{"Ling's Express 2": [["Jianlin C.", "I like ling's express 2 .the place is very good,the food is very good,less oil and MSG ,service attitude is good,"], ["Agent Luke T.", "The General Tsao's Chicken was nice and crispy and it tasted different than sesame chicken (that's a must!). I asked for extra broccoli, and they gave me plenty. It's an all new place in a very new strip mall. So, you know it's clean. However, the kitchen is bigger than the dining room. The dining seats only about 12 people or so total. If you're in from out of town there are other choices immediately nearby. The strip mall houses a coffee shop with hot food, a Mexican restaurant, and this Asian cuisine.  200 feet away is a full service bar and grill, too. I'm a fan for now. I'm looking forward to trying it again. Give it a shot!I stopped by on Sunday evening at 8:00.  They have a drive thru, but I'm not sure whether they deliver or not."], ["Dan L.", "Better stick to the script when ordering, anything off of the beaten Midwestern Chinese path is sure to lead to legit disappointment at best. Cheap, fast, greasy, another link in the continuation that this is the food we pay for. Not trying for a slam on a business that is pretty much par for the course here, but the space could be much better used by someone even the least bit passionate about their craft."]], "China Express": [], "Oriental Pearl Chinese": [], "China Pavilion": [], "Ling's Café": [], "Hunam Chinese Restaurant": [], "Thai Siam": [["Nitchada B.", "good PadThai :)"], ["William B.", "Just plain and simple,Ask them to make you a true Thai dish.My favorite shrimp fried rice with basil and jalapeños!!!!!!!!!!!!Price is always an issue, but for a good meal, I will pay the price!Love it!"], ["Clinton C.", "Called in an order at 1144 he told me to pick up in twenty five minutes. Showed up twenty five minutes later and they completely forgot to make it. He yelled at the lady to start making it. It was 1230 when they finished and he made me pay full price. Good food but the worst service."], ["Daniel H.", "All of the good reviews sure fooled me.  I met with a few of my friends and this place wasn't what I expected or even what other Yelpers' reviews had me believe based on their review.  First off, we waited close to 40 minutes for our food to come out to our table and we were the only ones in the restaurant at one point.  Apparently, they didn't know how to divide up the cooking, because they cooked everybody's orders who ordered to-go either by phone or in-person first.  This was fine except they could have divided up the cooking so one person would prepare all the to-go orders and the other for everybody in the restaurant.I ordered the Chicken Pad Thai ($7.95) and a soda for $10.49 total.  My friends ordered the Beef Pad Sea Ewe, Chicken Masaman Curry, and the Chicken Lo Mein.  The Chicken Pad Thai was nothing amazing and I've had way better.  I tried some Beef Pad Sea Ewe and the beef was tough to eat.  It might have been cooked a little bit too long.  The Chicken Masaman Curry was good but oily and probably the only thing worth ordering out of our table's food.  I didn't try the Chicken Lo Mein, but it didn't look like it tasted great.  Based on those four dishes, I would recommend the Chicken Masaman Curry.  I'm not coming back."], ["Beau S.", "The food is very expensive for the amount you get. It's like paying for front row seats when you're sitting in the nosebleeds. 2 entrees and an order of spring roles was almost $30. The owners seem like they hate you on the phone. \"Did you get the spring roles?\" \"YES I GOT THE SPRING ROLLS I SAID OK!\" Sorry to bother you on the phone sir. Once I got into the restaurant it was like there was anger about taking my money and giving me food. Is their heart still in this business? The good thing is if they aren't into it, they can still sell the space back to subway since they haven't changed anything after taking over in probably 1993. The food is good. But the price puts a bad taste in my mouth. The spring rolls are priced like they have shrimp, but they are all veggie! WHERE IS MY SHRIMP!!??"], ["Morgan S.", "Thai Siam is the best Thai food in town. I honestly eat there AT LEAST once per week, if not more. It takes a while because everything is made fresh, but its well worth the wait. I am always polite and the service is always exceptional. I think the people complaining of bad service are just impatient because they're used to fast food and quick take-out. The owners and workers recognize me because I eat there so much and are very polite and often ask me how my mother is doing. I HIGHLY recommend their food, particularly their tofu yellow curry, their egg rolls and their pad thai. The crab rangoons aren't bad either."], ["Kev L.", "The food here taste good. But none of it taste \"great\" or \"spectacular\". It's nice to see a Thai establishment this far from the center of the KC metro but after trying a few of the dishes with a crowd of friends, I really didn't have anything that left me impressed or really yearning to go back. For a college town though, I would have to say this is very subpar Thai food.The customer service here on the other hand was absolutely horrible. Messy tables everywhere. It seems like the son of the owner just sits behind the counter and yawns all night long. We actually had to ASK them to clean a table for us. This was a complete disregard for their eating area. I also did not  care for the lack of a friendly attitude from anyone. They seem to hate the fact they are running a restaurant. I will not waste my money here again."], ["James E.", "I'm really, *really*, confused by the people who ordered \"Chinese\" dishes here, and were disappointed in that they didn't enjoy them.  Why would you go to a Thai place and order lo mein? That being said; I really enjoy Thai Siam!  I typically order Panang Shrimp or Pineapple Curry, and am always happy.  Five years in a row, I have gone here for my birthday dinner.Yes, the yellow subway tables/benches are a bit off putting, and yes, the place does get crowded; but I don't care.What keeps me from giving this five stars is that it *does* take a while to get your food if you are ordering in.  I've started just calling in my order for carry-away."], ["P O.", "I've been to Thai Siam twice, and after the first time I would have given it 4 stars based solely on delicious food. On that day I ate tofu pad kee mao and tofu green curry and both were very good. I've eaten lots of thai food in Chicago, Portland and other cities that have lots of excellent thai food. Although neither if those dishes compared to the best thai food I've had, they exceeded my expectations. Yesterday I got tofu lard nar for carry out and it was awful :( The sauce tastes like the saltiest, worst American style chinese sauce you could imagine. I won't be back."], ["Cassandra A.", "I love the tofu pad thai.  It's ruined me because I cannot go anywhere else for thai food.This is definitely not a place you go if you want a great venue to hang out.  It is a exactly as others have mentioned - an old subway with hardly any remodeling.  This is great for takeout though.  Typically I call ahead and pick up my food.  The wait isn't too long though if you just order in the shop.  Not because of a line or anything, but because they make your food fresh.  The food is a large portion too.  Typically it will last me for two meals.  I do wish they did delivery.Update 5/24/12: I went in and had a horrible experience.  They burnt my food and when I tried to communicate that to the cook she got upset and started yelling at me.  Little weird, especially since I DO actually know what their food normally tastes like.  Kinda put a bad taste in my mouth (no pun intended) and I won't be going back for quite a while and thus changing my star distribution.  (Just a friendly request to management - it is a business no matter how good your food is.  If you want to keep your customers, don't be excessively rude to them.)"], ["Christina M.", "Wow. This place has gone downhill since I last had it in 2006. In college, my roommate and I essentially lived on Thai Siam, and we loved everything they cooked up. The place was always a little divey, but it's in a strip mall, so we weren't going to judge. After what I experienced last week, however, I'm more than ready to judge.I walked in to a moderate lunch crowd. Didn't have to wait very long in line before ordering, so I was pleased about that. After filling up my soda, I turned to find a table. In the booth directly in front of the ordering counter was... I'm trying to find a way to describe this, and the only word coming to mind is \"crap.\" Not, like, literal crap, but just a big pile of random stuff. A jacket, some grocery bags filled with who-knows-what, a handful of open vitamin bottles, a couple of bags of candy, some more grocery bags on the seat, some newspapers. It looked like someone had been living out of that booth.I get that it's hard to keep a place clean all the time, but seriously... you can't just shove all that shit in the back before you open? Come on.Then my food arrived... after about twenty minutes. Which seems ridiculous for a place as small and non-crowded as it is. I ordered the same thing I'd always gotten before: tofu pad thai. What arrived at my table looked nothing like what I'd enjoyed so many times a few years ago. It was a big, greasy pile of noodles and some big rectangular chunks of over-fried and oil-soaked tofu. The peanuts in the sauce weren't ground to a pleasing texture. It felt like chewing grit. The sauce itself was oily and bland. I felt like I was just eating noodles soaked in peanut oil with some chilis thrown in to give it a modicum of flavor. In short: it was disgusting.When I got home that night, I sat on the couch for awhile with the dogs, and then it hit me. I needed to get to a bathroom STAT. Everything I'd eaten came right back up. Now, ordinarily I might be willing to blame part of this on being pregnant, but I'm on Zofran. It's the stuff they give to chemo patients to combat their nausea. Since getting that magical, wonderful stuff prescribed, I have had zero problems with morning sickness, so I'm kind of not willing to give Thai Siam the benefit of the doubt on this one. I figure I must have gotten food poisoning, or else all that oil just didn't agree with me. Either way, it tasted just as bad on the way back up as it did on the way down.That'll be the last time I visit."], ["Amy H.", "Food = 5+* Service = 3*Decor/Ambience = 2*Seriously delicious Thai food!  We have about 5 Thai places in my town and Thai Siam is better than all of them.  Many folks were getting take out orders while we were there and that is definitely the way to go for this place.  Very bright, yellow decor."], ["Kerry P.", "I used to always come here while in college. Great hole-in-the-wall for some good Thai food. Get the curry, highly recommend. The service is meh, and the owners are kind of rude but their food makes up for it and that's all that matters."], ["Sarah M.", "Food= excellent! Pad Thai is deliciousService= good (guy that takes phone orders is really nice)Atmosphere= eh. We always get it to go. Thai Siam is in an old subway and it's pretty obvious, but you don't go for atmosphere. Bottom line: cheap and delicious Thai food"], ["Marina H.", "Excellent food! Call ahead for takeout because getting your food can take a while but it's definitely worth the wait. The green curry is a must."], ["Sunthud P.", "This is only one authentic Thai restaurant in Lawrence. I recommend fried tofu (in appetizer) and any kinds of curry here. The fried tofu is very crispy and delicious. I think their sauce is too sweet. They cook any kinds of curry very well. The hardest part of the Thai curry cooking is to cook until the coconut milk have an oily sheen--somebody may think it is unhealthy but the curry with or without the oily sheen have the same amount of fat and calories (just a different look). They cook the curry well and very authentic. If I pick one from the curry list, I would pick the Thai curry with grilled duck. You cannot find it easily in US (even in Thailand). Their pad Thai is as good as you can get in Lawrence. Sometimes, it is too oily and too sweet for me. The ingredient for their pad Thai is not complete compared to what I had in Thailand. I think the pad Thai from Bangkok Pavilion in Overland Park is closer to what I had in Thailand. Their pad kee mow is good but not one of the kind. Other dishes I have tried are okay. I would recommend the fried tofu and any curry dishes in this place. As a disclaimer, sometimes, the food can be super slow here."], ["Sean S.", "I'll start by saying that I have no idea if this Thai tastes authentic or not, but I've heard it's close for what you'll find in the states. That said, their Pad Thai is AMAZING! Don't recommend dining in here, it used to be a Subway and they didn't change a thing. Watch out for the lady owner, she constantly looks like she's about to rip someone's head off, but she's always good with customers. I have fun watching her when I'm waiting for my carry out, which usually takes 20-30 minutes by the way, so call ahead. Love this place!"], ["Teresa P.", "Ouch. Had high hopes for this hole in the wall, but sooo many things made me frown.35 or 40 min for our food? Hmm. Never had to wait this long for thai, especially on an unbusy weekday night. Then I finally got my beef pad see ew and was disappointed. Flavor was there, but the beef was toooooo chewy. My jaw hurts. Some noodles were a bit overcooked/dry, and most of the plate of noodles was in small chunks. Tried friend's pad thai and it was pretty meh too. Massaman curry was likely the best thing at our table. It was flavorful and portion size was hefty. Only thing is that they seem to dump in the coconut cream here... the curry was as oily as a teenager's face.I'd come back only for the curry, and only if others insisted on trying this place."], ["C V.", "The pad-thai is my favorite in town.  I always call ahead and take my food home because the dining area is a little skeezy.  Not really dirty, just like cluttered a \"hole-in-the-wall\"  feel.  Also, the family that runs the place seems to have permanently set up camp in the main booth near the cook line.  There's always tons of newspapers, jackets, personal belongings piled up and it's a little weird.If you can get past that, the food really is great."], ["Zach G.", "Thai Siam is pretty darn tasty...not only the best Thai in town, but some of the best Asian food in town, in my opinion. The staff are nice but not overly so. Prices are fair. Quality seems good. One thing though - the places throws off the vibe of being fast food (being in a former Subway and all), but ti isn't...it can take 15 minutes to get your food."], ["Ty O.", "Thai Siam is a little divey and all the better for it. Uncomfortable chairs, a generally worn interior, and friendly service are what await for you inside (and you probably will be doing a little waiting). But it's a place like this that reminds you that sometimes, it's just about the food.The food here is quite tasty and very reasonably priced considering the quality. They have a very wide selection of meals, covering the basics of Thai food and then some. The flavors are pretty vibrant, which is a nice contrast to some less skillful Thai restaurants who muddle things up a bit. You can get a nice tasting meal for a comparable price to any king-gantic sized meal from a fast food joint. The storefront is a little unassuming, as is everything else about the place, but don't be put off -- this is some excellent Thai food and definitely one of the better independent  places around Lawrence.Review: 3.5 stars."], ["Ed C.", "I had the chicken pad thai, and while it was not quite as good as Encore's, it was still rather nice. We split an order of crab rangoon that was very good. The wait wasn't too bad and I don't mind the lobby so much."], ["Joel S.", "I've been on a huge Thai kick lately, both in terms of eating out and my own cooking. I tend to judge Thai places on their panang curry - always the first dish I order at a new place, my \"control variable,\" if you will.I got the medium, which gave me the sniffles but wasn't unbearable - exactly the way I like it. You could taste everything - the peppers, coconut, fish sauce, peanut - every flavor popped through. I'm sure this was no canned paste mixed with coconut milk - which is fine for most occasions, but this was a whole new level. My girlfriend got the pad thai with chicken (her control dish), which I sampled and thought was pretty decent as well.The service is polite but very slow. They bring out the food as they make it, so your dining partner may have their food 15 minutes before you. But it's worth the wait. Judging by the food prep stations (up front) and the yellow hard booths, I'm pretty sure the place used to be a Subway, so it's not exactly a luxurious or romantic atmosphere. And that's OK, because this place is about the food, and they clearly do it very, very well."], ["Hannah A.", "It's a mom & pop shop in a strip mall. It's actually Chinese and Thai.  I can't take too much spiciness, but I found the pad Thai to be too sweet. My friend's Pa-nag curry did look good, but w a kick.  It's missing the two stars because of one of the tables were cluttered with office type stuff just piled on.   Also, not the most friendliest people around......customer service?"], ["Erika Y.", "good food, bad service, nonetheless best Thai food in Lawrence"], ["Jennifer H.", "Food was decent, though not presented well.  Plates were too large for the portions served and my tofu cubes apparently broke apart during cooking.The location is obviously a former Subway, and the food is prepared behind the counter.  Ingredients are a bit haphazardly kept in bins visible throughout the restaurant, and inventories of restaurant supplies are out in the open.  One of the booths was taken over by personal effects that implied an employee was practically living there.  I guess I just expect a better facade from an eating establishment.  Definitely less expensive than most Thai restaurants with the loss coming in quality and atmosphere.  I recommend getting your order to go if you're looking for some less expensive but decent Thai food."], ["Patrick S.", "I couldn't eat the food, I had to throw it away. I got a to-go order because a friend had suggested this place. The vegetables were cooked to mush and the shrimp tasted old and rubbery. It was so expensive for the poor quality! I am usually a BIG fan of thai food; its my favorite! This place is so bad though, we tried giving it a chance."], ["Casey M.", "Wow!  Thai Siam, what can I say...I think I'm in love!  I absolutely adore Thai Siam.  I lived in Lawrence for 4 years and ate there at least once a week.  Now I live in Austin, TX and I just can't seem to find any Thai food that is even half as good as Thai Siam.  The food is wonderfully flavored with fresh ingredients and is cooked fresh to order...so no food poisoning due to 8 hour old chicken or something...  I'm telling you, if you want good Thai food, or Chinese for that matter, Thai Siam is the place. My favorites: Fried Rice (any meat is good), Pad Thai, Lard Nar, Pad See Ewe, Green curry, Pad Kee Mao, Hot and Sour soup, Crab Rangoon, and the egg roll If you want Chinese, I agree with Carol R., don't get the lo mein, but the orange chicken and the other \"fried then put in sauce\" stuff is also to die for, as the breading underneath the sauce is still really crispy and not soggy like every single other Asian restaurant I've been too.Anyway, as a former Lawrencian, who now lives in a big city that should have good Thai, but doesn't -- treasure every single moment that you have with Thai Siam, because you'll miss it when you have to leave it... : ("], ["Just A S.", "Fresh food prepared by great cooks that make you feel like family.  You don't get much better than Thai Siam.  I promise you---ANYTHING you order on the menu is excellent and by far, the BEST thai food i've had...I think ever.  This restaurant is a converted Subway, which only adds to the kitch and charm.  You can see them preparing your food, so it's kitchen theatre, too...which I love.  The only thing that could improve about the atmosphere---the lighting.  and even that isn't distracting...it kind of feels like you're in some hole in the wall in Greenwich Village.  The people that run it make me feel the most welcome and taken care of in all of Lawrence's restaurants.  Maybe it's because they are family and it feels like they've invited you into their own kitchen for some classic Thai food.  Keep it up, Siam.  I don't know what I'd do without you.  :-)"], ["Brenda H.", "People are always raving about pad thai and at most Thai restaurants I'm just not that impressed. Here, however, it's GREAT! I miss their sweet and sour soup."], ["Abby A.", "Mmmm...love me some Thai Siam. Hole in the wall sorta place with amazing Thai food.I love the chicken wings as an app and Beef with Basil for my meal. Nothing short of heavenly!My hubby always gets the Pad Thai with tofu or Panang Curry with the same. Great portions, good value. Getting hungry just thinking about it..."], ["Ryan B.", "I've eaten at TS about maybe five times.  they serve chinese and Tahi food.  Chinese is pretty typical.  Thai is outstanding. I've had several of the curry dishes, and they're amazing.  The pad Thai is good.  The spring rolls are great.  The other posters are right about the service.  its not too good.  However, I love their open kitchen with the old Thai guy making all the food before your eyes.  Its a treat to watch them cook.  Bottom line, if you want really good Thai food, go to Thai Siam.  If you want to be treated really nice and sucked up to, go somewhere else."], ["Natalie S.", "Best Thai food in Lawrence, hands down.  I won't order Phad Thai anywhere else."], ["Helen M.", "We just moved back here from DC, where they have some excellent Thai restaurants and I've been jonesing for a fix. So I turned to Yelp for some reviews of Lawrence's Thai restaurants.  The reviews are spot on.  The grumpy owner was there scolding the new, college student, part-timer for repeating a customers order for mild food --\"Makes no sense! Medium, extra spicy, or Thai hot!\" I was just glad to hear \"Thai hot.\" The food was excellent and the Crab Rangoon really is off the hook. I had the Basil Chicken, Thai hot, and was thrilled. If I don't sweat over my Thai, I'm not happy. My S.O., who can't do hot, was happy with his Mongolian Beef, but really liked the Crab Rangoon. Like I said, I just got back to the Midwest from DC, so I've become accustomed to less than hospitable service. Just go to the bar ~two doors over, get a couple of cheap beers and come back in 15-20 minutes - it worked out for me. Can't wait to try more of the menu and see if the part-timer is able to stick it out."], ["SE T.", "Great food, great price.  We frequent this restaurant often, and it feels like family when we drop in.  The owners are from Thailand and create the most authentic Thai cuisine in the Land of Oz.  So, it might be necessary to leave your notions of fast food instant gratification at home, and relish the pleasure of fresh, spot on cooking in a unique atmosphere.  It usually is a wait, but you can chat with the cook and gain some insight into his gastronomical magic."], ["Josh P.", "Service is wretched.  The man behind the register, I believe he is the owner, was so rude that I don't plan on ever dining there again.  I asked a question about a dish, and he was obviously annoyed for whatever neurotic reason exists in his brain.  He kept asking why I was asking and acting like I should know the answer to my question, while pretending not to understand what I was asking.  I made a comment about leaving to eat somewhere else and he toned it down and finally answered my question.  This is the second time he was flat out rude over some simple non-issue.  I will not be returning."], ["Alison M.", "The food at Thai Siam is good, but the service is beyond awful. We once went in for carry out and were told it would take 20 minutes. TWO HOURS later we got our food. Sure, it was Valentines Day (I think 2006), and sure they were busy. But it was ridiculous. After an hour we asked for a refund, as we wanted to leave, but they would not give us one. We ended up getting beer from the liqour store next door and hanging out in the parking lot while we waited. Other times I've been to Thai Siam and my food has tasted like soap. Also, the Pad Kee Mao is heavy on sprouts, so if you ask for no sprouts, you get a very small portion of food. I used to go to Thai Siam because I liked their food, but I have had so many negative experiences that I will no longer eat there."]], "Oriental Express Restaurant": [], "Cryster Asian Diner": [["megan c.", "Went there for the first time tonight and was pleasantly surprised! The staff was so friendly and accommodating while we waited for our take-out order. Our food was ready promptly and was delicious! Can't wait to explore the rest of their menu!"], ["Bryan B.", "Crysters is my favorite restaurant in North Topeka.  The menu has a nice variety including sushi, korean, curries, pad thai...., The dishes you expect at this sort of place such as fried rice, orange chicken, and hot and sour soup are better than any buffet place.  The service varies depending on who is working, but  usually it is friendly and helpful without being annoying.  The manager frequently visits with the patrons and has been known to make something special or change some dish on the menu, which is a real treat.My personal favorite is the bibimbap, though I think they spell it differently on their menu.  It's always good though the last time I ordered it they didn't pre-heat the bowl which really adds to the flavors and the experience.I'm not a sushi expert, but it is as good as any I've had in the area, though it isn't served all the time. My family enjoys ordering the Topeka roll."], ["Justin G.", "We have eaten here twice since Christmas. Both times have awesome. Fresh and creative sushi. Plus awesome Pad Thai. It's a must eat for Topeka."], ["Jerry L.", "We went in about 6 pm and there were only 3 or 4 tables full.  A person walking by said \"sit wherever you want to.\"  Some of the tables were dirty and we chose a clean booth.  The waiter asked if we'd like something to drink, and when I asked about the bar, he said \"there is no alcohol,\" so my companion and I ordered water.  We placed an order for wontons, the red curry thai dish, and the four treasures (pork, beef, chicken, garlic) with vegetables in a szechuan garlic sauce.  All the food was large portions, attractive looking and delicious.  My companion had the steamed rice (comes with) and I chose the fried rice ($1 extra).  The things that bothered me 1) waiter who was always in a hurry and didn't smile, laugh or seem the slightest bit friendly; 2) one thin napkin each...had to leave those pesky drips from the wonton sauce on the table.  3) no spoons - had to  double dip those wontons, nothing to spoon the sauce over the food 4) no knives - there were some pretty large pieces of meat and vegetable there that I had to eat whole.  5) no real serving plate......the entree comes in a large bowl thing, and the rice comes in another bowl thing.....I am used to having a plate where I can combine some of the rice and some of the entree....and perhaps sample my companions meal as well.  I really thought this arrangement was odd.  By the time we left, maybe 6:30-ish, the place was fairly full, and I think there were only 3 people working - 1 in the kitchen and 2 on the floor.  I think they may have a decent take out business and delivery as well.   We'll likely try it again, but we'll definitely try delivery.  For an average Chinese restaurant, I thought it was a bit pricey - $30.55 for our two meals, an order of wontons, and water."], ["Lesia M.", "My family was very excited when an Asian restaurant was opened out in north Topeka area. I absolutely hate this place if I could give it negative stars I would, all of their good if overcooked and their sushi is a poor attempt at a popular item very sloppy and ingredients are low quality. Rude staff terrible food."]], "New China Restaurant": [], "Saigon Restaurant": [], "Silver Lake Restaurant": [], "Great Wall Chinese Restaurant": [], "Golden Dragon": [], "University Chinese Buffet": [], "Panda Express Gourmet Chinese": [], "Hong Kong": [], "China House": [], "CoCo Asian & Chinese Cuisine": []}