{"Blind Tiger Brewery & Restaurant": [["Emily R.", "Me and my husband went here for my birthday expecting delicious steaks and a special night. Both of our steaks were over cooked. They were so dry I couldn't chew the meat. The server was nice but never asked about the whole, Uneaten steak on our plates. She seamed hurried to get us out. It was my first time to blind tiger and had heard great things. I was very disappointed that after waiting an hour for our table, my birthday dinner consisted of sweet potato fries. (Which were delicious but not worth the $18 I paid for my steak meal.) Usually I say something if it's that bad but I didn't want to ruin the night for me and my husband."], ["Rachel B.", "I hate that this place gets poor reviews so often, because it is really amazing, especially for Topeka. While I will admit that I don't like everything on the menu, what I do like is so awesome that I understand I just need to figure out what is excellent and run with it.THE BEER. The best. Really, really good and crafted there. Just amazing, and it will mess you up, so watch out!I truly think their appetizers are the best things they offer, not to diss their entrees. The Texas Nachos are SOOOOOO GOOD!!!! Huge plate of chips smothered in their slow cooked black beans that have so much rich, deep flavor, and then melted cheddar cheese (no processed cheese food here, sorry queso lovers!) and green onions, tomatoes, who really knows? All I know is that it is awesome and enough to feed an army. Their fried pickles are also the best I've ever had, and I saw they took them off the appetizer menu but next time I will ask because they still make them to put on sandwiches. The stuffed mushrooms, tiger tips, and cheese fries also super good!It is trial-and-error with entrees. My boyfriend loves their BBQ but does not like their sauce, so he has learned to order sauce on the side and go with ketchup or whatever instead. I have learned that some things I love at other restaurants I don't like so much here, like the fish and chips or the fish tacos, but that just means I don't order them.My kids love the hot dogs and corn dogs (which are enormous and made in-house- who does that?) and the chicken fingers and the burgers, the list goes on. It's just good. So just eat there.  Yes, the decor is very 1970, but whatever. I'm not there for the scenery."], ["D. O.", "Ate here last night. First time in Topeka and took advice from Yelp - glad we did!  Some of the best Chicken and bbq we've had. Ask for Allison - she was super friendly and took great care of us."], ["Corey R.", "The burnt ends are to die for. Don't forget to take home a growler. The home made root beer is top notch."], ["Daniel L.", "Plenty of great choices for beer, you can also get your growler to go.  Wide variety of good food on the menu also.  Almost always get great service, occasional new waitress that hasn't had enough training but not often."], ["Stephen M.", "Great place to stop for a meal.  we are traveling through so our drink selections were limited, but the pulled pork sandwich with baked beans was quite good.  the service was excellent with several staff people and management stopping by to make sure that all was well. We received more than adequate amounts of food and refills on their excellent root beer without even asking, and the pricing gave us excellent value.  I would stop back, and I can recommend it to you, also."], ["Shannon S.", "Great place! The prime rib was incredible smoky flavor was awesome! Smoked chicken coupled with their homemade mac and cheese....the bomb! Well worth the trip!"], ["Sandy R.", "My husband and I are from out of town so had never heard of the Blind Tiger. We like Brew Pubs so decided to give it a try and were not disappointed. Our server was great- very helpful with recommendations and very attentive. Both beers we ordered were good- the Stout and the Smoky Beer. My husband had a chicken quesadilla which was excellent and I had brisket with baked beans and vegetables. The brisket with BBQ sauce was tender and tasty. The baked beans were fabulous! I like them a little on the sweet side but still smoky- they were so good! The vegetables were crisp and not seasoned at all- fine with me. If we lived around here we would be back!"], ["Jamie D.", "This meal was amazing!!! We had a bison burger and fries, the steak and rib special, and the 6oz sirloin with homemade Mac and cheese. We ended our meal with their homemade brownie delight and a couple of beers to accompany the meal. There was an empty plate from everyone at the table!"], ["Dezeree H.", "This is a great place to eat.  There is something on the menu for everyone and it is reasonably priced. The pulled pork and barbecue chicken are very good.  I am not a beer drinker, but my boyfriend really enjoyed the Munich Dunkles in the growlers which are priced well. The Say Cheese Fries appetizer is tasty."], ["Emily E.", "Apparently the Blind Tiger is \"the place to go\" in Topeka, however my experience did not meet that standard. I waited an hour for my food and when I received my cheese quesadilla, it was mediocre at best. When handing me the plate, my waiter told me it was a chicken quesadilla. As a vegetarian, I was alarmed. However, I cut into the tortilla and there was no chicken in sight. False alarm! The guacamole looked like it had been sitting out for too long-and it probably had considering that we sat around for so long! I'm giving this place 2 stars because I had their brewed root beer and that was excellent! However, I probably would not recommend the Blind Tiger unless you like slow service and mediocre food."], ["La Juania M.", "First time here and I enjoyed the food. Not a beer drinker so I didn't partake in those but for whoever is this place has a lot of their own beer. Chicken fried chicken was soo tender. I recommend it. Apparently it's a favorite around here."], ["Jeff W.", "Stopped here as we were passing through town and found that our experience did not live up to the hype of the other reviews in yelp.com. We were greeted with a 15-20 minute wait time when there were open tables and booths in sight. My fiancé was excited about the prospects of their various BBQ options, to which our waiter had to return to our table to tell us they were out of his first and second choices, and the dinner specials for the evening. Though our plates were steamin' hot, and my serving of New Orleans pasta was tasty, our food (including my fiancé's nachos) were incredibly greasy.Our server, Sean, was pleasant and attentive, even though we spent more time waiting to be seated and for our food rather than eating. We believe our experience would have been totally different had they had their menu items actually in stock, especially with their assortment of on-site crafted beers and unique brewery atmosphere."], ["Micah A.", "As a West Coaster your food blew my mind. Essential mid west food with out being cliche. Great job. Decent beer. Would go back for sure. Would love to see a higher IBU IPA."], ["C M.", "Go for the beer. The IPAnemia was excellent and the Octoberfest was great. Better have a designated driver is you date go beyond this two. Watching my waist band expand so I had the Tilapia. It was OK. The loads mashed potatoes were served COLD. They were replace and were good. The green beans we a little over cooked. The Tilapia was very well grilled. The server was attentive but not invasive. I was concerned as I entered because it was seat yourself. I did not wait long before I was greeted. All on all a pleasant experience. What I really wanted was a plate full of burnt ends."], ["George P.", "Let me start by saying that the beer is fantastic, however they have lost me forever because of the terrible service and average food. My wife and I  have only lived here in Topeka for a little over a year and have been to the blind tiger 5 times and only once have been even mildly impressed with the level of service and have always left mildly dissatisfied  with our meal. I do not recommend this establishment if you want something to eat. However,  If you do want to stop by and have a very tasty beer its worth a try. happy yelping"], ["Long B.", "Their TV advertisements always turned me off. So I never thought I would ever come here to have a drink and a meal. Well that changed when it was suggested by the gf to dine here.From the outside, it's not much. In fact it looks a bit smaller from the outside. Once you do walk in, this place is massive. It has a lower and upper level seating and it feels like it keeps going on. The lighting is a amber glow, which gives it a darker atmosphere. With the amount of people it seats, it'll be above average for noise level.I ordered the Honey Wheat beer, which honestly was not impressive at all. Light beers are generally easy to drink, but this ranked close to a Coors Light. It had barely any flavor and no resemblance to any Honey flavoring. It was good, but I think next time I'll try a few different beers. From what I saw on some waitresses trays, they had small cups which looked like samples.For my meal, I ordered a 10 oz corner steak - medium rare. I generally do medium rare because most places tend to slightly over cook what you requested. What I got was impeccable. It was perfectly cooked and seasoned perfectly. Out of all the steaks I have ate, this was by far the best one I have eaten. The waitress gave me the option of replacing the salad with another side. I did that and had the vegetable medley and garlic mashed potatoes. Both came out scorching hot. Give it time to cool off before you get a mouthful.Our waitress checked on us every 10-15 minutes, which I think was fair and not too obtrusive. So service was great.I tried out my gf's chicken, which was moist and good. Chicken is fairly difficult to cook, because it can often come out dry and tasteless.Blind Tiger's strength is in their food. It was spectacular. I don't think we waited too long either for our food. After it was ordered, about 10-14 minutes it arrived. Usually this is a red flag for \"pre-prepping\" food that is usually bad. Not the case here.I recommend them highly if you're visiting Topeka and want a great meal at a great restaurant."], ["Joseph L.", "I haven't been to this place in years. Nothing has changed. Doesn't look like the place has been cleaned either in the past 20 years. Very filthy.  Can't imagine what the kitchen looks like if management allows the front of the house to be so dirty. May a mistake a took my 8 year old and looked down in to the area in the bottom floor where some of the beer vats are. Near the restroom. He pointed out the dust and dirt collecting on everything and said \"the cleaners must not get paid to clean down there.\" Would love to see management or ownership show some passion and clean the place and update it. At least but a little money into the bathrooms and clean them up."], ["Amy S.", "A good selection of beer, a good buffalo burger, and Gilligan's Island on the TVs. It was crazy, crazy busy in here for a middle of a Saturday afternoon - glad to see the people of Topeka need their beer."], ["Karen I.", "I used to not like this place so much, but they have definitely improved both the food and the service. Well done, guys."]], "Quinton's Bar & Deli": [["Karen P.", "Quinton's says they are a 'bar and deli,' and it's exactly that. Don't go here expecting anything fancy, but they do have a good solid menu of sandwiches, soups, and baked potatoes (not as big a menu as it used to be, however- they've pared it down significantly,) and a massive beer and shots selections- although they no longer have Stella Artois on tap, which makes me sad. They're also transitioning into their Fall/Autumn beers, so some of their advertised Summer beers are gone- but they still had Boulevard Radler, which is lemon-ginger and sooooo yummy. I ordered the half French Dip with a bread bowl of broccoli cheddar soup. They have potato bacon soup and chili every day, plus one extra selection. The French Dip was one of the best I've ever had, and the soup was delicious too, but the bread bowl was white, bland, and dry- I wish I'd saved those calories and just ordered it in a regular bowl. The staff is friendly enough, and there's tons of TV's on but it's not crazy loud."], ["Jenn S.", "Use to be my favorite place in Topeka.  Took the Veggie sandwich off the menu and would not make me one.  Such a shame because you know they could have slapped some lettuce and tomato on some bread for me.  Please try to accommodate your non meat eaters."], ["David B.", "God, what a dump. Came in for drinks and could not have been more disappointed by the dive bar atmosphere and the loud obnoxious patrons. We won't be back."], ["Chris C.", "Quinton's new location in Topeka is my new favorite place to go out to grab a quick drink with friends any night of the week.  The staff is super friendly, the drinks - especially the specials - are very reasonable, and they make Long Island Iced Tea without the mix. Plus they have Guinness on tap and Jamison on the shelf which meets my requirement for a five star rating -- ability to make Irish Car Bombs.  With a mix of tables, booths, and bar seats, its a comfortable place to meet up with a date or a large group of friends.  The back half of the bar has darts set up and there are a number of televisions. The jukebox is one of those video ones that can play pretty much anything and the crowd is pretty mixed all round from age to ethnicity  (this bar is in the same strip as Bullfrogs Live and The Jet but doesn't seem to pull much of their clientele from either. Its friendlier and has a more mellow vibe.) I was totally comfortable sitting at this bar alone waiting on friends for over an hour on a Wednesday night. I would definitely recommend this bar to people visiting from out of town.Quinton's also serves food but I've never tried it (kitchen closes at 10p). They have a small fenced off smoking patio from which there is a scenic view of Gage Bowl and later at night, an impromptu floor show as people run out in traffic on Huntoon while crossing between Bullfrogs Live and Skinnys in the strip mall across the street."], ["Barbara T.", "Bread bowl soups and burgers are great!  Love the loaded baked potato soup especially (not sure if that's what it's called, but that's what it tastes like)!"], ["T B.", "Love this place!  Went for lunch and had a great time. It was busy but the service was fast and friendly.  Even the bar tender helped with table service when things got busy, nice to see. Love the truffle fries, really interesting. Everything was fresh and tasty. Will be back next time I am in town."], ["Cory T.", "Probably the worst service I have ever had.  Waitress was absolutely rude."], ["Suzy W.", "Quinton's is a great place to go for a casual lunch or dinner. I've only tried their beef & brie, which was delicious, and friends have told me that the other sandwiches & burgers are great. I really didn't care for the atmosphere, but other than that, I enjoyed it."], ["Allen L.", "A friend and I ate at this place as a last resort because we couldn't decide where else to eat...and we were glad we did. The staff is very nice and our orders came out quickly. The deli sandwiches are yummy. Will go back to this place in the future."]], "Chez Yasu": [["V S.", "The food was delicious and far exceeded our expectations - don't let the exterior fool you. Beef filet was tender and perfectly cooked, veggies were fresh and not overcooked. The interior was nice; tables were set with linens, real china, silver flatware and ambiance was complimented with soft, soothing lighting. No TVs in view which was really nice for a change. We will be back the next time we drive through Topeka. Yum!"], ["Lab L.", "Our first visit for a special family event. Would recommend a reservation even on a week night. The small room filled up quickly and most tables were reserved, with a nice sign with your name on the table.Highly recommend all of our dishes: escargot, calamari, goat cheese salad, and the soups. Bread was warm, yummy, and frequently refilled. Also appreciated the frequent refills on our water glasses.Negatives would be the attire of the staff. Very casual for the menu prices. As mentioned in other reviews, the lump of plain mashed potatoes and string beans were less than flavorful or appealing on every.single.plate on the table. Beans were included in the salad and I didn't need a repeat. I think other potato and green vegetable options could easily to offered, too.We'll keep Chez Yasu in mind for another special occasion celebration."], ["Lori P.", "The service here was stellar and the food pretty authentic. The only negative was when we got the check and realized that the goat cheese salad upgrade was not a small additional fee but full price at &5 each. Overall a great fine dining option for Topeka. It's small so best to make a reservation."], ["Chris S.", "Chez Yasu (Topeka, Kansas): Good, Overpriced French Cuisine With A Japanese FlarePrices: $$$A French restaurant in Topeka, Kansas with a Japanese chef? Seems a bit odd, but hey, it works!We arrived exactly on time for our 7:30pm reservation, but had to wait 15 minutes for our table ... STRIKE 1! While we waited, we had a view of the prep area where a server was taking cherry tarts out of a box that looked like something from Sam's Club ... STRIKE 2! The prices on the menu were significantly higher than the menu on their website ... STRIKE 3! Normally an \"out\", I have to admit that we enjoyed our dinner and may very well return to try Chez Yasu again ... MAYBE.I love escargots (snails - $7.95 online, $8.95 in reality) and their buttery, garlicly goodness, rarely having the opportunity to order them in culturally challenged eastern Kansas, so I did (as an antipasto). Sans shells, they came six on a plate accompanied by a couple sliced mushrooms and doused with a savory garlic, parsley, and butter sauce. They were good, but nowhere near the best I have had and definitely some of the priciest at $1.50 a pop.My wife had the potato and leek soup (potage - $3.95/$4.95) which apparently comes either hot or cold because when it arrived, it was ice-cold! We asked the server to please bring her the warm version. The soup was decent, moderately flavorful, but a little too watery for my taste. It could have been thicker with a bit more seasoning, but the bread made up for it. The server brought more freshly baked bread as needed and was actually one of the highlights of the night The Poulet Sauté, thinly sliced chicken breast served with a light teriyaki sauce ($16.95/$19.95 - also available with an herb or peppercorn sauce), was moist, light, and succulent with just enough teriyaki to flavor the dish without overpowering the poultry. I would have preferred the herb or peppercorn sauce in a French restaurant, but my wife does not appreciate pepper as much as I do and because she was eating it, I happily succumbed to her decision. The potatoes, not plentiful enough to last as long as the chicken, were light, good, and creamy and the green beans crisp with just enough butter and seasoning. In my opinion, $16.95 for a basic chicken dish is probably at the top of the scale, but $20 is excessive. Not a great value.Boeuf Borguignon ($21.95/$24.95), braised boneless beef short ribs, onions, and mushrooms in a red (burgundy, hence the name) wine reduction. Accompanied by the same mashed potatoes and fresh green beans, the plate was pleasing to the eye and very good. The burgundy sauce was perfect, but for such a small and inexpensive cut of meat, a couple mushrooms, potatoes, and beans, the price we paid was easily six times the food cost and again not a great value in my eyes. I believe the advertised $21.95 would be more appropriate and $19.95 would be a much better value, earning an extra bomb, maybe two in my book (or blog in this case).The house wine (Root: 1), a deep red, full bodies Chilean cabernet with intense fruity tones was the perfect accompaniment to the boeuf borguignon, but at $28 it was the least expensive option on a small wine menu with most bottles coming in at $40 or more.Now do not get me wrong, I have no trouble paying top dollar (or Euro) for a top-shelf meal worthy of a Michelin Star or two, but Chez Yasu will not be getting that star any time soon. I have eaten at some of the best restaurants in the world ... Brussels, Paris, Rome, Madrid, Tokyo, Seoul, Budapest, you name it ... and although decent, this small French restaurant in Topeka, Kansas is overpriced in my opinion. By comparison, one of my favorite French restaurants, Le Central in Denver (Colorado) has a much more extensive and affordable wine list, a menu offering a comparable number of options (plus an elaborate offering of mussel dishes, with unlimited French fries by the way, for under $10) all under or close to $20, and superb cuisine prepared by real French chefs. In that comparison, Chez Yasu does not even come close, hence my rating of \"value\" ....CombatCritic Gives Chez Yasu 6 Bombs Out of 10 ... Les Bombes Sont Bon!"], ["Deana A.", "We have visited several times. Every visit was great. Cute and quaint, has a romantic setting or you can chose a more relaxed space. Food was amazing, service was above and beyond. We have recommended to several friends who all agree one of the best places to eat in Topeka."], ["Dezeree H.", "The peppercorn chicken was very good. The prices were a bit higher than I would like to pay for lunch, but the food is very good. It's definitely a place I'd like to try again."], ["Gidget K.", "One of our favorites!  Definite choice for romantic dinner!"], ["Grant E.", "Did Valentine's Day lunch here. Wife had the quiche and it was too shelf. The crust was like eating a croissant - to mix French food metaphors. I had the beef medallions which were very tender and marinated to perfection. The salads and vegetables were perfect with a hint of cinnamon. Fresh bread was great as well.  Prices were a bit high but service and ambience get high marks. If you go for lunch - not a huge need for reservations. Dinner - best to call and get reservations."], ["Diane L.", "Our Topeka friends told us to stop here on our cross country drive, that it was a gem treasured by locales. We were not disappointed!  The dining room was simple and nothing special but the food and service were exquisite, just what weary travelers needed. The restaurant is hidden in an out of the way neighborhood but worth the effort to track it down."], ["Gaz H.", "Perfectly okay, but I'm not overly impressed with any aspect of the operation. Basically, this place has no Moxie.  From the dining room (plastic table coverings) to the presentation (my veal liver was buried under a pile of supermarket bacon and onions), to the overly bitter espresso coffee its all fine without being at all wonderful. The meat of my entree was properly cooked as were the veggies but nothing exciting about the flavor profile. Moxie-less. The starter salad had an interesting dressing but ultimately was a pile of knife-chopped lettuce. Creme brûlée was the same goodness without greatness - no chance of the dessert redeeming the entire affair. The largely Japanese wait staff is just a weird touch (presumably family - the chef is apparently of Japanese extraction).  Everyone is nice enough."], ["Lizzy L.", "Such an elegant and scrumptious little restaurant! My time in Topeka was ending and we went out to dinner here this week. My friends who frequently come here said that there's not been once that they've ordered something that wasn't absolutely delicious.We started out with the scallops appetizers and of course, some fresh-out-of-the-oven sliced baguette. The scallops were so tender and yummy and I had no shame in dipping the baguette into the sauce leftover. I restrained myself from licking the plate.Next we had soup --my friend ordered what she always orders: the cold potato and leek soup, and I tried the squash soup. And boy am I glad I did. It was so, so good. It tasted like fall season in the summer. So creamy and buttery and yummy! More bread-dipping ensued to get every last drop of that soup off the bowl.And finally, I ordered the teriyaki chicken. The chicken was cooked just right and came with a sweet teriyaki sauce, mashed potatoes, and green beans, all on a bed of rice. It was good but I think next time I'd try some of the seafood that my friend ordered! My chicken was good but slightly chewy in some areas. We had attentive service and it was so lovely to find a good French restaurant in the middle of Topeka!"], ["Thomas M.", "I really liked this place. I had the veal piccata and the veal was very tender....the hint of lemon and capers was outstanding. Nothing was overpowered. I also had the french onion soup for starters...this was my only complaint, the soup had flavor, but was missing the best part..the cheese! The soup had very little onion in it as well. Probably should have gotten the squash soup instead.The atmosphere was good, the waitress was outstanding, great service. Go and try it,"], ["Katie L.", "Really - I've experienced so much better in a restaurant that is trying to portray themselves as classy. Don't get me wrong - the beef medallions were very tasty! However, the menu said they were made with a red wine sauce but really it tasted like a good old fashioned brown gravy.My cappuccino tasted like burnt coffee (but after four packets of sugar it was alright). I was really disturbed when I looked at the ceiling fan and saw that it literally had clumps of dust hanging from each wing. My mother would have had a stroke if she saw that mess. The menu had very little selection. I think there were about four or five entrees to choose from. Maybe I'm not up to par with the french restaurant norm, but I didn't think it was very classy to have my side items as a pile of cooked baby carrots and thin pea pods either."], ["Sonia M.", "Cozy, great food, the bread and butter is amazing, great service!! I love this place but it's a little pricey for the plates on the dinner menu. I've had similar priced dinner menus at much much nicer places. For example, we dined here with friends, all of us ordered a different dish but we all were served mashed potatoes and green beans as our side. Not usually the standard at a \"nice\" restaurant with high prices but still, love it love it love it!! Romantic, delicious, quaint, perfect date night in Topeka!"], ["Dallas B.", "I have been to Chez Yasu approximately eight times in the past three years.  Tonight dinner was as exceptional as it always has been in the past.  There were five of us dining.  We shared two soups, three appetizers, main courses, and three desserts.  Everything was perfect.  The favorite of the night for me was the carrot soup (but also loved the squash soup), sea bass, and the goat cheese salad.  Everything is always fresh.  The service is exceptional and each course is sent out in perfect timing.  The portions are just right.  So many of the sauces are so good you think about how great it would be for them to be served as a soup.  And...the bread is always fresh and served warm."], ["Dan R.", "Only being visitors to Topeka (chain city) once a month or so, my wife and I are always looking for great local places.  You won't find us at Olive Garden or Carlos O'Kelly's.  A friend recommended Chez Yasu to us when he heard us complaining about all the chain restaurants in Topeka.This was a great little place in an old gas station near the university.  Reservations were a snap and we had a great table in a private side room.  The outside of the property looks a little dingey, but the atmosphere inside is perfect.We had a career-server who knew her trade; that makes a big difference when compared to uninterested college kids.  Wine, salad and soup were delicious, and the main course of salmon for my wife and scallops for me were unforgettable.Chez Yasu is now on our Topeka shortlist."], ["Steve M.", "I am not a French Restaurant connesieur, but I would say this place ranks up at the top of lot of the fancy restaurants that I have eaten at in the Topeka area.  The restaurant is a little small and has that intimate feel to it.  The lightling is a little on the dim side which adds to the ambience.     The quality of the food was excellent !!  Their menu selection is a little limited and consisted of about 2-3 salmon dishes, seafood crepe, a sole dish that I can't pronounce but was a piece of fish that was wrapped in a pastry and served with a cream sauce.  There was also a chicken dish, beef dish, rack of lamb dish, and the chicken Picatta.I went with the Veal Picatta which came with a mashed potatos, green beans, and a small house salad.  I also had the Gateau Formage for dessert and to wash everything down, I went with the house Pinot Noire wine.  The veal was very tender, and coated with a glaze/sauce that really brought out the flavor of the dish.  I highly recommend this place if you are looking for a fancy dinner.  Your total dinner bill will be expensive compared to the other restaurants in the area,  but the quality of the food will more than make up for it.   If you are looking to impress your date or want to celebrate a special occasion, then this place is worth checking out."], ["Bud T.", "Best restaurant in town."], ["Anje M.", "Overall the experience was fantastic although I have to admit the dirty fans and dirty vents was somewhat of a turn off... I ordered the salmon in white wine sauce and it was great.  The salmon was melt in your mouth mmmmm.  The bread and salad before my meal came out was both delicious.  Even though there was a full house with customers we didn't have to wait on drinks to be filled or plates to be picked up.  Service is wonderful and the wait staff was very knowledgeable about the food.  For the price of the food though I would of thought they would of cleaned a little better.  Overall I will give it 3 stars and would go there again as long as the fans are not on..."], ["Jon H.", "This restaurant is waaaay over rated! I was in Topeka for meetings and decided to check them out for something different; the service was ok but my god ninety dollars for two people and it tasted like that? Grocery rolls, rubbery duck, bland potatoes, two annoying flies, and way out dated decor? NO THANK YOU!"], ["Brian E.", "A diamond in the rough.  Best restaurant in Topeka.If you like wide variety: go to Chili's, you rube.If you like fantastic food: come here."], ["Jon S.", "By Topeka standards, this is a decent restaurant.  However, there really isn't anything special or memorable about this restaurant.  Food quality is good, but lacks imagination - which one would expect from a French restaurant.  However, I would definitely eat there again."], ["Jennifer D.", "My mom and I were visiting Topeka from Miami and Southern California respectively and read the reviews for this place. My husband is from France and my mom and I are both French food connoisseurs. This restaurant might get 4 stars in a major metropolitan area, but for Topeka, Chez Yasu merits 5 stars.The squash potage and the crab potage were delicately seasoned and flavorful. The green salad was fresh with a creamy house vinaigrette similar to Caesar dressing . We were really impressed with the duck breast au poivre accompanied by freshly made mashed potatoes and green beans. The duck breast was tender and cooked just right with a crispy layer of skin that was delicious. The sauce was sublime.We had a glass of pinot noir which went great with the duck. We skipped dessert. The atmosphere was quaint, with yellow walls, floral graphic prints and the white lace cafe curtains one sees in windows throughout France.Service was great. Our waitress was friendly.Definitely going to return when we come back to Topeka next time!"], ["Sarah C.", "Was a great restaurant. I got the beef wellington and it was delicious. The puff pastry it was wrapped in was very good.  Boyfriend got the veal piccata, which he said was very good too.  We got an order of escargot, which was good, and I used the extra garlic butter sauce with my bread, gave it a yummy taste.And the salad was very simple, just lettuce and salad dressing, but I normally don't like salad dressing, and their's was delicious.  A little zingy but not too much.The gataeu chocolat was small but very rich and tasty, and pretty cheap too.The meal was a little pricey, but it is definitely a special occasion place and has a very quaint and homey atmosphere."], ["Eddy S.", "I've been spoiled by French bistros over the years so this pails by comparison, BUT in Topeka you have a fantastic dining option.  Wonderful service, nice wines, limited but tasty menu (don't miss the soups)."], ["Alex C.", "Perfect. Enough said. You will spend money, but it is well worth it.A great date spot, very \"homey\", and great for the local community."], ["Terry H.", "We were looking for a different place for several ladies to have lunch. We had a great lunch. The decor is simple & cheery and conducive to good conversation. We had the quiche seafood crepe, and crab salad. Everything was delicious. The crab salad was fantastic and fresh. Even the bread was crusty but not hard. We will definitely be returning."], ["James R.", "Wow!  I was pleasantly surprised by how good this place was.  Really enjoyed the seafood dishes.  If you're looking for good food in Topeka, this is definitely a place to check out."], ["Cash W.", "This is one of the best meals to be had in Topeka. Don't leave without trying the squash soup. I've eaten here a lot over the years and never had a bad meal or a bad experience. The price is always reasonable too, for the quality of French Cuisine that is being served."], ["Peter S.", "I rarely review food on the day I eat it, because I like to allow for some period of reflection before I write an objective review.  That being said, this meal was absolutely horrible and an insult to French cooking. One of the previous reviews was right on the money. Right off the bat, I had misgivings when I went in and they were putting supermarket French bread into an oven. \"Don't be snobby, keep an open mind\" I told myself.  I also tried to convince myself to ignore the diner décor and plastic tablecloths, and to just sit down and give the food a chance. I had the purée soup to start, and it tasted like it absorbed a lot of the other flavors in the refrigerator that it was stored in. This is one of my pet peeves, and this syndrome usually stems from having an inadequate evaporator in a refrigerator. A good frame of reference would be when your ice cubes smell like garlic or onions because you keep them in a crappy refrigerator. This was such an occasion. My second course consisted of the saddest salad I have ever seen. It was shredded lettuce with some type of ultra-sour vinaigrette on top. Not even a sprig of parsley or half a cherry tomato to spruce it up. That's okay, maybe the salmon would be better? Nothing gets me more angry than when I ask if fish is fresh, only to be laughed at and told \"of COURSE it's fresh, everything here is.\"  Well, it turns out that gray salmon is not indicative of freshness. On top of that, it was boiled to death and their \"wine reduction sauce\" was little more than some type of country gravy smacked on top of the fish. Excess water from the kitchen was simply left on the plate, and I'm sure that the fish wished it could come back to life just to kill itself again for being served with such a sad assortment of side vegetables.  Tip for restaurant: at least get edible baby carrots and snow peas.   For a few minutes while I was eating lunch, I fully expected the stewardess to tell me to prepare for landing, because it tasted just as bad as airline food. A very enthusiastic one star. I don't take caustic reviews like this lightly, but I implore anyone who values food and their sanity to stay away from this monstrosity of a restaurant."], ["Nicholas G.", "A basic French restaurant that focuses on doing a few dishes well, this is one of only a few good non-chain restaurants in Topeka.   They have a nice selection of interesting wines.   My favorite entree here is the seafood served in a parchment pouch with a delicious lemon sauce.The dining room is pleasant but not formal or elaborate.   I eat here 4 -5 times a year and ever meal has been a pleasure."]], "23rd Street Brewery": [["Mike D.", "Great local brewery here. Really cool building on the inside. KU everywhere, a big open air silo type roof, and plenty of booths and different style tables. All the girls working were very friendly and helpful. The Royals were on the big screen which is an A+ for me!The beers are good. Nothing really spectacular but they're all drinkable and some are very good. I had the buffalo chicken sandwich and pub chips for dinner. The house garlic ranch and pub chips are absolutely amazing. The sandwich was great too. My only gripe is the food is pretty expensive. I mean like $14-$15 per meal. Really great place for beer lovers to check out in Lawrence though."], ["Chris S.", "Other reviews were mixed, but you cannot make everybody happy, so we decided to give 23rd Street Brewery a try when some of my wife's classmates suggested we meet there for dinner. For a Monday night, they were pretty busy, why I am not sure because the food was only \"fair\" and the prices rather \"high\". Five of us had to cram into a booth for four, so our meal was rather claustrophobic. The server was very nice and came quickly to take our drink orders. I tried a pint of their Bitter Professor IPA ($4.75) which, by the way, was not nearly as dark as the photo on their website indicates. It was very good with a robust hoppy, bitter taste indicative of a good IPA. I tried their More Cowbell Milk Stout (also $4.75) later in our meal. I love stouts, but this milk stout was not at all \"milky\" or as smooth as some I have had in the past, having a \"burnt\" taste as if someone had left the malt and barley unattended during roasting. I cannot imagine that it was intentional because it was not pleasant. One thumbs up, one down. On to the food. The food is not abundant and the prices a bit high for what we got. I ordered the French Dip sandwich, advertised as 8 ounces of sliced prime rib \"stuffed into a French loaf\" with horseradish sauce, Swiss cheese, a side of beef au jus and seasoned fries. ($12.49). The first thing I noticed was the size of the sandwich, coming on a bread roll about the size of a hot dog bun, not a \"French loaf\". $12.50 for this I said to myself? I think the advertised \"8 ounces\" of beef was also a bit of a stretch, but it did overwhelm the diminutive bun and making it look like there was more meat than there was. The meat was flavorful and the fries crispy, hot and tasty, but the sandwich was a disappointment and the plate would have been a much better value in the $7 to $9 range.My wife went with the Max's Mac & Cheese, advertised as \"shell pasta in a creamy mozzarella, provolone, and cheddar cream sauce ... baked and topped with bread crumbs\" ($12.99). Again, the portion was small for $13 considering that was all she got (a side salad is $3 extra), a plate of pasta with very little cheese sauce. Kraft Macaroni and Cheese has more flavor and I can buy a box of it for about a buck, so that tells you what a poor value this dish was. The dish was dry and flavorless.I saw on their website that they have a \"Mug Club\" and their advertised Monday Night Special was a 24 ounce schooner of draft beer for $3.50 - for Mug Club members. However, I could find no information on this \"Mug Club\" on their website or menu nor did our server mention anything about it. So when she returned with my 16 ounce, $4.75 IPA, I enquired. She told me that for $50 a year \"our regular customers\" get discounts on beer. Well, I am not a regular customer and very likely will not be, so I guess $5 for a pint was not a bad price. Our bill came to a little over $38, $46 including tip, for two beers, a sandwich, and small plate of pasta, a poor value even in comparison to the routinely underwhelming and overpriced cuisine of Lawrence, Kansas.Guess I will go to the liquor store, buy two good $1.50 to $2 bottles of beer ($9-$12 per six pack), and enjoy a couple boxes of Kraft Mac and Cheese at home with my wife next time, saving $42 in the process.CombatCritic Gives 23rd Street Brewery Four Bombs Out Of 10 ... More Bombs Are Better!"], ["Scott T.", "23rd Street Brewery has been around for a long time and definitely has found its place in far West Lawrence. If I had my way, there'd be more watering holes like this on the side of town that... well, looks like any other suburb in the country. Miles upon miles of mauve and tan houses, all neatly lined up, indistinguishable from the next.But I digress... the beer at 23rd St. is quite good. It's not my favorite in town (pssst, there's that other place downtown) but it's decent. Good, not great. Service here can range from good to great, another problem. The \"other\" place, those are salaried professionals tending bar and serving that have benefits, insurance, vacation, etc. These are largely college students servicing the clientele. Big difference.Good food, especially the pub grub dishes. Hard to beat a burger and chips with a couple of pints and when the weather is nice, forgo the inside which is uninspiring and try out their patio. A refreshing place to dine and quaff while the sun is going down, and you can catch the Royals on the tube outside during the summer. Who doesn't like that? I rarely get to this side of town for the purposes of entertainment but did so recently and thought it time to weigh in. This is a good place to hang, it just won't ever be my go-to destination for craft beers but that shouldn't stop you from dropping in for a pint or two. We're lucky to have 23rd Street Brewery in town and I'll definitely return."], ["Chris O.", "A casual restaurant with its own line of beer, 23rd Street makes the most sense if you're trying to get buzzed and catch the game or eat with a very large group. But if you're a vegetarian looking for something beyond pastas, salads, or a veggie patty purchased across the lot at Hy-Vee, this place might not be great. I went on the Saturday of graduation weekend for dinner with a close friend and that friend's family. I decided on the alfredo, which seemed like a very safe bet. It wasn't anything special, but it was definitely filling. I should have asked for some added vegetables - my friend did, and was rewarded with probably a half star or full star bump in experience. Maybe it's because I didn't grow up eating pasta and sauce with nothing else (read: mac & cheese), but I really just thought the alfredo sans grilled chicken (read: vegetarian) missed the spot a bit. The service at 23rd Street is always very cheerful, but I feel like they are dressing their wait staff in more tight fitting clothes than they used to. As a dining experience at 4:30 PM on a very busy day, 23rd Street did well enough."], ["Laurel C.", "This is one of my favorite places to get food in Lawrence.  I've never tried their beer selection.  Tonight I had chicken tenders and pub chips and they were delicious.  The garlic dip is great for both the chicken and the chips. They're totally packed on game nights and don't take call aheads but most nights they are a great place for dinner."], ["Roman A.", "The food and drink here is always good, even after another Jayhawk loss.  Oh well, how long until basketball season??  I have tried several items on the menu and have loved them all.  The service is good and they even treat the fans of opposing teams nicely.  I sometimes will stop by the Hy-Vee which is located in the same parking lot to pick up some items.  However, I don't think the owner of the Brewery is in cahoots with the manager at the Hy-Vee, if you know my expression."], ["Mike S.", "It's always a good time at 23rd...good beer, good atmosphere and great food. They are even nice to Wildcats! Hard to beat the Smoked turkey Stack sandwich although everything is good."], ["Geary J.", "A great place to grab a pint and a meal. Fast service and the food is delivered hot and fresh. The selection of beer is just what you would want at a micro brewery and we were happy to return several time while in Lawrence."], ["Christopher S.", "Five stars for a local brewery.  Beer was great, food was delicious, and the service good.  I liked the atmosphere.  A lot going on but you could talk.  Sat at the bar with a friend.  Large beers served and it was excellent.  I am not too adventurous when it comes to new beers.  Very pleasantly surprised.  Typically in a local brewery restaurant you get mediocre beer, mediocre food, and mediocre service.  This was a very pleasant surprise.  We each had a dinner entree and beer for about $20.00 apiece.  Portions were large.  I took half mine home."], ["Charlotte M.", "My children attend KU and we took them to dinner.  Make sure you go hungry.  The portion sizes on all our meals were large.  I always enjoy ordering The Sampler so that you get a variety of beers to taste.  I was not a fan of the raspberry beer but others in the group really liked it.  The service was great.  All servers checked on us.  Of course the boys liked it because the TV's all over the place were on a different sport channel.  Would not want to miss the Royals."], ["Maud K.", "Before I got celiac disease, I would come here with groups who liked their happy hour, which includes cheap pizzas. I enjoyed the pizzas. They were pretty good. I never had anything to drink because I'm not a beer drinker, and the cocktails seemed overpriced. The main problem is the noise. Even back then, when I could eat their pizzas, I hated this place. It's so loud all the time. I've been here maybe ten times, not all during happy hour, not all during lunch or dinner rushes, and every time, even when it seems relatively empty, it's just such a loud environment. The kind of place where you have to yell to hold a conversation. Hate it.If you drink beer, and hate talking to your friends and family, you might be happy here.So that's why I used to hate this place. But then I developed celiac disease, and now I can't have gluten. 23rd Street Brewery has an 'allergen menu' which lists the small number of things that people with various restrictions can eat. But for no good reason, they assume that anyone looking at this menu has all of the possible allergies they are trying to provide for. As a result, the items on this menu are very few, very bland, and very boring. As a vegetarian, I can eat almost none of even these few bland boring listed items. I've tried to talk to waiters about possible additional options from the menu that might be safe for someone with celiac but no other allergies, but no one seems knowledgeable enough about the ingredients to give me that kind of information, nor are they particularly willing to go out of their way to find out. As a vegetarian with celiac disease, basically all I can eat here is a few flavorless and overcooked spears of asparagus, an incredibly overpriced avocado half, or a super boring pile of iceberg lettuce. And I can't even have a real conversation over all the noise, to distract me from the bad food. Ugh."], ["Nicole L.", "Bill Self. Get that and a strawberry daiquiri and you're set! Their pastas are great! My husband and I always stop here at least once when we come visit from Chicago. We have yet to be disappointed!"], ["Cody H.", "Went here last night for a friends bday party. Cool building on the inside with atmosphere to match. Based off on a lot of you Yelper's reviews, I was either going to do the \"Bill Self\" or fish and chips. I went with a half order of the Bill Self and a side of fries. Holy crap. That. Food. Was. Amazing. It was probably be best Mac and cheese I'd ever had (I'm not even a big pasta guy), topped with buffalo chicken fingers. Sooo good! The fries were really good too. Everyone at the table was going off about how good the food was. Collectively, the table had a calzone, county fried streak, and a couple different sandwiches. It sounded like everyone would have given 5 stars for the food. The service was really good for a busy Saturday night too. Everyone was nice and helpful. I also tried the Bitter Professor and the Raspberry Wheat beers. Both were good as well. So Ya, 5 stars for sure!"], ["Daniel K.", "Beers were decent.  Its craft, but basic craft.  More of a restaurant type brewery... You know the kind.  They werent bad but just not enticing me to drive back to Lawrence for another visit.  I will say the Bill Self meal was da BOMB!"], ["Eric B.", "Great place for alate lunch. I have done a few work related meetings there. They have happy hour 3-5. $1 10oz beer and $5 flat bread pizza. Food is good and service is too."], ["Dezeree H.", "Good quesadillas. Nice atmosphere. Beer is better than Free State.  That being said, it's not the best brewery around these parts. But it's not bad either."], ["Lisa Z.", "This is becoming one our favorite places when we come up to visit our kids at school.  With each visit we've tried some new things, but always have to have the staple Naked Nachos, they are awesome!!  You could actually make it a meal for yourself.  They're loaded with several cheeses, peppers, beans, tomatoes, olives, scallions....all that good stuff you want!  Sides of salsa, sour cream and guacamole are a nice added touch!  With this visit, I had the hand tossed pizza, with sausage, mushrooms and pepperoni.  Had all the right spices, and cheese and was delicious!  My son was thrilled that I could only eat 2 pieces and he is getting the left overs for the week.  My hubby had the buffalo style wings and had just the right amount of hotness!  My son had the burger, which he gladly ate all of it, and my daughter gladly shared all of our goodies!!  I'm not a drinker, but my hubby and son are always eager to try the different in house beers and have yet to be disappointed!  Look forward to coming back on our next visit to KU!"], ["Emily C.", "Loved this place when I moved here on 2006. In recent years the food has become subpar. Staples became flavorless, smaller portions, and more expensive."], ["Robert J.", "The beer was good, the food and service was marginal.  Especially liked their IPA brew."], ["Farley D.", "A large, commercial brewery that seemed chain-y. The beer was okay, and you can get just about any mixed you'd ever want. The food menu was fairly straight forward American-chainlike, but it's worth stopping in for a flight."], ["Rachael F.", "I visited here twice in my stay in Lawrence, once for lunch and later that day for a couple beers.  The lunch was quite disappointing.  I ordered the fish tacos as they were recommended by the local that brought me here.  They were horrible.  First of all, they were served on pita bread.  PITA BREAD???!?!?!?!  The menu said they were served in a chalupa, which confused me because chalupas are flat and tacos are folded, but I went with it.  They most certainly copying Taco Bell, which serves a taco in a fried pita bread and calls it a chalupa.  Even if I get past the errors with the delivery system of the fish taco, I couldn't get past the lack of flavor - it was bland.  They also forgot to fry the \"chalupa\" as described in the menu.  So lunch was a bust.That evening a few of us came back for a couple beers.  The couple of wheat varieties I had were pretty tasty and at great prices.  The service was attentive both visits.  I'd go back for beer, but I don't think I'd have anything off the food menu again."], ["Kendra L.", "I loved it. The wait was too long,  but the hostess worked hard to get us a table. The fries are DELICIOUS. Now whenever I have a serious fry craving, I'm going there. The food was perfect and our waitress was super sweet."], ["Morgan F.", "I love this place! Fast service! Nice waiters! Right down the street from house ! Perfect!"], ["Mark P.", "Our first visit to 23rd Street Brewery tonight for my birthday dinner.  Four of us in our party and we had: \"Fried Chicken Salad\", \"Penne Alfredo With Grilled Chicken\", \"Pesto Chicken Flatbread\", and the \"Meatloaf\".I had the Penne Alfredo and it was very good.  The chicken was tender, the alfredo was good, and the penne was cooked correctly.My father-in-law had the pesto chicken flatbread.  He said it was good and took half home for leftovers.A friend had the fried chicken salad. She also said it was good and took half home for leftovers.My wife had the meatloaf, garlic mashed potatoes, and green beans.  While the green beans were very good, the mashed potatoes were not. They had an odd flavor, but not garlic.  They were thick and lumpy, indicating they were made from scratch, but the flavor just wasn't there.  The meatloaf was bad.  Instead of a slice of loaf, it looked like a large scoop of meat ice cream - with none of the goodness of ice cream.  The consistency was that of either wet cornbread or dog food (we each tried a bite and had varying descriptions).  Although it tasted okay, it was not good.  Maybe 5 out of 10 to be generous. It did have a strong taste of ketchup, and the gravy over the top added a little flavor, but this dish was a failure.The server was attentive and friendly, even being very busy with several other tables.  We will come back again sometime, but we will steer well clear of the meatloaf."], ["Jesi G.", "I don't understand the hype. The food is mediocre. The beer isn't anything special. And the service is far from prime.Don't bother going if you aren't willing to spend at least $75 and have three hours to spare. My parents and I went last month and got two salads and a mac and cheese. My mom and I had two drinks. Our total was just under $100 and we finally got out two hours and forty five minutes after we sat down. If you look in the kitchen it is filthy. There are insulated tubes hanging down from the ceiling and grime on the walls. Definitely better places in town for the price and atmosphere."], ["Anne H.", "It might have to do with new staff, but the service has been sub-par recently. The hostesses just kind of stare at you confused when you tell them your party number and the servers are just OK. Service can be a little slow and awkward. We go every Thursday to play trivia, and this has been a consistent pattern for the last couple of months, which is disappointing."], ["Virginia E.", "This restaurant is one the regulars at our house. The house brewed beer here is fantastic and there's quite a variety. They have anything from a fruity raspberry wheat, to a slightly hoppy, but full bodied red ale, to an imperial stout. There truly is something for every beer lover. As far as food goes, we love to come here because the brick oven pizzas are both delicious and cheap. We can go out for pizza and beer, watch the game, and go home for $25! Pizza isn't the only great option 23rd St has to offer. They have, in my opinion, one of the best burgers in town! The patty is thick and juicy, not overcooked, with a charbroiled flavor. The bun is a moist brioche roll, which is what really does it for me!Another great option is their custom mac and cheese. If you come to 23rd St, you really must try this dish! It's homemade cheese sauce topped with buffalo chicken make it one of the richest, most amazing dishes on the menu. It's jam packed with so many calories, I never order this one only for myself, but to share since it's a 'best thing I ever ate once a year' kinda dish.We've visited 23rd St. Brewery many many times over the years and only had poor service once and we ended up with a free appetizer and meal without complaining to a manager at all! We are very judgmental when it comes to service so that's saying something!Overall, I highly recommend this restaurant to anyone looking for a relaxed atmosphere, mid price ranged, Lawrence original type restaurant. You don't even have to fight the downtown traffic to get here!"], ["Katie W.", "The beer is good, I had the raspberry wheat. It had really good raspberry flavor that wasn't overpowering. The food is nothing special. The service was decent, our waitress wasn't very attentive but she was friendly. Would I go again? Probably not. But it's worth the stop if you just want to grab a decent beer."], ["Haylie S.", "I have generally enjoyed the food I've gotten here. Great hamburgers, pub chips, and beer. However, the ranch dressing leaves something to be desired. Some food is incredibly flavorful, other foods not so much."], ["Lisa S.", "Dirty booth. Dirty & sticky menu. Dirty ledge & window sill I had to stare at the whole time. Food was okay but they messed up my burger order. I was going to talk to a manager but I was so upset I decided to just go home."], ["Michael T.", "As one of the Lawrence originals, this place is usually always packed Thursday-Saturday nights and for game days. The food is named after KU coaches and players and has a creative edge to it. The food is pretty pricey but certainly holds its own. Popular dishes include the Bill Self (Mac n Cheese w/ Buffalo Chicken), the Danny Manning Marsala and the Manley Stanley (Massive Burger).The house brews are excellent, particularly the Wave the Wheat Ale and the Raspberry Wheat."], ["Mackenzie C.", "I'm not a beer drinker, but the martini here was excellent. I had the fish and chips, which is always a safe choice, and the meal was pretty good. The service is great and it's a warm, friendly atmosphere. It's also very classy but still casual. The prices were about what I expected, and I'd say fair. I would definitely visit again."], ["Logan B.", "I'd give 4 1/2 if I could. This is one of those places that after we eat at my husband and I say, \"why dont we eat here more often?\". This time we took the kids and they absolutely loved it. They have REAL crayola crayons, which is a bonus, lol, and they give the kids a free plate of cheese,crackers,and grapes while we wait. Which we all loved. Our food was delicious, our drinks were great (rasberry wheat for me), and the service was friendly and efficient. Happy hour specials are awesome, check them out."], ["Regina F.", "23rd Street Brewery has a nice selection of beer, and the happy hour food specials, including some very nice, fluffy, warm pita and standard, creamy-yet gritty hummus, are laudatory. The waitstaff is remarkably pleasant - our waitress promptly attended to a party of 15 or so, never leaving our glasses empty or our stomaches growling.The clean, amber-wood interior resembles those sophisticated (I say that non-ironically) family-friendly establishments where Mom could get a glass of Reisling and enjoy her hazel-nut encrusted goat cheese salad, Dad could opt for a soda to slurp with his chicken marsala, and the kids could munch on chicken fingers and french fries.Next time I'm in Lawrence, I'll check this place out for more than just drinks and appetizers - perhaps indulging in homemade pub chips and a giant chocolate cake, because that's a meal...right?"], ["Myranda S.", "Two words: chicken strips. This place is great for beer lovers everywhere but I go for the chicken strips every time--served with teriyaki or honey mustard.  The Mac n cheese and fish and chips are also menu favorites. Nothing too special about the atmosphere, just your everyday bar/restaurant that happens to be a brewery too.  Great place to watch a game!"], ["Nicole B.", "23rd Street Brewery feels more like a sports bar than a brewery to me.  Inside, it can get very loud, but it has a great patio outside.  Service is very inconsistent.  There is a bartender named Pat who is awesome.  He knows a lot and is friendly and efficient.  Some of the servers aren't knowledgeable when when it comes to the beer.  For example, my friend ordered the flight.  My friend asked our server about the beers.  The server looked at us like we had 50 heads.  So she goes inside and has the bartender write on a piece of paper the orders of the beer on the flight.I like the wheat and raspberry wheat.  The food is decent.  I usually create my own burger.  For whatever reason, they have the hottest jalapenos in all the land.  The burgers are big and juicy and they have really good fries.  23rd Street Brewery is not a horrible place, but service could be better and it just doesn't compare to Free State."], ["Nick H.", "The last two times I eaten at 23rd street, I've left extremely disappointed. Both times I ordered the honey mustard chicken sandwich. The chicken was over cooked and I wasn't able to cut it with a knife. It was impossible to bite into the sandwich. I will think twice before eating at 23rd street again."], ["Elizabeth A.", "I visited the 23rd Street Brewery with several friends on 10/30/14. We were there for a leisurely dinner and to catch up. Claire was our server and she was fantastic. Realizing we were having a girls night out, she did not push us to order or finish. She was so friendly and provided just the right amount of attention. The reuben sandwiches and pub chips we ordered were good but the service is what made the experience. Even the hosts at the door were very friendly. I will be back."], ["Jessica H.", "Still love the food and beer. This visit however I noticed some unpleasant things. First, the light bulbs in the women's restroom had a noticeable layer of dust on them so did the light fixtures that hang above the tables in the dining room.  The person with me had his growler filled and the cap they put on the growler was covered with mold on the inside of the cap, that was the most disturbing part."], ["Nicole M.", "Had the Reuben on special for lunch today and it was delightful. It was piled high with tasty corned beef and a layer of melty swiss. Personal preference for me, but I liked that it didn't have a TON of sauerkraut. I like just a little and this sandwich was perfect. I did ask for a side of Thousand Island because I like my sandwiches a little more \"wet.\" It was a steal for $7.99 which included a drink and I was totally stuffed.Other favorites include the Raspberry Wheat beer, the Bill Self (mac and cheese topped with buffalo chicken tenders. YES!), and the spicy cajun pasta. They also have a really nice patio out back and tons of TVs inside."], ["Michelle F.", "The food was good, the service was good, the prices... a bit high for what you get. The fried pickles are fantastic, if you go make sure you get those. But at $7.99, they are a perfect example of being overpriced for the size of the serving. I enjoyed my burger, and it was prepared correctly, but it wasn't anything extra fancy that the price would imply. It came with fries but they're standard Sysco-issue and a small handful at that. If they could bring the prices down a bit, or kick the quality up a notch this would easily be a 4 star or more experience for me."], ["Susan K.", "The pizza was very fantastic the service was great and you need to stop by the women's restroom to see the door opener."], ["Thad J.", "Our extended family of six arrived at the 23rd Street Brewery on a Friday night. The place was busy but not so crowded that werent seated immediately. Our server, Handler, came right over and asked for our drink orders. My brother and I love micro-breweries. We enjoy trying new beers. Handler was very knowledgable about the selections and helped us make a selction based on our likes/dislikes.There were many beer selections to choose from including a seasonal flavor that changes throughout the year. Unfortunately, my brother's selection did not agree with him. When Handler came to the table, she immediately exchanged it for another beer that was better suited. Everyone enjoyed their beers.When it came to our meals, we challenged Handler with six different selections many with substitutions. Handler was not rattled by our indecisiveness or our silly jokes. The entrees came out soon after the second round of drinks. BBQ pulled pork sandwich, chicken pesto pasta, macaroni and cheese, meat loaf, chicken fried steak and calzone.The portions were enormous! We knew there would be a lot of to-go boxes needed. by the end of the meal. The BBQ pull pork was piled on top of the bun. The meat was tender and the sauce was tasty and tangy. The chicken pesto pizza was perfectly baked on a thin crust. The chicken was plentiful and the seasonings were just right. Our mac-n-cheese expert gave his dish two thumbs up and said it was \"very cheesy\".The meat loaf dish came with two thick slices  and a mountain of mashed potatos. The brown gravy complimented the flavorful spices in the meat loaf.The chicken fried steak was a little tough and was the only negative mark on our meal. The pepperoni/sausage calzone was the size of a football! Stuffed with meat and cheese and sauce, it was all I could do to eat the whole thing. It was a challenge I was not going to lose.Lawrence is a college town. And while it bothered me to be surrounded by so many Jayhawks, this a great atmosphere to enjoy the game. Dozens of TV's surround the restaurant and bar. The largest was about 12 feet wide!When you go to the 23rd Street Brewery, try the beer sampler to get a taste of their samplings. And don't wear an O-State shirt. You'll get stared at.Handler the server. Pulled pork BBC, chicken pest pizza, mac n cheese, alone, meat loaf, chicken fried steak."], ["Brandy R.", "Decent beer and chill atmosphere."], ["Josh Y.", "This is a sorry excuse for a brewery.Those who feel this is a 3-4 star place, should get out more... well leave Kansas more. As we waited for our flight, which i passed by  as it sat on the bar on my way to the washroom, the waitress text'd and showed other people photos on her phone. There were 3 groups of people on the patio along with us and there were 3 recently empty tables. I know this because the waitress couldn't be bothered to clean up any of the tables. They sat that way the entire time we were there.Out of the 8 beers on the flight, 2 were decent. The waitress forgot one of the beers so we couldn't try it. She took forever to get us water and the check. She also never cleared any of the tables outside, which I am not a snob, but it was kinda gross. Anyone that likes to visit different breweries, avoid this place. It's not worth the effort."], ["Alexis R.", "Pretty good beer.  I love that they brew their own with inventive names and specialty beers rotated often.  Their menu offerings are varied but rather pricey for what you get.  $15 for chicken and a side.  Their pizza are a better option.  Plenty big for 2-3 people and only ~$10, the BBQ chicken is very tasty as is the Thai Chicken.  Their crust is great too.  Come after A pint is ~$4 but pitchers ($7) are cheap on Tuesday. The hummus is a good choice too are snacking.  This is a nice date place. Quiet enough to talk with nice ambiance.  They have extensive outdoor seating as well for chilling with friends."], ["Nicole E.", "I went here with a group of 7 and while the service could have been quicker, the food, drinks, and atmosphere were all well worth it!!  I had a martini because I\"m not much of a beer drinkers, but the beer drinkers around me were enjoying the selection and their drinks.  The apps were yummy and the mac and cheese awesome!! I'd highly recommend this as a stop if you're not in a hurry and want some good drinks and bar food."], ["Joseph L.", "I like this place. Was very busy when we went this weekend (just after a KU football game) but our server was very informative in telling us up front that it might take a little longer than usual for our food to arrive. She brought us free pub chips even though we didn't ask.I had the Bill Self pasta (good stuff), my girlfriend had the Naked Nachos (she loved them), her friend had the Fish & Chips (she was not a fan).The beer was cold and always delicious. You never fail with ordering Raspberry Wheat BeerFor any KU fan visiting Lawrence this is a great place to eat and drink at. Big enough to hold a lot of people so wait time for a table is never too long. I plan on going back more in the future."], ["David G.", "Guess what, there's another brewery in town and it's mighty fine.Ok, it's not as famous as the one downtown and doesn't get enough recognition because it's overshadowed by that 800 lb gorilla that everyone thinks of when they think of beer in Lawrence..  I remember this location changing hands many times, most notably before it opened when the place was set to explode and they had to pour all the beer down the sewers of Lawrence.  Seeing the streets of Lawrence run with unconsumed beer caused a part of me to die that day.  A few years back this was the second location of 75th Street Brewery in Waldo and eventually they broke away and became a local establishment.  I missed the beer mug club and the KC Rewards card, but generally the move was the right thing.The place has lots of local flavor, pun intended.  You can get the Hank Booth Burger or a Bill Self.  I can't remember what the dishes are, but it's darn fun to go to a place that has sandwiches named after famous people.  It's definitely a sports bar with games playing on a variety of screens.  No Langston Hughes salad :(The highlight of the place is the beer.  It's really good beer!  Makes sense for a sports bar.  Decent variety , though it tends to be on the safe side.  I'd like to see them branch out into funkier beers that have a bit more character.  Vanilla Stout was probably the best beer I had there.  I've never been disappointed in the beers.  What I'd kill for is jalapeno beer in this town just once.  Food is typical bar food with a bit more variety.  My favorite is the fried pickles.  Sinfully delicious.  They are spears though and I prefer pickle chips. No big deal though.  I'm only allowed to have them when I've been really good.  Forget ice cream as an incentive:  mama's gotta have her fried pickles.The nachos are awesome too and they are EXTREMELY spicy with those fresh jalapenos on top.  You'll feel them a few days after and I won't go into more detail than that.They've got a new menu now that is about the friendliest I've seen to vegetarians. I'm waiting to try the peppers stuffed with couscous.  Typically I get a nice calzone there or the goat cheese salad.  Now, I'll most likely  get the new Local Burger veggie burger there they sell in partnership with Local Burger in town.  Mmmm.  Gotta get the pub chips with that!  I wonder if they'll name that one after me?Service is acceptable and can be spotty at times.  It's what I'd expect in a college town.  Some servers are awesome and some simply phone it in.  When I've complained on occasion, I've gotten a very accommodating response from the management.  Overall, expect great beer with an upscale bar menu that everyone can find something they like.  When you are looking for good food and beer in Lawrence, and don't want to wait an hour for a table, check out 23rd street and be sure to have them name the veggie burger after me."], ["Carolyn N.", "Stopped in for lunch on a Weds on the first day of my vacation...and I sure feel lucky.  Had the Thai Chicken Salad lunch special, delicious and the Bitter Professor IPA, outstanding!!! If I lived here this would definitely be my go to IPA, wish I could have had two..."], ["Jennifer H.", "My friend and I wanted to try a new place, and we settled on 23rd Street. The nachos were AMAZING. After those, I had to box my mac n cheese, but only after tasting it. Pretty good but not worth $11. Not even close. My side Caesar was a bit disappointing but not bad. Service was great, and the top shelf margaritas (on the rocks) were tasty but watered down. One of the reasons I wanted to go here was because they are listed on the Lawrence GiveBack page as a participating business. I was extremely disappointed when the server informed me that they no longer participate. I am much more comfortable spending money when part of it benefits a good cause."], ["Sarah S.", "Ah, 23rd Street Brewery. So hard for me to neglect for too long because I'm kind of a sucker for beer and pub food, plus it's the closest sit-down restaurant to our place. So we've been quite a few times over the past 2.5 years, and at this point I can give a pretty fair summary.The Good/Average:-Beer. No, it's not as good as Free State's, but honestly, I've never had a bad or undrinkable beer at 23rd. They also tend to be a little more creative with their styles -- for example, today they had a sweet oatmeal stout on tap, and they had a delicious saison on for most of the summer. Their regular lineup is also solid, if nothing crazy delicious. And I appreciate that you can order four ounce tasters.-TVs. This is a really good place to watch just about any game because there are TVs EVERYWHERE. In fact, this might also be a bad thing because I often get distracted when we're there just to eat...-Food. Again, it's nothing remarkable and not as good as Free State's, but it's solid across the board. I've had everything from the burger to the flat bread pizza and never been disappointed, and it's nice that they have a large menu. Definitely not gourmet, but it's a brewpub so I'm not sure what people expect. -Location. It's not downtown! So you can actually park with ease and almost always get a table right away. The Bad:-Service. I've never had a problem with a rude server, but unfortunately you are almost guaranteed to get exceedingly slow service, no matter what time of day you go. Today we went over lunch and it was far from busy, but it still took us over an hour to get out of there. Considering we ordered cold items, I'm not sure why there would be such a delay. Most of the servers give you sporadic attention and it often takes quite a while to have someone show up at your table. There was one really good server there for a while, but I haven't seen him lately and I'm afraid he's left. Moral of the story: if you're in a rush or you're very hungry, you're best off going somewhere else. It's the one downfall of 23rd Street, but unfortunately it's a pretty big downfall. -Prices. Seem a little high. I'd like to try the Bill Self, but the fact that it's $16 keeps me away from it. And the beers could probably be a little cheaper for what they are. Overall, I'd give 23rd Street 3.5 stars, and if their service got a little speedier it would definitely be a huge plus."], ["Sherie S.", "Food is always good here.  Ordered the tai salad with dressing on the side.  The salad was weird and bare because I did that.  (note to self) clients enjoyed their food and the ambiance.  Service was slow with clearing plates and getting us our check, though.  They didn't seem that busy."], ["Emily S.", "Food was fine. Tasty and well made. Traditional pub meats sports bar. Waitstaff was superb. Not overbearing or neglectful. We came on Saturday night and were seated (in a comfy booth) immediately. The atmosphere is kind of noisy but that's to be expected with the type of establishment. My husband thought it was chilly inside. I didn't. Pricing was a little high considering the type of food they sell. Fish and chips and a bratwurst and one beer gave us a $30 bill. All in all? A fine place. Didn't change my life."], ["Rich G.", "I' went to 23rd Street Brewery recently on a late Friday. I have to admit, I am impressed with their beers. I tried them several years ago, and the brew was distinctly average...not bad...just not interesting enough to make me drive across town.I tasted a few different varietals on this trip, and they were all solid examples of the style.The food is generic \"american grill\" fare, and nothing spectacular, but certainly just fine if you're there with a large group, or to watch a game on the gi-nor-mous TV(!).All-in-all, 23rd Street offers a solid, place to have a nice local-brewed pint and tasty pub grub."], ["Teresa P.", "Awesome. My first dining experience in Kansas (yohoho, I'm not in Cali anymore, homies), and it was great!Our server was amazing in accommodating the group of about 20 people. Service was fast, and we never had to ask for more chips or water. I ordered a side of the sweet potato fries, which were an insane deal. For $2.99, you get a HUGE basket of fries that could feed quite a few people. The salmon topped with sun dried tomato was amazing as well. The fish was grilled to a juicy perfection, and I loved the pretty grill marks. Good stuff, and would love to come back for more :)"], ["Bill B.", "Went back a year after prior review.  Encountered none of the prior problems.  Clearly changed for the better."], ["Clarice W.", "Standard pub fare with standard quality. Nothing flavorful, clean-tasting, or original. Extremely heavy - but they give you huge portions. You need a drink to wash this stuff down. Their beer is pretty good, but does not compare to Free State. Overall I'd say the food is an ounce better (their sweet potato fries are actually great), though by no means excellent. The interior is more pub-like and less crowded/noisy than Free State, a perk. I'd go to 23rd Street on a more low-key night for their fries and decent beer (save Free State for when you and your palate are in for a bolder beer adventure)."], ["Sarah K.", "The pub chips are really good, as well as the beer! Max's Mac & Cheese is delicious, and the servings are generous."], ["Brian M.", "First review after three trips. I've had trouble reviewing 23rd Street so far but have finally figured it out. I can review this place in nine words or less. Nothing sticks out. Nothing too good, nothing too bad. With this goes the caveat that I  have not yet tried all their beers, the ones I have tried have been good, tasty and typical.Food was average.I'd give them a middle of the road three stars but when I asked for a certain game to be put on the TV, the manager said that they only had basic cable and not the channel for which I was looking. Basic Cable in a sports bar/restaurant/pub! I wasn't looking for anything too obscure, we were talking about the playoffs!"]], "The Shack Bar & Grill": []}