{"Pizagel's Pizza & Bakery": [], "Little Caesars Pizza": [], "Cibo Sano Italian Grille": [], "Gambino's Pizza": [], "Cici's Pizza": [], "Noodles & Company": [], "Papa John's Pizza": [], "Morningstar's New York Pizza": [["James M.", "Morningstars is one of the first places I tried after moving to Lawrence. It just kinda worked out that I was in the shopping center and wanted to eat. The other restraints seemed more expensive than I wanted at the time and wings sounded pretty good. When I walked in I instantly liked the decor. Nothing overly fancy but it's got a nice pizzeria vibe. Obviously my wife and I ordered the wings and they were even better than they sounded!!! The wings were made to perfection! Sweet and not too hot cause my wife can't take it too crazy. The dance was also really good! We have ordered from them several times since and it is always great! The pizza is also great! It's Brooklyn style but not overly greasy like you come to expect. They also have some remarkably good pastas including one dish with stuffed egg plant. All of them are amazing especially for a place where you would normally get pizza!My best experience with them came about a year after my first visit. We ordered delivery and after 50 minutes nothing had come. We called into the store and they told us it was on the way. Well 30 minutes later we still had no food. We called again because it was the first time we had even had a late delivery from them. Turns out the drivers car had broken down and they had to send someone out to get the food from him. They apologized for the delay and refunded our money without being asked too. I think that shows remarkable service and made us very happy patrons. We will be back as often as possible!Go with these folks and you'll be treated well and fantastically fed!"], ["Chris S.", "I was here last Autumn with a friend for a calzone, which was actually pretty well done, so I decided to try it again with my Sicilian-born wife. For a city of nearly 100,000, it is appalling that Lawrence does not have a single decent. authentic Italian restaurant. A Carrabba's would even be a breath of fresh air, but the tight-knit city \"powers that be\" seem to be pretty good at discouraging innovation and \"chains\" in favor of \"mom and pop\" establishments. Unfortunately, none of the moms and pops seem to have a clue how to run a decent restaurant, Italian or otherwise. Anyway, all that being said, Morningstar's is not bad.We tried the garlic knots ($3) which came with a side of red sauce. Baked balls of pizza dough infused with garlic apparently, I could barely taste the garlic and the \"knots\" were not baked long enough, a little too chewy ... too bad!The prices are decent except for the pizzas which are a bit pricey, so my wife ordered The New Yorker calzone ($7.25) with mozzarella, ricotta & parmigiana cheese, no sauce (she is allergic to tomatoes - some Italian!), with mushrooms added ($.50 extra). She was quite happy with the calzone. The dough was baked to perfection and there were just enough ingredients, so my wife (who has lived in Naples, Italy - the home of the best pizza in the World - most of her life) was actually impressed. Bravo!I wanted to try a few different things, so I got the Jumbo Combo ($9.75) which came with chicken parmigiana, eggplant rollatine, stuffed pasta shells, a side of spaghetti, and a meatball. I asked for the baked manicotti instead of the stuffed shells and they were happy to comply. Unfortunately, when my dish arrived I was a bit dismayed to see everything crammed into a casserole dish. The chicken parmigiana was actually cubes of breaded chicken piled on one end of the dish and the manicotti and eggplant rollatine were on the other end, layered one on top of the other. The whole dish was covered with sauce and mozzarella cheese, then baked in the oven. The side of spaghetti was not well drained, so it was a bit too watery. Too bad because the sauce was decent. With no meatball in sight, I asked the server where it was, but she said the dish did not come with one. After informing her that the menu indicated that a meatball did come with the dish, she scurried off and brought me one post haste. In all, the dish was a bit of a mess, but it was actually not that bad. It could have been better presented and would have been much more palatable had the chicken, manicotti, and eggplant been separated on a large plate, but with a name like Morningstar you cannot expect authentic Italian dishes.Alas, still no authentic Italian food in Lawrence, but Morningstar's does a fair job of trying. Their prices are fair and the service is decent, but it looks more like a sports bar than an Italian restaurant. The old world ambience just is not there. As Morningstar's would say: \"fuggedaboudit\", but not just yet. We will likely be back because my wife liked the calzone (as did I on my first visit), so maybe I will try one of their sandwiches next time. I would also offer suggestions for improvement if invited because I will do ANYTHING to help a local business as well as my chances of having a decent Italian restaurant meal without having to drive 4o miles. HOOAH!CombatCritic Gives Morningstar's New York Pizza 5 Bombs Out Of 10 (2 1/2 Stars) ... More Bombs Are Better!"], ["Sam A.", "Great surprise from strip mall pizza!  Ordered a combo pizza and garlic knots. Both were great. Knots were only $3 (and we got 9 of them!!). That'll be a go to snack. Next time I'm there I'll get a meatball sandwich. It was beautiful. This place needs another location not in a strip mall"], ["Zach G.", "I really did not expect to like Morningstar's too much. As a Chicagoan, I'm bred to hate NYC pizza. However, Morningstars NYC pizza...well, it isn't quite NYC pizza. First and foremost, they have a menu that consists of pizza, sandwiches, and some other ods and ends. They also offer slices...perhaps all day, in fact. I don't remember seeing something about slices being lunch-only, which is the case at many places. The slices, and the pizzas too, are offered Sicilian Style (thicker, about 1\") and Neapolitan Style (thin crisp cracker crust). For my lunch, Neapolitan slice with sausage, pepperoncini and garlic. The plain cheese slice is $2.50, and each ingredient is $0.50 extra, so my slice was $4.00. It came out fairly quickly. The sausage was the sliced kind and was flavorful enough. The pepperoncini's were not very spicy, which was a bit of a bummer. The garlic was...uh...applied very liberally. I'll be tasting it for years to come. But my love of garlic approves of this. Just beware. The crust was crispy and, as previously mentioned, cannot really be folded like NYC pizza. All in all, I would say it's a cross between NYC pizza and Neapolitan pizza. The only negative with the custom slices isn't limited to Morningstar's - because they're put on over the cheese, any little angle on the pizza allows some of the topping to slide off. In my case, many a pepperoncini ended up back on my plate. #FirstWorldProblems. Service was friendly and efficient, and the space is clean and comfortable. It does have an interesting setup in that you feel like it is a mixture of sit down and counter ordering. It can almost feel slightly confusing for the first few seconds you step in. If it says to seat yourself, just grab a spot and they'll bring you your menu, drink and cutlery. There are a few TVs along the wall. They also do have some bottled beers available (not sure about tap though). Quick, affordable, tasty. I will return for future lunches as it's also fairly near my office."], ["Tony T.", "This place is terrible!!! Do not waste your money on them! I ordered a slice of thin crust with pineapple, ham, jalapeño and the ham was literally torn pieces of lunch meat. (see photos) they couldn't even cut it with a knife!! The toppings are put on top of cold premade cheese pizza. They didn't even bother to reheat it so the toppings would be hot!!You are better off going to the grocery store and buying a one dollar jenos pizza than to waste money on this junk they try to pass off as pizza. Anyone that gave this place over 1 star rating is friends with the owners or the workers. I would give them a zero rating if it was allowed. If you don't even have enought pride in your product to cut the freaking ham with a knife instead of tearing it with your fingers then you shouldn't own a pizza joint. Sorry excuse for a pizza place. I hope they shut down after people realize they are being ripped off."], ["Terry M.", "What a great place, stopped in while in town picking up my son from Basketball Camp. Nice friendly place, the service was very good and our server was very nice. We met some family there since we were in town, split a couple different pizzas. The ingredients were very fresh and the crust was perfect.Do yourself a favor and stop by, you won't be sorry you did."], ["Scott T.", "Don't get it.Visited twice. Good enough to fill the belly without offending but the claim of New York style pizza quality? That's pretend land. Spend several weeks in New York City every year and this doesn't resemble the great pizza you can get there. Not in the ballpark, not close, missed first base. There's more to New York pizza than thin crust.First off, when you pick up a slice in the city the ingredients don't slide off the bread, which is precisely what happened to us twice. The pizza itself isn't bad, it just isn't New York style, and it's not crafted particularly well. I'd call it we-grew-up-on-Kansas-Pizza-Hut-and-think-this-is-what-New-York-Pizza-is.Pass."], ["Todd B.", "I am giving 2 stars because the experience really fits with \"meh. I've had better.\"The place was really clean. The service was good. The portion sizes were generous. Except for the large order of bread sticks wasn't very large.  The best part of whole experience had to be the marinara sauce.Never been to New York so couldn't tell you how this compares, but personally I'd rather have a wood-fired pizza."], ["Clarice W.", "I'm don't claim to be a NY style pizza connoisseur, but Morningstar's delivers some no-nonsense, no-frills, thin crust Neopolitan (for those of you even more newbie than me, read: Cheese) pizza that sure seemed authentic to me. Super crunchy crust, thin layers of sauce/cheese, and cut in a large wedge (about 9\" tip to crust), you've got to pick this baby up and fold it to ensure proper eating - which I believe is the \"correct,\" NY-way (please feel free to correct, true NYers).The garlic bread oozes with buttery grease, is heavily seasoned, and comes in a large portion (2 slices about 7\" long each). Stay away from it if you're here on a date - I fortunately was not and therefore was in carb heaven! I dig their marinara...watch it come straight out of a can or something, but that tartness perfectly complemented the garlicky goodness. When I couldn't finish the other half of my bread, our server gladly brought a to-go box for me, all ready with an extra cup of marinara in it. Bonus! I'm a sucker for these little details.On the down side, service is fairly slow and I can't boast about the quality of the cannoli; the filling isn't quite ricotta-y enough and is too heavy on the vanilla. I'm assuming this is what turned the color a displeasing beige instead of the clean, fluffy white I'm used to. The shell didn't taste that freshly-baked as advertised (it didn't crumble the way I'd like it to), but I'm nitpicking at this point. Morningstar's is, after all, a pizza joint. Sometimes you just crave simplicity and this stuff sure does it!"], ["David G.", "Lots of people claim to be \"New York\" pizza places but this is one of the few that delivers!  If you limit yourself to pizza here though you are missing half the fun.A certain degree of mysticism surrounds what is a New York pizza.  Is it the water? The cheese? The size? the oven? The sauce?  Yes, it's all of that and none of that.  You just know it when you taste it and you roll your eyes at imitators, just like when a midwesterner asks \"Why is it called an egg cream when it has no egg and no cream?\" and pronounce \"Houston\" like the city in Texas.When Morningstar first opened, I thought it was named after the stock report in what I thought was a clever tribute to Wall Street.  Alas, even though I live in Lawrence, I'm not a basketball fan and apparently this place is owned by a famous KU basketball family.  I was disappointed in what I thought would be quite the nod to New Yorkers!That is until I walked by and saw Drake's cake in the window.  Like a moth to a flame I was instantly drawn to the place.  I haven't had a Yodel since grade school.  Dad used to always keep them in the freezer and if I was really good I could have one.  For those midwesterners out there, Drake's is kinda like Dolly Madison or Hostess.  Except it's better because it's from the East Coast.  This was a smart move by the owners because unless you put a sign in Times Square, this was the best way to say \"Hey, we love New Yorkers\"When I walked in to decide what I'd eat before I ate my coffee cake and Yodel, I saw Wise potato chips.  Awwww.  That aqua green and yellow bag was part of my lunch box for so many years were about as valuable for trading during school lunches as cigarettes are at Riker's Island.  To top off that New York state of mind, they had Yoo-Hoo drink.  They didn't try to be a Jewish deli and have Doctor Browns or egg creams (again, use wiki to look it up and stop asking us New Yorkers about it.  Get some Fox's Ubet and experiment).  This place has all the trappings of a New York pizza parlour.Another authentic aspect of this place was a full Italian menu with calzones, lasagna, heroes (subs, grinders depending on where you are from).  Everything tasted as I remembered and nothing gourmet.  This is all about the basics and doing it right, though they do have gluten-free and dairy free cheeses.  I'd try some of these modern options, but I'd be afraid my New York taxi cab driving father would rise from the grave and tear up my birth certificate.  Although I haven't tried it yet, I hear the handmade cannoli is awesome.  I promise I'll try it but when they have Darke's Yodels and Coffee Cakes, I simply can't make it that far down on the menu.  No Italian ices though, which is a shame but makes sense since Marinos would melt coming all the way from Jamaica (and if you think the country not the borough you've got some more learning to do).  Maybe they can serve ice cream with a wooden spoon here and yellow cups and at least try and emulate that feel.What's missing here is the NY attitude, and that's a good thing.  The fact they accommodate a variety of dietary needs is a good sign.  No \"soup nazi\" here.  Everyone was friendly and helpful and generally interested in our enjoyment.  No paper plates and wax paper.  Real live silverware!Service was a bit slow, but that's ok because the murals and New York paraphernalia helps pass the time.   It's important to note there is all Yankees memorabilia in this place.  The reason is simple:  the Mets suck.  All true New Yorkers know this fact.  Ok, I might be exaggerating since not everyone from the Big Apple has realized it yet. The Mets/Yankees rivalry makes Mizzou/KU rivalry look like a playground shouting match and I'm glad this place takes sides.The irony though is Jerry Seinfeld is a big Mets fan and the bathrooms have pictures of Seinfeld characters.  Ed Koch is too.  These flaws make them human.  Neither would eat in a place that so prominently displayed Yankees memorabilia.  That's their loss because they've got dozens to choose from in the five boroughs.For us, in Lawrence Kansas, Morningstar's NY pizza is the only true choice for those that can quote and remember the I \"heart\" New York commercials and had the goofy T-shirt.   Native Lawrencians will really get a piece of the action here."], ["Christina J.", "Awesome delicious flavorful NY style pizza.  Foldable and excellent crust. Best authentic Italian sausage in our area  and fresh toppings on the Supreme"], ["Bill B.", "All true Jayhawks know the Morningstar name, and yes these are those people.  If you do not know the Morningstar name, you surely will be run out of town and will be greeted enthusiastically in Columbia, MO. Really healthy, good pizza.  In addition to having whole wheat, thin crust, they have low fat soy cheese, along with lots of fresh produce.  If you want something closer to authentic Neapolitan pizza, you'll have to drive to Kansas City, where two restaurants are doing that rather well.  But for healthy, low fat, low refined carb, NY style pizza, Morningstar's is the best I've found in this area."], ["Jason Y.", "Top 2 pizza joint in Lawrence Kansas. Papa Keno's and Morningstar very similar in regards to thin crust slice. Morningstar has a wide menu with lots of goodies. Compare this place to Aveluto's Italian Delight in Mission Kansas. Much nicer people and cleaner joint at Morningstar. Great addition to Lawrence, Kansas.Little confusing on how to order carry out. Other than that, you MUST try their thick and thin crust pizza."], ["Max C.", "NY style pizza you say? I found the thin crust cheese slice to be as I remembered pizza in NY... which is savory, hot, crunchy, yummy good stuff. The thick crust combo slice was a different story, it was burnt on one end and slightly warm with a mass of toppings cooked on top of a pepperoni napoleon slice. The decor is simply NY, a little bit of whatevah! It's all about the thin crust pizza here. I'll be coming here for more."], ["Tiffinie F.", "I'm with Scott T.  I don't get it either.  We ate here about a month after they opened.  I have to get straight to it.  It was horrible.   We very much wanted to find a new spot near us for some great Pizza.  We also love to support a good local business.   Unfortunately this is not one we can show love for. First the pizza took a good 45 min to come to the table.   Our beer even took an unusual amount of time to come out.   There were maybe 3-4 other tables there.  Some had already ordered one ordered after us.   That's it.  This part is what bothered my husband the most.   The employees were more busy chatting it up with another \"famous\" local who came in than taking orders and delivering food.   We also didn't get our garlic knots in a timely manner because they \"forgot\" we had ordered them.  When they did come out my kids didn't want to eat them because they were so greasy and over seasoned.  The sauce tasted like it came out of a can.  They were very chewy as well (probably d/t grease).When the pizza finally came out.  It was just \"ok\"  My expectations are never high for a good NY pizza in the middle of KS but really this was below expectation.  I would say the only thing they can claim to be similar to NY pizza was the size.  The crust was too thick.  The sausage had an odd taste.  They didn't drown the pizza in sauce which was a plus.   Would not waste a pizza night on this one.  I'd go to Tad's or JOHNNY\"S of all places for a better pizza.   We wish we could have a place like Grimaldi's pizza in Brooklyn near by!  I know they were just getting started but the service was horrible.   Starting with what I said about timeliness above.  Hopefully they have gotten this part down. We had to ask for EVERYTHING.  They dropped the pizza down and left.  Can we get some plates.  Can we get some napkins.  How about a fork.  Can you fill up our drinks that have been empty for 15 min?   Truly bizarre.  The owners,,,it was obvious who they were...were obnoxious.  I know that they have been a part of Lawrence for sometime and their son is well known but they were out right rude to us.    I honestly felt like they didn't want our business.    At the end of dinner the owner was standing near us and my husband tried to be polite and ask where they got the idea to start the business.   My husband is from New York---born and raised.   He was just wondering if they were also from NY.   The owner  spoke to us like we should have already known of course who they are and the history behind how they started it and how they got the idea from someone they knew who also had a pizza place...etc.    We were done with it by then.  We politely said thank you paid and left.  We will never give them our business and quite frankly that won't be hard as their food is horrible.  This is not \"NY\" pizza.  Is it edible?  Yes.   Are their other places in town they provide a better NY pizza and service? Definitely. Hopefully things have improved."], ["Bryan W.", "I came in to town over the holidays and thought I would try out Morningstar's since I had heard the Morningstar family opened a pizza place in Lawrence.  The pizza was great and Roger himself was working there.As for the authenticity of Morningstar's pizza as NYC-style, I take a couple trips to NYC each year and always make a point of getting pizza.  I see some other reviewers claim that it's not truly authentic, and there may be some truth to that, but Morningstar's pizza is great.  I will make a point to go to Morningstar's pizza next time I am in Lawrence.Also, an added bonus, they offer vegan dairy-free, soy cheese.  For those who are vegan or have friends and family that are vegan as I do, finding a solid restaurant that has vegan options is not always easy.  At Morningstar's you can enjoy your own meat pie, while your vegan friend or relative can enjoy a vegan pizza."], ["Quinn R.", "Legitimately good New York Style Pizza.  The calzones are superb and the pizza is very good.  Just on the food I'd probably give between 3 and 4 stars.  But what makes this a 5 star review is the service.  I haven't been anywhere in Lawrence, or ordered delivery from anyone else in Lawrence, that had such consistently friendly and excellent service.  That feeling, that the people running the store always want you to be happy and really care about the overall quality of your experience ordering from them is unparalleled at any restaurant I've been to in Lawrence.  Give this place a try!"], ["Jeff T.", "I tried Morningstar's on a Saturday night. I've had plenty of NY style pizza in my day and I don't get it quite honestly. The slices were too thick and the ingredients just didn't do it for me. In reading other reviews, I'll order thin sliced next time because I thought that was standard fare in a NY style pizza joint. Who knew?That said it definitely wasn't bad pizza but it wasn't great pizza either. The service was very friendly but rather scatter brained and they even messed up our supreme pizza order with one-side sans mushrooms and olives. The pizza was hot and smelled good but the pizza ingredients actually looked weird as if they didn't know how to slice veggies.I want to go back and try one of their pasta dishes which looked and smelled very appetizing on the surrounding tables. Give this place a shot but I wouldn't expect the best pizza in Lawrence."], ["Patrick M.", "This place is solid. Our specially-created pizza was tasty, right on-time, and the service was top-notch. The salads were excellent and the breadsticks too.  We'll definitely be back."], ["Eric M.", "Highly recommended. The closest thing to real NY pizza I've had in Lawrence and it's very good. They offer a menu that includes pasta and more just like the real NY pizza shops. You must give it a try for yourself."], ["Daniel P.", "Just got back from Morningstar's NYPD about five minutes ago and I felt overly obligated to write a review, so here I am.The place is great!  The owners were both there tonight and seeing them genuinely interested in pleasing the customers made the pizza and environment even more enjoyable than it already was.My wife and I ordered the garlic knots ($3) which were just the right size for an appetizer and very tasty.   Our medium combo pizza was good as well.  Before going to Morningstar's tonight, we checked some of the other reviews on Yelp before we made our decision where to eat.  I have only been to NYC once and am no expect on NY style pizza, but a few other reviewers mentioned that the crust was too crispy to fold and the toppings fall off the crust.  This was not the case with our pizza tonight. From the prompt greeting and generous hospitality to the décor and food, our experience this evening was great!"], ["Erik H.", "Awesome pizza and cheesy garlic bread!"], ["Jessica H.", "I noticed right away how clean it was inside, that started things off in a positive way. Ordered the NY slice and it was delicious! The staff was also very friendly and attentive. I will be back to try more of their pizza and pasta."], ["Rusty U.", "Awesome pizza and garlic knots, its all good here and not very expensive vs the chain stores."], ["Dan C.", "I'm not the expert on NY pizza, but I've loved what I've had the handful of times in Morningstar's. The appetizers (\"sticks & stones\" I think they call 'em) are that chewy, buttery, taste of garlic you're hungry for. And this is a restaurant where you really feel hosted. Few places do this well anymore, but you always feel like a guest in the home of friends when you show up and sit. If you try it out, it's my bet you'll go back and back."], ["Peter b.", "Both times I've gone, my order was messed up. It's pretty good pizza and calzones. I don't imagine it being around for too long. Get it while you can."], ["Doyle C.", "Excellent!  Would be a 5 star if hey delivered!"], ["Bill W.", "First experience was take out. Ordered whole wheat crust combo. I enjoyed the product, fresh ingredients thin crispy crust. My only criticism is that I had to recut the pizza once I got it home. I will return."]], "Old Chicago": [["Katie O.", "oh my spaghetti pie, OH MY! got it too go with marinara sauce and grilled chicken. so delicious! I wish I could make this on my own, it would be a hit anywhere. also got the chi town trio appetizer. garlic cheese bread was mediocre. Italian nachos were very tasty. the pepperoni rolls took the cake though! so good. courteous staff and speedy curbside pick up."], ["Lisa T.", "If you go to this restaurant, don't order anything other than water to drink. I ordered tea and had to wait a very long time for a refill. By the time it arrived, we were ready to leave so I asked for an empty cup to pour it in to go. It took 15 minutes and asking a manager to get the cup. The next time we went, I was only going to order water, but the waitress seemed better so I went ahead and ordered tea. Big mistake. Cup sat empty for a long time before a refill showed up. Lucky for us, the food was all right because she never once asked if it was all right. I don't know that the food is good enough to put up with the crummy service at this location."], ["Steven M.", "Great place. Was passing through and needed a late bite to eat. Had the pretzels with cheese and thin crust pizza. Both were awesome and they have a fantastic beer selection. Our server, Josh was great too. Really nice guy and great service."], ["SreeKanth V.", "Unexpectedly we have turned to this place tonight and had best of food, it was little bit of cheese but food tasted amazing and I had deep dish pizza which was so amazing I craved it for next few hours... friendly serving... I had Thai pai which was amazing but I didn't feel spicy as it was mentioned in menu"], ["Harley U.", "I was in the mood for Chicago style pizza, every time I travel through Chicago we have to get some deep dish pizza! This wasn't the same as native Chicago pizza, but don't let that detour you, this place is DELICIOUS!! Everything was wonderful."], ["Mike B.", "I really enjoy the food here, and they have great pizzas and craft beer selection. They are open pretty late too, which is great for late night dining.  The service is generally pretty good, but they can get fairly busy sometimes and don't pick up dishes, etc. overall pretty good though for Topeka."], ["Rose L.", "I am a high school coach and we travel for competition.  It's hard to find a place that can seat 36 people, 32 of them teenagers.  Old Chicago told us to call when we were on the way, and they would hook us up.  They sure did!  We had an entire section of the restaurant reserved for us when we arrived, and we were greeted with smiles all around.  We were in a time crunch, but they had us out of there, fat and happy, within an hour.  Pretty great, in my opinion!  MUCH better than other Topeka experiences we have had, definitely.  As for the food, well, I think Old Chicago is a great place to go with a group because they have so many options.  While I love their pepperjack avocado burger, their calzone, and their pizza, I opted for the avocado chicken salad.  It was delicious and healthy.  The southwest chicken salad is also delish, and that's even when they hold the dressing!  We come to Topeka two or three times a year, and this will be our go-to place from now on!  Another plus, and a necessity for us. . .they are open late and serve a full menu past 10pm."], ["Matthew R.", "Overall the experience was good! Our server was fantastic this time normally the service sucks. The food turned out well, I had the chicken pesto panini and it was delicious. Our appetizer was the cheese garlic bread, I think every time we order this it gets smaller and smaller."], ["SuzySnowflake Q.", "Unfortunately, this is the best pizza in town. Come on Topeka local businesses, let's have a great local pizza eatery!"], ["Katie L.", "Old Chicago is just another overpriced chain. I used to work second shift so this was one of the only places in Topeka that I could go to after 11PM, have a beer and eat some food. Inevitably the staff runs my boyfriend and I out just about every time we decide to give the place another chance by playing the WORST music known to man. Sometimes it seems as if the bartenders are getting a little wild and tipsy themselves, as they serve coworkers that must be off the clock and bringing their friends for a cheap and fun time. Maybe that's just bad luck for the folks who come in later at night, but it's not really the best way to run a corporate business and loses business like ours."], ["Roberto B.", "The server was kind and passably cute.  The beer list OK.  Otherwise I have nothing to recommend to the visitor or town dweller of this horrid cardboard covered in grease and limpid vegetables  - unless you're a bulemic and don't want to eat to begin with.  Or on a diet.  This food - will keep you on it easily.  Because it's awful!!!"], ["Jennifer S.", "Overall we liked this place. I would count us as pizza travelers, as in wherever we go we must try all the local and regional offerings. Walking in was a bit odd. Three hostesses/wait staff and not a single one actually greeted us or asked us how many in our party. One took some menus and said \"follow me.\" Thankfully service improved after that. We explained we were newbies and after our drink order the manager came by and thanked us for choosing Old Chicago and presented us with two coupons for a future visit. Nice!Pizza took a while, but was quite good. Our kids pizza was a pretty good size and not lava like hot. Drinks were readily filled. Had to wait a while after finishing to see our server, but not overly long. Will more than likely be back!"], ["Kristie C.", "Clean, comfortable bar with decent appetizers. Lousy pizza. NOT CHICAGO STYLE. Don't be fooled by the name. Just another lame chain restaurant, overall. We won't be back."], ["David K.", "I really like coming here for some late night food and beers. It does however appear the selection of food and beers has been reduced. Such a shame. Still wont keep me from coming back. Food and service great as usual"], ["Heather L.", "My husband and I try to go out at least once a week for our date night and we have been probably everywhere in Topeka.  Maybe we are partial because we have spent so much time at Old Chicago but not only do they have some of the best pizza there, the wait staff has to be some of the best wait staff in Topeka.  I'm the type of person that if my glass gets empty, your tip has just gone down.  Going other places we have yet to find any other place in this town that has such great service AND food.  This place has it all!"], ["Ryan P.", "My family comes here every week. Great beer selection, nice food variety, and good prices"], ["Angie S.", "I can't help but love me some Old Chicago!I LOVE LOVE LOVE the artichoke app, you get a variety of veggies and their amazing garlic bread for dipping... but love me some veggies!I am obsessed with the calazones and I get the Chicago Seven one... which is so delicious but SOOO much food.  This EASILY can be 2 meals if not three!Also - order the Caprese salad for $3.95!"], ["Steve M.", "Great Italian restaurant that specializes in pizza,  but they do offer other items including sandwiches, wraps, steaks, pasta, etc,  Prices are decent, and the quality of the food is excellent.There is a lunch buffet Monday thru Friday where you get to sample various different kinds of pizza.  And if they will even accept requests, in case you are looking for your favorite pizza pie.They have a great selection of beers in stock, last I counted,  there were over 110 different brands from all over the world.  You can join their World Beer Tour club, and as you work your way thru the 110 beers,  you earn prizes ranging from cards, t-shirts, bottle, openers, etc.  Go thru the World Beer Tour 10 times and you will earn yourself a metal beer stein that is hung up behind the bar and is yours to use whenever you visit.They currently have Trivia on Tuesdays where you form teams and compete against other teams in the bar for Chicago Bucks. First place earns you $50 chicago bucks which can easily pay your bar tab for the night."], ["Scott H.", "I travel 48 weeks a year and eat in all kinds of restaurants all over the US. This place has the worst service I have ever experienced - if you enjoy being treated like a leper, this is where you need to be."]], "Paisano's Ristorante": [["Tobias H.", "Definitely my favorite place to get Italian food from here in Topeka. It has the beautiful interior design of a major chain restaurant but still holds a charm that says locally owned. The breadsticks are vastly superior to Olive Gardens, and on a good night I even prefer their salad. A good menu and decent prices, and the diverse beer selection factor pushes this establishment over the edge. The main dish items are good, not the best Italian I've had but still worth the trip. If you're looking for a romantic place to take a date I'd recommend here, as well as if you're looking for a local restaurant to bring your family from out of town."], ["Sonia M.", "I'm going to assume we just had a poor experience here the day we went but...service and food were both awful!! Loved the ambiance! I think it was a coincidence that what we ordered was not good and our waiter was inappropriately defensive. Servers, not caring for the way our food came out is not a personal insult to you!!, Anyhow, I'll definitely go again and hope for a nicer experience. I think it's a place worth dining at for sure!! Pretty romantic vibe for a date night!!"], ["John K.", "My standby Italian place in Topeka, although both food and service can be somewhat spotty.Some nights the wait staff bugs you by checking on you too much.  Other times, you can't find a waiter when you need one.  But love the Sinatra tunes, the quiet booths and a great place for a romantic dinner.The foods is usually good, sometimes excellent.  I wasn't that impressed with their pizzas, but their lasagna and baked mostecolli is tasty.   I usually order something not on their regular menu, which is linquine with pesto and topped with Italian sausage.  Some nights it is great, with fresh pesto, tasty olive oil and toasted pine nuts.  Other nights the pesto is swimming in oil, the basil not noticeable and the pine nuts either not present or processed into oblivion.Their salad is usually great, but I find their breadsticks a little to salty for my liking.  All in all, not a bad place, though  I haven't been to Olive Garden enough to compare (I detest chains and like to support the home-town places)."], ["Steve M.", "Not the best Italian restaurant that I have been to. Like one of the other reviewers had mentioned, this place is sort of like going to Olive Garden, but not as good as they are. To start with, their menu selection was great if you wanted to eat pasta or pizza. But if you are trying to eat light, and have a healthy meal, then you are going to have a tough time finding anything on the menu. The only non-pasta/pizza dish that was on the menu was the grilled Salmon which came with a side of vegetables. Since I wasn't very hungry, I went with the soup and salad combo. They had 2 soups on the menu, the special of the day which was the chicken tortellini soup, and the usual minestrone soup. I went with the minestrone soup which was tasty, but it seemed to be lacking something. I also felt that the salad was a little bland as well. The dressing just didn't seem to have that kick that I usually get from the other Italian restaurants. The service was good, we were greeted by the waiter when we sat down, he took our order, and the food arrived a short period later. Only complaint I had was that the waiter did not keep tabs on our table regularly, and I had to wait for him to come by so that I could get my cup refilled, or get a refill on my bowl of soup. Prices seemed a little high, but not too extreme. My soup and salad with a soda ran about $11. Overall, the place was good, but I would not put it at the top of my list if I were to go out for Italian again."], ["Kris S.", "The one word I think best describes Paisano's is consistent. I've eaten in both the Lawrence and Topeka locations and the food and service are always good but never great. But in this instance, it's fine because I don't expect much from the place. I consider it an independent version of Olive Garden.My chief complaint about the place is that they nickel and dime you when you split a meal and by forcing all at a table to chip in to cover the cost of the family-style salad, even if you really and truly won't be eating it."], ["Brian E.", "Good God.  I hate to say this, but Olive Garden has a better grasp on Italian food.Every dish that came to our table was smothered in cheese.  Just like in Italy...right, moron?"], ["Michael B.", "We ate Paisano's recently for a special occasion, and really came away somewhat ambivalent.The food was not bad. It was actually pretty good, but the service was poor at best. We ordered a bottle of wine, and when the server brought it to the table, it was in two glasses. I pointed out that we had ordered a bottle of wine, and the server's response was that 2 glasses is a bottle. I begged to differ, and she brought out an empty bottle and held up the wine glass and said, \"see, the wine glass is about half the size of the bottle. For the record the wine bottle was not the wine we ordered.After this exchange, the server sent another person to the table to drop off the check.I understand we are not at a 5 star restaurant, but most restaurants that are not out to screw the customer bring the bottle to the table, then pour it. I don't know if we got the wine we paid for, but it would be good practice to actually show the customer the bottle being opened and poured."], ["Sherri G.", "Very disappointing. Took a visitor from CA this weekend and her meal was burned. The waiter apologized and took it away. no replacement or attempt to remove the charge from our bill. When we spoke to the manager we mentioned the woman at the table next to ours ordered the same dish and her's looked completely different, like it should look.  he said he would go back to the kitchen and look at ours. That was the last we saw of him. Bad move, you just lost customers. We have too many other options and refuse to pay for bad food and unconcerned management again."], ["Jim O.", "Great local operated Italian.  Monday is all you can eat pasta for $9.99.  Includes bottomless salad and breadsticks."], ["John R.", "I am not a huge Italian fan, but the atmosphere was nice.  The food was good and the staff was courteous and on top of everything."], ["Precious P.", "Always good food and service! I get the pesto every visit! It's so good. This is my place for Italian."], ["Lydia L.", "Everything was excellent, their salads are first rate, and their freshly baked bread sticks are the best I've ever eaten, EXCEPT: we ordered the calamari fritta appetizer and it was some kind of faux calamari, not the real thing, not even shaped like the real thing and it wasn't crispy. This needs to be re-thought."], ["Gary S.", "I recently discovered this restaurant while in Topeka on business.  It is some of the best I have had.  If manners weren't important the guests would lick the bowls. Yum, yum one of my favorites!!"], ["Matthew A.", "Excellent meal had on New Year's day. The place was dead as would be expected on this day, except for our group and another large group. Everyone's food was very good. Mine was excellent. I had a baked Mostacolli which was probably the best i have ever had, though it could use a little more seasoning. My wife had asiago and spinach ravioli, which she said was very good as well. Paisano's provides large dinner salads for your table to share as well as unlimited breadsticks. Both of these are excellent. The house wine was not very good, I should have had a nicer variety. The service was excellent. If I am in Topeka again and want Italian, i will certainly consider Paisano's."]], "Olive Garden Italian Restaurant": [], "Pizza Hut": [], "AJ's NY Pizzeria": [], "Domino's Pizza": [], "Via's Pizza and More": [], "Godfather's Pizza": [["Mikelle H.", "Best pizza ever!  Been going/eating to/at the North Topeka location since my preteen years. They are very fast and very friendly. All their crust are delish!"], ["Natalie C.", "Had a great experience today at Godfathers pizza. We stopped here on our way from Kansas City to Oklahoma City. The pizza was a little over priced but the service was amazing. The lady there saw my kids were very cranky from a long day at a water park and not only brought them some pineapple over but also made them some cinnamon rolls. That helped a little bit. The pizza, though as I said was a little high, did taste amazing. We would def stop by again."]]}