{"Old Chicago": [], "Olive Garden Italian Restaurant": [["Kay D.", "I love the Olive Garden and I met friends there to celebrate a birthday on Friday evening.  The food and ambience were good as you would expect but I want to especially point out that our server, Chris, was outstanding!!!  He was friendly and service was exemplary.  He went above and beyond when discovering we were there for a birthday celebration.  He also hit that perfect note of being attentive without making you wish he would quit dropping by!  He was always there with perfect service and timing.  Everything was wonderful but his service made it just that much better!!!!  Bravo Chris!!!  I hope that The Olive Garden realizes what a gem you are!!!"], ["SreeKanth V.", "It was pretty rush in the afternoon when we went for a lunch and everything was cheesy... I had a soup which can fill up your appetite and you can take away the main course... worst part on our visit was two waitress were fighting in front of us... overall service was good"], ["Brooke S.", "Growing up in a small town outside of Topeka, the Olive Garden was a place we ate at for many special occasions over the years - birthdays, Fathers Day, Mothers Day, etc. I no longer live in Kansas, but after a visit to my parents house for Christmas, we stopped in for a Saturday lunch. This place still delivers solid service and food. You just can't go wrong with the unlimited soup, salad and breadstick lunch. And their raspberry lemonade...all that sugar, but so darn good!I'm not usually one for 'chain' restaurants, but this place is always a good choice!"], ["Juan C.", "Ate here for dinner tonight and the food was great like always but I was most impressed by the service. Our waitress Mia C. was outstanding, quick and always there when we needed anything. Her attention to her customers and customer service was above and beyond, I haven't seen great service in a while. Thank you."], ["Grant E.", "The service here has always been very good. It's the food vs price issue. At $16-19 a plate for pasta, we can eat at a nice steakhouse for the same price. It's pao du paying close to $100 for a family of 5 for a meal that isn't all much better than Fazolis."], ["Ahmad J.", "I've been to Olive Garden at a couple of locations and have got accustomed to the taste of americanized Italian food served here. I had the Braised Beef & Tortelloni - the beef was excellent, absolutely melt in the mouth and Tortelloni nice and taught.Server was fast and friendly but the chairs were too uncomfortable for my linking so my advise is to ask for a booth here!!!"], ["Laurie W.", "Do not go here if you are looking to eat or must eat gluten free! They do have a gluten free menu, with no prices, but it has lots of info on it that would take a week to process! Even ordering the unlimited soup and salad I was limited to just salad, because all 3 soup choices had flour in them."], ["April B.", "Yuck. Just....yuck. Haven't been to an Olive Garden in 20 some odd years and this was a nice reminder as to why. The food tastes like someone opened up a frozen dinner and threw it in the microwave. The only reason we ate here is because we were in town for a funeral and it was a good meeting point for the family."], ["Michael R.", "Its Olive Garden.  Odds are you know what Olive Garden is anyways.  Obviously, not true Italian, but it is good for what it is.Went there for lunch today and went with the salad, breadsticks, and soup combo.  Not a bad combination for $7.  The salad and breadsticks were good.  A little tougher to find a decent soup when its 90 outside though, but mine was okay.  The place was quite crowded although my party showed up after 12:30.  No complaints about the service.Probably not a place I would go to often, but it is a nice change of pace though for me."], ["Steve M.", "I am on the road most of the year, and Olive Garden has become my monday lunch ritual.  The food is consistent with all the other locations,  the prices are decent, and the portions are just right.This place is more of an americanized italian restaurant.  They have a great all you can eat soup and salad deal for about $7.  Also their breadsticks are always hot and they are to die for."], ["Jon S.", "As chain restaurants go, Olive Garden is tops.  Food quality is consistently good and hot. Can't beat the soup, salad and bread stick meal!  Service is good and friendly. Never had a bad experience at the Topeka OG!"], ["Alex B.", "I was a bit annoyed by the ridiculous traffic pattern that one has to navigate in order to get to the restaurant.  But that's not their fault.  The wait staff couldn't have been nicer or more prompt. The food however...   I had a beef dish.. who knows what it is called, four decent-sized pieces of beef, but in a sea of salted rice and cheap beef stock.  My wife's chicken dish was just as salty.  Some dweeb in the corporate kitchen invents fake Italian dishes and the line chefs have to make the best of it."], ["Jon K.", "Great salad and breadsticks. Good portion sizes."], ["Michael B.", "This Olive Garden is one of the better stores in the chain. Our food consistently comes out right. Some servers are better than others, but for the most part the service is good.  My favorites are the soup and salad deal, with plenty of the Tuscan Potato soup. As an entree we generally like the chicken dishes, There is one with chicken in a lemon sauce that is wonderful."], ["Mw C.", "I went there last year. I love the food. The manager kept asking how is everything. The server did not bring the wine fast enough and it was room temperature. I think the server could have done a better job. The soup and salad were good."]], "Aladdin Cafe": [], "Pita Pit": [], "The Mad Greek": [["Gage W.", "Me and 2 of my friends were dying of hunger and decided to take on the town to find some grub. We drove the entirety of the city of Lawrence and then found ourselves walking up and down Massachusetts street. We got to the point where we didn't care what we were gonna eat but we just needed something and needed soon. The closest restaurant to us at that point was The Mad Greek. My friend said screw it and just walked towards the entrance and we followed. We walked in and saw an empty restaurant confused I walked back outside to make sure they were open. They were in fact and we were seated immediately. Our server was very professional, she greeted us very warmly and asked what we would like to eat and drink. She was very informative of the menu and even helped us edit our orders to our pleasing. Our food was prepared very fast which was great considering our hunger. My salad was decently good and would have been better but I forgot to ask for no onions. My friends food looked great and they both enjoyed their meals tremendously. My friend complimented the ravioli saying it was some of the best he's had. The scenery of the restaurant was great but was somewhat gloomy and we could over hear the table next to us in a argument and one of the individuals was crying. This was the only bad part of our meal but it's clearly not the restaurants fault. Over all it was a great adventure that I thought I should share."], ["Rick S.", "I reserve one star ratings for fast food quality and abhorrent service. That said, I found it difficult to not go below two stars because I think the quality of food at The Mad Greek has deteriorated nearly to fast food level. I used to love this place. It was where I took guests and dates for a unique dinner in Lawrence. Though the service is average (meaning I have no opinion one way or the other because nothing stood out), I remember when they took much more pride in their food. Sadly, it's clear that they have stopped taking pride in what they serve a long time ago. I took a friend there after taking a break from eating there for over a year to give them a chance to improve. I found it has only worsened. My food was served slopped onto my plate with half of my meat and half of my green beans buried in rice school lunch style. The food was lukewarm, at best. My sliced tomato was so unripened that it was still mostly white, tough, and tasted like paper. I didn't bother finishing it. How does a restaurant in a town like Lawrence with such a great farmer's market right down the street allow that to happen?The gyros dinner, one of their signature plates, came with a few small cut pieces of pita (not nearly enough for the gyro meat). The meat itself tasted old; it looked more boiled than roasted and had about the same flavor. Their infamous green tomato beans came with almost no sauce as it used to and I found myself wondering if they're still made the same way. That may have been the liquid that ran over my plate saturating my gyro meat, pita bread, and an already questionable rice pilaf.The bright side was the toasted ravioli appetizer, which I thought was good but was served without plates for two people--so no way to keep from sharing the dipping marinara which probably matters to some people. This place desperately needs a defibrillation to either get their menu and kitchen working again or start anew. They are surviving on name alone and something tells me that, soon, even their name and history won't carry them anymore. For me, the restaurant I once loved is already gone. I won't be returning."], ["Stephanie C.", "This place is amazing!  I come here every time I visit Lawrence and it never disappoints!  Great food-hot feta is my fav, fried ravioli, spinach pie, gyros to die for.  Check it out!  Plan a trip!!"], ["Erin T.", "Some plain Jane Greek food nothing special at all, no one is trying hard on these plain Greek staples. Bread was fresh. Salad was edible. The fettuccine meal tasted like canned sauce :(..."], ["Elizabeth S.", "Went for an early dinner on a Saturday night. My partner and I split the saganaki and both ordered the gyros dinner. I had a gin martini and my partner had a beer.The service was good. We were seated right away and promptly got our waters. The waiter seemed knowledgeable enough and was able to tell me that a Greek margarita has uzo and blue curacao in it (no thanks). The saganaki came out quickly and was pretty good. However, it was served with a ton of pita bread which is not something I've ever seen before.The gyros dinners also came out quickly and were just okay. The gyros meat tasted like the standard food service quality gyros. The tzatziki sauce was flavorful and fresh and the pita bread had a nice warm chewy but airy flavor. However, the rice pilaf was terrible and tasted like a store bought boxed mix with some dried cranberries tossed in. Equally baffling was the inclusion of canned green beans and one boiled potato slathered in watery tomato sauce. The sauce sort of ran all over the plate and made the pita bread very soggy. I had hoped for some feta cheese and kalamata olives but those were nowhere to be found.  Overall this place was just okay. It looks like they have a pretty great happy hour which I'd be willing to come back and try but go somewhere else for dinner."], ["Addison S.", "This was so disappointing. I've been here multiple times and absolutely loved it but this time was awful. First off, yes I'm young (18). Sometimes waiters and people in stores treat me weird because of my age because they either think I'm stealing or won't tip well which isn't the case. Well I went in with my friend and her little sister (12) and her sisters friends. Our waiter was Cris (yeah I'm calling you out). They sat us in a tiny booth causing us to all have to squeeze in. When he came to ask for our drinks all I said was \"water\" and he goes \"Ok so 5 waters\" assuming we were all getting waters (the other girls wanted sprites so we had to re order when he came back) then he quickly rushed us when we were trying to order. (It wasn't even that busy but apparently he wanted us out of there) Finally he brought our food pretty quickly but we had no meatballs in any of our \"spaghetti and meatballs\" we ordered. We then said \"do you mind bringing a bowl of meatballs\" and he goes \"why didn't you order that when I was taking your orders\" and I just firmly replied \"we did.\" That got his attention and the service for the rest of the time was sub par. I love this place but Cris, honey, you need an attitude check and a Xanax."], ["Grant E.", "The food is superb. The dilemma is what to order.  The gyros are a must. Tender and seasoned perfectly.  As is the manicotti.  And lasagna.If you eat there on Sunday, get here between 11 and 1 for the Buffett. It's $11 and completely worth it."], ["Ann W.", "I have been a somewhat infrequent customer at this restaurant since the late 80s when it first opened. By now, it's pretty much a Lawrence institution.The food is pretty decent and reasonably priced, but I have never dined here and been amazed. Most recently, I was here with some family for the Sunday brunch buffet and it was pretty much ok just like I expected it to be, but nothing blew me away. Service was a tad slow for the buffet as well with very slow refills on water and ice tea. I guess I had forgotten what an awkward and cramped space this restaurant has, but just getting in and out with wait staff and other patrons clogging up the aisles was amusing. The booths are tiny as well, so if you have four people crammed into a booth, you might be elbowing the person sitting next to you."], ["Adrian L.", "Good for lamb, reasonable prices. Can do gluten free."], ["Nick V.", "No good. I have been in Lawrence for business a lot lately and this is hands down the worst meal I have had in lawrence yet. Ordered a Greek salad with souvlaki. The souvlaki was raw. I like my pork medium but this was rare. They tried to make it right by taking a couple bucks off the check and replacing the souvlak with grilled chicken which was nice. Salad itself was not worth anywhere near $11. The only reason I can give I two stars is how nice and attentive the waitress was."], ["Ken D.", "Stopped by tonight, Sunday, around 8:30 for dinner. Stood in front of the host podium for an awkward four or five minutes while the guy behind the beverage station eyeballed us weirdly. No host in sight, only two people in the whole place eating. Never acknowledged, won't be back. Sorry for trying to inconvenience you so close to quitting time. Keep forgetting I live in Kansas now, where mediocre performance by employees is accepted."], ["Paul G.", "I love the food and atmosphere. Come for lunch or dinner you won't be disappointed.Went back today expecting another Great expecting!!!!The food may still be good. Only one other customer and after seating us I gave up waiting on a waitress and we left!!!Isn't service important anymore."], ["Ray M.", "Best Greek in the area for me...Sunday buffet is just the best.  I haven't had a bad meal in the dozen times I've been."], ["Charles R.", "Great. I could eat the vegetarian dinner for any meal every day. The complaints about the restaurant being cramped because it's in an old building only demonstrate that many Yelpers just look for things to complain about. Go to Applebee's if you need wide-load seating."], ["Andrea S.", "Just visited the Mad Greek for the first in in ages. I remember having had some excellent meals here in the past so I was surprised with a so-so dinner tonight. Gyros, pita and tzatziki were all decent. Spanakopita and dolmas were mediocre, at best. The green beans and rice pilaf were some kind of awful. Nothing really tasted fresh. Something about the service left me feeling that we were a distraction to the wait staff. I wouldn't rule out trying them again but, with plenty of other options on Mass, I doubt it."], ["Brianne L.", "I've only been here a few times.But I REALLY love the octopus salad. And their bread is always on point. I'm not a fan of the gyro-meat stuff, but I haven't come across a dish I've ordered or my friends have ordered that I didn't like. I'll definitely be returning. Great salad dressing, too!"], ["Ryan F.", "This is a neat little place. The decor was fun and authentic. The food was decent, though a little on the skimpy side for the price. The appetizers were the highlight of our meal. The Saganaki was really good though the skant serving of pita bread was disappointing. The moussaka and dolmades were homemade and very good too. The staff was not very welcoming and seemed more interested in standing around and talking to each other than taking care of customers."], ["Lexey J.", "I really love the Mad Greek. I'm a huge fan of the flavors in Greek food and the restaurant seems to have a nice authentic feel to it, regardless of whether or not it is actually in fact authentic. However, the family that owns it appears to be from Greece, so I have no reason to doubt them.First, the atmosphere is really cool. The high ceilings and darkish wall mural, along with the many planters and other Greco-Roman statues and architecture give the feeling of eating outside in a garden at dusk. It sometimes seems a little dark, especially at the back of the restaurant, but I've never felt it to be unpleasant.The food is also very good, and the prices match the portions well. I typically get the falafel, which is always fantastic. They give you plenty of tzatziki for the gyros, and they seem to have a rotating assortment of sides that come with the entrees. It's often some variation/combination of green beans, a small salad, jasmine rice, new potatoes, etc.They also have an excellent assortment of desserts that, if you're interested, they'll bring out on a huge, delicious-looking tray. My favorite is the tiramisu. :)"], ["Brent K.", "I am a huge fan of this Lawrence icon.  The greenbeans are what you'd eat in greece.  the grilled chicken is divine.  the service has always been fantastic, family oriented, great menu options, delicious deserts and won't break the bank.  sunday's buffet at 10 bucks is about as good as it gets for the money."], ["Claudia S.", "It was a busy Saturday lunch hour when we visited... service was fast, although the server for the table next to us kept sticking her butt in our faces as she waited on her table. I have a big butt too, but at least I have big butt awareness and try not to stick it into people's faces as I'm navigating around tables, especially if I'm bending over to do something. Her butt almost caused my mom to jab her fork into her face at one time she had it so close to my mom's face...wowzer.Anyway, I got Gyro Lunch Plate and mom got Spinach Ravioli Special. She enjoyed salad, but was truly, truly disappointed to find the ravioli were icky looking frozen ravioli out of a bag she could have bought at any grocery store. I'm not even sure they were boiled, but maybe microwaved because they were all dry around the edges. She probably should have refused them, but our server never came back. We never got refills on our drinks...she finally gave me the check after I sat there waving her down. I stood up for a second to pay the check and went back to drink a bit more of my melted ice in my empty glass and they already bussed the table. I told him that I was still sitting there and he said \"Oh, I didn't know\" and kept bussing the table and took my \"drink\" even after I told him 2 or 3 times that I still wanted to sit there and was going to DRINK THAT. By then the lunch rush was dwindling so he didn't need to rush that much.I finally yelled enough that the cashier came over to offer to get me a new drink, but by then I was so mad we just left.My Gyro was good, but not so good I'll EVER go back here. I can get something just as good at many other places around Kansas City. BOO"], ["Jeremy C.", "From my kids - Very good and yummy Greek Food.  They give you ice cream at the end.  The service is quick and kind.  The servers are nice.  From me - Excellent food.  Reasonably prices.  Good portions.  Great place to introduce children to Greek food.  We have visited there several times and the kids still request to go back."], ["Reed N.", "This place barely gets 3-stars... and it gets them due to service. Out service was friendly and excellent.We went for the lunch buffet on Sunday as we were indecisive. The buffet had gyro meats (lamb/beef and chicken). Neither were spiced very well nor were they appetizing in texture. The triangles of pita were cold..The salad and dressing were fine, but nothing special.The green beans, tomato sauce, and potatoes were better. Along with the eggs and the regular potatoes they were the best things on the buffet.The lasagna was actually okay as well.The real disappointment for me was that the Greek selections were the worst items. Just strange."], ["Diana K.", "Excellent food great ambiance, service was fantastic"], ["Judy R.", "The food is excellent . The service at noon is good.  We went back today for a late lunch and it was as if we were invisible."], ["SectionZ F.", "Average tasting everything, except tiramisu which was a 10/10, gnats bugging us throughout dinner, waiter wasn't clearing the table...not much else to say."], ["Hi T.", "Best gyros in the area, including KC.  Fantastic menu and very friendly staff.  Sunday brunch is excellent!  One of my favorite spots on Mass."], ["Kayla H.", "Food was really good...lots of olive oil goodness! The eggplant fritta and the spanakopita were particularly yummy. Our server was friendly, but a little slow with drinks. We were visiting from out of town and everyone in the party liked the atmosphere and the food. I was personally surprised to find an authentic Greek place in Kansas."], ["Michael A.", "My wife and I live in KC and every time we go to Lawrence we always have to eat at the Mad Greek. We love it.My favorite dishes are the falafel sandwich and the vegetarian spaghetti, which is spaghetti with mushrooms and green bell peppers on it. And we love their toasted cheese ravioli appetizer. Fantastic! The only thing keeping me from giving this place five stars is the lousy service we experience every time. Each time we've gone we've gotten the same cranky waitress who always has a terrible attitude. The rest of the staff seem friendly but for some reason we only ever get her--always rude, always frowning. It's not the end of the world but it certainly puts a damper on the whole experience.Anyway, the food is always superb and is the thing that keeps us coming back."], ["Mackenzie C.", "My friend and I recently visited the Mad Greek for a late lunch. When we finally got service, it was still slow, but the waitress was very sweet. The calamari appetizer was excellent. I ordered the lamb and was slightly disappointed. It was very dry and I had to soak it in the sauce it came with. I was also slightly upset by the charge for a side of olives (I expected to pay, but not that much). The martinis were decent. I ordered baklava for dessert, which was very good. Overall I don't think my meal was worth what I paid. If you're a big fan of Greek I'd recommend this place; if not, maybe skip this one."], ["Paul F.", "Good food and atmosphere! Though the bathroom may need some love, sitting on the toilet I shifted and the whole thing moved. Then when I grabbed some toilet paper the front of dispenser came off at me. I felt like I was discovering I was super-powered in a bathroom like those scenes in X-men Origins: Wolverine and the Amazing Spider-man. Sadly, I discovered upon further investigation this was not the case. The faucet in there was kind of neat too."], ["Chris S.", "The Mad Greek ... Good Greek Cuisine, Moderate PricesMad Greek Restaurant907 MassachusettsLawrence, KS 66044madgreekrestaurantlawren…Phone: 785-843-2441If you like arsenic poisoning, you will love the Mad Greek in downtown Lawrence! Seriously, this restaurant is actually pretty good and reasonably priced. The reason I made that comment is because they seem to serve rice and green beans with EVERY dish and rice has been linked to high arsenic content with recommendations, according to OneGreenPlanet.org and others, to limit rice consumption to once a week among other precautions.On our first visit to The Mad Greek, my wife ordered the spinach pie ($7.99), spinach and feta cheese with herbs baked in a light phyllo dough with tzatziki (a creamy cucumber sauce used extensively in Grecian cooking) and fresh pita bread. The spinach pies were light and flaky with a perfect ratio of filling to crust. For the price, I would think a salad would be included, but you must pay $1.99 to add a Greek salad ($1.59 for \"house\" salad) to any entrée. My wife and I both ordered a Greek salad with our meals and at $1.99 extra, not a bad deal considering the quality. Fresh romaine lettuce, tomato, Greek Calamata olives, and crumbled feta cheese in a Greek olive oil and vinegar dressing. I would prefer chunks of feta over the fine crumbles, but the taste is the same either way...very good.Greek \"Side\" SaladI ordered the gyros platter, a reasonable ($9.99 - not abundant) amount of sliced gyro meat (a combination of seasoned beef and lamb), pita bread, tzatziki, green beans, and rice (of course). The gyro meat was fresh and tasty, and the tzatziki delicious, but the pita bread was a little too soft for my taste. The green beans were simmered in a tomato sauce and were \"OK\" and the rice was similarly boring, but I am not a huge rice lover. I ordered a side of french fries ($2.99), which were hot and crunchy just the way I like them, but I will probably ask to substitute fries for the rice and green beans on our next visit.On our second visit it was my wife's birthday, so I ordered the \"flaming\" saganaki, a slab of fresh Greek goat cheese soaked in batter, deep fried, and served in a flaming extravaganza table side. The \"oohs\" and \"aahs\" of fellow customers followed the lighting of the cheese, but at $7.99 the dish was overpriced by AT LEAST $2.00 in my opinion, coming with one slice of pita bread (cut into six pieces). The birthday girl ordered the moussaka, one of her staples (along with Greek salad) during our month-long visit to Greece in 2005. The moussaka - eggplant, ground beef and other ingredients covered with a béchamel sauce and baked - looked as though it had been sitting for a while and the serving was small, a cube no more than two and a half inches in diameter and at $9.99, about one quarter of the size of servings we received in Greece. The moussaka came with pita bread, rice and green beans, so my wife substituted french fries at no additional charge. She did not like it and I thought it was very \"average\", being overpriced for the serving size.I decided to try one of the Italian offerings, so I ordered the cannelloni Florentine, pasta tubes stuffed with veal, spinach and seasonings then baked after being covered with alfredo (white) and red sauce. The cannelloni was actually pretty good, but the sauces were both rather boring, most likely coming from a can or jar, not homemade. Again, we had to pay $1.99 each to add a Greek salad and mine came with two small pieces of garlic bread ($9.99 for pasta and bread, $11.98 including the salad, not bad, but NOT A GREAT VALUE).Wine is reasonable at $3.50 per glass for the house wine, a tasty, inexpensive burgundy that went well with both meals. They have a full bar and prices seem fairly reasonable with a decent selection of drafts at $3.99 to $4.59 (stout). Water is served wit a lemon slice, but I had to ask for refills, something that should not have happened considering the small number of customers that night.The Mad Greek has original Greek recipes and decent food, but the value for the price is questionable. Ordering \"ala carte\" should be reserved for restaurants with cloth napkins and severs who take your payment rather than making customers stand in line to pay our bills (as is the case at The Mad Greek). I would recommend including a Greek salad with entrees and maybe increasing the price by fifty cents to a dollar to offset the cost and having servers handle payments as is done in even the cheapest sit-down restaurants these days. People should feel as if they are receiving a \"good value\" for their money and NOT feel like we are eating at McDonalds after having spent $25 each for dinner.CombatCritic gives The Mad Greek 6 Bombs Out of 10 ... Bombs Are Good! Key Words: mad, Greek, Greece, restaurant, gyros, moussaka, mousaka, phyllo, pita, bread, souvlaki, tzatziki, hummus, food, eat, wine, beer, CombatCritic, L"], ["Kim H.", "The rice was horrible. Trust me go down the street to Aladdin's or try the gyros at the Lebanese flower (also down the street) They use real rice not the microwaveable ones.K"], ["Megan C.", "My 8 year old son likes the Sunday buffet. Plenty of choices for the entire family. Gyro is good. Great service."], ["Ron B.", "First time here. My wife and I did the Sunday Buffett. Best Greek food I've had in awhile! Egg and lasagna or do you call it moussaka was really different. Had to go back for seconds on those.  We had 3 different deserts at our table. All were amazing! It'll definitely be in our rotation now for Sunday brunch!!"], ["Joan W.", "Stopped in to The Mad Greek as we were strolling down the street and we found a winner!  We were seated immediately and our server (Peter)  was friendly,  informational,  and accommodating.  My husband and I both had Greek food,  starting with falafal with tzatzíki sauce then he had the Gyro and fries and I had the Garlic and Olive oil pasta with feta and grilled tomatoes.  We are Greek food  nuts and found this place to be above and beyond... both in food and service.  Next time we are in the area  we look forward to trying  some of the Italian options as well.  Definitely in our top 10 in Lawrence!"], ["Lab L.", "We make the drive over to Lawrence for the Mad Greek!!Hummus and pita is a great way to start out.  They will continue to refill the pita for a small charge.The Gyro sandwich and fries are perfect!!We had a large group last time and our table was waiting for us.  They even let us go ahead and sit down early and get the apps going...before the rest showed up.We are fans....and will continue to drive over from Topeka when we get the craving for Greek!"], ["Katrina R.", "I love The Mad Greek. Really, I love it. It has been my favorite restaurant in Lawrence for around 20 years now (possibly as long as they've been opened, definitely for as long as I can remember) and my parents love that I love this place because the prices are completely great.I always order the spaghetti with meatballs. No, it is not going to be your mom's Italian. Yes, I know this is a Greek place. Don't ask me why, I really just love their spaghetti here. But that's not to say that's the only thing I've ever eaten here. I've strayed from the path a few times. I like their Gyros. I'm sure I've tried other stuff but between spaghetti and gyros I'm set on main course.But, the appetizers! Babaganoj is an easy pick, it's tangy, healthy, and delicious. But, the Saganaki is my most favorite appetizer ever-- and the Mad Greek always dresses it up with a big flame and a holler of \"OPA!\". Color me loves it. And yeah, the inside is kitschy but I totally love it. They even changed their very classic wooden divider-thing into these completely grotesque white columns, and I am way into it. The Mad Greek embraces what it is wholeheartedly, and I love that about this place.So yeah, I know there's Teller's and Pachamama's and everyone in Lawrence has some weird cultish following of Zen Zero-- but I will take Mad Greek over any of those joints any day."], ["Ty O.", "The atmosphere at the Mad Greek was nice enough. It felt clean and, though not super swanky, made a good effort to help it seem a touch nicer than average. The service was unfortunately poor, making the dining experience rather unpleasant. The waitress vacillated between impatiently hovering and weekend-dad inattentive. Getting the check or a water refill should not have been so difficult.The food was slightly below average. Of all the Greek and pseudo-Greek food I've had, this was definitely in the bottom half. Nothing was especially remarkable but rather dry and surprisingly plain. They put a more effort in than a food court gyro place, but it still fell short, especially for the price.It certainly wasn't the worst food I've had but the dining experience itself significantly lessened the experience.Review: 2 stars."], ["Natalie W.", "I haf never been to Lawrence before and my friend and I decided to go today. We were just walking down Massachusetts and came upon mad greek. We decided it sound good and it looked nice...well you definitely DO NOT get your moneys worth. I spent $11 on one piece of lasagna which wasnt any better than Fazolis. My frind spent I think $9-10 on like 10 pieces of ravioli. Placed looked nice until they gave you your food on a plastic plate that looked like it should bebused at ihop. I wouldnt go back again."], ["Gaz H.", "Very friendly servers. Nice dining room. Just one problem: the food for the dinner service is powerfully mediocre. At best. Bo knows Greek food and this kitchen has some significant shortcomings. The taste of the gyros is all wrong. Also, in the one area where Greek restaurants always distinguish themselves the Mad Greek is sorely lacking: roasted meats. The (pork) souvlaki was comprised of some horrifically poor cuts, prepared inexpertly. Side dish of green beans and potatoes was blandsville, population you. There was no redemption in old favorites, either: the moussaka was also bland and completely forgettable. The rice was an abortive mixture of cranberries and other such non-Greek additions. Not to say that nothing they serve is good; the pita and the tdzadsiki (sp?) were just fine. As was the baklava (it's imported from Chicago - they don't make it). I've had a spinach pie there before and it was just fine as well. But. So. Many. Things. Just. Suck. It's unforgivable. Overall, the kitchen powerfully disappoints. And the service was slow. And the servings were small. And the place is overpriced. Too bad, so sad."]], "Mediterranean Market & Cafe": [["Will M.", "A perfect gyro: succulent meat, perfectly crunchy toasted pita bread, and delicious tangy tzatziki sauce. It's the best in Lawrence, and it's worth the trip."], ["Ben M.", "I buy several specialty items in their market area less expensive than online and have never been disappointed with any of them.  I especially love the Marco Polo sour cherry preserves..  I have only eaten there once and the soup was excellent.  The staff is also very helpful and nice."], ["Alexandra O.", "This unassuming little gem is tucked into a small strip mall. I spent just as much time looking around the wide selection of Middle and Near Eastern and European goods for sale as I did eating my lunch. I had a great lamb and beef gyro with a small side of hummus and a perfectly sized side salad. The ingredients all tasted fresh, the meat was perfectly seasoned and roasted and the pita was warm and soft. This is a great meal for a good price ($10). Lawrence is lucky to have such an awesome Mediterranean market. They have great prices on nuts, especially in addition to a great selection of cheeses and dry food goods. The staff is very friendly as well. I will definitely be eating here again."], ["Fred W.", "One of our family favorites - the pita bread is amazing and will spoil you for other pita breads. The hot feta dip, lamb shawarma, and hummus are all delicious. Take out is fast and courteous."], ["Jessica H.", "Gyros and falafel are great! Friendly staff as well."], ["Scott T.", "Have never eaten here but have made more meals from products purchased from the market than I could possibly count.Note to starving college students: the large bags of basmati rice coming in just over $1 per lb. in the largest bags are a sure way to stay fed on the cheap, and it's hands down the best rice in town in my opinion, priced far less than the Community Merc. Love ya Merc, but your rice at twice the price isn't in the same league. Also a must: the large olive oils in the can. Yea, I know what you're thinking, but again, the quality here is unparalleled in Lawrence. Better than the Merc at multiples over in pricing. Easy decision. Buy bulk, save a ton of money.Other quality staples purchased regularly:Pine Nuts - top notch quality and best price in town.DatesOlives - great selection in bulkCanned Sardines - best in town in my opinionPecorino Romano - again, a surprising option for this store, terrific quality.... and much more. Love this place. The owner is friendly and the service is good, prices reasonable. Lots of interesting food options and spices you aren't going to find elsewhere in town make this a must destination for food shoppers."], ["Teresa G.", "I've been here a few times to eat and buy groceries (olives & pepperoncini, tabbouleh, tzaziki, pita, green cardamom). The food is good, service is friendly, and the green olives stuffed with garlic are better than whatever else I've bought around town. I think the menu prices are a little steep compared to NY (or, NYC for people who call it that), but this place is the only one around in what I consider a relatively barren culinary desert, so there's that. The brand selection for tahini and other groceries is so much better than any of the more general grocery stores -- to be expected."], ["H C.", "I think the stuffed grape leaves are the yummiest thing you can eat in Lawrence!  And the hummus is beautiful too.  Sure, the ambiance is off - it is a strip mall - but heck, these guys can cook!  Once I went in to buy groceries.  I told the owner what I was planning on making.  He was so worried that I would get the flavor profile wrong, he mixed some up himself and sent me home with it.  I loved it!"], ["Charity T.", "This was my first time eating chicken shawarma and I loved it! Will definitely eat here again and recommend it to people."], ["Paul G.", "I go to this restaurant when I come to Lawrence. Been coming for years and never been disappointed. Good food plus a Mediterranean market like you find nowhere else in Kansas. I always get the spinach pie vegetarian  combination, love the hummus and pita bread. More varieties of olives than I knew existed. You won't believe how many different varieties of things they have from the middle eastern countries"], ["Christina J.", "This place is great! Especially for lunch. I've shown it to many of my friends over the years. Love the food and the little store has nice teas and a large selection of olives. It's not much to look at, so I usually do carry out. Best felafel in town! Lots of vegetarian options, too!"], ["Shibli N.", "The most authentic middle eastern cuisine. I always go for the lamb swarmah with hot sauce. All their food is a reminder of the cuisine I grew up with and is excellent. Their select market has really good olives and cheeses and some.....Too bad I am back in Dallas but be back first place to eat when visiting in march. That' s a given. Wonderful hospitality."], ["Judy R.", "The spinach pie tastes better each time I taste it! The humus can be purchased on site or at The Merc or checkers !"], ["Karen C.", "The food is tasty here, but not the feed middle eastern in town. The baba ganoush was smoky and delicious, but the falafel was spongy and cakey. The dolmas were expensive to come from a can. The red lentil soup was very delicious, but again, very expensive. The ambiance is lacking, but not much can be expected, as the cafe is inside the store. Our dinner for two came out to fifty bucks. That was one entree, two appetizers, two soups and one drink.  In my opinion, Aladdin's cafe is more delicious, and better priced!"], ["Tara M.", "Tried this place after reading reviews and was not disappointed. The hummus is delicious and the pita fresh and warm. I had the spinach pie; it has the perfect balance of flaky and moist, go for it!"], ["Clarice W.", "This place is off the beaten path but totally hits the spot when you're craving street food. Don't expect anything fancy or exciting, you get standard Mediterranean fare here: gyros, moussaka, falafel, and shawarma, and it's all served on paper Dixie plates. Love it. Their sandwiches are reasonably priced (5.99) but a little on the small side if you have a bigger appetite than me. The falafel wasn't quite as crisp and similarly the shawarma wasn't as rich or juicy as it could've been, but this is not exactly a restaurant with a shawarma spit in the window and a full-time cooking staff so you can't expect that level of freshness. It did the job well enough for me, and still tastes A-ok when folded in with warm, delicate pita and tahini. It makes me sad that so few people seem to know about this place - try it!! It's a nice little find in Lawrence."], ["Nicole M.", "You wouldn't think one of the best gyros ever would be found in an unassuming strip mall. Their market has a wide variety of Middle Eastern food and their lamb and beef gyro is incredible."], ["Scott S.", "Mediterranean Market is a good, solid option for Middle Eastern food in a casual setting."], ["Crystal L.", "When I lived in Lawrence, I loved going to this place.  I bought the tzaziki sauce by the pint and ate it with their homemade pita and gyros.  Their moussaka is to die for.  Flavorful, savory layers of of eggplant and ground lamb folded with a delicious tomato sauce and finally covered with a blanket of cinnamon spiced bechamel sauce.  My sister and I would frequent this place often when we went on a culinary adventure to the Middle East in our kitchen.  We would find everything we needed to make our own moussaka, our version of adas polo, our endeavor to make dolmadas, and our awesome rendition of baklava."], ["Barbara T.", "The Mediterranean Market's variety of grocery items alone is pretty nice, however it's their cafe food that I want to comment on.  We had the lunch gyros combo.  It comes with gyros sandwich, side salad,  pita and hummus.  I did not have high expectations as it has a deli atmosphere, and the food was presented on paper plates and plastic silverware.  However when I tasted the food, I was extremely surprised and delighted.  The gyros meat was the best I've ever had.  It is more flavorful and tender as well as thicker cut than most places.  The pita was soft and the hummus had  what I would guess is a more authentic flavor than what I've had before, because you could actually taste the tahini in it.  The people working in the store were some of the friendliest and most helpful I've encountered in an ethnic grocery.  We will definitely visit again!"], ["Joe W.", "Best Mediterranean food in town.  Nice place to stop in and get a meal to go. Hummus is great.  Also, pick up your goat cheese here, less expensive than the grocery stores."]]}