{"Carlos O'kelly's Mexican Cafe": [], "El Mezcal Restaurant": [], "Oscar's": [], "Las Fuentes Authentic Mexican Restaurant": [], "Margarita's Jalisco": [], "El Centenario": [], "Tacos El Mexicano": [], "NOTO Burrito": [], "Tequila's Mexican Restaurant & Bar": [], "Casa Authentic Mexican Food": [], "Los Charros": [], "El Mezcal III": [["SreeKanth V.", "Never thought a Mexican restaurant with such a environment existed in my place. It has TV and bar inside the restaurant and lot of Mexican varieties to choose from. service was good and all the waiters do speak Spanish... Quantity of food is good and they need to work on taste that Mexican usually have..."], ["Amanda I.", "Had tacos de carne asada which were filled with meat. Must get a side of shredded white cheese.  Request rice over beans.  The house margaritas are ok, a bit on the sour side but willing to give them a second chance.  Salsa is ok and white queso is a good treat."], ["Jacob K.", "My girlfriend and I were long time patrons to El Mez, for almost 3 years as we hadn't really tried any of the other places in Topeka. The last time we went was final time though. I've had past experiences here where the service was an issue, but this last time was enough. We arrived to join her family and were ignored for 10 minutes with our server coming back during that time, checking on everyone else and not even asking us what we'd like to drink. At one point we were trying to order drinks and the server just kept asking us if we'd like menus. I ordered the Quesadilla Hawaiiana (Totally do not recommend btw.) took my first bite and it was awful, the server never came back to see if everything was ok, refill our drinks, or just check on us in general, so there I am sitting with a quesadilla I don't intend to eat infront of me, and when he finally came back he came with one check after we had specifically asked for ours to be separate (No big deal, we can split it at the register, what ever.) and a box for the quesadilla I did not want.I went to the register to pay for my share of the bill, and to ask to have my meal removed as I did not like it or care to take it with me, and I was told by the manager after I started to express my displeasure \"No no its ok buddy, no tips for that guy\". I paid, I did not tip, but I will not be returning. Ignoring your guests and then dismissing them is unacceptable, especially when places like El Maguey are right around the corner, serve better food at cheaper prices, and actually pay attention to their guests."], ["Katelyn C.", "Not a fan of the food at all...barely ate any"], ["Jef W.", "Blah. I love food and rarely rate anything low but this place is just blah. Food is average at best. Atmosphere is okay. Service is okay. Nothing special. There are 10 other Mexican restaurants in town doing similar menu with a lot more flavor and a lot better service. I'm pretty sure people go here because they have $.99 margaritas all the time. Those are served in an 8oz plastic cup like my grandma used to give me oj in with breakfast. And the margaritas aren't that great either."], ["Suzanne R.", "Excellent food, polite and attentive waitstaff. There is absolutely nothing not to like at this place! We are from out of town and have seen this place before, but never stopped. Now it will be a regular when we come to visit."], ["Gidget K.", "#1 Mexican choice for us!  Best of everything!"], ["Matthew R.", "I only gave three stars because of how bad the service is here. The servers are not attentive and it's difficult to order when some of them don't know English. However the food is always amazing. I had the chicken fajitas. Absolutely amazing. So much chicken and veggies. So good. The rice is great always. Add a little white queso on top of the rice and you have perfection. The food is what keeps me coming back."], ["Sonia M.", "Great Food!! The service was ok, not great but good enough. Would certainty recommend this place over some of the other Mexican I've had in Topeka!"], ["Chris E.", "Service was great!, Super quick!started off with the salsa which after reading some of these reviews, i expected tomato sauce, but it was actually not too bad! I got the expensive white cheese dip which is of course good (what oohy gooy melted cheese isn't?!) i also got one of the 99c margaritas which was worth the money. I got the Burrito Gigante (or something) and it was literally the size of a baby! it was 10 bucks, but if i wasn't in man vs. food mode, I would have had plenty for another meal. Overall I had an excellent experience. As far as the dinner entrees go, i felt they were a little overpriced but the lunch menu seemed much more reasonable. the food was fresh tasting with authentic flavor"], ["Christopher D.", "A small mexican restaurant on 21st street that is bursting with flavor. I had a wonderful lunch there that include fresh chips and salsa, some nice guacamole, and then a pretty good version of Chili Verde. The tomatillo was pronounced and it was served on the plate with rice and beans rather than in a bowl. Meat was tender, lots of garlic and onions. Quite good. Little things keep this from getting more stars. Service was a bit slow, the waiter forgot drinks though he was the only waiter on staff then. The tortillas were all flour tortillas, and they were also out of horchata which kind of bummed me out. My DC had a nice sized shrimp quesadilla that was bursting with large shrimp and not overly done it with cheese Good dish."], ["George P.", "Burrito gigante is the tops. Try it!!!"], ["Deepan M.", "El Mezcal is a great Mexican restaurant in all of its locations in Topeka and Lawrence.  I have never had a bad meal at any of their locations.  I always first rate a mexican restaurant by it's chips and salsa.  Chips are thin and crispy and salsa has great taste with a multiple variety of spice levels to choose from.  Whatever you decide to order as your main meal, make sure you start it off with the queso blanco. It is like a drug that you can't get enough of."], ["Amy G.", "There are a plethora of mediocre mexican restaurants in Topeka. This restaurant is 1 of 2 mexican restaurants which I really enjoy eating at. It's pretty busy most days during the week but they're able to handle the volume with a large number of staff. I really like their burritos, taco salad etc. They also have more 'authentic' Mexican dishes which my fiancee really appreciates being able to select from. The only real compliant I have is their salsa. Like everywhere else in Topeka, it's completely bland and might as well be Pace brand (maybe it is). I forgot to ask last time if they have a spicier option (many Mexican restaurants here do if you ask) but I will next time and report back. Good consistent quality and incredibly cheap. Even their margaritas are fairly cheap and consist a significant amount of actual alcohol (not just mix). I know they have a take-out option though we've never used it. I generally don't get take-out when dining in is an option but it's nice for those who do prefer to eat at home."], ["Kelly H.", "Got here long before the lunch rush. Got an initial round of chips and salsa. Just okay. Took some prodding to get additional chips.  Had the Tostaguac and it tasted good but looked pale and uninspired. My wife said the enchiladas were great! Service was adequate."], ["Kalen S.", "Best Mexican restaurant in Topeka. Authentic, delicious, inexpensive, plus a great atmosphere and staff to boot.I haven't tried anything here I didn't like, but my favorites are the white cheese sauce for chips (seriously, try this), the chimichangas, and the tacos.And, of course, the candy for a quarter is a great after-dinner treat."], ["Leichardti F.", "Beef burrito, smother entire plate with queso, add their spicy salsa.  Delicious!  Dollar margaritas was always a plus!"], ["B.W. R.", "A bit pricy- Mexican combo appetizer plate, large cheese dip, and a 3 taco platter ran $30.  Good food.  Service was friendly, but not well done.  No silverware, no plates for the appetizer & it took a while to get these delivered."], ["Randy H.", "This is me and my wife's favorite Mexican Restaurant to eat in Topeka, and believe me we have tried them all.  We usually get the Speedy Gonzales (Taco, Enchilada and Rice or Beans) along with the Free chips and salsa.  I get the Chicken Enchilada and they are always excellent. We look forward to going there at least once a week."], ["Steve M.", "Authentic Mexican restaurant.  Food was great,  service was great.  Everyone that worked in the restaurant was mexican which is always a good sign,  especially for a place that is in Kansas.  As we were seated,  we were given a bowl of salsa and a basket of freshly fried corn tortilla chips.  Their menu consisted of all the traditional mexican foods that  you can purchase as a combo or a-la-carte.   The only thing that looked out of place was the cheeseburger that was on the kids menu.  I ended up going with the #2 combo which consisted of 1 taco, 1beef enchilada covered in red sauce, and 1 chalupa.  All of the items were great,  they did not use cheddar cheese like a lot of mexican restaurants use,  they used this white cheddar cheese that had a bit somewhat stronger flavor to it.  The only thing I didn't like too much was the salsa that came with the chips.  I thought it tasted a little too much like tomato sauce, but that didn't stop me from dipping my chips into it."]], "Jose Peppers": [], "Lupita's Mexican Restaurant": [], "La Siesta Restaurant": [], "El Maguey": [], "Pancho's Mexican Food": [], "Casa Ramos": [], "Pepe & Chela's": [], "El Dorado Mexican Grille & Cantina": []}