{"Merchants Pub & Plate": [["Erik B.", "This place is slowly becoming one of the \"standards\" that me and my friends go to. It's just really good with a great bar/beer selection. It's a nice crowd. It's one of the few places in Lawrence that's nice but not too extravagant...a good first or second date venue. The food has never disappointed, but the portions you get have. If I could give them 4.5 stars, I would. It's a bit pricey for what you get...but overall, I highly recommend this place."], ["Sarah D.", "I've been twice to Merchant's. The first time, I was there for lunch with a friend. I had the Mac and Cheese and a salad, and she ordered a burger with a side of brussel sprouts. Everything was great - but the two highlights were the generous pile of delicious fries that came with the burger and the beautiful, golden brussel sprouts.It was the wonderful brussel sprouts that made me push my husband into going for dinner. I told him the fries were great and encouraged him to get them as his side. We ordered Soup of the Day (Crab chowder), he got a Sweet Potato Quinoa Burger and fries and I ordered cauliflower gratin and the aforementioned brussel sprouts. Things didn't start out that great, since our server was clearly completely ambivalent to our presence - preferring to tidy up other tables and chat with other staff members over taking our order.When the food arrived at the table, I was disappointed. The tiny handful of fries that came with his burger was nothing to write home about. Neither was the burger. My cauliflower gratin was bland and had several large stems. The brussel sprouts that had previously been so good were the worst of all. I could tell they were underdone - there was no golden brown exterior to these. When my husband tried to put a fork through one, it bounced off the table because it was too hard. We decided to say something our server, who brought them back to the kitchen. When they returned, they had the sickly-green cast of microwaved brussel sprouts. Seriously - these things were like something from a Green Giant frozen package that makes every child hate brussel sprouts. They were cooked enough to eat now... but uhhh.. pretty gross.So when our server reappeared to ask if we wanted a box, we said that the brussel sprouts hadn't survived the microwave. Her response was a disinterested, \"Oh really?\" She then asked \"So are you too full for dessert?\" I stared at the full plate of brussel sprouts - clearly, since I had not eaten half my meal, I was not too full for dessert, but I opted out nevertheless. She wandered off and returned with the bill. We felt awkward about asking for the inedible brussel sprouts to be removed from the bill at this point, so we just paid and left.My husband couldn't believe I recommended this place. I kept saying, \"I don't understand, it's like this is a completely different restaurant.\" Unfortunately, the second version of it was so terrible that it completely ruined my good first impression."], ["Clarice W.", "What's up with Lawrence replacing old classics (Teller's, Milton's...) with more swanky attempts?Came here for drinks on a Friday night; the crowd here is definitely older. Their signature cocktails are disappointing; I can think of several other places in KC and even in Lawrence where I've had better versions of similar drinks. The Sir Barnum sounded interesting (scotch, cream sherry, smoked salt rim) but was far too sweet and the salted rim did not meld well with the flavors. But most of all, it was so hard to get over how aesthetically unappealing the drink looked - it had chunks floating around in it. Please, bartenders, when working with cream liquers it is so crucial to think about how that cream is going to react with the other ingredients! No one wants to take a sip of chunky cocktail!!I didn't eat here but after seeing what they've done to the place, I can't say I want to. I don't like the open kitchen they've tried to create here - in a small space this works as a rustic reminder of farm-to-table style cooking, but in this large bank space it just looks messy. And for the record, I agree with previous Yelpers: this is no gastropub. It's a restaurant with a bar that has a decent variety of beers on tap. There is very little connection between the two.The one thing Merchant's has going for it is the space - even a paint job can't take away the historic feel of those high ceilings."], ["Anne H.", "We have eaten here multiple times and have always had a great experience! The service is always excellent and servers charming, the food is wonderful, and their beer selection exceeds my husband's standards (which is a feat).We loved this restaurant so much we also had our wedding rehearsal dinner here. Their food translated so well to family-style and they took great care of us and our family - perfectly executing every detail! I highly recommend heading to Merchant's for your next catered gathering. Oh, and don't leave without trying the yam fries!"], ["K G.", "I was so sad that this restaurant looked nothing like a pub, for starters.  After I got over the fact that it just looked like a newer version of the last restaurant, I swallowed my disappointment and ordered something unmemorable.  It was a tiny portion and was overpriced.  Nobody in our party of four was overly impressed with any of their food choices.  Too bad.  This city really could have benefited from an actual pub with actual pub fare. This is just pretentiousness."], ["Kerry P.", "This experience was short-lived due to me being partially intoxicated... however we did come here to try the fries and the meatballs from their \"late happy hour\" menu. Meatballs were good but the fries were saltier than the Dead Sea. And considering that I wasn't sober, it's gotta be REALLY salty. It was basically inedible... Not sure if I want to try this place again as I didn't really have a good experience (food-wise) when it was formally known as Teller's."], ["Bill B.", "Unfortunately Teller's restaurant, a long standing Lawrence landmark, is now gone.  The replacement is Merchants Pub.  While not comparable to the upscale Teller's, Merchants serves some very interesting and innovative food.  I particularly liked the Tuna Confiture and the Wild Striped Bass.  The soup of the day also was excellent.  The vegetables that you can order separately are served in large portions.  In fact one appetizer and one or two side vegetable could be enough for a dinner.  Although Merchants specializes in its large selection of craft beers, the wine list is very good, and includes some modestly priced options.The happy hour is only in the bar area from 4 to 6 pm.  But whether in the bar area or the main dining room, this is not a comfortable dining room in which to spend a lot of time.  If your preference is for a relaxed three course meal, you may not be happy with the hard wooden chairs.  There isn't a cushion anywhere in the restaurant.  Also there are many long tables for large groups.  When crowded, you won't have much privacy here, and the noise can be considerable.  We arrived at 4 pm and avoided those problems, until around the time we were leaving. The server was Rachel.  She provided excellent rapid service, but had not been adequately trained.  When she opened the wine bottle, she left the cork on the cork screw and then took them away.  Obviously she had not been told that she is supposed to remove the cork from the cork screw and leave the cork on the table.Another oddity is the need for a password for guest access to wifi.  Most restaurants do not require a password, if the restaurant has a separate guest wifi connection.  But at Merchants, both the secure and the guest connections require passwords.  When the restaurant is busy, it is a waste of the servers' time to have to find out and provide that password to customers who request it.I booked the reservations on Open Tables.  To my astonishment, I got a message from Open Tables (the day after we were there), saying that we had not been there, so would not get credit for the reservation.  Of course, I told the hostess that we had reservations, when we arrived.  In all the years I've been using Open Tables, I've never before had this happen to me.    I have better things to do with my time than having to deal with this kind of mistake by a restaurant.  Perhaps Merchants should send their hostesses back to school."], ["Farley D.", "I expected something different from Merchant's having read about it first. The night I was there was a night there was a basketball game on, so that may have affected the ambiance, but it was completely silent in there, as everyone was watching the game on television. We ordered through the bar, and the service was amiable, yet distant. They had great happy hour specials, and the menu was large, albeit rather plain. Bison bolognese was a let down, brussel sprout salad was plain, and the plowman's plate was skimpy--where they advertised 'meats' on it, all that came was one grilled sausage. Perhaps worth checking out if there's no other option."], ["Sandra W.", "Please do yourself a favor and go here. Try just about anything on the menu and you'll pretty much have to come back to try the rest. The quinoa and sweet potato burger is a great example of a die hard meat-eater (myself and several friends!) falling in love with a veggie option because it was just that darn good! I can't list all the great options because it would basically be the menu. However.... Sweet potato doughnut holes, bar bites, buffalo chicken meatballs, and scallops. Go after 9 for the best drink specials in town and order whatever speaks to you!"], ["H C.", "Like this spot and have enjoyed some wonderful beer pairing dinners here. The food is good. And so is the beer - though I wish they were more into belgium/farmhouse ales, and less into hoppy beers.  But that's my own personal preference.The downside is the dining space. It can't quite shake its bank ancestry.  The ceiling is so high, it feels vast.  Maybe if they painted is another color?  On a Friday night out w my beau I want a romantic, cozy spot, so we usually skip it.Saying all that, I love the bar! The happy hour is great.  I have drank many a $2 / half price beer here, and had a good time."], ["Ann W.", "The food here really seems to be a mixed bag.  I like that they have some gluten-free and dairy-free options available, although my gluten-free entree was served with regular, not gluten-free pasta. This could be a huge oops for someone with serious celiac disease. This is something I wanted to mention early in my review because it's important for those who could have a serious reaction to know up front that there may be some level of risk involved in trusting this restaurant to deliver on their dietary restriction requirements.We started out our dinner with a couple of appetizers.  We had the rabbit sausage appetizer which was incredibly tasty and served with roasted tart cherries and yams. This was my favorite part of the meal. We also had the scallops which we really should have sent back. $14 dollars for three small scallops and they couldn't bother to rinse the sand off first? If you do not know how to prepare scallops, don't put them on the menu. Scallops should never ever be sandy. My stepfather had the angus steak which was a huge portion. He liked the flavor, but it was a very tough cut that was difficult for him to chew.  My mother had the chicken and she reported it was one of the best chicken dishes she had ever had. The hubby had a hamburger which he said was \"ok\" but it simply didn't hold a candle to his favorite burgers at Blanc or The Burger Stand. My bison dish was served with tiny bits of ground bison meat which was unexpected, and not in a good way. The overall flavor of the sauce was nice, but the dish didn't have enough sauce. The error noted above with serving wheat pasta was unappreciated. It was funny, because at the time, I was a bit shocked that the pasta was cooked perfectly al dente because gluten-free pasta usually doesn't have that perfect bite. Not much later that evening, I discovered that it wasn't gluten-free as ordered. Don't ask me why I know this.The decor is generally nice. I love the old bank building, but I'm not sure what the hell they did to the wall behind the bar. Is this supposed to be artistic? It just looks like a hideous mistake and detracts from the beauty of the space. Our waitress was very quiet in her demeanor and not terribly full of personality, but delivered the food relatively quickly and kept glasses refilled at a reasonable pace.This is one of those places that I think has some promise. I would never ever again order a dish here where I could be exposed to gluten. I don't trust them. I would never order their scallops again. If I happened to be in Downtown Lawrence and wanted a quick bite, I'd be willing to order the rabbit sausage app again. At the prices here, because the quality is such a mixed bag, it's really not worth it to me to come back and work my way through their menu."], ["Denette V.", "This is a really great place. More upscale than the name suggests, the chef does an excellent job in the execution of the dishes. Of the three of us,  we had their beef steak special, the wild mushroom loaf and the shrimp/chorizo /polenta dish. Fabulous! Each unique with complementary flavors that brought out the stars of each dish. I was raised eating quality beef and find most chefs fail to enhance the flavors of beef. Salt and pepper is all good steak really needs, but this chef kicked it up with a drizzle of chimi churri. Honestly I found the sauce more delightful with the roasted veggies the steak sat on because the seasoning and steak was that good. The other table favorite was the mushroom loaf with a luscious tomato gravy. This dish is just fabulous. The Spanish flare of the shrimp and chorizo dish was good and delightfully balanced. Wine list was interesting with many great pairing choices. Spirits and beers were quite interesting if one wanted that direction.  Dessert was unique and well executed as the mains. Wait staff was pleasant and attentive without pressuring. Suggestions, make reservations before you come to town.  The place is pretty busy and you will not want to miss out."], ["David K.", "Had lunch on a Thursday, got:- burrata appetizer: seemed more like just mozzarella than burrata, but at least good mozzarella.  the crostini were more \"crosti\" than I'd prefer, although made them good teething toys for baby.  neither pesto nor mushrooms as flavorful as expected, though toasted garlic was.  so: could have been much better, but was still good as-is.- smoked beet salad: the beets weren't smoky, but still good, and the greens (mostly baby spinach, it seemed) were fresh, the dressing subtle, and the green apple slices and fried goat cheese rounded out the dish nicely.  no more than the sum of its parts, but good parts (and I was craving some fresh veggies after eating out for a couple days).  - falafel: I added this to my salad for $3.  I liked it a lot, and helped add some calories (you get two good-sized pieces) to an otherwise light dish.  it didn't particularly go with the beet salad, but enjoyable to eat just on its own.- (tried) shrimp & \"grits\" (polenta cubes): an interesting interpretation, and nice presentation.  I didn't like the shrimp as much as that at Free State (or Terrebonne)--maybe b/c it was a little less cooked, and had some slightly tougher strands--but still enjoyable, and the pepperonata went well with it.  the sausage (andouille) was really good, too (I guess they make it in-house, I just noticed?), although not spicy.- smoke & mirrors (drink): I don't get more than a few mixed drinks a year, so maybe my bar is low, but I thought this was delicious. - sweet potato donut(hole)s: the donuts themselves (5) had nice texture and flavor (the potato flavor is subtle, though).  they come w/ 3 sauces, and the Bavarian cream complements the heavy/fried/sweet donuts well.  I didn't like the choc/stout \"pudding\" (pretty liquidy for \"pudding\"...), but I don't like beer.  the strawberry jam tasted great but (imo) didn't match well with the donuts, so I just ate the jam separately w/ the spoon =)- the building/interior is a nice place to dine.  but didn't feel like it was too fancy to bring a baby (for lunch at least).Since I was a tourist, I enjoyed that they had a map of their (local/KS) suppliers on the back of the menu, although otherwise I wouldn't really care about \"local\" as opposed to \"sustainable\" (I mean, if someone's degrading the environment in whatever way, I'd rather it *not* be \"local\" to where I live...).  Not cheap ($63 incl. tax and nice tip), but I felt good about it, so I think that warrants 4 stars.  But still much room for improvement."], ["Tim V.", "I'll reserve a 5-star review for after I've eaten here more, but I had a great experience. I had the fish sandwich (barramundi?) and a few Lagunitas beers that were on special for an amazing price. The whole menu was more reasonable than I had been led to believe, and for the first time in years, the place looked clean enough to serve food."], ["Matt R.", "Take the bartenders advice.  Kale Caesar is a very nice change from the traditional.  Duck Carnitas - I ate it all by myself; no sharing.  Mac and Cheesemonger - make sure to add the bacon!"], ["Gordy M.", "We raised our kids to be adventurous eaters, and Merchant's hits the mark.  Our Boston kiddos were back in Lawrence for a visit, so we decided to meet up here for a family repast.  Merchants opened after they headed east, and we don't get to Lawrence too much these days.  All together we had six adults, a seven year-old and the newest granddaughter.  It was a pleasant evening - rare in July - and the sidewalk table worked out great.The service was friendly and prompt.Along with beers and a couple drink specials we ordered the Pub Picnic and Sweet Corn Arancini for starters.  Devoured!The two traditionalists in the crowd played safe with the Sweetlove Farm Chicken and Smoked Pork Chop.  They were well-prepared although a tad borrrrr-ing.  The aforementioned adventurers opted for Duet of Rabbit, the chef's special catfish creation for the evening, and I just had to taste Moroccan Goat Stew.  Now mind you I don't take goat stew at face value, so I questioned our waiter a bit.  The goat is grown and butchered locally and never frozen before landing in the chef's stewpot.  It was delectably tender and perfectly seasoned with curry and a few other spices I'm sure.  It was served with grilled pita, and I added a side of Brussels sprouts.  The dish was extremely bountiful, and I had to make myself stop eating it.  I was totally full, and I had it again the next day for lunch.  Nobody in our group complained about taste or portion.  I'm sure that resulted in the fact that all of us together could only muster enough appetite for one Chocolate Beet Tort and some house-made ice cream."], ["Richard R.", "We are visiting from the Chicago area.  Merchant's is a pleasant surprise. The food was excellent.  We had muscles for an appetizer which were outstanding.  I had shrimp and grits, my wife had the short ribs and my granddaughter had scallops.  Each dish was wonderful.  They have a nice beer and wine selection,I recommend Merchants for a great dining experience."], ["Andrew L.", "I understand the owners wanted to capitalize on being Lawrence's very first gastropub.  I believe one of the other reviewer's described it best by saying, \"a very large variety of beers to accompany overly priced comfort food with local ingredients.\"  I found his description to be right on the mark.  The food was rather bland and the beer list left me somewhat overwhelmed.  My biggest disappointment was the ambiance of the gastropub.  Merchant's used to be Lawrence's nicest restaurant because of their local ingredients, historical references, and family atmosphere.  I remember seeing tons of families enjoying a nice meal before a local sporting event, show at the Lied Center, or during the holidays.  Now it just seems like an upscale bar.  I miss the historical relevance it used to proudly display and the opportunity it provided families to share a quality experience.  I have no intention of returning.  I would rather spend the extra money at another establishment that provides a more welcoming atmosphere."], ["Randall F.", "If I could give negative stars- I'd start there.Merchants by all appearances is Tellers with a new paint-job on the ceiling.  Their snobbery, arrogance, and average food leads me to write the following review:Bringing my family there for a nice meal, I had high hopes.  As we walked in and the hostess noticed the two young children in our party I could immediately tell we were in trouble.  I was told there were no tables- despite the nearly 20!!!!! empty tables I was looking at.  Then after a 20 min. wait while they \"tried\" to accommodate us- they took us to the third level.  Clearly the family level based on the fact that the only other parties dining up there had kids.  We sampled a great spread of average food ranging from the deviled eggs, to pickled peppers, Kale Salad, to Pappardelle with lamb sausage.  Overall the food was average at best.  I'd probably have given the restaurant at least two stars if it were based on taste alone, however the slow service, constant attitude and general lack of care (despite the fact that we dropped well over $100) lead me to leave angry and dissatisfied.Food should have enough flavor to not need excessive salt to make it edible.  Everything I had was simply undercooked, under flavored, and over valued.  I will NEVER dine here again- and hope that the rest of lawrence will allow this place to wilt on the vine like Tellers did.  Lets put a bank back in this building and move on already."], ["Holly G.", "This place is wonderful!I had my first experience during a tasting at Final Fridays. I was hooked, and so ready for them to open.I also got a chance to hear the owners and building owner speak. They are all truly wonderful people and obviously care a lot of about the Lawrence community.More than that the food and service is AMAZING! The food is decently priced and is delicious and is local for a bonus. We went there once and they gave my boyfriend a sample of beer he wanted to try. On that same visit, they got his order wrong, twice. Whoops! But they were able to fix is quickly and were nice about it, and gave him another free drink (I don't think he needed it). Everyone there is incredible. Speaking of incredible, so is there beer/wine selection. A true paradise for those who are interested in that :)"]], "Free State Brewing Company": [["Alexis R.", "So I feel that I need to update my stellar review from 2 years ago. To be concise, you can't go wrong at Free State! Everything on the menu is amazing. I personally crave the Avocado Chimichurri, the beer cheese soup and the baked goat cheese appetizer but I have to add that the gumbo, all the pasta dishes, the black bean quesadilla, the fish and chips, the fresh, homemade salsa, the grilled cheese, the artichoke dip spread on thick toast points, and the harvest ham sandwich are equally amazing...Okay, so I think you get the idea.  They don't make a bad thing there.  Everything is fresh and delicious!  Also, did I mention the great beer?  There is always a great seasonal on tap along with their very solid, standard, year-round beers.  The staff is awesome and friendly, probably because the owner pays a living wage and benefits to full-time staff, which is great.  The bar area is typically packed on Monday $1.75 pint night for 2 or 3 of the selected beers on tap, but seating can be had fairly quickly...I can't get over how every time I come here, I'm not disappointed!"], ["Cody M.", "Free State has never overly impressed me nor overly disappointed me.  Every time I go to Free State, I do always think it is going to be a better experience than it actually turns out to be.  The actual bar/restaurant itself seems to be caught in a personality conflict; half of it is decorated and set up like a depressing Perkins Family Restaurant and the other half looks like a cool craft brewery.  With the focus of this place directed more toward the restaurant than the brewery/bar, it results in a busy and loud environment that is not the best place to just go to relax with a beer.  Ordering at the bar is a headache; you have to compete with the rushed wait staff, pickled regulars, and then the not-so-friendly bartenders (seriously, though, I have never had a positive customer experience with the bartenders here).Beer: As others have already pointed out in reviews on here, your best bet is the Ad Astra Ale and the Copperhead Pale Ale; these are the staple beers for the brewery and they are both pretty tasty.  I also really enjoy their new Stormchaser IPA, and last summer they had a seasonal Blood Orange Radler that I am hoping will make a comeback.  The best I can say about their Wheat State Golden is that it tastes like a slightly more refined Budweiser.  I wish that they listed the ABV% for their beers on the menu.Food: Being vegan, I honestly can't really speak to most of the food here.  If you are vegan, there are a couple of salads you could order without cheese, hummus (which I thought seemed suspiciously creamy when I had it), chips and salsa, and a black bean burger (this may not necessarily be vegan, I have never tried it).  Cheers!"], ["Lesia M.", "We called ahead on a friday night and got seated in a reasonable amount of time. It was 110 degrees outside and we got seated in the loft, they tried to manage the air flow, but we were sweating the whole time, that's my only complaint,we ordered Maryland crab cakes,sweet onion/nopales enchiladas,Gumbo,Gnocchi with a creamy Goulda sauce,Fish and chips.Everything was very well prepared. The crab cakes , enchiladas and house salads with homed dressings were very light and heavenly. the food is always good .They have some unique and healthy choices:)"], ["Lab L.", "Had a group dinner last night. The Call Ahead and text updates worked well, even if the timing was a bit off. Dining area can be loud during busy times.  Service was good and everyone enjoyed their food.As a general problem on Mass Ave, wish those hanging on the patio for their table wouldn't smoke.  Makes it uncomfortable for others also waiting nearby."], ["Chris S.", "Nothing Is Free at Free State Brew Pub Where a Terrible $6 Burger Costs $9!Free State Brewery ... Free State Brewery ... that is all I have heard since moving to Lawrence in August ... \"Free State Brewery\".  I have tasted some of their micro brews and they are excellent, but every time we wanted to try the food, the place was jam-packed.  Now I know why while at the same time wondering ... WHY?The place was full, but not packed, yet the noise-level was high.  After 20 years in the Air Force working around very loud jet engines, my hearing is not great and I had a hard time hearing my wife from across the small table.  Wood and glass dominate the large open room, the lighting not too bright and not dim, making the setting comfortable except for the decibel-level.Our server, a nice young man who never mentioned his name, arrived promptly to take our drink order.  I decided to go with one of two stouts ($4 for an American pint) on the menu, I tried the other later, a flavorful thick, rich chocolaty concoction that was complex, yet smooth.  The second, an oatmeal stout, was also very tasty and smooth with less complexity than the first, but it was delicious.I ordered the Brewery Burger medium-well with cheddar cheese, figuring a brew pub would have a top-notch burger, especially at $8.25 \"without cheese\".  The menu states that it is a \"1/3-pound patty of Kansas pride, Creekstone Farms seasoned premium charbroiled ground beef on an onion bun, slice of onion, leaf of lettuce and a pickle spear. Hot fries stand ready to complete the feast.\" Adding Provolone, Blue, Swiss, Jack or Cheddar cheese is an extra 55¢, bringing the price to nearly $9. When our order arrived, I was shocked by the size of the hamburger and not in a good way.  The plate was dominated by overcooked French fries that sat upon a single flaccid piece of wilted lettuce, NO ONION, and a small dill pickle spear hidden under the fries, leaving the small onion roll containing the meat and cheese.  That was it, a beef patty the size of a McDonalds ¼-pounder and cheese, no mayo, no catsup, no tomato, NO TASTE!  First of all, the beef patty was medium or medium-rare, pink throughout and NOT medium-well as I had ordered.  I added some catsup out of the bottle and rather than ask for some tomato or onion, deciding to eat it as is and thinking that maybe they knew something I did not ... that it should be eaten this way, it should not!Based on value, this was one of the worst hamburgers I have ever eaten ... and people wait outside in the rain and cold for this?  Five Guy's burgers, at less than $6, are eons better than this sad excuse for a hamburger and even (dare I say it?) Burger King's Whopper is tastier, cheaper, and COMES WITH ONION AND TOMATO!My wife had the Gorgonzola and Mushroom Gnocchi - $9.95 - consisting of Shiitake and button mushrooms sautéed with julienne red onions, then simmered in a creamy Gorgonzola white wine sauce with fresh made potato gnocchi and finished with sliced black mission figs, local micro greens and toasted rosemary focaccia.  Her dish was attractive and flavorful enough, except for the fact that the red onions had not only been caramelized, they had been burnt.  The burnt onion flavor overwhelmed the otherwise tasty, creamy Gorgonzola and white wine sauce which had just the right amount of the strong cheese which can be overpowering if not done correctly.  The gnocchi were cooked perfectly, not too soft and not too firm, making the dish a decent value except for the fact that the burnt onions ruined it.  For $10, a side salad would be nice considering the fact that sandwiches come with a choice of potato or salad, but that is not the case.I honestly have no idea why this place is so popular other than the fact that it may have become \"the place to be seen\" by the local college crowd, the same folks that give Chipotle 4 out of 5 stars on Yelp.  The beer was very good, the food extremely disappointing.  I live 7 blocks away and wouldn't make a special trip. Their beer is good, but not a huge selection. The food is boring and pretentious. Those who like TO BE SEEN, \"hipsters\" et al, probably enjoy it. Not me.Based on our experience and the few available options on the menu, I doubt if we will be back except to have a beer, but based on the size of the bar and the usual crowds, I also doubt if it will be worth the wait. That's my opinion, so take it for what it's worth. CombatCritic Gives Free State Brew Pub 5 Out of 10 Bombs ... BOMBS ARE GOOD!"], ["Chad C.", "Great Food.  Great Beer.  Is there anything else in life that matters?"], ["Thomas W.", "Free State is what a Brewery should be.  The Cheddar Ale soup is definitely a winner.  We also had some of their spinach artichoke dip, and nachos.  I would love to return to try some of their other dishes.  After a Kansas basketball game this place was packed, and the staff and owners are truly hospitable.  New York City could use a few of these places.  Well done Free State Brewing Company!"], ["Kayd P.", "Such a great experience. We enjoyed the beautiful front patio right on Mass street while waiting for our table. We had a very large group of friends together and they were very accommodating to all of us. Thanks again, definitely going to be going back."], ["Laura C.", "Thanks to the recommendation from a friend who saw I was in Lawrence via the Untappd app, I went to this place. The beer is affordable and really damn good, plus they actually brew it here. I had the beet salad, which was entree-sized and delicious. I hope to come back. The service was great, with friendly people. The bartender was totally awesome. Everyone should buy Free State!"], ["Peter M.", "Where do I begin? Came here for lunch during a business trip from Ohio. Yelp reviewers gave great feedback for a reason. Everything including the hostess, staff, lunch and dessert was absolutely...AMAZING!! I'm so satisfied that I'm still here writing the review. Would definitely come back again! If you live here or just passing through, it's worth the visit. $0.25 for 30 mins for parking meters out front, just FYI."], ["Jerry B.", "This place always seems busy and I know why.  Solid food at extremely reasonable prices.  Definitely a bar atmosphere vs. a restaurant, but people are here to eat.  Menu has something for everyone.  You may have a wait, which is a great excuse to try their home brews, but this is definitely a go to place when I'm in Lawrence."], ["Rachel B.", "In a town where service is almost always crap, this place delivers on food, beverage and service every. single. time. Their beer, of course, is heavy and packs a powerful punch, but their food is great, too! I especially love their Chopped Salad Verde, so much so that my boyfriend and I order it to share as an appetizer every time we come. Because of that, I cannot comment on other appetizers- that salad cannot be passed up! Delicious avocados and shredded parmesan cheese, tiny pasta shells, tomatoes-- just awesome. Also, their veggie burger is probably the best I have had anywhere, crispy and oaty and sinfully delicious. I have not personally ordered any desserts, but my boyfriend has liked any dessert he has tried. That's not easy to do, because he is a dessert snob! They have a text ahead function, which is very helpful because there is always a wait. No matter when you go, there is ALWAYS a wait. So, if you text ahead before you hop in the car, you will get to bypass all of those jealous customers who did not think to do this! Woo!"], ["Cheyene R.", "AWESOME FOOD! One of my  favorite places in Lawrence."], ["Lexey J.", "Oh my goodness, Free State...you gave me a foodgasm.I'd been here once before with a few friends, but I think I just ended up getting the fruit and cheese plate for some reason (I was in a weird mood that day).  I discovered yesterday that I had made a huge mistake.I had a friend visit town that was in a brewery mood yesterday, so I took him to Free State. We got there at the perfect time and didn't have to wait to be seated (typically there's at least a five to ten minute wait for lunch or dinner if you arrive during the rush; it's a very popular place) and they gave us a nice quiet corner booth up on the balcony overlooking the entrance.  It didn't stay quiet for long, unfortunately; that place reverberates sound like no other, so it's not a great place for a quiet dinner if that's what you're looking for.  The noise level actually made it very difficult to hear our server, who didn't speak very loudly.  He was a nice young man, but volume, son; it's important.Pricewise, it's not a bad place for its quality.  My entree was about $10, and my friend's steak dinner was about $20, so there's a fairly large range in what you might end up spending.  Drink prices are pretty average. I thought the hummus appetizer was just a touch more expensive than it should have been, but it was also delicious, so the complaints stopped there.Finally, we get to the main dish.  It was brought out pretty much as we were finishing our hummus, so their timing was impeccable there.  My friend said the steak and mashed potatoes (with what I believe was oatmeal stout gravy) were pretty awesome, but I have to tell you about the Gorgonzola mushroom gnocchi.Holy cow, that was the best thing I've ever eaten.  The Gorgonzola sauce was rich and creamy and was perfectly complemented with sweet dried fig and microgreens (I don't really know what microgreens are, but they added a beautifully contrasting crunch to the dish).  The gnocchi was soft and fresh and the sauteed mushrooms and onions in the dish were pleasant and not overpowering in any way.  If you have never been to Free State, especially if you're a vegetarian, do yourself a favor and get the Gorgonzola mushroom gnocchi.  It's the only dish I've ever eaten that prompted me to send my compliments to the chef AND write a Yelp review."], ["Ines S.", "This place not only has great food and beer, they also try to use as much local produce, meat, and bread. All of this and most meals are under $10."], ["Charity T.", "This place is always busy but that's a good sign. Great food and great beer. I've not had a bad meal here and I've tried many different items. I recommend going during March mustard madness!"], ["Cindy R.", "I sorta feel bad for giving them a 3-Star.... But let's be honest... I came here last night for a late night dinner and the food was \"okay\" at best.  We got two sandwiches and had the potato chips and fries.  The sandwich was fine- nothing spectacular.  The homemade potato chips were good but once again, nothing \"great\".  The beer is the real reason why people come here and that is A-OK by me."], ["Paul J.", "A definite five stars. Every time I've been there they have never disappointed. Just a nice place to be and a good local hang out with many friendly and familiar faces."], ["Chelsi H.", "Great beer + great food!.... But mainly beer :)"], ["Erin W.", "Love Free State, not only because I'm a Kansas girl that is married to a Missouri guy (yes, we may be crazy), but they have great beer and terrific food.  Our last trip came after the Warrior Dash and it was packed. Definitely worth the wait though. Free State even has some pretty good swag too!"]], "La Parrilla": [["Scott T.", "La Parilla has moved North one block on the same side of the street and it appears this is the first review since. Let me preface by saying I've been dining at this restaurant since they opened long ago--10-15 years? Lost track. Don't eat here real often, but enjoy an occasional visit and the food and service is always consistent.Happy to report I couldn't detect a change in the food at all which is what attracts its return customers. Same good grub, not high dining mind you and who'd want that out of a place that has rice and beans as their base food in most everything? Hell no, this is south of the border comfort food. It's not central American, it's not South American, it's sort of a combination. It's a solid good meal and a rice bowl is a lot of food for the price if you eat the chips and salsa that come with it.Our most recent visit we had the shrimp & salmon rice bowl and my companion the pork rice bowl. Delicious, plenty left over for carry-out. Packed with onions, green and red peppers and lots of juicy savory rice and meat.Only change is the new digs are a bit fancier but I don't see that being a problem. Waiter/waitress service was good and no delays for the meal. Little has changed it appears, just more room and finally a restaurant for this beautiful space (built originally for a high-end place called Prairie Fire that lasted a year or so) and then went through several painful other attempts. The owners who also gave us Zen Zero and Genovese will make this one last. Mark my words. They know how to run a restaurant. Must return for those pitchers of margaritas, something I try to avoid for lunch."], ["Michael V.", "The waitress we had was great, but my food was just okay. The flautas had hardly any meat in them at all, were buried in lettuce, and served with what seemed like reheated rice and beans. We came after the lunch rush... maybe the cook was tired? I was pretty disappointed. But, my partner had the enchiladas and he thought they were pretty tasty. They accommodated gluten-free/celiac well, as most mexican restaurants do. We'd go back I think, but prefer Salty Iguana over La Parilla any day."], ["Luis M.", "This is my favorite place in Lawrence. The food is great. They have one of the best salsa for chips I have ever tried. It has a very unique taste. I recommend and of the rice bowls (with pork al pastor or carnitas), the California style burrito or my personal favorite the \"bistec a la parilla\". The stuffed \"arrepas\" a and \"yuca frita\" are great starter alternatives. If you like Cuban food or Puertorican food this is the closest thing you'll have in Lawrence. This is not a Mexican restaurant. Is more like Latin fusion. So you'll get a bit of Mexican in it though but expect something uniquely different than your regular Mexican restaurant."], ["Cody M.", "I am writing this review from a vegan's perspective, but omnivores may want to read it, because if this restaurant can't even get black beans and rice right, I would not trust them to cook meat correctly.  Visit #1 (a few months ago): My girlfriend and I are both vegan and we gave La Parrilla a shot because their menu had at least one clearly stated vegan item, which is their Vegan Corn & Roasted Red Bell Pepper rice bowl.  During this first experience, we were told that they were \"out\" of that particular rice bowl, which I am still confused by; how does a \"Latin American\" restaurant not have rice, beans and corn on hand?  Even if they do not necessarily have vegan versions of those food items prepared, how long would it take to make them, 20 minutes?  With the slapdash nature of the food served to us on our second visit, I am going to guess less than five minutes.  Somehow on this first visit, the kitchen put something together for us, which I remember thinking probably had butter in it but could not be sure; anyway, not the end of the world, but we did feel a little wary about going back.Visit #2 (last night):  We decided to go back to La Parrilla after running through all of our other vegan-friendly restaurant options. (Side note: It is odd that a town like Lawrence does not have a straight-up vegetarian/vegan restaurant.)  I suppose we figured that it could not be any worse than the first time, and might even be better, and oh boy, were we so very wrong.  I ordered the Vegan Corn & Roasted Red Bell Pepper Rice Bowl, and was surprised to find that it was actually in stock this time.  My girlfriend ordered the Locally Made Organic Tofu Rice Bowl after our waitress checked with the kitchen to make sure that it was vegan, which she assured us it was as long the arepa sauce was omitted.  What was served to us was basically low-grade cafeteria food. In my dish the rice was stale and had clearly been cooked hours before hand, the corn and peas appeared to be rehydrated vegetables (also, what were peas even doing in this dish?).  This place claims to be a \"Latin American\" restaurant, so where were the diced tomatoes or cilantro for garnish?  Seriously, there was not a single fresh vegetable on my plate, and this place has the gall to call it a \"vegan\" bowl.  As bad as my dish was, my girlfriend caught the worst of it with her bowl.  I am putting restaurants on notice right now, if you are going to offer a tofu dish on your menu, learn how to cook tofu first; you wouldn't just throw raw pork or chicken into a bowl and call it good, so why would you do this with a protein substitute like tofu?  The tofu was uncooked/raw, which basically means it was a gelatinous mush of cube shapes on stale rice with peas (once again, WTF are peas even doing here?), and some kind of zucchini that had been cooked into oblivion and drenched in butter (no doubt about it this time).  She took three bites and was done, and we were both done with this place for good.  By the way, this place claims on its menu to be the \"Home of the Original Rice Bowl,\" whatever the hell that means."], ["Ed C.", "I've been meaning to try this place for years. I'm glad I did. I've been there twice already and even ordered the same thing- the enchiladas suiza. That's my default dish anytime I go to a Mexican restaurant and don't know the menu. I've had that same dish in a bunch of different places but no one else has ever done it so well. Ever. Not in all my years of dining out here, in Chicago, all over the place. Seriously you have got to try it. The only thing about the dish that isn't crank-up-the-knob-to-11-and-rip-it-off perfect is the rice, which is seasoned well but a tiny bit dry.Can anybody recommend other dishes from their menu? Especially something for my vegan days? If so PM me please."], ["Lauren F.", "Pretty good \"Latin American\" food....for Kansas.  They're open until 11p on Saturdays which was the main reason we stopped in-we needed food after the football game that started at 6p!  My fiancee had the Pork al Pastor quesadilla and I tried the Portabella & Roasted Red Pepper Chimichanga.  He enjoyed the quesadilla but I tried a bite and got a big chunk of gristle and was turned off.  I enjoyed the unique vegetarian option of the chimichanga but the ingredients were somewhat overshadowed by the fried tortilla and the copious amounts of sour cream.  Rice & beans on the side were just ok.  There are so many places to eat on Mass St, I'd probably pick somehwere else unless this was the only option."], ["madam n.", "As someone who's lived in Mexico very extensively, I patronize the Americanized kind of restaurants knowing full well that their relationship to true Mexican cuisine is sort of like Natalie Wood's relationship to a Latina person ... If you can accept it,you can still enjoy these kinds of places if you want to get tipsy on cheap tequila ...The vegetarian dish I tried, a so-called Salvadorean enchilada (whatever that means!) was pretty medicore, over-boiled veggies in a setting of tasteless refried beans ... But heck, being starving, it hit the spot ...The \"agave martini\" was actually quite delicious, though very sweet of course"], ["Elyse B.", "My favorite south american cuisine. The service is great--as are the prices. Try the rice bowls!"], ["Alicia R.", "This is great South American food...I am a huge fan of chimichangas and the roasted veggie and goat cheese chimis here (you get 2 little ones, so more crispy deliciousness on one plate) do not disappoint.  I have also had many other times on the menu and have never had a bad meal.I really like the new format they have with table service, instead of ordering at the counter like in the past,  it makes the experience even better."], ["Cassie A.", "The first time I came here, we asked to be sat on the patio and nobody ever came to serve us. It was hot that day, but really. The second time I came, I ordered something that did not contain meat and received something different that did. That was a little weird, but it was quickly fixed. I've been two times since then and am really glad that I gave it a third chance!! (something I don't think most people realize is that restaurants are run by human beings, humans who have off days and who make mistakes, and not everything is always going to go exactly how you want it, and you really shouldn't judge a restaurant's service by going there only one time... off soapbox).The last two times I've gotten the salmon and shrimp rice bowl with Oaxacan rice. Absolutely delicious!! I love the little tiny salad shrimp. I couldn't believe how much salmon was in it, and was actually disappointed that there wasn't as much rice! It comes with a pineapple salsa that's really awesome. Although the corn cake they gave on the side was room temperature and left something to be desired.The portabello and goat cheese chimichangas are also really divine. Oooozzing with cheeeessseeee. MMM!!We got the queso dip appetizer and I couldn't tell if it was \"real\" cheese or melted 'cheese food product'. It had characteristics of both which makes me think it might be a mix? I don't always like to ask questions about this sort of thing, because it puts the server in a weird position sometimes (people often 'shoot the messenger'). It tasted good though, isn't that what matters?"], ["Christina J.", "I've been hooked on the happy hour half-priced apps since they moved to the new location. I like everything I've tried BUT I tend to order the ceveche most of the time, it's delish. Went for dinner the other night and accidentally ordered an entirely vegetarian meal...and it was tasty! Black bean and roasted corn nachos, then goat cheese and mushroom chimichangas (you can ask for vegetarian rice, if you like) yum! The cocktail menu is nice, seems pretty modern, but I stick to margaritas mostly.     I like the new building.  It feels like the old spot, just bigger, cleaner and nicer than the old dining room. It doesn't have the same feel, the old spot always kept that \"fast food\" vibe for me...I remember ordering at the counter and waiting in those hard booths for food in plastic baskets and bussing my own table, back when they opened, years ago.  This is one of those spots I find myself at when I'm downtown with no destination, I know I will be happy when I leave. Enjoy!"], ["Ben M.", "La Parrilla is pretty standard for Latin American food in the midwest. Not bad but not great either. Last time I went I ordered the Carnitas Rice Bowl with pico de gallo. I would say the quality of food was about the same as Chipotle but you have to wait much longer for it to get in your belly. The Carnitas lacked the depth of flavor good Carnitas have and the vegetables were decently prepared. The chips were a bit stale and the salsa a tad runny. The coffee was ok. Overall this place is nothing out of the ordinary and you should not expect more than a standard Latin American restaurant. If you're in a hurry you can get the same quality of food much faster and cheaper at the Chipotle down Mass Street."], ["Jaymie J.", "This is the second time my husband and I have been here. Both times the service has been horrible. Tonight we got sat and it was 15 minutes before anyone even took our drink order and another 10 minutes before they took our food order. The food is just ok, definitely not something I'd crave and I love Mexican food. Needless to say, we won't be back."], ["Joi B.", "You can see by my previous reviews that I used to be a regular here. Hell, I was once called out on Bedford Avenue in Brooklyn by a girl who used to work the counter at La Parrilla. She may have even shouted out my regular order, too. If any of you want, you too can call me tofu bowl. I won't mind.Anyway... there's been ch-ch-ch changes... my first time to La Parilla since the change to full table service. Normally, I'd say such a change is for the better, as I prefer full table service to ordering from a counter and then trying to find a seat. But I'm slightly sad about my recent experience, and I guess I'm missing how it used to be.The positives:I love what they did with the decor! The bar is really lovely and the environment is much more inviting. I love seeing giant jars filled with things pickling and fermenting. And I prefer ordering from a menu to squinting with my lousy eyes to see a menu board so far away.When the K and I arrived the other night, the gal who greeted us seemed disgruntled. It's OK, we all have bad days, but it's hard to deal with such a first impression, even if you know you've been in her position before (I worked years in the service industry. I can relate, girl, but yeah, first impressions and all!) She seated us at the bar, while there were several two tops available. I just don't get why you'd seat a couple at the bar, but maybe that's just a me thing (I dislike sitting at a bar unless I'm alone. Reminds me of sitting at a diner counter or something. Ok, really, this must be just a me thing, come to think of it). If we weren't in such a rush, I would have asked for a table.So, you know that I lovvvvvve me that tofu rice bowl. As in, adore. So many times in Latin/Mexican restaurants, healthy options are scare and everything seems loaded with cheese and creamy things. I'm not made of stone, it's hard to resist and I usually end up feeling gross afterward (especially if I can't control my chip consumption prior to the entree's arrival). I will always be appreciative to La Parilla for having the rice bowl portion of the menu, because these are healthy and do not come with cheese (yay for vegans!)But, they were out of tofu. Ok, it's cool, restaurants run out of things and I'd never lower a star for that. After a lot of hemming and hawing, I ordered a grilled veg bowl. There is one other veg rice bowl option, corn and roasted red peppers. I hate bell peppers, so that was out. The waitress checked and sure enough the grilled veg bowl also has bell peppers and since it's pre-mixed, you can't leave 'em out. I figured I'd pick them out. I don't mind a bit of the flavor, I just can't consume them without feeling sick for the rest of the night. Verdict: it was OK--beans were tasty, rice was bland (one of the rice options isn't vegetarian, I think, so the rice is just a plain white rice with peas and carrots). The squash was quite bitter and the only other vegetables were the damn bell peppers and onions (which I also don't like in stir fry), so I ate about 1/4 of it. Luckily I poured a ton of habanero sauce on the whole shebang, because otherwise the dish would have been just too bland.Our waitress was really nice throughout our visit (same girl who greeted us unenthusiastically) and offered to wrap it up, but I figured why bother wasting to go containers on something I'd throw out anyway. I won't say that I wouldn't return, as I've had too many good experiences here. The menu is really creative and I probably should have just opted for something else, when told about the ingredients in the veg bowl. For now, I leave this review as a reminder to myself and others who also shun bland food (and bell peppers :)And my mouth *still* waters at the thought of that amazing habanero salsa (you have to ask for it--this is not the salsa they serve with the chips)."], ["Teresa P.", "This place isn't 'horrible' by any means, but I've really tasted a lot better latin american food. I've been totally spoiled by real mexican and central american food on visits to Mexico and El Salvador, plus I currently live in San Diego. So, I KNOW what good latin american food tastes like. But... this is Kansas. So, props to La Parilla for bringing some variety to Lawrence. Still, I expect more.I ordered the chicken mulato rice bowl, which ended up being a huge portion, but honestly, it didn't taste much different from a burrito bowl you can get a chipotle. And Chipotle might actually give a bit more punch on the flavor too. One of the girls at our table who ordered el chile relleno had a super duper sad looking chile relleno. Tempted to ship her the real stuff when I get back to San Diego. Anyhow, I'm sure I'll appreciate this place more when I become a permanent resident in Kansas, but this place isn't really cutting it right now."], ["Michael T.", "So-so. There are certainly better places to be had on Mass St, but as a Lawrence original, I had to partake."], ["Joe W.", "I had never been to a bad Mexican/Latin American restaurant until last week when I went to La Parrilla for the second time. The dinner didn't start well. I was served stale, cold chips that weren't even salted. The server talked way too quiet but did try to explain a special to me...something about an elk served flat on a platter.I passed on the elk and ordered the fish tacos. As I waited on my meal, I watched a server scrape the bottom of a bowl with a knife then lick it. Twice. The menu said the fish was beer battered, but I didn't taste a beer flavor, or any flavor for that matter-the pieces of fish weren't even crispy. The tacos were topped with a cabbage mixture that was really wet, turning the corn tortillas into soggy mess. Decent rice and a very dry pile of beans were served on the side."], ["Alexis R.", "La Parilla knows what they are doing.  After a relatively recent transition to full-service (from an order at the counter format), the food has increased in quality.  The chilaquiles is very tasty with only a mild spice and lots of chicken. I'm a big fan of their tacos- the barbacoa was excellent.  The carnitas filling was pretty fatty though, so I likely won't get that in the future.  The food is not Mexican - I consider it to more like Latin -fusion with some typical offerings with a new twist such as chimichangas with a creamy, veggie-mushroom filling.They have a nice selection of beers, offering microbrews from Mexico and Brazil.  I tried the Chupacabra amber and really enjoyed it.  My boyfriend is a huge fan of their magaritas.The seating outside is limited to two tables, but if your lucky enough to get one, you have prime seats for people watching and munching on chips and salsa before your meal.   Owned by the same folks that do Zen Zero and Genevese, they seem to have a formula that ensures success in the Lawrence market.They've started offering breakfast on weekends, so I'm looking forward to some trying their huevos rancheros soon."], ["Billie H.", "Have you ever been somewhere and once you were seated and ordered a drink realized you have been there, but another location before and really not cared for it. I was in Lawrence and walked by and noticed the Latin food sign. My interest was peaked so I stopped in. Once seated and after ordering my beer I was looking through the menu and realize I had tried the Olathe location and was not impressed at all. I sat there thinking if it would be rude to just pay for my beer and leave, but decided to try something. I knew I didn't care for the chimis so I went with the pork tacos. I have to say I was very pleasantly surprised! The pork was well seasoned, and the platter came with beans and rice. Both were standard Mexican dishes. I still do not understand the billing of this being a Latin restaurant. There are a couple of options on the menu that would be considered more Latin, but the menu is a standard Mexican menu. I will have to try the Olathe location again to see if the tacos rate as good as what I enjoyed in Lawrence. I will say based on my Olathe experience, do not try the fired chimis unless you really like fried tortillas, because that is about all they are. The restaurant in Lawrence is smaller than the Olathe one. When I was there it was not very busy so the smaller location did not seem to be an impact. The wait staff was so-so. I was offended at being referred to as a sir initially. Even though I have shorter hair, I have quite a large chest so I am not sure where the confusion came from, especially in a town with quite a blend of people. TMy waitress was the same person who greeted and served me and she was not overly attentive. The other staff moving around the restaurant was very friendly and talkative and made the customer service experience good. The location is on Mass street in Lawrence so parking can suck. You may be in for a walk to eat there."], ["Justin L.", "GoodLatinDishes thatAre mostly riceAnd meats. Add cheap drinks and perfect for dates."], ["Nicole M.", "Now that they've undergone renovation and have a bar and table service, this is one of our go-to spots downtown. The bar is nice, open view of the kitchen and they have great drink specials. Their peach margarita is tasty and not premixed like their house margarita which is premixed. Sangria is also delicious.Food-wise, my favorite is the enchiladas suizas. The tomatillo sauce is to die for! Their carnitas tacos are also good. The red salsa is also very good, a bit sweet with good cilantro flavor. The only \"bad\" thing here I've had are the ham and cheese croquettes. Not much ham or cheese, just tasted like a unseasoned, bland, fried mashed potato ball."], ["Ty O.", "La Parrilla surprised me because I didn't find anything too exceptional about the restaurant. The meal I had was a shrimp dish (Camarones a la Diabla). It was spicy, which I appreciated, but the flavor was 1-dimensional. Eating it wasn't exactly a chore, but the process became a bit mechanical -- fork to mouth with little variation to enjoy from its narrow flavor spectrum. Perhaps I should have tried a more representative item, though I liked how the menu offered some creative choices for adventurous diners. The beans and rice were just a touch too cool (temperature) and not especially interesting. The salsa I had was rather mild but with some nice flavors.The service was very attentive, the interior was clean and inviting (I understand that it was recently reworked), and the prices were good. I feel like I might have missed something because it didn't really surpass what I'd expect from an average Latin restaurant. It's certainly not a bad place to eat, but I somehow expected more from its reputation. Review: 3 stars."], ["Mia G.", "The food and service have declined tremendously since the move. I will never eat there again. Every time a friend drags me there, we wait forever for everything from water to the check. Often the food comes up tasteless and unappetizing. Come back La Parrilla! I miss the delicious food."], ["Erik F.", "La Parilla used to have a \"walk up and order\" style arrangement with minimal service.  I liked it - you got what you expected and paid a reasonable price for quality food without the service costs. After a change to their restaurant operation, they seem to have kept the \"minimal service\" but now charge more for services they don't deliver. Definitely disappointed.I'd been a La Parilla customer for years and appreciated the food quality and creativity. However, I had the worst dining experience I've had in years this afternoon while eating there. The atmosphere had totally changed. They seemed understaffed on a busy day, but the service was far less than what might be understood for a busy lunch hour  - it was terrible. There was zero sense of a \"service culture\" or protocol in the restaurant. The attitude seemed downright snooty. It reminded me of a trip I took to Eastern Europe after the collapse of the Soviet Union - it felt like the roles were reversed and the customer was there to serve the restaurant staff. We waited excessively to be seated. We waited excessively for service. I had to ask 3 times for the waitress to bring a side item we ordered. I was excited to take a guest there, along with my wife and children. I was shocked when the server (finally) brought our bill - I was automatically charged 18% gratuity  for the worst restaurant service I'd experienced in years. Though the food was still good, the dismal frustration my party experienced overshadowed everything. I do not plan on going back anytime soon unless the atmosphere changes.Hopefully they will improve their service. I miss the old La Parilla."], ["Logan S.", "I have eaten at La Parilla several hundred times and I would love to declare it to other yelpers as the best restaurant in town. Everything about LaPa is great, from the staff to the food, to the drinks. Margaritas are fantastic as are the housemade Brazilian lemonade and Sangria. the chips and salsa are really great, beware of the hot being hotter than your typical house salsa offerings. The guacamole is fantastic. As for menu items it is hard to find a favorite, and maybe harder to find something you don't like. The Jerk chicken is fantastic, the Parillas are easily the flagship item and well deserved of being the namesake of the restaurant. Fish tacos are delicious as well are the rice bowls. I would give the roasted red pepper and goat cheese chimichanga the crown as Lawrence's best vegetarian dish. stop reading this review and go try it. it's that goodThe specials are great too, always a nice rotation of limited availability items that are sure to please. The most solid 4 star restaurant around."], ["Carmen V.", "their online menu says the offer Peruvian, Colombian, and central American food, in addition to Mexican food. Once you get there, the menu is mostly Mexican food. It was good, but not what I was expecting."], ["David G.", "Since the move from counter service to table service, the quality of the food and experience has remained the same.  I was initially worried that prices or selection would change, but for the most part they haven't.  They still have daily entree and soup specials that, for me, are always a highlight of our visit.This is South American fare, not just Tex-Mex.  Expect recipe and styles of cooking from all over the region.  Standards such as enchiladas and tacos are available, but more exotic ingredients are included.  This place is extremely vegetarian friendly and you can order rice and beans without animal products upon request and the tofu rice bowl is a protein packed and complete treat.   If I'm feeling more sinful, I might get a portabella and Roasted Red Pepper chimichanga.   Salsas are tasty, but the chips aren't usually very fresh tasting; the guac is to die for!The service is generally speedy and friendly, and above average for a college town.   A great choice!"], ["Erin P.", "Mass street got some major cred when La Parilla moved in.  How often do you get a chance to eat at a Latin American establishment (as opposed to TexMex style)?  The fact that La Parilla has done so well and has become a mainstay for townies like myself shows that if you know what you're doing and you do it well, people will come even if they're like \"what the hell is Latin American cuisine?\" at first.Interestingly enough, I only gave La Parilla four stars because I really miss the old walk-up counter they had prior to the renovation.  I think renovating to the waiter/waitress style was kind of a mistake.  I used to just walk up and get what I wanted rather quickly, but now you have to flag down a staff person who also has to attend to several other tables.  It takes longer to refill my drink and my chips/salsa than it did when it was less \"fancy.\"Some of my favs include the horchata, the Brazilian lemonade, the portabella and roasted red pepper chimi and pretty much anything they happen to put on special for the day.  La Parilla, Zen Zero, and Genovese are all owned by the same outfit in case anyone didn't know.  I appreciate their willingness to bring some delicious diversity to downtown Lawrence and hope that La Parilla continues to do well."], ["Sarah M.", "I have only been here for breakfast but the food was great, service was friendly, and great atmosphere! Prices are not bad either!"], ["Clarice W.", "I really didn't want to not like La Parilla, it was recommended to me by several people and was one of the first places I tried in Lawrence. But after my second disappointing visit I feel more justified in writing about it...I mean, the experience is fine. Nice wait staff, attentive and friendly. I actually really like the remodeling, it's spacious and clean. But the food! The moment my plate came out I died a little inside. It looked like someone had splatted a ladle-ful of refried beans on my plate...15 minutes ago. Because it had hardened and become really pasty in color. There were dribbles of dried bean on my rice. And on the side was my poor little chile relleno, looking all the more limp and sad. I say sad because this is precisely how it tasted - it was so, so boring - bland cheese stuffed in an unseasoned poblano, with an even blander sauce on top. I'm not looking for fancy here, but I need flavor! I guess I should give them credit for underseasoning rather than overseasoning, the more common restaurant faux-pas. Still, it all left a mushy, heavy sensation in my mouth, one that I'm not eager to return to, even in writing. I don't know if I'm just coming on off-days, but part of me is not convinced this is a fluke because of my first poor experience. At the very least, if you want to give La Parilla your own go, I can safely advise that you don't get the dinner specials - maybe opt for a rice bowl instead?"], ["Melissa R.", "To my suprise - La Parrilla has been totally remodeled.  They have the same tasty menu of Latin American delights but now offer waiter service at your table and a snazzy bar to sit at.  Everything on the menu I've tasted is delish!-Fave appetizers: guac and friend plantains-Fave entrees: tequila shrimp tacos, beef tacos w/ chimichurri sauce-Fave drink: $12 margarita pitchers on Saturday night"], ["Laura H.", "I've been to LaPa several times and have left satisfied each time but never wow-ed. Their bowls are VERY spicy but you can cool yourself down with their better-than-average margaritas. I want very badly to like La Parrilla more than I do, but I just don't. I would never veto a suggestion to go here, but I also wouldn't suggest it myself, ya know?"], ["Emily M.", "La Parrilla has changed, I dare say, all for the better. The new bar is slick, and now finally there is a (albeit small) place to hang out while you wait for a table, should you need to. The order counter has been replaced by sit-down service. The speed and quality of service are pretty good, all much better than the slow, clueless counter service of yore.Although La Parrilla touts itself as Latin, I would say the vast majority of the menu is derived from Mexico. Tacos, burritos, quesadillas (more American than Mex, obv) dominate, but there are arepas and rice/bean dishes with Central and South American origins. The value and prices are very good. A big bonus: La Parrilla gives you free chips and decent salsa with your dinner. In this day and age, a rarity. And they refill it. Portions are good sized and very filling. The rice bowls are delicious and savory goodness. Gals may be able to get 2 meals out of them -- guys will be full. My personal fave there is the Pork al Pastor quesadilla, with avocado. Creamy, meaty deliciousness on a plate.All in all, a notch more upscale than it used to be atmosphere-wise. But the same yummy Latin-Mexican-whatever south-of-the-border food they've always had."], ["Sarah G.", "I miss spicy food. I really, really miss spicy food.Even after visiting La Parrilla, I still really miss spicy food. Whatever salsa was given to me left a lot to be desired, and I'm wondering if midwesterners can even handle heat hotter than this. I ordered chile relleno, which was pretty damned good, but the rice and beans was so-so. What I really loved though, and what gives this place more than two stars, is the absolutely astounding strawberry margarita!"], ["Rain B.", "This is a great choice for the Gluten-free diner. Not only does the staff know what menu items are and are not safe, but they are also very friendly about it. Even more exciting: many of their items are gluten-free by default, and don't even require substitution. Jon and I both had rice bowls, which were very filling, large and tasty.  My rice bowl turned into dinner and breakfast for me, plus three meals for Pixel (my puppy), since there was more than I could eat and we were traveling.We were able to sit outside with our pup, which was quite nice, and the atmosphere was pretty good.I would be giving this spot five stars if it weren't for the nearly 40 minute wait Jon and I had to sit down.  I'm not sure it's their fault, and they were very friendly about it, but it would have been nice to have a spot to sit and maybe some drinks or something while we waited that long."], ["Ben E.", "$2  Great Margaritas on Mondays... need I say more?"], ["Rachel M.", "Mmmm, this will always be on my top 3 go-to's for Lawrence!  The Latin Cuisine is affordable and very delicious.  I went with a fairly large group, and while it took a little bit to get seating, it was well worth the wait in the end.  Our group got the queso and the plantain chips with black bean dip for appetizers, all perfect.  For my main dish, I tried the Beef Flautas and loved it!  Everyone else in the group liked their dishes pretty well!"], ["Meg L.", "Ya know, I have noticed that this place just isnt as impressive as it used to be.  I used to love it. We went in this weekend on Sunday, and ordered the Jerk Pork Bowl.  Literally, I have had more meat in a chicken nugget than what came in the entire serving of this special.  Literally, there was less than 1 cup of NON rice ingredients, and less than an oz. of meat.  It was mostly grilled onions. I know this place isnt expensive, but its still 8 bucks plus drink and tip, and I get more bang for my buck and more meat at fricking Noodle and Co.  My boyfriend ordered the green chili pork bowl and it also, had almost no meat in it.They need to work on things in this joint."], ["Christina M.", "La Parilla (Spanish for \"The Parilla\") was my first dining experience in Lawrence many years ago when I began coming out on the weekends to visit all my high school friends who had started college at KU. It was then that I first discovered the joy of a very special beverage called Brazilian lemonade, and the restaurant has had a vice grip on my heart ever since. A lot has changed since then. They no longer have a walk-up ordering system. You're seated at a table and served by waitstaff, and they now offer a full bar. The atmosphere has also changed from a very casual eatery to one that has become significantly more fancy and/or schmancy. The quality of their food hasn't changed at all, though, and that's a very good thing. It may actually be my favorite restaurant in town, although it's a very tight race between this and the Burger Stand at the Casbah.If you ever talk to anyone in Lawrence about La Parilla, probably the first thing they'll mention is how much the food isn't Mexican. It's *Latin American,* and that's apparently such a big difference that people need to make a big thing out of telling you so. Whatever. That's really so far down the list of things you should know about La Parilla that it makes me facepalm every time someone says it. Stop being a pompous ass and get to the good stuff already. What you DO need to know:1) The food is delicious. They serve a lot of the same things you'd find at a Mexican restaurant, like enchiladas, quesadillas, chips and salsa, and even sopapillas. The difference in taste is pretty easy to spot, though. Much of the food here is a lot lighter than traditional Mexican fare, and the ingredients tend to taste fresher. I recommend the quesadillas suiza and the Salvadoran enchiladas. They also have unique foods, like their rice bowls and their plantain chips with black bean dip (both of which are amazing, by the way) that help to set them apart from other places.2) The beverages make me want to cry. Like, in a good way. Tears of ecstasy. Most of the time when we go out for Mexican food, I get a margarita. It's just what you're supposed to do. Here, however, I always forgo the tequila-y goodness for their non-alcoholic drinks. As I mentioned earlier, the Brazilian lemonade is my absolute favorite. Surprisingly, it contains zero lemon. Kind of like how a Long Island iced tea has absolutely nothing to do with tea, which I didn't know the first time I had it. That came back to haunt me. But that's another story for another time. A Brazilian lemonade here is actually a concoction made of lime juice, coconut milk, and ginger. Since they leave out the condensed milk in theirs, I could still drink it when I was vegan, which almost made me faint with relief. Last night, I also finally got to try their horchata, which is also fantastic. It's less rich than the Brazilian lemonade, but still very sweet and refreshing.3) The prices are super reasonable. The boyfriend and I made it out of there last night for about $30 with tip, and the portions are generous enough that we each had leftovers.I would easily be able to eat here a few times a week and not get tired of it, if that sort of extravagant eating-out budget was within my means. As it is, we probably go every couple of months or so, and that's not nearly enough, in my opinion. Even when we're not making regular visits for dinner, I have been known to stop in just for a Brazilian lemonade to go. However, I will neither confirm nor deny rumors of my having driven from Kansas City to Lawrence on multiple occasions just to get one. (Hypothetically, though, if I HAD done that, it would have totally been worth it.)"], ["Mike H.", "Maybe this place is best not experienced during lunch hour. My first visit was last week on a Thursday around 12:30pm. There were 2-3 people in line in front of me, but it still took at least 5 minutes before I got to order. I ordered their taco lunch combo. Got some chips and salsa to tide us over until our meals came out. I noticed nothing amazing about the salsa, typical salsa to me. My tacos were not quite what I expected when ordering beef tacos. I got corn tortilla, strip beef and some green sauce. Then green sauce worried me most, but it was actually what made the meal edible. While the dry meat and corn tortilla did nothing, the green sauce gave it some tang and spice. The tacos were served with plain re-fried beans and bland rice. My friend commented his tamales were pretty tasteless. There were some other dishes I was tempted to try here, but I don't know if I will bother going back after a completely forgettable first meal."]]}