{"Yuki Restaurant of Japan": [], "Kiku Japanese Steak House": [["Kristin P.", "We go to Kiku every time we have something to celebrate. We have been to many hibachi Japanese steakhouses all over the country, and none have come close to the deliciousness that is Kiku. The fried rice is yummy and the filet is tender and melts in your mouth. The veggies are seasoned perfectly and the sesame chicken is sweet and savory. They toss shrimp in the air for you to catch in your mouth. The sherbet finale is an excellent palate cleanser. If you have trouble choosing what to order, I recommend the filet, chicken and shrimp combo. It's enough to share, or take it home. Leftovers are amazing in a skillet with a little butter, reheats very well this way. For a lighter dinner or lunch, I highly recommend the sushi room. Excellent sushi in Topeka! You can order sushi at the hibachi grill, too. The owners are wonderful and friendly, they know us and always come over to visit. They've watched our kids grow up!"], ["Shannon E.", "I use eat here every Sunday. I'd drive an hour there and back but it use to be worth it. In February for  Valentine's Day I ate there and ordered the steak and lobster and the lobster tasted absolutely horrible.When I told the manager and she tasted it she said oh it needs more lemon. I left irritated but assumed they had a bad night. Fast forward to tonight. We hadn't eaten here 8 months.I got the steak and lobster again to go home for my mother in law and the lobster tasted ABSOLUTELY HORRIFIC AGAIN!This time I told the manager and the chef and has them smell it.He said \"oh that's was lobster smells like.\"Lobster is not suppose to taste or smell like rotting fish. I told him that I do not want to pay for the lobster and he said if that's the case I cannot take any of  my food with me. A 150$ meal ruined by a money hungry business. I am so disappointed in you KIKUS.You have forever lost a valued and adamant customer who use to eat here weekly and recommend you to everyone. Turns out every single person at the table was not satisfied with their meal after they heard me express my disappointment. You guys may have been labeled one of the best places to eat in Topeka but you will forever be the worst in my book from here on out. The only good thing about tonight was the server. She was only 16 but an absolutely sweetheart and a doll but because of how poorly I was treated I bid you farewell KIKUS. Get some new management and maybe I'll consider coming back.'Sincerely,The Pissed Off Blonde in the Striped purple shirt in the back of the restaurant."], ["Brea B.", "Can't go wrong with the filet and shrimp. All od the food was fresh and delicious. Always look forward to the next trip there."], ["Kathryn K.", "This is a fun spot for larger parties or a date night. The food always tastes great, though it can be a little pricey. I do wish they'd update and improve upon the decor here though. I understand mood lighting, but I've been there a few times where I feel like the only illumination is the fire in front of me from the hibachi! Definitely depends on the cook you get as to the kind of experience you'll recieve - some put on more of a show than others."], ["Dezeree H.", "I tend to think hibachi grill food all tastes the same. This restaurant is no different.  It has your standard hibachi grill offerings and they are well cooked. The service was excellent and our chef was very good. What I think us really good about this place is the price. You get a lot of food for the money and its way cheaper than places in Lawrence or KC and it has better service."], ["Sallie E.", "I moved away from Topeka 5 years ago. I've always loved Kobe now Kiku. Took a friend there who had never been before on Saturday, February 15 2014. They messed up our reservation. We finally got seated. Our table and grill had rice left on it from other meals. Our cook was just going through the motions of cooking for us. The food was just so-so. Sorry to see this happening at my fomer favorite place."], ["El D.", "This use to be a place for special occasions. People dressed up and service was impeccable. Now? Customers in shorts and t-shirts. Dirty floors, dirty walls, dirty menus, everything smells like a grease fire, dimly lit and very loud. A difficult walk for my grandparents from the parking lot, through a mini-mall and into the restaurant. Waited at our table 15 min to be asked our drink order. Miso soup was bland - one sliver of mushroom and a few specks of green onion. Salad with ginger dressing - salad needed chopped smaller and dressing tasted bitter this time. Glasses were empty before refills were offered. Chef was great. What I would expect for a teppenyaki steak house. He did all the tricks and was personable. Plentiful fried rice, although the scrambled egg was singed. Great veggies. Strip cooked MR. shrimp and scallops were great. Chicken was overdone. And yes, it all kind of tastes the same and is a big messy pile of food on your plate when it's all served. The sauces were not offered this time, you had to ask. Fork tines were bent. Chopsticks were not included or offered. The sherbet dessert was - sherbet. My mouth stills tastes like MSG. Spent about $20 a person. If you've never been? Go and have fun. Overall, this restaurant is better as a memory for me. I won't be going back."], ["Amanda M.", "Gave this place 3 stars. Took my family here hoping it was awesome but it was far from it. It was hot in there so not sure if air conditioner was working and the guy who cooked the food didn't interact with us at all. The chicken that was cooking on the grill was popping and splattering me. The food tasted all the same and we ordered a variety between chicken, steak, shrimp. The sushi however was fresh and was excellent."], ["Michael B.", "nice japanese ambience. kind of dark and romantic. although a bit worn and run down. hostess and waiter were pleasant and communicative. hence not a two star.Food Quality:  i ordered shrimp special roll, unagi hand roll, caterpiller roll and since I paid $27, I was expecting some high quality rolls. but was a bit disappointed. the eel is definitely NOT fresh, and from a can. I got some canned eel before since I was on a college budget and thought that how bad could it be compared to fresh eel, and I quickly gave that up. It was bad. So now I can tell the difference immediately. and the imitation crab they use is imitation. The sauce they use is a generic teriyaki sauce i think that they substitute for eel sauce. Bottom line - Don't come here for the sushi if you've had good sushi. I didn't try the steak. Maybe that's where its at?"], ["Matt L.", "Not bad not great. Bit run down, table was pretty wobbly. The service was not so great. It took over 10 minutes for us to be asked what we wanted to drink. And waiter was chewing on...lunch? While asking us. Food was ok, steak teriyaki was very good, best of what we ordered. Cook was very friendly and polite. Waiter may have been having a bad day, who knows, but very slow and the place was empty."], ["Dan W.", "I enjoy taking my whole family to Kikus. My son loves the fire and the show. Due to the price I tend to make this more of a special trip kind of place.  Building does need an update to the decor."], ["Ty A.", "The atmosphere as you come in definitely leaves something to be desired... but what more can you ask for from a place inside a mini mall. Once inside the decor is better if somewhat cliché. The show is entirely dependent on which of the chef's you are lucky to get. I would say that they range from solid 4 level cooks and showmen to some of them on the 3/2 threshold. The food itself is always the highlight. It's great and always plenty of it for the price point."], ["Txaguas W.", "Stopped in while on a business trip.  Service was very good - attentive but not smothering.Sushi was good, decent cut of fish. Tuna roll was average and the California roll was more than I expected.Two rolls, two sushi and a glass of wine for under $24."], ["Thad J.", "In the spirit of total honesty, I have to say: I love Japanese steak houses. I like the food, I like the show, I like having shrimp thrown at me. But not all steak houses are the same. A lot depends on the staff, the chefs and the freshness of the food.Kiku Japanese Steak House is located in a mall but that shouldn't discourage a visit. The atmosphere is wonderful and makes you feel like you stepped into another world. There are several dining rooms with multiple cooking tables. The lobby doubles as the cocktail lounge and sushi bar. There were several couples enjoying the sushi offerings. Everything looked delicious.The decor is very traditional and beautiful.We were quickly seated with another family. The server handed out menus and took our drink orders. He returned quickly with our beverages and took our dinner requests. Soon, the chef arrived with a cart filled with our food. He confirmed each person's order and started the cooking show.I've been to many Japanese steak houses and seen some fantastic chefs. This was not one of them. The food was perfectly cooked. Rice, vegetables, shrimp, chicken, steak; each was seasoned and cooked to order. Fantastic flavor. However, the show was not impressive. Generally, the chefs put on a spectacular presentation complete with humorous lines. Our chef was a little disappointing.I was prepared to lower my rating until I saw the chef at the next table. Very entertaining and flamboyant! He was spinning knives, flinging shrimp, drumming pepper grinders and building an impressive onion volcano. (If you don't know what I'm talking about, visit a Japanese steak house)Overall, I was impressed with Kiku Japanese Steak House. The staff was very friendly and attentive. The food was fantastic. Our chef was the only slight disappointment."], ["Lisa H.", "This restaurant is located IN a strip mall, like you actually had to walk in the mall.  It's a pretty standard hibachi restaurant.  They start you off with mushroom soup and salad, then A LOT of fried rice (eggs and soy sauce), veggies, shrimp appetizer, then entree, and lastly (my favorite) sorbet ice cream for dessert.  I had the filet with shrimp combo, and it was A LOT of food, but it was very good, a bit salty, but the filet was very tender and cooked perfectly.  There's not many good non-chained food options in Topeka, and I wouldn't mind coming back here if I'm ever in town again."], ["Jeanine W.", "Food was good.  Although no sauces were offered & nothing special in presentation.  Waiter service was horrible.  Very rushed.  He was bringing takeout boxes & sherbet within 2 minutes of chef leaving table.  Never were offered refills on drinks or dessert.  This used go be a special place to eat & enjoy a nice dinner/ special evening.  Tonight felt like a fast food carry out restaurant.  So sad to mark this off of places to eat in Topeka."], ["Bobbi S.", "Food is amazing and it is so much fun!"], ["Keshia M.", "Absolutely delicuous. I had the seafood trio and my husband had the chicken and steak combo. Before the food is cooked, they bring out a small serving of Miso soup and salad. Once the meal is complete, they bring out orange sherbert icecream for dessert.  Everything was cooked perfectly and the staff was very friendly."], ["Edith T.", "If you're ordering sushi, they start you out with miso soup and salad. The miso soup was good, the salad with thousand island dressing was watery and bad, which worried me. But the sushi we ordered was AMAHZING! We got the Jojo 2, Alaska, spicy shrimp and sweet and sour roll. While I didn't like the sweet sour roll (raw salmon on the top, nothing sweet about it), my mother did like it. We also got a free spicy tuna roll from the chef! Except for the watery salad and my choice of sweet sour roll... It was overall great!!"], ["Tod S.", "Bad service!!!!!  So they even know we r here????  Uh no, I do not recommend this place to anyone.  Food was mediocre at best and the staff was non existant."]], "China Pavilion": [], "Crawford Wayne Siding & Window Sales": [], "Kyoto": [], "Ling's Café": [["Carol G.", "It was a sad day in Topeka when Sun's Chinese closed. However, Ling's is filling the vacuum nicely and has shot to my #1 favorite Chinese restaurant in Topeka. The food is fantastic, it's plated beautifully and served by a great wait staff who really cares. The dining room is teeny and almost always full but it's decorated tastefully and lends to a pleasant dining experience. And the prices are great - lunch specials under $5 and dinner under $7. This is definitely a hidden jewel in North Topeka. UPDATE: After being closed for months on end (and scaring us that they were not going to reopen) Lings has come out of the cocoon, bigger and better. We visited the Monday after they opened and were very pleased with the changes. There is now a buffet selection with at least 40 items to choose from, along with a Mongolian Grill to give HuHot a run for their money, AND a Sushi selection. They also have a giant dessert \"boat\" and ice cream in cute little pre-packaged containers in a freezer near the restrooms. There was genuinely a great selection. I've never seen Egg Foo Young on a buffet. They had it along with many other tasty dishes. And, the price was just $6.29 for lunch and $8.59 for dinner - plus, they have their old menu to choose from as well. I still love them and hope Ling, the owner, can maintain the quality she's served up so far. Can't wait to go back!"], ["E P.", "Not just a Chinese Restaurant and all you can eat buffet, Ling's Cafe offers food for every taste. The buffet includes appetizers, two soups, a large variety of fried rice and noodles, a larger variety of entrees, salad bar and dessert bar. The menu selections include a diet menu as well as dinner combination platters, sushi bar and chef specialties. The restaurant is open for lunch and dinner. The night we visited, there was a steaming pot of crawfish as one of the selections, several varieties of egg rolls and spring rolls, and twice baked potatoes. I'm not a big buffet fan. I usually find buffet food to be just above warm, but the temperature of the food on the buffet tables is good. Prices range from $6 for lunch on the buffet to $10 for some of the Chef's Specials from the menu. Price for dinner buffet is $8.99. The restaurant was very clean. Lots of booths or tables. Areas are separated for privacy, so that you don't feel like you are in a big room. There is a separate large room for meetings. Wait staff was prompt for beverages, refills, and clearing the tables. Food was replenished quickly on the buffet tables."], ["Jesse O.", "Limited selection and items w congealed, concentrated sauces that i literally had to spit out. Never seen crab ragoons w no cream cheese in them. The cucumber salad was amazing though.Also, while they do have many items, they are for the mongolian bbq or desserts or american fanfare. I went there for classic Chinese. They had no beef and broccoli, no moo goo gai pan, no cashew chicken. So i will not be going back."], ["L E.", "Lings is another treasure North Topeka has!! There food is always hot and fresh. The owner and staff are very pleasant friendly people! Lings is the #1 place for Chinese food in town. They were open on Christmas and Thanksgiving and it was awesome!! A very nice break from traditional food at that time of year and one could not avoid thinking about the scene in Christmas Story when that is where they ended up eating Christmas dinner :):)Keep up the good work Lings and thanks for being consistently great!!!"], ["Sugar D.", "Very good buffet for all the Chinese food lovers! Employees are very nice but could refill your cup more often and give you more than one napkin."], ["Prima D.", "We went to try out Ling's soon after they opened, and were pleasantly surprised; the prices are in line with other local restaurants (reasonable), but there were lots and lots of good fresh vegetables, and the sauces are all top-notch (for example, egg foo young got a good brown sauce, not prefab gravy like other restaurants in town use). Service is fast, storefront is small but hospitable and nicely decorated. Let's just say that in this semi-rural area, a farming co-worker insists on going to Ling's (which is further away than other restaurants) for lunch because the food is fresh and real..."], ["Andrew C.", "Ling's has fair prices, and a nice assortment of cuisine. Sushi could taste better with Japanese pickles. Tempura would be nice."]], "Kokoro": [], "University Chinese Buffet": [], "Oriental Express Restaurant": [["Dallas B.", "Oriental Express never disappoints.  The Yum Yum Roll is to die for...fried, creamy \"sushi\".  Yum!  The pan fried noodles and sesame chicken are always on spot.  The service is good, but sometimes awkward.  Take out is great because they package everything up nicely.  I also love the cleanliness.  The last I knew, this is a baby restaurant of Jade Garden."], ["John G.", "As a rule, I am a bit wary of places that attempt too many culinary paradigms. Originally, I ate at Oriental Express with some hesitation and would have gone somewhere else if it hadn't been Christmas Eve. Two days later, I ate there again with enthusiasm and would have again if my vacation had been longer. Alright, so first off, this isn't the world's greatest Asian food. It is an express, a fast food place with a bit more class. If you're expecting gourmet, you'll be disappointed. On the other hand, they do everything well; Chinese, Japanese, Korean, Thai has all been great. Lunch portions come with rice, choice of soup, a few pieces of tempura veggies, and an eggroll or crab rangoon. Some of these sides are uninspired, possibly from-frozen, but the soup and tempura were both delicious and better than I've had at much more expensive eateries. The second time we went we ordered these in the appetizer sizes and they were massive. The 5 dollar tempura appetizer was literally heaping and came with three different sauces (though, ironically, no tentsuyu or tempura sauce).Everything I tried was at least good, but my favorites were the Korean dishes, Bulgogi and Spicy Pork. These were absolutely stellar. Richly flavorful, with just a little heat and that classic Korean barbeque flavor that melts in your mouth and is complemented beautifully by the onions and peppers. Fantastic stuff, and much cheaper here than anywhere else I've had. Other, more standard, offerings were good as well. The Sesame Chicken, for example, was nice and crispy with a great sauce that was sweetly sesame flavored without being cloying. We tried the sushi, too, but sadly just one roll. (We were still skeptical when we ordered.) We got the Yummy Roll which turned out to truly live up to its name. If I remember correctly, it was a spicy tuna roll deep-fried. Really, it's the deep-fried part that makes it. The warm, crunchy, cream-cheesy and fishy taste to it may sound weird, but it absolutely works. I almost ordered another one to take home. The sushi menu is very extensive and has a lot of innovative creations that I can't wait to try. The portions of the rolls aren't huge, but that gets balanced by the relatively low prices. Oriental Express is a fantastic place for a cheap but delicious Asian meal. With tons of options, great portions, and fantastic service, everyone should find something here they can enjoy. It has definitely earned a spot on the short list of places I will patronize every time I visit Topeka."], ["Roy D.", "Normally great service. Today: a dud. Slow waiter. Took forever to get sushi menu. Water refill?  Forget about it. Not friendly. And , not getting a tip."], ["Katie L.", "I went here on a random day where my cravings for a sushi bar were overwhelming... I read what reviewers had to say here on Yelp and I agree with most people when they say this has got to be one of the best places for sushi in Topeka! I ordered the Yummy Roll - it was absolutely delicious. My boyfriend ordered the Missouri Roll - he and I both agreed that it had a strange, fried texture that we weren't fans of. I'm sure I'll be returning for more of that Yummy Roll in the near future. :)"], ["Monica S.", "This place is a much better value at lunch- too expensive for what it is for dinner, and the lunch and dinner portions differ in layout and size. The sweet & sour chicken lunch and Pad Thai lunches are good. Lunches come with a cup of soup of your choice, and crab ragoon or egg roll. Most lunches are under $7."], ["Carol G.", "We have been to this restaurant several times. Service isn't always spectacular but we have never been dissatisfied with the food. It's small but service is fast. We'll be going back again and again."], ["Dan L.", "Solid chinese food restaurant! some of the quickest, freshest, tastiest chinese food in town. Although I agree that they do not cook \"authentic\" chinese food, they certantly do a better job of plating something edible than any other joint in town. Lunch specials are hard to beat."], ["Justin M.", "They have some really good food here and have never been disappointed. Lo Mein is good, fried rice is good, crab ragoon is good and have had many other things from there that is excellent. They have a HUGE Sushi Menu, that have always been good as well. They even have a drive thru if you don't want to sit down."]], "Cryster Asian Diner": [["megan c.", "Went there for the first time tonight and was pleasantly surprised! The staff was so friendly and accommodating while we waited for our take-out order. Our food was ready promptly and was delicious! Can't wait to explore the rest of their menu!"], ["Bryan B.", "Crysters is my favorite restaurant in North Topeka.  The menu has a nice variety including sushi, korean, curries, pad thai...., The dishes you expect at this sort of place such as fried rice, orange chicken, and hot and sour soup are better than any buffet place.  The service varies depending on who is working, but  usually it is friendly and helpful without being annoying.  The manager frequently visits with the patrons and has been known to make something special or change some dish on the menu, which is a real treat.My personal favorite is the bibimbap, though I think they spell it differently on their menu.  It's always good though the last time I ordered it they didn't pre-heat the bowl which really adds to the flavors and the experience.I'm not a sushi expert, but it is as good as any I've had in the area, though it isn't served all the time. My family enjoys ordering the Topeka roll."], ["Justin G.", "We have eaten here twice since Christmas. Both times have awesome. Fresh and creative sushi. Plus awesome Pad Thai. It's a must eat for Topeka."], ["Jerry L.", "We went in about 6 pm and there were only 3 or 4 tables full.  A person walking by said \"sit wherever you want to.\"  Some of the tables were dirty and we chose a clean booth.  The waiter asked if we'd like something to drink, and when I asked about the bar, he said \"there is no alcohol,\" so my companion and I ordered water.  We placed an order for wontons, the red curry thai dish, and the four treasures (pork, beef, chicken, garlic) with vegetables in a szechuan garlic sauce.  All the food was large portions, attractive looking and delicious.  My companion had the steamed rice (comes with) and I chose the fried rice ($1 extra).  The things that bothered me 1) waiter who was always in a hurry and didn't smile, laugh or seem the slightest bit friendly; 2) one thin napkin each...had to leave those pesky drips from the wonton sauce on the table.  3) no spoons - had to  double dip those wontons, nothing to spoon the sauce over the food 4) no knives - there were some pretty large pieces of meat and vegetable there that I had to eat whole.  5) no real serving plate......the entree comes in a large bowl thing, and the rice comes in another bowl thing.....I am used to having a plate where I can combine some of the rice and some of the entree....and perhaps sample my companions meal as well.  I really thought this arrangement was odd.  By the time we left, maybe 6:30-ish, the place was fairly full, and I think there were only 3 people working - 1 in the kitchen and 2 on the floor.  I think they may have a decent take out business and delivery as well.   We'll likely try it again, but we'll definitely try delivery.  For an average Chinese restaurant, I thought it was a bit pricey - $30.55 for our two meals, an order of wontons, and water."], ["Lesia M.", "My family was very excited when an Asian restaurant was opened out in north Topeka area. I absolutely hate this place if I could give it negative stars I would, all of their good if overcooked and their sushi is a poor attempt at a popular item very sloppy and ingredients are low quality. Rude staff terrible food."]]}