{"Tup Tim Thai": [["Eddie V.", "COME ON!! I ate here again for a post-easter celebration and things were averagely good, meaning there was nothing bad. Spring rolls average, fried spring rolls unexceptional, everyones food alright and the bitchy phone-hostess wasnt there...BUT, last night i called in a pick up order, as i thought i would give it another go, and MAN was i disappointed! First off, the bitchy phone girl did not answer the phone, instead the woman on the phone was very pleasant. Ok great. Plus half a star. I ordered pad thai, as i thought id try something i hadnt had in a while. Well, THAT was a mistake...MY bad! Plus 1 1/2 stars for the fresh spring rolls i received. As i am sure you have read in my previous review, they had been terrible lately (which is unusual). But this time they reminded me why i keep trying...the spring rolls were strangely deformed looking, but they had all the proper proportions! Sadly, this is the last good thing i have to say about my dinner. The pad thai is terrible! Its full of peanuts, waaaay too many peanuts. I know pad thai includes peanuts, sometimes i even order extra peanuts (at other restaurants) but DAMN! This was unnecessary, just excessive. It also has a TON or onions in it! I really wanted some tofu and noodles, sadly, i had to settle for peanuts and soggy onions trying to trick me into thinking they were noodles. Also, yet again, my to go order was lacking in size. When we go eat at tuptim my wife and i can easily share an entreé, but when we get a carry-out order...forget it! They are so small that one entreé often leaves me hungry afterwards, which pisses me off cause it aint \"Dillons chinese food\" price! The inconsistency here is just plain insulting! I really want to give one star only for this review, but i am sticking to two stars because of my previous meal here and because of the spring rolls and the lack of bitchy-ness. P.s. The pad thai tastes so unappealing that i cant get the taste out if my mouth and i cant get rid of the heart burn."], ["Lesia M.", "Has been my favorite restaurant of all time for 6 years......Until our last 2 visits, I eat here often enough i feel I know when my food is cooked well. We always get money bags, spring rolls, soya bean noodles w/ shrimp,cashew nut with chicken,sometimes we will try a new item and always in the past, even if it wasn't spot on, it was still better that any other thai or asian food place. Well this was not the case...... My shrimp had been overcooked, fishy,rank tasting/ inedible, noodles greasy and in clumps, money bags sitting in a puddle of grease, my husbands food was fine the time before and i just kept it to myself this time I tried to talk to a manager to make them aware because if they don't change it we will feel forced to stop coming here to eat. No manager had time to talk to me after four friendly attempts so guess what I am giving my first 2 star rating, I'm actually sad that management really doesn't care what a loyal customer has to say, i may not ever go back:("], ["Tami A.", "My new favorite restaurant! Clean, fast, friendly and most of all fresh ingredients!"], ["Dan L.", "Thai cuisine should be fresh, healthy, explosively flavored, and last but not least no where near mainstream American-Chinese food. Tup Tim meets 3 of 4 of these requirements, enjoy your visit and tell me what's missing."], ["Slim S.", "I had not been to the new location since the last time I came to Topeka in 2010. The food is still amazingly awesome and the service was even better than the last time. My dad had me try the hot tea this time and it was so good. My Thai basil with chicken was so tasty. I wish the proprietors would move to San Diego!!"], ["Rachel B.", "Another great time at Tuptim Thai, as I write this while sweating at my desk at work, eating my leftovers from last night. I now have two new additions to my favorites list for this place: Thai Spicy Peppercorn and their iced coffee. YUM YUM YUM YUM!!!!"], ["Martin B.", "Great Thai food in Topeka. I recommend the chicken pad thai with the spice tray on the side, and sticky rice mango for dessert."], ["Caitlin H.", "Absolutely delicious food and great service makes this my favorite restaurant in Topeka. Love to order their sampler appetizer with money bags, crispy fried spring rolls, and fresh spring rolls with tofu phad thai."], ["Andrea S.", "I've never been disappointed in Tup Tim Thai. I frequently bring out-of-town visitors here. They're always accommodating. Vegetarian? Gluten-free? Craving it super-spicy hot? All you have to do is ask. Favorite dishes here are their Pad Thai and the Panang Curry."], ["Nicholas G.", "In my opinion, this place has the best Asian food in Topeka, and the Thai cooking is better than most of the Thai resturants in Lawrence and Kansas City.  Menu is pretty standard Thai restuarant offerings, but they are prepared very well. My kinds love the money bags, and someone in the family almost always orders the cashew chicken.    I've never been disappointed here."], ["Sarah M.", "This place is pretty neat. I really enjoyed the atmosphere. It's quaint and authentic. The staff are very friendly and are able to handle a big crowd. The only issue I had was the pad thai was lacking in flavor, but other than that, I would definitely recommend this place."], ["Laura Y.", "Five star potential!  The food is really good. Medium is on the edge of too spicy for me, but Thai is always like that. Green curry was flavorful and decent value for the amount of food. The jasmine rice was a little clumpy. By far my favorite part of the meal was the dessert special of sticky rice and fresh berries...oh my goodness!!! So good (again with the clumpy rice though!). So why only three stars? Mr. Hosty Hotpants, do yourself a favor and learn the specials so you can just tell a customer instead of telling her to get up and go look at them herself. Rude and way too casual with the attitude. And, no it isn't because you are gay, it is because you were snooty and then lounging and chatting with coworkers.  And second,  my server...I think you said two words to me. I was going to have some soup and maybe salad, too, but you took my menu and left after I ordered my entree...what the heck? I watched everyone else being treated pretty nice, but you were aloof and had this annoying habit of putting my dishes on the edge of the table instead of in front of me?! To the chef and owners, good food,  sad your staff left a bad taste in my mouth."], ["Carl E.", "This restaurant is pretty pricy for what you get.  I had hot and sour soup and pad thai.  The soup was very good and gets this review the third star.  The pad thai was skimpy for the price and not particularly memorable.  The service was so-so."]], "Thai Siam": [["Holly G.", "The food is DELICIOUS.But they don't care at all about their customers. They are EXTREMELY rude and could care less about you individually.ONLY DO TAKEOUT UNLESS YOU HAVE A LOT OF TIME TO SIT AROUND. If you dine-in they will serve you last."], ["Cherry Y.", "The best thing is the duck noodle soup... But the environment is not so good,, kitchen is connected to dining space"], ["Melissa T.", "\"Dear Thai Siam,You were my first thai experience. I thank you for opening that door for my to have a full blown out love affair with thai food. Although I've had better thai than you since my first visit to you 5 years ago as I've moved away and spread my thai food eating wings, I will always remember the first time I stood there, looking at your board menu. I randomly picked #58 (i think that's the number - the beef kee mao), and I must say, my random pick sure was a good one. Your kee mao was delicious, and I thank you for that.Love, Melissa\"Ok, I really do have a great fondness for thai siam as it was my first thai experience. Their teriyaki chicken appetizer, which I do believe they refuse to make now, was delicious. Their crab rangoon - they're some of the best, if not the best in my opinion, in Lawrence (not saying much though b/c most chinese restaurants in Lawrence that would have crab rangoon SUCK - I'm sorry but it's true). Their yellow subway benches - how can you not love those? Their curries - too watery for my preferences. I like my curries thicker; their's was thin, soup even. For the most part though, their food has been great.Overall, I might give consider giving this place three stars if I had been there after I had better thai food at other fine eating establishments, but for giving me my first taste of a cuisine that I now love, the fourth star is certainly warranted. Further, if you're considering a rating based on location, (due to lawrence's lack of thai food) I also think that 4th star is warranted. The best in lawrence, I would say."], ["Ken K.", "Any Seinfeld fans? I know it's an old show, but it will help you understand my 'review'. The food is obviously really good, but watch out for the \"Thai Nazi\" / dragon lady. It is seriously just like the soup place in the Seinfeld episode. \"NO THAI FOR YOU!\" I have, on a couple occasions, had nightmares about her. lol. Great food, but do not look her in the eyes or you may turn into a pile of red pepper flakes.Now for a short funny/sad story:I was in there once and we got our order, but we were short a soup. So, I reluctantly and fearfully went up to tell them... one thing led to another... after a little yelling she ended up firing this young college kid on the spot. I felt so bad... like I was responsible for his termination (yet again Seinfeld episode where George gets a dude fired)... the poor guy turns around as he exits and says \"Welcome all to Thai Siam, best service in TOWN!!\" I couldn't eat the soup... it just sat there.Hope you found another, less stressful job."], ["Chirag R.", "Great food! The place is small and seems to be family managed, but it truly offers excellent food. They do get busy often, so it could take a while. But it's so worth it!"], ["Jennifer H.", "I do not ever want to be dragged back to this place. It was a recommendation, which is kind of scary. My panang curry was EXTREMELY oily. My friend's Mongolian beef was overwhelmingly salty, and another friend's dish was inexplicably sweet. Other reviewers have mentioned the booth that looks to be used as someone's closet/medicine cabinet/bed(?) It is indeed very off-putting."], ["Kavitha B.", "Loved the Thai Fried Rice. The place is a hole in the wall with questionable hygiene. But the food is good."], ["Drew F.", "So here's the thing: This place is unbelievable when it comes to the food. I ate there once a week when I lived in Lawrence (just moved a month ago). Everything I've had here has been amazing. I'm especially a huge fan of the Chicken Pineapple Curry. However, there are a couple caveats I want to put on this place.First, call your order in and get it to-go!! It's fresh food and most of the time they're really busy. So it's going to take longer. I know not to order from there when I'm on a time crunch.Second, they are not the friendliest people. I've been yelled at before by the owners for one of their employees screwing up, and I still went there once a week. In addition, since they saw me consecutively for 3 years, once a week, you would imagine they would have tried to remember my name? But again they're really busy, so I wasn't too heartbroken when they never remembered who I was. I can turn a blind eye to the service if the food is this amazing. However, I did stop tipping them after I was scolded by the woman owner. So if you get easily offended, I wouldn't really recommend this place, but if you don't, then prepare for some amazing and very authentic Thai food."], ["Alicia R.", "Yes, it does take awhile for your order to go through. Luckily, I usually come with friends when we're not quite starving and we have plenty of good conversation before the food comes. The old Subway tables are small, only fitting 4, so I wouldn't advise bringing a large group here. Meals are pretty big, I can comfortably eat 1/2 to 2/3. Make sure you check out the little whiteboard menu next to the register for more options! Most dishes run around $8-9. Info on food:Appetizers:Spring rolls - yum! peanut sauce with these is greatPaper-wrapped chicken - tasty, plentiful, but a bit messyFried tofu - not the best I've had, but not the worst, also plentifulEntrees:Massaman Curry - has chicken, very peanutty, my favorite, I think a safe intro to curryYellow Curry - similar to Massaman, also a favoritePad Sea Ewe - I like this one, haven't had in awhile, but goodPanang Curry - a bit spicier, sometime I like this, sometimes notPad thai - tasted better when reheated, but solid enough basic dishLard Nar - wide noodles and the sauce is a bit too thick for my tastesMoo Goo Gai Pan - eh, plenty of lovely vegetables, but sauce is very blandPro tip - order the Thai iced tea; it's not on the menu but is heavenly. Slightly smoky flavor with what I believe is cream on top. Yum!Ambience is not awesome - lots of Thai decorations (that part's nice) in a an old Subway, but the food is pretty darn good!"], ["Peter b.", "Really good food. This place used to be a Subway, so it has a weird feel to it; I always just get it for carry out instead. thoughts:1) the curry dishes are so good. I prefer the normal curry to the green curry, but both are good. I always wind up drinking the juice when I'm done because it's that tasty.2) at the same time, the curry isn't as filling as I'd like. I always get the beef and feel like there aren't enough beef pieces in it.3) A lot of people love the pad thai but I can't get into it.4) I also tried the 'lard nar' which i didn't really like--it was too bland. Apparently I don't like their noodle dishes much.5) Inconvenient hours. Not open on Sunday and they shut down between lunch and dinner."], ["Jeff T.", "Don't let the old bright-yellow Subway interior fool you, this is the best Thai and Chinese food in town. It's also the only place in town where theyserve \"Springfield-style Cashew Chicken\" or as my friends call it, \"Kentucky Fried Cashew Chicken\". Their Thai food is amazing too!"], ["Colin H.", "I'll go three stars here.  To parrot the sentiment from some other reviewers, the food is passable to half-way decent thai, but the customer service is a train wreck.  I quite enjoy the duck noodle soup as well as a number of their other offerings, but am I willing to deal with decidedly aloof service and  wait 45 minutes for it? That's a resounding \"No.\"  I've all but scratched this place from the rotation in light of the service."], ["Erin P.", "Ok, this food cannot be beat.  I've ordered many times and eaten several things and they're ALL JUST FLAT OUT AMAZINGLY DELICIOUS NOM NOM NOM!  Do not go there if you are in a hurry, however.  You will get angry and you may vow never to come back, which would be a travesty and, ultimately, your loss.If you want it faster, you can call ahead, wait about 20-30 minutes, then go pick it up.  But seriously, eating Thai food in an old Subway is sort of awesome so you should really dine-in if you can handle the wait.Don't expect gushing service.  In fact, you may sort of feel like they don't even really acknowledge your existence during your stay.  Don't be offended.  You're about to experience the best way the staff knows how to show you they care once you take a bite.  Heavenly!The menu is huge, the food is always piping hot and fresh, the flavors meld to form mouth nirvana and the prices are totally reasonable for what you get. Give it a shot!"], ["Mian W.", "Food is good, low price, and good portion. Worst thing: the owners are rude and loud, once I saw a customer who took the wrong order was shouted by the owner and he looked stunned..."], ["Brian J.", "The best Thai food that I have ever had. They have a small kitchen with the same crew making the most delicious Pad Thai and spring rolls you can possibly imagine. Call ahead because there will be a line and you will have to sit and wait for some time. The interior is small and there are no waiters, but the food just makes up for everything."], ["Madelynn M.", "Great food. Cooked quickly and on the spot. A little place, a dive....but NOT a dump. I take my friends there if we're in a hurry for some good lunch."], ["Katherine J.", "I have had a love-hate relationship with this place. However, as a lover of Thai food, Lawrence does not have many options (I'm like a kid in a candy store in Boston). I have been with Thai Siam in good times and bad. The customer service is never wonderful (you're lucky to get a smile) but they are great about customizing ingredients to help out vegetarians and vegans. The food is usually spot on - sometimes better than others.I love the panang curry and the pad thai. One big complaint - the tofu is in these weird strips instead of nicely fried cubes. Why? It's ugly and the texture is odd.They also won't let you order half orders and they make your food when they get around to it (even if there is no one else there). So go to Thai Siam for some yummy food. Just make sure you pack your patience and leave your Western notions of customer service at the door. Your tummy will thank you."], ["Sarah S.", "Really delicious food.  I love their Noodles Kee Mow with chicken.  I like to add tofu.  Their tofu rocks.  The food is not bland.  I do recommend being adventurous and trying something other than the pad thai.  The veggies and ingredients are fresh and right in front of you (it is set up like the old Subway it used to be) and you can watch them make each order.  The service only sucks if you expect it to be like a Subway, where you get it at the end of counter.  It is really a slow restaurant that seems like it should be quick.  But with each order being custom made, you get it hot and freshly made.  If you call for a to-go order and they say 20 minutes, it will be at least 25."], ["Sarah G.", "My boyfriend and I walked into Thai-Siam at around 9:59, right as they were shutting off the \"OPEN\" sign. I started to back out and tell my boyfriend they were closed, when the man behind the counter beckoned me back in and asked what I wanted. With this sweet gesture, my boyfriend and I were treated to quick, hot food and we were on our way out.The chicken pad thai was awesome, and so was their garlic chicken (which wasn't thai). I can't wait to try their panang and green curries!"], ["Mnason M.", "I decided to dine here for the first time to try something different that people rated decent on Yelp while we were in the Lawrence area.We ordered a medium (hotness) chicken curry panang and a chicken noodle pan thai. Both were decent. I have to admit, I've never liked any Thai restaurants I've been to in the past except this one gets a plus. I didn't fall in love but I would return. The food was decent however wow they used a lot of chopped peanuts and peanut oil in the pan thai. So much it almost got annoying...almost. The service was fine. The young girl working the counter was nice. They are slow on cooking. I think they had just one takeout order before ours and we were basically the only people they were cooking for. They took their time while lacking any \"hop in their steps\". Not really a bad thing, just I can understand an order would take a long time to fill if they were backed up. I thought it was funny how they had ink jet printer signs up saying things like \"no outside food\", \"restrooms only for customers\", \"order at the bar\", and \"return papers to this table\" all over the store. Made me chuckle for some reason.I wouldn't mind returning for a second meal."]]}