{"Go Go China": [], "China Taste": [], "China Garden": [["Vivian G.", "I was so thrilled with how awesome this place was. It was so good. Fast. Clean. And they deliver or you can take it out. They vegetable lo mein was so awesome. I highly recommend this place to everyone."], ["Taron B.", "Ordered chicken fried rice and egg drop soup just like I order in any city. This place is so inexpensive I had to add wings and egg rolls just to meet the $15 deliver minimum. FYI they deliver to the Courtyard Hotel on president Clinton Ave. egg drop soup was awesome. Everything else was good. Delivery was fast (Monday night). Order was correct. Did I mention the cost?  I will order here again. Sorry I was hungry and forgot to take pictures."], ["Rodney A.", "This is by far the best Chinese food I have found in Little Rock. Quality quality quality. I got Beef and Broccoli and my friend got Gen TSO both were fantastic. The egg rolls        were so good."], ["Jeff M.", "I'm giving China Garden five stars based in part on a cost-benefit analysis. This is quite possibly the best Chinese food in Little Rock (Fulin is it's only competition), but there is much better Chinese in larger cities. However, when four people can eat their fill for dinner, all the the food is on a continuum from decent to excellent, and the bill comes to $29, I think you have to go 5 stars.The Tofu and Mixed Vegetables stands out, as does the Kung Pao Chicken (unlike any Kung Pao I've ever had in either China and the U.S., but delicious nonetheless). The Lo Mein is a solid choice, and the beef here is not rubbery (or only slightly), as it so often is in American Chinese restaurants.As I understand it, this place is recently under new ownership, and it has made a turn for the better. If you like Chinese food, give China Garden a try."]], "New Funree Chinese Restaurant": [], "Mr. Cheng's": [], "Mike's Cafe": [], "Chi's Asian Café": [], "Pei Wei": [], "Fu Lin Chinese Restaurant": [], "Tokyo House": [], "Three Fold Noodles and Dumpling Co": [], "A.W. Lin's Asian Cuisine": [], "China Wok": [], "Chi's Dim Sum & Bistro": [], "P.F. Chang's": [["Kevin M.", "Never an off meal."], ["Brittany K.", "While I've always had a decent time at PF Changs (Ive been to several and this one in Little Rock twice now) I still can't get over the fact that it's just over priced chinese food. The service is good, the decor is lovely but paying $13 for an entree I could get at my corner chinese food spot for $4 is a little ridiculous. I'm a huge asian food fan but I prefer Thai or Vietnamese cuisine to Chinese really, and if i do need a general tso's fix its going to be take-out. I would reccomend Saigon on Cantrell if you're looking for some authentic asian food, they serve Thai, Vietnamese, & Chinese food. If you're really just a big fan of a nice sit down, chain restaurant Chinese food then PF Changs is your spot!I still give it 3 stars because I've never had a bad time there, I've just never had a great time either. Just so-so."], ["Clem H.", "Nastiest, most expensive food ever.  Don't even care if YELP moves this to their \"restricted\" views.  The only thing worth the money was the sesame chicken. Everything else tasted like vomit.  Lobster butter shrimp was simply shrimp dipped in raw egg.  Street noodles tasted like an acidic noodle threw up.  Disgusting."], ["Wade M.", "Poolside is a drink that is a must have; and ask for Matt.  Matt does talk really fast; but moves fast too!  Drinks were never empty, always a smile, and the service was awesome."], ["Whitney W.", "Although I would say it's more of an American restaurant than Chinese restaurant for real, I still like their food, The NY strip are delicious! And the Sichuan from the sea are good too!"], ["Rod D.", "Okay, so there's a PF Chang's near my house, in addition to the one at the Beverly Center in LA.  I've been several times because it was convenient, but the last time I finally realized something that's been lingering in the back of my mind for awhile.PF Chang's is NOT THAT GOOD.  It's just okay, at best and my experience at the one in Little Rock was not even okay, it sucked.  I had the lamb chengdu, which was the worst food I had in my week long trip to tha Rock.  Mom's had sweet and sour chicken, which was much better than the garbage I was eating.  The brown rice at PF Chang's sucks and the place is pricey.I've had a moment of clarity.  If you want Chinese food, go to your local Chinese owned/operated place and get take out.   It tastes much better and at a fraction of the cost."], ["David R.", "Horrible.  Don't know why.  Other PF Chang's are much better."], ["Neil B.", "Came here and got a springroll and sweet and sour chicken. Excellent service and the food tasted great! I have eaten at this one and the restaurant in Columbus, OH and both never dissapoint."], ["Rob K.", "AN OK Restaurant!! Great wine list..other than that nothing much!!Try the dumplings and the chilean seabass. Small portioned, expensive and overmarinated( too salty) Never try the Chengdu lamb if u don't like five spice. U will be so dissapointed.Best item on the menu All Dumplings, lettuce wrap. Bad items too many too list!!!Great service, well trained waitstaff. Will come back with friends!!"], ["Mark H.", "About six months ago several friends and I were eating here and one of the specials was  a \"Fresh Seared Ahai Tuna\" entree and when I asked if I could just have it as sashimi instead of seared, the waiter replied. \"It's seared. That's the special.\" I replied. \"Could you please not sear it and bring it out sliced thin with wasabi?\" He replied, \"Sir, it's seared.\" At that point he knew where I was going and I knew that it was a pre seared entree that was going to be heated. Being in the resturant business, there are some things that need to come par boiled, cooked etc but how hard is it to take fresh tuna and sear it for one minute on each side? At that point, I ordered something else off the menu. I didn't say anything I just ate my dinner, which was very tasty, but I refuse to validate the efforts of those who practice this type of  food service by giving them a perfect rating.  Even if they were to sear them ahead of time, they still should have some unseared in stock. I am all for prep work but to buy prepped Ahai Tuna or to prep seared Ahai Tuna ahead of time when it takes no time, is not my vision of a culinary experience. So if you want to know if your Ahai Tuna is fresh, then ask if they can serve it as sashimi. If so then, you decide if you want it seared or not. If they would have had uncooked sushi grade tuna, then this place would have been given 5 stars. I vowed to never go back, but I must admit, I have been once since then. It was wonderfulThe decor is very inviting and the wait staff is incredible. It boggles my mind that someone would invest that much time and money into an establishment and not have that option when it is claiming to be a \"Fresh Seared Ahi Tuna.\" entree. The bar has awesome Martinis.. Hell, I get over the tuna thing in a couple of months, I guess.."]], "Fantastic China": [], "Forbidden Garden Chinese Restaurant": [], "China Plus Buffet": [], "Mr. Chen's Authentic Chinese Cooking": [], "Chinese Kitchen": [["Toby T.", "TL;DR review:  Amazing quality for the price, will definately go again for take-out.I read a couple one-star reviews of this place before I ever tasted it.  I have no idea how they arrived at those scores.  I ordered the Kung-Po Chicken, and it was good.  Not the best, but good.  I also ordered the crab rangoon, and that was different.  It's not quite as sweet as I'm used to, but it wasn't fishy or gross like some others I've had.  Know what would have made it stand out as REALLY good?  Sweet and sour sauce.  The sides that came with my $5.50 lunch special were an egg roll and fried rice.  Those were stand-outs whereas other take-out chinese places have really bland rice indistinguishable from styrofoam and obviously frozen, underfried egg rolls.  Let me take a minute here to state that I'm not all that confident in my palate to know the difference between fried and fresh.  Chinese Kitchen's egg rolls *taste* fresh.  The ingredients are in chunks rather than being in heaps of glop that tastes homogenous.  The outside shell is crispy rather than being flat and stale.  It's hot, and very flavorful instead of being just \"egg roll\" enough to be able to put it on the menu to justify a higher price - like a throw-away egg roll.  I feel much the same way about the fried rice too, because there were actual chunks of meat in it.  It was an actual dish instead of something to hold a place on your plate so that someone could say \"what?  you wanted rice, that's technically rice...\" when you went to complain.  I will visit again, probably try a different entree, and will order a side of sweet and sour to go with the rangoon."], ["Rebecca D.", "We checked out this joint for the first time last night on a recommendation from a friend. We were more than impressed. Great pricing for huge portions. I would agree with other reviewers that the egg rolls and fried rice had a different taste. It was sort of nutmeg like. Overall I would say we look forward to returning. My husband had the sesame chicken which is not on the menu but man was it good! I had sweet and sour pork. My only suggestion since you ask for the sauce on the side. I don't know if they will do it but it would have made my experience just a little better since it is take out only."], ["Chris T.", "Website pics looked NOTHING like peppered steak I received. Rice tasted funky and so did the soup. It was like a hospital's version of Chinese food. Tossed the food in the dumpster on way to get a frosty from Wendy's for dinner. Never again Chinese Kitchen."], ["Michelle W.", "GREAT TAKE OUT food!  I would gave to agree with the first review...I was very hesitant upon entering, but WOW the food speaks for itself!!!!  Great fried rice! Great main entrees!!! Egg rolls were good. The only thing I didn't care for was the Crab Rangoon-it was just a little different from what I typically am accustomed to (it did not have the hint of sweet that I enjoy in mine) some people may like it. Overall excellent idea if you just want to take home a quick meal!   Fair warning...There is NO seating!  This is strictly a TAKE OUT joint!"]]}