{"The Pantry Restaurant": [], "Mellow Mushroom": [], "SandBar on Riverfront": [["Justin L.", "One of my most fun experiences to date!! My mom, brother and I stumbled upon this wonderful Riverboat bar while walking in the park next to our hotel, the Wyndham. Friday night we just had a few drinks on the top deck with an exquisite view of the city. Saturday, however, is when the real magic happened! We came back around 7:30 for the cruise portion of their \"dinner cruise.\" For only $15 a ticket, we were rewarded with a magnificent trip up the Arkansas River; 25 minutes up and 25 back! If it were still summer we would have been able to catch the sun set from the boat, but the city lights were magical from atop our little riverboat. On the return trip, the Captain pointed out THE Little Rock (insert french name here) and then we docked alongside the main boat/bar where we spent the rest of our evening making friends with fellow patrons as well as the business owner, Anita. We are just so thankful to add this experience to our first visit to the city of Little Rock!! PS: the drinks were cheeeeeaap and made by the friendliest bartender!"]], "Riverbend Bar & Grill": [], "Big Whiskey's Little Rock": [], "Capital Bar and Grill": [], "Terry's Finer Foods": [["Sandra F.", "Terry's is a wonderful small market that only carries the best of everything making your shopping quick and easy rather than trying to find your way around the huge mega markets of today. They have things you can't find anywhere else in Little Rock so it is worth a little extra. The service is great. They carry San Marzano tomatoes I can't find elsewhere. The meat & seafood are cut to your specifications and they are happy to order anything you want."], ["Janis T.", "Nice place-carry a lot of neat items. Great fruits and veggies. Lots of prepared foods as well although that can get a little pricey."], ["O. A.", "Under new ownership as of about a year ago. An old fashioned grocery with good produce (some local) and an excellent butcher shop which will cut choice and prime beef and other meats to order.  Has fresh fish several times per week (ask).  Has staples, but the price conscious go elsewhere for such items."]], "Markham Street Grill & Pub": [], "So Restaurant-Bar": [["Alan L.", "Came through Little Rock on my way back home to Fayetteville and stopped to pick up a to go order of Tres Leches for my son.  The staff was super nice and accommodating.  Not to mention that the dessert is AMAZING!!!  The best I have had in the state!!!"], ["Pat R.", "We stopped for cocktails at the bar before heading to another event, so this review doesn't include food. First, the liquor selection is broad and varied, which is a good sign. At least 4 premium bourbons plus a bottle of rye on the shelf let me know this place could make a good Manhattan. The bartender expertly made our drinks, both Booker's Manhattans. I was relieved to find somebody who knows you're supposed to stir a Manhattan, not shake it. He even let a neophyte customer taste a shot of Booker's Bourbon for free. Excellent service and great conversation at the bar. This place should do well."], ["Eric C.", "First time to Little Rock and SO was recommended. Sat at bar and had solid red Zin and really good escargo, awesome lobster mac and cheese. Best part is the cool neighborhood vibe."], ["Patsy T.", "great dinner with friends! service was good too. see you next time in little rock!"], ["Haley W.", "I came here for dinner one night, hoping, praying, that I could be proud of Little Rock for having more than three superb dining venues (Ashley's, 1620, and Acadia, respectively). SO fell short of any and all expectations. Let's start with the food: the blackened seafood fondue was fabulous, and the only thing worth eating. The mushroom risotto tasted like it had a gallon of soy sauce on it. The mashed potatoes were bland...straight out of a hospital cafeteria. The fish \"tacos\" were alright, but I think they're quality was more so just a result of everything else on the table being less than mediocre. But that's not the worst of it: To hopefully make up for the blah dining experience, a couple of my dining partners ordered Johnnie Walker Blacks--a good, solid whiskey, but not the top of the line. When our bill came these two drinks totaled to 64 dollars. Half of our entire ticket. Yes, SIXTY-FOUR DOLLARS. There must be a snafu between the liquor distributor and the manager of So, as this price tag is completely and utterly wrong. You can get JWB at a bar in New York or San Francisco for 9 dollars a pour. When we pointed out this alarming number on our ticket, the waiter did not seem sympathetic to our plight. He even had the audacity to WALK AWAY from our table when we had not finished our conversation. I found this to be completely unacceptable. Having worked in the restaurant world, like most other people, I know that if a customer raises concern over the price of an item, you address it without hesitation. The fact that the server completely disregarded our issue is a sign to me that this establishment takes absolutely no pride in customer service. Even if the food were fantastic, I wouldn't even consider coming here again."], ["Wendy B.", "Just had dinner last night and wanted to share the experience. I had the Blackened Seafood Fondue again because it's just that great. We had enough to take home to eat later as well. My boyfriend had two glasses of a great Chardonnay and I had two freshly made from scratch mojitos. Absolutely the best in town. We got the mini burgers with the french fries. The fries were crispy on the outside and tender inside and were fabulous. The mini burgers were juicy (a problem that I've noticed other restaurants have when they offer mini burgers is that they are too dry due to the smaller amount of meat). But So has this down. Service was great. I've had this waiter before and he was A-Plus. Will definitely return to venture further into the menu. Oh, on another trip I had the stuffed chicken breast and it blew me away. It could have been dry and unflavorful, but it was juicy, moist and full of flavor."], ["Jane B.", "Beautiful quaint establishment looking forward to having my colleagues dine here in june"], ["Carol N.", "Great atmosphere. V.O., the bartender, is great. I recommend a drink and an appetizer at the bar. Stop there. If you must have dinner, have the red snapper. On our last visit the food was VERY salty - as in it could not be eaten. Too expensive for sub-par food."], ["Christa H.", "Overall I've a pretty good experience in my visits to So, but the food never has much to do with it.  The amosphere is nice, romantic even, and  the drinks are great.  The food has always just been a litte...how can I put this...meh.  Not great, not bad, but definitely not worth the price.  I don't mind money well spent on fantastic meal, but both times I've been here I left with the feeling that it would have been better spent elsewhere.  One compliment I will give is that the service is outstanding and bumps it up to three stars for me."]], "Flying Saucer": [], "Applebee's": [], "Terry's, The Restaurant": [], "Hooters": []}