{"Georgia's Gyros": [["Rachel A.", "There are some pretty sad reviews of this little place... but I had a great experience there! A friend and I split their hummus appetizer, it was GREAT! It's a home made hummus served with warm pita bread- delish. We then split an order of fried zucchini, which reminded me of the good stuff back home in San Diego. Oh man, fried zucchini is the best, and Georgia's did not disappoint! I got a vegetarian gyro with tzaziki on it (you have to order tzaziki on the side, it doesn't come with it). It was one of the smallest gyros I've had, but wasn't the cheapest. It was loaded with vege's, and it was yummy! Wish it were a bit less pricey for it's size.The day we were there, the service was fine- but other reviews make it sound like it's typically not that great. We had a great lunch, and will be back soon... hopefully it's good again! Try the fried zucchini or the hummus!!"], ["Ashley R.", "Great!!! Live the hummus and Greek salad!!! Sweet service!!!"], ["Scott B.", "Saw the marquee and wanted some Greek food so I gave it a chance.  The original Gyro was tasty, but at $10 for a large without sides I was expecting a little more.  The Spinach Artichoke Dip was excellent and the freshly made chips were a little oily, but acceptable.  I have had Gyro's (or similar version) all over Europe and the Middle east.  The meat was good for, but it lacked the additional items like cucumbers, greens and feta.     The reason for only 3 stars is that they charged an additional $.75 for extra onions and $.75 for extra sauce.  The Gyro needed these items for my taste.  The fact that they charged for the little extra bit left a sour taste in my mouth and I will try the other Greek places before going back.     The décor was that of a bar and not a family eating establishment.  The fact they pride themselves on serving beer in a 32 ounce container is bad.  Sure have it on the menu, but putting it on the window makes me wonder if you even care about being a eating establishment.  Look at your revenue statements and determine if your customers go there for the beer or food."], ["Sara B.", "When you are starving and in a strange neighborhood you can only cross your fingers and hope you make a good decision (after checking yelp) This was an ok decision. We were kind of surprised to walk in at 5:30 and see a group of patrons huddled at the bar in the dimly lit restaurant. It feels like a bar that serves greek food.  I guess they tout their 32oz beer, which unless you are serious, is going to get warm, I'm never a fan of those. I was impressed with their on tap beer selection. (fat tire, shocktop, dos equis amber and then the usual american dratfs) The service was ok, a little slow, but friendly. The hummus was good, I recommend they change the presentation, as a cat owner it hit too close to looking like a tin of cat food was dumped on the plate. The bread served with it was also delicious. We both got the gyro (an original and chicken) they were just ok. They needed lettuce and feta. I would definitely not order the chicken again, but the original meat was good. Also I think the prices are a little high for a gyro with no sides. And the baklava was tiny and too buttery."], ["Dennis G.", "I had a hankering for some gyros the other day after going to the movies. De died to go for the \"Original\" and boy was I impressed!  Although the steak cut fries could be a larger portion.  The decor is that of a mix between a bar and a Greek fast food eatery."], ["John C.", "Great Greek food!  You will love anything on the menu."], ["Kevin K.", "Very good. Kinda hidden, but glad we took time to stop by"], ["Amber L.", "I recently visited Georgia's Gyros for a third time, as it was the restaurant of choice for a friend's birthday dinner. It had been years since I had been. Although not amazing, my experience was better than previous visits.First of all, we were greeted pretty quickly and told we could sit wherever we pleased. We had a table of five, and decided to split a \"Sampler Platter\", made up of fries, breaded zucchini sticks, mozzarella sticks, onion rings, and black bean quesadillas. Most everything was good, and to be honest, a larger portion than we expected for $9.99 (ordering individual appetizers ranges from $4.29-$6.99). It seemed everyone in our party ordered something different, from burgers, to gyros, to dinner plates. It didn't take long for our meals to arrive, however, my father-in-law was somehow completely left out of the equation (despite him ordering with the rest of us). The waitress looked baffled, but quickly got his order in the oven and out in no time. Everyone seemed to enjoy their dinner, and I can say that the Chicken Gyro was really good. Prices still seem a tad expensive, as only certain burgers/sandwiches come with sides."], ["Jay W.", "Good stuff! I had the original and fries. Great service also. There was a group of 6 of us and the server handled it well!"], ["David M.", "Stopped by on a Saturday evening to get carryout. Fast service. Hot food. And delicious. First time here, passing through town. Found it on Yelp!"], ["Chuck C.", "Georgia's is an interesting little spot. The food can be either average or good. The chips and salsa are always a solid choice; however, sometimes the sandwiches can be very tasty, and other times, it seems like they weren't really trying. The service is pretty slow, but they try. Another waitress would probably improve times, but it is a small restaurant, so...At any rate, the prices are pretty good--- better than the chains, so if you have no place in particular to eat, you could do worse than Georgia's.NOTE: I have never eaten the Greek, so I cannot comment or rate on that aspect."], ["Rutt R.", "Simple place with good food and service. I had the original gyro, good but nothing special, and the steak fries, they were perfect. With a tea it was $12.29. That's a little pricey for what you get."], ["James L.", "This was the crappiest read-made food ever. Nothing is home-made, but only re-heated. I know and I can tell. Lastly, the service is NOT GOOD. They don't care about food or service."], ["Andrew P.", "A small local joint with a short staff that struggles to meet your order. The gyros are very good, chock full of beef/lamb/chicken and the fries are seasoned well. The prices aren't half bad and expect to wait awhile for your order to appear in front of you."], ["Whitney R.", "Fine food, not anything to write home about. Understaffed."], ["Kerry B.", "Food is just awesome, service is really lacking though.  I use to know the owner, not sure if he is still the owner or not, but seems like when he was around managing the place, the service was awesome too."], ["justin c.", "This place has good Gyros.  That is really about all there is to say about it.  Its a little bar/restaurant, and it doesn't have to many tables.  The meat in the Gyros is tasty and there sauce is good and the food is always served piping hot.  They also have excellent onion rings, and i recommend getting them with a gyro.  Also they amongst others, they have Guiness on tap, so really how can you go wrong with this place.  Its also very affordable, casual, and just a good easy place to go to.  You don't have to get dressed up to go here and get some good food that is not your same ole deli sandwich menu."]], "Al Seraj Mediterranean Restaurant": [], "Istanbul Mediterranean": [], "Leo's Greek Castle": [], "Middle Eastern Cuisine": [], "Taziki's Mediterranean Cafe": [], "Mama's Gyros Grill": [], "Layla's Market": [], "Arkansas Burger Company": [["Velma D.", "Best burger I've tried in LR....just like homemade.....can't wait to go back. Home made burgers that take a little more time than normal to prepare, but definitely worth the wait. Near perfect.  Very big and cooked to order. Fried were really good and fresh cut from potatoes. Onion rings on another table looked good so I'm definitely trying those next time. Downfall...I was off one Monday and was craving one of their burgers...apparently they're closed on Mondays. :("], ["Noah H.", "That roof - it's like someone took that red and white paper that diner burgers come wrapped in, planted it, and poof! Burger joint pops outta the ground!Seriously though, heading west on Cantrell, that roof really, really stands out and makes an otherwise unassuming store front very easy to pick out of the crowd. Handy, if you're in a hurry and are looking for the drive-through.And the food?Oh so good! But oh soooo greasy!There's a time and a place, but once in a while you just want that bun (or bread) to be so greasy that it melts into your patty with every squeeze, until you're just holding juicy meat lightly coated in bread residue, toppings shedding from the top in a mayo and meat juice cascade with every bite!Oh come on, you know that made you hungry ;)We tried the burger, the fries, the chicken sandwich, and the onion rings, all dripping with grease, but in the best possible way! They've won some awards here for their burgers (magazine pages helpfully posted on the wall), and it's well work recognition. I wouldn't call it the best burger in Little Rock, because then I'd have to come eat here all the time. While I loved it, more than once and a while here would kill me in a year!Whoever writes their chalkboard menus is a calligrapher wizard of the highest order, so much so that I almost missed that they have fried pies! Played Sharknado while we were there, in honor of Sharknado 3's release. Oddly appropriate for a crew of hungry people on their way to the swimming hole.Our service was quite good, hardworking folks looking to provide a good meal served with love to their patrons. No one was jumping through hoops, but they were friendly, polite, and quick.The store entryway/cash register is classic old-school diner, but very well kept-up and arguably modernized. The sit-in dining areas, by contrast, just exudes history from every surface, the walls and shelf spaces festooned, coated, and drizzled in pictures, signs, knick-knacks, maps and trinkets from all of Arkansas, through time and space. It's well shaded from the outside, and while it's plenty spacious, it does a marvelous job of keeping that warm and cozy thing that makes diners such a fond part of all of our lives. I'm glad we stopped here for lunch :)"], ["Qiana G.", "Went today for the first time. The construction on Cantrell was really the only negative. I had the gyro, it was tasty. The customer service was super! Everyone was exceptionally friendly. I'll have to try the burgers next time."], ["Daniel P.", "First off they have quality food....before I explain my poor rating for them let me explain a percussor... Am a disabled veteran and I suffer from PTSD so I avoid crowded places the best I can....but tonight I was out and decided I wanted a hamburger so I go to Arkansas Hamburger Co. The parking lot is full so i don't go in to avoid the crowds, I go to the drive thru to order like I have dozens of times pull up to place a order and the girl looks behind her and looks back at me and says she won't take my order they are too busy I'll have to call in she won't take my order. OK.... So I pick up my call in (there's no other cars in the drive thru) at which point says am rude and I will not be served at all tonight."], ["Lydia B.", "I took my lovies there for lunch today and they loved it more than I expected. I love their cheese burgers, french fries, and fried Apple pies.Everything tastes fresh and is cooked as though one may cook for friends or loved ones. Needless to say, the customer service is fast, friendly, and prompt. Love this place!"], ["Mark H.", "Best burger in Little Rock?  Not hardly.  In fact, it isn't even close to being \"the best.\"I have enjoyed hamburgers from a legion of establishments that not only offer a better hamburger (Mama B's, Alley Oops, Cheeburger-Cheeburget, Town Pump, Five Guys, Hunka Pie, Cornerstone, Markham Street Pub, etc), but do so at a better price AND with friendly customer service.  Hell, all of the above offer CUSTOMER SERVICE and are happy to have your business.There is a misguided tone of superiority demonstrated by the staff at ABC...as if, they are going out of their way to help customers...and those charges on the back end are just a trivial necessity.  I even got an eye roll from the guy who helped me during this last visit.  (Note: Having been a waiter myself, I am not pushy, overly demanding or condescending.  I empathize in every way.  So, why isn't this type of empathy offered visa-versa.  Demand better service, Little Rock!)Over priced, over hyped and under whelming!  You've struck out too many times, ABC."], ["Mike H.", "Went looking for a good burger after being dissapointed at other places, and wow does this place deliver. Had \"the hog\" (bacon cheeseburger) and it was awesome. The onion rings are delicious too. Would eat here anytime!!!"], ["Jeré L.", "Best burgers I have ever had, hands down."], ["Hannah Lee E.", "Well I'm from out of town, and was starving and in need of a good burger, and took a taxi to this place, yelp says it's open. I get there and 25 $ later see that they are closed on Mondays. Dear, burger place you may want to adjust your hours of operation so that people don't waste their money on a taxi and an empty stomach. Thanks!"], ["Bill T.", "From out of town on business and needed a good burger place. Presentation looks good (food) and atmosphere is \"interesting\", tables are a little sticky \"ew\"."], ["Corbin C.", "We frequently have dinner at ABC.  As a family, we make it a point to try and support the local establishments over national chains.  This is a great example of the local place providing a much better product than you would receive from the chain next door!My younger sons love \"The Hog\" and our teenagers are big fans of \"The Rock\".  Burgers are tasty and the atmosphere is uniquely Arkansan.  We have always been pleased with the service of the staff and the speed of delivery of the food.  Fried pickles are good but a bit spicy for some of my family.  Fries are not spectacular, but otherwise we have been very happy with the quality of the food.  Crispier fries would be an improvement, but overall, this is my families go-to burger place!"], ["Steve M.", "Arkansas Burger is the premier burger joint in Little Rock! And the \"Cap City\" with mushrooms is my favorite!  Juicy and a flavor you just can't beat. I love it. Its a mood changer."], ["Sara B.", "Yay for burgers! We googled \"best burger in Arkansas\" and this came out as one of the best so we decided to try it out. It is an unsuspecting building. I had read it was a checkered roof so I saw it coming. The BF thought it looked too diner-ish for what we were looking for, but we decided to go in anyway and were glad we did.It's a family owned place in the best way possible. I suspect the daughter really is a razorback as the sign declares. The stuff on the wall is just that: stuff. I suspect if I gave them a picture of something cool and asked nicely, they would find a place for it. The burgers are in fact awesome. (The hog amd the greek) Not greasy as some people have described. I asked for extra crispy fries and they were great! Homemade ranch dressing was among the best ever. The onion rings were yummy and the great server even brought us a free sample of the queso AR is so well known for. It was yummy too!So why the only 4 stars? It's soooo close to 5. Great service, great burger and fries (and onion rings), VERY limited wine and beer selection (but who cares) The only thing that was a stinker was we ordered an apple pie to go. When we ate it later it sadly tasted like onion. Boo, sad, sad boo. Have separate oil for your very delicious desserts and you will get my fifth star easily!"], ["Saul K.", "Great place to go get a fast burger while also enjoying a piece Arkansas. I found the Greek Burger very innovative."], ["Travis R.", "Came at about 8pm on a Thursday. Not crowded, maybe 8 people or so.  Food came quick, like maybe 5-8 mins.  I ordered the double, and upgraded from chips to fries.  Burger was great. Flat grilled patties, heavily toasted bun.  Fries were terrible.  Warm, but not hot and kind of greasy.  Seemed like they had been sitting for a bit.  Service was excellent.   Would go back, but would not order fries.  I mentioned the fries when I paid, the guy appologized, told me he wished I would have told him.  Said they aren't frozen, made fresh.  Similar to Five Guys fries, which I don't really like either."], ["Greg S.", "On a recent trip to Little Rock, I heard the best burgers in the area were at Cotham's and the Arkansas Burger Company.  And of course I had to try them both!Hands down, the better of the two was Arkansas Burger Company, this very unassuming place that packs a punch with its food.  I was told by the owner that his favorite burger was \"The Hog,\" and that was good enough for me.  In fact, I was so hungry I ordered a Double Hog.  Great burger with yummy bacon and cheese, but it was also really fresh tasting.  A much more fulfilling hamburger than Cothams.The sides were also great, including their home-made fries.  The fried pickles are awesome, as well as the jalapeno poppers!  And dip them all in their home-made ranch or white cheese-dip, and you'll be doing just fine.Also on the menu was a Greek Gyro, which really caught my attention.  I didn't think it would be anything special, but it sure surprised me!  If I had to decide between the burger and the gyro, I'd get both!I'll definitely head back to Arkansas Burger Company the next time I'm in the Rock.  Great food and great people really make this place something special."], ["Nick G.", "Hands down one of the best burger joints I've ever been to. I ordered a cheeseburger, some jalapeno poppers, and a gyro (which I was taking for the road since I was about to catch a long flight).  When I ordered, I was warned that the food would take about 20 minutes to make since I arrived in the middle of the Arkansas vs Georgia college football game (Hawgs vs Dawgs, as it was posted outside) and there was a long line of excited fans ahead of me watching the game and eating some burgers.  I thought it was nice to be warned, because if I hadn't of been I might have been upset that it took so long, but since I was I just got to sit back and watch the game with them.  I even found myself routing for the Hogs as I waited.  It was pretty fun.20 min was about accurate, but the wait was worth it.  First off, I'm a fan of jalapeno poppers and they're kinda hard to get right I've found, but these were done perfectly, Bravo!  Now, the main attraction, the burger was also excellent.  The bun was lightly toasted and the perfect consistency to the burger which was big, juicy, and pure delicious!  It really couldn't get any better.  I ate the gyro about 3 hours later about mid-flight, and it was still good (btw, props to having a gryo on the menu, very nice).When I left, the owner (or at least I think it was the owner, he was a friendly old guy who looked and spoke like an owner) asked if I'd enjoyed my food in a very friendly tone.  I told him it was excellent, and he humbly responded with a \"thank you.\"  I kinda wanted to give him a hug after that."], ["Brittany K.", "Definitely a great burger. Me & hubby were out & about in Little Rock the other day and we decided we wanted to pop in somewhere for an early dinner, we were thinking Cheers in the Heights but as we pulled into the parking lot he says \"actually I really just want a good burger\" So I recalled reading all of the wonderful Yelp reviews for ABC and we headed over. From the outside it reminded me of a What-a-Burger (were from FL, theyre full of them) and I was sketchy,  I didn't want a fast food burger! But do not be swayed by the outside appearance, this place is legit. Hubby ordered \"The Rock\", a double cheeseburger with bacon & I ordered a regular cheesburger. Both burgers were delicious and huge! The handcut fries were really good too. Hubby is a big fan of \"5 guys\" and he decided the burgers were pretty similar, but ABC was bigger & better because they serve beer and they have tvs. I like 5 guys fries better but I preferred the ABC burger to 5 guys. Definitely a really cool little place in Little Rock to check out, heard they're really busy during lunch hours so keep that in mind! We were there around 4:30 and it wasn't busy at all, got our food really quickly and got to watch the end of the Arkansas game!"], ["Robert P.", "Just say no to fast food burgers and go to Arkansas Burger Company instead.  You will never ever order another burger from MacWendys King again.  Arkansas Burger Co is not a fast food joint.  I've waited as long as 20 minutes for my order, but I wasn't displeased; It was well worth the wait.The beef is very fresh and good quality and cooked perfectly.  It tastes like beef is supposed to.  It doesn't taste like something that was frozen and it doesn't taste like the typical mass market ground beef that other places use."], ["Andrew P.", "This burger is the best I've found in Little Rock.  We've been here a couple of years, and I've had a lot of burgers, but these are top notch.  The service was a little slow when I was there last time, but it was worth it for the burger.  The fries are good, I like the style, but I probably like Five Guys fries better.  I've had \"The Hog\" and the Greek Burger, the hog was much better.  I've only been here twice so far, but it's already one of my favorite LR places."], ["Arelia J.", "I ordered a burger with just cheese and onions.  Really yummy, juicy, greasy burger.  And large enough that I ate part one day and part the next.  There was a little too much grease/butter in the burger and the bun, so if you've not been eating a lot of fried foods your body might not be able to take a whole burger.  The french fries are skippable.I do plan to go back to try the Greek burger.  You can also call ahead and use the drive through to skip the long waits, although my wait was probably under 10 minutes."], ["K W.", "Service was excellent and very friendly. Food was ready very quickly. The Hog Burger was seasoned well, but was a little heavy on the mayo. The onion rings are unusual but delish."], ["Greg H.", "Great burger.  Excellent service. Really good deserts"], ["Thoma T.", "ABC is a great little hole in the wall restaurant that serves up a good, tasty, well-cooked burger. They're a big handful for the average person, and I recommend getting the kiddie burger if you're not starving. Their other menu items are also tasty, and my husband loves the Athen's Chicken Platter. I also suggest their spicy white cheese dip, although I think their chips are way too salty. Prices are reasonable for the amount of food you get."], ["Keith T.", "Granted, the food is decent.  Better than national chains, but worse than Davids or Purple Cow.  The worst part is the service.  Just look in the kitchen which hasn't been cleaned in years.  Plan on waiting 45 - 60 minutes most days during lunch for your order.  Staff has ZERO sense of urgency and even less concern for customers - including the owner.  If you have other options, take them, unless you like sitting in a grease pit for an hour waiting on your cheeseburger."], ["Ryan S.", "Burger tasted like a  frozen beef patty. The  chili on the burger tasted like it came from a can and they charge 30 cents for tap water. Overrated. Why is my review flagged"], ["Stan S.", "delicious burgers. only reason it doesnt get 5 stars is the lack of crispy french fries. this is the best burger in town."], ["Nique C.", "Great little burger joint.  I had the \"Hog\" which is a bacon cheeseburger with the onion rings.    I will definately be a repeat customer.   If you leave hungry, it is your fault."], ["Ted B.", "Pro:  Some of the best burgers around.Con:  Some of the worst parking around.   But it is worth it."], ["Nick O.", "I'd driven by the Arkansas Burger Company a couple times before; it's not hard to miss it, what with it's red-and-white checkered rooftop.  Unfortunately, I had never felt an overwhelming urge to go in, however.  I'm not sure why, and as clichd as it may sound, dive restaurants always have the best food.  Perhaps I'd just always assumed that a burger is a burger is a burger.In any case, first impressions were that despite being old and well worn, the restaurant is remarkably clean -- every time I've gone, the staff is constantly cleaning (almost ad nauseam).  It's quiet, and though I've never seen it, they apparently close the doors when they've run out of food...  Seems odd to me, considering I come from a 24 hour town.  The dcor is dated and eclectic; perhaps this is the restaurant that spawned the flea market school of decorating?  The burgers are excellent; for those of you not counting calories, I'd suggest \"The Rock\".  \"The Greek\" was just okay, but it seemed more like they threw feta at the burger and hoped the name stuck.  The food is fresh and prepared and served remarkably quickly.Lastly, I was amazed to watch so many people going into the Arby's next door...  They obviously don't know what they're missing."]], "Layla's Gyros & Pizzeria": [], "Zoe's Kitchen": [], "Little Greek Restaurant": [["Neal C.", "Another solid Greek restaurant in Little Rock! I suppose they are a mini-chain, but they have great quality meat, large portions, and reasonable prices ($7-9 for sandwiches, $4-6 for apps like Hummus). Service is super friendly and fast. Expect to wait less than ten minutes unless it's at a huge lunch rush. TIP: be sure to check in for their hummus and pita. And get the Fried pita not the regular soft one. It's some of the best I've had. Really great stuff. I think Layla's might have larger portions and it is a dollar or two cheaper, but Little Greek gives more variety on the sandwich (more lettuce, onion, and tomatoes) compared to Layla's meat and pita only."], ["Amber L.", "Little Greek Restaurant is a welcome addition to the Mediterranean food market in Little Rock. Now, I do realize it is a chain and therefore not entirely authentic. Yet, options are slim in Central AR, so I'll take what I can.Nice location. Prices vary. While I found it a tad steep to charge $6.50 for a chicken gyro (plus $1.99 for sides), my husband thought his was a good deal. He ordered sides of gyro meat and fries (ironically, also about $7.)Service was a tad rude and slow during our visit. I'll give them a pass though, as they just opened and have a few kinks to work out. The restaurant was clean, and the renovations turned out well."], ["Nicole S.", "It can sometimes be a little bit of a wait if it's mid lunch but it's totally worth it in my opinion. Their food is fantastic and fresh."], ["Kimberlee J.", "Great gyro and thin fries. Clean, priced well, always delish. The lemon chicken soup is also very good. It's the best gyro in town in my opinion."], ["Brian S.", "My wife and I came for lunch today after hearing how wonderful the food is at Little Greek. The food definitely stands up to its reputation. What we were not warned of was the prickly customer service. Well, let me correct myself. Only one person was a thorn in our sides with an extremely condescending tone that made you feel as if you came underdressed to a debutante ball. No, I was not sporting pajamas or anything of the sort. I was belittled on my ordering. Do not let this review keep you from the food. This is just a warning that the register is guarded by a troll."], ["Kate B.", "This place, while it may be a chain, is fantastic, and service is over the top.  A chain where the manager comes over to make sure you are satisfied with your meal? Good chain.  Greek salad was much larger than most chains, and was very tasty.  And the pita was super tasty and warm.  Would definitely go back for the friendly and attentive service alone!"], ["Brandon W.", "Went here last week and ate lunch and got a to go plate for my wife.  The food was absolutely amazing.  Fair price, good environment,  and the staff convinced me that the gave a damn.  Very impressed.  One of my new favs!!!!"], ["Devon D.", "Gyros are really good. Falafel is just decent. They were super dry and the tzaziki sauce had a weird taste, almost like a mayonnaise. Prices are super reasonable and service (only done takeout) was very fast."], ["Cheryl T.", "It's ok - not my fav.."], ["Kristin F.", "Went at noon, what was I thinking?!!? Busy, but they were quick, so that's a plus.  I had the falafel pita, side Greek salad and one stuffed grape leaf.  Stuffed me!The falafel wasn't my favorite, but the Greek salad and dolma were awesome.  Others in party had the lamb and they raved.Note to lady at counter...I can't pronounce \"dolmades\" so when I ask for stuffed grape leaves, don't make me repeat myself four times and then correct me.  Bad customer service.Anyway...yummy food, quick (mostly pleasant) service.  Weird though, there is a Mediterranean restaurant in same strip like four doors down.  Who signed that lease???Try it.  I'll go back."], ["Christi J.", "It was only ok. The falafel seemed dry and bland but I hadn't had it before so maybe it usually is? I also had the gyro platter and the meat was bland and still on the dry side. The salad was good, with cucumber and bell pepper and a good dressing. My partner had the Olympian pita and she also said it was just ok. We will try another place for Greek next time."], ["Carrie H.", "Little Greek is an affordable, family oriented restaurant that I enjoy frequenting. I highly recommend the hummus with fried pita as a must have. And I usually have the gyro platter with its generous portions and a tasty salad. I heart the dressing."], ["Jackie C.", "I ordered the veggie pita since I was not in the mood for meat after Thanksgiving. Being from LA I guess my expectations are higher than the locals; It was ok except my pita bread was never warmed and part of the pita bread was stale. These little things can make a huge difference in a meal. I was sadly unimpressed."]], "Pita Pit": [], "The Terrace Mediterranean Kitchen": []}