{"Veggi Deli": [], "Banana Leaf Indian Cuisine": [], "Star of India Restaurant": [], "Desi Den Indian Restaurant": [], "Taj Mahal Indian Cuisine": [["Neal C.", "Sometimes Taj Mahal is a 5 star worthy restaurant. Sometimes you leave their lunch buffet thinking, \"That tasted more like saucy chicken than Indian food\"-- it can be maddeningly inconsistent, but, more often than not, they get it right so I am giving four stars. Their chicken tikka masala, as many have mentioned, is not overly special. It is richer and creamier than usual, and has zero spicy level. Their naan is very good though, great crunch to it. They have good vindaloo, chicken ghobi, vegetable curries, and butter chicken. Good spice levels and large chunks of tender meat-- nothing gristly. Friendly service, free chai tea at lunch buffet, and lots of options make Taj a good spot... When they get it right"], ["Julie N.", "This is my favorite or second-favorite Indian restaurant in Arkansas. I strongly prefer it to Star of India. Flavor of India (which opened recently) has South Indian food but Taj Mahal has a more upscale (but not 'fancy' or formal) ambiance - it's a good date restaurant. Everything I've had has been flavorful and well prepared. The goat curry is heavenly. I get the cucumber salad every time I eat here. I like my food very spicy and this is a fresh, tangy counterpoint."], ["Rehan S.", "Found it on yelp!Very nice place, clean. Ambiance was nice. Tasty rice dishes. Chicken in 'chicken tikka masala' tasted little bland. Dessert selection was wonderful. Mango and Coconut Kulfi were exceptional. Wait staff was friendly, they made sure our drinks stayed full."], ["Andrew B.", "Really great lunch buffet with variety.  They do a good job of making sure there is something different to try every time you go.  They miss the mark on their chicken tikka masala (my favorite) but get so many things right it is hard to complain."], ["Sheena V.", "I usually visit Taj Mahal Indian Cuisine once every other month and always love it. I only visit during lunch hours because I go for their lunch buffet, which offers different kinds of curry, biryani, veggie pakoras, and tandoori chicken. Waiters bring small baskets of tandoori naan to your table and gladly re-fill the baskets when they are empty. I love dipping the naan in the curry, which means I usually wait for the waiters to bring the naan out before I begin eating (unless I'm starving, of course). I even dip my naan and veggie pakoras in chutney--so good!. Writing this review is making me crave for Taj Mahal. I think I'll go visit them this weekend!"], ["Bree S.", "Everything tastes like someone dumped lemon juice in it. Most of my food was disgusting."], ["Marlowe W.", "I personally love spicy and lemony food, so that is why I love this place so much. If your palette is pretty bland and you don't like experiencing new flavors, I would not suggest this place for you. Whenever I visit my dad in the summer, this is one of the first restaurants we go to. The best time to go to this place, in my opinion, is during lunch time because that is when they have their awesome buffet. If you've only been at night, I highly suggest you go during the afternoon one day so you can try a mix of all their staff picks. The atmosphere is also AMAZING. It looks a little cheesy with all of the decorations, but that is exactly what makes the place awesome. And to top that off, the servers have been nothing but nice to me. There is one lady who I absolutely love. I forgot her name (so sorry!), but you'll know which one I'm talking about if you go in there. Hopefully I will be able to eat at Taj Mahal two more times before I leave haha!"], ["Brittiney S.", "First time enjoying Indian cuisine. The buffet was small and had a lot of potato based products. Spice was a comfortable level. Nothing awesome but nothing gross either. We wouldn't go back, but that's really due to the limited selection."], ["Sumit P.", "Found this place by chance and absolutely loved it.. The ambience is gorgeous with a very ethnic feel to it. We had the weekend buffet which was around $13 per person. The spread is unbelievable and exquisite. My favorite was the goat curry, finger licking good. They had 4-5 different types of both chicken curries and veg options. The saag and kadi (yogurt curry) were equally amazing. The buffet also include a good spread of indian desserts and hot masala chai. I would definitely visit this place again and try out the remaining dishes. This place has found a spot in my favorites."], ["Tam V.", "My last review was back in 2010 when they just opened so I thought it was time for an update. This is now my go to place in Little Rock for Indian. The place was recently remodeled I believer and it looks absolutely great. The prices seem expensive but the amount of food defiantly makes up for that. One dish can defiantly serve two people so take that into consideration. I had several of the paneer dishes and also tried some of their different naan over several visits. My favorite dish would have to be the Saag Paneer with an order of the Bulllet Naan.If you don't know what you might like here or if you never tried Indian food before, I would defiantly go during their lunch buffet so you can sample the various dishes that they have out there."], ["Michelle ..", "First time coming here and I enjoyed the visit. First impression, outside not so great looking but the inside, once you step in just wow o wow. Its pretty, all the way down to the salt and pepper shakers.I have only ate Indian maybe at most a handful of times which is not a lot but I definitely will be coming back. All meals come with poppers (chips) and chutney (chili (red), apricot (orange), and tand something (deep red-burgundy))--we asked our waitress and that what she told us. She was not well versed on the menu.   We ordered the assorted vegetable plate and the assorted naan basket. The vegetable plate was all fried (which was my fault for not reading carefully) but it did not look appetizing. For the most part it tasted okay. There were some that tasted better than others but we didn't know which one was which.  The assorted naan basket was buttered, garlic, onion, and mozzarella naan, which was all good and was enough to use for our entree. Entree we ordered the mango shrimp--medium spicy and seafood curry (scallop, shrimp, and tilapia)--regular spicy. You have the option to choose from low, medium, regular, and Indian spicy. Both entrees were good. I liked the mango shrimp better but next time I would get it with regular spicy. The seafood curry was also good but dare I say did not like that it had the seafood odor to it that I did not like. The rice is Portion sizes you get more than if you were at Star of India. That being said, Star of India's food is slightly and can definitely can see why other reviewers said people prefer Taj Mahal for its ambiance. Price wise I guess it is a bit pricy but I don't really know how much Indian food is suppose to cost but I would say it was worth it."], ["Travis T.", "Short Version: Good; worth tryingFull version: got some carry out here for lunch.  They have a nice system where they give you a styrofoam container which you fill at the buffet. They then weigh your selection and you pay by the pound.  Warm naan is provided with your order.  I had several items, some of which I cannot name, however the mango chicken was fantastic, as were the chick peas and the reddish-colored cauliflower.  I'd definitely go back."], ["Pat R.", "I'm not a huge fan of lunch buffets, but Taj Mahal is pretty close to winning me over. I came on a Sunday before the noon crowd arrived and was seated immediately. While my water and naan were being served, I sauntered over to the side room where the aforementioned buffet resided. Wow! This might be the largest selection of food that I've ever seen on an Indian buffet. Choices included the normal chicken tikka masala, tandoori chicken, and dal, as well as some interesting lamb and goat curries. Vegetarian choices took up an entire wall by themselves. After my second trip, with each plate piled high, I had to throw in the towel, too stuffed to try the yummy-looking desserts. Refills on my water were quick, so I'm not sure what kind of service some of the other reviewers were seeing. Taj Mahal is clearly the best Indian restaurant in Little Rock, in my opinion."], ["Kyle T.", "Nice ambience...very Indian (music, servers, decor), but with cool chic bar.  Had Chicken Tika Masala and Chicken Korma.  Masala sauce was good but a bit too earthy than our favorite Masala (India Palace Tulsa), chicken was tender and fresh cilantro was nice touch. Korma was good...again different than our favorite, a little like a chili sauce with cream. We determine a truly great Indian restaurant by their chai and here is their failure. Served barely warm and lacked the punch of a flavorful chai. And that describes this place. We love Indian especially for the variety of spices, flavors, and fragrances. Taj Mahal seems to have tried to dumb down true Indian food to be acceptable to an Arkansas palate."], ["Apurva N.", "By now I have lost count how many times I have been to Taj Mahal. Maybe more than a dozen times!Easily the best Indian place in Little Rock and in general a pretty good restaurant. The staff is friendly and the food is pretty good. True to Arkansas style, the gravies can be a bit heavy / fatty, but then it comes with the territory. i particularly like the fact that they have a spiciness level of \"Indian Spicy\" - which is really spicy so be careful what you ask for! The Goat Biriyani is one of our staples here. So is the Chicken Tikka Masala. Try these and I'm sure your stomach will smile!I must add, that the lunch buffet here is excellent. In fact it is among the better lunch buffets I have been to in terms of quality of food. The fact that this place serves good food, along with the fact that it is not very pricey, makes it a near no-brainer!If you're in Little Rock, give it a shot and I'm sure you will concur!"], ["Wendy B.", "My husband and I loved this place!  We started with the vegetable samosas and they were well seasoned and the pastry was flaky and soft.  We shared the assorted naan and the garlic naan was our favorite.  My entree was the paneer tikka masala and I ordered it spicy.  I can generally tolerate heat but this may have been too spicy for even me but I loved it anyway.  The paneer was some of the best I've ever had.  My husband got the chicken makhani or butter chicken and the chicken was tender and the sauce was rich and delicious.  We will definitely come back soon."], ["B R.", "Can not say enough about the food here. Wife and I love going here. The naan is warm and tasty. The chicken tiki masala is amazing. Great selection of appetizers. The only thing negative is the service. Wait staff could pay a little more attention to detail and listening to what you actually order. But the food keeps it up there at 4 stars. Best lunch buffet around."], ["Manivannan M.", "Very good ambience and music. Royal seats chairs and vessels. Costly and food quality and taste was not that much compromising."], ["Rusty C.", "Fantastic service, beautiful decor and ambience, amazing food! Menu isn't to complex but it helps if you know what you are looking at. Don't hesitate to ask the friendly staff. Portions are just right.  The saffron rice is super fantastic - light- perfectly spiced and prepared. Veggy and meat samosas had wonderfully flaky dough. Staff boxed leftovers for us. Minus one star for the chai which was not a masala type - just a cheap combo of tea and cream. #teasnob"], ["Ali V.", "Let me admit, I'm picky. I've eaten a lot of 'Indian' food all over the country. And Taj Mahal is as good as any I've had in Chicago or otherwise. It's also a beautiful restaurant that is a major improvement over the previous dingy Mexican place. It's clean, the menu is extensive and the options taste house made. We tried veggie samosa (wonderful), naan, veggie Biryani saag paneer (w house made paneer cheese), Chana masala and chicken tikka. All really. Really good. All entrees come w rice and the unnecessary biryani was way too much food for just two of us. On a not so good note, they need more wait staff. The finishes, like down to the salt and pepper shakers and the expensive wallpaper are nice touches, but we did wait forever and ask three times for a glass of wine. Also, a cup of water for my kid would have been nice. Either way, I'm excited this place is in LR. I'll be back when I need my cardamom et al fix. Can't find that elsewhere in a clean, nice restaurant around here. (I'm looking at you Star of India.)"]], "Flavor of India": []}