{"Bruno's Little Italy": [["Jen A.", "The table service was great but I was seated near the hang out spot for the servers. I heard one scold a hostess three times for seatings. I don't care to know about back of the house issues while I'm waiting for my food. The value is inflated there. I paid $17 for a non-meat entree that didn't include a side salad. I didn't notice that detail on the menu so when the server prompted me for the salad I responded \"yes,\" not realizing it was a $4 upcharge.The manicotti was reported to be stuffed with a paragraph-length list of vegetables, but the result was less impressive. Nothing stood out but the steaming marinara.I won't return there, though I used to love the old Bruno's. I think it's outlasted its relevance."], ["Cristie T.", "Absolutely the best Italian food in Little Rock. Everything on the menu is delicious. My favorites are vegetable manicotti, all the lamb dishes, and the \"lady glove\" dish. I love their red sauce dishes. Everything tastes so fresh. The atmosphere is intimate. Sweet spot for a dinner date."], ["Bethany H.", "Our favorite Little Rock dining experience! The Bruno family is always on site, milling around with guests, and making sure their meals are just right. It's fun to see a family establishment that is obviously so cared for by the family. Besides that, the atmosphere is quaint and cozy, and just what you would expect from a little Italian spot. We always sit in the same booth (at first by chance but now by request) that is right in front of the glass window into the kitchen. You can watch the pizza maker throw dough, and it's pretty entertaining. They carry great selection of wine, and we always get a glass with out meal. The BREAD... oh my gosh. Its u real. Absolutely incredible. The meatballs are delicious! Try them for the app. My husband always gets pizza, and I have tried the manicotti, fettuccine, spaghetti, ravioli and lasagna. ALL are amazing. You just can't go wrong!! Try this place out. You won't be disappointed!"], ["Lauren T.", "I loved this place. The food was excellent. The atmosphere just as good or even better. We had a great waitress taking care of us too. The only reason I don't give it 5 stars in because of the wait time, on a Thursday night, but they can't help it when everyone is wanting a little bit of Little Italy!"], ["Susan B.", "The service was great. Home style authentic Italian food was as good as we've had. The food would be five.  A bit of a wait, limited seating, and no reservations were draw backs. Decor brings homage to its past and family member waited on us. He loved everything and he was right. Must go."], ["Stephen S.", "First time to visit the new location. Food was adequate but not special. Had the cannelloni strofatu and wife had the toasted ravioli. Cannelloni was good, not great. Garlic bread ok. Might be the best Itslian in Zlittle Rock, but doesn't compare with Cafe Amore in Eureka Springs or J&S in Hot Springs."], ["cheiko s.", "My friends and I waited for over an hour and half (1 1/2hrs) on a Saturday night. And after being told over and over that they were setting the table but nothing. We finally got a table and being excited to finally get seated we were served by a charming lady. 2nd the bread roll and \"butter\" I did not expected from a place everyone has been talking about. It was just butter (blue bell butter). And one roll for a table for 5.  3rd dinner was nothing out of the books at all. Simple food nothing Italian at all. Olive Garden has better food and for less and I have not been there for years.I asked for a sweet red wine and got an overly dry red. Not again not going there again. Or suggest going"], ["Tony P.", "I am somewhat biased having worked in and eaten at loads of Italian restaurants when I lived in Chicago. So I used to be a skeptic and only ate at Brunos one time right before the closure. I wasn't particularly impressed. It seemed tired. Lots of loyal fans but only so-so to me. Then the new opening downtown. Maybe I was there on a bad night way back when but after 4 or 5 visits to the new location I am a believer. Sure it's a red sauce joint but there are some real flavors to enjoy. The house salad dressing is zippy and fresh. The marinara is hearty. The pasta Sol Alman is a savory garlicky indulgence. The peperoni pizza is greasy and delicious with lots of oregano and stiff bones. I am glad they have wait times because that is a sign of success! Keep it up Brunos!!"], ["Will P.", "This place was suggested by the Courtyard hotel. I had Italian sausage and the meatballs for an appetizer. Wonderful, you have to get these. I had seafood pasta for dinner and wow what great flavor it had. The mushrooms were very good. Definitely go try this place."], ["Jason G.", "Waited for a table for 2 for over 1 1/2 hours on a Saturday evening, and it was definitely worth the wait. Service was great! Hostess and waitress were very friendly. I had the Spaghetti ala Caruso which was delicious. Would come back to Bruno's if I ever visit Little Rock again."], ["Sam E.", "We started off with the toasted ravioli. It arrived quickly, and it tasted freshly prepared. The manager said they made their own pastas, and the toasted ravioli tasted home made.Then they brought out fresh bread. OMG! I almost wanted to cancel the order so I could fill up on the bread. It was some of the best bread I've ever had!I ordered spaghetti with Italian sausage. They make their own sausage. It was a bit spicy and very tasty. The red sauce was tasty as well.The staff was very friendly, and it felt like dining with friends. I can't wait to come back."], ["Ron W.", "Got there with time to spare late on a Wednesday. Waited a few minutes for an outdoor table and loved it. Bar service while waiting was great. That level of service continued throughout the meal and post meal drinks.I had the clams in white sauce on linguine. Great presence of garlic and Parmesan. Lots of clams. A five star dish. Others at table had veal limone and enjoyed that as well. Great meals all around. Wonderful array of people driving/walking by. The right evening and sidewalk dining coupled with great food and drink made this an outstanding evening."], ["Kristy B.", "The food was not very good and I thought it was overpriced. I got pesto pasta and it must have been no more than two cups of pasta for around $15. Waitress wasn't friendly but the two bartenders were great. Bread was good."], ["Grace C.", "Bruno's is BACK!!! If you've somehow missed all the buzz ..do yourself a favor and stop in!! Amazing Pizza!! Adore the Chicken Vincenzo!! Perfect cold beer & great wine list. The Bruno Brothers are doing honor to their legacy!!!  The Best Italian Food!!! Bravo!! Welcome Back!! See you again soon!!"], ["Robert T.", "Honestly I can't comment on the food because after being seated we HAD to leave. The tables are so close together you can't even have a conversation. We were seated 12\" from each table on either side and for the price on the menu I just couldn't do it. We had our drinks and left!!! It was like being in a cafeteria! So I don't  really care what the food is like it's not worth the very close quarters. When you actually knock elbows with your neighbours it's just ridiculous."], ["Joseph B.", "Good atmosphere , Jennie was excellent. The ravioli was good, but the veal in a vermouth sauce with capers and mushrooms was excellent . Topped all of this off with fresh in house cannoli. I highly recommend this restaurant."], ["John S.", "Went back for an early dinner. Looks like they're over their long wait issues, we were seated immediately and the food came out promptly. The price we paid for this was sitting at the smallest table I've ever seen directly next to a bunch of other tiny tables crammed in...that part wasn't as nice as I wish it could be. The last time we were at Brunos the bread portion was almost comical, this time we were served an adequate portion of bread, also on the last visit they were out of Marinara sauce and a bunch of other ESSENTIAL items...this time no issues at all. Looks like Gio and the Brunos team has overcame most of the hurdles, and I'm assured those that remain will be also be resolved.  They're s always going to be growing pains and I think the Brunos team is doing a great job addressing them. The food was hearty/really good and owners checked in to make sure everything was to our liking, we'll be back."], ["Jeff M.", "Still no good Italian food in Little Rock (though I haven't been to Vesuvio yet). Bruno's gets two stars solely for helping out Main Street and for a good job on interior decor. Someone had the right eye for what an Italian place should look like: the many photos, the mirrors, the tablecloths, the darkness, etc., perfect atmosphere. Unfortunately, the food is quite bad. I was there with a group and the noodles in the pasta dishes were overcooked, the sauces lacked complexity, the cheese on the pizza was poor quality, the chicken tasted like chicken product, not fresh bird, and the cannoli shells were wrong and filling sparse. The service was pretty weak as well. The wine was good. The real kicker: for all the bad food you have to pay an arm and a leg. Better to stick with the Olive Garden, where you know the food will be bad, but at least at a reasonable price. I hope the food situation improves. It would be nice to have more food options downtown. The owner needs to buy better quality ingredients and fix the recipes to match the great space."]], "Vesuvio Bistro": [], "Olive Garden Italian Restaurant": [], "Fresh, an Urban Eatery": [], "Romano's Macaroni Grill": [["Christina C.", "The food was amazing.  It's a little on the expensive side, but a great place for date night.  And you get to draw on the table!!!"], ["Stephen T.", "I am always seeking a good Italian restaurant but since moving away from Little Rock, I haven't been to this Romano's Macaroni Grille For quite some time and the rather thin crowd had me concerned.   Our experience, however, was fantastic regarding service, food quality and presentation.  Shawn took great care of this family of five by asking good questions and making valued suggestions regarding meal size.  The restaurant was clean and the wait staff was well kept and cordial. I would recommend this restaurant for anyone wanting an Italian meal experience."], ["Laura F.", "This restaurant is difficult to find if you do not know where it is. We had to use GPS to find it. We were there mid afternoon for a late lunch, only 2 other tables had people seated. Waiter was quick to take out drink order but service slowed WAY down once we ordered our drinks. Aaron, our first waiter took our appetizer order, when it finally arrived we were informed Peter would continue servicing us. I had to ask for butter twice for the bread since crushed pepper was added to our olive oil without asking us first if we wanted pepper. My sisters salad arrived after yet another long wait. Veggies very fresh and well presented. I had asked for minestrone soup but was told they only have clam chowder or tomato basil. We ordered ravioli stuffed with mushrooms and cannelloni filled with ricotta and spinach. Both main dishes were good size portions with lots of flavor. So long story short, food was good but service was V E R Y, V E R Y,v E R Y slow. So good gets a 3 but service only gets a 2."], ["Gelica A.", "Food is lacking flavor, service is slow and they give you very little wine for the price"], ["Michelle L.", "My niece and 3 of her sorority sisters held their graduation dinner here. I was a little disappointed to be in chain restaurant but it was cool because of the occassion. I gave only 2 stars because there was just over 50 people in our dinner party and they assigned only 2 servers to help all of us. The reservation had been made in advance so there was time for the dining room manager to schedule accordingly.What happened with only 2 servers taking care of over 50 people is that they took only our drink orders first. The order and delivery on just drinks was almost 30 minutes. Then they delivered bread and would not take any dinner orders at all until all the bread was delivered to the tables. That was another 25 minutes.Once the food came out some of our party had to send their food back because the order was the wrong food or a steak had not been prepared properly.I like the mushroom ravioli here, it's my favorite item on their menu.Even if I hadn't been fully satisfied with my food I probably  would not have let that plate go anywhere. I had already waited a really long time for it.The best part of my experience here was the celebration and the bellini.I really think Macaroni Grill did an especially poor job in customer service. They were making a fortune off our dinner and bar bill and the general manager never came over to greet us, check on us or thank us for choosing Macaroni Grill.That bellini really was good though."], ["April B.", "The food was bland and mediocre. The service average to say the least. I think it was just my server, because the server at the other table was fabulous. I gave the three stars because the food was not that great. It wasn't bad but it wasn't great. This will not be a place I frequent. Oh and they are sooooooo slow. It took almost 45 min to get my meal. I could have cooked it myself faster."], ["Sharon L.", "I'm not convinced their margaritas have any alcohol in them. Pretty much $8.50 for some limeade."], ["Kate G.", "This place has changed ownership and you can definitely tell. Not the standard it used to hold itself to. Will go to Bravo's at the Promenade next time. Awful, awful service."], ["William K.", "I've always loved this place but was very disappointed this time. It started out fine but after waiting over an hour for our food, the manager came over. You would think he was coming over to apologize for the long wait but instead he leaned into the table and said \"should be about 3 more minutes,\" and walked off. About 10-15 minutes later out food arrived. None of the entrees were very hot. I would say luke warm. My wife's pasta was not thoroughly cooked and it was not what she ordered. After the long wait we weren't even hungry anymore so after a few bites we had it boxed up and got our checks. Our waitress was really nice and even took off my wife's meal from the bill because she felt so bad even though it wasn't her fault. I wish this place was like it used to be but unfortunately we did not have a good experience."], ["Jack H.", "Had a nice lunch with the family today.  Had the squash tortaloni and the lasagna Bolognese...really good!  Service was very nice and the restaurant was clean.  I prefer this chain to Olive Garden as I find Macaroni Grill seems to try harder with their pasta quality and choices."], ["Cathy F.", "We had an awesome experience there in January 2014.  My grandson was having surgery at ACH and we were staying overnight in LR due to the weather.  The food was delicious, cooked perfectly and I have no complaints whatsoever.  The service was excellent and the manager even came to our table and spoke to us.  When he found out my grandson was having surgery the next day, he was nice enough to discount our meal to help out.  I thought that was a very kind gesture.  We will frequent this place again when we are in LR."], ["Khianna W.", "They really need to work on their To-Go meals.... I placed an online order for curbside pickup at 11:30 am and I arrived on time. Wait ten minutes, no one came out and I had to go inside and was directed to the To-Go counter where I waited for 15 more minutes. The manager was called by the friendly associate helping me where they had to find my order (which was not ready...) I was given my receipt and directed to wait a few more minutes to my order to be finished. Still waiting... And about 20 minutes later, my meal as finally given to me at 12:10 pm although I requested 11:30 am pickup. What a waste of my time."], ["Jennifer B.", "My boyfriend and I really enjoy eating here. It's a chain restaurant, but really nicely done, and the food is delicious. The main reason I'm writing this review is to brag on the AMAZING waiter we have a had a few times, Michael. Michael is so energetic, upbeat, and seems genuinely happy to be there. He's easy to laugh and joke with and just generally makes the meal more enjoyable. Last night, he was training a waitress named Christine and she was doing a  great job too. If you eat at the Macaroni Grill and Michael is working, I highly suggest you ask to sit in his section. Now. Onto the food. I always order the Chicken Carmen. It's roasted chicken, mushrooms, caramelized onions and pasta with a cream sauce. It's wonderful! The portion is huge, so either come really hungry or ask for a to-go box. Romano's provides you with a foil oven reheatable container, so that's nice. The bread and fresh crack pepper with olive oil is also a great appetizer and is free with each meal. And don't forget the paper table cloths and crayons! I think we have more fun with that than anything else."], ["K D.", "Clean relaxing atmosphere. They undercooked my wife's chicken but made it right when we brought it to their attention. No lunch specials."], ["Dan K.", "Romano's Macaroni Grill has been a staple of casual, Italian chain-restaurant dining on the west side of Little Rock for years, and to be honest, I've had some great meals here, but lately things haven't been as good as they used to be.With every meal you're served hot, fresh bread to dip in olive oil and spices, and the bread is fantastic, and is probably one of the only saving highlights of the dining experience.The restaurant itself has a casual atmosphere and is well-appointed, although the floor plan does allow for the noise level to get a bit loud when the restaurant is full. I've dined here twice in the past six months and my entrees were disappointing; my wife insisted that we try it again. This time I decided to go back to the basics and try something as simple as spaghetti and meatballs; for an Italian restaurant, it shouldn't get any simpler than that.First up was my wife's salad; it was probably the sorriest salad I've ever seen in a restaurant. The lettuce was completely wilted, and it looked like someone took a bag of lettuce a week past it's expiration date and threw it in a bowl; every piece was brown, soggy, and wilted. There's absolutely no excuse for this, and the amazing thing is that it made it past three people (two in the kitchen and our server) without anyone taking note of it. This tells me that the kitchen staff, and likely the servers, simply don't care about the quality of the food that's being served. My wife sent the salad back and told them she didn't want it.Next up was my entree. The meatballs were dry and overcooked, the sauce was bland and almost tasteless, and the pasta was undercooked. Undercooked pasta? In an Italian restaurant? Where almost every meal contains pasta? This is your staple, if you can't get pasta cooked right, you're doing something awfully wrong.  Overall I walked away very disappointed with my dining experience, and that's a shame because I've had some really good food here in the past. Something has changed at the Macaroni Grill and it hasn't been for the better; unless I hear about things improving, I won't be back."], ["Kevin M.", "Quick business lunch"], ["Dee B.", "Okay folks went out for German and ended up here (45 min to 1 Hr at at the Pantry wasn't going to cut it). Well after driving around we decided that since the parking lot wasn't full (and I couldn't find Carrabba's) let's try this franchise. So yadada, yadada, Ho-Hum it's a place where you can get of Italian food. Peter our server did his best to answer our questions and point us in the right direction, it just boiled down to what we wanted (in crayon, DRY MERLOT). Food okay, but there's better out there folks."], ["Jeremy B.", "My wife and I love this place. Always good food, always good service."], ["Jeannie B.", "It was horrible....after waiting for 30 minutes ....they seat us at a table next to the kitchen ...when we asked for a table away from the kitchen. On the way to our table next we passed many open your tables away from the kitchen.  We asked why we couldn't sit there ....were given many different excuses ....they were yelling so loudly in the kitchen ...we just left.  They didn't care at all. Won't go back ....poor service"], ["Robyn K.", "One of my favorite places - love the bread and olive oil - I'll take it over dessert any day. Almost always get good service and great food. I really like the create your own pasta, I can get what ever I'm in the mood for that particular day."]], "Morinas Italian Restaurant": [], "Zaffino's Grapevine Cafe": [], "Amalfi's": [], "ZaZa Fine Salad And Wood Oven Pizza": [["Meghan M.", "ZaZa is a great lunch or casual dinner spot in LR. They offer pizzas and salads with fresh ingredients and unique dressings, and I'm a sucker for these types of places (i.e., gourmet-ish salad/pizza joints). I love that they have many dressing offerings from full fat to fat free and that they ask your preferred dressing quantity. I think the price point is completely justified. The salads are quite large and come with a smorgasbord of delicious toppings. Good food costs money folks...and this isn't your typical Pizza Inn salad bar (although I have a soft spot in my heart for those too:). The pizzas are fresh dough, fresh ingredients, and then finished in the wood fired oven. All these things add up to deliciousness, but a few of our pies got unevenly cooked. We were there on a sunny Saturday afternoon so it was packed and the line chefs were backed up, but I wish they would put a timer on their pies or something. We were stuck anxiously observing while one pizza got unintentionally blackened. Thank goodness we didn't have the terrible service that Meghan C. had, but the service could definitely use some refining. Some staff were friendly and nice, but then there were some weird interactions too. However, I would still happily dine here as it was tasty and a nice option for the LR area."], ["John S.", "Ties for the best pizza I've ever had (the other place is Tribecca Alley in Sardis, MS). The pizza is baked in a wood-burning oven with the finest of ingredients. Expect the mozzarella to be in discs rather than shredded. They have gelato too, and beer & wine if you're so inclined."], ["first l.", "Pizza was pretty great. One was a white pizza with carmelized onions, spinach and goat cheese. Second was the Hawaiian. Crispy crust and great ingredients.The \"wings\" were pretty terrible. Sort of like they came frozen from a Tyson bag. They are also the sauceless kind.Go for the pizza or salads, skip the wings. The gelato also looked amazing but did not get the chance to try it."], ["Steven S.", "There are two problems with this otherwise good salad bar restaurant.  First, the pizza is soggy, and second, there is no reserved seating.  This is a place. common in this part of the country, where you stand in line to get your food instead of sit at a table for service.  Arkansans seem to love to stand in line for food, and cafeteria type establishments abound. The problem is that if the restaurant is full or filling, you don't know whether there will be a place to sit and enjoy the food when you get it. This is the case with Za Za's.  Worse, is the pizza.  It's soggy and limp (see photo).  I know the owners to be good pizzamakers, certainly capable of high quality Neopolitano knockoffs; they use Caputo Tipo 000 flour, and bake the pizza in an excellent wood fired oven. I've tried to get the cooks to serve pizza that is still hot and crisp on the bottom, but they seem unable to do so.  They can do better, and even though locals don't have very high standards in this regard, having been served soggy pizza all their lives, the Za Za's product I was served is a fail.  The obvious solution to this problem is to monitor the floor temps closely, and serve the pizza on a screen instead of a cold plate, where the moisture from the pizza condenses and soaks into the otherwise excellent crust.  John and Scott take notice, please.I'll go back, but I'll take my own pizza screen, but I won't accept less than the best quality product possible."], ["Sara B.", "Here's the thing: I love a popular hipster place as well as the next girl. I'm just not sure how this place got so popular. Don't get me wrong, it was good. But it was just ok good. And when I think about the negatives, they are a few too many to head over there again. We got a caesar salad and a pizza with prosciutto and heirloom tomatoes. The salad was delicious and HUGE, definitely enough for two people. The pizza is super thin crust and was okay, but they were very light on the toppings. I'm a firm believer that when I take a bite of pizza it should have each topping on every bite. This was far, far from that and some of the toppings (goat cheese) were undetectable.It was also well over priced. Their wine was $8.50 a glass. I'm okay will paying that at a place that is a nice sit down dinner, but not really a place that I order at like Subway. Our pizza and a salad was over $40 with tip. That's too much for this place. We sat outside and the tables for two are so tiny if I had gotten a water it wouldn't have fit along with out pizza and salad. Finally their ordering is weird. You order salad first at one counter, move down and order your pizza then move to another counter to get your wine. It's weird and there's no flow. Also we got there at 6p on a Wednesday and it was busy, but we got a table. By the time we left it was crazy crowded. I wanted to tell everyone it wasn't worth standing around, but sometimes people just need to learn these things for themselves. If you want a fancy big yummy salad, this is your place. Otherwise, stay away."], ["Julie H.", "This place is awesome and we don't want you to steal our idea, but it's got the perfect Sunday afternoon or Sunday night date- You can get a pitcher of beer for $6, share a salad and pizza. But don't steal our idea!"], ["M T.", "One of the best salads that I have ever had. Salads are either custom created, or chosen from a menu. The pizza's are incredible. Great crust and vegetables. I am a vegetarian so I cannot rate the meats or cheese, but from what I saw people seemed very satisfied. I did not try the gelato, but it looked  delicious. Finding it can be tough, the address is for the back of the building and entry is on the opposite side. Worth the effort to enjoy. Highly recommended."], ["Will S.", "Love the food. Finally salads that rival the pizza. One thing I would fix would be the snarky 20 something severs. However without them how would I feel like I'm someplace cool?! There's no excuse for being polite........ ever."], ["Leah S.", "I have only had the salads here but they are great and also pretty big, The pizza looks great, can't wait to go try it. Docked it one star because it is a little pricey in my opinion."], ["Alaina L.", "I had the prosciutto-arugula pizza and the petit jean.ranch salad.  Both were delicious!  Overall, it's definitely one of those places that's a new favorite of mine!  I'll be back again."], ["Sophie M.", "BEST PIZZA IN LITTLE ROCK! go there asap if you haven't been before, and if you aren't in the mood for pizza there salads are to die for and so if the gelato!"], ["Catherine A.", "In town for a food industry visit and what do I find? THE BEST OVEN BRICK PIZZA (and salads) IN LITTLE ROCK! I was amazed. Line up & move down the line letting the staff member know what salad goodies you desire. At the end where you pay you can place a pizza order. I sat at the bar, it was quick, healthy...the pizza chef even acknowledged me, great ambiance & service...whoever owns this place is like Titus...whatever they touch shall become gold!!!"], ["Tam V.", "Great place for lunch and my go to place for salads. Some people might balk about paying $9-$11 for a salad but it's worth it for me. It's my go to place for a Cobb Salad. The pizza here is a much needed change from the typical Pizza Hut/Dominos pizza. Parking here can be a pain during the lunch and dinner rush but there is a lot of street parking nearby."], ["Joe S.", "I loved the Zaza salad and the prosciutto ham and arugula pizza.  I arrived at lunchtime and parking was terrible at this time of the day.  This would be my pizza and salad joint when I return to LR."], ["Joe T.", "After reading the reviews,  I had to check Zaza's out. The pizza delivered.  I had a Margherita pizza which was delicious. Wood fired oven and the thin neapolitan style pizza was a great find in Little Rock. Visiting from New York."], ["Katie L.", "We were on a road trip, preferring to avoid a fast food joint and found this place on Yelp. I'm glad we gave it a shot! Upon entering Za-Za, we felt slightly underdressed in our traveling gear (IE: collegiate jogging pants/jacket). This, for whatever reason, got us a lot of what seemed to be disapproving looks. I'm gonna go out on a limb here and say that the ambiance of pretentiousness was almost sickening. I mean, this is a salad and pizza joint, not Fogo de Chao, folks.ANYWAY,My boyfriend and I shared The Steakhouse salad and The Garden pizza. The salad was absolutely incredible! I loved all of the flavors, glad the guy who made our salad asked if we wanted light, medium or heavy dressing. We went with light and it was just perfect. Upon finishing our salad, the pizza was brought to our table, we dove in to the pizza that delivered a delicious sight. Unfortunately it looked better than it tasted and held up. I think that the toppings weighed down on the center of the pizza too much, it would fall apart had I not supported it with both hands and was impossible to eat with a fork. The taste was good, nothing too special, we ultimately wished we had just stuck with the salad. If we ever return to this city, we'll definitely come back just for some salad, still \"underdressed\". ;-)"], ["Kristen K.", "I love their oven pizzas. The pizzas are great, but can be hit and miss. Sometimes I wish the pizza was a little more done, or sometimes they come out with too dark of edges. With that being said, I always find myself coming back for a delicious salad or fresh ingredient pizza. It's great when pizzas aren't too greasy like Zaza's. their salad line is fantastic. The gelato is pretty superb as well."], ["John S.", "Pizza is great, salads are great, drinks are pricey and on the over iced/small/weak side and you have to walk back and forth if you want another better to stick with beer or water IMO. Someone said this is a hipster place? I thought it's more of an upscale family vibe, looks more like a North Face store than \"hipster\"....but I travel allot."], ["Sam I.", "Tucked away from street view , ZaZa's is a fine Little Rock establishment that is always busy with locals munching on giant salads and seemingly healthy pizza. Though the crowd is diverse, you will almost always be served by a hipster that wears a worn out  band t-shirt bought from savers. Though, at times service can get slow, the food quality stays consistent. The salads are hard to ruin because the produce is fresh and the \"salad maker\" only has to cup and mix ingredients. The same principle can be applied for the pizza. ZaZa's is more appealing in other aspects. The variety of alcohol is decent. Outdoor seating can become competitive because ZaZa's does sport a nice outdoor seating area. The menu is ascetically pleasing and designed by a professional, not an amateur using comic sans in microsoft word. To my taste buds the gelto here is good, but I wouldn't go far to say that my palette is very refined in gelto; seeing as ZaZa's is the only place to sell it in the area.Overall, ZaZa stays consistent with good quality food and sports a trendy atmosphere mostly filled with soccer moms looking for a healthy meal and the occasional bored teenager or old couple drinking wine. I'm a fan."], ["Mrs. D.", "Today was my first visit here and I was very satisfied with my service and menu choice. I chose The Cobb salad and it was enormous, two people can share one salad. The next time I'll ask for a smaller portion. I highly recommend this spot."]], "Cafe Prego Restaurant": [], "Vino's": [["Lizzy F.", "Good pizza, slow serviceGreat place if you have time to spare and want a craft beer with your pie"], ["Adam P.", "Vino's holds a special place in my heart. Going to shows since I was a teenager and going back from time to time for great pizza and root beer still hits the spot for me. It's also where I celebrated my 30th birthday with a lot of friends drinking their housemade brews.Vino's always gave me a \"big city\" feel for a pizza place in a very small metro like Little Rock. It seems to stick out...in a good way. Besides the nostalgia I have for the place, I'll concentrate on the food.My wife and I went to Vino's last Friday for something very, very simple. Pepperoni pizza and root beer. Yes, you may find yourself waiting in between the two doors in a line that seems to go fairly slow. Yes, you may wish the waiters and waitresses checked on you more (this never bothered me, because as a teenager, I never knew they existed in the first place). Yes, you may wait a little while for your food. However, when the hot pizza arrives on your table, all is well in the world.I love how they no longer serve your drink in the small paper cups. That was a pain. It's the little things, guys.Our pizza arrived and every bite reminded me why I love this place. This particular pie had a few too many \"dough bubbles\" on it for my liking, but it didn't take away from the taste. Our root beers tasted a little flat compared to previous times, but the homemade brew was still delicious.I've never eaten food from Vino's that I didn't like. Everyone laughs when I order a Turkey Pizza (yes, I said Turkey), but I highly recommend it alongside the Pizza Margherita.If you like a good hole-in-the-wall pizza place that is more on personality and good taste, go gran some pizza at Vino's."], ["Kelly M.", "So delicious! Great pizza in a casual atmosphere. When the food is this good who needs to fuss about \"atmosphere?\"Pizza has a great topping to crust ratio with delicious tomato sauce. Firehouse beer is yummy and worth a pint or two.Vegetarian and the Vino pizzas are delicious. Pizzas are huge! A large easily fed 4 of us. Try the cheese bread. Delicious!"], ["Jake B.", "Don't bother checking in!!! They don't honor the yelp check in two dollars off any pizza. Claims they didn't put it on there I told them they need to get off yelp them. Other than that the food was good the service was good."], ["Jacob W.", "I wasn't that impressed with this place. We ordered their cream ale - it was flat and honestly not so good. We switched to a regional brand and got a much better product. We went there on a Tuesday night around 6pm, so I didn't expect the food to take that long; we waited around 35-40 minutes for one pizza. The waitress didn't check on us very often, which doesn't make a lot of sense when a bunch of dudes are running through pitchers of beer.Biggest complaint though, has to do with the bathroom. If you're forced to sit at a restaurant for over an hour for a simple pizza meal, there ought to be a serviceable bathroom. It was honestly frightful in there. I know this place is going for \"divey,\" but there's no need to skip on sanitation. Ambience and health codes are not mutually exclusive."], ["Julie R.", "Love their pizza and calzones. Calzones are one of the best deal in town. I love the mix of the ricotta and mozzarella in it!"], ["Harold H.", "Best Calzones on this part of the planet. And the microbrewed beer? YUM. I always leave (full and happy) thinking I need more tattoos and piercings (to keep up with the waitstaff."], ["Crystal Diane D.", "Very cool spot. Came here in search of good micro brew, found it. Wish I was hungry enough to eat, the pizza looks amazing. This place looks like something out of a grunge movie, seriously love it. Highly recommend it, not the norm but in the best way possible. Also, music is perfect."], ["Peggy W.", "Great little place. First time ever trying Calzone. Amazing!!! Try the pepperoni one. You won't regret it"], ["Sam L.", "I have to say that if you dine-in at Vino's, you are in for some good eating. However, this is the 2nd time that we have ordered our food to go and the food is absolutely crap. The calzones that we got (the last 2 times) maybe had 6 pepperonis in it and the salad had all iceberg instead of the 1/2 and 1/2 that they give you in house. My only guess is that this is a short cut that the staff is taking. What a shame.The Calzones and salads are awesome every time we dine in, just don't do to-go orders."], ["Elroy W.", "While I've never been here except for lunch, I am a fan.  I usually get the lunch special which is a slice, small salad, and drink.  I love their pizza slices as they are huge and have ample toppings.  I also recommend their calzones as I enjoy them as well. I would highly recommend for lunch!"], ["Daniel H.", "This is a quality spot to grab pizza and and bite to eat. It is a slow process the whole way.. but they do warn you that during busy hours it can take 25-40 minutes to get certain items. The process of ordering took time because the people ahead of use were ordering Beer to go and the person running the register was the one taking food orders and also the one to pour the beer. He did acknowledge us during the long wait and that was a plus. The Pizza was above average but nothing amazing and I did not have any of the brewery beers. IOverall the service was good but not a good system and the food was good. 3.5 stars but not  good enough to round up to 4"], ["Noah R.", "It's hard to find good pizza in Arkansas but this spot hits the mark. Coupled with the delicious fresh brewed beers this place is a definite winner. The venue is a bit quirky but it really just adds to the charm."], ["Ben M.", "The layout for ordering and service is stressful for both the patrons and the staff. Mediocre beer but the food is quality."], ["Lisa S.", "Fantastic pizza! I also loved the low-key vibe of this place. We got a medium pepperoni and medium Vino's special...both were awesome, but I was definitely partial to the Vino's special because I'm a big olive person! There were 3 of us and we almost finished both pizza's so definitely enough for some hungry people! We also tried one of their Pinnacle Pale Ale which was pretty tasty...we got it in a pitcher which was nice to share amongst the 3 of us. If I lived in Little Rock I would definitely frequent this place often!"], ["Carrie S.", "we used to love this restaurant but lately whenever we go the food is so so and the wait is FOREVER. tonight we called in an order for pick up and were told it would be 35 minutes. When we got there after waiting the 35 minutes we had to wait an ADDITIONAL 30 minutes before we got our food. once we got home our calzones were extremely salty and undercooked. it's too bad this was a favorite spot- hopefully they'll get their act together!"], ["Aaron P.", "They brew their own beer, support local music, and have really good food. The atmosphere is really laid back and the staff is superb. I have been going there since 08 when I was stationed there."], ["Russ D.", "Vino's Pizza Pub Brewery is Little Rock's first Brewpub.  Their handcrafted ale is decent, a nice bastion of hope in a small microbrewery scene.  I enjoyed the potent Rock Hopera Imperial IPA.  It complimented the delicious pizza pie.The pizza is delicious and decently priced.  The atmosphere is typical of a brew pub in an old building.  The staff was attentive and helpful. Jonesin' for beer?  If you happen to be in the area you should stop by for some brew.  You'll be glad you did."], ["Ted C.", "Trying out Little Rock's microbrewery scene isn't that hard. I think Vino's is it since Bosco's is a chain and so it's just a matter of two places. Vino's also has food so it was a good choice for dinner. The four of us ended up sharing two large pizzas, a Margherita and the house special. For beer we went with the Firehouse and their Imperial stout.The pizza was all right, I have never really liked New York style pizza, I find it too thin and Vino's tries to make it in this style. The Margherita pizza though seemed like a White Pizza with tomatoes which was pretty good. My friends who live here say they always order that and I can see why, it was a good choice. The house special, basically the Supreme was all right, a little on the greasier side. I wouldn't get that again.Beerwise, the Firehouse was a light, easy drinking beer that went down pretty well. A pitcher of it went down very quickly. So quickly, in fact that I wanted their dark beer but they weren't able to sell me a pitcher of it because of the higher alcohol content. Since my friend's wife wasn't interested in a second round 3 did just fine. The stout was smooth with a slight malt nose. I wasn't sure that it's touted alcohol content was very high, it didn't taste very strong but was very drinkable.The beer was good, the pizza was on average, average, but I would come back for their brew work."], ["Sarah W.", "Better hipster hangout/bar than a pizza restaurant. The pizza wasn't terrible just a little too \"doughy\" for my taste. However, it's open late and the service was great."], ["Perry Y.", "While the pizza is pretty good and the beer is great, and the hipster atmosphere gives the place authenticity, really, folks, if you can't get a pizza to a table within 40 minutes of ordering, maybe a different line of work is in order. The place was moderately busy with plenty of staff standing around but that was the problem - that's all they were doing - stop adoring each other's tats, piercings and hair and SERVE YOUR CUSTOMERS. Maybe we'll go back, but there are plenty of other pizza joints (Iriana's) with better pizza or (Pizza D'Action) with a similar vibe."], ["Patrick F.", "Loved the pizza, we went back twice during our trip. Beer is made in house and is good, not great. The place is always busy. One complaint is that they should clean all the debris from around the back of the building so that the outside seating has more to look at."], ["s. m. j.", "Vino's is good at what it's good for, so I love it!I usually come here for a casual friendly lunch, and it is a great place for that. You order at the counter (have one of their excellent microbrews with your meal... you know you want to!), and they give you your drinks then and bring your food to you later. I usually have the mushroom and pepperoni calzone, but I've had pizza too. The calzones are huge and delicious! They come with more pizza sauce on the side for dipping. One of my friends usually gets a salad, and it also looks very good. Vino's is friendly and easy going and you can linger over your meal. There are many different seating areas, including outside (and outside upstairs). You can sit and talk and drink and fiddle-faddle, all the while sustained by great pizza and calzones. I love it!"], ["William D.", "Guided by Yelp reviews while driving through Arkansas, my girlfriend and I pit-stopped here on our journey across America. Turned out to be a great idea!Even though the neighborhood around it was run down, Vino stood out as an excellent pizza joint. Had a delicious slice of the house specialty pizza with a local brew. Atmosphere was hipster-y, but people of all ages were there enjoying lunch."], ["Mike C.", "Extremely rude staff. They act so put off by the fact that they half to work."], ["Ruby H.", "My husband and I come here every Friday. We always order the calzone with beer. Very nice people. It's nothing fancy but we always enjoy our dinner here."], ["Saul K.", "This place is alright. I tried their tap beer which was really good. The pizza was ok. I think it's a great place to get beer, but it's not a oh-let's-go-get-this-awesome-pizza kinda place... I would go back for beer tho."], ["Dale R.", "Great hand tossed fresh pizza. The Lazy Boy stout is perfect with pizza the huge calzones and a too go must growler beer. Like most places in Little Rock the building is old and has a lot of character. Some would say seedy, but the place is cool,staff are awesome and the food rocks. The micro brewery is tops producing complex full bodied beer."], ["Lance S.", "Last October on my trip to Austin from Pennsylvania, Little Rock was the next place on my journey to hang my hat for the night. After the long day's drive from Louisville, I was in the mood to find a microbrewery that served food. Vino's seemed like the place to go.Indeed, it was! Man I really liked this place! It reminded me of how Austin used to be; full of character  with no pretentiousness, kinda like if Love Joys served food. In fact, Little Rock in general reminded me of Austin past. Places like Vino's are an endangered species in Austin. Well anyhoo, the clientele was a comfortable mix of boomers, gen-xers, and college age kids. In addition to food, mainly pizzas and calzones, they also brew their own beer. I ordered a calzone and a couple of I.P.A.'s.The calzone was great. It had a crispy crust and the inside was piping hot with an italian tomato sauce, onions, peppers, mushrooms, pepperoni, and delicious fennel spiced italian sausage that rocked.The I.P.A was spot on! It was nicely hopped with a smooth body and balanced alcohol kick. One of the best I.P.A's I've had for sure.This place hit the spot and was exactly what I needed after a long day on the road. If I lived in Little Rock, Vino's would surely be a regular place for me to hang out."], ["Noah C.", "Vino's has not changed much over the past ten years and is still a really cool and unique place to go for pizza and sandwiches.  They are a locally owned hole in the wall that offers some of the best pizza and calzones you'll find anywhere in the \"rock\" ~ Little Rock. Their micro brew's are also very good and their prices are very reasonable. When you go, order their muffeletta pizza or a sausage and spinach calzone along with a cold IPA beer.  You can't go wrong here!If your into some great local heavy bands, this is a great place to go on Sat nights to get your head banging on!"], ["Amelia R.", "A local fav for handcrafted brew & hand tossed pizza.  In my opinion, just get pizza with your normal topping choices and they won't disappoint. Also they brew root beer for the kiddos.My 10 year old LOOOVES coming here.  She frequently pushes me to have one, two or three too many drinky-poos. I'm so thankful my little darling such a great driver."], ["Jordan C.", "Went here on a Friday evening just as it was starting to get busy. Nice atmosphere, the other raters give an apt description of the diversity of their clients. The service was efficient, the pizza was definitely \"new york\" style and I thought it tasted good and was a great deal at $3.50 a slice. The beer (I only had one) was pretty good, I'd like to go back and try more of them, also a good deal at $3.75/pint. Good New Belgium selection."], ["Laine M.", "The best pizza in Little Rock, hands down, in my book. They also have great beer and I really love their salads too. If you've never been before, you order up front and seat yourself, and they give you a quirky little postcard to put on your table so the server knows where your pizza goes. Only negative is that they are not super attentive on refilling non alcoholic beveragesAnd as a side note, I generally only go for lunch or dinner on a week night, so I can't comment on the type of weekend evening crowds they may have."], ["Amber L.", "Call me crazy, but I have never been that impressed with Vino's. It's a typical, local hole in the wall. I have normally gone to Vino's for the bands & entertainment. Tried the pizza- nothing exciting. Tried a club like sandwich- it was extremely bland, and missing toppings that were listed on the menu. Not so sure what all the hype is about."], ["Michelle T.", "The pizza is good, but the staff is so rude!! I watched a waiter yell at a woman for trying to put some tables together because they had a large party.  Previously she asked him if they could get a table for a party of 8. His response, \"Good luck!\". No offer to help her find a table, no offer to help put one together.  Once my party got seated, we waited for 20 minutes before our drink orders were taken. When the waiter finally came over my friend asked about what beer he would recommend. The waiter didn't want to take the time to respond so he just said, \"there's a menu up front\". We didn't realize you had to go up front to place your pizza order. We waited for an hour thinking someone would come take our order. Once we finally placed an order it took another 40 minutes before we got the pizza. When they brought forks and plates out, they didn't bring enough so we had to share with the person beside us. The staff is that lazy that they won't take the time to count how many people are at the table so they know  how many plates and forks to bring?? The only nice person was the cashier.  I have never received such terrible service at a restaurant before! I will be telling all my friends to avoid this place. Go to Iriana's instead!!!!"], ["Patrick O.", "How to sum up this Little Rock tradition? It's a rundown hole-in-the-wall, and has been ever since I found the place almost 20 years ago. That's not a complaint, it's their style. If you want linen on the table, this isn't the place for you. Low-key, undemanding, and accepting. The venue and the crowd.The walls are adorned with multiple layers of peeling paint as well as various kinds of art for sale from local hopefuls (some of whom have gone on to success at least locally). the menu is mostly (entirely?) pizza, calzones, sandwiches, and salads. all of them are quite tasty. and the dough is made and hand-spun constantly and visibly in the open--and rather tiny--kitchen.While the pizza is certainly good, you can certainly get better pizza in central arkansas. I'm not aware of anyone making a better calzone though.I helped to start the micro-brewery there many years ago before the current system was put into place...I think in 1994/5 (wow, that made me feel old.) and I'm very happy to see it still going strong and making a respectable product.After all of the dozens of visits over the years, I'm sure there will be many dozens more."], ["Harvey Y.", "this is a straight foward, no nonsense, beer and pizza type of place. If you like IPA, try the pinnacle. It is very hoppy...I can't imagine the Imperial, but I'm dying to try it...The pizza:It isn't exceptional, but it is solid. They have (what I call) the 'good' type of sausage. Its the chunkier, thicker clumps with seasoning laying on the top of it. It isn't New York style, it isn't thin crust and it deep-dish. Think papa johns (style wise) and that is the 'type' of pizza Vino's has...just way better. I would definitely recommend the pizza. A medium is big enough for two people."], ["Mike N.", "The beer is great.  I think the pizza is in the top 2 or 3 pies that you can get in Central Arkansas.  Their toppings are solid and the crust is perfectly crunchy.  I have never been for the live music.  The place is small and crowded sometimes but worth it."], ["Gina M.", "You gotta Love Vino's. It has been a staple for years, and where else can you get the ambience of graffiti like \"Satan Rules\" as you are washing your hands during your lunch break. Although they have a great local music scene, I usually make the lunch hour. They serve up individual, yet giant slices with your toppings of choice. Although not as good as a made to order complete pie ( I assume they have ready made crusts ready to go for the slices), it is always consistently yummy! The crust is thin to my liking and the toppings always taste fresh. Their Italian sausage is especially good! I am in love with their side salad which consists of dark greens, lots of shredded mozzarella, onion,  green olives, and a delicious creamy Italian house dressing. The calzones are great too! The service is very casual, you order at the counter and they find you by the cruddy post card table topper handed to you. The place is very rock and roll, grimy, and kind of smelly, with the kind of sellable art on display that makes you comment why someone would pay \"for that\". All this adds to the appeal for me, but the best part about Vinos, which is of course a brew pub, is the BREW! The Six Bridges Crème Ale is my all time favorite beer. It is just too good. The other selections are great too, but this particular one just hits the spot for me! Please do not go here and order a regular bottled beer. The location is super easy to get to, right off 1-30. Try it!"], ["Regina L.", "Convenient  downtown location.  The pizza was great.  The vibe is definitely geared toward a younger crowd but the wait staff made we grandparent crowd feel welcomed.  We did not try any of the house brewed beers but it looked liked they had many choices on hand.   Only negative,the place could use a face lift, fresh paint and a good cleaning.  The wait staff were very attentive."]], "Ya Ya's Euro Bistro": [["Julie H.", "As everyone has said, the brunch was pretty impressive. I was wishing I'd booked in advance to try out their Thanksgiving spread. I've also been for dinner and it was good as well but the brunch is what sets them apart from other Little Rock restaraunts. I only ordered soup and salad so obviously can't rave about much. I will be back to check out more of the menu."], ["Michelle ..", "The service was excellent! Waiter did a great job at explaining the menu and telling us was were his picks and what was popular at Ya Ya's -- this is great for first time dinners. I ordered the wood oven roasted chicken which was heavenly! My friend ordered the risotto which sooo good!Price is a bit expensive but its more upscale. Definitely a great place to go on a date.I can't wait to come back and try other dishes. I also looked up their brunch menu and I wait to try it. Will definitely be coming back!"], ["Neal C.", "Pretty unique menu and warm environment, but the flavor of the food just doesn't stand out enough for the prices charged. If it was simply for presentation, service, atmosphere, and menu offerings; this place deserves five stars-- but the food compared to its price would only warrant 2 stars. Thus, I arrive at my rating of 3 stars. A group of us came and sampled the Mahi Mahi (which was definitely the standout of the bunch), the beef tenderloin, and the strip steak. The two steaks were cooked right but lacked flavor. They seemed to season it simply with butter-- it was a very \"greasy\" steak, which seemed odd. Overall I likely won't be back, as there are better places to try for more reasonable prices."], ["Eileen H.", "Excellent. We had four in our party for lunch. The hostess was very rude and came across as very snotty so I thought we were in trouble, but our server and the food way more than made up for the cranky hostess. Everything was delicious-the bread brought to the table was fantastic and our crab cake starter was one of the best we've ever had. My husband and I can't wait to come back for dinner. I wish I would have asked our server's name again because he made our first time here most enjoyable. Try the lemonade. Wow! My guess is you can close your eyes and point to any item on the menu and it'll be fantastic."], ["Maegen B.", "I've heard this place was good in the past, I guess that is why the rating is so high. I've had two experiences here, one a Christmas party in the private room the other was dinner last night, and both were bad. My mom and I met for dinner there yesterday, it took over 15 minutes for someone to even take our drink order.  She ordered the corn risotto with grilled shrimp. The Shrimp was way over cooked and unsalted, corn wasn't fresh, either canned or frozen and the risotto was very thick.  I expected more from a $17 dish. I ordered the Shrimp Scampi, fried calamari was brought out instead. By the time the correct food was brought to me my mom was finished eating. The shrimp were not spiced like it described on the menu and were served over potato purée which I personally didn't think worked well together. The waiter offered me free dessert for the wait and I choose creme brûlée, 2 vanilla and 1 chocolate (it usually comes as a vanilla, chocolate, and sour apple). One vanilla still had granulated sugar on it. The other had scorched sugar and the custard had not set, was runny. Didn't care for the chocolate one. Our waiter rarely came by to check on us so we had to wave down a different server to ask for our check. We won't be going back."], ["Corina F.", "Third time here   Always great service   I had the cavatappi with mushrooms  this time can't say I was crazy for it but the bruschetta is to die for."], ["Sherri B.", "We decided to have brunch at Ya Ya's today. The restaurant offered several options including made to order pancakes, which were delicious. Members of our party also said they liked the omelet and waffle stations along with the chicken drummettes and peel & eat shrimp. The atmosphere was enjoyable and the live jazz music in the background was a nice added touch. Kedar was our waiter, he was pleasant and knowledgable. He went above and beyond to make sure we were satisfied. Our church service was over at 10:15 am, so Ya Ya's brunch was a nice change from our traditional Sunday dinner."], ["Debbie A.", "The service was excellent!! Our server was Paige, she was very attentive! The seafood tomato bisque was outstanding!! Order the chocolate soufflé as soon as you get there so it will be ready when you are finished with your meal. Pizza was amazing as was the roasted chicken. We will be back!!!"], ["Kurt H.", "YaYa's is truly one of the gems of Little Rock. I live nearby and frequent YaYa's often.  Everything I order is usually very good. There was an occasion where my soup was not very good, but the main course and/or appetizers are superb.  They have a good wine list and offer approximately 20-reds and 20-whites by the glass.  Their by-the-bottle selections are more extensive, as one would expect of a restaurant of this caliber. the daily specials are worth trying, as the chef explores his creativity. YaYa's has a Sunday Brunch and it has been voted one of Little Rock's best brunches. I tried it once but did not care for it that much.  Most of the items are very rich for my taste.  I do not eat dishes with cream or buttery sauces so it wasn't for me. YaYa's is busy most evenings and especially on the weekends, which is a good sign that a restaurant is good. The down side of this is expect to wait for a table. There is a full-service bar with small bar tables. You might be able to get a seat if you don't want to wait for a table.  On the up side, you can enjoy one of their many good wines.  I would suggest the Napa Valley or 14 Hands Merlot.  This is the one I usually order myself.  I do branch out into other reds, but usually come back to my favorite. Having moved from Southern California, and growing up near New York City, I truly enjoy eating outside. For me, YaYa's patio is a piece of home in an unfamiliar place. The table has very comfortable chairs and there are several couch areas on the patio.  In the summer, the couch areas are great for ordering a few drinks and appetizers before your table is ready. The patio area also has something that I love as well, live music.  I have been at there on Thursday, Friday, Saturday, and Sunday nights and experienced simple acoustic to jazz to country performances. I would not expect to see Social Distortion on the patio, but the Orange County natives ever decide, I'll be there for sure! Being is a shopping mall, there is not an issue with parking but I have seen \"traffic jams\" in front of the restaurant waiting for one of few up-front spots. My suggestion is don't waste your time and park in back or in front of the stores. Walking a few minutes will not kill you. Overall, YaYa's is a great restaurant but if you're going on a Friday or Saturday night, expect to wait. It is busy for a reason.  If you are the impatient type, try another restaurant that is not so busy.  Good things are worth waiting for. On Mother's Day, Father's Day, Valentine's Day etc., YaYa's will be exceptionally and their \"normal\" menu and prices might not apply. Be warned!"], ["Ron H.", "First time visit.  Service was very good.  I had the Shrimp Risotto, fabulous.  Risotto was creamy with corn kernels throughout. Shrimp was grilled with a nice spice.  Would highly recommend."], ["Amanda E.", "I'm a little worried that the good people of Little Rock don't have nice restaurants available to them since this place was rated so highly. We used to have one in Memphis but it shut down, I had always been a fan so I was excited to be going to Little Rock. I loved YaYas as a place to go wih a group of girls but one can do way better when it comes to a date night. We made a reservation so I'm not sure if there's a wait of not on a Saturday night. We were immeadily taken to this giant booth - which I thought was odd given that we had a reservation for two - did they not need the space for a larger party? A busier brought us water but failed to notice that my glass had a dried piece of lettuce on it -yuck. We ordered two apps to share and they were delicious - the gnocci and  beef carpaccio. We each had a pasta dish we each picked at - I can't tell you the names because they were not worth rembering. We also ordered a souflee to share, it tasted like a very moist brownie with the top burnt. Our bill was $85 before tip. Service was good but nothing stood out as noteworthy. This is not a contributing factor to my review (if it was, the review would be lower), but a note of their staff:The next morning I discovered I had left my credit card, so back we went after calling to make sure they had it. I was told to see the hostess - she was very rude. When I told her I was there for my card she told me how she couldn't leave the hostess stand and would have to wait for someone on staff to come up there - didn't call the manager. She then had a nerve a few mintues later to walk away from the hostess stand to put tablecloths on tables. I realize this may be part of her duties but DO NOT tell me that you cannot help me becuase you are tied to that location and then leave that location. Since I left my credit card there you'd think it would be obvious that I was someone who had just spent money there- apparently its ok for the staff to display a screw you attitude once you've spent your money. The manager was however very nice and seemed busy so I'll give him the benefit of the doubt that he's not aware of the rude blonde at the front."], ["Jennifer Z.", "I've been here numerous times and there seems to be consistency issues. While I love the high level of customer service, my pasta pomodoro dish was lackluster. It was very bland. Looks like they poured a can of diced tomatoes on pasta. Very underwhelming! On the other hand, I usually get the chicken dish and it is delicious."], ["Fiona N.", "Absolutely a brilliant surprise. Maurice, our waiter, first class, very professional and informed. Food was delicious and freshly made. We went for lunch, impromptu. Would definitely recommend for any meal. We ate the lasagne, bruschetta, tomato soup and the ham and cheese sandwich - lots of food, couldn't manage it all, but all was lovely."], ["Tiffany B.", "Ate there on valentines day, the service was ok but the food was way over priced for the quality provided. I don't mind spending a lot, but the food has to be worth it, here it is not."], ["A T.", "The food is amazing but the level of service the last few times I went there have been terrible. Don't get me wrong I have had excellent service before but the last two trips have been lacking. One time we never got our salads which okay things happen, people make mistakes but the server didn't remedy the situation when we told her which is all that needed to be done. She acted like she didn't want to be there. The second time we barely saw our server, we basically got drive by service."], ["Ali K.", "The food is wonderfully unique and artfully presented. The service is wonderful! Cole is a jewel!"], ["Bonnie D.", "I have never given a 1-star review to any business that has actually gotten my money, but the time has come. (1-start review for a non-communicative caterer, but I never paid a dime to them.)I took my mother here for brunch on Mother's Day and was extremely disappointed. I made the reservation about a month ahead, and did so based on brunch information on their website. The price for brunch listed on their website (Easter Sunday) was something like $17 or $19 per person. Okay, I can roll with that. The day before Mother's Day, I got a call confirming my reservation and the man told me that it would be $28.95 per head for Mother's Day brunch. WTF??!! In Arkansas?? They apparently waited to fill reservations and then determine the price. I called every other freakin' restaurant in Central Arkansas to get a last minute reservation and couldn't get in anywhere. So, we went to Ya Ya's. For $28.95 per head IN ARKANSAS, I expect excellence. In fact, I lived in DC for a while, where it was common place to pay $30 per head for brunch buffet, but the food was outstanding. And that was DC, not Little Rock, Arkansas. The food was pretty damn mediocre, and the service was just okay. The music was way too loud that my mom and I had to yell in order to have a conversation. I was so incredibly disappointed in this place, and I was even embarrassed that I had 'treated' my mom to such a boring and mediocre experience. I have since learned that this place is a chain. So, I'm not really surprised by the food quality in hindsight, but Ya Ya's, you need a reality check. Unless your food and service are impeccable, charging $28.95 for brunch IN LITTLE ROCK, ARKANSAS, is laughable. I will never spend my money at this place again, and neither will anyone in my family (who live in Arkansas). What a disappointment."], ["Christy W.", "Wow it was delicious - we made an entire meal from the starter menu and it was worth it.  My absolute favorites (though all of it was good) was the gnocchi (to die for) and the bruschetta.  But all of it was delicious.  Ambiance is great - nice cocktail and wine list.  Just great."], ["Greg P.", "My Mom, wife and I visited YaYas for her 70th birthday. Overall, service and food quality are average. Food portions are very considerate."], ["Jessica B.", "I just don't get the hype with this place. They do have a great patio, but of the 4 meals I've had there--none were better than average. The people I ate with on these visits had the same reaction. Nice atmosphere but there's better food to be found in town."], ["Elizabeth L.", "This has been my absolute favorite restaurant for years! I am back in town visiting and was quickly reminded why it was my favorite. Great food, great atmosphere, great service. Good luck beating their lasagna (great to share between two people)! Also, save room for the brownie!"], ["Wendy H.", "I adore this place and have visited 3 times so far!  Sadly, the last time they were out of the lobster for the Lobster Club, but this sandwich is just amazing and one of the three reasons that I will keep returning to this restaurant.  The lobster is poached in butter and served on tasty bread with crispy bacon - so delicious!  Secondly, I love the complimentary bread and Baba Ganoush (dip for the bread) that is served alongside.  Thirdly, the service is impeccable and the clientele is made to feel like valued customers.  Water is even served in an ice cold bottle for the table.Update:  This restaurant does change some of my fave items for the seasons; this was only a problem for me, because I have multiple diet restrictions/stomach conditions that keep me from spicy foods, tomatoes, and so on - I will be returning in the warmer months when the Lobster Club returns to its lemony goodness versus its slightly spicy tomatoey version that is on the menu currently."], ["John O.", "Nice place with very nice atmosphere, located among shopping in north Little Rock. Staff very friendly. Food was good, variety of choices."], ["Kat L.", "I ate here with my boyfriend, his mom, and grandma.  My boyfriend and I shared a pizza and the beet salad.  It was more than enough food for us.  Ya ya's has a big menu.  I like that they make their food fresh.  The beet salad was delicoius, although I would have liked to get more beets.  The pizza had truffle oil and mushrooms.  It was great! This is a nice sit down restuarant with a fancy ambiance.  It reminded me of going into a ski lodge with the layered stone walls."], ["Matt P.", "Ya Ya's is definitely one of the best restaurants for upscale dining experience in west Little Rock. Every dinner I've had there has been excellent--both the food and service. Every lunch I've has there has been mediocre. So...I recommend it for a nice dinner!"], ["cheiko s.", "Love this place. Great serve, good food. They make you feel very important every time. But even more when your a regular."], ["James H.", "Came to Ya Ya's last week during my business trip to Little rock and seriously i don't understand how places in Little Rock can be priced so well for the quality and quantity you receive. We had mushroom flatbread, bruschetta, and calamari for the appetizer. Everything was delicious! I particularly like that the calamari was not overfried Was feeling healthy that day so had the salad, which was also delicious but i mean salad is still just salad. Desserts were extremely rich and I will make sure I make another trip!"], ["Brennan M.", "I've been to Ya Ya's four or five times now, and I've had a wonderful time on each occasion.  I highly recommend the Bruschetta as an appetizer.  It comes with house made toast, oiled/herbed tomatoes, and a goat cheese/cream cheese mixture.  It is delicious and sure to get your appetite working.For dinner, I've eaten so many delicious things that it's hard to make a recommendation, but the duck is really spectacular.  I've also had the short-rib in grits, and while I really loved the grits, the short-rib wasn't quite right.  Bill's Chicken Salad is wonderful and leaves you feeling really full.  A surprise for a salad!For lunch, I recommend the Lobster Club.  It's really bacon-y.  Yum.  I also had a lunch special of fish tacos one day.  It was easily the best tasting fish taco I've ever had.  I was surprised to have this experience in Little Rock, of all places, but it was undeniable.  Ya Ya's has taken the fish taco crown.I can't wait to go back!"], ["Roger P.", "I am a consultant from Minneapolis Minnesota. In September and October I had the pleasure of eating at Yaya's  multiple times. This restaurant was by far my favorite place to eat in the course of my 25 nights out over five weeks that I was in LR. The beef carpaccio is one of the best appetizers that I have ever had. I thought the angel hair Pomodoro with shrimp was outstanding.  If this restaurant was in Minneapolis it would be in my top 5% of restaurants to go to. This is my first Yaya's experience. It definitely won't be my last and I will look for it in other locations. Please  bring this restaurant to Minneapolis!!"], ["April G.", "Day 2 of my Arkansas I was referred to this place by employees from Burlington Coat Factory and boy am I thankful!!! Sunday brunch @ 19.95 per person. Live music, great by the way...also got a special dedication from the musicians (guess I looked like an out of towner). The music sets the tone for such a wonderful day to enjoy good food with family or friends. Bacon, fried to perfection, waffles with melted butter running off the sides, golden brown hash browns, fresh sweet fruits, beautiful green salads, pizza slices, beef, ham...I mean do I really need to go on. Each piece of food that went down my throat spoke to every last taste bud as it touched my lips and tongue! It told them a wonderful story of how the cook took his tender hands and made all entrees with love and kindness!  The food thanked me and my stomach on the way down and for that....i am forever indebted to Ya Ya!"], ["Bryan M.", "Great place for a nice dinner. The atmosphere is perfect and the wine selection is the best in the state!! Had a rare bottle that was the best I have had this year. See picture!!!   Great place for a date or nice dinner with friends!  The lamb was amazing and the soufle was to die for!!"], ["Jana B.", "Outstanding menu & food.  Michael, our server was just the right mix of attention & scarce to feel taken care of but not hovered over.  Scallops were superb, will try the lasagna next time!"], ["T L.", "This place is great. They have done it right. From the best burger I've ever eaten, amazing lasagna, pizza, sandwiches, great drinks (the ginger martini is sick) and appetizers this place is awesome. They train their servers properly, have top notch food and Applebees prices. If your in the area you won't be disappointed."], ["Rose I.", "LOVE this restaurant! Their phyllo dough wrapped brownie dessert is to die for!"], ["Shannon R.", "The food is always delicious. Drinks go down smooth. Service is always great. This is truly my favorite place to dine in Little Rock."], ["s. m. j.", "I've been to YaYa's three times, and each time I've had the same delicious dish, but it's not a place I seek out or a place I really want to go for special food or experiences. Everything is fine, and this past time our waitress, Audrey, was really great. It really is A-OK to me, but not as good as it gets.The first time my husband and I came here, the let-down I experienced was my own fault. I thought they offered Saturday brunch, but they do not, so we were ready to get our brunch on, and we were denied. I ordered the gnocchi with walnuts and gorgonzola, and it was very tasty. I don't remember what my husband had, but I remember he was not that impressed with YaYa's and thought it was too expensive. I returned another time with a group of colleagues for cocktails and snacks, and we enjoyed our evening. I again ordered the gnocchi. I thought their wine selection was nice.This past time, my friend and I were shopping at the Promenade, so we decided to stop in here, and, again, I had the gnocchi and a glass of wine. The pours are generous, and the decor is lovely, especially for a girls' luncheon. Our server was professional and personable. We had no complaints.I think the competition is steep enough in Little Rock that this restaurant, for me, doesn't emerge at the top. But it is a pleasant place to dine and/or have a cocktail if you are in the neighborhood."], ["Wendy R.", "First time at Ya Ya's...it was great. Service was good. Food was wonderful."], ["Sam K.", "I've only been here once, but will be making another trip sooner or later. The food we ordered was great. The steak I ordered and the appetizer were a little salty, but wasn't too bad. Our waiter was excellent, he was very attentive and made sure we had everything we needed."], ["Alissa P.", "Had a wonderful meal-the scallops were wonderful. The wait staff was fantastic. But what really impressed me was when I realized I left my credit card behind, the staff was so gracious and kind to drive my card out to me at the airport as I was readying to head back home from a business trip. Thank you, YaYa team, including Justin, Anna, and Brandon ( I hope I got names right). Your staff is one in a million!"], ["A V.", "I went here with my brother and sister as a spur of the moment thing, and I really enjoyed my food.The beef carpaccio (our first time trying it) was delicious. It's ever so slightly seared raw beef served with goat cheese, caper berries, arugula with white truffle oil, sea salt, pita, and some other ingredients. Everything melded well together.For my main course, I ordered the duck with risotto and pear butter, and the duck was juicy and flavorful without having a game-like taste to it. It was the best duck I've had in a while. My sister loved it as well. The pear butter and almonds in the risotto added a nice touch to the dish.My sister ordered the asparagus and prosciutto pizza. Unless I'm mistaken, I swear that was NOT prosciutto on top of her pizza. It didn't look nor taste like prosciutto. Perhaps it was prosciutto cotto? I doubt it though...My brother ordered the pork chop dish. It wasn't dry or anything,  I'm just not a fan of pork chops. Also, I thought there was too much fontina.Despite my disappointment with my pizza, I enjoyed this place. I will definitely go here again when I have the chance. Can't wait to try the other dishes on the menu.PS: Try the bread pudding! Make sure you share it with several other people though since it's a generous serving!"], ["Mohamed I.", "This is where the partial star woud come in handy... I rate Yaya's a 4.7 out of 5. The service is dynomite!! The servers know the menu very well. The appetizers are ridiculous!! Thank you for bringing back the polenta w/ Duck confiet. The decor and bar scene are really nice.The outdoor seating draws you in. It's a great experience. The desserts (if there is any room left) are great. The dinner menu is good but not great which is the only reason why its not a 5 out of 5. You should go and check this place out. It will be one of your favorties. Also, an exceptional Sunday brunch."], ["John B.", "Ya-Ya's = Yum-Yum. Try the pizza and a drink before heading to the movie at Chenal 9. Then, skip the concession stand. You'll end up spending about as much as you would on popcorn and cokes, but you'll have a better time.'Nough said.Go, see, eat!!"], ["Kayla H.", "Their service and appetizers were pretty good, our waiter, Q was pretty fun. I ordered a pasta dish and it was sooooo over cooked it was mushy. Can't say I'll hurry back to this location or any of the others (it's a chain)."], ["Rodney C.", "I went on a date with my wife and was not disappointed.  We get so few chances to get a good meal out in Little Rock and look for sustainable healthy food.Nice interior.  Funny staff.  Excellent food and wine.Anyplace that lists the farm's name on the menu items tells me that they care about local, pasture raised meat and vibrant vegetables.  You can tell in their dishes.Watch out for the bread pudding.  It will make you come back."], ["Beez H.", "Service is generally pretty good. Beef carpaccio is hands down my favorite item. Try the sangria also"], ["Sam B.", "Absolutely love this place. LOVE this place."], ["David R.", "Had the Lobster Club Sandwich... was delicious!  If you like REAL food... you'll enjoy this place."], ["Shanna L.", "I was in Little Rock visiting a friend and she suggested this place for brunch. She had been a few times and said that they have an amazing brunch buffet with everything from flatbread pizza to eggs benedict and chocolate chip waffles.  Obviously, I was sold. Upon arrival, I was impressed with the overall look of the place.  It's in kind of a strip mall multiplex area, so I was half expecting a Chilis atmosphere.  Instead, it was more like a Sambuca (for you Dallas folks), with a large, well appointed interior and a nice patio with bistro tables as well as lounge furniture that I would imagine would be a great happy hour spot.  the The buffet was definitely extensive, with separate sections for salads, pizzas, hummus and other \"appetizer\" bites, then on to fruit display, cocktail shrimp etc before you reach the real deal - carving station, waffle station to kick off the hot entrees - then a long line of fried chicken, rosemary potatoes, pasta, biscuits and gravy, you name it - EXCEPT grits (boooo!).  They also do $2 mimosas and bloody marys, and since I don't do OJ they were happy to sub in a poinsettia for me and surprisingly, they made them PERFECTLY with just a tiny splash of cran, not a half and half-er which I hate. Service was great as well, we were catching up so we stayed longer than most of the other tables who were in and out - and she never grew impatient with us, keeping our drinks full but not imposing.  My only complaints about this place were related to the buffet set up- it was in the bar area, and not much room between the 2 \"lines\" - one along the bar and one along the area where they set up the hot food stations.  People were struggling to get their filled plates through the line to get back to their tables, and I for one hate to walk past a bunch of people with food on my plate - kinda weird about strangers eyeing (and breathing on) what I'm about to devour.  Also, they had a jazz trio which was really nice, but they were positioned awkwardly in the bar area where the buffet is, so the saxophone man was a little too close for comfort to the buffet plates, and the music was a bit loud for those standing in line waiting.  Food service and atmosphere, great - execution of buffet, off the mark.  All in all 4 stars and will definitely visit again."], ["Tim O.", "Being a huge fan of Yayas Denver I was very excited to see a Yayas during my visit to little rock. We were immediately greeted and sat at a requested booth even without a reservation. Our server Haley was wonderful and made great recommendations. The food, the wine, and the service was exceptional. Yayas knocked it out of the park with a wonderful post thanksgiving dinner for my family and I!"], ["Dennis C.", "We drove over to the rich side of town on a recommendation from a big shot lawyer my colleague knew. And the food was fantastic! Def recommend checking it out."], ["K M.", "The calamari is good, as is the Free Range Chicken.  The chicken is very rich, with berry capers, roasted potatoes and enough to feed two people.  The brunch on Sunday is plentiful and tasty, too.  Good wines, too.  Great place for a good meal."], ["Jason B.", "Anniversary dinner with my wife. We had the carpaccio, scallops, duck and peach bread pudding. The food was all great. The service was excellent. The cocktails were just ok,specialty coctails were sub-par. I did get a dirty martini with blue cheese olives that was good. Just a sugestion to the restaurant, martini glasses should be chilled before the drink is poured. The atmosphere was a little Loud for an anniversary dinner. The main complaint I have is that I told them when I confirmed my reservation that it was my anniversary. When we showed up there was no mention of it. At a place like this I would expect them to have made a note and for both the hostess and the server to have told my wife \"happy anniversary\".  This alone would have added a star to this review."], ["Bill M.", "Plain, ok food. Poor to fair service. Awful brunch. If you want to check out dinner, it is hit or miss. Stay away from brunch. I won't be back... ever!"], ["Chris L.", "When I was a frequent traveler to the Little Rock area, this was my go to place. I have visited several times of the past weeks and can tell you I am a fan of Yaya's. My favorites have to be the bruschetta for a starter, for entree it would be the fresh atlantic salmon over the lobster stuffed ravioli, and for desert you cant go wrong with either the filo dough brownie or peach bread pudding in the carmel sauce. This is a must if you are in the little rock area."], ["Aaron D.", "Ordered the Shrimp Bisque, it had an average taste, but the consistency was like baby food. The server noticed that we did not eat it and said she would have it removed from the bill, however it was not removed. I ordered the pork chop, I asked for it to come medium, it came well done. It came with Brussel sprouts that unfortunately were overcooked as well. Lastly, I cannot understand why a pork chop is served in a bowl, it makes cutting and eating cumbersome.  Our server was very professional, appeared to have good menu knowledge, and was very pleasant. I have historically had mixed experiences at Ya Ya's, not sure that I will be rushing back."], ["Aparna B.", "We loved going to the Yia Yia in Memphis and when we moved to Texas we were really sad. Fast forward 8 months and when we were driving to Memphis , we stopped at the newly opened location at Little Rock. We have worked out a formula when we eat here. Start with the lemonade, order the grilled pita + hummus appetizerOrder the beef tenderloin - mediumooh and aah when we bite into the meat which is coated with the most AMAZING wine sauce with a hint of mmmm gorgonzola cheese and the garnished with feta which does wonderful things in your mouthFInally, order the apple tart dessert with ice creamIt a formula for bliss.Trust me folks, stick to the formula and you will never be disappointed!"], ["Alan H.", "I went to Yia Yia's for lunch on 12/26/13 with my wife and my mother. The service was fine, nothing out of the ordinary. The atmosphere was fine. The food was good but, of the three main dishes that we ordered, only one of them (a pasta dish) had an adequate portion size. I ordered the steak with frites ($16) and my wife ordered the grilled steak salad with quinoa ($16). When the server put the plates in front of us we were shocked. My steak frites was heavy on the potatoes (a tad overdone, BTW) and very light on the steak. There were four small pieces of meat on the plate, which I would guess to be about 5 ounces. My wife's salad was the same, except she was given even less meat than I was served. We ate our meals. We left hungry. We felt as if we had been cheated. Yia Yia's should rethink the portion/price ratio for these two dishes. They were tasty but not at all worth the money. We have eaten regularly at the Yia Yia's in Kansas City and have never encountered this problem before. SO, lunch diners: BEWARE."], ["Alia M.", "The food here has been some of the best I've had in the city. I am in love with the beef carpaccio."], ["Brittney G.", "LOVE this place!!! The bread and dip is amazing, the service is spectacular and the martinis are very, very good. My fiancé and I live this place for date night, and we are always treated like royalty. I'd recommend this place to anyone!"], ["Emily F.", "This was my first time dining here, for Sunday brunch. I immediately felt underdressed for Sunday brunch in jeans and a blouse. I also cringed when I saw that the brunch buffet was $16. But it was honestly worth it. The experience was very classy, and the food was very good and filling. My date and I weren't hungry for the rest of the day. The mimosa was a bit dry for my taste, but that's just me. I would definitely go back. Very classy!"]], "Pizza Hut": [["Ryan C.", "Pizza completely wrong but Pizza Hut did honor their mistake and refund my money."], ["Jeff C.", "Salad bar was fresh, simple order came out completely wrong and pizza tastes stale and way too greasy. And could I please get another Dr. Pepper??"], ["Jana M.", "**ATTENTION QUALITY CONTROL** This is my first review or criticism  of any food service posted, ever. Whatever efforts Pizza Hut is attempting to improve sales through \"drizzles\" or \"new recipes\" are a pathetic EPIC FAIL. We normally buy Papa Murphy's because the small effort to pick up and bake has been well worth the quality and taste. Not to mention you can buy a family size gourmet delight pizza for $10.00 less than Pizza Hut delivery. On a rainy night whim, we decided to try the delivery piggy pretzel pizza. It was supposed to have been made with a garlic parmesan sauce. Our delivery arrived with a tomato based pizza with a God awful drizzle on top of which we did not order. Apparently, it was supposed to be a \"balsamic vinaigrette \" drizzle which tasted exactly like runny brown sugar. The only pretzel aspect to this pizza was on the edges, and had enough salt to bloat you  two pant sizes larger. I have had crappy pizza in my time, but this is the first so disgusting that the original piece could not go down the hatch."], ["John H.", "I would stay clear of Pizza Hut in Little Rock.  Their service has been hit and miss.  The time before last, they said it would be a 3 hour wait.  This past time, they delivered cold pizza about an hour late, left part of the order at the store, and were rude in the process."], ["Donny K.", "Excellent and timely delivery service,  pizza showed up steaming hot and fresh.  I was told 45 minutes but the pizza showed up in 30.  Will order from them again."]], "Graffiti's Italian Restaurant": [], "BRAVO! Cucina Italiana": [["Chance E.", "Great service. Fast. I had salmon and the wife had chicken Marsala. Both entrees were wonderful. We will return in the future."], ["Elroy W.", "Never had a bad meal here! Lobster bisque is great, spicy scallops great, lobster ravioli great, salad great, staff great!!!"], ["Julie G.", "Greatly disappointed by the quality of food and professionalism of the kitchen staff. We arrived at 6:15, served at 7:45. One person in our party never received their order, spoke with the manager on duty only to be told, \"it will be out in a minute\". Everyone else had finished. Our waiter was fabulous, apologized profusely, and brought complimentary desserts."], ["John K.", "Best Italian in Little Rock. I ordered the Chicken Scaloppini and was blown away. We will definitely be back again."], ["Maria C.", "So my g/f took me here for some drinks and appys upon my arrival. At first our service was a bit slow (had to deduct a star). My g/f wanted to have her party catered and the manager came over to discuss options. She was so sweet and knowledgeable. It was then when the service picked up. Everyone was super helpful and friendly thereafter. My g/f mentioned that I was a \"food blogger\" and I'm not sure if that contributed to better service... Anywho... We ordered the following: Calamari: It was good, but wasn't crispy enough for me. I like my calamari with crunch! Crispy Shrimp: This is my fav out of all the appys we had. I would have preferred a bit more batter, but I love my shrimp. Ravioli: Too filling. Came with about 4-5 large pieces and filled with cheese. Too rich for me. Spinach Dip: This was OK to me. My least fav. 2 Cabs: My g/f ordered and she loved it. 2 Muscato D'Astis: I ordered 2 and ended up purchasing a bottle at a nearby wine store to take back home with me. 2 Lemon Drops: We finished our happy hours with a nightcap for the road. It was delish! Personally, I'm not real big in eating out at Italian restaurants; however, this place does have potential in this newer shopping center. This is a great date spot or a place to unwind for happy hour. Apparently, this is a happening place as the outdoor patio got a bit busy for dinner on a weeknight. Total damage with grat = $120."], ["Rob M.", "Noisy, boisterous, possessed of a large menu, and a wait staff willing to modify it (and with good suggestions, too!). Thoroughly enjoyed my dinner here. Yes, a chain, but don't hold it against them -- these guys know their stuff."], ["James H.", "i didnt know this place was a chain.. but the food here is OKAY.. everything here was mediocre but pretty fairly priced. I really didn't like the fact that they used a glass to hold warm water.. The one thing that made this place especially mediocre was how the salads were DRENCHED in dressing and cheese... i had to pick apart the salad in order to not drink the sauce. Their appetizer shrimp was delicious, calamari mediocre, and pizza mediocre Probably will be ordering something beyond a salad in the future."], ["Bradley B.", "Love this place. They tend to pack out pretty, so always call ahead if you plan on going on a weekend at night. Go. Look at the menu. See something that sounds good? Most likely is. I haven't had anything there I didn't enjoy."], ["Myia B.", "Came here with my MIL/SIL...MIL loves the place - she likes good service.  I ordered the lasagna and a salad.  It was good.  The salad was tastier than the lasagna.  SIL ordered a flatbread.  The portions were a little on the small side.  Would I come back?  I would give it one more whirl."], ["Nathan P.", "The atmosphere is kind of pretty, and the food is decent, but the prices are REALLY high for what you get. Someone treated me there for my birthday, and while I ordered the lowest priced item on the menu since I ate a heavy lunch (a salad), I didn't be a whole lot for the price. If you like Italian food, the atmosphere is nice, but be prepared to spend a lot of money on smaller portions of food. For the money, I'd rather have something more like LongHorn's."], ["Adina W.", "Before coming into the restaurant, i was REALLY LOOKING FORWARD to coming here! I am extremely disappointed that the food wasn't as good as I expected.1. my food came out COLD. I didn't ask them to do anything about it, but i did let the server know. He did offer to do something about it, but I didn't think it was worth the hassle. The food would have been great, if it was hot!2. The calamari appetizer was really good.3. I'm not a big fan of the set up of the restaurant. I don't like low dividers/chairs. Everything was too open and I like higher boothes/chairs. Everyone could watch everyone eating and I'm not a big fan of that.4. I thought it was really cool that they have a server who knows sign language and she was signing with a couple who were deaf. I LOVE that, it makes me happy.I think I am willing to try this place again, maybe in a few months."], ["Matt P.", "Bravo has a nice atmosphere and generally provides a solid, if somewhat generic, experience. Some of the food is good, some just mediocre. It's a good place for a large group. Happy hour on the patio is probably the best way to go."], ["Tam V.", "The sister chain for Brio's, the disastrously overpriced/bland Italian chain. This place is almost the same when it comes to price but I will still go here, just because this location seemed to make it actually delicious and also the fact that people in Little Rock don't look at this as a chain as Olive Garden. I wouldn't really recommend the pasta here but definitely go for the steaks (order a cooking grade down from what you want here) or the fish. If you are just dying for pasta based course, go for the lobster ravioli."], ["T. C.", "Our meet up group did a farewell brunch for one of our members here.  It was decent enough. I loved the overall look and decor, but as another reviewer said it is really open and people can get all in your conversations...no Bueno.  The eggs were horrible they tasted watered down and fake, for that price another no Bueno. Other than that everyone was pretty satisfied with our meals. I wouldn't make this a regular stop on my foodie list."], ["Vardah S.", "I came here with a group of friends for a farewell dinner and I was pretty pleased with how everything came out. A couple of people ordered the Mozzarella Manicotti as an appetizer and i found that it wasn't very delicious but according to a couple of people around the table, the Italian Wedding Soup is to die for. For my entrée, I ordered the Shrimp Diavolo and found it to be pretty good. There was a lot of excess sauce which I prefer when it comes to my pasta but others might not. It cost $18 which I believe to be too much for what it but since it's a fancy restaurant I expected as much. For dessert, my friend and I split a crème brûlée and it was absolutely delicious and at $3 a piece it wasn't very expensive for either of us.My biggest complaint would definitely be the service. They were slow to wait on us and even though there were 3 serving our table I had to wait about 30 minutes for a glass of water. Bravo is known for their bread (rightly so, it's delicious) but the servers didn't bring enough to service a table of 15 and didn't bring more until most of the table was already finished with dinner. Ultimately, if you're going to come here with a large group, don't expect to get really good service or even the best quality food. Do look forward to dessert though, it's a good way to end a dinner here."], ["Amber L.", "So, technically today is Bravo's grand opening. However, my family and I had the honor of enjoying a free meal - appetizer, side dishes, entrees, and dessert- during Bravo's trial run/preview night. We were very impressed.First of all, let me just say that the staff was very attentive and friendly. They were a tad nervous at times, but working hard to follow procedure and give great service. Our glasses were never empty, and we had all the bread we could eat.The restaurant is in the Promenade at Chenal shopping center, and is beautiful. A large facility, well modeled and decorated. The outside seating looked comfy and inviting, and has a huge fireplace to crowd around during winter.On to the food- classic Italian with a twist. The rustica insalada salad is awesome- lettuce, bacon, pears, pecans, cranberries, and balsamic vinegarette. So good! My husband had the Italian wedding soup, which he enjoyed. The bread was light, fluffy, and tasty.I had a cheese ravioli dish with alfredo, tomato, and pesto sauces. My Mother-in-Law had lasagna- a giant portion, also with alfredo and tomato sauces. My husband had a pesto tortellini dish with jalapeños. And my Father-in-Law had a steak dish. All were excellent! And something different than the norm.If I have any negatives, it would be the dessert. Not bad, just alright. We had the option of choosing NY style cheesecake, chocolate chip bread pudding, or a 3 dessert plate- chocolate cake and ice cream, tiramisu, and a berry cake of sorts. No contest for us- we picked the 3. The chocolate cake was great, the others were alright. Yet, once again, I have no real complaints. We had an excellent experience! Be sure to try it out. You won't be disappointed."], ["Kurt H.", "Went here for brunch on Sunday (2/10/2013) and was not very impressed. Pasta was mediocre at best. The service was good, as my waitress was attentive. The interior is typical of a Italian restaurant chain. There are much better chains options available (e.g., Olive Garden). The lunch specials during the week might be worth it but I would avoid BRAVO! for dinner. Ironically, this probably one of the better Italian restaurants in Little Rock. I would not recommend taking a date unless you did not a second date!  My take on Italian food is slightly biased as I grew up in New Jersey near NYC with a high density of Italian restaurants."], ["Todd B.", "I generally do not like chain restaurants but Bravo! bucks the trend with very flavorful food (and it is consistent.)  I really enjoy the braised beef ravioli and the lobster bisque.The flatbreads are a bit dry sometimes but the cheesecake dessert makes up for it if you have an appetite left after finishing the large entrees.  I have been half a dozen times and they have always delivered.  Unlike other \"Italian\" chains, Bravo! actually does it right."], ["Jimena A.", "the Bravo's here in Little Rock is perfect..I have been to others,but they weren't as good as here..I really enjoyed the happy hour..the food is amazing.."], ["John C.", "BRAVO! Cucina Italiana is a perfect example of an age-old story. A restaurant opens, and driven by the fanfare and attention, the standards remain high. As time goes by, a routine develops and standards begin to fall. I've been to this restaurant multiple times, ranging from shortly after opening to last weekend (8/20/2011). On the most recent visit to BRAVO! (a group of 4) we were seated promptly since we had actually made a reservation for 6:30. Once seated, we were attended to quickly, however, our waiter encountered something he never expected. Apparently the roof air conditioning unit was draining into the ceiling so a ceiling tile right next to our table became saturated and began crumbling and falling to the floor (in the aisle) before we ordered our appetizers. I recognize that this was a fluke, but the reason it causes the restaurant to lose a star is the way the staff responded. Water poured from the ceiling (onto some guests) but very little concern was shown for the guests. We were moved to a different table, but no attempt was made to clean up the mess, nor did the staff warn people walking under the crumbling ceiling panel of the danger.Once at our new table we ordered our drinks and appetizers. The drinks were more than adequate. A glass of Sam Adams and a Margarita got excellent reviews. The ladies each ordered a glass of Moscato d'Asti. They had mixed feelings about it. It was sweet, but one-dimensionally sweet. Also ordered were an amaretto sour and a glass of the Grayson Cellars Cabernet Sauvignon. Both were excellent. We tried two appetizers, the Crispy Mozzarella Ravioli and the Calamari Fritti. The Mozzarella Ravioli was wonderful--full of flavor and perfectly crispy. The sauces enhanced the already great flavor. The Calamari was a little bit of a let down. It was a little bland and relied on the sauces for all of the flavor--not ideal. Two in our party also ordered the Lobster Bisque and gave it rave reviews. Of course, it goes without saying that the complimentary bread and olive oil were delicious.For the entrees, three of us ordered the Petit Filet & Shrimp, and one person ordered the Eggplant Parmesan. The entrees presented us with further evidence of the falling standards. All three steaks were over cooked. Two were ordered medium-rare. Both were cooked between medium and medium-well. A third was ordered medium. It was cooked well-done. There really is no reason to overcook a filet. The filets were also a little under-seasoned. The shrimp, on the other hand, was excellent. The garnish was delicious as well. The Eggplant Parmesan was very well received.For dessert, everyone enjoyed the New York cheesecake. And, of course, everyone loved it.BRAVO! remains a good restaurant, and we will continue to dine there. Hopefully their standards (both in the kitchen and in the dining room) will not continue in a downward trajectory."]], "Salut Bistro at Prospect Place": [], "Ristorante Capeo": [], "Ciao Italian Restaurant": [], "NYPD Pizza": []}