{"Al Seraj Mediterranean Restaurant": [], "Marketplace Grill- Little Rock": [], "Istanbul Mediterranean": [], "Leo's Greek Castle": [], "Taziki's Mediterranean Cafe": [], "Kebab House": [], "BRAVO! Cucina Italiana": [["Chance E.", "Great service. Fast. I had salmon and the wife had chicken Marsala. Both entrees were wonderful. We will return in the future."], ["Elroy W.", "Never had a bad meal here! Lobster bisque is great, spicy scallops great, lobster ravioli great, salad great, staff great!!!"], ["Julie G.", "Greatly disappointed by the quality of food and professionalism of the kitchen staff. We arrived at 6:15, served at 7:45. One person in our party never received their order, spoke with the manager on duty only to be told, \"it will be out in a minute\". Everyone else had finished. Our waiter was fabulous, apologized profusely, and brought complimentary desserts."], ["John K.", "Best Italian in Little Rock. I ordered the Chicken Scaloppini and was blown away. We will definitely be back again."], ["Maria C.", "So my g/f took me here for some drinks and appys upon my arrival. At first our service was a bit slow (had to deduct a star). My g/f wanted to have her party catered and the manager came over to discuss options. She was so sweet and knowledgeable. It was then when the service picked up. Everyone was super helpful and friendly thereafter. My g/f mentioned that I was a \"food blogger\" and I'm not sure if that contributed to better service... Anywho... We ordered the following: Calamari: It was good, but wasn't crispy enough for me. I like my calamari with crunch! Crispy Shrimp: This is my fav out of all the appys we had. I would have preferred a bit more batter, but I love my shrimp. Ravioli: Too filling. Came with about 4-5 large pieces and filled with cheese. Too rich for me. Spinach Dip: This was OK to me. My least fav. 2 Cabs: My g/f ordered and she loved it. 2 Muscato D'Astis: I ordered 2 and ended up purchasing a bottle at a nearby wine store to take back home with me. 2 Lemon Drops: We finished our happy hours with a nightcap for the road. It was delish! Personally, I'm not real big in eating out at Italian restaurants; however, this place does have potential in this newer shopping center. This is a great date spot or a place to unwind for happy hour. Apparently, this is a happening place as the outdoor patio got a bit busy for dinner on a weeknight. Total damage with grat = $120."], ["Rob M.", "Noisy, boisterous, possessed of a large menu, and a wait staff willing to modify it (and with good suggestions, too!). Thoroughly enjoyed my dinner here. Yes, a chain, but don't hold it against them -- these guys know their stuff."], ["James H.", "i didnt know this place was a chain.. but the food here is OKAY.. everything here was mediocre but pretty fairly priced. I really didn't like the fact that they used a glass to hold warm water.. The one thing that made this place especially mediocre was how the salads were DRENCHED in dressing and cheese... i had to pick apart the salad in order to not drink the sauce. Their appetizer shrimp was delicious, calamari mediocre, and pizza mediocre Probably will be ordering something beyond a salad in the future."], ["Bradley B.", "Love this place. They tend to pack out pretty, so always call ahead if you plan on going on a weekend at night. Go. Look at the menu. See something that sounds good? Most likely is. I haven't had anything there I didn't enjoy."], ["Myia B.", "Came here with my MIL/SIL...MIL loves the place - she likes good service.  I ordered the lasagna and a salad.  It was good.  The salad was tastier than the lasagna.  SIL ordered a flatbread.  The portions were a little on the small side.  Would I come back?  I would give it one more whirl."], ["Nathan P.", "The atmosphere is kind of pretty, and the food is decent, but the prices are REALLY high for what you get. Someone treated me there for my birthday, and while I ordered the lowest priced item on the menu since I ate a heavy lunch (a salad), I didn't be a whole lot for the price. If you like Italian food, the atmosphere is nice, but be prepared to spend a lot of money on smaller portions of food. For the money, I'd rather have something more like LongHorn's."], ["Adina W.", "Before coming into the restaurant, i was REALLY LOOKING FORWARD to coming here! I am extremely disappointed that the food wasn't as good as I expected.1. my food came out COLD. I didn't ask them to do anything about it, but i did let the server know. He did offer to do something about it, but I didn't think it was worth the hassle. The food would have been great, if it was hot!2. The calamari appetizer was really good.3. I'm not a big fan of the set up of the restaurant. I don't like low dividers/chairs. Everything was too open and I like higher boothes/chairs. Everyone could watch everyone eating and I'm not a big fan of that.4. I thought it was really cool that they have a server who knows sign language and she was signing with a couple who were deaf. I LOVE that, it makes me happy.I think I am willing to try this place again, maybe in a few months."], ["Matt P.", "Bravo has a nice atmosphere and generally provides a solid, if somewhat generic, experience. Some of the food is good, some just mediocre. It's a good place for a large group. Happy hour on the patio is probably the best way to go."], ["Tam V.", "The sister chain for Brio's, the disastrously overpriced/bland Italian chain. This place is almost the same when it comes to price but I will still go here, just because this location seemed to make it actually delicious and also the fact that people in Little Rock don't look at this as a chain as Olive Garden. I wouldn't really recommend the pasta here but definitely go for the steaks (order a cooking grade down from what you want here) or the fish. If you are just dying for pasta based course, go for the lobster ravioli."], ["T. C.", "Our meet up group did a farewell brunch for one of our members here.  It was decent enough. I loved the overall look and decor, but as another reviewer said it is really open and people can get all in your conversations...no Bueno.  The eggs were horrible they tasted watered down and fake, for that price another no Bueno. Other than that everyone was pretty satisfied with our meals. I wouldn't make this a regular stop on my foodie list."], ["Vardah S.", "I came here with a group of friends for a farewell dinner and I was pretty pleased with how everything came out. A couple of people ordered the Mozzarella Manicotti as an appetizer and i found that it wasn't very delicious but according to a couple of people around the table, the Italian Wedding Soup is to die for. For my entrée, I ordered the Shrimp Diavolo and found it to be pretty good. There was a lot of excess sauce which I prefer when it comes to my pasta but others might not. It cost $18 which I believe to be too much for what it but since it's a fancy restaurant I expected as much. For dessert, my friend and I split a crème brûlée and it was absolutely delicious and at $3 a piece it wasn't very expensive for either of us.My biggest complaint would definitely be the service. They were slow to wait on us and even though there were 3 serving our table I had to wait about 30 minutes for a glass of water. Bravo is known for their bread (rightly so, it's delicious) but the servers didn't bring enough to service a table of 15 and didn't bring more until most of the table was already finished with dinner. Ultimately, if you're going to come here with a large group, don't expect to get really good service or even the best quality food. Do look forward to dessert though, it's a good way to end a dinner here."], ["Amber L.", "So, technically today is Bravo's grand opening. However, my family and I had the honor of enjoying a free meal - appetizer, side dishes, entrees, and dessert- during Bravo's trial run/preview night. We were very impressed.First of all, let me just say that the staff was very attentive and friendly. They were a tad nervous at times, but working hard to follow procedure and give great service. Our glasses were never empty, and we had all the bread we could eat.The restaurant is in the Promenade at Chenal shopping center, and is beautiful. A large facility, well modeled and decorated. The outside seating looked comfy and inviting, and has a huge fireplace to crowd around during winter.On to the food- classic Italian with a twist. The rustica insalada salad is awesome- lettuce, bacon, pears, pecans, cranberries, and balsamic vinegarette. So good! My husband had the Italian wedding soup, which he enjoyed. The bread was light, fluffy, and tasty.I had a cheese ravioli dish with alfredo, tomato, and pesto sauces. My Mother-in-Law had lasagna- a giant portion, also with alfredo and tomato sauces. My husband had a pesto tortellini dish with jalapeños. And my Father-in-Law had a steak dish. All were excellent! And something different than the norm.If I have any negatives, it would be the dessert. Not bad, just alright. We had the option of choosing NY style cheesecake, chocolate chip bread pudding, or a 3 dessert plate- chocolate cake and ice cream, tiramisu, and a berry cake of sorts. No contest for us- we picked the 3. The chocolate cake was great, the others were alright. Yet, once again, I have no real complaints. We had an excellent experience! Be sure to try it out. You won't be disappointed."], ["Kurt H.", "Went here for brunch on Sunday (2/10/2013) and was not very impressed. Pasta was mediocre at best. The service was good, as my waitress was attentive. The interior is typical of a Italian restaurant chain. There are much better chains options available (e.g., Olive Garden). The lunch specials during the week might be worth it but I would avoid BRAVO! for dinner. Ironically, this probably one of the better Italian restaurants in Little Rock. I would not recommend taking a date unless you did not a second date!  My take on Italian food is slightly biased as I grew up in New Jersey near NYC with a high density of Italian restaurants."], ["Todd B.", "I generally do not like chain restaurants but Bravo! bucks the trend with very flavorful food (and it is consistent.)  I really enjoy the braised beef ravioli and the lobster bisque.The flatbreads are a bit dry sometimes but the cheesecake dessert makes up for it if you have an appetite left after finishing the large entrees.  I have been half a dozen times and they have always delivered.  Unlike other \"Italian\" chains, Bravo! actually does it right."], ["Jimena A.", "the Bravo's here in Little Rock is perfect..I have been to others,but they weren't as good as here..I really enjoyed the happy hour..the food is amazing.."], ["John C.", "BRAVO! Cucina Italiana is a perfect example of an age-old story. A restaurant opens, and driven by the fanfare and attention, the standards remain high. As time goes by, a routine develops and standards begin to fall. I've been to this restaurant multiple times, ranging from shortly after opening to last weekend (8/20/2011). On the most recent visit to BRAVO! (a group of 4) we were seated promptly since we had actually made a reservation for 6:30. Once seated, we were attended to quickly, however, our waiter encountered something he never expected. Apparently the roof air conditioning unit was draining into the ceiling so a ceiling tile right next to our table became saturated and began crumbling and falling to the floor (in the aisle) before we ordered our appetizers. I recognize that this was a fluke, but the reason it causes the restaurant to lose a star is the way the staff responded. Water poured from the ceiling (onto some guests) but very little concern was shown for the guests. We were moved to a different table, but no attempt was made to clean up the mess, nor did the staff warn people walking under the crumbling ceiling panel of the danger.Once at our new table we ordered our drinks and appetizers. The drinks were more than adequate. A glass of Sam Adams and a Margarita got excellent reviews. The ladies each ordered a glass of Moscato d'Asti. They had mixed feelings about it. It was sweet, but one-dimensionally sweet. Also ordered were an amaretto sour and a glass of the Grayson Cellars Cabernet Sauvignon. Both were excellent. We tried two appetizers, the Crispy Mozzarella Ravioli and the Calamari Fritti. The Mozzarella Ravioli was wonderful--full of flavor and perfectly crispy. The sauces enhanced the already great flavor. The Calamari was a little bit of a let down. It was a little bland and relied on the sauces for all of the flavor--not ideal. Two in our party also ordered the Lobster Bisque and gave it rave reviews. Of course, it goes without saying that the complimentary bread and olive oil were delicious.For the entrees, three of us ordered the Petit Filet & Shrimp, and one person ordered the Eggplant Parmesan. The entrees presented us with further evidence of the falling standards. All three steaks were over cooked. Two were ordered medium-rare. Both were cooked between medium and medium-well. A third was ordered medium. It was cooked well-done. There really is no reason to overcook a filet. The filets were also a little under-seasoned. The shrimp, on the other hand, was excellent. The garnish was delicious as well. The Eggplant Parmesan was very well received.For dessert, everyone enjoyed the New York cheesecake. And, of course, everyone loved it.BRAVO! remains a good restaurant, and we will continue to dine there. Hopefully their standards (both in the kitchen and in the dining room) will not continue in a downward trajectory."]], "Zoe's Kitchen": [], "Layla's Market": [], "Ali Baba Mediterranean Restaurant & Market": [], "La Terraza Rum & Lounge": [["Danny W.", "WINNER!  Fantastic new restaurant in the former Arcadia location!  Venezuelan fusion restaurant that adds a great Columbian-Spanish-French flair to untraditional beef and chicken dishes. Intimate setting with excellent service (ask for Samantha) that is on point, and makes you feel at home. Armando Bolanos and his family have created an awesome diversion from the typical Little Rock chain experience. A MUST TRY!"], ["Russell W.", "I was very excited about this restaurant when I heard it opening. Like...  teenage girl at Bieber concert excited. But then all of the sudden I realized I wasn't at a concert and fell back to reality. It's time like these I feel conflicted. I'm excited about the promise but unfortunately I think the restaurant needs to fix a couple things. Here is my top pro and con, since I hate being a negative Nancy and rarely give bad reviews. Con:1) the price points and dishes don't align. I've eaten similar food in higher cost markets at much lower price points. My pabellon (sp?)  serving size/quality seemed to be more a $10-12 instead of $16.  Given how cheap most price points are in Little Rock, I doubt I'm the only one noticing.  Unless I'm missing something... like I ate Kobe beef marinated in gold  on accident.  Pro 1) their patio is a strong asset but they are opening in winter. Hopefully they figure out how to fully utilize the patio as it has a lot of room. I hope that the restaurant figures it out, since I love food diversity. But I don't think the vibe of the restaurant, food, and price points align very well."], ["Andrew B.", "Very disappointing restaurant.  I'm a huge fan of Venezuelan food and I was excited that Little Rock would finally have one.  The atmosphere was fine although a little music would be an improvement, the tables were too close together (got bumped into at least 20 times during the course of our meal), the chairs were rather flimsy and not particularly comfortable (not something I usually even think about), the menu options were largely italian and spanish it seemed - traditional Venezuelan fare like arepas, cachapas, etc. were missing from the menu.  The prices were high, portions rather paltry, and the quality was hit and miss.  I will say that the shredded beef was superb but not enough to make up for all the shortcomings.  I doubt I will return to this restaurant except maybe to give them a chance at lunch (which I understand includes more Venezuelan options and hopefully more reasonable pricing)."]], "Ciao Italian Restaurant": [], "Trio's Restaurant": [], "Graffiti's Italian Restaurant": [], "Pita Pit": [], "The Terrace Mediterranean Kitchen": [["Maggie M.", "Good food, good service -- if you didn't know what you were looking for, you'd never find this place in the Merryl Lynch office building -- there are no signs or exterior advertising -- but it's definitely worth finding. The food was delicious; we had the warm goat cheese appetizer (awesome! I don't always like goat cheese), Athenian salad and rack of lamb with grilled asparagus. Everthing was done perfectly. Our server Justin was truly wonderful, attentive without being obtrusive, friendly and helpful about the menu, and he brought the courses with perfect timing. When we arrived, the hostess said \"we're going to need you to sit at that table back there,\" which we thought was an odd statement  (what happened to  \"welcome, let me show you to your table\"?) we wondered if we were somehow underdressed for the place, or we arrived without reservations?? It's certainly not fancy inside. It is small and clean, and there were tables open at 6:00 on a Wednesday evening. Anyway,  we liked our table by the front door, tucked away a bit, and Justin's professionalism made up for the awkward feeling we got from the hostess. I've eaten in many Mediterranean restaurants, from large and upscale to small and eclectic, in major cities around the US, and the food at the Terrace compares favourably. There were so many interesting menu offerings, I will definitely be back to try some others"], ["Dawn R.", "Shrimp pirogue was delicious. Hummus was great. Was late being seated despite reservation. Would have been nice to have been offered a drink while we waited considering the wait. Meal was a little rushed - but delicious :-) Will go back for sure."], ["Apurva N.", "This place is a great find in an otherwise somewhat dismal Little Rock restaurant scene!We were a group of 4 and got the restaurant about 20 minutes before our reservation. The pleasant hostess seated us almost immediately. The decor of the place feels very New York-ey and looks quite nice and upscale.We ordered the Warm Goat Cheese and the Hummus Trio appetizers which we all thought were excellent. The red pesto that came with the goat cheese was addictive!For my main course, I ordered the Shrimp Perogue (sp?), which was really good. The eggplant in the dish seemed a bit random - not sure it fit in well with the shrimp and the sauce. Nevertheless, it was very tasty.My colleagues got an assortment of entre's. The rack of lamb was the stand-out from what I heard. My collegue was salivating over his \"tender and juicy\" dish, which I must admit, did look quite appetizing.Overall, I think this is an excellent restaurant, and has popped up on our map just when we had eaten practically everything on the Acadia menu. If you haven't been here before, you are definitely missing out. Worth visiting, and I will definitely be back!"], ["April B.", "This place is amazing. I work upstairs and eat there about 3 times a week. The chicken cypress is amazing! The staff is Wonderful! Thomas and Melissa treat all their clients like family! The owner is very hands on and makes sure that everything is perfect! The space is really small but the great food makes you forget about it."], ["Erin J.", "I took my kids this time and they both loved it. It's a very small place and they do take reservations. I got the chicken terrace it's my favorite. You get 2 big chicken breasts that are crispy and filled with this cream cheese mixture. It's so wonderful. It comes with pasta and big potions so it's plenary to take home or split. The desserts are also very good so be sure to save room"], ["Dale R.", "The Mediterranean Kitchen is one of my favorite restaurants in Little Rock.  Great food! Great wine selection! Great wait staff!  Patrons are well dressed and this place has a real upscale feel.  Terrace is THE place to go if you want to get dressed up and have a really special and memorable experience.  However, getting a table can be difficult!  Reservations are always necessary on the weekends.  Overall Impression:  Its Good!! GO Eat There!!!"], ["Gregg P.", "This is mine and my wife's favorite place to enjoy a great meal with great service. Highly recommended!!! Order Frenchie's humus."], ["J R.", "A hidden gem that could really use better signage.  I found their offerings creative and flavorful.  I've forgotten the dish that I had (veal with shrimp & a spicy cream sauce) but it was out of this world good.  Pretty rare I give 5 stars but the Terrace is worthy of a 6th."], ["Andrew W.", "Mediterranean style menu, indoor and outdoor seating, intimate atmosphere with a good selection of wine and food. My wife loves the lamb and I agree it is amazing. Price is decent and food is worth the money."], ["Chocolate L.", "I have eaten here previously and  enjoyed it.  However, the most recent visit was a disaster.  I had reserved a table for a small business party.  When we arrived they were all booked, with no record of our reservations.  I could never trust them again."], ["Carol N.", "Cozy atmosphere. They take reservations! The salmon and the sample platter of their three different creme brûlées is wonderful. Great service. We also like the pork with raspberry and chipotle sauce."], ["Amber L.", "My husband and I recently visited Terrace on the Green (my first time!) for our anniversary. As mentioned in a previous post, they are definitely not located in a typical high end dining location. If you blink, you would miss them. However, our experience was an excellent one!First of all, I must admit that our waiter was very professional, friendly, and efficient. He knew the appropriate amount and times to check on us, and always made sure we had everything we needed. Our glasses were never empty.As for the food, my husband and I started with the hummus appetizer. It was some of the better hummus I have had. Just the right consistency.For entrees, my husband had a special they were serving. I had some type of chicken dish which was excellent! Wish I could remember the names of the dishes, but I can't seem to find a menu online to refresh my memory :) This isn't an every day sort of restaurant, but is great for special occasions. They have been a staple in Little Rock for many years - and now I know why."], ["Jennifer H.", "Service was excellent on a Tuesday night. We had the place to ourselves at 8:45. Outside seating area was nice & the shrubs hid a good bit of the street noise-- you wouldn't think you were next to a bank drive through :-)A friend was shocked when I told her we had the place to ourselves. She'd recently gone on a weekend night & every seat was taken.We both enjoyed our entrees. The goat cheese appetizer was nice."], ["Todd B.", "The restaurant has recently been remodeled and is now under new ownership.  They also changed the name to The Terrace Mediterranean Kitchen but the food is as good as ever.They have the best hummus and babaganoush anywhere in Arkansas and you cannot go wrong with many of their lunch specials.  I also really enjoy the gyro with feta added.Highly recommended.  Try to get there before 11:45 if going at lunch as the space is small and they are always packed.  You can find a table after 12:30 as well."], ["Sandra L.", "A local gem!  Small, cozy restaurant in a business complex (needs a sign!).  My husband had a pork tenderloin special with raspberry-chipotle sauce that was excellent.  My salmon was just OK due to a pasty creamy dill sauce that needed less thickening, amd more dill and lemon.  My husband loved his bread pudding dessert.  Excellent service and reasonable prices.  We would definitely go again."], ["J R.", "Read the reviews and headed to dinner on a Saturday night at 6pm. When we arrived to a restaurant that was a quarter full, the host advised us \"sorry we just took our last reservation'. As my wife and I both turned to each and scanned the room with 15 empty tables, we left and were extremely confused about what had just happened."], ["Rob M.", "Terrace is definitely not in a space you'd expect in Little Rock -- an office building isn't the first place you'd look for them, and they're nigh well invislbe there -- but the Mediterranean food is very good. I've had their chicken marsala (warning to low-carb types: it comes on a bed of pasta, not mentioned on the menu), and several other dishes; no complaints yet.One minor thing to keep in mind: they are closed between lunch and dinner.Very reasonably priced, and highly recommended."], ["David N.", "What an incredible evening! My teenage daughters and I took my wife to Terrace tonight for her birthday.  The food, the place and the service was simply superb. The appetizers of humus, goat cheese and tabouli were amazing. One of my daughters had a watermelon gazpacho that w all enjoyed. The entrées were also terrific. I was very happy with the evening. We will definitely be going back. Thanks for a great evening Mike."], ["s. m. j.", "I love this Mediterranean restaurant in Little Rock. We've been coming here for close to eight years and are always pleased with the service, food and experience. I have to disclose that I am kind of a hummus connoisseur, having spent a summer in Detroit (no, listen!), which at the time had the largest Arabic population outside of the Middle East, and I really like hummus to be creamy and subtly flavorful. I think Terrace has some of the best hummus I've ever had, and I think they offer the best hummus in Little Rock. We often order some to go at the end of our meal to have the next day. One of my favorite restaurants in the nation is Jerusalem's in Minneapolis, which has the best shawirma (or gyro meat), and Terrace's is just as good!Last night we visited again, and noticed some changes. The floor plan had been altered to open up the dining room a little, which we thought was attractive. We had a lovely table on the outside wall for two, and I ordered a cosmopolitan (the Yelp page above says beer and wine only, but they have a full bar and mixed a cool, refreshing cosmo for me). I almost always have the same dinner: My husband and I split some hummus to start, then I have the warm goat cheese appetizer. Last night was no exception to this ritual of two appetizers. The warm goat cheese is nut crusted and they serve a healthy portion along with roasted garlic and olives with toast. (Last night, the toast was stale, which shocked me because they never do anything wrong here. I ate the goat cheese and garlic with pita, and when I mentioned it to the server she was horrified, said she was sorry, the manager came over and also apologized. I didn't want to make a big deal about it, because I LOVE this restaurant and just wanted them to know. Later, when the bill came, they did not charge us for this item. I said I hadn't meant for them to do this, and the waitress said she knew that and again, they were sorry that there was a problem.) I love the goat cheese! It's just heavenly. For my entree I almost always ask them to make a special plate for me, gyro meat, tabouli and hummus, and they always do. It's a trio of my favorite Mediterranean flavors! The meat is so delicious and tender, and goes so well with the crisp freshness of the tabouli salad (and I can't go wrong with more hummus, right?). But last night, I was preparing for a long training run, so I wanted more carbs. Looking over the menu made me sad that I couldn't order about five or six different entrees. So many things looked great, plus they had a lot of delicious sounding specials. I asked the waitress if I should get the hamburger with blue cheese and hand-cut fries, which was a special, or the veal and pecan fettucini, which is on the regular menu. She directed my choice toward the veal, and I was so grateful. It was amazing!  A slim veal cut, lightly breaded and sauteed with pecans and sauce and a delicious side of fettucini and veggies. I brought home about 1/3 of it because it was so delicious, I didn't want to leave it. My husband was going to a poker party, where there would be snacks and pizza, so he didn't want a giant meal, though he also said everything looked so good, as usual. He ordered one of his favorite things to start, the dolmades. He then ordered one of the special appetizers for an entree, the spanakopita. These came in triangles, and I could see they were perfectly brushed with butter; the filo crusts were golden brown, and my husband liked the dill used to flavor them. We've always enjoyed our evenings here and often bring friends who are visiting Little Rock to this gem of a restaurant. I highly recommend it!"], ["That's Princess T.", "For being as small as Terrace on the Greens is and the location (In an office building) it was wonderful.  This Greek with Italian flare restaurant really makes for a great overall experience.  The menu is small but the flavor is HUGE!A little slow on service, the waitstaff is a  younger crowd that not always seems sincere, rest assured the food is good.Not much of a drinker so I'm not sure what the wine list has to offer, this place is always packed!Great for a light refreshing dinner!"]], "Boulevard Bread Company": [], "Frullati Cafe": []}