{"Casa Manana Rock": [], "Juanita's Mexican Cafe & Bar": [["Mitch R.", "We loved this place.   The atmosphere was great.  Loved the band.  We ordered lots of appetizers for our meal.   They were all good.  We ordered margaritas    They were enjoyable.  We would go back here.  We did not think it was expensive."], ["Jo D.", "The only reason I gave two stars is because the shows upstairs are great. The restaurant is terrible. Don't bother.Service is slow. People seat you then forget about you for 30 minutes. The salsa is bland. The food was messed up from what we ordered and bland. The drinks are bland and mostly ice. Come for the shows but skip the restaurant."], ["Lesley M.", "Though a great place for salsa dancing, Juanita's once vibrant menu has dwindled in a drastic way. My friends and I went and tried the new menu last night. We started out with luke warm-too thick cheese dip. The Wet Willy entrée my boyfriend ordered had a rank smell of old meat, and the aftertaste couldn't be doused with their watered-down margarita. We sent it back, and the manager only comped 20% on the item--something that could have caused a food poisoning lawsuit.The Enchilada Laredo was ok, but you could tell their once flavorful enchilada sauce is no longer homemade. Though the staff was nice, it was clear the new menu was a sudden change, as no one could answer our questions.Poor management + worse food = we won't be back"], ["Felix G.", "Do not eat here, if you ate from Texas. This place makes taco hell look like an authentic Mexican food restaurant. Beers and Babes in Toyland is the best they hot going for them. Stick to the shows and you will see."], ["Carl K.", "Not to sure about the food here but I've seen several concerts at the \" new location \" and dozens at the old location on main street. Usually a great venue and they have a good variety of musicians and bands that come threw."], ["Michael G.", "I used to frequent Juanitas at its old location on Main St in the Quapaw Quarter. It's food and margaritas were fabulous. Not true today. Had 3 margaritas at happy hour and found them to be alcohol free. Guess the alcohol was extra? Food was ok, not great. I've had better elsewhere. I'd been dreaming of good Mexican food and fabulous margaritas on the flight from ATL to LR. Got terribly dissapointed. Guess you can't go home."], ["Stefanie C.", "Maybe being from Texas im spoiled by Tex-Mex and Mexican food so I'm biased. But this place was horrible. For starters our server was just downright snotty and mean. I came in with three guy friends while we were in town working. We decided to stop in here to grab dinner. After waiting a good 20 minutes we had to flag someone down to ask for waters and menus. The waitress we flagged down seemed overly annoyed that we asked for those two items. When our waitress came by she acted as if we were a burden to want to order food. It was 7:30 on a Saturday and the place had only 4 tables not including ours. If it was busy I would have understood but it wasn't.The menu only has about 10-12 items on it so you're very limited. I ordered the taco salad for my meal. The menu said it ONLY came with beef. I asked if I could sub chicken and the waitress said she would try. Little did I know, apparently chicken is more expensive than beef in Arkansas. I was charged $2 extra for chicken instead of beef. The salad itself was fine but nothing I would crave or really want to order again. Halfway through our meal I started to feel like something was dripping on me. Yup! The pipe above our table had started to drip and was getting all over me and my friend next to me. We mentioned it to the waitress and her exact response was \"oh you can move the table forward more if you don't want to get wet.\" You have got to be kidding me?!? That was the end of it for me. I just wanted to get out. Overall I would never return. A tiny menu with barely average food and horrible service is not a place I care to come back to."], ["Jessdlew L.", "I ordered pulled pork tacos. Awful. Almost no meat, and cold. The rice was not done and inedible. I told our waitress (who acted like we were annoying her the entire time while we were there) and she gave me a new order that was just as bad. I told her the rice was still hard, she replied \"what do you mean by hard\". I said \"opposite of soft\"."], ["Bob W.", "Got to Juanita's about 9pm Saturday night and there was only a handful of people there. We had a couple of drinks on the patio, which is a very nice, cozy spot but it just wasn't happening. I don't know if they need drink specials or a band outside but being down on the end of the street...they need something that makes you want to come down. I'll go back again but then I'm weird that way"], ["Shan A.", "Ordered vegetarian fajitas and vegetarian nachos. Didn't expect squash and zucchini on Mexican food. The chips from the nachos were super soggy and had to use the chips from the basket to eat them. The food was greasy and bland. No Mexican spices at all. The salsa tasted like it was made from canned stewed tomatoes didn't taste fresh at all. The service was mediocre but understandably so for how understaffed they were. Great location and atmosphere,  too bad the food sucks."], ["Jered R.", "Everything everyone else says is true, slow service, poor service, scarce service. Mediocre food and lousy staff. Only here because I'm at a show upstairs and wanted to limit travel for food. DO NOT COME HERE UNLESS YOU HAVE TO. Very disappointed all the way around."], ["Penny N.", "Juanitas has always been a decent experience but this time it was rough. Food took about 45 minutes because the cook got confused with our order, there were 5 of us, and the rice was rock hard and really dry.  We asked for new rice but never got it. Disappointed and won't return. They did give us half off the bill, which was a sign of some sort of customer service. Our server was really great despite the complaints we had."], ["Ann Marie F.", "I had one of the worst experiences I have ever had in a restaurant. If you are not a restaurant then don't advertise that you are. You can be a bar w/apps if you like. But, if you are just that then the drinks and apps need to be real! This place is total crap. It is really sad b/c it is a pretty cool looking restaurant. Exposed brick, nice stage. But the service was horrible, manager didn't know how to address a complaint at all!, food wasn't edible, 11/2 hour ticket time with little customers on a Friday night(maybe 10), watered down drinks-it honestly tasted like they threw house tequila, triple sec with some ice and topped w/water! It took 35 minutes to get a drink. After 25 minutes I asked if we could at least get waters. 35 minutes for cheese dip that was lumpy, gooey and gross! I will say the chips and salsa were good but they were free. Chicken fajitas were so burned that I couldn't eat them, beans had been sitting on expo line for probably 1 1/2 hours that it took to get the food out! We couldn't get our check and many other things went wrong. No one could ever check us out!!! So, someone decided to make us pay for drinks and went home hungry, disappointed and sad. I wanted to help them soooooo much but it seemed as if they couldn't even get it together to ask for help from another restaurant 2 help w/computer or tech support. It was absolutely insane!!! I honestly have never been this disappointed in any fast food, restaurant, bar, fine dining, etc!!! If computer is down why can't you do hand tickets old school? If the server sucks why doesn't mgr fire him? If the food is awful why didn't they try to recook or do a check back on food? If the drinks are terrible why isn't the bartender getting held accountable and why can't they make a great Top Shelf Margarita? It's a TexMex Restaurant! I didn't go to a sushi bar asking for a margarita! Just a total disappointment! We are from out of town and really wanted to have a great time! After 3 hours and most of us not eating and still having to pay for our watery gross drinks out of the cheapest triple sec at Top Shelf prices we were running to the shuttle for our sweet little hotel rooms."], ["J R.", "The move was not kind to Juanita's.The old location was PACKED for lunch daily, new spot you could shoot a gun without fear of hitting another diner.Food was \"ok\", not what it once was by any means.  Service was slow but friendly with a lot of apologies for forgotten items.Best I can tell they want to be a bar, maybe even a music venue-which they may be on weekends.I will probably never know."], ["Charlee H.", "I'm currently at this restaurant. I've been here for 1 hour at a table for 2. We've had 3 random people come check on us, only after we keep making puppy eyes at them. I'm still unsure who our server actually is. So, yeah....not great."], ["Roger E.", "Hmm I really had to do a double take based on the other reviews of Juanita's to make sure I had the right place. We came here during our trip to Little Rock and I found the food to be very good. I enjoyed the chips and salsa and everything I had was delicious. We have been pretty bummed not having a decent Mexican food experience out here having come from San Diego. I have to say I enjoyed my meal a lot, the wait staff was very nice and kept up fine on the drinks and overall it was very good and I would 100% come back when I go back to Little Rock later this year. Maybe I hit them on a really good day but I found their food and ambiance to be very nice and what I would expect from a Mexican Cantina."], ["Beau B.", "Great fish tacos. Wait staff was on top of things. I would recommend this place to anyone wanting a laid back place with good food and decent prices."], ["Cid S.", "Was on my way to the Discovery  Museum and was hungry, so I had a late lunch here. Only a few other folks in the place. My waitress was nice and friendly, although she seemed like she was kind of new there. A little unsure. But no issues.Had the grilled fish tacos -- delicious! The fish was unbreaded and nicely grilled, and tacos had a slightly spicy sauce, cabbage, and a little cheese. Really good. They were soft tacos, which was perfect. Came with retried beans & rice -- nothing remarkable about them. Chips & salsa also included; they were fresh and a nice starter. I would definitely come again for lunch!"], ["Paul H.", "I always have hope when I come here based on the old location, but food is fair to average and service is fair to average."], ["Deborah M.", "Himmm where do I start. Arrive at 9:00pm waited over 15 min to be seated (no menus) waitress that was assigned had no clue. (Her excuse is I have only been here 4 days). She didn't know menu, didn't know if they did pitchers of margaritas. She DID Know that they ran out of chips! (What do I eat my cheese dip with). After ordering food (VERY LIMITED MENU) we are through one pitcher of margaritas and we are told our food will be another 15-20min.   Asked if we could get something comped. Manager was VERY abrupt in explained he can't give us free margaritas but he could comp a meal if we want.  So far would NOT recommend."]], "Ponchitos Mexican Grill": [], "La Casa Real": [], "Cotija's Mexican Grill": [], "Cactus Jack's Mexican Restaurant": [], "Heights Taco & Tamale": [], "Fonda Mexican Cuisine": [], "Taqueria Karina Cafe": [], "Taqueria El Palenque": [], "Cantina Laredo": [], "La Hacienda Mexican Restaurant": [], "Del Campo A La Cuidad": [], "Chuy's": [], "La Frontera Mexican Grill": [], "Senor Tequila": [], "Local Lime": [], "El Chico": [], "The Fold: Botanas & Bar": [], "Lupita's Original Mexican Food": []}