{"Kiyens": [], "Sushi Cafe": [], "Hanaroo Sushi Bar": [], "Oishi Hibachi + Thai Cuisine": [], "Shogun Japanese Steakhouse & Sushi Bar": [], "Chi's Asian Café": [["Amy Q.", "Tried this restaurant last night. Waitress was super sweet & attentive. Ordered a Bud Light. Nope, they're out. Seriously!? Glad I didn't order a Prosecco...oh, that's right, don't have that either. Ordered chicken Lo Mein and shrimp with walnuts. My shrimp were SWIMMING in some sort of cream. Very heavy, tasted good, but heavy. Good size shrimp as well. No complaints there, just a very heavy sauce. Husband was ehh on his Lo Mein. Would I go back? Nah. Nothing to write home about."], ["Julie N.", "Mediocre Americanized Chinese food, but certainly not the worst in Little Rock (I wish I could find a non-snarky way of saying, \"but that's not saying much\".) Most dishes are overly sweet and/or bland. I live nearby and, lacking more suitable options to quench my need for Chinese food, have eaten here shamefully often. The only dishes I can legitimately recommend are the Singapore Rice Noodles, combination style, and the Crispy Calamari. Everything else tastes pretty much the same. The sides you get with the dinner combo are pretty good (hard to argue with fried cream cheese). I do actually like their sweet and sour soup, which is usually an abomination. Also, the folks working behind the counter (when I get take out) are ridiculously slow. Like they're stuck in the sticky, sweet sauce that is sloshed on most of the dishes."], ["Beth A.", "When we discovered this Asian spot, we made it our go-to place for Asian food in Little Rock. It's great to have this mixture of Chinese, Japanese, and some Thai. Everything tastes fresh here. Love the Seaweed Salad and the Watercress with garlic. The Udon with shrimp is wonderful. Haven't had anything we weren't very happy about. The sushi is delish--and the 5 -7 everyday Sushi Happy Hour is a great deal. Two rolls and a soup for $8. You can't beat it. We order take-out and and also eat in. Service can be slow sometimes, but we usually don't care. We're enjoying ourselves."], ["Lucy S.", "Mediocre for sure. The food is not terrible, but definitely not great. You can find way better Chinese in LR. We've never dined in, always take out, so I can't speak for the service, but the food is nothing memorable. We have tried it a couple of times, thinking maybe we just ordered the wrong thing, but nope, there is just a major lack of flavor. Even the egg drop soup is bland. Plus it's a bit pricey for boring Chinese."], ["Sara B.", "Chi recently opened and is a really great addition to the little restaurant area with Maddie's Place, Buffalo Grill etc (I'm sure that area has a name, but I don't know it) It's sushi and Chinese. We got the pot stickers, (steamed and sautéed, perf!) the yellow tail roll and the volcano roll. Both were exactly what you would expect and delicious. I'm not going to lie, I'm a sushi snob (11 years in SoCal will do that to you) and was very happy. Their happy hour is a dollar off beer and house wine. I got the house pinot grigio and it was delicious and a huge serving. I think they should add some food to their happy hour deals, but I've noticed not a lot of places in LR have that, so it's a general statement to the city. It was kind of quiet. I can only assume it's because we went early, because this place is great! Hopefully it wasn't because they haven't been discovered yet."], ["Victoria D.", "I just moved in down the street and was excited about their specials. However, I stopped dining in after repeated horrible service and opted for TOGO orders. Today when I went to pick it up I ended up waiting 62 minutes for my order. 62 MINUTES. When I asked the manger about compensation he refused on account the the sushi chef was backed up with dine in orders. There were currently 3 tables in the entire restaurant. I decided to go ahead and wait since it was almost done but was continually disappointed. The miso soup I ordered did not have tofu or seaweed. They charged me $1.10 to add cream cheese to one roll and the cheese wasn't even in the roll. The cream cheese was sloppily applied to the top, like an after thought. After discovering this, I promptly called back. When I asked to speak to the manager, I was told he was \"on an errand.\" They better change their ways if they want to stay in business! I definitely will never return and will tell everyone else I know to save their time and money."], ["Farrah L.", "Food was good but manager charged $2.50 extra for steamed veggies instead of rice. I would not come back."], ["Brandon M.", "I enjoy this restaurant because they have a great selection and okay service. I live in the Riverdale area so this is the first place I call for Chinese takeout. I would definitely recommend this restaurant to anyone visiting the area. It's just as good as any Chinese restaurant in West Little Rock, the Heights or Midtown."], ["Ian C.", "Great new location. Had a great experience ordering for pickup. Lady was super nice and they're quick. Love the design of the interior. Have sushi too. Will be trying that next time."]], "Osaka Japanese Restaurant": [], "Wasabi": [], "Igibon Japanese Restaurant": [], "Kanpai Japanese Steakhouse and Sushi Bar": [], "Sekisui Restaurant": [], "A.W. Lin's Asian Cuisine": [], "Mt Fuji Japanese Restaurant": [], "Kirin Garden": [], "Kobe Japanese Steakhouse": [], "Sushi Cafe West": [], "Samurai Japanese Steakhouse": [], "Tokyo House": [["Dale W.", "Good fresh food. Great variety buffet. Was seated in a backroom so I felt a little isolated (eating alone) but it was not very crowded so that may have been just a timing issue. Attentive wait staff. It was a little pricey $18 for a weekday dinner. Overall a good place. Will go back when I am in the area again in 2 weeks."], ["Emilee R.", "When you think buffet food you think greasy gross and sub par. That is not the case at this Buffet. Hot Food: The hot food was very very good! The favorite of our group was the salt and pepper shrimp. Sushi/Seafood: They had raw oysters, crab legs, cocktail shrimp and a variety of seafood salads. The sushi was so so good. They had sashimi, fish roe, and over 20 kinds of rolls. Our favorites were the strawberry banana, white tuna,rainbow rolls, and pink lady.  We finished our meal with green tea ice cream.This was our first time here and it was very very good. We will be back. Probably sooner than latter. :)"], ["Brooke A.", "It was alright, but I wouldn't recommend it to anyone. I hear that it's quite different when they are busy for lunch."], ["Aaron H.", "I have been to many oriental buffets, and this Japanese version really blows the rest away. The thing that I really enjoyed about Tokyo House was that even though it is a buffet, the food is prepared to make you feel other wise. Most places just dump food on to feed their customers. Not this place, as each platter of food is presented as though they are bringing it to your table.The food is delicious, the only real problem is where to start. They offer two areas of food, a cold section that is sushi, sashimi and side items like salads and cold seafood dishes that incorporates everything from jellyfish, octopus and seaweed salad. The sushi bar is great because all of the sushi is prepared by a variety of chefs. Most buffets I don't dare touch the sushi because there is no telling how long its been sitting there. Not the case with this establishment.The hot food section features many varieties of seafood, beef/pork, dumpling and chicken dishes. The wait staff is VERY attentive. If you are there on a slow night like we were, it feels as though they are watching you eat, a little creepy but the food is so good it distracted me from noticing them too much. We will definitely be back."], ["Apurva N.", "This is a much-delayed review. My colleagues and I have been to Tokyo House maybe a couple of dozen times and I just realized I have not written a review! Oh the horror!Anyway, Tokyo House is the ultimate value for money experience. Not just in Little Rock, maybe anywhere! The sushi is good and tastes fresh. Same with all the other items they have laid out in their buffet.We frequent this place because of the fresh food and because we can be in and out in 20 minutes!If you're in Little Rock and are looking for decent sushi at a decent price, look no further!"], ["Pauline L.", "If you're going to pay for sushi in Little Rock, you might as well get a buffet along with it. For $16.95/person, I'd definitely say it was worth it. For that much, you'd get a lot less sushi and no buffet at any other place. SUSHI: I'm always skeptical about sushi from a buffet, but I do have to say that this is relatively good. I'm from San Diego, and sushi is a staple out there, so for me to say that, it's kind of a big deal (haha, Ron Burgundy!). Stay away from the ones with cream cheese in it though, they tend to overdo it, and that's all you taste. BF says Volcano roll from the hot bar was the best, and I preferred the Crunchy roll. SERVICE: Mary, our server was like a ninja--I'd turn around and she was gone and back with my hot tea refilled! They were really quick to clear plates too, faster than any other buffet I've been to. THE GOOD: Of all things I had to say stood out, the tempura shrimp dipped in that really delicious ponzu sauce (nice crisp & flavor), the Udon was al dente-ly delicious, the shrimp cocktail was very fresh, and the seafood and/or azuki salad were good. Green tea ice cream was bomb.com. BF liked the duck dish and egg drop soup. THE BAD: The crab (small) was not fresh, and too much effort to be worth eating. The coconut shrimp and salt and pepper shrimp were chewy, not crispy (those are usually my favorite dishes at buffets). Cream cheese-y sushi. Grilled steak was chewy, too. Honeydew and cantaloupe were not ripe, and desserts/cakes/pastries were very artificial-tasting and not right texture. THE UGLY: Take a note, you can't wear tank tops there. There's a sign out in front of the door. Both the BF & I wore tanks today, as it was hot and humid here in LR; the owner mentioned it to us as we were leaving. We're used to very casual SD :/"], ["Heather N.", "I typically steer clear of buffets. I pretty much hate them. The food is mediocre, and I always question whether or not the place is sanitary. I like Indian lunch buffets. And surprisingly (when sanitation and quality of the food is MOST important), I like sushi buffets. Back home in Charlotte there is a sushi buffet I've been to for lunch a few times, Ru Sans. The food is very good. Especially for the ridiculously cheap price. The problem: eating there is one of the most stress full dining experiences of your entire life. They open at 11:00am, and people start lining up about 10:30. Once you're inside, all of the sushi is in one (very small) area, and you're basically herded like cattle through the line. It's so busy that you really can't even enjoy your meal. Dinner at Tokyo House is nothing like that. We arrived at about 6:30 on a Saturday night and were promptly seated. The dining area is spacious & modern, and in the middle of the room is the four sided cold food bar. One side is an assortment of sushi (all labeled, neatly arranged & accessible), next is sashimi, then you have shrimp, soba noodles & a variety of sauces, and last you have salads. I'm not big on sashimi, and shrimp you have to peel is just too much work, so I stuck to the sushi & salads. The sushi is not the same caliber you'll find at Sushi Cafe or Sky, but it's good. One roll (I think it was called the \"Special\" roll) was full of mostly ice berg lettuce: stay away from that one. But I tried nearly every roll offered (except for the Philly roll; not a fan of cream cheese) and that was the only one I didn't go back for. Unfortunately with sushi buffets, I never remember what I'm eating, but they had almost 20 rolls out, I tried a piece from nearly every one, and was more than happy with my meal. All of the rolls stayed together, were not drenched in sauce & had good flavor. The seaweed salad was absolutely perfect and the kimchi was quite good as well. I've never had kimchi before, so I had nothing to compare it to, but I'd have it again. Downstairs they have a generous selection of hot food. I think between the two of us, we sampled everything. And I was really, really happy with everything. I had a piece of salmon, a beef roll (a thinly sliced piece of beef rolled around bell peppers & onions), udon noodles, gyoza, volcano rolls, snow peas, a spring roll & some shrimp. The shrimp were mediocre, but everything else was amazing. I could have eaten the snow peas, noodles & gyoza all day. And I LOVE that all the things that typically are served with sauce had the sauce on the side, and little containers for you to ladle it in. Brilliant. I needed more sushi, so I went back to the sushi bar one more time. They had switched out somethings and had a few different rolls up there. So I did more sampling and revisited my favorites. Oh dear Jesus, there are no words as to how much I love a simple, perfect rainbow roll. Love it. I also am a complete sucker for the Japanese cheesecake that all buffets have. I need to learn to make that...Anyways, if you're in the mood for sushi and don't feel like waiting two years for a table at Sushi Cafe, give Tokyo House a try. The food is really good, and $20 per person for an all you can eat sushi buffet? That is one heck of a deal!"], ["Tara S.", "This place is awesome!!  I can't believe I'm trying it for the first time.I have read all the other reviews and guess what??  If they wrote something good about this place, they are telling the truth!!Make sure you get the green tea ice cream at the end?!"], ["Julie N.", "I never eat at buffets so I was pleasantly surprised by the quality here. Most of the hot dishes were not to my liking (too sweet, but this is a common complaint of mine for Asian food in Little Rock) but the sushi, sashimi, and nigiri were still good (especially for a landlocked state!)."], ["Sheena V.", "You'd think that buffets eventually lose their spark and become \"Americanized\" with their entry of mozzarella sticks and chicken strips, but Tokyo House stays on point. Their sushi bar always has a great selection to choose from and their food is fantastic. I love their tempura, miso soup, volcano rolls, sushi (of course), salted shrimp, and noodles. If I could spare 20 bucks for weekends, I would go and eat so much of their sashimi!"], ["Ramakrishna T.", "Good sushi. Nice ambience. Well presented food. Good customer service. Above all Very decent pricing.Will definitely come back many more times."], ["Jason K.", "Best buffet I've had in little rock. Sushi was good and the selection was different than a typical buffet."], ["Zsuzsa G.", "Don't go there after 8:30, the owner greets you with a \"you must be done in 45 minutes!\" Even though it is supposed to be open until 10. Then the waitress speaks no English, leans over you to mark your order on the menu itself. Despite a dress code posted on the door they serve the beer in bottles, i had to ask for a glass four times. The food itself is OK though my tempura was fried only, not breaded: they must have run out of breadcrumbs. Then they started sweeping the floor: perhaps to insert a sense of crunchiness into my tempura..."], ["Danielle K.", "This buffet is making me wish I could move to Arkansas! I mean, my high point of food was the bellagio in vegas...but we can't always afford vegas...this place has EVERYTHING! The beautifully etched glass cherry blossom doors open to fresh sushi (salmon, tuna, eel) and rolls, oysters and peel-n-eat shrimp, plus salad. Behind that are rows of soups, fruit, dessert, teriyaki meats, udon, spare ribs, duck, calamari...believe me when I say I tried pretty much everything, esp the frog legs! I topped my 3 plates off with my fave flavor of ice cream-green tea. $16.50/person for dinner would have me coming at least once a week if I lived here."], ["Joshua J.", "It's been a couple of years since I've last been, but went there with the girlfriend recently and it didn't disappoint.  I've probably been about 5-6 total times, but only for the weekday lunch buffet for about 12-13$, which sounds a little pricey for a lunch, but its a crazy good deal if you like sushi.  I know how you could easily be skeptical of a sushi buffet, but the quality and freshness of the sushi is brilliance.  If you love good, simple sushi like myself stick with the basics, the spicy tuna, rainbow, and nigiri tuna/salmon/red snapper pieces.  I don't like cooked rolls, or cream cheese in my sushi so I avoid those, but there are there for anyone who does.  I am not a big eater, but even I can seemingly consume 20+ dollars worth of sushi based on area prices on standard rolls and nigiri.  Then there is miso and egg drop soup, and even a hot buffet option with I rarely get anything from, but it looks allright, and this last time I got a spring roll that was decent to go along with a bowl of egg drop which was tasty.  Bottom line is go here, and the prices for dinner are more like 18$, and lunch prices vary with weekday versus weekends, so be prepared.  They also have boiled shrimp with the sushi, and its pretty good, and possibly on nights/weekends they have boiled crab legs.  But the sushi is the star, its made right in front of you like a standard sushi restaurant, but here its one price, and all you can eat.  Now, is it the best sushi I've ever eaten? No, but it delivers solid standards for a cut rate price, so the skeptic of me has been changed by Tokyo House, and its been going strong for a few years now, so way to keep up the good work."], ["Jeston M.", "If you are a sushi snob, you probably will not like because it is too cheap. This is probably the best buffet I have ever been to. $16 a person and simply wow. I probably ate $80 worth of sushi."], ["Mike T.", "Shushi!....you had me at buffet!  I never ate that much quality sushi for dinner- under $20! Waiter very friendly and accommodating Sushi side and warm side both awesomeFree green tea ice cream at end nice touchConsidering moving in and living here...cannot wait to come back"], ["Anna B.", "Definitely not your typical buffet place. Food was amazing, and hot. Didn't try the sushi, but my partner and best friend couldn't get enough of it!Ice cream was amazing too. Nice creamy texture.My only real complaint is I wish they had a wider variety of food, but I can look past it. What they had was delicious!"], ["Tao Tao W.", "For LR, this is a pretty bomb sushi and i make sure to hit it up each time i frequent the home to visit the parentals. Went here last night with the fam and fiance. Same as usual - plenty of rolls, sashimi, cold bar stuff, and hot bar stuff. My fav on the hot bar is the sea bass which you have to seriously stalk the staff to see when it comes out. I happen to be there right when they were taking it out and got the first hit on it. I went back to my table and asked if my parents wanted some and literally in the 2 minutes, i was gone, half the sea bass was gone. Best of all, if you all politely, they will give you sashimi that they use for the nigiri rolls or custom make you something. Oh and they have ice cream at the end - green tea, red bean, and 4 other flavors on top of the already large dessert bar in the back."], ["Jeff E.", "Not from Little Rock so relied on Yelp reviews for this gem. Didn't disappoint. I was a little concerned knowing it was a buffet and sushi restaurant. The two together seldom work but they still have retained the class and freshness expected for great sushi. The sushi chefs were preparing the sushi just behind the buffet so everything seemed fresh. My only recommendation is to improve the ginger salad dressing. Its way too thick and tastes a little like flavored mayonnaise. Not the typical ginger dressing that's usually light and creamy. Overall I look forward to coming back when in town."]], "Sky Modern Japanese": [], "Kemuri": []}