{"Lilly's Dim Sum Then Some": [], "Sullivan's Diner": [], "Chang Thai & Asia Cuisine": [["Rick G.", "Maybe ordering from the menu would be better. I had the buffet. It was very small, very few choices, and nothing much that was really appealing. The steamed dumplings were the best thing on it. At $9 for the dinner buffet, I didn't feel that I'd gotten my money's worth."], ["Laine M.", "I've been to Chang's several times, both eat in and take out. I am in love with their green curry with tofu. Sooooo good! I've also tried several other items from the menu. The basil rolls are good (you can get them with tofu instead of shrimp if you don't eat meat), the pad thai is good (a little on the sweet side, but you can order it as spicy as you like to amp it up), and I've even dabbled in their buffet. I must say I prefer the menu over the buffet, but it's good if you aren't sure what you want-they have a good variety of items to try."], ["John S.", "This place was awesome. I was missing Thai food like crazy until now. Great tofu too."], ["Duke B.", "Talk to the owner. She is super friendly, and will prepare things that are not on the menu. Mieng Come is a must try; I heard from a Thai person that it is \"old people food.\"  Unfortunately, like most central Arkansas restaurants, there is the ubiquitous buffet... Gotta feed the fatties...  But if you order Thai off the menu, it is superb."], ["GC Y.", "Mediocre at best. Food was OK. Buffet was not maintained."]], "Oishi Hibachi + Thai Cuisine": [], "kBird": [["Toby T.", "TL;DR review: Really good pat thai from an unlikely underdog restaurant.This is my last day in the neighborhood so I decided I was going to try kBird. I arrived, walked up to the counter, and was greeted warmly by both the cashier and the cook. I'm assuming that's what they were... They could either or both be owners. Anyway, I'll call them by how they functioned. Place is REALLY à la bonne franquette. You might describe it as militantly anti-professional in appearance. All signs made by hand or white-boarded, etc. She took my card, had me sign with my finger, and she asked me to help myself to some water while I wait. I took a seat at the \"bar\" and watched the gentleman cook. It was something to see, too. I'm sure the owners will forgive me for saying so if they read these reviews; I lost a bit of faith watching him work. He seemed to slowly, carelessly just throw undefined measurements of ingredients into a wok. I thought to myself, \"Oh well, I've been wanting to try this place for a while, and it'll be worth having to write a bad review just to check it off of my list.\" He finished one order, emptied the wok, plated it, and called out \"pat thai especial, ready to go!\" I started to arise and saw that it was on a plate. Clearly not mine, as mine was to-go. He called me out, \"Toby, yours is next.\" And he started a new one. It seemed to take forever. By the time he called my name and said I'm ready to go, it had been 20 minutes. So if you're in a hurry, go somewhere else. The cashier handed me a small box that had goodies poking out the edges: a noodle here, green bean there, maybe the odd peanut. It was heavy. And hot. I jumped in my car and headed back to work where I can comfortably sit in the breakroom and watch horrible, tabloidesque court TV as I eat. Don't judge me; that and Jerry Springer are all we can pick up on our antenna. I opened the carton up and snapped a picture. It was more colorful than I'm used to. More peanutty than I'm used to. More vegetabley. Now, I'm a stalwart of a restaurant in Indian Hills owned, staffed, and created by the nicest Thai family you'd ever have the pleasure of meeting; so you'll have to understand and forgive my apprehension or lack of faith in kBird. The first taste was confusing. It's not what I'm used to. I started thinking back... is Pat Thai the same as Pad Thai? Is it a difference in translating an eastern language phonetically into western characters? Or are they completely different dishes? Is kBird just trying to be \"different?\" The peanuts are there as usual; the bean sprouts, but there are other aspects, and a presence of other types of spices. When I eat pad Thai, I usually drown it in Sriracha. So maybe that's it. See, I didn't have any Sriracha available. But no, that's not the ONLY difference for sure; because it looks like there are bits of mango in this. There are green beans. Cilantro. Delicious. I'm half through with the carton, but I can't stop shoveling it into my face. Each bite is a smidge mysterious, a bit exciting, and completely enjoyable. Not a lot of fire, but there was flavor to spare, enjoyable to the last bite. Would eat again, would try something different."], ["Jensyn H.", "Tasty! When my food was ready, I thought it was pretty small to be $10. However, I was wrong. It definitely lasted two meals, and it was delicious. Their hours are tough, but if you can hit them M-F at lunch or early dinner, you're in luck."], ["Julie N.", "This is one of my favorite restaurants in Little Rock, possibly my #1 - it definitely has the reliably tastiest food. I grew up eating at one of the oldest Thai restaurants in the country (near SeaTac airport - it opened decades ago to service workers of Thai Airways) and kBird gives them a run for their money.The menu is small and rotating, which is a style that I like: pick a few things and do them really, really well. There is always a rice/noodle option, a vegetarian option, chicken, pork, and shrimp. I recommend trying the green papaya salad. And if you like heat, request it extra spicy!The inside is barebones but welcoming, with quotes and sayings scrawled on the wall. There are games available to play as well as a dart board. It can be warm in the summer, so don't expect the over-air-conditioned chill of most restaurants.The food is prepared by one chef, so if you're doing takeout, I recommend calling ahead ~20-30 minutes, especially if it's during the dinner hour rush. Or you can play one of the aforementioned games while you wait! Closing time is listed as 6:30, which means they take orders until this time and you're welcome to linger over your meal as they finish cooking and close up shop. Be warned that, as a small operation with a small menu, the closer to 6:30 you order, the more likely they are to sell out of dishes on the menu.The dudes are super personable. You should chat with them, watch them cook, ask about Thailand, what to order, etc."], ["El T.", "Bohemian. Thai. Little Rock.It works very well together. Bright, fresh and full flavor are on the menu here. The owners are very friendly and make no bones about their hospitality. Anyone with a Parliament Chocolate City sticker over the stove is sure sign of greatness. The care and quality are evident upon viewing the plate. Tasting it proves it. I had the Chicken Pad Thai, most excellent! Parking is tricky."], ["Russell W.", "It was an ordinary day and I wanted some Thai food. I end up here and sit at the counter to order food to go. This place is located in a residential neighborhood with a slightly chaotic atmosphere. The Thai food was surprisingly good for an establishment staffed with entirely Caucasians . It is definitely a memorable experience, and still has a distinct food truck ambiance which may be a turn off for some for a restaurant outing. But when in Little Rock, beggars can't be choosers"], ["Paul P.", "The food here is great. That is worthy of five stars. The guys working were friendly, helpful and knowledgable. We got the salad roll salad, the red curry with tofu and the something style pork. Can't remember the name. Everything was great. The red curry had a lot of heat. The pork had blood cubes. I wasn't sure about that but went for it. It tasted like lemongrass. Not offensive and quite tasty. The location is somewhat hard to find. I don't remember seeing a sign. It smelled like wet dog inside which was off putting. It is very blah. Not an appealing interior. However, you should go for the food. It was awesome and we will be back."], ["Frank N.", "The Little Rock food scene is getting better and better each time I visit!This little cafe, in a residential neighborhood, in a little old house, is really quite amazing.  The menu is part static, and part dynamic based on fresh ingredients...    I must say, the recipes are very authentic and not necessarily adapted to the western palate.  ...... and that's what I'm here forWe had some Khao Soi Muu (Chiangmai style curried noodles with Pork)  and Tom Yam Goong (Spicy Shrimp Soup).  Both were fabulous!  I asked for extra spice and got it.  The owner seems to pour his heart into the preparation....   He's been to Thailand many times, and refers to his experience there in the same way that Howard Wolowitz reminds you that he went to the Space Station...   (often).....   I kid...   His food experience shines through and we all benefit from it...and when you're done eating, please cleanup after yourself."], ["Mark H.", "A day off from work meant I could actually sneak over to kBird for a nice, relaxing lunch. Why had I not been here before? Many of the reviews (listed here), mention two things: how great the food tastes, and how slow the meal process is at kBird. I found the first to be spot on and the second point to be not true, whatsoever.When I arrived (on the tail end of lunch) the restaurant was fairly busy, but it was \"easy in\" and easy to order for me. I started things off with a Salad Roll Salad with peanut sauce and the Green Curry Shrimp as my main entree. Borrowing a quote from Christopher Walken, \"WOWWY, WOW, WOW, WOW!!!\"  From the very first bite, this was an amazing meal and an amazing adventure! And, for the record, it did not take chef/owner Richard Glasgow any extraordinary amount of time to have my food freshly prepared for me. I would have patiently waited another 30-minutes for this meal!!!I was completely seduced and captivated by the sophisticated array of savory flavors. I did not want this meal to end.  So, after my lunch, I promptly requested two orders of Thai Style Fried Rice to take home for dinner, that evening.  My wife and I both agreed that this too, was an amazing meal!No frills, just great, great, delicious food -- period!vSalad Roll Sala(d w/peanut sauce and Green Curry Shrimp"], ["Kristen A.", "Tried to go here today at 1:45 for lunch.  They were completely OUT OF FOOD.  Didn't offer me a single choiceof food to order.  I would have eaten just about anything, bc I was at the hangry point.  So you might need to call before you go to make sure you will actually get to order. What a pain!"], ["Tracey R.", "For delicious and authentic Thai cuisine, kBird delivers every time. The green papaya salad with stick rice is a wonderful way to start. It has fresh lime juice, mint, garlic, fish sauce and the right amount chili to spice up your taste buds. Next, try the green curry. It has loads of vegetables and your choice of shrimp or tofu. The curry is just right and not over powering. I wrap it up with coconut sticky rice....a hint of sweetness to finalize a tasty Thai experience."], ["Amber L.", "I recently took a friend here for lunch at the new non-mobile location (aka an older house turned restaurant.) The location isn't much to look at - just a few tables and minimal decor - but the food was still tasty as ever! We both had pad thai, and said friend added on a mango sticky rice dessert. All was happily consumed."], ["Edward H.", "This is the most authentic Thai food I have had since I've been back from Thailand, and I've eaten at a lot of Thai restaurants throughout the United States. Everything here is delicious! You know you're in business when there's prik nam pla on the counter and you open up the lid of your Tom Yam Goong and there's a shrimp head staring back at you. For the people that don't like the food, be ready to be severely disappointed if you ever make it to Thailand. I had to rub my eyes to make sure I was still in Little Rock with this place. You could transplant kBird in the heart of Thailand and no one would bat an eye. Their tables and chairs are actually an upgrade from the plastic ones that line the restaurants and streets of Thai cities. The non-descript building, faint smell of fish sauce, white board menu, and Kroger takeout bags are icing on the cake. The chef, Richard? gives off an Anthony Bourdain vibe, and has been to Thailand (as well as other Southeast Asian countries) to learn his trade many more times than the Parts Unknown star himself. The food is made to order so call it in if you are in a hurry. If not, sit back, relax, and watch the chef do work, which is an experience in itself."], ["eric p.", "still on top of their game.  did i mention the papaya salad??? HOLY BALLS IT IS DELICIOUS!  get it as an appetizer to split with a friend."], ["Kat H.", "This place is the tits. I think it's probably the best thai food I have had in the USA. As long as you are not in a hurry you will have an amazing experience."], ["Andrea S.", "By far the best Thai food I've had since moving to Arkansas. Went there for lunch and had the Pad Thai and basil fried rice to split with my cousin. Both dishes were great. I was especially impressed at the short menu - it's always been my experience that places that keep their selections limited tend to do what they do ten times better. And here was no exception. Everything was fresh and wonderfully done. I'll definitely be going back!"], ["Jenna B.", "The food is really great! They are open weird hours tho. They said it because they are in a residential area and are working to get that fixed. So, that's a plus! They need to renovate the inside. Don't let the appearance cloud your judgement of the food because it's REALLY GOOD!!"], ["Tommy M.", "Hidden gem. A must for Little Rockers, as authentic and genuine as Thai gets in this area. The owners are great and down to earth. Menu is constantly changing, be sure to check out their FB page."], ["Allison W.", "This place is really cosy and small. Don't judge a book by its cover. The food is good. It is no the typical Thai food. It really is a food adventure. The only reason it get 4 stars is because there are not that many options on the menu. A great place to try!"], ["S J.", "Probably one of the best dinners I have had here in Little Rock.  Consistently awesome, great portions and affordable prices, very friendly and takes phone orders also posts his menu daily on FB.  Lots of pride for the food he cooks which is probably why it's so good! Will definitely get dinner from here often!"], ["John S.", "Great Food, cool dude. Food takes forever so allow some time or call ahead."]], "Zangna Thai Cuisine": [], "Bangkok Thai Cuisine": [], "Thai Taste Restaurant": []}