{"Szechuan Chinese Restaurant": [["Kolme R.", "Gahhhh this place is AWESOME and the owner is seriously nice. Also, and this is random, try their zombie drink. Somehow he made a shot of 151 taste like hypnotiq. Also!!! The hot and sour soup is THE BEST IN THE STATE"], ["Johnathan C.", "Please someone tell me where you are all eating.  Someone tell me where this restaurant is that has such good food.  I followed the directions and as of tonight have eaten here twice.  This cannot be the same place that everyone raves about.4 people, me, my dad, my sister and her boyfriend spent $70 on food that didn't deserve $20. Our meal started with fried dumplings that were fried only on one side and soggy on the reverse.  My beef curry was spicy (as I asked) but flavorless and drowning in the cheapest vegetable a kitchen can use, onions.  My dad's General Tso' chicken seemed to be \"sugar flavor\" and resembled spicy the way a steamed carrot does.  My sisters \"Sweet & Sour chicken\" was covered with a sweet and sour sauce that was made in the sweet tart factory and served in the food court of your local mall.  Actually, the food court in the mall would throw this food away.I always give a place two tries but if they want to charge me $15 for a meal that I can get at China Buffet for $5 then I'll pass.Is there an option for half a star?"], ["Lauren S.", "So I'm not big on american style chinese food, but when I get a craving for it, this is the place I come to. The portions here are smaller than most places and they are stingy with the rice-so if you want more than a cup, be sure to order extra. I usually get the tung ting whatever. Shrimp, beef or chicken is all good. Th egg drop soup is the best I have ever had. It's full of flavor and doesn't taste like it's loaded with corn starch. It reminds me of a soft boiled egg. The egg rolls are greasy and delicious. I have never actually eaten in the restaurant- I always get the food to go. It's really slim picking in Fort Worth on Chinese places, so I'm glad I found this one."], ["Lou K.", "Love the food here. I always get the spicy beef and broccoli. It's located in a little strip mall off camp bowie and is easy to miss. Won ton soup is delish especially with the egg rolls."], ["Luke S.", "Was looking for somewhere new to try for Chinese food and was driving down Camp Bowie when my wife and I saw this place. It was about 7:00pm and we decided to give it a try (horrible decision).We were sat at a table quickly and the service was what would be expected but the food was cold and tasted awful. The vegetables were like something poured out of an aluminum can and the rice was very dry and old. If your hungry and care about your tastebuds avoid this place."], ["Kate R.", "This place has become one of my favorites.  An ex-boyfriend introduced me to this place, and I'm so happy he did.  Now I take subsequent boyfriends there.  I love the food, and have always received good service.  I've been there dozens of times, so that's a pretty good track record.My favorite dish is the sesame beef; it has the perfect amount of spice and sweet.  I think it will be a favorite with meat-lovers, but veggie lovers should pick a different dish.  It's served over white curly stuff; not sure what it's called.  Somebody please reply and tell me what that white curly stuff is if you know."], ["A R.", "I like their fried rice and lo mein. Clean restaurant and quick service. The owner (I think he is) is very friendly but everyone else not so much. Open late which is nice."], ["Sharon W.", "Authentic Chinese food."], ["Anye F.", "This gets a 3.5 on the Americanized Chinese food scale, not to be confused with the authentic Chinese food scale.  I am rounding up for quick service and low prices.Although the sesame chicken wasn't what I was expecting (it tasted like sweet & sour chicken with sesame seeds on it), the chicken was fresh and the breading was crisp, so you know they had JUST poured the sauce on it. The lunch portion was much bigger than I could finish.  My wonton soup was decent.  The fried rice was fairly light, not too heavily soy-sauced.  A very good value for $6.75.My honey goes here for lunch a lot, he enjoys the Ting Ting chicken.  I plan to try something else next time, probably Mu Shu pork.  Since he works nearby I'd drive to meet him for lunch but it's not a place we'd drive out of the way for on a weekend."], ["Sanna N.", "I just moved here. I wasn't a fan of the food. I tried the chicken with peanuts. There weren't any veggies in the dish. I got the dinner portion. The rice included is only enough for one so make sure and get another. The egg drop soup was not bad but only enough for one. I will continue to look for a better Chinese restaurant in the area."], ["Christine C.", "Be super sweet on the phone. They threw in a box of sprouts for me on my take-out order.Also: The ginger shrimp is a delicious, spicy dish. A violent pink color, but delicious nonetheless. The sesame chicken was not up to my taste, however. I prefer mine to be in that dark goopy sauce. You know, like BP really did a number on it. Their sesame chicken is pink-ish and sweet. It reminded me of ketchup (which may be perfectly suitable for some tastes!)"], ["Christie P.", "Super cheap lunch specials served up hot and quickly. My only complaint was that the vegetables in my Moo Goo Gai Pan were only broccoli, carrots and bok choi. I would really have loved a few musrooms and some bamboo shoots, too."], ["Emm A.", "This is by far my favorite Chinese restaurant in FW. It's not authentic Chinese but as far as Americanized Chinese goes, it's darn good!Egg rolls are actually spring rolls as they're wrapped in rice paper, not egg roll wrappers.  They're very good though.  Shredded veggies weren't soggy or greasy.  I love their egg drop soup and order it every time.  Most of the dishes I've had were done with a lighter touch than I've experienced other places.  The sauces on many of their entrees aren't thick, salty syrups, glossy with the amount of corn starch in them.  My recommendations would be the tung ting pork, chicken with green onion and beef and broccoli.  Vegetables are firm and fresh, flavors are good and not drowned out with salty sauce.Customer service is always good.  One of the managers makes it a point to remember people's names and thanks them for their return business.  I usually do to go orders.  The bar area is cozy and I often like to sit and have a glass of wine while I wait for my food.  Good Chinese with good customer service.  I'm never disappointed."], ["Christina J.", "Eh.  Went to dinner with three friends - I did not pick this restaurant.  The menu has no descriptions and the waitress was new so she had to go to the kitchen and get a \"cheat sheet\" to tell us what was in the dishes.  We all shared the pu pu platter and the fried wontons and tempura green beans were so greasy.  We shared our entree dishes because we all got something different, but all the sauces tasted the same.  The duck was greasy (of course) and there was skin on it.  I had to switch out shrimp for scallops in my dish because I am allergic to shrimp and there was one (yes 1) scallop in the entire dish. The vegetables were all cooked to mush.  Honestly, I get better Chinese at the take-out place around the corner from my house at the fraction of the price."], ["Lisa L.", "Been a favorite for 30 years. Best Chinese in Fort Worth!!!"], ["Z S.", "this is the worst Szechuan place ever. I actually was offended when I tried their food. It is as close to Szechuan food as Olive Garden to Itelian. It is American Chinese, and I will never step into that place ever again.If you are looking for an American Chinese restaurant, you probably will like it. If you are looking for real food, stay away. Besides, it is totally overprised for very very bad food"], ["Adrianne P.", "food is always great, big portions, consistent. but they no longer offer delivery. this yelp ad is wrong."], ["Danny P.", "This is where I eat when the boss is buying lunch. Orange Chicken FTW"], ["Cari S.", "My favorite Chinese in Fort Worth.  Everything is good, service is quick and the to go pick up food is always quick and hot."], ["Sophie H.", "This was an exceptionally nice Asian restaurant. The decor was modern and really nice. It was a step far far above all other Chinese restaurants that I've been to recently. AND the service is really good. This place is a total anomaly. In a really good way. But then again, this place is Zagat rated, so wouldn't you already expect that?I was making fun of the fact that the wonton soup had one wonton in it and one of the guys I went with got defensive about it, saying that I shouldn't knock the soup cuz its awesome. I took a bite of the wonton and shut up after that. It was gooood.I ordered the Tung Ting Beef off the lunch menu. It was really good. Lots of veggies, lots of meat. But it was spicy. I was getting sweaty when I neared the bottom of the dish."]], "Pappa Chang Asia Bistro": [], "China Express": [["Melissa A.", "My new favorite Chinese food place! I ordered the vegetable lo mein, vegetable fried rice, and the tofu with veggies I am vegetarian so I can only review those 3 things but it was so delicious. The prices are unbeatable and what I love most is they don't use msg. The place is also clean and friendly staff. Taste is wonderful :-)"], ["Mr R.", "Sorry, this was just not good. Refried fried food. After a late work day, stop by to pick-up and go home.  Food look good and fresh but I should have known better since sitting under heat lamps. They makes my fried rice fresh or that's what I taught but as soon as got home it was oily rices.  And the food was hard I mean tough to chew. Yeah so for me a no go."], ["Jeff K.", "My wife and I went to Fort Worth to take care of baby business and came across this place for lunch. The food is good. It's not greasy or salty as some Chinese takeout places we've been to. The customer service is excellent and the main reason we gave them 5 stars. Customer service matters more than anything else and you'll get that and more here. Come by China Express if you're ever in Fort Worth. It's worth the stop."], ["Pancho A.", "Not a bad place you can tell its ran by a young couple. its located near the TCU area off west berry and they give you a discount for being a student and you get allot for what you pay. only problem is the temperature inside the place is always hot or humid and the food is either bleh with not much flavor and its greasy. so you either hate it or love it but you get allot for you're buck and its good. TRY IT"], ["TexasPossum T.", "This is a review for the take-out.The Possums do Chinese take-out about once a month, and this is where we go. As Chinese takeout joints go, China Express is solid, three-star, middle of the road. Tasty! No surprises here, just good ol' \"American\" Chinese take out.Generally hot and fresh. Fast service. Very reasonable prices. Hard-working, super nice owners.What gets them the extra star is the amazing amount of food they manage to load into those to-go clamshell boxes. We always manage to get 4 meals out of two orders. Be sure to add the extra order of eggrolls and bbq chicken ."], ["Abigayle B.", "Was gonna give 2 stars because that's about the quality but I appreciate them accommodating me when I ordered off menu. It's kind of like a Panda Express set up with about the same quality food, although I guess a little more authentic."], ["Francesca W.", "Love this little slightly sticky feeling place. Fast, and cheap. The buffet is okay, but if you order off the menu the food it hot, fresh and fast and much better. The HUGE Togo box full of fried rice for $5.50 is great! A meal for two!"]], "Bowl Express": [], "Szechuan Restaurant City View": [], "Pei Wei": [], "China Jade": [["Marlene F.", "Since moving from Hawaii I craved Chinese food.  Hawaii is littered with true Chinese restaurants and they all taste great no matter which place you choose.I found this restaurant on Yelp and thought it would be a good place to try since the reviews were good.  Sadly to say, I've had better.We ordered roast duck, stir-fried won tons, crab rangoon and beef with vegetables.  The roast duck was a huge disappointment!  It was more like shredded duck.  Back home we would get half a duck  and they gave you different pieces as well.  The crab rangoon was ok, so was the stir-fried won tons.  The best dish of the night was the beef with vegetables.  The prices are decent."], ["Mary W.", "We had a large group getting together on a Saturday evening so we called ahead to make sure there was a table to accommodate us. The man on the phone was very pleasant and assured me he'd have it ready (which he did).The atmosphere was nice, although they had just painted and the paint fumes were a little noxious. The service was decent, the food was mediocre, the prices were good for the portion size. We asked for chopsticks but the restaurant was out of them (sad!). All in all it's okay. The atmosphere is better than the food...as for us, we probably won't be back."], ["Rebecca B.", "Awesome Egg Foo Yung & Pu Pu Platter. Always delicious & fast. Super friendly staff. Glad it's only a mile from home."], ["Carla L.", "Went for lunch today. Had not been there in a very long time. (since they moved off of Trail Lake)  The lunch we had was very good and a reasonable price. Ohhh, the soup!"], ["Lufty J.", "This is our Chinese take-out spot.  The boiled wantons are addictive to a point of scary.  The portions are always enough for leftovers and the price is reasonable.  Also, the staff is always very nice.  If you're craving Chinese on Hulen, the Jade is worth it."], ["Ken K.", "Food was very good, ample portions, beef egg-rolls were huge and the hot and sour soup was powerful. I'll definitely be coming back!"], ["CJ H.", "Good delivery chinese food.  Nothing special, but it's fast, hot and tasty."], ["Nicole C.", "I'm glad I found a good Chinese place close to my mom's that is yummy and cheap! The lunch specials are worth the money, about $6 you get a egg roll, biscuit, soup, the meal, crunchies and fortune cookie. Nice little place!"], ["Shirley F.", "We feasted here one night! For about $30, we stuffed ourselves with such incredible food!OK, so the dinners themselves may have not been that incredible, but we really didn't need them after the FANTASTIC pupu platter! Definitely get yourself one of those, along with some oolong tea to help you down more. Mmmmmm....Plus, extremely cheerful service. We were the only ones there so the waiter and the hostess were totally focused on us and their enthusiasm more than compensated for their poor English. Lovely experience. Great place to go on a date."]], "Cannon Chinese Kitchen": [["Amanda S.", "I waited a few days prior to writing this lunch review of Tiger shrimp in XO sauce.  Reflecting on the meal, I would rename this dish to \"Napa Cabbage in Shrimpy Soy Sauce Broth\".Traditional XO sauce primarily contains dried scallop, Chinese ham, dried shrimp, chillis and garlic in oil. There was no visible sign of the 1st three ingredients.  There was a few chilli flakes and garlic. -2starsTypically, this is a stir fry dish so that each shrimp is encapsulated by the fragrant XO sauce. (Google image xo sauce shrimp and you'll see what I'm trying to say)Deviation from tradition is OK if it doesn't taste like a wet sock. There is way too much Napa cabbage vs 6 tiny (U25) shrimp ratio.-1star. Replacing Napa (releases more liquids when cooking) with stir fried celery, carrots and onions in bite size pieces in real XO sauce or Sacha sauce would be a better complement to the shrimp. XO sauce shrimp is premium dish, so U15 shrimp or larger would be better for a nice bite. -1star. If all these improvements were made, charge more. $12-$15 would be ok if this dish was memorable in a good way. When there are less than 10 main dishes on the menu, I was expecting this to be top notch. Sadly, it still has a lot of room for improvement. :("], ["Van W.", "The food here is imaginative, hearty, and fresh. Great atmosphere for a date night, but it is just as fun to belly up to the bar with some friends to share some  lively cuisine and conversation. Tracy, the bartender, is welcoming and intuitive. All of the drinks on the menu are superb, but Tracy excels at creating concoctions that fit your current mood. This chick can sling some drinks."], ["Scott N.", "Really good food, unusual share-able dinner menu. More standard menu at lunch. Fort Worth is short on good Chinese. I've eaten here three times since it opened. Not sure it will suit my wants every time I want Chinese. Most of the time, I'm in the mood for large-platter traditional family-style dishes."], ["Carrie S.", "This place was absolutely awesome. The vibe, decor, food, service and drinks were all perfect. We had the duck stir fry, fried rice, and spring rolls. Loved all of it. I would highly recommend this to anyone! I can't wait to come here to have drinks with friends."], ["John W.", "We went during their soft opening Excellent traditional Chinese but with flare  and the service was very good ask for Tracy she took good care of us and her recommendations were spot on not to mention she is a ringer for Nicole Curtis of rehab addict. But Casey has a hit go check it out"], ["Stone B.", "The decor was terrific, the service was excellent especially considering they were packed, and the green tea gimlets were EXCEPTIONALLY good.  My only complaint was that while the food had good flavor, overall it was a little under seasoned.  Which wouldn't have been a problem except there were no salt shakers on the tables.  I expect they'll get the seasoning adjusted shortly, so I'm looking forward to going back.  Otherwise I would have given them 5 stars because except for the salt, everything else was spot-on."], ["Ryan S.", "Finally got to visit Cannon. Very good experience. Service and food were both awesome. The dumplings were the best I've ever tasted anywhere. Our waiter had very good suggestions and I'm glad we listened. I can't wait to go back and try other items!"], ["Bonnie B.", "I am a big fan of the owners' other venture, Shinjuku Station, so I was excited to try Cannon Chinese. The renovated house is beautifully decorated, the perfect atmosphere for a fancy date night. The staff is very attentive and kind.  The cocktails and wines, while a shorter list, were very good and thoughtfully chosen.   I was disappointed that there were not more vegetarian and vegan options, since we can normally count on Asian restaurants to offer something we can eat.  The few veggie things they did have tasted very similar (excessively salty).  In the end, we thought, \"we just paid $75 for rice and over-salted bok choy in various iterations.\"  I did appreciate the server's candor about ingredients.  She steered us away from some dishes, like scallion pancakes, that appeared to be vegetarian from the description but were actually fried in lard.  It was during their soft open, and they did solicit feedback, so if I hear they've added some vegetarian options, I'll be sure to give them a second try."], ["Clarence L.", "First time - great decor and vibe. Welcoming bar area, friendly staff. We had sausage & leeks fried rice, sreamed pork dumplings, roasted duck & veggies and chinese style pork ribs. Plenty to share, enough to fill you up!"], ["Sarah L.", "We ate here during the soft opening (late April), and it was one of the best meals we've had all year. My husband and I ordered four dishes to share, since this is a \"small plates\" restaurant: sweet & sour ribs, duck stir-fry, sausage & leek fried rice, and dumplings. The ribs were very meaty, and unlike the overly sweet dishes at regular Chinese food places, you could actually taste both flavors. The stir-fry was similarly delectable. They serve natural pork products, and everything was flavorful. Portions were appropriate for tapas, and everything was served hot. Highly recommended!"]], "Le's Wok": [["Barry K.", "Ok, so it's no frills! They have the best (and largest to go size) Beef Chow Fun, but it's not on the menu, you'll have to request it like this:\"Give me the flat noodles, scorched, \"burnt\" (but they don't really burn them, it's just the style of Beef Chow Fun) wth beef and scallions! There's a nice little Asian lady that owns the place and has been there every time I've gone and she takes my order. She \"knows\" my order so you could end your order request by saying \"like the black guy that comes in and orders it all the time.\"She'll know !!!!One to go order is enough for two people or leftovers.Great egg rolls too. Enjoy!!! And if the lady is there tell her hello!!"], ["Jim P.", "Been getting food here for over a year. Good food, everything is tasty and prepared well. The crab Rangoon and the spring rolls are my favorite appetizers.  I have tried several of the dishes and they are very good.A great place to pick up.  Always fast and easy to get on the way home."], ["Jon P.", "I ordered the vermicelli with pork along with the shrimp springrolls. The shrimp springrolls had that fake crab meat in it along with a couple of shrimp. I hate that fake crab meat! The peanut sauce was marginal.The pork in the vermicelli tasted old and mealy. After tasting the spring rolls and pork vermicelli, I could not eat them, nor ask for something else. Every time someone came into the attached convenience store, the restaurant would just about come to a halt as the worker was doing double duty. I will NEVER come back. Everything was just shit."], ["Brett I.", "i do like the fried rice, it's pretty big and tasty! I ordered it the other day with pork and it came out hot and fresh rather quickly, within 5-10 minutes. As far as I could tell, I don't think it had MSG... It tasted flavorful and pretty much everything fried rice should be. As mentioned before, it was pretty big~ it actually made for two meals...I don't particularly care for their banh mi though... i came one night a half hour before they closed. i didn't want to order anything too big out of consideration for the staff, so I ordered a pork banh mi, thinking that because it didn't take too much dishes or time to put it together.  However, what they gave me was pretty bad~ the meat was really bland as though it hadn't been marinated long enough and so it pretty much ruined the whole sandwich.That said, the place is a friendly and family-run place me thinks. The place has the ambience of a gas station mini-mart~ since it's connected to a mini-mart (sans the gas station), but that's fine. And again, I liked their fried rice; perhaps just stay away from their sandwiches..."], ["Jim R.", "Why you first drive up the curb appeal is not very good, but don't let that stop you from coming in. My son and I eat lunch here and we're not disappointed at all. He had chicken pai tai and I had chicken broccoli. They were both very good. Egg rolls were ok. Service is quick and friendly."], ["Lauren S.", "Since a few of the local yelp elites rated this place so highly, we had to check this place out. It's not very visible from the street. The location is split- half dine in/ to go and half convenience store. Every time we have been we just dine in. They have tables as well as booths. One of the owners is running front of house. She is so friendly- she chatted us up a bit when bringing out our food and when we were leaving. We have shared a few apps, banh mi and various dishes. The banh mi is a favorite. I also like the beef flat noodles. The portions are huge. We always have leftovers. The cafe su da is delicious and they don't put too much condensed milk in it. I like that this is a tiny family run operation. We will be back."], ["Krista R.", "If I'm not cooking, my afternoon pretty much starts with asking my Grandma \"what do you want to do for dinner?\"She's pretty much answers like my husband \"I don't know whatever you want!\"Well, I don't know because husband and I are going out to eat when he gets off. I just need to get you and the kids fed. She mentions Cantonese or Polynesian. Sorry, this isn't Miami. Remembering Le's Wok, I suggested Chinese. There isn't many Star worthy americanized chinese places on my end of Fort Worth. She turned her nose up until I told her it wasn't a place she ate before. It's located in a convenient store. How bad can it be? Grandma says \"Hopefully no worse than China Jade\"Ugh.. China Jade.Traveling up and down Rosedale, I've always looked at Le's side eyed. Keep going. Keep going. Don't look. We aren't going to eat there. Arriving at Le's, I realized this is the same convenient store I got a pregnancy test from many years ago when it popped positive. I thought, \"Maybe I shouldn't eat here.\"What would be worse than China Jade at the moment? A positive pregnancy test.. ..KIDDING...kind of.We ordered: Combo fried rice, hot and sour soup, egg drop soup, crab ragoon, garlic butter wings, and cashew chicken.The combo fried rice was enough to feed my whole family. Contained beef, chicken, and shrimp. It was pretty good.The egg drop soup needed doctoring. It was ok. My Grandma liked the hot and sour soup.The garlic butter wings. What was I thinking? I was thinking of Beef O Brady's garlic butter wings. These didn't have flavor, but tasted a lot better in the red sauce that came with the crab ragoon.The cashew chicken? Ugh, should leave it to the Thai's. They do it better. The best thing I had was the crab ragoon's. They were delicious. On the plus side, I didn't feel awful or bloated afterwards.I'm leaning more towards 3 stars, but it's better than any chinese restaurant on my side of town and my Grandma liked it."], ["Ivy W.", "This place is average. The entrees range from your typical orange chicken and flat noodles to fried rice. The Vietnamese entrees include pho and banh mi. I tried their pho with meatballs and there was almost no flavor in their broth. My boyfriend had the flat noodles and orange chicken. The orange chicken barely looked like chicken and the noodles were okay. The ladies bagged our to go for us and routinely checked up on us. I don't have any complaints about their service or environment. It seems like it's family-owned. The restaurant is really simple and clean. The outside appearance seems small but it's connected to the convenient store on the left. I have a lot of respect for this restaurant and the owner but their food just hits a little below average for me. I wish I could say I would come back but there are definitely better Chinese and Vietnamese restaurants in Fort Worth."], ["Xin L.", "I decided to try a new Pho in town and...Bad decision. Friendly people,and all butthe chicken pho is atrocious.. Spring roll was better; sauce was pretty good."], ["John Y.", "I have become a regular here and so I'm updating my review from 4 to 5 stars. This isn't fine dining, but it is really good. Don't be put off by the convenient store. If that bothers you, just get it for take-out. The ladies that work here are incredibly nice."], ["Jojo M.", "Good food and fast n friendly service. Oh, and did I mention low prices? These three factors make for a legit establishment that deserves multiple visits and tries. I enjoyed the fresh ingredients of my beef vermicelli (6.95) and was even more pleased with my noodle to lettuce ratio of 2:1. Thank you for giving me beef vermicelli and not beef lettuce! They also give a lot of pickled carrots and radish, which I loooooove.After I ordered, my meal came in 5 minutes. Outstanding.My server was nice and the owner was even nicer. They're the kind of people that leave you hoping people treat them well for the rest of the day so they're niceness isn't spoiled. If you're afraid of the \"convenient store\" vibe, don't be. If anything, it's rather... Convenient. The only downside would be the parking, which can get a little tricky if everyone got hungry at once. Never the less, I implore the skeptics and the curious to try for themselves. I already like this place a lot. Can't wait to go back and try the other things that yelpers were crazy about."], ["Deirdre B.", "Read about this place in the paper and have been meaning to come out for a while now to support a local business. Finally tried it and it was a-mazing.The rangoons were crisp and creamy and the pho was pretty good. Apparently they are revamping the menu and adding new options, which is great. I stopped by again for take-out with my boyfriend and we splurged. Chicken lo-mein, teriyaki chicken and rice, eggrolls, rangoons, pork banh mi. All of it was SO good! I have definitely found my new go-to take-out place for lazy nights. Such a great neighborhood spot."], ["Jason M.", "This place is so great, affordable, and very tasty! I recommend the #69 and any of the flat noodles."], ["Andrew T.", "Oh Le's Wok....where would I be without you? Having recently moved to Fort Worth, I picked a location pretty void of any Asian food. If I got hot and bothered by menudo, I'd be happy as an oyster in a jewelry store. Alas, menudo doesn't tickle my eggplant like that.But Le...oh but Le...you are my saving grace. You give me an Asian restaurant that I can walk to. WALK TO. You will always converse with me when I eat there because you know me by my first name.Not only that, I am now looking for ideas on science projects for the son of the owners. Big mistake? Probably. But...well just big mistake probably.The pho is good. Good enough to not drive all the way to belknap. The chicken teriyaki is a pretty heftly portion, giving you a big piece of chicken breast. I really enjoy their spring rolls, as well.Thank you Baby Jesus for having Le's Wok in my immediate vicinity. Without you Le....I'd...well I'd eat a lot more tacos."], ["Jocelyn C.", "I realize I risk getting stoned by angry Yelpers that will ultimately be thankful that they will have one less person to fight for a parking spot, but I'm not digging it. Contrary to what another Yelper suggested, please don't come here for a first date unless you are in college. While the halogen glow of the convenience store refrigerators might create a luminous glow surrounding your date, there's too much going on here for something like that. The other side lends a very sterile atmosphere under harsh lighting, which doesn't sound particularly more magical than the other.This review is just for the pho. Their options are rather limited and devoid of crazy, delicious cow parts that Asians are notorious for ingesting:1. Beef 2. Meatball 3. Beef and meatball  ($1 more)4. Vegetarian5. ChickenI had the beef and meatball. Beef wasn't thinly sliced, so it was tough. Meatball slices were very salty. The broth itself is Americanized- not a full body pho broth that hints of aromatics and grody things like fish sauce. The whole thing was just too Americanized for me. Service- they are so nice and say hi to everyone and are very grateful for your business.Pho sure, I would still come back to try the hot food line that everyone raves about..."], ["Chad D.", "Came back here last week to give the restaurant another try. This time I didn't order from the menu and instead ordered from the entree bar. The concept is the same as Panda Express, choose your entree(s) and your side.I went with the beef and mushrooms with steamed rice. The flavor of the dish was pretty solid. The beef is tender and mushrooms were buttery.I decided to stop in today to order from the entree bar again. This time I did two entrees. The beef and mushrooms and crispy shrimp. The crispy shrimp was delicious. It tasted like salt and pepper shrimp. It wasn't battered but was still crunchy from the salt I guess?If you need a quick and tasty lunch skip the grilled pork and pick from the entree bar. Even though it's not made to order, it still tastes good and you get plenty.The owners and their staff are also really nice and helpful. I'm glad I gave it another shot."], ["Bruce V.", "Not a bad little eatery located inside a convenient store.  Opted for a quick luncheon and ordered the Vietnamese sandwich.  One sub alone filled me up.  Pricing for my lunch was low.  It came out to $6.00.Nowadays, if you roll into a McD's or Whataburger, you'll spend at least $10 just to get a \"Satisfying Filling\".  Stop here and enjoy a hole in the wall eatery.  If you're looking to impress a Hot date or VIP....reconsider.  Eatery is very small and the decor may not be too impressing (you'll be surrounded w/convenient store items beer, novelties etc...  On second thought, \"Do it!\"  You'll find out the true person you're with can be.  Hmmmm, a person who's open-minded or simply a person who's FaKeDunDee!"], ["Chris P.", "Updating to 5 stars because Le's Wok has absolutely become one of my favorite neighborhood places. The food is good, it's completely unassuming, the owners and staff are all great people, and there's really nothing not to like.It would easily qualify as a Diner, Drive-In and/or Dive, but I do publicly swear that I will throw a shoe at Guy Fieri and his hair if he ever shows up to ruin this place."], ["The D.", "Definitely worth a visit if your looking for pho. You can't find much better on this side of town. I've tried pho at alot of places in Fort worth, including the overpriced stuff at the local Thai restaurants. I'm originally from Haltom City so this isn't the best pho I've had. Stay away from the meatballs, not the usual. Instead try the tofu or the beef, all excellent. Spring rolls are massive and not as green as other spots, just how I like it. Egg rolls are very sweet and crumbley, a very difficult to find gem in most of these types of restaurants.Staff is fantastic! Definitely fight for that good vibe they so desperately need. Unfortunately I cannot reccomend you go to this with a girl your trying to impress. It's one thing to be on the side of a gas station but its another to have people come in off the street and ask for money while you eat just to grab a beer out of the freezer behind you...Go check it out"], ["Lan T.", "I've only been here once for pho. The portion size is huge and price is cheap. Pho broth is pretty good also. Overall, not the best pho ever but pretty good. The location seems slightly sketchy though."]], "Tom's Asian Bistro": [], "An Zen Sushi": [["Bianca M.", "We LOVE this place, been coming here for the past year, so glad we found this hidden GEM! The sushi and cooked food is amazing, and there has not been a plate I didn't like. We love Masimoto and his wife, they always make us feel like family and YT is awesome as well."], ["Mssroy H.", "My husband and I just had a date might and dined here for the first time. Loved it!!!! We will be frequent customers. Loved the food, staff was amazing."], ["Jessica L.", "I LOVE this place. I go at least once every few weeks. Great atmosphere, great service and even better sushi. My favorites is the squid salad to start and I really like the I-35 roll. They have great choices and the Sushi chefs always treat us good. Y.T Is awesome. If you don't want to spend tons then they have a great sushi buffet but I normally go for date night in the evenings. I have been to so many sushi places before but I just love the service and sushi here it beats every place I've tried near by. Don't miss out on this hidden gem!"], ["Em D.", "Came for the $12 sushi buffet lunch and was not disappointed. Decent selection, good quality sushi. Service was good. Small dessert bar was a nice addition. I will definitely be back."], ["Jen H.", "$12 lunch Sushi buffet.  What more could anyone ask for?  Friendly staff.  We visit this restraunt at least once a week for lunch.  Seems that the word has gotten out because it is much busier now than when we first found it a year ago."], ["David C.", "Only commenting on lunch sushi buffet. I will have to come back again some time to try their real rolls. $11 will get you in for a lunch sushi buffet. While the quality is expectedly lower than you would see from actual sushi restaurants, the quality is still decent. Options are somewhat limited and usually hit more of your Americanized rolls, but they are still pretty good. There is also some fried dumplings, fried rice, yakisoba, salad, and tempura on the side if you want a little variety. Decent place if you're craving some cheap sushi and a lot of it for lunch. Service was excellent. Very friendly staff and constantly refilled my water."], ["Jim B.", "Good food, very attentive staff.A small place and there are enough sushi-chefs to keep the buffet filled and fresh.  There is a very good cross of the rolls they offer on the menu.  All of the items on the buffet were fresh and tasty.There is a lot of crab on the menu -- seems that 70% of the rolls and stuff contain crab.  If you are not a fan, this isn't your menu.Happy hour has good drink prices, off H.H. they are expensive.  The \"Long Island\" iced-tea was weak and not worth the $12 price tag.3 tvs, all on the same channel.  At least it was baseball.Shall go back for another try."], ["Russ K.", "The best thing about this place is how friendly the staff are to thier guests. The fish has always been good, I have' been here several times, either 4 or 5 and I continue to enjoy it everytime.  The ahi tower is wonderful,  their special rolls are great nothing to spicy."], ["Lindsay M.", "Great sushi buffet with great customer service. Love going here for lunch and get a little of everything for a decent rate. Sushi is fresh and good portions."], ["Angel G.", "This place is great! The sashimi was cut a little thick for my liking but everything else was superb. I highly recommend the wasabi crusted roll or the rose garden roll. I'm normally not a fan of sake but the peach flavored one was delicious, next time I'll try the watermelon. I would recommend this place to anyone."], ["D S.", "Pretty good.  Reasonable prices.  Like the bento box for lunch.  The sushi buffet is decent."], ["Betty G.", "This place is awful. The service is terrible and the sushi is not good. I ordered the Anzen Fire that had a hot pepper on the menu, but it was not at all spicy and the waiter said it wasn't supposed to be. The drinks are half price after 3 but they do not appear to have alcohol in them. We were the only ones in the place and it took 30 minutes to get the first roll....don't waste your time."], ["Yxia O.", "Never heard of a Sushi Buffet. ... IT WAS delicious! They have so many options and all of them as Yummy as the First one.  The Mexican Roll YUMMY! The staff is Friendly and the music is soothing.  Definitely Our New Go To Sushi Place!"], ["Katie L.", "Came here for the lunch  buffet. I was intrigued by 16 rolls to choose from and 6 different entrees and different desserts with a 8.95 price tag. The sushi seemed to be nothing but crab and all had the same flavor.  I would not recommend it for the  lunch buffet. If you do find yourself here at lunch time, order off the menu instead. Service was great granted we were 2 out of 4 costumers in the place."], ["Phillip D.", "I am giving this a high review as a sushi buffet. There were a few side dishes to go with it. For $12 it is hard to go wrong on simple sushi all you can eat. We were there with 4 adults and 2 kids. The boys found enough food to make a meal. I could go back and try it again."], ["Aaron P.", "This place is blah. The sushi is just okay and the menu items are over priced for the portion size."], ["Michael P.", "Sushi Buffet was awesome. Fresh & Very Tasty. Wife gives salmon fillet a 10. People friendly and quick. Our waiter was new, and didn't speak English very well but he was quick to ask for help when needed, and fairly attentive. Will most definitely return."], ["Britt L.", "Closed / Out of businessRestaurant has been up-and-down. Under new management at least twice since opening.The sushi chefs were usually good, and the fish was fresh. The menu items from the kitchen were middle-of-the-road at best.The service was usually weak. And now it looked like the latest management revamp failed, as there are For Lease signs up in their window; lights out."], ["Jeff S.", "Stopped in for the first time. Had the lunch buffet. It was very good. Everything on the buffet tasted wonderful. I was having a late lunch but everything was still very fresh. The service was excellent in spite of any language barriers. The place was about 3/4 full of guests and everyone seemed well taken care of. An all around great experience. It looks like any previous problems have definitely been corrected. I will most assuredly be back."], ["Falon G.", "Last weekend, the Boyfriend and I ventured over to Western Center to find some decent grub before meeting friends for drinks. We saw An Zen Sushi Bar and Asian Bistro and figured we'd give it a shot. Boy am I glad we did! For a date night this was actually a lot of fun. They play hip music and everybody is very lively and friendly. Apparently it has been recently remodeled, and I must say they did a swanky job. Also, we got a lotta bang for our buck! 2 appetizers: spring rolls & crab rangoon4 beers: Bf had Shiner, I had Sapporo2 Sushi Rolls: Tornado and Rainbow rollMongolian Beef: Because bf really doesnt care for sushi. He loved it. We paid extra for fried rice to come with it, but he said it was delicious. Total: $50!!!We will be back, and bringing friends."]], "Tang's Pacific Bistro": [["LeAnna B.", "Instead of a 45 min delivery, it took 1 1/2 hr. The food was mushy and poorly made. This is the first and last time I will order there"], ["Vu N.", "The food was just okay. There wasn't really a  big wow factor in it. If you tried one meal you pretty much tried them all. The only really good stuff here is the bento boxes, the appetizers and the sushi!!"], ["J W.", "I don't know why this place has a strong 4 star rating. This tells me that the other Asian restaurants in the local area is terrible. Service was ok. We ordered one plate of steamed dumpings and one plate of pan fried dumplings. When the order was brought out, she went to a different table and dropped off the steamed dumplings at that table and brought the pan fried ones back to the kitchen. It sat there for another 5 minutes and then it was brought out to our table. It was cold. Then we waited another 10 minutes for the steamed dumplings. She said that the kitchen forgot to put the order in. And they weren't worth the wait since they were the frozen dumplings you can get at your local Asian grocer. I ordered the House special Beef. The flavor was good, but they overcooked the meat. It was very tough.I thought they would have some sushi, but only salmon sashimi and seared tuna sashimi and no other kind of fish tells me they are just half assing the sushi option."], ["Jesse W.", "First of all, I'd like to complain that while I was sitting at my table, Yelp said I was too far away to check in. I was in the middle of the restaurant! Rant over. This is my second time here. Today, I ordered the Miso soup and chicken Pad Thai. Miso soup was good, just like last time.  The Pad Thai was lacking, however. I love Pad Thai, and any chance I get, I order it...but I probably won't be ordering it again from this place. The chicken was cooked perfectly, nice and moist. Not dry at all (like some places). It looked like Pad Thai, for the most part. (Sauce was a little more brown than I'm used to). It looked good though...all the normal components (egg, peanuts, etc), but the sauce was nothing I was used to. It was a little sweet and tangy. It was reminiscent of Chinese food I've had before. Not spicy at all. I enjoyed it, but I had to tell myself I was just trying a new dish (it was hard to enjoy when my brain kept telling me \"this isn't pad thai\"). And it was good....just not what I expect when I get Pad Thai.My first experience here, everything was really good...so, I will be back. Just not when I want Pad Thai."], ["Marty T.", "Very disappointed. The hot and sour soup was so salty that it was inedible. Probably old. The waiter didn't even ask how it was even though our bowls remained full. Breaded dishes tasted frozen."], ["Kimberly Kimmy C.", "By far my Favorite Chinese Food Place to Eat!! I've tried tons of Dishes here and have never had 1 I didn't like yet!If you can add spice or remove it. Just need to tell the server and they take care of it. Not spicy enough- no problem ask for Jessica Sauce (Named after the creator- Jessica Tang)- this stuff will light your fire :)I love the lunch specials and the Happy Hour with a great atmosphere!! Super great place and also kid friendly! :) Oh and the portions are super share-able big if you wanna order 2 dishes for everyone at the table to share! :)Full Bar is awesome too! :)"], ["Kasey L.", "My favorite local Asian go-to spot and they deliver! I come here often and have never been disappointed. Try the cucumber and crab salad and the cashew chicken... The best!"], ["Carmen S.", "This is a great place we go there a few times a month.  The service is wonderful, and there is nothing that we've had that we did not like. The food, service, music and drinks all wonderful."], ["Gmo M.", "Pretty good food and a friendly staff and atmosphere. The owner (what I assume was the owner) is very nice and talks to all her customers. The sushi is really good and the Orange chicken. The bar looks really nice and packed. I would eat here again."], ["Curtis L.", "Awesome house special chicken!"], ["Ashwin M.", "The Chinese lunch buffet stereotype is blown away by Tang's place. As a vegetarian, I was impressed with the explicit choices I had here. I tried the vegetable egg young dish. It took a while to show up but man was it huge! Vegetables stuffed in an egg batter, it was like a Chinese fritata. I had the edmame to start off and the quantity was more than adequate. I would skip lunch before coming back here again!"], ["Danielle S.", "Probably the worst Sushi place I have ever been. The servers had no idea what Tamari sauce or gluten were. As a server one should be aware of common dietary restrictions and be aware of what ingredients are in what. I was super confused when it seemed like we had two servers and two people tried to drop off our check. The sushi roll itself was incredibly dry. I had been craving a seaweed salad, which they don't carry and settled for a \"cucumber salad.\" When they suggested the salad they didn't mention that is was about seven bites of cucmber covered by a half pound of crab. Not impressed at all. Will not be back."], ["Jarrod J.", "I've lived near here for over a year and we finally decided to try it out.We went on a Friday night and the place was busy and pretty loud.  For us with a few kids, this was perfect to cover up their boisterousness!I tried the House Special roll and it was good.  A little too spicy for the kids, but a little weak for me.  I'll try something else next time as I didn't really like it.  We got a bowl of the Hot and Sour soup which was awesome.  I had two cups myself and we finished off the entire bowl!For dinner I had the Kung Pao and told them to make it extra spicy.  It was really good and I think I pulled out around 1,000 peppers, but it wasn't all that spicy.  The spicy fried rice at Sea Siam was hotter.  That's not to say it wasn't very good.  The portions were huge and with all the appetizers I had, I couldn't finish it off and had it for lunch the next day.  It was still good!Service was fantastic and though the prices were a little much for the whole family, my wife and I will definitely come back to try more of their sushi!"], ["Ray P.", "It really is about the best Customer Service!This was by far one of the best customer experiences I have ever had.  Even if the food was horrible, I would most likely still come back:)  But that is why I gave it 5 stars, because the food is just as good as their customer service.I usually do not like a lot of the Americanized Asian dishes, yet this place does a good job of injecting those authentic flavors but still keeping the dishes palatable to American tastes.  Just in case you are wondering, yes I am American but I am married to a Taiwanese woman and I have been to several places in Asia so pretty much it is authentic or bust for me unless I am just really hungry.The manager started us off with some fresh shrimp tempura sushi rolls which was outstanding and will definitely have that again.  My wife and I shared their House homemade Ramen soup which is the best ramen I ever had!  We had to share it because the bowl is huge and there was no way we were going to finish one of those ourselves.  I will come back to Tang's just for this soup alone.  We also shared a plate of General Tsao's chicken which was really good but it still does not compare to the House Ramen.Again the customer service was top notch.  The waitress and the manager, Jeff always checked in on us to make sure we were satisfied with everything.  At the end of our meal, the waitress asked us if we needed help packing our leftovers in the to go containers, which was a really nice gesture.We will definitely be coming back to this place, probably sooner than later:)"], ["Keith S.", "Great atmosphere and even better food!!!  SAKE-BOMB!!  Thanks, Jeff!!"], ["Joshua M.", "I love this place! Everything from the vibe, to the food, to the owners, it is always so welcoming and enjoyable. Jessica the owner has to be one of the sweetest and genuine owners from a local business, she always welcomes you visits with you when she has time. The food is always consistently good, and made fresh. For me and my boyfriend it comes down to the simple things, when a restaurant can achieve that then the rest of the food will be delicious! For us it is the fried rice, it isn't full of bland veggies or over saturated with soy sauce, it is moist and seasoned just right- its like little pillows in your mouth! The chicken is always really moist and good as well; at most Asian food places the chicken is always really dry and overcooked- here it is always spot on.One thing that keeps me always going back is there lunch specials that they have 7 days a week! It turns me off at a restaurant when I can't get a decent meal all the time. Here at Tang's you are able to get a soup and salad and an entree! This to me is a good deal, where as most places only offer an egg-roll and rice. Another item that I love is that they have really good rewards, for every $50.00 you spend you get $5.00 off, 10% is pretty good in this day and age!One last thing that makes me happy is there happy hour is really good and last a while! Any good happy hour in Keller I am a fan of! Check it out for yourself!"], ["Tom P.", "Been to Tang's Pacific Bistro a few times now, and my visits have all been consistent.  I have been happy with all aspects of my visits.1.  Easy access parking2.  Attentive and friendly service.  You may question things, when you see the high school age servers, but they will impress you with their courteous and quick service.3.  Food has been consistent , but my favorite are the wings.  My daughter was happy with the sushi rolls she ordered, but I preferred to stay with the americanized chinese food.  4.  There is a full bar, and the beer is ice cold.I am at 3.5 stars for this place, but the service is so good, I rounded up."], ["Harold H.", "Pretty disappointed I didn't get my coupon \"free\" egg rolls. It was on the bill and I was told they were in the order, but no. Very disappointing!!I will not be back. Too many other choices out there....."], ["Dash W.", "I take it back. This place at first was not the best choice for noodles.... however I gave it another chance and found out that they make the best boiled crab EVER!!! No kidding... they can make some amazing crab! Like wayyy better than Joe's Crab Shack. Get the boiled crab pot, get the crab rangoon, .... these guys rock!!!!!!! Oh, and their sushi is good too. They are sooooo strange!!!! But soo cool."], ["Michelle T.", "I love, love , love this place.  By far the best Chinese food around that I have found.  The service is awesome.  I haven't had anything I don't like.  Keep in mind I don't eat sushi so I can't speak for that.  I can tell you portions are sharable."]], "Pan Asia": [["Emily B.", "I ordered a few different things tonight to try this new place out. Everything was pretty good. The service was a little slow, but everyone was really nice and accommodating."], ["Kristin W.", "I ordered delivery and it was great! Large portions and very tasty and flavorful. The food arrived fairly quickly. The menu they have offers a wide variety of Asian cuisine (hence the name) and *they offer coupons* on their website! I will definitely order from here again."], ["Greg H.", "First time trying Pan Asia in Fort Worth. I usually tell the waitstaff to \"surprise me\" where ever I go eat. The Thai Basil Chicken was a pleasant surprise. Fresh veggies, just the right amount of heat and full of flavor. The chicken was of good quality. Also enjoyed the Oolong tea, fried rice and egg roll. Casual atmosphere and friendly staff. We order take out at the office for lunch fairly often and this will certainly be in the regular rotation."]], "P.F. Chang's": [], "China Pagoda Restaurant": [], "Ming Wok": [], "T's Asian Kitchen": [], "New Skillman Wok": [], "Taste of Asia": []}