{"The Capital Grille": [["Monica R.", "What else can I say but I died and went to Heaven!Everything was great!There server, food- dinner and desert was outstanding, parking wasnt bad we valet parked which is only $5 bargin!"], ["Rohan S.", "So I only recently jumped on the beef train. Till now I didn't really understand what all the fuss about beef was. If someone told me I had to give it up again, I wouldn't be bothered at all. Then I had a steak here and that changed my opinion about the whole animal. The peppered NY Strip stake was unreal. I don't think I've had a steak that good ever. I've been ruined for steak. They also make a fantastic martini and the servers there are wonderful."], ["Tony A.", "The Capital Grille is raising the bar on what it is to be a top tier, service oriented, fine dining restaurant.Located in downtown Fort Worth, it is an easy drive from Arlington.Upon arrival we were personally greeted by the maitre d'.  This is an appreciated special touch that they take the time to review each reservation, know the customer, and remember what special occasion is being celebrated that evening.  Very nice.Our table was cleanly and simply set.  Our server, Ean, who was especially fantastic, and whom I would recommend to all my readers, that they exclusively ask to be seated with, greeted my wife and I, and recognized our special anniversary evening.  He presented us with a nice card, signed by the staff, and proceeded to decorate the table with tiny confetti hearts, and served us complimentary champagne.  He then took a quick photo with his camera.  (At the end of the dinner, he presented us with a nice card with the photo framed in it, very nice.).We began the dinner with a delicious  variety of table breads.  Our appetizers were the Malpeque Oysters for me and the French Onion Soup for my wife.  You will never taste a sweeter, more buttery-tasting oyster in your lifetime.  These Malpeques will blow your mind.  They were served with your standard cocktail sauce, as well as a delicious wine vinger and shallot sauce.My suggested pairing for the oysters is the Santa Margherita Pinot Grigio, from Italy's Trentino region, this dry white wine comes with a clean aroma and the flavor of Golden Delicious Apples.Our entrees consisted of the dry aged, bone-in filet mignon, with roasted brussels sprouts with smoked bacon, and my wife had the pan-seared sea scallops with wild mushroom risotto.Both entrees were cooked to perfection and delicious.At the end of the meal, our server Ean, presented us with a beautifully decorated dessert plate with one small creme brulee and a small chocolate mousse, with the words Happy Anniversary written in chocolate on the plate.The overall service and attention to detail, throughout our entire dining experience, easily makes The Capital Grille of Fort Worth, the leader in fine dining downtown."], ["Shauna T.", "Great experience, but parking is an inconvenience in DT. Would highly recommend the restaurant to anyone in the area that is looking for a nice night out.Hosts, servers, even the water guy were all so friendly and professional. No complaints with service, but they did seem cheerfully robotic. If that bothers you, get used to it the entire night. Food was cooked to perfection. I came during restaurant week (I think they do almost the entire month) and had a taste of a good portion of the menu for a fraction of the price.-Lobster mac and cheese is very notable. Worth the price. Cheese is rich and macaroni not overcooked. Good, generous chunks of lobster.-Filet Mignon was great quality. I ordered rare and it had a smooth and rich texture. Outside sear had great flavor.-Mashed potatoes were very creamy and reminded me of Brazilian steakhouse quality. Mild taste and very fine.-Green beans had a good level of crisp and flavor. It was probably one of my favorite components of the items ordered. -Clam chowder was smooth and had a generous amount of clams. Not too overwhelming. Potato/clam ratio was equivalent.-Desserts were more on the sweet side for me. I used to have a sweet tooth, but I felt like the desserts were like pouring sugar down my throat. Chocolate cake was very rich, but overwhelming. If you're a wine fanatic, there's also a great menu. I loved how there were personalized (named) wines when you first walk into the restaurant. Really added a homey feel to the environment. I wish I knew more about wine so I could appreciate what was offered. Overall, 5/5. Haven't visited a restaurant with such a homey feel and superior service in a long time. Well worth the money spent. I also recommend doing valet, which is only like $5. Parking can get frustrating during peak hours, so spend those extra few dollars!"], ["Susan S.", "The Capital Grille truly is \"as good as it gets!\" The service is impeccable, the food is great and the atmosphere is perfect for a business lunch. My sister in law and I met here because it was downtown and the valet parking made it super easy to get in and out. I had the chicken caesar salad and it was fabulous. It came with a large piece of tender chicken, crispy parmesan, fresh lettuce and the balsamic tomatoes on the side were a nice surprise. She had the scallops from the lunch menu and they came with a corn risotto and a watermelon salad. We sat in the bar and our waiter was prompt, helpful and friendly. He recommended the specials and provided just the right amount of attention. This was such a treat for an afternoon lunch. I probably won't do this very often but will definitely be back for dinner in the near future.The hostesses were friendly and welcoming when we arrived and the valets were nice, helpful and our cars were brought up quickly. I highly recommend the Capital Grille for any type of lunch, whether it's business or pleasure."], ["Courtney K.", "Bottom Line:  A perfect meal served by perfect staff.Recently I dined at The Capital Grill while in Fort Worth.  Although The Capital Grill is a chain (which I generally avoid) my coworker and I chose it due to the proximity to our hotel and the strong reputation of the steakhouse.  My experience was perfect and in nearly 900 Yelp reviews, I think I have only said that a handful of times.  The service was absolutely text book and the food was all delicious and prepared just as described in the menu and by the waiter.  The Kona Crusted Dry Aged NY Strip was flavorful and exceptionally tender.  This was the highlight of my meal but the Bibb Salad, Butternut Squash Soup, Asparagus and Scalloped Potatoes would have made for a delicious meal on their own.  One of many things I liked about my dining experience here is that we were able to order half portions of our sides which was nice since we were just a party of two."], ["Von B.", "I love capital grille! The service is ALWAYS amazing the first time I came here it was for my fathers birthday and they gave us a free dessert and took our picture, printed it out for us. The most recent time we came here was for our 4 year wedding anniversary and when we got to our table it was nicely decorated with little hearts and a card from the staff. We received complimentary champaign for our anniversary which is very nice of them! I got the porcini rubbed delmonico with balsamic and it was to die for. Cooked to a perfect medium rare and was not lacking in the flavor department. I'm drooling as I'm thinking about it now. The hubs got the dry age sirloin and he liked that as well I know he preferred my dish over his because he kept trying to sneak a bite. We had the lobster mac n cheese and asparagus as our sides. They do not skimp out on the lobster! The was a perfect amount of cheese, lobster and breadcrumbs ( I love extra breadcrumbs on my Mac n cheese). The asparagus had a nice lemon zing to it and it was actually pretty refreshing it"], ["Suann G.", "I work across the street and stopped in with a co-worker for restaurant week for lunch.The food was great and the service spectacular. The waitress asked us if we had a time commitment, which I did. They had us in and out in exactly the time I said I needed to leave.I will need to go back for dinner!"], ["Linn P.", "Great attentive service.  mediocre food.  Especially for the cost.  Honestly. Even if this place was $, we would not come back to eat here.   Came here for a birthday.  It was a weekday, so we didn't make a reservation. Got a table in 5 mins.  Mostly they were setting it up with birthday glitter/sprinkles. Cute.  We got complimentary champagne and dessert.  Nice touch! So with one entree, one appetizer, one salad, one soup, one side. Our bill was almost $100.  Lobster bisque: bland and watery. Roasted chicken: okay.  Not flavorful or memorable.  But a very big portion.  Crab lobster cake- okay.  I would not order it again.   Cesar salad- too sour.  Too much lemon. I like classy places where they just give real anchovies on the Cesar salad.   This place gives it on request.  But not as a standard.  Lobster mac and cheese- don't know why people rave about this.  The lobster was overcooked and rubbery.  Our server was very nice and attentive.  He would come by to check on us.  But if he saw us in deep conversation, he would smile, turn around and come back 5-10Mins later.  At the end towards the dessert, he took a pic of us and printed it out and gave it to us in an envelope.  That was a super nice and sweet touch! But over all.  We would just not come back for overpriced mediocre food no matter how sweet the service is or nice decor."], ["Mary margaret D.", "Grant and I went for early dinner at 4:30 before Lyle Lovett at Bass Hall at 6:30. I had been some time ago for girl's birthday night but this was Grant's first time. From the start the ambience was comfortable and classy and the staff was impeccably attentive and respectful! There was restaurant week happening and we ordered soup and steak and dessert. Doug took great care of us! Valet parking was already up and going even this early. We even got a personalized 'hand written note' on our doggie bag. A++ y'all!!"], ["Brian L.", "My wife and I celebrated our anniversary here. They made every moment special, from the greeting to the finale. The food was equally amazing, presented well and cooked perfectly. The kona crusted filet is the best I've ever had. The lobster Mac and cheese is out of this world and features large pieces of scrumptious lobster. This place is not cheap, but is definitely worth it."], ["Viralyn K.", "Seriously, what a perfect experience. From walking in, service, and leaving, my family and friends felt really welcomed and taken care of. The server was very professional and really had her stuff on point. She got through the specials and recommendations, wasn't too over bearing, and the other waitstaff really helped her out. I am not a big fan of the iPad menu - c'mon guys, you would really trust me with that thing? And I didn't like how I couldn't adjust the brightness on the screen. I'm old school. I want a wine list on paper and desserts on paper. On to the food. It was very nice. We started with fresh oysters and calamari. On the table, we had steaks, lamb, lobster bisque, french onion soup, mash potatoes, brussel  sprouts and lobster mac and cheese. Lobster mac n cheese is glorious. Cheesey, curly noodles and chucks of fresh lobster that macaroni haters loved. The French onion soup was perfect; most of the time I find them to be salty but this broth was silky and flavorful. I got lamb as my entree and loved it. It was cooked perfectly. Everyone else seemed to enjoy their food. The wine list was nice too; $39 for a bottle being the lowest priced and most are priced around the $70 - $100 range. Capitol Grille really gave us the ultimate fine dining experience. My parents said they felt special being able to enjoy something like this."], ["Gordon F.", "Dinner and date night here was excellent. Service was fantastic and food out of this world!"], ["John R.", "Was in town for a conference that coincided with my birthday.   I chose Capitol Grille for dinner.  Great service and food experience.  I have eaten at several Capitol Grille locations and have never been disappointed."], ["Holly N.", "Suzanne was so sweet and wonderful even though we sat on the patio for lunch on a hot summer day. Thank you for putting up with us, Suzanne!"], ["Brandon K.", "What can I say about The Capital Grille and their outstanding service, food, location, and attention to detail? OUTSTANDING!I had made a reservation for my wife's birthday about a month in advance. When we arrived our table was decorated and we had a champagne toast waiting for us! Our server Steve has worked with the organization for a very long time and was extremely knowledgeable about their menu and wine selection. He also provided great insights into the cooking process and offered some amazing suggestions. I'm a big fan of Pinot Noir and Steve allowed me to sample a few of their most popular selections until I found just the right one!I had to go with the Porterhouse steak for dinner with a side of Brussel sprouts and Potatoes Au Gratin.Dinner was finished off with an amazing birthday desert plate. While Steve placed the birthday desert plate in front of my wife, he slipped a long stem rose onto the bench beside me to give to the wife after he left! What a smooth move and added touch that made the evening even better!What an amazing evening with outstanding food and service. There is no comparison to Ruth Chris, The Capital Grille is heads above the competition!"], ["Amy K.", "5 star service and best porterhouse steak ever! Service was great and food was outstanding. The bottle of wine washed it down really smooth."], ["Penny L.", "The last stop on our staycation. Didn't realize it was restaurant week or wouldn't have gone. Fortunately it wasn't busy Friday morning when they opened. We hadWedge salad good. Lobster mac & cheese was ok. Needed more creaminess. Bread & butter good. Salt & vinegar chips deliciousLobster roll very bland. To many other restaurants with great flavors to choose from so we probably won't be back."], ["Emily P.", "Came here with my family, so my rating has nothing to do with price because I thankfully did not have to pay. When we arrived at 6 on a Friday, the restaurant was practically empty. The service was fabulous, but that might have something to do with the fact that we had our waiter's undivided attention.Now, for the food - oh my god. Its good (as it should be when you see the prices). Anyways, the bread alone is to die for. I highly suggest trying all of them, even the commonly scoured-at pumpernickel. I ordered the caprese salad, which isn't actually called that, but essentially it is a caprese salad. The mozzarella was fresh and delicious, and I love tomatoes so it was really quite yummy (but very filling so beware). For the main course I had the scallops, which were perfect. Sometimes when you order scallops there are uninvited sandy bites, but that was not the case. Basically they were perfectly seasoned and delectably buttery. The risotto was relatively good but not as flavorful as I expected considering the waiter raved about it. My grandfather ordered some very rare lamb, which sounds slightly terrifying, but even my uncultured tongue enjoyed it. Our table of six ordered two sharable sides which was sufficient. The Brussel sprouts were very nice, and the lobster mac n' cheese was marvelous (better than Ruth's Chris, sorry). Dessert is apparently essential at such establishments, so my grandmother and I shared the creme brûlée with fresh berries. Honestly the custard part of the dish and the berries were to die for, but the caramelized topping was way thicker than necessary and detracted from the gentle custard. Had I seen it, the check might have horrified me into rating this 4 stars. But, I can only base my rating on what I experienced and everybody agreed the food was to die for and the wait staff was wonderful"], ["Mike H.", "Love this place. Came here for our anniversary and they made the night so special. The staff is very caring and sincere. They always go above and beyond. The food was fantastic. All around it was a terrific experience. Not our first time and we will continue to dine here."], ["Jacqueline N.", "From the moment we arrived through dessert we had an amazing experience.  Their lobster bisque was creamy and had a wonderful amount of lobster chunks that delivered with every spoon. I had the bone-in filet and my boyfriend the bone-in ribeye, they were both prepared perfectly. They have a number of delightful looking desserts which made it difficult to choose. I had the coconut cream pie and it was heavenly. Both food and service were great.  We will definitely be back."], ["Ashley M.", "This place has always been a go to of mine for celebrations. I have always been nothing but overly satisfied with the service and food. Last night, however was a completely different story.My boyfriend and I were seated directly in front of the kitchen when we arrived and we had groups of waiters standing in front of us chattering loudly about their tables while the racket from pots and pans in the kitchen sounded off in the background. We quickly requested a different table and we were reseated someone promptly, which I appreciated very much. Our first course of shrimp cocktail and crab cakes were fabulous. The shrimp were huge and fresh and the crab cakes were flavorful. Unfortunately this is when our positive experience ended. This restaurant one carries one size of filets. A 10 oz. We inquired about any other sizes and they simply said no. There was absolutely no other sizes offered. We ended up ordering the 10oz Oscar style and the lobster mac and cheese.  Both have which have always been our favorites there. Upon ordering our waiter said they no longer did Oscar style which is completely unheard of at an upscale steak house. He made a huge show about having to go back and ask the chef. He finally returned saying they would make an exception but it would take an extremely long time and it was a total imposition. Finally our entrees and sides came and they were both good. The lobster mac and cheese has changed a lot since last time though... I always rave to friends about the huge chunks of lobster in this dish. On this occasion it was not the case and I think I counted 2 pieces of lobster total. At the end of our meal our server came and took all of our plates without asking and did not offer togo boxes when we had an extremely large amount of food leftover. Pretty rude if you ask me...This restaurant seems to have changed a lot over the last few months and definitely not for the better. I hope to see it change back to their old ways."], ["Pepa R.", "Celebrated a nice birthday party for a coworker. A party of 9 with no reservations for a friday night, was a little complicated. The restaurant offered to sit us outside, which was perfect.The Bone In Filet Mignon was excellent.The Bartenders Alex And John super cool and our server Mary did an outstanding job."], ["Kyle M.", "Returned here for a family members birthday. I left way more satisfied than the time before.The delmonico ribeye was cooked perfectly and was the best steak I've had in a long time. Bravo."], ["Stephanie D.", "Boo-bear and I came here for Restaurant Week 2014, near the tail end of the whole ordeal, and it was by far one of the most pleasant experiences in TX yet!I just have to say, the model that CG does for their RW is impeccable - they treat you like a regular even if you order off that menu and that menu alone, which is just fantastic. We started out at the bar, boo with a mixed whiskey drink and me with a glass of dry chardonnay. The bartenders were just chatty enough without being overbearing. We quickly got our seats within 15 minutes and were seated as a nice booth in the midst of the restaurant. Off the RW menu, I got the salad and boo got the clam chowdah, we both got the filet's with the accompaniment of mashed potatoe's and green beans, and we ordered both the cheesecake and the flourless chocolate cake. We also threw in a side of the lobster mac and cheese as we had heard it was amazing. Nothing disappointed us! We were actually too full half way through to eat even the dessert, so they kindly boxed that up for us! The filet's were cooked perfectly - even re-heated up the next day they were juicy and melt in your mouth tender (yes, I know, I shouldn't be treating a filet this badly, but we couldn't let it go to waste!). The desserts were divine even the next day, and the service and the entire staff as a whole was just impeccable. We love Capital Grille, I'm just glad to see the standards here are just as good at any of them :) We'll definitely be back for more special events and/or restaurant week next year!!"], ["Cristina M.", "Excellent dining experience last night! It was my first time there and will definitely be going back. Food and service were terrific! This is the best service I've ever received in Texas,from Chicago. Our server went above and beyond and felt the entire restaurant also cared to make our experience fantastic. I dub Capital Grille the \"Neiman Marcus\" of restaurants! Love this place and will be returning for life! Very happy! Thank you!"], ["Debbie E.", "We came here for lunch and everything we ate was amazing!  Service was excellent. I would highly recommend the lobster crab burger. Best \"crab cake\" I've ever had. Save room or get a take away bag so you can have dessert. The creme brûlée & coconut pie are incredible. This restaurant has delicious food and reasonable for the quality & atmosphere."], ["Thomas W.", "READ WHOLE REVIEW FOR SOMETHING COOL, ABOUT WHAT THE RESTAURANT HAS, AT THE END!BEST FOOD EVER! I just came back from capital grill in Fort Worth. Really good food. They treat you really nice and they treat you like a VIP on your birthday. I had the steak, my mom had the lamb chops! Really good! My dad had the surf and turf steak and lobster! I had one bite of each of their food, oh my god was the food awesome! It's very fancy. So dress your best. If you don't plan to dress up that nice, a everyday dress for women would be fine. A collared shirt and some Jeans would be fine. Want the best waiter? Have the hostess sit you to the right of you when you walk in. Sit in one of the booths or tables when you walk in to that room. You'll have the best waiter. Also, you know this place is fancy because it has mouth wash in the bathroom. Go eat and enjoy. They have great deserts too. Their alcohol, desert, and other drinks menu is on a iPad. So if you hate apple, you might just want to steer clear of the restaurant. I'm kidding. Not about the iPad of course. About Samsung and android people wanting to steer clear of the this restaurant. I'm joking about that."], ["Korena S.", "Great atmosphere. Delicious meal.  Came here for our 12 yr anniversary and was amazed with everything.  Cannot say enough about their customer service.  FANTASTIC job to the valet, wait, and management staff.  Rob was our waiter and he was top notch awesome!! Will definitely be back."], ["Bridget V.", "First, I wanted to start by saying that I rarely use phrase \"best ever.\" A. because I am forgetful and B. I find it hard to pinpoint what would make something best because all food is different and I have shoved some wonderfully delicious things in my mouth. I am here to tell you that I had the BEST. MEAL. EVER. at The Capital Grille.My fiancé and I were celebrating our anniversary on July 4th and he surprised me by taking me to The Capital Grille. We had never been there before, but he saw it had great reviews so he booked the reservation. We were seated right away to a table with heart shaped confetti as well as a single rose for me. It was so cute.The service was outstanding. Our server was very helpful and knowledgeable, and checked on us often, but she wasn't overbearing in anyway. She also brought us a sample of her favorite cocktail and of an appetizer for us to try. Management and the chef also stopped by our table to see how everything was and to thank us for dining with them. Usually, I am not a fan of the manager stopping over to check in, but the way she approached us was much politer and less abrupt than what I am used to. It was also between our dinner and dessert so I didn't have food in my mouth (I hate that so much! I seriously think they train servers to do that at some restaurants because then you can't complain!).I saved the best for last. The food. The bread was excellent. It was moist and there was a great variety. It definitely tasted fresh. For the main course, I ordered the porcini crusted ribeye and my fiancé got the bone-in Kona crusted NY strip. Both medium rare and cooked to perfection and my sweet mother of God, both steaks were AMAZING! Tender, juicy, with excellent flavor. I only had a bite of the strip, so I can't properly describe it. All I remember is that it was flipping awesome! My steak had a wonderful savory earthiness. Like an umami. It was paired with aged balsamic which added an excellent tang and a bit of sweetness to break up the strong flavor of the porcini. Both steaks had a crisp crust on the outside which is arguably the best way to eat a steak. Both steaks were huge! My ribeye was the size of the entire dinner plate, and about and inch thick and the fiancé's, while a bit smaller, was at least 2 in thick! We also shared the lobster mac and cheese. This  is a must! I don't care that you might feel pretentious for spending somewhere around $18 for Mac n cheese, but that shizz is worth it's weight in gold! Normally, I am not a fan of cheese with my seafood, but they definitely picked the perfect cheese to go with the sweet and succulent lobster. It was a mild white cheddar I believe, with the perfect amount of saltiness to counter balance the lobster. There is also a buttery, crunchy crust at the top to add some needed texture. They also gave use a free dessert for our anniversary and I am shocked to say that the dessert was almost as good at my steak! They placed two individual sized desserts on one plate that had \"Happy Anniversary\" stenciled on with chocolate which I found very thoughtful and unique! One of the desserts was the creme brûlée cheesecake and the other dense chocolate mousse cake with whipped icing on the side. The cheesecake was creamy, with the perfect balance of sweet and tang. It was the lightest cheesecake I had truly ever had! True to its name, it had a caramelized sugar crust on top which gave it a slightly bitter crunch. It worked well with the sweetness and tang. Last but not least was the chocolate mousse cake. It was so dense and bitter sweet, and left me weak at the knees! Haha! It satiated my normally unsatisfiable sweet tooth and chocolate monster hidden within. The \"icing\", which was more like whipped cream, cut the bitterness of the dark chocolate and lightened up the bite a little. I preferred just eating both separately because I love bitter chocolate.  It was decadent, rich, and sinful. Just what I love in a dessert! Thank you Capital Grille for making our anniversary perfect!"], ["Diana B.", "Had our Annual Secret Santa Dinner here for a group of 9. Made reservations, but still had to wait a little over 15 to 20 minutes for a group to leave before we were seated. They helped us with all the gifts we had in the closet while we were waiting. There weren't any seating areas to wait and the bar was pretty packed, so that was a downer. The place is really dark and made me a little sleepy, as for the other girls I went with, it was the same for them. We were too close to other people, especially for a large size of 9. I think we were a little loud for other people and taking too many pictures. LOL. As for the service or our waiter, he was really nice and attentive. I didn't have to track him down at all or ask for any refills. Also, our orders were split for us if we shared, which I thought was nice and neat. I didn't expect it, but they did it for us. All good portion sizes to share. I honestly believe you can order a dish for every 2 people.Food we all ordered:Pan Fried Calamari with Hot Cherry Peppers - I would say this taste like any other restaurants. I can just eat this anywhere. It was nothing special to me.Lobster & Crab Cakes - The sauce was pretty good and the crab cakes taste fresh. I enjoyed it. I like more more crispy on the outside, but this was still heaven in my mouth since I love crab cakes.Lobster Bisque - Good chunk size lobsters in the bisque in a really good broth. it was creamy and rich. This is not part of the menu, but they had it available.  Chilean Sea Bass with Mushroom Soy Broth - My sister ordered this, but of course I tried it. The soy broth was a bit salty. If it's going to be a mushroom sauce, I like it a bit more creamy, but the chilean sea bass was soft and good, but doesn't compare to Pappadeaux chilean sea bass!Double Cut Lamb Rib Chops - I thought this taste okay. One of my girlfriends ordered it, but I tasted it too. I've had better at other places.Dry Aged Porterhouse Steak with Courvoisier Cream - The steak was moist and on point. The sauce was more of a gravy to me for which I asked to be served on the side. Definitely something to order.Pan Seared Sea Scallops with Wild Mushroom Risotto - The scallops were not satisfying to most of us who had it. It didn't have a unique taste or made me want to order it again. I felt I could have it anywhere else. As for the risotto, that was delicious!Lobster Mac & Cheese - One of the best mac&cheese I had. I loved it. It had a good amount of lobsters in it, very rich and cheesy, and I believe there was garlic bits on top which was a super plus for me with the crisp. Parmesan Truffle Fries - Did not like it. I wouldn't order it again. Just my preference."], ["Peter H.", "My fiancee and I went here after the nutcracker. I missed our reservation at The Reata because of traffic and we almost went somewhere faster because of how hungry we were. We ended up going here and thus avoided what would have been the greatest culinary mistake of our young lives.The service was excellent. Chester, our waiter, has that rare quality of being engaging and talkative without lingering at the table. When we told him we are getting married soon, a complimentary dessert with \"19 days and counting\" written on the plate in chocolate was brought out. Any other staff member we talked to showed the same attentiveness.The food, ohhhh the food. I have a habit of giving a little chuckle of delight when I eat great food. The Kona rubbed sirloin I ordered fit the bill, as did my fiancee's sea bass. I didn't so much cut the steak with my knife as I set a knife on the steak and put some pressure on it. Truly excellent. The calamari we had as an appetizer was the best I've ever had.Seeing the Nutcracker was already a holiday tradition, dinner at Capital Grille just got added to the agenda."], ["Jared H.", "Really quality food, and amazing service. I had the burger with an egg on it, and it was overwhelmingly delicious. Hard to top this restaurant, other than its a tad on the pricey side"], ["Kenneth M.", "This visit was superb!  Excellent customer service!  Excellent steaks!When you go, ask for EAN ATTIG!  He is the best I have ever experienced!  We are ready to invite him to Sunday dinners!"], ["Scott B.", "Umm.....what is there to say here? It's a fantastic dining experience, but you'll pay for it. We went here for my wife's birthday and it didn't disappoint. Our table was sprinkled w/ birthday confetti and we sat in the Sous Chef section and were \"treated\" to fresh lobster claw. Just a taste, but beautifully plated. Service was top notch as you'd expect. Steaks, sides, drinks.........just wonderful. With drinks, be prepared to spend about $100.00 per person, but what a wonderful experience! By the way, dress is business casual, but I noticed lots of jeans in here, which is awesome. Oh and I forgot that they took a great picture of my little group and presented it to us when we left........and yes, it's just part of the experience. Nicely done!"], ["Chase B.", "The Steaks get 4 stars, the staff get 5 stars, the rest of the food gets 3 stars, and value I put at 2 stars.  In a place like this I will pay top dollar if I can't make a steak better than the restaurant can. That was true, the rubs on my Kona and her Ribeye were fantastic. But the spinach salad and Lobster bisque were so-so. As for our waitress, Cheryl was great and did everything perfectly.  The other staff came by a few times and checked on us too, they really do a top notch job.  The ambiance is soothing, low light and romantic. Especially when you bring your 1 year old, oops. I do not think I would go back because the value was really not there. If you spend lots of money dining out, go ahead and go you probably would like it. But if you are a once a year splurge type person, I would take your money elsewhere."], ["Leslie H.", "A favorite place for us thanks to the delicious food and attentive service.  Server Lety is the best in the business and the managers are top notch. They work together to make sure you have an amazing, positive dining experience.  Expensive but well worth it. Especially for a special occasion. I recommend the stoli doli for starters. And my hubby recommends the Manhattan.  The prosciutto wrapped mozzarella app is a great way to begin a meal. We prefer it over salads. Soups are good here but too filling. You want to leave plenty of room for your entree and the decadent lobster mac and cheese. It is one of the best dishes on the planet!  If you have room for dessert, go for the coconut cream pie. So good you will dream about it."], ["Mark S.", "My wife and I went here for the first time, for our 20th Anniversary.  I had very high expectations, and I was not disappointed.The service is impeccable.  Everyone here takes there job very seriously and professionally.  The decor is nice with great local flavor.  And valet parking is only $5.The food: My words could never do it justice.  The aged beef could be cut with a fork and almost melts in your mouth.  The buttered lobster is the best I have had, which may not be saying much.  The lobster mac n' cheese was delicious.The price:  Well you are going to pay what you would expect to pay for such service and food.All in all, I loved the whole experience.  I would not hesitate to recommend this restaurant to anyone (with the money).  Great experience."], ["Mark H.", "Great service!!! We were not dressed nice at all because it was impromptu stop but they were still great! The food was wonderful and the waiter was great. It did take a little bit of time but was a wonderful experience!"], ["Debra C.", "My husband and I went on a Sunday night for our first time. The ambiance was refined and elegant even though a few guys came in wearing T-shirts. Our waiter Doug was very informative and attentive. Our cocktails were refreshing.  We started with the shrimp cocktail and they were huge and of course scrumptious. DH had the 10 oz Filet Mignon and I had the Filet Oscar and we shared the Lobster Mac and cheese. Wow! Fabulous  cuts of beef! Would definitely recommend for a special occasion!"], ["Jennifer W.", "My birthday was in January, and though I'm getting too old to have fun parties (wait, when did that happen?), my parents are always good to treat me to a nice dinner out on the town. And this year, it was a visit to The Capital Grille in downtown Fort Worth.From the moment we arrived, we were taken well taken care of. We were promptly seated in a cozy booth where they had sprinkled sparkly confetti on the table in honor of yours truly. Our server, Chris(topher) Parnell appeared quickly to offer me a long-stemmed rose (which, by the way, lasted a solid week at home in water), and to take our drink order. The servers here are for more than merely order-taking and delivery; rather, they are knowledgeable about everything on the menu and - at least in Chris' case - fluent in mixology. When I ordered my standard Old Fashioned, I was asked something I'd never heard: Dry, Sweet, or.. I can't remember the third. While this may be a bit pretentious, I found it interesting and just right for the experience.Though the lighting was a bit dim to comfortably read the menu, it's hard to argue with the ambiance. We were successful in ordering, trying  a couple appetizers first. The lobster crab cakes are a must-try; I'd say about 95% meat, very little filling, and simply delicious - best I've ever had. The french onion soup my mother had was also probably the best I've ever had. Oh, and I failed to mention their selection of breads and rolls which was a refreshing change from the norm what with warm and soft pumpernickel slices, onion rolls, and sourdough. Our entrees didn't disappoint either. My dad had the bone-in rib eye, which was tender as can be and full of flavor. My mother tried the tenderloin, and though I hate to sound like a broken record... best I've ever tasted. Finally, I had the grilled ahi tuna. Used to this coming out in tidy little seared slices, instead I was presented with a large steak, perfectly seared. The tuna cut like butter and tasted wonderful. And, to ensure that we got our veggies (entrees are a la carte), I ordered us the green beans, which came sauteed/grilled with cherry tomatoes and roasted garlic. I couldn't get enough.We opted out of dessert because - as it was my birthday - Chris brought us a trio of desserts - the perfect sampling to end an evening of fine dining. Truly a great experience. The only word of caution: you get what you pay for. Just like everything was among the best I've ever had, the price point was equally 'high' quality: not for the light wallet, even with a $75 gift card. Worth it once in a blue moon if you can afford it, but be forewarned, it's not cheap."], ["Gary D.", "My wife took me to Capital Grille on my Birthday.  The food was excellent and the service was even better.  I highly recommend anyone looking for a place to feel special to stop by the Capital Grille.  You won't be disappointed!"], ["Vishal S.", "Typical chain restaurant. I've been to a couple of these locations and I must say there is a chain type feeling to them, there is nothing unique to the big name brand. The service is always fantastic so the 3 stars are for the service, food ........ Blah."], ["Allison C.", "This is a beautiful restaurant. Food is spectacular and service is ALWAYS amazing! From the moment you walk in the door to the moment you leave, it will be a wonderful experience!"], ["R J.", "If the prices were just a bit better, it would rate a five-star...excellent service, food, and setting...everything was really good."], ["Kurt R.", "My wife and I ate here while she was attending a veterinary conference. The food was amazing. Had the lobster bisque, it was loaded with lobster. Asked the chef to prepare the lobster mac and cheese for lunch even though it's a dinner only item, it was prepared and full of lobster. I had the sirloin sliders, both were tender and juicy. My wife had the lobster roll (I bet you're wondering if it was full of lobster. It was!) and the clam chowder. The lobster was tender and moist in every preparation. Cheryl our waitress was phenomenal. So kind and courteous. Just a joy to have her help us. Got the cheesecake and the coconut pie to go. Had them for breakfast the next day. The cheesecake was by far the best cheesecake I have ever tasted. It was melt in your mouth delicious. Perfectly tangy with moist tart berries to accentuate and offset the tanginess. The coconut was the best I have ever had as well, but the cheesecake was so good it overshadowed it. Today we received a hand written thank you note from Cheryl. This place is the classiest restaurant I have ever been to. They are a fine dining restaurant and still treat you like a friend.  I would recommend this place to any foreign dignitary, anyone who wants a place to go for a delicious and romantic dinner, the pope, the president, anyone. This is the place to eat in Fort Worth."], ["Nam N.", "Very upscale and pretty tasty too! My family got the Lobster Mac and Crab Cakes to share. (Both were very savory and delicious.) Service was very good and informative. Only complaint is that my steak, The Konan Rub, was kinda bland by itself. Its cook was amazing, but without the sauce, the meat was kinda bland. Other wise very nice experience. Will definitely come back though. I'll try a new steak next time."], ["Marisol L.", "Hands down best food ever. A little pricey but so worth it. The staff is super friendly"], ["Staci A.", "Love Capital Grille! I don't eat a lot of meat and I am able to go here and enjoy their wonderful sides. They're so nice to my 5 year old too. I eat at Del Frsico's Grille, Reata and Capital Grille every week and Capital Grille is my favorite."], ["Brent W.", "Great food, fantastic service, very comfortable ambiance. Don't miss your chance to experience this dining extravagance."], ["Don K.", "Excellent food and excellent service.  What more can you ask for?  The filet was grilled perfectly and the porcini rubbed tenderloin was fabulous!"], ["Laura H.", "Beautiful restaurant near the convention center.  A bit upscale.   We went there with a group of about 50 and the service was great.  We had a prefixed meal... I got the sirloin with shallot butter, which was juicy and delicious and perfectly medium rare. The dessert assortment was decadent.   Creme brûlée, cheesecake, chocolate cake and raspberries and blueberries.  Enough to share... Delicious. I highly recommend Capital grille.  A little pricey so maybe save it for a special occasion."], ["David F.", "Fantastic food and service. We had a party of 18 and the service was fantastic.  I had the Delmonico steak.  It was amazing!  Perfectly cooked to order."], ["Victor V.", "We arrived early for our Saturday night 5:30 reservation. We were seated in Brenda's section which was a great start to our evening. Drinks were offered and bread was placed immediately. Breads were a combination of warm rolls, a sweet dark bread and some flat bread. All really fresh and tasty. Rock salted butter was also presented.  Starting with the steak tartar, which was perfectly seasoned and presented with the chopped egg, capers and onion folded into the dish. This was a great presentation. Then we ordered a prosciutto wrapped mozzarella that was baked and drizzled with aged balsamic vinegar.  Great texture and perfect temperature. One in our party ordered a rib eye steak. Rubbed in their Kona rub and cooked to perfection. Another ordered filet mignon with an different spice rub and also cooked perfectly. The other two ordered Main Lobster.  It was broiled expertly tasted sweet and tender served with a side of drawn butter.  The sides we ordered were whipped mashed potatoes and escaloped potatoes. Both excellent.  Brussels sprouts were also ordered but we did not have room to taste those. For our birthday boy, they brought out a complimentary duet dessert of chocolate mousse and strawberry cheesecake.  Both very light and perfectly sweet.  Brenda was a fantastic sever gracious and attentive. She ensured the evening was perfect for my birthday boy."], ["Jen L.", "OMG the porcini bisque was the best thing I ate while in Ft. Worth. When a friend suggested we dine here, I didn't think it was going to be in my budget, but $18 plate lunch special was perfect! I had the above mentioned bisque (with chive oil...give me a Homer Simpson drooling moment....), seared scallops on delicious corn something and then a side of baked butternut squash with cranberry compote. My dining companions got steak sliders, beef hash and a lobster roll. In fact I think we all ordered different combos of things. The only thing that I tasted and didn't think wow, was the truffle fries and they were fine, just a bit heavy on the truffle oil. The staff was lovely and service was just how I like it, attentive & friendly without being intrusive. The setting was relaxing but not sleepy.Seriously, lunch is the perfect way to enjoy a more affordable meal at this upscale steakhouse."], ["Monica W.", "The service was impeccable however the food was bland with no flavor. The only thing I enjoyed was the lobster mac and cheese. If you want an amazing steak with great service go to The Keg in Plano. I have yet to have a steak/lobster that's any better."], ["Stoney R.", "Bartending service as well as the host staff... awesomeThe soggy calamari not so hot...Expected more on my first visit. ..."], ["John G.", "What can I say that hasn't been said before? This place is fantastic, the appetizer/salads were great (clam chowder) was great, the truffle fries were out of this world. I ordered the Kona Crusted Bone in sirloin and this steak was to die for. The other people at the table ordered the Filets and they were so fork tender. The mash potatoes were like made from the gods, I have read reviews here were they say the potatoes are bland and I question their ability to judge great food. The service from the door to the table and everything after that was top notch, server was knowledgable and did an amazing job. I would recommend this place and say if you are reading this review, stop and make reservations you won't be disappointed"], ["Rudy T.", "This is an awesome place for your special night's out. Good any other time as well. But they go out of their way to make special events even more special. The atmosphere is great and the food is event better."], ["Patrick A.", "New favorite steak place.  Truffle fries are crazy good.  Service is insane....pretty sure you can ask for anything and they will do it.  In fact, we did....my daughter wanted a \"fancy\" drink....not shirley temple.  They delivered!  Steak is perfectly cooked every time.  Mac and Cheese you will leave you spouse for....okay maybe.  I took my wife for her birthday, they decorated the table and provided a rose...the whole 9.  Can't beat it."]], "The Bottom": [], "Houlihan's": [["Lora Lea N.", "We ate there tonight and had a very pleasant experience. When we arrived which was about 6 o'clock there was a short 10 to 20 minute wait, but the waiting area was very comfortable.  It gave us time to look at the menu as this was our first time there. We ordered an appetizer which was a cup of French onion soup. It would've been better had it arrived a little earlier because we only took 2 bites before the entree arrived.  For the entrée we selected stuffed chicken with asparagus and don't smash potatoes and it was absolutely delicious.The atmosphere is very conducive to conversation. It is upbeat and modern yet quiet enough to carry on a conversation. Definitely will try this again and perhaps order the highly recommended hamburgers. The gentleman next to us had the Ahi Tuna Salad and raved about it."], ["Jason D.", "We really wanted to like this place but were really disappointed. It was really nice inside but.. it was super cold and I'm sure the waiter was high. But the worse part was the food just wasn't good and over-priced. They didn't even have sweet team.We will not be back"], ["Tram N.", "Walked in 1 1/2 hours before they were about to closed. The atmosphere here is very chilled you can hear some chattering in the bar area but not too noisy. The chicken tortilla soup would've been good if the tortilla strips didn't taste old and if the soup was actually hot. Mines was cooled (pre-made). I couldn't tell my server because she didn't bring us our food or check up on us. Their famous stuffed shrooms though did come out hot and delicious (freshly made)! Crispy on the outside but soft and creamy on the inside. The sauce with it was good too. The chicken lettuce wrap was pretty good too. Lettuce was nice and crisp and the chicken was full of flavor. Our server was very nice when we came in and took our order and when we asked for our check but that was the only time she spoke to us. She didn't check up on us after we received our food or anything. Since she didn't refill my water I had to share water with my boyfriend. She was busy cleaning up her area I assume. But it is what it is."], ["Harless R.", "Nice staff, nice restaurant, comparable to apple bees but twice as expensive. HoulaBLANDS"], ["Nora H.", "Stopped by here on Sunday really not knowing what to expect. My boyfriend's little sister kept asking us for Popeye's chicken but I really didn't feel like having that. Anyway on our way back home we saw a huddle of restaurants, and one of them was Houlihan's. It was pretty busy, and I'm guessing it was because of the All Day Happy Hour! If you need a drink on a Sunday and you happen to be around the Alliance area, Houlihan's is the place to be. Domestic drafts are $3 and margaritas are only $5. I ordered one of the Traditional Margaritas. It was served to me in a pint, and it was strong as hell. It was the only drink I probably needed to get me going, but I added a Blue Moon to the mix cause why not. And always remember \"Liquor before beer, you're in the clear\". If you had been there with me that night you could have heard me chanting \"I'm in the clear! I'm in the clear\". Silliness aside, I really enjoyed my amazing Stuffed Chicken Plate with mashed potatoes and my tomato soup. You must order it! Served at room temperature, which oddly made it even more delicious. My boyfriend had the Seared Georges Bank Scallops, which he loved. His little sister had the Grilled Chicken Breast from the kids menu, and she ate it all up, even saying that she wish she had more. The only reason I'm not giving it a full on 5 is because our waitress wasn't the friendliest. We waited for our check for a good 20 minutes after asking for it.  But I will be back, this place rocks."], ["Scott T.", "Not at ALL impressed on our first visit to this Houlihans- to say we were disappointed is an understatement.We were seated and ordered a drink and appetizer- I ordered a straight up vodka martini with olives and my wife ordered a glass of chardonnay. 15 minutes later, our drinks arrived- my martini with no olives and a glass or red wine which my wife sent back for what she ordered. We ordered dinner- my wife ordered scallops and I the new york strip steak.40 minutes later- our food arrived, my steak was luke warm and side dishes were cold but by this time we were so hungry we ate it anyway. For the most expensive steak on their menu- most guys can cook a better steak on their own backyard grill trust me.So- I ordered a glass of merlot to go with my steak- didn't happen, our waiter made yet another excuse for the bartender being so backed up. when my wine did arrive, I was done eating so sent it back.The manager came over apologizing also making excuses for the bartender and did comp a free dessert which we took to go.1 hour 20 minutes and $90 later for a dinner for two- we left. This restaurant must be succeeding because of sheer volume of people shopping nearby because there are so many far better restaurant choices around with much better service and food.Had it not been because of our enjoyable waiter Raul- we would have walked out of this place mid dinner.I don't write reviews or complain very often but when I do- it's for real, trust me avoid this place."], ["Tinsley K.", "This is our go to place for date night.  The wait is usually not long, the mini martini sampler is fun and the appetizers are delicious!  I got the scallops with risotto and ate every last bite!  The atmosphere is nice and relaxing with good mood lighting for a date.  Love this place!"], ["Kerry N.", "Great stuffed mushroom and fun drinks. Meh, otherwise.  We've given this location a few tries.  The staff is friendly and the food has different things to choose from; it's just not exciting and it's not cheap."], ["Samantha K.", "I took my girlfriend on a date to Houlihan's this Wednesday afternoon in a hope things would be better. My entree was very good (filet) but was over cooked. I ordered rare and it was more along the lines of medium rare or medium. I didn't send it back because it was not over cooked to the point of being inedible or bad even, it just wasn't cooked to my liking. I got a 9 oz glass of red wine that took a good 15 minutes to come out. I would understand it was busy but it was at 3 in the afternoon and it wasn't busy. There were 3 tables in the whole restaurant. My girlfriend got the buffalo bleu salad. The lettuce was a little limp and the bleu cheese came in a slice instead of crumbled on top. I could see why after watching her try to crumble it for 10 minutes. It just stuck together in one spot and turned into a giant ball of cheese. The portion was extremely small for 12 dollars. It came with a small cup of soup as an appetizer; she got baked potato and said it wasn't bad. I got chicken tortilla and it was very good. So overall food wasn't bad, just not good portions for the price. Now to the service: always Houlihan's biggest downfall. The service was SLOW. Very very slow. Like everything was stuck in slow motion. 15 minutes for a glass of wine. 10 minutes later soup. And 25 minutes after our entree came out. The only thing that was fast was our brownie desert (which is normally delicious, but wasn't as great this time). Now getting to our actual server. It was just weird. He acted very strange. Shaking our hands at the beginning of the meal kind of weird. I couldn't decide if he was hitting on my girlfriend or just had an odd personality. He was very nice, just not the service I like to enjoy in a restaurant.Over all, I think I will stick to ordering to go deserts to bring home to enjoy in front of the TV."], ["Cheryl G.", "Nice restaurant inside, lots of booths and tables, patio for outside dining. The salads came out with warm plates, weird. Didn't finish my Caesar, gross tasting warm greens. Asked for my filet cooked well done. Super pink inside and had to send back. When it was done my hubby was pretty much done with his dinner. The filet was cooked perfectly and tasted super yummy. Baked potato was hard inside and the outside fell apart. The manager gave us a free desert for the mishap. Happy hour is only in the bar. Hubby dish was the French dip, no complaints."], ["Rich And Amanda M.", "1/2 Price wine bottles on Tuesday is awesome - but what happened to the great HH apps?  4 wings for $3.95 - that's not a deal.... 1 Slider for $3.95 - same thing.  Might as well order full menu item, I haven't done the math yet but probably cheaper.  Used to be best - very disappointing."], ["Ben D.", "I had the worst service of my life here. My water was empty and I had to go inside, pass up two servers, one bartender, (without being asked if I needed anything) fill up my cup with ice and with water. Our sever was no where to be found. Terrible service. The manager was amazing. After being in the business for 13 years, I expected so much more. We probably will give it one more chance, one more is it."], ["Shannon E.", "Let's start off with the food.Portions are similar to those in Europe, not a problem, but I paid less for better in France for the same thing. $14 for the Soggy Salmon BLT. The service....here goes. Josh, aka Severus Snape, potions master at Hogwarts, was our waiter. He shook our hand and was monotone in such a low baritone, I could barely hear him over the obnoxious playlist they have playing in there. He was quick and polite, but gave me the feeling I was being served food by a depressive mortician that probably has more than a few Cure albums. He was the only redeeming factor here. Management,Scott is not only unhelpful, but condescending and pretentious. A hard sell when he looks like his hygiene hadn't been tended to properly. I don't know who told you the \"chin landing strip\" was a good look for you, but maybe it serves a purpose elsewhere. Also, his body odor could be likened to one of my migrant farmers after a long day in the orchards in 90% humidity. NEWS FLASH...old spice had 2 for 1 shower bundle pack. Anyway that's all I've got. The bartender Kristin is the best thing about this place. The cocktails being cheap is the only way to tolerate the aforementioned grievances. S. Everest."], ["Miranda B.", "Promptly seated and served! Great food! the ribs and pot roast were awesome!!! Husband and I were here for a rare date night and the staff made us feel welcome and provided awesome service!!! A nice rare treat considering we just had a bad experience at another nearby restaurant and glad we stopped here!!"], ["Shane W.", "Nice decor inside and out, modern and relatively upscale vibe.  The food quality didn't match the decor.  Very mediocre.  The menu is decent, the presentation is ok but the food was a bit bland. Bring the food up a couple levels and this would be a nice place."], ["Ruthie H.", "My husband's company comes here for lunch sometimes & he wanted me to check Houlihan's out. It was Sunday about 11a. He had grilled salmon & I had stuffed chicken. Food was delicious although we had to wait a little longer than I expected. (It is my understanding they have a time served guarantee although I didnt see it on the menu.)You have to ask for rolls (a little odd...); service was average. Empty glasses sat for a while. ...I switched from soda pop to tea & was charged for each. Maybe this is normal but seemed unnecessary. 4 stars because food was quite good.People say yelp reviews are slanted/ biased & not trustworthy. All my reviews are written by me & totally honest & quite trustworthy."], ["Karen S.", "I love Houlihan's!!  They have an awesome Happy Hour if you're looking to grab some drinks and appetizers.  The outside patio area is nice to meet up with friends.  I love that they email me coupons and special offers. I've never had a bad experience at Houlihan's!!"], ["Brad M.", "SALT!  2 STARS full of SALT!We have been here a few times, but I'm not sure I can be convinced to go back.  It's an easy -access location for me, and a beautiful restaurant.  However, I'm not quite sure where the wait staff gets the attitude and entitlement from.  As my profile says, \"What part of service\" do you not understand?On our most recent trip we started by sharing the CHIPOTLE CHICKEN NACHOS.  It was to have chili roasted chicken,  pepper jack, cheddar and chipotle cheese sauce, jalapenos, tomato, cilantro, guacamole, sour cream, house salsa all for just  $10.95.  What we got was a bad Taco Bell version of chicken nacho's compete with the sharp-turn in the car that dumped all the toppings onto one side (leaving 2/3 of the nacho's as just chips).We also had the PARMESAN FRITES with truffle mayo, chipotle, ketchup & garlic parmesan dipping sauces for $5.95.  They were cold, salty and unimpressive.I was also in the mood for the FRENCH ONION SOUP with rich beef broth, sherry & melted provolone at $3.95.  I had about 3 bites and pushed it away.I know that these3 appetizers tend to be on the salty side anyway, but I got to the point (after only 2-3 bites of each) that salt was the only thing I could taste.  While we both sucked our water glasses completely dry... we had to wait 15 minutes before \"frustrating our waitress\" by asking for more water!  We apologize for being so difficult by hoping for a water refill every 15-20 minutes!The food was so SALTY that since we couldn't taste anything besides salt, we didn't bother to order entrees.  We just paid and left.I would never leave a bad review on one experience.  And I read how the managers reach out to Yelpers with bad reviews... but apparently, this isn't sticking with the wait staff.  There's enough options in this center, we will probably choose a different option next time, rather than come back in here!"], ["Tee J.", "I love this place, frequent the happy hour. cheap food. appetizers 3 something during happy hour. They also have reverse happy hour.  Staff is always top notch and friendly. Food is always good, never disappoint."], ["Shahed K.", "Overall I would give this place a four star. The servers are usually pretty good and helpful. The food is good, not great. Price of the food is decent. They used to have this thing - I didn't see it the last time I went there, not sure if they made a mistake or got rid of it entirely - whereby if you ordered something from the lunch menu, they would put a timer and make sure that your food was on your table within 15 minutes. Otherwise, the food was free. Given the fact that I usually go to Houlihan's during my lunch break, this was the perfect arrangement.I have had the Atlantic Salmon, Georges Bank Scallops, Pot Roast, Grilled Chicken, Panko Fried Shrimp, Filet Mignon, Italian Sausage Flatbread, French Onion Soup, Baked Potato Soup, Chicken Tortilla Soup and the Tomato Bisque. All of them were pretty good."]], "Byblos Mediterranean Lebanese Restaurant and Hookah Lounge": [["Dina G.", "My beau and I enjoyed happy hour: $2 margaritas, a half- priced bubbly hookah, and a brick oven Greek pizza. Marios made sure we felt right at home, and the ambiance was fantastic. We will definitely revisit Byblos with friends and family. Thank you for the wonderful experience!"], ["Jay A.", "Here's a few notes from our visit: (this is long, guys)1. I walked in a little late, after some of my party already had drinks. The waitress never asked me for my drink order. She did finally bring water at least...30 minutes later.2. My sister ordered the stuffed Cornish hen. The menu says to allow 20+ minutes for cook time. The dish came out after about 5 minutes. My sister did not like it and barely ate any...she sent it back but they didn't offer to refund her money. A couple hours later (yes...we were there for 3+ hours), we looked over and were horrified to see a tray of 5-6 cooked Cornish hens sitting out on top of a tall appliance. They were still sitting there when we left. 3. Aside from my sister mentioned above, everyone else's food took *at least* 45 minutes and everything came out at different times. My food took over an hour (beef kabobs & rice).4. My mother ordered the stuffed squash. The waitress asked her if she'd like shaved lamb or ground beef. My mother said \"shaved lamb.\" When the dish came out, it had ground beef in it. When my mother asked about the lamb, the waitress insisted, \"That dish does NOT come with lamb.\" She then proceeded to argue with my mother about it.4a. So I heard of something else that happened that night. Our friend also was asked if he wanted beef or lamb. He said lamb. When his meal was brought out...it was a ground meat. He gave the plate to the waitress and asked \"Is this ground beef?\" And she said, \"Yep!\" Then he said, \"I ordered lamb.\" The waitress then lifted the plate to her nose, took a big long whiff, and said, \"Oh yes, this is lamb.\" 5. I think the waitress knew we were dissatisfied with her service, but she did nothing to remedy it. Oh ok, at one point she came by with 2 random salads and said \"Who wants an extra side salad? They're freeee!\" as if that was an amazing offer.6. We were there so long (not by choice...that was mostly time spent waiting around for food) that we saw both belly-dancing performances (one at 8 and one at 11).7. My other sister ordered a cheese pita and french fries for the kids...these took the longest to receive. They were finally brought out around 10pm (perfect meal time for children). The fries weren't fries...more like homestyle potatoes. They were sizzling hot...so you'd think they were fully cooked...nope, when they finally cooled down and we could touch them...they were completely hard and raw on the inside. Yum.8. Everyone, except me, said their food was bland. There were lots of full plates, if you know what I mean. My food alone is where the 1-star comes from. So...if you have to go here, get the kafta kabobs I guess. But tell them eeeaasy on the onions! It was covered in raw onions (I LIKE raw onion...but this was too much).9. When we were ready to go...we couldn't find the waitress. This isn't really a big place, but she was nowhere to be found. Finally, we saw that she had emerged and was at the computer. She was there for, I kid you not, 25-30 minutes trying to figure out our checks. 10. We were charged an \"entertainment fee.\" LOL. $1 per person.------Since my food was decent, and I guess I was in a chill mood, I was ok with my check when it finally came. My total was $20, which included kafta kabobs, water, and crappy service. But...I really feel bad for others in my party who paid $100+ for horrible food that they didn't eat. No compensation was offered...so I'm gonna have to say the waiter service and customer service here are appalling. Maybe this girl was new.....but IF she was new, why on earth was no one helping her? And...her being new has nothing to do with the speed of the kitchen.... And...why didn't they care that customers hated their food? And....none of that can explain why a tray of cooked meat was sitting out in room temperature... So, ONE STAR - for the kabobs. And because I have to put at least 1 star."], ["Chris J.", "Great Lebanese/Middle Eastern food. The week day offers a buffet that includes a large variety of Lebanese dishes. The buffet changes from day to day but always has the tabouli, hummus and rice.Thursday,  Friday and Saturday evenings offer belly dancers for entertainment.The dinner menu offers a large selection of Lebanese favorites. Reminds me of the old country."], ["Yush K.", "Incredible! Best lunch buffet! Best price for lunch buffet ;)Their coffee is great it's included and so is baklava :)The kibbi is tasty and meat is very fresh.They have very tasty babaganoush and green hummus.Gorgeous restaurant ! They have an incredible hookah lounge with alley style balcony. There is also full bar ! Best place in Fort Worth!"], ["Shonda M.", "My coworker and I stopped here for lunch on a Tuesday. There aren't many options in the area, aside from Mexican, burgers, or steak. It's located in a historic commercial block and has a fabulous neon sign out front. For lunch, you can either order off the regular dinner menu, or you can get the all-you-can-eat buffet. We each chose the buffet, since it's only $8 and was quite large. It was delicious! There was a variety of Lebanese and Greek foods, including several versions of hummus, gyro meat, Greek salad, and warm pita bread. In addition, there was also several other options, including fried chicken, and my favorite, roasted Brussels sprouts. For dessert, there was also a variety of sweets and fresh fruit, including watermelon, cantaloupe, and mango. All in all, we were each very impressed. I would recommend this restaurant to anyone passing through the area."], ["Brayden B.", "I loved this place! I have been going here for about 6 years now. I love all the staff and their willingness to get to know the customer. The hookah and food are amazing. Every time I'm here I meet someone new."], ["Susan A.", "This was my first time here and we were early so it was not the least bit crowded. Service was great. It was clean, well lit, and the sound wasn't LOUD.. The Beef Schwarma was WONDERFUL.. Flavorful, tender, the rice was fabulous! The bread was fresh and hot.. I will be back for seconds! Will have to try the buffet!"], ["Aaron W.", "If you go for the buffet its ok but for dinner its about 25 bucks a person and the food is very well prepared but very tasteless. If youve eaten at any other arabic resteraunt you would not call this arabic food. Its like a good cook that had never eaten arabic food made it from a cook book. so bland such a waste of money."], ["Gowthami T.", "Ambiance is nice but the food was mediocre.  I order the chicken shawarma plate and the meat was salty and dry. The drinks we ordered were pretty crappy as they were too sugary and not enough alcohol in them. this place does have a nice hookah lounge which I would recommend but don't go here for the food."], ["Sylvia E.", "Great lunch buffet. Liked the lamb gyros and salads! Definitely going back with my lunch crowd."], ["Lauren M.", "Save your money, skip this joint, seriously. Having traveled around the world and lounged/dined at many establishments, I can say with full confidence that Byblos was by far some of the worst service and drinks I have ever had. Upon walking in, I had already stepped into the hookah lounge when a waitress with curly hair demanded my ID and for me to step back out into the lobby. No greeting, just plain rudeness. I felt like I was in trouble. After scanning my ID, she just sat at the computer so I walked back into the lounge and had a sit. About 15 minutes later, a young waitress walked in and just bluntly asked me \"Do you know what you want?\" I was dumbfounded and asked for a menu. I was handed a hookah menu only. She had no suggestions other than \"they're all good.\" I settled for the hubbly bubbly Blue Mist with Ciroc. Placing this order was like trying to talk to someone who speaks no English or else is totally lost. Was rather awkward. She ran off and I tried to flag her back down for a drink menu, meanwhile, another waitress who looked like an angry Morticia Adams came in and asked if we were there because we were bored. What? Are you criticising my choice to visit this establishment? Maybe it was an indirect sign that the night was going to suck and there must have been no other options for entertainment. 20 minutes go by and finally I am able to grab the waitress and ask for a drink menu. I got the Bahama Mamma and my friend  ordered the jalapeño cucumber margarita. We asked for specific liquors and she looked like a deer in headlights. I probably got well but paid premium. Hookah is just now arriving. Drinks take another 20 minutes and are super ugly. My drink just had a measly marichino cherry stuffed onto a Southwest Airlines looking cocktail thing sitting across the top of my drink. It rolled off the drink when I sat the cup down. My friend had a huge, hideous, dirty, and wilted cucumber slice on hers. Neither of the drinks tasted good, we're overly sweet, and I doubt there was any alcohol in them. The hookah was alright but about 2hrs in, we were way past ready to go. We asked for the check and the waitress never brought it so we asked someone else to bring it. I paid with a card and my friend paid in cash and we asked for the check to be split. Apparently this was super confusing for them to half a 50$ ticket. After one waitress said it was all another ones fault, it finally got taken care of only for my friend to be shorted by 10$. When we immediately notified them, they acted as if we were crazy and pocketed ten to try and get ten more dollars. Needless to say I will never go back here ever again. I wanted to just get up and leave about 30 minutes into my visit. Management obviously has no idea what they're doing and none of the girls communicate well, have manners or any type of service industry hospitality training. Too bad since it is a nice place and different for the Fort Worth area. This place needs to be on Bar Rescue like yesterday!!!"], ["Brennon H.", "I came here on a Wednesday.  They have a weekday deal going for 10 bucks. Then I got an \"Appetizer\" that came with 20 dishes for 20 bucks!!! Me and my date were stuffed and satisfied off 30 dollars! The lounge provided a relaxing exotic atmosphere to eat and smoke and our server, Mario, was great.  I felt like a king! Or a Malik."], ["Ben M.", "The place has a quiet atmosphere if you go in before the evening show.  The food is good, but you probably won't like everything they have.  That said, it is a real treat for me to find some food haven't tried before, and the desert was amazing.  Finally, the service was just fine."], ["Kelsie M.", "Lunch buffet is delicious! Fresh, filling, and healthy! Service was friendly and fast."], ["Pamela B.", "Went to Byblos just for appetizers. My friend's appetizer came fiirst. Had to wait 1/2 hour after he was served to get my appetizer. We were the only cisromers in the restaurant at 9:30 pm. Waiter did not apologize,  never came to refill water. Hid in the kitchen so he would not have to.face us. By the time my.appetizer arrived, my friend was finished dining.Will not eat here af again."], ["Cristal Y.", "The food portions were very generous and tasty! I had the Mediterranean salad with gyro. The boyfriend had an appetizer sampler. We had a few bites of a friend's lamb and it was soooo good! The lamb was very tender and flavorful. We went for a friend's birthday party and it was soo much fun. They belly dancer there was a great form of entertainment. She taught some of the girls AND guys some belly dancing moves. Overall, very great belly dancing experience. Thennnn, we moved to the hooka lounge! This place is  like a 3 in one! I didn't do much of the hooka, but it was nice that the lounge area could accommodate so many people. We were a party of 15+ and we all sat very comfortably. Definitely will come back!"], ["Elida P.", "Hands down the best restaurant in the metroplex!!!!  The uncompromising quality, freshness and taste of the food is simply exemplary!  I have been going to Byblos for years, and have used them to cater for everything from my baby shower to corporate events.  Aside from the most exquisite buffet, and evening dinning experience, Byblos also offers a full service catering is which is amazing!   Complete with delivery, all utensils and embossed serve-ware that you get to keep :)  The owner Marios is just a great person, always easy to work with, so accommodating and a visionary of the culinary experience, with regular Belly dancing events, wine-tastings, book signings etc.  He always makes you feel like you're family when you visit.  If there were 10 stars, that is what I would be giving Byblos.  Bravo!"], ["Donna W.", "it has a cute environment.  i'm not sure that the food is anything spectacular, but it was adequate and there was plenty of it.  $12.95 for middle-eastern buffet on a Thursday night.  that's darn good.  and they were more than accommodating of our group of 20+ people.  Apparently its a little sketchy about when or if you will actually see the belly dancing.    I went thinking that there was a show on Thursdays but sadly ... NOT.   but the parking was great, the service was adequate, the food was adequate, the atmosphere was more than adequate."], ["Kym B.", "Had an amazing time here as our first time for my friends bday dinner and hookah. Their food was good!!  We had the gyro plate and the chicken schwarma plate, very tasty and full of flavor. Their pomegranate margarita  and some watermelon martini were really really good.  Love the atmosphere and the paintings they have on their walls, great service from the manager and the cook, and hookah was pretty good as well. We had the heaven can wait hookah and relaxed at their lounge and patio. We will definitely be back :)"], ["Victoria B.", "This is one of my favorite places to eat because of the food.  The service always sucks.  It is not uncommon to arrive and be the only people there, but still have to wait 45 minutes to an hour for food.  Again, I do not go for the service, but the food.  If you are in a hurry go for lunch.  The lunch buffet allows you to try almost everything on their menu without the wait."]], "La Madeleine": [], "Flips Patio Grill": [["Nicholas D.", "Check Flips out if you want to have a fairly low key night with some friends. I've been here many times and each ones had a fairly docile crowd. I've had wonderful service here every time and the bartenders are extremely attentive.. I'm not a real fan of the food, or else this place would be 5 stars for me. Everything is mediocre and verrrry average. Everything inside is nonsmoking, but you can still light up on the patio."], ["Ron B.", "For some reason I always passed up a Flips Patio Grill. This place is pretty Awesome!  We ordered our Cheeseburger medium and that's the way we got it. It was very good. I had the Fish and Chips which were good also. Flip's Chips are some of the best I have had. Their prices are cheap.  I really like the open layout design of the Bar and all the TV's for your sports pleasure."], ["Jennifer H.", "Good music...I was suprised they had a mix of top 40 from 90's to now. The drinks were average nothing specail. There was only one server and she made sure to check on us often. I would go back to watch a game or something like that. I wouldn't not go there looking to party more like I rolled out the bed and wanted a drink and some bar food. Nothing to get dressed up for."], ["Amit K.", "Good for a quick working lunch. I personally strongly dislike the stuffed animals displayed throughout the restaurant."], ["Sarah B.", "Oh beacon of douchebaggery, shine your invariable light upon us so that we may bask among the furry carcasses adorning your towering walls.  Lavish your blessings in the form of Fireman's 4, Ugly Pug, Guinness and Blue Moon on tap(among others).  Be not hesitant to bestow tasty fried pickles upon your followers and the brewed fruits of your labor in frosted mega pint glasses.   Allow your children to fester in the moonlight on your large patio.  Forty-somethings and afore-mentioned tools flock to your expansive house to gaze upon the glory of your attractive waitstaff and your non-intrusive flat screens. We humble ourselves before your skilled bartenders for thine is the liquor, and the mister-fans, and the multiple bars forever.Amen."], ["Robin K.", "Great place to catch a game of weekly trivia... Food is okay (french fries are good). We tried the chips over the fries at first, and the chips seemed to be way to greasy :(.. Service was good, subbed them out immd."], ["James S.", "I learned my lesson and checked out the area on Yelp before deciding to head to Flip's for dinner. The genre fit perfectly since I am in Fort Worth checking out the Goodguy's car show this weekend. The spot had some good reviews. First impressions were good, the place is huge with a nice sized sit yourself patio, 2 large indoor bars, and a \"family\" seating area inside. TVs are everywhere in the place if you decide to sit inside. Jeff and I decided to  grab one of the few open spots on the patio. We were there early, the weather was great, and the patio was nearly full already. The patio looks prepared for the middle of summer when it gets here. Fans all over the place with mister attachments on every one of them. Even in the seat yourself area, the staff located us right away and were asking how they could help us. The whole time we were there, they were very attentive. We had the fried pickles to start. They were good, really sour, and not greasy at all. I went with the Suicide Jack buger for my meal. Other than the buger being much more done than the medium I asked for it was also really good. Great flavor on the burger itself and the pepper jack cheese and other peppers added a nice amount of heat to the burger. A nice touch was the toasted bun. The price was right. So if you in the area and in the mood for some typical bar/grill style meal, this is a good choice."], ["Marissa A.", "I missed my flight due to a delay and was forced to stay in the Beymont Inn.  I have never went to Texas, I gave up meat for lent, no need to be in Texas looking up for dinner options on a very late Thursday night but Flips was there to turn my frown upside down.The customer service was great, I loved LOVED my waitress, GREAT music, the customers there made me feel welcomed as well- very cool people- the only bad thing was that everyone smokes (I am sorry viewers, in Philly and in Cali- you cannot smoke in bars/restaurants) so I was forced to move to the patio which was still a great experience.  Flips has big flatscreens and a huge fireplace outside, I didn't mind sitting out there at all.  Since I couldn't eat meat I had a Tilapia sandwich which was really great!  In addition I ordered a side of nachos and cheese YUMMMM, very fun to dip my entree in to the cheese.I am only rating a 3 because the drinks were A-Ok, nothing too special about them, kinda watered down if you asked me.   The worse Long Island ever, they make it with Triple Sec instead of Tequila...how can you leave out the Tequila?! My 3 is a strong 3.....so I still recommend this place.Overall, good time, I would love to visit the area in more detail next time.  ENJOY!"], ["Dirk N.", "Been here a few times and it's, like my Yelp rating shows, it's an A-OK place to go for a beer or meal with some friends.Their burgers are really, really good, fries are OK and fried pickles are pretty tasty. Wings are solid as well.Service is great and pool tables are also fun, so I'd definitely recommend them. But I wouldn't go by myself."], ["Marla K.", "This place is perfect if you are looking for a good happy hour joint!  I'm not a huge fan of their food but did have a decent salad (the santa fe one).  It's a huge place so great for a big work group or a quick informal dinner."], ["Jeff A.", "I've been to Flip's quite a few times and we always have a good time. It can get quite crowded on the weekend, especially if there's a game going. This of course is expected with most places. There's a huge Nebraska following here and you always see a bunch of die hard Nebraska fans which is always fun.The wait staff is great, we usually play pool and eat on that side of the room so we usually get Rose or Jaclyn, who are both excellent. Drink prices are relatively cheap but lately it seems like they have been pouring light. Last time I was there I went through 5 Long Islands and 7+ JD & cokes. At most places I would be pretty bombed after that much but I walked out there just slightly intoxicated.Pool prices are the standard shitty $12/hour that you come to expect from any place that rents by the hour on the weekend. The tables themselves are good quality, the felt on most of them could use a change though. The house cues are of pretty solid quality.Overall we like to come here for a casual night of drinking and pool playing. If you are looking to chat up the opposite sex, there is plenty of opportunity for that, most of the clientele past 10pm is more young then old."], ["Dawn K.", "First of all I need to clarify that the bar is the worse place to sit in this restaurant. I have been here quite a few times, each time thinking...well maybe it was just the time I came. The service in the bar area is extremely poor. For some reason no one wants to pay attention to you. I always feel like I'm being a burden by needing the another drink, or even my check. I guess you have to be a \"regular\" to get good service. On the other hand usually when we sit on the patio or in the rest of the restaurant the service is quite adequate. You don't have to get out of your seat to find someone to \"wait\" on you. However, the food is really good. My husband orders the bacon cheeseburger with natural cut french fries and thinks it's one of the best burgers in DFW. I get the french dip which is also probably one of the best in DFW. I just hate getting irritated every time I come here.Best advice.....don't sit in the bar.  Such a shame....I love bars!!!"], ["Lovey M.", "This bar and grill not only has the best patio and live music around, they have the best staff in town.  The food is always great and the staff is friendly, knowledgeable and happy! Management dies a great job of keeping all the football games on and spread throughout the restaurant.  This place gives me the \"cheers\" feel every time I walk in.  If you are looking for a GREAT burger or just a GREAT place to watch the game and have a drink, Flips is your place! I would recommend it to anyone!"], ["Matt P.", "Good food, good service, awesome cold beer.  Plenty of TV's to watch any game.  A place you have to go...."], ["Michael W.", "It's NBA playoff season (GO MAVS) and for game 2 against the Spurs (Booo) my friend and I needed a place to watch. This was my first time at Flips, and I was immediately impressed with the layout. As you walk up to the entrance you see a good sized patio with a lot of bar-height table seating. I didn't see many TV's outside so we decided to go inside. Closer to the entrance doors you will see on your left that sliding glass doors are open and you can walk down a couple stairs to get to the bar. It gives a great open and welcoming atmosphere. Inside of Flips, tables are spread out nicely and there are TV's everywhere for prime viewing of various sports. I ordered a beer, fried pickles (a signature appetizer) and the BBQ Bacon Burger w/ chips. The pickles were just ok. There wasn't a ton of flavor in the batter, and just having ranch to dip didn't help. I also think the slices where just a bit too thin because many of them were shriveled up once they came out. I would probably pass on these next time. The burger was juicy and delicious. It was delivered medium as ordered, BBQ sauce was plentiful, and veggies were fresh. The bacon was piled all crumbled up, though not as overflowing as Snuffers.  The chips and fries at Flips are made in-house and you can definitely tell. The chips are crispy with just a bit of oil left to let you know they're fresh. I tried some of my friend's fries and they were good as well with that fresh hand-cut taste. Between the two of us the bill was roughly $35 total for two meals, and appetizer, and two drinks. So it was about what I was expecting. I also want to complement the hostess and waitstaff who were both very friendly and attentive. Be aware that this place didn't seem to have a lot of parking, so if you're going on a busy night, try and get there early or you'll be parking on the street.  Luckily we found a spot right up front so I can't complain about parking on my visit.I will definitely have return visits. Go MAVS!!!"], ["Tony B.", "Decent burgers, never been during dinner only lunch."], ["Bob F.", "Nice place outdoor (open) seating, menu has an assortment of entrees and appetizer.  I had the Carnivore. The prices are reasonable. This night they had live entertainment (there's nothing like good live entertainment). The outdoor seating was busy and the wait staff seems to wait table timely and were knowledgeable about the menu items offered if you had questions.  One outdoor large screen for the sports fans who like baseball, I'm not sure if the offer any NASCAR fans and option if the races were being broadcasted on the patio.  I really enjoyed the patio area each time I visit Flips.  Drawbacks: They have to take you driver license for some reason if you want to purchase any alcoholic beverages, something to be a club member. It always makes me nervous when some takes you ID and you loose sight of it as it's too easy to have your identity stolen. Another draw back is I'm a non-smoker and the smokers dominate the out door patio area, so there is no place there in the patio area that the drift of the smoke can't get to you. So if you want a smoker free environment this is not the place for you,,, but i if you can tolerate the occasional smokers drift... you can have an enjoyable experience."], ["Jonathan A.", "This location is closer to my house, while the Grapevine spot is closer to work.  I went to this one last winter, and they allowed smoking inside, in the bar area.  Not sure why it changed but it doesn't seem to have effected business.  I haven't been here in a few months but when I did go it was still pretty busy.I haven't sampled the food at this location at all, but the drinks have all been good.  Also, they have really good pool tables that you pay for by the hour."], ["Diana E.", "SCENERY: Holy cow is this place is like a dark lair of hugeness. It's dark, even in the daytime. Don't fear, there are no vampires, but only really DEAD giant animals everywhere. For a minute I thought I walked into Ted Nugent's house. The animals were real at one time and were bought from a museum. (I know that is a fact, because the little girl I was eating with HAD to ask the waiter, to my happiness) I have also been to the Flips in Grapevine, but this place in Fort Worth is new, big and pretty cool. FOOD: EVERYTHING IS GREAT. I suggest the Turkey Avocado sandwich, and you don't have to bother with fries unless that day you want fries. The chips are HOMEMADE. They are so yummy. Get a side of ranch to use to dip and you might reach heaven. They also have a small size cheese fries, which is nice when you don't want to gain 10 lbs. in one night. I happen to be a connoisseur of this dish, and I have to say it wasn't bad. They also have nice lovely salads. The queso is all right, I have had better. SERVICE: The service was great. Nice waiter, and he was good looking and that never hurts in my opinion. He was helpful, knew a lot and didn't forget to bring me a side of ranch. Good call. He also talked to the little girl with me, very nicely, and politely. I respect waiters who do not want to kill children. Sometimes, I think I would. He also filled up my pop without me asking. I don't like to go thirsty. COST: It's not bad. It's not too expensive, and the food is good. I know that they have $2.00 happy hour pints, and that is steal in this town. The Fort Worth and Grapevine location also have a nice patio, but I won't enjoy it until it's not 1,000 degrees outside and constantly sunny. Why sweat when you can look at a giant elephant instead? Overall, a good place, small and upcoming chain perhaps."], ["Angel W.", "As a bar, I give this place 4 stars, but due to the food, I'll drop it down to 3 stars.My boyfriend and I walk here often for drinks. Walking, it's less than five minutes from our apartment, and it's always packed on Friday and Saturday nights. It's definitely a good place to have some drinks when you don't want to go downtown or too far out of the way.As for food, my boyfriend and I actually went to Flips our first time to have dinner. I ordered a burger and fries while my boyfriend ordered... well I don't remember now. Regardless we both agreed that the food was overpriced bar food. The prices reflect that of other adjacent restaurants, but the food doesn't live up to the same quality. More recently we shared a plate of bacon cheese fries with some friends and I didn't like them at all. They were so saturated with grease that they had no taste, other than grease of course. I can't believe something COVERED in delicious cheddar and bacon bits, had no taste! If I eat anything else here, it will have to be a sandwich or something I suspect won't be ruined by grease.I definitely recommend this place for drinks, but not for a quality meal."]], "Citrus Bistro": [], "Saint-Emilion Restaurant": [["Picaboo S.", "This is no doubt one of the best restaurants in DFW. It is authentic to a T,starting with the standard french Bon soir greeting upon arrival.  We had 2 specials, a lobster gnocchi and the skate (fish), both delicious. The gnocchi was the perfect consistency and the lobster, was well, lobster, but a generous quantity. The skate was crisp on the outside and perfectly moist on the inside with a delightful beurre blanc sauce.  The roasted buttery potatoes alongside it burst with flavor.  We also had the house salad, which was very classical french, dressed in a Dijon vinaigrette, and the roast duck, the oldest selection on the menu.  My husband who doesn't normally eat poultry skin was happily eating the crispy honey coated skin.  The surprise was the french fries that were soaked in the orange vinaigrette the spinach was tossed in under the duck; so yummy!  We ended with a lemony creme brûlée, creamy with a perfectly bruleed top.  This restaurant is fantastic.  My only complaint, but not really a complaint, is that the atmosphere is just not my style, a little too white table cloth for me.  I think we can remedy that by eating outside!"], ["Gary M.", "Third trip to Saint-Emilion in thirty years, once for each anniversary, this is one place you will always receive good quality food and service, in wonderful surroundings. What more could one ask for from a special place to dine."], ["Brandy A.", "Such a great dining experience. The alcohol selection was fun, the waiter was professional and conversational, and the courses were perfectly timed. The steak tartare portion was enormous. I had duck 2 ways with wild rice, as well. The rice was not very good at all. I didn't eat any of it. The confit was just a smidge salty for my liking. The raspberry tart was outstanding. Although the food wasn't spectacular, the experience more than made up for the shortcomings."], ["Audrey B.", "This adorable little restaurant know what it is doing. When you walk in, you get the star treatment from being seated to being presented the night's specials on the board placed right in front of you. The food was perfect, specifically the braised pork belly. Fell apart in my mouth! Very tentative service, lovely atmosphere, and wonderful food. Must try!"], ["Prince H.", "Small and full of French charm. I have been eating here for years and it is just as good today as ever. As good of scallops as I have ever had. Both ala carte or fixed price menus are available. Want to try it on the cheap? Tuesday and Wed has an amazing deal of rotating menu of three courses for $25, even discounted bottles of wine for$15. Just order before 7:30. And dress up for gods sake."], ["Lara S.", "Really good food with service to match. Tucked away and cozy, Saint-Emilion has certainly earned it's reputation. The dining room sparkles with conversation, the menu offers many combinations and possibilities, and then there's that fancy iPad wine list. A great touch and really quite practical when you stop to think about it.Between the four of us, we ordered from three different menus: the bistro menu, the menu classique and the menu du chef. Like I said, there are a lot of possibilities when dining at Saint-Emilion. In my opinion, the food does live up to the restaurant's Zagat rating. On Tuesday and Wednesday nights they offer a 3-course bistro menu for only $25. This is a great deal! Check out the website weekly to see what's being offered and be sure you make a reservation. The place was packed the night we dined there.Lastly, service is prompt enough. This is a meal to be savored, not plowed through.  After all, leisurely is the French way."], ["Shana L.", "My husband heard about this place from a coworker just a few months ago, and thankfully we had our anniversary coming up, so it was the perfect excuse to try a new fancy restaurant. I checked out the website and saw the $25 menu on Tuesdays and Wednesdays and the budget-minded part of me went from disappointed to excited that our anniversary fell on a Tuesday this year.That said, we didn't end up ordering the $25 dollar menu (fixed 3-course menu); it was too much fun to browse the entire menu and order all the things I'd heard about but never tried.  We ordered a ton of food, but we wanted to try it all! For appetizers, for example, we both had a taste of caviar and we shared steak tartare and escargot! I love fish, so I was very happy that they had several options as Fish of the Day. My husband was thrilled that they offer a cheese plate as a dessert. (I stuck to a classic sweet dessert and was not disappointed!)We ended up going back again recently for another occasion and again had a wonderful meal. This time we fully trusted our waiter for recommendations, so I don't even recall all that we had; I just know it was all wonderful! Near the end of the evening, the chef came out and spoke with each table; he was so personable and fun to talk to!All in all -- interesting menu, great food, great service, and great atmosphere. Expensive but worth it."], ["Le L.", "Whoever makes the reservation is the rudest jerk in the world. I have eaten here many times, but never again."], ["david w.", "this review is sad to write.  we've been eating at St Emilion for 8 or so years.  it's a special place for us - valentines, graduations, birthdays, wedding proposal and our 3 year anniversary.  we have a lot of great memories at this place, but don't think we'll be back.  they allowed people with shorts in the dining room.  our waiter last night was clueless.  she didn't know the menu and food.  she didnt listen.  't had to pour our wine, ask for water.  the table next to us told the same server they didn't drink.  she brought them two glasses of champagne to celebrate their anniversary.  they said, thanks, but we told you we don't drink, we are alcoholics.  we started with the lobster bisque  it was ok.  needed salt/pepper.  next was escargot and tartare.   both were ok, not great like we had remembered before. then we had the halibut and lamb.  the halibut was overcooked and dry.  the food just wasn't well seasoned.  ok.  not bad, but not great.for dessert we ordered the tuile and brandy alexander.  the brandy alex is incredible.  they have changed the recipe on the tuile.  it's good, but not as great as it use to be.sadly, goodbye st e,  time for us to find our new special place."], ["Jelena B.", "Sophisticated, charming and romantic all in one little French room. We had dinner with friends, he told us it's easier to get a reservation if you can make it for 4 people. I had the halibut, it was good but not the greatest that I've had. The scallops were delicious, I was trying to be polite so I only had one, otherwise I would have eaten them all! Interesting menu options and it is good French food. What won me over was the wine - it was the best red I have ever had, and I'm glad to share it with you. If you can, split the bottle of  the CLOS du MARQUIS 2009, Bordeaux."], ["Sam V.", "Special occasion for mothers bday and parents really enjoy this restaurant.  Disappointing evening.  Ran out of Sea Bass at 6:30, no flavor with the red fish or potato leek soup.  Sole was good.  Most disappointing was how we were rushed through the entire meal.  We will not return, too many other fine restaurants on 7th."], ["Jeff G.", "The absolute best french restaurant that I have ever been too, and can't believe that it is in Fort Worth Texas. It is a hidden little gem of a place. They food and service are amazing make sure that you take a big appetite and try all kinds of food. The dress code is very formal, and the crowd that typically goes to dinner there is older and more formal, but this is a terrific place for a romantic dinner."], ["Jovan V.", "Charming atmosphere, wonderful food, it's no wonder they have been around for 28 years!  My only complaint: please add a soufflé or two to the menu. I would have loved a traditional chocolate soufflé, or perhaps crepes Suzette.  The desserts don't live up to the appetizers and entrees! Perhaps that's because I am a stickler for classic French desserts. The apple brandy tart was way too mushy, like eating baby food. On a positive note, the beef burgundy was fabulous and the lamb with gnocchi was memorable. Large portions, so you DO get your money's worth.Still I would have loved to end on a perfect note with dessert, which is why I am withholding one star."], ["Braden D.", "Fantastic food and okay service.I will definitely be going back to Saint Emilion's.  Our table ordered a number of different dishes: rabbit cooked with bacon, lamb tenderloin, escargot, sweetbreads and nothing about the food disappointed.  We were also very pleased with the wine pairings suggested by our server and the sommelier.I had only two small complaints with the service: First, our server came back to the table with suggestions from the sommelier to change the wine we had ordered because another might compliment our food better.  Fair enough but I think suggestions should come before the customer places the order.Secondly, we were sitting and enjoying our leisurely meal and got the impression that the staff was encouraging us to finish our meal, hit dessert and make the table available for other groups coming in.  If we want to take our time talking over coffee and dessert, that should be fine.  Nothing overt was said to us; its simply the feeling I got from our waiter's frequent returns to the table asking if we needed anything else.Like I said, very minor overall compared to the overall experience.  We had excellent food, and the owner's son proposed at the table next to us making for a very festive atmosphere.  I'll definitely be back with my girlfriend when we have something to celebrate and want to treat ourselves."], ["Brock P.", "Great food and service.Staff is very attentive and caters to your needs without being intrusive."], ["Kevin N.", "I'd actually been rather lamenting lately the idea that Fort Worth didn't boast a top of mind French restaurant, and I'm definitely pleased to correct that assertion. Saint-Emilion, tucked into a quaint house-like space along the narrow recesses of West 7th, bore a number of pleasant surprises on my stop in this week, and I was pretty jazzed to make its acquaintance. Know that they're unbowed at the prospect of getting to know your Benjamins -- each entree rings at least thirty bones -- but the specials are interesting, the soup and pate intriguing, the service warm and efficient. Though the prix fixe house special sounded inviting (steak frites with a mousse chaser) I ended up having my way with the Magret De Canard Fort De France, a seared Moulard duck breast with a golden raisin and rum sauce accompanied by roasted cauliflower with duck confit. It was as divine as it was filling: I entered fully intending to go three rounds with dinner, including dessert, and the tray looked terrific. But there was simply no place for additional food to go. The iPad wine list is a special kick (and awesome, I kind of wish all restaurants did this, but this one really stood out because it did), and the duck charcuterie plate was a great advance on the main course. Its spendy enough that I won't be back particularly often, but I'll definitely be back."], ["Greg S.", "Had a 30th birthday dinner for our daughter and friends. Could not ask for better food, wine or service. Great atmosphere, not as stuffy as The French Room in Dallas, but equal or better food! We can't wait to go back!"], ["Jarrod H.", "It's nice to know there are still exceptional dining experiences outside of the city center. Not just Fort Worth's best French restaurant, it deserves to be ranked among the top regardless. The place has wall-to-wall charm and every step of the experience is handled well. Hard to not like a place where the management and chef make separate trips to check on you.Beyond all the provençial courtesy, you'll want to notice the wine offerings, and don't be afraid to consider the half-bottles. The chalkboard menu usually has the best offerings but there's nothing to scoff at the table menu, either. I can't imagine anything that comes out of their kitchen could disappoint. In fact, this is one of the few places where the food that arrives at the table usually exceeds expectations and pleasantly surprises. A few details: chocolate lovers shouldn't feel disappointed when they see the dessert tray, the kitchen can make a molten chocolate dish that's pretty great, although you might want to order it when your entrees arrive. The only time I've had anything close to a negative experience is when we were once seated next to a VIP who manipulated most of the staff's attention. Can't fault the business for that, but beware the risk."], ["Jenn K.", "I first heard of this restaurant from a \"roundabout\" way on television.  The first season of The Great Food Truck Race on Food Network featured one of the food trucks using this business as their wholesaler to obtain specialty ingredients for the competition when visiting Fort Worth.After 2 years we finally got around to going.  I told my boyfriend this was where I wanted to go for my birthday.  It is an understatement to say I was thrilled with my experience.The restaurant is tiny and very intimate.  The seating is very close together, by intimate, I mean you will be very near every other table.  The food was excellent!  The menu is classical French cuisine but I chose the rabbit off the blackboard special and was not disappointed.I'm hoping to go back soon.  Tuesday and Wednesday the restaurant offers a prix fixe  menu."], ["Isis H.", "We received a lovely gift card to Saint-Emilion from a great friend of ours earlier this year. I was pregnant at the time and wasn't really adventurous when it came to dining. After having the baby, we were extremely busy and it wasn't until last weekend that we felt comfortable having a \"date\" night. Right before we went out, I noticed the gift card had an expiration date of Sept 22nd. I was crushed... I called the restaurant and let them know of our dilemma. They said \"It's no problem, come on in.\" My face immediately lit up and my husband and I headed over. When we walked in, we were greeted by the manager (owner?) and the wait staff. The atmosphere was quaint and very romantic. We were seated and were immediately greeted by our server and served water. For starters we ordered wine, scallops (SAINT-JACQUES du CHEF) and a CRABE RAFRAÎCHI AU PAMPLEMOUSSE. For dinner we ordered the Artic Char and a Beef Tenderloin.  For dessert we had coffee with the GÂTEAU au CHOCOLAT FONDANT, TUILE aux MÛRES and Crème Brulée. Everything was absolutely delicious! I will warn you that we aren't true French eaters...we don't go for the duck, rabbit or caviar. We played it safe and enjoyed every bite."], ["Solomon W.", "It took me 3 weekend calls, but I finally made it on the reservation list, and I was pretty excited.  The atmosphere is very cozy and inviting, but I left fairly angered.  I would give the food here a 4, maybe a 4.5, but a bad incident near the end, which I will later talk about, really made my mother and me angry, forcing me to give it no more than a 2.  Anyways, the food was either a great hit or fairly ordinary.  We started with beef tartare and their scallops.  Beef tartare was flawless, as it was the perfect tenderness and texture.  It also had a nice tang and bite from the capers and maybe some dijon. On the other hand, the scallops, which are apparently one of their top dishes, were fairly plain, though they did cut like butter.  They were served with a simple butter sauce and some simple julienned veggies.  We then had the french onion soup and the beef short rib salad; both were nothing too special.  The soup had a nice beefy flavor, but the crouton and cheese were too large and pretty much soaked up all of the soup, leaving a saturated piece of bread with some runny Gruyere.  The salad had nice components, but nothing blended together.  The short ribs were really chewy and were not braised to perfect tenderness.  Roasted tomatoes and grapefruit segments were nice touches, but all of the pieces didn't complete the puzzle.  For the entrees we had the roast duck with black currant sauce and the lamb chops.  The duck was disappointing, as the meat was perhaps a tad overcooked, thus making the meat a bit tough.  The sauce was a nice complement though.  It was served with some mediocre sauteed veggies, haricot verts, and a blue cheese potato casserole.  I must say though, the lamb was probably the best I've ever had.  It just had the perfect taste, tenderness, and even a hint of real gaminess.  Normally, gaminess overpowers a dish, but it really worked well with the strong demiglace served with the lamb.  It was served alongside haricot verts and Israeli couscous.  The couscous had nicely seasoned ground lamb in it, which made it interesting.  So, lamb was the real gem of the night.  Overall, the service was great, except at the end when the ticket came...  On comes the venting/complaining.  So the male server we had told us that an entree/appetizer combo comes at a set price, and that our entree also comes with a soup or salad.  The female server changed this on our ticket, charging us for an a la carte soup or salad, putting an addition $11 on the bill.  Though my mother and I know to pay for what we order, we were still extremely bitter about the way of calculating this miscommunication; we don't expect to pay for excess when it is not what we originally wanted.  We could have easily passed on soup and salad if we knew that it was extra.  She was adamant about this, and despite being nice the whole night, was a bit rude because in this case, \"the customer is not always right, apparently.\"  Thus, the night ended on a sour note, and we left extremely frustrated.  Come for the food, but watch out for the pricing system; it is fairly flawed, and pricey."]], "La Madeleine French Bakery & Cafe": [["Stacey S.", "I came in for a simple breakfast. I ordered the American breakfast--2 fried eggs, 3 strips of bacon, and a croissant. I also ordered an American coffee, simply because it was the closest to breakfast blend. The cashier, Jolene, was so sweet and helpful. She helped me with my coffee order and was so polite. As I waited for my meal, I grabbed some French bread and my coffee. The bread was delicious. The coffee was just right. Though, I wish they had a sugar shaker instead of packets. I loved that their cream options were liquid: milk, low fat milk, and 2 canisters of half-and-half. Charlie brought me my meal. He was so polite. I loved they added a little slice of tomato. Pardon my French (lol, pun), but fuck yes. I love tomatoes. I sprinkled on them and ran a train on them. The eggs were great. Most places have so much grease, but it looked like the chef used a minimal amount of a less-non healthy oil,  like peanut oil. The bacon had ZERO grease. AMAZING! It was so crispy, too. Parfait! As I left, I filled up my coffee to go. Charlie was filling up little cups of jelly to go. I joked and asked if we were going to do shots. The fact he chuckled shows the employees aren't robots like other French restaurants. I would recommend if you're looking for a quiet place to sit down and maybe chat with a friend."], ["James S.", "This la Madeline is pretty much par with the others.  I wish they didn't try to speak French because it always seems lazy and half-hearted.  I have a French foreign exchange student and took French through high school and college so maybe I'm jaded.  They generally have a good selection of bakery items and the typical pasta, salad and sandwich mix of a bistro.They offer complimentary bread with blackberry and orange marmalade.  Sodas or brewed tea if you so choose.  I come here often enough to say I'll hold off until I'm craving it again.  It's not bad but not great..."], ["Faila M.", "This location is near the Dallas Cowboys Stadium. I went on a Sunday around brunch time 11:30 a.m. ish and it was super busy! It was my first time here and I was quite confused on how everything went. I had to go look for an employee just to help me figure out how to order, and ask if it's open seating and etc. I actually told myself inside the restaurant the next time I come I'll have to definitely come when its much slower and less people there. The food was actually great tho despite all the noise going on. It would be a great place to take the family. But in my opinion not somewhere you would want to carry a conversation. It's loud and such tight space. While having brunch I kept on having to ask my cousin \"say that again\" Lol it's better to go there to eat and get right on out, or order it and pick up!"], ["Stephanie R.", "This location is nearby and very convenient. We go here frequently because we love their soup and the food in general is consistently good.The service can be hit or miss there, though. For a long time, it was top-notch but has kind of tapered off into being sort of \"meh.\"I think the driving force behind the over-the-top service was a manager who I no longer see in the store. I hope it's because he got promoted because he was amazing, but once he left, so did the amazing service."], ["Shelly E.", "I have been enjoying La Madeline's since 1990.This is the only horrible La Mad.Only good thing I can say is the service is reliable-always horrible and you can count on not getting what you order or pay for.Consistently s l o w, everyone is in a fog running around with plates of food in their hands trying to figure out who's food goes to what table( all the while, the plates getting colder by the minute).  Half of the time, someone in my group leaves having never been served and has to get their $ back.If you want to see how to not run a restaurant, check it out."], ["Robin M.", "For a quick fix of delicious and affordable french food I go to this La Madeleine. Food is always consistently good and the customer service here is amazing. With a variety of dishes to choose from like salads, soups, and sandwiches you cant go wrong!"], ["Pilar G.", "Worst service  ever 25 minutes  for a sandwich very rude never coming back , dirty place"], ["Terry G.", "I've been a fan of La Madeleine for years and years. You can order from the menu or get premade items from the bar.Try the Chicken Friand it's the best. The Chicken Friand is a puff pastry filled with a chicken and mushroom filling. Light and flaky, it's soooo good. Also, get the Mushroom sauce on the side. This will keep the Friand from getting soggy (plus you seem to get more sauce YUM YUM)I also love their French onion soup. Everything I've had here is great.This place is on the pricy side but every now and then it's worth it to treat yourself."], ["Josefina C.", "Worst service to date. I've been to this location before. In the past they have forgot to add either the chicken or the dressing on my grilled checking Ceasar salad. Tonight I decide to try it again after a year. Took about 5 minutes for me to pay for my order, and 40 minutes to in order for them to hand it to me. But the cinched is that 6 people ordered after me and they all got their orders before me. It's not hard to get salad right. Well I guess in my case it was. Not happy"], ["Yolanda M.", "Dessert, dessert, dessert. Yes I love dessert and I love La Madeleine.  This is by far my favorite location.1. Close to home2. Staff is always friendly3. Food is always good4. Never overcrowdedThis location really doesn't stand apart from any other because I've only had one bad experience at La Madeleine and they made up for it. They have the best budget friendly French Onion soup around and you can't go wrong with it unless you don't like onions or the French."], ["Miss E E.", "First time here..: chicken friand , caramel macchiato and mushroom soup were delish!  highly recommend this place !"], ["April K.", "I absolutely love this place. I have only ordered to go a few times but each time the staff could not be more accommodating or friendly. This time I ordered two entrées versus the usual sandwiches and chips. We had a shrimp pesto pasta and mushroom chicken with rice and broccoli. Both were fantasic. Great place to go for affordable yummy food for dinner, lunch, or breakfast!"], ["Sandy L.", "What is mot to like? Fabulous soups..great salads..esp the spinach salad.  Famous for their roast chicken with rosemary and worth it..wild rice yum.Gotta try the coconut cake."], ["F R.", "I have frequented this restaurant many times and it WAS always good...until recently. The last two times I ate here I found hair in my food. Once in my breakfast and the second time in my salad.  I'm done."], ["Ashlee D.", "The coconut cream cake and lemon tart are delicious. Not the cheapest (took away 1 star) place for dessert though, but worth it."], ["Susan S.", "TYpical La Madeleine. Good food, yummy desserts, nice drinks. Consistently good."], ["Tiffany S.", "This review is on the dessert only. La Madeleine has great dessert! I went in because I had a taste for something sweet and hit the jackpot. The fruit tart and strawberry cheesecake parfait were just what satisfied my sweet tooth. We were greeted promptly after entering the restaurant and the staff was patient while we made up our minds. I will definitely be back for the bigger fruit tart and more cheesecake parfaits very soon!"], ["Jessie B.", "Not sure if it was just because I got take out breakfast... But the omelet wasn't good and the potato/hashbrown was so greasy. I was sad :("], ["Jonathan M.", "I had not been to La Madeleine for over a decade; it will be at least another decade before I return again.  I ordered a blueberry muffin and some madeleines.  The muffin was great, Madeleines should be avoided because they taste like something from the Walmart next-door.  Using lemon-scented soap with your kitchen sponge would be just as good.  Also the service left a great deal to be desired, for instance friendliness and courtesy.  The lady manning the counter had none.  I was 7am, if I don't want to deal with customers at 7am...well I don't take a job that requires it."], ["Becky F.", "I recently met some friends here for breakfast (as I always do every home game)  and afterwards, jumped into 1 car to go to the game. Upon returning 4 hours later, my car was gone.. towed.  The towing company said that the Manager on duty called it in. After following up a couple of days later, I am getting the run around. There are signs that say no parking if you aren't doing business, but NO SIGNS stating you can only park there for a certain time period after you eat.  I was a huge fan of la Madeleine, but not any more.. great way to treat loyal customers."]], "Mash'd": [], "Rodeo Goat": [], "MAX's Wine Dive": [["Patti W.", "RUDE!!!! 9 of us finished a 15K and came here and wanted to sit together. They wouldn't let us move a table or move chairs. The guys response was we could either sit at 2 tables or leave. We left. Went to Boomer Jacks and had a great time! Never will go there or recommend it!"], ["James H.", "Tried for first time.   Great service.  Waiter very knowledgeable.  The accommodated us by doing one piece of fried chicken gluten free.  Burger b.o.b style very good.  Wine picked by waiter very good.  4 stars due to strawberry shortcake wasn't great.  Ice cream was good but cake fell short.  Will be back."], ["Sheryl C.", "Totally LOVE this place! Were recommended to it and loved it so much we brought friend the next time! Sunday brunch is wonderfully priced, as is their beer & wine! They run daily specials too. Try them, you won't be dissapointed in the flavor & variety of choices you are given!"], ["Somchai I.", "im not sure if i got the best experience at this place i really wanted to like this place. i tried a sample of their food at the fort worth chefs event and i thought omg i could die right now and id be okay with it haha okay dramatic but it was that good. then i went in for dinner and i thought i was ordering what i sampled but it was not it haha.i had the fried chicken. it was pretty good but it wasnt begging me to come back for more and order it again. i loved their portions it came in though, 1 breast 1 leg 1 thigh collard greens were prob better tasting than the chicken? and the mash was just there. the honey syrup was great. the egg sandwich was pretty good i actually wish i had that instead which is strange haha. i think the lunch dinner and brunch menus are different ill have to give it another shot.im afraid of trying new wines cause well i hate wine haha so the waiter did try his best to push some wines for us but we were just to scared so i just ordered a pitcher of sangria."], ["Robyn R.", "One of my absolute favorites in Fort Worth! Great for a girls night since everything is shareable, sit at the bar top and Stefon won't steer you wrong!"], ["Penny L.", "THE BEST!We had the lemon blueberry French toast amazingly delicious - they also half size which was perfect for me. The fried chicken is everything yelpers say about & I don't usually like fried chicken. Can't wait to go back!"], ["Lauren S.", "After last nights fabulous dinner, I feel the need to update this review. Max's never disappoints. I've been here for brunch, dinner and now 2 of the special events they have thrown. Last years Great Gatsby themed NYE and this years Alice in Wonderland dinner. I love that the restaurant gives the chef creative freedom to conceptualize these amazing meals for us. Last nights themed dinner was no exception. The wine pairings were lovely. The story between courses had us cracking up and finding a deeper appreciation for what we were eating. Even with our party having gluten free and non pork eaters, everyone seemed to love the food. You know a meal is good when everyone stops talking. You can always expect something creative from Chef Stefon. Whether it's these themed events, the seasonal menu he has, or the weekly specials for brunch and dinner that you find posted on Facebook to tempt you in the doors. I know I am gushing, but I can't say enough. The service is always great. Thanks Lyn! I always try a new wine, or something I wouldn't normally order, but I trust my server :) She makes great recommendations. They have even started to offer a service industry brunch on Mondays. That is awesome. Check out the happy hour menu. Come to brunch. Bring a group for dinner. Just get here fast. You are missing out. Max's has made a lovely addition to Fort Worth and it's hands down one of our favorite places to dine."], ["Tony S.", "Pretty neat little place to come have brunch.  All of our food was really good.  And the wait staff was knowledgeable and friendly.  It's a dark, little wine bar.  But the atmosphere is fun.  Good place to stop by when you are in the area."], ["Brian J.", "Positives:  Fun menu, great food, immediate seating at 12:15pm on a Sunday.  Accommodating of nut allergy.  Beautiful patio.Negatives: Service was s....l.....o.....w, and not very friendly.  Little things like drink refills or lemon for iced tea were apparently not possible.Prices are pretty steep for what you are getting.Location is a bit hard to find, for what I'm guessing they pay in rent, it is a mint of a maze to get there.  Too many great choices in the Fort, will probably not try them again."], ["Ben G.", "When it comes to weekend brunch this is where we go and where we take family/friends when they are in town.  Split the fried egg sandwich (feeds 3), order of the current french toast, and a piece or two of the fried chicken and that will feed 3-5 adults and allow everyone to try a little of everything.I highly suggest you make a reservation unless you want to wait when you arrive.  Nice small patio if you'd like to sit outside but not much of a view.This place always delivers so check it out and take my advice on what to order above.Enjoy yourself!"], ["Bob A.", "You'll love it. Just go !!"], ["Damon D.", "MAX'S Wine Dive in Fort Worth is truly a magical tour of hade-made dishes, made in a scratch kitchen prepared by a VERY talented Exe. Chef, Stefon Rishel and served by the ultra-knowledgeable waiter Aaron. As soon as you rare seated you are greeted and the menu is shared and explained (yes explained) to you. I say this because where in the world would you start of a meal with appetizers like Fried Bologna Sliders or PB&J Wings. Once explained that the bologna sliders come with a hade made onion jam and house made Cheez Wiz, you know you are in for a special treat.Ok, you are saying, but what about the wine. I have been collecting and tasting wines from around the world and I have never seen a wine list quite like you will find at MAX'S. Oh, and they will be more than happy to let you have a taste of something to help you make a decision. Here is another delightful custom at MAX's. They sell by the glass or bottle but if something in a bottle is more to your liking they will open the bottle if you buy and minimum of two glasses. How hard is that?I could go on for hours about our experience there, but better you go and find out for yourself. So right now you are thinking, this has to cost one pretty penny. NOPE! The prices at MAX'S are a bargain and I mean BARGAIN. So grab your best friend(s) and go as soon as you can. The have tables for two to tables for many. Call ahead and make the reservation, ask for Aaron because you won't believe the level of service and knowledge you will receive."], ["Emily O.", "I took my mom here, and we had a great time! Cool atmosphere and great service. They have a really good happy hour, and I enjoy their house wines ($5 a glass during Happy Hour). If you go, you should definitely try the Chicken Dinner Meatballs. Two thumbs up for Max's Wine Dive!"], ["Shirley F.", "Had Baked 1/2 Chicken Dinner. With red bell pepper, ocra and mash potatoes blend. Loved it. Nice confort food and low on sodium when you ask. Im from Chicago...and this was a fantastic taste!!!"], ["Kerissa B.", "I am always pleasantly surprised when restaurants have gluten free options. Generally, I can eat meat/veggies in most places. Especially, if I know it's a nice restaurant like this. But I'm always FLOORED when it's something super delicious that I don't often get to eat like FRIED CHICKEN. Get the Max's fried chicken. Gluten free or not. But especially if you're gluten free. I can't remember if this is one of those places that labels things 'gluten friendly' or not, but I did not get any sort of reaction after eating this meal. It was so delicious. We sat on the patio, and it was incredibly relaxing and just the perfect pace for a nice meal."], ["KH W.", "Underwhelmed at best. Will not be returning. Atmosphere- while I am always a fan of live music, the singer was far too loud for the small, echo-y space. We sat near the back and had to pause our conversation during her breaks. Food - The concept of the menu is great, but poorly executed and bland. The best item of any of the three dishes we had were the heirloom tomatoes that accompanied my redfish. Service- our waitress was nice, but not overly helpful. When I asked for a taste of one of the \"by the glass\" selections, she said she couldn't provide me taste....but did offer to open a bottle twice as expensive (that was not on the by the glass list) for a taste?!....not exactly logical. She then tried to up sell me -3 times- on the twice as expensive bottle. Seems obvious.... Please note that I was not ordering a particularly cheap glass to begin with and I am very familiar with the selections... This was not a situation where I was even asking for her opinion. The wine-the selection is good, but the \"by the glass\" pours are incredibly -almost insultingly- small. (Picture attached). I ordered a red, and was blown away at how small the pour was...I wish I had taken a photo of my friends moscato pour...it was about 2 sips. Yes, I am aware that is a dessert wine and the glasses are smaller...it was too small, trust me. I thought perhaps there was a flight pour that I wasn't aware of. Overall- My advice is to utilize the patio seating, eat beforehand and have only cheese and other wine pairing accoutrements, avoid \"by the glass\" and order a bottle."], ["Trish F.", "This place was delicious!!!  We had the Bourbon Pecan French Toast and I can not wait to go back for some more!!!"], ["Clarence L.", "Fried chicken worth the wait time. Stellar. Fried egg sandwich is enormous and delucious.Chef Anton is great host and ready to answer your questions, make suggestions, etc.And they have a great wine selection at very reasonable price points."], ["Sarah A.", "Brunch was amazing. I had ordered the basic breakfast,  and the grits were outstanding! My boyfriend had the fried chicken that he  loved as well. While we were waiting on the chicken (it takes a while to make, but so worth the wait) we split an order of the amaretto French toast. We devoured that rather quickly, it was so good. My mimosa never ran out thanks to the lovely wait staff. We want to come back for dinner and try the pb&j wings!"], ["Melissa R.", "Hubby and I ventured out Sunday for some brunch perfection. I wanted mimosas and a delicious, well-seasoned eggy breakfast. Max's fit the bill. Excellent service, the best chiliqueles in town, and prices that are fair, not outrageous. I also appreciate the fact that the servers are knowledgeable about wine and champagne options yet subtle and not pushy. There's a time and a place to buy a bottle for the table and there is a time and place for a $2 mimosa. We will be back for both!"], ["Sandra P.", "Sunday brunch was amazing. We came in without reservations and had to wait... But the food was totally worth the wait.  Ordered the Roasted Chile Relleno with Chorizo- I don't usually go for this popular dish but I could not resist it this time. My instincts were spot on! It was delicious! Next we shared the Lemon Bar French Toast and it was absolutely divine. You must try it! Big bonus... Excellent service from Emily."], ["Ali S.", "I've only been here once so far, but I plan on returning next time I get the chance! I work down the street and I had an early meeting one Sunday morning, a few coworkers and I decided to grab some brunch before I had to report back to work. Of course when we arrived, there was a short 20 minute wait for our party of 5. Our server had long brunette hair, and I think she mentioned she's half Japanese? I forgot her name, but she was great! I let her know I had to be back at work within the next 30 minutes and she pushed my food out immediately. I was able to enjoy some of my blueberry pancakes and head back to work on time. Although I didn't get to try much of the food, the service is what will bring me back. While we were waiting for our table the hostesses tried their best to seat us ASAP! Each staff member we encountered was very friendly and helpful. The team gave off an inviting vibe, and that's what I love about them most!"], ["L R.", "This place is a great spot for food and wine.  I am not much of a wine person, but they are very helpful and talk you through things, even if it is just one glass.  They have a constant menu and then a menu they change seasonally.  Everything is delicious, and this place is a cut above a regular chain restaurant, they have an actual chef and great kitchen staff, and great service.  I highly recommend making a reservation, because when it is busy, they do not compromise service and rush you.  Which is great.   The biggest reason I love this place is that as a person with Celiac disease, my dining choices can be limited.  This place understands food allergies (one of the proprietors has celiac) and they have practices in place to feed you safely.  They have a dedicated fryer for gluten free items, so you can get many items made gluten free, and the best thing this place has is GF fried chicken!!!  While the menu calls it gluten friendly and has the usual disclaimer, the staff really does take care to make sure things are done properly.  The PB&J wings are a favorite of mine, too.  For dessert, the dark chocolate mousse is divine, and light enough on the stomach that it can still fit after all that food.The environment is set up like a dive bar kind of place.  Loud music with a jukebox, dim lighting, casually dressed servers and diners, but with the upscale food it is the perfect combination.  You will pay a few extra dollars for the food, but the service and quality are well worth it.  They also sell wine to-go, and host special brunches and dinners periodically.Also, free valet parking.  Something great to have in that area.  Next door is Barcadia, a nice place to check out, especially if you are out with friends."], ["Peter D.", "I don't even know where to begin. Some of the best service in Fort Worth. Great atmosphere. Amazing rosé. Even better Pinot. Even better food. fried chicken? Yes pls. If I could give 12 stars I would."], ["Becky K.", "I first experienced this charming place at a special Alice In Wonderland themed dinner a few months ago which was seriously the most fun I've ever had at a dinner event and an amazing, somewhat experimental spread as I understand... The whole event was incredibly creative and unique and I hope they continue on to make it a tradition!  I was so taken with the place that I came back shortly after for brunch and had a very generously sized egg sandwich - about the size of my head! :-)  It's a casual environment with classy food and very friendly staff - don't miss out on this gem!"], ["Patricia P.", "This is my second time coming in for brunch. Plan for a wait as they are very popular, unless you don't mind searching for a seat at the bar.First time I came in, I was sad to find out that their chicken is breaded in a jalapeño flour mix (I am very allergic to jalapeños). Our waitress went through all my options on the menu, but I have to admit I was really looking forward to trying the fried chicken I had heard so much about. But The executive chef even came out to talk to me about my allergy and my options and apologized that the chicken was also marinated in jalapeño buttermilk, and could not be made without it.Last time I tried the max & cheese. Food was ok, service was great. The girl who served us was very sweet & helped me so much finding something I could eat. However the food was a little underwhelming & I didn't feel a strong pull to come back. After seeing a magazine article & the Tiramisu French Toast I had to come back! Tiramisu is my weakness. Sat at the bar this time & Crystal took care of me. I was very excited about the French toast but was disappointed. They didn't taste anything like Tiramisu. They were good, but not what I had anticipated. Maybe if I was able to eat the chicken (which I've been told really is amazing) I would feel differently. Or maybe it's also because the only times I've come in have been on a really busy brunch. But for my rating I give 4 stars for the service and 1 star for the food. Maybe things will be different next time? The service is definitely worth coming back & searching for something to love on the menu. And in the meantime I can sip on some great mimosas."], ["Adam C.", "Great service, horrible food (for the price).  Start with the bad.PB&J wings:  Didn't work.  Loved the sound and thought it could be pulled off.  Tasted like PB wings that were missing a LOT of J (or some other flavor to offset the PB).  Was my meal, and I ate 3 of the 6.Grilled Cheese with Tomato Soup:  Very thick bread with a little cheese, so you really couldn't taste the cheese at all.  Just buttery bread.  The tomato soup tasted very basic.  I'm sure it was tomato sauce, cream and basil with spices, or very close to that.  Nothing special.Grill redfish:  Very basic and not cooked well.  Falling apart tender, as if it were cooked in a lot of liquid rather than searing and finishing off in oven.Fried Chicken:  Collard greens not good.  Mashed potatoes great.  Fried chick was phenomenal!  If I go back there, it will be only for the fried chicken.  Very tasty.Overall, extremely underwhelmed.  Decent wine selection but I expected more considering they ONLY serve wine and a few craft beers.  No liquor."], ["Cassie B.", "Finally had a chance to swing in for brunch this past weekend. The food was good, especially for the really reasonable price. The jalapeño cheddar grits almost had me doing a little dance because they were so tasty! Let's talk about the service. Even with a slight wait on food and our order being a little wrong the service was still amazing. We had a waiter in training backed up by an awesome waitress. They both were super friendly and apologetic when our order came out. I will definitely be back to this establishment and cannot wait to come in during the evening to try their menu!"], ["Tony G.", "I have visited Max's wine dive a few times always for brunch. All of my fellow yelpers had told me about this place with really great food. So I had this picture of a fancy wine bar in my head, complete with snooty wine peeps and everything. Bam to my surprise it was this quaint little Restraunt will a really chill vibe and good tunes coming from the jukebox. The staff is chill it is a fun atmosphere every one is just smiling and interacting. Now on many mission to the dive i found one big truth. You want to experience brunch at least once when the head chef is there. He seems to always have something up his sleeve that is not on the regular menu. The first visit was great. I was told to try the dreamsicle French toast and have to say this is very sound advice. It is two big slices of Texas toast fried up to perfection then cover in syrup and butter with orange infused marscapone that gives it a very special flavor. This is so good you need to eat it over and over. If you just want to try it order the children's portion nice and small and you still get the full experience. The brunch menu offers a lot of options. We tried the fried egg sandwich. Which is huge and can feed a small army. Perfect hangover food three eggs topped with tons of bacon cheese. This is awesome. Its has been so much fun frequenting this place that I am taking my folks there tomorrow."], ["Linda S.", "PB&J wings were awesome!!  They opened at bottle for me to \"share \" of Caymus Special Selection 2009 to enjoy with my wings.  Service was GREAT and very friendly."], ["Jenny T.", "Where do I even start... Found Max's Wine Dive from Yelp. Chose this place because of the delicious menu & the yummy looking Yelper's pics. We got: 3 Mimosas. Half portion of truffle Mac n Cheese. I am a pretty big fan of truffle and mac n cheese, so out them together and I'm in heaven. Half portion of Dreamsicle French Toast. My bf ate it so fast that I could barely taste it. So speaking for him, it was the BEST French toast that he has ever had! Even had to convince him not to get another order. Southern Fried Chicken w/ collard greens, home fries & Texas toast. I ordered this only bc of reading great reviews about it. This was absolutely the BEST fried chicken I have ever had! I'm not a big chicken person bc it typically comes out dry and bland but not this chicken. It was DELICIOUS!!! Collard greens were good but just borderline salty. Still really good so no need to complain. Two Eggs, bacon, jalapeño grits & toast. My boyfriend devoured his plate...in the midst of devouring mine. Eggs are eggs but they were cooked perfectly to his liking, over easy. OK, so I may sound a bit repetitive but the jalapeño grits were the BEST grits I've ever had and I don't even like grits!!!!Total Check: $53.04 I am so happy that I found this place. Thank you fellow Yelpers!!! Service was great, food was superb & atmosphere was nice. If I lived closer, I would most surely be a regular."], ["David G.", "This was on our list for a while and we finally decided to try it last Saturday night. Really glad we did. The atmosphere was great (a little crowded and a little small). The classic rock music playing low along with all the original artwork on the wall set a really laid back, fun mood. I was told comfort food and it was, and plentiful. My wife really liked the magnolia cheese board for an appetizer. She had the seared diver scallops for dinner and I had the bison meatloaf-wow! We shared the roasted cauliflower side, perfect.  We ordered a very reasonably priced bottle of wine  upon arrival and, unexpectedly, we were entertained with wine tastings throughout our meal. We found some great wines at wonderful prices to take home (a great bargain), and after all the tastings we still had the majority of our  original bottle left too.Also, I have to give a shout out to our waitress, Lauren. She went out of her way to make this a great evening for us. Thank you Lauren!  We can't wait to come back for dinner and to try them out for brunch."], ["Monica B.", "The waitstaff  is wonderful.  The fried chicken  and grits are to die for.. I will definitely  be  back."], ["Katie A.", "I've been multiple  time to their Saturday brunch and enjoy  the  French toast  however today it was extremely  runny  except for edges.  It tasted good just not a great texture.  The mimosas  were great.  Overall I recommend for a yummy breakfast"], ["Greg M.", "Very eclectic menu (which you can tell by other reviews), will be a hit or a miss for most folks.  The wait staff is very knowledgeable about the wines so if you are not sure just ask them!  The wines are not from the mainstream labels that we have grown accustomed to but rather smaller, lesser known vintners.  For this reason, you can pick out some real gems.  For a more traditional fare, try their brunch menu."], ["Kennasha J.", "De-freaking-licious! We visited this location for Sunday brunch. Although reservations were recommended we were seated immediately without them.The staff was kind, helpful and worked quickly!The atmosphere was lively - lots of people of all ages. There was an seniorly couple on our left and a group of middle aged individuals on our left. A little loud but it's understandable because of the small space.I appreciated the variety on the menu. Some sweet options and some savory options as well. I ordered the pancakes with a side of fried chicken. My pancakes were semi-sweet, light and flavorful. The chicken tasted like something my granny would make from home - yummy!My husband enjoyed the roasted chili relleno dish. I didn't love it but he did.Clean establishment and a fun, hip vibe!"], ["LaKeyva S.", "I went for the first time to have brunch and we left because the waitress forgot about us and we sat 45 minutes drinking coffee and never had our order put in. I wrote a comment on the website and the general manager responded within 24 hours and invited us back for brunch on him. They rolled out the red carpet and treated us like royalty. The \"BEST\" french toast we ever had. It had fresh peaches and a caramelized brown sugar syrup. Mmmm"], ["Shannon S.", "I enjoyed the patio and my breakfast. I arrived as soon as it opened on a Sunday, so I managed to beat the church crowd. The tiramisu French toast was creamy and delicious. It's definitely worth your time and money. I also liked my bacon, eggs, and home fries. The potatoes were well seasoned and piping hot. Yummy. I'll be back for breakfast, soon."], ["Kristen S.", "My husband and I loved Max's Wine Dive so much that we came for brunch two Sunday's in a row! Valet parking was quick and convenient, and both times we got right in. Their gluten-free fried chicken was so crispy and juicy that I actually considered licking the plate, and because I have no self control, I also got a few gluten-free blueberry pancakes. My husband has gotten the eggs any style and Greek yogurt/granola dishes and loved both. If you like brunch, don't miss trying this restaurant!"], ["Deborah L.", "I ate here a couple of weeks ago pretty late in the evening. Wait staff was nice, and helped guide us in our food choices. My friend and I shared the stuffed piquillo peppers, and the gnocchi. Both were good, definitely on the smallish side but we were neither exceptionally hungry. It would have been nice if the pasta entree came with some bread, especially because the sauce was really good! I've eaten at a Max's in Austin several years ago, and I thought I remembered their menu having a bit more of a selection. Overall, the food was good, not phenomenal so just 4 stars for me."]], "Bird Cafe": [], "Cruzin Chef": [], "Le Cep Restaurant": [], "La Madeleine Country French Café": [], "Cacharel Restaurant": [["Sheila V.", "The food, service and ambience were exceptional.  The dish and drinks are a bit pricy, but I definitely recommend for a special evening.  Our waiter mentioned that they also have lunch seatings which is a nice alternative."], ["Molly H.", "Not that great. The crabcakes were burnt, the salad had way to much dressing, the stake was really over cooked and the whole place looked like it was out of the 80's. The service was fantastic though. I would still dive the extra 20 min to oak cliff if I feel like spending the money on a nice dinner."], ["Ben P.", "My wife and I got married at Cacharel last year and to this day, we still have friends tell us that it was the best wedding they had ever been to! The food was top notch, and the lighting and atmosphere was so amazingly perfect for a night time wedding. Sara was our wedding coordinator and she did an awesome job! It was such a success, that my wife and I have decided to go back to Cacharel for every year after!!"], ["Peter S.", "We were visiting the Dallas area to get together with some relatives and went to Cacharel for the Easter Brunch menu.  It was absolutely fantastic.  I had the escargot appetizer which was nicely finished with some mushrooms and a unique sauce that complemented the chewiness of the escargot, but was not overbearing.  Others in our group had the scallops en crute which was delicious when I tasted it with a nice balance between the pastry crust and the taste of the scallops.For the main course I had the smoked pork chop which was perfectly cooked and complemented with a chipotle sauce that was not overpowering but added just the right amount of smoky flavor.  For dessert the chocolate souffle was incredible.  It came to the table at just the right temperature, so no burning the roof of the mouth.  There was also an apricot/mango souffle that was a unique and tasty treat.The service was attentive but not overbearing and the atmosphere was quietly elegant.The view is fabulous and, although we were there during the day, it seems that the sunsets would be spectacular.  We also got a private tour of the wedding banquet room.  This looks like a very nice setting for a wedding and/or reception.  The room is not a bland rectangle, but includes curves and corners that provide a unique setting, all with that fabulous view.We definitely plan to return the next time we are in the Dallas/Fort Worth area."], ["Mister S.", "Disgusting food. Terrible for weddings. Head someplace else."], ["Trent M.", "I have not been here in years, but I know that the one time it went it blew my doors off.   The food was excellent and I had no idea there was fine dining in Arlington."]], "The Wild Mushroom Steak House & Lounge": [], "Mellow Mushroom": []}