{"Opa Mediterranean Cafe": [], "Terra Mediterranean Grill": [["Chirstine A.", "When I first started coming here I remember telling everyone about it. Now the place is so overcrowded because the secret got out. I have to have this place at least once a month for lunch buffet. I've also considered having them cater different private events for us too. There's nothing on the menu I don't like! Saffron Chicken is my favorite, but it's hard to choose what I love most! I also like how a beverage is included in the cost. $12.99"], ["Samantha S.", "I love Terra! Whether you're going for buffet lunch or dinner, it's a good choice. I like their kabob chicken, rice, hummus/pita, tabouli, all their veggies, and curried chicken. Going for the buffet lunch is a blessing and a curse, there's so much delicious food but only so much room in your stomach. After polishing off three plates, I still crave the curry. I find myself strategizing by resisting more delicious pita bread for the cauliflower. Yummy Mediterranean food, huzzah!"], ["Alejandra Y.", "We had a great dinner here! It was a crowded Saturday night, but service was fast and consistent throughout the meal. We had the Vegetarian Moussaka appetizer which was delicious and rich; it could have been a meal on its own!My boyfriend had the lamb skewer and I had the shrimp. The plates had a ton of food, and it was all well seasoned. The vegetables could have used less oil. And I wouldn't bother with the baklava because it's really not authentic--too gooey and sweet."], ["Marty B.", "Let me preface this review by saying I've visited Terra three times in total. The first two visits were lovely, but the third visit was disappointing. The food has been consistently very good, but the service this time was a bummer. I ordered a gyro, but was only brought a plate of shaved meat. No pitas, veggies, rice, sauce...you know the drill. When I asked if the rest of it was on it's way out, our waiter apologized and said he would ask them to make me the full gyro plate and not just the gyro meat. It took roughly another 15-20 minutes for the rice, sauce and veggies turn up, but by that time the meat was cold. Another 5-10 minutes to get some pita bread (from a different friendly waitress). 20 minutes to get our check. In total we were at Terra for about an hour and a half (most of which was waiting), even though there were only two of us and the dinner crowd was pretty sparse. Our waiter, while polite, just was not on his game. I would be willing to try Terra again (because the food is good), but I hope the unfortunate service experience was an isolated event."], ["Jessica S.", "What a pleasant surprise! We stopped in to Terra on a Friday evening just to try something new... and boy were we happy we did! The food here was absolutely delicious!PROS:* Best hummus and baba ghanouj I've ever had! Super creamy and just perfect with their oh-so delightful pita bread* Awesome menu with tons of options. Our favorite was the New Zealand Lamb Kabob. Order it medium and your tummy will be very thankful you did so. This is served with a tasty saffron rice and some savory roasted vegetables.* Very personable server named Aaron. He was very honest about what to order and what not to order on the menu, and we definitely appreciated his frankness.CONS:* The layout of the space is quite awkward. Some of the tables are a bit uncomfortable looking, especially the one we sat at up against the window with a pillar halfway through our table. Could be fine for a party of 2. But there were 3 of us and this seating arrangement was pretty odd.* Staff seemed a little under-dressed and a bit on the sloppy side. Get your servers to tuck in their shirts and to look more professional. * The decor was a little off to me. Seemed like their intentions were to have a modern restaurant, but the awkward open kitchen which was half taken over by an awkward buffet, was very much out of place. The buffet wasn't even set up (and thank goodness it wasn't... I would have walked out had a noticed it right when we walked in). So, I am not sure what the point of it was. Time to rip that out and rearrange the layout of your tables."], ["Izzy W.", "I love when they do the buffets. You get to sample everything and it's all so yummy! There's normally a wait around noon but worth it."], ["Patricia E.", "Large variety lunch buffet; even at 1:30P on a Wed there was plenty to eat. Would have preferred a little more lamb options and a few less ground beef but found enough to leave there full. Waiter was very pleasant and brought my drink promptly, and a side of pita bread since I couldn't get to it through all the others at the buffet. Perhaps dropping a couple of pieces at each table with the drinks could be implemented?Dirty dishes were quickly removed and even though it's a buffet, the waiter checked on me often. Definitely worth the $12.99 price (includes tax & drink; grat extra)."], ["Michelle L.", "Favorite resteraunt in Ft Worth! Excellent food and love sitting outside on the patio. Reasonably priced."], ["Raissa W.", "Went to Terra today with a friend. Had heard this place was good but didn't truly know what to expect. I had glanced at the menu briefly before arriving so I anticipated ordering a couple things. Had no idea that the lunch rush is actually a buffet! Totally unexpected but totally delicious. Pricing was $12.99/pp for the buffet. Not terrible considering the locale. I got to try a few things that I'd probably not order and boy was I surprised. There was not one thing I ate that I didn't enjoy! Honestly I can't pronounce or remember the names of most of the food but you just can't go wrong here - so authentic and delicious. The restaurant was definitely a popular place to be. We had to wait for a table but it was a short 10 minutes. I truly recommend everyone trying this place out. I'll definitely be coming back for more!!"], ["J W R.", "This place serves Texas-sized tapas and mezzes. Normally when I see the word meze, I think small plates.  Not here.  The lamb spanakopita easily served four. The Greek Salad huge.  The hummus like everything else was super-sized.   We were looking for  something light, ended up taking home boxes and eating well for the next couple of meals.  Overall the food was good, the prices affordable, the wine list acceptable and all the huge portions over the top."], ["Jeff E.", "Really outstanding quality for a buffet of any type at lunch, and the size of the crowd underscores this - be prepared for a wait from 11am until about 2.  It is worth it though.  The buffet sees enough turnover to keep everything fresh - really good hummus, taboulleh, dolmas, tatziki, beef, lamb, chicken, salads, spinach and other veg,  etc.  The buffet is not as huge as some of the other spots (ie dimassi), but is better and more focused for this fact.  The only complaint I had was that the falafel was rather dry, but the overall quality is good enough not to remove stars for that one thing."], ["Christine C.", "Love, love, love the food and service. A tad on the pricey side. I've only been here with girlfriends, as my husband has simpler (ie., cheaper) tastes.On the last visit, my friend and I split a Haloumi Cheese ($10; sheep's cheese with mint and olive oil). Delicious and rich. We also had sangria, which was very sweet, on par with grape juice. For my entree, I got the Kibbie ($15; baked, though they have a fried option). The menu described it as \"ribeye beef, wheat, onion, pine nuts, served with saffron rice, tabouli salad & ziziki sauce.\" Great, we both ordered it.The waiter asked if we ever had it and gently mentioned that most people who get it for the first time return it because it's not what they expect. I asked him what he meant and he said it's the seasoning that turns people off. My friend backtracked and just got a giant tabouli salad. To Hell with the populace, I want the kibbie!Here's how I'd describe it: Mediterranean meatloaf. Yeah. The rib eye is ground with the seasoning (nutmeg, cardamom, and cinnamon notes to my amateur palate), blended with wheat and onion with a nice topping of pine nuts. My friend didn't care for the corner I gave her, but I enjoyed it. Topped it with zizki sauce and mixed in the rice and tabouli and I was in flavor country. I ate the whole thing, but I admittedly I am a good eater :3"], ["Kyle L.", "Love the lunch buffet. I would come for the bread and hummus alone. Coming from a native Metro Detroiter, where the Arabic/Mediterranean food might be the best in the USA, the struggle is real finding decent options in that vein here in DFW. Terra scratches that itch. Can't beat a plethora of options and the right to stuff yourself to the gills for $12.99!"], ["Rashell M.", "I've been here on several occasions and am never disappointed in their food. Well I decided to take some of my family here and they were very impressed with the lunch buffet which has most of their menu. I love their pita bread it's always fresh also love their hummus. Service is sometimes questionable. But I'll continue to come back for their food."], ["Chris M.", "If you give this place any less than 5-stars, you need your head examined. The lunch buffet is only $12 and includes a soft drink. I feel like I'm robbing them, it's such a good deal. Especially since the food and gyros (all you can eat gyros!!!) are to die for. Everything is homemade and fresh. It's so good, it's ridiculous. Get here early if you're doing the lunch buffet, because the word is out. You may have to wait. Worth. The. Wait."], ["Kali G.", "Nice place for the price and the overall value.  I like this place for the buffet on the weekends, they have a great spread to chose from and the wait staff is always attentive.  It is always very crowed but they seat you very quick and your server always has your glass filled.The food is decent, but sometimes the gyro meat and saffron chicken a bit over seasoned but it is a buffet and it is extremely busy so for the value ($12) it is still a good deal. It is worth checking out."], ["Ann T.", "Good food and fast service. I like the location because it's in walking distance to a lot of other places. I like that they are generous with portions. Nothing particularly stands out about this location but it's good food, clean and decent prices and that's what I was looking for."], ["Holly H.", "Went here for the lunch buffet with a friend, and was shocked at how good it was! Now keep in mind I am not a Greek or Mediterranean gourmand, but everything I tried here was delicious! The atmosphere is very nice, and the place was very clean. The saffron chicken and saffron rice really stood out to me, I had never had anything like it before, and it is to die for! The chicken kebob was also out of this world! The coriander potatoes were fabulous. There was not one single item I tried that I didn't like. My one tip is to get there early. We were there when it opened, and by 11:30 the place was swarming with people, and by the time we left it was standing room only with people waiting on tables to clear! I can't wait to go back, it was a really good experience."], ["Suzanne W.", "I came here awhile ago, but had a pretty good experience! We came on a Saturday night so there was a 20 minute wait, but really not too bad. I loveee Mediterranean food, and this place's is delicious! I don't remember any specific dishes, except for the hummus which was yummy, but overall, this place has a great atmosphere."], ["Mehdi D.", "Great food and super amazing lunch buffet highly recommend trying it out to see what you like so you can order it next time you do normal dining."], ["Maria P.", "Fantastic, fresh, great flavor, lots of variety, consistent. I always go for lunch buffet and eat in or get take out.  I love to make a gyro salad and have the roasted cauliflower and eggplant with lamb.  Yummy"], ["Margaret A.", "Came here for the lunch buffet. I'm not normally a buffet fan but this is really a treat. Lots of variety on the line, everything fresh, everything flavorful. Plenty of options for meat eaters and vegetarians alike!At first the service was mediocre - The waitstaff all chatting it up at the hostess stand. I know that table service is usually reserved to water refills when it comes to buffet style restaurants, but I asked for a wine list and then waited forEVER for her to come back! I finally wound up walking up to the hostess stand to place my order...Then we thought the service was slipping even more when my fiancé's debit card was overcharged! Finally an attentive employee came to our table to help us. She ended up re-opening the ticket and ensured us that the charge had been corrected, but told us to call if there was a problem on his bank statement. Then she comped my wine as a courtesy!"], ["Sarath P.", "Come for the buffet. You won't be sorry! I have to prepare for a buffet lunch here -- no breakfast and a brisk walk during my morning break. You gotta get your money's worth, y'all! My favorite items on the buffet are the tabbouli, baba ghanouj, saffron chicken, potatoes, cauliflower, kafta and the saffron rice. Come early or there will be wait. And if you come late -- you can stand sadly by the door and hungrily watch me at my table with my 2 plates of food, nom nomming away. And no, I won't feel sorry for you."], ["Julie W.", "Delicious! Literally everything I had was so flavorful. Lunch buffet. 6-8 fresh salads. Falafel was flavorful and not too dry like it can be. Saffron chicken was amazing as was creamy hummus. Chicken kabobs also full of flavor. Even stuffed, I went back for 2nds!"], ["Tanya P.", "Service was good. Booths fir some reason made me feel like I was sitting crooked. The table were to high or the booths were to low. Either or it was uncomfortable.  The waiter was nuce enough to switch us to a table. We ordered the feta and olive plate and the lamb grape leaves. Te feta was good and the olives were better. The grape leaves had a weird taste and we returned them. Usually dont do that but couldn't finish half of 1. The fried kibbe was good but $4 for 1 a little bigger than a large egg is kind of a ripoff but oh well..I ordered the trout. And the bf ordered the lamb gyro plate. The trout came with this weird sauce that killed the raste of the fish. Real heavy and strong.  Fyi if u have a nice piece of trout than u don't need that sauce with it. All in all it was decent.  Will I return probably not but who knows"], ["Sunny P.", "It was my first time eating at a Mediterranean buffet, and I was a little hesitant at first, since my diet only consists of eating chicken, fish, and vegetables. As far as the chicken went, I had the saffron chicken and the chicken kabob, and both dishes were very flavorful and tender. The chicken kabob was very lean, and it is a good choice for people who are following a high protein diet. As for the vegetable dishes, I had the spinach and the roasted cauliflower. The roasted cauliflower was amazing, since I don't typically eat cauliflower, but the seasoning on the cauliflower made it spectacular. The spinach dish was good, but it was a little overly bland. Tips: 1. When you ask for a drink, you are only allowed to have one drink per buffet. 2. You pay for the buffet before you are seated"], ["Jun E.", "Their lunch buffet is great!!! Mushrooms soup, fried cauliflower and saffron rice are sooo good!! And $12.99 included drink is cheep!"], ["Jessie K.", "Food was delicious and we didn't have to wait or have reservations on a Friday night.  The hummus app was yummy as was the Gyro and lamb kabob.  Only problem was that a lot of stuff was dirty.  Two of our wine glasses had lipstick prints and a fork had dried food."], ["Carmen D.", "Yummm Yummmm Yummm!! My hubby and I love to eat here for our lunch dates! Their buffet is amazing food and their staff is always so nice!"], ["Chris B.", "I just moved to the West 7th area and wanted to try something different. Im really glad I came upon Terra because it was honestly incredible. Service was good, the waiter knew exactly when he was needed and was never hovering around and always seemed to appear at the right times.They bring out delicious hot and fresh naan to eat with olive oil while you wait and it is addicting. I am glad I saved room for the main course which were kafta and grilled shrimp kabobs served with saffron rice and vegetables. I really liked how you could get a mix of kabobs to try differen things. I had never had kafta before and it was basically a spice infused lamb and beef meatball and it was awesome. The shrimp was perfectly grilled with a nice crunch on the inside and juicy tenderness on the inside. The saffron rice may have been the best part of the dish, it was moist and flavorful and really complimented the meat. Even the seasoned grilled vegetables held there own as some of the best tasting vegetables I've had at a restaurant.Everything was so good I kind of ate in a sloppy rush and wolfed it down just because it was so rich and flavorful and I couldnt stop myself. I ate every bite and cleaned the plate and it was definitely a generous amount of food. Thats how good it was. I look forward to returning, especially on Sunday where they apparently have an amazing buffet.Far and away the best meditterrean food Ive ever had."], ["John P.", "Went during lunchtime with coworkers,  for $13 all you can eat buffett and non alcoholic beverages are served. Food is crazy delicious, restaurant is in a cute upscale area with garage parking. Just be sure to come super early for lunch or super late. 12:00 PM people were waiting out the door with no end in sight. But i can't get over how amazing the food is! Will definitely return."], ["Robert P.", "Great place in the neighborhood. Food is great. Sangria is good. Love the outdoor bar!  Can't go wrong with anything you rose but my usual is the chicken kebab."], ["Steven S.", "Best Med Grill in town!Lunch: All you can eat saffron rice, kebab chicken, med. salads, fruit, seasoned potatoes, and the creamy saffron chicken and mushroom soup........oh that soup. I love to get some kebab chicken, saffron rice, and bath it all in the sauce from the soup. Best lunch ever. Also, great flat bread.Dinner: Lamb kebabs. do it. That is all.Bar: Tvs, large selection from what I can tell, and cool atmosphere. The location in Fort Worth is great, perfect for dinner and a movie or catch a live concert/show. Parking can be a beast, but if you are familiar with West 7th, you will be fine."], ["Pat Q.", "I love eating at Terra's Mediterrean Grill.  Often times I bring clients here for the fabulous buffet.  They love it!!!  It is a real pleaser because some of my clients have not experienced this type of cuisine and it is a great place for them to try all kinds of fare.  Every client has been appreciative of the new restaurant hook up, but most especially the new cultural experience.   When the weather is nice eating outside takes your whole foodie experience to another level.  If you are eating dinner and not the lunch, try the  Mediterrean Salad, Fried Cauliflower and Chicken Kabobs that is served with an amazing saffron rice.  So yummy!  Love Terra's!"], ["R R.", "Terra lunch Buffett is a must! Add a mimosa for only $4, but leave a cash tip on the table or else credit card tips go to the cashiers. The servers are doing the majority of the work they should receive a tip!"], ["Ashley P.", "Baba ganoush!!!! Omgggggg!!!Minus a start for the feta platter..so salty my tongue fell out of my mouth."], ["Jessica A.", "Great location. Great atmosphere. Very knowledgable and friendly waitstaff. Fresh, hot pita bread. Gyro...delicious and lots of food. It could easily be shared between two people. The saffron rice was very good as well. Kibbie...it's pretty much ground beef mixed with other ingredients, rolled into a ball with a breading batter. You can definitely taste the cinnamon and nutmeg, which is something I wouldn't expect in ground beef, but nonetheless it is very delicious.  Prices were about average. Entrees range from $12-$24."], ["Stoney R.", "Best Naan in town...Always good but service can be sketchy in my experience...Lamb pops are the best"], ["Joanna T.", "I came here with high expectations by reading all of the great reviews. We were circling there to be a buffet. Turns out it's only during the week, my mistake. But we decided to try it anyway. The hummus lacked flavor, I ended up making my own by adding salt and pepper and I'm not a person who uses salt. Their gyros are in a style to create your own, that was different. I ordered a Greek salad with chicken but instead it came with lamb. So I had to wait about 20 minutes for the chicken. By that time I was already done with my salad. The pita was a hit or miss. Sometimes it came fresh and others it was hard and a bit cold. I've had much better Mediterranean food than here. The only good thing was the flavor of the chicken."], ["Allison H.", "My favorite lunch time spot! But get there at 11:30 or before to avoid the crowds! Vegetarians and vegans can find lots to eat. My dreams are made of this baba ganoush and pita bread. I have my selections down to a one-plate-science, but its simple to make several trips. Tips:*You pay right when you walk in, and the price includes a drink. *If you have a large group call ahead and they will save one of the more private/big table areas for you. *If you park in the gated garage area- make sure you take your ticket in for validation"]], "Café Medi": [["Jackie F.", "Great Food. Great Atmosphere. Love the Gyro and the rice they serve is AWESOME!"], ["Jeanne B.", "Great food...lots of food even at lunch prices..the wait staff friendly and efficient but best part it is a BYOB!!"], ["Carly A.", "I was pleased with how well they accommodated our large group. The service was quick and friendly. The tomato soup was wonderful. I had a gyro. It was very flavorful and huge. The portions were really enough to split.  The food seemed almost over seasoned to me but everyone else in my group loved it."], ["Deborah L.", "The food and ambiance of this place is the best!!! Hookah was perfect as well. Will definitely go back many times!!!!"], ["Cristal Y.", "I went here last week to celebrate my birthday with a friend. She had the vegetarian plate and I had the lamb ... something? I forgot, but you can tell by the picture that it was so tender and juicy! I couldn't finish the entire meal, so I ended up taking most of it to go. We received pita while we were waiting for the entrees to arrive which was nice and the waiter was very responsive. We came in the evening and there weren't that many customers, but when we left the tables started to fill up. Overall, my experience here was wonderful! I would definitely try to come back to try other items on the menu :D"], ["Todd R.", "First time, here walked in and greeted by a VERY friendly staff. The menu is authentic, just BYOB."], ["Brett I.", "Really good, i say. My new favorite Mediterranean restaurant, i think.Lemon rice soup is really good. Like, really good. Real citrusy but not overbearingly so. Rice adds body and texture to it. I'm not even a soup kind of person, but this was seriously good. I ordered the moussaka. I can't say anything about its authenticity, but taste-wise it was good; it was almost lasagna-like, but not cheesy. Ground beef with eggplant and a tomato-base sauce on top of rice--yummy.A friend ordered the chicken shwarma, which was also tasty, well-seasoned, and totally not dry. Another friend ordered the bassa fish--surprisingly good and not needing of the sauce to give it flavor. The place might seem a little pricey, especially at dinner time, but it's worth it for the portion size.The place also offers hookah if that's your thing.I also liked our server, he was nice and kept checking up on us.Can't wait to go back to Cafe Medi!"], ["Charlotte D.", "Love the food!  Got the meza plate for an appetizer, which has babaghanoush, hummus, and tatziki on it. Its hard to find good babaghanoush, and it was on point!  We also tried the tomato basil and cream of mushroom soups and the house salad. All very tasty!  Found out from the waitress that all soups are gluten free, not the we needed it, but seemed like a bonus!  Kiddo had the pastitsio which is kinda like lasagna, hubster had the gyro plate and I had the gyro wrap. I've never had a better gyro. EVER.  We will definitely be back next Sunday."], ["Karen P.", "Wonderful salads, absolutely love the Gyros with Tzatziki. The hummus is delicious!! And staff are so nice! Oh! And the steak fries!!! Delicious!!! I think I'll be going in soon!"], ["Garrett S.", "Great food!  Nice change from the chains and prices are reasonable. Good kids menu and friendly atmosphere!"], ["Lara L.", "One of our favorite local BYOB restaurants!  We eat here with the kids about once a month - get there early in the weekends!"], ["M S.", "Gotta love a place where I can practice my Arabic and get a phone number instead of a thank you, fab fab moussaka! Kofta!!! Yum! Pass the arguila!!!!! Eat and smoke here! BYOB folks"], ["Ryan L.", "I have been here twice so far, and both times were fantastic!It has a fun patio to eat and hang out on, where you can have a hookah brought to you.  I have had both the chicken and beef shawerma plates, as well as the pita wrap versions of them.  We get the falafel and the humus for appetizers.  Everything tastes great!  I do have to ask for no onions in the shawerma though.  Service was a little slow the last time around, but the waiter was very nice and apologetic about it.  He also comp'd both appetizers and the dessert, without us asking or complaining.  That was awesome.Speaking of dessert, the baclava is absolutely awesome!  Get it!This is a great greek place and its less than 2 miles from my house.  I will be back many more times I'm sure."], ["Kevin H.", "I like. Had the swarma(spelling? ), not bad and the baklava(again spelling?) was pretty good also. I have nothin bad to say about what I ate or the friendly staff. So I'm cuttin it short on this one until I visit a second time."], ["Stephen L.", "The front of the building can be a bit unimpressive, but hands down they make up for it in quality of food and quantity. the staff is friendly and even though I have only been a couple of times over 6 months, they remember us. Such a great place to eat."], ["Ava D.", "Amazing food! I've been wanting to try this place for the last 2 years. It has been bookmarked, but we finally went last night. We shared the meza plate, and their mixed grill (chicken, beef, kofta kabob). We ended the meal with the most delicious tiramisu. I was hesitant to order tiramisu at a Greek restaurant, but boy it was so much better than a lot of Italian restaurants I've visited. I'll definitely go back."], ["Reena D.", "Why I didn't check out Cafe Medi sooner??!!  We were greeted and seated quickly.  We ordered the vegetarian plate to start off with.  The falafels here were amazing.  It was perfectly cooked and not dry like other locations I've been too.  The Tzatziki sauce was perfect as well with the falafels.  The hummus here is fantastic with their fresh pita bread that is given to us when we are seated.  I ordered the Chicken Shawerma wrap.  The chicken was very moist and flavorful.  It came with their tahini sauce which was really good.  It had to be one of the best Chicken Shawerma pita wrap.  I subbed the fries for the house salad with the Greek balsamic dressing which was really great as well.  We all enjoyed our meals and I can't wait to go back here to try other items off the menu!"], ["Taylor V.", "Yikes! Flies everywhere. We sat down INSIDE and there were flies everywhere. We moved...still more flies. We had to pack up our food to go, it was disgusting. Made me not want the food even at home. If there are that many flies in the dining room...imagine the kitchen? Gross."], ["Kristy S.", "Couldn't be better. Great value. Fantastic food. Charming wait staff. Love the lamb souvlaki and mixed grill!!"], ["Larry C.", "Very good food.  Reasonable prices. Great staff , very helpful.   We had kabobs and they were very good along with rice and green beans, very good and filling.  We will be back often."]], "Al Wadi Cafe": [["David W.", "I came her once, and it was awesome. They had a buffet set up, and the waiter was great. He made me laugh the whole time. Their good was delicious. I have never tried Greek food, and I was welcomed. I will return."], ["Bryan W.", "Yeah this place was pretty good. The cauliflower was excellent. Must try it.Went back and had lamb chops.  Worth checking out as well!   So far everything has been great along with service!"], ["Kennasha J.", "I love this restaurant - especially the buffet on Sunday, Tuesday and Wednesday. I have enjoyed EVERYTHING I tried ob the buffet line - u can't go wrong! The food is consistently fresh, flavorful and appealing to the eye. The service staff is friendly and the restaurant is clean. The decor could be a bit more exciting but that is the only thing lacking."], ["Don J.", "Surprisingly good Middle Eastern food for being in the middle of a North Texas suburb.  I live a couple miles away and eat here 6-8 times per year.  I've never had a bad meal.  My favorites are kibbeh, a deep-fried meat and pine nut concoction; the sirloin and chicken kabobs; and the kafta.  If you get the dinner, definitely spend the few extra coins to upgrade to the Greek salad.  The hummus is pretty good.  The falafel is okay but not as good as some of the other items.  My favorite three things about this place: (1) BYOB; (2) the outdoor patio, where you can enjoy the plants and order a hookah if you like; and (3) the friendly service."], ["John B.", "Not a solid 3 stars--probably more like 2.5.  We went for the Sunday buffet ($12), and although most items were passable, nothing stood out as \"really good\"--the trouble with most buffets.  I specifically asked about lamb before visiting and was assured that lamb was included.  There was lamb in the gyro meat, but it suffered from dryness from standing out too long, and another dish had lamb with okra.  However, it was overcooked, and they didn't bother to throw away any of the fat, and half the people in the world (at least!) hate okra so they would pass on this dish.  (Hate to think that's what the owners had in mind, but I have my suspicions.)The biggest disappointment was the so-called dessert that was included.  Imagine baklava without the walnut filling--what an utter disgrace and a scam!  Oh, there may have been a few  ground up nuts in there, but they could scarcely be found, and it was just too obvious that they were cutting corners to save money.The place is tiny so it was packed, with folks waiting for tables.  The owners might spend a little of their earnings to dress up the surroundings--pretty drab!"], ["Anita D.", "This place wasn't bad! I ordered the Chicken Shawarma Pita wrap, and it was okay. I don't really know why I ordered it since I don't normally like pita wraps because in general they're dry. I probably wouldn't order the dish again, but I think I will definitely come back because the dolmas are soo good!! For anyone who is wondering, I have a slight obsession with grape leaves stuffed with rice, also known as dolmas. I sometimes rank Greek restaurants based on their dolmas. Our waitress was superrrrrrrrrrrrrrr nice. I am adding all of those \"r\"s because I cannot emphasize how nice she was! I think I'd like to come again to try their Chicken Shawarma Platter.So for the service and the dolmas, I give this restaurant 4 stars, and would not hesitate to come back."], ["R J.", "Been a while since we have been here, but it's a very basic platform for middle-eastern food..."], ["Tater J.", "Everything I've had here is delicious. Some of the best hummus I've had. The service has always been great too. Don't miss out on the chocolates they have for dessert too!"], ["Kali H.", "This place was absolutely horrible. I came here for lunch on a Saturday with my stepmom who swore up and down it was good. The service was horrible, the waiter handed our drinks through the open window sort of thing on the opposite side of the wall that we were sitting in. Rude. And then there was this whole big deal when we wanted to substitute something for dolmas on the mezza plate. Their tziki sauce was bad. I ordered a falafel pita as well, sure those were frozen french fries. Will never come back."], ["Laura A.", "Had the chicken shawarma and it was yum!  The baklava was good also :D  Love the fact that there's a Greek store right next door if I want to stop by and grab a few things for the house."], ["Txgirl M.", "Food was great and so was the service. Will try again."], ["Diane T.", "I had been meaning to go back after I wrote my original review, but somehow hadn't gotten around to it.  After seeing a bit about them in the FW paper last week, I was reminded.  Plus the article mentioned that they do a lunch buffet on Tuesdays and Wednesdays (a sign posted in the restaurant notes a lunch buffet on Sundays, as well).  I decided it was time to go back and check it out.I got there about 11:30 and there were only a few other diners.  By noon, the place was mobbed so I was really glad I got an early start. The buffet is an excellent deal for $8.95.  Everything I had was tasty, but of course some things stood out for me.  The baba ganoush was deliciously smoky and smooth.  The tabbouleh was refreshingly lemony and light (I ate a LOT of it).  The fattoush was good but I like it better when mint is used as one of the herbs (a lot of mint).  There was hummus, cuke and tomato salad, dolmas, chicken kabobs, (what they called) beef shawarma, beef meatballs, a couple kinds of rice, fried fish, and quite a few other things that I just don't remember.  It's a great way to sample a lot of things without committing to an entire plate of it.  And needless to say, I was quite stuffed when I left.Service was friendly and my iced tea was refilled promptly.  The restaurant itself could use a facelift, but it's clean and serviceable.  I'll definitely be back.  The lunch was too good to wait another two years!"], ["O S.", "Decent Mediterranean food, with a reasonable buffet, they need to make fresh bread and improve the outdoor seating."], ["A W.", "It is an average place. We decided to stop by on the way to Fort Worth Botanical Gardens. The Sunday buffet was limited. Gyro meat and chicken kebabs are lukewarm. Hummus and baba ganoush were all right. Falafel tasted better than it looked. Some dishes were too salty. Baklava was dry."], ["Lisette A.", "Delicious food, great music, and very friendly staff, Alwadi is one of our favorite places to go to. I like the vegetarian platter and the hummus is some of the best I've tasted. I also love the date drink--delicious! The husband son love the lamb and platter, gyros, and schwerma, and we all love the baklava. Alwadi is one of our \"go-to\" restaurants.We haven't tried the buffet, so I can't speak to that."], ["Trini R.", "Dining period- Lunch, BuffetAmbience- hmm not so shabby, but the food is good!Food - Tasty, nice selection.Dips- the Baba Ganoush is awesome, quite smoke, just as other reviews specified.Particularly like the falafel & chicken shish kabobs.Desserts: Baklava + rice pudding. The baklava is awesome.**Remember to get your card- after 7 meals, y ou get the 8th free."], ["Emilia R.", "Another wonderful local family run business for us to frequent! I had the shwarma chicken & beef with tahbouleh & hummus. Very flavorful... the hummus was exceptional! For dessert I HIGHLY RECOMMEND THE SHAABIYAT!!! It's a welcome departure from the typical sickly sweet baklava. Just enough sweetness. Combined with the Lebanese coffee it's the perfect finish to a pleasant casual warm dining experience."], ["Larry E.", "Call it shwarma, shawarma, shewerma or whatever other spelling you like, it's hard to find the good stuff in DFW.  Developed a taste for the sandwhich version while in Vancouver, BC last summer.  In Vancouver it seems like the shwarma and donair shops are three-to-the-block and all delicious which made the last six months seem so unfair.I can't say that the chicken shwarma at Alwadi is quite as good as the shops in Vancouver just because you don't get all the options for delicous fixings (red pepper paste, yum!) but it is easily the best shwarma I've found in the six months since I've been back in Dallas.I wish I lived much closer to this place!"], ["Emmy N.", "I am so down with this place.  When we first came up on it, I was hell of suspicious, mostly because of the depressing nature of the stores surrounding.  When we got closer, I was pleasantly surprised by the patio and then, inside, I was even more surprised by how nice and cozy it was.  The music was awesome...like sexy Aladdin with Jasmine belly-dancing instead of getting her ass kidnapped or whatever.The food itself was very good.  We started with the dolmas.  I usually hate beets with the kind of passion reserved for skinheads and telemarketers, but I found myself nibbling on the pickled beet garnish anyway.  The tzaziki sauce was the best I've had in DFW yet - thick and goat milky, unlike their watery, bland competitors.  The dolmas themselves were good, but typical fare.  I then had the avgolemono, which was a bit on the bland side, but dill-ightful (sorry).  Most of the pita chips that came with were a bit burnt, but those that weren't were tasty, though I can't say they really added to the soup.  I really liked the house salad dressing as well and will be attempting to recreate it at some point.My entree was the lamb kebabs with rice and hummus.  I really dug the hummus, mostly because of the quality olive oil they garnished it with.  Rice was good.  Kebabs were fucking money - well-seasoned and impossibly tender.Service was decent, especially because we came in close to closing. Our  server was this precious little white girl.  This older dude was helping her run food and he was...a little brusque.  I guess.  What I mean to say is he scared me.  But other than that, it was good.  Price was good too.  I'm excited to come back."], ["Franz Z.", "Good Mediterranean food (Greek/Lebanese), especially for the price.  Sometimes you have to just try the holes in the wall, and although I don't like the HEB mid-city area, I read other reviews on Alwadi that convinced me to try it.We had dolmas, mama ganoush, shawerma, gyro, greek salad, lemon soup, rice pudding and baklavas.   It was all decent, with something missing from the lemon soup, and the baklavas was almost honey-less.  However on the whole we were very happy.  Definitely doing this place again when I have the craving for that type of food or in the area!Don't forget it's BYOB."]], "Byblos Mediterranean Lebanese Restaurant and Hookah Lounge": [["Dina G.", "My beau and I enjoyed happy hour: $2 margaritas, a half- priced bubbly hookah, and a brick oven Greek pizza. Marios made sure we felt right at home, and the ambiance was fantastic. We will definitely revisit Byblos with friends and family. Thank you for the wonderful experience!"], ["Jay A.", "Here's a few notes from our visit: (this is long, guys)1. I walked in a little late, after some of my party already had drinks. The waitress never asked me for my drink order. She did finally bring water at least...30 minutes later.2. My sister ordered the stuffed Cornish hen. The menu says to allow 20+ minutes for cook time. The dish came out after about 5 minutes. My sister did not like it and barely ate any...she sent it back but they didn't offer to refund her money. A couple hours later (yes...we were there for 3+ hours), we looked over and were horrified to see a tray of 5-6 cooked Cornish hens sitting out on top of a tall appliance. They were still sitting there when we left. 3. Aside from my sister mentioned above, everyone else's food took *at least* 45 minutes and everything came out at different times. My food took over an hour (beef kabobs & rice).4. My mother ordered the stuffed squash. The waitress asked her if she'd like shaved lamb or ground beef. My mother said \"shaved lamb.\" When the dish came out, it had ground beef in it. When my mother asked about the lamb, the waitress insisted, \"That dish does NOT come with lamb.\" She then proceeded to argue with my mother about it.4a. So I heard of something else that happened that night. Our friend also was asked if he wanted beef or lamb. He said lamb. When his meal was brought out...it was a ground meat. He gave the plate to the waitress and asked \"Is this ground beef?\" And she said, \"Yep!\" Then he said, \"I ordered lamb.\" The waitress then lifted the plate to her nose, took a big long whiff, and said, \"Oh yes, this is lamb.\" 5. I think the waitress knew we were dissatisfied with her service, but she did nothing to remedy it. Oh ok, at one point she came by with 2 random salads and said \"Who wants an extra side salad? They're freeee!\" as if that was an amazing offer.6. We were there so long (not by choice...that was mostly time spent waiting around for food) that we saw both belly-dancing performances (one at 8 and one at 11).7. My other sister ordered a cheese pita and french fries for the kids...these took the longest to receive. They were finally brought out around 10pm (perfect meal time for children). The fries weren't fries...more like homestyle potatoes. They were sizzling hot...so you'd think they were fully cooked...nope, when they finally cooled down and we could touch them...they were completely hard and raw on the inside. Yum.8. Everyone, except me, said their food was bland. There were lots of full plates, if you know what I mean. My food alone is where the 1-star comes from. So...if you have to go here, get the kafta kabobs I guess. But tell them eeeaasy on the onions! It was covered in raw onions (I LIKE raw onion...but this was too much).9. When we were ready to go...we couldn't find the waitress. This isn't really a big place, but she was nowhere to be found. Finally, we saw that she had emerged and was at the computer. She was there for, I kid you not, 25-30 minutes trying to figure out our checks. 10. We were charged an \"entertainment fee.\" LOL. $1 per person.------Since my food was decent, and I guess I was in a chill mood, I was ok with my check when it finally came. My total was $20, which included kafta kabobs, water, and crappy service. But...I really feel bad for others in my party who paid $100+ for horrible food that they didn't eat. No compensation was offered...so I'm gonna have to say the waiter service and customer service here are appalling. Maybe this girl was new.....but IF she was new, why on earth was no one helping her? And...her being new has nothing to do with the speed of the kitchen.... And...why didn't they care that customers hated their food? And....none of that can explain why a tray of cooked meat was sitting out in room temperature... So, ONE STAR - for the kabobs. And because I have to put at least 1 star."], ["Chris J.", "Great Lebanese/Middle Eastern food. The week day offers a buffet that includes a large variety of Lebanese dishes. The buffet changes from day to day but always has the tabouli, hummus and rice.Thursday,  Friday and Saturday evenings offer belly dancers for entertainment.The dinner menu offers a large selection of Lebanese favorites. Reminds me of the old country."], ["Yush K.", "Incredible! Best lunch buffet! Best price for lunch buffet ;)Their coffee is great it's included and so is baklava :)The kibbi is tasty and meat is very fresh.They have very tasty babaganoush and green hummus.Gorgeous restaurant ! They have an incredible hookah lounge with alley style balcony. There is also full bar ! Best place in Fort Worth!"], ["Shonda M.", "My coworker and I stopped here for lunch on a Tuesday. There aren't many options in the area, aside from Mexican, burgers, or steak. It's located in a historic commercial block and has a fabulous neon sign out front. For lunch, you can either order off the regular dinner menu, or you can get the all-you-can-eat buffet. We each chose the buffet, since it's only $8 and was quite large. It was delicious! There was a variety of Lebanese and Greek foods, including several versions of hummus, gyro meat, Greek salad, and warm pita bread. In addition, there was also several other options, including fried chicken, and my favorite, roasted Brussels sprouts. For dessert, there was also a variety of sweets and fresh fruit, including watermelon, cantaloupe, and mango. All in all, we were each very impressed. I would recommend this restaurant to anyone passing through the area."], ["Brayden B.", "I loved this place! I have been going here for about 6 years now. I love all the staff and their willingness to get to know the customer. The hookah and food are amazing. Every time I'm here I meet someone new."], ["Susan A.", "This was my first time here and we were early so it was not the least bit crowded. Service was great. It was clean, well lit, and the sound wasn't LOUD.. The Beef Schwarma was WONDERFUL.. Flavorful, tender, the rice was fabulous! The bread was fresh and hot.. I will be back for seconds! Will have to try the buffet!"], ["Aaron W.", "If you go for the buffet its ok but for dinner its about 25 bucks a person and the food is very well prepared but very tasteless. If youve eaten at any other arabic resteraunt you would not call this arabic food. Its like a good cook that had never eaten arabic food made it from a cook book. so bland such a waste of money."], ["Gowthami T.", "Ambiance is nice but the food was mediocre.  I order the chicken shawarma plate and the meat was salty and dry. The drinks we ordered were pretty crappy as they were too sugary and not enough alcohol in them. this place does have a nice hookah lounge which I would recommend but don't go here for the food."], ["Sylvia E.", "Great lunch buffet. Liked the lamb gyros and salads! Definitely going back with my lunch crowd."], ["Lauren M.", "Save your money, skip this joint, seriously. Having traveled around the world and lounged/dined at many establishments, I can say with full confidence that Byblos was by far some of the worst service and drinks I have ever had. Upon walking in, I had already stepped into the hookah lounge when a waitress with curly hair demanded my ID and for me to step back out into the lobby. No greeting, just plain rudeness. I felt like I was in trouble. After scanning my ID, she just sat at the computer so I walked back into the lounge and had a sit. About 15 minutes later, a young waitress walked in and just bluntly asked me \"Do you know what you want?\" I was dumbfounded and asked for a menu. I was handed a hookah menu only. She had no suggestions other than \"they're all good.\" I settled for the hubbly bubbly Blue Mist with Ciroc. Placing this order was like trying to talk to someone who speaks no English or else is totally lost. Was rather awkward. She ran off and I tried to flag her back down for a drink menu, meanwhile, another waitress who looked like an angry Morticia Adams came in and asked if we were there because we were bored. What? Are you criticising my choice to visit this establishment? Maybe it was an indirect sign that the night was going to suck and there must have been no other options for entertainment. 20 minutes go by and finally I am able to grab the waitress and ask for a drink menu. I got the Bahama Mamma and my friend  ordered the jalapeño cucumber margarita. We asked for specific liquors and she looked like a deer in headlights. I probably got well but paid premium. Hookah is just now arriving. Drinks take another 20 minutes and are super ugly. My drink just had a measly marichino cherry stuffed onto a Southwest Airlines looking cocktail thing sitting across the top of my drink. It rolled off the drink when I sat the cup down. My friend had a huge, hideous, dirty, and wilted cucumber slice on hers. Neither of the drinks tasted good, we're overly sweet, and I doubt there was any alcohol in them. The hookah was alright but about 2hrs in, we were way past ready to go. We asked for the check and the waitress never brought it so we asked someone else to bring it. I paid with a card and my friend paid in cash and we asked for the check to be split. Apparently this was super confusing for them to half a 50$ ticket. After one waitress said it was all another ones fault, it finally got taken care of only for my friend to be shorted by 10$. When we immediately notified them, they acted as if we were crazy and pocketed ten to try and get ten more dollars. Needless to say I will never go back here ever again. I wanted to just get up and leave about 30 minutes into my visit. Management obviously has no idea what they're doing and none of the girls communicate well, have manners or any type of service industry hospitality training. Too bad since it is a nice place and different for the Fort Worth area. This place needs to be on Bar Rescue like yesterday!!!"], ["Brennon H.", "I came here on a Wednesday.  They have a weekday deal going for 10 bucks. Then I got an \"Appetizer\" that came with 20 dishes for 20 bucks!!! Me and my date were stuffed and satisfied off 30 dollars! The lounge provided a relaxing exotic atmosphere to eat and smoke and our server, Mario, was great.  I felt like a king! Or a Malik."], ["Ben M.", "The place has a quiet atmosphere if you go in before the evening show.  The food is good, but you probably won't like everything they have.  That said, it is a real treat for me to find some food haven't tried before, and the desert was amazing.  Finally, the service was just fine."], ["Kelsie M.", "Lunch buffet is delicious! Fresh, filling, and healthy! Service was friendly and fast."], ["Pamela B.", "Went to Byblos just for appetizers. My friend's appetizer came fiirst. Had to wait 1/2 hour after he was served to get my appetizer. We were the only cisromers in the restaurant at 9:30 pm. Waiter did not apologize,  never came to refill water. Hid in the kitchen so he would not have to.face us. By the time my.appetizer arrived, my friend was finished dining.Will not eat here af again."], ["Cristal Y.", "The food portions were very generous and tasty! I had the Mediterranean salad with gyro. The boyfriend had an appetizer sampler. We had a few bites of a friend's lamb and it was soooo good! The lamb was very tender and flavorful. We went for a friend's birthday party and it was soo much fun. They belly dancer there was a great form of entertainment. She taught some of the girls AND guys some belly dancing moves. Overall, very great belly dancing experience. Thennnn, we moved to the hooka lounge! This place is  like a 3 in one! I didn't do much of the hooka, but it was nice that the lounge area could accommodate so many people. We were a party of 15+ and we all sat very comfortably. Definitely will come back!"], ["Elida P.", "Hands down the best restaurant in the metroplex!!!!  The uncompromising quality, freshness and taste of the food is simply exemplary!  I have been going to Byblos for years, and have used them to cater for everything from my baby shower to corporate events.  Aside from the most exquisite buffet, and evening dinning experience, Byblos also offers a full service catering is which is amazing!   Complete with delivery, all utensils and embossed serve-ware that you get to keep :)  The owner Marios is just a great person, always easy to work with, so accommodating and a visionary of the culinary experience, with regular Belly dancing events, wine-tastings, book signings etc.  He always makes you feel like you're family when you visit.  If there were 10 stars, that is what I would be giving Byblos.  Bravo!"], ["Donna W.", "it has a cute environment.  i'm not sure that the food is anything spectacular, but it was adequate and there was plenty of it.  $12.95 for middle-eastern buffet on a Thursday night.  that's darn good.  and they were more than accommodating of our group of 20+ people.  Apparently its a little sketchy about when or if you will actually see the belly dancing.    I went thinking that there was a show on Thursdays but sadly ... NOT.   but the parking was great, the service was adequate, the food was adequate, the atmosphere was more than adequate."], ["Kym B.", "Had an amazing time here as our first time for my friends bday dinner and hookah. Their food was good!!  We had the gyro plate and the chicken schwarma plate, very tasty and full of flavor. Their pomegranate margarita  and some watermelon martini were really really good.  Love the atmosphere and the paintings they have on their walls, great service from the manager and the cook, and hookah was pretty good as well. We had the heaven can wait hookah and relaxed at their lounge and patio. We will definitely be back :)"], ["Victoria B.", "This is one of my favorite places to eat because of the food.  The service always sucks.  It is not uncommon to arrive and be the only people there, but still have to wait 45 minutes to an hour for food.  Again, I do not go for the service, but the food.  If you are in a hurry go for lunch.  The lunch buffet allows you to try almost everything on their menu without the wait."]], "Prince Lebanese Grill": [], "Gyros House": [], "Opah Greek Flavor": [["Christine C.", "Yeah, so most of our visits to Hulen Mall is straight to the food court just to eat here.  THE best gyros you can get this side of Ft Worth.  I mean damn, they have this one gyro combo in which the gyro is COVERED in jalapenos.  The same guy always works here, openly shaving a lamb shank.  And there's nary a line, either.  I don't get why there's always a line at the Panda Express next door.  Just wacky.The fries are perfect.  They also serve these gyros up with onion rings or fried mushrooms.  And BEER. These people totally have a liquor license.  It's a freaking mall food court and I'm drinking a Dos Equis.  Just brilliant.   They also have a breakfast menu.  I'm not sure what the hours or nor what's on it, since I never notice it til I'm seated.  Be prepared to be stared out by other mall patrons as you eat.  We call it \"food envy.\"  So think outside of orange chicken, mall rats!!!"], ["Russell R.", "One... this is the only place in Hulen Mall that you can get beer (or wine).I know.... that's crazy that you can get alcohol in a mall, right?Anyhow, the food is great! (Especially for food court food).It's a bit pricey (convenience),  but you get a lot for the money.The gyro meat is a little dry, but that's fixable with the cucumber sauce. Check it out (if not on a budget)"], ["Daniel S.", "Opah Greek Flavor can be found on the second floor of the Hulen Mall food court.  Amazingly, Opah deserves all of the five-star ratings seen on Yelp.I tried the large gyro and it was the best I have ever had.  There must have been a half pound of fork-tender meat stuffed inside.  The flatbread was perfectly toasted and the veggies were fresh.  Overall, the flavor was very impressive.I still cannot believe that the best gyro I ever had was served in a food court at the local mall.  I really do not like the mall, but will visit again if only to try more Opah dishes."], ["Raquel S.", "The food here is delish. I had chicken souvlaki, and the cucumber sauce is AWESOME, especially with grilled tomatoes and onions. OM NOM.HOWEVER, the only reason this place didnt get 5/5: the girl working there had some serious attitude that night. Charged us $.25 for extra cucumber sauce, which came in a tiny paper cup? What gives? Sad day guys."], ["Angela B.", "I hate that I have to go out to hulen mall when i want some greek food but at least it's good.  I don't usually write reviews but the guy at the counter was so nice and I saw the yelp tag so I decided to give them a quick review.  I ordered the traditional gyro and I opted for the combo because I wanted a soda. The only choices for sides though were fries or greek salad and I'm not really a fan of either so I just got the fries I didn't eat them though because the gyro was HUGE!  That was the best part.  I didn't even get through it because it was so big.  The only thing that disappointed me was that I asked at the counter if it had tzatziki sauce because I love it and they didn't put enough on.  Really it was a dollop on one side.  Would be better if it at least covered the whole gyro.  Other than that it was great and I left feeling satisfied."], ["Hanna V.", "its just mouthwatering delish"], ["Jennifer H.", "So glad I came!!!! Food is great! Lamb is moist. Will be back :)"], ["Theresa M.", "I had forgotten how good their food was until today. I used to work in the mall and always ate their greek salad with chicken. I have missed it!! Awesome service and awesome food as always. The fresh pita bread and salad could not have been better. This little place is a true gem!!"], ["Randy G.", "Very good place. The cucumber sauce is a little more sour than what I am used to but very good. The cheese fries with bacon are awesome even though they are just made with regular old nacho cheese from a can I think."], ["CJ H.", "Great Greek food in a mall? Believe it or not this place is rockin it out on the second floor of Hulen Mall. I have been known to brave the crazy mall teenagers just for a container of their hummus. The Greek salad is delish, and the gyros are stuffed full of goodies and super tasty."], ["Mick R.", "We recently stopped at the food court at Hulen Mall and since I wasn't really in the mood for chinese I decided to try a Gyro and side salad at Opah's. Was I ever glad I did. The side salad was good but the Gyro w/cucumber sauce was amazing.. I highly recommend this place - the five star ratings are definitely well deserved!"], ["Jamie H.", "I just want to scream \"OH MY GOD!\" the best ever gyros any way you want it with the most flavorful meat! I told the manager he needs to move it to Irving so it can be loved by me more often. Btw- 4.59 for an original gyros."]], "Cafe Medi": [["Sergio O.", "This is our go to Mediterranean restaurant . Their sampler platter is exceptional and more than feeling  for two people. They're mix grill is to die for. Would highly recommend this place, if you're looking for Mediterranean food"], ["Cristina S.", "Went again recently and the food seemed better than the last time! My chicken dish was incredibly tender and the appetizers we enjoyed were fantastic. The service could not have been better - really attentive which was great as it was extremely crowded. That is a huge plus in my mind. Also, discovered they have a lovely back patio which I know I will enjoy this spring / summer!"], ["Patricia E.", "Took a friend who had never been - started with baba ganoush, then she had the pastitsio on my recommendation, and I had the special, stuffed cabbage. As usual, portions were MORE than ample and food was fresh. Only drawback this visit is our waiter was not very attentive, not the norm. Food took a bit longer, but tasted fresh, so worth the wait."], ["J P.", "Hands down one of the best places in town to eat.   Food is amazing, staff is wonderful.   Be hungry, portions are huge.    Being Greek, I am very critical of Mediterranean food.   You won't be disappointed."], ["Ryan M.", "Reasonably fast service and large portion sizes. Split my entrée with my wife and we had plenty plus the hummus appetizer, which was really good.  Location is right in the heart of Old Town Keller.  Good stuff - great date night start off location if you plan on staying near Keller."], ["Arline R.", "Love this place in Colleyville too. We love Mediterranean food! Although Greek. Isn't our favorite, we enjoy their food and most of the food is really fresh. I would recommend it for the food and the ambiance. Nice place and nice people. I'll eat here again and recommend it. Pretty good!"], ["David V.", "One of my favorite restaurants. This new Keller location makes the drive so much shorter. I hope they succeed as this place seems kind of hidden. I had the gyro pita wrap and tzaziki appetizer. I enjoyed both. I highly reccommend. I've tried the hummus as well, very delicious."], ["Debra A.", "Amazing food. I loved every single bite.  The falafel was melt in your mouth.  Pita bread was homemade and hot."], ["Tracy S.", "AMAZING!  Been driving to Colleyville location for years.  Food is fantastic.  Love the tenderloin.  Meat is tender, great seasoning and huge portions.  My daughter always get the Pastisstio, which she call Greek lasange.  Excited for cooler weather to enjoy the patio."], ["Tony D.", "I love this place! Not only for it being the only Hookah place in the area, but the food has always been so tasty. I almost ate my fingers off! Definitely recommend this place for everyone. Dont let the outside fool you."], ["Wicked A.", "I was super excited for this experience after hearing great things about the original location! We arrived for a weekday lunch. It was fairly busy. We were seated at a booth that was against a back wall. We weren't even all seated when we noticed an extremely pungent odor. I do not exaggerate. This smell was strong enough that we decided we would not be able to consume food at the table. We noticed the table was against and sharing a wall with the restrooms. We moved..however the smell as never 100% completely absent : {We perused our menus and were surprised by some of the offerings and very honestly: the prices for lunch hour. Very recently we had a second visit to a Greek restaurant on 7th (ft worth) with an extremely polished decor - and the dinner prices are comparable to the lunch here at Medi. I wasn't impressed by all the upcharges and add ons, substitute charges. We ordered some basics- chicken dishes and lamb. As everyone else has stated: green beans are canned. For the $$- not what is expected. Just to follow up regarding their 'odor issue' : the restroom was worrisome at best. The commode had some strange contraption attached to it. There were at least three devices in the (single) bathroom that provided deodorizing spray on demand. (!!!) There was also an extra table for the dining room INSIDE the bathroom. I visited on the way out. For me, masking or band-aiding issues is a problem. If you cannot make repairs properly or have the dignity to care about it-- then I will have the dignity to stay away from dining here."], ["Steve M.", "Nice to get a little variety in the neighborhood without the drive. Came in for lunch and was seated quickly, though service was a little slow. There was a big party of very chatty ladies coming in at various times. Typical Greek fare so I had to get my gyros going.I was looking for something small in addition to meal so asked friendly person going by who suggested Baba ghanoush. I appreciate how he offered half order since portion was big so I tried.Pita bread was nice and warm and they made regular rounds to refill my tea glass. Prices very reasonable and nothing super expensive on menu (though I did not try any of the fish on the menu board). I really liked their side salad and the gryos meat was good. Will definitely return."], ["Stephen L.", "Walking up to café medi can be a bit underwhelming with the appearance of a remodeled old house and a bland ramp. BUT...once inside it is cute and private environment that suits well to groups of friends or those out on dates. The food is delicious and the service is pretty good. The biggest thing for me is the food, delicious and inexpensive. Cooked to perfection, delicious, and makes me feel like I stepped out of Texas and into my big fat Greek wedding. My wife and I love this place. Also fyi it is byob."], ["Mary N.", "Dont know how the people are rating this place. Unfortunately my husband wanted to give the place a shot.I would have left after entering the front door.It was not clean...the walls were dirty just as you enter.So we sit down..get soda in dirty/glass, like old food stuck to it ...get a dirty knife.Looking to my left is a broken chair.  Food was terrible, I did not eat, told the waiter it was too much...as my husband does not like complaints.My husband gave them a good shot as he even had desert.The one star was for the waiter that was friendly. UG, we will not be back."], ["Castillo F.", "Everything was great!!! I have had my share of Mediterranean food in every city I have visited and I have to quote my husband \"a hidden gem!!\""], ["Samantha S.", "My mom & I decided to do our birthday lunches here, and it was a great choice. We've been frequenters of the Colleyville location for a couple years, but their new location is incredibly convenient for those in the Keller area. The food was fresh and tasty, and the service was friendly and fast. We went in at lunch time on a Saturday, and the restaurant was comfortably full, without a wait. Our group of 5 ordered from the lunch menu, and shared the Mousaka, Gyro, Kefta, and Shawerma. All were delicious, and reasonably portioned for around $10 each. We got complimentary desserts for our birthdays (and a couple more for the table, since we were not sharing!) and sampled the Lemoncello Mascarpone Mousse Cake, Bananas Foster Ice Cream Cake, Tiramisu, and Galaktoboureko, all of which were tasty and worth the calories. For those looking for a traditional Mediterranean dessert, the Galaktoboureko was delicious, but our entire party regretted not ordering the Bananas Foster Ice Cream Cake, which was sublime. The Lemoncello Marscarpone Mousse Cake was tart and flavorful, but would have been better paired with a romantic evening and an espresso."], ["Sarah S.", "Wow! I came in to have a quick lunch by myself. I ordered the souvlaki lamb with the fattoush salad, green beans, and babaghanoosh. The salad was the least favorite part of the meal. It was good but not great. Next time I will get the tabouli for sure!!! The green beans were the best I've ever had! Sorry mom! Babaghanoosh was excited served with warm soft pitas! The lamb was cooked to medium perfection!! The service was great too! Can't wait to come back!!!"], ["Dennis O.", "Food is out of this world. Prices are great. Service is top notch. They give you tons of food at a very reasonable price. Chicken Shawarma is different, but wonderful. Vegetarian plate is a must."], ["Kyle R.", "If you're looking for shawarma after you've conquered aliens and saved the world, this is the place. Delicious food, fast service, low prices."], ["Christine N.", "Went to try it out based on a friends recommendation.  So glad I did!  The food was fabulous and very beautifully presented.  The kids menu had great options which were really tasty too. In the end the whole family was happy!"]], "Chadra Mezza & Grill": [["April M.", "It was around 5-6 on a Thursday evening and the place had a steady flow of customers that sat and ate for a long time like us.Because the portions are huge! I had the gyro ($9) which filled me up for the rest of the day and made up for my saving my appetite for this dinner. Really good. Enormous. I cannot emphasize that enough. I honestly could have split it with my friend who had the Kafta (?) sandwich which she said was good too. Both of our meals came with fries. My plate had a good amount but my friend noticed her unequal and small amount of fries and told me she considered asking the waitress for more but luckily the waitress came out at the same time with two baskets explaining that the cook actually noticed but just wanted to get our food out first. So yay for both of us! After my gyro, I somehow mustered the space to order a scoop of their Turkish Coffee ice cream which I crave to this day. I'm not one for coffee but this one was the right texture and authentic. Lord have mercy, I'm so big on texture. And this ice cream was smooth and had coffee grinds in it which gave it this complimenting graininess. It was only $2 for the scoop but it was a really small scoop. The disproportionate scoop was amplified in the already tiny bowl it came in. Overall, my experience was super worth it. The food exceeded my expectations and I liked the environment and that general area in Fort Worth."], ["Jim S.", "Gyro and hummus were very average, hummus lacked much taste and pita seemed store bought, thin and Luke warm. Italian dishes on the other hand were outstanding, meatballs were awesome and sauce was perfect to my taste. Eggplant lasagna was very tasty. First time there and in the hood so we'll be back and focused on the Italian side of the menu. Side bar on seating there were only 2 sets of guests at the restaurant and we were seated at a small table as a couple, when food arrived waitress asked where to put it?? Just a pet peeve ...why sit us at a small take when there were 40 open and as a server..figure something's out like where to put the food."], ["monserrat a.", "As new residents of Fairmount this was a neighborhood staple that was on our bucket list.  When we walked into Chadra Mezza i cannot express how excited we were it smelled delightful, there was a great Friday night vibe. The bar was fully loaded w great spirits. Our bartender Thomas immediately  greeted us and made us feel completely welcome.  He was relaxed yet professional. Funny and suggested we go with the $18 buffet as first-timers there so we can try a little bit of everything.My personal favorites: hummus, so fresh and garlicky, babaganoush, the tilapia, juicy thick pieces of gyro, the pizza, lamb shank, the grape leaves were so aromatic and lastly the chicken.Honestly this will become our favorite go to spot now. We're sold! And we're not easyily sold but Chadra has impressed."], ["Vichy L.", "The Gyro was a great size and wonderfully flavored. I got full after eating only half of it!! -I mean... I ate the fries, and they were a little cold. But, I had to drive my plate ALL the way home. The plate had a good warm heat to it, but it wasn't too spicy. The garlic knots... man... those were delicious! The restaurant guy was really nice, and the next waitress that saw me also asked if I needed help, so overall. It was a good experience."], ["Amanda W.", "I'm vegan and went in because people recommended it to me and I've always enjoyed it. After I ordered the vegan friendly grape leaves I took a bite and there was actual meat in it! I told my server and he asked if I could still pay for it. I talked to the manager and he didn't seem to care. I'm never going back after being a regular for so long. They shouldn't offer vegan options if they don't really care."], ["Ashley N.", "Chadra, I love you. Your delicious pizza with a crust unlike any other, your chicken shawarma, your perfect falafel. Please don't ever change. Seriously, though you make me want to order the chicken shawarma & the pizza & the falafel just so I can combine the three to make the most glorious shawarma falafel pizza ever. Your wait staff is also extremely pleasant & it's always clean & nice smelling in there."], ["Krista R.", "Chadra, I am sorry that I have passed you up all of these years. I always have intentions of trying you and then I get distracted and I'm like \"OHH, Esperanza's!\" or \"ohh, let's eat at so and so on Magnolia!\". Not this time!We went for lunch. The garlic knots were so good and addicting. I had to be careful and not eat the whole basket! I got the Kabob Trio. I got the chicken, steak, and kafta with a side greek salad. The salad was good, drowned in Feta. The salad dressing was tasty. Some places the chicken and steak are dry, but not here. The chicken and steak were moist and full of flavor. They have a Mediterranean and seafood buffet on Friday and Saturday nights. I will be back to try that!!"], ["Austin S.", "Super nice chef who came and talked to us after I asked our waitress to compliment him on the perfect medium rare cook on the salmon. It was very fresh and delicious!"], ["Adam M.", "I have come across Chadra a few times. They have been at many outdoor music events around Fort Worth. They'll usually have a booth set up with a small selection to chose from. I always enjoyed what I got from them but I always suspected that there was more.Last Saturday I finally made it into their restaurant. It was surprisingly empty for a weekend. We were sat on the patio. It's completely covered so the shade was nice. There isn't much of a view since this place is sort of tucked away.After looking over the menu for a while and not knowing what to choose it was obvious that the buffet was the way to go. That turned out to be an excellent decision! Their buffet has a lot of the same items that are on the menu. So instead of trying to decide on one, I was able to try several. Yes, several.I'm not very big on buffets. Let's face it, most of them aren't that great. I also don't usually eat more than one plate (if it's piled right). Once I saw the buffet I knew immediately that wasn't going to be the case. I was careful to not overload on any one particular item.My favorites were the heavenly chicken and the lamb legs. The chicken was something different for me. I won't pretend to know what herbs or flavors I was tasting but I'm sure I haven't had anything like it before. The lamb legs came with the bone but the meat melted right off. Lamb tends to be a little on the chewy side so having it slow cooked was an interesting experience. I think that's how it should be done.I don't think they have the buffet everyday. I'll be back for it soon though."], ["Denise R.", "Buffet was great and there were so many choices. The heavenly chicken was delicious! I will definitely be visiting again.The staff was extremely helpful. The service was great. It was an overall wonderful experience."], ["Sarah H.", "Their meat is HALAL! My friend and I came in here for lunch and were pleasantly surprised to find this out seeing that my friend only eats halal meat. Their lunch buffet has a lot of options and the staff was very kind. We'll definitely be coming back!"], ["Carol D.", "My girlfriends and I meet here once a month for lunch. Lunch buffet is delicious, the dolmas and garlic knots are fabulous. We love this place. They make their own ice-cream too! Only complaint is there is a parking problem around the restaurant."], ["Viralyn K.", "When I want to eat a lot but don't want to eat bad, I come here for lunch. $10 gets you an entire buffet. I am so in love with their salad bar. I love the fresh veggie options and the dip offerings right around the corner. I don't know the names of all of them, but they're so good. They will have meat and cooked veg options, the veg options don't make me feel too guilty. I usually end with fresh fruit. I always try a little bit of everything and it's always so good. I've been to other restaurants like this kind, but this one is by far my favorite. You can tell love has been prepared with the dishes put out. This is my new favorite spot."], ["Emmy F.", "LOVE this place! My coworkers and I work in the medical district and love to order delivery from this place but last night we decided to dine in when we found out they have a bar and hookah too. The service was excellent, the food delicious and flavorful, and all in a delightful atmosphere! We were happy to see Bradley as he had delivered food to us at work, and he's just as awesome as a waiter giving us everything we asked for and super pleasant. They have Mediterranean and Italian food, which I didn't think go together but it's nice to have both options in one place I suppose.Appetizers - I've had the Garlic Bread with mozzarella cheese, meatballs (3 large meatballs in marinara sauce), and hummus (served with 2 pita breads). All of them are delicious but probably my favorite is the garlic bread and cheese, sooooo yummy! Entrees come with garlic knots which are also good, but cheese makes everything better.Cocktails I tried were pomegranate Cosmo, watermelon mojito (which taste exactly as it's name) and something with midori and pineapple which was ridiculously sweet and my friend described as drinking the beach. I like my sweet martinis so the Pom Cosmo was perfect. They also have a decent beer selection and have a normal bar as well. Entrees - I ordered the heavenly chicken... Which is super awesome! Stuff chicken with cream cheese and penne pasta mixed in a creamy Alfredo sauce topped with spinach and chopped bacon. PERFECT. Love hands down. My friends ordered the grilled salmon, penne a la vodka, and kabob trio which they all thoroughly enjoyed too.Dessert - they offered us their pomegranate and Rose ice cream. Of course we were like, \"what does rose taste like?\" And it literally taste like the smell of a rose. I can't describe it any other way but it was good! So try it if you're curious, it's definitely worth it! Oh and the pom was good too. Hookah was pretty basic, they only had about 3 flavors but the owner was more than happy to bring flavors if we asked for next time. Lounge area/patio was nice and they had the big heater lamps to keep us warm and toasty. I also appreciated the random Indie rock station they had playing (they know what I like lol) The owner also approached our table and was extremely appreciative and super nice and friendly to us! I really love seeing that in family restaurants! Makes me feel much more welcomed and wanting to come back! For a Friday night we got a table for 8 at 8pm seated within 5min. So order delivery or make your way here. Either way you will enjoy it!"], ["Jason T.", "My wife and I with our two kids (2 yrs and 4 months old) went for the Saturday dinner buffet and it was good, but not great. They had a variety of food including lamb, crab legs, baked tilapia, 3 selection of hummus, pizza, heavenly chicken and salad. The quality was not the best of what we experienced in the past.  What they didn't have much were fruits (only grapes, pineapples, and strawberries), and desert. For a buffet, we think they should have more options in those categories.Unfortunately, they did not have any juice for our daughter. The price was $18 which was a bit steep for the amount of food they had. We thought we should have order from the menu. The atmosphere was nice with friendly service and they had a patio if you want to eat outside. We have not tried the lunch buffet yet. The lunch price might match the food they have much better than the dinner buffet."], ["Christie P.", "The lunch buffet at Chadra is AWESOME!!! Definitely go on Thursday when they serve the Heavenly Chicken, and bring lots of breath mints since those garlic knot rolls are absolutely amazing! The Monday night pizza and pasta buffet is also good, though it doesn't have as many choices as the lunch buffet. Their pizza crust is always fresh and chewy."], ["Melondy D.", "As a picker eater, I was nervous about trying this place. I had the lunch buffet with my husband and fell in love. The food was amazing and so was the service. I liked the something-vodka penne, the garlic knots, and the assortment of different meats. My husband enjoyed the endless pizza, lol. I loved the decor and overall atmosphere. I enjoyed it so much I went the next week with a co-worker who was already into this place. I'll see you guys next week!"], ["Meredith R.", "After craving eggplant and reading the yelp reviews, I decided to try the lunch buffet. I sampled the hummus, baba ghanoush, tabouli, homemade pita chips, and the saffron rice. I also had a tomato salad. There were plenty of meat dishes and several pizzas to try as well (but  I'm a vegetarian and have been staying away from cheese lately so I didn't try). Everything I has was extremely fresh. But the baba ghanoush needed something. That was my only tiny complaint.Besides everything on the buffet looking fresh and appetizing, it's also labeled so you don't have to guess. The service was composed of hipsters but they were friendly and attentive. The drinks and pita bread basket were refilled often.I'll be back next time in town. Maybe for dinner. Seems like a great place to drink wine."], ["Lydia J.", "The tomato soup was very good but my main dish, Alabma (sp?) was a little disappointing-the meat. The cinnamon rice was very good, though."], ["Hussain R.", "Probably the worst Mediteranian food I have ever had and I am not a Mediteranian food snob. Everyone on my table ordered the same thing pretty much, meat on skewers. I tried lamb, beef, Kafka, and chicken skewers. Meat was extremely dry, over cooked and was completely tasteless. The rice it came with was extremely hard probably from the bottom of the pan. Extremely poor quality. Food arrived 45 mins after we ordered. I will say the server was nice."]], "Greek Cafe": [["Logan H.", "We found this place on accident one day and have been thankful ever since! Great staff who has really cleaned up the place and made it more open for the larger groups who seem to coming in more often than ever. Music can be a little loud, but the food is amazing. I always get the pita and humus which is amazing and usually get the gyro and fries. All great food served quick and hot. My wife prefers the chicken wrap or the chicken kabob. Regardless, the food is amazing and we try to go about once a week or at least once every two. Great local place!What do ya'll put in the humus!?!?! Amazing."], ["Michael S.", "They left a flyer on our door with their menu which said they delivered. So I called to have some food delivered. I was trying to give him my address to verify the delivery area. He told me their address was on the menu and that I was responsible for figuring out if they delivered to us or not. The guy was flat out rude. So we just called someone else. BVery unprofessional. They lost a customer before we could even try their food."], ["Loren B.", "We visited the Greek Café for the first time with a friend from out of town based on Yelp reviews, and found it to be a bit of a letdown. The food was fresh and the service extremely friendly and helpful. The atmosphere was not unexpected for fast food, nothing bad about it, but nothing particularly special either. I ordered a Gyro sandwich combo, which includes fries, but after 3 PM not a drink (?). Nothing about what I ordered seemed \"prepared\" except the gyro meat, which I'm pretty sure is provided by a vendor in most places anyway. The onions and tomatoes in the sandwich were raw and cold. The Tzatziki \"sauce\" was so much like sour cream it had to be the result of a spice mix stirred into store-bought sour cream. We ordered ranch on the side with our fries and the Ranch tasted exactly like Hidden Valley Ranch poured from the bottle. The pitas were dense and puffy, but also tasted store-bought. The dolmas were quite good, but came with a cup of Tzatziki that is so thick it has to be spread on the food. We also ordered a bowl of melon rice soup, again good but nothing special. I am admittedly a Greek food lover and come into any Greek place with a high expectation for enjoyment. The Greek Café probably works on a fast food level, but for me the flavors and the food just didn't blend well. It was like an American fast food version of a great cuisine. Prices were reasonable. And I can't say enough about how genuinely nice the staff was. They just need to work in the food a bit."], ["Jake C.", "Got 2 gyros, dolmas, and rice all for $20. The food was sensational! The gyros were breaking as you ate them due to so much meat (super flavor). The dolmas were orgasmic. And the rice was so flavorful. If you haven't tried this place your missing out! My wife is a total foodie and when I see her eyes roll back as she takes a bite I know it really is good. Nice staff and cool little restaurant."], ["Una B.", "Totally casual, order at the counter place. There's a few booths and a couple of stools at a counter in the back. Food was tasty, but stick with the greek items. For whatever reason, I saw a sign that said they offered hot wings, and I ordered them in a moment of unclear thought. They were ok, but nothing special. What was I doing ordering hot wings at a greek place anyway? I'm unsure, don't be like me. Pita was soft, veggies were crisp, and the tzatziki was cool and thick. I thought the food came at a good value, and there are also lunch specials available. The lady at the counter was friendly, food was out quickly. All in all, an a-ok place!"], ["Diana W.", "We have been here often for lunch, we usually get the gyro lunch platter which is a good amount of food on one plate.  And the taste is awesome.  All the plates I have ordered always taste fresh and the customer service is excellent.   We  come here often.  It is a small little cozy place, with a great taste."], ["Steve B.", "Great food, cheap price, family run, great place.  Their gyro is good but they make one of the best Philly cheese steaks on the planet.  Mamas cooking in the kitchen, son runs the counter, what other fast food place do you have the counterman check with you to see if you like everything...three times.  Cant wait to go back!  And during the week you can get a gyro, fries, and a drink for around six bucks!"], ["Kristi B.", "Great little gyro place! Would eat here all the time if we lived here. Found on Yelp! Seems like a mom and pop kind of restaurant."], ["Lindsay B.", "So this place is awesome. I'm only going to mention my food because I don't remember what my husband got. We started with pita and hummus which was very good. I got the chicken kabob plate with included a chicken kabob, lots of veggies, and rice. All of it was absolutely delicious. Seriously delicious. The only issue I had was that the chicken pieces on the inside were a bit too pink for my liking. I actually didn't eat those pieces because I was a bit nervous. That being said I wouldn't hesitate at all to eat here again. In fact, I can't wait to go back because my food was just THAT good. This isn't a chain (to my knowledge) and you can tell. The food is fresh and tastes homemade."], ["Stephanie I.", "Great place to grab a gyro if you're in the alliance corridor. They have good lunch specials too. Price is reasonable, I usually order the gyro with fries. My kids even like it."], ["Snaeha J.", "I always enjoy stopping in for a quick, cheap and most of all delicious gyro! Service and food has been consistently delicious. We have also had food delivered and it had been rather quick and hot. I recommend this place to people looking for a nice, reasonably priced Mediterranean meal in Keller area."], ["Carol D.", "The lunch specials are reasonably priced and the gyros sandwich is the best. I love this place when I want Greek food."], ["Bill K.", "It has been good 4 out of 5 times, so I am giving them four out of five stars. Not fancy but it won't let you down."], ["G C.", "Outstanding. Best bang for the buck. Nothing fancy but good food. I had the gyro, Greek salad and some baklava!!! Not much more to say other than DO IT!!!"], ["Tana P.", "So on food and staff alone, this place is a total 5.  I'm only knocking them down a notch for the environment.  If it were less of a dive, my husband would be more open to regular lunches and dinners here.  Only thing missing from the menu is some spanikopita. Seriously, some of the best greek food to ever hit my blood stream, was from this little hole in the wall.  Totally authentic.  YUM!  Speaking of... I'm hungry right about now."], ["Drin L.", "Hey there i really want totell about my first experience in this greek cafe and i really liked it. The gyro was delicious, very quick and the staff was very friendly and kind. I suggest everyone to go and try the magnificient Greek/Mediterranean cuisine.Cheers!!"], ["Elisha W.", "It was my first time ever trying a gyro..... I am now HOOKED! I go back weekly for more! Even my picky eater daughter loves them too! I can't believe I haven't tried a gyro until recently! My friend loves gyros too, and she said they were yummy and the right size! She continued to say OTHER places make them too small. I haven't tried any one else's gyros because I'm hooked on Greek cafe! And I promise I wasn't paid to say it. Just a satisfied customer."], ["Brenda D.", "1st time here!! We will be back!! Friendly service, great food! Extremely fresh!!! Someone ROLL me to the car please!"], ["Shannon G.", "First time here and I had the Gyro Combo. Very good Gyros! Greek Salad was delicious :) Great location but not a very big seating area. The restaurant was filled during lunch.I live close enough for delivery (winning!)I'll be back again."], ["Scott M.", "Good veggies, rice, hummus & pita bread. Meat (beef & chicken) was dry & barely had any flavor."]], "Beirut Rock Café": [], "Greek House": [], "Hedary's Mediterranean Restaurant": [["Angel Z.", "This place is so great. If you've ever been to Terra Mediterranean restaurant, this place is kind of a hole in the wall in comparison, but a much better value. The authentic feel of the restaurant adds to the experience. It's clean, the gentleman in charge is very friendly and will explain anything if you're confused.The price is crazy low. If you're new to Mediterranean food or aren't sure what to get at Hedary's get the \"sampler plate\" it has a nice portion of everything for just $10. It fed three very hungry adults with PLENTY of leftovers. Seriously could've fed four big appetites easily. So delicious, coming back again!"], ["Bernie D.", "We used to go to Celaborelle Phoenecian and loved it.  We got some food to go not too long ago and it is just as good as the old place.   Sure the wait is long, hence the calling the food order in and taking it.  But if I was in no hurry I would definately not mind waiting.  Portions huge, I love the kebabs and the hummus.  The Kibbe was a little smaller than before but actually was better.  Love this place wish it was a little closer to the house."], ["Sarath P.", "So excited that the amazing Celaborelle style is now at Hedary's!! The food is the same -- massive and delicious!! I love to watch the faces of first-timers when their entrees are brought out and put in front of them!! Just remember, sharing is caring here! My hubby and I started our meal off with a small plate of baba ganoush and tabbouleh with a side of their steaming hot pita bread. I love the tabbouleh here -- it's nice and refreshing and more tomato than parsley. The baba ganoush is really good, as well. We ordered the 16 oz. plate of the lamb shwarma -- yummy lamb cooked with tons of vegetables on a bed of the most flavorful yellow rice. It's delicious! Even though we shared -- we still had to take home a good amount of it, but that's ok, the leftovers taste just as good! And don't forget to save room for some yummy baklava -- they have different nut varieties other than the traditional pistachio so ask when you go!"], ["Naif A.", "this restaurant is bad badThey didn't prepare fresh food, I will never visit there again"], ["Samuel C.", "Love the food, and the atmosphere. The hummus and fresh bread is awesome. The salads are amazing ...I recommend the Greek salad. they're still so much more I wanna try from here. And so far I've had the kabobs and a meat combo and both were amazing.The meat with prepared just right it was juicy and not overdone.I also went for lunch yesterday 2/18/2015 and got the sampler,  great portion and great value... left full and happy"], ["Amelia S.", "The food is amazing as well as the service. Both times we have been it has taken a while to get our food. But the price and taste are worth the wait!"], ["Brian C.", "My wife and I have been eating here for years. Especially love the frarej, tabouleh and the hot pita bread. The new chef serves so much food a family of four or five can eat a full meal for $13-15. I got the shawarma 3 nights ago with the Hedarys salad and will eat 4 meals out of the 2 dishes. I paid $15 with a $1-2 tip. For a simple, healthy and delicious meal, you can't do better. I couldn't cook the meal at home for that price. Recently the Hedarys family put in a deli counter for lunch, where they serve salads, wraps, and bowls. Seriously, if you don't want to waste 1/2 a pound of food, or you don't have a place to store it, tell him to go easy on portions. He will load you up with rice, salad, humus, tabouleh, kibbi, gyro meat, yogurt sauce (forget the name) , whatever you tell him."], ["Phillip D.", "The food is delicious and it is a fun place to eat. We will avoid the take out as I am sure all of the others that called in or dropped in that night will. We were there for 90 minutes at the take out. A man came in after us and said he had called in 45 mins before. A lady before us was the same situation. The server who was doing double duty gave us Turkish Coffee and lots of water while we watched Happy Potter and the sorcerers stone on the bar TV. The good part is the tables were being served in a timely manner. Maybe the key is to get a table (not that night) order your food, then ask for a to-go box. Could save you half the time. Come early, grab a seat and enjoy a fresh prepared meal."], ["John Y.", "I loved Celaborelle. And when I read Hedary's was now owned by the same guy, I thought this would be great. My expectations were a nice restaurant with the charm of the old house Celaborelle was in. Unfortunately, it doesn't translate.So first, let's touch on a couple of ways the Celaborelle and Hedary's are the same.I thought the old house had ventilation problems. Which it did. It was always smokey like they just put out a fire. Somehow they managed for this to make the restaurant the same way. They left the front door open to air the place out. But after an hour there, it wasn't any better.Secondly, service was awful at the house. There was always only a single server. You filled out your own order sometimes even. The restaurant still doesn't have enough help to scale. We had one server who was overwhelmed. We waited a really long time without being checked on. Our food also took an extra long time to come out. There's a lack of overall professionalism as well. Again, in the house it was looked at as a quirky charm. Here, it's just poor service.Third, it's still a BYOB. Interesting enough, they now serve wine as well. There's a $2 a glass charge though.As for the food... I'll just leave it at the star rating of \"Meh. I've experienced better.\" My wife and I split a meat combination beef kabob plate. The beef kabobs were fine. The pork sausage (mqaniq), beef sausage (sujuk), and meat loaf (kibbi) were dry. I didn't care for them. The Kafta was relatively good. All the vegetables were scorched black. I left half my food uneaten.As someone who has rated Celaborelle 5 stars in the past, I think I'm done with this place. Really disappointed and won't be back."], ["Lisa Y.", "This restaurant is under new management, and the food is amazing! I had a vegetarian plate, and everything was so fresh and delicious! To my amazement, the food kept coming out, one dish after another, until I was surrounded by hot, tasty Mediterranean goodness. Sangria was on special for happy hour, and it, too, was great. By the time the waitress asked whether we were ready for dessert, all we could do was laugh, there was so much food. We brought home more than we ate, and the price was so reasonable that I felt like we should be sneaking out after we paid. I can't wait until I am hungry again, just so I can dig into the leftovers."], ["Mike T.", "Ever since Joseph started cooking here its made this place 20 times better. They give you large family style portions. I do need to warn you the food does take a little while to prepare so I recommend you grab your favorite wine and hopefully your seated with some good company. The food is worth the wait!"], ["Chris S.", "Healthy fare, crazy proportions (yes, really insane!), and sick prices...what more can you expect?!  My cup of soup was the largest bowl I've been served when ordering bowls of soup.  The greek salad was enough to munch on for days.  The lentils were sides for 2 ensuing meals later in the week.  Between 5 adults and 2 children, the 3 in my party carried away 4 standard size boxes of food and the others had similar hordes to carry as well.  I'll come back next time and order soup and salad and I'll still leave with leftovers...no joke."], ["Kelly L.", "Wonderful food. Fantastic baba ganoush and hummus.   Been there several times and can't find anything I don't like.  The service is great as well!'n"], ["Virginie C.", "Authentic food for a very decent price. The portion size are big too. The chicken bowl is delicious !"], ["Erika N.", "Delicious food and wonderful, friendly service. You can't beat the quality of this food for the price."], ["Kh P.", "I don't post bad review usually but wait time was too long for us.We waited for more than 30 minutes but no one even bother to check on us. We couldNot wait any longer.Heard food is good so will have to  try next time to post review on food.Overall not a pleasant customer service."], ["Rocco M.", "Great food! Unless you are with a big group that wants to sit for a long time waiting, use the take out service. The food is delicious and made fresh when ordered, but that takes some time..."], ["Jennifer W.", "Joseph Hedary has taken over this longtime FW favorite and boy it shows!!! Always loved Hedary's but my budget didn't keep up with their prices so I wasn't able to go as often as I would have liked. NO MORE! Now EVERYONE can fall in love again with this Mediterranean mecca AND with the best chef in the land! Joseph is a master and will thrill you and fulfill you with all your favorites with the added treat of being so affordable you can eat their as soon as you've finished off the leftover you took home!"], ["Mehdi D.", "Not sure what exactly I received but I ordered a gyro and a falafel. Got a huge stuffed bread of everything I could possibly imagine. Food didn't taste good at all and it was real expensive."], ["Vanessa W.", "I came with a friend yesterday, for the first time.  I LOVED IT!  The food was fantastic!  The prices are fantastic!  I plan to try EVERYTHING on the menu! ;-)"]], "Zoës Kitchen": [["Marc M.", "\"I wuv goo foo.  I wuv Zoes.  Zoe's hav goo foo.\"Ok, it's not polite to type with my mouth full, so now that I have finished that bite, let me finish this review.Zoe's is a chain of Greek/Southern counter-service restaurant that is based in the DFW area.  They seem to be a chain that is on-fire because they are expanding everywhere quickly.   This location is situated on a corner in a busy retail area, good luck finding parking (hint: Best Buy seems to have lost all of their customers to the Internet, so park there :)Zoe's is not true greek - don't come for The Best Greek Salad, or The Best Hummus.  Heck, they don't even have a true gyro sandwich. Also, for the \"southern\" side of the menu, not everything is FRIED.   It is kind of like Pei Wei is not really chinese food.  And I never eat at Outback Steakhouse unless I am in Australia...What they DO have it is CONSISTENTLY good food.  I can order the grilled pimento cheese sandwich (from the southern side of the big menu) with a side of greek salad or hummus.  I can wash it down with hibiscus green tea (not sure which side of the menu that comes from).My wife loves their \"gruben\" sandwich - basically a reuben with turkey instead of pastrami.  My daughter loves their quesedillas and fruit salad.  If we want a special treat, we order their chocolate cake.pssst: If you download the Zoe's app, you can submit a picture of your receipt and they reward frequent visits with free stuff... like chocolate cake!Service is fast and friendly.  I am bit leery of eating outside only because I use the salad dressing that sits on every table.  Is it safe to eat olive oil and red vinegar that sits in 90+ degree heat??"], ["Chris G.", "Food is always freshChicken and Salmon are excellent. The hummus is really tasty. I always have to ask for more flat bread for dipping though. Try the family style orders if you have 4 people, it's less expensive overall."], ["Naomi L.", "Great hummus and pita, I honestly don't know about anything else because I love this so much I always have it."], ["Kim K.", "I had a excellent meal today. I ordered my favorite the Gruben and a side of slaw and a side of the potatoes. Everything came out fresh and fast! The service today was also very friendly and helpful!"], ["David S.", "Very fresh medditeranian food. We walked in having no idea what to expect and were very happy with the atmosphere of the place and the kindness of the staff. The manager knew what the person in front of us wanted just because he came there two days in a row and the other cashier was so wonderful to us. She guided us through the menu and made us want to order everything. She was very kind and even gave us free drinks for this being our first time visiting! The food came out to us before we even had a chance to get the drinks and choose a booth! It was that fast! Were in love with this place already and havent been here nearly 20 minutes."], ["Stacie H.", "Very good food! Lots of healthy vegetarian choices. I enjoyed some hummus, greek salad and pita bread. I wish they would tell you they put oil on the hummus. I prefer hummus without it. Reasonable price. The patio looked really pretty to dine on."], ["Jennifer G.", "We used to eat here all the time, until it gave my 12 year old son horrible food poisoning on my birthday. He ordered the beef kabobs. He was up all night terribly ill and was out of commission for a couple of days. Even worse, the company did not respond when I wrote via their website feedback form to let them know what happened. We will never be eating here again."], ["Marcus W.", "My first visit to Zoe's was a good one. The staff was friendly- guy at the register suggested some variety to our meals that was nice (toast the bread, different soup pairing suggestions, etc.) and the restaurant was very clean. It was busy for a 1:00p visit on Friday- we had a tough time finding a table that seated 3 and ended up at a larger \"communal\" spot where 10-12 people could share a spot. I ordered the egg salad sandwich with the chicken and orzo soup. The egg salad was sort of blended, not chunky, and I liked that. It had a great flavor and the serving size was perfect. The toasted whole grain bread was excellent. The soup was more warm than hot but had a good flavor as well. My wife ordered the chicken salad sandwich, and a greek salad. The salad looked amazing- a huge portion with fresh veggies. I was wishing I had ordered the salad too. There's a decent kids menu for the little ones, and the prices were just right. We spent $25 to feed the 3 of us. Considering this is more of a health-conscious establishment with seemingly higher quality food it was worth paying the few extra bucks. We'll be back!"], ["Jay A.", "This place was awesome. Everything looked/sounded good and it took me a while to choose. I got the spinach rolls with potato salad (potato salad - amazing). The rolls were very good, however I didn't really like the salsa they came with. I don't want to dip a Greek-tasting roll into a Mexican-tasting dip. You know? They didn't mesh. It would have been awesome to have some kind of sun-dried tomato dip. I tasted my sister's hummus, pita, and quinoa salad and it was all good. Then I grabbed a 99c bag of pita chips to take home. Overall, great food. The only reason I say 4 stars and not 5 is because of the salsa and because it was slightly too expensive ($8.34 for spinach rolls and potato salad, no drink)."], ["Chris B.", "Got the steak kabobs and the hummus trio. Kabobs were well-seasoned but unevenly cooked. Some of it was a too chewy. Hummus was okay. The pesto hummus was the best. Overall tasted good but seemed a little pricey."], ["Tana P.", "Staff is friendly, facility is clean, menu has a great selection, and food is pretty darn good.  Not our favorite greek place, but we love the atmosphere and it's uber convenient.  We'll be back, and yep, the kids love it too."], ["Stephanie P.", "I came here on a Saturday around 1:30pm with my boyfriend. I got the pick two deal (6.99 for a classic sandwich and a side), and so I got the chicken salad sandwich with roasted vegetables. The sandwich was really delicious and fresh. The roasted vegetables were good, but too seasoned for my taste. However my boyfriend enjoyed them. He got the spinach roll ups with chicken. It came with four rolls. Very well toasted and fresh spinach. Love it! It also came with a side (in which he got the vegetables as well).The service was friendly and fast, with a good atmosphere as well. I would definitely come here again!"], ["Erika M.", "Came here for the first time today to try something different , staff was very welcoming and friendly o had the spinach roll ups and added chicken , and they were delicious !!!! And a side of grilled potato salad , will be back , definetly hits the spot"], ["J M.", "Stopped by here to try something a bit different while visiting family in Keller.  I had a hankering for a pimento cheese sandwich since if loved these growing up.  My daughter had the chicken skewers.  It was a cool sunny afternoon - the perfect day to sit outside and enjoy a  quite meal.   This was the highlight of the meal. I found the pimento cheese - well cheesy but rather unassuming.  Honestly speaking, I was quite let down by it.  as for the chicken, the spice pallet was ok, but the chicken was overcooked and quite dry.  I will say I loved the hibiscus tea.  This turned out to be the best part of the food / drink that was served.  Summing it up, on a nice warm evening, before it gets to hot, order a large glass of hibiscus tea and enjoy the outdoors.   I would find a better place to eat though."], ["Donna W.", "fresh food served reasonably fast.  more of a lunch sort of a place.  no real ambiance.  portions are smallish.   The hummus is good. I always have to ask for more flat bread for dipping though."], ["Kim L.", "Yep. No comps were ever sent. Nice thought though!!! Guess their to-go service and the business side need some refreshing.Edit: Nov 1 - we received a comp to give it another try....   it bought us 2 dinners worth (both TO-GO since that was the main issues we had) - the first time I placed my order and told the guy on the phone before I hung up something to the effect of 'so you guys have messed our orders up in the past, and it'd be really great if everything was correct this time.. thanks!' and he was OH so sweet-sounding on the phone, saying how they'd make 110% everything was perfect. And it was! yay! The second order we placed, I gave them the benefit of the doubt and did not say my 'please get it right' disclaimer before I hung up, and SURE enough they messed it up. My husband asked to sub the veggies for rice and there was none. He was pretty annoyed, and frankly I am too, given that it was such a simple request. Why, Zoes? If you need this much hand-holding with to-go orders, perhaps it's not something you should even be doing in the first place. If we go back, we'll eat in the restaurant so that if/when there's a mistake we can walk it back to the counter instead of being home with 3 kids with nothing to do about it."], ["Angelica M.", "Came here for lunch on a Friday and we were definitely treated to a great experience. The young lady working there gave us a free limeade and was very friendly. After we sat down a man who I believed to be the manager brought us out a plate of hummus and pita bread to try since it was our first time there. I think he heard us talking in line about hummus saying my boyfriend had never tried it and wondered what it tasted like. I ordered the Greek chicken pita and coleslaw and I found it very fresh and filling. I added some of the dressing that was on the table and YUM! My boyfriend got the Club Pita and he said he enjoyed his food as well. The atmosphere was nice and relaxing and we definitely enjoyed the casual vibe. Would return again!"], ["Estie C.", "To start...parking was a breeze. The patio and the landscaping was well manicured. As we entered, we were immediately greeted by a friendly face and a warm hello. I let the guy know it was our first trip there and he gladly offered detailed information about Zoe's and the menu. He even let us same a few things to help is make a decision. Nice. We ordered the steak kabobs and chicken marinara to share. Also ordered potassium s hummus to snack on. Everything was delicious. The steak was so tender I could cut it with my table knife.  The pita and hummus were fresh. The restaurant clean and neat. We will definitely be back. The only reason I didn't award 5 stars is because I think they should add gyros and lamb kabobs to the menu. Try them. You'll love it!"], ["Amy B.", "Today was my first visit to this place and the staffs were really friendly, especially the guy at the cashier who greeted us with a big smile! It was good to see such nice people whenever your day had been a little less then boring. For my first visit, I ordered a Chicken Roll-up and it was ok. I'm not a huge fan of white meat in the first place (I didn't know the chicken was white meat Q_Q), but it was still pretty good. Next time, I'll probably order a Steak Roll-up instead."], ["Patsy D.", "Always one of my favorites.  Love the chicken pita. Salad is always fresh,  chicken freshly made and delicious.  A regular Sunday favorite for my daughter and I. I live in South Arlington and visit my daughter in the area and it is a must for us. Need a Zoe's Kitchen in South Arlington! !"], ["Bob M.", "Can't say too much about the location but we have this catered to our job a few times a year, I can only assume it's a price thing. Most notably is they are generally late. Let me say that when you have a half hour lunch, late is not conceivable. 13 people waiting to eat is carp. Outside of the tardiness they have not shown at all twice. The food is decent considering your eating it while aggravated and in a hurry. For me there is no reason to ever seek out going into the place for mundane chicken kabobs."], ["Judy G.", "We decided to try this out for the Gluten Free options since our daughter is allergic to wheat.  We were pleasantly surprised at the number of entree's that were available that weren't just salad (most restaurants idea of GF).  We all decided to try the Chicken Kabobs and they were delicious!!  The chicken was cooked to perfection, the greek salad that came with it was done right with the appropriate balance of veggies to cheese to lettuce ratio and the salad was dressed just right.  If you wanted more of the dressing, which our daughter did, there is dressing on each table.  It also came with rice pilaf which was cooked correctly; not mushy, but a nice bite-feel and a great nutty taste.  The pita bread that was included in the meal was fresh and very tasty.  The GF meal comes without the pita bread. The staff were all pleasant and the gentleman behind the counter was very funny.  The restaurant was clean and inviting.We will definitely be coming back!  I have a feeling that this is going to be our go-to place to eat!."], ["G C.", "Great good as usual but this time I want to take the time to thank my cashier Misty.  She provided excellent customer service.  I was very impressed with her.   You can never go wrong with Zoe's."], ["Una B.", "Overall I like Zoe's enough to keep it in my 3-6 month rotation. On past visits I really liked the steak stack sandwich - but once the bread was mysteriously plain, sandwich bread without any explanation. So, I gave that up. Don't toy with my emotions!I've dabbled here and there for a few other items, and while ok- I've never had anything beyond that. Most recently I chose the steak rollups, which also walked the middle of the road. The meat was tender, I had a few oddly chewy bits, but meat, cheese, tortilla, I mean - this isn't rocket science. I think I'll lean in towards a salad my next visit."], ["Julie W.", "Note: Hummus Trio comes with Pita Chips not Pita Bread as listed on the menu.  It was only a big deal for me because I just finished at the dentist office.  Otherwise chips might be nice?"], ["Vicky W.", "I was so excited to see that one of their newer menu items is quinoa salad!  I love quinoa but few restaurants serve it yet (in case you don't know what it is, it's small sort of like couscous, but instead of pasta it is a seed - meaning it has many of the healthful properties like nuts. High in protein, low carb, low calorie).Very flavorful salad, but be aware - you'll need a to-go box!  The quinoa is mixed with tomatoes, cucumbers, etc. and then served on a bed of greens.  I added a bit of their salad dressing to part of my salad, which was also a good mix.Hubby had the steak kabob, and they looked and smelled delicious and he said they were.  Served with seared carrots, onions, broccoli and potatoes on the side.We also had the hummus and pita appetizer.  Good as expected.  And the homemade chocolate cake was moist and yummy!We went back second time and hubby had the same steak kabobs, but I had the veggie kabobs.  Also very good and flavorful, served with side salad and cooked white beans.Very inexpensive, I think it was $25 or so for both of us.  And even though I ate until I was full, I didn't feel lethargic after my meal, which is always my preference.All very fresh, cold when it should be and hot when it should be.  Great staff.  Even though this is a \"chain\" restaurant, it's definitely one we will return to often!Only negative is no gyros, but the other food is so good that we don't even care."], ["Shannon J.", "Beware! The employees that work there are completely rude and the customer service is horrible. Food is excellent just too bad the managers and staff are completely unprofessional and rude."], ["Julia M.", "Well, my recent trip to Zoe's may be my last one. Why the update?I normally get the spinach roll ups with a side of the slaw and the last two times that I've been in the portions seemed smaller while the price is the same. My husband ordered the grilled chicken plate and the chicken was very small and tough. He also found several hairs in his food (totally ruined his appetite). They did refund his meal, though, but didn't really offer much in the way of apology. Oh well."], ["Sherry B.", "I eat at the Southlake Zoes on a regular basis and this one is NOT even close to as clean or good.  First it is a Filthy restaurant.  The ice dispenser was unusable, thank goodness they had a Coke machine with ice I could use.  The silverware tray was disgusting.Hummus and pita...hummus was thick, pita was crunchy on the ends, as if it was either stale or toasted.  Protein plate...chicken was overcooked and chewyWon't be back..."], ["Suzanne F.", "This Lifestylist® tends to be a road warrior - I spend a lot of time on the road and finding food that is not only healthy but worth the calories is hard to come by. Zoe's not only gave me fresh, healthy options - the staff put a smile on my face that lasted the entire day.I was greeted by a manager? that said welcome! Where have you been? I don't know if he really did remember me, but he sure made me feel important, and memorable. I lust after their chicken kabobs and green tea, but because the photo of their new quinoa salad was so appetizing I had to order that as well. Plus hummus - it looked too good to pass up. He asked me if I would like my hummus dressed - I said of course. Warning: their green tea is addictive, so you should buy the refill glass when you go so you are good for refills on your next visit. I can't stress enough how genuinely nice everyone was, and the restaurant (and bathroom!) was spotless.Food? Every time I dine here (and it's a lot because I have a client nearby) is perfection, and the staff has always gone above and beyond. Love, love, love everything about Zoes, and it will always be my first choice - any chance of an Oak Cliff location any time soon;)"], ["Greg F.", "Very well managed place to eat!  All the staff greats you when you enter.  The food is excellent!"], ["Brandon W.", "Everything I have tried here has been delicious. The managers here have recommended a few things and they always go out of there way to make it a great time here. This is my favorite Zoe's location. It blows Southlake out of the water primarily due to the management and their outstanding co-workers. One of the employees told me to download the zoes app to get free stuff. So it's awesome as well. Good place for sure."], ["Michael P.", "Food is ok and not overly pricey. Had the Chicken Ka-bobs which came with rise & a small Greek salad. The chicken was cooked just right, which is actually hard to do with a ka-bob. It's pretty easy for them to dry out. Not a bad meal for $8.00 and it was filling.One thing that I found was odd is that there is not one menu item with Lamb.  Also no felafel.  Hard to accept a Greek restaurant without these two items. I'm giving it a three star which means that I will probably return again (to try a wrap) but I'm not ready to give them full accolades."], ["Scott B.", "I've eaten here a couple times and it's very very good. Food is very fresh and you can taste it. Salads are amazing and the Beef Kabobs were scrumptious. I've also had their chicken and orzo soup......again, yum. Best \"fast food\" place around!"], ["Leslie N.", "Menu had lots of good selections, service was very friendly, but I had to pick out all the dead lettuce from my salad. I had hummus, a Greek salad, and a spinach and chicken wrap.  Not great, but not horrible. Will try another location. Didn't leave me satisfied or excited to come back..,"], ["Tracy C.", "I've heard so many people rave about this place but thought it was overpriced for what you get. The hummus is good. I was a bit disappointed, because I absolutely love Mediterranean food. Only ate there once. Maybe I should give it another try."], ["Jarrod J.", "This place had a pretty high rating and I really enjoy Greek food, so I thought I'd give it a try.I am giving it 3 stars because I came for dinner and it's definitely a better place for lunch based on the menu items.  Lots of rollups and kabobs and salads.  Mostly chicken items.  I had to search for beef menu options, which is a requirement for my dinner.  I'm a carnivore.  :)I had the Steak Rollups which were very good especially with the accompanying lemon-mayonnaise sauce.  If I'd eaten here for lunch it would have been an easy 4 stars.I'll definitely come back for lunch sometime and see if 4 stars suits Zoe's!"], ["S T.", "Undecided with so many good choices in the Golden Triangle strip, Zoe's just seemed to look welcoming and friendly. This new spot took beamed at the corner with a beautiful color of flare with a patio umbrella garden. It was a bit before the usual lunch crowd and walking in with ease of checking out the place and menu. While trying to decide I checked in on Yelp to read some reviews and noticed a 10% disc. with check-in. Zoe's has a 2 item deal (1/2 sandwich with fruit, soup or salad) for $5.99 and the portions are very filling. The drink station is one too remember with a visual screened showing of your sodas, totally cool!! I'm a fan of sweet tea but there's tasted like it was on a diet. The food tasted so fresh and good.This place echoes happiness from the outside in. All of you Jason Deli fans.....Zoe's is making a home run so step up to the plate and swing on by.I think we made a good choice and will keep this place on our radar...:()"], ["Evelyn F.", "Nice laid back and modern atmosphere. I was very happy with my chicken roll up, and paired it with the super tasty grilled veggies. I wasn't too crazy about the salsa, but I'm probably just a salsa snob having grown up in Texas. My husband had the grilled chicken dinner, and for someone who can be really picky he was impressed with the braised white beans. I found the prices very reasonable given the selection of fresh entrees, was intrigued by their variety of gluten free options, and noticed there is even a protein power plate on the menu. I was super excited when they let me keep the koozie that held my beer, and I highly recommend trying the chocolate cake. I'm pretty certain this place has found a home in our dining out rotation."], ["Tiffany L.", "Wow!  What a pleasantly awesome surprise Zoe's Kitchen was!  We swung on in some time last week and immediately liked the place before even eating a single item!  It just looks happy in there!  Great colors, fabulous lay out.  You go up to the counter and order your food... loads of really yummy sounding options!  We went with the Mediterranean Chicken Pita Pizza and the Chicken Kebabs and the orzo soup.  It was all delicious!  Seriously, I used to live just outside of Greektown in Chicago and these Chicken Kebabs were just as good at Zoe's Kitchen as they were anywhere in Greektown.  Full of flavor and moist. The rice and and salad the dish came with was also fantastic.  They have an extensive beverage station; several types of iced tea and a really cool soda machine that allows you to add fun flavors to your standard sodas.  I went all out and tried a grape flavored Sprite and the boyfriend was delighted to find vanilla Coke!  Way fun machine.The staff is very very sweet, polite, informative.  Zoe's Kitchen is just a really really neat place with really fantastic food and we look forward to going back!"], ["Tielle D.", "Zoe's Kitchen has wonderful, fresh Mediterranean food. I ordered a Greek salad with pasta salad on the side and was in heaven. On a side note, I really love that they have a fancy new pop dispenser so you can get pretty much any flavor you can think of."], ["Heather B.", "Great food, ffreindly staff, samples on request. What is not to love? And that soda machine? That thing is THE BOMB!"], ["Jennifer H.", "I had the steak kabobs (sp).... I know I wasn't going to be getting Kobe Beef but I am not a fan of eating tendons...the meat was so chewy I could never break it down enough to swallow....The veggies were veggies nothing to yelp about....I would probably not go back to eat but if someone bought it in at work I would eat it...cause it was FREE!"], ["Chris W.", "First time at a Zoe's.  Nice tasting, healthy, affordable, slightly upscale fast food.  Really enjoyed it. :-)"], ["Steven D.", "From California but was visiting for work.  My colleague and I needed to grab a quick bite and someone recommended this place.  Turns out, it was pretty good.  They have Mediterranean dishes (hummus, etc) but with a contemporary flair. Beats going to a subway or mcdonald's.  I'll keep this place in mind next time I'm passing thru Fort Worth."], ["Summer H.", "Delicious! Fast, fresh, made from scratch in-house! We will be going back!"], ["Val T.", "Awesomeness....had no idea what this place was, boy am I glad we came in.  Such a surprise to get great Greek food at a quick place.  The hummus and pita was delish, side of white beans and the chicken wrap.....ooooo soooooo yummy!  We liked it so much we went back just a week later!"], ["Kara A.", "I was so excited to find that Zoe's was opening nearby.  My family has been a huge fan of the fresh and healthy menu here. I love the spinach roll ups and chicken salad sandwich. My boys love the chicken salad sandwich as well. My husband has also tried the grueben, which is his new favorite. Don't forget to order chocolate cake, which is awesome! This is a family favorite!"], ["Wanda M.", "Loved it! Friendly Staff...Nice and clean too. Food was marvelous...great lunch on our Girls Day Out... ;)"], ["Caitlin D.", "This place has been fantastic. we eat here all the time and have never been disappointed. I love the chicken pita pizza and chocolate cake!"], ["Drew S.", "Great meal and great change from the usual. My first of many visits. The pasta salad was the best I've ever had and the Greek feta side salad was very good too. My wife and I shared the chicken pita pizza and chicken wrap. Both were good but I can't wait to try something else. To bad I live 60 miles away."], ["Madeleine L.", "Yummy food, good tea , and good service!  We especially liked the veggies!  Very fresh and perfectly cooked and seasoned"], ["Stacy C.", "I was not impressed. For the price I was very disappointed that my sandwich was made on what appeared to be Mrs Baird's sandwich bread and tasted like a sandwich I could gave made at home for much less money.  I will NOT go back."], ["Ezra C.", "Cozy bistro with a decent selection of tasty food. We'll likely head back, but nothing stood out enough to pull us back in immediately."], ["June V.", "Our new fave restaurant! Love the Mediterranean tuna pita. And the roasted veggies are only the best side ever!"], ["Kelly G.", "The hummus is AWESOME!!!!"], ["paula k.", "Love it.  Fresh food, and plenty of it.  Order at the counter and they bring it to your table.  Had the tuna sandwich and pasta salad.  Really good!  Green, decaf iced tea had no flavor.  Will try the regular tea next time.  Will definitely be back.  They're opening one in Flower Mound which will be my go-to place for lunch.  Not cheap though..."], ["Jenny B.", "This place is not what I was expecting. They had a great selection of healthy, Mediterranean-inspired selections. I got the Protein Plate and hummus as an appetizer--both were very fresh and good. They have some nice options for ordering take out family meals."]], "Jazz Cafe": [["Jean K.", "Weirdly enough, this place managed to be in a travel guide for the Dalls-Fort Worth area. The food was mediocre. I got a sandwich of some sort, which was overloaded with meat and had very few vegetables. My friend was also not wow-ed by her food. Maybe their breakfast/brunch menu is significantly better than their lunch menu? Finally, the service was lackluster. While our server appeared friendly on the surface, she actually seemed mad when I requested a new water because mine had a hair in it. No apologies were ever given. The live jazz music was nice, and it was not overcrowded, but I would not return here."], ["David H.", "I lived three blocks away and wanted to walk in this place and love it.Sadly, I stood at the counter for a while before being noticed and helped. The environment inside needs a lot of help. It's not very inviting so I chose to walk home. I thought my food would be pretty good because sometimes when places don't look good on the outside or inside the food is awesome because the place spends time on the food and not the atmosphere. Sadly, though, the food was not that great. Over the last year as I drove by it I did notice that they have been making improvements to the outside area. Maybe now that they are carrying about the outside they will start to care more about their food. I would give it another try soon if I still lived in Ft. Worth."], ["Krishelle L.", "My dad introduced me to this hole in the wall Mediterranean restaurant- and I am so glad he did! This is the only place I have found in all of Texas that serves taramasalata- which I fell in love with while traveling in Greece. I will warn you- it's salty, but that's the way I like it, served with warm pita bread. Add a healthy sized Greek salad and I have a huge lunch for a reasonable price. Loads of other options including the ever popular gyros, falafels, and yummy hummus. Make sure to bring cash, they don't accept credit cards. If you want to imbibe, bring your own. Pretty sure there is no corkage fee. And they have live music (Jazz of course!) at night. You may not have the best service, but you will get served some authentically wonderful food."], ["Scott C.", "You may think I didn't like Jazz Cafe.....As I approached the restaurant it appeared to me as if they weren't open. As in, no longer in business. The sign in front was broken out and the neon \"OPEN\" sign facing the street was not on. It appeared dark inside. I turned down the side street with the intention of turning around but found the parking lot to be full meaning there were 8 cars. Open maybe? Also, I found another neon sign operating with the colorful and welcoming \"OPEN\" on display.From the parking lot one approaches onto the patio. A somewhat charming and inviting area, or it could be given the odd assortment of industrial equipment, vacum cleaners, hardware and tools scattered about. An area on the west end of the patio looked like it could be a great stage for a jazz combo on some pleasant evening but on my visit was doubling as a storage area of sorts. I stumbled around trying to find a door and a mysteriously hidden voice called out to me \"Can I help you?\" I replied \"I can't see you\" (The reader should know I'm hearing impaired and can't discern the direction of sound) After spinning in circles, I finally located the source of the voice partially hidden behind a wall and the assortment of equipment mentioned above. I was directed to the front door. I then proceeded to the Montgomery street side of the building but another voice pointed out my continued misdirection and extended his arm and finger toward the REAL front door. \"Front\" being a misnomer since it is on the SIDE of the building. Finally becoming oriented to enter the building, no one on the inside greeted me. I scanned the dining room and some quick math deduced that there were more cars in the parking lot than patrons but I let go of the mystery. Since I'm a big fan of patio seating and the aforementioned patio did not look as though they were serving out there, I picked a table next to a window overlooking the patio, the next best thing I suppose. I sat, sat and sat. Please note all other reviews of Jazz Cafe that I read indicate the service is less than desirable. Duly noted. Eventually, a fair natured fellow with a long gray pony tail appeared and dropped 2 menus on my table. 1 for lunch and 1 for breakfast. I looked at neither. I think you can still find an article from the Star Telegram titled \"Eat this and die happy\" A list of about 45 things in the metroplex on one should put on their gastronomic bucket list. This is a great list. On the list is the SOB Eggs at Jazz Cafe. I hope I don't need a bucket list anytime soon but I did order the SOB Eggs. Being a sneaky type and liking to order off the menu when I can, I also ordered Greek coffee like I knew what I was doing. I suppose it's also good to note that Jazz Cafe is a Greek restaurant when not doubling as a brunch locale or a storage facility.Again, I waited. Soon an attractive and curvaceous dark haired beauty with an attitude pitched an espresso sized cup on my table and without a word walked away. Pony tail man appeared with water and told me my coffee would be \"just a minute\". Good thing I brought a book. The arrival of my eggs coincided with the opening of chapter 2. Again, I was told my coffee would be \"just a minute\". The food: There are no eggs and black beans on the planet worth $10 unless they're served with sliced truffles & beluga caviar. SOB eggs are chiliquiles. Wait.... my coffee just arrived.  The eggs are served covering half the plate with runny black beans covering the other half and some pretty good pico de gallo wedged in. Since theres no room left, 3 tortillas are folded and placed on top. It was good, end food review. For those of you who don't know.... forget Starbucks for espresso. Find a greek or turkish or some mediterranean place of your liking and get your mainline caffeine fix there. They boil coffee, that's right, boil coffee in a small open pot then add sugar because no one can drink sludge unless it's sweet. The grounds and everything are left in the pot which is brought to your table. Thats why Ms. Hot Smarmy pitched me the tiny cup. You pour until its too gritty for you then stop. For me this equated to about 3 tiny cups. All good things must come to an and the closer the time came to leave, the better the service was. Odd, since not once did I think they wanted me to stay. Mr. Pony Tail now wanted to refill my water, get me more coffee, serve me another entree and clean off the patio so I could sit outside. OK, just kidding about everything except the water. So I went to pay. At the register he offered a can of coffee for purchase. I said before I could buy coffee I needed one of those nifty boiler pot thingys. At this time another gentleman with nicely coiffed hair and smart looking clothes who had been on his cell phone all morning interjected. (I think he was the owner) He told me about Halal market in Arlington where I could purchase said cookware. He told me what a fantastic place it was. But thats another review."], ["M. Deloris D.", "Pros:*The SOB eggs were delish, in the style of chilaquiles and tastiness. *Biscuits and gravy were also yumtastic.*The place wasn't crowded so we didn't have to elbow people to get   brunch.Cons:*No mimosas*Water served in styrofoam cups...HELLO! Environment!*The service was poor, even after we shared that we needed to be to     the airport in an hour and a half.  There were so few people in the     restaurant that this should never have happened.  *My friend found hair in her gravy and sent it back but refused to   'punish the omelet for what the gravy had done.'  In all the place was a tad overpriced, the food was pretty good and I'd visit again...on a leisurely day."]], "Celaborelle Phoenician": [["Monica B.", "They have moved and taken over Hedarys on Hemphill Go here! The manaeesh pizza (with veg and feta added) is $9 and can feed 4 people. It's SO good. Zatar spice. MmmmmmmFalafel is the best in town. Fresh and moist. Hummus is good too.The frarej is half a juicy chicken Their rice is really good (and I don't care much for rice). The sautéed veggies are so tasty. The owner is very friendlyThe portions are HUGE for normal prices. You'll have leftovers for days. Every time I go I order too much food (4-5 people). This place has yet to be discovered by the masses. And when it is, it would be worth the wait if it gets long lines like it deserves."], ["Cindy W.", "Great value for the food but horrendous service. The wait was so long and there were flies inside the office. Yes, the food is good. Kafta is savory and the red snapper was delicious. However, it was very overrated. I was disappointed because the ambiance was kind of gloomy and empty. The two flies that I continually had to swat didn't help at all. The portions are humongous though! And you won't have to pay a lot for the food. A lot of locals seem to like it but... I don't think I'll be coming back. There was literally one waitress for 6 tables and she disappeared quite frequently. Also, there's huge SELF-SERVICE. Like you seat yourself, you write your orders, you pick up your drinks, you get napkins/take-out boxes, etc. I don't know if I'm used to this..."], ["Ian L.", "Value: 5Food: 4.5Desserts: 2Don't be put off by Cindy's review of poor service. We ate together and she places a much higher emphasis on service than I do. (different utility functions).Free appetizer for yelp check in! I forgot what it was, some bread with some very unique spices, Baba gannouj was nothing to write home about, it was passable the eggplant was not smoky nor creamy enough.I really, really loved the kafta and red snapper. Wow, those huge meatballs... with the outstanding roasted veggies, and caramelized outer crust, it was heavenly. Absolutely brought tears to my eyes, how did they roast those mushrooms and peppers so well?The red snapper could have been seasoned better though, it was quite bland, but surprisingly fresh.OTOH, the baclava sucked. I didn't like it. Dry, flaky, and like eating a rock, it tasted very synthetic and not at all like the baclava in the middle east. Perhaps i've been spoilt. It could have been a very good sugar cube, but it was a terrible baclava."], ["David P.", "How exciting that they are taking over Hedary's!!!  See you this weekend with friends!  And if you charge a few more bucks to bring in more help I wont mind one bit!!!  Congratulations!!!"], ["Britney Thuy T.", "A true hole-in-the wall! Cheap, huge portions, and deliciousTheir portions are HUGE. I didn't believe other reviews, but immediately regretted ordering so much food as soon as it came out. My boyfriend and I ate til we were stuffed, and still took home 3 boxes.My recommendations:  Mtabbal (Baba Ganoush), falafels (HUGE plate for only $3.95), and the beef shish kabob plate. It is only $10.95 for a 16oz portion of the beef shish kabob plate, and it comes with rice and grilled vegetables. This will feed two people - the portion is THAT big. This probably would've costed double what it did at any other Mediterranean restaurant.I've also had the hummus, which was just ok- nothing special. I also don't recommend the chicken schwarma plate. The first couple bites were really delicious, until we realized how oily it was. There was enough oil to fill a whole separate plate. Wasn't sure if it was just cooked poorly that day, but we gave it another chance on a separate occasion and it was just as oily.Tip:  don't come with a big group (no more than 4 people). There is just one guy cooking and his wife helping out - you will wait FOREVER for your food. My boyfriend and I were the only ones there at the time, and it took 30 minutes for our food to come out. If you do decide to come with a group, carpool since parking spots are limited"], ["Travis H.", "My favorite restaurant in town! Unfortunately Joe the owner told me he recently closed his doors for business because he doesn't have enough help to run the restaurant. Joe said he will be working at Hedary's restaurant off of Camp Bowie going forward. I'm really bummed because Celaborelle was without a doubt a jewel of Fort Worth. I really hope it opens back up soon!!!"], ["Nadiya R.", "Truly the best Mediterranean I have had in the metroplex! This is the type of place you need to come to for a long leisurely laid back dinner! The owner makes everything fresh and from scratch and by himself! I will write the basic review first, then if you wanna read more you can!Kafta plate is perfection, falafel is best I have ever had, portion sizes are huge! Hummus and pita are just phenomenal! Walk up and order by writing your items from a whiteboard menu and submitting to the kitchen window.Now for the extended! It is sooo worth the wait! He makes his own bread, I think it is pita, it's incredible! We ordered hummus, \"small\" falafel app (which came with 8 large ones) kafta plate, chicken swarma, medium cucumber tomato salad. The portions sizes are monstrous! This is a walk up and order your food at a window joint. The menu is a whiteboard that lists everything so it is quite small print. You write out what you want on the paper provided and then turn it in to the chef for approval! DO NOT TURN AWAY until you have received approval! You will sit and the food is brought to you.Then prepare to wait 30 mins to an hour! The kafta kebabs were cooked to perfection! Swarma was seasoned well and had beautiful big chunky vegetables! Hummus was a hearty consistency! You could turn that plate over and it wasn't gonna budge! Great flavor and tasty pickles as a garnish! THE PITA (or what I think is pita) IS MADE FRESH TO ORDER ON THE PREMISESThe \"medium\" cucumber and tomato salad we ordered was two full dinner plates! The dressing was so flavorful! All round great choice!This place is not in the greatest of areas and it is an old house that has definitely seen better days. It could do with a face lift and probably a good scrub down, it is not dirty, it is just old! But is truly a rare gem!"], ["Craig J.", "Before I start, I absolutely love Celaborelle. This is probably the longest review I've ever posted. I tried to add as much detail as I could. Keep in mind when reading about the service, that there are about 3 people who work here. One is the waitress who disappears for a while because she goes back to the kitchen to help cook. The other two are in the kitchen as well. I'm fairly sure that they are a family. Where to start? I guess I'll start with the obvious? The service. Almost non-existent. When we walked in, there we no directions of what to do or how to order other than \"Please order from the window\". We were confused and were literally standing there waiting in what looking like a back kitchen at a restaurant for about 10-15 minutes. Finally I said aloud \"WHAT IS GOING ON HERE?!\". One of the regulars laughed at us and finally told us the deal here: You have to write down what you want an order slip and give it to the chef in back through the little hole or \"window\" in the wall. The menu is a big white board with barely legible writing. Our brave friend wrote down her order first. The chef looks at the ticket and says pretty much \"What is this? This doesn't come with this order. Go back and try again.\" So after about a combined 25 minutes of waiting around, writing down orders and re-writing orders, our food was in and under way...Now that that's out of the way...I LOVE THIS PLACE!!!!!...I think... The interior: I wouldn't go so far as calling it a hole-in-the-wall as much as its very rustic. This is a restaurant built inside of an old, i'm guessing turn of the century, house. The exterior is in dire need of a good white washing but the interior is all hardwood floors and pillars. There are six tables. There is also little evidence of a working A/C unit. The ambiance: This is a place that is truly \"regular'\" friendly. Your 1st visit here will be a little off putting. After you've got the routine down and know what to expect, this place is your little hidden gem! It's BYOB or BYOW...I think it might even be BYOL! All the regulars that are there seem willing to help you out. We were told by a few regulars at the next table that the food takes about an hour to come out after you order. We all laughed but they were serious. They then went on to offer some of their ridiculously huge wood fire pizza to our table! The regulars here are so nice! That brings me to my next point: The food: Sweet \"oh face\" baby Jesus! The portion sizes are out of this world. And CHEAP!!. It did take a while to get the food but it was well worth the wait. I got the 16 oz Lamb schwarma plate. That is a lie. It weighed a few pounds. When I was done, I had enough left over for 3 whole meals! My roomate ordered the same. It had a nice flavor but the meat was a little tough for my taste. HIs wifey ordered chicken kabob 8 oz. It was again, a lie. She's got at least two servings sitting in the fridge. The chicken had a nice char, was cooked to perfection, juicy and you could actually taste the individual lebanese/Meditarranean seasonings. Served over a bed of very complimenting saffron rice. My roommates sister and her mate were smart...they split a 16 oz steak kabob; Perfect to share for 4 people (I'm dead serious). All of the plates were good but probably my favorite plate was the steak kabobs. Great savory flavor with a nice kick at the end. By this point I think I've made it clear that you get a lot of food. There were 5 of use. We left with 8 full boxes of left overs...I'll be fed for a week! Bottom line: I understand all of the negative comments I've seen in other reviews. They are for the most part all true. You have to look at this place from a different perspective though. I think of it as visiting a relative's house who is ridiculously good at making Lebanese food. You serve yourself in most ways. You seat yourself, Want water or something else to drink? You have to go to into the kitchen, grab a glass and shovel your ice and get it yourself. You need a togo box? Go back into the kitchen and get it yourself. I actually like it this way! Also considering how cheap the food is, I'd rather serve myself and let the staff keep making great food."], ["Ashley L.", "After much raving by friends and strangers, I came here for dinner on a Tue night with 2 friends. Ordered one of the specials - swai fish - which came with zucchini, yellow squash, tomato, onion, carrots and spiced yellow rice. Granted, the entree was 4 times as large as at normal restaurants, I was moderately disappointed at the taste. I felt like salt pretty much drowned out any multi-dimensional taste to the dish. On the plus side, you had leftovers to last you for days. I am not however going to judge this place by a single dish - I'd be open to trying the beans and rish dish, vegetarian entree, hummus and pita, falafel, Lebanese salad. I saw a couple share what looked like 4 crowns of broccoli. It was ridiculous.  And the prices are dirt cheap - it's no wonder it's hard to get return!I do like the owner - he doesn't judge you for being a newb at ordering ethnic/Lebanese/Phoenician food. Warning: Parking in front of the restaurant may be difficult."], ["Paetra L.", "This is without a doubt the best Mediterranean food in the area. It is no longer on Hemphill at least not at the moment. They are now open at the Hedary's location on Camp Bowie but as long as Joe is the chef you cannot go wrong. This man loves what he does and it shows."], ["Noel T.", "This is one of the most amazing hole-in-the-wall gems that I have recently come across. The restaurant is literally ran by a husband and wife who have an industrial kitchen IN THE DOWNSTAIRS of their house...It doesn't get anymore home cooked than that! All of the dishes are amazing, and the portions are bigger than you could ever imagine. I cannot really say anything bad about this place. However, beware of the slow service and unusual opening hours. I don't mind it, the food is entirely worth the wait."], ["Andrew H.", "Do you know how you think of something and it gets stuck in your brain until you satisfy whatever craving you have? Well for the past few months falafel has been stuck there. Not sure why, because I probably haven't eaten it in well over 20 years. So it's an odd thing to crave it. Lately I've been trying newer and healthier items. Vegetarian is foreign to me. I like meat. I love a great burger. So to try veggie options is not my norm.During one of my random Yelp searches a month ago I discovered this place, but I didn't visit until today. I had taken a look at the menu online and saw kabobs, hummus, labni and of course falafel. In my limited experience with falafel, it has always been chickpeas. Their version is chickpeas and fava beans. As the reviews before have stated, HUGE PORTIONS, CHEAP PRICES. I orderd some labni (yogurt that is dried to a cream cheese consistency), a falafel sandwich and a piece of baclava. I didn't even pay eight dollars for everything. I got it to go and the food came in two bags.............. wow.The labni was exactly what I thought it would be and it came with a fresh piece of pita. It reminded me of plain greek yogurt but a whole lot thicker. It was really good. They have another version that they serve that has garlic and mint mixed in called labni matoon. The falafel sandwich ($3.50) is gigantic. A large pita with several warm and soft falafel balls with romaine lettuce, tomatoes and another pickled vegetable and was served with tarator (a sauce made from sesame paste, garlic, lemon juice and parsley sauce) The sauce is tart and tangy and ties it all together. I did like the falafel itself. Moist and crisp and really good. I also needed a little sweet to complete this meal and had a piece of baclava. Layers of phylo and macadamia nuts with a rose and orange blossom syrup. Sweet, salty and just a perfect way to finish off a really good meal.With such options as manaeesh, ftayir, shawarma and of course kabobs there are many, many new foods to try and I will return, with others because I can't eat all of this myself.Enjoy."], ["Amanda H.", "The previous reviewer explained the service very well.  You have to roll with it and not be in a hurry.  That said, the prices can't be beat, and the food is extremely fresh.  My faves are the tabouleh, hummus with pita, and the falafel.  The baklava is to die for.  The prices can't be beat!  A falafel platter comes with a dozen falafel, rice, lentils, and red beans for $7 or $8, and it will feed three people (or two with big appetites).  If you love Middle Eastern food, Celaborelle is not to be missed."], ["Mad I.", "Parking is very limited have to drive around looking for parking heard good things about this place too bad I didn't get to find adequate parking"], ["Ravi C.", "I have no idea how I missed this place, but I'm glad I found it. If you are hungry go here! If you want great food go here! If you want buy one get one free Baklavas go here! If you like huge portions for cheap go here! Sadly, places like Terra Mediterranean Grill(highly overrated IMO) will always out class a place like this, but people are missing out! I took my wife here and at first it seemed a bit sketch, but luckily we don't let much stand in the way if we are hungry. Ha. Food was great. We had the Falafales and let me tell ya, it's the best I've had. Ever. That alone is enough for a dinner portion. We clearly didnt read the other yelpers giveing us heads up about that. So we also ordered the spicy kafta platter a d it was huuuuuuugeeee! And full of flavor. We also couldn't pass the buy one get one free Baklavas. We got the pecan and the pistachio. Both were big and delicious. Pista was our fave though. Please go here and spread the word about this place. They deserve it!"], ["Ryann E.", "Exceptional food, everything is made to order with the freshest ingredients available, and it makes all the difference! Several people have mentioned that the food takes too long to be served, I personally would NEVER complain about having to wait 30 minutes for food that I knew was being freshly prepared. People also like to complain about the way the menu and ordering process are operated. These lovely people are able to charge such fantastic prices for their food by cutting costs that aren't essential elsewhere, like on individual menus and the additional wait staff that would be requires to take and place an order. So would you rather place your own order and pay $8 for a full dinner portion or have someone place your order for you and pay $20 for that same exact meal? That being said, I have become a regular and I will continue to support this fantastic establishment! I certainly don't mind placing my own order! I'm looking forward to bring colleagues here for lunch later this week, I know they will all love it as much as I do!"], ["Gus G.", "Wow...... Simply wow..... This little place is awesome, the hummus with meat- awesome, lentil soup very good not awesome, the shawarma sandwich awesome, Turkish coffee awesome..... I so full my gut hurts..... Wife and I ate till we could not then brought two boxes and a cup of lentil soup home.. All for the small price of $28.Best Mediterranean food I have ever had stateside. The cook must love to cook because there is no way he is making money. Service was quick and we shared a table with some strangers great conversation....  I Love This Place!!!!!!  Don't want to tell any one about it but got to keep this place open. Please go...... Wait if you have to,  but two/three people can share a meal. This is a must stop.No tv no wifi yes you must speak to strangers. Serve yourself water ,tea, get your silverware, way worth getting your callous butt of the seat.Again wow."], ["Georgia C.", "BEST food ever but I think they're closed"], ["Jennifer J.", "Parking is limited at best.  This is a family owned business with the chef and his wife running all aspects of the business.  There were 3 other tables of loyal and local customers on the rainy day that I stopped in to try lunch here during my two hour visit.  Having read prior reviews, I knew to read the menu on the board and to seat myself.  Then, the waiting began.  The waitress came probably 5 or 10 minutes later and took my order and rushed off.  When she returned 45 minutes later to literally drop a coffee on my table with some hummus, I merely asked if this was normal (to wait 45 minutes without so much as a water). The owner came out sweating profusely and raised his voice to me asking me if I was complaining (which I was not) and inquiring why I would complain about waiting 45 minutes with no water for food that was being prepared for my order and that other customers would get their full orders before my appetizer or coffee could be prepared.  When I did taste the hummus, it was good and it was fresh.  The pita bread was piping hot and fresh.  The tabbouleh was massive and fresh also but the bulgar wheat was undercooked and crunchy.   The Turkish coffee was okay but only granulated sugar to put in it and what I thought was a metal creamer container (I don't put creamer in that type of coffee so I never opened it) had more servings of coffee in it as I found out upon leaving.  I had ordered kafta with a side of grilled tomatoes for lunch and it came out with the salad.  The first bite had gristle in the meat so, that was pretty much the end of the meal for me.  This seems like a place that was thriving at one time and perhaps is in need of a restaurant business makeover or a restaurant intervention as it seems to have potential.  If you are willing to wait, order directly from the chef and ask for items such as water the first time you order.  Hopefully this business can turn things around and hopefully you have a better experience than I did."], ["Reba M.", "This place gets 2 stars bc I believe that some of the people I saw eating were whole-heartedly enjoying their meal. After placing our order, sitting down at an uncleared table, and waiting 20 minutes with no service, not even drinks, I found the server and asked how long the wait was and she said an hour and then asked me where my order was. Unique service indeed!  I guess you have to get there right at five in order to not wait forever.  The food looked amazing and I can't wait to eat it... One day. They need another cook and more than one server."], ["Chadd S.", "hidden gem.   This place has been recommended for years.   Finally I had the pleasure of experiencing what is Celaborelle.   It has such a strange old house exterior which leads to a surprisingly welcoming interior.  The service is a little awkward until the other patrons give you some insight.   You will write your own order on old Carriage House order forms (recycling in action.  Love it) then pass them through the window to the kitchen.   The chef will assess your order and nod if all is approved.   Find your own table and enjoy the wait.    Food  will continue to flow until you can't imagine what else will follow.   The falafel is the absolute best I have ever put in my mouth.   I highly recommend the chicken livers (add a little lemon and it takes you back to the Hedary chicken livers).   Well done beyond my expectations.   An incredible dinner experience!    The most shocking part of our evening was the amount of food that was served and our tab was phenomenal.    A must go!  Add it to your list!"], ["Taylor S.", "A hidden jewel. One of my favorite places."], ["Jason M.", "For the money, I can guarantee you won't find more tasty or well prepared food on this planet! The ablama and the sheik al meish is awesome. They have a $3.95 special everyday. Don't go expecting to be in and out in 15-20 min. And plan on taking home a ton of leftovers. Portions are enormous. Prices are the lowest I've ever seen for food of this quantity/quality!  Enjoy!"], ["Garrett R.", "This place was LUDICROUS! It's in a pretty run down area on the outskirts of Downtown Fort Worth. Family owned since 1908, the restaurant is in a beautiful, large but similarly neglected old home and walking up the steps to the front door comes not without some general confusion. There isn't much else around the predominantly residential streets. Inside it's very clean. The original brown patinated interior was very charming and we were greeted to sit and be shown the menu. As far as I could tell there was a single hostess/server and the cook. Between the four of us we ordered 2 falafel and 2 veggie plates. We ordered starters of hummus and pita(awesome), and tabouleh. My veggie plate included a bowl of lentil grape leaf soup and a small serving of babaganouj. Delicious! Stop! Enough food. \"I'm good!\" My main plate arrives and it's huge. Black beans, lentils and rice, and a sort of hot squash dish called Kibbi, and five 3 inch falafel. Turned out the falafel plate was the same arrangement except substituting the soup and Baba with five more falafel! An absolutely ridiculous amount of food for all of us, we turned away two of the falafel dishes out of fear. Cost? Guess what...$5.95 for all my entree. I'm guessing it was about $32 for all of us to eat and drink. Do yourself a favor and go out of your way if you must to enjoy what this restaurant has to offer. Anybody under 5 stars on this one is silly and the asshole posting a 1 star should be dropped and drowned in a vat of babaganouj. On second thought, not a bad way to go if it's made from Celaborelle!"], ["Brian L.", "Just wow, portions are epic.  Thier medium salad would easily be 5 portions at a normal place.  Worth coming out to ft worth for."], ["Josh O.", "This place is a hidden gem. You'll drive up and question whether or not you came to the right place but do not judge this book by its cover. This is the best Mediterranean food in Fort Worth and it is very underpriced. A few things- -The staff is extremely friendly and helpful. They aren't very talkative but the service is great. -The food is phenomenal. I would recommend the Beef Shwarma and you HAVE to get the pita bread and hummus. The meals are so cheap, especially for what you get. -It is BYOB so it can make a great and affordable date place. Just make sure she is ok with the \"run-down\" feel of the place. **-Do not come here if you are in a rush. The speed of service is hit or miss. They have a small staff and seem to make everything from scratch. There will be a wait for your food but it is worth it. Overall, this is worth the visit if you can deal with the neighborhood and the run-down feel of the place. It's slow service but amazing food."], ["Heather M.", "I went here with my best friends for my birthday dinner. I got to pick the place, and I have to say that even though my friends thought I was crazy when we pulled up in front if what looked like a house that belonged on a scary movie set, we had the best time! The inside is quite cute and date worthy (perhaps blindfold your date until you get them in the door - or point them here to all the glowing reviews so that they will be less put off by the exterior and neighborhood). It's also obviously great for a group of friends! I found this little gem by searching for BYOB places in Fort Worth (they provide wine glasses and don't have a corking fee).  The amount of food for the price is incredible.  You may not want to go as crazy as we did, ordering several appetizers and four meals among the four of us - we ended up with 10 to-go boxes and enough food to feed us for lunch and dinner the rest of the week.If I could only tell you to order two things, it would be the hummus and pita plate (killer pita!) and the falafel.  I LOVE their falafel!  They make the best falafel I've ever had.  Not only does it have great flavor, but the texture is great (not super dry and crumbly - here's looking at you Terra Grill).  We had a very picky, non-adventurous, non-veggie eater with us, and he devoured the falafel right along with the rest of us (quite a testament to the awesomeness of this falafel).  I also need to note that the aforementioned meat-eater with us ordered the brisket plate, and not only was it great smokey meat (with two HUGE sides!), it was only $4.99!!!!  RIDICULOUS! So grab a bottle of wine and your open-minded friends and prepare for a feast of copious yummy goodness!  You better run, not walk, or I may beat you there.Notes:  there's no corking fee, check their website for when they are open (doesn't hurt to call either so that you aren't disappointed), try to park in front of the house or in front of the house next door (at last resort, there is parking behind the house next door), share plates or have space in your fridge for leftovers, and get the hummus/pita and the falafel!!!!!"], ["Kim N.", "Due to the fact that this place has been having a lot of reviews and visitors within the last year, the owners decided to raise up the prices on their entrees. The last time I came here, I had placed an order through phone just because it takes less time to wait for your meal as if you were to be waiting inside the restaurant. The guy told me that it was an hour wait. I was completely shocked! Because all of the times that I have visited, it was never busy. When I received me lamb shawarma, the vegetables were burnt and were impossible to eat. Even though the menu says \"char grilled vegetables\". I also didn't receive any complimentary pita bread. There is only one server, he try's his best to help every customer. He is also the chefs son. One time, they were both arguing and yelling in the back kitchen. Which I thought to be very unprofessional."], ["Sarath P.", "I finally got to experience the amazingness that Celaborelle Phoenician is... FINALLY! All I have to say is... WOW! We went there for lunch... we started off with the hummus plate and the feta plate. Of course -- we had starters because we just didn't know the amount of food that was coming. The feta was amazing -- not as strong as most fetas which made you want to eat blocks and blocks of it! The hummus was great with the huge discs of fresh, hot pita they also bring to you. I ordered the chicken and rice special that was $4.95 and my friend ordered the falafel sandwich that was $3.95. After over stuffing ourselves with feta, hummus and pita -- our dishes came out. HOLY MOLY. My chicken and rice was the size of a pig trough. It was enough to feed 4 people! My friend's falafel sandwich was... a circular pita the size of a medium pizza, topped with 8 gigantic falafels and a sprinkling of lettuce and tomatoes. We literally just looked at each other with our eyes and mouths wide open. To top it all off, the chicken and rice was delicious -- full of spices and juicy shreds of chicken and the falafels were so flavorful and moist! I can't wait to come back and bring newbies to experience this greatness. If you haven't been here... please go! There is nothing like this place!"], ["Vicky W.", "BIG portions, enough for two meals.  Authentic and good food.  VERY good prices.Very hard to find, it's in an old remodeled house, and you actually park in front of the window of the house next door.  Pull into the driveway between the two houses.Extensive menu.  Maybe too extensive, it's hard to decide!Very nice and friendly people.  My first urge was to offer to help with marketing!My guess is they can keep the prices low because they probably live upstairs.  Not uncommon in other large towns, just not what we're used to seeing here.Don't get the lemonade - it was made from powdered concentrate.  That's the only negative I had."], ["Ian O.", "Amazingly huge portions, amazingly tasty food, amazingly cheap, amazingly little parking space for its popularity, and amazingly slow service.Overall, it was amazing. I would probably go there again."], ["David V.", "This place is mafioso-esque. Basically a home converted into a resturant. Family lives upstairs. Parking...good luck. What parking? Neighborhood is kind of slummy. Buffet is served on styrofoam plates and with plastic utensils. Food was mediocre at best. No gyro either. The place was litterally filled with only grouponers and the resturant didnt fufill the dessert order that came as part of the groupon. Manager was also the only cook in the kitchen. His answer was that he \"just didnt get around to making it.\" Was really excited to try this place but the experience was wholly unacceptable!"], ["Nicole D.", "Outstanding! The best meal we've ever had. We were skeptics when pulling up. No or little A/C is the main drawback. A regular helped us order, that part was a bit confusing."], ["numair k.", "Hands down one of the best Lebanese restaurants I have eaten at. Even better than some I have eaten at in many countries in the middle east. That's the biggest compliment I can give them. If you want fast food or constant service, this is probably not the place for you. If you want exceptionally good food at a great price, I would check it out, again and again and again......."], ["Patrick O.", "Wow!  Great food and amazing prices.I'm not sure where you could find these prices, how do these guys stay in business..  I always tip extra here.."], ["Pazinhim B.", "We left. It was absolutely ridiculous. No menu. Instead, they walked around with ONE dry erase board that had their menu in chick scratch. Of course, if there is only one dry erase board, you can imagine how many people are sitting at tables just waiting to see the menu. This one belonged on Restaurant Nightmares."], ["Ebony E.", "Smells goood, cooked when ordered takes a long time so I advice you not to go on your lunch break..... but well worth the wait the hummus I loved portions are huge if your not a competitive eater get the small serving still well ova enough to share. 3ppl $30 you can't beat this homemade meal. I WILL BE BACK!"], ["Josh H.", "Don't show up expecting anything like service or food to make its way by your table at any point. Showed up at 6 and had to leave at 7:48 having only received our hummus appetizer. We didn't even get our drinks in that time. When I asked if we could just get our order to go I was told that we were still 3 orders back. I cancelled my order and paid for my hummus and left. I've heard that the food is amazingly delicious, but I'll never find out. Can't imagine ever going back. Can't imagine it's worth waiting 2+ hours for, especially not with King Tut just right down the street"], ["Stone B.", "Definitely going to be a regular lunch stop.  Food is simple (mostly grilled meat, fresh grilled veggies, and rice), but expertly cooked.  The chef came out and took our order, and upsold an appetizer of olives and pickles with a yogurt dip called labna.  Turned out to be a good recommendation - the olives were excellent, then had some kind of herbs that lightened the flavor, and the pickles turned out to be pickled turnips.  Nice and crunchy.  Decor is very nice - the house the restaurant is in was obviously a ritzy place at one time, judging by all the real wood paneling.  The place is small, just 7 tables.  Don't go if you don't have an hour for lunch - both times I've gone for lunch, it took about 20 minutes from the time I placed my order to when I got my food.  This is fine since it is being cooked fresh, just something to keep in mind. For this reason, it's best to go with a group, or make sure you have your Kindle app on your phone.There is a LOT of stuff on the menu.  I plan on taking a group soon so we can order a variety of stuff just to try all the things I've never tried.  Everything I've tried so far has been fairly simple and delicious.  About the only real complaint I have is the parking situation.  There's room in front of the house for about three cars, after that you have to park down the street. But the food is terrific."], ["Elizabeth E.", "Most of the poor reviews on here seem to be about it being closed - it was for a little while but it is back and boy am I glad!Byblos and Hedary's are two businesses I've enjoyed on the northside and the westside of town.  Now that I'm moved to the south, I'm so happy to see another restaurant in the Hedary family right in my neighborhood!  Warning: it does not look open from the outside, so don't let that put you off.  Check the website to see the days/ times they are open.The food is delicious and inexpensive, two of my favorite things.  I got the chicken baked with potatoes in a lemon garlic sauce, the salad and squash sides, and all of that was less than $8.  And that was half a chicken.I loved my food, and will be back.  Glad to see an affordable and delicious dining option on this side of town."]], "Casablanca Greek Mediterranean Cuisine": [["Karen L.", "Casablanca is a great dining option you will want in repeat rotation. I have eaten there many times and had take out as well. I love, love the Moussaka. I think of it as a Greek alternative to Italian lasagna, but so rich and decadent. It is a must try! I've had the beef, chicken & lamb shawarma. The chicken is the most flavorful and the lamb was nice. My daughter prefers the beef.Atmosphere is nice. This is an excellent business lunch choice for meetings as it tends to be quiet and uncrowded during the weekdays."], ["Loren B.", "Casablanca has fantastic food! You must eat here!We have wanted to try Casablanca since moving to the area several weeks ago. We tried to go on a Sunday, the one day it's not open. So, anticipation was mounting. The food was definitely worth the wait. We ordered Dolmas as an appetizer and my date went for the lemon rice soup. The Dolma was exquisite, robust and melty. It's served on a plate with lemon rice soup like a sauce, which I've never seen before. The flavors worked beautifully together. The soup itself was also very good. I ordered beef shawarma and it was fantastic. Such flavor!! It'll be difficult for me to order something different next time. Our server was wonderful. Casablanca is BYOB so we brought several beers to try and the waiter offers to keep the unopened ones in a refrigerator for us to keep them chilled. He had a big infectious smile that gave our interactions a homey feeling. The only slight downside of Casablanca was the atmosphere. A TV was mounted above us and was loudly playing a live performance of a middle eastern concert which we found distracting. The decor is a bit mismatched, like Steak and Ale in Athens.  But, no big deal. The food will bring me back again and a again!!"], ["Karissa S.", "I've been to this restaurant twice so far, & it's been a bittersweet experience.I usually will give places a best 2 our of 3 chance, & so I will give this place one more chance before I decide to officially stop coming here. (I ordered the same plate both times, Gyro and Chicken Shawarma Combo Plate)My first time I came to this restaurant I had a WONDERFUL experience, we had the female server (I cannot remember her name right now).  She was very helpful with the questions we had about the menu.  My friend and I had never been to this restaurant before, and I had never had Medi/Greek food before.  She gave us some recommendations that we ended up ordering and tasted amazing.  She was very attentive in making sure our drinks were consistently filled without being overbearing and annoying.  The food was amazing. The meat was fresh and warm, the veggies were fresh, the rice was good.  Everything was perfect.  It was a great experience for both of us.  After we left we both agreed that we must return to this restaurant again, because it was definitely great.  It was pricey, but we agreed that it was definitely worth it!  However, oddly enough the place was empty.  It was just the two of us and maybe two other tables. I also had ordered food to go for my mother, she said the food was good.  I don't remember exactly what she had ordered, but she said it was good. My most recent experience there, about a week or two ago, was very disappointing. I went in again with the same friend I went the first time.  This time we had the older male server help us out.  This time, it was a complete opposite experience.  It took forever to get a refill on my drink, it was constantly empty & he was constantly disappearing. The place was empty, it was us two and one other table so I know they were not busy by any means.  When our food came out, it definitely was lesser quality than the first time.  The meat didn't taste fresh and it was slightly cold.  The veggies also seemed like they had been sitting there for a few days and they didn't have the same fresh crispness from the first time we had visited.  It was definitely a disappointment.  I planned on taking my meal to go because I had other dinner plans,  I had two small containers of the Tzakitzi sauce and the Garlic sauce.  They were almost completely full because I didn't eat a lot.  I asked the server if I could take it to go, and for two containers of the sauce.  He asked me if I'd want fresh ones, I looked at mine and told him I have enough to take home with me.  He said, it's okay I'll bring you two fresh.  I agreed and waited for it.  When I got my bill, HE CHARGED ME FOR BOTH SAUCES.  $1 a piece.  Which, it's not that expensive, but just the principle of customer service.  If I have two containers that are full and you are going to insist I should get two fresh ones you should at least let me know that I'm choosing between charging me for sauce when I could just go through the effort of scooping it out and putting it in a container myself. I will give this place a third chance, and if that third chance is a miss... then I'm going to edit this post and give it one star."], ["David N.", "Super good food: had the sampler appetizer (everything was awesome), great pita, lamb and gyro were great, and apple pie w/vanilla ice cream was the over the top point. Furniture, music, and hospitality also incredible. I'll be back :)"], ["Rae C.", "Aw, man. I was SO hoping this restaurant was going to be awesome! It's walking distance to my house, BYOB, and Greek food so what could possibly go wrong?Unfortunately, kind of a lot. Let's start with the positive. Their falafel is DELICIOUS. Like, possibly the best falafel I've ever had.Now for the bad. The rest of the food was fine, not great. My vegetarian sampler plate didn't come with everything it was supposed to. This would have been fine and an easy fix if only our waitress had ever come to check on us.Service was just ridiculously slow. Getting seated in the predominantly empty restaurant was slow. Getting greeted took forever. Getting wine glasses to enjoy our bottle was an eternity. Once we got our food, our waitress vanished. We had to sit for a solid 20 minutes after finishing our food to get our check.No falafel in the world is worth waiting that long for, folks."], ["Jamie S.", "This place is great! We had the gyro, chicken kebab plate and the moussaka plate. Everything tasted delicious. This was our first time and I can't wait to go back!"], ["Annla D.", "Can never go wrong with Greek! I got the salmon and hummus! All delicious! They also have hookahs for cheap!"], ["Alex K.", "Easily the worst middle eastern restaurant I've been to. Ordered gyro plate.  Rice had absolutely no seasoning.  Vegetables were frozen vegetables that were overheated in the microwave and covered in salt.  The gyro meat was lukewarm (guess they forgot they need to turn the heating element on BEFORE the lunch rush.)  Had to ask twice for water.  The food actually came out before my water did.  They forgot the pita bread, but I didn't see any waitstaff until I was halfway done with the meal.  Of course, for the same reason i couldn't ask for more tzitiki sauce, which was needed because the hero meat was not warm enough to have juice or impart flavor.  After waiting for the check, I had to stand up front until someone saw me  when the waitress came to me, she told me to wait for the check because she was splitting the checks for a group (who had not even recieved their food yet!)I wouldn't come back unless a dear friend insisted on coming here.Could have been an off day for food, I won't find out. Won't be back. Your milage may vary.(Redemption notice:  as I'm in the restaurant waiting for my change, I started this review.  Change came back. Cook came out and asked how it was.  I told him I was writing this review and it was an awful experience.  He insisted on picking up change and refunding money. BTW I only saw waitress to order and to take my money.   He said waitress was new and learning.  At least the owner/cook cares, for what it's worth)"], ["Chuck M.", "My wife and I have lunch each and every Thursday. She works off of North Beach so we're always looking for new places to try. We ate here previously when the two brothers owned it and it was quite good. I wish that was the same now under the new ownership. and name.We stopped in for lunch. My wife ordered a chicken wrap plate and I ordered the \"baked\" flounder lunch plate. The description of the baked fish sounded just what I wanted for lunch.Shortly our plates were delivered and I was very surprised to see the fish on my plate with a heavy coating. I asked the server if she was sure i received the correct entree and she said yes that's how their \"baked\" fish is served. It's baked in the oven with a crust on it. Basically it tasted to me like a commercially prepared fish that had been pre-fried then baked in the oven to serve. I was very disappointed in the mis-communication on the menu.When the server figured out that I wasn't happy with my entree, the chef in the kitchen sent out another exactly same piece of fish which I didn't request. It was a very strange experience."], ["Brenda C.", "Found this place here in Yelp and it was very delicious I had Hummus and pita, and a lemon and rice soup and the soup was my favorite! I had some \"fresh\" orange juice but that was ok. The girls working there were very nice and understood that I didn't  know what they had so she explained some plates for me Coming back for sure!"], ["Melissa G.", "We have visited Casablanca twice now. It is a really nice place to take the family and seems to be family owned. The staff is very friendly and take the time to talk to you. They do good business on Friday night and our food came out fast and fresh. I have tried the Gyro and the Chicken Schwarma...both were top notch. The hummus is great as well...very fresh with piping hot pita bread...mmmm, I want some right now!The only thing I did not enjoy were the fries that came with the Gyro...they seemed frozen and not very tasty. That is a minor thing, though. When it comes to Greek and Medi food they are spot on. The atmosphere is really nice, too. They have the place decorated very nicely and the fresh flowers at each table are a very nice added touch. I also like the real cloth napkins. If you haven't been here...give it a try! We will continue to visit this great locally owned restaurant!"], ["Gene O.", "Ladies and gentlemen,EAT HERE! This place is a gem. The environment is quiet and laid back and the staff couldn't be friendlier.Also, you must try the Gyro. Simply phenomenal."], ["Karim J.", "don't often write reviews but I felt compelled after eating here to share my experience. had lunch with my parents and the food was fresh, authentic, healthy and quickly prepared. the owner who is also the chef came over to the table to make sure everything was prepared to our liking. the location is great and parking is plenty .... I'll be back for sure"], ["Kersten K.", "We had a great experience here. Great service and the food was exceptional! I ordered the mixed grill and my husband had shawarma beef and chicken.  Both were great! Do not skip on the dessert either. The Kanafe is homemade and perfectly sweet."], ["M P.", "Was looking forward to a good Greek food. I was thoroughly disappointed. The beef was dried. The lamb did not have a hint of lamb. The only good item was the complimentary pita bread.Having been to Athens the good here is a poor imitation of Greek food."], ["Phillip D.", "For what it is it is good. I appears as if they changed ownership and menu. Think it was a higher end restaurant that had some issues and bad reviews earlier. They now have a more moderate priced menu and the staff is more responsive. We really enjoyed the meal and the flavors. With the remake I would recommend it and hope it makes up the business. We love Greek food. I think the lunch and dinner prices are the same. May have paid around $ 10 per main dish.  If you keep adding sides and drinks you can get into the higher cost ranges.The restaurant was lightly attended for a Sunday lunch. A group of 6 millenniums with kids thought they were at their friends house and were obnoxious walking around talking loud and bragging. Some people just don't understand the concept of being in public places."], ["Steve P.", "The food is always fresh. The service has always been fast , courteous, and friendly. We have eaten here twice. Both times we have ordered and app an a entree. Both times we have left full and glad we chose here to eat. We shall return!"], ["Martin R.", "This place was amazing! We came on Saturday at 11 A.M. When we went in there was litterally no one there. The man (who I think was the owner), was friendly and even cracked a few jokes; a nice lady sat us down at a table, for the drink I asked for a root beer, and she laughed, I have no idea why. But anyways I ordered a Shwarma and it was amazing, and along with that topped off with a great sauce. Unfortunately turst me, eating just 1 Shwarma look's like it will fill you up; but trust me, it won't. You will still be hungry afterwards. The fries where as you would imagine, mediocre at best. But I didn't expect top notch fries from a Greek Cuisine anyways. For some odd reason, the Greek background music shut off for about a minute, but the owner quickly fixed the technical issue."], ["Tana P.", "Yummy greek food, super friendly staff, and really authentic menu and food.  We love it here and will be back."], ["Steve M.", "Hard not to measure a place versus others. I started with the kubbeh appetizer which was interesting. I don't buy too many $7-9 appetizers but they had one so I tried. I thought menu said it came with a sauce but none. The fried ball was was like a hushpuppy with some beef inside and I liked. They also brought pita bread.I ordered the gyro plate which had meat, scoop of rice and some veggies (couldn't tell if grilled). The meat seemed a little overcooked and dry but ok. Service was great but only a couple diners with me for late lunch.I would go again but prob not if I was closer to Cafe Median in Keller."]], "Gyros Greek Cafe": []}