{"Pasand Indian Cuisine": [["Raghari P.", "Great tasty food. We just visited at the closing time but we were very well welcomed. Ambience and service was great. Food tasted superb. Well visit again."], ["Shay S.", "Just terrible.I should've  turned around and walked right out when I was greeted with the strong  pungent  odor. Not the smell of food, but a distinct odor.1. The complimentary appetizer smelled of old oil.2. The water had particles of unknown item floating in it.3. Drink was watered down. Had to ask twice to just Get it.4. Plates (empty and clean) smelled.5. Food overpriced. Dosa smelled of old oil or such.6. Flies came by to have dinner  with us. Gross. 7. Everything  felt sticky and unsanitary.8. Had to ask for silverware twice.9. Looked up at the ceiling to see water marks and dirty vents. Didn't know  help ambience.10. Barely could swallow the overpriced \"food\"So unhappy. Had to down 2 or 3 peppermints to recover. I hate writing bad reviews but i really  think restaurants need to up their game. There is no excuse for unsanitary dining areas and poor customer  service. I understand  food taste can vary and is subjective. But I felt disgusted the entire time."], ["Neha M.", "this is one of my favorite Indian restaurants ever.  I love all their dishes I have had.  I have had various items here, from chicken tikka masala, to chole, and even the dosas are so good.  They even have a party hall that we had rented out before and had about 80 people come, and it was awesome and cheap....and of course the food was fantastic!"], ["Lily F.", "Came here on a Saturday for their buffet lunch and was pleasantly surprised.  I'm a huge goat curry (goat anything) fan and was happy that this Pasand's version of goat was perfectly tender.  Other stand outs for me were chicken biryani, fish curry and of course the raita, which was almost drinkable.  The naan was fresh and hot as well and the wait staff were polite and welcoming.   Also, each table gets a basket of their piping hot dosa stuffed with the potato mixture which was amazing!"], ["Samuel M.", "Great buffet. Price is fine. It's a bit too quiet if you care about the whole place hearing your conversation. I prefer to go alone."], ["Kumaresan P.", "Decent and well done buffet. Worth a visit. Authentic taste, not americanized, not spicy (hot) as well. Well balanced. Clean place, excellent service and delicious food."], ["David L.", "Arrived at the restaurant at 2:10 PM on a Sunday afternoon.   Judging from the demographics of the customers  this is truly authentic Indian food. My wife enjoyed the meal and wants to come back.I have eaten street food in Korea, China and Mexico.  While my pallet can handle  diverse flavors  I struggled to find a group of dishes on the buffet I cared enough for to make a great meal.With a split  decision on this one I would say if you enjoy Indian flavors this is a reasonably priced buffet worth your time. The service was good and the people  friendly."], ["Daniel M.", "Excellent quality! Fresh food, the service is very kind and helpful. The place is clean, my personal favorite part about eating here is the buffet, it is pretty diverse.  If you're looking for something authentic this place is pretty well spot on."], ["Pruthvi K.", "Worst Indian buffet I tried ever. I would never ever ever step in there again. Last Friday I went with my coworkers there, and we had a really bad experience there.First of all they had really less varieties to try.There are hardly 2 to 3 starters which taste like crap.And the naans are really dry.Tried cabbage manchurian which was totally dipped in oil, there's both but oil in it. Tried goat curry and biryani thinking that they may not go wrong at least in the basic Indian delicacy, my prediction was wrong. Meat was half cooked in a way that we can smell the rawness of the meat.And the desert, they had rock solid rasagulla, which in general is the one of the most fluffy Indian desert.The only thing that was good is gulabjamun.I would never ever step in there again."], ["Sergio M.", "It was ok, well, not even ok. I doubt I'll ever go back. First in the free appetizer, the thin crispy thing they give u with two sauces, had a hair fried into the crisp. Then when I received my curry, there was a hair in it too. My wife's curry had a bone in it . All this in one same visit! It was our first visit and the first impression was destroyed."], ["PAUL G.", "Was in town for a short business trip and fancied some Indian food for lunch.  I found this place on Yelp and I'm glad I did.  While the atmosphere and general service was nothing to write home about, the food was marvelous.  The lunch buffet was full of absolutely delicious delights with a very impressive selection of both vegetarian and non-vegetarian options.  I'm not often in this part of the country, but I assure you that I have marked this place as one to return to if ever I am.  I hope you enjoy it as much as I did."], ["Chris H.", "I eat lunch at Pasand weekly...they have a good selection of traditional Indian cuisine, both vegetarian and non, that varies daily and never disappoints.  Unlike many lunch buffets they serve naan fresh at the table, which is an added bonus."], ["Sajith A.", "I went out with my friends few days back.. Food was really horrible. Nobody felt good. It wasn't authentic Indian food. Desserts were sour. Chutney wasnt good.Not sure if they really use mangoes or use the syrup/powders to make mango kheer. Only puliogare was good. We went there only because of the reviews here ! Will never go again. Not a Pasand(good) place at all. I'd recommend Chennai cafe/anjappar ($$ though). PS: Music was worst (really). Atleast play 106.1 FM"], ["Tim V.", "I used to frequent Pasand when I lived in Irving about 10 years ago. I think my go-to dish back then was the Malai Kofta, which is cheese (paneer) and vegetables rolled into balls then fried and placed in a delicious, creamy curry sauce. I can't remember ordering much else, but it was always a great dish.I remember eating the lunch buffet once or twice, but, luckily I had the presence of mind to suggest it when a friend from Grapevine wanted to meet me halfway to Dallas. I'd been wanting to gorge on an Indian buffet for quite a while, but find it hard to make it to Richardson, Irving, or Arlington, where my favorite Indian restaurants are.It was everything I wanted and then some. The butter chicken and mutter paneer were delicious curries. On the weekends they bring you a dosa... don't forget the mild green sauce that goes well with them, located in the buffet. There were other dishes, all delightful, that I can't name, and the warm rice pudding was delicious. For $11.99, the buffet was well worth it."], ["Sarath P.", "The weekend lunch buffet was ok. I enjoyed the vegetarian dishes more than the meat dishes that were offered, although the goat curry was really good and spicy. Some of the dishes were super salty -- I don't think I've ever had the problem when eating at any other Indian restaurant before. Also, there was only one dessert option available and it wasn't gulab jamun. We all did enjoy the complimentary dosa that came with the buffet. Being that there are so many other Indian restaurants in the Irving area, I probably won't be coming back to Pasand."], ["Michael C.", "We were visiting the area and decided to dine Indian.  We seek out Indian fare in our travels, so we are able to compare and contrast.  We ordered chicken tikka masala and lamb curry.  The chicken was pretty tasty, but we were surprised to find bits of cartilage, which suggests they were using dark meat, rather than white meat, as we have come to expect.  The lamb was disappointing, primarily because the pieces of lamb were chewy, with fat and gristle.  To me, that is often what differentiates good from not so good.We received an order of naan with our meal.  It was delicious ... nicely prepared and quite tasty.I also note that both restrooms were out of hand soap and the women's room was desperately in need of service.  In any restaurant, the level of maintenance of the restrooms is a general indication of the attention that one can expect to cleanliness.  We discretely brought this to the attention of the server and they appeared to address the issue pretty quickly, which is a good sign.Final analysis -- Not good, not bad, but we will explore other Indian dining options next time in the area."], ["Christina W.", "Thrilled to find this place. We've tried several restaurants around the area and nothing has come close to Pasand's. The lunch buffet gave us the opportunity to try many dishes and the waiter was courteous and quick.We will definitely be back!"], ["Gene B.", "One of my favorite restaurants in the DFW area.  Loads of delicious and authentic Indian food at very reasonable prices. They have an extensive menu with options for every palate. My favorite is the Chicken Tikka Masala. Service is prompt and friendly. Can't wait to go back."], ["Daniel M.", "I work right down the street and go here all the time.  Always very clean and very good food.  The food is excellent and there is very strong consistency on a number of items on the buffet which is great.  Your expectations are always met.I was debating on 5 or 4 stars.  I landed on 4 stars just because I think they are staffed just 1 person short at lunch and often have trouble flagging down the server in case you need anything such as a refill.  Other than that, it would be great if they could mix in one more vegetable dish such as a korma to balance the buffet selections.  What they do have out is usually fresh, good quality, and very tasty."], ["Tanmay A.", "OK Lunch buffet. Based on the reviewes, I visited this restaurant today and went for a buffet. There were limited items in there and not all were upto to the par, there was no taste of authentic indian food. Andhra Chicken & Fish curry were good in meat section, Okra was good in veg. section. But the famous chicken tikka & butter chicken were not upto the expectation of real indian food lover. Tikka was just red in color, but not from Tandoor, butter chicken was not that good too. Ambiance is good, Service is good, food is OK/Good. Overall, I would say OK, but with the limited choice & un-authentic indian food, I wont go here again for lunch buffet."], ["Tamira V.", "Very underdone place- looks wise. Food is okay- the sauces are great and the nan, too, but the buryani is terrible- using frozen veggies, and they never have the lamb dishes from the menu available. The service is okay- they aren't too slow, but it can be hard to get anyone over when you need them, and they don't speak very clearly. (Same thing over the phone.) The employees always seem like they are irritated and distracted. I go back for their sauce dishes, but I prefer take out from here."], ["Vish K.", "Before we moved out of Irving, we were regular lunchers here. The biriyani and curry dishes were consistent and we always had a good hog.I had a chance to visit recently and was nice to see they have maintained the food standard and spice levels. I wish they had a branch in North Dallas area, but if you are in the Irving Mall area and craving for Indian food.. this place is certainly worth a visit.Cheers!"], ["Prince H.", "Good lunch Buffett offering standard selections. Very clean and fresh. For a Buffett, good food."], ["Vy D.", "Just went here for the lunch buffet and it was great! The food was flavorful and I loved the vegetable fried rice! I had their Chicken Tiki Masala, their chicken curry, a few other items and their refreshing mango pudding. It was a great lunch! It was a VERY clean restaurant and looks much better inside than what you would expect from a strip mall restaurant! The servers/employees there are also extremely courteous and polite!"], ["Nicolas C.", "Atmosphere, service, food. 5 stars. Many options here. You can't go wrong. Mix it up."], ["Zach G.", "Pretty disappointing in my book. I did carry-out and had a colleague pick it up on the way back from a meeting, so I cannot comment on the restaurant or staff, but the food is most important right? Goat Vindaloo, because they were out of lamb (what Indian restaurant runs out of lamb?). The goat was generally flavorous. The curry sauce was decent and appropriately spiced, but not that great. Rice was fairly bland a disappointing. The naan was probably the biggest disappointment of all...I love naan, but this stuff was just plain boring - it had a strong butter taste.It wasn't a terribly meal but I must say I have no desire to order again."], ["paul h.", "Feels clean. Nice service. They didn't have a Potato sag on the menu so they made it for me. And yes, the chicken tiki masala is as good as the reviews !!"], ["Michael R.", "A decent Indian place with a good lunch buffet. They had some of the old stand bys, like tandorri chicken, chicken tikka but they also offered a tasty goat curry and chicken biriyani. The naan and dal were also quite tasty.They also had a dish I had never seen or eaten before called andra chicken. I'll definitely check it out again."], ["Anusha S.", "Being regulars here, how can I forget to drop a note here.. Love the ambience perfect indian style.. Service is great, food is really good, can set the bars even high! Buffet is a great deal, sufficient varieties. Thank god it's not overloaded like IndiaPalace, too much of anything sours.. Give a try and it will be worth it.."], ["Jana H.", "The food was very good. Even our picky girls enjoyed it ;)"], ["Rick T.", "The selection is better than average; everything tasted delicious.  Ate from the buffet, so I don't quite remember what all I had...except for the goat curry.  Very tasty.  If you like Indian food, eat here."], ["Shannon G.", "I work around here and love Indian food so I thought maybe it could add it to my list of go-to lunch spots.  And I have -but only for take out.One day I got some Chicken Tikka Masala takeout and it was very yummy but spicy out the ying yang.  There was naan and rice and the usual condiments (tamarind sauce and mint chutney) but also something I've not been able to identify.  It was sort of like diced carrots in this oily hella spicey sauce in one of those little condiment cups.  I didn't know where to put it so I kinda dabbed my naan in it.  It was interesting so I say they get bonus points for introducing me to something new!But then I had the lunch buffet one day and was not impressed.  Maybe it was an off day but it seemed like the selection was weak.  There were alot of curries (I'm not a huge fan of anything that is called just Curry *Blank*) and it just seemed like the meats were sub par -fatty or lacking flavor.  It was generally lacking some of the elements I just expect from an Indian buffet.  Also, I've never really enjoyed getting the free dosa that so many Indian buffets try to bring you (Pasand is not the only one who does this.)  This may sound mean but I just don't like them and the point of a buffet is to pick what you want to eat. I know I don't want to eat that so please, just put them on the buffet, leaving it untouched makes me feel so wasteful!"], ["Paul W.", "One of my favorite Indian food places.  The Vegetable Biriyani and the Chicken Tiki Masala are to die for.  The Masala Dosas are huge and the Papads are crunchy; you can't eat just one (apologies to Pringles™).  The Raita and Pakoras are also very good.The owner/staff are very helpful and friendly.  They go the extra step when accommodating our specific tastes."], ["Juliane S.", "My friend and I stopped by today for lunch. We are from out of town. We were craving Indian food and came across Pasand via a google map search. We were even more excited to know they have a lunch buffet! Everything was really good, and they had a great selection to choose from. But the BEST thing was the KHEER! SERIOUSLY THE BEST EVER! You have to try it when you go :)"], ["Zee S.", "I had the lunch buffet. It is serve with freshly made masala dosa, which was unexpected. The buffet consist over 10 items. I enjoyed the chicken masala the most. Though there was only one goat item. Rest were vegi and chicken. Overall,guests were well served and atmosphere is nice and clean. Food was too mild for my taste but if you don't eat spicy, it might be right for you. Overall, my experience there was pleasant."], ["Mohammad K.", "This place use to be amazing for the last few years but now it sucks. The bread was uncooked or burnt, the food was way too spicy and when we asked for a less spicy food they brought us food that was bland and had no taste whatsoever. When I was at the cash register, I noticed that his fingertips were yellow. When I got out of the restaurant, I noticed that all of our fingertips were yellow as well. It shows that the only things in their food was food coloring and spice. The only good thing was that the server was prompt at bringing us water,which you need if you are going to eat there. I filled myself up with more water rather than food.This place use to have high standard, really sorry to say that I will never come here again, and I will suggest you not to waste your  money on this garbage."], ["Nadine F.", "This place is pretty good for an Indian buffet.  I don't usually go here by my own will, but if someone else suggests it, I'm more than happy to oblige.  It's particularly good if I'm going with my vegetarian friends, because this is probably my favorite of the three restaurants they can eat at in the area.  (I will kill myself if they make me go to Macaroni Grill for the 501st time.)The nan is good, and there are always at least two or three things on the buffet that are so good you'll want seconds.  I wouldn't go out of my way for Pasand, but if you have vegetarian friends, I bet they'd be really appreciative if you suggested it to them.  The other plus is that you can go to this place with your vegetarian friends, and at least you know you won't have to eat flavorless tofu and carob, as you've probably had to do at many of their other favorite restaurants while secretly wanting to punch them in the face."], ["al a.", "I'm back and so is Pasand.  They are back to top form.  Lesson learned.  Come earlier (so that the vacuum guy does not have a chance before we are done eating).  Come even earlier (so that you get a nice buffet line with a freshly cooked Indian feast.  The nan was brought to our table almost instantaneous to our being seated.  They seem to have added more staff, too.  That's just great!Kudos to you Pasand, well done.  The only thing holding you off to 5 stars is your liquor license.  What gives?"], ["ash m.", "So after trying out almost every indian palce in dallas .. I had to give pasand a try.. I remember as a kid going here after church with my folks. That was 10 years ago.. so I went on my lunch break to check it out..I was seated fast, (tue 11:35am) so they just opened.. I went to the buffett and filled up my plate.. Chicken tilka masala was great, ..spicy, good flavor, and HOT.. tried the chicken Biryani.. good but not the best ive had. Tried the chicken tilka..Great!!! Naan was brought to my table, Hot and fresh.. I tried the samosa, potato fry and the Pakora.. all were good.. better than myuri id say..I then went for the desserts:)  well Gulab jaum was just average.. then I gave the rasmalai a shot.. not good at all..watery..Overall the food was good.. But i wont be back..Cause the main issue I had with this place was not the quality of the food.. it was tasty and fresh..As I was getting my dessert..I got a bowl off the buffett..and saw a special uninvited guest.!!!!!on the bowls stacked high for desserts.. A baby ROACH WAS CRAWLING AROUND.. that was GROSS.. let alone to think its on the same ISLAND AS THE FOOD.. That just did it for me.. I was pissed..esp since i had already eaten.. I WILL NEVER BE BACK.. I should have belived  Dallas F.'s review.. cause he wasnt lying.. Be carefull.. the taste might not be from the spices at this place!!!!"], ["Stefani N.", "My favorite thing to order from an Indian restaurant is the Masala Dosa and it's rare to find a restaurant that makes it as good as Pasand. It's a giant crepe that's crispy and stuffed with masala potatoes, onions, peas and carrots. Pasand serves theirs with a coconut chutney but I tend to swirl mine in tamarind chutney because I like that tartness to cut through the richness of the crepe. Wow! It's so good!!!On Sat and Suns they've got a lunch buffet going on and it's not too bad. You get a complimentary dosa with your buffet. It comes with a good variety of vegetarian and non-vegetarian items. I personally think ordering from the menu is better than the buffet. When it comes to Indian buffets, I still think that Mayuri has the best lunch buffet as there's more to choose from. However, if you're not willing to drive all the way down to 635 and MacArthur for Mayuri, Pasand is a good second choice."]], "Ramailo Restaurant": [["Suzanne P.", "Consistently delicious! Chicken korma, chicken tikka masala, vegetable bryani & garlic naan. I crave this place on a regular basis. Have never been called a \"regular\" in my 40+ years until now. Seriously some of the best food I have ever had, ever. You can tell this food is made with pride. Huge portions!$30 for enough food for easily 2 meals.  Service is GREAT!"], ["Dominic C.", "Nepalese food is under most people's radar. Most people tend to focus on Indian or Chinese cuisine but forget that there are cultures and people between those 2 giants that are equally exquisite.While Ramailo does have lots of Indian food, I suggest trying the authentic Nepalese items. Why go to a Nepalese restaurant for Indian food?Momos are Nepalese meat dumplings. They're very unique because of the spices used. There's fried and steamed. Both are good. Try them with chili too.For an introduction to Nepalese food, try the platters. There are 3 platters - Nepali, Newari, and Thakali. A combination of the Newari and Thakali should be a good start.There are too many items on the platter. Most of them sound foreign so I can't spell them. Just know that there are organ meats on one of them. I love organ meats.I was told that there are weekend specials that need to be called in because of the prep time. That seriously piqued my interest. Will definitely RTE."], ["Eldric B.", "Based on my experience tonight, I seriously gotta wonder if this was the same restaurant that was given 5-star reviews by other users, or if I had accidentally gone to another restaurant operating under the same name.The ambience left alot to be desired - my party was seated in an area between two hanging television sets, and we were constantly having to talk over the Planet Bollywood program in order to hear one another. The noise level was so loud, that we had to flag down a member of staff to get it turned down to a semi-acceptable level, 10 minutes after we were seated and our order taken. Why they didn't have some mellow music playing instead is beyond me...Foodwise, it was more miss and less hit - the momos and garlic naan were good, but the chicken tikka marsala and curry goat were definitely big misses! Based on previous reviews we expected large \"Texas Sized\" portions - nope, not here. My chicken tikka marsala was a chopped up half an overcooked chicken breast laying at the bottom of a bowl and a cup and a half of tomato-based sauce. I spent most of the dinner dredging the bottom of the bowl with my fork, looking for ANY pieces that I might've missed, because I couldn't believe the lack of meat! The dish itself wasn't at all spicy, yet I had asked for medium - so I had expected at least SOME spiciness. My dad's curried goat was more bone (3 LARGE bones) than meat, and what meat there was was hard to chew. I've been to places where they slow-cooked the meat till it just falls apart because it is so tender, but this....not so much! Had to sit and watch the poor guy struggle to scrape any meat off the bone with his fork, JUST so he could eat! Lastly, if you want anything to drink, stick with water - $1.50 for a can of soda and even then, 1) not what I asked for (a diet soda of ANY kind - they brought me a regular Sprite), JUST arbitrarily what was available,  and 2) no refills - I wasn't even offered one. If you want good Indian/Nepalese cuisine - this ain't it, so believe me, just keep on looking!"], ["Miki E.", "My friends and I are very adventurous and love to try foods from other countries. When we try a new restaurant we let the waiter/waitress pick for us.  They did an awesome job! There was a lady who explained all the different plates they picked for us, she was extremely knowledgeable!We started with chili momo. Very spicy but you must try! Definitely my favorite dish. We got the thakali platter for the main course. A little bit of everything, so great for newbies. Definitely recommend this restaurant! This place is very chill. If you are in a hurry you may want to hit up some fast food. You'll spend an hour here. It's worth the wait!"], ["Michael N.", "Great food. The biriyani is very delicious especially with mutton. Service is a little slow but overall a great restaurant. The hostess was incredibly friendly and made the experience very enjoyable"], ["David H.", "Wow! I really like to experience different food cultures, and Romailo is a great experience. Our waitress/host Diksha (I hope I spelled it correctly) is so gracious and helpful. We left the food choices up to her since we did not have a clue what to order and wanted to try a sampling of both Indian and Nepalese. We had these large crispy chips with a carrot and pickle relish on it, along with chili moomas and a spiced goat tray with various accents. So good! Our entrée consisted of Chicken Marsala, pork, and the mixed grill platter. Everything was delicious! Make sure to let them know if you like spicy food! Last but definitely best, Our host took the time to explain a lot about the foods and the culture which made everything just that much better. This is definitely a hidden gem!! We'll be back again."], ["Monica N.", "Favorite Nepali restaurant, hands down. The food is amazing here. I strongly recommend any of their momo dishes, my personal favorite is the jhol momo. Also, the chicken chhoila cannot be beat. It is the spiciest dish on the menu, but please don't let that scare you away. I promise you won't regret it. The staff is super friendly, and very attentive to your needs. Some of the best customer service I've ever experienced. I highly recommend this restaurant to EVERYONE. I love this place."], ["Eleazar C.", "I was blown away by the level of service. Our server was extremely sweet and caring. She knew we were new to this Nepalese food so she gave us a free sample of a few different kinds of Momo, which were delicious. They also gave us a free glass of wine for checking in on Yelp."], ["Melinda B.", "Had the platter which the hostess explained were traditional.  Loved all the flavored.   The food was spicy and interesting.  Definitely will eat here again."], ["Perla G.", "This place is great. The customer service is unparalleled. You could tell the server, Dikchhya, cared about her culture and the food they served and she really wanted to share it with us. The atmosphere was very casual, but fun. I ordered vegetable samosas, garlic naan, and chicken tikka masala. Dikchhya recommended mango lassi at the beginning of the meal, so we got a couple of those. They were flavorful, just the right amount of sweet. Next she brought out some masala papad as an appetizer and those were the tastiest I've ever had. The vegetable samosas came out and according to Dikchhya, they were freshly made from scratch. The taste definitely reflected that fact. Then Dikchhya brought out a sample of momo, a favorite of the Nepalese, free of charge. She brought two vegetarian ones and two chicken ones. I preferred the chicken, but the vegetarian one was also good. Again, you could tell she loved to share her culture with new customers. Our entrees came out soon after trying the momo, and they were perfectly spiced. My medium-spicy chicken tikka masala and garlic naan were delicious and although I felt like I ate a lot, the food kept multiplying. For the price, the portion sizes were great. Dikchhya made sure our water was always filled (that is very important to me) and said the next time we came, she would guide us through Nepalese cuisine, since neither of us has ever had it. She helped us box up our leftovers, we finished off the meal with a handful of mukhwas and left. The combination of amazing food and even better customer service ensures that I will definitely be a loyal customer here."], ["Joel S.", "The food was full of flavor.  I had one of the platters and was very happy with the many flavors.  It left my taste buds dancing. I will definitely be back."], ["D'man D.", "Tried the Veg Thukpa(Tibetan Noodle Soup) and veg momo(dumplings), both were very average. The soup had too many ginger pieces and not much flavor, dumplings were ok but the sauce was very bland; need to up their game on Veggie items. Also, I didn't like that fact that they were cleaning the floor with strong Clorox during lunch hour."], ["Kapil G.", "Nepalese restaurants never disappoint me and the legacy continued with Ramailo today. Can't say much. Just go there and try some awesom and delicious food."], ["Stephen E.", "What a great find this was. Thank you yelp. Our server was so helpful. If you are not familiar with the different cuisines, then this is your place. They will help you pick your foods and walk you through the menu. They have such a great variety and the quality was great. The atmosphere is very laid back and they let you sit and enjoy the company of your table so if you are in a rush you would need to say so. Super friendly and helpful service. Greaty food.... it's hard to go wrong here."], ["Kimberly K.", "All I can say is- amazing. Great food and absolutely the best service I've had in a long while. My husband and I were feeling adventurous today, and even though our last Indian food experience went awry we decided to give a new place a shot. We are super glad we did! From the beginning our experience was great. From prompt seating in a good looking and clean dining room, to a polite greeting and having someone walk us through the menu, we were already impressed. Every single thing we had was delicious. Husband had the Thakali (sp?!) platter and I had the Nepalese platter. My standout was the Daal- or yellow lentil soup. So incredibly delicious I'll be craving it later! Come here, and I promise you won't be disappointed. We'll most certainly be back."], ["Nayan P.", "This is the best nepali restaurant ever I have been !!! Great food greatP service and cheap price  what else you need !!! Simply the best nepali restaurant !!! Will surely go there again and again !!!"], ["Annalisa S.", "Fantastic authentic nepalese food with great service. I loved the entire dish I got (which was like a sampler). There were so many dishes and I wasn't sure of everything I ate but I enjoyed every taste. You can choose your level of spiciness and I went for medium. It was great! We will definitely be there again."], ["Robin B.", "My son took me to Ramailo today and it was fantastic! Dictia (not sure of spelling, pronounced like \"Dictionary\" with 'a' sound at the end) was incredible in explaining their food, how it was made, etc. Their homemade naan was excellent. The chicken masala, outstanding. And so much more. I highly recommend this as your next choice for Indian food and am looking forward to returning."], ["Sanjeev S.", "Service was Oke. We ordered an ethnic Newari food 'Choila'. Waiter didn't ask how hot we would like. He brought it so hot and spicy that we had our mouths gaping after eating it. Dessert brought to us was canned desert heated for my minutes in microwave. I wouldn't recommend this place to my friends."], ["Biplab W.", "The food and service both were good.  The food was best i would say.  The traditional nepali Thakali Thali was outta the world.  Great food indeed.  Can be spicy for some though but still has some best nepali foods compared to other restaurants around."]], "Bombay Grill Indian Restaurant": [], "India Cafe": [], "Bombay Sizzlers": [], "Southern Spice": [["Chanh H.", "I'm usually very skeptical about Indian places cause they're usually a complete hit or miss. Considering its in a nice side of town that has lots of good eats me and my buds took a leap of faith and this place definitely didn't fail us!!! I ordered the chicken tikka masala and it came in a very cute plate with various dishes that went with the naan. The garlic naan is uh-mazing and perfect to dip with the tikka masala. Very light meal shared between two and also good for a meal if you each get individual plates! My friends ordered the chicken biriyani and it was very fragrant and delicious as well!! Only down side? A single shared bathroom.Nonetheless definitely looking forward to my next visit here!"], ["Raji R.", "Best. Mango. Lassi. Ever. My husband and I had lunch here today - he got the non-veg thali, and I got a veg thali - there are some staple dishes that are the same for both - choice of brown or white rice, sambar, yogurt, papadum, roti, and the most perfectly made gulab jamuns for desert. I couldn't stop eating the saag paneer once I started, and the gulab jamun melted in my mouth. Overall, the thali was delicious but it was way too much food for me. We both loved the food and will be back!"], ["Gern B.", "So this is NOT your typical Indian place.  No white tablecloths, no over-dressed wait staff.Picture something like Moe's or Chipotle, but Indian food instead.  I was unable to find a menu online, but if you know your Indian food, you should be able to get what you want.  I called and placed a takeaway order, but that wasn't really necessary as they have a walk-up counter and can get your food ready quickly.The size of the portions was VERY generous, particularly considering their prices are a good bit lower than a sit-down place.  Food was very good, on par with some of the better places I've been to here in the US and abroad in the UK.My only complaint is that this place isn't a chain, so I can't go to one near my house.  If I am ever in the North Dallas area again, I will be looking this place up."], ["Noreen T.", "When you walk in, it's hard to know what to expect. The interior decor looks like a chipotle with all their metallic accents and brick walls, but it smells like curry. Their Thalis are amazing, especially if you're like me and not too experienced with Indian food. Their lunch thali comes with 3 different curries, rice, different kinds of naan (a crunchy one, one with onions, and a regular one), a soup, another side item, and 2 desserts. I picked the potato curry, egg curry, and mushroom masala. They were all delicious, but my favorite was the egg curry because it wasn't spicy and had more of a tomato base. I couldn't finish all the food because they give you a lot of food. But this is definitely a fun way to eat, and its a great experience everyone should try out at least once."], ["Mai L.", "The food was pretty good, but I would say they need to work on the service. We ordered the chili chicken wings, chicken tika masala, & chicken biriyani. The restaurant was very clean and the menu was extensive. There were no descriptions for all the menu items so it's quite difficult to order if you're new to Indian food. Also the cashier was not helpful in explaining or even suggesting how or what to order. Probably would not come back unless I happen to be in the area and had a craving. Sub par service definitely keeps away possible repeat customers."], ["Raymond O.", "Indian food catered to the American eye. The taste is definitely there and none of the flavor is bland. As you walk in the restaurant it self reminded me of Chipotle with an Indian flair. I had southern spice around lunch time. There is a lunch special, which was suggested by the staff. They offer quite a larger amount for lunch. Most of the food is vegetarian, but also just enough dishes with meat to entice the normal American.Overall Southern Spice is a nice local fast food styled Indian establishment that focuses on traditional vegetarian and meat dishes with an abundant amount for on order/plate."], ["Olivia E.", "So happy I found this place!!! I'd driven by it a lot and just never really thought it would be as authentic as it turned out to be. Walking in there are booth tables and tall tables, brick walls and a huge menu posted on the wall similar to snappy salads. After reviewing I decided on the veggie samosas and tikka misala plate. Pricies are very affordable and you get huge amounts of food. Good idea to share a plate with a friend. Masala plate came with rice, lentil veggie soup, lentil curry, 4 pieces of naan, yogurt and a dessert that tasted almost like gulap Jamun with rice instead of the sweet dough balls. However, you get a free order of gulap with your yelp check-in.  I really enjoyed the food here. Can't wait to try the other dishes."], ["Cat N.", "OOooo I like this place! it was such a unique experience to mix things up once in awhile. :) This place is definitely not for the usual American. You need to be able to take a lot of spices at once. Flavors will hit you before you could even comprehend what you just put in your mouth. I went with the non-vegetarian thali to try different items at one time. A thali is eating style with different selection of many dishes in little bowls.  You get two different types of rice: white and biryani. You also get a crispy naan and a soft naan. It's a lot of carbs. There's soup and a squash type soup. All that are default so you don't pick them. You pick your meat and a different veggie dish. I went with chicken curry and cauliflower. Flavor was definitely packing but the chicken had too much bones. I didnt get any meat. Cauliflower was my favorite! you also get this really spicy paste and a dessert that tastes just like a sponge cake soaked in honey! Go through the line, order, and pay at the end."], ["Amy T.", "Southern Spice is definitely your americanized indian joint.  You walk in and see a huge chalk menu, place your order accordingly, and they'll call out your order when it's ready.  Service is friendly and prices are extremely reasonable.  We got two tikka masalas and an order of samosas for $25.  Overall, I would say the tikka masala was just okay.  It didn't have that flavor that left me all bug eyed,  The chicken was a bit on the drier side and the masala itself didn't have that powerful flavor that I was expecting.  The samosas on the other hand were exceptional.  They're huge and the tamarind sauce is perfect.I really wanted to love this place but I just ended up liking it.  Would I come back?  Sure, if it wasn't terribly out of the way for me."], ["B R.", "Butter chicken & the garlic naan.Do yourself a favor and do this for lunch or dinner as soon as possible. Now admittedly they could do better to explain the menu to those that aren't familiar with Indian cuisine but still so so delicious and fresh!"], ["Krista R.", "Yelp said that there was waiter service and there isn't. Southern Spice is like the Chipotle of Indian food. There is a menu on the wall and you go through and order or pick already made items on the line and then seat yourself. The decor is lovely with a hipster feel to it. Since Yelp said there was waiter service, I was expecting a casual sit down restaurant. Instead what I got was the Chipotle of Indian. The menu is on the wall with no descriptions. I like descriptions. When we asked what something was the staff seemed to get irritated that we even asked. I went with what I knew best, Tandoori Chicken. My husband got the Chicken Tikka Masala. Fun fact thanks to the travel channel: Chicken Tikka is an Indian dish. Chicken Tikka Masala is a British dish. The Brits like their gravy and so that is how the Chicken Tikka Masala came about. I always thought that they were both indian and it confused me why the Londoner and From Across the Pond served Chicken Tikka Masala. Thanks Travel Channel.Anyway, the chicken tikka masala is served with white rice and a couple of sauces. The chicken tikka masala was amazing. I got the full portion of Tandoori Chicken. Kids got the half. The half comes with 4 pieces. The full comes with 8. 12 pieces of chicken were gone. I loved it. The kids and husband loved it. Full of flavor and so moist. The Lentill balls were good as well. Everything came out pretty fast except the Tandoori Chicken which took about 15 minutes to come out. No complaints on that though! Would I come back? I probably would."], ["Thy T.", "We came here in the evening near opening time and we were the only one here for a while. When we walked in, there is a strong smell which can be a little too much for some people. But your brain become used to it and you forget about it later. This is not your typical Indian restaurant. The decors are hipster-ish with bench-like tables while modern music is playing in the background. The menu is on the back wall with giant words that you can't miss. I love eating Indian food but my knowledge of the meals are pretty limited (sorry, I can't help but order vindaloo everywhere I go). So the menu was quite overwhelming when there weren't any description next to the name of the entree. I ended up ordering the tandoori chicken while my boyfriend had the chicken tikka. On top of that, we ordered garlic naan 'cause we thought there weren't going to be enough naan that came already with the meals.The garlic naan was crispy and garlicky! I highly recommend that if you want more carbs in the meal. Our dishes came out on these fajita-like sizzling plates from Mexican restaurants so they were hot and fresh once on the table. On top of that, we both got a separate round silver plate with several sauces, rice, and regular naan. It was a lot of food and we were both so full at the end. Both dishes were great! What made the whole experience better was how decently priced the foods were. Total price for everything (including a free dessert) was $21. The tandoori chicken was $8-9 while the chicken tikka was around $10. Every time we go to a regular (not fancy) Indian restaurants for dinner, an entree would cost us $15 each. Overall, love the concept there and definitely recommend it."], ["Adam G.", "Man, I keep coming back to this restaurant due their delicious Vegetarian Thali.  It's a Thali, (metal plate with several little bowls filled with different sides), style...and it's more than plenty for a hearty appetite.  In addition, it's full of flavors and more importantly...it's spicy, (just the way I love it)!  If you're unsure of what to order at an Indian restaurant, this is definitely a dish that I would recommend anyone that's wants to try a little of everything...like a sampler.  You won't be disappointed!!!"], ["Pavan Kumar J.", "Deserves 5 star. Perfect Indian spicy food. No restaurant in Dallas matches the taste."], ["Kiti A.", "Great place, ambiance and food! The service was on point! My parents have never had Indian so they struggled with the menu, of course. But the guy at the front was super helpful and patient. Thanks!!!!! Good place to try if you're in the area."], ["Pooline N.", "Really wanted to love this place more than I did. The staff were great. Ordered the kheema biryani and it was underwhelming.  Very small amount of lamb and should be a rice accompaniment as opposed to an entree.  Will try something else if I go again."], ["H R.", "Good food. I asked for a medium spicy option and the Mangalorean Sukka was recommended. I chose lamb as the meat and garlic naan. I wish there were a bit more rice because it was spicier than I was expecting but overall it was good -- very flavorful. Many/most of the patrons are Indian --always a good sign! Indian pop music playing in the background (or foreground...it was pretty loud) was a good atmosphere."], ["Adiv S.", "If you are unfamiliar with Southern Indian food, most of the staple dishes are typically vegetarian, focusing on some prepared form of rice or lentils. While Southern Spice offers the more common North Indian dishes as well, I highly suggest you go to try out foods that are their specialty considering it's even advertised in their name.The place has that distinct southern Indian food smell the moment you walk in, which can be a bit overwhelming at first. The place features a large board menu akin to Chipotle. You can ask those who work there about any item on the menu since much of it is not too self explanatory, and they can tell you the types of spices and ingredients used in the dish!I personally love their Dosa--a crispy crepe made using a rice and lentils batter. This large crepe comes with two chutneys as well as Sambar (lentil vegetable stew broth) as dips. As you tear your pieces of Dosa and try out the chutneys, you'll be surprised how fast all the food disappears so quickly. Best part of it all? This huge dish is only $6 or $7 (depending on whether or not you want the Masala variation).What are you waiting for?! Go try it out!"], ["Vaibhav G.", "Good food. On the spicy side but flavorful. One issue we had was with Food Allergy questions. My daughter asked the man two times to check if there were any nuts and he said \"No\". Unfortunately there were nuts in two curries and my daughter suffered discomfort and pain due to this. Our request is to train everyone who works there on the importance of this aspect to help future patrons. Thanks."], ["Karla J.", "My first time here and I really enjoyed the food. The guy who works here took the time to explain what each dish on the menu was and I thought that was awesome! I had the tika chicken which at first I didn't want because I was tired of eating chicken but I'm glad I went with it cause it was delicious! It was spicy so the yogurt definitely helped with that. The dessert ball, I was not a big fan of. I will definitely be back!"], ["Shampa R.", "My first time here was one month ago--Southern Spice had opened in the winter and it seemed like they were still settling in. I went back today to get 3 lunch thalis for coworkers and myself expecting an improved experience, but was disappointed. The staff seemed stressed even though the restaurant wasn't very busy. The portion sizes were cut down DRAMATICALLY since my last visit. The staff was mindful of how much food they were giving me, carefully measuring out items which I didn't like. I eat less than the average human my age so it was OK, but this is not the place to go if you have a normal appetite.  The food itself was good- mild spice to cater to a wide demographic. I recommend the chana masala and lemon rice. Desserts aren't their strong suit. Last time's gulab jamun was mush and the kheer today was watery."], ["Dina M.", "Yuck! This place is gross!! There is no flavor in the food.  Barely any spices.  If you want decent food I would go as far away from here as possible."], ["Matt V.", "Amazing lunch specials, curries are perfectly spiced! Staff really gave us a detailed rundown of the specials for the day. Great place!"], ["Ranjita J.", "Just visited this place on Tuesday (02/10/14) for the first time. Being a South Indian with a mom who's a phenomenal cook, I had very high expectations going in. I was VERY impressed. I've been avoiding garlic and onion in my diet recently, and the chef made me my own mutter paneer and chole bature without either one!! Each of the baturas were soft, fluffy, hot, and non-greasy!Both the dishes were spicier than I expected, but nothing my palate wasn't used to at home :)The poori aloo (as per my dining group) was decent but puri came out hard and over fried  so we left the second one in the plate. Everything else was clean so we will def be back to try the other menu items! 3 people ate for $25."], ["Vijay P.", "Ordered the following:Kheema Biryani - Deplorable. Kheema totally lacked any flavor. Rice, though fluffy was flavored like jeera rice. Same goes for EGG Biryani.Ordering Gobhi Paratha felt like the dumbest move on my part. I'm not coming back. Once bitten twice shy.."], ["Drew C.", "One of the few Indian restaurants in the area that isn't a buffet at lunch.  I had the vegetarian thali and loved it.  Everything is high-quality.  I also ordered two samosas on the side, and they're the biggest samosas I've ever seen.  They were excellent, as well."], ["Joe A.", "Had the Thali. Food was really quite good. Thought it was just a skootch pricey for what it was. (Naan was small.)"], ["Nash N.", "After all the Indian buffets around North Irving, this place is refreshing... Tasty Indian food, the way it's meant to be..."], ["D'man D.", "Southern Spice is the recently opened, revamped version of the former Chapati grill. The look inside hasn't changed much but the new food offerings are completely remarkable. Between the tandoor, curry, and lunch thalis, you can't go wrong, however, they do have other small plates and tiffin items that is best suited for afternoon snacks.The vegetarian lunch thali was totally awesome: The combination of delicate yet savory lemon rice, generous portion of basmati rice, and a slice of Naan was more than desired to go with two entrees and not to mention the rasam and daal. I tried the cauliflower and mint based veggies. Cauliflower, though little oily was spiced amply and had genuine flavor although I would have loved to see few potatoes in it. The mint based veg item was equally good, a remarkably noble item that I was really delighted to taste for the first time. The daal was of little thick consistency than I prefer, nonetheless cooked properly with perfect combination of condiments. The rasam was alright and the curd was good but a little heavy on salt. The papad and vada were perfect addition to the make this meal complete. The dessert item, I guess the jaggery infused inside flour ball was delicately sweet to end this great vegetarian meal. I was enjoying the food so much, I didn't even think about that small naan portion; when you have as good a thali as this, naan, a northern fare becomes irrelevant. They do, however, offer varieties of naan, parathas and biryanis if that is what you are looking for.I will definitely be back to try other stuffs. They do serve many of these items with veg, kofta and paneer making it a true attraction even for Vegetarians. This is the kind of goodness that comes out by remaining true to its roots."], ["Aviva M.", "Amazing food! We stumbled across this place and are so happy we did. Possibly the best Indian food I've ever had in the U.S.!"], ["John M.", "Bumping up to four stars. The service today was very slow - took over 30 minutes to get idli sambar - but the sambar was amazing, and with excellent chutney. Fast becoming my favorite Indian place in DFW."], ["Sandeep M.", "Been there for LunchThis is my second visit to this place...so decided to post my review.Food -4/5Service - it's self service (Chipotle Style)Ambiance - 4/5 Cleanliness - 3.5/5Food is great, especially their home made pickles (roti  pachchadlu we call them). Their Tandoori Thali's are quite a good portion to finish them. All the Thali's come with a desert and a cup of rice. This is a fast food place and is very decently maintained compared to any other Indian fast food place in town.Would definitely recommend a visit to this place. Excited to see how many Tummies will their Biryani Bucket feed."], ["Srinidhi P.", "We got curry thali and a byrani.. curry thali was awesome with good quantity.. byrani was lil dryOvreall good first experience with clean and nice ambiance will visit again."], ["V K.", "We get this in India and rarely find such a delicious thali (platter of small dishes). I chose the Tandoor thali and my Wife selected chicken and Goat. Everything tasted freshly made and came out of the kitchen steaming hot (temp). The most extraordinary thing was that even the tandoori shrimp were perfectly cooked and juicy. Nothing was dry, rubbery or bland (we have eaten some dreadful stuff lately--here in Irving). The naan came to the table hot from the oven, fresh and lightly buttered.All in all, a surprising find."], ["Kelsey C.", "Very authentic. Got the samosas, mango lassis, and two chicken tikka masalas. Everything was very delicious."], ["Abhijit T.", "Good south Indian food. Tasty chicken curries, authentic tandoori items and the best gulab jamun in dfw metroplex."], ["D S.", "Fantastic place.  We've been here several times since they opened and it's been great every time.  The food is always fresh and tastes great.  We will definitely keep visiting here and will recommend to our friends as well."], ["Fixilator C.", "Just had dinner here -- I had regular (non-mint) lamb korma and an order of vegetable samosas. Excellent all-around; the lamb korma (dinner entree version) came with three great sides, one of which was a side of yogurt, so you could regulate yourself how yogurt-y you wanted your korma. Genius. Another was the usual coconut/raison pudding dessert, which was better than usual, served warm, not cold as I'm used to receiving it. Big improvement. Other two were dals (I think), one a bit spicy, both good.And the vegetable samosas were extra-large, dusted with... cumin-salt? Whatever it was, it was great. One complaint--the samosa's tamarind and cilantro sauces were really watered down. Staff is friendly and I like the no table-service model. They get you attention and you come get your food.I'll be returning next time I'm in town."], ["Youssef B.", "I liked the atmosphere.  The food was good too. Their chicken korma was better than most places. I'll  come back."], ["Stephen B.", "The food is fantastic and spicy. The atmosphere is family friendly. Th staff is kind and attentive. I love this place."]], "Currys Indian Cafe": [["Dallas F.", "Having been let down by another Indian restaurant in Flower Mound (hint: located in the Sprouts plaza), I was cautious about this place. I can now confidently say that we have a great Indian place in FM. Not only is the food good, the plates are extremely clean and lunch specials are served in plentiful quantity. I had the veg lunch special today, and couldn't finish half of it - it was too much with an entire naan, rice, two curries and a dessert. I really hope these people make it here."], ["John T.", "We've been back a few times to confirm our first impressions, and we still feel the same -- this is the best Indian food we've found in DFW.  The place might not look like much, but the food is super tasty, fresh and expertly prepared.  So far our favorites are the masala dosas (huge pancake-like bread wrapped around curried potatoes and vegetables) and the malai kofta (fired vegetable balls in sauce).  A few of the chicken dishes are also great.  The southern Indian items are all fantastic as well -- particularly some of the appetizers.  As a number of reviews here mention, the naan is incredible.  The friendly staff are always happy to help with suggestions and explanations.  Just a great place."], ["Bill S.", "I was excited to try this place as the reviews have all been stellar. The atmosphere is lacking but that's not the attraction of this Currie cooking house. The food is really well prepared and visually on point with the best Indian cuisine I've had. The spice is decent balanced and any currie dish is not overwhelming. I will say the vindaloo could be a bit spicier and the the tika masala was a tiny bit under-flavored. That being said, this is some of the best Indian I've had in a long time. The Somosas are expertly prepared, and have the perfect texture. The roti and garlic nan were amazing. It's well worth the trip but I would rent a movie and take out."], ["Bill B.", "Happy to have a good Indian place near Flower Mound finally.  We grabbed chicken tikka masala and lamb vindaloo.  They were both good, not great.  Samosas and naan were just ok.  Based on the food I was torn between 3 and 4 stars, but the portions are huge with lots of quality meat chunks and the prices are cheap, so half a star for the great value.  The owners were very hospitable, but I'd recommend take-out as its not a very comfortable restaurant setup."], ["Ann T.", "Finally a fantastic South Indian restaurant in Flower Mound. Everything I have ordered from this establishment has been amazing. Tandoori chicken, veg biryani, masala dosa etc etc. you will not be disappointed. Very fast and friendly service."], ["Robert L.", "If you are looking at ambience, this is not it. But, the food is top notch. Best Indian food in Flower Mound."], ["Biren M.", "The best Indian cafe I have eaten in. The food is made when ordred. I enjoyed the breakfast on Saturday and Sunday. The idly is made as ordered and is fluffy and fresh. We have been taking out breakfast every weekend. Overall, great diner."], ["Travis W.", "The Masala dosa, samosa, and chicken tiki masala were all amazing. The masala dosa came with a dipping sauce that was absolutely amazing. It's a bit spicy, just the way I like it. I don't eat Indian food often, but this is the best I've ever had. Loved it!!"]], "Route 66": [], "Biriyani House": [], "Underground Indian Cuisine": [["Christine K.", "I went to college in a city with spectacular Indian and Nepalese restaurants, so my expectations are set relatively high. Underground is more 3.5 stars than 3 stars, but Yelp lacks such functionality. A small group of us visited here for lunch, and I was slightly surprised by the lack of options for the lunch buffet. Regardless, the chicken biryani was solid--moist and tender chicken with mild seasoning. I can't say much, since I didn't try the other main dishes. HOWEVER, I will say this: Indulge in the complimentary naan!"], ["Kunal B.", "Ambience is a bit different from other places. Its literally underground. Gives you a feel of an old shady place with poker and betting room. I like it :)Chicken was great but malai kofta was average. Can't remember the name but starter was also good. Overall a positive experience. Definately worth a visit."], ["Florence W.", "We went there on a weekday for an early dinner. The food is so slow. The wait time for our entrees was an hour!!! The waiter didn't even apologize, makes me wondering if this is how long it takes on an average. If you are in a hurry, this is not the place for you."], ["Patrick B.", "Great little restaurant.  Have been for dinner twice.  Fairly inexpensive for the area.Butter ChickenMutton CurryTikka Masala (vegetarian, the cottage cheese one)Mushroom ___All were great.  Good service, good presentation."], ["Graeme V.", "In search for delicious Mali Kofta, I have found the only place in dfw good enough to get my repeated service, I have only gotten this to go here but the place looks nice. If you know what's up with Indian food, come here."], ["Jonny S.", "I think there's better Indian to be had in Dallas, but this place was pretty good.  The chicken 65 was awesome as was the palak paneer.  .  I wasn't that impressed with the goat vindaloo (I think the goat might have been overcooked or something) or the murg siddam pukht which is supposedly the chef's specialty.  We ordered takeout so can't really comment on the service."], ["Kaia V.", "The buffet at lunch weekdays is $12, and it has a pretty good variety. If I had to vote, I'd rank Taj Mahal off the 75 a bit higher in terms of variety, taste, and vegetarian options. No regular salad, but they did have a bean sprout salad when I was there which was fantastic. The chicken korma was good and not too spicy, but the meat was kind of tough. The chicken in the chicken biryani was much moister, but the piece I had was dark meat so maybe that's why. The rice in the biryani was perfectly savory and not over or under cooked. The naan was probably the highlight of the meal - so soft, warm, and glistening. I wish I were a tiny kitten so I could use this bread as a huge mattress, sleeping on it and eating it at the same time.  The location has free parking validation for the garage, or you can park on the street if you see a spot."], ["Hardik C.", "Amaaaazing spot. The shahi paneer si is fantastic, loaded in flavor. The naan is always fresh and just a little crispy for that little extra touch. HighlyRecommended. The Kati rolls are okay, but the buffet is legit!"], ["scott g.", "Pretty good Indian food. I was visiting Irving for 24 hours and was looking for a vegetarian friendly place and this was the first one within walking distance that looked good. The place was much larger than it appears on the outside since the seating is downstairs. My guess is that it gets pretty busy during the lunch time buffet. The Indian food was pretty good but not the best I've ever had. Someone once told me that you can judge the quality of Indian food by how their naan is. The food was pretty good but the naan was totally sub-par. Overall I am not sure if I would come back the next time I am in town, I might try to explore other places in the area."], ["N B.", "I would have loved to give this place higher rating, but cannot. Went for dinner. Ordered few dum Pakht style dishes - which were decent but not spectacular as I was expecting. Garlic naan was good. May need to try few more dishes before giving final verdict."], ["Amit P.", "I read  positive reviews and drove 25 miles to discover most pathetic food and poor service at this restaurant. The Naan were delivered 20 mins after the main course . The Malai koftha were so hard to break, I had to use knife . If this was not enough, they charge us for an appetizer that was never delivered. This is the most overrated expensive restaurant. We complained to the server about the inconvenience we faced but he neither apologized nor looked interested. I and my friends will skip this restaurant in future. It's waste of money and time."], ["Andrea F.", "Love this place very tasty food!...they do not serve alcohol however it is BYOB...they give you a nice helping of food and everything is fresh and piping hot!Very nice soft-spoken people I have been several times and I will continue to go for my fix!"], ["Smita S.", "The best place to get authentic Indian food. Every dish is cooked to its best. Must try the kadhai chicken and the hariyali kebab"], ["Vijay P.", "Best place to hangout and have some serious authentic Indian food.My fav is the BYOB ( Bring your own booze) policy. I have tasted the following and 5 stars to them:1) Cut Mirchi ( Hot chilli Pepper fritters)2) Methi Malai Paneer (Cottage cheese cubes in a silky herb n butter induced sauce)3) Mushroom Makhani (Sauteed Bella mushrooms in a tomato, butter, mild spices induced n cream based sauce)4) Butter NanUnlike other places the Chef/ owner personally ensures the authentic recipe is followed in the kitchen which translates to a memorable experience for pallette."], ["Mari V.", "What I have been missing all my life!I came today (Saturday) for lunch after an exhausting week. It was my first time here, but I was very impressed! The restaurant and its restroom were very clean, the dining space was intimate, the service was kind and timely, and the food was awesome. I enjoyed everything I tried, and I was a little sad when I became full.My favorite thing about Indian cuisine: so many excellent non-meat options. This place is all you could wish for in a buffet experience. Thank you!"], ["Alex K.", "I came for the lunch buffet. The staff were very kind and courteous. Overall, the buffet was good. The pakora was very light and crisp. Side note, you have to specifically ask them to bring the naan. I was a little disappointed theirs biriyani was vegetarian. I am usually picky when it comes to chicken tikka, but this place impressed me! It actually had both Breast and thigh pieces with a gravy that is slightly sweeter yet spicy than typical recipes. Lastly, the gulab jamon was nice warm and fluffy...tasted like a pancake. Usually most establishment's gulab jamon end up a little soggy from sitting in the syrup."], ["Kevin L.", "Good Indian restaurants can be difficult to find, but this one is a gem to be sure. My 4th visit here was my first for the buffet, and I found the food to be just as good as what I'd previously ordered off the menu. The chef actually interacts with the patrons and when I spoke to him about a dish I liked, he actually comped another for me to try. These folks are eager to please!"], ["Veronika Z.", "Love it! It was our first time at this restaurant yesterday. We both had mild Chicken Tikka Masala and garlic naan. The naan is the best I've ever had, by far. The flavor is pure perfection. My husband thought the Tikka lacked flavor, while I found it perfect! The portion is very big in size. Will definitely be back!"], ["Dan F.", "This was a tough one to review. Food : 4 starsService : 2.5?I had a quick stop through. First off (likely my own ignorance) it is a dry establishment. Looks like it may be BYOB as a table near me was sharing a bottle of wine... But really wanted a beer or too. I was quickly seated which is always nice, and they accommodated my choice of seating which is great too. I ordered the fried jalapeños, chicken chili, and a naan. Fried jalapeños were a mixed review. I loved them, but the chickpea batter was too thick for me. But they were easily popped out so I had some with the batter and most without. Portion was generous. Sadly because I popped a bunch out I think they thought I didn't like them because they were confused when I didn't want to take them home .... I wasn't taking home batter. I ordered the chicken chili very spicy and they actually did an admirable job. I did have a little kick to it. It was very tasty too. Good amount of chicken and flavorful curry.  The naan is nothing worth writing about unfortunately. The part that threw me for a loop was the service. They seemed very disoriented. They were mostly very nice. There was a bit of a language difficulty, which doesn't phase me as I work in a global company and work with individuals around the world. After I placed my order I had multiple different staff come and ask if I was going to order anything else besides the jalapeños.  I said i did. They would go away, and then come back a few minutes later and ask the same question. It got kind of annoying after a while. I don't know if it was a new crew, but it was a Saturday night.... Not the time to expect the \"B\" team."], ["Donald S.", "When was the last time you could taste the chef's passion in the food? Not often, I bet. But at Underground Indian, the passion shines through beautifully!This restaurant just gets it right. The service is impeccable. Our waiter was friendly, helpful, kind and unobtrusive. He really went the extra mile to make us happy. The food was exceptional! Really the best Indian I've had in years. I had palak paneer, which was complex, nuanced, and freaking delicious. The paneer had the flavor and texture of homemade. My wife had chicken tikka masala and loved it. The sauce had a silky texture and the chicken was tender, juicy, and smoky. The atmosphere was comfortable and a lot classier than many Indian restaurants. It's not a slick designer interior, but the lights were low, the music was good, the tables had linens, and it was perfectly clean. I will absolutely eat here again soon. My wife will actually experiment with new foods here because she is so confident it's going to be delicious!"], ["Reba G.", "When it comes to Indian food, I'm extremely picky, but I've heard great things about this place.  Park in the garage, they will validate your ticket when you leave, so take the ticket inside with you!I walked in, and I had no idea what to expect.  It was empty upstairs, but you have to go \"underground\" to go to the restaurant area.  The decor is nice and filled with a ton of Indian decor, it created the Indian vibe.The buffet is $14, I recommend doing that if you want to pick and choose what you want to eat.  I gave this place 4 stars because I wasn't impressed with the chicken tikka masala, it was bland in my opinion, but the chicken 65 was MY FAVORITE!!  The biriyani was flavorful, and all of the other items were good.  The samosa is something that you have to start out with, these were thick and filled with spices, potatoes and peas, try the plum chutney with the samosa.  They serve hot and fresh naan at the table, and they made sure to keep bringing them out.Service was awesome, they were good about topping off our drinks and offering complimentary wine. If you want to have a private party here, they have a room that will seat up to 25.Overall, I was impressed with the food and will come back."], ["Leo B.", "I live in Houston, currently in Dallas visiting gf.  I tried underground and must say is the best indian food Ive had!  Even better than the good indian restaurant I like to visit in Houston.  Do yourself a favor and visit this place for true indian food."], ["Stephen H.", "Amazing lunch buffet! I like Indian Cuisine and everything I had today was delicious and was honestly surprised by the quality of food. The service was friendly and I believe this is as good as Indian food can get without going to an upscale restaurant."], ["Newly P.", "Compared to my previous visit to this place, my last experience at this restaurant left a really bad taste in my mouth. The two stars I gave are for the service and for the fact that parking is validated at this location; other than that there was absolutely nothing to remember about this place. On this visit we ordered Andhra chicken, butter naan and chicken biryani. The chicken we got was either Tikka Masala or something else, but definitely not Andhra chicken. It lacked the trademark curry leaves that are put in the dish, and of course tasted nothing like Andhra Chicken. The biggest disappointment, however, was the biryani. Bland white rice with a sprinkling of spices and tasteless boiled chicken does not make a biryani! We were given salan and raita with the biryani but they did absolutely nothing to make the meal edible. I was terribly disappointed with my visit, because I'd been looking forward to eating some good food as a reward for starting and sticking with a workout program! I really hope this was a one off case, because my first visit here had been so much better!"], ["Felipe B.", "Second time here and it's always a good choice. Probably the best and, surprisingly, the cheapest Indian restaurant in Dallas metropolitan area.The staff is helpful and understanding. We came in with our two kids for the lunch buffet and they didn't mind making extra mild food for our kids. While we were expecting to be charged for the extra food, to our surprise they didn't charge anything. Naan is freshly made once you sit on the table, all the food is tasty and very fresh. Probably medium spice for most palates. We live over half an hour away and really don't mind the drive.Would certainly recommend."], ["Miss K.", "Great food & service. I am glad we went to try this place out. We ordered cut mirchi for appetizer. veg biriyani and malai Kofta in main course and it was yummy. With main course they do give us an option to choose rice or naan which is unheard of in United States of America with Indian restaurants. We will definitely return back soon with friends."], ["William B.", "Came into this business district of Irving, TX with low  food expectations.  Was worried that @ 2pm everything would be closed.  Sign said open and walked into empty room.  Realized with name like Underground the dining room was below.  Downstairs there was a host and single diner and the last of the lunch buffet.  It looked decent so I proceeded to try small portions of each dish. It was very good!  Attentive service by the host and all at a reasonable price."], ["Kanger H.", "I was craving Indian on a business trip and this little hole-in-the-wall satisfied my itch. The chicken tikka masala was creamy with a hint of spice. The vegetable samosas were crunchy with savory potato filling. Really enjoyed the food here."], ["Jessica M.", "I don't even know what I ate I just know it was delicious! The butter naan was the best I have ever had. I would go back just for that! I honestly don't know what my husband ordered either but it came in a cute metal pot and it was great too! I can't wait to go back!"], ["Alex D.", "This place has always been great.  The food and ambiance here is top notch Indian cuisine at a price no more than your average Indian restaurant. The flavors are always mind blowing and everyone that I've taken here has loved it. Definitely a place not to be missed."], ["Jenni M.", "Absolutely loved this restaurant. Ate here with several friends, including two native Indian friends, and everyone cleaned their plates and wanted more. Do get the specially cooked curries!Can't wait to come back here."], ["Drew C.", "Absolutely love this place.  It's within walking distance from my office, so I come here often.  At the lunch buffet there are 5-6 cold dishes like salad, potatoes, chickpeas, etc., 4 hot veggie dishes that change from day to day, two hot desserts, at least one cold dessert, and two fried things like pakora and samosas, but with different ingredients like eggplant, potato, or onion.  There's a cold bean salad that I've never seen anywhere else and it's one of my favorite dishes in existence.  Super-friendly waitstaff.  I forgot my debit card one day and they gave me a free lunch.  They're the best."], ["Harmeet S.", "This place used to be good but it has now gone down the drain. Poor food, no liquor served, service sucks. Won't be back."], ["Jc J.", "Great service and food. had murg rihana, paratha, a mango lassi and a chai tea. the murg rihana was perfect. nice balance between flavor of the chicken and spices. the mango lassi is one of the best I had. the paratha was freshly baked and soft. love it.will be back. Location: A clean, Food: A+, service:A+, price range: not bad in comparison with the SF bay area."], ["Nick P.", "Last Friday, For office lunch we decided to go there. In lunch buffet they had very limited variety. Most of the food was over (Finished) They didn't refill it for next 30 minute. Food was tasteless except one or two items. After asking 4-5 times we got naan. It felt like we are begging for naan. Later when we thought of eating desert bowls were finished and they never tried to put cleaned ones. Funniest thing happened when we finished the lunch ready to pay @ register their system didn't work. We have to wait for 20 minutes still it didn't work. In the end one of us had cash and he paid for all of us. Sounds embarrassing when you don't have cash.  When it comes to price they don't compromise. They will charge same as best buffet places.Horrible experience never go there."], ["Katie J.", "My favorite Indian food in DFW. I have only been for lunch, for which they have a buffet. Don't let that turn you away.  Each offering is so well prepared and delectable. Even the naan is perfect."], ["Robert M.", "First impressions upon entering the building were slightly sub par. The decor and table setup isn't what I was expecting. It was not busy but it took 15 minutes before someone came to take my order. With that said..The food was excellent. Cooked perfectly, well seasoned and the perfect quantity.I had the samosa, chicken tikka and garlic naan. Would highly recommend and look forward to coming back to Dallas for this."], ["Jeff L.", "Incredibly fast delivery time Chicken tika masala was out of this world Veg samosa was extra deep friedNaan bread melted in your mouth They deliver !!"], ["Vic P.", "This place is definitely one of the better Indian restaurants in the entire DFW area.  We had been wanting to give this restaurant a try for a while after seeing all if the positive feedback on Yelp so last night was our chance to experience it along with other family members in our dining party.  Overall we were glad we tried it and we will certainly return to dine here again.  I will attempt to breakdown the dining experience into some key categories here:Service: 4 stars.  Service received was probably the vest service amongst all other Indian restaurants we've visited in the DFW area.  Still some room of improvement with attentiveness but overall they got the orders exactly right and were courteous.Food: 4 stars.  We ordered a selection of meals and a couple of appetizers.  The Kathi Rolls were excellent and different from the norm.  They were so good we ordered more after polishing off the initial orders.  As for the meals, they were overall fair/good.  The meals we ordered off of their \"standard\"menu side were a 4 star.  The items we ordered off the other unique side of the menu(can't remember the exact wording used) were a 3 star.  I liked the uniqueness with the menu so I'd give them an overall 4 for this category.Ambiance: 3.5 star.  It was clean and overall OK but I was hoping for a bit more wow/nice factor to go with their service and unique items on the menuWe will definitely be back as their were some items we enjoyed and the service was better than the rest.  Oh, their naan was nice and soft without it being buried in butter so that is another plus."], ["Jiya J.", "Wow the paneer tikka masala was amazing!!!  Definitely the best Indian food in DFW!! Don't let the construction keep you away....it's worth the detours :)"]], "Bombay Curry House": [], "India Grill": [["Willow R.", "Gone back many times since initial review and have enjoyed every visit. The Sunday buffet is awesome."], ["Yohan S.", "Service is extremely SLOW. Music is LOUD.They made us wait 90 minutes for our food..."], ["A N.", "The staff are really friendly, great food, I will definitely eat here more often, and more thing very reasonable prices."], ["Gunvir S.", "They have good and good presentation of food to. I will suggest every go there and try their food"], ["Dee K.", "We eat here several times a year, but so far only for lunch.  The lunch buffet is wonderful.  The restaurant is clean and has decent atmosphere.  The service is friendly, but lacks a bit on attentiveness.  This is, in my opinion, the best Indian food restaurant in Arlington."], ["Paulina S.", "I came here for lunch with a friend and it was a pleasant experience. One of the ladies was nice enough to walk us through the buffet and tell us about the food. I tried a little bit of everything and I absolutely loved it! I'd have to say my favorites were the vegetable samosas and the masala chai. The prices are affordable and I'll definitely be back!!"], ["Cody T.", "Goat curry isn't on the menu but worth trying first time I've had it and it was delicious, meat is on the bone and very tender! I forget what the name of dish my wife had but it was chicken in a cream sauce and it was amazing! Service was great, staff and owner very personable and happy to explain and suggest dishes. We'll be coming back fosho!"], ["Chmst 3.", "The lunch buffet provides quite a few options and the food was very good. My favorites were the goat curry and the vegetable samosas.  I'm not usually partial to a buffet, but I watched the food get changed over regularly."], ["Tejas P.", "I usually eat here once every two weeks. I return not because the food is great but that is very close to work. In the past year or so, their menu has never changed. Food is decent. I would recommend this place only for lunch because it is quick and convenient. Definitely not a place to visit as a sit down location."], ["N D.", "Hands down the best Indian food buffet.  Gray selection of items and the price is really reasonable.  Recommend not going here at 1pm on Sunday as you are guaranteed to wait a while.  It's worth the wait though.   Customer service is very good as well."], ["Eric A.", "The food is amazing, and you can taste the different spices. I have not had a bad meal yet and have tried to consistently try new things every time. My only complaint is the service can be haywire from time to time. But, they do care about you, and make things rite."], ["Chris E.", "Hit up India Grill with the fam on pre-Thanksgiving weekend out in the Arlington \"Highlands\" Shopping Toilet. Every Outback and Pei Wei for miles around was packed to overflowing with suburban families and broken dreams.As such, it stands to reason that India Grill was completely vacant of all these Protestant \"scared-of-scary-foods\" types, so we waltzed right in and had our pick of many tables while those fools waited over an hour for their high-sodium, nitrate-packed pre-made...   uh, Idiocracy Meal Deals. That took me about 3 minutes to think of.Anyway, the 5 stars here is all for the food! It was top-tier excellent! We had an array of beef, chicken and lamb dishes with saag paneer (excellent!), aloo gobi (well, it was okay. I can make better myself), raita (so-so), and the requisite naan (awesome!). The entrees and also the pre-meal papadum and mint chutney, though, were just fantastic and we couldn't have been happier!The 5 stars here, however, is NOT for the service. It was cold and impersonal and met with subtle disdain when we asked genuine questions about Indian cuisine and the regions from which it comes. What an ass that guy. Jerk. But I'd go back any time at the drop of a hat for the greatness of their food! Definite win!"], ["Brannon S.", "My wife and I decided we were in the mood for some Indian food and this place had good reviews on yelp. We were so happy with everything. Cute place, wonderful service, and UNBELIEVABLE food!!!!!"], ["Lulu M.", "I love the food here, my favorite restaurant in DFW. The Tiki Chicken Masala and cauliflower stuffed bread keeps me a loyal customer."], ["Kathryn E.", "We haven't braved any Indian restaurants since moving to Texas so this was our first attempt. We couldn't have been happier with what we found. Good lunch buffet with hot fresh food that was switched out regularly in the 40 minutes we were there. We enjoyed everything we tried and the servers were quick to clear plates and bring drink refills. We weren't going to have dessert but our server insisted we let him bring us something special. I'm not sure what it was called but it was excellent. Between good food and exceptional service we will certainly visit again despite it being a bit of a drive."], ["Robert G.", "Great buffet during lunch and all day Sunday.  Great service and atmosphere."], ["Rebecca M.", "Delicious tikka masala and beef punjabi. Garlic naan was the best we've had. Service impeccable. A new fave."], ["William S.", "My wife and I arrived at 1:45pm on a Saturday - only 45 minutes before the buffet was supposed to close. Not a problem!! Fresh food was being brought out continuously. They have a great selection of spicy and non-spicy food as well as veg and non-veg. My wife and I love Indian food and have visited several restaurants around the USA and around the world. This place definitely was one of the best outside of India. We had good attentive service. Will definitely be back! Located in the Highlands."], ["Robert S.", "The food here is fantastic, but the service is not.We've ordered from this place twice, both times on line. The first time, we received a call within 10 minutes asking us for our order again because the fax was in some way unintelligible. When we arrived 15-20 minutes later, there was another 15+ minute wait until we received the food. The young man who assisted us was very nice.The second time, also an on line order, I waited a half hour before showing up. When I did, I was greeted with chaos as several groups of annoyed customers were standing around the register area waiting for their food, and the older woman running the show seemed extremely flustered. After about 5 minutes of this awkwardness, the woman asked me what I had ordered and when I told her, wrote it down again and sent it to the kitchen (at this point I realized they lost it). She then gestured to a table near the wall and told me that I was \"late\", as if that was the explanation for the annoyed customers and the reason why my order had to be remade. I ordered at 9:27 PM and arrived around 35 minutes later (having learned my lesson from the first time we ordered here), not an unreasonable time frame. Besides, the worst thing that should happen to someone who is late picking up their order is cold food.The worst part? I had already added a 10% tip when I paid on line.There aren't many options for Indian food in this area, which is very fortunate for this establishment, because they will probably get a third shot from us just because of how good the food is and the convenient location."], ["Peter J.", "Pathetic excuse for a lunch buffet.Almost all the food tasted like it was made days ago and recycled.    Nothing had any flavor or taste.The place was almost empty during peak lunch hour on a Saturday and i should have taken the hint.  Service was business like and impersonal.     Kids above age 10 get charged the adult rate.How in the world did this place get 52 reviews with an average of 4 stars?Guess i get to live and learn."]], "Indian Kitchen": [["Christian M.", "saw on yelp that there is a new Indian place close to my house. And I have to say I am very happy I checked it out.Family owned restaurant...very friendly and helpful and happy to explain items on the menu.Chicken Marsala was so good...naan bread was also one of the best I had ever.it is a pretty big place (former Chinese Buffet) and they just opened a month ago or so...so decoration is not that great...but i never care for that much anyway.I hope  they get lots of people to check it out..love to see family owned restaurants who takes  pride in their food."], ["Brooke P.", "My husband, our son and myself stopped in here for dinner one night. We used to come here fairly often when it was a Chinese buffet. We were pleasantly surprised to see it turn into an Indian place, however. I had lamb, and my husband had goat curry and we both really enjoyed our dishes. The staff was lovely and friendly. We plan to go again soon!"], ["Russell N.", "I was excited to see an Indian restaurant outside of Irving, so I didn't hesitate to stop in when I found myself in this part of town. I have to say, the staff and manager were extremely kind and friendly, the restaurant was spotless, and the place is spacious and nice. I really hope they do well, but the food was just so indifferent and bland. I eat a *lot* of Indian food, it's one of my favorite cuisines. I don't know if they were trying to tone things down for an \"American\" audience, but only one of the dishes on the lunch buffet had any heat and none had that wonderful combination of spices that I love about Indian food. Another reviewer mentioned that several of the chicken items tasted like they had been cooked the day before and reheated, and I would have to agree. I had a small bite of almost everything on the buffet and nothing was remarkable in terms of flavor. The best thing they had was the sambar, and you can only eat so much of that.As I said, the space is nice and the staff is super-friendly and kind. If they could just get a better chef and go for more authentic flavors, I think this could be a really great place. I really wish them the best."], ["Jaspreet S.", "Best place ever. Recommended to everyone !! Best customer service. Amaaaaaaazzzzing !!!!"], ["Rae C.", "When we moved into this neighborhood, I was promptly disappointed by the restaurants in the immediate vicinity. That has all changed with the arrival of Indian Kitchen. This place is ammmaaaazzzing!I have been sadly lacking in delicious Indian food since I quit working in Irving. Now I have access to some of the best, most freshly cooked, savory Indian food in walking distance of my house. The restaurant is obviously a converted Asian buffet and their menu still has some Chinese options, but don't be silly. You're here for their fresh baked naan, the incredible paneer tikka masala with thick paneer like I've never had before, or any of the other scrumptious options on their expansive menu.The owners are so friendly and apparently ran a successful Indian restaurant in Wisconsin before relocating to Texas. They have been above and beyond with customer service in the three (yes, three) times we've been in the last two weeks.They are also BYOB - score!"], ["Saurabh S.", "This restaurant food is complete waste, lassi was like sweet butter milk, gobhi Manchurian was horrible. All curry was sweet and goat curry has all bones only no meet . I am giving two star as hospitality was good and they greeted us well. However service time was very long."], ["Dana P.", "Pretty good chicken tikka masala! I ordered mine mild, and it was enough to feed two people. The naan-bread is also very good. I think you will get your best value if you go for the lunch buffet. I am hoping to try it out again sometime for lunch"], ["Nick P.", "I visited this place twice. Once for lunch buffet and second time during late evening over the weekend. Initially I was very happy we didn't have Indian restaurant in the neighborhood. No need to drive 25-30 miles all the way to Irving for best Indian food. But after trying their food twice I will say it is worth driving that far.Lets start  the review.Lunch buffet had decent variety. 4-5 non-veg,3-4 veg curries and three desert. Naan comes on the table. During both visit only 2-3 tables were occupied rest whole place was empty. Not sure if I was there at wrong time or same happens always.Most of the dishes were below average in taste. I am regular Indian food eater so not sure about rest. Some dishes felt like leftover. Both times experience didn't go any better.Name of desert there were 3 items. Carrot Halwa, Mango Custard, Rice pudding (Kheer). Carror Halwa was good. Rest things were just ok. Only Indian restaurant nearby so it can pull the crowd few times but it won't go long.At least I won't visit :-) Price was little expensive compare to other Indian restaurant. **Place call themselves Indo-Chinese. I will say they should have hired Indian cook to make perfect Indian dish. Instead place is now not perfect Indian can't say anything about Chinese."], ["Marijke V.", "I was happy to find that an Indian restaurant had open close to my house. The decor here is not great, but the staff is very friendly and the food is very good! Perfectly cooked rice, well-seasoned chicken tikka, and  delicious naan. The veggie pakoras were not bad (not the best I've ever had, but not bad). I am already planning a return visit!"], ["Harry M.", "Awesome service, delicious food with multiple choices from authentic Indian cuisine.  With formal and semi formal  friendly environment.  Beautiful ambience.  Must goto place with family friends and work peers.  Also give discounts to local corporates."]], "Tandoor Indian Restaurant": [], "Ista Indian Cuisine": [], "Mom's Spice": [], "Maharaja Indian Restaurant": [], "Karachi Village": [], "India Star": [], "Sana Indian Restaurant & Grocery": [["Mark S.", "4 stars for the food, which is some of the best in the area. Don't come here if you are expecting a sit in experience or are in a hurry however. What it lacks in decor and customer service it makes up for with awesome dishes."], ["Dee G.", "Moved from Seattle to Fort worth area and heard from friends that Indian food is better here. This was close to my place and impressed with positive reviews, went for lunch.1. Customer Service - Below average (same person cooks and cashier).2. Place was filthy and unclean. Found fair in biryani3. Taste - only fair - Any one can make food easy and a bit ok by putting tons of oil.4. I would rate only naan as good because it was baked wellI'll not try it again."], ["Abey P.", "They say Thursday special as Goat biriyani for $4.99. By mistake the cashier billed with regular price and when I pointed out about the special price, she consulted someone in kitchen and used $4.99 .But the lady ran from kitchen and told me \"sorry, I gave you the regular biriyani and the special biriyani is less quantity !!!\". She took the biriyani orders inside , made it \"special\" , gave it back !!!!Moral - beware of the special biriyani's....."], ["Estelle S.", "Best Indian food in NRH !!!!! I always get the goat curry which is my favorite Indian dish and the spices and everything is just right !!"], ["Jim P.", "I stopped by on a business trip because I wanted something tasty for lunch.  I ordered the chicken tikka masala, with rice, and a mango lassi.  I would rate then only fair. Good Indian food is very hard to find in Texas- and tha place was a quick, cheap imitation of a restaurant.   The tikka masala was pretty bland, and the rice was only fair.   If you are looking for cheap, this place is about it.  Lunch. Cost me ten bucks."], ["Larry G.", "Two for lunch.  16$ with drinks.  Chicken Cury with Rice and daal and Chicken Tikka Massala with rice too.  It was very good.  The Massala was better in my opinion but nothing wrong with the curry chicken either.   Tasty."], ["Rae C.", "Indian food is my comfort food, so you can imagine my dismay as each new job I get takes me further and further away from good Indian options. Fortunately, a coworker let me know about Sana!The restaurant and grocery are split right down the middle. This definitely isn't a place you'll come to for atmosphere - it's a hole in the wall, run down, get your food on Styrofoam plates kind of place. But what it's lacking in ambience is more than made up for with the cheap, gigantic plates of yummy food.My first time here I tried the paneer tikka masala with rice and ordered a side of naan. The naan was HUUUGGGE! As was the plate of rice that came with the my dish. The paneer tikka masala tasted different than I am used to - it seemed less cream based and more watery. It was still delicious, but might be a different type of regional Indian food than I have typically had.I came back again on a Tuesday, when they have $2.99 vegetable biryani. You read that right, $2.99! It was a TON of rice, so I got  lunch and dinner out of it. I also ordered two samosas, which were huge but tasted like they were frozen and reheated. Not sure I'd order them again.Ultimately, this is an awesome and super affordable Indian option in a place without many alternatives. Hooray!"], ["Zach H.", "I have had Indian food in England, Germany, France and the United States. The United States usually places last unfortunately. The English seem to always come out on top. Restaurant cleanliness usually wins the war with this cuisine.Sana was quaint. Half grocery store, half restaurant that feels more like a cafe. The menu selection was from a board hung above the register counter, with a selection of around 40 to 50 items.I chose the chicken masala. You're given one Nan bread, and one small bowl of masala. The taste was extraordinarily unique. A spicy, yet sweet tang with moist chicken. Also excellent when you dip the nan bread.Lack of fifth star for the owner blatantly laughing about how he was discounting his friends in front of us in line, who had more food than myself and my date, and paid less. Ouch.Otherwise, a prime example of an Indian establishment aiming to make your taste buds know the meal was 100% authentic."], ["John D.", "My dad and i came by to try a new indian food location in our area. Small hole in the wall place. They had some really good food, a bit spicy but enjoyed it. Its a must try location."], ["Brad S.", "awesome curry!  I loved the samosas and paneer with nan.  I can't wait to go back and try more."], ["Tinsley K.", "I don't even know where to begin.  The place was dingy and dirty attached to some kind of grocery store.  The dirtiness made me question the safety of the food I was about to pickup.  The chicken tikka masala was an oily tomato soup with five pieces of questionable chicken.  The chicken curry had so many bones my husband wouldn't even take one bite.  The vegetable samosa was a mushy triangle of blandness.  I tried to give it a shot but took two bites and threw it away.  Guess when you're paying $16 you get what you pay for."], ["Racheal M.", "I love this little gem. The goat biryani was wonderful, the chicken samosa' were nice and crisp with a yummy side sauce and their chicken biryani and chicken tandoori I crave in my sleep. Service has been excellent and I love that they have a store on the other side where you can pick up spices and snacks. Love love love!"], ["Quentin T.", "Great food, they have a great menu of various indian dishes. The decor is not the most up to date, but the food is some of the best in the area. Keeps me coming back for more. The gorcery store attached is also very useful when filling a shopping list for homeade indian cusine."], ["Dennis U.", "This funny guy has to improve this restaurant I guess, food is ok. customer service is below average. No cashier the same guy who cook come out and take the money with the apron on it, because of that, it make my apatite take away."], ["Justin M.", "My favorite meal here is the fresh naan with a side of dal. The chicken curry also has a wonderful flavor with a lot of cinnamon, clove, and cinnamon shinning through (be prepared to pick out the whole spices too btw)."], ["Christian J.", "I love indian food and the lamb curry here is pretty delicious. I ordered tandori chicken once and it was very dry and almost burnt. Besides that, it's still a good place to have lunch."], ["Annla D.", "Best hidden gem in Fort Worth! Located inside a grocery store, nothing fancy, but I love love their spicy tika masala and their naan. I also ordered the curried goat, and skewers. Can't order anything bad here."], ["Jul J.", "Good biriyani and other foods, friendly,  but more of a takeout than sit in restaurant.. Needs better location, good food!"], ["Sandra P.", "I love Indian food, and this is my second time to go here.  I got the chicken curry, daal, naan, veggie samosa, and veggie biryani.  The chicken curry had some weird pieces of chicken in it, mostly bones and the sauce was about 50 percent grease.  Daal was ok and the naan was ok.  I asked what's in the veggie biryani and the cashier said it would have potatoes and cauliflower.  It ended up having mixed veggies from a can inside it.  The veggie samosas were pretty good with potatoes inside them, but they could have been frozen before, not sure if they were homemade.  The food took a really long time to come out.  One plus is the food is dirt cheap, but you get what you pay for.  Also, there is a $5 minimum for credit card transactions."], ["Hamza M.", "Halal. Cool dhabba (hole in the wall) like feel to the small restaurant next to the market. Chaat and beryani are good. price is awesome. And the chai, it's good but it kinda depends on the day you go too. all in all, worth coming back to."]]}