{"Campisi's Restaurant": [["Scott C.", "Love coming here, but they finally have Toi behind the bar!  She is the best! They are crazy if they don't keep her behind the bar!! Thanks for great evening, Toi!The food is good, but the atmosphere is great for after work."], ["Somchai I.", "i finally got to eat here! lol after only grabbing beer here i finally got to have some pasta! sadly no pizza...first off from outside this place looks divey. walking in. not even the slightest! it never seems busy at night when i go no prob. the game was on and i wanted to watch my fantasy so i sat at the bar. as i looked over the menu they had 5 people come pick up their orders and while they waited they had beers and all the staff walked by and was like hey joe, hey ben hey john. i was like uhm. LOL. they must come here a lot! what a cool friendly vibe im getting! one guy even sat down and the bartender just hands him a wine glass and pours. now that is service! so i ordered the grilled chicken marsala because well marsala is just so sweet i loveeee it! and my friend got the shrimp scampi with fettuccine alfredo. next our house salad comes out which is honestly. why bother? its okay its overly dressed and overly seasoned but good if you come in super hungry and just need something to eat right away other than that it did nothing. then our food came out in nice hot plates! presentation was well done on my part but the scampi was ehhh. it was the perfect portion of pasta to chicken very good nice juicy chicken with enough marsala sauce. very well executing. the scampi's shrimp was cooked perfectly not overly done served in a saucer of butter garlic and other things so seasoned well. and the alfredo sauce you could tell was not from a can and just made it was perfecto, thick sauce with just enough to cover the fet. and not murder it.all in all id love to eat here again my only complaint was the marsala was heavily oiled with olive oil had i not dipped my bread into my sauce i prob had 2 oz of oil in my plate. but id still eat here again."], ["Page P.", "They were the first Pizza in Texas.  So, most copied them.  The reason it is oval.  When they great grandmother was told \"there was a new thing in NYC, called, Pizza Pie\".  No one told her it was round.  My family has been eating at Campisi's since the 60's. (Dallas Mockingbird Original Location, Since 1949!)I dare you to go try the lasagna !  The BEST!  I my stomach, all else fail in comparison!  Really!Just like another local old restaurant in Fort Worth called Kincaid's. These people started in the grocery business.  The bar that serves pizza. In the 1950s they moved into the first restaurant location.  It was called the \"Egyptian lounge\".  Funny story. My uncle was there in the 60s with a customer. He was a salesman. And he was whining and dining one of us biggest clients. Came time to pay the bill. At the time, and up until the 70s, they didn't take credit cards.  He called my dad at 11:30, on a weeknight, and begged my father to bring him money. My Dad, in true form, hung up on him. When he called back, my Mom took him the money."], ["Kimberly R.", "Love the bar and thank God Toi is back behind the bar!!!! She is the best! Love the veggie pizza and dirty martinis."], ["Elyse L.", "There was a Campisi's just minutes down the road from where I grew up, but surprisingly this was my first time eating here. I was staying with a friend in Ft Worth for the weekend and she asked me what sort of food sounded good for lunch. I told her I never turn down Italian so she suggested we come here.I was excited to finally go after all this time. I debated between pasta or pizza, but didn't feel hungry enough to eat a big plate of food so we chose pizza since that's easier to share. The medium is enough to feed two, but it's very thin crust so if you have a hearty appetite you could probably finish this one on your own.I'm honestly not the biggest fan of thin crust because I love bread, and to me this one was a bit reminiscent of a frozen pizza in flavor. We picked our toppings and chose crumbled Italian sausage, ricotta cheese, and onion. The onion was still pretty raw, it tasted as if they threw it on top of the pizza after they had already baked it. The sausage and ricotta were good, and there was some Italian seasonings on there too that I liked. Overall though, their pizza is not something I would order again. I saw a lot of people with pasta and wished I had gone that route instead. Another thing I didn't like was that they don't give you free bread to snack on before the meal. That's one of the best parts of going out for Italian food! Total bummer. Our server was in a rush to get us to order when we sat down, and was great about refilling our drinks at first, but the second the pizza came we barely saw her again. It wasn't busy, as we came after their lunch rush, so I assumed since we only ordered one thing to share she didn't think her tip would be worth it and ignored us for higher paying tables. Just sort of a 'meh' experience all around. I know my friend has great taste so there has to be something here that was worth her suggesting it. I don't think she had ordered the pizza before either so it was a first for both of us. But I will return for pasta, and hope my next experience is a lot better than this one was."], ["Jose H.", "A friend and I wanted some Italiano, the evening was right to eat outside in their patio but instead we sat at the bar to watch tv. This was our first time eating here. I ordered the Original Shrimp Scampi, it can either be served with Spaghetti or Fettuccine. The barista/waitor who attended us was friendly, he seemed to know the incoming customers who sat at the bar by name. A gentlemen enjoying a cold one at the bar while waiting for his to go order was making conversation with my friend. Recommending the  \"All The Way\" specialty pizza. If your companion wants Italian and your in the area, stop and eat here. Overall my food was delicious, the environment was nice but next time I'd like to try their pizza."], ["Anye F.", "I don't know if my tastes are changing or if this location just doesn't compare to others I've been to but I was underwhelmed by my dinner last night.  We had two appetizers (scampi + meatball) and a pizza.  I remember loving the scampi before at other locations, especially when ordered over pasta.  This one was missing the breadcrumbs for the most part and the shrimp were quite small (not salad size, but not much bigger.)  The meatballs were good, with a very sweet marinara (perhaps a little too sweet).  The pizza was just ok, which is weird as I remember loving their pizza.  But again the sauce seemed too sweet to me.  Service was good and quite speedy, the food wasn't particularly expensive, but it's also not worth driving out from Arlington for.  Corky's is much better in Arlington, and if we want a really great Italian meal (and are willing to dress just a little nicer than we were last night) Aventino's is a great choice."], ["Brittany F.", "Couldn't decide where to eat last night while driving down Camp Bowie, so my friend & I figured we would try somewhere new to the both of us.  Loved the vibe of this restaurant. You can either go into a small bar area where it seemed a little livelier or have a seat in booths/tables where the lights are low, candles are lit, and the mood is set! (Even though there are large tv screens playing football games, the sound is low/muted)Wait.. They also have a small patio area in the front. I did see quite a few tables full out there. Greeted as soon as we walked in, were seated in a matter of seconds as it wasn't too full (Thursday evening around 6/7)  Unfortunately most of the booths seemed to be for larger parties so we were offered a table in the middle seating area. I had a glass of moscato, friend had a beer. We ordered, for him Breaded Chicken Parm& for myself I, after help from the waitress, ordered an Artichoke & Chicken Pizza. Our bread and salads came right away. Both pretty good. Then out food followed shortly after. I didn't care for my pizza at all, of course my waitress didn't know that until she came to offer us our bill bc she hadn't checked on us since she dropped off our meals.  Thankfully the Chicken Parm is a very generous portion and I was able to steal a few bites. I had no desire to try anything else by the time she returned.  Got our ticket (minus this pizza that I only took a bite of)..and was shocked she charged me for a \"dinner salad\" really? I didn't eat your meal bc it was nasty but I'm charged for the small salad? I laughed it off as I really didn't care to complain. Would I return? Yeah.. I'm sure there are other menu items I'd enjoy. Just not a place I'd recommend at all yet.. Maybe next time I won't be influenced by a waitress & hopefully find something I like."], ["Jim J.", "We mostly order delivery from Campisi's as it's five minutes from our house, but we have also eaten there in the dining room. We became acquainted with Campisi's (The Egyptian) years ago in Dallas on Mockingbird Av. as that was the only one then.The pizza is just as we like it, thin, cooked just right, and is always nicely topped with whatever you order. The small house salads are also good with a oil/vinegar dressing. We have ordered  other dishes also (Ravioli Angel Hair Pasta, etc), but the dinner sized portions are quite small and rather lackluster in taste.This is not the place to go for a GREAT Italian dinner, but the pizza is hard to beat. Don't worry Campisi's, we'll keep ordering from you."], ["Adam M.", "I have lived in or around Fort Worth for way too long to be barely trying this place. I used to live near the original one in Dallas and heard many stories about the place. Everyone always said they have good food. It was about time I tasted for myself!Just like any other place with great food, you'll probably have to wait a bit to be seated. It didn't take nearly as long as expected for a party of 2 on a Saturday evening though. They will also text you when your table is ready. I wish every restaurant would start doing this.I wanted to get a good sampling of a few things they had to offer, so naturally I order the Sample Platter. It came with spaghetti, a large meatball, cheese ravioli, and lasagna. The meatball tasted like one of the better meatloafs I have ever had. The sauce was the highlight of the meal, and it was spread over all of it.And the price is very reasonable! I would put this place somewhere between the Olive Garden and a fancy Italian restaurant. Overall it is a great bargain for some delicious Italian."], ["Le E.", "I've lived in Fort Worth the majority of my adult years and I've never been here until a month ago. Since that first visit, I've eaten at Campisi's at least three more times. I love the décor, the ambiance, the service, and the food. My go to is the breaded chicken parm with fettuccini alfredo. The portion is huge and I always have to take some home. My husband typically orders the pizza which is prepared with thin crust. It's pretty great too.During prime dinner hour, you may have to wait for a table. From experience, after 8:30pm, it starts to clear out!"], ["Chirstine A.", "I absolutely love this place and all of the food on the menu I swear I could try something different every time. Pizza is great pasta is great appetizers as well. The only one thing that I would change about this place, is that they really need to make their ranch dressing homemade. For such an amazing pizza most Texans want some ranch on the side, but not some ranch that came out of a plastic tub. If you've ever worked in the restaurant business you know exactly what I mean it smells sour it does not taste good, they really need to step up a notch in their salad dressing."], ["Clayton T.", "Tonight's dining experience really wasn't very good. The atmosphere was nice and the waitress was very attentive.Unfortunately it was the food that wasn't very good. It wasn't horribly, just not very good. We started off with bruschetta and Joe's toast with provolone. The bruschetta was extremely tough and chewy which I wasn't fond of, but it had a pretty good taste.Both the Chicken Parmigiana and Chicken Alfredo that my wife and I ordered came out with good portions that looked good, however the taste was off on both. I'm not sure what it was that was off but neither of us ate more than a quarter of the portion.In the end we've decided Campisi's isn't for us."], ["A P.", "Food and service were fabulous!  We enjoyed the calamari, the lasagna and the spaghetti and meatballs. This is our new go-to place for Italian food."], ["Chuck M.", "Another absolutely incredible visit to Campisi's. We were in the mood for pizza and Campisi's fit the bill this evening. The crust was absolutely perfect and crisp and the toppings were ample, but not too much.Our server took excellent care of us. She kept our drinks filled and even offered us to-go cups for our drinks before we left. Our server was so friendly with an \"eye for detail\".We couldn't have asked for anything else. If you haven't tried Campisi's pizza, you need to make a point of doing do real soon. You won't be sorry. In fact, I feel you will leave with a VERY happy tummy and a smile on your face. :-)The restaurant is also very pleasant, some what dark and mysterious, but very comfortable. We are so glad that Campisi's now has a permanent location in Tarrant County."], ["Lisa N.", "Pros: all the wall pizza is delicious! The thin crust was excellent. I tried the pizza cheeseless and the pizza was just as good. Toppings were plentiful. The complimentary bread was soft and goodCons: pasta. The angel hair with marinara was not al-dente and the marinara had a fishy taste. The beef ravioli with marinara was just okay.I would just get the pizza and pass on all things pasta."], ["John B.", "I had a really bad experience with theft from the kitchen staff, ironically the next day the health inspector was there. HMMMMMMMMM a kitchen staff that are thieves and we expect them to wash after going to the bathroom and handle our food in a sanitary way???? I think not!!!! It made me choose 1 star or it would've been a 0"], ["Sandra B.", "The food was excellent, the service was outstanding and the fact that they had Gluten Free was a wonderful bonus!  It was a perfect evening to sit out on the patio which made everything so much better."], ["Terry G.", "First off, Campisi's pizza was built up so large to me that it probably never had a chance.Was it the best pizza ever? Nope. For me it was just ok. We had the Everything pizza. It had Italian sausage that had an odd spice that some people may love but for me not so much.The cracker crust was very good but the rest of it was kind of tasteless. This was odd because there were so many toppings.The service:The service was very friendly. When we walked in the bartender said that they would treat us like Royalty. With that I asked her if we needed a taster for our food to make sure they did not poison us. (I guess an old royalty joke). This cracked them up and they took really good care of us.The price:The prices were in the $12 - $15 range. Not bad at all but a small pizza for the price.They had a wide menu that may be really good. I'm not saying I will not be back but it will be a while."], ["Ruthie H.", "Not sure what the big deal is about this place. The marinara sauce was way too sweet. I ordered the trio of lasagne, ravioli and spaghetti and meatballs.... I got 1 (one) ravioli.  The meatball was over-seasoned. The only positive about this restaurant was my colorado bulldog. I don't expect this location to last."]], "NY Joe's Pasta & Pizza": [], "Italy Pasta & Pizza": [], "Picchi Pacchi": [["Perry D.", "Came in late night, which is the only reason I will give them 2 stars instead of 1. They advertise slices until 3am. When we went in at around 2 , they refused to sell us slices and we had to order an extra large pie to split between 3 people. When we got the pizza, it was average at best. Then when we asked for a box to take home the half of the pizza we had left, the guy would only give us a small box the held at most 2 slices, so we had to stack the slices, making them soggy. In addition, even though they had a self dispensing soda machine, they refused to give us cups for water, despite the fact that we had just spent $36 on a pizza when all we had wanted was 3 cheap slices. I'd rather go to bed hungry then go back to this place. Awful customer service."], ["Paul K.", "Ok pizza / Italian joint in downtown FTW, but nothing special. I had a slice of the deluxe pizza (pretty mediocre) and a meatball sub (good). Don't sit by the door, everytime it opens it turns the place into a windtunnel."], ["Lauren M.", "Ordered two slices asked for the bottoms to be well done because well, soggy bottom pizza is gross. Perfectly executed. Crust was perfectly crisp without being too crunchy. Also ordered a gyro which was just mediocre. Pizza slices was reasonably priced but the gyro was pricey given the quality."], ["Stan G.", "I've eaten at the restaurant several times. They have good food. It's reasonably priced and tastes good. However, I will never, ever eat there again and will do everything in my power to spread negativity to all of my friends and family who frequent downtown Ft. Worth. Last night, while in the cigar shop of the Sinclair Building (right next door to Picchi Pacchi, I needed to use the facilities. I'd been to Picchi Pacchi before, so knew where their restrooms were and did not know if the cigar shop had any. So I simply went over to Picchi Pacchi's. I ran upstairs, used the restroom and was headed back out. I'd eaten at Uno's and their restroom was closed for cleaning when I left, so it was my intent to simply slip in and use another restroom.After exiting the restroom, there was a male Picchi Pacchi employee posted on the stairs. He began talking to me but I wasn't really paying attention. When it registered that he was talking to me, I took in that he asked me \"did you ask someone to use the restroom.\" It was a tone and an approach that someone uses when they're looking to start a fist-fight. It threw me off. I said \"no. I didn't.\" He kept talking and raising his voice. This idiot was taking it to a whole other level, and before I did something stupid (I was 2 seconds away from waxing the floor with this rude, obnoxious idiot), I left.Picchi Pacchi - This isn't New York, and if you want to pretend like it is - either place signs up or lock your bathrooms.You're putting your employees in danger otherwise, because if you expect them to guard the bathrooms - a.) that's pathetic and b.) they're going to get hurt. I was the better person last night."], ["Melanie W.", "Appreciate that this restaurant is open late....especially for guests at the downtown hotels that are looking for a late night snack (it seems everything closes pretty early here)!!  We took the pizza to go and asked that they crisp it up for us so it was not soggy when we got back to the hotel (we had 2 slices of pepperoni and 2 slices of pepperoni and sausage).  They did make sure the bottom was crisp and we thought the pizza was good."], ["Alexa B.", "I ate here last weekend, with my boyfriend and two of my best friends, as we were attending the TCU Jazz Festival, and were looking for a quick bite around Sundance Square.This was first and only time dinning here. When the four of us walked in at around 4:30, we were the only ones in the restaurant, which was a bit weird. You order at a counter, and then they reheat your entree, which I don't really have a problem with; I didn't this to be a super fancy restaurant.Anyways, I got a calzone and a slice of cheese cake. The cheese cake was really great- awesome texture and sharp flavor. The clazone was a bit greasy on the inside and overly hard/crunchy on the outside (it was hard to cut it with a butter knife). I also had a bite (or 10) of one of my boyfriend's pieces of pizza, and it was pretty good. Not the best I've had, but still pretty tasty; it had a nice oregano-y taste to it.I couldn't justify giving this place more than 3 stars because of the slightly disappointing calzone, and the weird/awkward vibe I got from the guys and the lady working the front counter. They were not outwardly rude or anything, they just seemed to be annoyed that we all had long orders, and that they were all separate. Overall, it did it's job for that one Saturday, but I probably won't be back."], ["Kevin Z.", "Colleague ate here the other night & suggested we go for lunch today. Quite the line for lunch time w/ about 15 people deep. There was one guy taking orders, making pizza, warming pizza, & calling out orders. This guy was making it all happen & not even breaking a sweat!We ordered pizza that was freshly being made & well worth the wait! So tasty, just like from back east. $3 for a large piece of cheese pizza & $3.50 for pepperoni. Not bad for a tasty treat! While waiting in line the Strambolis were looking tasty as well as they were HUGE! Everything is freshly made & goes as quickly as it is made. Def a good spot to hit for lunch as it is worth the wait."], ["John K.", "This review is based solely off of late night service. I probably wouldn't come here without a night of partying already in my circulatory system, but if you find yourself around closing time in that predicament, this is a decent option in the limited late night food scene of downtown Fort Worth.It's pretty simple point and heat up pizza by the slice, moderately priced for what is is.If you're feeling out your Texan stereotypes and order ranch to dip in, you'll get a little styrofoam tub of hidden valley for what seemed like more than a slice (north of $3)."], ["Matt P.", "I come here quite a bit for lunches during the week. The food is pretty much always good. I've had the salads, pizza, and gyro. Great fast lunch if you work downtown, although on convention days, there can be long lines. Really there are only two drawbacks. 1.) if you order a gyro salad the price is ALWAYS different. I've attempted to figure this out by asking for receipts, double checking the menu, etc, but I've never figured it out. I've even gone with co-workers and the price is different when we order the same thing. I can't wrap my head around that. It can range from $9-$12 on any given day, but the salad is always the same. 2.) The straws for the drinks. They are unwrapped in a box by the soda machine. It's kinda gross because you watch everyone put there dirty hands in there to get a straw, while touching all the other straws. It's kinda gross, but I've come to accept it and just not get a straw there.Other than those 2 things, this place is great. I'm here usually once a week, and even though the price of things isn't always the same, it's always good. Actually, the lettuce and such on their salads might be the freshest I've had in Downtown Ft. Worth anywhere. Including some salad specific locations.**UPDATE** I have updated my review to 5 stars. Went here today for lunch and the straws are nice and wrapped, made me very happy! I got pizza today so I can't attest for the price fluctuation, but per Mary's response I will ask if something seems off. Pizza was good today, as always!"], ["Somchai I.", "what a great pizza place! went with a few friends so i got to try the calzone pasta and pizza. all were perfect. pasta sauce is perfectly made here..if theres a lot of sauce the sauce has to be thin. a little bit of sauce it needs to be thick. or else i cant taste anything at all. the calzone was perfectly ratio and the pizza was not greasy soggy or bad it was tasty! the price was def kind of high but oh well! it was a great time."], ["Jeff B.", "Solid lunch spot just off of Sundance Square - they get your food out quickly and the pasta dishes, pizza and salads are all good quality and made in-house.  Atmosphere is 'pizza joint', which is adequate for the fare and pricing.  Friendly staff, and they do bus your table when you're done."], ["Preston W.", "Found the place for the first time 2 weeks ago and have been hooked ever since! Reasonably priced, plenty of space, and fantastic food & desert. Never left disappointed. You can't go wrong with a classic meat lovers slice!"], ["Tim W.", "Consistent, excellent food. I ADORE the Picchi Pacchi Salad. The atmosphere is casual, yet very nice, and you must try out the balcony seating area."], ["Michael M.", "This place survives off two downtown Fort Worth phenomenons:1.  There's no Italian restaurants downtown.  Saviano's sucked it up from day one.  Uno's is Uno's, not really an Italian player.2.  There's no restaurants open after the bars close, except this place.  They get slammed after 2:00.  You gotta dodge vomiters and soon-to-be-vomiters.The chefs don't royally screw up the pizza, entrees or salad, so if you need a marinara fix or alcohol absorption, you found your match."], ["J J.", "If you like late-night pizza and being treated like a mushroom, put this place on your map. But if you like luxury amenities like restrooms for customers and complimentary parmesan and red pepper with your pizza then you may just want to go for a more traditional evening stop, like Ol' South Pancake House, where condiments come with the food at no additional charge and you're less likely to be insulted by the manager for asking for another slice of pizza upon finding hair in the one you previously ordered.If they double-charge your card, good luck getting them to merely fix it by issuing a credit or comping your meal on the next go 'round. When you respond by saying that's kind of sketch you can count on them to default to using censored-for-PG-audience vocabulary directly speaking to you. After a good handful of visits and forgetfulness, it's important to recognize the power of competition and monopoly I'm the marketplace. Granted - it's just pizza - but being the only place open late in the downtown area gives these guys full authority to make it the most miserable experience possible and it's obvious the \"Son of the Owner\" will take max advantage of this.I feel sorry for the guys that work there, since the \"Son of the Owner,\" who insists he goes by no other name, refers to them as \"just labor\" but has no problem refusing restrooms to customers and charging $3.50 for condiments for a cheap pizza profit and terrible customer service turnaround."], ["Michelle M.", "This was the only place we could find late night to grab a bite in walking distance downtown. The pizza was good but I found it to be overpriced for what it was. I would give the pizza four stars, but as far as bang for your buck goes had to lower it down to three."], ["Joe M.", "Best pizza in fort worth in my opinion. A bit pricey but its top notch. I really like the upstairs for added privacy in case it's crowded. And their deserts are amazing I recommend the teramisu. Its awesome"], ["Allison C.", "I honestly feel that giving them one star is FAR too many!  It was truly one of the worst experiences I have ever had in a restaurant!!! I mean EVER!  I have never seen anything like their customer service anywhere and hope to never again!  We were all in a state of shocDuring the Main Street Arts Festival, we decided to go inside and get my son and my nephew and piece of pizza as they hadn't had any lunch yet.  I ordered my son's pizza from the guy and he asked me which type of pizza that I would rather have (after I told him specifically which one we wanted) and we made eye contact and i told him again which piece.  Then my sister in law ordered my nephew's piece of pizza.  I only saw him put one piece in the oven and was confused. He put a piece up on the counter that was the same kind that my son was wanting, so I asked him if this was ours and he said kind of rudely, \"No, it's for another customer.\"  So we asked him if he got my son's order and he told us no, that he only got the one order.  So once again, I tell him which type of pizza my son wanted.Then we move down to order the drinks.  I told the lady at the register that I wanted to get one coke to go and one ice water.  She shows me a hard plastic coke cup and says that's for water.  Well, I knew that I certainly couldn't take that cup \"to go.\"  So I got two of the paper cups that were by the register, so I could put water in one and coke in the other.  As soon as I did, the lady raised her voice and says to me, \"Excuse me, you can only take one of those for a coke!\" And I said to her, that I was also taking one for water because as I told her originally, I wanted a water \"to go\" and I very well couldn't take the hard plastic cup with me.  Then she tells me that she didn't know that I wanted it to go?  Seriously?!?!  Then she shows me this smaller, thinner plastic cup and tells me that THIS cup is for water!  I'm thinking to myself, does it REALLY matter THAT much to act this way?  So I told her that I was sorry, but they were all being kind of rude and that I didn't appreciate it.  She didn't apologize or anything.So in the mean time, my sister in law, friend, the kids and myself go to a table to wait for the pizza to be ready to go.  So we are talking about something else altogether and a bad word was used.  All of the sudden, this lady who works there who had been standing there eavesdropping on us, unknowingly to me walks up and just as loudly as she could said to me, \"Excuse me, but did you just call my Mother a B$#@h?\"  I could NOT believe it!  Everyone in the restaurant turned around and looked at us!  I told her NO that we were NOT talking about her mother and asked her what her problem was (her mother was the lady at the cash register!)  So she and I said a few things back and forth to each other and I told her that I coudn't believe that she was eavesdropping on our conversation and if she was going to spy on somoene, that she needed to get her story straight!At this point, I was so in shock, we all were!!  So I went up to the lady at the cash register and her extremely rude daughter and I demanded to see the Manager. I was then informed that they owned the place!  I was blown away!  I told her that they would NOT be in business long if they keep running it like that and treating customers that way!  And I told her how her daughter had just embarrassed me in front of everyone and had been spying on our conversation and so on.  The lady apologized for her daughter as her daughter stood by giving me the worst looks, like if looks could kill kind of looks!  Then I told the lady at the cash register, that I was was NOT calling her any names, but that yes, she had been rude to me, then SHE starts to raise her voice at me.  All of this is in front of two people trying to pay for their meal.  Then they guy who is at the pizza area tells both of us to stop arguing!!  OH MY GOSH!!  Please tell me this is NOT happening!  Am I in a nightmare!  That is what I was thinking!!!  I just walked away!  I will not lower myself to their level!  It was total insanity in there!  I will surely never go back!!!My family and I freqently go out to eat, sometimes 4 or more times a week.  My husband and I both work in the travel industry and have been all around to many restaurants and have had all kinds of service from excellent down to horrible, but this certainly took the cake for the worst experience to date!!!  I was apalled to say the least!  As I told the owner, I am the customer and you do NOT ever treat a customer in such a way, that is if you expect to have repeat business and there is also word of mouth and I certainly will be getting the word out on how I was treated in there as I wouldn't want anyone else treated this way!!!"], ["Don C.", "Not bad for Texas pizza!"], ["Matthew J.", "I have had a fair amount of pizza at 2:30 a.m. in numerous cities. This might be the best. Amazing food, decent price."]], "Giovanni's Italian kitchen": [["Gary L.", "The food is great. The service was spot on. I had the pasta trio and all three were very good. The salad was freshly chopped and not bagged stuff they pull out on you. The portions are huge. They do a lot of pizza take out here so we're going to try a pizza soon. Thumbs up on this place !!!!!"], ["My L.", "Been here twice now and I have yet to be disappointed. Real home style Italian food. Need I say more? The service is friendly and very attentive. The desserts definitely hit the spot and I can't disagree with the atmosphere. Although the spacing is tight, everything else is spot on. My favorite place to go to when I have a craving for Italian!"], ["CS L.", "Cute place. Owner/chef is very friendly and seems like the real deal. My 20-minute take out order was ready in less than 10. Tried the chicken parm and loved it. I would love to give 5 stars but the sweet tea I ordered was not good at all - tasted old. Still, this one is worth a try - highly recommend it."], ["Sax M.", "We made the mistake of going on a night when they had the worst singing imaginable. Tables were moved close together to make room for the Karaoke folks and made it impossible to get seated and have a comfortable meal. The food here IS NOT outstanding, and the atmosphere is less than appealing. It is certainly not a quiet romantic place to dine. Lose the annoying Karaoke."], ["Mark B.", "Nice staff, fast service, and good food! :-)"], ["Mike S.", "Very good, and super nice people.   Don't be put off by the location, this place has delicious Italian food!"], ["Keary C.", "I had veal parmigiana, my wife chicken Penni, my son lasagna. Everything was delicious and reasonably priced. Our service was excellent and the staff made you feel at home."]], "Nonna Tata": [["Jessica T.", "I really am not sure what to rate this place because my experience was so strange.  I had seen this place many times but never been due to the fact that they are cash only (or personal check it turns out!).  But me and coworker finally went because Lili's was packed.  First, the interior... I thought we were in just the \"front room\" before realizing that it.  A tiny room with a few high top tables with bar stools.  We chose outside, where there are a few metal tables.  Much nicer.The waiter brought us menus and told us the specials.  I had the chicken with lemon and capers and paid extra to have the \"vegetable soup\" instead of the salad.  My coworker had the special which was described as pork loin and cabbage with tomato sauce.  The place had a european ambiance to them, and I was a bit surprised by my soup (which I was corrected when I said Minestrone)... it was a light broth with lots of peas, and a few other veggies.  Not bad, but not Italian.  Coworkers salad reminded me of general european salads - greens, corn, carrots, tomatoes.  Drinks came in a can with a glass of ice.  Not my favorite but acceptable.Then came the entrees which is where things got weird.  My coworkers meal was a bowl full of spaghetti with red sauce.  We both expected a significant piece of meat, but instead it was tiny pieces of meat that seemed to just have flavored the sauce.  She said it was tasty but it did not really meet expectations.My chicken was as expected and super yummy... but the side of pasta was penne in a slightly spicy red sauce.  So chicken in lemon sauce with capers, piled onto the edge of pasta with red sauce... weird!  I have never had a place NOT put the same sauce on the pasta as on my chicken.  But it was tasty.  Meals came with one piece of focaccia  which was more oily than ideal but good.  Sadly they charge if you want a second piece.The service was very casual and not overly helpful.  not bad, just odd and made me feel like he was out of it.  Not sure I will be back anytime soon.  I hate cash only, especially if you are not going to be cheap.  And things were just so odd, but my meal was good in the end."], ["Christine Kassandra H.", "Bottle of wine - CHECKWine glasses - CHECK (Bring your own or they provide them to you for a fee)Ca$h money - CHECKWe arrived a bit before 5:30pm and there were already 4 couples hovering around the entry way. Promptly at 5:30pm, doors open and we all quickly filled up the entire indoor space. Indoor seating area seats about 20 max. Appetizer - Bruschetta Entree - Pasta All Arrabiata (Spicy and chunky tomato saucewith fresh parsley on mezzepenne pasta)Bruschetta was quite tasty as the toasted crispy bread and tomato/garlic/onion/balsamic vinaigrette toppings were served separately. As for my pasta, it was a bit softer than al dente and lacks flavor. I did not taste any spiciness and had to ask for extra red pepper flakes to spice things up a bit. All the food were promptly served and dessert menu was quickly handed to us as soon as the last piece of pasta was consumed. It was not exactly a laid back, relax and drink your glass of wine slowly type of place. The service was rushed and you get the idea because you see people walking in constantly and get told to wait outside because the place was full. Any somewhat considerate person would want to finish their meal and go without lingering around for too long.The Verdict:Food- 3/5Service - 4/5Ambiance - 3/5Value - 2/5I definitely have had better BYOB Italian in DFW. Nonna Tata is one cozy establishment but I don't see what the hype is all about."], ["Lana Lee L.", "Great & friendly service! They allow you to bring your own bottle of wine & they don't charge any additional corkage fees.  Prices are reasonable and quality is superb! My daughter brought me here for my first visit and her description was it's like dining in Italy rather than the typical Americanized Italian food. BTW. they do not accept credit/debit catds, so bring cash.  They even acce0tpt Euros! Try them, you will love them!"], ["Matthew D.", "Bring your cash and eat your heart out! Never a dull eating experience here. Great charm, excellent food, and lovely people. Doesn't get better than this!"], ["Dave T.", "Worst dining experience I have had in a very long time. The food was below average, with the homemade ham envoltini dish (one of their signature dishes) being simply not eatable. The most disappointing part of the night was not the food however. Rather it came in seeing the bill for the night. I was with a large group so they had told us they would be serving us family style, which amounted to less than a normal plate for everyone and yet amassed a bill of $40 per person. The wait staff was extremely rude and the total bill was criminal. I will never be eating food from this restaurant again."], ["Daniel A.", "You've asked for it and now you got it: a place that's much... much better and authentic than Italian restaurant chains like Olive Garden (not to mention cheaper, too). Nonna Tata is a great place to go if you're looking for a quaint yet charming hole-in-the-whole place to dine at.SPECIAL NOTE: Don't forget to bring cash to pay. If you forgot, there's a nearby ATM that's within a short five minute walk of the restaurant."], ["Bissell S.", "Food was very good. Good wine. Nice atmosphere....the problem here is value. The cost is way too high for what you get. Lower your prices by 25%....5 stars."], ["Shelly N.", "Not your typical Italian fare. One of the most memorable item on their menu is the calamari. It's not your typical fried, greasy, overcooked kind. This one is sauteed and incredibly tender and quite possibly the best calamari I've ever eaten. The location is very cozy and romantic as well. It's also BYOB!"], ["Tim T.", "My wife and I absolutely love this place. It is true homemade Italian food. The focaccia is so good and works great to mop up the last bits of sauce from your plate. The tagliata is my favorite entree, thinly sliced seared beef with truffle oil and shaved parmesan. Also a big fan of the gnocchi, so soft and perfect. This isn't a restaurant where you are in and out in 20 minutes, it is true Italian dining. Bring a bottle of your favorite wine and enjoy the meal!"], ["Jonathan N.", "Came in due to the high reviews. It's a small little place with 5 SMALL tables inside and some bigger ones outside. The inside decor is pretty \"cutsie\" and cozy I guess. They play some italian music which is cool. BYOB! Do not come without bringing a bottle of wine! They made us wait an hour for our food, and it was NOT busy. That turned me off a little but I am willing to wait for some good food.Bruschetta - not worth it, even if it's $2.50. 4 small pieces of bread with a bowl of their version of pico de gallo. Not anything special or worth getting in my opinion.Side Salad w/ Raspberry Chipotle Vinaigrette - not bad at all. It was very different and worked. It's not my choice of salad, but very interesting combination. Pappardelle w/ Seafood Sauce - GROSS. DO NOT GET. GROSS. Pappardelle itself was not bad.. but boy how do you mess up the sauce that bad?Pappardelle w/ Mushroom & Cream sauce - This was good for about 3-4 bites. It was then way too rich, but that is a given when eating most italian food. I would get this again if I came back, which will be never probably..Cute place and it is BYOB. Maybe this place has some good dishes, but I did not experience the best here. They also made me wait for an hour for some food that looked like it was thrown together."], ["Thy T.", "Since it was BYOB, we brought our own wine to celebrate a friend's birthday here at Nonna Tata. Nonna Tata is a cute restaurant with an outdoor seating and a great view of the medical district of Fort Worth. We ordered the charcuterie and goodness, that was delicious. I love tiny slices of ham and cheese. I don't remember what else we ate but we all enjoyed what we ordered and had a great time.Btw, make sure you bring either cash, check, or euro!"], ["Michael D.", "Great spot for lunch when in the med district. Food is old world not Olive Garden, try the specials."], ["Knuckles G.", "Well we had high hopes just by the reviews themselves. We went on a Wednesday night right when they opened and the fourteen tables they had quickly filled up with people and their wines. I called ahead of time to get some clarification on the BYOB. So you bring your own wine, they have glasses BUT they charge $3 to use them so bring your own. There was only one waitress to serve all the tables that night she was sweet enough but she easily got overwhelmed only just getting orders in and getting them out no skinny on specials or recommendations. We brought our own glasses and asked if they could rinse them as other BYOB establishments often do as a courtesy but the waitress stated no but that she could give us a napkin. My husband ordered the gnocchi and I ordered the carbonara. His plate was a $22 plate my plate was $14 plate both were the same portions. The gnocchi was edible but nothing special my carbonara was bland and came with a nice long strand of hair inside. It was at this point my hunger pangs went away and realized that the only decent meal I would be having is the wine we brought. My husband me pressed to bring it to the attention of the waitress but she was so preoccupied with other tables that to flag her down would entail us waving arms like we were that annoying kid in the class that knew the answer to the question. When we did flag her down she quickly replied \"your entrees are on their way\" when we corrected her to ask for the check. I can only imagine this place got the stars it got because maybe that's all ft worth has in somewhat \"authentic\" Italian that is close by. Don't get me wrong we enjoy ft worth and came all the in just based on the reviews. But I feel like we coulda went to a know Italian restaurant chain and got better experience."], ["Stone B.", "Food was excellent as usual, but the restaurant still smells like dirty mop water to me. I wonder if any of their sewer vents are clogged. Solution to smell is to eat outside, which I want to do anyway."], ["Tania I.", "20 people fit In the dinning, small and cute. The house salad with vinaigrette was very good. Calamari was good and not fried. Pasta was delish as well, but the desert...yum! Cash and checks only"], ["J L.", "I don't understand this place, I saw people going there with theirs own wine. Well, I understand it's a good idea to save money and more free to drink.  But the place is dirty and the food is terrible.  Maybe we got different taste.  It's the first time I been there and will be the only time.  Beside the food, I prefer to eat in central market.  I can buy ham cheese or whatever I want. It's clean and also no tips needed.  If you will go this place and looking for Italian food.  Well, good luck."], ["W F.", "What  do you do when your 4 day a week joint is so good that there are lines and crowds? What to do? Hmmm... definitely start closing earlier, how about 2 p.m. sharp?!  Bravo! We really feel the love:("], ["Jamie W.", "Wonderful little place...great food and service! We love going here, if you want true Italian food this is the place!! Save room for dessert!! It's BYOB too!!!"], ["Gwen D.", "My husband and I have always wanted to go here since we had heard such great things and seen the awesome reviews, but we were disappointed to say the least. When we arrived, we were seated next to a table of four that had had too much to drink and were obnoxiously loud. Not the restaurant's fault, but with the inside being so tiny, we couldn't even have a conversation. You could tell by everyone's faces they were happy when the group left. While there was no wait for a table, we waited an hour and fifteen minutes for our food. Neither of us were impressed with our plates as both were rather bland and certainly did not constitute the wait. Service was casual (which we don't mind), but not very attentive other than filling our waters. We did not BYOB... maybe that's why most enjoy it? By the time you get your food, I'm sure you would be pretty well sloshed!"], ["Jason R.", "The only authentic Italian restaurant in Fort Worth. I had the Tagliata and it was the best thing I have ever eaten in my entire life.  I have tried their pasta and it is also fantastic! I only order the Tagliata when I go now because I see it as the most perfect meal ever created by anyone....ever."], ["Yale Y.", "You will have to wait but its very well worth it."], ["Shiro Q.", "Wow!!! The Firenze 07 rocks! I mean everything is so good I have no words... If you forget to bring wine since it's BYOB, then just go across the street and get some wine. Awesome!"], ["Wendell H.", "The food is among the best I've ever had.  The menu varies from night to night, so there are always new dishes to try.  I've never had anything bad.  The place is very small, so seating is a challenge.  My only complaint is that it not easy to get in without waiting.  But it is definitely worth it."], ["Lorika H.", "Unique atmosphere with very little seating.  The food wasn't that good, very grease. I had Penne Pasta and was horribly watery.  Also, it's bring your own wine and bring cash, credit cards not accepted. I will go back to try something else."], ["Jan F.", "Friends treated us to dinner at this small, intimate Italian gem on Magnolia.  We came away happy with the experience and ready to go back if the opportunity arises.We started with two appetizers and both are to be recommended.  First, the bruschetta topping was quite good - it comes in a little dish and there was more than enough for the toasts served with it.  We shared antipasto for two (there were four of us) and enjoyed every morsel.  At $9.50 it is somewhat expensive, but not for the unusual offerings and amount - enough to make a meal.  We highly recommend the antipasto.After the house salad, two in our party enjoyed the specials of the day - varieties of stuffed pastas.  Two of us had simpler pasta dishes.  Mine was a simple rendering with prosciutto and parmesan.  Tasty all.  One ordered dessert, a lemony ricotta pie that was delicious.  Along with our own wine (served in our own glasses!!) we left more than full, and quite happy.As others have mentioned, the restaurant is quite small and no table seats more than 4.  The seats are uncomfortable stools.  But the restaurant remains full with happy patrons and turns away those who arrive later after all the few tables are filled."], ["Terry R.", "Second time here and I just can't rave enough. About the food. You have to get past the seating issues (not much and hard stools), teeny tiny room with hardly any breathing room, much less elbow room and the hubbub. Lots of making room for people to pass, lots of the front door opening and closing, lots of the bathroom door opening and closing, basically all right in your face. And did I mention the tiny tables and very uncomfortable stools? On the plus side, its BYOB with no corkage fee and I've yet to see a kid there. No offense. I like kids generally. I have 2. But I don't like them much in restaurants. At least not the poorly parented ones I generally see in restaurants.But the food. The food is so worth it. Calamari appetizer was absolutely divine. I've only had calamari fried, and doubted I would like it prepared any other way. But it must be marinated - its full of flavor - basil, lemon and the calamari itself thick and steaky. It was served atop arugula and roasted tomatoes. On of the best things I've ever eaten IN MY LIFE. I had the mushroom risotto, creamy, smoky mushroom flavor and very generously portioned. Risotto was perfectly cooked. I took my first bite, closed my eyes and swooned. Next thing I knew the BF was into my risotto. But thats fine because I got to share his seared tenderloin topped with parmesan and truffle oil. Perfectly cooked. Melt in your mouth tenderloin. The food here is crazy good. This place is a Ft. Worth treasure."], ["Ben G.", "Stopped for a quick lunch and ordered the lemon chicken.  First time here and I was very impressed.  I look forward to trying more on future returns.BRING CASH!"], ["Suzie-Annie C.", "This is a difficult review for me to write because so many are writing about quaintness, charm and the like but that all comes down to definitions and opinions.  I see what people are talking about when they say it is like a restaurant you would find in Italy, but I am an American and I just love Italian food! I don't want to live in Italy...I like America!  With that, I will begin...There is seating outside, in the dark, heat, bugs on a fairly busy downtown street.  Hmm - strike one.  You walk in to a SMALL, did I say SMALL dining area...um, if you can call it a dining area.  There were six, what they call \"tables\" in this room, they check out, a door in, a door to the unisex restroom and a doorway to the kitchen.  Their were 3 tables that they said sat 2, one that sat 4 and 2 more that sat 6!  Did I say they had to be Europeans to FIT in here!  A larger American would NOT fit in here and from the portion sizes, they wouldn't stay large for long.Everyone sits on stools inside...my husband's 6'4\" back was not happy when we left nor was his boney bottom from sitting on these hard stools.  This definitely is a European feel and if you like crammed spaces, then you will like this spot.The food: I ordered the Pasta la Limone e Spinaci (fresh spinach, lemon, cream and Parmesan cheese).  It was FABULOUS if you like cheesy, almost bland noodles with 4 sprigs of spinach.  The portion was small but every bite was delicious...just wish I had more bites and more spinach!My husband ordered the Pasta Firenze 07 (sausage, onions, walnuts, garlic and Parmesan cheese).  This was a penne pasta and again portion small, food was lukewarm and really lacking in substance.Both were served with a 2 1/2 x 2 1/2 by 1 inch piece of fociccia bread.  It again was good, but small.We had water, no dessert and we left $35 poorer.  They only take cash too.  I enjoyed the food but again my husbands was too cold and the portions were too small for the buck.  Old world charm?  Ummm - not so much for us."], ["Robert S.", "OMG. sooo good.  That is all there really is to say"], ["Ryan F.", "There's a long review that could be written here, but it would be a waste of my time and yours for it to be put together.  Everything amazing about this place has been written already- its small, its BYOB/BYOW, seating outside is scarce, they close at times to go to Italy so they can bring back additional cuisine, and they only accept cash.  Boom! Saved you reading 35 reviews in one sentence!On the whole though, what is important is to know that as someone who grew up on traditional Italian food, this is the truly, most authentic Italian food you can find in the metroplex.  That's not an opinion, its a statement from someone that cooks Italian and grew up on grandmother's perfection.  It is by no means that this location does not deserve all of its accolades on the shoulders of Donatella Trotti.  This location is truly a must on Magnolia and one of the secret innovators in Fort Worth.  Why are you still reading this?  You should be there already!"], ["Ashleigh D.", "They don't take reservations and there is only about 6 tables inside. It's so quaint and the food is in high demand! They have a great appetizer of anti pesto and there's zillions of things on it! The food is amazing as well and we were personally greeted by the chef! Wonderful place! Really pricey for a college student though, make your parents who have an established career pay."], ["Fregas B.", "my mom went here three times and received rude service. pancetta in the pasta was sparse, there was no heat and everyone had to wear coats."], ["Michael M.", "Phenomenal italian food.  If you're expecting heavy marinara dishes or pizza, stick to your local Joe's.  The menu constantly changes.  Start a dialogue with your waiter for suggestions...listen, relax and let it happen.  BYOB.  Tiny space.  You can order their food at the Usual Bar next door."], ["Lynn P.", "Very authentic Italian restaurant..perhaps might be too authentic to people like me. Great service. So many choices on the menu. Very little space. Over all, it was a fun experience ; )"], ["Gerard P.", "Funny how many people rate this amazing restaurant poorly because they did not do their research and come prepared.... I will not restate the conditions & requirements, but this is absolutely one of the best Italian food spots in DFW for someone seeking quality authentic cuisine in a relaxed romantic environmentIf you are by chance a typical \"larger American\" that requires insane portion sizes and room to spread out your love handles (as complained by previous unhappy reviewers), head further West to endulge yourself at the Macaroni Grill franchise. Otherwise, ignore all of the subjective reviewers that cannot truly appreciate this restaurant for it's intended purpose.... genuine, quality food"], ["R S.", "What can I say that's not already been said about this stellar establishment. I dream of their potato gnocchi- it was the best I've ever had! Everything was just perfectly delicious. Love this quaint, cozy little place. It's definitely a FW gem; my favorite Italian restaurant in FW for sure. Oh, and it's BYOB."], ["Randal S.", "Had THE MOST INCREDIBLE LASAGNA I'VE EVER EATEN at this place last night. Had to share.  Why haven't I eaten here before???  I live right around the corner!!BYO-whatever since they don't sell wine.  Bring glasses too. Just make sure you bring CASH or CHECK!!!  Lucky my friend had money or we would have been washing dishes."], ["Terry H.", "The ONLY thing that keeps this place from rating a 5-star from me is it's size.  The stools are not very comfortable, however, the food is Amazing!  First experience with Nonna Tata was ordering from The Usual Bar down the street.  For dinner, this is the way to go.  Fast ordering and only about 20 minutes for your food.  When the toretelli with eggplant and marcapone is available, I highly recommend it.  Fabulous!For lunch, if the door is locked, as it was today, just give them a call.  It may be they just forgot to unlock it!  Lunch specials were great.  I had the daily special of green peas with ham in a bechamel sauce over bow tie pasta.  Something so simple, yet absolutely delicious.  Came with a wonderful mixed green salad with fresh corn and a balsamic vinegarette.  Prices are reasonable and staff was very friendly and helpful."], ["Jonathan N.", "I am so happy that my parents and I went to eat here!  Whenever they come into town, we always look for something near where I live (Forest Park and Park Place).  Being hip to the gem that is The Fairmount/Magnolia Street neighborhood, we always gravitate to this lovely part of Fort Worth. FYI, They don't take reservations, they don't take cards, and they don't serve alcohol but it doesn't make a bit of difference.  Solution? Show up at a reasonable time, get cash down the street and stop off at Ellerbe's for their great wine selection.  Some have said that it's crowded.  I would call it intimate.  Furthermore, our server, Mallory was as nice and conversational as anyone I have ever had.  She was polite without ignoring the needs of the other customers.I've had Calamari in every country and Italian restaurant I care to remember.  This is the best I have ever eaten, bar none!! Angeluna (now Ferre') was about the best and this blew it away!As anyone knows, food, especially good food is a subjective experience.  I felt compelled to write my humble opinion because I read a few that were less than stellar.  My personal favorite was this:\"A larger American would NOT fit in here and from the portion sizes, they wouldn't stay large for long.\"Well then truck your fat butt on down to Ryan's or the Sizzler so you can eat until you explode, pal.  This is what I hate about some folks on yelp. This is authentic food and the portions were more than sufficient.  My family and I wholeheartedly recommend it!"], ["Nettie M.", "Food was absolutely outstanding.... Only draw back was the sewage smell! We sat outside but every time the door opened we caught a wiff. Delicious and authentic! No complaints about the food"]], "Thirteen Pies": [["Sylvia E.", "First time here. Lunch. It was great! I'm so happy. Although I'm not Italian, I am a native European having vacationed in Italy for years as a kid/teenager and we had a native Italian in our company today. He did verify (and I do too) that the lasagna is REAL lasagna as the menu says. We were a group, one had the lasagna... And we tasted it. It is real lasagna as served in Italy with meat sauce. The béchamel sauce was missing though or at least not enough. But very tasty overall with the meat sauce. No ricotta cheese to be seen ( yes, folks, that's an Americanization!!) The rest of us had pizzas. One wild mushrooms & leeks, one giancale and farm egg and one \"13th pizza\" - which it's the special - today it was with hatch chile, meat, roasted corn and fried onions. I cannot state enough how happy I was. The pizza pie was light, thin and crusty, just like in Italy as I remember. All very tasty in their own right. I sure will be back!!!!!!"], ["Jamie W.", "Pretty good pizza, wish it came out hot it was just warm!!! Will give them another try in the future before making a decision to not go there!The salad was good...lots of goodies in it!"], ["Jack H.", "Where to begin! I love the ambience of Fireside pies. It really matches the whole 7th street vibe. With the right amount of lighting to give it a very warm feel. The location is one of my favorite spots to enjoy an evening. The service was excellent. Very friendly and explained the specials with great description. Quinoa salad with fresh summer veggies was incredible. Fresh, light and delightful. We order the Iberian pie which was exploding with flavor.  Fennel salami had such a rich flavor, with smoked provolone to give it added depth. Castelvetrano olives had just the right amount to give it a bit more taste. Loved the yellow tomatoes on top, very fresh and juicy. The crust is light and crisp. Just what you would want in a perfect pizza. For dessert we had lemon mascarpone semifreddo which is frozen mascarpone cut into squares topped with this perfectly tart lemon curd , a pistachio crumble and blueberries. By far one of the best desserts I've enjoyed. It wasn't too sweet and the texture was interesting and unique. The lemon had enough sour and sweet to make it a top choice. One of my favorite meals by far."], ["Renee L.", "Based on the quality of the food, maybe a 4 but the potions are really small. We have eaten in once and for 2 adults and 1 6 yr old our bill was $90, granted we did have a couple glasses of wine which was reasonably priced. Second time we ordered take out. One pizza, salad and a pasta dish - $43 for this. Pizzas really only feed one hungry person. And we ordered a kale salad to go and it was the wrong salad. I live walking distance so we had hoped we'd like this place better especially from the other reviews but won't be eager to return. Oh well, lots of other places to chose from in the vicinity that we are quite happy with."], ["Lauren S.", "My favorite fireside location. I love to sit at the bar here and watch them make tasty creations. The bartenders are phenomenal. Very friendly, they make great suggestions and mix a mean drink too! I haven't had anything here that didn't delight me. I love the seasonal wood fired veggies- always rotating. I had a ricotta and corn stuffed hatch chile once- out of this world. My favorite salad is the panzanella- tomatoes, cheese, prosciutto, hand torn croutons, balsamic marinated red onion. Heaven. The pasta with bolognese is so fresh and flavorful. Garlicky- the pasta freshly made. As for the pizzas- I do try to get the 13th pie- whatever they have created for that week- or something loaded with porky bits- being a pork lover :) Drinks here rival The Usual for me. Hand crafted alcoholic treats. The ginger vodka soda is the best. I had a shot of Tuaca from a big glass dispenser that had fire roasted pineapples floating in it. It should be illegal- so tasty and I'm sure I could have kept drinking it like water. Love this place! Be prepped for a wait on weekends- but it's worth it."], ["Joi B.", "Pizza fanatic reporting in and *yay, I'm a fan* indeed, of Fireside Pies!I arrived famished (OK, so not really) and in dire need of something sparkling. This is a very common scenario for me, Fort Worth friends. It was ten minutes prior to closing, and I was dreading the words, \"I'm sorry, but...\" I never heard them!Look, if you have decent thin slice pizza, in addition to a killer wine list, *and* are willing to serve me at any point even though I'm there shamefully right at closing, you will probably win me over. And Fireside Pies did just that.God I hate being *that* customer. Normally if I'm realizing that I'm hungry 1/2 hour or less before closing time, I just suck it up and have at the can of Pringles in the mini bar of my hotel. But I was with locals (your own Kendall S, in fact, Fort Worth!) and felt a bit more... Brave. And the staff here is so wonderful, so gracious, so utterly *angelic* to serve us without a sneer or even an OUNCE of reluctance. In fact, our server was just an all around nice dude. And our food and drinks came out quickly. And we inhaled them.The menu contains many amazing pizzas and I was undecided between the Burrata and the mushroom leek. I went with the latter because I love me some 'shrooms. I. Ate. The. Entire. Thing. And it was fiiiiiine. The perfect size and nice and thin. No pizza gut afterward. No deep feelings of regret. Pizza always inspires melodrama for me, I'm sorry.Fireside Pies, I'll be back, hopefully a bit earlier next time!"], ["Whitney D.", "Amazing unique pizzas with fresh ingredients!  The salads are wonderful as well!  They're so much better than your average garden salad. The service is always great, you can expect your waiter to be on top of their game!  I've dined here a few times and have never been disappointed!"], ["Kristy C.", "Wow! Love the simple-chic atmosphere! The entrance is grand with ultra-modern, flair. The open bar, food prep and pizza ovens' view is refreshing, clean, uniquely organized and candid! Feels just like you're sitting in your best friend's spacious gourmet kitchen about to ready your meal together! The fresh and organized meats and cheeses in the see-through refrigerator adds to the open transparency of the place, as does the freshly made pastas hanging on drying wall racks ready for use! Well done from concept to completion!!! Oh yes!! The food...amazing!! Although a bit of a skeptic of mustard-based dressings, the Fancy House salad is nicely finished with a delightful true-mustard vinaigrette with seeds playfully dispersed throughout. The salad itself is enough to share as an opening act, or easily hoarded for oneself. Beautifully colored with field greens from the home-state (Texas, of course!) and a nice blend of perfectly sliced red and golden beets, compliment the ABUNDANT Marcona almonds and perfectly sliced old Manchego dusted with freshly ground black pepper! I am delighted and would gladly subsist on this alone! The Grapefruit Rickey proves true to the recommendations...check-in, order and see for yourself!"], ["Alicia F.", "This is my favorite gourmet pizza place in town. I know I should branch out, but I ALWAYS order the baked goat cheese as a starter because it's heavenly. It comes with oven-dried tomatoes, kalamata olives, basil pesto & crostini to dip. Their kale salad and pasta dishes are also great and every pizza I've tried there has been excellent. Great atmosphere and service, too."], ["Russ K.", "Meatballs appetizer, crucial.  Cocktails spot on with flavor. Peperoni pizza was by far the best because of the distinction between flavors."], ["Alex S.", "We'll this is one of my  favorite pizza place , they have great selection of wines and their cocktails are to  die for specially blues and Earl Grey ( my favorite)                                Also great selection on draft beers like peronni and some locals as we'll My favorite  app meatball really popular here , sit at the bar for better experience John it's a great bartender also salads and pies are really tasty got a short selection on desserts but they small and tasty  ."], ["Will M.", "I am a big fan of fireside pies.   I usually visit the Plano location and this was my first try in Ft Worth.  It is located in a nice area near downtown next to some other cool places. The appetizers of meatballs and bread were pretty good.  They didn't have the four cheese salad that the other locations do for some reason but we had a chopped salad that was very good.We had three pizzas - two of them were good but one came out pretty greasy.  The only thing I wasn't wild about is that our waiter was pushing us to order more food than we needed.  He said we should order one pIzza per person but luckily I have been to fireside before and new the ratio was more like 2 people per pizza. Overall I liked it and would go back."], ["Julian A.", "This is not your traditional pizza so if you are looking for the Pizza Hut experience, move on. This is a fresh approach to the pizza mundane; a mixture of superb ingredients melded together in innovative ways to excite the palate and open your senses.  But this is not the only perc from this venue.  Under the direction of John Foch, one of the outstanding mixologists of Fort Worth, you will find some of the most innovative drinks such as the popular grapefruit ricky, or my favorite, the honey lemon bourbon, which you will have to ask for because it is no longer on the menu.  Their salads are also delicious and flavorful and their pastas are fresh and yummy.  No, I do not work there.  I just love it."], ["Starr P.", "Fabulous food and relaxed, festive atmosphere here.  I had dinner w girlfriends Christine and Missy (regulars at this location) last night and we visited in a relaxed manner for 45 minutes outside, lounging in the festive atmosphere w drinks and appetizers without rush, while waiting for a table.I have been here several times w friends and each time been stayed for the company and delightful food.  The pizza pies are razor thin and delightfully tasty and rich without being heavy and,the cheese salad is a savory accompaniment (cudos to the chefs for such balanced complimentary culinary combinations) and my personal fav, the kale salad is truly beautifully seasoned and incredible (had my leftover for breakfast today!)As I waited w girlfriends last night we visited in a relaxed manner for 45 minutes outside at the cement tables and seating, lounging in the festive atmosphere w drinks and appetizers.A shout out to master barkeep and drinks historian John who is always friendly, amazingly knowledgeable and enjoyably entertaining - weekend evenings are always busy, so you can go alone and chat up friendly folks at the bar or go with friends and just hang out - worth the wait every time."], ["Brett I.", "I really dig the location. Location location location--it's super important, and they definitely make the most of it. The atmosphere of the place inside really matches the overall vibe of the 7th Street/Crockett area, and makes Fireside all the more desirable of a place to eat at when you're hanging out around the area. It has been two years since my first review, and I must say that the overall quality of the place has not diminished at all. Which is impressive. Their pizzas are pretty solid and a good departure from your standard chain pizza; I really like their selection and the creativity of the pizzas. I personally like their Iberia (salami, provolone, sofritto, olives, etc.) and their homemade chicken sausage pizza. Another good one is their pizza with proscuitto and arugula--those two go really well together. Also ask what their \"13th pie\" is; it changes from day to day!Good prices and decent selection on cocktails and beer if that be your thing.Fireside Pies--still gots it!"], ["Kim D.", "Love this place. Excellent service and atmosphere. The pizza's are made right in front of you, if your a bar patron, which I am. They hand make their own pasta too. Salads are to die for and the specials are always, well, special. Great specialty drinks as well! A must try when your on 7th!"], ["Cameron M.", "Such good pizza! My bf and I came here for date night ( on a Saturday) it was a bit of a wait but, worth it! We order grass feed meatballs (5/5), Texas bibb salad (4/5), ginger vodka soda(3/5- not my favorite), and spicy pork sausage pizza (5/5- so good!!!)! Great atmosphere, wonderful wait staff, and awesome food! I'll be back :)"], ["Amy A.", "We visited this location for my bachelorette party back in August. They do not take reservations which was a little nerve wracking since we had such a large party (15 plus people) but they were actually very fast to seat us. They also served us drinks while we waited. The service was fast as well & the food is always amazing! The only thing that was a little disappointing is the salads were much smaller than I was used to at the Fireside Pies in Grapevine."], ["Jeremy D.", "The unique pizza's were each delicious!  Pasta Bolognese was also great!  Unique cocktails as on the menu as well.  Overall a great dining experience and a comfy restaurant."], ["Frank S.", "Been wanting to try this place for awhile. Went on a Friday night, kinda busy. Put our name on the wait list. 90 minutes later, our name was called, I felt like i had won at BINGO. Inside, the place has a club like feel, dark lighting, very trendy, with Michael Jackson jamming on the sound system. It was nice to watch two older ladies swaying back and forth in their chairs to the music.Our server, Blake was real cool, explained how it works, and made us very comforable. We both had specialty drinks, my lady had the Sangria, and I had something called Enoxi. Both drinks were very good. We skipped apps and went straight for the pizza. She had the good pepporoni and I had the strait pie, several differnet types of cheeses. Both were very good, thin ,and crispy.  The sauce was realy tasty!!We both ate all of our pizzas, and finished our drinks like good girls and boys.  I really liked it, and we are missing that mystical 5th star due to 1 1/2 hour wait, but it was worth it."]], "Macaluso's Italian Restaurant": [], "Hysen's Nizza Pizza": [["Nicolas C.", "One of the great unknown treasures in Fort Worth.  While it doesnt look like much on the exterior, inside they are serving some of the NY style pizza I have found in the metroplex.  I discovered this place in 2011 when I moved to the downtown area and since then has been my wife & I's go to for pizza/pasta in the area.  Whether it be take-out or dine-in we are always treated to consistently good food by the friendly staff.  The quailty, fresh ingredients (no canned mushrooms here), and price cannot be beat.  I have had everything from the pizza, to chicken penne al a vodka, chicken marsala, meatball & cold italian sandwhich.  Even the chocolate cannoli is amazing!  They even have BYOB which makes it a great spot for my friends and I to all get together for a great family style meal on the cheap!This blow Joe's away, and it really is not even fair.   You are doing yourself a disservice if you do not give this place a shot, but hey more for me!"], ["Nathan P.", "Cruising around fort worth and decided to give this place a try. Pleasantly surprised, the food was good and the workers were awesome. They were friendly and welcoming. The prices were more than reasonable especially the pizza. Big slices with lots of flavor. What do you have to lose. You like pizza? Then eat here!We ordered an xl pizza that was great and a pasta plate that came with manicotti, stuffed shells, chicken parmigiana and spaghetti. All was wonderful minus the spaghetti. It was not for me but it doesn't change how I feel about the place.See you next time we are in Texas!"], ["Rosina D.", "I've just only had their spinach manicotti and their chicken Alfredo which I always ask for more Alfredo sauce on it. Food is good always call in my order"], ["Q R.", "I never write reviews but I had to on this place, the pizza is amazing. Dont be fooled by the outside appearance. The staff is great and the food is dead on the money. The marinara sauce is really the highlight of the pizza. Highly recommend the deep dish. Definitely will be hitting this place up when back in Fort Worth."], ["Chuck M.", "I work right around the corner from Nizza pizza and haven't been taking advantage of this wonderful restaurant. Twice last week, I called in my order and then picked it up at the drive-thru window.The first day I ordered ziti pasta with a pink vodka sauce. Oh my, it was incredible and the serving was enough to share. And what a deal and $5.95 for the entree with delicious garlic \"doughknots\". I also ordered a side salad. Their house dressing is the tomato based Italian that was made famous by Moni's in Arlington. The salad was crisp and the dressing was SO delicious.A couple of days later, I ordered a sub sandwich, the Italian combo. It's a 12\" sub for $5.95. It was absolutely one of the best subs I've ever eaten.I ordered the sub toasted. There was plenty of meat on the sub and it was packed with lettuce and tomato. A side of the house Italian dressing was also included. The bread was crunchy and fresh and the perfect texture. It was heavenly at ever bite. I'm definitely hooked!"], ["Karla B.", "They say pizza is their specialty and that it's NY style pizza and I'm going to have to disagree. I had a regular plain slice, a pepperoni slice, and the garlic knots. The slices weren't even heated all the way through and there was barely any sauce or cheese on the slices. They didn't really have any flavor...I'd rather buy those dollar slices in the city that suck but they taste better than the ones I had here. The garlic knots weren't that good either. I was really disappointed that I paid almost 8 dollars for 2 slices and the garlic knots. Their prices are too high for the quality of the pizza. Guess I'll still be looking for decent pizza in Fort Worth."], ["Ally A.", "My boyfriend is one of their regulars. Every time we go in, we're always treated like family. Everything is delicious. I can't express enough how nice is it is to come here. They greet us by name, know what we like, and they always make an effort to come by to catch up. I never leave unsatisfied. I don't know what we're going to do when Jason graduates, but luckily, that's not for another year! Thanks for another great experience! See you soon, family! Best pizza, great service, stop in, you won't regret it!"], ["Michelle L.", "I saw an ad in Fort Worth Weekly and being the city explorer that I am I got a friend to go with me for dinner one week night. We both ordered from the Nizza's Homemade Pasta portion of the menu. They have 21 dishes for $7.95 (6.95) if you go at lunch time. You order and pay at the counter and are given a number to take to your table and they bring your dinner out to you. I tried #11 which is Spaghetti with mushrooms. It was wonderful and is served with a small bread basket of garlic knots. They are good too. My friend also ordered from the Freshly Made Subs portion of the menu and tried the Chicken Parmigiana. It's $7.95 including drink. We both enjoyed the food, loved the price and will definitely return."], ["Rafael R.", "Very good pizza and service. Owner was extremely friendly and served us very well. We will return for future visits"], ["Tim J.", "I am new to Ft Worth and wanted to check out the pizza scene- I unfortunately am stuck downtown, and wanted delivery so checked this place out.  I got a salad, pizza and garlic bread.  First the salad-  I don't know if anyone watches family guy, but there is one that's talks about pizza place salads, and how odd they are- pickled carrots, check. Huge tomatoes, check.  Tons of lettuce barely torn or chopped, check.  It was just a hot mess, and for $7 I was expecting something a little better prepared.  The garlic cheese bread was barely that.  It had the slightest hint of garlic that was disappointing given the name, though there was a good amount of cheese.The pizza was average tasting, but insanely greasy, and topping were ok, but nothing memorable, and the sauce was bland.Delivery took 60 minutes, which was 15 minutes longer than quoted, and considering the time of day, I can't imagine an excuse except laziness as my food was luck warm when it arrived."], ["Mike N.", "The pizza was awesome, we had a large \"Works\" I have to say it was one of the best pizzas. We ate half took it home for the next two meals."], ["Chelsea K.", "The staff was SO rude to us for NO reason what so ever. We called in an order for pick up, arrived and we were the only ones there. We let them know that we were there for a pick up order  and the cashier says while rolling his eyes and throwing his hands up \"WELL WHATS YOUR NAME?!\" We were in shock. He continued to be rude until the moment we walked out the door. Then the pizza was mediocre at best. We will never eat here again. Don't waste you time, just go to NY Joe's Pizza & Pasta instead!"], ["O O.", "I was skeptical when I saw the drive-thru but apparently the Texas weather makes that a convenient element for quick dining options. What a delightful surprise this was. Fantastic pizza with fresh toppings and good service. We ended up spilling a glass of tea with the young ones in tow but no problem, they were happy to help clean up. They mixed up our pizza order but were so apologetic and quickly fixed us another pie. Great stop when you are at in the museum district and looking for a family friendly option."], ["Chef Bradford S.", "Easily best pizza in Ft. Worth.  In a landscape where there is not much competition, Nizza wins big and without effort.  The most authentic NY / Northeastern style pie I have had anywhere near this area.  There is some competition right off of camp bowie and more coming to magnolia area but Nizza may still be the king. They have several pies ready for you to grab a slice as well as Calzones, Stromboli and Pepperoni Rolls which i have not seen since touring NY.  The crust is crispy and the texture is near perfection.  Order the 18\" for the real feel and fold it over like a local.  At $12.95 base price, order two.   Happy Chef and Family."], ["Timothy S.", "Everything I've had from here is amazing, from pizza to pAsta and subs. My go to place to eat."], ["Anye F.", "It's funny how different locations of a chain can be.  My husband came here for lunch last week and really enjoyed it, so we visited the local Arlington branch and were not impressed at all.  He insisted I try Hysen's though to try the items they had here and not at Arlington, and I reluctantly agreed.  I told him that if the food sucked I was going to start my review with \"My husband is on crack.\"Well, he's happy to discover he's not on crack.  This location has significantly better food than the other one.  Everything from the garlic knots to the pizza rolls were better and some of the pasta surprisingly decent.My kiddo ordered shrimp alfredo and the alfredo was much better than I was expecting, and better than most of the other places around town.  I ordered manicotti and it was decent, doesn't hold a candle to Aventino's but most places don't.  The meatballs on my husband's ziti were tasty and the pepperoni/ground beef pizza roll was light years better than the stuffed pizza I had in Arlington.  The pizza roll has a very thin crust, not at all doughy, and has enough pepperoni in it to dominate the flavor.Most of the pasta dishes are very reasonably priced.  Shrimp dishes really aren't the best buy here; you can get fettucine alfredo w/o shrimp for half the price.  I probably won't make a special trip to Fort Worth to come here but if I worked or lived close by it's a great place for a cheap meal.  Service was excellent as well, very attentive and they gave us all freshly filled to-go cups for our soda.  (At the Arlington location, it was one refill per paid soda, probably because it's across the street from the high school, but here they were very generous with refills).We didn't actually order a \"pizza\" per se, and I'm not sure I would have cared for it as I'm pretty picky on pizza, but the pastas & pizza \"roll\" were all pretty good.tl;dr : Good place for a casual & inexpensive meal.  It's not 5 star but it's a solid 4."], ["Regular J.", "I don't know what happened or maybe i'm thinking of the wrong place but, this pizza used to be pretty tolerable! I ordered a Large Pineapple and Canadian Bacon pizza to be delivered to my place which showed up in a decent time. Upon first glance and first couple of whiffs from the pizza I noticed it didn't have that Pizza smell for some reason and was super oily looking. I should've taken a picture. I bite into it and the crust is already crumbling although it is pretty hard and almost over cooked but not burnt. Similar to unseasoned and very hard Papadum, It was like biting a tortilla chip you found in the couch after a week of looking for it. I couldn't finish that pizza. I didn't understand since my neighbors ordered the same pizza once before in which they gave me a slice and it was remarkable. I told them about it and they also said that when they ordered from there again, Nizza's Pizza missed the mark as I described. So I order a Deep Dish a month later just to be sure. That was a mistake too. The Pizza once again had this stale tasting cheese and was very very oily. The was hardly any pizza sauce in it. The Crust/Bread of the pizza was cardboard hard and yes very oily as well. Horrible deep dish. I ate 2 pieces before I had to get rid of it all and sit there looking very stupid that I tried this place again. Never again. Unless someone figures out how they used to make pizza here."], ["Paul F.", "If it is possible to lust after food, this is a good place to have an affair. The meat-lovers pizza was delicious and although it came with additional sauce on the side it was unneeded. The place was clean, quick, informal, and reasonably priced. I will be back to try other menu items."], ["Rick D.", "NY style and worth the experience... pizza is large and foldable with good meat toppings, but their pasta, stromboli, stuffed pizza and other downmenu dishes are also very good. Chicken Marsala plate gives you plenty to munch on. The large pastas will feed a few large appetites, and the small dishes will leave you either very full or with a dinner and next day's lunch.The service is fantastic and...authentic. Definitely worth stopping in for, but maybe not if you're oversensitive or faint of heart. It's a highlight for me. Also, I put in a delivery order on Friday and was told it would be 45 minutes, but it arrived in 30. Probably not typical of every experience, but it was a pleasant surprise nonetheless."], ["Janiel B.", "Ordered pizza and salad for delivery. Salad was just a large pile of lettuce with some generic dressing. We had ordered a crispy pizza with hamburger and olives. The meat looked like an unknown substance and the pizza was cold and greasy. YUCK"]], "Mamma Mia Italian Grill & Pizza": [["Brad R.", "Always good food and a really cool building. No TV's for watching sports but the bar is big enough.  We often order pizza to go."], ["Thy T.", "Came here several times when I'm in the area to hang out with a friend and we like to come here for lunch. I like their house dressing on the salad which is this slightly sour red sauce. Their bread is unlimited and great to munch on while waiting for your entrees. I normally order spaghetti with marinara sauce but recently I ordered spaghetti with pesto sauce. The calamari was pretty decent from what I remembered. Overall, decent place to grab some Italian food in this area. There aren't that many restaurants in the surrounding area so you won't miss it when trying to find the restaurant."], ["Charlene L.", "My husband owns At Your Service Flooring Discounters (Joe) and he orders a ginormous pizza every single Friday for his employees.  He has been doing this for at least a year.  I sneak a slice if I am in the neighborhood of his store and it is always so tasty!  And Joe and his employees never want anything else on Friday.  In my opinion that speaks volumes!"], ["John M.", "We love this place. We have been going ever since it opened and keep coming back. When we have visitors from out of town we go here. The food is great and everyone is nice"], ["E. A. P.", "Any meal I've had there was awesome. I've been 3 times since it's opened. I must say, though, every time I've been there the overwhelming smell of pine-sol is difficult to get past. The first time I hoped it was a one time thing. The second time, not only was the smell there, we had to stand by a dirty mop bucket while we waited to sit. 3rd time I reluctantly went because my mom wanted to go. The smell was accompanied by the table and everything on it being sticky. I'm going to try take out tonight- the food is good, after all...."], ["Vanessa T.", "Homemade rolls...stuffed mushrooms in cheesy cream sauce and mussels with marinara sauce. All delicious and the service was great! Listening to others...the wait staff even has regular customers."], ["Lance P.", "Great food. Good ambiance. Pre dinner rolls are awesome! Angel hair, olive oil and garlic is always great!!  Good prices"], ["Seri H.", "My favorite Italian eatery by far! Any pasta with their Pink Sauce is my favorite.The fresh rolls are also a reason to go to Mamma Mia's...warm and tasty every time!"], ["Jo M.", "My daughter, husband and I ate here around 1:00 on a Tuesday. Easy to park. We had lasagna  and a salad. It was the best lasagna I have ever had and the price was reasonable. It also was very clean and the server was attentive. We will definitely go back"], ["Michele P.", "Solid great meal!  We had chicken with artichoke in a pink sauce.  AMAZING!  Very good veggies.  Bread was killer, good.  If in Ft Worth, drive over here!!  We had a great lunch!!"], ["Heather J.", "My fellow Yelpers did not let me down on this place! It was EXCELLENT!Great food, service, and prices!Currently it is happy hour all day everyday...$2 domestic beers and $3 house wines!I got a pasta trio \"sampler\" special for $9.95. I shared it with someone and there were still leftovers!We also got the tiramisu, it was to-die-for!This is authentic Italian food!Great atmosphere too!"], ["Michael G.", "Had chicken Marsala not very good chicken was processed meat and had minimal taste! I grew up in an Italian home the Marsala wine was not authentic Marsala too runny indicates a knock off! Probably would not return here! Low end Italian. :("], ["Larry P.", "I had the meatball sandwich and Janet had the Tony's Salad. My meatball sandwich had tons of cut up meatballs.  The sauce and cheese was generous on a really fresh Italian/French roll. The salad had lots of items, and generous amounts... no skimping. Artichoke hearts, black olives, mushrooms, cheese and romaine lettuce with a tasty dressing."], ["Robert S.", "I just had lunch here for the first time.  I wish I could give it 4 1/2 stars, because that is more accurate than four.  I have passed by the restaurant many times, and thought it looked inviting.  I will keep this short and sweet.  I had the lasagna, and it was outstanding.  The service was superb.  Very reasonable prices.  I will be back many times."], ["Samuel L.", "Thank you Yelp for helping us find a nice Italian restaurant.  My wife and I went here after church and while we weren't impressed by the interior; I can't complain about the food or service! I ordered the Linguini Carbonara and love it! I was impressed with the portion for my son's kid's Alfredo w/chicken. My wife ordered the Chicken Picatta, but wasn't feeling too well. She did get the Tortellini soup and found it very soothing. She liked it so much, she asked for more. Not only did she get a second bowl, but our server gave us some to take home! No review of this place can be done without mentioning the awesome bread they give you. They are fine by themselves, but they make sure to have plenty of butter on the table for them too. Something you just don't see much anymore.It was very quiet inside and I loved the view of the traffic going by."], ["Tilde H.", "This restaurant is awesome.  I had salmon which was excellent.  The salad with the house dressing was great.  I love the building and the decor.  Service couldn't be better.  Prices are reasonable.  My friend and I enjoyed it and will be returning soon."], ["Trader M.", "We live nearby so love to give local businesses an opportunity as much as possible.  Stopped by for late lunch/early dinner about 3pm... not another person there at the time but the food and service were excellent.  One of the best Pizza's I have ever had.  The 'Personal' 8\" size is huge I picked 'The Special'... ingredients tasted fresh and the crust was to die for.  The complimentary bread with Olive Oil much appreciated.  Robert our waiter was very friendly and attentive.The Restaurant interior is a little hokey and looks older than 7 years.... but the ambience is good and the outlook from the huge windows to the street is cool.  We will definitely be back and probably call in for pick-up aswell!!I'm looking forward to my dinner after work tonight... left overs!!"], ["Rachel H.", "The bread is so soft and tasty. We got the anti pasta salad with the house dressing which was rich and better since homemade. Them for our main course we got the White Wonder pizza. The melted white cheese and spinach was just perfect! All a must try!"], ["Richard G.", "I have been here a few more times since my original experience and I have never been let down. The staff is always friendly and very eager to serve us. Food is more than enough to satisfy an appetite and prices are more than reasonable. Definitely check this place it!"], ["Dawn R.", "It was a fluke that we made it to this restaurant. I simply located a Italian place near to where we were passing through Ft. Worth.While unassuming from the outside with a simple sign on a brick building, the inside is completely renovated using the gorgeous bones of the structure to set off the crisp and clean atmosphere. The floor is a stained concrete and the rafters are exposed. I love it! We sat near the corner where a stunning fountain stands trickling away. The food is divine with generous portions and old world flavor. I had the lasagna with lots of gooey cheese. The meal came with a crisp salad and fresh parmesean rolls. There is also a clean bar, I noticed, with lots of wines set against the walls. Though I didn't partake, the selection looked well rounded.   A gem of a place to eat! I would highly recommend it if you are planning on taking friends out for their first time in Ft. Worth or for a banquet/reception."]], "Chadra Mezza & Grill": [["April M.", "It was around 5-6 on a Thursday evening and the place had a steady flow of customers that sat and ate for a long time like us.Because the portions are huge! I had the gyro ($9) which filled me up for the rest of the day and made up for my saving my appetite for this dinner. Really good. Enormous. I cannot emphasize that enough. I honestly could have split it with my friend who had the Kafta (?) sandwich which she said was good too. Both of our meals came with fries. My plate had a good amount but my friend noticed her unequal and small amount of fries and told me she considered asking the waitress for more but luckily the waitress came out at the same time with two baskets explaining that the cook actually noticed but just wanted to get our food out first. So yay for both of us! After my gyro, I somehow mustered the space to order a scoop of their Turkish Coffee ice cream which I crave to this day. I'm not one for coffee but this one was the right texture and authentic. Lord have mercy, I'm so big on texture. And this ice cream was smooth and had coffee grinds in it which gave it this complimenting graininess. It was only $2 for the scoop but it was a really small scoop. The disproportionate scoop was amplified in the already tiny bowl it came in. Overall, my experience was super worth it. The food exceeded my expectations and I liked the environment and that general area in Fort Worth."], ["Jim S.", "Gyro and hummus were very average, hummus lacked much taste and pita seemed store bought, thin and Luke warm. Italian dishes on the other hand were outstanding, meatballs were awesome and sauce was perfect to my taste. Eggplant lasagna was very tasty. First time there and in the hood so we'll be back and focused on the Italian side of the menu. Side bar on seating there were only 2 sets of guests at the restaurant and we were seated at a small table as a couple, when food arrived waitress asked where to put it?? Just a pet peeve ...why sit us at a small take when there were 40 open and as a server..figure something's out like where to put the food."], ["monserrat a.", "As new residents of Fairmount this was a neighborhood staple that was on our bucket list.  When we walked into Chadra Mezza i cannot express how excited we were it smelled delightful, there was a great Friday night vibe. The bar was fully loaded w great spirits. Our bartender Thomas immediately  greeted us and made us feel completely welcome.  He was relaxed yet professional. Funny and suggested we go with the $18 buffet as first-timers there so we can try a little bit of everything.My personal favorites: hummus, so fresh and garlicky, babaganoush, the tilapia, juicy thick pieces of gyro, the pizza, lamb shank, the grape leaves were so aromatic and lastly the chicken.Honestly this will become our favorite go to spot now. We're sold! And we're not easyily sold but Chadra has impressed."], ["Vichy L.", "The Gyro was a great size and wonderfully flavored. I got full after eating only half of it!! -I mean... I ate the fries, and they were a little cold. But, I had to drive my plate ALL the way home. The plate had a good warm heat to it, but it wasn't too spicy. The garlic knots... man... those were delicious! The restaurant guy was really nice, and the next waitress that saw me also asked if I needed help, so overall. It was a good experience."], ["Amanda W.", "I'm vegan and went in because people recommended it to me and I've always enjoyed it. After I ordered the vegan friendly grape leaves I took a bite and there was actual meat in it! I told my server and he asked if I could still pay for it. I talked to the manager and he didn't seem to care. I'm never going back after being a regular for so long. They shouldn't offer vegan options if they don't really care."], ["Ashley N.", "Chadra, I love you. Your delicious pizza with a crust unlike any other, your chicken shawarma, your perfect falafel. Please don't ever change. Seriously, though you make me want to order the chicken shawarma & the pizza & the falafel just so I can combine the three to make the most glorious shawarma falafel pizza ever. Your wait staff is also extremely pleasant & it's always clean & nice smelling in there."], ["Krista R.", "Chadra, I am sorry that I have passed you up all of these years. I always have intentions of trying you and then I get distracted and I'm like \"OHH, Esperanza's!\" or \"ohh, let's eat at so and so on Magnolia!\". Not this time!We went for lunch. The garlic knots were so good and addicting. I had to be careful and not eat the whole basket! I got the Kabob Trio. I got the chicken, steak, and kafta with a side greek salad. The salad was good, drowned in Feta. The salad dressing was tasty. Some places the chicken and steak are dry, but not here. The chicken and steak were moist and full of flavor. They have a Mediterranean and seafood buffet on Friday and Saturday nights. I will be back to try that!!"], ["Austin S.", "Super nice chef who came and talked to us after I asked our waitress to compliment him on the perfect medium rare cook on the salmon. It was very fresh and delicious!"], ["Adam M.", "I have come across Chadra a few times. They have been at many outdoor music events around Fort Worth. They'll usually have a booth set up with a small selection to chose from. I always enjoyed what I got from them but I always suspected that there was more.Last Saturday I finally made it into their restaurant. It was surprisingly empty for a weekend. We were sat on the patio. It's completely covered so the shade was nice. There isn't much of a view since this place is sort of tucked away.After looking over the menu for a while and not knowing what to choose it was obvious that the buffet was the way to go. That turned out to be an excellent decision! Their buffet has a lot of the same items that are on the menu. So instead of trying to decide on one, I was able to try several. Yes, several.I'm not very big on buffets. Let's face it, most of them aren't that great. I also don't usually eat more than one plate (if it's piled right). Once I saw the buffet I knew immediately that wasn't going to be the case. I was careful to not overload on any one particular item.My favorites were the heavenly chicken and the lamb legs. The chicken was something different for me. I won't pretend to know what herbs or flavors I was tasting but I'm sure I haven't had anything like it before. The lamb legs came with the bone but the meat melted right off. Lamb tends to be a little on the chewy side so having it slow cooked was an interesting experience. I think that's how it should be done.I don't think they have the buffet everyday. I'll be back for it soon though."], ["Denise R.", "Buffet was great and there were so many choices. The heavenly chicken was delicious! I will definitely be visiting again.The staff was extremely helpful. The service was great. It was an overall wonderful experience."], ["Sarah H.", "Their meat is HALAL! My friend and I came in here for lunch and were pleasantly surprised to find this out seeing that my friend only eats halal meat. Their lunch buffet has a lot of options and the staff was very kind. We'll definitely be coming back!"], ["Carol D.", "My girlfriends and I meet here once a month for lunch. Lunch buffet is delicious, the dolmas and garlic knots are fabulous. We love this place. They make their own ice-cream too! Only complaint is there is a parking problem around the restaurant."], ["Viralyn K.", "When I want to eat a lot but don't want to eat bad, I come here for lunch. $10 gets you an entire buffet. I am so in love with their salad bar. I love the fresh veggie options and the dip offerings right around the corner. I don't know the names of all of them, but they're so good. They will have meat and cooked veg options, the veg options don't make me feel too guilty. I usually end with fresh fruit. I always try a little bit of everything and it's always so good. I've been to other restaurants like this kind, but this one is by far my favorite. You can tell love has been prepared with the dishes put out. This is my new favorite spot."], ["Emmy F.", "LOVE this place! My coworkers and I work in the medical district and love to order delivery from this place but last night we decided to dine in when we found out they have a bar and hookah too. The service was excellent, the food delicious and flavorful, and all in a delightful atmosphere! We were happy to see Bradley as he had delivered food to us at work, and he's just as awesome as a waiter giving us everything we asked for and super pleasant. They have Mediterranean and Italian food, which I didn't think go together but it's nice to have both options in one place I suppose.Appetizers - I've had the Garlic Bread with mozzarella cheese, meatballs (3 large meatballs in marinara sauce), and hummus (served with 2 pita breads). All of them are delicious but probably my favorite is the garlic bread and cheese, sooooo yummy! Entrees come with garlic knots which are also good, but cheese makes everything better.Cocktails I tried were pomegranate Cosmo, watermelon mojito (which taste exactly as it's name) and something with midori and pineapple which was ridiculously sweet and my friend described as drinking the beach. I like my sweet martinis so the Pom Cosmo was perfect. They also have a decent beer selection and have a normal bar as well. Entrees - I ordered the heavenly chicken... Which is super awesome! Stuff chicken with cream cheese and penne pasta mixed in a creamy Alfredo sauce topped with spinach and chopped bacon. PERFECT. Love hands down. My friends ordered the grilled salmon, penne a la vodka, and kabob trio which they all thoroughly enjoyed too.Dessert - they offered us their pomegranate and Rose ice cream. Of course we were like, \"what does rose taste like?\" And it literally taste like the smell of a rose. I can't describe it any other way but it was good! So try it if you're curious, it's definitely worth it! Oh and the pom was good too. Hookah was pretty basic, they only had about 3 flavors but the owner was more than happy to bring flavors if we asked for next time. Lounge area/patio was nice and they had the big heater lamps to keep us warm and toasty. I also appreciated the random Indie rock station they had playing (they know what I like lol) The owner also approached our table and was extremely appreciative and super nice and friendly to us! I really love seeing that in family restaurants! Makes me feel much more welcomed and wanting to come back! For a Friday night we got a table for 8 at 8pm seated within 5min. So order delivery or make your way here. Either way you will enjoy it!"], ["Jason T.", "My wife and I with our two kids (2 yrs and 4 months old) went for the Saturday dinner buffet and it was good, but not great. They had a variety of food including lamb, crab legs, baked tilapia, 3 selection of hummus, pizza, heavenly chicken and salad. The quality was not the best of what we experienced in the past.  What they didn't have much were fruits (only grapes, pineapples, and strawberries), and desert. For a buffet, we think they should have more options in those categories.Unfortunately, they did not have any juice for our daughter. The price was $18 which was a bit steep for the amount of food they had. We thought we should have order from the menu. The atmosphere was nice with friendly service and they had a patio if you want to eat outside. We have not tried the lunch buffet yet. The lunch price might match the food they have much better than the dinner buffet."], ["Christie P.", "The lunch buffet at Chadra is AWESOME!!! Definitely go on Thursday when they serve the Heavenly Chicken, and bring lots of breath mints since those garlic knot rolls are absolutely amazing! The Monday night pizza and pasta buffet is also good, though it doesn't have as many choices as the lunch buffet. Their pizza crust is always fresh and chewy."], ["Melondy D.", "As a picker eater, I was nervous about trying this place. I had the lunch buffet with my husband and fell in love. The food was amazing and so was the service. I liked the something-vodka penne, the garlic knots, and the assortment of different meats. My husband enjoyed the endless pizza, lol. I loved the decor and overall atmosphere. I enjoyed it so much I went the next week with a co-worker who was already into this place. I'll see you guys next week!"], ["Meredith R.", "After craving eggplant and reading the yelp reviews, I decided to try the lunch buffet. I sampled the hummus, baba ghanoush, tabouli, homemade pita chips, and the saffron rice. I also had a tomato salad. There were plenty of meat dishes and several pizzas to try as well (but  I'm a vegetarian and have been staying away from cheese lately so I didn't try). Everything I has was extremely fresh. But the baba ghanoush needed something. That was my only tiny complaint.Besides everything on the buffet looking fresh and appetizing, it's also labeled so you don't have to guess. The service was composed of hipsters but they were friendly and attentive. The drinks and pita bread basket were refilled often.I'll be back next time in town. Maybe for dinner. Seems like a great place to drink wine."], ["Lydia J.", "The tomato soup was very good but my main dish, Alabma (sp?) was a little disappointing-the meat. The cinnamon rice was very good, though."], ["Hussain R.", "Probably the worst Mediteranian food I have ever had and I am not a Mediteranian food snob. Everyone on my table ordered the same thing pretty much, meat on skewers. I tried lamb, beef, Kafka, and chicken skewers. Meat was extremely dry, over cooked and was completely tasteless. The rice it came with was extremely hard probably from the bottom of the pan. Extremely poor quality. Food arrived 45 mins after we ordered. I will say the server was nice."], ["Ted W.", "Not sure how in the hell I've missed this place for long, suffice it to say I've finally found it and I'm totally in love.Went on a Friday night for dinner.  We'd been there previously for a Yelp event so we knew the menu a bit, the atmosphere was to our liking and the staff was friendly and incredible. On weekends they do a buffet over dinner and for 17 bucks you are treated to an Amazing Chicken dish, some fantastic veggies, grilled Lamb Chops, roasted Leg of Lamb, assorted Pizzas, fresh Tilapia, hummus and pita chips/fresh bread, salads and many many other things I didn't get to try (this time)None of the dishes disappointed and were way above standard buffet fare.  This was full-on entree quality stuff.    The roasted leg of lamb was the hit for me though.  Tender, moist and packed with flavor.  It was \"fall off the bone\" good. I almost had 3.They also had some baklava (sp) on board but I was so full, I didn't dare push the gut-expansion any further.We are definitely looking forward to our next visit here."], ["Andrew H.", "I was here for a Yelp event and wrote a pretty good review about the experience I had there. I plan on returning to eat some of the menu items. While at the event, we had some really great hummus, a feta salad, falafel, dolmas and fresh pita and pita chips. All of the food was great and the owners were very gracious to us.The patio is the place to be, and I'd expect on a cool evening it has got to be a really relaxing time. We even had some music going on. A man was playing a cora? an upright stringed instument. Possibly Lebanese? It was cool background noise to have.I will be back, because all of my Yelper friends who have been here have all had great food here and really enjoyed themselves."], ["Todd W.", "A group from our office dined there 3/28/13 to celebrate a couple of department birthday. Chadra is an easy choice for our group, especially on Thursdays when they serve their aptly named \"Heavenly Chicken\" which is incredible. The salad bar is fresh (and I could drink that greek dressing) and all of the entrees are well cooked, perfect temperature, and delicious. The grilled chicken will have you wondering how they make it so tasty and juicy. And holy COW the pizzas--hearty and flavorful--and that bread!!!!!They're always great with our group although this trip, our server was inexperienced or maybe having a bad day--but she was sweet and cheerful so why complain. (This, gentle readers, is the effect of the Heavenly Chicken will have on you!)"], ["Habeeb S.", "This was the worst experience ever as a Mideteranean cuisine  restaurant. Although the chef was friendly, but the food quality is not as good. Also, we were told the buffet is 12 USD and then charged us for 17 USD... I did not pay attention tell I paid later on..."], ["Shane F.", "After searching two hours for a good southern restaurant, I finally settled on Chadra grill, which happened to be across from the restaurant I wanted to go to. It was much later at night, but the very friendly waitress took our order of the kebab combo. Perhaps it's due to my growing up in the middle east, but I was underwhelmed by the overall flavor. You might wonder what more could be done with meat that is skewered on a stick with some veggies, but believe me, more marination can be done. While the meal was satiating, it was merely ok. Note: I did not have the buffet, which may have been quite amazing compared to a la carte."], ["Lara S.", "Happy find! Really good fresh lunch buffet. Not as expansive as Terra's buffet, but the atmosphere is warm and..................they have killer pizza! Also, greek salad/fresh veggies & fruit along with a selection of hummus/tabbouli plus plenty of meat dishes & fresh pita and garlic knots. They have a full veg buffet on Wednesdays only. I'm saving my calories to return for their Monday night pizza buffet. I also noticed a full bar and a great looking patio. Thumbs up."], ["Lisa B.", "Great place to hang out with friends, we often do this after work. There is a buffet that has a variety of things on different days. The menu is great too. Garlic knots are wonderful. I personally love the pizza and heavenly chicken!! The desserts are ok, just weird ice cream flavors!"], ["Reena D.", "I think it was time for an  update.  I recently came back for a yelp event.  We all sat on the patio.  The patio is really cute and there was a musician there playing away.  I was sipping on a Tamarind margarita.  It was quite tasty and had a nice kick to it.  I tried their hummus with their pita chips.  It was fantastic.  The hummus was so fresh and really good with their yummy pita chips.  I couldn't stop eating the pita chips.  They were that good.  The dolmas here were quite delicious as well.  They also had a feta cheese salad which was very refreshing especially on a hot day.  I've had their falafels before and they were really tasty.  This time around, it was a little on the bland side but its okay I enjoyed the food here.  The owners were really nice and shared us their story.  I can't wait to go back and try other items off the menu."], ["Ines N.", "I used to adore chadra mezza and go there quite frequently in the past, but recently the food has really been sub-par. The last few times I have gone there has always been something a little off (soggy fries, cold gyro sandwich, etc.) and its just not as good as I remember it being."], ["Michelle M.", "Everything on the $9 Monday weekday lunch buffet was scrumptious!! The only thing I didn't try was the pizza bc I don't wanna go comatose at work ;) Service is very friendly. That Heavenly Chicken is something I've never tasted and it was great. The homemade pita chips are very crunchy and so good with the hummus.I went again on a Friday and the entrees on the buffet were completely different than the Monday buffet but, again, everything was very fresh and delicious! Fresh fruit and salad and the house dressing was yummy (sweet & spicy)"], ["Stella W.", "After reading so many positive reviews about this place, I couldn't wait to try it. We thought the best way to try a bit of everything would be at the buffet.  We walked in a bit after 12pm on a Saturday and was the first table there.  The server greeted us with a smile and provided us with attentive and excellent service for the rest of the meal.  The lunch buffet was a steal at $10 per person.  So if you are looking for quantity over quality, then this is the place for you.  Personally, my hubby and I found most of the meats including chicken shawarma, Heavenly chicken, and pork loin to be dry and overcooked.  The hummus was great but that was about it.  Also all the food was lukewarm.  I wonder if ordering à la carte would be better but not sure if I want to give it a second chance since Terra Mediterranean is so much better."], ["Skyler S.", "I like Chadra's just alright. I don't think I've ever had a bad dish there. Everything for the most part is good, but nothing outstanding. My main problems with this place is it's prices, especially in conjunction with how the food quality is less than outstanding.If you are near the place and have the money, I'd say try it out. I used to eat frequently until I found out about Celaborelle about a mile down the street. You can get a falafel wrap at Celaborelle's that is literally three times the size of Chadra's falafel wrap for about a third of the price. Not only that, but it's about three times more delicious than Chadra's. Just my two cents."], ["Eugenio V.", "Here is my lunch review:the Good:- nice, clean, well kept restaurant- good amount of food choice- food quality is adequate- good value for your money- you can eat outside- lunch buffet for $9The bad:- mixing Italian and Middle-eastern food is a sin."], ["Nancy H.", "Was not impressed with how the buffet was presented but I was pleasantly surprised with the flavor. Everything I tired was quite amazing."], ["Stacey G.", "My family and I were visiting Fort Worth for the WVU/TCU game and wanted something unique to eat after the game.  Read good things about Chadra, plus it had a lamb buffet (!!) so we had to check it out.Of course we were slightly skeptical about the buffet...could it really be that good?  Would the lamb be the same quality you would order off the menu? YES. The buffet was a great value for $17...all you can eat lamb chops?! And they were sooo good! Plus all the traditional sides and salads, as well as whole lamb shanks. Let's just say nobody went home hungry.The owner saw us in our WVU shirts and came over to introduce himself and inquire how we had found his restaurant since it is a little off the beaten path.  He was extremely friendly and gracious, explaining each one of his desserts, and even bringing a free dessert for me since my mom blurted out that I was expecting.We got so lucky to find such a great place for our last meal in town.  I would eat there all the time if it didn't involve a 5 hour drive!"], ["Lauren S.", "I can't believe I didn't know about this place! I've been for both the buffet at lunch and ordered off the menu for dinner. The buffet is great. Wednesday is vegetarian- even though when we went on a Wednesday for lunch there was a few meaty dishes available. I love the chicken shawarma and penne alla vodka with veggies. The house dressing is really tasty- lemony and light. The garlic knots are addictive. If you want dessert try the baklava- just the right amount of honey. One order is enough for 2 with left over pieces. The patio looks really nice- can't wait to try it out in the spring :)"], ["Misty D.", "We were far from home, I checked Yelp! for a recommendation for somewhere to have lunch.  We would have never found this place otherwise and we thoroughly enjoyed our experience.  Thanks a million for the recommendation, Yelpers!!!"], ["Bonnie B.", "Update:  On my 4th visit, I finally found the right thing to order.  I had previously had disappointing salads, buffet food and overcooked salmon. This time I had the vegetarian pizza and it was really very good, much better than the pizza on the buffet line.  The service was still quite slow, but the food was a big improvement.  It's just a matter of knowing what to order, I guess."], ["Heather L.", "Enjoyed a Yelp Elite event on the patio here, and I have to bump it up another star. I asked what was vegetarian of the food that was set out, and got the awesome reply that it all was! Sweet! The hummus was delicious, very flavorful, and they had stuffed grape leaves, which were fantastic. I talked to the co-owner who was behind the bar, and she told me about other events they have hosted there. She was really sweet. The patio though, was charming! With all its plants, string lights, and live music. I didn't even know about it until tonight. It is on my list for sure for when the weather cools down again. Will be back!"], ["Christine C.", "On an especially bad day at work, we look around at each other and agree: Let's order out for lunch. Let's treat ourselves to something other than hospital cafeteria food, frozen lean cuisines, and leftovers. Let's order Chadra!It's the only place we can all agree on. It's so awesome to get foodie food from the trenches of the nurses' station. I love their eggplant lasagna (basically eggplant rollatini covered in vodka penne sauce). I really don't like their chicken shawarma though. They have an awesome buffet. Lamb shanks, squash stuffed with beef, and pretty good pizza. No desert other than fruit though. And that's only if you consider fruit a desert (and it isn't). They need some real desert at the buffet. Throw in some baklava or something and this would be a real five-star winner."]], "Taverna Pizzeria And Risotteria": [], "Cane Rosso": [["Jack H.", "We decided on the cane Rosso pizza and let me tell you. This is how pizza should taste! The mozzarella cheese has so much flavor, sausage is juicy and meaty. The roasted peppers are so delicious and then you get the crust! Heavenly! It's not too heavy or doughy, it's just right!  The fresh Italian flavors are bursting with flavor. I've never had pizza quite so amazing! Only downside was the service could of been better. But I will look over it  seeing as how amazing the pizza was!"], ["John Y.", "This place is legit. I just got back from Italy and this place is as good if not better than any pizza I had over there. They provide a fork and knife because that's how you're supposed to eat it. So if you're not a fan of thin, soft crust pizza... you're not going to dig this. But it's pretty amazing and rather unique. You'll pay a little extra for it. But I'm a fan.Also, of note--I eat a gluten free diet but not Celiac. I'm what they call \"gluten sensitive.\" I have found that I don't have issues when eating here. I think it's because they use imported flour. (I also didn't have issues when eating in Italy.) So if your'e like me, dive in my friends. DIVE IN."], ["Debbie S.", "Great pizza, they just forgot to bring us our salad first so we cancelled it. The s'mores calzone for dessert was great!"], ["Mark B.", "Went for lunch at Cane Rosso and got seated fast.  Our waiter, Noah, politely guided us through the daily specials.  We went with the two for twenty deal and drinks and salad both arrived quickly.  The Margherita Naples style pizza was fresh and savory.  The thin yet soft crust was flavorful and cooked just right!  This ain't some wimpy cracker crust. So expect to fold it or use a fork! :-)And if you have time for dessert ask about their dessert pizza.  It was wonderful!!!"], ["Amy S.", "Fantastic all around! Great location, great service and off the chart pizza.  This what we have been looking for!  We had the Paulie Gie and I would highly recommend it.  Spicy and perfect.  The sauce should be served as a drink option at the bar, it is that good."], ["Georgia C.", "(I actually wrote this review weeks ago but it never posted. Hopefully things have changed)I generally enjoy Cane Rosso because of the dairy free cheese.  On multiple occasions they have been out of dairy free cheese so I've made a habit of calling ahead of time; no problem.  I called to confirm that they did have \"vegan Cheese\" and went to dinner with a group of friends. The menu specifically states that they serve Daiya Cheese, I received the pizza and knew immediately knew that it was Traider Joe's cheap and terrible imitation cheese.  I confirmed with the waitress and even requested her to take it back because the cheese was inedible. Assuming the back of the house was too busy for the manager to come by and that I would not be charged for a pizza that I did not eat.  Unfortunately I assumed that the pizza had been comped but I found out later that not only did my husband pay for that uneaten pizza but also the upgraded cheese!I will not be returning."], ["Frank D.", "The pizza is good, but it's not Zio Carlo a.k.a Chimera. I'm not saying the service is bad or the selection of pizzas/drinks sucks, it's just not my cup of tea. The pizza is a little too wet and soggy compared to some of the pies at Chimera. Maybe I being bias since I love Chimera lol, but if you're looking to try a different style of pie, you should give this spot a try."], ["Jacob Y.", "I love Cane Rosso so much, like I literally don't even have the right words to fully describe the awesomeness of this place. Their pizzas are baked in a Neapolitan pizza oven, and they have a wonderfully blistered crust. We had a traditional Margherita pizza, a pizza with prosciutto and arugula, and a fantastic dessert pizza called the Ladybird, which had biscoff cookie crumbles, Nutella, and cookie butter. Definitely check this place out"], ["Brandon L.", "Traditional firepit pizza so you will need a fork & knife. I would recommend splitting a small salad and pizza, plenty of food.  During my visit I had the Luana pizza and Larry salad. Nothing unique about the salad, just a little roughage to feel better about eating pizza. The Luana pizza was excellent.  The spice sausage provide a medium heat that discussion not linger and allow you to enjoy a cold craft beer. In short, if you are in Fort Worth and craving pizza, then go to Cane Rosso."], ["Reena D.", "I love Pizza!  Pizza is one of my comfort meals.  I've been wanting to check out Cane Rosso for the longest and was so happy when they opened a location in Fort Worth.  We came here on a Thursday and it was not packed at all.  Thank goodness cause I heard there was always a wait here.  We were seated quickly.  We started off with the Carciofini (deep fried artichokes).   It was really good with the Calabrian chile aioli sauce that came with it.  I love going with friends as I get to sample the other pizzas that they order.  LOL I ordered the Che Cazzo as our waitress told me that this would be super spicy.  I love spicy.  The pizza sure was spicy and I loved it.  I was also able to sample the Regina Margherita and it was quite tasty with it being a simple pizza.  We also had ordered the Paulee G and it was really good as well.  The caramelized onions on this pizza gave it a great flavor.  The Caesar salad a friend had look fantastic and I want to try it next time I go here.  We enjoyed everything here including the Tiramisu dessert we ordered.Yay for opening a location in Fort Worth!"], ["Lauren S.", "You know that moment in the movie Ratatouille when the food critic tastes his food and is transported back to his childhood? That's what happened to me last night at Cane Rosso. I had been waiting for all the hype (and 3 hour waits) to die down before we braved the crowds. I love the interior! The open kitchen, mismatched chandeliers and warm cozy feeling despite being very open. It wasn't very busy at all so we sat immediately and had a few separate servers taking care of us. We started with the house-made burrata which came with friarielli, arugula, crostini, and sea salt. We ended up asking for more crostini because the order only comes with 6 thin pieces and a huge ball of cheese! It's way more than enough for 3-4 people to share. The center was creamy and the arugula adds a nice peppery kick. For dinner I ordered the Paulie Gee pizza which has hot soppressata, caramelized onions, Calabrian chiles, hand-crushed San Marzanos, house-made mozzarella, and basil. This is by far one of the best pizzas I have had in recent memory. The chiles gave it just the right amount of heat and the crust was perfect. It's a knife and fork pizza for sure, but that is okay with me! The man friend ordered the Bolognese. This is my favorite thing we ate. The sauce was perfect. The noodles are made in house. It tasted identical to what my grandfather would make when I was a child. It was a massive portion and we ended up taking half of it home, along with 2 slices of pizza and half the burrata! We washed everything down with a nice red blend that one of the servers suggested- Gertrude Toscana. I had a lovely meal here. The service was good, the food was amazing and we were impressed. I'm interested in the brunch menu- ricotta pancakes sound divine."], ["Ana O.", "Updating my review to 5 stars. I love the food and dining experience at Cane Rosso!I've dined at Cane Rosso a few times since my first visit and have grow to love it more. Love the pizza because all the ingredients are fresh and delicious. Then I learned they make their own pasta!  I still need to try it but just knowing they make fresh pasta makes them special. Parking remains a challenge but we've learned to park across the street at dinner time."], ["Justin S.", "DFW.com said to go to Cane Rosso for one of the best Cuban sandwiches in Dallas/Fort Worth. We took their advice and it didn't disappoint. Their cuban sandwich was great. It was a big sandwich and was packed with flavor.  My fiancé had the sausage and pepper sandwich and couldn't say enough good things. Another person in our group had the funghi pizza--also delicious. Everything was awesome. Definitely a great choice and we'll be going back for more."], ["Becky R.", "Showed up at about 8:30 on Saturday night and only had a 20 minute wait.  Grabbed a beer at the bar while waiting for our table. There were 4 in our party, and we ordered the Capricciosa and Luana pizzas. Pizzas were fantastic!  Only negative thing to say as that our waitress was not very attentive. Never received a refill on may of our drinks!  She never even offered drinks and was not around long enough to even ask. We would have all had another round of drinks, but just drank the water we were served when we were first seated. The pizza was good enough that we will go back, and recommend to friends."], ["Brad M.", "A place with a pig in front cannot go wrong... right?First, we sat outside on Magnolia Street on a Friday night, and enjoyed the patio!  INSTANT WIN!The menu had many authentic neopolitan style pizzas, including a delicious fig option.  The margharita pizza was delicious and so was the sausage and peppers (even though I'm not a fennel fan, and the fennel was nice and light).They have a fantastic selection of beer, including many Texas beers on draft.  Unfortunately, no vodka...pizza place with beer options:  egg and yeast allergy people are going to have a tough night!Also, I read the menu... and I get the idea... but when the center of the pizza is watery and still raw dough... the pizza hasn't been cooked well enough yet.This is a 3.5 I round up to a 4... because: PATIO!!"], ["Tim C.", "Great pizza, rude service.  I came here on a Friday evening with my girlfriend and her sister.  The waiter would not let me customize a pizza that was on the menu and his response was extremely rude.  I asked if I could remove a topping from a pizza that was on the menu, he said \"um, no\" then I asked \"really?\" to which he responded \"really\".  I feel like it could have been better explained if that is the companies policy but am doubtful that it is.  He also refused to get us ranch salad dressing and again, if there is none in stock, it could have been better explained than his response.  I believe the guy's name was Noah and it may just be his personality but he has no business waiting tables."], ["Ulises-Toni F.", "Amazing pizza with some of our favorite toppings. Burratta and Prosciutto, locally made sausage, etc...:need we say more!Service was great. The outdoor deck was perfect! A must try! Zion said it is his new favorite pizza place."], ["Edith Y.", "Excellent service! The meatballs are amazing! The app for the waitlist is efficient! Tasty and authentic food!"], ["Chad C.", "The pizza is dang near perfect. I love the sauce and dough. The service has always been great.  I have had one or two of the sandwiches and they were okay. The tiramisu was a very large portion and just okay. Th parking at this location is my only gripe. Magnolia is growing and less and less parking is available. I can go here every week for a pizza and ice tea and it is always enough. I have given up on the idea of having left over pizza to take home with me."], ["Una B.", "Can't lie to you, I was a little shocked that this place wasn't more packed out on a Saturday night. This was my first visit to this location, having dined in Dallas and via the mobile oven during happy hour at times ten. Our group started with the calamari that our server gave us the heads up on. Lightly breaded and tasty dipping sauce, I thought this was a winner. I was able to sway my lovely husband to ordering the capra salad (half order, plenty for us both and some for a few friends wanting samples) and the OMB. Both of these were so good, I was totally happy with our choices. We also had the opportunity to taste the proscciutto e rucola which was a complete opposite in flavor profile. It had a burst of freshness and this savory, salty party happening. Totally loved it. Another guy ordered a che cazzo. I wasn't daring enough to try it, as the visible handful of pepper seeds looked frightening. He really enjoyed it, my husband's mouth lit on fire from his sample slice. If you like heat - get this one. Another plus was definitely the service. Our server answered all our questions and walked through the basics when he discovered most of our group were first timers. He was funny and quirky and an all around nice guy.One boo point, they were either out or didn't make any sangria for the evening. I consoled myself with a few glasses of prosecco instead.  Cane Rosso pleased all ends of the spectrum in our group. From the food conscious to the everyday-corndog-eating-ultra-picky guy. Thumbs up all around!"]], "Cafe Bella": [["Ashleigh D.", "Cafe Bella is a great little restaurant when you're looking for some decent Italian food at a great price. First of all, it's one of the only Italian BYOB restaurants in Fort Worth that I know of, so it already makes it towards to top of my list. The inside is a quaint little old school Italian joint with murals on the wall, tiled floors and mis-matched chairs. The entire staff is super friendly from start to finish, and the food is pretty good!If you're looking for a laid back environment to hang out and drink wine, whilst sampling Americanized Italian food look no further."], ["Ben S.", "My rankings are as follows:Food: 4 stars, good not greatService: 2 stars, hostess was lazy, waiter was fineAtmosphere: 4 stars, decorated well but not spectacularThe veal roll was tender but a bit oily tasting. I was impressed with the sauce, it was creamy and well balanced. The spaghetti was cooked slightly over al dente but only slightly. The fresh baked bread was still warm from the oven and wonderful. The waiter was very kind and attentive and very Texan which I found funny because Bella is very clearly an Italian mom and pop shop. The hostess on the other hand was almost opposite. I'm not sure what she was doing when we arrived but she neither greeted us nor seated us. We actually had to ask her if we were supposed to grab menus and seat ourselves because there was no other indication we should. Heads up, this place seems to be BYOB; bring your wine if you want some with dinner."], ["Michelle L.", "We visited Cafe Bella for the very first time on Thursday evening. The weather was nice so we sat on the patio. I'm not very familiar with getting around Ft, Worth but it was easy to find the cafe. It looks like an older building, not fancy at all, but that doesn't really matter much since it's about the food. Our server was very pleasant and attentive which I always like. For an appetizer we had the Mussels Marinara $6.95 and it was spectacular. The sauce was so flavorful. They serve a basket of garlic rolls. They were pretty good but I think they are too big. The food is so hearty they could go smaller with the bread I think. I tried the Capellini de Bella in pink sauce $8.95. I loved it. My date had the Chicken Portabella $10.95 and my son had the Chicken Romano $10.95 and every one of us really enjoyed our meal. For dessert we had cheesecake $3.95.Are you noticing how reasonable these prices are for really good Italian food?I need about 3 more trips in the near future because I want to try the Lobster Ravioli Foresta, the Shrimp Fra Diablo and the Red Grilled Salmon Piccata.I recommend Cafe Bella, I really think that if you try this place that you'll be pleased."], ["Gerald S.", "Great lunch.  Chicken Parmesan, spaghetti, salad, under seven bucks.  Nice and quiet."], ["Marco H.", "Had previously been here before a few times.  Definitely agree that the owner is not too friendly.  On this night, the area of the restaurant we were seated had a faint smell of sewage.  Not too pleasant but decided to stick around.  Towards the end of the meal, my dad discovered a roach in his tea!  Disgusted, we flagged the waiter down and showed him our \"find\".  He took the drink away and promptly brought another tea.  Needless to say, this did not get touched.Food is mediocre at best.  Do not recommend and will not be coming back."], ["Clay A.", "Great Italian establishment. Excellent Chicken Parm and the service is incredible.  TCU friendly and the BYOB makes this high-in restaurant affordable for all parties. Great place for birthdays, a night out with a significant other, and any other occasion.  Bella's has never let me down."], ["Mr S.", "If you're looking for a top-of-the-line cuisine served by non-corporate bullshit this is the place I actually used to work for the original owner , who now is partnered up with one of my very first coworkers whom started as a waitress and worked her way up to half owner of this restaurant and proud we are of her ! you should all go to Bella's and have a bite, take a bottle of wine ,and enjoy yourselves,  take your lady, and have a great time!"], ["M W.", "I've always been a Bella's customer. Great food, nice patio, BYOB. However, tonight was very sub-par. When I tried to share a pasta dish and salad with a friend (with several people at the table) the waiter insisted we both order our own entree as it is \"the mangers request\". That is bullshit. Instead of ordering an appetizer portion salad and pasta, we had to order a large salad to count as one of our entrees, in addition to the pasta for the other. Ridiculous. Totally disappointed. Customer service is NOT on fleek."], ["Pokai M.", "What is the big deal?? Just because it's BYOB? Gf and I went on a weekday night because we wanted some Italian food. After looking up on Yelp, we decided to give Cafe Bella a try based on all the 4-5 star reviews. The place is in a run down scary strip mall. The parking lot was dark and right next to the place is a dollar store so it felt like we were gonna get robbed. Anyway....We were able to get a table right away. We ordered a calamari appetizer and we both ordered the penne vodka pasta (mixture of red and white sauce). The pasta was bad and the calamari was even worse!!!! The calamari at Blue sushi and Cheesecake Factory and Maggiano's tasted SOOOO much better, miles ahead. It was bland, like zero salt and the crust was too thick so it wasn't fried right and was falling off the squid. The squid itself was overcooked and rubbery. Probably from over-breading too! Felt like I was eating a crusty bland eraser.The pasta was not as bad but I've def had better jarred sauce. Again, it was bland zero salt bland. I had to add my own salt. Maybe that's what they do?? The penne was also overcooked so it was too soft. Definitely not al-dente. The only great thing I tasted that night was the olive oil that came as a dip for the garlic roll. But that probably came from a bottle. Garlic roll was okay. We would definitely not return, and would not recommend this place to anyone. This place is not romantic, it's cramped, it's not delicious, it's not cheap. I don't know why people drool over it, if you want to BYOB, just eat at home!"], ["Hector O.", "Good place. Great service. BYOW and they provide glasses and corkscrew. The bread was great and the calamari too. Had the Veal Barese and it was a little too salty."], ["Tedi T.", "I'm a fan of this place.  Okay...okay...it's not in the BEST part of town but I never felt it was unsafe.  The food is good and for the price, it's great.  I thought the bread and bread dip was exceptional.  The fact that you can bring in wine is a real bonus.  I like this place a lot...and will definitely be going back."], ["Karen V.", "Delicious food! Salt was perfect and I usually add salt, but the veal piccata was great!"], ["Van R.", "Great food, good service, and I even like their byob. The only thing that kept me from giving them five stars is their restriction against smoking on their patio."], ["David L.", "One of my favorite date places in Fort Worth. Affordable, excellent food, and it's BYOB. what else could you want?"], ["Kathleen S.", "This place is great! A group of my girlfriends and I went here for my bachelorette party dinner because it is BYOB, and we wanted to save money on alcohol before going out later that night. Cafe Bella provides you with glasses for wine or whatever you bring, and they just charge a $1 corking fee per person that drinks. All of the food that we had was great. They serve simple Italian food - nothing fancy, but still tasty - so it was perfect for a few of the picky eaters in our crowd. The staff was very friendly, attentive and incredibly tolerant of our large somewhat  intoxicated crowd."], ["Natalie T.", "I loved this place. Byob is pretty cool. It's a cute place. With a covered and heated patio...It's location will throw you off a bit (in a strip mall with a donut shop next door; which apparently \"has the best donuts\" according to a local)..but i digress... it isn't scary as one reviewer said. I wasnt afraid in the neighborhood..Anyhow. Went here with a few friends, the staff were nice and attentive.  May have helped we were one of the only tables there..but anyhow.Ordered the calamari, the batter wasnt seasoned but it was cooked perfectly.  There wasnt a crazy amount of breading. And the calamaris were a good size...ive had bad calamari before and the table agreed this was probbaly one of the best.Their dressings are all house made. (aka no hidden valley) I tried the balsamic Italian? I think ..bad choice. Put it on my salad, but it reminded me a bit of shrimp cocktail sauce..however. I heard their ranch version is pretty tasty. Our party had the mussels, penne vodka, and veal picatta.  All had great reviews. I think there coulda been more garlic in my mussels dish, but all in all, yum!BYOB...4 ppl walked out of there for just about $50. (Around 10-15 a piece) including tipWe had a great night. I say go!"], ["Kari C.", "Once again upon walking in this place has potential- the ambiance is right but not ao much... This has earned an extra star for being BYOB- awesome plus!!  The service was standard- not exceptional, not horrible. The food was sub par. My boyfriend had the tilapia- it came over pasta and was in a weird sauce- it also had some cheese, possibly mozzarella on it which was strange. I had chicken Romano which sounded a million times better in the description- also had a strange sauce which I ate after flooding it with Parmesan and red pepper flakes- needless to day the food was subpar. The best part about the meal was the bread rolls and oil dip! And the BYOB"], ["Josh E.", "This restaurant is great, and the family who runs it is very nice. Our favorite dish was the chicken rollatini. Other highlights were the house dressing on the salad and the tiramisu.  There is a lot of variety on the menu, and we really like the laid-back atmosphere. It is also nice that you can bring your own wine."], ["Brandon K.", "This place is great for a nice night out on a budget. The food is fabulous, the prices are cheap... my fiancé and I ate here for $18. To top it all off, Cafe Bella is BYOB... so bring your own wine and keep the price even lower. The decor is great, recently remodeled and very nicely done. The patio is our favorite... even in winter the heaters keep it nice and warm. GREAT BREAD! Highly recommended from one TCU grad to another."], ["Danielle D.", "First off I would like to comment on some of the reviews that bewilder me!!. The owner is NOT rude, in fact she is very very kind to everyone that comes in, now when young college kids come in drunk, loud, disruptive and start breaking things, then it is understandable why she might get irritated with those people. To the review about the \"empty back room\" well that is actually the FRONT of the restaurant which is reserved only for large parties and reservations. And third everything there is made from scratch, not from bottles, and as for the \"weird sauces\" well almost every item on the menu has a description of what is in it and for those that don't, simply ask the waiter. But either way you can have whatever you want, if you literally want your own pasta, veggies and sauce they will do that no problem! The food is amazing! Everything I've tasted there is delicious and I have no complaints. The waiters are nice, the owner is nice, the food is great. I don't see how anyone can give this place anything but a 5!! Seriously, don't miss out! I recommend this place to everyone. And the prices are very reasonable for the taste!"], ["Ben P.", "This place is fantastic for a quiet date night in the middle of the week! If you go on the weekends, it is super loud and everyone is drunk on their wine...so just pick what night sounds good to you. The food is fantastic and for a decent price! The atmosphere is underwhelming, kind of homey and quaint, and could definitely use a facelift. But you'll be going for the food at a good price, not wallpaper eye candy. ;) Give it a chance when you get tired of Olive Garden. My wife and I like the baked lasagna and Alfredo respectively. Their bread and olive oil dip is fantastic too! Enjoy!"], ["HD R.", "Horrible food horrible owner. I had my a birthday dinner here with a group of 20. We had reservations for 15 at 7:00 pm 4 of us arrived together and sat at our table for 15.  The owner made us move to the back of her empty restaurant because our part of 15 was trickling slowly. We were told  \"you are taking up to much space and you're full party isn't here yet it's 7:15 we must move you\" after being moved we were all told to hurry up and order by the owner (full party arrived at 7:30).  I told the owner we would order when ready and enjoy our celebratory dinner and to please not rush us. The owner replied \"do you want to eat here\" haha I was so appalled, I thought she was kidding! After we revived our horrible excuse for Italian food we sat and shared drinks and conversation. We were still being rushed and booted after spending $400 at her restaurant. I have NEVER been treated like this before. I do NOT recommend this restaurant."], ["Stacey S.", "I have experienced better home-cooked italian food or from some of the chain restaurants.  I got the fettuccine alfredo with chicken and it was pretty bland tasting.  Portion size was okay.  The atmosphere was nothing special.  I actually sat on a folding chair.  The restaurant was BYOB which i knew before hand but kind of a bummer when it comes to getting a mix drink which out bringing all the ingredients. It did have the small neighborhood feeling which was nice."], ["Kevin P.", "Definitely my favorite Italian place in Fort Worth. As Raymond said it is a classic hole-in-the-wall. It's affordable, good food served by a friendly staff. I recommend everything on the menu!"], ["Nichole B.", "Great lunch specials! It's a cute place...nothing too fancy but it's definitely one of my favorite places for a good, quick lunch."], ["L G.", "I wouldn't exactly call this place a home in the wall maybe cozy charming. First off not too impressed with the service. Long time waiting on our waitress but made better with how fast the food came out. Food was pretty good, chicken kinda bland, and my husband's chicken marsala didn't actually a Marsala flavor. Kinda the whole point of ordering it. Will be back but not too soon."], ["Arjola M.", "Wonderful atmosphere, service was great, food was delicious, what more could one ask for on a crowded Saturday night? I must say we had the opposite experience with managment as some of these other comments state, a good one, and all customers seemed to be enjoying themselves, exchanging jolly banters and asking \"what are you having, that looks good\" to their neighbors. You cannot beat the quality food and attentive service for the price point. The manager trusts and cares about their customers. Thanks again for a great experiece and delicious meal!!  This restaurant with outside covered seating, friendly staff and good food is a gem in Fort Worth!"], ["Kevin L.", "Cafe Bella is a great place. It's very reasonobly priced and pretty good. Being able to bring your own wine is nice too. The service was always good and just had a nice, warm atmosphere. It's nothing fancy or special, just good stuff."], ["Margie D.", "This is our absolute favorite place to go for Italian in Fort Worth!  This hidden gem is just outside of the University circle.  You can BYOW (bring your own wine) and they will provide glasses for you and the food is outstanding (and reasonably priced).  We are easily amused by the owner who always has a Help Wanted sign on the door, but many of his staff are faithful (possibly family members) or students (and never had any issue with the waitstaff).  Children and groups are always welcomed and outdoor seating is nice on a warm summer's night."]], "Taste Of Italy": [], "Prima's": [], "Vivo 53": [], "Aventino's Italian Restaurant": [["P G.", "Best Italian food in Fort Worth. A great variety on the menu and great atmosphere. Personal favorites are the lamb meatballs, any pasta with the pesto sauce, and lasagna. Did I mention the chef/owner makes the best desserts! yum! You must check out this family owned restaurant."], ["Thomas M.", "Well, what to say. We stopped here on our way through fort worth and I was a bit hungry. It was yelp review that prompted me to stop, so we did. Now, my review. Im not really sure what most people raved about, but one consistent thing is the bread and salad was very simple and just as it stated, bread and a few leaves drowned in the house dressing. The wine selection is large and diverse and a bit pricey. But, some are worth it. We order the veal parm and it was the highlight of the place, this dish was quite good and prepared better than most italian restaurants in italy. Lastly, the prices are around 25-30 per person for a meal. So not sure if the two $$ listed are quite accurate.Anyway, this is a good place to eat and i will go again if Im in the area."], ["Anjali D.", "I recently went to Aventino's for the first time with a friend. We went for lunch and the restaurant was pretty empty, probably because it's not in a very bustling location. We both got the lunch special - $9 included manicotti, a small house salad, bread, and iced tea. The vinaigrette on the house salad was excellent. The manicotti came out still bubbling and we could tell that it was freshly made. Their lunch special is a really good deal and they have fast, friendly service. I will definitely be coming back."], ["Alisa P.", "I have to give Avenitos 5 stars. We have tried several places as we recently moved to the area. Every time we have eaten there, the food is consistently good. I tried the lasagna tonight. I loved it! The dressing on the side salad is delicious.  You are my go to place for Italian."], ["Jessica A.", "Salad and bread were something I could thrown together with a bag of store bought lettuce and bread. Carpaccio and garlic bread was immaculate though! I could have eaten just this and been completely satisfied. Fungi sauce was delicious as well although it could have been a bit spicer for my liking. Small place, decent service and good food."], ["Monica N.", "It's a rarity to find a restaurant that serves free bread AND salad with the meal, but Aventino's probably shouldn't do either. The bread was store-bought, and cut in small slices. The salad featured about seven pieces of mixed greens, two cherry tomatoes, one cucumber slice and a raspberry vinaigrette. The dressing was good, but the salad was so small it didn't add much. The Carbonara came with a few pieces of what tasted like warmed bacon bits, a few onion strings, and egg. It was unusually gritty in texture and lacked seasoning.The Chicken Alfredo featured watered-down sauce, and over-cooked chicken with not the slightest hint of salt or pepper. The staff was very friendly, but not enough  to make up for the $30 underwhelming dinner."], ["Kevin M.", "Went there tonight. Found it on Yelp. It was so good. Like a hidden gem in a neighborhood  I have lived in for ten years. Great food. A place you can actually hear the people you are with talk. And it didn't cost an arm or a leg."], ["Anye F.", "I've been four times now and do think this is the best Italian in the area.  I've tried four different entrees:two were excellent (sausage & peppers parmigiana, manicotti)one was very good (shrimp scampi)one wasn't to my taste (carbonara) -- but I have to give them props for not calling alfredo with ham & peas carbonara like most places do.  They use all the right ingredients but somehow the balance was a little off from how I like it, hard to say exactly why.  But, they have enough other good stuff that it's no biggie.Everything \"meatball\" is wonderful here - both their homemade italian meatballs and the lamb meatball special (which I went home and tried to duplicate the next day).  We can't visit without ordering a meatball appetizer.  Their meat sauce is rich and flavorful - I don't think you can go wrong with any of the red sauce dishes.The cherry bread pudding was really good, I was sad that they were out of it tonight but my waistline thanks me.  (We won't mention that I filled my tummy with sangrias when I got home..no we won't!)If I could ask them to change one teensy thing, it would be to offer a cream based salad dressing in addition to a vinaigrette.  I know, I know, it's not authentic Italian -- but I really just don't like vinegar.  Some days their vinaigrette is more vinegary than others, but really I'd just like some ranch or blue cheese or anything not vinegary.But, we've always had excellent service and great food at pretty reasonable prices.  I look forward to trying more of the menu and I'm sure I'll give myself plenty of opportunity."], ["Leyton C.", "Amazing I've been here so long and hadn't found this place.Great food. Carbanara was perfect, veal was great also.They fill fast for weekend so make reservations."], ["Patrick C.", "Excellent food....Today, complete jerks from the top down.   Skating on the Paez name, Chris Hight (married to the daughter of the original founders) is now running this Ft. Worth sensation.  With one other table seated on a Friday night Chef Chis was way to busy to come out and speak with us about his staff's inappropriate  behavior toward my wife and son.  Furthermore, hostess hung up on me later in the evening after stating Chris was still too busy.  Left a message after that, no call back."], ["Gigi L.", "Good food, great staff.  The Raviolio Carciofi was amazing. We had a wonderful time. Everyone at our table loved the food and atmosphere. There were a few hiccups in the meal delivery but all in all it was an enjoyable experience. We will visit here again!"], ["Sydney L.", "Probably my favorite Italian restaurant in Fort Worth. My father and I found this place when we were taking me to TCU. I have been here just about every time I have driven in from Albuquerque. Now with me having my car, I plan on being here more often for a delicious treat!Chris and Erica are very nice people and offered to be emergency contacts if I ever needed help. Along with them, every person who works there is just as nice and genuine as them."], ["Madison B.", "Small and intimate. Wonderful food.  We will definitely be returning. Highly recommend the focaccia appetizer."], ["William K.", "Simply put, Aventino's is the best Italian food in the DFW metroplex. The food is always properly prepared and the waitstaff is very attentive. They even have a low carb option! Chicken parm is the best thing on the menu, but everything is delicious."], ["Taylor B.", "Took a girl on a date here last night.  Nice quaint atmosphere with traditional white table cloths.  It was surprisingly uncrowded. I made a reservation, but it was absolutely unneeded.  Felt bad for them since it was a Saturday night and we were one of like 4 couples in the restaurant.  Service was good and quick. I ordered the veil Parmesan while my date ordered penne pasta with rosa sauce, which both came with complimentary house salads. Both of us really enjoyed our meal.  Veil was hot and very tender and full of flavor. Loved it! Her pasta was yummy and I really liked the sauce.  We both ordered wine as well.  $8 a glass left me wishing we'd gone somewhere that was BYOB.   Prima's is still my favorite FW Italian food.  Same quality food with better prices and BYOB. Aventinos, however, was very good as well and definitely provides a better atmosphere for a date"], ["Katie H.", "Great decor and really nice staff. Food was good and the free garlic bread with yelp was what sold us on coming there. I'd definitely go back."], ["Scott C.", "Wonderful homemade Italian food from the family who own's the restaurant. Service was excellent all three entrees we ordered were fantastic. The only reason it is not a five star for me was the location in a strip mall it does not make the food taste any less great just loses a little bit of ambiance. Highly recommend."], ["Miranda M.", "Had the Eggplant Parmesan and found it delightful. Great atmosphere, quiet enough for good conversation. Great service. Will be back!"], ["Caryn E.", "My friend and I have a solid rule about not going to restaurants that have a lot of the.. how do I say this politically correct... Older generation present. Not because we don't love a good war story, but because the food tends to be bland, flavorless, and slightly cold. This is a pattern we, as out of towners, have learned to trust. I broke the rule. Needless to say, as my one star symbolizes it so well, it was a mistake. I got the lasagna. As our rule predicted, the food was bland. So bland. Nauseatingly bland. It was ever-so-slightly warm, it was gooey in the most unappetizing too-done pasta type of way, and it tasted of mostly cheese with a chunky meat undertone. A lot of the reviews mention the garlic bread, but all that was offered was plain bread. It was sliced, though, so maybe that's what everyone is so excited about? (sarcasm)I'm not sure why the ratings are so high, as the inside of the restaurant isn't overly inviting, the location is terrible, the parking is bad. I honestly was impressed with nothing from this restaurant. Good luck finding good Italian in Fort Worth."], ["James V.", "Overall, our experience was good, but nothing to write home about. The atmosphere is nice and, as others have stated, quiet and laid back. The service was outstanding: attentive without being pushy. The food was a bit bland especially my pasta with marinara sauce that was served as a side dish. My wife's ravioli was good, but not great. Although we might go back, we are still in search of an outstanding Italian restaurant in a West Fort Worth."], ["Alan C.", "Great Italian food! I ate the chicken cannelloni, & the girlfriend had the ziti umbriana. My meal portion was just a little smaller than what I was hoping for, but I was starving when I arrived. Both were very delicious though & would eat again. Waiting staff were all very friendly & helpful. Even the owner spoke with every person at the restaurant as if everyone was a close friend. Look forward to going back again in the near future."], ["Michael N.", "Great restaurant!! We loved the food, the service, and the chef even came out to see how we liked the new dish we tried. Good food and friendly atmosphere."], ["Kari C.", "This is by far the best Italian food we have had in Fort Worth. The only reason I gave it 4 stars was it used to be BYOB and no longer is...and unfortunately the wine was overpriced and mediocre served out of plastic glasses so drink specials or BYOB would change to 5. For food- we ordered the lasagna, it was great and can't wait to try the other dishes. The pasta dishes come with a small salad and bread and their house salad dressing was delicious! Bonus- free garlic bread offer from yelp and the garlic bread was amazing- I'd order it even if it wasn't freeFor service- average. The owner greeted us and sat immediately it wasn't super busy I wasn't sure what the hype of reservations was all about... And our waiter was attentive and friendly. Highly recommend and we will definitely return!"], ["Jim B.", "This place is excellent.  I travel quite a bit and I try to look for local resturaunts that are good.  I was surpised that there weren't many people when I went and I was even more surpised after tasting the food.  There really should be a line around the block.I can't say enough good things about the way the meal was prepared and delivered.Thanks for a great experience."], ["Jessica V.", "We had our rehearsal dinner here and everything went so well. There was nothing on the menu that we picked that we did not like. Erica was so helpful and flexible in the planning process and the service at this restaurant was top notch. All of our guests enjoyed it and it was very reasonably priced for a four course meal for seventeen people. Thank you so much!"], ["A R.", "Decided to try this place out after reading reviews. Was not disappointed! Definitely coming back soon. Tip: the garlic bread is worth the check-in."], ["Marcus P.", "Best Italian in Fort Worth and at a reasonable price! I love the chicken parmigiana. The new garlic bread is much better as well. All very tasty and the staff is superb."], ["S. S.", "Thanks to Yelp I found the reviews and decided to go to Aventino's for dinner. I wanted something really good to take home. ( I was alone so I didn't want to sit in a nice restaurant alone. lol  It's funny because I sat in Braum's for 1 hour on Yelp searching for a good Italian restaurant within 5 miles. I found a few and read reviews. This place caught my attention.  My experience with the restaurant was pleasant the moment I walked in. I picked up a menu so I could see what I might order. The waiter greeted me and he was very polite. This place is very quaint. The waiter took my order promptly and even the chef came out to let me know if would be several minutes. He came back and offered me a glass of water while I waited. I was so happy because I was incredibly thirsty. lol I was also happy to get a free order of garlic bread. They had an offer on Yelp to check-in and receive it for free. YUMMMM I had the chicken cannelloni. Spinach pasta tubes with chicken , cheese and spinach inside with sauce and melted mozzarella on top. It was really good. It came with house bread and salad. The house dressing vinaigrette has a wonderful taste. The garlic bread was a little dry but it was still tasty. I guess that is better than it being to greasy. I hate it when people make the bread a sloppy greasy mess. The bread also had just right amount of garlic.I will definitely go back to try something new."], ["Tolbert G.", "Great old west Fort Worth Italian is up and going at a new location on Lovell.  Still great Italian cuisine in a pleasant atmosphere.  The service is friendly and efficient. I have dined here many times in the year, and thoroughly enjoyed the wine, food, and great service."], ["Manolo E.", "Worst Italian food I have had in a long time.  My wife had the lasagna which was almost as good as Stouffer's but cost twice as much, i had the veal scallopini which was absolutely terrible.  The so called white wine sauce tasted like it was out of a can, the veal was tough and cold when it came out.  Service was friendly but not knowledgeable or good at qualifying dishes.I would would eat at Olive Garden ten times over.  Does this violate guidelines? You hate the truth? Wont quit, don't worry.  I file complaints on fake reviews. Plenty of those close by. Waaaaaaaassup son?!? Like them apples.  Owners need to lose that trust fund syndrome."], ["Tim T.", "I was referred to Aventinos by a local and I want to thank them for doing so.  After eating lots of BBQ, mexican and Tex-Mex it turns out that the best meal I had during my stay in Ft. Worth was at Aventinos.  The food here was as good as I have ever eaten.  I'm not just talking Italian but all types.  The service and the wine list were both excellent.  I really enjoyed the ravioli dish as well as all the other dishes that my dinner companions shared with me.  Not to be left out, one of the best italian dressings I have ever had.  The place is so good that during a five day stay I went there twice.  You will be very happy you made the trip to Ft. Worth to enjoy this family owned gem."], ["Madeline M.", "Fantastic food and great atmosphere!  There were 3 of us.  One had Eggplant Parmigiana, one had chicken cannelloni and there other had chicken parmigiana plus a side of meatballs!  All were excellent along with the salads with the wonderful dressing!  No doubt we will return and recommend it to all!  Also had dessert -one had cappuccino pie and one had the berry bread pudding!  These were also fantastic!"], ["Christina J.", "What a gem!  I did a Yelp search and based on the great ratings we went here.  The adult children have taken over this place when the parents retired so they have updated the menu.  Everyone was so friendly and the owner came out and chatted with us at length.  I had the veal Florentine and it was superb.  We shared a bottle of wine and the wine list was impressive with VERY reasonable prices.  Love this place!"], ["Heather W.", "This place is great. Everyone in the party loved their meal as well as the great wine list. From what I read i thought it was BYOB, but not any longer. They have have amazing wait staff and great food. We will be back!"], ["Angeline H.", "As a self-proclaimed Italian food connoisseur; I have yet to let my friends down!  This place was quaint and sophisticated.  The food was unparalleled.  I've noticed throughout my 10 years of the \"food journey\" mom & pop's are usually good but this was unfallible.  You can't go wrong here.  I will say, for those of us whom have to watch our calories; it's worth saving up.  The sauces are rich and creamy...not as if you're getting a mouth full of whipping cream or milk!  Atmosphere: Idealic for dates and great for small groups.Wine:  If you need a recommendation, the lady owner (believe her name is Erica or Elaine, she's got dark hair and features and utterly breathtakingly beautiful.) Her wine knowledge was impressive and was able to assist us with the pairings throughout our courses.Hope this helps!  Enjoy"], ["Bill M.", "Aventino's is a family tradition and our all time favorite. The owners are at the restaurant all day everyday putting their heart and soul into creating a great experience. They are young, energetic, hard working, funny and genuinely friendly. The generous portions are made from scratch and tastes awesome, especially the chicken parmesan and the Tiramisu. :-)!!! You can tell that the owners truly care and the love for what they do is evident in every last bite. The ambiance is very intimate and is inviting if you are with family, friends, colleagues  or your significant other. PLAIN AND SIMPLE, ANENTINO'S  IS THE BEST  RESTAURANT VALUE IN TOWN!!!!!!"], ["Isaac And Julie M.", "This is one of if not the best traditional Italian restaurants you can find in Fort Worth. It is family owned and obviously uses family recipes that are fantastic. The management is friendly and welcoming, the waitstaff is professional and attentive without being annoying. The atmosphere and spaces are clean and inviting, and the food... The food at Aventino's is the best Italian that we can find in the area. Fort Worth has limited Italian options (that are good at least) and this is a welcome return of a longtime Fort Worth family establishment. It is nice to have such a gem in our area. We give this our highest recommendation and will be returning soon."], ["Katie T.", "So, Aventino's was definitely ok.  The food was definitely tasty, but the atmosphere was kind of old and sleepy.  Lots of middle-aged business people, only 4 or 5 tables full out of 25 on a Friday night, and a sort of weird waiter that delivered our food with a fake British accent.  I appreciated the Yelp coupon for free garlic bread, but it was $5.50 and not actually that much better than the bread that comes with the meal, so I wouldn't have paid for it.  I got the cappeloni, and my friends got the spaghetti with meat sauce and chicken alfredo.  All of us thought the food was tasty!  I went there because I saw a bunch of 5 stars on Yelp, which has yet to fail me, but I don't think that it was as good as people on here are saying, which makes me think that some of the reviews may have been planted??  Cue ominous music."], ["Richard W.", "What a great place to eat! The food was fantastic. Traditional dishes passed down from family recipes with wonderful preparation and beautiful presentation. I opened up with the focaccia, mozzarella and tomatoes. It was beautiful on the plate and had a special pesto sauce that really added a great taste. Next with a house salad with a really nice dressing and very fresh greens. The baked ziti and meatballs were fantastic. Great texture and a wonderfully creamy meat sauce. Dessert was a great finish with cappuccino pie. I also was fortunate to taste the carpaccio appetizer as well. Very nice presentation with a soft dijon sauce.The real jewel of Aventino's is the family behind the food. These are people who love to make an evening special. The passion for the customer and the desire to make the best food makes this a great place to spend an evening. You won't be disappointed!"], ["John L.", "I would walk a mile through broken glass to eat their carpaccio!!"]], "BRAVO! Cucina Italiana": [["Monie H.", "We were introduced to the food at this restaurant at a Yelp event, so of course, we had to patronize :-)The service was excellent and the food was great!  The bread sticks are over-the-top yummy!  (We could have easily eaten another bread basket, but wanted to leave room for dinner.)We enjoyed the Braised Beef Ravioli and BRAVO!'s Classic Grilled Pork Chop.My ravioli was good, but I would have thoroughly enjoyed it had the beef been spicy. I do like spicy! There were very nice pieces of tender cubed beef in the ravioli, and that did pair well with the sweet potato, fresh sage, and champagne brown butter sauce.My husband's mashed potatoes were creamy and buttery like you love mashed potatoes to be.  The pork chop was a tad overdone, but the we loved the grilled taste.  We were expecting a balsamic glaze, or some other Italian glaze on the chop, but the glaze tasted like it had a touch of soy sauce in it.  It wasn't bad, just didn't quite fit an Italian restaurant.Dinner portions are large and quite satisfying.My only other very minor complaint is that salad is extra.  I always like a small side salad to come with my meal.During the week, we noticed that this restaurant does have nice Happy Hour offerings, so we'll have to hit that up in the future."], ["Eric T.", "A long overdue review. I came here with the Mrs. for dinner to celebrate my 40th birthday with the expectation that I was just going to have a very good dinner and be stuffed like a Thanksgiving turkey for the rest of the night. I left the restaurant with those same expectations exceeded, less full, and pleased at the same time. Here's why in brief.First, we were given the option of ordering off of the menu, or in having the chef (Scott) go completely off the book and make whatever we had a taste for. We opted for the latter, which turned into a creative fusion of asparagus & shrimp appetizers, a fist-sized salad with homemade vinaigrette, and 5-ounces of salmon and scallops that concluded the first three courses of a four course meal. The dessert was a very rich tiramisu with chocolate covered strawberries, followed by a second glass of red wine that I cannot pronounce yet had an early 2000 era vintage. As well as the red wine tasted with the three courses, it tasted even better with the tiramisu!Chef Scott, as well as his staff, were unbelievably attentive throughout the evening. So much so that the two of us would get the occasional stare towards our booth from patrons wondering why we were receiving the Queen Elizabeth treatment. The interior decor is quite decadent, if not mesmerizing when you consider an evening meal after 7 PM and with the lights turn down a bit, the music smoother. This is one of those places that you just don't ever want to leave. So glad that its in the Hulen area, right over the bridge. Thank you, Bravo! Cucina Italiana!"], ["Santanu S.", "Having attended an event here several weeks ago, I was very eager to try their regular menu. It was definitely worth the drive from workFor starters, there was no wait for a table when I arrived. I was seated  very quickly. As soon as I sat, my waiter came by to get my beverage order. My initial thought was a glass of chianti, so I got the San Fabiano Chianti.I told my waiter that I was interested in something flavorful. The Broiled Talipia with the Spicy Tomato Sauce was the lighter of the two recommendations. I ordered the Caprese Salad as the light salad would complement my entree.The salad did not disappoint. If there were any more mozzarella cheese and tomato slices, the salad could be a meal in itself. There was the right amount of balsamic dressing not to overwhelm the flavor of the cheese or tomatoes.What can I say about the tilapia? First, it was delicious even without the sauce. Since it wasn't drowning in the sauce, the fish could be easily be eaten without it. Because of this spicy sauce, I noticed I ended up finishing the entire plate, vegetables and all. Yes, I finished every piece of the couscous, zucchini and green beans.Now, when it comes to dining at an Italian restaurant, I always order the tiramisu. Well, did you know there is a dessert flight?! Yes, three small desserts which consists of a vanilla bean creme brûlée, a chocolate/peanut butter brownie, and Bravo's take on the cannoli. Choosing a light salad and a light entree provided plenty of room to eat the three \"mini\" desserts.The only mistake I made was eating the focaccia bread which is placed at each table. Like the Lay's potato chip, you can't eat just one. Fortunately for me, the salad arrived when I ate the second piece of bread."], ["Becky K.", "This was my first yelp event and I must say it was a lot of fun. Not knowing anyone and not bringing anyone with me I thought I would be alone. I ended up at at a table with some really cool chicks who made me feel really welcome. The waiters/waitresses came around very promptly for drink orders. They had choices of beer, wine and sangria. Sangria was good but very sweet. They then passed around delicious appetizers of; fried ravioli, shrimp, and mozzarella meatball sliders. They also had a buffet of pizza, chicken flatbread and tomato/basil and mozzarella crostini. While having a great conversation with my new table friends they brought out the desserts; creme brûlée, chocolate mousse and tiramisu. The creme brûlée was creamy and luscious. The chocolate mousse was delicate and rich. It was heaven in a cup. They had a raffle and a lot of other free items for guests. What a great way to say thank you to their yelpers. Thank you to everyone who put this wonderful event together."], ["Hailey G.", "Thought I would update my review since I've been here a few times since my original post. Bravo continues to be one of my favorite places, EVER! I've read some reviews about bad service and things going wrong with the food? I guess I've been extremely fortunate to have amazing service every single time! And our food is always delicious! Tonight we started with the Shrimp Napoli, like always, and you MUST order this dish. Fried shrimp with an amazing lemony-tomato sauce. Yummmm. Then I ordered the lobster ravioli and the lobster bisque. I have a little love affair going on with lobster if you can't tell. The bisque is probably the best one I've had! So good. And the ravioli is always top notch. My bf ordered the veal parmesan (at least I think that's what it's called) and he loved it. Also on this trip we tried out the patio for the first time. We will be sitting out there from now on when the weather is nice. Service was once again great. We'll continue to come to Bravo for many many more dinners, it's our go to place if we want guaranteed awesome food."], ["Krista R.", "Bravo is somewhat new to the Hulen area. A few years ago, the Covey closed its doors and Bravo replaced it. Bravo has a classy feel to it without being classy. Good for groups, families, and a date! It's pretty on the inside. It has a bar with an oven in the middle of it.This was our second visit. Our first visit, was when the restaurant first opened. I remember having the grilled pork chops. They were bland and didn't have much going for them. I told my husband I wouldn't eat here again. However, I kept hearing good things about this place. The Brunch is supposed to be really good. The husband wanted to give it another try again, so why not! Everyone deserves a 2nd or 3rd try. You start off with bread with an oil based dip. My husband got the Sausage Tortelloni. I got the Grilled Chicken Marsala. The grilled chicken marsala wasn't on the lunch menu, but the waiter said they would be able to make it. He asked if I wanted a single breast or two, which I appreciated because I didn't think I could eat two. It comes with mashed potatoes and fresh vegetables. Their fresh vegetables were just green beans. I also got the Insalata Della Casa salad. I didn't really care for the salad. It was just lettuce, tomatoes, cucumbers, bacon, and crispy things with Parmesan dressing, so I don't really know what it was. I just wasn't feeling it. I was pleased with my grilled chicken marsala. Plenty of mushrooms! I liked my husband's meal as well.We had the white chocolate bread pudding and it was delicious! Bravo is a chain, but the food is freshly made and it didn't roll in on the Lisanti food truck. It's much better than Olive Garden, I think. When my Grandma wants OG, I will try to steer her into the direction of Bravo! Last visit, I would say was 1-2 stars, this visit is about 3-3 1/2. We will be back =)."], ["Linn P.", "Came here for a family lunch. Food was good. Everyone seemed to enjoy the food. The bread they brought out was delicious. Dining area was very nice and pleasing. Service was good. I don't remember liking my dish too much. But I did get to sample some stuff at an event recently. Tried the white peach sangria.  Sweet, light and refreshing. delicious!  Tiramisu was good.  Creme brûlée was even better! Chocolate moose was good.  But not a fave.  We do want to come back and try some more dishes."], ["Brian J.", "BRAVO! Great food, refreshing drinks and friendly service.  I attended a Yelp party there tonight, and we got to experience several appetizers, drinks and desserts.  My favorite was the Napoli shrimp.  Fried in a light batter and served with an outstanding sauce, these were really delicious.  The fried cheese raviolis came in second place.  Crisp, warm and gooey, with a spectacular alfredo type sauce.  The bruschetta were solid, especially the mozzarella and tomato version.  They had a unique flatbread that was delicious, it was either leeks or green onions.  Clearly I would fail the blind taste challenge on Hell's Kitchen.  I was abel to taste a Revolver Beer seasonal called Sidewinder.  \"This extremely Pale Ale has a unique blend of regional flavors. It's brewed with agave nectar, citrus, maize, spices and finished with Citra hops.\"  Yeah, that is just a fancy way of saying it really hit the spot on a hot day.  Light but flavorful to max.  Lastly we had a dessert sampling, the creme brûlée was crisp on top and decadent in middle.  The best part of the evening was meeting some new friends and connecting in person with Yelp friends.  Thanks everybody involved!"], ["Anna M.", "What a great place! It's located in one of the more fancy areas of Fort Worth, so I was so excited when I pulled into the parking lot while my stomach rumbled with extreme hunger, which BRAVO! more than satisfied! First of all... oh my god... their Crispy Mozzarella Ravioli! Those little bites of heaven are DELECTABLE! They're partnered with a creamy horseradish sauce that perfectly compliments the dish. Then I was fortunate enough to try out the Chicken, Spinach & Bacon Pizza. It was absolutely delicious. It's a little pricey, but definitely worth it.For my beverage I had their special White Peach Sangria. This is a perfect drink for Summer. It was sweet (but not to sweet), cool, fruity and refreshing. Each glass was garnished with a piece of orange and strawberry. Now on to the ambience! I sat at out on the patio, which was a GREAT decision. The area is filled with plenty of seating, including cushioned benches and cushioned chairs surrounding a giant marble fire place. There's also plenty of ceiling fans, so even if it is a little toasty outside, it's bearable. Their staff was very nice and attentive to our table. All of them were so professional looking in their button up white shirts and black pants.I would definitely recommend BRAVO! for anything from a casual date to a fancy business dinner!"], ["Brian B.", "We loved Bravo!  Decided to visit at the last minute after reading reviews on Yelp. Had a great glass of wine then we had the Bravo Pasta and the Grilled Salmon Pasta. Both were delicious!  The grilled salmon was one of the best I have had. My wife finished off the dinner with  a dessert that was fantastic! (Tiramisu)Great dinner and we highly recommend."], ["Lola M.", "We had a great dinner celebrating my hubby's birthday!  The food was delicious and our waiter, Konner was awesome. He even got a complimentary dessert for his birthday!"], ["Chelsea R.", "They have a nice variety of items on the menu, everything from salads to tasty looking pizzas and rich pastas. An Italian lover's comfort food dream! I was feeling like something light and ordered their Italian wedding soup...just from reading other Yelp reviews it sounded delicious! It had flavorful broth and huge chunks of meatballs...happiness. I also tried some of their garlic bread with some zesty kind of oil dipping sauce. Decadent! I can imagine this would be a great place to splurge on dessert too! They have excellent cocktails and wine as well if that is your fancy. Good place to plan your next hot date for sure! Whether you sit inside or on the elegant patio you are in for a real romantic treat."], ["Joelle F.", "Went here for a mid week lunch with some friends. Blown away! This place is very fancy without the high price tags. The staff were super professional and attentive, never let our drinks go empty and always kept checking on us. The food was delicious and the portion sizes were huge! The Chef even came out to make sure our food was ok! We got the burger and fries, the chef even sent out more fries, free of charge, as a few had fallen off the plate, a chicken salad (enough for two people) and chicken and potatoes with asparagus. We we all too full for desert, needless to say, we wobbled out of here. I'm a huge fan of this place, and will definitely be back to sample more of the menu!"], ["Melissa H.", "4 rating is for ... the best thing (by far)  I have eva eaten at Bravo!! My new signature dish minus tomatoes and feta. Exactly what the doctor ordered since I was so undecided on what I wanted and from where. I also love the Italian wedding soup. 4 for the drinks ... They are scrumptious!! 3 for Service ... It's ok nothing to write home about. Good neighborhood spot.No stars ..: One thing I did notice is the bartender placed used Napkins on the counter back in the holder. I told her they were dirty and she put them back in the dispenser anyway. Not Kool. Don't use those napkins to wipe your face."], ["Jennifer W.", "I don't get all the high reviews. Finally tried Bravo! on Sunday evening - it was slow so we were seated very quickly, and our waitress was quick. So, that's good. My mom was having trouble deciding her meal, so we had to keep asking our waitress to come back. As so often happens with this situation at nearly every restaurant I've been to, there is that one-too-many \"come back in minute\" request that ends up waiting far longer than necessary. In this case, it was the same - we were decided for a few minutes and our waitress was busy chatting at the kitchen. I had to wave my arm to hopefully get attention of someone, who turned out to be the manager.Menu options were \"ok\". As a vegetarian, I was remiss to find that unlike most other Italian eateries, there were only two non-meat dishes. And, unfortunately, neither of them was appealing to me (I don't like eggplant [parmesean]; and I don't like sundried tomatoes + pine nuts + feta combinations - it tastes like throwing up in my mouth). Everything, aside from the salads and a margherita pizza, came with meat. There was no plain old spaghetti, primavera, ravioli, etc. I suppose if this is Roman food, that maybe they eat a lot of meat. The waitress said I could just tell her what I wanted and they'd make it (though, I didn't know what I wanted, just what I didn't want). I do allow myself to eat seafood in a pinch, so instead of inventing something I ordered a spicy scallop entree. It was super \"meh\". One thing I found odd: they put breadcrumbs on many items. I thought my entree would come out like a baked dish with the breadcrumbs a little crust on top, but no... it was a very juicy pasta dish with the breadcrumbs seemingly out of place atop the pile. Scallops were overcooked. Everything was soggy. Even the leftover container leaked severely on the ride home.My dad had the chicken caprese - said it was ok. He thought the balsamic vinegar on it was odd. My mom got the lobster ravioli, and thought it was good. It was a lot and she could only eat a fraction of the serving.The pre-dinner salads were ok. My dad and I each got the chopped which was tasty, but slightly overdressed and thus a bit more macerated than I'd hope. My mom thoroughly enjoyed the Caesar. Yet... we were barely finishing our salads when our entrees came out. This is a *huge* pet peeve of mine. When you have to shove all your plates around because the staff couldn't time your meal correctly. My mom wanted to finish her salad so she had to cram two plates in.. The waitress never blinked or offered to come back. Poor form, Bravo.The big rub for me was this: overpriced entrees (really, Olive Garden I think would be better) and you have to add $3.99 for a salad! The few appetizers they offer (really, few) except for the caprese, were all over $10. So, we tried something new. We were very unimpressed, and next time we'll just go to The Tavern down the street which is fantastic."], ["Le E.", "I had a weekday dinner here with a coworker and our experience wasn't anywhere as memorable as other reviewers. She and I both ordered wine and it took several back and forth trips from the waiter to actually bring our glasses. I ordered the lasagna and asked the waiter about the portion size. He suggested getting the smaller size because the diners always take leftovers home from the normal dinner size. Well I took his suggestion and once my entree arrived, it was the tiniest piece of lasagna I've ever seen. It was so sad. Worst of all as we were wrapping up our dinner and paying our tab, there was another waiter standing next to us with broom in hand waiting for us to get up. He literally interrupted our conversation so he could sweep under our table. It was only 9pm."], ["Angelica L.", "My boyfriend and I got dinner togo from here last night. I got the grilled salmon salad and he got the chicken scaloppini. The food tasted good, but the descriptions on the menu were misleading. My grilled salmon salad was supposed to come on a bed of field greens but what I really got was a thin layer of field greens layered on top of cheap iceberg lettuce. I don't know if they do this when you dine in, but it is completely unacceptable. My boyfriend's dish had good pasta but the chicken was just ok. We both really loved the rosemary bread but we wished we would have gotten oil and vinegar for dipping instead of some tomato oil dip. Overall the meal was ok. The thick layer of iceberg lettuce under very little field greens on my dish really put me in a bad mood about this place."], ["Susan S.", "I wish there was a BRAVO! in Arlington. I LOVE this place. Excellent food, service and atmosphere. Can't beat it."], ["Dave M.", "Excellent service and the food is very good. The menu selections are well done. They do an excellent job on the pizza.Overall, you will always enjoy your experience at Bravos"], ["Chuck M.", "I got introduced to this place through a YELP Elite event. I have also dined at their sister restaurant, Brio, in Southlake. I was in the area for lunch and decided to stop in and dine. I'm glad I did.My meal started out with warm bread and an olive oil infused with different spices and peppers. I ordered the 1/2 order of lasagna accompanied with a 1/2 order of my choice of salad. I decided on Bravo's Chopped Salad.My salad was delivered to my table shortly after ordering. It consisted of chopped iceberg lettuce, tomatoes, cucumbers, feta cheese and a very tasty vinaigrette.Shortly after finishing my salad, my entree was delivered to my table. Bravo's lasagna was very delicious and packed full of meat. It was layer upon layer of gooey goodness. I can't wait to return to Bravo again real soon to explore more menu options."], ["Jennifer Y.", "Basically, a glorified Macaroni Grill. The food was way overpriced for the quality. Typical chain Italian restaurant, but a bit more pricey than Olive Garden or Macaroni Grill. Service was slow to start, but overall no complaints."], ["De M.", "The best food, ambiance, price and service. Can't go wrong with this restaurant. Love it!!!"], ["Justin B.", "Had the Grilled Chicken with Balsamic vinaigrette. It was ok, not amazing. Price was reasonable. What I did not expect was to go to a $12+ a plate Italian Restaurant for lunch and be seated 3 feet from a 1 year old's birthday party. Complete with noise makers. There was room enough in the dining room to have separated \"regular\" patrons from the 1 year old.  They probably should have done that. I won't rush back, but I wouldn't refuse to go again if that is where the group wants to go."], ["Cheryl S.", "Ok I'm not gonna lie, you feel like you just stepped into Rome, Italy in this place.  I'm pretty sure I want to have them come decorate my crib when they get a chance and if that wasn't enough to make you want to fall in love with this place, then the mesmerizing smells coming from their brick oven pizza will definitley take you to paradise.  The staff is friendly and eager to serve you.  Check, I like!  The dishes are top notch and consist of quality food.  Check 2, I really like and oh yeah it's close to my crib, uh I mean house....Check 3, done deal!Check out their great happy hour menu of food and drink specials and their dinner dishes do not disappoint.  It's on the pricier side but you will savor every delicious bite, trust me.  The spicy encrusted planked salmon with scallops will make you feel like it was prepared just for you and the veal scallopini will give any Italian woman a run for her placement in the family.  And you know what family I'm referring to! I suggest you come check it out for yourself and when your there, I understand if it might be too hot but if you dare to step outside, you will feel like you are in a 5* resort with their beautiful outdoor seating.  I'm just waiting for them to close so I can get \"locked\" inside and pretend I live there for a night! A lot cheaper than going to Mexico ha!"], ["Kerry M.", "OK, so for me, it's all about the service. Let me start out by saying that the food was good. Lobster Ravioli and Pasta Woozie (a chicken pasta dish) was eaten by me and my girlfriend. No complaints about the food. Service was horrible by standards for this type of restaurant. We elected to sit at the bar and eat there as we arrived at almost 7pm and the place wasn't packed, but we could easily sit there immediately and typically get much better service. Wrong at this place. The Bar tenders (Robert and Andy, whose names we didn't find out until AFTER dinner had been served) waited on people on both sides of us, while we sat there and patiently waited almost 10 minutes to be spoken to, then a quick drop off of menus and to tell us he'd give us a few minutes to look over the menu. Almost 10 minutes later and waiting on just about every other person at the bar, some twice, Robert graced us with his presence, no small talk, how are you doing tonight, etc. just What can I get you? Fine, I know he's busy, White Peach Sangria for the girl and a Peroni for me. They are out of Peroni so he has to run to the back to get some (doesn't tell me this, just takes off). Ends up after Andy made the girls drink (Which was AWESOME!) here comes Robert with a 12 pack of mildly cool Peroni from the back. Opens the bottle and places it in front of me, while walking by. Now every other person at the bar is drinking from Cold Glasses. Doesn't even offer me one. I suck it up because it's semi cool. (Really Strike 2 at this point). We get our dinner and the food is fine, we have to ask for Bread, we weren't offered any. It just seemed like we were invisible to the bartenders. The only interaction we had with Andy was when Robert asked him to make the White Peach Sangria while he ran to get Peroni. Next strike came when I asked for another Peroni. It came out of the same 12 pack carton sitting on the shelf, 20 minutes later that still hadn't been placed into the cooler. I asked for a cold glass (Like everyone else had been offered) and while I saw him look in the cooler and didn't see any glasses, he came up empty, no cold glasses available, they are out. A few minutes later he must have noted the disgust on my face and finally decided to place some Peroni into the freezer and made a point of letting me know he was going to place some in the freezer for me in case I wanted any more. Sure enough, 15 minutes later I asked for another. This time in the back, there was also a magical frozen glass to be found, that apparently wasn't there before. Halfway through drinking the last beer from the cold frozen glass, I then noticed that the glass was chipped on the top with a razor sharp edge. Last straw. I did mention to him that he should probably throw away the glass as we left after paying the bill and while I offered up a meager 12% tip (I've had bad days before as well), it was nowhere near the normal 25-40% and higher that I have been known to leave for excellent service and food. Ya know Bravo! Managers/Servers/BarTenders/Owners, it only takes one bad experience to turn someone away forever. I for one will never be back. It was simply a horrible service experience and having been a bartender in a past life, simply inexcusable. Sorry Robert and Andy (Bartenders), last night was not fun for me and my girl and I hope you get the direct message, because I'm certain without a doubt you know exactly the couple you dissed with your poor service."], ["Stella W.", "We walked in last Sunday a few minutes after 1pm and there was still about a 15-20 minute wait for a table inside. The nice hostess suggested that we could sit at the bar immediately without any wait, so we decided to do that. The bartender, Ashley, immediately introduced herself and her other co-workers to us. We had the Mimosa and Peach Bellini (frozen) from the bar. I personally loved the Mimosa because it was a nice change to have it made with freshly squeezed orange juice instead of the concentrate. We were having a hard time deciding on the appetizer and Ashley was nice enough to suggest the Margherita Stuffed Flatbread which we loved. I loved the Grilled Salmon Pasta that I ordered from the \"Lighter Side of Rome\" menu.  Everything on this menu is 550 calories or less. The salmon was perfectly cooked and the veggies were so fresh and tasty. The sauce was just right and not too oily or creamy at all. My hubby liked his Pasta Pomodoro with Chicken too.  I had a taste of his chicken and liked how tender it was. All the dishes were perfectly seasoned and not too oily or salty at all. We didn't get a chance to try their desserts but Ashley said that the Cheesecake and Crème Brulee are a must try. I forgot to mentioned that after we had our appetizer and was waiting for our entrée, the manager actually came over to apologize about how long our main courses were taking. We didn't even say anything at all and had only been waiting for about 10 minutes.  Therefore, we were quite surprised that she noticed and was so nice about it.  I can't believe that this restaurant just had their grand opening on 8/1, because they definitely have everything down already.  Final Verdict: Everyone must come and give it a try.  They have Happy Hour every Monday-Friday from 3:30-6:30pm."], ["John C.", "I particularly like Bravo for their brunch.  I have had the Tuscan omelette and the turkey sausage eggs Benedict and they were both excellent.  Also I cannot leave out the doping bread which is great.  The employees are very friendly and accommodating. They also have a dessert made up of small samples that is great for sharing.  Highly recommend Bravo!Added 9-10-15:  We have continued to go to Bravos. The menu has changed twice and food is still very good. They will fix items from past menus.  Really like the place."], ["Ashley L.", "Overall this place is delicious and at a very decent price. The bread, stuffed pepperoni flatbread, and chicken pesto Spaghetini was superb! Staff was nice and didn't take much time at all to get our food. Would surely go back again."], ["Jason E.", "Terrible service. Mediocre food. Host did not speak. It took 10 minutes for server to arrive. We only saw her once after ordering. Had to find someone else to bring our check. I ordered the pasta primavera and there was stray beef in the sauce. A busboy carried a large bag of trash out in between several tables of diners. I asked for a manager when we left and it took the hostess 10 minutes to find one. The manager thanked me for my complaints and apologized. We will not return."], ["Jon W.", "Bravo is to Italian dining as Frank Sinatra's golden pipes are to a croon-fueled seduction. I have proof.  I'm sure everyone has already attested to this new restaurant's supreme food quality as well as the classy modern ambiance. What I'd like to point out is the exceptional management and staff. At the height of dinner rush with a line out the door this place is fun and festive with staff that are calm, collected, fast and efficient, not to mention fun. This is a staple in our Fort Worth dining arsenal now. The chicken pesto was a delight (picture provided). We experienced exceptional creativity and quality in both our low cost appetizer and our moderately priced entrees. What a great value and a classy experience. You stay classy Bravo."], ["Luis D.", "If your looking for a step above the Olive Garden, then this is it.  If your looking for fine Itiaiian dining, then keep looking.  I say this only to point out that this is a nince place with really good service, but it has a Cheesecake Factory feel to it (which is OK if thats what youre looking for).  The food was ok.  Members of my party had the lobster and said it was good but not great.  Another had the veal parm and he raved about it.  I had the chicken scaloppini on the recomendation of the waiter, and it was ok, but I would not order it again (and to me that is the true test).  Drinks were OK, and I will also say that everything came out really fast. Almost too fast, cause it made us wnder if the food was being prepared fresh or just re-heated.   The taste was good and I don't want to sound displeased, but I guess I was expecting more, maybe too much. I will return and give it another chance, buut next time I won't let the waiter talk me out of my first choice."], ["Hunter J.", "Great atmosphere . Lively crowd!  Great server from Mass and knew his stuff!Food just okay."], ["CubicleGuru.com '.", "This place was great! From impeccable service to the best Egg Plant Parmigiana I've ever had!! STRONGLY RECOMMEND!!!"], ["Tyler V.", "Awesome patio with great salads!  Could get more beers on draft though they make up for it with their wine pairings and bilinnis"], ["Nagendra A.", "The food is amazing!!!!! I'm a vegetarian and I had lots of options. The roasted vegetable pizza is to die for!!!! The food was delicious, had amazing flavors, people were nice and the ambience, all together makes it worthy to visit. It was a great experience. It's officially my favorite restaurant."], ["Josh H.", "After the ELite event the other night, my new friends and I sat down and had some dessert from the menu.  WOW!!!!  Our server was incredibly sweet, maybe sweeter than the desserts, and very efficient.  The setting was a great place to have a good conversation.  Not too loud or distracting.  The desserts were amazing.  I got the Tiramasu and holy moly it was good!  My friends got the apple bread pudding, and the creme brulee sampler.  Both delicious.  I ordered an appetizer to go, the Mediterranean flatbread, and enjoyed it for lunch the next day.  This is a great place to eat!"], ["Tedi T.", "I LOVE this place.  The food is delicious and the service is outstanding.  They have $5 wine Thursdays...all night long.  And it's decent wine...not Yellow Tail.  They do the same on Wednesday's w/martinis. It's a beautiful \"Tuscan\" decor.  I love just sitting at the bar.  The staff at the bar couldn't be more friendly and gracious."], ["Lauren S.", "I went to a Yelp Elite event here last night and our group enjoyed the samples so much, we decided to stay for dinner. Our server Megan was very accommodating, answered all our questions and even brought us samples of the different sauces so we could decide on entrees. I enjoyed the della casa salad- thanks for the recommendation Heather! My fra diavolo was very creamy, not a traditional sauce. I could have used more crushed red pepper to turn up the heat! We all shared some desserts, tiramisu and creme brulee. The brulee was my favorite. Total for my party of 2 with alcohol, entrees, dessert and coffee was 60$ before tip. I would recommend this place if you want a more upscale italian feel without the upscale pricing."], ["Yale Y.", "Pepperoni Pizza was excellent."], ["Somchai I.", "i love wine! its just so classy lol. it got the atmosphere going! its like when you go to a party and theres a keg, you think yeahhhhhh frat partyyy or whatever lol. but this, would you like red or white? and its uhhh yes please! lolthe food was sooo good, i was so sad it was ant sized hahaha little ben stiller joke there. the meatball burger thing was very tasty and the flat bread. i freaking love spinach dip so im very biased when i see that lol!!i liked that we were kinda dressy for this! we need more! although im always dressed trashy lol!THANK YOU KENDALL!! for letting me be apart of this and taking like a million buttons lol!! i want one of each kind!!!! cant wait to see everyone in december!"]], "Alba's Italian Restaurant & Bar": []}