{"Opa Mediterranean Cafe": [], "Terra Mediterranean Grill": [], "Café Medi": [["Sasha L.", "I'm officially obsessed with Café Medi and would urge anyone who enjoys greek food or wants to try it for the first time to check this place out.The service is top notch. While Chaz has been an EXCELLENT server for both my visits, the whole Café Medi crew comes by the table to clear plates and make sure you are happy with your experience. The food is authentic, plentiful, and delicious. Each entree comes with either a soup or salad, the lemon rice soup is my favorite. The hummus makes for a great appetizer and is nice to have with a meal to dip meat in. However, the meal also comes with some great dipping sauces. Make sure to come hungry, because they aren't stingy with portions! Thanks again to Chaz and the rest of the staff for creating such a great dining experience, I'll be sure to stop by whenever I'm in town!Note: This is a BYOB restaurant. Conveniently, there is a liquor store nearby."], ["Jennifer M.", "We came to celebrate my husbands birthday and were not disappointed.The staff is very polite and friendly. The owner came and checked on our table and chatted with our children. He was very kind and even promised our youngest dessert if he finished his dinner. I had lemon rice soup, which is delicious and a must have when here; and the vegetarian plate, which was wonderful as well.My husband had the Greek salad, followed by Moussaka. He had absolutely no complaints. Dessert was Tiramisu and Baklava, which was shared around our table and enjoyed by all.We can't wait to go again!"], ["Thuy N.", "Had the gyro lunch plate $10.. Kinda pricey.  They babus eggplant dip was good with the pita. Decent but has better.. will stick with Andalous grill or buffet at that price"], ["Billy G.", "Ate here last night.  Had the humus with some kind of fried fire cheese.   Definitely an acquired taste but service was good.  Hookahs were smooth.  All in all very enjoyable"], ["Michael I.", "I'm a very picky foodie and I was amazed with the vegetarian platter here but can't speak for the meats. I got the vegetarian platter with cucumbers \"not pita\" to dip into the hummus etc.. Very authentic!!! Very satisfied would come again.  I had a bite of the pita bread and wasn't impressed at all actually was terrible from what I've had from other places."], ["Carlie M.", "Pretty reasonably priced decent Greek food. Had the gyro entree for lunch. Rice and meat were both good, green beans were a tasty surprise. Very strict about substitutions so I didn't try it since I like to keep my lunches at $10 or less. Would have succeeded but I really wanted to try the baklava. Not bad. Good sized portions of everything for sure. Asked for a box for my leftover pita, and the waiter insisted on bringing me a fresh order free. Service isn't amazing but no specific complaints. I'd come back here."], ["Jennifer S.", "This was our first experience at Cafe Medi but it won't be our last! My husband and I had a craving for Greek food, did a little research and came up with the idea to try this little gem. The space is cozy enough with a cute little enclosed patio for nicer days. We ordered the arayes for an appetizer. We had never tried this dish but the description sounded delicious and it was! We both had soup with our entree. Lemon rice for me and mushroom for him. Again, delicious! By the time our main course came we were pretty stuffed with not only the appetizer and soup but the copious amount of pita we had already consumed! Wish we would have thought to ask for a little olive oil to dip the pita in but it was very good anyhow. The gyro plate was heaped with a very generous amount of meat, a little pile of fluffy rice and some not-so-appetizing looking green beans. The meat was tender and flavorful and the rice so light and fluffy. I didn't touch the green beans because they really looked like a can had just been dumped on the plate (very weird). We had so much food we ended up taking 2 boxes home with more pita for a complete second meal! All in all the prices were very fair for the amount and quality of food (sans the green beans - my only complaint). Super delicious. I totally recommend for anyone craving some Mediterranean cuisine!"], ["Kimmy B.", "Wanted to try Mediterranean food here in the area, And I'm originally from Houston. I took my friend with me and he's never had food like this. Appetizer, we had tzatziki and spanakopita. They were both great, eseckally with the fresh pita bread. Lemon Rice Soup is amazing. It's a must have and must take some to-go.For entree we had the lamb shank and a chicken and beef shawarma combo and beef souvlaki. Lamb shank was very tender and meat came right off the bone. The combo we had with the beef souvlaki was great also. Especially with the sauces it came with. Am the entrees were delicious. Service was fast and great! Definitely will be coming back."], ["Nicole N.", "First time coming here and I love it! I had the chicken shawarma lunch plate. It looked like a dinner portion! And they also give you your choice of a soup or a salad. Very filling and delicious! The garlic sauce that comes with it is to die for! Can't wait to come back and try more things off the menu!"], ["Jim S.", "I've enjoyed their food for years. My favorite is the Souvlaki lamb. The food has been consistently good as is the attentive wait staff. This is a BYOB restaurant and they are happy to provide pouring service."], ["Josh H.", "Absolutely the best Mediterranean food in Tarrant County! The waitstaff is fast and friendly. I had the beef tenderloin and my wife had Tilapia. Both were outstanding. I couldn't believe how good the whole dish was. One of the best meals I've ever eaten!"], ["Matthew N.", "Came here for dinner and I ordered the hummus, calamari, lamb shank, and mixed grill, which is a 3 meat combo. The hummus was good and the bread was nice and soft. The calamari was battered well. I like that they served it with the tentacles. I thought the portion of the calamari was small, compared to most restaurants.  The lamb shank was delicious. It was well seasoned and the meat was nice and tender. The mixed grill was good. The beef and chicken was tasty, but the kabob would have been better if it was cooked a little less.  For dessert we ordered the Tiramisu, which was great, for a Greek restaurant."], ["Jen D.", "I love this place so much. It's become a part of my rotation and I've brought many friends here who don't live in the area.   They all RAVE about the food.   I've never ever had a bad meal here. Bring family bring friends bring Co workers. I will die if they ever close :)"], ["Tiffany J.", "Great Greek salad!! The best! The lemon rice soup is also great. Great atmosphere as well"], ["Linz N.", "We shared the vegetable appetizer platter of pita, hummus, dolmas, falafel, an order of tzatziki and it was all fresh and delicious.  The gyro meat on my salad was tender--will be ordering again!  This place is BYOB, so we will be coming back for dinner."], ["Shantai I.", "I love this place - the greek food is great and the staff is very friendly. I had the gyro with rice and green beans - every thing was very good."], ["Melissa G.", "This place is fairly close to work and I love coming here for an occasional lunch. Their lemon rice soup is amazing and both the Gyros and Chicken Shawerma plates are amazing! The service is mostly good but can be a little hit and miss when they are busy. I will definitely continue going back here! I hope to try the new Keller location soon as well."], ["Pat Q.", "Food was delicious.  Atmosphere was great. Service was good, friendly but a tad slow; not the server but the food coming out from the kitchen.  However, the portions are very generous and tasty so that trumps a little linger wait for quality.  I ordered an appetizer of dolmas to split with my friend.  There were 5 or 6 on the plate and large sized.  They don't scrimp on portion size.  Then I enjoyed the grilled chicken dinner that was served with a fresh Greek salad, rice and green beans that were really well seasoned.  I can't wait to come back and bring my husband.  Perhaps after my next visit I will up my rating to 5 stars."], ["Ken W.", "First time dining here. Pleasant atmosphere, very good food (4 1/2 stars worthy). The service leaved something to be desired. We only ate half our dinner (save the rest for later). We sat waiting for over 20 minutes for our server (Chaz) to see if we needed anything else. I wanted desert, but with waiting so long... I decided I would skip desert. Will we come back??? Maybe."], ["Kim G.", "AWSOME food device and atmosphere! I try to eat healthy and this place has great salad! Great lunch place"]], "Istanbul Grill": [["Andrew W.", "This was some of the most amazing Turkish food I have had. It was even better than the food we would get in Berlin. Absolutely delicious grill flavor and seasonings. Meat cooked to PERFECT temperature. Nothing was overdone or dried out. The hummus was tasty but not the absolute best I've had (a little thin). This spot is authentic and even though my water sat empty for 10+ minutes I almost didn't care. Americans can't stand going 5 seconds without a drink but my global traveling experience has taught me that most non-American eateries don't place too terribly much emphasis on the meal beverage. It's a part of the cultural divide, and it doesn't even deduct a single star for me."], ["Shee R.", "Liked their Ezme and falafel plate (comes with grilled veggies, tabbouleh and hummus) .Nice. If you have not tried their Ezme, you must, it comes with really nice pita bread. Their pita bread alone was  so yummy."], ["Jenny M.", "This place is an amazing little restaurant on Cooper. Love that it's BYOB first of all. I had the falafel plate and everything on it was amazing. Hummus is so wonderful and smooth and falafel was perfectly crispy.My husband had the lamb Adana, which he really enjoyed as a meat lover and veggie hater. We of course had to end with the baklava and it didn't disappoint! Wonderful meal and excellent service!"], ["Juanita J.", "I went to this restaurant after reading the reviews.  This is hands down the best restaurant I have ever gone to.  It was my first time eating Turkish food.  The waiter suggested a dish.  It was excellent, but the food was only part of what made the experience so pleasurable.  The service was top notch.  It was busy, but all the employees still took time to make sure that I had enough bread and drink.  I also didn't feel rushed to eat my food.  I will definitely go back, and try other menu options."], ["Tom C R.", "Very impressive! I began with humus and warmed pita pieces and for my entrée, the Gyro Chicken, which was VERY tender and flavorful. It was served on a bed of rice, with tiziki sauce, cabbage & small salad.I'm no expert on Turkish food but this seemed authentic and ver well done!"], ["Jess M.", "The service is always great: friendly, attentive and helpful servers. The hummus is fresh and has a great flavor. I had the chicken shish and it was definitely good - I would love it to be spicier. (I asked for spicy, but it still needed a kick...but, that's coming from a spicy lover!) Definitely recommend this restaurant. It's easy to miss on cooper because of its location."], ["Thomas M.", "My wife have heard many good reviews and decided to give it a try. We were not disappointed! The atmosphere, the service and food was outstanding. We will definitely be back."], ["Samantha W.", "From the outside when you're driving by on the hellish mini-highway that is Cooper Street, it may not look like much, but once you step inside Istanbul Grill, you're transported to another country.My husband and I have been going to Istanbul Grill for a little over two years now, and use it for all of our special occasions---birthdays, anniversaries, friends visiting. We look for just about any excuse to go back!The decor inside is warm and inviting, and makes you feel like you're in a small cafe somewhere that is definitely not Arlington, Texas. The staff are always friendly and the food always top notch. They don't serve wine or beer, but it's BYOB and the staff are always happy to bring your glasses and uncork your wine.Since we started going to Istanbul Grill, we've tried just about everything on the menu. Some of our favorites are the humus (probably the best I've ever had, and way better than Prince Lebanese's on the other side of Arlington), babaghanoush, moussakka, lamb gyro and chicken adana. We usually try to finish our meal with Turkish coffee and their amazing baklava. ;) We're twenty-somethings who love breaking away from traditional American fare, and highly recommend this place to anyone looking to try something out of the norm!Visited November 2014"], ["Breana C.", "If you are looking for a delicious and authentic Turkish/Mediterranean meal, look no further than Istanbul Grill. It is amazing!! I have eaten here a few times and each time I try something different. All of the food has been fabulous!I had the hummus, babaganoush, and moussaka. Every one them was to die for!I can't wait to come back for more."], ["SM M.", "Excellent food and service. The only reason they don't get 5 is because it is BYOB.I will certainly be back!"], ["Michael S.", "Pretty good.  I had a lunch special with red lentil soup, the Izgara Kofte (Mixture of ground beef and lamb seasoned with, Turkish spice served with rice), and Turkish Tea.  Service was quick and thorough.  The Turkish Tea comes out hot in a small glass, but the glass never became completely empty.  I'd go back.  I'm curious about some of the other dishes now."], ["David C.", "WOW!  I don't say that often at a restaurant, but I've fallen in love with Istanbul Grill.  I took the wife out for a date night and we ended up here.  I'm gastronomically adventurous, however my lovely bride is not, so she was a bit tenuous about eating here.  The first thing we noticed was the linen table clothes and nicely decorated dining room.  It was inviting and gave the impression that the folks here take food service seriously.  A good start so far.  The place was small and cozy and was about half full, but we were greeted almost immediately and seated right away.  The first thing our friendly server asked us was if we had eaten Turkish fare before.  I've enjoyed Mediterranean food many times, but my spouse had not.  The server intuitively deduced that my wife was timid about the food and made a few recommendations.  We ordered accordingly.Everything was fabulous!  My wife has a normally discerning palate, but tried everything on the table and loved all of it, which never happens.  The bill was very reasonable for two appetizers and two entrees.  The combination of service, atmosphere and fare were the perfect mix of a dining experience that makes this place an instant favorite for us.  We will most definitely be back!"], ["Ankit M.", "Must have the Turkish coffee, it's great!The food, specially the kebabs was delicious, however slightly pricier. They serve a side of bread which is awesome!Amongst the sweets, their baklava is simply amazing- tender & sweet as it should be. It's by far the best amongst other Mediterranean place I've been so far.Overall, I feel that this place is 9/10. 1 point less for slightly overpriced main course."], ["Kimberly B.", "Great!  My husband and I were in town a year ago and ate here.  We have been talking about it ever since.  We finally got back fairly close and decided to go out of our way by an hour just to come back again.  We were worried that it wouldn't be as good as we remembered but we were wrong. ..it was just as great!   We got the sample platter and the Hunkar Begendi  (which is the best! )  I highly recommend if you are ANYWHERE close.   The service is amazing too.  The chef heard how far away we are (6 hours) and sent us a free baklava for the trip home.  :-)"], ["Carol L.", "This is one of my favorite lunch places. They have a good lunch menu with an appetizer and entre for around $10. Sometimes it takes some time to get your food so it's not the best if u have somewhere to be right after lunch BUT it's wonderful food."], ["Karson R.", "Definitely not what I was expecting, but that's a good thing :) food was absolutely delicious. I honestly have no idea what's what yet because I've only gotten the sampler platter deal that's like $20 bucks. But it's a lot of food and it's all very good. Highly recommend."], ["Cindy L.", "We finally found a good Mediterranean restaurant!  We have been on the hunt for years!  I had the lamb chops, and they were cooked to perfection, served with a generous portion of delicious rice & freshly grilled veggies.  We came in about an hour before closing, and received friendly & efficient service.  We will definitely be back!"], ["Miss M.", "Their food is beyond amazing.... we ordered Hummas that came fresh with feesh pita bread..Chees Borak (chees egg rolls amazing), Falafel and I ordered my absolute favorit Iskandar Kabab..Loved it was just they way they make it in Turkey!!! My friends ordered the beef sheesh kabab it so tender and amazing..For desert we ordered Baklava and Kunafa wonderfully done...Service is Amazing ...it's a BYOB and we loved it!!!"], ["Monisha T P.", "Love the food!! Great service, most friendly staff.. Perfectly staffed they didn't keep us waiting for any of our orders they were always available...  Perfect ambience.. Highly recommended place for Mediterranean food lovers!! Its by far the best Mediterranean food in Arlington.."], ["Lanny B.", "Dishes are simple but very tasty, at least the ones that I've had. The kabob is quite good and you get a good amount too. The service was good, will be going back to try more of the menu."]], "Byblos Mediterranean Lebanese Restaurant and Hookah Lounge": [], "King Tut": [], "Prince Lebanese Grill": [], "Cairo Mediterranean Grill": [], "Velvet Taco": [], "Opah Greek Flavor": [], "Vee Lounge": [], "Al Wadi Cafe": [["Caitlin G.", "delicious Greek/Middle Eastern restaurant. Our family enjoyed everything, especially the few appetizers we ordered."], ["David C.", "Al Wadi is a small place, out of the way on Brown Trail in Bedford.  Their Lebanese dishes are good and authentic.  I learned about this type of food while living in Africa and these dishes seem as authentic as any I have tried in DFW.  I need to go and try the buffet sometime...but the Meze is very good.  Give them a try."], ["Misty H.", "Excellent food.  I've had both the buffet and ordered from the menu.  Great staff.  Very quite."], ["Sungei V.", "Stumbled upon this gem thats right in the heart of Mid-Cities. Great Mediterranean buffet on Sundays that stays going till 4pm. I really loved the stewed green beans, roasted cauliflower, and even the Greek Salad was great and fresh. Baklava and rice pudding, yum! I have one bad thing to note (which really is no fault of Al Wadi, but rather, just an unfortunate mishap) which is that I witnessed a germ spread! I was lucky enough to have been seated right by the entry to which what would my wandering eyes would appear? A customer decided to sneeze all over the first buffet table....wipe his nose, then proceed on to the next buffet table where he then sneezed on the second set of buffet tables. I was GROSSED OUT!!! but luckily I was finished with my lunch and ready to bounce out of there. My only regret, in retrospect, is that I should have addressed this to the manager...oops!Overall, I highly recommend this place and especially on Sundays =)"], ["Phillip D.", "Interesting location, but is was good when we got inside. We found the entrees to be very well done and presented. It was not very crowded, maybe it was an off time. I was comfortable with everything presented. Good size portions."], ["Rae C.", "Alwadi is a tiny little gem of happiness in the bleakness of the mid cities area. While everything I've had there is a good, you can't beat their prices on their delicious falafel pitas. They are always willing to substitute their  yummy hummus and pita for the french fries it normally comes with. This is my standby for days when I don't feel like cooking, but can't spend a ton of money. Delicious dinner for two for around $10 is pretty much unbeatable.While the ambience isn't amazing, the employees are friendly and the service is good. We mostly take advantage of their super fast take out, but the few times we've sat down to eat we have enjoyed ourselves.Also recommend their spanakopita, and although I'm a vegetarian, my husband loves their lamb. Great food and really food prices - you can't go wrong here."], ["Jose S.", "I go here for the buffet on Tuesdays & Wednesdays. Haven't been any other days, but I'm sure the standard menu is fine since the buffet is so good. Small buffet, but lots to choose from it all tastes great. I love the mama and baba ganoush so much here. The lamb is usually what I go with when I get a serving of meat. Very tender but also has that nice crust on some spots. The rice pudding at the end is delicous. This can al be yours for a little over a 10 spot. I'll reserve the last star when I've tried something other than the buffet."], ["Bryce H.", "This place rocks my socks off. We love Stratos, but Stratos is a world away in Dallas.  We have searched and searched for somewhere to satisfy our Medi cravings...and no we have found it.   We are here almost every Friday, and have yet to have a bad experience.  The lamb, be it on a chop, or on a shank, is phenom.  Fish is de-lish, and the hummus is not to be missed.  The staff is, actually, a notch up on hte delicious food.  Very kind, and they treat us like family.  Dessert is not to be missed.  We usually stick with just a piece of dark chocolate, but the baklava is pretty good, as is the other puffed baklava pastry. (The name escapes me, but it's the only puffed pastry on the menu!)I wouldnt leave without picking up a jar of local honey from Giza, the little Medi store that is attached to the building! So good!"], ["Govnor H.", "If you're looking for Greek food look no more.  The other offerings in the area do not compare to Al Wadi, which is also offers Lebanese fare.  First of all the prices are cheap for what you get, but the food does not taste cheap.  The hummus is really good and VERY garlicky the way I like it.  The menu is pretty extensive and everything I've had here was always good.This place is a little hole in the wall that's hard to see from the street and is next door to a grocery that is probably owned by the same folks as they offer similar foods to cook at home.  Every time I've been in the place is clean and the service is good.  One problem guys is I can hear the microwave beeping in the restaurant!  They're not using it to cook the food, just to heat up the pita bread, but some people might get the wrong idea.  Their menu is online so take a look before you go.With your meal they have a house salad or a Greek salad for $1.75 more.  Trust me, pay the extra and get the Greek salad.  It's very fresh and has lots of feta.  If you're going light you can choose hummus as a side dish instead of fries, which is nice.  In fact I think you can choose any side dish that you want with your meal.  Five stars for what it is, which is good food for a reasonable price.  If you like Greek or Lebanese food Al Wadi is well worth a visit.  It's a nice reprieve from the normal, boring chain restaurants in the mid cities."], ["Kenneth H.", "Impressive Greek food but the good impression stops there.  With little to no ambience, it seems better suited for casual lunch.  If it's dinner out take your wife, or long time girlfriend, not a new date. Pick a nice, cool evening, go casual, with a bottle of wine and sit on the uh, porch.  Or parking lot.  It's a value option that has a fair ways to go to be known for anything more than just good Greek food at a good price.  Found out that the co-owners of the cafe also own the Greek food store next door.  Get inspired and shop after your meal and try your hand at cocking Greek at home."], ["Brent C S.", "I tried Al Wadi for lunch, and the buffet, and the freshness, flavor, and options for a buffet was better than I had expected. Great service, great place."], ["Shane F.", "I love Lebanese food. Having grown up in Dubai, I pretty much lived on the stuff for almost eighteen years. And so, every now and then a strong desire for arabic food settles in. Before returning to cowtown from a meeting in Dallas, I looked up restaurants along my route. Seeing how well reviewed Al Wadi was, I decided to give it a shot. I placed an order for two crucial dishes: Chicken schwarma, and sambousik (paired with hummous). Once I got home, I dug right in. The chicken schwarma was well (and correctly) seasoned with plenty of cloves and garlic added, and once paired with pickled radish (included) it was delicious. The little container of garlic paste was also a perfect combination. The only complaint I had was for the sambousik. I'm used to the doughy pastry version, so Al Wadi's puff pastry version surprised me. Not bad, just not my cup of tea."], ["Jessica B.", "This place is awesome. If you look at my other reviews, I have been going to several other Mediterranean restaurants in the past year all over the Metroplex and I have been VERY DISAPPOINTED. My family and I go to these places together and we all say at the SAME TIME, \"I MISS AL WADI!\" Please open a location in Dallas or Addison, so we can visit you more often. For sure I want to bring my Baba (dad) and Amo (uncle) here to show how good you really are. Keep up the great work!   Thank you so much for your great service, managing, and quality food."], ["David S.", "Dolmas was good. Gyro platter was OK. Price was reasonable. Nothing special about this place but nothing bad either."], ["Ali G.", "The house salad dressing could stand to be a little thicker, but it has a good flavor. The pitas are soft and yummy. The gyros are wonderful and the mousaka is really a great dish. We had a very friendly waitress and I've been back a few times in the past couple of weeks. This will be added to my \"rotating staple restaurants\"."], ["Jeff S.", "We found Al Wadi through a Yelp search.  Always up for good Mediterranean food.We started with appetizers of hummus, baba ghanouj and mama ghanouj -- fried eggplant and cauliflower.I'm a big hummus fan, and thought this was not my fave, my wife and kids loved it -- just not garlicky enough for my taste.  On the other hand, the baba was fantastic.  We were also brought a big basket of pita, which was refilled without charge.  The pita was on the thin side.  The dips were very plentiful -- will be having leftovers for breakfast.  We ordered the mama based on some other yelp comments.  These were quite tasty.  The cauli and eggplant were fried, but not breaded.  The cauli was perfectly firm and quite tasty.  The eggplant was delicious, but falling apart.My wife and one son had the gyro wrap.  The meat was tasty, though could have been more plentiful.  My other son had the chicken schwarma wrap.  Also tasty.  I went with a large Greek salad with house dressing.  Very plentiful, though not remarkable.  Overall we were quite pleased with the meal, and even more so when we got the check.  $44 for an amazing amount of food.  Take off $3 for a coupon on the restaurant web site and we were out for $50 tip included. We'll be back for sure!"], ["Savannah R.", "I love love love Al Wadi! The food here is the absolute best! The baklava is made fresh, the sjabiyat is made on order, and all of the pickles, turnip sours, and sauces are made in house! I have been going here for years now and i never get tired of the food. The service is lacking lately, but over all its not bad, just slow. Still, live in plano now, but when I want Greek, Lebanese, and Mediterranean and food, I won't go anywhere else."], ["Cory T.", "Good food good value. Slow sevice."], ["Daniel G.", "We go to this place at least once a week, sometimes more. Excellent Mediterranean food."], ["c p.", "Finally I've found healthy and very tasty food in the area. What a pleasant surprise!"]], "Chadra Mezza & Grill": [["Kendall S.", "Authentic, savory, vibrant food; spicy and full-bodied Lebanese wine; a welcoming and modest staff; these are things possessed and celebrated by Chadra Mezza! I popped in here on a Friday eve with a simple dream of ambrosial lamb and red vino. I was not let down! I ordered the Lamb Shawarma: fabulously seasoned lamb stir-fried with onions, peppers, and tomatoes, served with a bed of delicately spiced rice. It was absolutely delightful (a little pricey at $17), and it paired gorgeously with the Lebanese Reserve wine I ordered (which I can't find listed on Chadra's online menu, otherwise I'd give you the name!). I had two glasses at $8 each because this wine was robust, drinkable, and had a lovely heat to it. I had plenty of food for leftovers, which was just as impressive the next day, although my Sutter Home Cabernet was not too fabulous comparatively!  OH, by the way.. Beautiful Greek Salad with a TON of feta cheese, spicy wax peppers, fresh cucumber, crisp purple onion, plump olives, and dressing on the side - which I totally appreciate. Pre-dressed salads are usually too soggy for my taste!This is not a cheap dinner, no, but the food is awesome and the owners are so sweet. Chadra Mezza is a big celebration of family, legit cuisine, and amazing imported libations! Yesssss."], ["Miranda D.", "Tried this place with my coworkers the other day. The hummus and pita were delish. Nice atmosphere. I hear the lunch buffet is great, as well as the salads. Friendly service."], ["Sean M.", "What can I say, awesome service, awesome food, I love the patio. The owners are very hands on and the staff is great. You must try the pizza the dessert. Oh and don't miss New year's eve at this place."], ["David R.", "After months of being on my radar, I finally made it over to Chadra. We went in a group to celebrate my birthday, and seeing I have been on a bit of a BBQ bender, hitting up Chadra was a nice change of pace. Stepping in, I can tell why this place is such a favorite. A large patio, with a lively, soothing atmosphere. Not to mention, they have a buffet special for each day(even on weekends), so it is hard not to find something you like. Although the buffet looked quite tempting (seafood and lamb), the line was constantly full, so I decided to go with a la carte.My usual strategy with any new place I try is to find a dish that allows me to try a bit of everything, so naturally I was predestined to order the Kabob Trio. You get four choices of meats: Chicken, Lamb, Steak, and Kafta. I chose the latter three, as I usually stay away from chicken kabobs, since so many places dry them out. Despite the $19 price tag, the food did not disappoint. Each one of the kabob skewers had great flavor, due to the nice seasoning and char flavor from the open fire pit you can see when you look into the kitchen. Steak kabobs at most Middle Eastern restaurants often suffer the same fate as the chicken, they tend to dry out. Not at Chadra, and the lamb and Kafta were great too. Kafta is quickly becoming my favorite dish to order at Lebanese restaurants, you just have to love the flavor derived from the herbs and spices mixed in with the grilled ground beef and lamb.My brother mentioned I needed to order the falafel. They came out piping hot and are the best I have had in Fort Worth thus far. I can also confirm the garlic knots are evil in their addictiveness. You will feel ashamed for your lack of self control after you eat 5 of them. Chadra also has a nice selection of drinks and cocktails. All my friends liked what they ordered and we went through several rounds as well. I kept it simple and ordered a few rounds of Arak, I picked up a love for Ouzo and Raki through my Mediterranean travels so I tend to order them or their variants at any chance I get. So Chadra definitely lives up to its billing. Great food, good sized portions, and something for everyone. My next plan is to hit up one of their buffets too."], ["Chris P.", "Know what I love? This place. The food is great, the buffet is doubly (sometimes triple-y) great, the vibe is great, the owners are some of the nicest people ever in the history of nice things.I know that's short on detail, but that's all the detail you need, really. Just...great."], ["Brian W.", "Chadra is a great little lunch spot. ($9 on weekdays - a steal).  We went on a Thursday for the lunch buffet. According to the very friendly staff, Thursdays are popular because they serve the Heavenly Chicken that day. We just about everything, and all was very good.  The pizza is solid too. On Wednesdays, the buffet is all-vegetarian. To mirror another yelper, its a little strange they have no desserts on the buffet (just dates and fruit), but we certainly didn't need them. The dessert menu looked great though. We will have to make another trip for that. There is ample parking out back. We will certainly be back for seconds!"], ["Glenn R.", "Excellent food and the chef is the owner. He puts his soul into the food! Highly recommended!"], ["Ryan H.", "I'm sorry Chadra, but we can't keep seeing each other. I wanted to love you, with your casual family-owned personality and friendly staff, but you seem to have an identity crisis. You look and act like a Lebanese restaurant, but every time I come to visit you only serve \"Italian\" style pasta (stuffed shells & lasagna), or pizza!? This makes no sense. Please call me someday, when you go back to being yourself. It's really quite sad - I feel like I never even go to know you."], ["Emily M.", "The atmosphere is pleasant and quaint, the wait staff is extremely accommodating and friendly, and most of all, the food is delicious! My husband usually gets the buffet (and they turn a blind eye to me stealing a bite or two from his plate for tastes!), and I usually get a wrap or a pasta dish! We both love everything on the menu, and are only sad that we no longer live in Fort Worth and thus can't visit as frequently."], ["Brett I.", "Location isn't ideal, but it makes up for it with quality Mediterranean food. It's a nice place that makes good food and it's worth seeking out if you're looking for well-priced and tasty Mediterranean fare in Fort Worth. The waitress was nice and we got our food quickly.Shaik al mehse was nice and tasty; reminded me of moussaka, with the eggplant, ground beef with a tomato-based sauce and all. It was tasty and the portion was good for the price. The entrees come with a salad. Food comes fast; they also have a dinner buffet option on Mondays if that's your thing.I think i'll come back again and try some more dishes!"], ["Pat Q.", "If you like mixing Mediterranean food with Italian food then this is your place.  However, if you are a purist like me do not waste your time trying out the restaurant.  When I go to a Mediterranean restaurant I want it to be authentic so much so that I can feel the sand under my feed and feel the sway of the camel ride.  My husband and I had gone to the restaurant to meet some friends that wanted to try it out.  The salad bar looked  nice and fresh but I notice that there are a couple of items on the entree buffet that were italian.   I decide to get my salad from the salad bar first and enjoyed the build of the Greek salad and fruit.  However, when I went a little later to get the main entrees, the buffet had ran out of two of the Mediterrean dishes and had replaced them with more pasta dishes.  I questioned our waiter about it but he said there was nothing he could do.   The Middle Eastern items left on the buffet were not substantial and it upset me so bad that I told our waiter to just bill me for the salad and that I would not partake in the entrees.  There was one silver lining in this experience and that was the baklava.  It was served with two pieces plus a scoop of ice cream. Baklava was really good.  Would I go back?  No!!!!  There are to many great Mediterrean restaurants that actually serve Mediterrean food."], ["Angel F.", "Finally made it out to Chadra's.  I dragged my mom along who happens to be somewhat unadventurous when it comes to food.   We both LOVED the buffet.  The salad bar was fresh, the heavenly chicken was heavenly, and we left with full bellies.  We'll be back for sure!"], ["Bianca M.", "So October of last year I was just walking around and needed a bite to eat and I came across Chadra and their spaghetti and meatballs were DELICIOUS BEYOND COMPARE and I know it's a dish so cliche but it was so good big hefty serving too."], ["Reba G.", "I was here for a yelp event, so I got to sample some of the appetizers, I can't  wait to come back and try some of the main dishes.  This is a small business owner, so it makes it even better as they are not like other chains.  There is a cute little patio where you can sit with friends and enjoy a beverage or two.  One of the drinks I got to sample was the tamarind margarita, it had a kick to it, but it was tasty.I loved the hummus here, it is very fresh and goes well with their pita chips and pita bread.  The dolmas were fantastic, and I was a fan of the feta salad.  Falafel was a little bland to me, but it was decent.  I can't wait to come back when I'm in Ft Worth."], ["Rick D.", "Great lunch spot.The buffet has a salad spread, some Mediterranean dishes, and pizza and pasta. Most all of it is good, and it certainly can meet a few different palates in case someone in a group doesn't like Lebanese food or wants to eat something healthier than pizza. The space is casual and large without being noisy, and the large back patio is nice on spring and fall days. It's ideal for a work group who want to go out to a fun lunch that doesn't necessarily have to be a long one. There's a spacious bar, hooka, and full dinner menu, as well."], ["Steve L.", "Not so great.Slow service started the meal. Not because they were busy, but he just got distracted. Friendly, otherwise.The food wasn't bad, just not great. Strangely it just didn't have much taste.Chicken Parm served in a weird way, in a small shallow bowl. Difficult to cut, spilled out of the bowl. Odd.We wanted to love it but will probably not return. Cheers."], ["Gerald W.", "An interesting mix of Med-ItalianWe went with a group of friends for a friday night dinner.  The restaurant is very nice, and there is plenty of parking behind the restaurant.  The food is full of flavor and they have a nice fully stocked bar.  On the weekend, they offer a unique buffett for dinner.  You can find a very nice salad option, mediteranean option and italian option.  The hummus on the buffett was falvorful, they also offer crab legs, lamb chops that were perfect (and medium rare), dolmas, mozzarella, pizza, and so much more.  The value is fantastic as the buffett is around $18.  The bar pours nice drinks, and the food was really good.  The chicken on the buffett was amazing.  This is a neat find, and worth checking out if you are in the neighborhood."], ["Britney Thuy T.", "I came here for a Yelp event and got to try a variety of items.The feta salad was really good, had to go back for seconds... then thirds after that =) I loved the soft Lebanese pita, which is a lot thinner than Greek pita (served at Terra's Mediterranean Grill). I was thinking the Tamarind margarita would be tequila, but I think it was actually beer in a margarita glass, rimmed with tamarind powder. The hummus was alright, nothing special.The patio in the back had a cozy feel to it, with string lights overhead and live music (on that one occasion that I was there). Makes me want to spend all cool evenings dining out on the patio nowI've heard a lot of great things about the Friday evening buffet, but I have yet to try it. Hopefully I'll have a chance to soon!"], ["Ralph C.", "The food was great. I was amazed at the pizza taste like NYC pizza. I love itWould definitely go back."], ["Amy G.", "The food is excellent!  The wait staff is very attentive. I love sitting out on the back porch. I feel like I am a million miles away eating delicious food."]], "Pak-A-Pocket": [], "Zoës Kitchen": [["Bob M.", "Can't say too much about the location but we have this catered to our job a few times a year, I can only assume it's a price thing. Most notably is they are generally late. Let me say that when you have a half hour lunch, late is not conceivable. 13 people waiting to eat is carp. Outside of the tardiness they have not shown at all twice. The food is decent considering your eating it while aggravated and in a hurry. For me there is no reason to ever seek out going into the place for mundane chicken kabobs."], ["Judy G.", "We decided to try this out for the Gluten Free options since our daughter is allergic to wheat.  We were pleasantly surprised at the number of entree's that were available that weren't just salad (most restaurants idea of GF).  We all decided to try the Chicken Kabobs and they were delicious!!  The chicken was cooked to perfection, the greek salad that came with it was done right with the appropriate balance of veggies to cheese to lettuce ratio and the salad was dressed just right.  If you wanted more of the dressing, which our daughter did, there is dressing on each table.  It also came with rice pilaf which was cooked correctly; not mushy, but a nice bite-feel and a great nutty taste.  The pita bread that was included in the meal was fresh and very tasty.  The GF meal comes without the pita bread. The staff were all pleasant and the gentleman behind the counter was very funny.  The restaurant was clean and inviting.We will definitely be coming back!  I have a feeling that this is going to be our go-to place to eat!."], ["G C.", "Great good as usual but this time I want to take the time to thank my cashier Misty.  She provided excellent customer service.  I was very impressed with her.   You can never go wrong with Zoe's."], ["Una B.", "Overall I like Zoe's enough to keep it in my 3-6 month rotation. On past visits I really liked the steak stack sandwich - but once the bread was mysteriously plain, sandwich bread without any explanation. So, I gave that up. Don't toy with my emotions!I've dabbled here and there for a few other items, and while ok- I've never had anything beyond that. Most recently I chose the steak rollups, which also walked the middle of the road. The meat was tender, I had a few oddly chewy bits, but meat, cheese, tortilla, I mean - this isn't rocket science. I think I'll lean in towards a salad my next visit."], ["Julie W.", "Note: Hummus Trio comes with Pita Chips not Pita Bread as listed on the menu.  It was only a big deal for me because I just finished at the dentist office.  Otherwise chips might be nice?"], ["Vicky W.", "I was so excited to see that one of their newer menu items is quinoa salad!  I love quinoa but few restaurants serve it yet (in case you don't know what it is, it's small sort of like couscous, but instead of pasta it is a seed - meaning it has many of the healthful properties like nuts. High in protein, low carb, low calorie).Very flavorful salad, but be aware - you'll need a to-go box!  The quinoa is mixed with tomatoes, cucumbers, etc. and then served on a bed of greens.  I added a bit of their salad dressing to part of my salad, which was also a good mix.Hubby had the steak kabob, and they looked and smelled delicious and he said they were.  Served with seared carrots, onions, broccoli and potatoes on the side.We also had the hummus and pita appetizer.  Good as expected.  And the homemade chocolate cake was moist and yummy!We went back second time and hubby had the same steak kabobs, but I had the veggie kabobs.  Also very good and flavorful, served with side salad and cooked white beans.Very inexpensive, I think it was $25 or so for both of us.  And even though I ate until I was full, I didn't feel lethargic after my meal, which is always my preference.All very fresh, cold when it should be and hot when it should be.  Great staff.  Even though this is a \"chain\" restaurant, it's definitely one we will return to often!Only negative is no gyros, but the other food is so good that we don't even care."], ["Shannon J.", "Beware! The employees that work there are completely rude and the customer service is horrible. Food is excellent just too bad the managers and staff are completely unprofessional and rude."], ["Julia M.", "Well, my recent trip to Zoe's may be my last one. Why the update?I normally get the spinach roll ups with a side of the slaw and the last two times that I've been in the portions seemed smaller while the price is the same. My husband ordered the grilled chicken plate and the chicken was very small and tough. He also found several hairs in his food (totally ruined his appetite). They did refund his meal, though, but didn't really offer much in the way of apology. Oh well."], ["Sherry B.", "I eat at the Southlake Zoes on a regular basis and this one is NOT even close to as clean or good.  First it is a Filthy restaurant.  The ice dispenser was unusable, thank goodness they had a Coke machine with ice I could use.  The silverware tray was disgusting.Hummus and pita...hummus was thick, pita was crunchy on the ends, as if it was either stale or toasted.  Protein plate...chicken was overcooked and chewyWon't be back..."], ["Suzanne F.", "This Lifestylist® tends to be a road warrior - I spend a lot of time on the road and finding food that is not only healthy but worth the calories is hard to come by. Zoe's not only gave me fresh, healthy options - the staff put a smile on my face that lasted the entire day.I was greeted by a manager? that said welcome! Where have you been? I don't know if he really did remember me, but he sure made me feel important, and memorable. I lust after their chicken kabobs and green tea, but because the photo of their new quinoa salad was so appetizing I had to order that as well. Plus hummus - it looked too good to pass up. He asked me if I would like my hummus dressed - I said of course. Warning: their green tea is addictive, so you should buy the refill glass when you go so you are good for refills on your next visit. I can't stress enough how genuinely nice everyone was, and the restaurant (and bathroom!) was spotless.Food? Every time I dine here (and it's a lot because I have a client nearby) is perfection, and the staff has always gone above and beyond. Love, love, love everything about Zoes, and it will always be my first choice - any chance of an Oak Cliff location any time soon;)"], ["Greg F.", "Very well managed place to eat!  All the staff greats you when you enter.  The food is excellent!"], ["Brandon W.", "Everything I have tried here has been delicious. The managers here have recommended a few things and they always go out of there way to make it a great time here. This is my favorite Zoe's location. It blows Southlake out of the water primarily due to the management and their outstanding co-workers. One of the employees told me to download the zoes app to get free stuff. So it's awesome as well. Good place for sure."], ["Michael P.", "Food is ok and not overly pricey. Had the Chicken Ka-bobs which came with rise & a small Greek salad. The chicken was cooked just right, which is actually hard to do with a ka-bob. It's pretty easy for them to dry out. Not a bad meal for $8.00 and it was filling.One thing that I found was odd is that there is not one menu item with Lamb.  Also no felafel.  Hard to accept a Greek restaurant without these two items. I'm giving it a three star which means that I will probably return again (to try a wrap) but I'm not ready to give them full accolades."], ["Scott B.", "I've eaten here a couple times and it's very very good. Food is very fresh and you can taste it. Salads are amazing and the Beef Kabobs were scrumptious. I've also had their chicken and orzo soup......again, yum. Best \"fast food\" place around!"], ["Leslie N.", "Menu had lots of good selections, service was very friendly, but I had to pick out all the dead lettuce from my salad. I had hummus, a Greek salad, and a spinach and chicken wrap.  Not great, but not horrible. Will try another location. Didn't leave me satisfied or excited to come back..,"], ["Tracy C.", "I've heard so many people rave about this place but thought it was overpriced for what you get. The hummus is good. I was a bit disappointed, because I absolutely love Mediterranean food. Only ate there once. Maybe I should give it another try."], ["Jarrod J.", "This place had a pretty high rating and I really enjoy Greek food, so I thought I'd give it a try.I am giving it 3 stars because I came for dinner and it's definitely a better place for lunch based on the menu items.  Lots of rollups and kabobs and salads.  Mostly chicken items.  I had to search for beef menu options, which is a requirement for my dinner.  I'm a carnivore.  :)I had the Steak Rollups which were very good especially with the accompanying lemon-mayonnaise sauce.  If I'd eaten here for lunch it would have been an easy 4 stars.I'll definitely come back for lunch sometime and see if 4 stars suits Zoe's!"], ["S T.", "Undecided with so many good choices in the Golden Triangle strip, Zoe's just seemed to look welcoming and friendly. This new spot took beamed at the corner with a beautiful color of flare with a patio umbrella garden. It was a bit before the usual lunch crowd and walking in with ease of checking out the place and menu. While trying to decide I checked in on Yelp to read some reviews and noticed a 10% disc. with check-in. Zoe's has a 2 item deal (1/2 sandwich with fruit, soup or salad) for $5.99 and the portions are very filling. The drink station is one too remember with a visual screened showing of your sodas, totally cool!! I'm a fan of sweet tea but there's tasted like it was on a diet. The food tasted so fresh and good.This place echoes happiness from the outside in. All of you Jason Deli fans.....Zoe's is making a home run so step up to the plate and swing on by.I think we made a good choice and will keep this place on our radar...:()"], ["Evelyn F.", "Nice laid back and modern atmosphere. I was very happy with my chicken roll up, and paired it with the super tasty grilled veggies. I wasn't too crazy about the salsa, but I'm probably just a salsa snob having grown up in Texas. My husband had the grilled chicken dinner, and for someone who can be really picky he was impressed with the braised white beans. I found the prices very reasonable given the selection of fresh entrees, was intrigued by their variety of gluten free options, and noticed there is even a protein power plate on the menu. I was super excited when they let me keep the koozie that held my beer, and I highly recommend trying the chocolate cake. I'm pretty certain this place has found a home in our dining out rotation."], ["Tiffany L.", "Wow!  What a pleasantly awesome surprise Zoe's Kitchen was!  We swung on in some time last week and immediately liked the place before even eating a single item!  It just looks happy in there!  Great colors, fabulous lay out.  You go up to the counter and order your food... loads of really yummy sounding options!  We went with the Mediterranean Chicken Pita Pizza and the Chicken Kebabs and the orzo soup.  It was all delicious!  Seriously, I used to live just outside of Greektown in Chicago and these Chicken Kebabs were just as good at Zoe's Kitchen as they were anywhere in Greektown.  Full of flavor and moist. The rice and and salad the dish came with was also fantastic.  They have an extensive beverage station; several types of iced tea and a really cool soda machine that allows you to add fun flavors to your standard sodas.  I went all out and tried a grape flavored Sprite and the boyfriend was delighted to find vanilla Coke!  Way fun machine.The staff is very very sweet, polite, informative.  Zoe's Kitchen is just a really really neat place with really fantastic food and we look forward to going back!"]], "Saffron Sky": [], "Hedary's Mediterranean Restaurant": [], "Celaborelle Phoenician": [["Vannessa K.", "I came with my boyfriend right when they opened after visiting the Modern. He had never had Mediterranean food and he doesn't like vegetables. But he loved all the food we tried. Everything tasted very fresh. Even the lemonade felt like it was just made. Falafels were great. We also had the Manaeesh which was my favorite. And the chicken kabobs were well seasoned and juicy.Granted, it looks a little spooky and questionable. The chef was super friendly with us and answered all our questions. He even gave us some of the Manaeesh seasoning to try. This place is a great hidden gem."], ["R J.", "What a great place to get some exceptional food, seems it is all made to order with the freshest ingredients available, and makes a great difference! It does take along time to be served, but we got there at one of the busier times...They are currently only open 5-8pm for dinner, M-Saturday, but we took enough home for 3 lunches!!!  Would gladly go there, and, it's BYOB, so bring a bottle of wine or six-pack of beer and chill!!!"], ["Melinda P.", "Don't let the outside fool you! The food is delicious! Be sure to arrive when they open at 5pm. The tables filled Up fast around 6 or so! Its hard to distinguish what it's what on the menu.   I ordered some roasted carrots and sauteed mushrooms for an appetizer...bad idea. When this food arrived it was enough to feed 4 people...each plate.  My boyfriend ordered falefal plate , that was enough for 3 people and my tilapia came with rice and veggies,  that was enough for 2. This was obviously our first time here. We left with 6 to go boxes. Hahaha.  Food was excellent! Took a while to get our food but we weren't in a rush. We were enjoying our wine. It's BYOB!  score!!  We have enough food for the next few days. Our Check was only 20 bucks too!  I recommend this place and will definitely return. Next time, I will surely order much less!! :-)"], ["Dee K.", "We don't miss the buffet at all!  The food is fantastic, but it's a small place & the wait can be long. Good thing the food makes up for it!  Share a plate - the portions are huge!  Bring a bottle or wine to enjoy with your dinner!"], ["Heather R.", "Don't let the unconventional interior and flow of this place turn you away.   Be patient.  Home made food takes a little time.  Family restaurants are not brimming with staff posted at every turn.  No corporate monolith has applied their magic formula to minimize wait time and maximize profit.  This place is innocent and delicious and you are lucky if you have the sort of life that gives it a chance.When I paid the bill, I felt like I had gotten away with robbery.  I worry that they can't survive with this kind of food at these prices.  Hint: They open at 5.  When you walk in trail to the right and walk toward the kitchen window.  There is a menu board and the hummus and real feta should not be missed.  Beside the board is a little table with pens and slips of paper to write your order.  Slide the paper up to the window.  Papa Bear will look it over to make sure all is clear.  Grab your waters at the drink station and find a seat."], ["Heather L.", "We went back and I had to update... I don't care about the neighborhood, the parking, or the weird exterior. The food is so good, so plentiful, I have to give it five stars.  We tried the Maneesh (Lebanese like pizza) and just MMMMMM'ed our way through it. Order it with Feta, and you'll know what I am saying with the first bite. Their hummus and pitas were as delicious as before, their fruit plate was huge for the price and had some very nice thick slices of papaya. My husband doesn't like cucumber much so he missed out on the cucumber yogurt salad, but that just meant more for me! Everything is so fresh, I haven't tried anything I didn't absolutely enjoy there.  There are a bunch of vegetarian items on their menu that I haven't even gotten to try yet which is a rarity, usually two visits to most places and that is the extent of their vegetarian friendly fare. Everyone is always in a good mood in there too, I ended up talking to people at two separate tables who were also mmmmm-ing over their food. We beat our old record and left with 6 takeout containers... I'm eating leftovers as I write this... mmmmmmm. I smell like garlic and I don't care. I heart you Celaborelle."], ["Ayala M.", "Do yourself a favor share the meals. We will be back for sure!"], ["Alan P.", "I believe it's closed stopped by yesterday  around noon was not open .Closed closed closed not open lol"], ["Michiko H.", "Big fan of Falafel and Lentil as side there. Falafel is so crunchy and fine. Lentil is simple but full of natural, sweet flavor, derives from the lentil itself. I recommend to order Arabic coffee from the first because this spicy taste goes well with all the dishes and with refilling pot it may remain one cup after the supper. Ok, to tell the truth, I shuddered arriving the restaurant and wanted to return home. It was out of downtown and was no shops around. But once you enter, this place is cozy, good smelling of cuisine and utterly clean. In spite of such inexpensive price, the foods are very tasty and all the staffs are kind and caring. Next time I will try eggplant and tomato plate, which smelled good from the next table!"], ["Anye F.", "The food here is pretty good.  It strikes me as the Lebanese version of \"home cooking\"; big chunks of grilled vegetables adorn the schwarma, the pita is a super-fresh, whole wheat variety, the hummus has a strong tahini taste to it and a just-out-of-the-grinder texture.As others have said, it's a small dining space in the foyer of an old house, and it's got charm.  I think there's probably only one or two people cooking, as everything was definitely made to order and the wait time reflected that.  Even the 'small' portion of the meal was huge (do not be fooled by \"8 oz\" -- that's probably just the chicken weight alone, there is easily 5-6 cups of food on the plate!)Definitely go family style with the entrees and definitely come when you have time to relax and converse.  The parking is a bit confusing, especially at night when you're going to have trouble seeing the signs, but there is actually parking both in front of the restaurant, in the lot behind it, and on the next street over."], ["Chi N.", "Slowest service ever! I got here and ordered food around 7pm. 1hr and 30 min later, we still haven't gotten our food, so I went up there to check, and they haven't even started on our orders yet. Their excuses was that they had 4 orders before us. There was only one other table there beside from us, and they had pretty much finished eating, so we just left the restaurant to grab food somewhere else. So just a warning, make sure you ask when will the food be ready as you're ordering, or else you might have to wait hours in a hot, dark, mosquitos ridden table for food!!"], ["Eugenio V.", "Let me start with the BAD so you know it before hand.- it is not a restaurant, it is a HOUSE. You are eating in the foyer.- you could drive there a thousand times and not see it- they have 6 tables and 5 car spots.- at 8 PM no more customers allowed in- if you have trouble controlling the amount you eat, do not come here- menu is on a whiteboard brought at the table at order timeNow the GOOD:- the place is quite unique.- the food is absolutely great.- the food comes in gigantic portions.- the food is insanely cheap. Only two item are more than $10. Most are less than 5.- I have seen customers helping cleaning the tables and in the kitchen (!)- Lamb Sish Kebob was sublime- Do not order more than 2 plates every 3 persons, unless you are willing to carry boxes at home"], ["Ryan B.", "This review is for those who have never experienced such a unique restaurant.If you are in a hurry,If you require that someone personally tend to all of your needs,If you want countless drink options,If you do not want to interact with others,If you feel that all restaurants should have the same core values,This is not the place for you.This restaurant is very unique and will make you smile if you accept the reality of it all. You may have to get out your phone and research a little too figure out what you are ordering. You may even want to look at the menu here on Yelp and have an idea about what you want before you go. You may even have to ask for assistance from that individual in line with you that seems as though they frequent the restaurant. Yes, the guy in the window wants to create great meal for you so tell him what you want. He may not have it, so have options. The food will not be garnished and look like gourmet cuisine, but it will taste great. Be flexible and enjoy the experience. There is no waitress that is going to take care of it all. There is water and ice available for you to serve yourself.  You may want to help by having your table in an order when you leave. You may pay at the table or have to find someone to pay, cash makes it easier. I usually leave a big tip because the experience is that good. As for the food, the portions are huge, inexpensive and very good. I tell all my friends that all of the leftovers make eating here cheaper than grocery shopping, and the quality is great. If you are looking for a quite romantic dinner this is not the place. I must admit that my wife and I celebrate every special occasion that we can at this restaurant. Works for us, we like good food and fun. I think its BYOB too."], ["Rebekah S.", "Incredible food, mind-blowing portions, and disturbingly low prices. This place would be cheaper and better than shopping and cooking for yourself every night of the week. I heard the wait is usually long, but I was not disappointed and my group was full with the first plate. We ended up ordering four huge platters, Turkish coffee AND a healthy (and incredible) dose of baklava for a grand total of under $30. Leaving with four overflowing to-go boxes..."], ["Ramesh C.", "2nd time here after almost a year.. Taste and quantity remains the same.. We ordered Grilled Kafta and Sheik..  Both the dishes are delicious..  We will go back soon!"], ["Lauren H.", "They keep it fresh up in here! Seriously..the food is cooked to order. Delish! You will be taking food home, portions are cray!! The exterior is lTexas chainsaw massacre meets east Lancaster...but keep an open mind! Once your inside, you forget about the zombies cruising up and down Hemphill. Byob, always a plus! Prepare to wait a bit for the food..just know that going in! Get here NOW"], ["Chris P.", "About a year and a half ago, someone told me about this place.  So I tried to go one night. And they were closed. So a month later, I tried again on a weekend. Closed. Then I tried again, during lunch one day. Closed. So I gave up.Bottom line is that this place isn't open very often. If you would have asked me 3 months ago, I would have bet money that they were closed for good.  I think they just open their doors for short stretches when they feel like it. So last weekend, as I was trying to make a reservation at another place on my phone, I saw Celaborelle pop up. Hmmh. Surely that's a mistake, right? So I called them, and they actually were open. And it was amazing. Seriously. It's in an old house that looks kind of like a haunted house. Which is clue number one that it's going to be good. Those shady sketchy hideaway places are what really getting to know the cultural gems of a city is all about, right?My girlfriend and I got the Beef and Chicken Shawarma, with a side salad and Lentil soup. We also ordered hummus and tabouleh, but apparently the lady either didn't hear us or knew we wouldn't be able to finish it, so we never got it (and she would have been right btw, we were really surprised by the amount of food we got). The salad was made of really high quality stuff and the soup was really good as well, all for around $25.And I'm sitting here eating the leftovers, and I swear they got better in my fridge.So if you can find it, and it's open, do it. They mentioned that they're not going to be doing the buffet for a while since they don't have many customers (and I'm not an expert or anything, but step number one might be opening your doors more than once every year and a half), but it's a great, great, casual dinner spot. The service while we were there consisted of just one person, sweet as she may have been, so it might run a little long for lunch if you have somewhere to be.Still, go there."], ["Lindsey A.", "Celaborelle is the best under $10/plate restaurant in Fort Worth, hands down. The owner, also our server & probably our cook, writes the menu by hand and displays it to each table as customers walk in. The menu changes daily according to what he has available. This tells me the restaurant is evolving and making daily changes to ensure the food is delicious and fresh. STEP #1 IN BEING A GREAT RESTAURANT.  the food does not reflect the prices. i swear its too great to be so inexpensive. the portions are so large they are just waiting to be taken home in a box. heaven forbid...the soup is .75 a bowl. As in, UNDER one dollar. It is incredible One bowl of lentil & spinach soup with an order of hummus (plenty for lunch) comes to a total of $3.75. Go go go support this great local charm. Check out the weird house its in too!"], ["Jennifer W.", "It's Hedary's without the $$$$- but even better, the taste the serving size-Joseph is a king!  I'd work here for free as long as he fed me and I might just have to offer him some help since the staff is always family...wonder if he would adopt me? If they are open, go, wait if you have to -even outside- but don't come too late or they may run out  of your favorites. Cannot say enough good things about this place, it's like you ARE family and prices so low you want to give them more money!"], ["Rae S.", "OK, service aside, this place is a find.  You will wait a longggg time for your food, you write up your own order, you most likely have to get your own water and utensils....but the family is sweet and they are working hard making your food from scratch.  The best thing I can say about this place is that the portions are huge.  I mean HUGE.  We had to pack up about 90 percent of the items we got.   The best dish we had was the tabouleh. ....it was fantastic.  And the rest was good if you don't mind a lot of oil.  We didn't mind the slow service and the daughter of the cook was the worst waitress ever, but it was entertaining.  No plate, no silverware, our drink arrived as we were finishing our meal, no napkins until we asked for them, etc.  If we lived here, I would return, but would only order one dish, since the portions were so huge.  There were like a dozen giant felafel balls on our plate.  We begged another diner to take them. We have had much better hummus and felafel, but this was pretty good.The vegetarian plate had these amazing beans with it.....one was lentils and the other was maybe pintos....but they taste amazing.  I just had leftovers for lunch.  Yum.  And I will be eating the leftovers for the next three days, at least."], ["Chadd S.", "hidden gem.   This place has been recommended for years.   Finally I had the pleasure of experiencing what is Celaborelle.   It has such a strange old house exterior which leads to a surprisingly welcoming interior.  The service is a little awkward until the other patrons give you some insight.   You will write your own order on old Carriage House order forms (recycling in action.  Love it) then pass them through the window to the kitchen.   The chef will assess your order and nod if all is approved.   Find your own table and enjoy the wait.    Food  will continue to flow until you can't imagine what else will follow.   The falafel is the absolute best I have ever put in my mouth.   I highly recommend the chicken livers (add a little lemon and it takes you back to the Hedary chicken livers).   Well done beyond my expectations.   An incredible dinner experience!    The most shocking part of our evening was the amount of food that was served and our tab was phenomenal.    A must go!  Add it to your list!"], ["Taylor S.", "A hidden jewel. One of my favorite places."], ["Jason M.", "For the money, I can guarantee you won't find more tasty or well prepared food on this planet! The ablama and the sheik al meish is awesome. They have a $3.95 special everyday. Don't go expecting to be in and out in 15-20 min. And plan on taking home a ton of leftovers. Portions are enormous. Prices are the lowest I've ever seen for food of this quantity/quality!  Enjoy!"], ["Garrett R.", "This place was LUDICROUS! It's in a pretty run down area on the outskirts of Downtown Fort Worth. Family owned since 1908, the restaurant is in a beautiful, large but similarly neglected old home and walking up the steps to the front door comes not without some general confusion. There isn't much else around the predominantly residential streets. Inside it's very clean. The original brown patinated interior was very charming and we were greeted to sit and be shown the menu. As far as I could tell there was a single hostess/server and the cook. Between the four of us we ordered 2 falafel and 2 veggie plates. We ordered starters of hummus and pita(awesome), and tabouleh. My veggie plate included a bowl of lentil grape leaf soup and a small serving of babaganouj. Delicious! Stop! Enough food. \"I'm good!\" My main plate arrives and it's huge. Black beans, lentils and rice, and a sort of hot squash dish called Kibbi, and five 3 inch falafel. Turned out the falafel plate was the same arrangement except substituting the soup and Baba with five more falafel! An absolutely ridiculous amount of food for all of us, we turned away two of the falafel dishes out of fear. Cost? Guess what...$5.95 for all my entree. I'm guessing it was about $32 for all of us to eat and drink. Do yourself a favor and go out of your way if you must to enjoy what this restaurant has to offer. Anybody under 5 stars on this one is silly and the asshole posting a 1 star should be dropped and drowned in a vat of babaganouj. On second thought, not a bad way to go if it's made from Celaborelle!"], ["Brian L.", "Just wow, portions are epic.  Thier medium salad would easily be 5 portions at a normal place.  Worth coming out to ft worth for."], ["Josh O.", "This place is a hidden gem. You'll drive up and question whether or not you came to the right place but do not judge this book by its cover. This is the best Mediterranean food in Fort Worth and it is very underpriced. A few things- -The staff is extremely friendly and helpful. They aren't very talkative but the service is great. -The food is phenomenal. I would recommend the Beef Shwarma and you HAVE to get the pita bread and hummus. The meals are so cheap, especially for what you get. -It is BYOB so it can make a great and affordable date place. Just make sure she is ok with the \"run-down\" feel of the place. **-Do not come here if you are in a rush. The speed of service is hit or miss. They have a small staff and seem to make everything from scratch. There will be a wait for your food but it is worth it. Overall, this is worth the visit if you can deal with the neighborhood and the run-down feel of the place. It's slow service but amazing food."], ["Heather M.", "I went here with my best friends for my birthday dinner. I got to pick the place, and I have to say that even though my friends thought I was crazy when we pulled up in front if what looked like a house that belonged on a scary movie set, we had the best time! The inside is quite cute and date worthy (perhaps blindfold your date until you get them in the door - or point them here to all the glowing reviews so that they will be less put off by the exterior and neighborhood). It's also obviously great for a group of friends! I found this little gem by searching for BYOB places in Fort Worth (they provide wine glasses and don't have a corking fee).  The amount of food for the price is incredible.  You may not want to go as crazy as we did, ordering several appetizers and four meals among the four of us - we ended up with 10 to-go boxes and enough food to feed us for lunch and dinner the rest of the week.If I could only tell you to order two things, it would be the hummus and pita plate (killer pita!) and the falafel.  I LOVE their falafel!  They make the best falafel I've ever had.  Not only does it have great flavor, but the texture is great (not super dry and crumbly - here's looking at you Terra Grill).  We had a very picky, non-adventurous, non-veggie eater with us, and he devoured the falafel right along with the rest of us (quite a testament to the awesomeness of this falafel).  I also need to note that the aforementioned meat-eater with us ordered the brisket plate, and not only was it great smokey meat (with two HUGE sides!), it was only $4.99!!!!  RIDICULOUS! So grab a bottle of wine and your open-minded friends and prepare for a feast of copious yummy goodness!  You better run, not walk, or I may beat you there.Notes:  there's no corking fee, check their website for when they are open (doesn't hurt to call either so that you aren't disappointed), try to park in front of the house or in front of the house next door (at last resort, there is parking behind the house next door), share plates or have space in your fridge for leftovers, and get the hummus/pita and the falafel!!!!!"], ["Kim N.", "Due to the fact that this place has been having a lot of reviews and visitors within the last year, the owners decided to raise up the prices on their entrees. The last time I came here, I had placed an order through phone just because it takes less time to wait for your meal as if you were to be waiting inside the restaurant. The guy told me that it was an hour wait. I was completely shocked! Because all of the times that I have visited, it was never busy. When I received me lamb shawarma, the vegetables were burnt and were impossible to eat. Even though the menu says \"char grilled vegetables\". I also didn't receive any complimentary pita bread. There is only one server, he try's his best to help every customer. He is also the chefs son. One time, they were both arguing and yelling in the back kitchen. Which I thought to be very unprofessional."], ["Sarath P.", "I finally got to experience the amazingness that Celaborelle Phoenician is... FINALLY! All I have to say is... WOW! We went there for lunch... we started off with the hummus plate and the feta plate. Of course -- we had starters because we just didn't know the amount of food that was coming. The feta was amazing -- not as strong as most fetas which made you want to eat blocks and blocks of it! The hummus was great with the huge discs of fresh, hot pita they also bring to you. I ordered the chicken and rice special that was $4.95 and my friend ordered the falafel sandwich that was $3.95. After over stuffing ourselves with feta, hummus and pita -- our dishes came out. HOLY MOLY. My chicken and rice was the size of a pig trough. It was enough to feed 4 people! My friend's falafel sandwich was... a circular pita the size of a medium pizza, topped with 8 gigantic falafels and a sprinkling of lettuce and tomatoes. We literally just looked at each other with our eyes and mouths wide open. To top it all off, the chicken and rice was delicious -- full of spices and juicy shreds of chicken and the falafels were so flavorful and moist! I can't wait to come back and bring newbies to experience this greatness. If you haven't been here... please go! There is nothing like this place!"], ["Vicky W.", "BIG portions, enough for two meals.  Authentic and good food.  VERY good prices.Very hard to find, it's in an old remodeled house, and you actually park in front of the window of the house next door.  Pull into the driveway between the two houses.Extensive menu.  Maybe too extensive, it's hard to decide!Very nice and friendly people.  My first urge was to offer to help with marketing!My guess is they can keep the prices low because they probably live upstairs.  Not uncommon in other large towns, just not what we're used to seeing here.Don't get the lemonade - it was made from powdered concentrate.  That's the only negative I had."], ["Ian O.", "Amazingly huge portions, amazingly tasty food, amazingly cheap, amazingly little parking space for its popularity, and amazingly slow service.Overall, it was amazing. I would probably go there again."], ["David V.", "This place is mafioso-esque. Basically a home converted into a resturant. Family lives upstairs. Parking...good luck. What parking? Neighborhood is kind of slummy. Buffet is served on styrofoam plates and with plastic utensils. Food was mediocre at best. No gyro either. The place was litterally filled with only grouponers and the resturant didnt fufill the dessert order that came as part of the groupon. Manager was also the only cook in the kitchen. His answer was that he \"just didnt get around to making it.\" Was really excited to try this place but the experience was wholly unacceptable!"], ["Nicole D.", "Outstanding! The best meal we've ever had. We were skeptics when pulling up. No or little A/C is the main drawback. A regular helped us order, that part was a bit confusing."], ["numair k.", "Hands down one of the best Lebanese restaurants I have eaten at. Even better than some I have eaten at in many countries in the middle east. That's the biggest compliment I can give them. If you want fast food or constant service, this is probably not the place for you. If you want exceptionally good food at a great price, I would check it out, again and again and again......."], ["Patrick O.", "Wow!  Great food and amazing prices.I'm not sure where you could find these prices, how do these guys stay in business..  I always tip extra here.."], ["Pazinhim B.", "We left. It was absolutely ridiculous. No menu. Instead, they walked around with ONE dry erase board that had their menu in chick scratch. Of course, if there is only one dry erase board, you can imagine how many people are sitting at tables just waiting to see the menu. This one belonged on Restaurant Nightmares."], ["Ebony E.", "Smells goood, cooked when ordered takes a long time so I advice you not to go on your lunch break..... but well worth the wait the hummus I loved portions are huge if your not a competitive eater get the small serving still well ova enough to share. 3ppl $30 you can't beat this homemade meal. I WILL BE BACK!"], ["Josh H.", "Don't show up expecting anything like service or food to make its way by your table at any point. Showed up at 6 and had to leave at 7:48 having only received our hummus appetizer. We didn't even get our drinks in that time. When I asked if we could just get our order to go I was told that we were still 3 orders back. I cancelled my order and paid for my hummus and left. I've heard that the food is amazingly delicious, but I'll never find out. Can't imagine ever going back. Can't imagine it's worth waiting 2+ hours for, especially not with King Tut just right down the street"], ["Stone B.", "Definitely going to be a regular lunch stop.  Food is simple (mostly grilled meat, fresh grilled veggies, and rice), but expertly cooked.  The chef came out and took our order, and upsold an appetizer of olives and pickles with a yogurt dip called labna.  Turned out to be a good recommendation - the olives were excellent, then had some kind of herbs that lightened the flavor, and the pickles turned out to be pickled turnips.  Nice and crunchy.  Decor is very nice - the house the restaurant is in was obviously a ritzy place at one time, judging by all the real wood paneling.  The place is small, just 7 tables.  Don't go if you don't have an hour for lunch - both times I've gone for lunch, it took about 20 minutes from the time I placed my order to when I got my food.  This is fine since it is being cooked fresh, just something to keep in mind. For this reason, it's best to go with a group, or make sure you have your Kindle app on your phone.There is a LOT of stuff on the menu.  I plan on taking a group soon so we can order a variety of stuff just to try all the things I've never tried.  Everything I've tried so far has been fairly simple and delicious.  About the only real complaint I have is the parking situation.  There's room in front of the house for about three cars, after that you have to park down the street. But the food is terrific."], ["Elizabeth E.", "Most of the poor reviews on here seem to be about it being closed - it was for a little while but it is back and boy am I glad!Byblos and Hedary's are two businesses I've enjoyed on the northside and the westside of town.  Now that I'm moved to the south, I'm so happy to see another restaurant in the Hedary family right in my neighborhood!  Warning: it does not look open from the outside, so don't let that put you off.  Check the website to see the days/ times they are open.The food is delicious and inexpensive, two of my favorite things.  I got the chicken baked with potatoes in a lemon garlic sauce, the salad and squash sides, and all of that was less than $8.  And that was half a chicken.I loved my food, and will be back.  Glad to see an affordable and delicious dining option on this side of town."]], "Casablanca Greek Mediterranean Cuisine": []}