{"La Familia Mexican Restaurant": [["Richard G.", "This place has a very good rating, but it also has a lot of reviews.  So I have much to say about La Familia, especially going on a Saturday evening.  We entered the place and waited to be seated, but maybe we seat ourselves?  There was a quarter of the crowd, not a packed place.  No one came up to greet us.  I finally went to the counter in the back of the restaurant and asked the lady if we sit ourselves.  She said there should be someone there to seat us, I agreed.  Anyways, we were seated by a senior citizen that honestly had no business working.  I felt disturbed that this older gentleman was trying to keep up with the servers.  It made the place look severely under staffed.  While seated we waited for our server, and waited, and waited.  Finally, our server appears, and asks if we wanted something to drink.  And I probably would have ordered a distinctive margarita, the one with the sugar cube, but I was already disappoint by the service.  We went ahead and ordered.  I ordered the chili relleno, stuffed with chicken and covered with ranchero sauce.  To my satisfaction it was stuffed with cheese instead of chicken...very disappointing.  Of course I informed the server that I ordered the chicken relleno, so she had to take it back.  I waited, waited, and waited for my food...so disappointing.  When I did get it back it was exactly the same disk.  I wondered if they even knew how to make chicken relleno.  I gave the disk a below average rating because it was warm plate, not a hot disk.  There was nothing spectacular about La Familia, except the waiting, and waiting, and waiting..."], ["Jack H.", "Walking in was like walking into my families home! Greeted right away with a warm smile and hand shake! We were seated right away in a surprisingly roomy restaurant. The service was exceptional and prompt. The salsa tasted as if it was hand picked from a garden with the perfect amount if spice! The queso was creamy and flavorful. The complimentary chicken soup was incredible! And this is coming. From someone who doesn't even like soup!  The flaming margaritas were stunning as well as some of the strongest and best tasting I've had! The spicy beef and shrimp fajitas were tender and extremely spicy, although the shrimp was a tad bland. The beef was tender,  melted in your mouth. The chicken enchiladas were creamy, rich and delicious! Only.complaint is they don't offer dessert and drink prices are rather high. But the strength of our drinks, I don't mind! Will definitely be back for more!"], ["Juanita A.", "Never coming here again! Place has a nice atmosphere but the food was not good at all and way over priced. The server was very short when we questioned the sauce on the enchiladas, apparently her took it personal when we told him the sauce was ranchero sauce and not 'swissa' sauce. This is not real mexican food!!"], ["Melissa E.", "Loved the salsa, it was fresh and yummy. The queso on the other hand was a little flavorless. I ordered the grilled chicken dish with tomatillo sauce. It was pretty good. The beans were a little lacking in flavor as well. Maybe because they don't use MSG, haha. They stated this on their menu, do most Mexican restaurants use MSG? :( The lunch comes with bean soup or chicken soup. I was caught offguard and ordered the bean soup. It was very good. I wish I would have gotten the chicken since beans came with my meal. The service was excellent. The whole handshake thing at the door was a little awkward... especially when dealing with a 2-year old and diaper bag and someone wants to shake your hand. :)"], ["Heather S.", "I must confess- I like to drink... Whew- I feel better..Now I don't normally drink margaritas. However, when I'm elbow deep in some cheesy, Mexican heaven there is nothing better than one of La Familia's frozen margaritas to wash it down. I was introduced to this place by my favorite foodie surgeon I work with- we left an exhibit at the Kimball a few years back and he suggested Mexican. My sister and I wanted to take him to North side to the little hole in the walls we love but he insisted on this place because the margaritas come with a \"surprise\". This was a long time ago- before they finished Montgomery Plaza- and before Times Ten Cellars was across the street- La Familia sat almost alone in the now packed strip mall on Foch. We walked in on a Sunday afternoon and were promptly greeted and sat down by the same sweet man I see every time I visit. *They get very busy on Friday and Saturday nights and they do not take reservations so just show up early, grab a drink from the register and wait for it*I will say the salsa is like the kind I make at home- I prefer not to cook my red salsa because I like the fresh taste of the raw veggies and that is exactly how they do it here. The food always comes out very quickly which makes me wonder how much of it is pre made- but Its always piping hot so my belly is always happy.  The food is very Tex- Mex and over priced at that but I love how dim and cozy the ambiance is here. So- the surprise I spoke of..... Flaming margaritas.... they soak a sugar cube in 151 and light it on fire atop all the margaritas.. Don't be like me and try to eat it- it tastes horrible. Just blow it out and drop it in the drink!"], ["Kyle M.", "The food was ok. I was not really impressed with anything but nothing was sent back.Margarita was terrible. I think the flaming sugar cube is used to distract from the fact that their margarita tastes like store bought syrup mix.Staff seated us under broken lights even though they had tables open under working lights. Some guests needed their phone flashlights to read the menu. We brought this up to staff several times but they weren't interested in addressing the issue.Overall, I would be very hesitant to return."], ["Chris S.", "Very mixed feelings after eating lunch at La Familia today. We had a great time. The food was very good and well priced. The service was excellent, but nothing we ate made us crave a quick return. The chip and salsa that's brought out when you first arrive is good. According to the owner, who came to our table and explained how he cooks things, the salsa is made fresh, daily, with real tomatoes, unlike many of his competitors who use canned tomatoes. He also mentioned that everything they cook is made with corn oil, not lard, except for his tamales. Kudos to the owner, his food is great. No complaints. However, the guacamole fell far short of great. It was basically mashed avocado. That's it. Not spice or flavor added. He told me, specifically, that he likes to keep things plain and simple with natural ingredients. Unless you want avocado and chips, there's no reason to order the guac. Meanwhile, the chicken soup I had was loaded with flavor. Our main dishes were pretty good. I had the fajitas with chorizo sprinkled it. I enjoyed the flavor, but it was pretty dry. Might have been slightly overcooked. (Keep in mind, they light the fajitas on fire tableside, not sure if that had anything to do with the dryness. I'm not cook, but an eater!) Still, no complaints. I was satisfied. My sis ordered the chili relleno, which they said was very good, as were the rice and beans."], ["D. S.", "Go somewhere else for good TexMex food. Based on the name, you would think the food would be authentic; however, it is very Americanized. The interior is dark, which is may be likely hiding dirt. It FEELS grimy. Like other reviews, the wait is extremely long. Location stinks because there is no parking in the area. I have been twice, and will not return.Groups beware-- They do NOT accept reservations. This is not a restaurant for big groups."], ["Paige D.", "Walking in the atmosphere is very pleasing; dim lights, lots of seating, large collection of old family pictures, and southern decor. This really made the restaurant live up to it's name. Sadly, the positive aspect ends there. Our friends were already seated about 10 minutes prior to our arrival. When we got there, our waiter greeted us and took our drink orders. And that was that, he never brought it to us... a non-wait staff had to retake our drink orders. After 20 minutes of being there we were ready to order. That was when we ran into our second problem. Our waiter did not show up to our table again for another 20-25 minutes. An older gentleman, whom I presume is the owner, came over to talk to us. He asked if we were waiting for our waiter and we said yes. So he said, I'll stand here until they come. Sad part is, the waiter never came. The old man had to grab him and tell him that we were ready to order.... And the worse part? We were having a late dinner, so the restaurant was already starting to clear out. When we put in our order we took that chance to ask for a spicier salsa. He said yes....and guess what? He never came back with that either! We, again, had to go through the non-wait staff..The old man, brought out free queso, probably because of our wait. It was delicious, but didn't make up for the horrible  waiter we had. 2 had the steak/chicken a la Mexicana (something a la Mexicana), 1 had the combination fajitas, and 1 had the steak a la Mexicana. Either the steak/chicken a la Mexicana was really good or we were starving after the hr wait. My fiancé wasn't too impressed with his fajitas. He asked for his onions to be cooked extra well, which they weren't, they were practically raw. The steak and chicken were too thinly cooked which made the onions overshadow it.Overall, food, atmosphere, and ambiance was good, but the wait staff was beyond horrible, which is why I can't give anything higher than 2 stars."], ["Belen L.", "Once we walked in the host greeted my party with a hand shake. That was interesting and polite.The food was delicious. Ordered the Pollo Ala Mexican ($14.99). It was spicy, just the was I like my food. Also, ordered a margarita ($8.49). It was quite stronger than I expected to me but definitely not complaining! The reason for only four stars was due to the customer service we received from the waitress. She got frustrated that we needed extra time to order. Next, we flagged her and when trying to order an appetizer she walk away as we were speaking to her. Rude! She rolled her eyes when we asked for straws. She made us feel uncomfortable to ask for anything else. Other than that, food and drinks were great!"], ["Carl A.", "The was food was  mediocre. The service was not good. The owner was a really nice guy. I'd go back just for salsa and chips. The fajitas were nothing to brag about. Check it out though. It may just have been an off night."], ["Ryan H.", "Pretty standard Tex Mex menu, but incredibly fresh and homemade. Very non-standard food quality! If you love traditional Tex Mex, this is your place. Exceptional."], ["B G.", "First time to this place. The person who invited me orders the fish tacos always. They tasted great.Salsa is made fresh daily.Our waiter & server staff was great.I had the fajitas, great taste, and be prepared for a table side 'flare'."], ["Kathleen T.", "Great food, great ambiance, and the servers know their menu! We stopped on our way back to NC, as I grew up in Texas, and needed just one last taste of Tex-Mex before heading back to the Bull City area. Hands down a great eating experience and well worth the 12 miles off of our trek back to NC. Must eat here again!!!!"], ["Sneha P.", "Back here after about 3 years now! The manager said he remembered me; I have trouble believing him. But he was nice. The food was good. I had a chicken and beef taco. Their magaritas are always good too. It was empty for a Saturday afternoon, not sure how much the colonial affected crowd flow that day though.  Other yelp reviews said it well, good standard tex-mex with a good ambiance (and random entertaining fires on their enchiladas.) Stop in for the food!"], ["Vance L.", "This place is our favorite Mexican restaurant.  We are not from Fort Worth, but when we visit, la familia is top choice.  Great family atmosphere. Love the food and great margaritas. Only fault  is service has always been slow, however it's ok because it gives you time to drink another margarita.   Love this place."], ["Leslie M.", "I went here last night to meet up with some friends and was very unimpressed. I would definitely go to a different Mexican restaurant, unless you like not being served water for 20 minutes after you sit down and then have to wait another 15 for your beer (which you had to remind the waiter about). Our waiter was anything but interested in our table. He hardly ever made eye contact, he quickly came and left without giving us a chance to ask for anything, and it took about 45 minutes for us to get our food, after already waiting 30 minutes to order it. The food is also not worth the price at all, I feel like my taco came from a fast food Mexican place instead of a well established business. All in all, I won't ever visit this place again."], ["Janie T.", "Ate at this restaurant for the first time tonite - on recommendation from a friend.  The waiter who served us was intentionally dishonest and made our dining experience very unpleasant.I ordered the veggie enchiladas and requested no jalapeños - the waiter said the jalapeños were already mixed in with the veggies.  I questioned him on this several times and he was adamant that the dish could not be served without jalapenos - he said the same about the veggie quesadillas.  I have never had a problem like that at any other Mexican restaurant.  I asked to speak to the manager because I did not believe it and in fact asked another waiter to get the manager and when I asked again to speak to the manager our waiter said the manager was not there tonite.My wife's food arrived to the table cold.  After I paid the bill, I looked around and saw a lady taking in the paid checks, and asked if her if there was a manager at the restaurant.  The lady told me she was the owner.   The waiter obviously did not want to send the owner over to the table.   I asked her  if the dishes could be served without jalapeños and she said of course they could, if requested.  That would never be a problem.   She apologized for the waiter.  I have never had a waiter at a restaurant blatantly lie because he did not want to be inconvenienced.So when dining at this  restaurant, just be aware, the wait staff may lie because they do not want to be inconvenienced.  There are plenty of excellent Mexican restaurants in Fort Worth where you can get honest service.I am posting this review because I am shocked at the behavior of the waiter."], ["Stetson B.", "Personally, I absolutely love this restaurant and the wonderful owner. Some of the best Mexican food and service I have had. Family owned and it definitely shows. That being said, for some reason the place seems to have slowed down and don't know why. Parking?  What do you think?  Post your comments so they create solutions and we don't loose a great restaurant. The floutas are incredible. The salsa is amazing. Post your suggestions and Go Here Soon!"], ["Lynn L.", "So basically most Tex-Mex places are the same.  What sets them apart are 2 things (maybe 3):  the hot sauce & margaritas, maybe the queso.  Here the hot sauce is wonderful and the margaritas are strong with the perfect balance of sweet and lime.  You can feel the tequila effects after just one!  The queso was much better than I expected and was chili cheese like.  I had the #17, the chicken enchiladas and cheese enchiladas were typical."], ["Larry L.", "Very, very nice.  Was recommended by our Azalea Plantation B&B and they were right.  You walk in and Paul greets us with a welcome and a handshake.  Not the usual ...  \"2?? \"   Mari is our waitress and she is so pleasant.  Very quiet and sweet but so helpful.  The food is fresh and delicious.  Al owns the restaurant and he joined us to tell us some history of the restaurant and the name of La Familia.  The walls are full of beautiful photos of his family and its history.  Just a fun, pleasant experience.  Yes, we would return!"], ["Daniel A.", "This place was decent, but honestly I thought it was a little overrated for all the waiting that we had to do. It gets insanely packed on the weekends, and getting a table is done haphazardly (at least when I went, there wasn't really much of a line, everybody was just pushing and being passive aggressive towards each other to get sat first). The food is tasty though and decently priced! However, for whatever reason, the acoustics of this place tend to carry a lot of sound... so if you go on a busy night, you'll be overhearing snippets of a lot of people yelling at each other just to be heard clearly, from topics ranging from bitching about live in general to self-important dialogs. The great thing though about this is you'll find that you'll have a lot in common with others... I sure did!"], ["Rick NJessica K.", "The salsa is fresh, the food is amazing.  Great owner who loves serving wonderful food.  Come try it!  Order a beer-Rita and see the flames."], ["Ryan R.", "My friend was playing music next door at M Lounge and I was hungry and there was to much rain to walk any where good so I thought that there was no way they could screw up a beef quesadilla. I mean it is a tortilla cheese and meat that is heated. So somehow they found the worse flavored cheese, in fact I will refuse to call it that, in the world and found a way to get steak to have the same gooey texture as the cheaz.I took one bite of the sorry excuse that they call salsa and gagged. It is more like blinded raw tomatoes. This is seriously the poorest excuse of tex-mex/Mexican food that I have ever had."], ["Tara C.", "Went for lunch today. Tea was under brewed, so I switched to diet coke. The waiter seemed annoyed. The salsa is always good.  My husband and son ordered the quesadillas and I ordered the fish tacos. Quesadillas were good. Fish tacos were inedible. The oil that they were fried in was not hot enough, so there was no texture to the fish, just an oily mush. There was also a sauce over the fish that completely overpowered everything. It was disgusting. My husband, who can eat most anything, couldn't even stomach them. When the waiter asked how our food was, I told him about the fish tacos, he just looked at me blankly, shrugged his shoulders and walked off. I doubt we will ever return."], ["Blayne K.", "It grieves me that I'm incapable of ordering anything but the fish tacos at this place - i love them so much i am crippled my efforts to branch out. they never disappoint!!"], ["Max B.", "Best Mexican Food in Fort Worth! If you go there for lunch, try one of their three daily specials, they are almost always fantastic.  If they offer the Spicy Brisket tacos, get those.  Very good!  I enjoy the free soup they provide and I always get the bean soup.  Be sure to shake their hand on the way out, you're part of La Familia now.The only bad part is the parking."], ["Debra T.", "Pretty good Mexican food! I'm in love with their Queso Con Chile Dip... To DIE for! I noticed this place is great for large parties and they give people sombreros for their birthdays. Customer service is excellent! We had at least five different waiters checking on us the whole time. Love it!"], ["Emily M.", "Fresh and delicious. When you walk in, someone will greet you by shaking your hand and taking you to a table. The staff is very friendly at La Familia. As you are walking to your table, you will notice the decor (and be impressed) - lots of old cowboy type stuff and family photos. They start you out with yummy chips and salsa, and either bean or chicken soup. I like the chicken, I wish I could buy a bucket of it, bring it home, and eat it every day that it is raining, cold, I am sick, or really, just every day. Normally I think chicken soup is boring and I do not understand why people order it at restaurants, but chicken soup like this is worth making room for in your belly.The food here is quite good as well, I have never ordered anything I do not like. I usually go with one of the daily specials written on big spools of paper hanging on the wall. I always leave full and happy. The service here can be erratic, the same person will take your order and give you your check, but everything in between is done by somebody new. The service is never bad, but the waitstaff is always running around like crazy."], ["Gricelda P.", "I had high expectations. I kept hearing how good and cozy this palace was. Let's see: Cozy NOT, good DEFINITELY NOT.Ok, so I had their chile relleno and it was so average and so expensive. My husband had the veggie tacos which are nothing but a lettuce taco  with a little bit of guac, really? really?  and you dare to charge like $12 for that. Like Mr Cee Lo Green would say: F U u u uuuu .The place was super crowded and it took forever to get a table, everything was a disaster. I really don't understand the hype, my family likes to go there because of their margaritas, big deal, you light fire to a sugar cube and get to charge like 30% more for mediocre TexMex?"], ["Tamara S.", "This was a great restaurant at one time.   I'm not sure what happened but the last two times I was there, service took over 90 mins.  Our drinks and chips were prompt but then we didn't see someone for another 40 mins.  We had to wait then for the food for what seemed like forever. We waited another 30 mins after he told us that the food would be up in about 4 mins.  Furthermore, we were with someone who has been going to this restaurant for years,  even before they were in their current location.   What was infuriating is that when we tried to discuss our displeasure, the owner and relative became defensive, and somewhat combative and mentioned.  It was unprofessional and unwelcomed after what we endured, with additional family members from out of state.  When the food did finally come, the rice was undercooked and the rest of the food was cold.  We have recemmended this place multiple times in the past.  Not only will we not be going back.  We will be sure to let others know as well.   Wish the former attitude and service could come back."], ["Alexandria B.", "Generally, I try to be as stereotypical as possible when dining out. If I walk into an ethnic restaurant and no one from that ethnicity is eating there then I make a beeline for the door. Tex-Mex is tricky though....should I look for Mexicans or for Texans? When my friend and I walked into what looked like a casting call for an Abercrombie and Fitch ad, I figured hey, it's Tex-Mex! Texans win this round. But still, I was listening to hear a diner speak in that familiar accented English to comfort me. Anyway, We stood at the door awkwardly, waiting for someone to greet us. There's no list to put your name on and other people waiting looked pissed. Since there was only 2 of us we were seated fairly quickly.The salsa and chips came out in seconds. I liked the taste of the salsa, fresh and very tomato-y. Not spicy at all though. There was a oil and pepper concoction that you could I add so I did. We also got the queso with chorizo. This was the best thing we ate all night. It had a subtle kick from the chorizo and I probably ate half the bowl myself. Ok, maybe 3/4 of the bowl....The main courses were Mexican for people who were absent when taste buds were passed out. It was so disappointingly bland. The \"spicy\" chile relleno had almost zero heat. The rice was average and the thin splatter of refried beans were forgettable. I ordered the beef flautas. It was a nice portion and tasted ok just again, bland. Nothing at all tasted seasoned. It was just meat and cheese fried up in a tortilla. The menu said they were the best. The menu is a lie.After the boring food and crappy service, I was a little upset. We waited about 15 minutes for our waiter to come and pick up the check, a bald old man sat at our table. I figured he must be the owner, Al. At 78, he was full of humor and seemed to really love being there. He advised us to stay healthy (ironic since I just ate a bowl of queso and fried food) and to enjoy life. Talking with him was the best part of meal. If I could leave a rating based off that alone it'd be 5 stars. Unfortunately, the food fell flat."], ["Chaitanya I.", "Loved this place growing up. Drove in from Dallas only to find that they close at 8:30 PM during the week! Website has listed hours to close at 10:00 PM. Disappointing."], ["Lorin M.", "We had the worst experience. We sat down and fans were blowing. Our 97 year old grandmother was miserable and when we asked them to turn the fan off the waiter told us he couldn't because the lights would go out.  After waiting 40 minutes our queso came cold and runny. When we complained he asked how hot we wanted it to be. After sitting there an hour we left. They kept telling us out food was next. The manager mocked one of us. Horrible restaurant food and people. Go to chuys!!!!"], ["Jeff B.", "I've been going to La Familia for almost 13 years and it is by far my favorite Mexican restaurant in the DFW area.  The owner Al, is a Ft. Worth icon and is still there almost every day.  You are greeted with a handshake, and made to feel welcome.  The service is outstanding, and so is the food.  I always order one of the daily specials, and am never disappointed.  The food is fresh and the atmosphere is great.  The salsa and the soup are great starters before the meal comes.I highly recommend giving La Familia a try!"], ["Catherine A.", "Cilantro lovers, rejoice!This is one of my family's favorite places to go to for Mexican cuisine. The service so far has never been anything short of excellent. The servors and staff are extremely attentive - from the very moment you walk in and are greeted with a welcoming handshake. It feels like family. If you're celebrating a birthday, you're in for a special surprise. Pretty much every dish is amazing. THE MARGARITAS... are totally worth it.I highly recommend trying out La Familia if you're looking for some fine mexican food near 7th."], ["Luke W.", "Went to lunch with my daughter and was very good all around, great food, fast and friendly service and prices were very reasonable. Only complaint I do have is the limited parking."], ["Kim C.", "We went to this place because of reviews on the internet. We wanted to avoid the typical Joe T. Garcias. I am so glad we went. Upon entering,  as others have mentioned, we received a friendly handshake.  As we were seated, they couldn't offer us service fast enough. It was very refreshing.  The decor was nice. It was modern, simple, and very clean. I enjoyed the photos on the wall. We ordered sodas so the drinks were standard there, but the chips and salsa were fantastic. I normally don't like \"fresh\" or raw type salsas, but this one had such an nice fresh tomato taste and smell, with the perfect seasoning and cilantro that I couldn't get enough. It isn't very spicy, but the freshness and flavor make up for it. I just cannot get over the impeccable quality and freshness of the ingredients. They make the salsa from scratch with fresh ingredients (never canned) several times a day.Next, the soup was delivered. I ordered the bean soup. It was delightful. It had a nice smoky flavor from the bacon, and the bean broth was fresh tasting for the cilantro. I normally really hate to have so much cilantro in things, but  the flavor did not overpower the soup at all. It was one of the better bean soups I have tasted.For my meal, I ordered a cheese chile rellenos. I order it at every place I try. This was also incredibly fresh and well made. I love that it had a light breading so that the flavor of the chile shined through. It wasn't greasy at all.  The ranchero sauce was the best I have ever had. It wasn't that thin canned stuff most places have. It was chunky, well-seasoned, and did not overpower the dish at all. The food here is a delight. The quality and effort put into the food is exceptional. It isn't the number one place I've been too, but very solid. If you are in Fort Worth, I very much recommend this place. I cant get over the level of service. they offer, and they only serve fresh food, never frozen or from cans."], ["South C.", "Ladies and Gents - though this place is adored in Fort Worth as a staple in the tex-mex realm, I must give it the lowest rating. Couple of reasons:First - this was the Restaurant that began the Great Drought of 2012 (several months where I couldn't eat tex-mex unless I was away on business... Let me explain. My wife and I ate here one night with a large group, and they'd run out of something in the menu that  we ordered so we defaulted to an enchilada plate. It was a mistake. Later that night my wife was sick, and then I got sick. Maybe from the food? Maybe it was fate? Either way, the food was admittedly sub-par, especially for an esteemed tex-mex establishment).B) - they ran out of food (?)4th - the food was sub-par"], ["Kevin N.", "So, first of all, this restaurant's deceiving in a good way: tucked into the middle of a strip center on Foch Street, you'd never once think just wandering by that some sort of cinematic offering might well happen within. But take one step inside and find out more. Intimately lit (or at least reasonably so), La Familia clearly aims to provide folks who drop in with a transcendent stop, from the handshake on the way in to the careful touches throughout. And I thought my dinner was tasty, the staff friendly, but something seemed a little bit off. For starters: this is a small beef, but as a beer nerd, there's no beer list, and when I asked what beers they had available, the waiter made one recommendation (Victoria, a beer I know well, a recent addition to the American market, backed by a major importer, and probably not nearly the most interesting Mexican beer they had at the ready). Anyhoo, that's that. Otherwise, the waitstaff but was near-by often (although I did feel like, oddly, one of them hovered around our table), and dinner hit the spot. I did enjoy the chicken soup they offered at the beginning of my meal.I'd like to get back in when I can linger and see if things smooth out. Time will tell."]], "Mercado Juarez": [["Tiffani D.", "Love the fajitas! Corn tortillas are yum. Chips are great. I love that it can hold large parties! Good prices! Pretty clean, not perfect. Service is good."], ["Heather J.", "We were staying at the hotel across the parking lot, so we walked here.The food and service was good, but I've had better. I would go here again if I didn't feel like driving anywhere. A bit overpriced IMO."], ["Monica A.", "Came here for lunch today and the food and service were excellent. I ordered chicken enchiladas and it is delicious! Not to mention, my food came out like 7 min after I ordered. Very fast service!! Good food and good value for what you get. Will be back!!"], ["Chuy V.", "I have to say that the place has really good food 4 out of 5 in my opinion and this is more aligned with Mexican food than tex-mex i had the carnitas and it was very good, my co-worker had the beef enchiladas and he said that they where good but they where made of ground meat (not very appealing to the eye) and i did knock another star for cleanliness the place is kept clean but the silverware and the glasses and plates had better days and that might put a damp on your appetite ... Still good mexican food at a decent price"], ["Joyce L.", "Our group of four went here for Valentine's Day.  I was expecting mediocre service because of the holiday, but I must say we had great service during our 6:30-8:00 p.m. visit.  Entrees chosen were Juarez Special, Pollo Con Hongos, Pork Tenderloin Fajitas, & Chicken Fajitas.  Food was really yummy, portions very generous & good value.  Beverages chosen were draft Dos Equis Amber & top shelf margaritas--all fairly priced during happy hour.  I am very fussy about my margaritas & these were right on the mark!  Only marginal comment is Juarez Special could have been a bit hotter.  We definitely recommend and will return."], ["Chris H.", "Been going here for probably 20 years. I always love this place! Chips and Salsa are great. Flour and corn tortillias are the best and taste home made. Sometimes the food is hit or miss but the service is always good. anytime I am in Fort Worth I try to find time to eat there."], ["Shelly R.", "This is one of my favorite mesxican restarants. They have the jamminest tortillas around! the salsa is warm and yummy. Tortilla soup is the shit and fajitas are the best!chips and salsa all day erry day"], ["Terry H.", "Where do I begin?  We took my father in law out for his birthday dinner this weekend.  We had been here several years ago and it was great.  Not so much this time.We ordered the fajita queso for an appetizer and they brought it out quickly enough, but no plates.  Plenty of flour tortillas, but the five of us really didn't want to be dripping hot cheese everywhere.  By the time by brother in law could get a waitress to bring us some plates, lo and behold, our main course was served.  No consideration for us even tasting our appetizer first.  For the main course, my father in law and his date each ordered enchilades.  His came with no cheese and he loves cheese!  No idea why this was so.  She only ate a little of hers and did not want a to go bag.  My brother in law ordered the Pollo con Hongos, or adobo smothered chicken breast with mushrooms.  He was surprised when this was served on a sizzling plate like fajitas, but not sliced.  He had a side plate of beans and rice, with cheese and guacomole, but there was no room to slice his chicken.  He said the adobo was bland and slightly sweet.  No heat what so ever, so he asked for jalapenos.My husband ordered the pork fajitas.  He said they were so-so.  Not much flavor, but eatable.  I ordered the cabrito al pastor.  Wish I hadn't.  The meat was without flavor, and it was cooked to pure mush.  Again, we got our food and side plates, but no plates in which to \"put together\" our fajitas.  This was on a Saturday night, roughly 6:30.  No excuse for not being ready for customers!Needless to say, we will not be back.  I'm really sorry to see what was once one of Fort Worth's finest Mexican Restaurants go so so downhill."], ["Miles M.", "I've always wanted to go to this place since i pass it every time I go to Ft Worth.  It just seems as though this place would be great since it's kind of away from everything and there are always plenty of cars in the lot. The salsa and chips were pretty good i must admit, but it all went down hill from there.  Now i was pretty hung over so i was a bit dehydrated.  This meant i was sucking down waters pretty quick, so i let it go that i had to wait for a refill several times.  As you may or may not know i normally order the chimichanga as my standard to compare with other mexican resturants.  Well i must say this is by far the worst chimi i've ever had.  I chewed and chewed that chimi, but it just wouldn't break down lol  I could go on and on about how bad it was, but you get the idea.As far as the place goes it was a typical older mexican resturant.  I did like the trees in the place, but i felt that the place wasn't as clean as it should be.  Also we arrived late and out of the whole place they sat us nearly in the very back where the waiters were cleaning and putting chairs up on the tables.   I hate that!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!  I'm all about giving places a second chance, but there is really no need to do so seeing as there are tons of places that i haven't tried."], ["Kelly Y.", "Um...this place is okay.  The restaurant was kinda dark, but that was okay.  Quick service and friendly server, but the food was nothing to really write home about.  I ordered the veggie fajitas (which are not vegan, I came to find out).  It came with a lot of vegetables, but the majority were onions hidden under a layer of squash.  The tortillas and salsa weren't too bad.  I didn't touch the beans because meat was floating in the bowl...yuck.  The guacamole was okay, but not the best I've ever had. The employee at the register had no personality at all, not saying a word as we paid.  Might as well have been a monkey.  I probably won't be back, as it is not vegan friendly, but meat-eaters might find it enjoyable. The two I were with thought their food was okay (veggie shrimp fajitas and tacos).  Neither one of them got a to-go box, which is a sign that the food isn't worth the trouble of transport."], ["Jeff L.", "We came to this restaurant without doing any real reconnaissance, but we were pleasantly surprised. The giant schooners of beer were thoroughly refreshing and the ceviche tasted wonderfully fresh. My wife dug in happily despite her general indifference to seafood. I believe I could have eaten a bucket of the stuff myself. Good value."], ["Richard S.", "Great mexican food.  Salsa/Chips/Queso gets high marks.   Fresh made tortillas also a win."], ["Jessica E.", "Horrible. Just horrible.We were there with a big party in their banquet room. The service was very slow, but the biggest problems came when our food arrived. We ordered the fajitas for 2. When the waiter brought out our order, he brought only the meat, and the plates that had the rice, beans and toppings on it. No plates for us to actually eat off of, and no tortillas. Next time he passed by, I asked him for the plates and tortillas. He came back with one tiny appetizer plate, still no tortillas. When I tried to explain to him that we needed real plates and tortillas, he literally just walked away. We made eye contact, so he knew I was talking to him. No chance that he didn't. Just walked off mid-sentence. We walked by again, and I flagged him again, and explained what we needed. This time, when he came back, he brought 4 plates and 2 stacks of tortillas. Nice attitude, buddy.The fajitas were tasteless and made with cheap meat. Other than that, it was just run-of-the-mill. Certainly nothing special.I also noted several dead roaches on the floor on the way back to the banquet room."], ["Chow C.", "Went to MJ as an afterthought. Had my family with me and we had been running errands most of the day. So we swung by after the lunch crowd. There was only one other customer sitting in the dark. I asked the hostess for a table. We were seated and the hostess was courteous, and so was the little lady that brings out the chips and salsa. But holy moly, then attitude came swaggering over. The attitude that reads...\"I wish you weren't here because I don't feel like working...\" Once she took our order, I asked her for a small side of sour cream for my fajitas. She brought out the food like 30 min. later and she said, \"Oh I forgot your tortillas for the fajitas..\" Okay, everyone makes mistakes. So I waited..and waited...and waited. Then my sister had ordered the Tortilla Soup and she was unhappy about it. It had about a cup of shredded tortillas in about a 1/3 cup of broth. And only about three 1/8 size bits of chicken in it. For $6.99, you would think they would bring it in a big bowl with a good serving of broth. So, I told her to scoop it out of the bowl and place it in one of the empty salsa bowls. I gave her a bit of my chicken fajitas. The fajitas were okay..meh. The server asked if everything was okay on osmosis mode, but I had to stop her in her tracks and asked if she could bring out a little bit more broth for the soup. She looked at me and sarcasticaly told me..\"Well it is tortilla soup, that is what it's based upon..\" I said \"Well it's suppose to be tortilla soup not a masa bowl!\" Okay, so by now, she wanted to put me in my place, and she asked my sister..\"Do you want another bowl?\" I thought...(Hell no! Why to charge me again for crap?) Anyway, my sister apologized TO HER..and said to let it go. But after that little exchange I couldn't finish my meal. Made me sick. Then she disappeared for about 30 min..never asked us if we wanted refills or anything. She just cleared the table and I could see she was standing against a wall near the kitchen..talking and pointing towards our table. Sheesh! So now it's time to pay and get the heck out of there. I told the cashier about what happened and then she told the manager. Then he told me that it's a recipe that is portioned out. And at first he was trying to argue with me..but I told him about the server and what happened, and so he said that he would give me discount. I guess he figured the customer is always right. And Believe me, I have eaten at different places where they serve tortilla soup. And my friends, this is not it. For good tortilla soup, either make it at home...or try Pappas Burgers, they have an appetizer Tortilla soup and the bowl is bigger than at MJ's and also On the Border. The chicken is all breast meat, and tender and has very few chips on its. The broth is not cloudy or overly seasoned.  So this was my experience."], ["Jennifer C.", "Traditional mexcian restaurant!  We have tried several things here and they are all good.  The salsa is spicy (bonus in my book!). For you chile heads, the habanero queso is to die for!!  The flautas are also amazing - super crispy with well seasoned chicken.   The service is attentive and friendly."], ["Amy S.", "I love everything about their chips and hot sauce!!  If that was what my rating was based on this place would get 5 stars!!!  However the rest of the food is just ehh.  Worth eating, but not the best I've had!  I've ordered the tortilla soup which is not bad, but not my favorite, arroz con pollo has been my favorite thing I've had there but it's only on the lunch menu.  I still drop in just for the hot sauce but without it I would never stop my car. . ."], ["Chloe A.", "Ate here with family, there were lots of us, so we were seated in what I guess would be a \"banquet\" area. The privacy was nice. I love the interior of this restaurant, pretty cool. The food was awesome, I had the spinach enchiladas, they were very good, didn't eat too much of them, though as I'd gotten full on the delicious tortillas prior to the meal. lol. The tortillas were great, as were the chips, salsa, & queso. The chips were very fresh tasting. I've been trying to go back here every since that evening. Good food, good service."], ["Regular J.", "So here I am trying to fall asleep but i just couldn't with out getting this review off of my mind....I ate here tonight. I could have sworn the first time I ate here I couldn't stop telling people how good the enchiladas were. IDK what happened. Now they almost taste like those microwavable enchilada dinners that Momma would heat up really quick for us kids while we played outside. Then she would lie to us and say that she made them from scratch and love....It tasted a bit cheap is what I am saying...even though the chicken enchilada dinner was a Special for like $5.99, I didn't expect it to taste So dang 5.99....I should've gotten the Fajitas, Someone next to me got them and I couldn't stop staring at them, and smelling them....I was soo in their business. Try the fajitas next time that is my Goal!"], ["Stephanie L.", "Great Fajita Salad, very tender beef and first taco salad that I've had that had queso on it as well as grated cheese..so much for my diet...but it was yummy!  I knock em 2 stars cause of slow service. We waited a long time for our meal and also for our check."], ["Val P.", "I ate here with my husband and my parents tonight, although I've been here several times.   My mom and I had the parradillo to share- beef fajita and shrimp.  Both were great!  The fajita meat was very tender and the shrimp was also cooked to perfection and large.  There were definitely left overs to take home.  I thought the seasoning was good as well but not overpowering.  My dad had the cabrito which I am so fortunate that he was willing to share!  Cabrito is slow roasted goat-they roast the whole goat and then serve you a portion.  It is absolutely delicious.  My husband had the beef chimichanga, he ate the whole thing!!! The waitress was very attentive without hovering.  My only complaint is that the margarita-on the rocks- was way! too sour.  But I will definitely go back!"]], "Salsa Limón Museo": [], "Torchy's Tacos": [], "Enchiladas Ole": [["Loc L.", "Delicious food, friendly staff, and great value!!Fresh salsa & crispy chips.Ordered the enchilada sampler plate: chicken with sour cream sauce, chicken with mole sauce, and brisket with savory sauce; all were very tasty & piping hot.  Rice & beans were also very good.Will definitely return to try other items on the menu."], ["Robert P.", "Well, this is a \"follow up\" review, which seemed like a good idea since we just returned from an extended trip through New Mexico and Colorado where we were completely frustrated because we couldn't find Mexican food nearly as enjoyable as that at Enchiladas Ole!  Certainly, there is no shortage of Mexican food eateries in New Mexico and Colorado, but we found nothing that came even close to the quality and freshness of that has completely spoiled us at Enchiladas Ole.  Heck, knowing that great Mexican food was just minutes away made coming home even more enjoyable!The Hatch sauce on their vegetarian enchiladas is more magical than Disney World!  Ole!!"], ["Carl I.", "Began with chips, which were dry. Not the place for chips for me, but I didn't come for the chipsHad the 3 enchilada combo: cheese with their house sauce, brisket and chicken curry. Brisket was more flavorful than the cheese. The last is a unique combination and delicious; the reason I wanted to try this place.and went away satisfied."], ["Daniel K.", "Wow..my colleagues and I came here after reading the Yelp reviews and we loved it! We each got the two enchilada plate for lunch (Texican, Street, and another one enchilada that I can't remember the name). The staff is very friendly and helpful. I will definitely come back the next time I'm in Fort Worth."], ["Mark B.", "Holy tamale this place is da bomb when it comes to enchiladas!  I started off with a small guacamole salad that was just as it should be. Fresh guacamole with some tomatoes, onion and garlic. For my entree I decided to try one of each of the ground sirloin and smoked brisket tacos. While both were first class the brisket enchiladas are what the Greek Gods would have demanded be served for every meal. You could taste the smoked in flavor. The meal did not end there. They have the BEST refried beans and rice I've had since my grandfathers. Theirs may even be slighttttly better.If your within 20 miles of this place - GO. You'll be back."], ["Truitt M.", "This is our main go to for enchiladas.Outstanding food.The service is always good even of busy nights.Mary's sauces are some of the best I have ever had.I have been all through Mexico as I use to race down there in road rally races and the sauces Mary makes are very authentic.Many do not know that Mexican food vary greatly throughout Mexico. One style of sauce or food in northern Mexico will taste totally different in southern Mexico. Real Mexican food is nothing like Tex-Mex most people are use too.Mary cares very much about her customers and the quality of the food she puts out.If your not happy with the food or service Mary will make it right by you.All I can say is if you don't like the food go back to Taco Bell and keep eating dumpster Tex-Mex."], ["Richard N.", "My colleague and I decided to try this restaurant after seeing the Yelp reviews.  We were working at a facility nearby and went here for lunch.  The food was fantastic!!!  I had the beef brisket enchilada and curry chicken enchilada covered with mole sauce!   The mole sauce is the best that I have ever tasted in all my travels across the USA.The wait staff is super friendly and very attentive.  They checked on us and refilled drinks whenever a top-of-the-range was needed for my glass.When I paid my bill, I td the young lady behind the counter that it was our first visit and we would be back.  The owner stuck her head out of the kitchen window and asked how my meal was today.  I told her that we would be back!"], ["Heather B.", "Disgusting!  It is so hard to find a decent enchilada...I really thought they would have an awesome enchalida, after all they specialize in them.  OK so I had the cheese enchalida, absolutely terrible.  Completely drenched in sauce (i believed to be canned) way too much cheese.  Also had the chicken enchalida with the green sauce,  it just tasted weird...the chicken was awful. The chips are not served warm and the salsa has way to much cilantro and really no spice or flavor other than cilantro and tomato. ..the beans were watery and the rice is too mushy...  honestly does not seem authentic. My step father's mother is from Mexico and I love her food!  That is legit mexican food. Not impressed and wondering why people are raving this food...it's a sloppy mess but Maybe it's me because the 4 people with me loved it.Plus service is fantastic.  You don't get service like that in most places anymore.   5 stars for them. But 2 for overall because I think the food sucks."], ["Shawn S.", "Great place, very friendly staff and food was great. They have some growing pains so don't go looking for fantastic service. I'm sure it will improve because of their great attitude. Food makes up for it. The salsa was great, the person that said it \"was too much cilantro\" is a fool, food is art. Just because you don't like something, doesn't mean it's bad. I Loved that it had lots of cilantro, it's was fresh and great consistency.My sister and I will be coming back for sure."], ["Gabriel C.", "The enchiladas are not authentic! Bad service bad answers bad employees I wouldn't recommend it at all don't waste your money on this place not worth a penny!"], ["Mirtila L.", "The food is absolutely delicious! The street enchiladas had bold flavored that blended well. Spicy and moist Mexican rice, Limey and fresh enchiladas with tomatillo sauce, black refried beans were just okay (I'd probably order a different kind next time).Why not 5 stars? Service. They didn't know what table number was what and so orders were getting jumbled up from the kitchen. Would I eat here again or recommend this place? Absolutely! But I'd also strongly recommend to do takeout."], ["Jahn M.", "Great food with a great staff. If I lived in Texas again I would come back all the time!"], ["Peter H.", "This place is awesome. The staff is great - always friendly and very helpful. I've dined here 5+ times and the service is excellent every time. The location is a little cozy, but that's not a bad thing. Parking can be tough. Definitely not a reason to pass on going here. I have yet to be disappointed by anything the menu. Nachos are piled high and covered in awesomeness. All of the enchiladas are excellent. The Texican and the Street enchiladas are my 2 favorites. Everything is fresh and at a great price of $10 per plate or less."], ["Will W.", "Heard about this place through Instagram. And it was worth it.Started off with some chips and salsa. Chips were nothing special but the salsa was fresh and delicious. Ordered the original enchiladas with brisket and I'll just say, da-yum were they good. Rice and beans accompanied were spot on. I'll be back."], ["Sammie L.", "Best wedding decision we made.  We had Enchiladas Ole cater our wedding and the food was amazing (as it always is) and the staff was INCREDIBLE.  It should go with out saying they were friendly and easy to work with because the service at the restraint is always top notch, but they were also happy to tell people what ingredients were used as there were vegetarians and guests with allergies.  They welcomed the questions instead of being out off.  Everyone loved their meal, and I never once was concerned with how it would turn out. As always an amazing experience.  I should also mention they drove clear out to Forney.  What an amazing, talented team.  Thank you all for being a part of our special day."], ["Dan A.", "BRING A STRAW. The salsa verde is that good. Brisket and chicken enchiladas smothered in this is heaven. The chips and salsa have great flavor. The salsa verde is so good I buy a bottle. I landed at DFW. Rented the car and drive straight here. Phenomenal. Stay hungry."], ["Ileanna R.", "I come here very often. The first time I came the enchiladas were so good I couldn't wait to go back, the second time I ordered the street brisket enchiladas and they were burned. The green sauce is really good, the rice and beans not so much. The service is average, we haven't had great service here. I tried the mole enchiladas and those were good too, the mole was a little sweet. I personally like sweet and spicy mole but this one was too sweet but the chicken was good."], ["Mark T.", "This place is special: incredible value, AMAZING food, hard-working and friendly staff. Enchiladas Ole has become the Go To lunch spot for my office when it's time to celebrate. Vegetarians have yummy options and the brisket is out of this world. Oh, and they cater too! Best. Meeting. Ever."], ["Linn P.", "May I say, one of the most wonderful services we have experienced in a while! Our waitress, I think Stephanie, was so nice! And my husband and I felt like this was a very sincere nice, not the type just faking it to get tips.  Since they can't sell beer, they offered a free one to anyone over 21.  How nice!!!! I think it is BYOB. And they bring out chips, salsa, and a small bowl of noodle soup!!! At least I think it was noodle soup.  Either way, my husband really enjoyed it and ate my portion too.  Parking is limited. My husband and I got the enchiladas and they were so so.  I was craving mole since I had some great mole on my vacation to Mexico a month ago.  So we were excited to find a restaurant nearby.  I could eat this... But it was VERY sweet and I'm used to mole having more spices than sweet.  The enchilada chicken mix inside was different.  It looked like it was cooked with curry. I liked it but my husband didn't. All in all.  We thought the food was average. But the people here are so fantastic, we would stop in here again and try different dishes."], ["Christine L.", "Went here yesterday with hubby on a whim around dinner time.  We weren't hungry and wanted to kill time before an event and hubby wanted a beer.  Got on yelp and found this great hole in the wall. Very small restaurant and very friendly and fast service.We were seated right away, drink order was taken, and they gave us chips and some very fresh and delicious salsa.  They even refilled hubby's salsa when they saw it run low.  No beers on tap.  Hubby got a bottle of tecate.We asked what was recommended and our waitress recommended the Texican enchilada - enchilada with brisket.  I believe the plate usually comes with 2 enchiladas but we weren't too hungry. Waitress was quick to suggest she can just do one enchilada. I mentioned I wanted to try the guacamole and she was friendly enough to tell me the plate comes with a small portion of guac so I don't have to order an additional since I wasn't too hungry. I appreciated all her suggestions....very honest and not pushy.  As we were waiting for our food, we were reading articles about the place and owner on the wall.  No lard and no preservatives to name a few.  They have this sign I really liked on the wall that said something along the lines of, \"It takes months to find a customer but only seconds to lose one.\"  You can tell the staff knows it by heart bc they really treat you so well.  Our Texican enchilada came with rice and beans and scoop of guac. It did not disappoint.  Cheese was delicious.  Brisket was moist.  Tortilla was moist.  Rice was moist and flavorful.  Guac was fresh but a bit limey.  Beans weren't bad. Hubby and I usually don't like beans and usually order double rice but we didn't realize the sides that came with the order to ask. Anyway, remember I said we weren't hungry and hubby just wanted a beer?  We licked that plate clean.  We will definitely be back."]], "Mi Cocina Restaurant Sundance": [], "Tina's Cocina": [["Patrick W.", "Stopped in for a little brunch, and was very impressed by this little place.   Great food and what a great value!  I had the eggs and chorizo.   Not greasy, terrific taste and all for $4.50!   You can't beat that."], ["Adam H.", "Pretty good! The tacos are all great, and authentic, especially the chorizo. The salsas could be a little spicier, and one of the meats was a tad bland, but a good, satisfying meal otherwise. Staff was also very nice and helpful."], ["Antony C.", "Very nice staff, good authentic selections like pozole, Picadillo en fideo, and good taco selection for cheap, the owner promised tripas and menudo soon, but not soon enough for this intestine lover ;)"], ["Cynthia B.", "I decided to give this place a second chance today only because everyone seems to like it. I ordered the breakfast burritos and was again unimpressed. I thought to myself \"how can you mess up breakfast burritos?\". Well you can and they did... they left the cheese out! This place is mediocre and I won't be returning."], ["Ryan H.", "We have been here for lunch a few times and it's always a good choice.  They have an excellent ceviche tostada and their tacos are very good."], ["Amy G.", "Best breakfast tacos. Period. I am a Torchy's fan but Tina's tacos are the best. And who can beat $10 all you can eat brunch when you can bring your own champagne?? Awesome!! Jesse was very friendly, except he seems to be a Philadelphia Eagles fan! Will definitely be coming back here."], ["Michael W.", "Just ordered two burritos. The rice was well executed and the flavor was great. The dining area was clean and the smell of good food greeted me when I walked in. Unfortunately, I ordered a Carnitas burrito and I received a rice burrito with a two ounce garnish of Carnitas. I brought one home to my friend and after eating her burrito she glanced at the togo menu and recommended that I try the Carnitas next time. I informed her that she just had the Carnitas burrito. She really thought that I ordered a rice and bean burrito for her. I'll just head back to my favorite taqueria next time."]], "Mi Cocula Mexican Grill": [], "El Asadero Mexican Restaurant": [], "Pappasito's Cantina": [["Erika C.", "I have been living in Fort Worth for over 10 years and recently accepted an invitation to Pappasito's.  I rarely enjoy going to chain restaurants, much less tex mex places.  Needless to say I was impressed with this place, the chips are thin and slightly oily............the only way I eat tostadas.  They presented us with three different salsas, ranging from mildly hot to moderately hot, ensuring to please everyone's spicy tolerance.  I order their Mexican soup and calamari and was blown away.  Their calamari pieces where large, tender, and only slightly battered.I will go back just to eat their calamari again and look forward to trying much, much more."], ["Ashley S.", "I read alot of ur comments and decided to try this place out. I dont know if it was a bad night but I feel like I wasted $98.00."], ["Jim W.", "Tables are too small for four people, tables spacing is too close together and service is poor."], ["Ryan S.", "Service is pretty damn good every time i go. Comes out quick, hot and delicious. Fajitas and stuffed shrimp are AMAZING. Also note the chicken tinga enchiladas=best ive ever had. Dessert is good too. Tres leches cake is BOMB. Probably my favorite tex mex spot."], ["Ava P.", "Food was really good. Sat out on patio, it was a nice night. Service wad a little slow, think the waitress a s tired or really not into her job tonight."], ["Tara L.", "The big guy LOVES Pappasito's and when I asked him where he wanted to go for his birthday, he said he wanted to go to Pappasito's. So we made our way there on a Wednesday evening just before 6:00 p.m.The joint was already on its way to being blown out! On the up-side, Wednesdays after 5:00 is 1/2 off fajitas for two - hooray!! We were seated quickly and were greeted right off by our server, DeShawn. DeShawn was super-friendly, efficient, knowledgeable of the menu, and everything that you'd want in a waiter. In fact, the whole staff works like a NASCAR pit crew - totally cool. But man! Why does their chips, salsa and $10 house margaritas have an aftertaste that's kinda like vom? I just don't get it. The big guy doesn't have the same experience with their food - he thinks it all tastes great... so good! The combo chicken and beef fajitas were good. The beef fajitas were just a little undercooked, but I'm not scared of a little medium-rare beef. The portion of the order was mighty small, though. The best part of the night was the gentleman at the next table who broke into Elvis's version of Happy Birthday - he was my most favorite part of my Pappasito's experience!! I'll continue to eat here - only because of that big, sweet man."], ["Connie N.", "Outstanding cuisine; excelling in their Campfire Fajitas! I really loved the atmosphere and the service.  This restaurant was A-1.  I will definitely return and highly recommend Pappasittos to others!"], ["Greg D.", "3 hours later and I'm being held hostage.  We can't get our bill as they don't know how to print out the check.  I finished eating 2 hours ago and I'd like to go home. Stay away if you can"], ["Alex M.", "While I haven't tried the Fajitas that everyone (and Papasitos) recommends, I have tried their combo meals and my god, they definitely satisfy to say the least.  I've read a lot of reviews from various Mexican restaurants and it seems like everyone always says \"BEST MARGARITAS EVER\" or \"OMG WTF TRY THE MARGARITAS\" so I usually don't pay them any attention but I did get a margarita after reading what other people said here and I gotta tell you, it was good.  It wasn't too sugary, it wasn't too sweet, and it had that bite that good margaritas have where you know it has alcohol in it.  So I guess you can chalk me up to one of the many who say \"OMG TRY THEM!\"As for the rest of the menu, you can take a glance and see there are some expensive things on the menu, and while I'm not opposed to buying them, I'm one of those guys who wants to try everything at once so I tend to stick to the combo meals they have.  Taco, enchilladas, tamales, beans and rice, all on one plate and you can't go wrong.Let me tell you, I'm not a big fan of Tamales and by \"not a big fan\" I mean I don't eat them ever because I don't like them so the only reason I got one (twice) was because it comes on most platters.  Well, the Tamale was the last thing I ate and I regretted it immediately.  The pork tamale is, hands down, the best I've ever had.  If you get it, eat it as soon as it hits your table.The service is decent for how packed it gets.  The first time I went our waiter was awesome (I wish I remembered his name.)  He welcomed us to the restaurant, got us the usual chips and salsa and because it was our first time coming we got some queso for free which was sweet.  Then after watching me devour the salsa he asked if it was good enough to which I replied \"yeah it's good but could be spicier\" and he went into the back and brought me out some special salsa with 2 habanero peppers in it which was phenomenal. I could go into much more detail but this is long enough as it is.  Check out Papasitos and if you're not sure exactly what you want, try one of the combo platters and have a taste of what they have to offer, you won't be disappointed."], ["Matt B.", "This is an extremely solid Mexican restaurant. It feels like a chain, certainly not authentic, but the food is quite good. Being perplexed about whether or not this is a local spot or not is certainly overshadowed by the nice dining experience, extremely helpful staff, and wonderfully delicious food. We had the \"Superior Combination\" split between two people and it was plenty of food. Tip: Put a little extra salt in the fresh made guacamole, otherwise it was great."], ["Kristina W.", "We usually love the beef fajitas here, but were disappointed with the service & small portions last time we were here about a month ago with our 2 small kids. Waiter was friendly but took a long time for food to arrive. We asked for extra avocado, didn't know there was a $1.5 for 4-5 small pieces. We only received one, but were charged for 2. The family size beef fajitas barely fed 2 people. I felt bad eating the meat bc our kids loved it. We got some to go order with us, the fajitas for 2, found NO RICE & BEANS in the bag, & a portion that was just enough for 1 person. We sure overpaid for our meals!!! We will not go back in a long...time & will find an alternative restaurant to eat beef fajitas."], ["Vickie S.", "All I can say is it's an overpriced (really, it's just Mexican food), average food at best place. We had a large party for a special occasion and we were all disappointed. We had to send a couple of things back they tasted so bad. The noise level was really loud which made it difficult to talk to the person next to you. The service was okay considering we had a lot of people, but that is the only good thing about the experience. Will not be going back."], ["Angela T.", "I would like to give this location more stars but I really can't.  What is happening to Pappasitos... Is Thurs night usually dead? Is the food prepared ahead of time and plates sit under the warming light?  We ordered the Laredo and shrimp taco plates, we didn't have to wait very long before our plates came out.  When we tried the food it, was lukewarm, the corn tortillas were very dry, the shrimp wrapped in bacon seemed to have been re-heated and the boracho beans, goodness, was a whole salt package emptied into the beans, we couldn't eat them.  We let the server know about the beans but he didn't know how they should taste since he didn't eat them regularly. Oh, and the couple next to us fighting about their relationship, ughhh who wants to hear that when you're trying to enjoy you evening, throw people like that out, but why would Pappasitos do so, the couple was ordering drink after drink.... We'll stick to Pappadeux next door, much better experience!"], ["Kevin P.", "I thought the food here was good,it was my first visit.We got the large combo fajitas that would be $42 but we came on Wednesday after five so they were half price.It was a nice plate of fajitas w/ beans n rice.Was asked if we wanted 2 of the beans n rice and of course we did,extra charge for that,,hmm.I would say the fajitas were good nothing special and the service was good.If they are half price they are a good value otherwise they seem overpriced.."], ["Andy T.", "Came here from out of state visiting some friends.  Seated quickly and waitress was attentive and courteous.  Was going to order a drink but she said they don't accept out of state IDs.  What?  Did I hear her right? Is that not the purpose of an ID?  Well after I was like okay well I've been flying all day and want a drink, she said it was okay and proceeded to take our order.Anyhow, to the fajita enchilada which was great, chips and salsa were a nice addition to the table.  I did notice that they deliver beer in these chilled chalices which are very cool looking but they do melt quickly so you end up with a table full of water and ice.  I guess I'd just rather have a normal glass than the mess.Overall, good food.  A little confused that they don't accept out of state IDs for carding people but I still got my drink so oh well."], ["Noelle W.", "AMAZING.Try the shrimp Bruschetta.Never disappoints"], ["Cee G.", "THIS IS MY FAVORITE RESTAURANT OF ALL TIME (for tex mex). The fajitas are the bomb. The meat is so tender & melts in your mouth. The margaritas are also amazing. Expensive, but amazing."], ["Rachel M.", "Good food now = tummy ache later."], ["Reena D.", "I've had better service at a different Pappasito's.  Seems like our waiter was READY to call it a night.  He was a bit rude in the beginning.  I asked for a straw and felt like he was throwing the straws at us.   My friend order fajitas and it came with stale/old tortillas.  The tortillas were CRISPY!  He wanted to wait on some fresh tortillas.  While waiting for the tortillas which took a long time as their machine \"crapped\" out, his food got cold.  Who wants cold fajitas with hot tortillas? LOL  We were able to correct the situation and in the end he got a whole new order of fajitas with some fresh tortillas.  Our waiter's attitude change for the better.  We all had a good time here but hopefully next time our service will be better!"], ["Reba G.", "We didn't receive the best service, or maybe the waiter was just ready to go.  The white queso is great though, but I wasn't a fan of their chips.  It tasted a bit off like it was fried with coconut oil or a special oil.  A friend ordered fajitas, his tortillas were supposed to be flour, it came out as a crunchy hot mess.  The waiter took it back, and either the tortilla machine maker crapped out, or they turned the machine off early because it took forever to get fresh tortillas.  So while waiting, his food got cold, but the good thing about the service is that they replaced his meal with a fresh meal.  Pappasito's is tex mex, but I've had better at a cheaper cost."]], "Tacos Ernesto": [], "Los Paisanos Restaurante Y Taqueria": [], "Mi Cocinita": [["Manuel M.", "Have been there several times and can't get enough. Staff is ALWAYS super friendly and the food was out quick. Food is always made fresh with Virgie at the helm in the kitchen. The enchiladas I had didn't have the usual chili con carne but more of a mole sauce. It was awesome! Looking forward to next time."], ["Michael S.", "Co-worker told me about this great little house/restaurant nestled in few blocks from 35W south of the Berry exit. We waited for a nice enough day to eat there on their patio. Unfortunately the patio was closed, but enjoyed the indoor dining area of 8 tables.  Met Virggie who talked me into daily special of Chicken and Rice. Excellent choice and great service. Good chips and salsa too.A couple of notes: Street parking in a neighborhood, enter by walking past house and towards garage via driveway, go to back to order at counter, seat yourself and they deliver to table, and finally it is a cash only!"], ["Megan T.", "I went for the first time this week and have craved more every day since. Such a wonderful small family establishment with delicious food. It's like going to a long-time friend's grandmother's house for dinner. I tried the Betty's Plate and everything was perfect! I can't wait to go back and try the Sampler so I can try the sour cream chicken enchiladas!"], ["Jesse T.", "We just tried this place for the first time yesterday. It was very, very good. Cheese enchiladas with chili con carne was excellent, second only to El Fenix in my opinion. The beef enchilada was terrific and their little beef tacos are in shell bowls as opposed to the traditional taco shell. Everything that we tried was extremely fresh. We got there about 12:30 and they were out of chicken dishes, but we very much enjoyed everything we tried with the exception of the chips - they were fresh but extremely salty. My wife likes salted chips but these were too much even for her. The oversalted chips are the only thing keeping this from being a 5. All of the service is fast and super-friendly. Also, they have great homemade Arnold Palmers if you like those. We will definitely be back and try to make it earlier to try the chicken enchiladas. Note: At one time they took credit cards, but at this time they are cash only."], ["Jenn G.", "If you're looking for an amazing homemade meal from the sweetest people, then you've found the right place.  It's hidden in a residential neighborhood in a garage, but once you find it, it's amazing.  I had the sampler plate, and would have taken a picture, but I ate it too fast and forgot.  The business is family owned and they take great pride in their work and product.  I'll definitely be going back and bringing friends and business associates!  Just remember that they are only open on Wednesday, Thursday and Friday from 10:30-3:30 and it's CASH ONLY!  BYOB as well..."], ["Joe P.", "After leaving a funeral on that side of town, I had a seriously hankering for some good mexican food.  Boy, did this place ever fit the bill.  I can't believe I have never dined here.  It has been operating since the early sixties.  I could not find it at first due to the fact it was behind a house in a residential area.  It was a cozy little place that totally floored me.  I had a sampler.  The cheese enchilada was one of the best on the planet as well as the chicken sour cream enchiladas.  Bean and rice good as well.  Quacamole was tasty. I sat by the kitchen and got hear some good kitchen banter which I always enjoy.  It gives a place character.  I left fat and happy. Good outside dining.  Cash only.  BYOB if you want a libation. Open from 10:30 A.M. to 2:30 A.M.  I will go out of my way to go back."], ["Julie S.", "Oh my, oh my.  Have you been here yet?  WHY are you still sitting here reading, then?  Oh, maybe it is M, Tu, Sa, or Su when they are closed.  Fine, you are forgiven.I really do not know where to start with this review.  It was a fantastic experience all around.  We walked in on a Friday around 115 to a dimly lit enclosed carport with pretty good AC and several tables eating their lunch.  The divine smell was evident as we walked up the driveway.  We weren't sure where to sit and, luckily, another table directed us around a corner to a counter where we could order.  The lady behind the counter was the owner, and Betty's granddaughter (I think, maybe her great-granddaughter).  She was very nice and chatted about how we found Mi Cocinita and the menu.  We ordered a sampler plate (chicken sour cream enchilada, cheese enchilada, crispy beef taco, rice & beans) and a Betty's plate (Beef enchilada, cheese enchilada, guacamole tostada, beef taco, rice and beans).  Good news!!  They NOW TAKE CREDIT CARDS!!The owner brought out a plate of delicious tamales to thank us for trying out their little restaurant.  The chips and salsa were made in house and were fabulous.  The guacamole (according to hubs) was some of the best he'd ever had and the beef tacos were perfectly seasoned and and delicious.The enchiladas (all three kinds!) were very, very good.  Hubs thought the sour cream sauce was a bit overpowering, but I really liked it.  The rice and beans were also excellent, they tasted just like they should. If you can work lunch on a We, Th or Fr into your schedule you should make it a point to head out here!!"], ["TexasPossum T.", "Well sh...oot  I had just typed a glowing review, and my computer ate it.  (razzle frazzle)The upshot of it is this: You HAVE to try this place. I'd give the food SIX stars if I could. The owners made us feel like old family friends. The converted garage is super cute (busy Tex-Mex joint decor). The handmade tamale was pretty close to perfection. Both of us liked the delicious but quirky beef taco. The enchiladas were made to order and not pulled out of a steam pan.Very reasonably priced. $5.95 - $10.95 Limited hours Wed., Thurs., Friday 10:30-2:30 Cash only."], ["Danielle D.", "After reading the reviews for this place I had high hopes but was disappointed. The service was fine and the staff was very very friendly and the little converted garage was cute but the food was not that great at all. The beans honestly tasted like they came from a can and the rice was mush. However the salsa was delicious. When we went I ordered tacos and my boyfriend ordered a sampler and they brought my food out the second we sat down and I waited for almost 15 minutes before his came out and my food was cold by then because of course I was waiting for his food. The cook later came out and apologized because her oven stopped working. Was good but not great. I may go back but it won't be soon."], ["Kenzie S.", "Amazing!! I am a TCU student and was moving in for my sophomore and we saw it on yelp and thought, \"why not?!\". We walked right in to the sweetest service. It wasn't expensive and BYOB. It was the BEST Mexican food I have had. The service was great! The food was out within 5 minutes and the amount of food we were served could keep me happy for a week. It is interesting driving up to Mi Cocinita because it is pretty much in a garage. But my dad and I loved it and couldn't stop talking about our hole in the wall find."], ["Anthony S.", "This is the best Mexican restaurant in Fort Worth. The staff treats you like family. I would go here everyday if it was open everyday."], ["Jasmine L.", "Love this place!  Went for Sunday brunch before the church crowd.  This is like going to grandma's house!  Adorable little place with small patio, amazingly fresh food, great service, fun people and BYOB!  We took a small bloody mary kit and had drinks with brunch.Open since the 1960's, tucked behind a house in the Near Southside of Fort Worth, we will definitely be back.Cash Only."], ["Kevin K.", "Best mexican food. Virgie makes the best mexican food around period.  I've been coming to this place literally since I was  born.  Whenever I bring people here who have never been, Virgie and Audrina tell stories how they remember me as a baby.  This place us located in a neighborhood off 35 and ripy.  Don't be scared when you go through the neighborhood and don't worry about not being able to find it.  Take 35 then west on Ripy and right on Bryan.  They are also only opened Wed-Fri 10-3.  As far as food goes, the tacos are a must.  Little different than most tacos but they are amazing.  Carne asada is a must as well.  The enchiladas are rediculous and they make their salsa fresh everyday (ask for some green salsa if you like a little extra kick).  My suggestion for first timers is the Jacks special.  It comes with enchiladas, rice and beans, a crispy taco, and a carne asada soft taco.  Meals like this make me miss being a carnivore but for those who aren't, the cheese enchilada plate and the bean tostada plate are perfect.  Also, they are famous for their tamales.  If you haven't been here, then you haven't experienced mexican food in Fort Worth.  This place has been around for 50 years and lets hope its around for 50 more! Also try Audrina's husband's queso he's been tinkering with.  Its worth it!CASH ONLY!"], ["Kelly C.", "Good service.  Great food!   Love it!"], ["Ashley S.", "Absolutely the best enchiladas in FW!! Cash only and open only Wed, Thurs, Fri 11-3. Definitely a dive with great atmosphere and excellent food"]], "Uncle Julio's Fine Mexican Foods": [["Danette R.", "Went here for dinner on Friday night for a friend's birthday. We weren't allowed to make reservations, so we waited an hour before we Sat down. We were a party of 12 do that was understandable. While we were waiting for the table a cocktail server offered a peach margarita. It was good, but not worth $12. I ordered three enchilada plate, yummy! Table side guacamole was yummy as well. I will be back! Our server was great as well!"], ["Charles S.", "Stopped during late lunch/early happy hour time after a meeting with my real estate agent, and had all my positive childhood memories of the place confirmed.  Delicious food, great selection of items and served with a distinctive style all its own.  Miss the quail selection that I remembered from many years ago, but still enjoy the focus on mariscos, not to mention a classy version of a mojito and rocks margarita.  Only thing is that the day I stopped in, there was some trouble with flies in the place. If you're going to have open-air ventilation with a garage door patio, you've got to keep your environment under control. Still, I'd love to go back."], ["Geneva T.", "Enroute to Denton. Quick stop and dine. Was perfect. Hit the spot before we hit the road. Our waitress was super nice and gave great recommendations... :)) Thanks!!!! J&G"], ["Jay W.", "My husband, my son and I enjoyed lunch together today.  Our lunch at Uncle Julio's in Fort Worth was fantastic.  The food was great and the service from Miguel, excellent!  Thanks to Miguel for always improving my experience.  We appreciate you.  Suzy Wilson"], ["Sheryl B.", "Ignore the negative reviews. This is our favorite Mexican restaurant.  Great food, great service and we love the drinks too. We're regulars. Our favorite server knows what we like and we're never disappointed. Bring back the quail."], ["Annie D.", "This is hands down the best Mexican food I have had in the four years that I've been back stateside.  I had enchiladas and it was very evident that the sauce was made fresh, today on the spot.  Additionally our server, Justin was very personable, attentive and courteous.  I will recommend this restaurant to everyone I know that lives in the area and I am one of those people who hate everything.  Five stars, across the board!"], ["Heather W.", "The long wait is totally worth it. Not only is the chips and salsa out of the world yummo but the cheese and onion enchiladas are the bomb. I love the margaritas and the large patio is great during the summer evenings!"], ["Alea H.", "Unle Julio's is really great. Their food is delicious. Be sure to call ahead because they get busy and waits get long. The workers are always friendly and helpful. Their spicy guacamole is extremely spicy so watch out. A lot of people in my family always get the fajitas and they are good, but the soft taco plate with fajita beef is my favorite. And there is something about their cheese. It is extra delicious and I don't know how. I have never had dessert there but I imagine it's good because I have never eaten anything there that wasn't delicious."], ["Pastor Steve D.", "Fine Mexican food? Not even close. If you're reading this and know of a better Mexican restaurant please let me know...Now on to the review. I came to eat here because of the high reviews. I am literally stunned... like... Am I in the twilight zone? How does this place have such high reviews? I seriously struggled even giving the second star. First, the chips while crispy, couldn't help the mediocre salsa. Next, my family of 4 ordered our food and literally sent back every plate. Yes, shocking... But true. My wives fish tacos were \"fishy\" tasting; an indication the fish was old. For the record, never in our marriage has she ever sent any food back. My daughter and I had the cheese enchiladas. The Best way to describe them, is take a standard cheese enchilada and poor some canned chili over them (yuck!). For a Mexican restaurant the menu is quite small (no burritos or chimmis). One thing I will say is the manager and service personnel were quite good. The manager came to our table and tried to make things right by having us order another item. And we did try the steak fajitas and shrimp, but to be honest it was all so underwhelming. Was there a positive? Yes... the flour tortillas are made in house and are fluffy and amazing. And the fried ice cream was pretty good. So what is the final verdict? I guess it's safe to say there is no possible way I will ever go back to this place. I'm left just astonished that people actually like this place. My wife commented on the way out that a lot of people were drinking... that might be it. They might be too drunk to realize the quality of food that they're eating. Seriously, if there is a better place in the Dallas-Fort Worth metroplex, please let me know."], ["Arimathea J.", "Got news for ya.....THE QUAIL AND FROG LEGS ARE GONE!!! Are u serious??? I've been coming to the DFW area for years. Once I heard about this place I HAD to get a taste!  where's the quail dude? 'Oh it's no longer on the menu'.....you say what now?? We'll gimme a drink. I'm gonna need it. In a warm glass he pours me a half frozen/soupy drink...what the hell!?? Anyway the food was decent. Def not bad but uh....I'm in no hurry to return amigo!"], ["Brent M.", "This place has really gone downhill. I would give less stars but the numerous great experiences I have had wont let me give less stars. The service is still a 4 star experience. However, the new menu (and its new prices) along with the new kitchen staff and recipes are definitely a 2 star. I also hate how they nickel and dime you nowadays. The new happy hour prices are definitely good, to end the review on a good note."], ["David R.", "When my cousin was in town from The Bay Area (SF/Oakland), her one request was that we take her to get some good Tex-Mex, as they do not get much good Mexican food in that part of Cali, not to mention the unique twist we have on it here in Texas. Naturally, I defaulted to Uncle Julio's. We all kicked off the day by consuming a few basket fulls of those dangerous tortilla chips, followed by a few rounds of Negro Modelo's. I deviated a bit from the norm and instead of just doing the fajitas, I rolled with the Guadalajara: combo fajitas with bacon-wrapped shrimp stuffed with Monterrey jack cheese and jalapeno. Needless to say, another great choice from Uncle Julio's. It really isn't even fair offering bacon-wrapped shrimp with their sublime fajitas. My cousin and fellow yelper ordered the La Paloma and was instantly in love with the quail. She seriously would not stop talking about it for the next few days. So, yet another great outing at Uncle Julio's and now will be the go-to place every time my cousin comes in town."], ["Whitney D.", "I've dined at Uncle Julio's several times, the food for the most part is consistently good & the service is always great.  The prices are a bit high - there are several places in Fort Worth with great Mexican food with more reasonable prices."], ["Brian W.", "Uncle Julios is the real deal. As advertised, they have the best chips and salsa (it's the salsa, the chips are just good, not great) in Fort Worth. The tortillas always come warm, soft, and fresh. All the main courses I have had are decent (I've had fajita's, combo plates, and enchiladas) but nothing to write home about. I wouldn't call any of them \"authentic\" . Entrees are a little on the pricey side as well.Service is always spot on, and ambiance is typical Mexican-American restaurant flare. Uncle Julio's is a very large place and always stays busy, even at lunch. They offer call ahead service, so be sure to take advantage if you can."], ["Connor N.", "Great food. Service was great, huge fajita platter out in no time. They also are finally taking reservations!"], ["Jordan E.", "This is the absolute best Tex-Mex I have ever had. Ever. That salsa alone is enough to keep me coming back forever. The quality of food speaks for itself. The meat is flavorful and tender, the Tortillas are soft and fluffy... I can't even. I absolutely love it. This place is one of the few that I will forever go back again and again and never get tired of it."], ["Nathan H.", "Food is pretty good, probably one of the better options in DFW.  Prices are reasonable* (except Margaritas which ALL Mexicans restaurants recently have started to price at $10 #waittilligethometohaveone).  Main Complaint: they literally stack tables on top of one another!  So if you like eating within 6\" of the next closest patron then visit Uncle Julio's!"], ["Giamaria W.", "All I can say is...man' I am going to miss this place! I moved to NC, could I NOT bring Uncle Julio's with? I have eaten there several times, and each time is better than the last. To start of we had a wonderful server our first time that walked us through the highs and lows of the menu. She was a real gem! Wonderful Tex-Mex, and how I wish I could get my grubby little hands on that salsa! My hubz always get his much loved brisket street tacos. They are amazing, I must admit!  always get the chicken sourcream style enchiladas with the balck beans, and cilantro rice. All I can say is, may I please pray it makes it to NC some day?!The staff is always well trained, and exceptional. Very good staffing, and excellant atmosphere, and a spot on experinece every time!  Also if you can get on the patio, you will absolutely love it! A little quieter, so an even better experience!"], ["Stephen W.", "Very disappointed, and despite bringing it to managers attention left feeling like it fell on deaf apathetic ears!They recent changed their menu and the beef fajitas definitely took a turn for the worse. The meat was some of the most gristly I've ever had. It was so bad I wound up spitting it into my napkin after chewing it for more than 40 times. If I hadn't gotten the chicken I would have had nothing at all.Service was ok, a little slow but acceptable, but when I brought it to the mgrs attention she basically apologized and took my plate, and offered a free dessert. So I spent $20 on a plate of gristly flank steak with not even a slight change in the bill.Other than the reverse swirl there was very little to get excited about, and after a $50 tab for two (w no appetizers) it will be a very long time before I go back there, two big thumbs down!!"], ["Drew W.", "The food was very fresh and everything tasted wonderful! The portions were really big, and we could have definitely just shared a meal that is meant for one. Our server, Ro, was the best part! He was very friendly and did a great job. Thanks Ro!"]], "Sombrero Mexican Food": [], "Los Molcajetes Mexican Restaurant": [["Trip G.", "Great atmosphere. Solid family restaurant. The menu is quite large with many different options ranging from whole quail to nachos. We suggest getting the queso fundido as an appetizer as the presentation is awesome with them setting it on fire table-side. It seas also delicious. The small warm salsa that's spicer was my favorite of the two offered. The cold salsa was a little too chunky for my tastes. Dos XX in a cold mug to wash it down with."], ["Leslie S.", "The food here is always great! The only reason it isn't getting 5 stars is because the salsa, although tasty, it's too watery. Would love for it to have more substance!"], ["Randi F.", "Wonderful food and great margarita!! Well known with the locals so it's packed on the evenings"], ["Jeff S.", "We have been coming to this location for almost a decade now.  It has a cozy interior with great service, cold beers and some of the best Mexican food around.  I highly (VERY HIGHLY) recommend their Mole con Pollo...just ridiculously decadent.  The Super Burrito is definitely super and their brisket tacos are phenomenal.  Their chips and salsa are great, but if you want the good stuff, ask for a side of their salsa verde...SOOOO good (and spicy).  The Roanoke location is every bit as good as the Western Center location, but the Western Center location's interior is a bit warmer and homier.This is our go-to place and has been for nearly a decade...considering all the competition that has come and gone in the past 10 years, that is quite a good record."], ["Jack H.", "I love finding mexican food I actually enjoy. I'm not big on mexican food but this place might have changed my mind. Los molcajetes is a fantastic find. Drink prices were awesome, margaritas were large and tasty. I had the molcajetes  special and the meat was so tender and flavorful. It had such a smoked her spicy flavor. The shrimp was delicious and it came with quail which surprisingly good. The seasonings they use made the meal perfect. My wife had chicken enchiladas and I think they were some of the best she's had! The service was so fast and friendly. We didn't have to wait at all for drink refills or our entrees.  It may not seem like much being in a shopping center but don't let it fool you, some of the best Mexican food we have had."], ["Jessica V.", "Amazing margaritas, brisket tacos are a little messy but extremely flavorful and service is fast. But the most impressive item on the menu are the sopapillas- yum!!"], ["Jessica W.", "The salsa is great and so are their margaritas. I never have to wait long for my food even when they're busy. I can get in and out with time to spare during my lunch hour."], ["Garry T.", "Looks like a hole in the wall in a strip mall from the outside. Inside is very nice, well lit and decorated. Rating it as average because the food was very average as Mexican food goes. Service was great, prices were reasonable. I would try other places in the area before coming back however, just to see if perhaps there isn't a little more \"Mexican\" Mexican food here somewhere."], ["Adam N.", "My favorite place for Tex Mex on the north side of Fort Worth. You want service? Every meal I have had here has come out in less than 10 minutes.The servers fly around the restaurant filling drinks, salsa, and chips.You want taste? Best salsa in town. The other Tex Mex staples are always fresh and well portioned. One of my favorite places for enchiladas.You want atmosphere? Mariachi's once a month. TV's laid out like a sports bar. Wooden door at the entrance like in old Mexico. Restaurant located in a hole in the wall location in an Albertson's shopping center.You want good value? My lunch fajitas were $9.25Now if only I could figure out the password for the free WiFi....."], ["Melissa G.", "Went here again and WOW, loved it this time! I ordered a combo that came with an enchilada, beef fajita taco and chicken fajita taco. It was really good and the fajita meat was right up there with the best I have ever had. I think Fajitas are the way to go here! We will definitely be back soon, this place is so close to home. Hard to believe we have only been here once before in the 6 years living here. We have to change that soon..."], ["Karen T.", "My husband and I had a wonderful dinner this evening. The food was excellent as was the service. We had the fajitas and fajitas enchiladas and both were perfect. They serve two different sauces and our favorite was the one served warm.  The prices are more on the moderate side but the portion sizes are large. The margaritas were very tasty as well. We will definitely be back for more soon."], ["Damon B.", "I am embarrased. My office is less than 1/4 mile away and I have driven by Los Molcajetes about 400 times, never stoping. Why would I? A shopping center Mexican Restaurant? Well, Monday night, a late night in the office and on the way home decided to stop in. My expectations were low. I never heard about this place and my co-workers never said that they went there for lunch or dinner. The food was great. The service excellent, and the vibe of the restaurant was nice. It was a mix of business people, families, young, and older. As i soaked in the atmosphere munching on my chips and salsa, I thought, \"did I find a gem\"? When my order of Mexican Style Quail and side of Enchiladas arrived, I knew I was in for a treat. The quail, perfectly cooked and the enchilada was delicious and void of grease. The rice was moist (Not dry that you would think later in the day) and the beans were spot on. As I left, I asked myself, am I the only one that likes this place? When I got home I typed up the restaurant and saw the reviews on Yelp. To my surprise, I was not alone! I can't wait to go back next week as I have found my new lunch spot and a new dinner home for my family and friends Tex-Mex cravings. No other tex-Mex on these lips and taste buds. I am now a Los Molcajetes follower. I can't believe it has taken me this long... however, the wait, WELL WORTH IT!"], ["Breanne B.", "Love this place! Good food and atmosphere. My husband and I really like the fajita meat."], ["Jessica B.", "Good food! Love their chips and salsa. The green chicken enchiladas are my favorite."], ["Chandler P.", "The best authentic mex food joint in town. The food is top notch and the salsa is to die for...... If ya like cilantro.Even is ya see there is a wait don't worry is won't be long but it will definitely be worth it! I guarantee!Haven't had a single bad menu item yet and I've been at least a dozen times with multiple friends and family and having the same opinion."], ["Dianna N.", "This is the best mexicana restaurant close to my house. The food here is good. Rice is good. Enchilada is good. Beans is good. I love the live music!"], ["Saul C.", "It is a typical Tex-Mex restaurant, but i actually enjoyed the food here. I had their Bistec Ranchero which was pretty good and the sauce that came with it had a good kick. the staff was friendly and helpful. The prices were reasonable. I do plan on going back."], ["Bobby A.", "Great atmosphere bistek  Ranchero and fajitas Margaritas freaking rock. Mariachi band nice"], ["Lynnette B.", "This was a delicious dinner!  I ate here last week while I was visiting my new grand baby in Fort Worth and this restaurant was highly recommended by the locals. They were not kidding!!! The service was very good!  Attentive generous waitstaff and a great mariachi band that gave each table an individual serenade of great music!  The food was superb!  Don't let the looks of the place fool you!  It's in a shopping center and looks deceptively small from outside but it appointed well and seats a lot more people than I thought it would! Yummmmy!"], ["Samantha Y.", "AWESOME food, service was quick and attentive. The margaritas were GREAT! Well, I think all margaritas are good, lol. They charge for every little thing, no complaints, I just didn't know a side of chopped of jalapeños was going to be charged.. The salsa was NOT hot at all, I guess I'm assuming Mexican food is spicy."]], "El Rancho Grande Restaurante": [], "Mariposa's Latin Kitchen": [], "El Paseo Mexican Restaurant": [], "Joe T Garcias": [["Joseph F.", "I have a very love hate relationship with Joe T's.  Cash only is the business practice here and that's not to big a deal since they do have an ATM on site.  So down to the love hate; on one side Joe T's is a classic Stockyards experience and they have probably one of the best patios there is (this thing is huge, private, and gorgeous), on the other the food has always been hit or miss for me and the drink prices are absurd.Regardless of all that it is still one of the more long standing establishments in Fort Worth.  It is always a popular spot with a wait most times.  The staff know their jobs and do them well.  The menu is very well rounded with an option for everyone, even the pickiest of eaters.  All in all I will continue to come back and I will continue to have my love/hate."], ["Sandra K.", "It's a great place for family celebrations.  We always take my mom for her birthday.  My husband loves the nachos, my son loves the fajitas and my mom loves the enchiladas.  We enjoy the patio because of the fountains and beautiful landscape.  The service is always excellent."], ["Danny B.", "Joe T. Garcia's only has two entrees on their menu, so you should know right off the bat that those two things are going to be made to perfection. (Spoiler: they are!)My aunt and uncle told me I couldn't leave Texas without coming here first and now I know why. From the chips, salsa and dip to the food and margaritas, this place is top notch! Definitely a must try if you're in the area."], ["Evelyn M.", "We came here for lunch with our Friends. We were visiting from Southern California which has the best Mexican food! However I was pleasantly surprised by the quality of the food and their delicious salsa. If you get the salsa right it's a big deal! We sat outside which is absolutely beautiful, only downside is that it's cash only and that our sever took a while to take our order and did not frequently check if we needed anything"], ["Tamara S.", "amazing drinks"], ["Cris G.", "I've eaten Joe T's hot sauce for a few decades now.  I finally got to stop by the restaurant and see what it's all about.  It wasn't the greatest Mexican food I've ever had, but they had some interesting turns on the usual.  Their enchilada sauce was very tomato-y.  The tacos were pleasant and fairly light.  And then they served it all with a generous bowl of that wonderful salsa.The grounds are just as good if not better than the meal.  What a gorgeous compound they have.  Worth a look around.  Made me wish we had tolerated the heat and eaten outside.Bring cash.  No cards."], ["Brooke W.", "Sigh. I have been avoiding leaving a review for this Fort Worth landmark for a while now, because I have such mixed feelings about this joint! When the weather is pleasant, I instantly crave those simple little nachos with the pickled jalapeno relish. We usually give in to temptation, wait in the ridiculous line for the patio, and indulge in a pitcher of margaritas. Then the mediocrity of the service sets in and I often think \"Whyyyyyy am I here?!\" But, alas, we keep coming back because, let's face it, the patio is bomb dot com. My last three visits to Joe T's (probably over the course of 6-8 weeks) have resulted in pretty decent food, but consistently poor service. To top it off, during the last visit I felt like the margaritas were \"off\" just a bit. This is a MUST if you're visiting Fort Worth, or are more worried about ambiance than the actual dining experience. But there are lots of other Tex Mex places with better food and service. There. I said it."], ["Marc R.", "Make reservations!  Food is pretty good, you select from a very few available items on the menu.  If you have dietary restrictions this is not the place for you.  Salsa is very good, service is good.Its more of a fad place and place to be seen than about the food."], ["S. M.", "Joe T Garcia's is one of those places that trades mostly on name recognition. It's also the kind of place where the business model involves limiting customers' options. It's kind of a tradition for Fort Worth folks. The food is good, not great. The place has great ambience for events. Cash only, and in the year 2015, that's really inexcusable for a major restaurant. That costs a star."], ["Syl M.", "One star for good service and another for atmosphere. It's a pretty restaurant.  And enormous. The food was a huge disappointment. Margarita was weak and just bad. I had beef fajitas. The portion was big but I've had way better. The queso was probably the worse I hv ever had. I was very disappointed in the food :("], ["Matt A.", "Summary: A must-do Ft. Worth institution.  The food won't blow your mind, and parking is a pain at peak hours, but I mean, come on. It's Joe T's!!!Happy to notch this restaurant. It is a really fun and interesting tex-mex place. The wait can be long on a Friday or Saturday night. Parking was ridiculous.So, this isn't really a place you come to because you want super fancy stuff. It's not a place you come to to drink all night with friends. This is a boisterous place you come to with friends and/or family for a great ambiance and family-style meal.The choices are super limited. You get fajitas or enchiladas, more or less. You are then inundated with all sorts of food. They have nacho appetizers. If you order enchiladas, you get tacos with them. If you order fajitas, you get enough fajitas for 2 people. The beans, rice, guacamole are served on big plates, family style.Although the place was packed, the service was actually really admirable!No complaints at all for this place. It just didn't get the fifth star because some of the food was average. You might find better fajitas elsewhere. You will find better enchiladas and nachos elsewhere. But you might nto find more FUN fajitas, enchiladas and nachos!"], ["Emily E.", "The guacamole was good, the service was quick, almost too quick. Those are the ONLY positives.The salsa tasted like it came from a jar. They only serve two things for dinner (no menu)- fajitas and cheese enchiladas. We got the fajitas to share and there was plenty of food for two of us. Everything lacked flavor and moisture. The meat was so dry on the outside and overcooked that you couldn't tell the difference between the chicken and the beef until you sliced it open. What flavor it did have was sweet, not savory. The rice and beans were terrible. It all just looked and tasted like it had been sitting under a heat lamp for hours- which was probably the case since we got our food TWO MINUTES after ordering it. Even the waiter was surprised is came out so quickly. And we didn't come during some slow afternoon lag, the place was packed. Oh, and the grated cheese that cost an extra dollar was way too orange, had no flavor, and didn't melt- pretty sure it was imitation cheese.The margarita was ok. I'm not a big fan of the sweet and sourness of margs so this water downed version was decent to me.As many others have said, this place came highly recommended. I can only guess that's because locals grew up going there and just never realized how awful the food was. I wish we hadn't even tried it. Literally the worst fajitas I've ever had. Could have gotten better ones at Taco Bueno."], ["Juliana P.", "I used to love this place but This place is now really expensive for the quality of food. I was there last week and the service was so slow! The food was cold, and it tasted like it was old! The waitress was so rude and I never coming here again! You lost a very loyal customer"], ["Annie T.", "Can't come to Fort Worth without a visit to Joe T.s! I usually come with a big group but their large party is perfectly suitable. The line wrapped around the front of the restaurant may be daunting, but don't let it scare you. Jump in line, it usually moves fast and get a pitcher of margs to help pass the time. When going for dinner-they don't have a menu. It's either the fajitas or enchilada dinner (the small dinner is perfect size). You get complimentary chips and salsa and with the dinner your table will get plates of tacos (so good) and the nachos (the best). I seriously dream about these nachos. They are nothing fancy but the crispy round tortilla with melty greasy cheese and spicy peppers have me hooked. If you go for brunch or lunch there are a lot more options. I had never been during the day until this past weekend, but a big mexican breakfast on a sunny patio is uber hard to beat. Lot's of egg dishes like huevos rancheros and chiliquilas and various lunch dishes in addition to their regular dinner items. Margaritas, greasy nachos, and refried beans all before noon is a fabulous thing."], ["Natalie H.", "I absolutely love this place. I've been many times, and I still can't get enough. The scenery is absolutely breathtaking. You take in all of the nature while enjoying a marvelous dinner. I've never been at night, but I need to in the future. I've never sat on the inside of the restaurant, because who wouldn't want to eat and enjoy the beautiful outside part!As for the food, well it's just as good! There's also a little venue section in the back, where you can hold special events and such outdoors.I highly recommend to anyone who hasn't been, to visit ASAP!Also, it's cash only, and it gets very packed so get there early to avoid an hour long line!"], ["Chris P.", "I've never understood the antipathy of locals toward Joe T's. Let me say it this way: I think there are two types of people in the world, and a trip to Joe T's will help you sort them out in a single evening -- There are people that can have an outing with good people in a one-of-a-kind, beautiful atmosphere (bonus: margaritas) and fully enjoy it no matter what else might be going on, and there are people who literally lose sight of the forest *and* the trees because they won't stop complaining about how one particular thing isn't up to their standards.True, there's nothing that says you can't have a truly unique atmosphere and gourmet food together, but once you've figured the Joe T's situation out, I say you should know exactly what you're getting. If it's a big enough deal, revise your expectations and choose to have a good time anyway or else just stop going. It's not going anywhere."], ["Lan N.", "Margaritas, good... Guacamole.. Good, queso.. Good, fajitas... Good.. Enchiladas... Good. everything was great along with the atmosphere which just upped this review. Good for family time and dates. The good could be greater but I could never ever complain at joe T's"], ["Bob B.", "Great food, great ambiance and superb service.  We were very pleased and recommend anyone visiting or living in  the Fort Worth area give this Tex Mex a try.  The prices are very reasonable and the servings are quite plentiful.The flan dessert was superb.  Bring cash as plastic is not accepted."], ["Misti O.", "Ole!!     Like always. I forget the have a lunch menu, however, not needed. We get the same thing. Every. Single. Time. 2 nachos + extra side of minced jalapeños. (A must). 1 bowl chicken tortilla soup -- sooooooo good!!Steak fajitas. No cheese or sour cream. Flour and corn tortillas.  Such huge portions. We always bring 1/2 home. Always terrific and the bonus is no wait time at lunch today! Great service."], ["Emiliano D.", "Omg how long is the wait! This place is not worth the wait. As I am writing this I believe I have been here almost an hour and half. If it wasn't for my family I would have left an hour ago."]]}