{"Gloria's Latin Cuisine": [["Melanie C.", "Gloria's has a nice sophisticated bistro-like atmosphere which was a nice change from the many(!) sports bar-type places around town.  They have great sangria and delicious fish tacos - three to an order which we shared among three of us.  Good times."], ["Kali G.", "Beautiful atmosphere,  great quality servers, wonder food.  I highly recommend this place."], ["Le E.", "fancy shmancy place for latin/tex mex in colleyville.my sister and i stopped in for some lunch mainly because i wanted to try the pupusas. and it gets a four star. the pupusa was a little greasy, but still very tasty. for $2 each, it doesn't seem too expensive.i ordered the chicken enchiladas with sour cream sauce and my sister ordered the chicken dish with a poblano cream sauce. my sister enjoyed her dish, but said the sauce was extremely rich as she was removing some of it off the chicken. my enchiladas were just ok because there was a flavor or spice to them that i can't quite pin point. didn't taste like the typical sour cream chicken enchiladas. the salsa, chips, and bean dip were great.i will probably be back to try other items on the menu maybe during lunch time since we spent $30 including tip for just the both of us."], ["Whitney B.", "When the best thing there is the blackbean dip? We've been several times and the bar scenes good but the food is underwhelming. We will go if a group wants to cause the atmospheres fun but the foods not the main draw."], ["Rich L.", "I've always just been meh about this place.  I thought the food was just pompous, I don't like the interior part of the remodel (even though its a few years old now), and I miss the SBux that was right there.  But I have found a 4 things I do like.  The first is the big arse El-Salvaradorian beer that can fill 3 pints.  It's a fine cervesa and I think maybe the only place to get it in Dallas.  I like the ceviche tostado.  It's simple, fresh, and full of good good nourishment.  And I think it's real cheap one night but not sure which.I just recently found out I like the Papusas.  The pork one is hearty, tasty, and full of good good greasiness.And lastly, the Dyson hand dryers in el bano are tantalizing especially after some big arse El Sav beers and tequila shots."], ["Naomi L.", "Really good authentic Salvadorian food. Really nice staff, and always fresh!"], ["Penny L.", "I've seen Gloria's sign on Hwy 26 for a lot of years now.  I thought it was \"home cooking\" or something like that so we never tried it.  Thanks to Yelp and the reviewers we tried it today after we found Reposados closed.It is my new favorite local place!  I asked for two changes on their specialty chicken dish - to change the sour cream sauce to tomatillo and add jack cheese. It was fabulous! No attitude for the change, it came out exactly as I asked for!  The chicken was so tender I could cut it with the spoon I used to scoop up the tomatillo sauce. My man had the crispy tacos and they were stuffed full of meat with plenty of cheese and veggies in the side.We will definitely be back at least once a week!"], ["James L.", "Me and the wife went out with four of our closet friends on a Sunday night.  We got immediate seating and immediate chips, salsa and black bean dip.  The chips were good, the salsa didn't have a kick but it was flavorful and my wife and the rest of the table enjoyed the black bean dip (I personally love Mexican food-but don't like beans...go figure).I ordered a combination place that had a ground beef taco, a Chicken Enchilada and a Fajita Steak Enchilada.  The food was pretty good, no complaints.  Everyone seemed to enjoy their food and their mixed drinks as well.The only thing stopping me from giving this a 4....is that a 20% gratuity is added to your bill for parties of 6 or more.  I'm used to seeing that for parties of 8 or more and it being 15%.As far as tipping goes, I tip 10% if the service sucks, the normal 15% is the service is average, 20% if the service is good and 25-30% if the service is exceptional.   The service was average.  Chips baskets and salsa bowls sat empty for 10 minutes at a time before another person besides our waitress asked if we would like more.  Drinks sat empty quite a bit too.If you're going to automatically charge me gratuity...earn it.   Don't rest on our your laurels since you're automatically going to get the tip....When it's all said and done, Gloria's is a 20 minute drive from my house.  I have to pass 10-15 other mexican restaurants to get there.  Is the food that good to pass up the other 15 places?  No.  I would return if invited by other friends, but not a place I would say to my wife \"Hey, wanna go back to Glorias?\""], ["Ryan P.", "Great place to eat great mexican food, I love the salsa and bean dip that come with the chips as it provides a marvelous variety. Entrees are tasty and fresh foodwise you really can't go wrong.My only complaint is the servers seem more awkward than friendly. Like they are too nervous to speak up and talk to you. Don't be afraid of the guy treating his live in mother to a nice dinner, ask me if I need anything else.. (like a longterm plan in life).."], ["Sonia M.", "Umm..pretty much my new favorite mexican restaurant in the area (and I have eaten at a lot of them in the area). My boyfriend and I came to visit my parents for the weekend and when it came down to deciding on what type of cuisine we wanted for an (early) Father's Day dinner, everyone said Mexican.  I seriously think my family was supposed to be born Mexican sometimes. Anyways, lets just start with how delicious the steak fajitas me and my dad shared (ordered for one btw and it was just perfect - and we can really  eat!) and how perfect the smokey flavor  was of the brisket tacos that  my boyfriend had.  Their bean dip they bring out with the chips and salsa in the beginning is just the bonus.  We also finished with a tres leches cake that was so perfect!  Finally, I would like to take this moment to commend the staff on their excellent service, smiles, and attentiveness.  A drink never went un-refilled and we had plenty of staff checking on us to make sure we had everything we needed (not in the annoying way).The only con I can think of is that my silverware looked a bit dirty which is kinda gross but I asked for new silverware and it was brought to me immediately.  I am super picky and can be hard to please at times so I can't believe my first yelp review is a 5-star!  Next time I will have to take advantage of the small patio dining in the front.   If you love mexican food - you def. don't want to miss out on Gloria's in Colleyville!"], ["Rose A.", "great fresh food and awesome happy hour specials throughout the week.  very crowded."], ["Carri A.", "Oh Colleyville.  You crack me up.  When you do something you have to do it FANCY!So yeah, Gloria's is basically fancy Mexican food.  Well, there are other Latin cuisines on the menu as well (Salvadorian and Tex Mex, notably).  I'm a big fan of the delicious salsa, tasty bean dip and the phenomenal tortilla chips that are promptly served once you're seated.  Both times I've been here I have gone with the Shrimp Quesadillas, though I'm impressed at the number of vegetarian-friendly options on the menu.I'm disappointed at the guacamole because it tastes like they bought that packaged stuff and then threw some onions in it.  It's too creamy to be real.  I like my guacamole thick and chunky, please.  Sour cream is good though.It's a solid bet for some good food.  The service can be hit-or-miss, the decor is cozy comfortable and the music is festive."], ["Amy B.", "The food here is FANTASTIC!!! I have never been here before so when my son and I decided to have our monthly dinner date we picked this place. So glad we did. We had nothing but appetizers and it was so satisfying. The papusas were divine both the pork and cheese. They were fresh and cooked to perfection. The chicken nachos were so flavorful we didn't want to stop eating. I ordered the cevieche trio. Magnificent!  The wait staff was on point and friendly. We have to go back and try some entrees. This is not your typical Mexican restaurant. They have all things Latin and it seems like each thing is created with skill and fresh ingredients. This is a place worth dining at."], ["Joseph W.", "Yes, it's true -- I've lived here for 2.5 years, and have never tried a Gloria's until now.  So sue me.  It's been on my \"to try\" list for a while, and I finally decided to try it out.The Gloria's in Colleyville is in a great location.  I really like the shopping center that it's in (with Market Street, the IMAX theater, Borders, and lots of other little shops.)  It was comfortably occupied, but not crowded at 2 pm on Black Friday.I always check out the menu online before I try out a new place.  Gloria's menu is pretty extensive for that of a Tex-Mex place.  A big reason for that is that around half of the menu is Salvadorian food.  Not feeling adventurous today, I decided to stick with the Tex Mex, however, and ordered their Combo #2:  A chicken tostada, a ground beef enchilada, and chicken and spinach quesadillas.As other posters have mentioned, Gloria's has bean dip, in addition to salsa, at the table.  I'm not a big fan of bean dip, in general, so I really won't say anything more about that.  Their salsa, however, was great.  It was very spicy (for dipping salsa) yet plenty flavorful.  When my plate of food came out, it was massive, as I suspected.The weak part of my combo was the chicken tostada.  While the tortilla was cooked perfectly (very crispy,) there was some kind of feta-like cheese on it.  Yuck!  I'm only mad about that because I didn't recall seeing it on the menu (if I had, I would've asked to have it left off.)  Also, the chicken was not the most flavorful. The beef enchilada and the chicken and spinach quesadilla, however, were both excellent.  Service was great, and my mother really liked their margarita (which she's sleeping off right now.)  For some reason, margaritas were only  3 bucks this afternoon.  Definitely a great deal for great food.  I definitely plan on making Gloria's a regular stop for Tex-Mex.  There is a LOT of stuff on their menu that I still really want to try."], ["Bruce G.", "Gloria's has always been my go-to restaurant. I know when I go there that I will have a good meal. I usually like to go during happy hour (Sun thru Thurs all-day). Went there today (Sunday, 1-27-13) and when I received the bill I noted that the prices for the drinks were full price. I was told that they no longer have Sunday all-day happy hour. Gloria's now only has happy hour Monday thru Thursday. Come on, the place wasn't even half full. Sunday happy hour has always been a draw. Gloria's needs to reevaluate their marketing team because they really dropped the ball on this one. Well, needless to say, you lost a Sunday customer. I will be back. I will even be there on Friday or Saturday during non-happy hour times. But not Sunday. The Sunday all-day happy hour was a major incentive to get me out on Sundays. Too bad, sooo sad...."], ["Moto S.", "Okay, I go to Gloria's for their house margaritas and the chips and salsa. Eaten at a couple of them but never really cared for the latin fusion mexican guatamalen or whatever food thing. I just go plop down at the bar. Love the margy's and at $4 they can't be beat. Chips and salsa are good too, but the black bean dip isn't much to my liking, there is better in town. However, still like the place, service at the Colleyville location is good and quick, and they keep your drinks filled."], ["David M.", "Overall A-OK but nothing really impressed me.Service was great - Maria, our waiter, was attentive and checked on us often, and Gloria's had separate waiters whose sole job was to refill water and chips. The chips were unremarkable. The salsa is heavy on the cilantro (I like it, but not everyone will). The black bean dip tasted like... well... black beans but was otherwise nothing to write home about.I had the chile relleno with cheese and a cheese enchilada. It was a lot of cheese but I did enjoy it along with the sides of black beans, a tomato sauce, and rice. Another in my party had the grilled chicken breast, which was decently average.The menu states the chile con queso is $5 but it showed up on the check as $6. The waitress said \"we put up the price but haven't changed our menu,\" but she did change it back to $5 on the final bill."], ["Cliff C.", "This is a great place to dine for a number of reasons. The food, the drinks, the service, and the scenery at any given moment, are consistently excellent. My favorite light bite is the small chicken soup or a single tamale. The tamales come wrapped in a banana leaf, filled with zesty chicken and a small potato on the end. The gratis chips, salsa, and black bean dip are just a bonus. I haven't dined with anyone during lunch or dinner that has been disappointed with food or beverage. The only reason not to go is if you are afraid of a bar that is occasionally a bit too crowded."], ["Zach F.", "Decent mexican but what sets it above others is its selection of Salvadorean food. The tamales are wrapped in banana leaves and they have a good seafood selection."], ["Chace D.", "I have been to Gloria's several times and I have never been disappointed.I went with a friend of mine and were instantly greeted with chips and dip at our table. They have salsa, but also some black bean dip with is great. The waitir said that there was a new item that wasn't even on the menu yet. Brisket tacos. That's all I needed to hear. We both got the tacos which are served with aides of chopped up onion, celantro, a black bean sauce, and a hot salsa. While the natural flavor of the brisket taco was great, I threw on some onions, the black bean sauce and dipped it in the salsa. That made it amazing.I will definitely be going back to Gloria's."]], "Reata": [["Brooke W.", "Tradition, tradition, tradition. That's what makes this Texas classic so vital to the Fort Worth dining scene. We had planned on dining at nearby Del Frisco's Grille. We were completely unimpressed, and opted to mosey over to Reata after appetizers. We just sat in the lounge and had a few drinks before going to see a show. Our server was great, and had genuine suggestions about the menu items. We tried the crab stuffed jalapenos which are wrapped in bacon. Apparently these are fairly new to the menu. They were good, but of course my husband boasted that his are better.... We enjoyed our experience so much that we came back the next day to enjoy the gorgeous weather on the rooftop patio. As the sun set, it got a little chilly. All of the tables near the heaters were taken. Our server saw me shivering, and had another brought out to our table. Also, another server overhead us talking about possibly catching a movie. He came back with many suggestions and movie times. 4 stars for top-notch customer service. Will be back soon to enjoy a leisurely dining experience."], ["Ashleigh D.", "Okay, so I've been back on numerous occasions, and while the ambiance is very Texan, the rooftop bar is tourist heaven and the private dining areas are unique, I still don't think Reata lives up to its hype of 5 stars. If you're having a private event, or just want a private group dinner, there are plenty of rooms and spaces for you to dine in. One of the most unique I find is in the center of the main dining room, and is accurately called the \"corazon.\" It's completely circular glass walls that divide you from the rest of the restaurant and it's like dining in a fish tank. On the rooftop is a private indoor geometric dome that you can also sit in and look at the starry night while dining on steaks, jalapeno corn bread muffins and the best tenderloin tamales you've ever had. The service here is wonderful and they really know their stuff. They're very helpful and hold flashlights up in the dimly lit dining space, as well as offer reading glasses to those who need them to read the menu. My issue here is the price. I don't find the food worth the price. I really don't think it's out of this world fantastic that everyone says it is. I often go here for business dinners, and I think that's really the only time I would really want to eat here."], ["Ileanna R.", "The food was very good. The service is excellent, I recommend their chicken tortilla soup, one of the best tortilla soup I've ever had."], ["Willie C.", "Great place for a Texas atmosphere experience and great food! I had the Pan-Seared Pepper Crusted Tenderloin with Port Wine Sauce and the Bacon Wrapped Crab Stuffed Jalapeños. Both amazing!! Finished with some Dessert Tacos with Caramelized Bananas and Chocolate Gravy for desert.  :)"], ["Ben F.", "At a wedding here. Jonathan is the man. Excellent service. Awesome place to visit on the balcony when the weather is good."], ["Dave S.", "Im a tourist. My girlfriend is a local. We were wandering around and came upon this place that looked too good to be true but it was real. They had several very interesting and unique cocktails that were worth what they cost (rare for me to see that).  The habanero infused tequila Moscow mule was so good we stayed for dinner and had pork osso bucco. Just a great experience. Bartrnder Mike set the tone. Total professional. Can't wait to go back."], ["Tammy N.", "We recently had a work trip to Fort Worth for our Annual Meeting.  I worked with Alexandra on  our reservation details.  She was very accommodating!  We had a private dining room and balcony for our guests.  We pre-selected appetizers which were placed on the tables during our social hour, which everyone really enjoyed!  We had an open bar and the drinks were great!  The food was spectacular- appetizers, main course and dessert!  We want to thank Reata for creating such a unique experience for our group! Thank you and we will be back!"], ["William B.", "The essence of upscale southern cowboy cuisine! Texmex/tex/french/steak cowboy fusion!  If you can only eat at one restaurant in Fort Worth this should be it. Tea smoked quail on cheese grits is just one example of perfection."], ["Lauren S.", "This is a great place to take out of town guests. I prefer coming here over the stockyards, simply because of the cheese factor! Reata gives you the western flare, cowboy feeling without any of the hokey junk that comes with it. The service here is always top notch. I really like dining on the rooftop- you get great views and when the weather is nice you can relax, have a few drinks and just take it all in. I usually get a steak and the wedge salad. My steaks are always cooked the way I request them and you cant go wrong with blue cheese on a salad. The menu is pricey, but I feel like it's worth it! I've dined with a large group and just with 2 and either way service didn't suffer. I'll be back."], ["Jeff S.", "Reata is a Fort Worth tradition that scores five stars in all respects.Ambience and atmosphere are true Texas Western that embraces our Cowboy heritage in a classy, sophisticated way.The menu offers something for everyone. I'm a fan of the Carne Asada and the Stacked Chicken Enchiladas. For lunch the other day, they offered a tomato-bleu cheese soup that was absolutely outstanding.This was my first time to dine at the downtown Fort Worth restaurant, although I am a frequent visitor to their locations at the Will Rogers Coliseum during the Fort Worth Stock Show & Rodeo.Succinctly stated, Reata is true Fort Worth and definitely worth the visit next time you find yourself in Cowtown."], ["Sissy Pants T.", "The food and ambience was amazing!! Our server, Brandon, was outstanding!!! We split the portions and it was more then enough. Highly recommend the roof top...make reservations!!!"], ["Kim A.", "I love this place. You can't beat the roof top view and the roof makes you think you are in a garden. The good is great. I had the tamales (beef, pecan sweet potato mash with a tomato cream sauce) which were amazing!"], ["Sara G.", "Whether you live in the DFW area or are just passing through, The Reata is the perfect place to experience Ft. Worth charm. It's classic yet upscale, filled with cowboys and leather furniture.The menu is a bit more eclectic than a traditional steakhouse. While the steak is delicious, there are only a few cuts, and otherwise the options run the gamut from jalepeno and cilantro soup to citrus chicken, enchiladas, and lamb. My mom and I split the tenderloin, and the portion was still plenty for both of us. The mashed potatoes are absolute heaven - you'll leave wanting to steal the recipe!At $115 for two entrees and two drinks it is definitely an expensive option; one you will want to savor for a special occasion. When the weather is nice make a point to head up to the rooftoop for a cocktail."], ["Brandee G.", "This restaurant has the best service ever! Everyone is so friendly and welcoming, free valet, too. We came during a rush; it took a while to get our food, so they offered us a complimentary dessert. The apple crisp is really delicious, the caramel is unique. I ordered the citrus crusted chicken with honey mustard which was juicy with a light crust. The flavor was strong, but not bad if you like the taste of honey mustard; it paired very well with the mashed potatoes. He ordered a rib eye. We both ate everything and we weren't that hungry, it's just quality food! The asparagus that came with his steak was cooked perfectly, not too crunchy and not soggy, and they also gave him a roasted tomato stuffed with Parmesan and spinach. Our waitress said that no one ever eats it, you guys need to start eating it bc it's really good! That little tomato is packed with flavor; it's not just a garnish lol I really enjoyed my time here and look forward to trying more, they have a diverse menu and lots of dessert options! Oh one thing I did not enjoy was the starter bread. The mini cornbread tasted strange to me, I think it has jalapeños and cheese in it, and the biscuits were full of pecans. I am allergic to nuts, but my fiancée also said he could do without the pecans in the bread. They gave me extra cornbread that hadn't touched the pecan bread which was really nice. Everyone in the restaurant was laughing boisterously and having a great time, even though I was tired I didn't mind staying over an hour bc of the welcoming atmosphere."], ["Big Al J.", "Good food, GREAT service. Female bartender upstairs was VERY good.  Remembered previous drink orders and it was super busy.  Same for our waitress.   Pity can't recall their names. Second time here."], ["Pepa R.", "Nice place close to the hotel I stayed.... my steak was cooked to perfection.Great service for large parties with no reservations."], ["Elizabeth H.", "Outstanding cuisine despite it being a hot tourist spot. Steak cooked to perfection and the seasonal game is a must. Only regret was having no room for dessert. ps- excellent calamari and THE best tartar sauce we've ever eaten. pss- tartar sauce is not on the menu."], ["Philip A.", "Calamari, tenderloin tamales were delicious.  Elk sausage was the best."], ["Kimberly G.", "My fiance and I made dinner reservations for the upstairs patio this past Saturday. They sat us next to the fountain and it was lovely for a date night. I didn't want a huge dinner plate (to avoid leftovers since we were off to the Bass Hall afterwards) so I opted for the pecan salad and added grilled chicken. I was pleasantly surprised with how good it was! I am hard to please when it comes to a salad. The dressing was fantastic. I sampled his mashed potatoes and OH MY they are SO good - Texas style. Service was excellent. You could dress up or dress down - you see a little bit of everything. Reata made for a memorable dinner and evening out in our favorite city!"], ["Michael S.", "Took my wife for her birthday. We had a great time and really enjoyed the date. Our food was amazing and the staff was some of the best I have ever experienced. I need to remember to go there more often."]], "The Lonesome Dove Western Bistro": [], "Cafe Madrid": [], "FnG Eats": [["carly a.", "I am so happy we found this gem. We just moved here from the Ny Metro area and our taste buds have been very sad. On Sunday we ended up here, with two small children in tow, around 1130am. Warm welcome. Smelled so good...wood fire. Yum. Very cute inside. Everyone eating looked happy. Sunday brunch, $3 mimosas! Yeah! I had the calabasa and queso soup and while very different, I have been thinking about it ever since. delicious!!!!! I had the iceberg cob and my husband had he macadamia chicken salad.  Fan-frickin- tabulous!! The boys had nice meant options too.  The burgers were great and small enough to not overwhelm their tiny taste buds. The cherry on top? The hostess brought over fresh fruit for my boys while we waited... It was so nice of her and really helped to keep them at bay. Thanks! We ate well for under $40 before tip. That's a big deal for these foodies! We shall return!"], ["Jewell C.", "The food here was amazing! So glad yelp helped me find this place! I had the steak and crème brûlée. I will definitely be back to try some more of their great options."], ["E S.", "The food is good but not THAT good that they have to charge so much for it. The ambient is nice, service is courteous, but the food takes forever to come out."], ["Libby B.", "Very lovely! Came for their Sunday brunch this afternoon with my boyfriend and another couple along with their beautiful little girl. The atmosphere was nice and casual. The chef/owner came by our table personally to make sure all our questions were answered, which they were, perfectly I might add. The food was delicious and above all else completely unique. It was definitely a dining experience. We had a wonderful time and everyone found something they loved from the ones who would eat anything (me included) to the picky eaters to my friends lovely little girl. Everyone enjoyed their meal. We will definitely be back."], ["James M.", "Great happy hour til 7. 2 chefs run the place and quality is very good. Won't find a better restaurant in keller."], ["Keith K.", "Really lucky to have a great, locally owned and sourced fine dining option in KellerHave enjoyed the whole range of offerings, including several set menu special meals on holidays. The folks at FnG deliver excellent food and service every timeMy fav for lunch is the JAC sandwich with a cup of their amazing tomato bisque soupWife loves their Chicken SaladBrunch is amazing as well... The French Toast is unique and a must to try"], ["TJ H.", "This is a pretty solid choice for brunch. They have super good chicken & waffles, and their bloody Mary's are on point. I typically don't notice stuff like this, but the kitchen is located for everyone to watch the cooks prepare the food which I find a bit unique for a spot like this. The staff seems friendly and welcoming, so if you need to find a place to kick that weekend hangover, I'd go with FnG!"], ["Scott B.", "I dig this place. It's vibe is great. Produce is fresh. Service is top-notch. Food is fantastic. Prices are reasonable. What more could Keller ask for? You will not be disappointed!"], ["Krystal A.", "This place is great in regards to the food! It's savory and unique! From the chicken n waffles to the jalapeño cornbread, there's something for everyone. The waiting staff experiences haven't been the best, but the food is worth it! Great brunch place"], ["Chrissy S.", "Outta towner. Went to google and looked up food. Happy to choose this place. Fun, med-loud enviroment, edgy and modern. Great drinks and awesome food. I got the Hickory Citrus Chicken Fettuccine with a Blood Orange Margarita. I wanted something light that wasn't going to make me feel overwhelmed. (Big stk and potatoes). Bring your fiance or a group of friend. Their bar seating is great too for us loners. ;)"], ["Danielle B.", "BEST BLOODY MARY I'VE EVER HAD.The mix is made fresh daily by hand and they infuse their own pepper vodka! I can't order a Bloody Mary anywhere else after this.As for their cusine...Very fresh, contemporary, and flavorful. I had their salmon and it was perfect. I have also had one of their pasta dishes containing a cream sauce with veggies (don't know the proper name of it. It was a while ago) and it was also very good. The menu is small so anything you order will be good as the cooks don't have to memorize a larger menu, giving them time to perfect the small menu they have. I haven't had a dish here that wasn't great. Any of their desserts are tasty, as well."], ["Amy B.", "FYI when I searched for pet friendly dining this popped up in yelp.  Dog has to sit outside patio in sun.  So we left.  Not exactly pet friendly dining.  Otherwise I've always enjoyed eating here and supporting local spots."], ["Tony D.", "The wine is warm both red and white FNG failed not Napa servers are f n grumpy Managers in bad mods"], ["Joshua D.", "This was my 2nd time dining at FnG. Atmosphere: I like the vibe here. It's un-assuming and one wouldn't guess that a chef-driven concept would be found in Keller, of all places. The music was at the perfect level, and the lighting wasn't too bright or too dim. About perfect. The decor is modern, but not uncomfortable. Cozy. Wine list: The wine list isn't what one would expect from a fine French restaurant, but offered a small range of decent wines. I was satisfied with our selection and the prices are reasonable. Especially on a monday, where bottles $45 and under are offered half-off. Cocktails: I began with FnG's signature old-fashioned, aptly labeled \"Best Damn Old-Fasioned\", if I recall correctly. And as the name suggests, they got it right. It's surprising how easy it is to ruin such an easy drink, yet Kyle and FnG's bar program really nailed it. Great job, Kyle. Service: the service was wonderful. My guest and I did not feel rushed or neglected. Our dishes arrived within the expected time frame and were as promised. Our server/bartender Kyle was fantastic, and non-intrusive. He was knowledgeable, knew the menu and didn't hesitate when asked to offer suggestions, which he did with gusto and confidence that is so rare in servers these days. Menu: the appetizers and salad/sandwich menu was the most diverse section of the menu. The entree/main course menu was surprisingly lacking, and offered little other than meat-heavy dishes. While I love steak/pork/fish options, it didn't reflect the creativity on which the rest of the restaurant is based. This was my ONLY caveat. The menu is well-designed and easy to navigate. Food: Both of our dishes were well-portioned and were delivered as promised. Not too much, not too little. The Steak Diane is wonderful, so is The Bomb Chicken. It's a shame the mussels are seasonal, because they were the best damn mussels I've ever had. Price: all things considered, the prices are wonderful. To a Chili's or Applebee's native, they may seem steep; but to diners who know and appreciate great food and service, they are considerably lower than other similarly-styled alternatives. Overall, I was very pleased (as was my guest) with FnG. The simple fact that my old-fashioned was crafted perfectly by Kyle is enough for me to rave over this restaurant. Check this place out. Flacco and Gordo definitely deliver. For you Kellerites who appreciate chef-driven cuisine coupled with a wonderful bar program, definitely stop in."], ["Stacey G.", "Never had a bad meal here!  Thanks for bringing a fresh, farm to table type of approach to Keller.  This place is great for date night or dinner with a family.  The staff knows exactly how to cater to children.  Brunch on Sunday and Happy Hour every day from 2-7 pm with half price select apps, cocktail, wine. And beer specials.  Sun-Mon get half off all bottles of wine $49 and under."], ["Sogus P.", "I ventured in today for the first time. I was hungry and alone, so I sat at the bar hoping to strike up conversation.The host stand was polite and directed me to a seat. I had a perfectly cooked medium rare wood grilled salmon with asparagus. I started with a bourbon and couldn't convince the bartender to join me in my debauchery ( I was going to pay for his too but he wouldn't have it)  The Bloody Mary was simple and delightful. I had a glass of duck horn Chardonnay was able to complete a little bit of work while hanging out at the bar before I got too \"brunchy\". The atmosphere was classy but not pretentious. Football on in the bar, a lot of families and locals I recognize from the grocery store. I ordered a bread pudding that the bartender recommended. It was great. The bartender suggested a fambois to go with it. I was stoked, I love fambois (raspberry desert wine) and didn't see it myself on the menu. He tried to lure me into it with a taste. I was sold on it before he offered it. I can't wait for my next visit. If you ever serve scallops or mussels please let me know, I'll drive from Austin to experience that. This place regardless of ownership and the name has always been a little gem. On a side note the wifi was blazing fast and the bartender didn't have to search for the credentials to log in, he knew it off the top of his head. Huge plus, keep that man in the bar!"], ["Katie F.", "Was excited to try this place--finally got a chance to get away without my kids for an evening and visited earlier this week.  Unfortunately, I was underwhelmed.  Environment gets 5 stars--very fun and hip.  Nice patio area, and comfortable seating.Drinks get 3 stars--extensive menu options, but $9 for a 8oz margarita does not get me excited.Service gets 3 stars--wasn't super busy, but still didn't see much of our waitress.Food gets.....3.5--hard call to make.  I got a strong impression, both from the menu and the entrees, that this is a place that is trying REALLY HARD to appeal to foodie types who like trying new combinations and flavors...but it just isn't clicking somewhere.  The food was just ok.  Nothing that blew me away or I feel a need to return for. Plus--pretty pricey.  Most dinner entrees priced over $20--and at those prices, I expect something extraordinary.Overall, just kind of an 'Eh' experience.  Don't feel a need to return."], ["Arline R.", "When the chef is being creative, hold on to your drawers. He's a great chef! Have eaten at the restaurant several times and had the chefs creations at many Keller Chamber events. Would definitely recommend going here. Good quality food, good friendly Keller service. Yum!"], ["Brittanie L.", "We simply stopped in after leaving to comic book store.  The staff was more the welcoming!!  Shortly after the bartender took our order, the chef personally brought my salad and panini to our table. The best dining establishment I've ever been to.  I was more than impressed,  I was taking back at how delectable the menu was and excellent the staff was."], ["Jan F.", "We had not visited this new city center area of Keller before, and were impressed with the site so we entered FnG with high expectations, and we were not disappointed.Pots of herbs along the entry way and inside preview the attention given to local and fresh foods by the creative chefs.  The menu is small with a few nightly specials thrown in that sounded wonderful, if priced on the high side of the menu.  At our server's suggestion, we tried two of the appetizers.  We preferred the Primadita, an unusual concoction that was like a chopped roast beef sandwich on pita bread that was so tasty.  It would satisfy a lighter appetite as a meal.  The other JAC n Roqamole (a guacamole dip and a cheese dip with tortilla chips - not quite that simple) was OK, though we found the cheesy part a bit too salty for our 'trying to be salt free' living.Dinners were tasty.  My Macadamia Club Salad was an interesting variation of a club sandwich with macadamia crusted chicken breasts, avocado, bacon, field greens, cheddar, swiss, and a honey mustard dressing.  I couldn't eat it all and I must let you know that my dog truly did enjoy the rest, lettuce included!  My dining companion's hamburger was nothing unusual.  Our friends liked their fish and chips, which our server said is the most popular dish on the menu.Restaurant was full so we were happy that we had made reservations and were seated promptly - nice that they take reservations since it was a bit of a jaunt for us to get to this restaurant.  It is a happy atmosphere, and somewhat noisy.  We would happily eat here again, but unless we have plans to be in Keller, I'm not sure that we will make a special effort to go just for the restaurant."]], "Doña Carmen Pupuseria Restaurant": [["Juan V.", "Pupusas are great just like they outta taste if you went to eat in El Salvador, but that's not all, the rest of the traditional dishes are good!"]], "Si Tapas": [["Jim A.", "To rate this 5 stars is not enough! Try the carrot and orange salad! Nothing like it.We ordered about 6 different tapas, all excellent."], ["Nathan S.", "More than just good food, this is an authentic Spanish tapas restaurant. Excellent staff and a good wine selection round this place out.If you are interested tapas, give this place a try. Seems like a place that mostly locals visit."], ["Leslie K.", "Great outdoor patio - very quaint and overlooks a long patch of green grass. I came for dinner and went with the bread with assorted toppings and the paella mixta. The bread was choose 3 out of 4, and we got the tomato marmalade and goat cheese, cheese, and salmon. Though all were tasty, the tomato marmalade was a bit sweet and was the best one out of the three. The paella was very good and definitely a filling option for 2 people. The paella mixta came with mussels, clams, fried chicken wings, pork, squid, shrimp, and scallops. It was really delicious. The rice was very savory and combined with the lemon juice made a winning combination. The meat/seafood was tender and tasty, but the pork was a bit dry and the shrimp overcooked. A very good paella though, overall. One minor complaint that I have is that I had to ask for the complimentary bread basket, and when it came out, I also had to request for olive oil. I thought it was strange that I had to request both, seems like they both should have come out without me asking. FYI - the balsamic vinegar is an extra charge.Service was good, and if the weather is nice, do yourself a favor and sit outside!"], ["Lisa P.", "Perfection. Every single thing. The house sangria. The hummus. The bread. Fried artichokes were so light and wonderful. Tuna was amazing. Chicken in saffron delicious. Portions perfect to try many things but some you'll want double. The marinated beets w goat cheese is great. Use the dressing w the bread. You don't want to leave a drop of anything. Excellent service. Great backyard patio. Will be back."], ["Monika G.", "Ok, I'm obsessed with this place. Si Tapas gets 5 stars from me because it's absolute perfection...if you're looking for an amazing Spanish food experience in Dallas, you've got to come here!The location is a little hidden -- it's a tiny house that's sort of tucked away into a neighborhood in uptown, so you've got to really look for it! We walk in for dinner on a Saturday night around 8ish with no reservations and are quickly greeted and seated into a cozy little nook in the back room with a beautiful view of their cute, little garden patio. Our server is quick to greet us and we order a bottle of Rioja and decide to split the seafood paella. Food is brought out quickly and there's fresh bread waiting on the table for us. The paella is absolutely magnificent!! Plenty of seafood -- shrimp, mussels, scallops, squid and octopus. The flavors were all there and my husband and I devoured our entree completely. Everyone around us was enjoying themselves, and with good reason! Prices are really reasonable, the atmosphere is wonderful and made me feel like I was in a little cafe somewhere in Spain. The lighting was dark and romantic and there was a Spanish guitar playing from their speakers with different scenes of Spain showing on their flat screen TVs. I was in heaven. We'll definitely be back!"], ["Stacy Y.", "The restaurant itself is super cute, but also super hard to find. Look for the place that looks like a small house with an OPEN sign in the window! And once we walked in, the ambience was really romantic with dim lights and lovely music.The food, however, was a little underwhelming. We decided against ordering the sangria (which has no fruit in it) and got the Agua de Valencia instead, which was delicious but definitely on the sweet side. Between four of us, we shared seafood paella, seared tuna with fresh pepper, sirloin steak in Cabrelas sauce, and grilled pork tenderloin with herbs. The paella was definitely the highlight--it had a bunch of clams and shrimp and scallops, and was so so tasty. The rest of the dishes were so-so and very small plates. The tuna was nothing special, the steak was mediocre, and the grilled pork was borderline bad; it tasted like generic grilled meat. The amount of food was in no way enough for us, but we just decided to eat somewhere else afterward to avoid racking up a huge bill.I'd probably come back for the ambience for a date night or something, but I would not come back for the food."], ["Marissa L.", "Wandered around Uptown last night in search of a bite to eat after an event. My phone directed me here, as just about every other restaurant in the area was already closed and their hours listed online are 11:30am-11:00am on both Google and Yelp. So we walked 15 minutes only to find that no, there were no tapas to be had because they were CLOSED. Get your hours right or I will open up a 23.5-hour tapas bar across the street."], ["Cat J.", "Average food, not a huge variety of tapas to choose from. Our table was dirty. Sat outside and was attacked by swarms of Mosquitos. Inside smelled like old house."], ["Mike M.", "Nice place for a quiet evening with a date or spouse. I had the quail and it was quite ok but very boney. I liked the shrimp in garlic, the dijon sirloin and torilla espanola which was the best thing ever. The ambiance and the patio are great. Good place to enjoy reasonably priced tapas."], ["M E.", "This is a hidden gem I stumbled across! So glad I did.  I had my birthday dinner there. It was very quaint, romantic and overall great selection of food and wines.  I will go back!"], ["Anna B.", "It's a nice atmosphere and the staff is friendly I just wasn't a particularly big fan of the food. The marinated shark was fried like something found at the state fair. However, the clams in the paella were delicious. Not a place I am likely to try again but I wouldn't discourage others from giving it a go."], ["Jeremy L.", "Fantastic food. Great wine list. Patatas Bravas, Pulpos, bread and wine all top notch. Santiago took care of me behind the bar. After a decade in New York City with amazing food, and a year in Cincinnati without, it's nice to be reminded that awesome food exists. Reminds me of the month I spent in Spain. I'll be back!"], ["Vi T.", "It looks like a little cafe from the outside but do not underestimate this place. The food here is legit. We had the Garlic Shrimp, Peppered Tuna, Spanish Omelette. I LOVED the Garlic Shrimp's sauce. They also brought out some bread which compliments the sauce well. Overall, it was a positive dining experience. Service was good; but since we came at an odd time (right when they open on Sunday), we were the only ones there. Prices were a little high, just like any other tapas place. I would recommend trying this place out if you have the budget."], ["Mark C.", "Quaint (almost to the point of being hard to find) but very cramped. Come here on a Friday or Saturday night and you're going to wait a good long while. That's not to say it's a bad thing given the ambiance, but given how small the location is you might be better off sitting outside while you wait for your name to be called. Once seated, the menu is incredibly extensive although lacking in some places (No Dolmades?) . If anything the portion sizes were a little large to be called tapas, with a few of the dishes being almost as big as an entire meal for one. As the night led on and the place got busier, it was easy to see the kitchen struggled a little. And while tapas is meant for conversing there were more than a few tables where the occupants had far too much to drink and were loud enough to affect other guests. If you are looking for quiet dining, you are not going to get it here. Period. That's a shame, because this would be an ideal place to be a romantic restaurant. It's even set out and arranged to be one, but unfortunately the whole place comes across like a bar. Fortunately the overall quality of food made up for it. You certainly wont leave hungry!"], ["Tamara N.", "Great food. The red beats and goat cheese is one of my favorite tapas. House sangria is red. My baby girl loves the fresh pacific sole sautéed with almonds, Jason Serrano and garlic. Found this place on yelp and will defiantly come again."], ["Piyusha P.", "Si Tapas has been the back-drop of many great nights for me. Girls night, happy hours, date nights, double-date nights... and they all involved the amazing sangria that they have at si tapas.Here are some of my favorites:-Tortilla Española~spanish potato omelette - fluffy, hearty- Papas bravas, aioli o mixtas~potatoes w/ tomato piquant sauce or aioli -  - man that aioli is so good... and the tomato sauce... I'm getting hungry as I type- Gambas al ajillo~shrimp in garlic - haven't personally had this but it's a crowd favorite- Tomate al ajillo~tomato garlic salad - so incredibly fresh - the olive oil is fruity and the fresh garlic... again, drool- Pimientos aliňados~marinated roasted red bell peppersIf you have an opportunity, go during the Euro Cup or World cup (soccer), especially when Spain is playing. Best experience ever :)"], ["Christiane H.", "Best food I've had on a trip to Dallas all week.  Warm service, amazing curry okra, fine wine, pisco, all tucked away in an unassuming Uptown house."], ["J. C.", "Our best decision when we visited Dallas. Like a kid in a candy store! Its a hidden gem. At first, we was skeptical about the exterior but once you open those doors, you will be surprise at the crowd. We was seated and thought that the table might be a little small for our huge appetite. However, that did not phase us because the food came out so fast and we had some sort of logistic down. Highly recommend the seared tuna, scallop, lamb chops, white rice w/ tomato sauce and egg, and the alcoholic cane pitcher drink. Honorable mentions to the fried shark meat and shrimp in garlic.I will definitely come back the next time I am in Dallas."], ["Eddie C.", "For me personally, this place is normally 3 stars. The food is good, but outside of happy hour, I think it is just a tad too expensive for what you get. With that said, this place is very good for happy hour, and since I only come during this time, I am going to bump it up to 4 stars for the review. During happy hour, there is a wide array of tapas to choose from, all of which are only $3. In addition to the food, $12 pitchers are available. These drinks aren't very strong, but they are quite refreshing! Very good on a hot day! The Agua de Valencia is probably my favorite, but the Sangria and Echegaray are also good. For food, my go-to's are the fried calamari, garlic shrimp, and potatoes with Spanish chorizo. The ambiance is very nice for the area. This is an old house converted into a restaurant, situated right across the street from The Nodding Donkey. If you sit in the backyard, you will be greeted with a nice view of our beautiful Dallas Skyline. This place is usually pretty quiet making it ideal for dates. Overall, solid tapas place, but try to come during happy hour if you can."], ["Tiffany D.", "Absolutely  love this place. Had been craving tapas and a little taste of Spain since returning home from Barcelona and boy did  this place deliver. It was perfect. The location is on a quiet street in tge heart of uptown in what appears to be an old house.  We decided to sit on the back patio. It was incredibly peaceful with a large grassy area and a view of downtown.It was happy hour at the time. We got a pitcher of sangria for 12$. It was really good sangria. We also ordered meat and cheese tray with salami, chorizo, manchego, and smoked  cheese. It was delicious; exactly like i remember  in Spain. An order of the papas bravas which were very good and the sauces were homemade.  An order of the calamari which was lightly fried to perfection,  slightly salty, and delicious. The garlic  shrimp which were very garlicky, fresh, and cooked perfectly.  And lastly 2 orders of the montaditos with the sobrasada, smoked salmon, goat cheese with tomatoe  marmalade,  and a cabrales cream cheese one. The salmon was smoky and tender. It melted in your mouth.  The goat cheese and jam one was sweet and savory.  The cabrales cream was creamy and had a very unique flavor profile. Lastly, the sobrasada  which is a greasy, savory, delicious,  sausage that is almost like a pepperoni spread; One of my favorites actually.  The bread was also amazing. Perfectly toasted and freshly baked. Everything was amazing and would order it all again. Service was quick and attentive.  Food was fresh and all homemade.  Drinks were tasty and the atmosphere  romantic and peaceful. I loved everything about this place!"], ["Mehreen A.", "Awesome tapas! Baby shark taters were great! Lots of varieties on tapas. Great ambiance."], ["Karen L.", "Such a cute little place! I love how cozy and intimate it is inside. I love it when people take established houses/buildings and flip it into something modern! They have this gigantic mirror in the middle that makes the whole place feel spacious too! Love the pitcher of sangria. We couldn't stop ordering them! This is also one of the few restaurants that I have been to that serves Estrella. They have amazing tapas during happy hour. You should try them all! My favorite is the Papas con chorizo (potatoes), Ocra frita con sal de mar y curry (fried okra), Gambas al ajillo (shrimp and garlic), and Judias verdes con jamon (green beans and ham). Some non-happy hour items that you must try are the Angulas al ajillo (baby eel) and Paella de Mariscos! After listing all of those dishes, I am officially starving. Can't wait to go back!"], ["Kathi J.", "Stopped in here today for a late lunch. The staff greeted us warmly at the door and we were escorted to a beautiful table by the windows in the back. The menu has a LOT to it, but the waiter was incredibly knowledgeable - in a helpful way, not condescending at all. We decided to order a little bit at a time, which was a real help to having too many plates on the table at once. We began with some ham and cheese - served with super-fresh bread - and some olives. We moved into the pork tenderloin with onions (OMG - so good), the meatballs (yum), the cod fritters (fabulous), the cauliflower gratin (amazing), and a little \"sampler\" of the smoked salmon, tomato marmalade, and cheese on toast (SO GOOD). Hubby and friend split a bottle of $18 wine and loved it. THEN...because we hadn't quite stuffed ourselves...we ordered delicious little coffees (\"cortado\" - like little lattes) and dessert. Hubby got the house made ice cream which was very good, and friend and I split the delicious chocolate mousse which would have been enough to split three ways after all the other food! This was a wonderful experience and one of the best meals I've had in a long time. We will be back!PS - during the day, apparently, you can park in the school lot across the street. We parked in the garage that's a couple of blocks down Allen. The walk helped. :-)"], ["Meghan G.", "My favorite restaurant in uptown!! Best sangria in town! They can be a little pricey, but go for happy hour for the lowered prices. Trust me, you'll go through 2-3 loaves of bread. It's that good!Order the shrimp in garlic, potatoes and chorizo, calamari, green beans and ham, and the okra! You won't regret it!"], ["mintymoo o.", "The Spanish cuisine here is yuuuuuum!!!the paella was buttery, moist and full of flavor!!! It's big enough for 2-3 people. And the pan perdido dessert was just delicious....u have to try that dessert with a side of pepper ice cream.....very interesting and tasty. This is a cute and quaint spot to have a great glass of wine and fun conversation with your lover or your friends!"], ["Jared K.", "It's hard to live in Dallas and not eat tapas from time to time. My wife had been to Si Tapas before, but this was my first rodeo. Our waiter was super friendly and gave great, quick service. I also thoroughly enjoyed the atmosphere, which was both simple and inviting at the same time. Since the general idea behind tapas is to try a bunch of different things, I think it's easiest to review the food in list form.1. Echegaray Cava white sangria: The sangria was light and crisp, which was a perfect pairing for a hefty meal.2. Serrano ham croquettes: They were creamy, delicious, and very tasty. Croquettes are one of my favorite tapas picks.3. Fried calamari with poppy seeds: The batter was nice and light, and they were fried perfectly. I didn't find just an abundance of flavor, and I'm not sure how much the poppy seeds added either.4. Shrimp in garlic: Not surprisingly, the garlic stood out the most here. The shrimp were cooked well at least.5. Fried pork belly with chocolate sauce: Fantastic! The chocolate went really well with the pork for some reason. The extra-crisp batter also made this dish extra delicious!6. Veal sweetbreads with capers in lemon sauce: I found just the right amount of lemon, which paired nicely with the velvety meat.7. Fried blood sausage: Although only for the brave, this dish was really flavorful.8. Fried Okra with sea salt and curry. The okra was, as you might expect, nicely salty. The curry was an interesting twist, though I would have liked more of it.9. Baby lamb chops on the grill: There was a nice sear on the meat, which was also very juicy. I think some black pepper would have made these even better.10. Sirloin Steak in cabrales sauce: I found a big punch of bleu cheese here. The meat was very rare, which made it really tender.11. Beef meatballs: The meat was incredibly tender, but the sauce strangely reminded me of Chef Boyardee.As if that wasn't enough food to tide the four of us over, we couldn't resist tacking on some dessert. It was hard to pick just one, but we eventually settled on the Spanish Tempranillo red wine chocolate cake. This was an excellent dessert! The red wine added a nice bitterness to the whole thing, and it's hard to compete with chocolate. There were a few parts of the meal that could have been a little better, but overall I left extremely satisfied."], ["Lee R.", "Si Tapas was a pleasant surprise. Enjoyed several tapas dishes and some \"mixta\" paella but particularly enjoyed a pork loin and caramelized onion bruschetta, crispy fried okra, and a very tasty potato omelette of sorts.Service was fine although we did have problems being understood by the Iberian waiter, even though one of us speaks Spanish as a native language.Our table in the far corner of a glassed-in back porch was the best in the house, especially on a very rainy evening. The wine selection was simple but agreeableHowever, a table of six women next to us had been hitting the sangria a bit too long and the noise volume in the room was at the occasionally-shoot-them-a-dirty-look level (which was not effective).What is it about braying, inebriated women at Dallas restaurants, anyway?"], ["Olivia R.", "Some of their tapas are really good, they tend to cheat a little on their cheese boards by putting salami, hams and cheeses that are not the ones you order, hoping that the customer won't notice. BUT CAREFUL cause if you point out they made a mistake they will say they can't do anything and WON'T APOLOGIZE for THEIR mistake. I used to go to this place at least once a month... but their customer service has declined so much in these last couple of months, it's sad. I guess café Madrid will be my tapas place from now on!"], ["B T.", "Wonderful restaurant, terrific food, excellent atmosphere, unique experience.  We have tried probably 15 different tapas, not a miss in the bunch and many were home runs! Without a doubt, give this a try! Quaint and homey in the best sense. Only wish we could get there more often."], ["Behrooz D.", "The food quality was good and the ingredients seemed to be fresh. However their portions were so little that I had to order two dishes to get full."], ["Linda D.", "Came here because I was craving some Spanish food! The seafood paella was SOOOO good! my mouth is watering thinking about it right now. we tried the fried shark, which was interesting. shrimp in garlic was really tasty and im not even that big of a shrimp fan. fried calamari was good.. average. mussels were really good. octopus was ehh.. not as good as I thought it would be.. too much olive oil. seems like everything is drenched in olive oil.. I did not like the seared tuna here... taste like olive oil and the peppers around it was just too much for me. cute little place.. id come again if I were craving paella."], ["Steve S.", "Jamie and I did the happy hour here today, and enjoyed five delicious appetizers and three glasses of sangria for less than $30. The food was mindfully prepared, and quite tasty:- shrimp in garlic sauce was six nice little bites, with a nice pool of garlic butter to soak up with the fresh warm bread- fried calamari, light and crispy, and not a hint of oiliness, served with herbed aioli- green beans with ham- nice french preparation, in a rustic mustard sauce- poatatoes in aioli- same aioli, and perfectly roated cunks o taters, crispy outside and creamy inside- orange salad- shaved carrot slices and orange orbs, lightly dressed and and garnished with fresh mintThe sangria was red, refreshing, and quite tasty, perfect for a summer afternoon.The service was understated, attentive, and flawless.  We got honest opinions when asking about various menu items, a rare and simple treat in itself.We'll be back soon, to enjoy more of this heavenly happy hour experience."], ["Jael N.", "I visited this place with my husband and a friend for a late dinner. I am undecided between 2 or 3 stars. Right when we arrived we were greeted and seated right away. The decor an ambiance is great. I would recommend this place for large groups. The food was a hit or miss. Some of the things we ordered were yummy but others were terrible.  The octopus and Serrano ham were not good at all. I informed the server since he asked how everything was. He took the octopus off the bill because we didn't eat it. The croquetas (ham), coliflower and the garbanzo spinach spread were good, but not amazing. This is not a memorable place. Is just okay. We really loved the ambiance and the service but that's it. It works of you are going for drinks nearby afterwards."], ["Charlotte J.", "Absolutely delicious! A wonderful experience all around. The atmosphere was intimate and comfortable. The service was attentive, friendly and professional. The food was spectacular. Try the hummus if they have it, you won't regret it."], ["Lily P.", "Came for happy hour and the only good deal are their pitchers. Food specials are $3 for small plates and they really emphasize on the \"small.\" I was a little disappointedService was terrible. The waiter looked like she hated us and didn't want us to be there. We were scared she would spit in our food if we kept bothering her. Don't celebrate birthdays here, cause they charge you for your own cakes. Lame Paella is a must. As is sangria. But everything else was ordinary. Atmosphere is quaint and cute for a date night. I just hope you have a better waitress than who I had."], ["Nga N.", "Love this place for happy hour. $3 tapas and we pretty much ordered the whole menu. I highly recommend the shrimp in garlic, because of the amazing garlic-y sauce. The shrimps were whatever, but that sauce was money. The potato omelette was delish even for someone who doesn't like potatoes. The fried smelts was also yummy and fun to eat, if you aren't scare of eating the whole fish with the head on it. Everything else was a better than expected, but those were my 3 favorite items at si tapas on their happy hour menu.Drinks: We had a pitcher of Echegaray and it was so good, but weak though. It was fruity and minty...very refreshing. Another great happy hour (and tapas) place added to my list. Note:  -Happy hour is from 4-7PM, Mon-Friday -Happy hour food prices are not offered for parties larger than 8...Lame!! -Parking is hard to find...Double lame!!!"], ["Alice L.", "I came here for happy hour with a friend. I got lost trying to find this place and so did she but that's because this restaurant looks like a small house on the side of the road. Nevertheless, it's a cute little restaurant that's perfect for a date or a casual night out.Between the two of us, we shared a pitcher of sangria, montaditos, shrimp in garlic, papas con chorizo, and fried okra. To be completely honest, the food to me was just okay. Nothing that was mind blowing to say the least. I liked the montaditos the most probably just because of the variety in the plate. Like everyone said about the shrimp, it's nothing special but the sauce is delicious (great for dipping the complimentary bread in). Papas con chorizo was a bit disappointing to me because I felt the chorizo was a bit burnt. The fried okra was really good though, and this is coming from someone who doesn't normally like okra. Sangria is great, and us two girls downed that pitcher like no other. For $12 each, I think this place is totally worth it! I'll have to try some of the other dishes some other time."], ["Lindsey B.", "Likes:1. Food has some great flavors. Dislikes: 1. Tables are INCREDIBLY tiny!! I was with my boyfriend and we were sat at a table that was the size of my desk in middle school.  This is not ideal at any restaurant especially at a tapas restaurant in which you are ordering several items.2. They serve bread, but do not carry butter. According to the manager Francisco, it does not follow \"traditional\" Spanish culture because in Spain, the people only eat butter with breakfast.3. There are no substitutions allowed. This is the result of a pretentious chef or owner.  According to the manager Francisco, they do not allow subs because it takes away from the \"traditional Spanish recipes\" that they have.  I understand where they are coming from, but the problem is, the customer is paying money for their meal and if they want to sub goat cheese for manchega cheese - then LET THEM! I asked for a manager to come and speak with me. Francisco came over to my table. I mentioned everything listed above to him.  He was very defensive about my dislikes.  He did not apologize for my unhappiness, nor did he offer to do anything to make up for my bad experience.  I worked in the F&B industry for 3+ years and I believe that Francisco handled the situation completely wrong. If all of their managers act like that when receiving constructive criticism then it will not be long before this restaurant closes."], ["Cecilia P.", "Never knew Dallas had a tapas restaurant and found this one on yelp! Was taking my boyfriend here, has no idea of where the location was. It's actually in the middle of a residential area and lofts I'm assuming! Be prepared to parallel park, watch out for residential parking. I got there around 7pm, it wasn't crowded yet, after we got drinks, the crowd started coming. It's a very small place, once the inside is full, you'll be seated on the patio. We ordered a pitcher of echegaray, which tasted like a mojito with a strong lime taste. We ordered 6 plates... Seared tuna, fresh scallops, pork belly with chocolate sauce, clams with wine sauce, potato omelette, and creme brûlée for dessert!"], ["Capree V.", "Valentines Day dinner was exquisite! Great backyard view of Dallas skyline at night. Try the clams and shrimp. ..you won't be disappointed!"], ["Norma A.", "Si Tapas served up a very nice meal. server was pleasant, warm and charming. Food was great... we ate way to much but rolled out of there happy campers."], ["Lifan L.", "Nice balcony in the back. It is just hard to find something on the menu that doesn't taste good."], ["Ivana J.", "I came here on my one night out in Dallas and even though we came rather late, we still had a bit of a wait due to the popularity of the place. Nonetheless, we enjoyed some drinks out on the chilly but lovely patio before getting a table inside. There, we proceeded to destroy a selection of tapas, including croquetas de bacalao, some choice montaditos, fried okra (just like back in querida Espana), tortilla espanola, and delicious pulpo. The only weak spot in our selection was some fried pork in a chocolate sauce, which was our last dish and way to rich for me at that point... everything else was amazing! As a bonus, they even had tinto de verano on the menu, although it wasn't \"verano\" enough outside for me to order. When the bill came, the difference between LA and Dallas became immediately apparent- all of this food + drinks came out to ~$15 per person. Amazing."], ["Lindsey H.", "Wow. I LOVE this place. Such a quaint little restaurant hidden in a row of houses. The atmosphere is fantastic, definitely romantic in the evening time. The food is delicious, and reasonablly priced. The only thing I didn't really enjoy was their sangria. It was pretty sub-par. But don't take my opinion too heavily into account there as I have been to Spain. Definitely a must try!"], ["Marco C.", "Overall good food. No complaints but I wasn't \"wowed.\" Tried 5 different plates and they were all good but not great. Might try it out again. Nice atmosphere though."], ["Terri H.", "Pollo ArandaThis place was difficult to find but well worth the hunt.  It looks like the building was a house converted to a restaurant, which is very cool because you feel at home here.  The gentleman was very friendly and let us sit wherever we wanted.  We choose a table looking out over the back yard where the squirrels and birds were playing.There were so many exciting menu options that I could have spent all day here.  We started with three toasted breads.  One was topped with sobrasada, one with salmon, and the other with tomato marmalade with goat cheese.  My favorite was the Pollo Aranda.  It was chicken in saffron wine sauce.  Patatas con chorizo and the albondigas were delicious.  Patatas con chorizo were potatloes with chorizo.  Albondigas were perfectly spiced Spanish meatballs.  There were several Spanish wines to fit any taste.  I tried two different glasses of Tempranillos and I enjoyed both of them."], ["Mike B.", "This was my 1st time Tapas experience....and now I am a lifetime partaker thanks to Si Tapas. Stumbled upon this place when I was virtually looking in the area for something new to try for Happy Hour with co-workers. They have select $3 Tapa dishes and $12 bottles of house wine and pitchers of sangria every day for Happy Hour. I didn't like the idea of sharing my food with folks....you make your own decisions now. But even the shortened Happy Hour Menu has too many delicious sounded choices so I acquiesced....that's the point, right?  I ended up tasting the best dishes of the night on someone else's plate, the Gambas al ajillo (shrimps in garlic) and Montaditos (toasted bread and various toppings).  The ambiance is on the quiet side, with a nice bar when you first walk in. And the service was just fine...nothing stellar or egregious in the mix. They were attentive and nice. The parking situation is absolutely outlandish in the area even at 4pm, so come with that mindset...there is some self-parking just northeast a few blocks and some free valet in the same area so that's your best bet....especially after things get popping in the area.  With all of that...it was a great experience and I strongly recommend it to people looking to try Tapas."], ["Alex Q.", "Despite the pricey-ness of the tapas (usually tapas are cheap or at least come free with purchase of drink in Spain), I enjoyed this place. I came with a friend I met while we were both teaching abroad so we both had high expectations. And we were able to reminisce over a table full of patatas bravas, queso, tortilla de patatas, and of course plenty of tintos de verano. I stayed away from the jamón but my friend said it was on point. While the restaurant is a cute little house, I really wished they had better patio seating. Then I could close my eyes and sip my tinto, pretending I'm back in the plaza mayor."], ["Lavi W.", "I love Tapas, but apparently my friends didn't want to spend too much money on fooooooood, which made me super sad. We sat in the little backyard of this place. The weather was great and it felt so cozy.Sangria is a deliciously sweet treat for myself. I really like the seared tuna with peppercorn. My friends were obsessed with the sautéed artichoke."], ["Ginger X.", "Worst delivery experience ever. I ordered a total to 57 dollar food today including tips. On top of that, I tipped the delivery guy an extra five dollar, only to find out that there was no plasticware and No napkin. So I called the resturant and the manager's response was \" we don't do that, We never include plasticware\" Hello?! Food delivery not including plasticware?? How are ppl supposed to eat then? Avoid ordering food from this resturant, forever! And I will stop going to this resturant  and tell all my friends not to go. If they don't care, that's fine. There are thousands of restaurants out there and I can spend my money with satisfaction and being respected."], ["Christopher T.", "Service at this place has really stunk lately. I've been back with a group and servers walk around bitter about something. They don't have to be friendly but they shouldn't look bothered by customers. You may end up sitting there confused about how you've offended them."], ["Stella W.", "I love the decor of this place from how the restaurant is inside a quaint old house to the old brick like floors.  It takes you to another country and time once you walk in.  Definitely a great escape from the summer heat.  This is actually our second visit.  Because we came during Happy Hour this time, it was definitely a much better deal for the same amount of food. So definitely come during Happy Hour which is Monday-Thursday from 4pm-7pm if you can.  Our favorite drink is of course the pitcher of red Sangria. As for food, we recommend Gambas al ajillo (shrimp in garlic), Papas con chorizo (potatoes sauté with Spanish chorizo), Ocra frita con sal de mar y curry (fried okra w/ sea salt & curry) and of course the Paella is a MUST.  We love dipping their freshly made and super soft complimentary french bread with the oil from the shrimp in garlic and potatoes sauté with Spanish chorizo. Their dessert, Pan Perdido, is the perfect way to end the meal.  We love the blend of caramelized apples with their homemade vanilla ice cream."], ["Angela F.", "This is my second visit, and it was as good as I remembered. The atmosphere is great here, so if you want to impress a foodie, this is the place to go! It's cozy and really nice at night... That could have been the sangria talking, but trust me. It's date night approved. I've done both dinner and well, pre dinner. Anyway, everything I've tried so far has been a hit. Garlic mushrooms, garlic shrimp, the bread with tomato marmalade & goat cheese... And my favorite, the baby shark. Delicious. Service has been on point, always attentive but never overwhelming. Definitely going to go back and try a few more things!"], ["Francisco R.", "Great experience love the concept of Tapas and this place has great choices and delicious. The place is very different from the rest and stands out will definitely come back for more"], ["Heather N.", "We had dinner here on a Saturday night while we were in Dallas for the weekend. This place lived up to the high reviews. We got there about 7:00pm. There were tables open outside, but it was incredibly hot & humid so we opted to wait for a table inside. We waited about 15 minutes and had a drink (get the sangria, it was amazing!) until we were taken to a table in the back. It was small, and dimly lit, and just perfect. Our waitress was friendly & efficient. We ordered drinks and perused the menu. The menu had a LOT to offer and it took us a while to decide. We ultimately decided on 6 items: the shrimp & garlic, the shark, the pepper crusted ahi tuna, the brussels sprouts, marinated mushrooms & fried okra (we were hungry...)The only thing that was a let down was the mushrooms, which was disappointing since we're mushroom fanatics. They had very little flavor. All you could taste was the red wine the mushrooms were marinated in. Everything else was amazing. -The shark tasted like salt & pepper catfish, intensified. The flavor was strong and delicious. The texture wasn't as flaky as most fish, It was much more substantial.-The shrimp and garlic was AMAZING. There was some type of chili in the garlicky broth, and it gave it a very slow moving heat. The shrimp were perfect, and the leftover broth was amazing when we dipped the warm house bread in it. I wanted like 6 more bowls of this. - The tuna: AMAZING. It was lightly seared with a peppercorn crust. The tuna was served with olive oil & lemon and was perfect. The lemon accented the fish, instead of being a prominent flavor. The tuna was so tender and tasted so fresh. -The brussels sprouts were amazing. They were also tossed with horseradish, It wasn't a combination that I would have thought of, but the flavors worked so well together. I would have been happy eating this all day. -The okra was good. I honestly don't like okra, but I read that you HAD to order it. Graham loves it, so we had it. It wasn't 'fried okra' like I've ever had before. It seemed more like it was roasted. It didn't have a heavy breading on it, and it wasn't slimy. It was crunchy and had a fantastic flavor. I am SO glad we ended up here for my birthday dinner. The restaurant had a ton of character, the staff was friendly and the food was amazing, and the prices were amazing. The tuna & shark were the most expensive items at about $9 each. The only negative was the blah plating. Everything was just tossed in a bowl, and had no presence. As busy as they were though, it didn't bother me too much. Just made for bad food pictures =("], ["Kristen S.", "Really tasty food, very pretty ambiance and the waitstaff was incredibly friendly and attentive! The Happy Hour is a great deal! $4 sparkling wine and $3 tapas? How can you not give it a try? I anticipate changing my review to 5 stars once we go back and try the full menu, but for HH I highly recommend the garlic shrimp (dip your bread in the oil), garlic chicken, calamari (great dipping sauce), tomato oil salad (eat on the bread for delicious bruschetta), green beans and ham, potatoes and chorizo (so good!) and leave some room for dessert! Ask about the homemade ice cream flavors: pepper, red bean, green tea, cheese! The Pepper Ice Cream and Berries/Oranges in grand marnier is to die for as well as the ice cream and bread dish. Check this place out!"], ["Elaine C.", "My favorite neighborhood restaurant owned by bona fide Spaniards!"], ["Sarah P.", "I had been here for dinner awhile ago and remember it being good. Went for a late lunch recently, and it was not as I remembered. We were the only ones there, but service was great!GREAT:AsparagusSangriaGOOD:Garlic tomatoesOK:Patatas Bravas - had way too much sauceMushrooms - sliced so much you can barely pick them up with your fork and especially spicyTortilla - Had a weird blue cheesy sauce on top and the consistency was such that you couldn't really distinguish between the egg and potatoBread - didn't taste fresh : /"], ["Kim C.", "I have no idea how this place gets better ratings than Sangria. Normally, I try not to compare, but in this case, there is no comparison. I was so underwhelmed by this place. The Sangria tasted fine, but, the food was just meh. We had the grilled artichokes in lemon creme and they were clearly canned artichokes. The clams in wine and garlic were overcooked and chewy. The shellacked ribs were like shoe leather.  Don't get me started on the service. They could not be bothered to bring clean plates, even when our previous plates were drenched in garlic sauce. They gave us fresh ice, not by taking our cups away and bringing them with ice, but by bringing a plastic cup with ice and dumping over the melted ice. The server seemed like it was a put out just to breathe and exist. We will never return here. It was the most underwhelming meal I have ever had. I am shocked that it gets such good ratings."], ["Cara N.", "I've been to Madrid and Barcelona and this place is the closest thing you can get to the real thing.  My husband lived in Spain for 3 years and this is where he took me on our first date and I fell in love...with him and the place!  I recommend the patatas bravas, the pork with sautéed onions and gorgonzola on toast and the garlic shrimp.  The artichokes are also very tasty.  And of course you have to get the sangria.  Great date place or place to go with a group and just order a bunch of things and share."]], "Esparza's Restaurante Mexicano": [["Steve I.", "Great waitstaff, great scenery, and most importantly great food! My waiter Max, (max s million g) was always easy to be found, no book needed to remember orders. He also offered great recommendations and  was very knowledgable of  the menu. Looking around everyone seemed happy and focused. Another sign of how good management is running restaurant. You have to visit this place sometime if you're in Grapevine Tx! Me and my date are very pleased. 5+ stars"], ["Rachel R.", "We stopped here this weekend on Saturday while we were wine tasting in Grapevine. The food smelled so good from Homestead Winery that we made our way over for some grub. The restaurant itself was super cute. It is located in a residential area and has a cute little patio outside. The inside was well maintained and open. The food was decent, but nothing out of the ordinary. I ordered Tacos al Carbon. While the seasoning was good, the meat inside was a little dry. I prefer Cantino Laredo's Tacos al Carbon to these. However, the salsa with the chips was delicious. It had the perfect amount of heat!"], ["Keisha A.", "The food was over priced for no reason. Don't sit on the patio your service will not be great. We asked a couple of waiters to take a picture of our small table of four. They said made it clear that they didn't want to take the photo. I will not be back to the restaurant ever again.  I would have been better going to taco bell. At least they would have gotten my order right."], ["Terry H.", "Very good food. Always great service. The chips were extra fresh and crispy today. My favorite. The Build Your Own Tacos were awesome. More than I could eat at one sitting. Flautas were also very good."], ["Jeff L.", "I am completely impressed. The Swirl margarita is awesome. They mix sangria with the margarita to make a sweet and sour drink. I tried the gluten free tacos. A delicious chicken fajita with cilantro. Sid s include fresh avocado, rice and beans. Service was fantastic. We sat outside and had a wonderful experience."], ["Rick K.", "Food and Margaritas always rock. One bad thing is how they seat people and service. Arrived asked for a table outside. Told 25 min wait. (Open 4 top right next to me) Family of 7 shows up right behind me. They squeezed the family in and told me to go inside.  Was seated and waited 10 minutes to even be acknowledged. Guess higher $$ over loyal diner. I'll go to Baja next time. Better service. Better Rita's."], ["Margaret B.", "I'm a little floored by all the harshly worded negative reviews.While Esparza's bills themselves as a \"Restaurante Mexicano\", nowhere do they claim they are the best Mexican restaurant in DFW.They trade in strong margaritas, decent cheese covered Tex Mex, and a patio overlooking Main Street.  Same as El Chico, El Fenix, and Joe T's.No, their food isn't technically authentic Mexican and to those that recommend the Uncle Julio's right next to Chilis, I gotta laugh.  Mia Dia is just down the street.I've come during happy hour and have recently come during lunch to belly up to the bar for cheese enchiladas and a beer.  The bartender gave me excellent service both times.  I was surprised to see they had Grapevine Craft Brewery's Lakefire on tap.  Then I realized something.Ezparza's is commited to the community, to Grapevine.  Not to all newcomers looking to be blown away or impressed by the food.  It's so you can get a great buzz, drinking margs on the patio and watching the Grapevine area grow and transform before your eyes."], ["Lisa K.", "Used to love this place.  $8 for a crappy house margarita that gave me insane heartburn. No thanks!"], ["R J.", "Hadn't been here in almost 20 years, and we stopped in for late-night drinks after dinner...fun...chips, salsa, mediocre drinks, but fun when it's no hassle!"], ["Chris H.", "I really enjoyed this place. The brisket quesadillas were delicious,  service was fantastic!!! I had all the ice tea and water I could drink ---the salsa is really nice."], ["Kelley M.", "Unfortunately, despite all the hype about this place, we were beyond disappointed. We walked up for the first time, not knowing where to go and everyone just stood around. No one helped show us where to go. Once we got in, we were seated immediately though. We were so excited about this place!! The queso was beyond bland and for being \"world famous margaritas\" they were nothing special. The brisket tacos were decent, but it's hard to mess up brisket! The chimichanga was NOT good. I couldn't even eat half of it. For the price, we could go get amazing margaritas and Mexican food down the street! We will not be back."], ["Steven Y.", "We have seen this place for over a year when we visit the local farmers market, we decided last week to go here for brunch.  They start you out with chips and salsa.  The chips were very fresh and were very tasty.  What made them better than most chips was that they were very light and had a great salty flavor.I ordered the Migas Rellino which was very tasty.  They take their migas recipe of eggs, spices and tortillas and stuff it into a roasted pablano pepper with some cheese.  The flavors were great and the chili added to the flavor with the migas. This was served with some \"mexican potatoes\" which had to be some of the blandest tasting potatoes that I have had.  It really was not worth having them on the plate.My wife got a brisket quesadilla which she also really enjoyedThe one thing that I would share that only makes this place OK is that the weight staff just seemed to be robotic and made us feel uncomfortable.  The restaurant also  has an outstanding outdoor patio that is great for the early hours of a summer morning."], ["Anna G.", "Previously when I visited Grapevine I went to Napoli's Italian but this time I chose to go to Esparza's. I was hesitant at first but I'm glad I went. We got say right away on the patio. The server brought us chips and salsa plus a class of water which was nice. Chips & Salsa was delicious by the way. I ordered the Cheese Enchilada and Sour Cream Enchilada w/ beans and rice. It was so good! My Husband had the Chicken Sobrano and it was so juicy and delicious. Loved loved loved the food. The service was extraordinary. We had about 4 different servers. One was refilling our chips, another our drinks, another taking our order. They were all making sure we had everything we needed. Wow I left so impressed with their service. Overall my visit was great and I intend on recommended this place to my friends and family."], ["Roni B.", "Come early for lunch.We came here because I've been hearing about this place & how great the food & drinks were.Got here a little after 11am and I'm glad we did because it fills up pretty quickly.I ordered the the sour cream chicken nachos & it was enough to feed 2 people lolThe only thing I would have done differently was request fajita chicken meat...other than that...these were the bomb. The chips were fresh & so dayum tasty it wasn't even funny!! I hurt myself Yelp LOLYes people....I ordered the swirl margarita....SCORE!! That really was the best margarita I've had in a while!! I'm not normally a fan of the swirl margaritas because they are more miss than hit LOL....The chips & salsa were fresh & piping hot. I'll be back....matter of fact...came back less than a week later :-)"], ["Deano G.", "Sorry, I guess having had some of the best Mexican food in the nation has spoiled me and made everything else average.  This place just didn't do it for me at all.  The puffy taco's were actually funny...  They weren't puffy tacos but more a flour tortilla that was fully cooked and crispy with a hole punched in the top and filled with taco filling....  far from what I was expecting...."], ["Geoff P.", "If Taco Bell had a liquor license this place would be done. Service is fine but food is horrible. Good thing there are plenty of good Mexican restaurants in the area, just won't return to this one."], ["Jan F.", "Esparza's has been a popular local Tex-Mex spot for well over 25 years.  Margaritas abound in all sizes (pitchers too) and styles.  Food is typical.  Fajitas sizzle.  Owners continue to upgrade and the outdoor patio is great and popular during good weather, perhaps because it is so hard to talk inside, particularly in the large bar area - the noise is too much to my old ears.  Parking areas have been added and increased in size over the years but still can be an issue.  The former funeral home's transformation is terrific and it is a must go spot if you are in the Grapevine area, not necessarily for the food, but just because."], ["Cat N.", "The best margaritas in town!!!!!come for happy hour, $5 each glass. You don't need much because they are STRONG!!!!I had puff tacos to eat...it was just okay. I love their queso flameado though. That is good enough to share in my opinion. It comes with melted cheese over fajitas chicken and beef meat. DELICIOUS!!!! best eaten while the cheese is gooey melted hot goodness!!!this place is located behind the shopping strip near the houses. I didn't know so ditzy me walked up and down the strip looking for it hehehe"], ["Jordan W.", "What used to be a family home in Grapevine, outside of Dallas, is a really good Mexican restaurant called Esparza's. I went there for a dinner on a family vacation and we had a fabulous dinner, according to my mom.First the drinks they have are good, such as wine, margaritas, and more sodas you can enjoy. We also ordered the chili con queso for an appetizer with the chips and it had some good flavors. The salsa with the chips was great in taste but had a little kick to it. That's what we all thought about it!When it came time to order our entrees, I had the grilled shrimp with rice and the sauce they top the shrimp off with. I enjoyed the sauces flavor because it gave the shrimp less dryness than what it would've been if it came out plain. The rice had an average taste but it could've had more spices or flavoring. Finally the bean soup was on point. It had nice taste in which any other bean soup would have and it went good with my meal.The service is amazing and friendly. When our waiter was busy at a time, another nice gentleman came to us and helped us out. Good family owned place and I want to give this restaurant a lot of credit for making it so clean, and the atmosphere was a nice feel for a Mexican place. I would love to come back here again when I get the chance on another trip to Dallas.It's a good restaurant to take your family out to for Mexican food and even if you are on vacation go and try it. You'll find it will be pretty decent."], ["Ben B.", "This place is good but not great. It's usually busy so many others like it!  The service is hit or miss. I've never not liked my meal here. Time of delivery varies. I generally get a shrimp dish. This last time it came out in advance of my tortillas so I was munching on grilled onions and peppers without which was interesting. I live in Dallas so I have my go to Mexican restaurants. This would not be considered in my typical rotation if it were in Dallas. Parking is pretty easy. There's a free lot across the street and plenty of street parking to boot. Can be noisy inside so I recommend sitting outside if the weather permits."]], "Dona Carmen Pupuseria Carlitos Raspados": [], "Chadra Mezza & Grill": [["April M.", "It was around 5-6 on a Thursday evening and the place had a steady flow of customers that sat and ate for a long time like us.Because the portions are huge! I had the gyro ($9) which filled me up for the rest of the day and made up for my saving my appetite for this dinner. Really good. Enormous. I cannot emphasize that enough. I honestly could have split it with my friend who had the Kafta (?) sandwich which she said was good too. Both of our meals came with fries. My plate had a good amount but my friend noticed her unequal and small amount of fries and told me she considered asking the waitress for more but luckily the waitress came out at the same time with two baskets explaining that the cook actually noticed but just wanted to get our food out first. So yay for both of us! After my gyro, I somehow mustered the space to order a scoop of their Turkish Coffee ice cream which I crave to this day. I'm not one for coffee but this one was the right texture and authentic. Lord have mercy, I'm so big on texture. And this ice cream was smooth and had coffee grinds in it which gave it this complimenting graininess. It was only $2 for the scoop but it was a really small scoop. The disproportionate scoop was amplified in the already tiny bowl it came in. Overall, my experience was super worth it. The food exceeded my expectations and I liked the environment and that general area in Fort Worth."], ["Jim S.", "Gyro and hummus were very average, hummus lacked much taste and pita seemed store bought, thin and Luke warm. Italian dishes on the other hand were outstanding, meatballs were awesome and sauce was perfect to my taste. Eggplant lasagna was very tasty. First time there and in the hood so we'll be back and focused on the Italian side of the menu. Side bar on seating there were only 2 sets of guests at the restaurant and we were seated at a small table as a couple, when food arrived waitress asked where to put it?? Just a pet peeve ...why sit us at a small take when there were 40 open and as a server..figure something's out like where to put the food."], ["monserrat a.", "As new residents of Fairmount this was a neighborhood staple that was on our bucket list.  When we walked into Chadra Mezza i cannot express how excited we were it smelled delightful, there was a great Friday night vibe. The bar was fully loaded w great spirits. Our bartender Thomas immediately  greeted us and made us feel completely welcome.  He was relaxed yet professional. Funny and suggested we go with the $18 buffet as first-timers there so we can try a little bit of everything.My personal favorites: hummus, so fresh and garlicky, babaganoush, the tilapia, juicy thick pieces of gyro, the pizza, lamb shank, the grape leaves were so aromatic and lastly the chicken.Honestly this will become our favorite go to spot now. We're sold! And we're not easyily sold but Chadra has impressed."], ["Vichy L.", "The Gyro was a great size and wonderfully flavored. I got full after eating only half of it!! -I mean... I ate the fries, and they were a little cold. But, I had to drive my plate ALL the way home. The plate had a good warm heat to it, but it wasn't too spicy. The garlic knots... man... those were delicious! The restaurant guy was really nice, and the next waitress that saw me also asked if I needed help, so overall. It was a good experience."], ["Amanda W.", "I'm vegan and went in because people recommended it to me and I've always enjoyed it. After I ordered the vegan friendly grape leaves I took a bite and there was actual meat in it! I told my server and he asked if I could still pay for it. I talked to the manager and he didn't seem to care. I'm never going back after being a regular for so long. They shouldn't offer vegan options if they don't really care."], ["Ashley N.", "Chadra, I love you. Your delicious pizza with a crust unlike any other, your chicken shawarma, your perfect falafel. Please don't ever change. Seriously, though you make me want to order the chicken shawarma & the pizza & the falafel just so I can combine the three to make the most glorious shawarma falafel pizza ever. Your wait staff is also extremely pleasant & it's always clean & nice smelling in there."], ["Krista R.", "Chadra, I am sorry that I have passed you up all of these years. I always have intentions of trying you and then I get distracted and I'm like \"OHH, Esperanza's!\" or \"ohh, let's eat at so and so on Magnolia!\". Not this time!We went for lunch. The garlic knots were so good and addicting. I had to be careful and not eat the whole basket! I got the Kabob Trio. I got the chicken, steak, and kafta with a side greek salad. The salad was good, drowned in Feta. The salad dressing was tasty. Some places the chicken and steak are dry, but not here. The chicken and steak were moist and full of flavor. They have a Mediterranean and seafood buffet on Friday and Saturday nights. I will be back to try that!!"], ["Austin S.", "Super nice chef who came and talked to us after I asked our waitress to compliment him on the perfect medium rare cook on the salmon. It was very fresh and delicious!"], ["Adam M.", "I have come across Chadra a few times. They have been at many outdoor music events around Fort Worth. They'll usually have a booth set up with a small selection to chose from. I always enjoyed what I got from them but I always suspected that there was more.Last Saturday I finally made it into their restaurant. It was surprisingly empty for a weekend. We were sat on the patio. It's completely covered so the shade was nice. There isn't much of a view since this place is sort of tucked away.After looking over the menu for a while and not knowing what to choose it was obvious that the buffet was the way to go. That turned out to be an excellent decision! Their buffet has a lot of the same items that are on the menu. So instead of trying to decide on one, I was able to try several. Yes, several.I'm not very big on buffets. Let's face it, most of them aren't that great. I also don't usually eat more than one plate (if it's piled right). Once I saw the buffet I knew immediately that wasn't going to be the case. I was careful to not overload on any one particular item.My favorites were the heavenly chicken and the lamb legs. The chicken was something different for me. I won't pretend to know what herbs or flavors I was tasting but I'm sure I haven't had anything like it before. The lamb legs came with the bone but the meat melted right off. Lamb tends to be a little on the chewy side so having it slow cooked was an interesting experience. I think that's how it should be done.I don't think they have the buffet everyday. I'll be back for it soon though."], ["Denise R.", "Buffet was great and there were so many choices. The heavenly chicken was delicious! I will definitely be visiting again.The staff was extremely helpful. The service was great. It was an overall wonderful experience."], ["Sarah H.", "Their meat is HALAL! My friend and I came in here for lunch and were pleasantly surprised to find this out seeing that my friend only eats halal meat. Their lunch buffet has a lot of options and the staff was very kind. We'll definitely be coming back!"], ["Carol D.", "My girlfriends and I meet here once a month for lunch. Lunch buffet is delicious, the dolmas and garlic knots are fabulous. We love this place. They make their own ice-cream too! Only complaint is there is a parking problem around the restaurant."], ["Viralyn K.", "When I want to eat a lot but don't want to eat bad, I come here for lunch. $10 gets you an entire buffet. I am so in love with their salad bar. I love the fresh veggie options and the dip offerings right around the corner. I don't know the names of all of them, but they're so good. They will have meat and cooked veg options, the veg options don't make me feel too guilty. I usually end with fresh fruit. I always try a little bit of everything and it's always so good. I've been to other restaurants like this kind, but this one is by far my favorite. You can tell love has been prepared with the dishes put out. This is my new favorite spot."], ["Emmy F.", "LOVE this place! My coworkers and I work in the medical district and love to order delivery from this place but last night we decided to dine in when we found out they have a bar and hookah too. The service was excellent, the food delicious and flavorful, and all in a delightful atmosphere! We were happy to see Bradley as he had delivered food to us at work, and he's just as awesome as a waiter giving us everything we asked for and super pleasant. They have Mediterranean and Italian food, which I didn't think go together but it's nice to have both options in one place I suppose.Appetizers - I've had the Garlic Bread with mozzarella cheese, meatballs (3 large meatballs in marinara sauce), and hummus (served with 2 pita breads). All of them are delicious but probably my favorite is the garlic bread and cheese, sooooo yummy! Entrees come with garlic knots which are also good, but cheese makes everything better.Cocktails I tried were pomegranate Cosmo, watermelon mojito (which taste exactly as it's name) and something with midori and pineapple which was ridiculously sweet and my friend described as drinking the beach. I like my sweet martinis so the Pom Cosmo was perfect. They also have a decent beer selection and have a normal bar as well. Entrees - I ordered the heavenly chicken... Which is super awesome! Stuff chicken with cream cheese and penne pasta mixed in a creamy Alfredo sauce topped with spinach and chopped bacon. PERFECT. Love hands down. My friends ordered the grilled salmon, penne a la vodka, and kabob trio which they all thoroughly enjoyed too.Dessert - they offered us their pomegranate and Rose ice cream. Of course we were like, \"what does rose taste like?\" And it literally taste like the smell of a rose. I can't describe it any other way but it was good! So try it if you're curious, it's definitely worth it! Oh and the pom was good too. Hookah was pretty basic, they only had about 3 flavors but the owner was more than happy to bring flavors if we asked for next time. Lounge area/patio was nice and they had the big heater lamps to keep us warm and toasty. I also appreciated the random Indie rock station they had playing (they know what I like lol) The owner also approached our table and was extremely appreciative and super nice and friendly to us! I really love seeing that in family restaurants! Makes me feel much more welcomed and wanting to come back! For a Friday night we got a table for 8 at 8pm seated within 5min. So order delivery or make your way here. Either way you will enjoy it!"], ["Jason T.", "My wife and I with our two kids (2 yrs and 4 months old) went for the Saturday dinner buffet and it was good, but not great. They had a variety of food including lamb, crab legs, baked tilapia, 3 selection of hummus, pizza, heavenly chicken and salad. The quality was not the best of what we experienced in the past.  What they didn't have much were fruits (only grapes, pineapples, and strawberries), and desert. For a buffet, we think they should have more options in those categories.Unfortunately, they did not have any juice for our daughter. The price was $18 which was a bit steep for the amount of food they had. We thought we should have order from the menu. The atmosphere was nice with friendly service and they had a patio if you want to eat outside. We have not tried the lunch buffet yet. The lunch price might match the food they have much better than the dinner buffet."], ["Christie P.", "The lunch buffet at Chadra is AWESOME!!! Definitely go on Thursday when they serve the Heavenly Chicken, and bring lots of breath mints since those garlic knot rolls are absolutely amazing! The Monday night pizza and pasta buffet is also good, though it doesn't have as many choices as the lunch buffet. Their pizza crust is always fresh and chewy."], ["Melondy D.", "As a picker eater, I was nervous about trying this place. I had the lunch buffet with my husband and fell in love. The food was amazing and so was the service. I liked the something-vodka penne, the garlic knots, and the assortment of different meats. My husband enjoyed the endless pizza, lol. I loved the decor and overall atmosphere. I enjoyed it so much I went the next week with a co-worker who was already into this place. I'll see you guys next week!"], ["Meredith R.", "After craving eggplant and reading the yelp reviews, I decided to try the lunch buffet. I sampled the hummus, baba ghanoush, tabouli, homemade pita chips, and the saffron rice. I also had a tomato salad. There were plenty of meat dishes and several pizzas to try as well (but  I'm a vegetarian and have been staying away from cheese lately so I didn't try). Everything I has was extremely fresh. But the baba ghanoush needed something. That was my only tiny complaint.Besides everything on the buffet looking fresh and appetizing, it's also labeled so you don't have to guess. The service was composed of hipsters but they were friendly and attentive. The drinks and pita bread basket were refilled often.I'll be back next time in town. Maybe for dinner. Seems like a great place to drink wine."], ["Lydia J.", "The tomato soup was very good but my main dish, Alabma (sp?) was a little disappointing-the meat. The cinnamon rice was very good, though."], ["Hussain R.", "Probably the worst Mediteranian food I have ever had and I am not a Mediteranian food snob. Everyone on my table ordered the same thing pretty much, meat on skewers. I tried lamb, beef, Kafka, and chicken skewers. Meat was extremely dry, over cooked and was completely tasteless. The rice it came with was extremely hard probably from the bottom of the pan. Extremely poor quality. Food arrived 45 mins after we ordered. I will say the server was nice."]], "Pera Wine & Tapas": [], "Casa Rubia": [], "Bird Cafe": [], "The Lunch Box": [["Jim P.", "The best chicken salad in town!  A great little gem if you can find it. The poppy seed dressing is good on everything. Nothing fake here."], ["Reena D.", "I never knew this place existed until we had an Yelp event here.  This place is so cute.  I love sandwiches.  The staff here was so friendly and very attentive.  They made sure we were fed and had plenty to drink.   Everything thing I tried was fantastic.  Loved the fact the staff came around our tables with hot Reuben sandwiches.  It was really good.  My favorite sandwich was the pimento cheese.  It was so yummy.  The chicken salad was really good too with a hint of jalapeno to give it a kick.  The salad was great too with their poppy seed dressing.  The salad was so fresh and crisp.  The fruits were really fresh and yummy as well.  Loved sitting on the patio enjoying the food and drinks.  The desserts are really good here.  My favorites were the coconut cream pie and the coconut/pecan cookies.  The cookies are really soft.  We enjoyed our experience here and can't wait to go back!"], ["Jay G.", "Awesome Rueben. Very hard to find but that's what makes it that much more special. It's like being part of an exclusive underground lunch club being there... Nice staff and very good food. Will definitely be back."], ["Christopher V.", "I was driving around Camp Bowie Blvd. and I thought I would give this place a shot with my family in tow.  Very pleasant atmosphere, cheerful and friendly wait staff, and the food was great.  I'm likely to bring my kids back again, as they absolutely loved the fruit salad with sherbert, and it was large enough for both of them to share, with some left over for their parents.  Very likely to return in the future to try more of their sandwiches."], ["Ally D.", "I never thought I liked chicken salad until I ate one from The Lunch Box. My friend had saved me half a sandwich after I got off the plane in Texas and I was grossed out that it was chicken salad. He assured me it was the best sandwich he had ever tasted so I tried it. And it was the best sandwich I had ever had. I go to the Lunch Box solely for the chicken salad but I'm sure the other things are great. I like to eat there best and have it warmed up on marbled rye. I love the fresh fruit as a side and their poppyseed sauce is so yummy! Only downside is that they are only open lunch hours so no going after work. :("], ["Tia P.", "Cute little place tucked away in a corner! Great place! I had the tuna salad sandwich with potato salad, husband had Reuben on rye and pasta salad, and we shared the crab bisque soup and a slice of chocolate pie. ALL of it was so yummy! Portions are a good size! I expected to leave hungry like most deli type places but I'm most definitely full!"], ["Samantha S.", "I'm not originally from here and this is one of those places many locals are familiar with. Especially since it's been there since the 70's. This is probably the 2nd or 3rd local lunch place I've been introduced to that is famous for their chicken salad. I don't care for chicken salad but I expect the other items on the menu to still be worth my money. As with the other places, I was disappointed again. I got a turkey sandwich that I could have made at home. Regular sandwich bread, a heap of turkey that looked like the same turkey I just got from the Kroger deli and an extra charge for cheese. It also came with chips and a pickle. The poppy seed dressing is ok, it's growing on me. More recently I had the quiche, which was sub par (and I loves me some quiche), that had very cheap tasting cheese on top. Meh. The one thing I can't knock them for are their pies and 70's ambiance, that alone gave them their second star.This is another one on my list of \"Local Favorite Fort Worth restaurants that really aren't as good as people say\""], ["Katie F.", "One of the best Reuben sandwiches! The only problem-- it was so delicious I ate it too fast! The sandwich had a tangy horseradish sauce that wasn't too overpowering, sauerkraut, and a light rye bread. Moist but not too soggy and grilled to perfection. I'll be back!"], ["James N.", "I love this place!!!! The lunch box has quickly become my favorite lunch location.  Everything I have tried here is great and not to mention the staff is super friendly and helpful.  I wish I didn't work days so I could eat here for lunch five times a week."], ["Lisa L.", "Been going here for 30 years. Best chicken salad on earth!!"], ["Lauren S.", "The Lunch Box is a small little family owned restaurant that has the best food in the world. You must try the chicken salad sandwich and the egg salad sandwich. It's just like a little bit of sweet delicious heaven in your mouth. The pies are also made from scratch."], ["Benjamin M.", "Love it. One of our favorite places. We go every Saturday, and my wife has withdrawal if we miss it and go out of town. Fantastic lunch. The best chicken salad sandwich in town. Do not, I repeat, DO NOT miss the chocolate pie. It is hands down the greatest piece of chocolate pie that I have ever stuffed in my face. I now order chocolate pie elsewhere to see if it can be topped--and it cannot. The side of fruit is very fresh. Top it off with an iced tea and it really can't be beat for a tasty lunch."], ["Katy W.", "Do you have those special childhood memories at a local hometown establishment that no matter when you're there it always feel like home or makes you feel like a kid again? That is exactly how The Lunchbox is for me. I have been dining at this perfectly quaint lunch spot ever since I can remember. After going through several well established Fort Worth owners, the Lunchbox has not changed a bit since its debut in 1974, even the original yellow and green interior adds to your luncheon experience. Fort Worth natives flock to this restaurant for their homestyle sandwiches, homemade soups and the best pies in town. The chicken salad recipe continues to be a Fort Worth mystery and the topic of several past conversations that I have had with friends or local chefs/restaurant owners - people are crazy over this stuff and rightfully so! When this particular chicken salad becomes the topic of conversation people tend to get into debates over what makes up the delicious concoction - everything but the kitchen sink is what I say but have yet to find someone that can perfect the recipe. Oh, and don't bother asking the owners or waitresses because its a close kept secret - all of that aside, its definitely the best chicken salad I have ever had, and I am a bit of a chicken salad snob. The Lunchbox is also famous for their homemade poppyseed dressing that literally sits in what might as well be vats on every table in the place, you see it going on everything from fruit salad, sandwiches, chips and heaping scoops of that incredible chicken salad, which is my personal favorite application! This hometown favorite is tucked away in the 6333 shopping center on Camp Bowie and very well hidden, you have to walk between two shops, almost to the back of the center down a paved alley to get to it, if you are new to the area you probably have no idea that this place or opening in the shopping center exists but get with a Fort Worth native and see what its all about! The Lunchbox just feels like family, you can see the owners here everyday with their smiling faces, seating people, checking you out and taking orders. I'm always running into local  acquaintances and love seeing familiar faces each time I dine here, which is pretty often, but I love knowing that some of these people have been dining here for years and years with standing lunch dates. Truly a hometown favorite. Oh, a new announcement, starting this month they are now open on Sundays!"], ["Laura M.", "Cute family owned business.  Bright, fun inviting decor.  Chicken salad sandwich is delish, get the potato chips AND dont forget the fruit salad. It comes with poppyseed dressing to drench your fruit in.  Not too sweet, just a perfect combo.  Great lunch place!"]], "Pupuseria Dona Carmen En Riverside": [], "Next Wood Fired Bistro & Vino Bar": [], "Mariposa's Latin Kitchen": [["Carli W.", "Where do I begin?? My friend at work and I found this little spot a few years ago but just decided to give it a try last winter. We had heard how Mariposa's Kitchen prided themselves on only using authentic ingredients and we were intrigued by that. We arrived to a quaint little restaurant with a bakery counter (yum). The hot sauce that greeted us is where we fell in love! We couldn't get enough of it! I ordered the (seasonal) Bean Soup with Jalapeno Cornbread and a side salad with house dressing, and my friend ordered the Enchilada Soup with a side salad; both were fantastic (we shared each others' soups)! The only two requests I have as a delighted customer would be: 1.) Set out LARGE salsa bowls at each table! and 2.) Make the Bean Soup with Jalapeno Cornbread YEAR ROUND!!!! PLEASE!!!! I've been craving it all summer!!!"], ["Warren R.", "This place has great potential. However....There is only one waitress during the lunch rush, which makes this place absolutely unviable for those of us who have to get back to work in a timely manner. The food is well priced, but exceptionally salty. Everyone at my table also had the same opinion. I'm a little unsure how this place has such reviews for the experience we had.  Maybe this was a fluke?"], ["Krista R.", "It becomes evident that \"Mariposa\" in Spanish means Butterfly when you walk in. It doesn't look like much on the outside, but it's nicely decorated on the inside.Mariposa is another hidden gem off of Camp Bowie. It's tucked away in a strip center with Rocco's Pizza behind Mexican Inn. Mariposa's is ran by mother and daughter, Crystal. Freshly made food with fresh ingredients. Mariposa's started off as a catering company and they become popular so they opened up a restaurant. They have been there for 3 years! They have a very small menu. Mini tacos, tacos, enchiladas, tamales, ceviche, and salads. I ordered the mini tacos. One of each: Pork, Beef, and Roasted Chicken. The husband got Tacos. I don't remember which ones, but I do remember the beef fajita being one of them. He said the beef was a little tough. We started off with the dip trio. It was queso, guacamole, and queso with cuban rice. I absolutely loved the queso with cuban rice. Just give me the cuban rice queso and I'll be fine.The guacamole was really good too. The salsa is mild and limey. Don't expect it to be spicy.Be warned, if you come here for the tacos these aren't your normal tacos like in most restaurants here with soft flour tortillas. They fry their flour tortilla first. It's more of a tostada type taco and is not easily folded over like a taco.  I still enjoyed mine. They were really good, especially the pork.My husband and I talked to Crystal the daughter for nearly an hour after they closed for lunch. Really a nice family. They are not known for their tacos, which we figured because almost everyone there was eating an enchilada or a tamale. These tamales are HUGE. I'm walking to the bathroom looking at all the plates and I'm like wow, those tamales are gigantic! No wonder they are almost $10. Man, they looked so good though.Crystal said they want to have more Latin inspired dishes than Mexican inspired. She said starting in September (or soon, I could be wrong with the month) that they are going to choose a Latin American country and make the dish as a special.Every now and then they have a 4 course dinner special with Latin Ballroom dancing or Salsa dancing. How fun would that be?Also, during the holidays starting in November they make a turkey and dressing tamale with cranberry sauce on top and sweet potato souffle on the side. At first I was like WHAT? The more I think about it the more I want one. I bet it's awesome. Lol.Oh! Tamale classes. Every now and then they will offer Tamale making cooking classes. They give you the ingredients. YOU do everything, they just instruct you. Sounds fun as well.You just have to watch for all of the stuff they do/offer on their Facebook. Mariposa's has the potential to be big. Such a sweet place and nice family.So, remember come from the Tamales and Enchiladas. The tacos are good, I'm just telling you what to go for since they are known for those two.Now that I say all that, I think it's time I try a tamale to find out how good they are myself."], ["Jessica N.", "I really enjoyed the beauty and simplicity of this restaurant! Their decor is fresh and simple, their service was great, and their food was tasty.I got a free mini taco with my check-in (yessssssssssss!!) and it was delectable! I then ordered the pork tamale grande and attempted to eat the entire thing.  That thing is absolutely massive.  It was less of a tamale and more of a meat log - it was packed with delicious pork! I only got through half of it, needless to say, and was stuffed!  I had a big of a tummy ache after eating this meal, which makes me give it only 3 stars.  My friend, who had the same dish, also experienced the same thing.  It could have been that we aren't used to eating that much meat or something else.  No one else had problems, though, which makes me hopeful that the next time I come to Mariposa's I will have no problems whatsoever.I want to return and try some other menu items and get a better idea of what all this cute place has to offer!"], ["Andrew S.", "This place is solid. High quality food with good portion size and reasonable prices. Can't ask for much more than that."], ["Sarath P.", "One of my coworkers brought me here for lunch and I absolutely fell in love!! This place is tucked away -- if it wasn't for him, I would've never knew it existed!! First off, the chips and salsa at Mariposa's is really, really good -- the salsa is super fresh and the chips are light, crispy and salty. Both of us ordered the Wednesday lunch special which was the ginger pork empanada plate. This plate came with 3 massive pork empanadas, cuban rice and plantains -- it was AMAZING! Each empanada was full of moist, juicy shredded pork and served with a gingery gravy on the side which was a perfect compliment. The cuban rice was absolutely delicious... a little greasy but full of flavor!! The plantains were good, as well but not the best that I've had. After stuffing ourselves -- we gave in to the waiter's suggestion of getting a dessert. We shared a mini cheesecake -- perfect for two small decadent bites each. I definitely want to come and try dinner soon but for sure, this is going to be a regular lunch spot for me!!"], ["Sarah H.", "It's amazing! Visiting from out of town and decided to stop in. The Cuban dip is fantastic! I never eat rice or beans from a Mexican or Latin place because they are from a canned and the rice is always crunchy. I ate all of my rice. Everything is so fresh and the cookies are handmade. They are done with royal icing and royal icing is time consuming and so difficult. As a baker I'm very impressed with their icing and cookies!"], ["Jw S.", "This place is a hidden gem! Awesome! Everything is fresh and tasted amazing. I would recommend this to everyone!  So so great! The waitstaff were so friendly and helpful!"], ["Sarah J.", "This is a lovely spot in west Fort Worth! The atmosphere is relaxed and friendly. The space welcomes smaller parties, enjoying a great meal and time together. Perfect for a quick lunch or a leisurely dinner. I have been extremely impressed with the menu. Their tamales grande are wonderful. The queso has a unique flavor but still remains true to satisfy your hankering for chips and dip. I imagine the menu is full of family recipes - it certainly taste so."], ["Maria P.", "Very cute place staff is excellent and nice. Tried the free shredded beef taco with my Yelp app it was very good beef was just kind of steamed or shredded but not very spicy. Chicken enchilada was refreshing and tasty not an overpowering sauce. Fish tacos were bursting with flavor best tasting Tilapa I've had in a while. It was grilled and the toppings were very good although I think you could use more. I definitely will come back and try other things.My only negative is I think they should have more variety on the toppings of the tacos and enchiladas for more flavor. I'm happy about the freshness and the atmosphere I would definitely recommend this restaurant."], ["David R.", "Mariposa's has been on my radar ever since I was able to taste some of their delicious tamales when they catered an event. A group of six of us made it over to their newly minted location and it is a cool little place with a nice open floor plan (by Szechuan for those that need a good point of reference).For me, the best thing about Mariposa's are their tamales. Let me say these aren't your grandmother's tamales. They are massive, stuffed with meat, and very unique. My brother I think is still in awe of the one he ordered. You just do not see this type of attention to tamales in DFW.Since I had tasted their roasted chicken tamale (The Girlfriend went on to order it), I went with the jalapeno cheddar, along with a pork taco and a beef fajita taco. Another cool aspect about Mariposa's is that you are not even forced to order an entree! You can order everything individually, hence my three choices. The pork taco was solid and I really liked the jalapeno cheddar tamale too, especially the chipotle sauce. Like the others it is massive and filling. The beef on the beef fajita taco was really interesting because it had a sort of reddish crust on it, kind of like  that of pork dishes served at chinese restaurants. This unique featured made it quite tasty, I might add. I still say the roasted chicken tamale is my favorite. Stuffed with chicken and slathered in pablano sauce and cheese, it is hard to beat. So, if you are craving tamales, make Mariposa's your tamale place. It is definitely mine."], ["Ashleigh D.", "Oh Mariposas, you have so much potential! When you walk into the strip center restaurant, you are transported into a vintage, antique-like, boho-chic dining area. It's adorable and colorful, and is lined with hand painted murals and metal sculptures. I felt right at home with the friendly service and atmosphere. When we were first seated and received our menus my first impression was that this menu was VERY small and limited. You can get a taco, tamale or enchilada for $10 with rice and beans. Mexican favorites or course, but I just felt more options would really make the place pop! We ordered chips and guacamole with our salsa and $10 margaritas. These margaritas are supposedly made with this special tequila that \"is way better than Patron,\" our waitress bragged. Upon receiving our order (quickly, I may add) the guacamole was flavorless, and the salsa tasted like Pace. The margaritas were excellent and I love the tall glasses they come in (in fact I liked all the presentation of food and drink in this restaurant), I just wish the margs were a little cheaper. Perhaps a happy hour is needed. When you check in here on Yelp, you get a free mini taco. So we showed our waitress the check-in and got a beef mini taco. Wow! The flavors were amazing. The meat was juicy and sort of melted in your mouth. I wish I ordered that as a main meal, but instead I got a single tamale (they are really big, think chili relleno big). It was decent, but tasted like it was topped with the enchilada sauce you buy in a can with melted cheddar cheese on top. No juicy meat inside this baby, it was dry and mostly corn starch. As for the enchiladas, they are nothing special. With an abundance of Mexican food and Mexican chains, I was excited to try a \"Latin\" kitchen. When I think of Latin cuisine I don't think of beef tamales, chicken enchiladas, and beef tacos. Also, when comparing to all of the Mexican food we have in the DFW, I would put this quality on the lower end of the spectrum of GOOD Mexican."], ["Catherine Z.", "A small restaurant with friendly staff. The food was delicious and filling. They forgot the free taco with check-in, but we were so stuffed we couldn't have eaten it anyway. The dessert was solid as well. Will definitely be back!"], ["MC C.", "Tried this place for the first time and I have no idea how we've never tried it before! You're allowed to create your own dish (to a certain extent I'm sure) but the waiter recommended pork tamales and they were amazing!! They also had a special with blackened salmon and cabbage that I got and it was great! Not as good as the pork tamales my fiancé got but I was getting it to be health conscious, anyway so I went in knowing that. We ordered a homemade red velvet cupcake for dessert and my fiancé, who hates sweets, said it was the best dessert he's ever had! Will definitely be back. Fantastic service, too!"], ["Heather L.", "Great, casual environment. Make sure you order the Cuban dip (not on the menu!) -- a delicious combo of black beans, Cuban rice, ground beef, & queso. Salsa was fresh & flavorful. Chips were warm and crunchy. Our group ordered tamales, fish tacos, and enchiladas and all were fantastic. Top notch service."], ["J H.", "This place has quickly become one of my favorite spots in town."], ["carrie n.", "Super cute place.  Was on a day trip to Ft Worth and wanted some Tex Mex.  This place sounded unique on Yelp and was really close to the Arts District.  I wasn't disappointed!  They have a basic menu: enchiladas, soft tacos and tamales with several meat options. I was about to order the chicken when the waitress suggested the brisket tacos.  I'm glad I took her advice. I got the \"mini\" tacos but they were stacked high with meat and filled me up.  My dad got the same thing and talked about them the whole day.  Really delicious brisket.  The refried beans were delish and I liked the Cuban rice.We tried the lemon cupcake for dessert and it was a great ending to a great meal.  We got a praline cinnamon roll to go.  I don't know which one I'll choose when I go back.  I really hope I make it back on a Wednesday so I can try the empanadas.  They mentioned the brisket was a seasonal thing so I also hope they find a way to make it standard on the menu...although I do want to try the chicken.As other yelpers mentioned, this is a place best for a leisurely meal.  If you are starving, you might want to get an appetizer while you wait for your food.  Ha, or maybe have a dessert to start your meal!"], ["Amy J.", "I stopped by for lunch. Order Monday special which was beef and chicken fajita tacos.  Salsa was okay, tacos were great, beans and rice not so good. I felt like everything needed seasoning. Waitress was really nice, however once I checked in on Yelp it said claim your free taco. I showed the waitress and she said \"that expired 3 years ago\" Overall it was okay. I will not be back."], ["Watt R.", "Fresh and tasty food! Great atmosphere! The pork tamale was a generous sized portion and excellent! Very attentive and nice staff."], ["David S.", "Light and Fresh Mexican FoodMy wife and I have visited Mariposa's Latin Kitchen twice now, and it is becoming one of our favorite spots.  The restaurant is welcoming, with bright butterfly cookies on the counter, and a vibrantly-painted butterfly painted on the wall.  The rustic furniture integrates well with the modern interior design.  First, we were greeted with fresh chips and delicious salsa.  The chips were light and perfectly salted, making them quite irresistible.  The salsa is on the chunky side, which I am always looking for in good salsa.  For the entrée, I chose the Pork Tacos with Cuban Rice ($10.45).  I found the pulled pork to be very tender.  The meat was juicy and flavorful.  The generous portion of meat was complimented with cabbage and a tasty sauce.  The Cuban rice was great, a good change from the normal Mexican rice served at most Tex-Mex places.  We look forward to our next visit, as we will be returning soon."]], "LightCatcher Winery & Bistro": [], "Casita Salvadoreña Restaurant": []}