{"Ha Na Bi Hibachi & Sushi": [], "Blue Sushi Sake Grill": [["Gary L.", "i love the happy hour sushi and the house margaritas... are the bomb!!! i usually go here every other sunday! sunday funday!!They have also reverse happy hour also... The ambiance of the place is just so inviting and welcoming!"], ["Nicole N.", "My roommate convinced me to give this place another try for their Happy Hour. We got 4 rolls (Cabo, South Pacific, Asparagus, and another salmon based roll), crab rangoons, and edamame. Cabo:spicy tuna, crab, Japanese cucumber (8)South Pacific: Eel tempura, cream cheese, pineapple, scallion, eel sauce (8 pcs)Asparagus: Cooked salmon, cream cheese, asparagus, eel sauce (8 pcs)Nothing was spectacular, but they weren't bad. I wouldn't pay full price for these rolls, but HH prices are fair. I've never found myself craving it enough to come back though. The service wasn't bad. Our waitress came by to check up on us, and was fairly patient with how indecisive we were lol. The manager came by and asked how we were doing, as well. I think he came by the last time I was there, too. I appreciate that (:Overall, I wouldn't crave to come back, but I wouldn't be against going if my friends wanted to go for HH. Tip: check in with Yelp and get complimentary edamame (;"], ["Tinsley K.", "I would give it zero stars if I could.  Friends from work and I show up at 6pm (8) of us.  We check in at front and are told an hour and a half wait despite the restaurant not even being crowded.  Fine, I get it.  We didn't make a reservation like we should've for a party of 8.  However, I see several tables open that can accommodate our party; just sitting there.  I was snidely told by the hostess that those are reserved for people who made reservations.  Ok, no problem.  We will wait by the bar.  An hour and a half goes by and we ask if our table would be ready soon.  Luckily, we were able to snag a tiny lounge like booth by the bar so we could get some appetizers since we were starving, which were ok by the way.  Nothing to rave about despite all the good reviews for this place.  We were told it would probably be another hour, on top of the hour and a half we already waited???  Again, I see open tables.  I ask why our time is being extended even further.  I was told I should make a reservation next time.  We ask a 'manager', if you want to call him that, why we were told a longer time and got the same reply, we should make a reservation next time.  There is nothing he can do, as I stare at plenty of open tables.I have NEVER, in my whole life been treated with such disregard and I'm from NY!  I've dined in NYC many, many times where restaurants are always super busy due to the sheer volume of customers and have ALWAYS been accommodated after a long wait even if we had no reservation.  Get over yourself Blue Sushi!  This restaurant is just an overpriced, Texas sushi faux pas hangout with a tacky menu and 80's decor and the staff and managers are extremely rude.  The place was barely busy and the staff couldn't handle it then, I can only imagine what kind of train wreck goes on when the restaurant is actually crowded.  That's if it ever truly gets crowded because if they let tables sit the way they did Friday evening, they are losing thousands every night.Not only did the manager blow us off, he didn't seem to care to be losing such a huge party nor did he try to make it better by perhaps comping our drinks or an appetizer or even apologizing.  I foresee this establishment being run into the ground in the near future if they treat all large parties like that. This restaurant needs better management or staff or customer service training.  I will never go to this place again.  NEVER!  We took our business across the street to Eddie V's Seafood.  They accommodated our party right away, the service was impeccable, the food was amazing, and we dropped over $1k there.  I recommend perhaps taking some notes from their management on how to run an upscale restaurant."], ["Tonya J.", "Went there yesterday and the food wasn't as great as it usually is, the calamari was just not good to me this time; undercooked and soggy. The sushi was blah.... The beer taps were down so no sake bombs unless you made your own. Our server was nice but overall, I didn't leave happy. So since this review I've returned UPDATE: I've been back twice since the original review  and I'm happy to report things seem to back to normal"], ["Renee L.", "I hate to downgrade this rating and I have put a lot of thought into doing so. I moved next door over a year ago. I visited several times a week and brought MANY friends. Spent thousands of $$ here, bought hundreds of $$ in their Christmas special gift cards....However, my favorite manager was promoted to open the Dallas location. He was my favorite manager because his he ran the restaurant efficiently, the food was 99 % always perfect and in the rare occasion it wasn't it was quickly attended to, his staff and his customers adored him. He got to know his customers and we always felt special going there. NOW...management has changed over SEVERAL times. Some of the same servers are still there and they care and really want to please the customers. However, the quality and efficiency (timeliness food delivered) has gone WAY down. Every time we sit down, even if we have had the server a couple of times we are always asked \"Have you eaten here before\" - then when the servers we know see us and start talking to us they realize, \"oh yeah, these people HAVE been here - probably last week, or maybe even a couple of days ago\"Last night (Wednesday) was the final straw. The edamame was over cooked. The lettuce on the lettuce wraps were wilted and brown and they brought out the dairy sauces on the plate when we asked for them not to be included because I have a dairy allergy. This meal was taking longer than expected so we asked for the hummus to be boxed up but the server came out and said the manager told him they couldn't give us the happy hour price if we had it boxed but he could bring it to the table and they can box what we don't eat. Ok, goodness. We hardly ever box anything up so we didn't know this but again, everything was taking forever and we had to be somewhere. So we asked for it to be brought out to the table with plans of just being boxed up. THEN - the hummus was delivered to the table with the buttered bread which we asked to be left off due to the allergy so the server said he would get a new one right out.....25 minutes later we still didn't have it and the server told me it was because they had to get a \"special\" cucumber and cut it a certain way. Mind you, these cucumbers are the same they serve with every hummus dip, we just asked for no bread. Finally the server said he would just get it boxed up for us to go. Almost another 10 min went by, still no hummus so we asked to just get out check and leave. Then he came out with it boxed up and the veggies were 1/2 of what they normally are. The server agreed. We were so irritated by then we just wanted to LEAVE!!!! We told the manager after the over cooked edamame and wilted and brown lettuce and he did bring more lettuce and edamame. And he also caught us at the door on our way out to give us some more veggies but when I told him how frustrated we were with the whole experience he really didn't seem to care. It was more of a \"sorry you feel that way\" but the sincerity just was lacking in his tone and body language. We have never seen this \"new\" manager before so I don't know his name. Again, it seems like there's \"new\" management every time we go in now. I know this is just one example but ever since the manager, Scott, left there have been many experiences like this but they are our neighbors so I've waited on updating this hoping it would improve. It just continues to get worse. John and Adrian were our favorite servers. John left. If Adrian leaves I'm leaves I'm not sure we will ever go back. Now if you don't frequent this place as much as we do then you might not notice all of this. However, I saw several servers bringing more lettuce out and when I told our server it was wilted and brown he said he wondered what was going on in the kitchen because we weren't the first table this happened to and claimed they were busy. The place was \"steady\" I've seen it busy. We didn't even have to wait for a table. Try Sunday during all day happy hour - that's BUSY!"], ["Holland S.", "Blue Sushi is a cool place with good food. I've eaten here a handful of times and always had a great experience! Atmosphere: Modern, open, and clean. With super high ceilings and cool leather furniture, the bar feels comfortable while staying chic. The staff is friendly and always helpful if you are feeling adventurous about trying something new. Food: The sushi here is clean and fresh. I've never gotten something I didn't like! They have amazing happy hour food and drink specials throughout the whole restaurant. They include selected appetizers and some pretty amazing rolls to choose from. Drinks: Blue has a full bar plus a selection of sake. They are known for the delicious and fruity Martinis! I would recommend giving them a try. Especially at happy hour prices!! Bonus: Yelp offers pretty great extras at Blue, so don't forget to check in to unlock your goodies."], ["Ashley N.", "Very good food, slightly awkward location with most hideous parking situation possible, which resulted in our party being seated (after a 45 minute wait & having to have our names added to the wait list twice) & then having to go back out & valet our cars with another restaurant. They still didn't lose too many points with us, as the food is legitimately great & our waitress really seemed to care, which is a welcome change from most restaurants in Fort Worth. This would be a 5-star review if not for the horrid parking & the fact that they put cucumber in everyone's water. Ew."], ["Vichy L.", "I've been here twice and most of the time, the food is quite delicious. They have a sushi menu that is quite different from I am use to in my hometown. But, the flavors meld in a beautiful symphony and the plating is delightful. The atmosphere here is quite intriguing with the big screen underwater theme and, generally, the staff seem very happy and accommodating. It is a great place for a romantic date."], ["Blair V.", "My sisters took me here for my birthday during their sushi happy hour.  Started off with the veggie tempura and it was pretty good, the only thing that had a weird taste/texture was the avocado tempera but the other veggies included were asparagus, green beans, sweet potato and mushrooms. We ended up ordering the Snow White, Shrimp tempura, Crunchy La, Super Asparagus and the Hot Popper. All were fairly good, no complaints except for the Crunchy La which we agreed had too much chili sauce on top which softened the crunchy Pablo crumbs quite a bit when it arrived at our table. We also ordered a house margarita which was only $3 which had a quite a kick to it. All in all, it was a great birthday dinner and I would definitely come back the next time I'm in the Ft Worth area. Also this place is one of very few that offers Sushi Happy Hour, and you can't turn down  the nice modern vibe of this hip restaurant."], ["Megan W.", "Had a fun time here. The sushi was good, as were the drinks and appetizers. We sat at the bar and had some nice bartenders that were pretty chatty throughout our visit - though when it was time to pay, it took a little while to get paid out."], ["Kirstin J.", "I eat there for lunch at lease once a week. They are really good! I usually get the sushi roll and the South Pacific roll. Today I was in a rush and the service was super fast! The miso soup came out instantly and my rolls came out about 5 minutes later. I will continue to visit every week!"], ["Ingrid A.", "Boyfriend and I decided to check out this place on a Sunday, where they have Happy Hour pretty much all day (noon to 10pm).We tried a lot of their $5 rolls, and they were all pretty decent but all pretty Americanized (expected, especially with the HUGE screen showcasing surfers behind the bar - pretty cool, though). Nothing really stands out in my memory or in my tastebuds.HOWEVER, one thing I remember was just how terrible the service was. The place is super hip and bumpin', so it was pretty crowded. Our waitress came to our table pretty much once to take our order (after a VERY long time, we thought she had forgotten about us) and once or twice when we had to CALL her over to order some more or get the check. She kept walking past the bar without saying anything or checking up, and she even disappeared for a very long time at one point, we couldn't find her anywhere lol.Anyway, pretty solid happy hour, but with the service and how meh the food was, probably not a go-to."], ["Aaron P.", "Great Sushi. Awesome ambiance. We think of ourselves as sushi snobs. We will not go to any other place for sushi in Fort Worth. Go. Try. You won't be disappointed!"], ["Hailey G.", "My boyfriend and I go to Blue a couple of times a month and it's always worth the 1 hour drive from Stephenville! We usually start with Blue Balls - one of their best appetizers IMO - and I normally get either the Hotel Cali or Tidal Wave roll. I've tried quite a few rolls from Blue but most just aren't my taste so I usually stick with what I know is good. The food is always fresh and great tasting, and we never have to wait too long for it to come out. Weekends can be super busy though, make reservations.I would recommend Blue to anyone! It's a tiny bit pricey compared to a normal dinner but it is sushi after all so I don't really consider it too expensive. We usually spend $60 or so for 2 people."], ["Marci W.", "This place is awesome!  The Bloody Mary Martini is the bomb!  The cherry bomb and itchy salmon are so good with the sweet chili sauce.  The best part is the video that shows marine life and 500 gallon fish aquarium!"], ["T T.", "YES PLEASE! This is the best sushi I've ever had. Pricey? A little, so then check out their happy hour. Bests: Shishito Peppers, Mango Crab Rangoons, Hawaiian Roll, Knuckle and Claw, Black Tuna, Squid Salad, Cherry Bombs, Crunchy Red & Crunchy Blue, Yellowtail Serrano,  Shojin, Eden Roll, Hot Popper, Tidal Wave, Negi Hama, Edamame Hummus, Pork Gyoza, and Chicken Satay. If you haven't tried Japanese Beer, you should... Sapporo. The house Hot Sake on the Happy Hour menu is pretty smooth. So good!!!"], ["Cleda W.", "This was my first time and I liked it more than I expected. I went with some friends late enough to get Happy Hour (starts at 10:30PM on Saturday). Lots of great deals during Happy Hour.We ordered a lot of different things:River Rock Beef Tenderloin -- the beef came out on hot rocks and was steaming. So tender and delicious.Calamari -- lots of calamari and vegetable tempura. This was an excellent started and of course great for $5.50 as a starter (happy hour price).South Pacific Roll -- this is a roll with eel tempura on top, cream cheese, pineapple, scallion, and eel sauce. Every bite was sweet and savory. 8 pieces of heaven. Bring a jacket/cardigan. It was freezing. Service was excellent and drinks were very strong. $6 classic martinis.Great place for friends and family. Not sure if great for kids."], ["Jennifer C.", "We had a party of 8 & the staff did a great job of getting our food & drinks & refills out to us as quickly as possible. And the sushi was great! A lot of different options & rolls. Prices were pretty good, too. The fish tank above the bar is really cool, as is the entire place. The bar has a lounge feel to it with low couch seating, which is a cool change from high top seating. I definitely recommend eating here. We will be back"], ["Jessica N.", "Love their lunch special options.  It's affordable and you get a lot of food plus have great options of different maki to choose from. I got the salad with ginger and carrot dressing - the leaves were not very fresh, unfortunately, but I loved the dressing.  I got the Hotel Cali and Super Asparagus maki and they filled me up and were very tasty.We had a little trouble with service the day I came and that's why I am giving them a lower rating than I usually do.  We had to switch tables to accommodate more friends arriving and they were great about helping us find a bigger table, but it took a very long time for my friends to be taken care of and resulted in one of them having to get her order to go because her food took over 45 minutes to be brought out.  It's great that they split checks now, though! Much less hassle in that regard.I definitely recommend the lunch special - $12.99 for a soup or salad and choice of 2 maki's, 1 maki and 1 sashimi, or 1 maki and 1 nigiri.  Just make sure you get there before the lunch rush because it does get crowded!"], ["Robyn G.", "I love sushi!! But being vegetarian I am usually limited to a selection of 3-4 simpleItems. Here they have the best and biggest vegetarian selection I have ever seen. I can finally have the yummy specialty rolls like everyone else!!"]], "Shinjuku Station": [], "Temaki Sushi": [["Farisa C.", "Excellent food! Enjoyed the unique items on the menu. The sea vegetable salad was delightful and different as well as the crisp sushi roll and the dessert as well. Lovely environment. Romantic music. Alex (one of the owners) is absolutely charming. Thanks."], ["Stephanie R.", "It was my first time here. Service was wonderful. The music is splendid. My husband and I ordered the Fish Tank, Crispy Melt and Sashimi Combo. The fish was fresh. The food was excellent. We also ordered tempura chocolate ice cream. It was the bomb! The price you pay for the quality of food is perfect in my eyes. I will definitely be coming back."], ["rachael f.", "love this place, the owners rock. and the food is excellent"], ["A B C.", "I wasn't blown away and there was no real Ramen Soup on the menu as Yelp implies. (My fault for not reading the menu in detail.) Overall the Food was good, service was good, and place is quaint with great music."], ["Mariel B.", "Hands down favorite sushi in Ft. Worth! The atmosphere is great and the owners are wonderful- they always remember customers. The sushi is really fresh and well done, no deep fried cream cheese slathered rolls. I love the rolls with forbidden (black) rice available on weekends. And for dessert they have house-made macarons that are the very best in town and rival the Parisian ones - seriously! Love this place!!"], ["Sam P.", "Being a sushi lover I have to give this place 3 stars.  The food was fresh, however it was not of the quality I expect.  The second star was lost on service.  If you don't know the people working there, you can forget about great service.  They will take your order, bring it to you, and bring you the check, nothing in between."], ["Miguel G.", "Atmosphere was great and I enjoyed the feel of finding a nice hole-in-the wall restaurant.  I only gave three stars because I thought the sushi was average, service was slow, and the sushi chef and staff was overwhelmed with a half full restaurant.  Sushi was definitely not 4.5 stars like yelp initially showed, but decent."], ["Kevin Q.", "This is one of our favorite sushi spots in Fort Worth. We consistently eat lunch here. The portions and prices are reasonable. The food is fresh and delicious. The service is always excellent. I suggest the spicy tuna, any of the nigiri, and a ramen dish."], ["Penny M.", "After visiting a relative in the hospital in Ft. Worth, I checked yelp to see what was close and not too expensive. I love the fact you can check yelp, while driving down the street, (I wasn't driving!) before you enter any place to view the menu and see the prices. We ended up at Temaki Sushi and I can't imagine we could have had a better experience in the other many restaurants in that neighborhood. There were about 4 tables with 4 or 5 people and one table of ten. The gentleman (later found out he was the owner, with his wife, who was also there) gestured to a table and we sat down. They were pretty busy with the big table, but brought us our menus after a couple of minutes and we ordered wine and a beer. He brought it to us and we ordered the rest of our meal. Along with some potstickers, sashimi and soup, my husband asked if ordering another roll with splitting an entree dish would be too much food. He suggested we not order it til we had the entree. I thought that was pretty good, not trying to over sell it to us. They brought us an extra beer and wine on the house, and apologized for the wait. We hadn't even thought it was too long at that point. After the soup and sashimi they also brought us some edamame on the house. The table of ten asked for ten separate checks and they didn't bat an eye - took care of them with a smile.Overall the food was very fresh, the yellow tail really flavorful and fresh. We did end up ordering the extra roll because I just had to have more sushi!  It's a small place, not a lot of space, less than two years old, but they know what they're doing. The prices were really reasonable. The menu looks very interesting, not a huge variety of rolls, but some different dishes on the menu, and next time we head to Ft. Worth, we'll definitely make a stop there.Almost forgot the mochi ice cream at the end!  Delicious!!"], ["Tae S.", "Can I say brown rice sushi!!!  Awesome and Affordable. The menu is pretty simple and you order out the counter and the lady brings the food out to you. They are really nice and explain a good amount. Especially since I ask a lot of questions.  I tried the inari appetizer and the hot summer roll. Both were really good. The hot summer roll had just the right amount of kick for sushi and the inari was a new thing for my taste buds. I gobbled that down as well.The place is clean and minimalist feel."], ["L. M.", "My go to sushi spot in FW. One of the only places in town that doesn't deep fry every roll or put cream cheese in it. Fresh sushi! The owners are great..always a warm experience eating here."], ["Andrew L.", "I'm sorry, but I just don't understand the crazy high ratings here. I guess it's the brown rice and relatively cheap menu? Either way, my gf and I didn't enjoy the food. The rice was dry and nigiri was extremely compressed. The cuts of fish were terrible and not fresh. The hand rolls were similarly bad as was the green tea (from cheap tea bags). The one thing we did like was the onigiri, which was a rice roll that had been cut, pan fried, then topped with mushrooms and other stuff. It was a nice twist on onigiri and sushi. The owners were very nice, but that didn't make the food taste better unfortunately."], ["Priscilla D.", "For me this is the best sushi in Fort Worth and they are so nice wish I was there now"], ["Jonathan N.", "Ordered to-go and wanted a sashimi plate. They said \"No, we do not do that.\" I am a little confused why a sushi restaurant cannot cut multiple pieces of fish, put it on a plate, and charge me for it. Walked in to pick up my order and the place had NOBODY in it at 7PM. Is this a sign?Owner seemed nice and was prompt to get my order.Salmon/Escolar/Yellowtail Sashimi - they were very thin (pre-cut might I add..) pieces. The escolar was a little chewy but the others were okay.Seaweed salad - just regular seaweed salad, I like regular seaweed salad.Prosciutto Roll - I told the owner to get me the most popular roll. He gave me this. It is salmon with eggplant tempura inside topped with prosciutto. I will not be getting this roll again.Although most of it was okay, it fell way below expectations for a sushi joint. Shinjuku station is just down the street.. I suggest you go there for dinner instead if you are craving sushi. You will be paying a little more, but it is better than this place. Sorry Temaki Sushi, you did not do much to impress."], ["Kevin L.", "I have lived in most of the southern United States including Las Vegas. This is the best sushi I have ever had."], ["Shannon S.", "Great sushi @ fair prices. Go on Thursday for black rice, clean, earthy and delicious. I've returned several times and been pleased every time. Consistency is paramount."], ["Neil And Manik A.", "No!!!!! I didn't think sushi could be so gross! Disgusting. For the first time in the history of Ken's existence, he didn't finish his sushi! Piranha KICKS Temaki's ASS and I didn't even like Piranha that much.I ordered miso soup, 1 salmon temaki, 1 spicy tuna roll, and 1 crunchy Tempura roll. The spicy tuna was DISGUSTING! GROSS! The salmon cuts were awful! If it weren't for the tempura on that roll, I probably couldn't have finished that one either! I paid $25 for all of that; a bad taste lingered in my mouth for an hour after lunch."], ["James L.", "LOVED THIS PLACE!!  This was a recommended place and I had a great dinner.  I can't quite remmeber the names of the rolls I got, but they were delicious!  The service was spot on, the food was fresh and flavorful and believe it or not...for a restaurant on Magnolia Avenue, it was very affordable!  Will definitely be back!"], ["Anye F.", "We went here for lunch today, intrigued by all the 4 and 5 star reviews.  What we found was a clean, attractive, low-key 'order at the counter' kind of sushi place that appears at first to be cheap by sushi standards (though not by lunch standards), and that has decent but not extraordinary food.We ordered potstickers, crunchy tempura roll, and three of the daily specials ( a 5 piece albacore sashimi w/ cucumbers, an albacore tuna roll, and a volcano roll (not like most places volcano roll, this is a vegetable roll that has imitation crab on top drizzled with sauce, served warm).  The presentation of each dish was quite attractive, definitely better than you'd expect for 'fast food' sushi.My favorite dish was the potstickers- you get 4 small ones for $3, followed by the crunchy tempura roll (a good deal at $5, shrimp tempura, extra crunchies on the outside, drizzled with eel sauce).  The albacore roll and the sashimi were tasty and fresh, but not much food - the sashimi was cut very thin so $8 for five small pieces of fish and some cucumbers seemed a bit steep, and the roll was not particularly large at $7).  I did like the lemony wasabi sauce on the sashimi.    I did not care for the volcano roll.  There was no need for it to be served warm given its ingredients and I think that detracted a bit.  We were both still quite hungry after four mains and an appetizer.  Usually we are full on 3-4 rolls (admittedly we tend to order 'fancy' rolls which are often a little bigger), but these rolls are quite small.  To be full we'd have needed two more rolls at least, possibly 3.  Which would have bumped the price up to a usual sushi dinner price of $20-25 per person.I suspect the bento boxes are a much better deal.  They are $9 and looked (from a distance) like they came with a big bowl of soup, I am not sure what else.One minor complaint I have is that there is no explanation of what any of their items are.  A person unfamiliar with sushi (or even just unfamiliar with their restaurant) will be lost trying to figure out what they want. If I worked close by this would be a decent lunchtime stop for days when I'm not super hungry.  However, I can't see it as a destination in and of itself because the food isn't out of the ordinary and once you order enough food to fill up, the prices aren't either.  Here I go, busting up nearly perfect reviews again. I really don't do it deliberately (in fact I agreed with the near-perfect reviews of another sushi place just a few days ago!)"], ["Drate B.", "Went here with my girlfriend and some friends by chance. We had originally planned on eating at the Bearded Lady, but they were packed so we decided on sushi. I've never been so happy that my dinner plans changed. We split an appetizer of pork pot stickers which were probably the best pot stickers we've had at any place. I ordered the spicy tuna roll and the salmon sashimi. The tuna roll was amazing and had just enough spice. The sashimi left a little to be desired. It wasn't bad, but it was lacking something against the sushi. My girlfriend, who had never had sushi before, ordered the vegetable roll which was fresh and crispy, just what a vegetable roll should be. Our friends ordered a caterpillar roll and another plate that I can't remember the name of. The caterpillar roll looked amazing with the fresh avocado and sauce. Whenever I go back, that's definitely on my list of things to try. An added plus was the beer/sake selection. While not huge, the prices were very inexpensive for the Japanese beers when compared to other restaurants in the area. If you're in the Magnolia area, this is definitely worth a visit."]], "Wasabi Sushi": [], "Mks Sushi": [["Chris E.", "My wife and I had our first date here and still continue to come back over the years.  Everything is always very good and service is great.  Try the Ahi tuna tower. It is delicious!"], ["Jason D.", "Called to do a small to go order, no one is there, told me it was going to take 30 mins!!!! WHAT???!!!! WHYDONEUpdate: called one across the street, it was done in 15mins"], ["Mark F.", "Amazingly fresh and reasonably priced. The chef, Charlie, is amazingly talented! The sashimi platter is a work or art! The muscles are to die for!There's food, there's art, then there's BOTH!"], ["Stephanie V.", "Well, 5 years later I'm still a fan! I like to take my coworkers here for special celebrations during lunch. We always get in and out within an hour and the service is friendly and prompt.The roll bento is still my favorite and the food quality is just as good. The bento includes a salad, edamame (if you dine in), soup, and 3 varieties of rolls. The price has stayed pretty consistent (maybe raised $1 in the past 5 years) and you get a good value for your food here."], ["Brandon K.", "Good quality sushi in North Fort Worth. Although it can take a while to get your food once you order depending on the crowd you will be very happy once it arrives. This place has a really great happy hour with lots of drink specials and sushi specials to save you some $$$."], ["Dianna N.", "I only go here for the ahi tower happy hour for $10. Maybe I like rolls better than sushi rolls, so I don't really taste anything exceptionally about this place. They have good sashimi and raw fish sushi. But signature rolls such as dragon roll, spider roll etc... Are bland. Even the representation of the dishes are poor for the price and setting this restaurant is trying to achieve. Over priced as well. The spider roll only came with 6 rolls, and tastes like crap."], ["Jenny M.", "They have a great selection of sushi and it is always freah. The restaurant is very clean"], ["Jillian G.", "I'm sorry but I have tried this place three times now and each time it gets progressively worse. We went yesterday and the server, Michelle, was awful. My friend ordered rice and kimchi and some sushi. She only brought out sushi... And then eventually the bill. So he asked where his rice and kimchi were and she took off after it. Then she comes back with only rice - no kimchi - and no apology - and no mention of kimchi. Then she adjusts the bill and returns it. Again, no mention of kimchi. My roll was falling apart - on the platter- before I picked them up.. and this is the second time I've experienced that here. We asked for salt and they don't even have salt shakers - they brought it in a bowl and we had to use our fingers. Some people like to add a little salt to raw fish.. So why not have shakers? Finally, the prices are too high. This place is nothing special and it's highly overrated. I'm never going back here again. I usually go to Wild Sushi just a little farther up the road on Western Center and have never had a bad experience there. So done with MKs."], ["TRYNH M.", "Great place to go for happy hour! I get drunk Every time. Their happy hour menu is great and cheap. I love their martinis and beef tatakis yummmmm"], ["Charles V.", "Showed up today to try out MK.  I arrive at 11 when the opened.  First thing i noticed was an overwhelming smell of cleaning products.The hostess was very friendly and sat me at the sushi bar.  I like to ask the wait staff for their recommendations for a first timer.  She'd asked if I preferred cooked or raw Sushi, then recommended the Caribbean roll.  The first thing I noticed is that it was the most expensive roll in that section of the menu.  I ordered it along a the Spicy Roll Bento box.  The bento box was average at best compared to other locations nearby.  The sushi pieces were small and the rice was not well packed on them.  The Caribbean roll was drowning in a sauce the prepared it with that was overpowering to the rest of the flavors that you would expect in a signature roll.   The best part of the meal was the ginger lemon herbal tea.  So lunch for one with a cucumber salad, bento box, Caribbean roll, and hot tea came to $37.77 before tip.   Comparing to other locations I've been throughout the area, this was not worthily of the price.Cowtown Sushi in Southlake is around this price point, but the presentation, and quality over there matches the price point.I'll try Wild Sushi next for a nearby comparison."], ["Ginger B.", "Ordered a fried roll bento for lunch. The quality and execution of preparing the food at this location has been on a steady decline for a while. This was a last ditch effort on my part to give them a chance to wow me. The BEDFORD location is hands down the best. I don't know the reason for this location not having decent food.The soup...couldn't even eat it. It was cold, tasteless, looked disgusting.Salad...dressing mostly waterFried rolls..brown avocado, tasted stale $20 for my lunch"], ["Kim S.", "Went on a date night with my fiancé. Always great service and we sat at the bar and watched the rolls being made. The ahi tower is amazing and they have a reward points so I can get free sushi!!! Will come back for sure!!!"], ["Susan P.", "Overrated!! Seating: Yes, I got seated right away, but in the corner where I 1. couldn't see what the sushi chefs were doing (which is the WHOLE point!) and 2. kept getting hit by the servers as they were REACHING OVER ME to get plates and 3. there was ABSOLUTELY no interaction between sushi chef and patron AT ALL. He didn't even give me the SUSHI!! HEEEELLLLOOOO, if I wanted to be COMPLETELY ignored then I would have sat at a table.Service: The service was absolutely so slow that my husband got his meal (chicken teriyaki) so ahead of my sushi that he was almost DONE by the time I even got mine. She kept telling me it was coming, but after twenty minutes of waiting AFTER my husband got his food, (This isn't including the time BEFORE he got his food.) it was still coming...I was feeling a little impatient. She wasn't nice nor was she mean but she wasn't that \"on it\" either. THEN another server was literally fighting with the sushi chefs about how something didn't come out yet and seriously the whole thing was a debacle. I was thisclose to just canceling my sushi and leaving, but I thought I'd give it a try anyway. (BIG MISTAKE!)Food: It was AIIIIIIIGHT, and I say that sort of begrudgingly because there were definitely some hit or miss items. On the tab:1. Chicken Teriyaki - Good, but kind of cold. (A LOT of chicken)2. White Rice - Had to get two because the portion was SOOOOOOOO small.3. Miso Soup - Watery...AWFUL! It was water flavored with a tiny bit of miso and some VERY VERY VERY small garnishes in it.4. Salmon Nigiri - Great...the star of the show.5. White Tuna Nigiri - Fishy and REALLY tough like what?!6. Unagi - A LITTTLE too greasy for my taste, but acceptable.7. Tuna Nigiri - Fishy8. Yummi Yummi Roll - More like yucky yucky roll. FISHY and almost gag worthy.9. Spicy Tuna Roll - Okay. Standard.10. Almost forgot the little egg rolls. They were okay. Price: I spent almost $75 on food that was mostly sub-par so I would say this wasn't a bargain. Not worth it. I've spent $100s of dollars on sushi and felt like I was getting a bargain but this was not worth it. There was NOTHING spectacular about this place. In fact, I'm REALLY surprised that it is as highly rated as it is. Sorry but you have to know there is better sushi joints out there. This wasn't even an awful experience really, but it was just all sub-par."], ["Bill A.", "Best Sushi in N Fort Worth. Great bar offerings,especially during happy hour. Rest of the menu is rather hit and miss and they get busy quick. Getting a seat at the bar can be very difficult after 4 or so. Check the special board!  They have offered several species rarely seen in this area and really do them justice!"], ["Sandra M.", "Too expensive for what they're offering.  Not very inviting staff.   Pop down the rode to Wild Sushi or up to BTH on Beach and Basswood.  MKs is definitely $$$."], ["Alysha C.", "The MKtini & Texas Ranger Roll are both a definite must every time I go here. Add the spicy red pepper flakes on the roll & it's over the top delicious! Great service every time. The sushi menu has so many choices, we always have to try something new! You won't be disappointed!"], ["Bonnie M.", "I love and miss this place (I moved). I'd say MK's is the best sushi restaurant in DFW area, price-wise and quality-wise. Service is always great. For appetizer, I love their garlic black mussels. Simple yet very tasty. My other fave appetizers are spicy garlic edamame and beef tataki. For sushi or sashimi, I love love love and seriously recommend everybody to try their hawaiian walu. Very similar with super white tuna but it has more buttery texture. I also love their freshness of all of their selection. I love their octopus, squid and conch. Very clean taste of freshness. To keep their freshness they don't always serve sea urchin but when they do, again, very fresh. From specialty rolls, I love fire cracker roll, walu-walu roll, sun rise roll and of course AHI TOWER. As far as alcoholic beverages, not many I can recommend since I am not a drinker. I know their peachy lychee and spicy pear martini are great!! They also have full bar with a lot of sake selection as well as liquor. Totally recommended this place!"], ["Scott R.", "They have happy hour that offers quite a bit of the menu items at a substantial discount.  I've been there several times and today just popped in to grab some rolls to go.  The host was very polite and quickly took my order.  Five minutes later I was back on the road heading home with tasty rolls riding shotgun."], ["S P.", "There aren't many sushi restaurants in this area, but we were craving sushi so we decided to try this place out. The interior seemed nice with dim lighting and a modern decor. For an appetizer, we ordered the Tokyo nachos, which were tortilla chips topped with mozzarella cheese, spicy crab, guacamole, salmon, and roe served with salsa. Sounds interesting, right? Well, it was gross! It was piled high with imitation crab, and it ended up being a really bad combination. It wasn't worth the $14 price. I could only manage to eat one.We also ordered the spicy yellowtail roll, the 911 roll (spicy crab with spicy tuna, jalapeno, and hot mustard), and the tuna lover roll (tuna, avocado, and cucumber topped with different types of tuna). The rolls tasted better, but the spicy yellowtail and 911 rolls seemed to have too much sauce on them. It was overwhelming, especially on the 911 roll. The tuna lover roll was the best one we tried. Service was exceptional. Our waitress was very nice and was awesome about refilling my water, which she did very frequently! We were never rushed either. I usually take my time eating, and they were very patient and didn't constantly bother us. The only problem- they brought out the rolls before the appetizer. After the rolls came out, I asked about our appetizer, and she said they made the rolls first. So, we had to wait another 5 or 10 minutes for the appetizer, which was unusual.We weren't too thrilled with the food. Even though we don't frequent this area often, we probably wouldn't come back."], ["Kristin M.", "So, we've been here many times over the last couple years and while it remains my favorite place for sushi (the food is just phenomenal!) the service has gone down hill. What's going on?!?  Such a shame."]], "Thai & Fusion Ave": [], "Edohana Hibachi & Sushi": [], "Piranha Killer Sushi": [], "Ume Sushi & Korean BBQ": [["Phu Phu G.", "Goodness gracious, this place is so lovely.  The ambiance is on point - decor is clean and cozy, music is the most happy/romantic selection I've ever experienced at a restaurant.  The wait staff is incredibly kind, respectful, and thoughtful.  All the the sushi is SUPER! Bulgogi spring roll was uniquely awesome :)"], ["Jessica B.", "The restaurant is really nice ! The  sushi was really good and is reasonably priced. Can't wait to go back soon to try more items from the menu. They have a huge selection."], ["Tara S.", "Again, Yelp doesn't disappoint! I was planning a birthday party with a party of 16 people to head over to Main Event for bowling afterwords. I googled the best places and this popped up with high scores from Yelp. Making reservations for that large of a group without having been there is a little scary, BUT I was very pleasantly surprised that this small place was so beautifully decorated. For a Party:They set up one long table in an alcove, so we had our own party space, and the service was perfect. Plenty of parking. Can make reservations online. Super easy; and they confirmed that morning. And were flexible when I added 2 people to the reservation at the last minute. They didn't complain at all when we asked to split the check per couple; she had already set it up that way and knew how to split it w/o us asking. Impressive!Food:Delicious! Everyone enjoyed their food! They surprised us with a few complimentary appetizers (crab stuffed jalapenos, eggplant pastry, etc). And a complimentary dessert for the birthday girl after dinner. (Fried green tea ice cream with cheesecake-like squares - very good). Everyone's sushi rolls were delicious (along w/ 1 chicken teriyaki bowl, kimchi and bibimbap. They also had a sangria special (very yummy) and a special on white wines ($3 a glass). Many enjoyed that special.I 100% recommend this restaurant. They were so happy to have us there, and, this may sound bad... ;) BUT when most customers are Korean or Asian, you know it's gotta be good! Right? :)"], ["Panalee C.", "Love this restaurant!!!!!Suitable price and qualityCome back here 3 times already!!!!!Here is the best japanese restaurant in Fort worth.!!!"], ["K B.", "Excellent service, friendly, and a terrific watermelon/radish appetizer (though it had been made way ahead). Disappointed in the Ramen. The broth was just OK, with egg (overcooked), green onions, corn, and nori. We asked about the pork listed on the ramen menu, and the waiter said, \"It was in there. Didn't you see the little meats?\" Well, we hadn't noticed them. Probably won't try here again."], ["Buck S.", "Excellent food and service with great pricing, my new favorite!  Had the spider crab and California roll, both very good.  Includes complimentary salad bar and mitso soup.  Very delicious!  Yum."], ["Maggie M.", "I truly enjoy this place . They have an extensive menu and their daily specials are always pretty inventive. Never over crowded and the staff is always great."], ["Alexis C.", "I ordered the bulgogi and it was okay. The menu selection didn't impress me all too much and I was actually disappointed in the lack of variety of dishes."], ["David T.", "Service and food were both fantastic. Spicy edamame was a bit too salty, but the unpronounceable main dish was out of site. I'll come again, when in the area (you should stop in too)."], ["Mindy C.", "The service you receive there is exceptional. They also give you a little appetizer when you order. The appetizer is something unique the chief prepares and I've found it changes probably every two weeks. The bibimbap I'm sure is the most popular on the menu and the most frequent thing I order there. This is the only Korean restuarant I'm aware of in Fort Worth so it is conveniently located on Bryant Irvin. They do have ramen, which has been good the two times I've had it, but they aren't too consistent with their recipe. I would recommend trying this place at least once to see if it's to your palate's liking."], ["Jessica A.", "Service: Greeted by a nice young man, asked if we needed any recommendations, overall great service. Food: Very nice presentation of food, big rolls made with lots of filling (and not a lot of rice which is what I notice a lot of places doing). We were also given a free appetizer of watermelon infused with wine or something it was different and delicious. We had the Golden Roll, Volcano Dynamite (definitely named volcano something maybe not dynamite), spicy tuna, spicy California, shrimp tempura and spider roll. Prices: decent prices about the same as other sushi restaurants. Ambiance: very quiet, there were about 5 other people besides myself and my boyfriend. Overall good food, good service and decently priced."], ["Rachel B.", "Amazzzzzing sushi :)!! I highly recommend the spicy California roll. Ordered the chicken teriyaki too- not sure why it comes with potatoes but it doesn't matter because it was all delicious. Be aware that if you order take out only chopsticks are given, wasn't a problem for me but might be for some. Restaurant was beautifully decorated when I went to pick up my order, kind of made me wish I had chosen to dine in."], ["Ngoc Anh N.", "I absolutely love this place. Friendly service, great food (short ribs, sushi Dragon roll, and mochi ice-cream (my partner insanely loves the mochi) and quite reasonable price. I wish it was cheaper though. To give you a picture: I ordered 2 dishes+ 1 disert = $37"], ["Mint Chocolate H.", "The servers are friendly, and the hot stone bibimbop is excellent. It is authentic with cooked veggies, meat, and egg - unlike some other Korean places I've been to, where they just serve raw lettuce instead of the proper boiled and seasoned veggies. My friend had kimchi stew, and although it didn't taste like an authentic Korean kimchi stew, it was still good in its own way. When she told the waiter she wanted more rice, they gave her another bowl for gratis. The side bulgogi was also good."], ["Harol R.", "At lunch they offer several choices under $10 that are of high quality and large enough that I usually get a carry out container. I often have bulgogi or Korean BBQ, comes ith soup, salad, rice, two dumplings, tempura, and a California roll, what a deal fro $9."], ["Mariz F.", "Really nice place and their sushi are big. Unlike the other sushi restaurants that serve little rolls of sushi. And this one, they put big amounts of crab meat. They are not stingy on it. The server was very humble that made me give him more than enough tip"], ["Eissa J.", "Unexpectedly good! Have eaten there twice now and both time the food was excellent! The sushi is well prices and in my opinion pretty darn good, granted i have only tried a few rolls. The ramen is good, not the best, but definitely better then most. The Bulgogi is very good and flavorful, and the Bibimbap is great as well. A little pricey for the quantity of Bulgogi and Bibimbap , but it's too good to complain."], ["Jeffrey D.", "Wonderfully pleasant staff!!! They are always smiling and easy to speak to. It was a great surprise to have complimentary amuse of wine infused watermelon cube over balsamic reduction, a great way to begin a meal. We then ordered the ramen. Great spice and very tasty pork. Noodles were perfectly cooked. The two rolls we had were caterpillar roll and volcano dynamite roll. The volcano dynamite is my favorite crawfish roll ever! The food was excellent and staff even better. These are some of the best restaurant staff I've seen in a long time. It was our first time here, not to be our last."], ["Kassie H.", "My go to sushi place! They offer complimentary salad and miso soup. It's the best and they have reasonable prices too!"], ["Justine C.", "My husband and I went here on a whim on a Tuesday night and we were delighted by the friendly staff, great food, and tasteful décor. The waiter recommended a few sushi rolls and we went with the Golden Roll which was DELICIOUS and FILLING! I ordered the Bibimbap in the hot stone bowl and my husband got the spicy beef Bulgogi. I would definitely recommend either one of these dishes to anyone who loves Korean food."], ["Jamie H.", "The sushi was good as was the bugogi. The ume chicken was gross & so was my beef in the stone. They had no Korean beef @ the Korean beef restaurant! Weird. Service was overly conscience as I am uncomfortable when I feel stared @. They were nice but the food was expensive for what you get. I don't think we'll return."], ["Heather W.", "Yes yes yes! So glad we stumbled on the place. Had the wow roll sushi and a yummy bowl that I can't remember the name of. I am looking forward to returning"], ["Matthew M.", "Very impressive sushi selections here. The raw rolls had such great flavor and quantity. It's what you come to expect from a real sushi joint. If you want a real good sushi experience by all means head to Ume. Now if you rather spend double and have sushi that's not desirable, then head to Little Lilly Sushi."], ["Alyssa K.", "Really great take on Korean food! Having come back from SK two months ago was pleasantly surprised by the kimchi, makgeolli and meats. Everything we had was yummy!!!"], ["Adiah O.", "They are new so they are still getting in the swing of things. The food is good. The service is great! The price is the same as other sushi bars. It's a great lunch time sushi menu. Ill be back and would bring colleagues.Tip for Owner: If your going to greet customers, try to great everyone"], ["JG S.", "We are here constantly...staff is amazing, food is superb.   Go go go...      Ramen...fried brussel sprouts...sushi...it's all amazing."], ["Loi T.", "It's true there's probably more Sushi than Korean bbq on the menu, but I'll tell you why this is a good thing. The restaurant's location has hosted probably 3 previous Korean restaurants or maybe owners. For the most part they were all authentic and they all tanked I believe due to over-authenticity. Many people here aren't adventuresome enough to try the really authentic stuff. So, I'm glad they added sushi as a enticement to come in. Baby steps as they say.Overall, my wife and I really enjoyed the food. I had the unagi (eel) bowl. My wife had the kim chi stew. Very good all around."], ["Keith N.", "I came here wanting korean food but couldn't help that the rolls looked so great. So I ordered few rolls and was I glad I did! Everything was very fresh and delicious!  I am definitely coming back here."], ["Blayne K.", "spicy beef bulgogi lunch/bento box!! YUM!"], ["Cathy H.", "Love this place!! The lunch specials are such an awesome deal, although they are slightly different than what the menu says and that's frustrating. Over all, really good deal and the food quality is great. The noodles, that can come with the lunch bento  and sound boring, are surprisingly good and the kimchi is fab!"], ["David B.", "Can't believe we've never here before... we will definitely be going back! Awesome place!"], ["Joshua C.", "Nice atmosphere, attentive wait staff. Excellent specialty roll selection. Try the Sunny Roll and the Chicken Crab Meat Roll. Extremely courteous staff."], ["Cory B.", "This place has really good food.  The sushi rolls were really good and fresh and the Korean bibimbap was really good.Price was reasonable, very good service, and the overall dining experience was great.  We will definitely be back!"], ["Jonathan B.", "Went here with my girlfriend last night. Went in and sat down and right away they had the wine infused watermelon. I was already own over. I'm a huge fan of sushi and we ordered a spicy dragon roll for her and I ordered bibimbap! My first time having it and it was awesome!!!! Definitely coming back to try various items like bugolgi and ramen! Haven't had good ramen in a bit so I'm really looking forward to that! Didn't get to try any sake either, but will next time!"], ["Joon P.", "Did you know the owner trained at a Michellin star restaurant and the head sushi chef was head chef at numerous prominent restaurants in Dallas?  These are facts that are not flashed around as the group prefers to let their food speak for themselves.  And boy does it speak volumes.  The attention to detail even to the simplest dish is borderline OCD.  The art Chef Koh paints on the dishes are absolutely mesmerizing.  I sometimes think he is the Bob Ross of painting with food and hesitate to eat and would rather frame the dish. Sushi is obviously spectacular but my true favorites are the ramen and kimchi jjigae.  I swear this has to be one of the best ramens in all of DFW.  The miso pork broth really is indescribable.  I could try to explain it but this is something one must experience on their own.  It's that personal!  And the kimchi jjigae... I'm not saying it's better than my mom's but it makes me think of her cooking.  Yes, it's that good. Ume is truly a hidden gem of Ft. Worth and the city is lucky to have them."], ["Perry L.", "It's not just okay!!It's wonderful. I just met the owners as they came to my table and introduced themselves. They recommended which rolls to eat and what to drink with it. The food was breathtaking. The staff was courteous and non intrusive. A huge step up from the Korean place that was here before!I'll be back very soon. Perry Lunsford"], ["Andie M.", "The place has a very relaxing atmosphere. As you enter you are greeted with a truly welcoming smile. We go for the sushi. Since coming to Texas 4 years ago we have only eaten at one sushi restaraunt and lets just say the bad experience lasted well into the next day. Ive managed to go this long only because i frequently go to san diego which have many excellent sushi restaraunt. We took a chance ( can't go without sushi for too long ) with Ume . Glad we did. Here's my experience everytime with slight variation ( items ordered).You can tell that the place has a chef hidden behind the curtain ( inaddition to the chefs typical of a sushi restaraunts). No longer than we sat down we were served a pumpkin soup with a soy sauce drizzle ( totally not what I would expect ) served with a kind of fried chip ... surprisingly pleased with how delish it was . Good start! I have never been to a  restaraunt that showed a true appreciation for my business and I haven't even ordered. LolNext the crunch roll and louisiana roll came out and delish! The crunch roll was exactly that. It was warm and creamy yet still had that delicate crunch. The louisina roll was warm and served with a kind of savory southern sauce drizzled on top.The seaweed and squid salad was the perfect side refreshing, crisp and cool. Topped with squid and a sesame kind of vinegrette it was a perfect compliment to the sushi.What got me was the Special Dragon Roll ... truly it was a special roll. It came out looking exactly like the picture ( a painting of dragon using differnt kinds of sauce) ....lol I thought that was just for the picture in the menu I didn't expected it to be on the plate.You can tell the sushi is made very well and presentation ( special dragon roll ) is a small thing with a huge impact. I must have screamed or something at the sight of the dish cause it caught the sushi chefs attention. You can tell he prides himself in what he does and enjoys seeing those enjoy the food.Customer service is the best I've had since coming here to Texas . My drink was always full , friendly staff, knowledgable of the items on the menu ( that says something really good about a place), timely service, clean and I'm  very impressed. This place really make you feel special. Stand out place!"], ["Bumble B.", "The menu has both Korean and Japanese items on it, but I went there for the Korean fare, and was not disappointed.  We tried the pajeon (seafood pancake), the bibimbap, and the short rib bbq platter.  Oh, and the makkoli!  The pajeon was perfectly cooked, well seasoned, tender in the center and slightly crisp on the outside, with a good amount of crab and shrimp meat.  The bibimbap was served in a stone bowl, with a nice combination of ingredients, and a delicious gochujang sauce...not to mention, a delicious array of banchan!  The marinade for the galbi was expertly done, and the meat was perfectly cooked.  I could have ordered a second platter of the short ribs and polished them off, easily!  I want to go back and try their kimchi jjigae--I have faith it is good and authentic!  The service was friendly and efficient, and the ambience is very tidy and stylish.  Will definitely return!"], ["Lanny B.", "Authentic and delicious Bibimbop, and we went ahead and tried the Louisiana Roll, which I was skeptical of, but they did very well with the crawfish in it. The restaurant was nice and clean and the staff was super attentive. I'm going back when I get a chance."], ["Helen H.", "What a pleasant surprise! I ordered the Agadashi tofu and a beef Korean bowl. Wow. I am very picky in the Agadashi tofu and it was the best I ever had. Lightly fried on the outside with a delicious sauce on the bottom. The Korean bowl was surprisingly delicious, a savory dish with slightly sweet touch. They had 3.50 glass of wine on a Wednesday  night. The service was superb and everything was reasonably priced. Highly recommend this place."]], "Ninja Sushi Grill": [], "Sushi Axiom": [], "Little Lilly Sushi": [["Jim J.", "Simply put, Little Lilly is one of the best sushi bars we have found in the state of Texas! The fish is fresh, the staff is friendly, and the place is five minutes from our house. It is small and cozy and the owner is always happy to answer your questions or guide you on his newest specials in house. Be sure to try the Masunosuke (New Zealand King Salmon), it is truly remarkable.This place isn't cheap, but you are paying for high quality fish that is super fresh. I highly recommend Little Lilly!"], ["Katie W.", "This place was delicious! My friend and I came in on a Friday night at 8:30ish. The prices were very reasonable. We split 4 rolls of sushi and it was a perfect amount. The service and the whole experience is very much at your own leisure. Most tables were people sitting and talking while slowly eating. It was a perfect little place. I definitely recommend it (if you're not in a hurry)!"], ["Erica A.", "THEY HAVE RAMEN HERE!!! And very delicious ramen at that. It was very authentic, from the broth down to the egg, which was PERFECTLY cooked.  Their broth simmers for 48 hours to tasty delicious perfection.We came here on a Sunday with no reservation. They had two tables in the back by the kitchen and the bathroom, not ideal, so we sat at the sushi bar. The sushi chef was very helpful when we wanted to try something different. TIP from the sushi chef himself: go on a Thursday because they receive their food shipments on Monday or Tuesday or Wednesday, so they will be fully stocked by Thursday. Some of the stuff we wanted to try was sold out, like the sea urchin and the mochi ice cream-bummer!We also tried the Anikmo-Monkfish Liver Plate, for an appetizer, which they dubbed \"Foi Gras of the Sea\". I've never had liver before, so I really have nothing to compare it to, but I really liked it. We also got a bottle of the Nigori sake-yum! Which came in its own ice box with chilled shot glasses.  It was worth the drive from Arlington."], ["Nicole L.", "This place is AWESOME! The sushi is very fresh and delicious. The customer service is so refreshing and hospitable. When it's a nice night enjoy their patio."], ["Tiffany K.", "It was my friend, our 2 babies and myself who visited the restaurant. As soon as we were walking up to the door to enter, someone from the waitstaff was already getting a table ready with high chairs, that was a great first impression. Immediately upon being seated we received our waters and got our menus. A few minutes later, basically the perfect time to look over the menu, our server was back to get our order. And then our appetizer came a few moments later and our sushi rolls came out like 10 min or so afterwards. The food was fantastic! Everything was just perfect.  The waitstaff was also great with our kiddos. I was very impressed all around and will most definitely be back."], ["Andrea S.", "My mom and I was in town for the weekend, and we craved for sashimi. As per yelpers recommendation, we tried this place out! The place is small, but I've observed that they have an upper room to hold bigger groups. Servers were polite, albeit they do not speak English clearly. We ordered tempura udon, hamachi zest roll, wild salmon sashimi and tuna belly sashimi. I love this place! Probably one of the best I've had in my life. The servings were small, but they are well-crafted. The tempura was served aside, breading was thin and light. Noodles were al dente, and the broth was savory. The hamachi zest roll was flavorful, yet light. Rice was cooked perfectly and not too thick, allowing your palate to savor every protein in the roll, then you get the hint of ponzu that accents it. Finally, the sashimi! Everything was fresh. My personal favorite was the tuna belly, which I think is a MUST TRY for sashimi lovers. It was melt in your mouth goodness! The wasabi was also real wasabi, not the paste that you get with most restaurants. They also make their own ginger, again we loved it.Our bill was $85ish without the tip.Highly recommend trying out Little Lilly's!!"], ["Christopher B.", "Have been to this place several times before and it never disappoints.    Tonight we took some of our friends here for the first time and they said it was the best sushi they have had in fort worth.   They had uni delivered the day before and the pork belly is always amazing.   If you eat at one sushi place before you die this should be it.   They do not do the boats of sushi like most places.   Its might costs a little more but you are paying for the quality of the fish.  Also the owner is amazing.   Had my pic taken by him because he made me a super extreme dragons breath roll and i ate it with no problem."], ["Phil K.", "Absolutely one of the best sushi venues in the state of Texas.  So we came to Lilly on the recommendation of a good friend, and it was awesome.  We received a warm greeting from attentive staff as we arrived, and seated quickly in a nice quiet corner.  Immediately we noted the welcoming atmosphere, and quaint Japanese decor.  Additionally, there is ample parking, and the restaurant is in a safe, nice part of town.We were in a party of 4, and did what folks call \"family style\" dining, which is the typical way many of us asian folks eat anyway.  Here is my breakdown of the food:Tonkatsu Ramen: Very lighthearted, without any overbearing flavors.  I prefer a more buttery creamy texture and flavor with more character, but this ramen had its own points.  The chashu had good flavor, and was tender with decent fat.  The ajitama was cooked to a tasty soft boil, and had a light saltiness. The noodle was a thin style, and had an excellent texture and taste.  The broth is simmered over 48 hours, and has a light flavor/texture. Seaweed Salad: very light flavor, and prepared well.  Very small portion.Uni Nigiri: The sea urchin was a little slimy, and had mild notes of the ocean, much better than other uni i've had in america.Devil's Breath: Awesome roll!  This roll was a ghost pepper tuna, with habenero masago, not some shitty \"spicy roll\" that just had some sriracha doused on it. As a lover of all things spicy, I was pleasantly surprised to see the ghost pepper implementation.  Although the presentation was nice, and the flavor was excellent, i was let-down by the spiciness.  I will say that for the average guest (white folks) this dish is likely very very hot, so please take my opinion there with a grain of salt.  Overall still an excellent roll.Spider roll: a soft-shell crab based roll, it had excellent full flavor, without any \"fishy\" overtones.\"Chef's Specials\": Nigiri Sampler, sashimi sampler & Tuna Tataki: This is what made Lilly the best sushi restaurant in DFW.  The sushi was delightfully fresh, and had no nasty film. For the nigiri, the rice had a floral plum note, wasn't overbearing in taste/abundance, and was simply amazing.  We also washed it all down with Hitachino Nest White Ale, and it was delicious, in fact I loved it so much I'm going to order some online.We'd actually rate Lilly a 4.5, but unfortunately yelp doesn't offer that option.  I can't give it a 5 because I wasn't fully impressed with the ramen, and I am a ramen guy.  Overall, we certainly recommend this place though, as it is top notch, and the sushi is amazing!"], ["Thy T.", "Located in a shopping strip, this place was actually hard to find at night for someone who is somewhat familiar with the area. I saw the word sushi on the shopping area sign so I knew it had to be in the area. When I walked in, I noticed how tiny the restaurant is. Thank goodness I came on a weekday because I could easily see this place being packed. I met up with a group of friends (total 5 people) and somehow we got seated at the special room. We had to take off our shoes and the atmosphere of the room made us feel special. The 5 of us only took half of the table though...but it was a nice experience.We didn't order anything unusual (e.g. sea urchin) from the menu and actually went with the more normal items. Since we had their more normal rolls (e.g. spicy tuna), they didn't stand out too much to me. However, I could tell the fish tasted pretty fresh! The cost of the rolls was the average price so wasn't too surprised it. Overall, nice staff and great atmosphere to enjoy some sushi. I have to come back and try their other foods."], ["Lisa L.", "Our new favorite sushi place.  Every time we have been its very fresh. Service was great and we loved the patio"], ["Christy E.", "By far best sushi ever! Small joint that fills up fast and they close early but still amazing! Every bite you can taste how fresh everything is. It's subtle ingredients that all compliment each other andAllow you to taste each one! Awesome establishment!"], ["Hugh H.", "Last year on the way back from summer camp, we wanted to try a new restaurant.  We found his one and now it's our favorite sushi place.  We would go more often but it's too far away.    This visit we both had the 48 Hour Tonkotsu Ramen and the Lilly roll  The ramen had a nice favor and we were both pleased.  The roll was very light and had a nice taste.We had the Catalonian Pork Belly and the Tempura Okra on a prior visit - it was also very good."], ["Lyndsey F.", "I sort of don't want to share this place with you out of selfishness. We have been dining here for a few years, and the food and service is always wonderful. It's my go to place for sushi and a delicious bowl of ramen. Haven't been disappointed once!"], ["Lan T.", "Very good sushi! I have nothing bad to say! Great service also! The waitstaff was attentive but not overbearing. The place is pretty quiet also."], ["Mecha F.", "I eat sushi once a week so I'm constantly finding new places!! Super gourmet sushi. Chefs are super quick with orders. We kept ordering they were so good. We did happen to come on a Tuesday so we were seated quickly. The water that is served taste refreshing."], ["Sarah S.", "Came in on a rainy Sunday to celebrate my boyfriends birthday! This place is a mile from my bfs apt, and we have pass it a million times but never noticed it. Definitely a hidden gem! The restaurant itself is tiny. We ordered a smorgasbord... Everything was exceptional! The Pace of service was amazing! Our waitress never rushed us. We started with a bottle of sayuri \"little lilly\" sakè... It was served cold. Perfectly balanced of sweet unfiltered goodness!We also had a few bottles of Kirin... I thought the beer was very expensive. But hey we were celebrating!!  Our first round of food was the Panko Hiroshima oysters! Perfect little bites with this sticky sauce, we for sure order them again! Then we had the the ama ebi, SHRIMP HEADS!! Again they had their own special sauce! Incredible!!! Next up was the hotategai surf clams!! They were a bit chewy. Ha! Then came the Cali 69... I normally don't like Cali rolls, but these were sooo fresh made with realy lump crab!Our next in our overindulgence was the on the border roll! That was my favorite! Perfectly spicy! Our last roll was the spider roll! It was amazingly crispy!! Over all it was a phenomenal experience!  All of that our bill was $105... I think it was very reasonable and the freshest sushi I have had in DFW!"], ["Teresa D.", "FINALLY FOUND A PLACE I REALLY LIKE! I am so obsessed now and will definitely be coming back when I crave sushi again. Such a great environment and the service was on point. First time here and I really enjoyed my experience so if you are craving sushi then I highly suggest you to come here! Give this place a try cause you will not regret it! That's a promise."], ["Erica M.", "This little gem on campbowie is really delicious.  It is a little pricey so you probably end up spending at least $50 a person to eat and feel full.  That being said, the fish is always incredibly fresh and really tasty.  They have a small portion of their menu that is rotating specials.  They always have something different and new to try for the adventurous sushi eaters.  I would say that this place is definitely one of the better sushi places in fort worth. Thumbs up!"], ["Jim R.", "The sushi was unbelievable. Fast service and nice waiters. Very clean and wonderful ambience. Prices are standard to other sushi restaurants."], ["Gina C.", "This was our first visit to Little Lilly. We were seated very quickly. Our server brought us warm towels after we sat down which was a nice touch. We ordered the shishito lime with pecans. It was delicious!  Our favorites were the \"south of the border\" roll and the \"Cali-69\".  Our son ordered the tempura udon and he ate almost every bite! The service was good and we didn't have to wait long for our orders. The restaurant is small but had a nice atmosphere. The kitchen is open so you can see what is going on. We were very pleased and will definitely return."]], "Edohana Sushi": [], "Sushi Tao Japanese Restaurant": [["Jessica B.", "We have been patrons of Sushi Tao since college, which was, ahem, several years ago. No matter where we live in the metroplex, we are very willing to make special trip to eat Sushi Tao. Now for the specifics: the super dragon roll is, hands down, our favorite followed closely by the TCU roll. They also have fantastic dessert...try the ice cream (any flavor)...you won't regret it (unless you're lactose intolerant). They have a wide variety of beer, wine, and of course, sake. Their prices are pretty comparable to other sushi joints in the metroplex.The service has always been spectacular. Most of the wait staff know us by our order (super dragon and TCU roll)...not sure if that's something to be proud of but it definitely speaks to the quality of service."], ["Krista R.", "Sushi Tao is a restaurant tucked away in a strip center off of Overton Ridge. It never is busy so expect to have the restaurant to yourself. They have a big sushi menu with some entrees like teriyaki. I wasn't really hungry when my husband got off work and wanted to go out to eat so I got miso soup and a salad. It was okay. He got a soup.. Udon noodle soup with shrimp. I didn't care for it, but he enjoyed it. The sushi was decent. We got the super dragon roll. It wasn't bad and presentation was pretty."], ["Judy S.", "I keep trying this place to see if a different meme item will meet the rave reviews. Answer --not!Over priced .. Over rated ... Over it. Cruise to Ume up the street for heaven sake !P.s and why are the tables always so sticky even after they wipe them down????"], ["Brian S.", "Great Sushi. I've been to \"fancier\" sushi houses but the food speaks for itself. Very good and great staff too."], ["Kari C.", "One of my favorite sushi places to go! A small but nice little sushi restaurant, that has really fresh fish for an incredibly reasonable price! Joy and Susie are an absolute delight to be waited on by! They are so sweet and suggest the best items to try. One major thing you must try is the Uni Shooter! It was so AMAZING! Check out the picture I posted of it, it has a burst of flavor right as you shoot it, and the quail egg adds a nice finish! My favorite time to go here is during the week or for lunch, just because it's slower and you get the best service! Now that I live close to this sushi place again I will definitely be coming back!"], ["Ivy W.", "I'm a frequent customer just because I live 5 minutes away. There's not much to say about this place. It's your typical sushi restaurant. Not many of their rolls stand out to me but their sashimi/nigiri is decent- not the best but not horrible either. Customer service is always friendly and their food comes out in a timely manner. They do have a full bar and the ambience is nice at night. I do have one complaint. Do not try their mochi. It is dry and too pricey."], ["Jonathan R.", "Very fresh and delicious sushi. Maki rolls, sushi, shashimi, all great! The service is a bit slow when busy because they always appear to be under staffed but they make up for it with kindness and excellent food. A must try!"], ["Nadja S.", "My second option for lunch time since is very close to work. I usually order a lunch special spicy salmon/tuna rolls. It comes with misso soup and a salad. Very well served and good taste."], ["Mariko B.", "We dined here one night because of a friend's recommendation; my boyfriend and I didn't particularly like it, although I'm extremely picky about Japanese food. It's a very generic asian fusion restaurant, which I figured from the name but it definitely didn't exceed any expectations I had. Meh, there are so many better places to eat than this (idk about Ft Worth but def in Dallas)."], ["Veronica C.", "This place is great! My sister and I always eat sushi when we hang out and this is our go to spot. The fish is fresh and delicious! The service is fast and friendly and they're always giving you suggestions on what to try. For the first time ever, I tried a sea urchin shooter! It was a little different but our server appreciated that I went out of my comfort zone. A really great place, you must go!"], ["Alicia A.", "Who PF CHANGS?... This place is the BOMB.COM!My fiance is a huge sushi fan and is in love with this place. I'm not a fan on sushi so I get the Udon Chicken and it is amazing. Taste better than PF Changs and that is one of my favorite places. Excellent service and amazing fun!"], ["Mr R.", "Restaurant is good, big place and great for groups tables are easily move to accommodate.  Great selection on alcohol from domestic to Japanese's wines, beers, to non-alcohol sodas and different kinds of teas. For food you can start with appetizers, soup, salads, sushi, rolls, even vegetable rolls, sashimi, udon soup and much much more combinations also.  I had ask for a to go menu and was told to go thru their website. -For me, tried the plum wine which was different special since my wine came with ice. Wine and ice not a good mix, right?-It was sweet, at times tasted like cough syrup and sweet again. But did order another one And ordered the Tao sushi, since that's the name of the place.  It was very good, waiter kept checking on me if I wanted anything else which was great + I wanted to try something else but couldn't decided.  So called it an evening.  Decor was ok. But great places for friends and/or get together would order their sushi and sashimi boat, mixed for sharing."], ["Ibuki M.", "My favorite sushi spot love the food and great service"], ["Ashley A.", "Love the Super Dragon Roll. Great place for dinner. My husband and I go here anytime we are in the area. The servers are all very friendly. Great place all around. :) Worth checking out if you're in the area. They won't let you down."], ["Samantha S.", "I still go to this sushi place even though I've moved across town. Excellent service, when you sit down you're handed a hot towel, which I particularly like. You're also served a small bowl of bean sprouts and thinly sliced veggies in a soy sauce type...well sauce. I'm not the most adventurous sushi eater but it's worth mentioning that my sushi connoisseur friends like this place as much as I do. I love the Super Dragon Roll, it's the best. I can also vouch for the miso soup. While sushi nights are usually not the cheapest of occasions, this place offers awesome sushi for a reasonable price in a pleasant enironment."], ["Julie T.", "We decided to eat here because our hotel was close by. The food was ok, not bad, not the best, either. My seat had duct tape over the cushion. Service was good and  fast. I am veggie so I ordered a 2 rolls that would meet my likings and miso soup and a glass of wine. They appeared to have a full stocked bar."], ["Jon M.", "Guys, seriously. This place rocks. It's amazing...the best sushi joint in Fort Worth (or Arlington). I was a die-hard fan of Pirhana's until I ate here. Now I won't go anywhere else. The service is flawless, and the sushi is a work of art. I have had such fresh sashimi in only a couple of places. My sister and I came once and now we're hooked. Give it a try, you will not regret it."], ["Andy J.", "This restaurant has the best service.  You'll forget who your waitress is because they all help you out to make sure you aren't left needing anything.  The sushi is very good, as well as some of the appetizers and cooked plates that I've tried.  But, mostly we eat the sushi rolls here.  It's not overpriced like some other spots in town.  Nice quiet atmosphere."], ["Sarah N.", "This is my go-to restaurant for Japanese food. Been coming here for years and never once have I left unsatisfied. I can't tell you much about the sushi because I'm kosher, but they have so many other dishes that I can have that I absolutely love. I always get the miso and the vegetable gyouza. I love their yakisoba, their udon, and their tempura chicken (I especially love all the little vegetables they fry to go with it). The staff is always attentive and friendly. Definitely worth a stop!"], ["Christine A.", "Sushi Tao had a good ambiance- not too quiet and empty to make you think they are secretly playing scrabble in the back, but also not blisteringly loud music or screaming children. My boyfriend and I usually venture to Wasabi Sushi for a sushi date, but we decided to try Sushi Tao, having driven by it many times. We both thought it was a fair dinner. I wasn't blown away, but I did truly enjoy my meal. We had the shrimp shumai appetizer, along with the tiger roll, mimosa roll, and Tao roll--all very good, but basic. They do have a full bar, which adds to a nice dinner out. Prices were also fair, not as steep as some of the other restaurants in town. I think we will go back due to ease and location, however Sushi Tao didn't settle our score for the best all around sushi dining experience in Fort Worth."]], "Big Fish Japanese Cuisine": [], "Wild Sushi & Ramen": [], "An Zen Sushi": [], "Pan Asia": []}