{"Thai Terrace": [["Travis S.", "This place is a very good find in FTW. I was looking for some good Thai food in FTW and this place was a nice surprise. I will definitely be going back soon. Great noodles, curry, spring rolls, and BYOB with a liquor store next door! Many different spice levels with a great kick. Satisfied my tasted buds!"], ["Jeff S.", "Food very good..at this time (summer) a/C is poor. Otherwise would be more stars. Pricing is good. Service good."], ["Leah P.", "I think this restaurant has a ton of potential, but it isn't there yet. It's not in a very accessible location, but visible from Chisholm Trail which is how we found it. The service is not good, at all. Food was okay, but I've had better. We'll give this place another shot, simply because we went the first week it was open."], ["Colby W.", "Best Thai food I've ever had.   The place is non assuming from the outside, but very clean and inviting on the inside.  Our server, Nick, was extremely attentive and had great recommendations.  We had the egg rolls, chicken pad Kee mow with pad Thai noodles (level 3) and chicken green curry (level 4 out of 5).  The spice level was spicier than other places and was just perfect for the dishes that we ordered.  Both dishes were delicious, but the green chicken curry was absolutely incredible. We will definitely go back again soon."], ["Elaine T.", "What serendipity! :-) This quaint corner spot is reasonably priced, has quick service, and a friendly staff. The interior is simple and clean. Parking wasn't an issue at 11:45. I had beef pad see ew and Tom Ka soup. Portions are just right. Great place for lunch during a busy work week. I will be back to try more dishes."], ["Kim P.", "Enjoyed the various curry dishes & they are addictive!  Friendly, clean & yummy neighborhood spot. I'll be back!"], ["James L.", "My wife and I tried this place a few days ago and were pleasantly surprised. We ordered the beef pad thai to split. It was so good we ordered another! I will definitely be going back. Also, it's BYOB, which is nice."], ["Linda H.", "First visit to Thai Terrace after reading good reviews.  Not disappointed.  Thai Sampler appetizer was delicious as was green curry with chicken (stated to be some of the best ever eaten by a very big fan of curry!)  and Rad Na with pork.  Server, Nick, was delightful and efficient and all of the food was fresh and delicious.  Décor is basic but clean and neat.  Food is not overly spicy (not the usual heat selection from 1 to 4 as in most Thai restaurants) and hot sauce additions are gladly delivered to the table."], ["Nsa A.", "Fast service, reasonably priced, and amazing Thai food. I had the egg rolls, pad Thai, and sticky rice with mango. I will definitely be back"], ["Kyle K.", "From the papaya salad, to the pad ka prow...pretty terrific!! The wait staff was friendly and provided great service. The company was unbelievably good as well. I will definitely return for another visit."], ["Erica E.", "Delicious, fresh, and beautifully presented! Was sweating with a 1 on the spice scale on my red curry, but still delicious. The Tom Yum soup my stepdad got looked amazing too. So glad this place had opened up- we'll be back!"], ["Joe E.", "Stumbling onto Thai Terrace was a pleasant surprise. We saw it driving down Vickery before it had opened with a \"coming soon\" sign and were eagerly anticipating its arrival. There is a dearth of great Thai food in the area, with Thai Select and Thailicious running a mediocre monopoly on the culture's cuisine. So I was hopeful that Thai Terrace would deliver and it did. Their food has a unique flavor that I haven't tasted before, and was pleasantly surprised by. The portions are a great value. I highly recommend getting the coconut ice cream as a dessert. The service was patient, helpful and attentive. I would recommend this place to anyone looking for some good Thai food in Fort Worth."], ["Robert W.", "My wife and I found this on our way to another restaurant and decided to try it out. It was during lunch, so we got the specials. I tried the pad thai with shrimp, and my wife had got chicken fried rice. I really like their tea, although my wife isn't so enamored with it. The hot and sour soup that day was really good, nothing like the hot and sour in the Chinese restaurants I frequent. The steamed dumplings are also particularly tasty. The spring rolls couldn't be any better, love them. I was a little hungry :)."]], "Thailicious": [["Laa P.", "I love the crying tiger steak. Best Tom Kha Gai soup in Fort Worth. Love the duck curry. Lovely owners. A bit on the pricey side. Good date night spot!  I believe entrees on tray does their delivery service."], ["Thomas A.", "I love Thailicious and have dined in a few times but usually order out. The food has always been excellent in flavor. It's a bit more expensive than other Thai restaurants in town but the location and ambiance are far better than most. I was sad to get home after calling in my order for curry after a long day at work to find I was only given half an order but charged full price. I hope it was an anomaly and I'll go back again. But if it happens again, I'll be sure to Yelp about it and find another Thai place to frequent."], ["D H.", "Wayyyy too sweet, waitress sucked, i asked for somewhat spicy food 3.5-4 out of 5 and i got sweet with no hint of spic. Same to be said about my wife's plate. She wouldn't even finish it."], ["Giamaria W.", "I love this establishment, and will miss it dearly. I was lucky one day, my boss brought me here for lunch, and I will never forget how fab it is! The potsickers were a great intro, and just delicate as can be. The dining is quaint and yet trendy at the same time. Great decor with quiet , so you are not overwhelmed by background dining noise. The staff is highly attentive, and just wonderful. They will walk you through the menu, insure you understand the heat grades, and recommend many great things I have never tried. Even when I was stuck at my store one time, they even were kind enough to deliver it to me, I was in the same shopping center, but truly it is the little things in servioce and kindness you ALWAYS rmember. The chicken with cashew nuts is wonderful, but I will truly say by die hard end all be all dish there is the Green Curry Shrimp with steamed rice. The eggplant and bamboo shoots are cooked perfectly to the most delicate sweetness, the taste of coconut milk on you pallette with the high spice of curry just sends me over the edge! Rest assured though, please by all means get the heat grade right! I ususually go with a 2.0-2.5 nooooo higher! Whew! My head would tingle and explode at any higher! There are so many great dishes to try there, everytime, i taste a little something new and I am always thrilled with my new find. I will truly miss this place, as I have moved back to NC, but I wanted to take the time to give a glowing review. The owners and management are wonderful, the attention to detail with the entrees are always spot on, and I just never have had a bad experience! Enjoy for me as this is a little gem in Fort Worth!"], ["Carlos H.", "The food was good, but not the service. Waiter was horrible, really. Oh, and their \"spicy meter\" is way off. I ordered a two on their meter, and my food was very spicy, and I'm not one to be easily spooked by spicy foods."], ["Ryan R.", "I have been to this establishment a few time. I like my thai food to be spicy. This place doesn't understand the term. I ordered the fire noodles I asked for an 8 out of 10 second time I went after I asked what heat index would it be in Thailand they said 15 so I ordered a 15 still came to me as a 0. The third and final time I went same thing. Each time I go to this place I have a conversation with the owner and she tells me that they lower the heat because I am white and that is what will sell, of course they always say that they will correct it the next time I come in. Well I gave them 3 chances. I just made a thai red curry for the first time. Even though I messed up by putting to much ground ginger it still was better than any thai food I have had in the DFW area. I will be making thai food at home from here on out."], ["Ralph D.", "This place does not have alcohol but it has very good food. My crab and egg rice at level 4 was outstanding. Green, mint curry with shrimp the same. Also good value and service. We will return soon."], ["M B.", "Very good Thai place."], ["Coco T.", "Their food was good. Not the best Thai food I've had but it was pretty good compared to some places. The service could've been better. I asked for a spicy level of 4 but didn't have any in either of my dishes. I also asked for hot sauce on the side but never received it. My friend asked for an extra white rice which they forgot to bring to him. The staff was nice but they definitely need to work on taking orders and listening to customers."], ["Alison M.", "There aren't a lot of Thai restaurants to choose from in fort worth, thailicious is definitely my favorite out of them all. The food tastes very authentic, fresh and high quality. Some other thai places have extremely greasy food, but thailicious tastes more healthy and crisp. I love their curries and their Pad Kra Prow!The restaurant is a little small and gets very busy during lunch and dinner, so be prepared to wait."], ["Kelsey R.", "Drove out to Fort Worth to meet up for lunch with an old friend. It's right off of I-30 at Hulen, convenient for a drive from Dallas. Due to unforeseen traffic, I was about 30 minutes late and my friend didn't get my text, so she got there on time and waited. She said they were very nice to her and didn't pressure her to leave or give up her table while I sat in construction. We both ordered the Pad Thai lunch specials, hers with chicken and mine with tofu. We started with salad with peanut sauce, which was delicious! I want to bottle that sauce and bring it home. I ordered the egg roll, which is marked as vegetarian on the menu, and she had the summer roll. The summer roll came out before our food, but my egg roll came out with the entree. I slathered the peanut sauce on it and took a big bite...only to taste meat of some sort. I had to be *that person* in public, spitting my food out. I asked the waiter, who was very nice, if the egg roll had meat in it since the menu said vegetarian and he had to ask another lady that worked there who told him yes. He then said I should've ordered the spring roll...which isn't on the menu for the lunch specials. Just the (vegetarian) summer roll, (vegetarian) egg rolls and pot sticks, with no substitutions allowed. So, my appetizer was a waste and there were no apologies made for the incorrect labeling on the menu, just blaming me for not ordering something that was not on the menu.Now that I didn't get my appetizer, I dug into the pad thai. We both got spice level 1 and enjoyed the kick. Not too hot for my boring taste buds. The flavor was rich, not too greasy or anything. Saved about 1/3 to take home as leftovers and it reheated well. The food came out quickly after we ordered and our drinks were refilled often. The prices are lunch are a bit higher than normal Thai lunch options, $9.50 versus the $7-8 I am used to.We may return, if only for its convenience and options, but we'll see. Kind of reeling still after the vegetarian-or-not debacle."], ["Maria G.", "Thailicious can do NO wrong!!! My bf and I have had the Pad Thai and it is amazing! Today my bf and I tried to be \"adventurous\" and step away from the pad thai. I tried the Drunken Noodles and my bf had the Bangkok fried rice. My DN were incredibly amazing. I asked for a level 2/5 in spiciness and it was perfect. My bf really enjoyed his BFR dish as well. After trying these two \"new\" dishes, we are ready to explore the menu further!"], ["Leah T.", "I have never been a fan of Thai food until I came here!  It's amazing what can happen when attention is paid to small details and things are done right!Dislaimer** I have only ordered Vegetarian options here....I have had Pad-Thai, Pad-See-Ew, Crab Rangoo, spring rolls, and Larb here.All the dishes have been fabulous.  Things that matter to me: The spice levels have been consistent and I discovered that I am not as tough as I thought it was when it comes to heat.  The noodles are cooked well and are smooth and velvety vs. stuck together and chewy.  THE VEGETABLES ARE TOP NOTCH! They pay attention and cook their veggie & tofu well. Veggies are sliced not too thick and not too thin and there's lots of variety (carrots, snap, peas, broccoli, mushrooms etc.) The vegetarian Larb was a highlight....the complexity of the flavors are making my mouth water RIGHT NOW while I'm typing. The imitation chicken used was seasoned perfectly and had a great texture.Service has always been great and the people are very friendly.  The decor inside is very nice and it could be an excellent date spot."], ["Cocktail H.", "Why would you give his place a one star? Is the question my husband asked  in a recent visit. This place is awesome - BYOB, fast service and most importantly, when you ask them to change the god awful jazz, they do it! On a more serious note, the food is delicious and fresh. We ordered the the red curry and the pad Kra prow and we were not disappointed!"], ["Christine C.", "A new Thai restaurant opened up in town! We were sooo excited. We love Thai food! And it's so close, too! First, the good. The service was top-notch. Everyone had a smile, drinks stayed replenished, and we had multiple people attend to us. One lady even kept bowing. And the bad. The prices were on the high side. Like $9 for chicken satay appetizers. The menu was also uninspired, especially the curries. I had to flip through it a few times to find something that I couldn't have easily made myself at home. I gave up and just ended up getting the Oyster Sauce dish because I love mushrooms. I did not care for it. In fact, I threw away the leftovers on the way home. Frank thought his curry was good, but the portion was too small. He also didn't think he got enough rice.It really pains me to write this review. Really, it does. They still have the \"GRAND OPENING\" banner in front and everything. And we really wanted to like this place, too. But nevertheless, this is my least favorite Thai place, and I don't think I'll be going back. I think that warrants a review.Two entrees (one oyster sauce; one curry) and one tea = $28 before tip."], ["A R.", "I love this place! I like coming for lunch specials. Cool ambiance and amazing service! Best fried rice I've ever had. I'm not big fan of super spicy so I order level 2 and that's good for me. Love love this place!"], ["Dawn H.", "Beside the fact that the name is AMAZING and filled with humor the food is Spec.tac.ular! Pineapple Fried Rice is my go-to item but the Pad See Ew is breathtaking. I'd order that every day for a week if my hips weren't already so saggy (not that the pineapple fried rice is much better, it's just easier for me to stop shoveling delicious food into my mouth).Great food, great service. Yum!"], ["Shannon S.", "Lunchtime prices and portions are the best deal. Your meal comes with an appetizer and a side salad. Try the lemon dressing! I love the chicken (or tofu) pad Thai, spice level 2! They use skinnier noodles that I just love!"], ["PricelessJewels P.", "We eat a LOT of Thai food and try new spots often looking for a good authentic Thai restaurant. I was trained by a soccer coach from Thailand who introduced me to \"GREAT\" Thai food and worked at a Thai restaurant in college.  Thailicious is GREAT thai food and great service. Which, if you visit a lot of Thai restaurants you know is hard to find, especially if you have kids with you. We have four kids and take them here, it's a nice restaurant, and the staff is always so friendly and wonderful! The food is amazing and we always get the coconut chicken soup \"Thom Ka\", Pad Thai, Curry, and often we will get the spring rolls. I also enjoy their salads and their Thai iced tea is delicious too! We go whenever we visit Fort Worth! It's worth EVERY penny! You should definitely try it! DELICIOUS!"], ["Sharon W.", "Lunch special is good and service is actually fast. The restaurant is crowded and you might have to wait for seats to come up. I tried wild chili and made it as spicy as 5. The waiter will ask you for your preference of spicy from 1 to 5. It was truly spicy but it was good.Thai tea is good too. Ice and goes great with spicy stuff.It cost about 12 for lunch."]], "Pandan Thai Kitchen": [], "Kin Kin Urban Thai": [["Anjali D.", "I've been to 7 Thai places in Fort Worth, and Kin Kin Urban Thai is the only place where (1) you have to pay extra for rice - it does not come with the curry dishes, and (2) you cannot choose your spiciness level - \"the food comes out as the chef intends it.\" The decor of the place is very nice and the food itself was good - I got red curry with tofu - but it was overpriced. My friend and I ordered an appetizer that still hadn't been brought out when our entrees arrived. We pointed this out to the server, who said they'd bring the appetizer ASAP. About 10-15 minutes later it still hadn't arrived, so we canceled the order. I would give the food 3.5 stars, but have to lower my rating because of the service and because they don't allow you to specify how spicy you'd like for your dish to be, which to me is a signature aspect of ordering at a Thai restaurant."], ["Ralph D.", "Has potential. But they need to install a door blocking off a view of the kitchen from the tables and really need to train the waiters. Mine could not handle a simple gin and tonic with bitters and knew nothing about the wines. Food was good."], ["Crystal L.", "Me and my boyfriend decided to try this place out for the first time today. We came in at around 2 PM, the place was a little slow so we had a really good seat at the booth. The place looks very modern and nice with a lot of windows. We started off with some Handmade Dumplings, the sauce was really good and the dumplings are super soft. I ordered the Pad Kee Mow and the boyfriend got the Gang Dang (Red Curry). The menu indicated that the Pad Kee Mow is spicy but our waitress told me that it isn't and she was right, it wasn't that spicy for a person that can't eat spicy at all like me. It was very delicious, but a bit too sweet at the bottom. the boyfriend's Red Curry was very delicious as well, I only got 2 bites of it. He seemed to enjoyed it a a lot too. We ended our meal with  Tofu Panna Cotta. It was like a combination of 3 mini desserts, we both loved it! The manager and the owner were very nice, they came to say hi and check up on us. Our waitress is a really sweet girl as well. I had a great first experience here and will definitely come back."], ["Vi N.", "In my opinion, Kin Kin still needs to train their staff because the service was not good at all. My friends and I came for their 50% off deal yesterday and we came EARLY before the place was packed. Starting from 5:30pm, we didn't leave until 7:45pm because it was taking forever for them to get our food. There were 6 of us and we saw a table who came after us who got their food before us. In addition, I ordered the Grilled Nam Tok and so did my friend and it came out cold. We made the waiter take it back to reheat it. The meat was dry but the sauce did help a little bit. This would not be a dish I would want to order again. In addition, it did take them awhile to give us our checks and when they did, the waiter forgot to add the 50% off deal and so we had to wait again. We asked them to validate our parking ticket and when we got out of the parking garage, it was actually not validated and my friend ended up having to pay. I hope this place improves because with the service that we received yesterday, I do not want to come back again. I've not felt the need to write a negative review on yelp before but this restaurant needs to know so that it can improve..especially since this is their opening week."]], "Thai Rice 'N' Noodles": [], "Sikhay": [["Alisha S.", "I lived in Fort Worth for 5 years before finding out about this place. Delicious authentic Lao food with a variety of jaew to choose from. I'm am now a regular here!  Their portions are generous and presentation is nice. I'm working on trying everything on the menu. My son loves their kow biek sengnand egg rolls.  I love the Papya salad, calamari and the rare beef larb."], ["Stc T.", "Had the lao sausage and one of the lao soups with tripe, skirt steak, and meatballs. Everything was good, but no one asked me about spice level and it was a bit bland, but there were a good assortment of chilis and sauces on the table."], ["Jennifer H.", "I ordered fried chicken and papaya salad level 2 as a takeout order. The fried chicken was good. The dipping sauce wasn't necessary since the wings already had a flavorful taste to it. Unfortunately, the papaya salad was not great. It tasted like the fish sauce went bad and I ended up throwing half of it away. Overall, if there was another thai restaurant open after 9pm on a Saturday, I would have gone there. I did appreciate their customer service,  they were attentive and very helpful."], ["Josh L.", "Been here twice and will come back again. The 25$ for 50$ deal is pretty awesome. Food is priced well and the portion sizes are pretty good too.The location of the restaurant is in a pretty dump location. The outside of the restaurant also looks pretty bad, but the inside is pretty awesome. I would've never expected the inside to look like what it looked like from seeing the outside.  The bathroom is also very clean. Staff is very friendly. Food can be very spicy though."], ["Kay V.", "I ate here before and after they remodel, looks nice inside had the drunken noodles level 4 spicy omg so good and flavorful best I ever had. The fried chicken is so crispy and big. Favorite spot to eat for thai/Laos food. Reasonable prices. Ate for two $26"], ["Laura C.", "Really good food, service was really slow. I was told it's because they only have two cooks and one cook does only certain dishes and the other does the rest."], ["M P.", "Great Lao/Thai food. Dining room now looks way better, cleaner, updated tables, chairs. There's a separated area for private party I presume. Have been eating here for years. Food is consistent and good.  Have tried Sukiyaki, basil stir fry, papaya salad, all good."], ["Andrew D.", "Came back again and it be a fine dine, as usual. Yelp didn't accept my other post for some reason oh well I'm here to post another I like this place a lot they have good food especially they noodles something called pad Thai?This time no fried chicken but got eggrolls they good they were busy but it's all good news for them friendly people equal good service with great food five stars for me"], ["Downtown Y.", "Love the Orange chicken with pineapple! One of my favorite restaurants to go to! I come at least 2-3 times a month if not more!"], ["Chris P.", "By far the best Lao restaurant I had! Great service and the inside is very clean. Everything on the menu is good. I can eat here 5 days a week!"], ["Aara M.", "This place is super clean on the inside! They have the best asian food! The boba tea is amazing. I think their sauces are even homemade!!"], ["M B.", "Best in this area. Very authentic and Cheap !"], ["Diane T.", "Me and the Hubs had lunch here recently.  Generally, we both liked the food.  We ordered Spring Rolls, Chicken Larb, and Tum Muah.  It took a little while for the spring rolls to come out, but when they did they were very good and fresh (we found out later that the cook had originally made us eggrolls which I assume accounted for the slight delay receiving the spring rolls).  Both the larb and tum muah were tasty and both dishes had a nice presentation.  Actually, I don't know if we received the tum mua or the tum mii.  I thought we ordered the first one, but the one we got had noodles and long beans.  It didn't really matter since it was tasty, but maybe it's better to point to the menu item rather than try to say it if you don't speak the language ;-)  Anyway...  The larb was a little different than most of the Thai versions I've had.  I prefer a little more dressing on larb than this version had so I can soak it up with rice, but it still tasted very good.  Let's put it this way - there were no leftovers!Our server was very friendly and helpful and checked on us regularly.  We were never out of iced tea or extra napkins.  He even brought us the eggrolls we didn't order for no charge.  (I'm not a big eggroll fan, but these were quite good, especially while they were still hot.)  The restaurant itself is pleasant enough.  It's not fancy or anything, but it seems well-maintained and is clean.  It's way way better on the inside than it looks from the outside (its in a rundown-looking strip mall).  If this place were closer to home, I'd put it in my regular lunch rotation.  But I'll make a special trip again sometime anyway."], ["R G.", "Very Authentic, my wife was craving authentic Southeast Asian food for her birthday and Sikhay delivered. We had the Papaya Salad (Thai style), Larb, Wassermann curry, Nam Kao, Pad Thai, and Sticky Rice. All of which was good! It was all very authentic, so if you're used to overly americanized asian food this might not be the place for you."], ["Aly G.", "Ordered the chicken pad Thai, beef jerky appetizers, & two spring rolls for two. All delicious and large portions. Even had to take some home. Definitely will go again next time we are in the vicinity."], ["Miranda C.", "I love this place! The food is always good. Customer service is always great! I love the way they cook their larb, kao piak sen, and ladna. The prices are good also."], ["NokieNeddie B.", "What can I say. This is what I call a \"hole in the wall\" type of restaurant mostly where the food is absolutely delicious! This is such a place if you don't mind the unappealing atmosphere and local. Authentic Lao/Thai food cooked by known Lao cooks who have the talent and taste-buds to absolutely satisfy any craving. Recommending this place if you are missing Lao soul food.Cheers!"], ["Kathy N.", "The food here is delicious. The best homemade Laos food I have ever tasted. I've been to many laos/thai restaurant before and none can compare to this one. The food is just right and tastes very oriental. Relaxed environment and extremely nice and friendly staff. I believe this is a family owned restaurant which explains hospitality. Definitely the best Laos Restaurant around."], ["Jordan B.", "The food here is the best Lao/Thai/asian food I've had. The fried chicken is really good!! The PHO is so good, a very flavorful broth and excellent fresh ingredients. I've eaten here several times and every time the food has been prepared fresh and fast with lots of great sauces to kick up any dish.The staff is very friendly and helpful with menu selections."], ["Antony C.", "Curry, curry, curry. That is all"]], "Thai Charm Cuisine": [], "Pandan Thai Kitchen Keller": [["Joel J.", "This place is great! Came here during lunch time with my wife and were both pleasantly surprised.  She had the Red Curry and I had the Pork Fried rice.  Both dishes offered so much  flavor and we were not disappointed with their portions. The people were very friendly and genuinely happy to have our business.  We will coming here again. ... the spring rolls were amazing!"], ["Paul N.", "This place seemed to be a little hyped up. I don't hate the food but nothing is special here. I got the shrimp Pad Kee Mao and it was just alright. There was a good amount of shrimp on the plate and the portion was big but the taste was just okay. I got the \"famous\" raspberry orange green tea and it was somewhat refreshing (need to squeeze orange in rather than throwing in two little slices). I also ordered both of the wings plates and I'll never order it again. The garlic wings were just fried wings with little sprinkles of garlic pieces on it (didn't even stick to the wings). The best garlic wings, hands down, goes to T's Asian Kitchen. The other spicy wing plate was just the regular sweet sauce that came out of a bottle sold at asian markets. Overall, big portions but taste was alright. I've had better thai food down the street at Muang Lao."], ["Amby A.", "New Thai place in my immediate neighborhood I felt it was only fair I checked this out and commented. Came here with my brother and his girlfriend all famished from an evening at the Kimball Arts museum. Food was ...ok. The business model appeared to lean more towards a take out  place as they were busy in the takeout counter but hardly any dinners in the restaurant. I'm yet to decide if I will return here or not."], ["Heather V.", "Hoping we found a great Thai place that was close to the house.  This place has fresh ingredients but food was lacking flavor. We had a cashew chicken stir fry, Tom Kai soup,and green curry. Price was decent and gave good portions. Service was good."], ["David V.", "Tried some Thai takeout the other day since this place was in my neighborhood. When you first walk in you notice they have a place house for kids, looks kind of weird, but probably good for families. Tried the panang and yellow curry. Both were good, but I've had better. The curries came with just meat and onions, thought there would be more vegetables. This place is convenient for those in the neighborhood since their aren't too many ethnic restaurants around Keller. Will try other things on menu."], ["Erwin C.", "Truth...I was skeptical. Walk up order places aren't usually any good. Then they asked for tip prior to service or food...pretty weird. However the food was awesome!"], ["Chen-Han W.", "If you're looking for delicious Thai food in the Keller area, this is the place to go.I ordered the Pad See Ew with a Orange Rasberry Green Tea to sip on.The Pad See Ew was simply amazing. It was very fresh and was quickly delivered to my table. This will definitely become one of my staples when coming here.The Orange Rasberry Green Tea was very refreshing. All the flavors blended well together and it was much needed on the warm spring day that I came. The restaurant itself is very modern and spacious. Just like other reviews mentioned it's a very casual restaurant where you order at the counter and the food is brought to you. The servers were also very attentive and courteous.To wrap up the review, the food was amazing, the service was great, and I will definitely be coming back to get my Thai fix."], ["shawn n.", "Really good food and cool set up.  We had Thai fried rice, panag beef curry, phat Thai, garlicky chicken wings and Tom yum soup. Everyone was full and happy. The portion sizes are on point as well.  The panag beef had a good portion of beef  as well. We will be back soon!"], ["Ronald M.", "A favorite for the whole family. They even have selections that meet strict dietary needs (gleutin, dairy free). The food is always excellent and reasonably priced. Whether dine in or take out, it is definitely worth the trip."], ["Travis B.", "So finally gave this joint a try Tom ka chicken and the chicken lahb . Ok I get it many versions on Thai food depending on the region it comes from, just like our good old US OF A BBQ ( texas bbq is the best )  . Back to the soup the broth was lemongrass overload veggies a bit chunky for my taste. I asked for it Thai spicy and all they did was cut dried red Thai chilis into the soup. Fresh red and green Thai chilis would be much better . HEY COOK FIX THAT PLEASE! All said n done below par on my scale of CTK. LAHB CHICKEN SALAD this was pretty good but they describe it as with a wedge of lettuce  and it was not, it was chopped lettuce then covered in the LAHB with 2 weak looking tomatoe slices.if you going to serve tomatoes and your a mom and pop joint you best hit the farmers market for the red things! I'll sneek back in and try a noodle dish maybe they can ROCK THAT"], ["JaNae W.", "Love this place!!  We eat here every Saturday and if we miss it for the week we are craving it bad. The staff is all very friendly!"], ["Jenn D.", "I don't do many reviews but seeing as this is very close to home and my new fave spot to eat, I want to make sure everyone tries them out and they stay here for a long time to come! Definitely great for dine-in if you have young children and don't mind noise but probably not the right atmosphere for date night. It does have a food court type feel but we gets ours to go so we don't care! Pad thai is amazing. My kids love the kids noodles, fried rice, and spring rolls. The tamarind chicken is great too. None of us are fans of spicy so bare that in mind. None of those have any spice or kick to them unless you ask otherwise. Even if you have never eaten thai, give it a try!"], ["Jennifer W.", "I love Thai food and was so excited that this opened in my neighborhood!  It's good, but not the best I've had. 3 stars because my food varies every time I get it. I love yellow curry and the first time I got it it was full of potatoes and other veggies. This last time I got it take out, and it had nothing in it other than chicken. I was pretty disappointed.  :(Will I go there again? Yes, but only because it's closer than Happy Bowl in White Settlement."], ["Linda B.", "Yay! First time here, but already a fan!  Good food, atmosphere and friendly people. Pork green curry as good as I've had elsewhere, spring rolls delish!"], ["Brant P.", "These guys are a life saver.  Their Thai food is top notch in all categories, but What impressed me most was their willingness to help me out.  They were closing up shop. I had instructions to get the red coconut curry and beef pad see-eew from the mrs.  Seeing my plight at the door and hearing my dilemma, they unlocked the doors and made the order in less than 5 min.   Hell hath no fury like a woman without her Thai food.  Thank you, thank you, thank you."], ["Andy W.", "Great food and nice decor. Thought the portions were a little on the small side. Good service and a convenient kids play area."], ["Michael B.", "Every thing tasted so good and the play area was perfect for our two year old! We had the pad thai, pad kee mao, chicken satay and the stick Thai wings. Highly recommended!"], ["Diane T.", "So I tried this place again and ordered something different.  This time I had the Pad Kee Mow with beef.  Once again, there was way too much sweetness in the sauce.  I don't know if they use a prepared sauce or make their own, but there's too much sugar in it.  If you like sweet food, then this is your place.  If you like Thai food with balanced flavors, it isn't."], ["Joshua D.", "I had only had Thai food once before my first visit to Pandan, so my exposure is minimal to say the least. The restaurant is clean, and very minimalist but tasteful in terms of decor. The menu isn't vast, but very straightforward and approachable for Thai noobies like myself. The young lady who took my order was very friendly and VERY helpful in explaining the menu and guiding me through the process. After getting home and actually eating my dish, I was stunned. I'm no expert about Thai cuisine, but the Pad Kee Mow (I think?) was awesome. The summer rolls were incredible as well, and you can really tell that the vegetables are fresh. My first experience here was incredible and I am sure to return often. My only caveat is the serving size. I realize that this is America and we're spoiled to large servings, but as a guy with a voracious appetite I'd like to get a larger serving. This is not to say that the prices weren't fair, just that I'd appreciate a larger amount; perhaps a Large or Small option on the menu. Go give this place a visit; Food quality is stellar, the staff is friendly and helpful, and the atmosphere is nice."], ["Brian S.", "I'm so glad that I gave this place a try. The food is unbelievably fresh with awesome flavor. The staff seems to really care about their customer's experience. Has been added to our go to local favorites."]], "Thai House Restaurant": [["Jessica B.", "I came to Thai House for the first time to celebrate a friend's birthday. We did sort of a \"family style\" set up. We got drunken noodles, pad Thai, and Penang curry. All were quite possibly the best I've ever eaten.They have a \"spice\" rating system, 1-5, with 5 being the spiciest. If you're a whimp, like me, I wouldn't go above a 3 because they take their spices seriously.Thai house is BYOB and luckily, there's a specs right across the street.The restaurant itself is beautiful inside, with colorful walls and beautiful artwork. The staff are very attentive and friendly."], ["Heather S.", "They are anything if not efficent. Everyone helps get our food and refill drinks but I never have any idea who our waiter is when I dine in the restaurant. The prices are crazy low for the massive servings- I think you get more when it's to-go cause I can eat twice on it. I agree with Amy T.- nothing mind blowing but it satisfies my cravings. I get yellow or red curry most of the time.. I don't know if they have green but I'll try that next. I love that the potatoes in the yellow curry are always cooked perfectly, they tend to be firmer at other Thai spots. I like their Tom Kha- the lunch specials usually come with a small cup and a spring roll. I don't think I could eat a large bowl of it- it's pretty sour compared to others I've had. Try it- if your in Arlington it's one of the best you'll get in the area."], ["Jamie L.", "First time trying Thai food.  I got the garlic chicken.  It was beautifully plated and tasted as good as it looked.My boyfriend got the spicy squid.  He was also satisfied."], ["Erin t.", "Recently started coming here. I like the atmosphere, and they provide good service. I've tried a few things, but so far my favorite item on the menu is the Panang Curry. It is so good! I have tried it with, chicken, duck, and shrimp. They don't hold out on the shrimp either : ) I also like that when you order it with duck, it's only duck and no bone. That is one thing that always gets me with wonton soups. Speaking of duck, I tried the fried duck dish. I like the texture, but the taste just doesn't do it for me. Probably wouldn't order it again."], ["Paul H.", "TIP: Automatic 18% gratuity for parties 6+Decor: 4/5-Mellow atmosphere-You can choose table or booth. -Tables can accommodate 6-7 comfortably.Service: 4/5-Food came out at various times but at least it was hot and fresh-Checks can be split easily-Be careful not to double tip if you have a party of 6 or more, they add 18% gratuityFood: 3.5/5-Chicken wrap with lettuce and crispy fried noodles is a great starter that's light (4/5) -Tom yum shrimp hot pot is not recommended, it is waay too salty (1/5) -Pad thai beef is wow. So much food, perfect taste. No ingredient overpowers another. I loved this dish (5/5)"], ["Hangster N.", "I have been here several times already but yesterday made me want to write a review. I normally get good/moderate service here and the food is always good. But yesterday, there were 2 older waitresses who acted like I was always a nuisance and really did not want to serve me. I came here with both my sisters so we ordered quite a bit too. I ordered a bowl of soup for my daughter and asked for scissors to cut her soup noodles and veggies so she can eat it (she's only 1) and the older waitress acted like it was a huge bother along with cheese rolls and shrimp rolls. she then took away my menu when I had told her I was waiting for 2 more people, I just wanted to order appetizers. When my sisters came we ordered even more - hot pot tom yum gai soup, papaya salad, 2 drunken noodles and 1 pad c ew. So obviously we were spending a lot of money. I had to ask several times for napkins and chopsticks. I would stack dishes so it could be removed and when the older waitresses would come by she would never take them away and I would have to ask for it. The youngest waitress was very pleasant and nice though. The soups were both ok, the pad c ew also moderate but the drunken noodles were very good. I also loved the cheese rolls and shrimp rolls. I just wish our service was so much better. I was very upset they acted like they didn't want us there...."], ["Britney Thuy T.", "Living in Fort Worth, our go-to Thai place is Thai Select. Since we were in Arlington, we decided to try Thai House for their lunch specials.It isn't the worst, but it isn't the best either. My fiance got the chicken green curry, and while it was good initially, it got very boring less than halfway through  the bowl. However, the portion size is generous, and he stayed full (and heavy feeling) the entire day. I actually liked my entree - the chicken pad thai, which was a good blend of sweet & sour, and the noodles were chewy (a good thing). We also tried the Thai iced coffee, which wasn't too great. It was overall decent food for the price, but isn't anything exceptional."], ["Christine P.", "I love Thai house! I've been coming here since my freshman year at UTA and I will be a senior this upcoming fall. This is one of my go-to places when I wanna take family or friends out to food in Arlington.I always order the drunken noodles with a level of 5 spiciness. The scale is from 1-5 (one being the lowest). Dinner always comes with a salad before that comes with a house dressing that I really like. Sorry, I don't have a picture of it right now. Dinner portions here are huge. I always eat half and take the rest to go so it's nice to have a second meal for later ;)Lunch portions are perfect for me because it's half the size of dinner.The last time I came here, my order was WAY TOO SPICY. Yes, I LOVE spicy. That's why I order the 5. But the kitchen made it so spicy this time that it was unbearable to eat. They are usually consistent but this one time was not the best experience. Slip-up happens I suppose. Staff is usually very generous and attentive. Never dealt with a bad waitress or waiter here. Management seems spot-on."], ["Wendy S.", "We came to try this place out for the first time. Yelp reviews said it was very tasty. We enjoyed the dishes we got and would go back again. The service was excellent. The waitresses kept our drinks filled and kept checking on us before,during, and after the meal. The prices are a little on the high side I think for the portions you receive but the quality was good. We ordered two bowls of the Tom Kha Kai, we didn't like this, it had a weird smell to it. However, our entrees the Num Tok was very tender and the panang curry was very good. We would definitely get those dishes again and would like to try the drunken noodles next since so many say they are very good. Overall nice little Thai restaurant."], ["LanChi N.", "It's cool that they offer different spice levels from about 1-5. I ordered the Spicy Thai Noodle aka Drunken Noodle...spice level 3. While waiting we got a small salad with a creamy dressing. It was basically iceberg lettuce. I guess is been awhile since I've had drunken noodles so the taste isn't with me but I guess I wasn't ever wowed but the dish in general. It was okay nothing too special. For a Thai dish it was a bit bland most of the spice came from chili oil.  $2 extra for veggies  so in total it was about 12 dollars or so. Quality seemed a bit lacking.decent portion but lacking the Thai kick. Service was a bit spotty I guess because it's such a large group that they aren't used to that. But this place seems family owned so that may explain it. Overall it's decent at Thai house I've had better but I mean it seems to be the spot here in TX."], ["Joey H.", "Drop what you're doing and eat here.  I'm not kidding.  Thai food is kinda my thing.  Out of 4 states and 5 countries including Thailand, who would have thought this mom and pop strip mall joint woulda taken it.  We had shrimp drunken noodles and tofu yellow curry.  The fresh rolls were good.  The sticky rice and custard were good.  Bro.  The noodles and curry.  Make like Shia Leboeuf and just do it."], ["Ally N.", "Wow. This place is pretty darn good. I've now added this place to my top restaurants in Arlington! Our service was really good, we're weren't rushed and everyone was very calm and collected. But then again it really wasn't that busy. I really dug the decor of this place too. Came during the dinner time and ordered the drunken noodle, while my friends ordered the Panang curry, pad Thai and cheese rolls (so good!!!!). Nothing but positive reactions! Lunch specials are about $6-8 while dinner is $9-10. I feel that for that price, there should be a little bit more, but it's okay. Still yummy."], ["Asher B.", "I came here after noticing the 100+ reviews this place had on yelp. The restaurant is well spaced and well lit too. The wait staff is friendly and got me started off immediately with some water and salad. I ordered the tom yum goong soup to start off with. The waitress asked me how spicy I wanted it on a scale of 1-5 and I choose four. If you have eaten real tom yum soup you'd know it's supposed to be spicy and not sweet. This place had spiced the soup by adding chilli flakes and that was a big turn-off. For appetizers I ordered the curry puffs. Having had the curry puffs in Singapore these were a huge disappointment. They weren't up to the mark. However if you haven't tasted these before I'd say give em a shot.For the main course I got the black pepper beef. This was good, and hence the review gets the third star instead of initially planned two.The food comes quick to your table and it's quite fresh. The wait staff takes good care of their customers.I'd come back here again but next time imma be trying the Thai curry."], ["Cat W.", "Food was good for take out. We ordered the spring rolls, pad Thai with chicken and pad kee Mao with beef. The pad Thai was not amazing but it was good. The pad kee mao was good as well.  The food was better than the average Thai place but not the best I've had either. Give it a try if you're craving Thai in the Arlington area and you don't want to drive."], ["Chris B.", "Not good.  Ordered the chicken pad thai, extra spicy.  Received a bland dish that was almost inedible due to the excessive amount of (fish flavor?).  Add in the fact that although yelp and website states delivery, they no longer offer this service.  Fresh rolls, ok.  Mango sticky rice, ok.  Neither seemed freshly prepared.Won't be back."], ["Linda S.", "So tonight I was just too tired to cook but wanted something fresh and healthy when I came across this place on Yelp.  Thai House is located in a strip center on Cooper just past Arbrook on the East side of the street.  The thing that enticed me were their pictures on the online menu and the food that came out looked just like the pictures.  First they served a very small salad which despite its size was just right to get the meal started.I ordered Thai rolls which came 4 to an order.  They came with shrimp in them on the  menu but I asked if they could be made without and it was no problem. They were pretty good overall.  I wish they would have had some cabbage in them instead of so much lettuce.  The peanut sauce that came with them was fabulous. Sol had the spring roll, which came 5 to an order.  They were crunchy and flavorful.  They came out hot and fresh.  I tried one but didn't use the sauce that came with them but rather dipped it in that fab peanut sauce.  Very tasty.So for an entrée Sol had a stir fry beef and veg dish.  The portion looked kind of small to me but he was stuffed after eating that and 4 of the spring rolls.  I had pineapple fried rice with veggies.  The rice was perfectly cooked and loaded with veggies.  I really liked the way the veg was stir fried and crispy.  There was some type of seasoning sprinkled on the top that made a hint of spicy heat.  Not too much spice but a rather perfect amount.  The dish had cashews, raisins and tomatoes adding just the right amount of sweetness.   My only issue with the dish was there was only 4 small pieces of pineapple in the pineapple fried rice.  The restaurant was very clean and the service was great.  I would definitely go back."], ["Abby S.", "It's not really authentic thai place for me. The lad na chicken was too watery. I had the drunken noodles and pad thai before and it's not bad. The tom yum goong was too sour for me and I usually enjoy that soup. I probably wouldn't come here again. It's not a place I would crave. The free salad was good and the thai iced coffee. The thai tea here is way too sweet for my taste."], ["Christopher D.", "Always great food, service, time to cook and serve, prices. Always great food, service, time to cook and serve, prices. Always great food, service, time to cook and serve, prices."], ["Christine L.", "This is my go to place for Thai food.Hubby and I usually order pad Thai, drunken noodles, and Tom kha.  If you dine in, they usually give you a small plate of salad to start.  The only reason why I'm not giving them 5 stars is bc their spice level can vary.  It's a scale of 1 to 5.  Sometimes their 2 isn't spicy enough, other times it's just right. Since we have a tot that picks off our food, we usually do pad Thai with level 1 spice and she's usually content with that.  We get everything else level 2 spicy in case 3 is going to cause our noses to run.Flavor is always on point though."], ["Jana L.", "Probably my favorite Thai restaurant in Arlington!! Experience: loved my experience here! I came with a friend and its a great place to have lunch/ dinner with someone! It's a nice dim lighting that makes it nice to talk. The decor is nice and asian-y. Maybe not a great place for large crowds, however it is quite spacious and you will never have to wait for a seat. Really enjoyed my overall experience here. Food: every time I come here I get the drunken noodle, it's always my default! I highly recommend getting the drunken noodle if you're at lost!! There's egg in it and it's slightly spivey, and the noodles are wonderfully flat and wide. My friend got the massaman curry, and it was really good as well! Be careful when you first get it cause it WILL burn your mouth Lol. Service: super great! She did stop checking on us after a while (I had to call her to ask for more water) but it was all good. She was super nice and didn't mind that we sat there for a while. Overall, I would absolutely recommend this place if you're ever in the Arlington area and want some awesome Thai food, go to Thai house!!!"], ["Chana R.", "After I signed up to give my first review for Thai Basil Leaf I feel like I owe it to Thai House as well. Been a long time customer, would feel so wrong if I don't share their greatness with the world. First of, I like the new updates done to the restaurant. Nice new floor!People are always really nice here so five stars for that for sure. Service are quick most of the time but I like to visit when it's not usual dining time. Thai people are always friendly (most of them, really) and this place is no exception, from servers to cooks to owners they are all nice people. I don't really like curry as much here but I don't find most Thai restaurant made a really authentic curry dish compare to Thailand. Well, it supposed to be super creamy and oily goodness, a heart attack kind of goodness and to do that you need a real fresh coconut milk and lots of it and a lot of patience preparing the first step of cooking any coconut curry dish. When I crave it I do it myself.I would give Curry only 2.5 stars but seriously, most people seem to like it and as long as you do that is good enough. I love the Tom Yum Shrimp Hot Pot here! I would give it 4 stars. When I do order I ask for 10 stars spicinessTom Yum is a very deep flavor dish and no questions if they do it right. Tom Kha (Chicken is the most common served in Thailand) is pretty good too. Spicy Beef Salad. yummy goodness grilled beef with crispy lettuce and lightly sour and flavorful thai style dressing sauce. What's not to love? 5 Stars easy!Pad Kee Maw! Love it. I find it a bit too oily but the deep flavor just too hard to pass on. A bit alternative compare to real authentic dish, but good enough that I don't care about the little bitty issue. Try with pork I think it's best with pork. Pad See Ew. Love it even more than Pad kee maw!! Ask for Thai style with Chinese Broccoli instead of fusion one with broccoli. It tasted better. Very Simple dish, Flat noodle, meat (I like pork), Chinese broccoli, egg, all stir fried together, not spicy (add it on after if you like) Simply at its best!Oh Man, I almost almost forget to mention Cheese Roll! Not a chance!You can never leave this place without trying it. Please please order it and eat it when it's hot and the cheese is still soft and melt in your mouth. (be careful and don't let it burn your tongue)Minced pork (or chicken) Thai style basil stir fried. They got it right. (Not much veggies in it, just onion and sliced jalapeno pepper I think)Khao Soi Oh goodness. Well I don't like curry here as much but Khao Soi (Curry noodle) is an exception. So so good. Try it with Chicken. 5 hard stars!Somtam (Papaya Salad) is pretty good here too. Really love the flavor but I think its wee bit expensive for the amount I get. Lunch here is good value! Because it comes with Cheese roll teheheheGood lunch price, good portion, I would order curry if I feel like it for lunch since it's cheaper, otherwise I like to order my favorite pad see ew or pad kee maw or pad thai for lunch. I think it's a very good value. I usually reorder what I think it best offers at that place so these are my favorites and if I get to try different dishes in the future I sure will give you an update."], ["Desiree P.", "Great food and great service! The pad Thai was second only to what I've had in Thailand. Their Thai ice coffee was delicious and very authentic. The restaurant was clean and very well decorated. We went for lunch when they have discounted meals. Very reasonable prices and large portion. My friend and I could have probably split the meal. Very classy place, not your typical hole in the wall Asian food restaurant."], ["Jennifer H.", "If you're looking for authentic Thai food, this is the right place to find it! I've had my share of Thai food around the metroplex, Houston, and Austin. Next to Madame Mams' (Thai restaurant in Austin), Thai House was as delicious! They also have a break down on 3 spiciness levels on the menu. But if you ask the server they will offer you  5 Thai spicy levels, that's if you like your food normally spicy. I recommend starting off with their Tom Yum soup. I was really satisfied with their Beef Pad Thai and Drunken noodle for the entrees! Service was better than I expected from an Asian restaurant."], ["Steve N.", "I travel a lot for work and was recently in the Arlington area with a coworker that loved Thai. Did a quick search on yelp for something close with good ratings. Thai House Restaurant came up with a decent amount of reviews and 4 stars. In the past this was a good indication that it was going to be a good restaurant however I've been noticing lately 4 star and 5 star restaurants are really not what they use to be. This leads me to believe that people are manipulating the rating system on yelp. This restaurant was maybe a 2 star restaurant. We both had two Thai Ice Tea that were so sweet that you couldn't drink them even when watering them down by 50%. My co worker ordered the cheese spring rolls for an app, which sounds discussing but she said they were alright although she only ate one. I really don't think this is a Thai dish so it sort of indicated to me that this really wasn't a traditional Thai place. I had the drunken noodles since this was one of the most reviewed item. It was OK.  Nothing special and not good enough to stop me from writing this review. My coworker had the yellow curry and she said it was ok. Avoid the dinner salad they serve. Scary mayonnaise based dressing and old looking lettuce. To some this place up, if your not a Thai lover and don't have a frame of reference then you might enjoy a meal here. If you do like Thai and like good Thai then I would look somewhere else. I won't be back to this place."], ["Jordan C.", "I love the cheese rolls, it's an appetizer. Any dish is a good size and if you like spicy food cannot go wrong with getting \"Thai hot\"."], ["Stephanie L.", "My boyfriend and I came here for dinner on a Saturday night. We indulged in a three course meal starting off with the combination appetizer platter. The Chicken Satay and Fried Shrimp were the best tasting ones for me. I didn't care very much for the Fried Cheese Rolls, Fried Spring Rolls or the Corn Cake. Next was the Thai Hot and Sour Shrimp soup. A nice palate cleanser for the spicy food I still had coming. I had the Beef Drunken Noodles while my boyfriend had the Combination Pineapple Fried Rice. I love flat rice noodles but personally wish they didn't use green bell peppers. Green bell peppers aren't as sweet as the red, orange, or yellow peppers; also why they're much cheaper to buy. They're actually kind of bitter when not cooked all the way and so for me, it was an unpleasant taste alongside the savory meat and noodles. Other than that, I enjoyed it. I personally don't like cashews or the use of pineapple in savory foods but the addition of both in the Pineapple Fried Rice worked. It gave the dish more dimension. Sweet, savory, crunchy, and spicy all in one hit. We ordered both of our dishes at a Spicy 3 which we felt was perfect. Spice is apparent but not overwhelming: an enjoyable spicy. Lastly, a sweet ending with Thai teas to-go. Not as sweet as I like mine to be but it was good.The staff were all very friendly and the service was quick. We'll be happy to come back if/when we have a craving for Thai food!"], ["Christine C.", "I love Thai food and I've been wanting to try Thai House for ages because of the great reviews. I stopped in one cold Sunday for lunch looking for some warm and delicious curry.I ordered Panang Curry with Tofu, my hubby ordered the Thai Fried Rice, and we split the Chicken Satay for an appetizer. We were brought small salads with a white dressing, which I couldn't identify, but it was tasty. We were starving and looking forward to the Satay appetizer but it was brought out at the same time as our entrees. The Satay was pretty standard - grilled chicken on skewers with a thick peanut sauce. The Panang Curry was pretty good - the kaffir lime flavor was strong, as it should be and my tofu was cooked well. I asked for a Mild on the spicy scale and it was still almost too spicy for me to eat. My husband's Thai Fried Rice was also good. Unfortunately, the restaurant was extremely cold during my  visit and it really hindered my dining experience. My husband and I both had to wear our winter jackets the entire meal and we were still freezing. The service left a little to be desired as well. Although the staff was nice, there was only one person on the floor at most times and they were kept pretty busy with other guests. We ended up waiting about 20 minutes for our check before walking to the front counter to pay.Overall, I would give Thai House another shot if I was in the area and craving Thai food. But I probably won't go out of my way to go back."], ["Cynthia F.", "Love this place ! Authentic, clean Thai flavors.. perfect date night ambience.. must eat the dumplings appetizer..."], ["Daniel S.", "Had the Yellow Curry and Flat noodles.  Both excellent.  Really enjoy the jasmine rice, and steamy edamame.  Staff is very friendly, and the atmosphere is nice.  It was a very pleasant experience and delicious meal, we will be back.Great place."], ["Kat C.", "This is my go-to Thai place (not that there are that many around). The decor is your typical Asian restaurant but the staff/service is much quicker and friendlier. Seating is pretty spread out. I always get the pad-c ew and if I'm feeling extra hungry, I'll add in a tom yum soup."], ["Meridith B.", "The food is great but they're always understaffed. I'll keep coming back for sure just for the food :)"], ["F R.", "My first experience at this restaurant was a few days ago. The restaurant wasn't crowded so we were seated quickly. The food we ordered was delicious - my only complaint is that I would like to have had more coconut milk in my curry to make it sweeter (yellow curry), but aside from that everything was good. Our waitress was friendly and funny - when I remember her name, I'll post it here, and she brought our food out in a timely manner. This restaurant was very clean (hardwood/tile floor, glass top  tables etc.) the waitresses were very quick at clearing & cleaning tables once vacated. I would love to go here again & I would recommend it to my friends.Note:After writing this review and it being a cold day today, my review made me hungry for  spicy Thai food again. I'm happy to say that my second visit to Thai House was equally as good as the first."], ["Lore M.", "I totally love this place.  I use this as my standar for awesome Thai food. I feel that the prices are reasonable for what you get.  I've tried most of their curries, their Pad-CU is freaking awesome my four year old loves this place.  The staff is very friendly over all.  The new owners are nice the only thing is that on holidays they are ALWAYS understaffed.  Other than that I love this place from the cheese rolls to the green papaya salad to the curries."], ["Judy R.", "The spice level is so delicious! The pad kee mow is my absolute favorite and the service is quick and very very friendly."], ["Shelby M.", "The food is amazing! My boyfriend and I usually order take out from here and it is always so fresh, hot and always correct. I have had the green curry, red curry, drunken noodles and crystal noodles and they are all so delicious!"], ["Juno L.", "This place  rocks.  The atmosphere is quiet and very classy.  The servers are always very attentive and friendly. I've tried almost everything on the menu by now and you can't go wrong here.  The prices are great and the portion sizes are pretty generous.  Fellas if you're looking for a nice place to take a lady out to a first date, look no further.Ladies if you're looking for places to drop hints about to your new love interest, look no further."], ["Mike K.", "One of the best authentic pad thai dishes.  Great taste made me come back many times.  Service was fair - not bad but not memorable. Ambiance was fair"], ["Amy W.", "That is an amazing restaurant, try the spicy Thai noodle( flat noodle with egg and spicy sauce and chillies ). I ordered the most hottest one ( 5 star). Real spicy !!  And the Thai house roll is real yummy ! Love this restaurant ! Will come back soon"], ["Todd R.", "What a great find!  I sought this restaurant out based on reviews from Yelp while on a business trip to Arlington.  Glad I did.  The hostess / waitress / guessing the owner was so nicely dressed and so kind and attentive.  The Red Curry was perfect and so flavorful.  With the extra soup and spring roll, I do not know have they keep their prices so low.  We were so happy to have dined here!"], ["Nicole S.", "Upon arriving it didn't look open due to sign but luckily for us it was. It is located in an unassuming strip center. It oddly was pretty deserted on a Thursday night. I really liked the staffs uniforms. I'm hopefully assuming right that it is a homage to a traditional outfit. We started out with Thai teas. Tasty as usual. The servers are very prompt with your requests and keeping your water glasses filled. We ordered Corn fritters and Cheese Rolls as appetizers.  Really like the fritters. I hadn't seen those on a Thai menu before.  The cheese rolls were just okay.  I'm a huge fan of cheese rolls, and was looking forward to them.  They appeared veggie friendly which is a plus as sometimes they contain seafood.  However,  these didn't have the creaminess and flavor I was hoping for. For our entrees we ordered the  Country Curry and Drunken Noodles. If you order medium spiciness you get a good amount of heat without burning your mouth. The beau usually gets it too spicy for me so I didn't try his, but mine was a good version of this dish. It's one of the items that's my go to at Thai restaurants.  As another aside they use good toilet paper in their bathrooms.  It's one of those little things you appreciate when you take medicine that essentially act like water pills."]], "Thai Texas": [["Darlene O.", "I feel like I was expecting more with this restaurant especially with the consistent 4 and 5 star ratings.I was actually overjoyed that a high ranking thai restaurant exists and it is NOT in Dallas but I think I anticipated too much.The pad thai was dry, the sauce left much to be desired (too heavy on the tamarind perhaps) and my shrimp tempura was a terrible substitute for my usual shrimp blanket/shrimp roll appetizer I always look forward to eating at Thai restaurants. I generally expect shrimp tempura at a Japanese or hibachi restaurant. *kanye shrug* The shrimp tempura just tasted like the oil it was fried in and it had no real taste beyond that. Perhaps their OTHER menu options deliver more punch that gifts them the myriad of positive reviews. Maybe one day I will attempt to try one of their other menu items but it may be awhile since I always choose pad thai at Thai restaurants."], ["Michael N.", "Wow.Wow.Thai food kinda scares me ever since I ordered volcano fish at a place once. I've learned if I stay away from descriptions of food named after molten rocks and stuff, that I can survive. I like some heat, so I went with the 2.5 (out of 5) heat level on the cashew delight. It was indeed delightful. The staff is unfailingly friendly and polite.We will definitely be back again and again."], ["Terry G.", "Can you say Texas Tiki Bar??? The décor in this place is somewhat odd. Texas flags alongside of Tiki / Polynesian / Thai. Very odd but it works.First off BYOB yeahhhhh.Now I'm no Thai expert to say the least but I really did enjoy my Drunken Noodles. I must say it was the best Drunken Noodles I've ever had (first time too). Just kidding but it was very good. Our server was new and really had no idea about anything in the place but the owner lady helped her through it all. The boss lady was very nice and wanted to know how we found them. I mentioned Yelp and she got all excited.I like spicy but I was not really in the mood so I ordered #1 spicy which still had a kick. For those to talk about 4 & 5... you're NUTS.Again this place is BYOB and I recommend a dry Riesling to help cool down the spice of the food.Try it, you'll like it. (ok, not sure if an alka-seltzer reference is proper but it was really good.)"], ["Meng Q.", "I don't know how they got good review?  I came because of the good review. I was not impressed at all.  Pad Thai is too sweet!!  The Tom kah gai doesn't worth me $6 for a little bowl!  And it doesn't even have kah in it!   They charge $1.5 for little bowl of rice."], ["Mykie D.", "Delicious Thai food. very flavorful and great customer service! I was impressed and satisfied! This place is a hidden gem!"], ["Tu H.", "This place has really nice decor! Walking in you get a beach vibe because the booths looks like tiki huts! My compliant is that it is expensive for the portions they give you. Honestly, I've had better Thai food and this place was below average for me. I got the crispy duck which was 20 (not worth it) because they give a tiny few pieces. It was not all that good. I would not come back just because I've had better Thai food for half the price. I'm really surprised this place has high ratings... I mean there aren't many Thai places in Arlington/gp so I guess that's why people think it's good? I don't know, that's just my opinion!"], ["Harmony H.", "Loved my first of many lunches from Texas Thai. When I walked in it smelled amazing!! Been craving Pad Thai all week this hit the spot!!!"], ["Tony P.", "Best place ever I we have been to this place every weekend that's how crazy we are about this place great food we always order the pad Thai with chicken and the drunken noodles and the green curry all are very good and very filling I always leave happy"], ["Alejandra R.", "Great customer service, all of the waiters work together to serve all customer. As for the food, we ordered the fried spring rolls, they were ok, we should have gone with the fried calamari though.  I had the Panang chicken curry with spice level 3, for me it had a little too much coconut milk and I prefer mine a little thicker but it was a large portion for those looking for quantity. The spice was dead on. My boyfriend ordered the drunken noodles, which was good, however, he ordered the same spice level as I did but his seemed a lot less spicy...like a 1. I had higher expectations but I would come back to try something else. As others have reviewed their stir fried plates are the way to go."], ["Esme C.", "This place was amazing. Went in and it has this rustic atmosphere that I loved. Every table is like a little hut and there's this water feature in the front, very cozy.The hostess was very quick and all smiles!I ordered the pad woonsen with chicken, level 3 spicy. Of course I had to try the thai tea as well! Yum-yum-YUM! Delicious and a big portion too, good for leftovers!There was alot of things on the menu that caught my eye, so everything aligned and I WILL be coming again!!!"], ["Renae G.", "Very good Thai food. I've eaten here twice. My only compliant the second time was that it was Father's Day and they seemed understaffed. The waitress apologized for not being able to check on us very often.The peanut sauce like dressing on their salad is awesome. The Panang Curry is good, though I prefer my curries on the thicker side.The decor is odd, with the booths covered in in individual tiki hut set-ups. I've seen so many episodes of Restaurant Impossible that my first thought was to wonder how much dust accumulates up there."], ["Anye F.", "We've been back about half a dozen times now and I think I've found the \"perfect\" dish -- pad see ew with tofu.  And I'm not even a vegetarian.  It's probably excellent with shrimp too but I'm cheap :)I can not get enough of this dish.  The flavor is amazing.  I cannot really describe it, though it reminds me for some reason of breakfast. A really good spicy breakfast.  I have long been a fan of yellow curry and pad thai but I like this even more.  I may never order anything differently.  Getting the thai iced tea with it will help cut the spice just a teeny bit.I order the spice level at 1 and it still has quite a bit of kick to it.  I once ordered the pineapple fried rice at a 3 and that was pretty darn hot, though I could still tolerate it.  I cannot imagine ordering anything spicier than a 3.The lunch specials are a great bargain.  We usually come for lunch.  Dinner prices are a little more but not unreasonable, and as I said in previous reviews the service is always excellent. I'm upping my rating to a 5 because I think the pad see ew here is my favorite Thai dish ever now."], ["G H.", "So good. Just go. If you have to wait, then wait. Worth it. Loved everything I've had but the Massaman Curry is sublime :)Staff is nice and friendly, place is adorable. I hope it never ever closes."], ["Kevin D.", "This place really is as fantastic as everyone says.  I've eaten here about a dozen times now and it has been deliciously consistent every time.  I've had takeout and it's well packed (virtually spill proof), hot, and the portions in the takeout bowls are VERY generous, and I've had my meal at a table inside.   In every case Ive had enough for lunch the next day after filling up for dinner.        The service is excellent and everyone is super nice.  I got the impression it's a family business and they all do a great job and are kind and friendly.        The chicken, salads, and veggies have been fresh and mouth wateringly good every time.  I have not yet tried a beef dish.  The ginger chicken is amazing.  The pineapple fried rice is wonderful and I had to stop myself from eating too much,  and the chicken panang curry was perfect.   Try the homemade coconut ice cream!  The location is the former location of Sake.  Sake was not impressive.  When the owners of Thai Texas took the place over, they refurbished it from top to bottom and side to side, put in new flooring, new ceiling, new paint, new booths - basically everything.  Nothing is the same except for where it's at.  It's now a relaxing and cozy delicious thai place."], ["Ashley F.", "I had this delivered and was so happy with it. The lady recommended half my order which I was so thankful for. Everything was hot and price was decent. Will order again."], ["Brian C.", "It hurts me to not give this place 5 stars as it clearly the best Thai place in my area. They appear to use fresh ingredients and the meat is not suspect like in many other asian restaraunts.  But in my attempt to improve this little corner of the world I must call a spade a spade. The crispy Thai egg rolls which once had a complete control over my life are no longer hand rolled. This might not be a deal breaker for most, but it's devasting to have tasted greatness and had it substituted with a frozen egg roll. Like I said everything else here is on point."], ["Morgann M.", "The food is amazing, the prices are good, and it's super cute! I've been here at least 6 times this month, and every time I've come here the food has been better and better! You can bring your own alcohol, and they'll give you your own wine or beer glasses! Great for groups, or a date!"], ["Mark G.", "Arguably one of the best Thai places in DFW.  Drunken Noodles aka Pad Kee Mao was excellent.  Wish this place was closer to my house.  Highly recommended."], ["Kimberley K.", "Hands down our favorite Thai restaurant in the area. Great food and service! Love the Pad Thai and Thai Fried Rice. Also the noodle soups and drunken noodle. Always cooked to how you like, and whatever spice level. Fresh Rolls and peanut sauce are yummy too. My boys love it hot and spicy especially the Curry! My favorite is chicken satay! Yummy!"], ["Lydia R.", "Such good Thai food!!! Moved here from NC a couple of years ago and this is the only Thai restaurant so far that compares to the Thai restaurants we were used to back home.  The owners are really nice and caring as well.  Love it!"], ["Stephanie N.", "I recently discovered this place while looking for more places that deliver other than Chinese food and Pizza. There's nothing wrong with either one of those but I wanted something different. I was surprised how much I enjoyed the food. I always get the Tom Kha Kai (spicy coconut soup). I also regularly order the drunken noodles because they are tasty! I would like to try some additional items on the menu but I have trouble ordering something else when I already know my usual order is so good. I tried dining in before but the service was slow so I stick to delivery."], ["Scott K.", "We are glad we found Thai Texas but if it was 1/4 of a mile instead of four miles from my house we'd be eating it  5 nights a week instead of 2.  Everything we've tried has been excellent.  My personal favorite is the mixed vegetables with chicken.  My wife loves the drunken noodles and curries.  My 9 year old tears up the chicken friend rice and my 3 & 2 year old boys destroy the chicken teriyaki.  Kevin makes sure the service is excellent, takeout is quick, and delivery is fast."], ["Cheyenne Z.", "Not a great experience....but not a completely bad one either, hence the 2 star rating. The drunken noodles were just ok, the actual noodles weren't the traditional flat noodles, instead what they gave me was similar to. I don't know if they ran out of the regular stuff and thought it would be an ok substitute but it def wasn't . On the other hand, my side order of crab rangoons were very tasty and the customer service was friendly and it was a fast delivery which is a huge plus since not many places deliver anymore. But I will try Thai Texas again in hopes that this was just a fluke and all the good reviews are representative of what it really is...... and hopefully they give me the right noodles this timeUpdate and for a star raise, tried them again and their pad thai was delicious."], ["Jimmy P.", "Been wanting to try this place, Tay had been here before. Great little place, great service by Tina. Mango Sticky Rice fir desert!"], ["Shawn W.", "I LOVE THIS PLACE. That is all. You really should go especially if you are in SW A"], ["Jeff W.", "Been coming here for about a year now. Everything we have tried is great. My favorites are the Pad Thai and the Massaman curry. The owners and staff are very friendly and always great service."], ["Meagan G.", "I've ate here twice and both times I've found a big BALL of HAIR in my broccoli. At first I thought it was an accident, but when it happens twice the same exact way I highly doubt that!!"], ["Summer G.", "Best Thai food in Arlington. food was authentic, fresh, flavorful,and spicy good. Have the red curry and fried rice. This is a must go. It's a small store so very clean and they're very very friendly and food is awesome. would recommend to anyone."], ["Haley M.", "I have gotten lunch here before and it was fine but our dinner we picked up today was not good at all. My spring rolls were not fresh at all.. The outside was sticky.. And they were 97% all lettuce, and the shrimp was just not fresh tasting at all. Not what I'm used to when ordering a spring roll. The peanut sauce that came with it was disgusting. It was thick like glue. Overall there was no flavor and the textures were terrible. My husband got teriyaki chicken and it was flavorless and he was disappointed as well. My soup wasn't bad  though. But having spend $25 on this small dinner for 2 was disappointing and really gross. Sad day."], ["V G.", "It was a special occasion and I wanted to take dad someplace where his penchant for spicy cuisine would feel at home. So when this little joint popped up on my Yelp-dar, I just had to find out for myself. This one's set in the middle of an older run-of-the-mill strip mall (isn't Arlington just a big strip mall anyway?). He ordered the Thai Garlic with beef while I ordered the Drunken Noodles with pork. We had some reasonably good miso soup as we awaited our main entrees. My drunken noodles were top notch, pork was tender and flavorful. Portions were generous all around. My old man ordered his spice level a \"5\" which was acceptably hot, just not Noomi Rapace-in-a-catsuit-licking-pieces-of-the-Sun-inside-a-blast-furnace-in-Texas-during-the-middle-of-August hot (cool fact: my dad is actually Arthur Brown). Unaware at the time that the spice scale theoretically goes all the way to \"10\" he'll probably order a bolder number next time, hopefully without setting off the fire alarm. We were also served a complimentary post-meal accompaniment: fresh pa thong ko (thai donuts).Food was great, service was really friendly and attentive. I promise it won't be hard to become a regular here! This will definitely be our go to Thai spot!"], ["Melanie S.", "Yum. Volcano chicken is fantastic!  Garlic chicken is good. Papaya salad rocks. They don't play around with spicy either. A level 3 is quite spicy. A level 4 is almost too spicy to enjoy eating the entire serving. But the people are so sweet, the service is great, and the atmosphere is cute. BYOB- I love that part!!!"], ["Sally M.", "This place is a great find...for lunch, dinner, delivery and take-out! The food is delicious, the service is friendly and attentive and the atmosphere is delightful. Mainstays such as pad thai and yellow curry are very tasty...soups have the right amount of spice...fried rice is moist...thus far we have been very happy with everything we have ordered.I like spice and they will make it as spicy as you would like...I would recommend easing into it if you're a medium kind of spice foodie.It is BYOB so bring your own beer. I'm not saying this place is just as good as what I ate while in Thailand but I think it does a damn good job of getting pretty close!"], ["Yogurt V.", "The food is pretty authentic. We really liked crispy duck with spicy basil sauce . It was as good as we had in Thailand . Kho Soi chicken was awesome . The curry paste was perfectly prepared. However , the chicken was a bit too over cooked . Minced beef with spicy basil & fried egg was spot on . My DH & friend loved spicy papaya salad . Veggie spring rolls were piping hot & homemade . Thai custard & sticky rice was good . We will definitely come back ."], ["Ana C.", "I got delivery from there after finding out that they existed thanks to a trip to bueno ..I decided to give them a chance even tho my bf said no since the name had Texas in it but i went on ahead and tried it .. I ordered the shrimp pad Thai the delivery was fast the food was still hot and omg was it delicious i usually order from Asian bowl but not anymore this is seriously delicious! I ordered it kinda spicy and was not let down the shrimp were big comes with a small salad and a spring roll.The owner delivered and he is very nice and explained that he is the Texas in Thai Texas which makes more sense now...Don't let the name fool you.Its family owned! support local business!"], ["Mara H.", "Finally! After our trip to Thailand, we have been searching for Thai food comparable to what we had during our travels. Our usual Thai restaurants in Dallas just did not do the trick. Even some of the most popular Thai restaurants could not satisfy our craving for authentic Thai food until Thai Texas. Don't let the unassuming location deter you. This is a family run business with grandparents running the kitchen. Go. eat. here. now."], ["Andrea F.", "The food was tasty and moderately spicy but very fresh!! The calamari was a bit chewy though"], ["Huong T.", "This is now my favorite Thai restaurant in Arlington. Be aware they don't kid around on their spice level so if don't want to sweat or have your mouth on fire I advise if you usually order three star here will be more like two (maybe even one )"], ["Nok M.", "We found this place by accidentally. After we walked in, the owner greeting us nicely. We asked for typical Thai dish like Papaya salad and Chicken wings. There is no chicken wings, we asked for crispy pork and Chinese broccoli dish, there is no Chinese broccoli. Err, we were kindly hesitating about this place. But the owner suggested Stir fried crispy duck, it was amazingly good. Kao Soi which egg noodles with yellow curry and coconut milk (Thai Northern dish) was very good. Stir Fried beef and basil was excellent.  We asked the owner why they don't have some dishes that Thai usually order. The answer is because they do everything from scratch so they only limited dished that they make best. Recommended to everyone."], ["Lee H.", "We have been eating here since shortly after they opened and have enjoyed watching the changes that they have made to the decor.  These people are great and we are so lucky to have them in our neighborhood. We try to eat there or have delivery about once a week and we have never been disappointed....going again tonight"], ["Kristi M.", "Really great and they deliver to Kennedale! This is a dangerous fact for us! Food was great... I had volcano chicken and my husband had the duck."]], "Thai Tina's": [["Cara B.", "I was staying at the Embassy Suites Hotel on business earlier this week, and arrived late in the evening--tired, hungry, and in need of a good meal and some peace and quiet. Not wishing to walk far, I drifted over to Thai Tina's, directly adjacent to the hotel, and plopped down. A server arrived quickly, and within minutes I was enjoying THE most FANTASTIC Chicken Coconut Thai Soup on the planet. My world was transformed. It was simply the BEST such soup I have ever had (and I've lived and eaten all around the world for many years.) Savory, opaque, with a subtle and wonderful citrus edge, it's generously filled with fresh mushrooms, onions, and meaty chunks of flavorful chicken. Tina told me it's made \"from scratch\" and I believe her. I wanted to lick the bowl! Not kidding. Next, the fried calamari. TRY IT! It, too, is terrific. Crispy and fresh! And the little bowls of various dipping sauces are fun to taste.Everything was so good, I had to come back the next evening for more. I was not disappointed. Tina Steak was perfectly flavored and cooked. Sliced and placed on a bed of fried rice, with a side of salad, it was tender and lovely. Paired with a glass of Blackstone Merlot, it hit the spot and then some. To end things, I was served a Thai dessert (the name of which I don't know), that featured sticky rice (perfectly cooked) in white and brown and drizzled with some magical sauce loaded with flavor, vanilla ice cream, and juicy slabs of fresh mango. My head was exploding! So delicious.Tina herself, and her wait staff, are delightful, professional and a pleasure to talk with.Thai Tina's is highly recommended. I will go back each time I visit Forth Worth. Thank you for the experience, Tina!"], ["Joshua C.", "After walking around for a few hours taking in downtown Fort Worth and attempting to find a place to grab some grub, my wife and I ended up back in our hotel at Thai Tina's.  Yes, this is a restaurant attached to the lobby of a hotel which is 50/50 a recipe for disaster.  We were beat, our Seattle bodies and the 95-100 degree weather don't match well, so we decided to give it a shot and take it up to our room.I ordered the Panang Duck with no rice and extra veggies and my wife ordered The Bounjay (see menu for specifics on each dish).  We had planned to order a separate appetizer, but upon seeing some of the items being brought out of the kitchen for other diners, we figured the amount of food would be fine for two people looking to share.The food came out quickly, about 10-15 minutes after placing, and we took it up to the room.  We discovered that Thai food is a bit of a pain to eat/share in a hotel room with no real plates and plastic utensils (the sauce...what a nightmare!).  Regardless, the food was tasty.  I'm used to Japanese curry, so it always weirds me out a bit when I order a curry dish and the curry is \"liquidy\", but the Thai flavoring is so good it hardly mattered.  I definitely preferred the duck dish to the Bounjay, but both were good (and of course, my wife preferred The Bounjay, who'd have guessed?).  The only part I didn't like - they gave us both rice and ignored the request for extra veggies.  We didn't complain because we were hungry and the rice was surprisingly moist/sticky (also something I grew up with), but there really wasn't much of an excuse for the waitress (owner?) or kitchen missing this request as the restaurant was fairly dead at the time.  A quick note about the prices - I'd say it's fairly priced for downtown Fort Worth for the quality/amount of food.  It was one of the better value meals we ate during our stay downtown.  That said, it's more expensive than what I'd expect to pay for similar food locally in the PNW."], ["Tu H.", "This place is horrible.. from service to food. I will not be back here and wouldn't recommend this to anyone. First off, the service was very slow and the servers seem to not know the menu very well. They were confused when bringing out the food. For food wise, it was just plain horrible. The Thai teas were ALL watered down and so was the coconut water. Food wasn't any better either, I had gotten the Thai wraps which is basically a freaking pad Thai wrap in a burrito. I honestly didnt even know how to eat it. It was way too sweet. Pad see ew had no flavor whatsowhatever. Curry was bland also. Overall,I would not come back here. This is NOT real Thai food. The price for this place is ridiculously expensive because the food just doesn't match up to it."], ["Preston P.", "I love Thai food and feel it was just so so. I have had better. The Tom yum was above average thought"], ["Em C.", "I walked in from the rain after getting off from my internship and was greeted by Tina herself and helped quickly. I sat at the bar and ordered a water and a chicken pad see ew, it took maybe ten minutes for it to come out and it was generous portion. It came out smelling amazing and looked amazing and wow it tasted amazing! I've had my far share of Thai food and pad see ew and this was by far the tastiest pad see ew dish I've had.The sauce was perfectly balanced and just sweet enough, the noodles were all covered in it generously and the veggies were crunchy which created great texture. If I'm ever in the area again if come back for sure to try other dishes but maybe just for the pad see ew....the sticky rice with mango looked yummy too though might have to give that a try too."], ["Celina B.", "I work in downtown and I'm Asian so I've been trying all the Asian restaurants around here. You have to valet (I think this was the best part of my experiences) they were super nice and friendly! Valet is complementary, just tip! I had the fried rice (pic posted) I have to agree with another yelper...it reminded of me jambalaya instead of the typical Thai fried rice. Was the rice jasmine? I don't how to explain it because I have never had thai fried like this. It didn't taste bad just different. Like they stir fried the siracha sauce into the sauce to make it red...I'm not sure. Just wasn't what I wanted. Waitress didn't know anything about thai food. It was my first time so I'm not sure if she was new. I asked her about many items and she was clueless! And my biggest complaint is the menu...Please re do the menu. It's complicated and why is the lunch special so tiny???? The pricing is not over priced for being in a hotel and in downtown but please make the menu easier to read. I probably won't be coming back I'll rather eat at Tie down the street on Houston :)"], ["Donna K.", "My son's rehearsal dinner was at Thai Tina's in embassy suites. A buffet was offered with her steak, jalapeño fried  rice, lamb chops,  sushi-me appetizer, Thai noodle with shrimp, calamari, crab cake, and melon for dessert with variety cheesecake bites. I was so pleased with the positive comments for all who attended. Ambience and service lovely."], ["Anonymous I.", "Found out today the owner keeps all of the waitstaff's tips . If you think you are tipping the wait staff, you are not. I will never dine here again. Owner is taking advantage of customers ignorance on her tipping practices and keeping the tips intended for the hardworking wait staff for herself!! Shame on you Tina. This may also explain all the negative reviews for slow service."], ["Paul M.", "Deliciously hot and spicy Thai food!  This restaurant is a gem hidden inside the downtown Fort Worth Embassy Suites.  Make the effort and eat here - WELL WORTH IT!  Great place to host a birthday party dinner - which we did for a dear friend.   Ask to meet Thai Tina herself she's a hoot!"], ["Glenn K.", "After getting turned away from simply fondue we gave this place a try. Wow, is all I can say great Thai food. Try the lobster fried rice its bomb.com. Owner works on site is attentive and quick with the best Thai food in Texas. My son had the steak and shrimp all that's left is an empty plate."], ["R V.", "Visiting the Fort Worth area found this place on Yelp! The food is delicious the service of as great. We def recommend this Thai place if your in the area! We had Pat se eww beef, jalapeño fried rice with chicken, Tom yum soup chicken it was all delicious!"], ["Chris B.", "This was an easy stop for me since I was staying in the Embassy Suites.  The dining room is TINY, though that wasn't a problem.  Only two other tables had parties.  The décor is nice, very elegant, though they ruin that by using paper table cloths.  It's the little things!I got decent service, nothing to remark upon either way, and the food came out quickly.The food let me down, though!  You have to get Pad Thai to try a Thai restaurant, right?  Well, I had maybe four little chunks of meat in mine.  Definitely not worth the up-charge to add meat.  Prices are just all around REDICULOUS, entirely too high, and skimping on the meat just made things worse.  I was served a plate with a pile of sauced noodles on the right, and all the veggies, etc, on the left.  There were no peanuts anywhere, which was odd.  The sauce lacked balance, with the sour notes dominating.  It wasn't unpleasant, just one-dimensional.  Noodles were piping hot and cooked perfectly, though.With a few adjustments, I think this could be a fantastic Thai restaurant, but as it is, it's just disappointing, especially for the top-dollar prices."], ["Suyen O.", "TO WHOM IT MAY CONCERN, THIS RESTAURANT IS LOCATED INSIDE THE EMBASSY SUITES HOTEL! IT IS NOT CLOSED! Now, for the review: Everytime I come to this restaurant I am delighted with the exquisite presentation and delectable taste of the food. Thus far I have tried the Panang duck, Tina's Thai steak, the Masaman Steak, Seafood Paradise, and Seafood Curry with Panang sauce. But my favorite is the Grilled Salmon with Avocado Panang sauce. I absolutely love the sticky rice and mango for dessert. I'm not quite sure why other reviews say that this place is closed, but it's not true. Also, the service has always been commendable in the 12 times I've eaten here. Don't forget to enjoy a cocktail or drink as you await your meal!"], ["Chris P.", "I'm so torn about Thai Tina's. The food is so, so delicious, but the service is so terrible. A long time ago, I learned not to go during lunch rush, so I usually go before or after (11 or 1). On more than one occasion, I've been literally the only person in the place and had to get up to refill my own water as servers were walking by, actively ignoring or otherwise not noticing me. Then I almost always have to walk up to the stand to pay when I'm done because there's nobody around to notice that I'm done. BUT THE FOOD IS SO GOOD, so I deal with it. Like I said, I'm torn."], ["Nicole F.", "I am giving their Jalapeño fried rice a solid 3 stars! It is good!! I go about once a month for it since its within walking distance from work. I can't say how the rest of the menu is since I've only tried one other item and I didn't like it. But I would recommend the jalapeño fried rice to friends for sure!"], ["stephanie k.", "Worst food ever! Food tastes stale and fried. Wontons are disgusting. Fried basil rice tastes the same as the fried tofu appetizer. Just a joke!"], ["Liz M.", "I did not have high hopes for this restaurant when I realized it was located inside of a hotel, but I could not have been more wrong!  The food was absolutely phenomenal!  The spring rolls were about the best I have ever had, and the calamari was wonderful.  I had the Massaman Curry for my entree, and it was so good that I ate the whole thing (which, after eating all the appetizers, was sort of impressive.  They serve a LOT of food.).  This may be one of the best Thai meals I have ever eaten!"], ["Elise H.", "Hidden Gem . . .My fiancé and I recently discovered this restaurant inside the Embassy Suites and we have gone back about once a month since! It's never crowded due to the location, the staff is attentive and super sweet, and the food is wonderful!! We have had five different dishes thus far and have enjoyed all but one - and the only reason this one wasn't a favorite was the lack of spicy heat that I can ask for next time. We will definitely continue to frequent this restaurant PLUS who can resist FREE valet parking in downtown Fort Worth?!"], ["Sirish K.", "HORRIBLE SERVICE.  Full of chaos. We went in group and they messed up the orders. Veg and non veg dishes were mixed. One person found scraps of metal in food and server agreed that it was from metal scrubber of  cleaning of pans. Will NEVER go again.Why should I pay gratuity of 18 percentage over this mess now."], ["Ashley V.", "Worst service ever!!! Not only did it take multiple calls to finally get an answer, but there is no one to greet you when you get there. On top of that it wasnt even busy so i have no idea why my calls werent answered!  I was told my food would be ready in 15mins. when i got there no one was around and when a girl finally came out, i told her i had a pick up order and she went in the back and took forever and when she came out,she just went straight to serving other people. no acknowledgement or updates on my order. I ended up waiting over 15mins. in fact im still waiting as i write this review. worst service ever! im never recommending or coming here again!"]], "Happy Bowl": [], "Bangkok House Thai Restaurant": [["Paul P.", "Good food and \"Mama Tiki\" is funny as hell!"], ["Tyra L.", "We just had our first dinner here.  We thought the food was excellent. The sushi was fresh, the roll was a very ice combination. Both entrees were delicious and a very generous portion. We will be back!"], ["Susan B.", "Is Mama Tiki serious? Authenic Thai food in White Settlement?! Freaking amazing! I'm Thai, myself, and her dishes remind me of home. The staff is so kind! Mama Tiki is a character. Her restarant is a dive, but I don't care, all her dishes are delicious and served in a big portion. Craving Bangkok House, right now!"], ["Carrie C.", "Mama Tiki and family know how it's done!! Hands down the best Thai you will find in The Fort! I tend to stick with what I know at Thai places, which means I get red curry chicken and chicken pad woon sen. Holy Toledo Batman, it is the greatest red curry ever, especially when it's dragon hot on the spice level. I think I might have impressed Mama Tiki ordering it that hot but I love it and it was gorgeous. I've yet to try the $7 buffet, so when I go, I order two entrees and an app for dinner. That ends up being three meals for me...one there and two at home, maybe more. And the curry gets better after a couple of days. When I order all that plus hot tea, it's under $23!! (And it's BYOB too)The prices here are great. The pure delight you get from experiencing the food is hard to beat. And the feeling of home you get from Mama Tiki and her family is priceless. I guarantee you will return again, and again, and again."], ["Truc L.", "Best damn $7 buffet in DFW. Always full of food, two soups, and bomb salad."], ["Linh N.", "BEST orange chicken I've ever tasted! Literally still sitting here eating and writing this review! This is my first time here, I was enthusiastically greeted by mama. This place is filled with regulars from as I can tell in my 30 mins if being here. You can feel the positive energy is this place, Mama is full of light and spirit!  stopped by only because I was starving and worked by here today, looked up on yelp for what's good around here, this place showed up. I don't live around here but I'll he back!!!"], ["Cathy H.", "Their free soup with dinner is awesome. Love their pad ke mow- the straw mushrooms are a nice addition to the usual. Their fresh springs aren't the best, because they are a little on the bland side, but that is ok with me bc their peanut sauce is good enough to eat on a tire. The buffet is awesome- I'd love to hate the orange chicken, but I LOVE that deep fried crack! : )"], ["Julie P.", "Decided to go here because of all the great reviews. Let me say that the Thai Tea was the BOMB!! I had the Khao Pad which tasted just like my mom's. my husband had the Pad Thai. That didn't tast like my moms. It was so so. We will definitely be going back. The staff was great."], ["Brian F.", "I really like Bangkok House. Mama Tiki is so much fun. The lunch buffet offers many choices, though I usually prefer to go in the evening when it's less busy and I order from the menu then. This is my favorite Thai place in the Fort Worth area."], ["Lydia A.", "So welcoming! spring rolls are wonderful, yum!"], ["Richard M.", "Looks scary from the outside, but the food is fantastic. Great orange chicken, great mussaman (?) curry, and good pad thai. Word of warning- I got the medium level of heat on the curry and it was comparable to hot at other establishments."], ["Mike M.", "Yep, it's probably my favorite Thai restaurant so far in the DFW area.  I haven't tried them all, but everything I've had here has been delicious.  The only minus was the fresh veggie spring roll--no shrimp or other protein, just veggies.  These were very fresh, but I prefer the Vietnamese-style roll.  (Maybe I should just remember that this is a Thai restaurant, not Vietnamese.)"], ["Fast e.", "This is a great mom and pap thai restaurant.  They have a lunch buffet for 7 dollars M-F. Orange chicken, beef salad, egg rolls, curry, a few soups to choose from,, Kai Pad Bai Kaprow, and few other authentic dishes.  They also have a great menu with many spot on thai dishes.  The couple that runs BH are very friendly and spend much of their time talking to guests. They make you feel right at home.  The only downfall of this place is the atmosphere.  It's located in a old shopping center and is outdated on the inside.  If you love thai food and excellent service I would recommend Bangkok House.  Don't come here if your looking for a modern asian fusion restaurant with black table clothes and a martini list."], ["Karena R.", "My husband and I are here visiting and our hotel is up the street from the restaurant. I am just getting into Thai food and although this place is not in the busiest of spots, the food is simply delicious. This appear to be a family ran restaurant, with a nice buffet selection. The service and price of the food was good! We would definitely eat here again!"], ["Margaret H.", "Love it, good food & neat  military family owned and associated!"], ["walper b.", "I love the buffet for lunch.  Black rice and coconut milk dessert is awesome!!!  the orange chicken is a family special recipe (i would lick my plate clean if I could get away with it)"], ["Lauren C.", "I throughly enjoyed our recent visit to Bangkok House! We got there the same time as the lunch buffet but we decided to place an order. I had the yellow chicken curry and my husband had Pad Thai. Yum!, this was among some of the best curry I have had ( and I love yellow curry!). This is the best place to go if you want Thai in Fort Worth."], ["Jeff N.", "We (my wife and two friends) stumbled upon this little gem in an unlikely spot on Cherry Lane near White Settlement Road.  It is a very small and cozy place with a nice little lunch buffet.  That day they had Tom Kha Gai and another broth based soup. The Tom Kha had a nice bite and was pungent with kieffer lime leaves, lemon grass and galangal. The yellow curry (offered with chicken or tofu) was excellent as was the kaprow (ground pork with basil, Thai chilies, fish sauce and other spices).  Seafood stir fried Thai style and Pad Thai were also very good.  There were a couple of other dishes as well including beef salad and Thai egg rolls, but I did not try them.  I was pleasantly surprised to see a large bowl of Pik Nam Pla (Thai chilies sliced in fish sauce) on the condiment table. For desert, I was able to try one that I'd seen but never tried. Sweet black beans with thick coconut cream to ladle over them.  It was a scrumptious delight and hard to stop going back for more! We spent quite some time talking to Tiki (aka Mama) and her hubby of 40 years.  They were wonderful people and Tiki's bubbly yet sassy attitude was infectious.  She insisted we try her home made Thai iced tea for free warning that we'd become addicted and would have to pay next time!  It was very good.  Hubby (sorry I forgot his name) said that the buffet changes daily and features a different curry each day (red, green, yellow, massaman, or panang). Mama added that she makes the curry paste from scratch which I believe is unheard of these days due to the tedious nature of making curry paste.  Since the number of patrons was small, they made moderate amounts of the dishes to make sure it was always fresh, but never let a pan go empty for very long. We got a drink and the buffet including tax - all for $8 cash. I think there is a small surcharge for using the credit card. We will be back!"], ["CAROL L.", "Met my daughter for lunch, we are always trying new places to eat.  We ate from the buffet, seemed like that was our only option.  Was a limited selection and we had a hard time finding something that was any good.  Left feeling like what a waste of money.  Owner running around trying to wait tables and cook.  This is one of those strip mall restaurants you should skip, no hidden treasure here."]], "TIE Restaurant & Bar": [], "Happy Bowl Thai Restaurant": [["Laura M.", "Wonderful fresh Thai food and a little Chinese on the menu. Hole in the wall place to eat so very casual. Service was very nice and friendly. Offered my small child different tastes off the menu. Been there three times and have experienced same quality product on each visit. Great portions and will be coming back for sure."], ["Matt B.", "Happy bowl is a great little dive thai place!  Great food.  Service was ok but everything was fresh and great!  Had the green curry w/pork.Decor isn't great but this little whole in the wall is great.  They seem to do a good bit of take out as well.If you're on this side of fort Worth it is worth stopping by."], ["Shannon S.", "After about ten more meals from here, I'm happy to give it four stars. It's authentic, and it's always prepared with fresh, aromatic ingredients. See my previous review for more delicious details."], ["Elain L.", "Had their chicken yellow curry (spicy level 2) and thai tea to go here! Both were standard, but great for its price and the amount of food they give! For cheap delicious thai I would go to this place! The chicken yellow curry had tons of chicken, compared to other curries that give you mostly potatoes.Only cons to this place would be the location. It's not in the nicest area of Fort Worth. However, the inside was clean and felt like a hole in the wall, mom and pops place!"], ["Leslie G.", "Happy Bowl Thai Restaurant is the epitome of the commonly used phrase, \"Don't judge a book by it's cover\". Both the decor and the location of the restaurant is run down, ragged, and out of date. However, the food is exquisite and well worth the brave journey into the unknown. I stopped by here with a friend after a work meeting. Undeterred from our sudden and insatiable craving for Thai food, we ordered the chicken penang curry and massaman curry. The curries were full-bodied, perfectly spiced, and the mirrored that of the curries that I had in Thailand. The portions sizes were large enough to where you get your money's worth but not too large where it compromises taste (read: diluted). I got spicy level 2 out of 5 and it was exactly what you would expect from an authentic Thai restaurant. Furthermore, they are cheap. I did not see anything on the menu that was over $15, although they could charge more and I would still pay.I highly recommend this restaurant to any and everyone! Don't be intimidated by the area. I would definitely come back if ever in this part of the state again. YUM!"], ["Frances F.", "My husband and I had dinner at Happy Bowl tonight and is was fantastic! The atmosphere has a cool dive vibe - you feel like you've discovered a hidden gem. And once the food gets to the table you know you've struck gold. I had the yellow curry with chicken (spice level zero) - it had just enough spiciness for me to handle and was delicious! My husband had the seafood panang curry (spice level one) - he practically licked his plate clean he liked it so much. The prices were great too - after tip it was about $30 for both of us. We will definitely be spending date night here again."], ["Shelbie L.", "Okay.  For as small and plain this little place is, their food is AMAZING.  Every time I go I always get the Massaman Curry with chicken at level 2 or 3 depending on how spicy I'm feeling.  But seriously, I drive 45 minutes just to get this when I'm craving it.  I wish there was one closer to me though!"], ["Eunice Sugisawa S.", "Waited a long time to get two noodle dishes. ... and Pad Thai didn't taste like Pad Thai. They made it way too spicy and I can only taste the spiciness with no sweet peanut sauce.Place is very old and discusting.Not recommended if you are looking for an authentic tasting Thai food."], ["Brooke H.", "My family loves Happy Bowl! The food is amazing and the staff is super sweet! The restaurant is a hole in the wall of a strip mall off white settlement...nothing any kind of fancy. We typically order it take out style but have eaten in a handful of times as well. My favorite is the chicken pad Thai (huge portion - can share easily) and my boys (age 4&5) love the pineapple ckn fried rice (also huge portion). I haven't tasted anything I haven't liked so far. Prices are great, too!"], ["Parissa M.", "So delicious! I highly recommend. I ordered the pad thai and coconut soup.  I've eaten at different thai restaurants and this is by far my favorite. The plates are big enough for two."], ["Jessica N.", "I came here for lunch with a friend - heard their food was really good and wanted to try it myself!This is a hole in the wall Thai place out on White Settlement road - the owners are very quiet and humble people.  The lunch specials all come with salad, a spring roll or fresh veggie roll, fried/ white rice, and the entree for around 6.95 - a pretty good deal if you ask me!  The spring roll was nice and crisp - just how I like it and the peanut dressing on the salad was tasty and sweet.  I got a level 3 spice on my pineapple curry and it had a lot of kick!! The curry was very flavorful and I had a ton left over.  Unfortunately when I went to pay at the register, my bowl was swooped away before I could get it to-go!!  I really want to try their pad thai next - I usually try the pad thai on the first go around at Thai places but this curry sounded too good to pass up - especially because I was in the mood for a dish with broth.  I definitely would recommend trying this place yourself and lunch is a great affordable option!P.S. We were only given a lunch special menu - I am sure you could ask for the regular menu but just a heads up!"], ["Alexis S.", "Great Thai restaurant! Curry is amazing and huge portions! Be ready to take extra home!"], ["Rob A.", "I find it very sad that \"Jason A\" has chose to post a negative\" 1 * \"review of Happy Bowl based \"solely on his last visit\".  I also find it appalling to accuse the owners of doctoring or manufacturing false reviews.  I was the patron who first showed them their yelp page and can vouch for the honesty and integrity of the owners.  Happy Bowl has earned their rating by preparing fresh food that tastes fantastic.  There are an army of regular patrons who frequent this establishment and it is sad to see that a few folks with a hidden agenda are trying to tarnish the reputation of this great little restaurant."], ["Thy T.", "My friends and I came here for lunch after seeing decent reviews for this place. I have never been to this part of town so as I was driving here, I would have easily missed it if it wasn't for my GPS. It is a hole-in-the-wall restaurant but at least parking wasn't a big deal. We must have missed the busy lunch time (we arrived at 1 PM) because there were plenty of seats available. When we sat down, there were menus already laid out on the table which was nice. It only had the lunch menu so that made ordering easier. I ordered the spicy basil noodle which came with soup (or salad). To be honest, I had better noodles at other Thai places. The noodles were a little too soft and oily. My level of spiciness I had was a 3 and that was the right amount of spicy (I can tolerate spicy food more than most). My soup was coconut-based; I thought it was a tad too sweet and wanted it to be more sour. That's my preference of soup though. My friend's yellow curry was pretty tasty but you have to eat it with rice. Otherwise, it might be a little too salty. Overall, our waiter was really nice but their service is not impressive. It's decent for quick Thai food but a little out of the way to come here."], ["Jennifer C.", "Amazing Thai food!! I love everything about this place and it's sister restaurant Happy Bowl Too :)"], ["Ryan F.", "Wow!  This is my favorite type of place- unassuming hole in the wall with amazing food. I had the atom Kha soup which was the freshest I gave ever had!  Sliced ginger in the soup. Next the massaman curry was fabulous. Be careful in the spice, thus is the real deal. Don't be scared from the neighborhood or the outside if the Restaraunt. The food is incredible!"], ["Jon P.", "Not the best for Thai food.  What I liked best was the crunchiness of the cooked vegetables. Also, their tofu was quite good. The price is very reasonable.  Their springroll was predominately lettuce.  The food lacked spice.  It was actually quite boring.  I had to really laden on the Sriracha sauce to get any heat.The restaurant itself is very cluttered behind the counter.  I wondered what the past health inspection results were for this restaurant.  Think hole in the wall. For me, it was a place to try once.  I don't think I'll be back."], ["Kevan O.", "The staff is really nice, and the pineapple fried rice was great.  I was surprised by the prices, I thought they were too much, until I got my giant plate of food."], ["Richard G.", "We had the lettuce wraps for an appetizer...very good.  For our main meal we had green curry, and it was delicious.  The portions were a lot, the spiciness was just right.  I liked that it's hidden, and away from traffic.  I think we will be coming back."], ["Sarah D.", "Do not be put off by the appearance, this place is the bomb! Their curries are incredible. Service is very warm and friendly."]], "Pan Asia": [["Emily B.", "I ordered a few different things tonight to try this new place out. Everything was pretty good. The service was a little slow, but everyone was really nice and accommodating."], ["Kristin W.", "I ordered delivery and it was great! Large portions and very tasty and flavorful. The food arrived fairly quickly. The menu they have offers a wide variety of Asian cuisine (hence the name) and *they offer coupons* on their website! I will definitely order from here again."], ["Greg H.", "First time trying Pan Asia in Fort Worth. I usually tell the waitstaff to \"surprise me\" where ever I go eat. The Thai Basil Chicken was a pleasant surprise. Fresh veggies, just the right amount of heat and full of flavor. The chicken was of good quality. Also enjoyed the Oolong tea, fried rice and egg roll. Casual atmosphere and friendly staff. We order take out at the office for lunch fairly often and this will certainly be in the regular rotation."]], "Thai & Fusion Ave": [["Susan P.", "The Tom Kha soup was AMAZING!  One of the best I have ever had!  The mango sticky rice is absolutely delicious.  We will be coming back very often!"], ["Carla B.", "This place is Gross... I ordered chicken fried rice and a spicy tuna roll. The fried rice had no flavor and chicken was bland. The sushi was not fresh... To be exact the tuna was ~2 weeks old.. I should have known better when all the other eateries were packed and this one was empty when I arrived. I politely asked for my money back.. I work to hard for my coins to pay for garbage!Good day!"], ["Anh N.", "As soon as you walked into the door, you feel instantly welcome by the servers and the manager there. Even though we came in 30 minutes before they closed, the manager was still willing to take us in and serve us. The foods were all delicious. You might think sushi at a thai restaurant would not be as good compare to the japanese restaurant , but your tastebud would be in a surprise once you try the sushi at Thai and Fushion ave. I got the yellow curry and the curry was perfect. Not too sweet and there was not too much spice in it. Overall it was a \"fushion\" in my mouth. Cant wait for the mango sticky rice to come in season."], ["Chris P.", "So we stopped into this happy little place on an off the beaten path excursion to strip mall shangri-la. While looking for something a little bit different, we stumbled in for a late lunch to a sparse crowd that ramped up to full-blown busy in almost no time. \"Thai AND Sushi?\" I thought...This could be interesting. You can do Thai well, you can do sushi well, but the odds of doing both well I would say are usually pretty slim. Don't get too distracted, you know? Here's the thing though - judging from what I had, they actually seem to do both really, really well.We had the pad see yew and some assorted sushi and sashimi -- most notably the \"mountain roll\", which we discovered was aptly named because it's quite literally a mountain of a sushi roll. The fish was really fresh. The noodles in the pad see yew were soft and cooked perfectly.And an interesting factoid that we found out from chatting with the owners when they came by was that their sushi chef actually spent several years as an executive sushi chef in Thailand, and seems to know what the heck he's doing and then some. Interesting find."], ["Chavalit P.", "Last week I went to Sammoon on 35 North for pickupMy special order,  I found Thai Restaurant Next toTuesday Morning at Sammoom Plaza.I like to let you know they have pad Se Eew noodAnd Red curry that I ordered were deliciousI am going back next week for try other Thai dishesBia"], ["Shea W.", "This place is amazing! I noticed it when I was out shopping this morning and my boyfriend and I tried it this afternoon. I got the Pad Kee Mow (drunken noodles) with beef and at the Thai spicy level. My boyfriend got the King fried rice with chicken. We shared a Thai tea. It was all delicious and the place was very clean. We will definitely be making this a fairly regular place!"], ["Lexi R.", "AMAZING!  My hunny and i tried the spring rolls with peanut sauce and they were delish. Then we split a Mountain Roll and holy flavor explosion! When I took a bite, it was sweet..but then it was SO refeeshing and light...with a lemony taste. We also tried the pineapple fried rice. That was sooooo good as well. I feel comfortable recommending this place! Oh and the staff was so great as well. Thank you!"], ["Sheila M.", "I've been to here quite a few times and can honestly say, food quality wise, I've never been disappointed. I've tried a couple things, but the Pad See Ew is my absolute favorite (and tops any other restaurants' Pad See Ew I've had in the past couple years). The veggies are always fresh and the staff is always friendly. Clean, cute, welcoming atmosphere. My favorite \"eat lunch and read a book\" spot.The ONLY reason I knocked off a star is because this family-owned restaurant is occasionally randomly closed. Sometimes it's a day or two, once it was almost 3 weeks. After that longer span, I asked the waiter about it and he explained that the family was out of town for a while.Highly recommend checking them out, but maybe give them a call first."], ["Alex N.", "Nice cozy and clean dining area. Combination Pad Thai was pretty good. Not spicy at all, so if you like spicy food, make sure to ask for a side of Sriracha. The portion was good and more than enough to fill me up. The Thai tea was delicious as well. We also tried the spicy Cali roll. It has a \"Thai\" taste to it. It was good, but not what I'm use to. Will be back for more Pad Thai and Thai Tea! Almost forgot, they use crushed ice for their beverages which I always like."], ["Michelle N.", "I was really skeptical of the place because it was a fusion restaurant and I worked at an authentic Thai restaurant for over two years so I'm pretty picky on my Thai food! I ordered the massaman curry and It was pretty good! I haven't tried their sushi because there's mixed reviews (I also worked at different Japanese/sushi restaurants before too), but I'm definitely going to come back and try different dishes just to give it a shot! I'll let you know how the sushi is!"], ["Danielle S.", "Good sushi. The server had no idea about anything on the menu. She didnt speak english very well. We were the only people in the place at 7pm on Tuesday. I would go back. The food was delish."], ["Scott B.", "SLOP:noun1. Spilled or splashed liquid.2. Soft mud or slush.3. Unappetizing watery food or soup.4. Waste food used to feed pigs or other animals; swill. Often used in the plural.5. Mash remaining after alcohol distillation. Often used in the plural.When I pay $15 for a sushi roll, I expect the quality to match the price. If I wanted \"slop,\" I'd go to McDonalds and order a McGriddle. However, this evening, I was craving sushi. When Thai and Sushi Ave opened up just a few weeks ago, over in the ever so popular, and growing Alliance Town Center, here in N. Fort Worth (Keller), Wifey and I were cautiously optimistic that we might finally have a decent sushi restaurant here in this area.Back track a few days: I popped in Thai and Sushi Ave at lunch to grab a menu. When I got home, wifey and did a double take. Most specialty rolls are in the $15-$18 range? Now, I've owned a restaurant and bar, so I know pricing depends a lot of what your overhead is (e.g., rent, payroll, etc.) Now, since there were only 3 employees working, the payroll can't be high. Since it's in N. Fort Worth (not Downtown, or Southlake), rent can't be that high. Not to mention, the square footage can't be more than 2000, including the kitchen. So, we'll rule out overhead, and must assume that they offer a superb quality of sushi. Nope, we'll eventually rule that out too. Read on.My take-out order consisted of the following:1. \"Special\" Cucumber Roll $15   Tuna, salmon, crab meat, cream cheese wrapped with cucumber and house sauce2. Crabmeat \"Dynamite\"  AKA \"Slop\" (See pic) 3. 2 pieces of Tuna sashimi $53. Cashew Chicken $8 (Kid sized entree) The \"Special\" Cucumber Roll was decent, but nothing special. In fact, if there was a ray of sunshine in this meal, it was the cucumber itself. The tuna, salmon, and crab meat, was just a bunch of slop. Not quality *pieces* of sushi that most quality restaurants serve. Just mush wrapped in cucumber.The crabmeat 'Dynamite\" is as described. It looks like someone stuck a stick of dynamite in my \"to go\" box. Sushi nachos maybe. View pic and come to your own conclusion.2 pieces of Tuna sashimi. Not fresh, and not of good quality. To be fair, I've had worse {Cough Cough}  at Ha Na Bi (across the street).Cashew chicken. Americanized, and loaded with salt. Quite shitty, to be honest.$50 wasted. I would gladly pay upwards of $100 for good sushi. I do, quite often, in Southlake, or D/T Fort Worth. If you're going to charge \"Big City\" pricing, you need to serve \"Big City\" quality, or you'll be out of business. Quick! If you sell sushi at $6 a roll, I'd come here knowing that I'm getting a $6 roll. Hope that makes sense {Directing this to Owners of Thai and Sushi Ave}Fool me once, shame on you. Fool me twice, shame on me. There won't be a second time, so shame on you!"], ["Zack A.", "Absolutely Amazing food!  My wife and I had the Pad Thai with shrimp and the Pad Kee Mow with pork, level 3 spice and it was spicy and super yummy!  We also had the Mountain Roll, freakin' Awesome!  Found out they deliver also, Score!  We will be back:)"], ["Marcela M.", "Had the pad thai--was good and enough for two days. Came with soup too for the lunch special."], ["Steve M.", "Worst restaurant experience in a long while. The owner needs to get involved or do something here.I came in for lunch searching for something new in the Heritage Trace area. I only saw 4 people when I got there so thought I could get in and out and get some good food. The single person working the counter looked up briefly and after a few minutes came over with menus. I ordered one of the lunch specials and all seemed good but after 10 minutes, I still didn't have iced tea.She had been running furiously around, or I assume so since she disappeared for a while, and when I finally caught her attention and mouthed tea, she remembered. Too bad this meant she still had to brew iced tea. So, another 5 minutes and either the strongest lemonade or the weakest tea made it's way to my table.Another 10 minutes and then my meal made its way out. But, I ordered the mixed vegetables (including broccoli) with shrimp. I didn't see any broccoli so looked around for waitress. I watched the new customer who walked in for a take-out order peer around the counter for her food for 5-10 minutes before I decided to go ahead and eat what I was served because I wasn't going to be able to complain to anyone.  My lunch that I paid extra for shrimp had exactly 2 small shrimp and some chicken with the small portion. I caught her cleaning the table in front of me and mentioned the issue with my food and she \"guessed\" they made it wrong in the back. She did ask me if I wanted to say something to the cook but I was about work out. I did ask about the soup and salad that were supposed to come with the meal and she asked if I wanted to take it to go or wanted me to still bring it out. I was really so ready to be gone I told her don't tell the kitchen and bring the soup/salad out. I was almost done and watched the people sitting at the counter walk to the front door and open and close it several times hoping some bell would go off to call the person to the front again. They finally left disgustingly. I had a few bites left and had to remind her about the iced tea until I was the only person in the restaurant at 12:45. The food was actually flavorful though lots of other things need to happen in a restaurant for it to be good.I guess there is a reason why it was empty but don't know if people sick or new person with no training but I did see a manager looking person finally pop out but never said a thing to me or anything else in the restaurant. Hopefully when new owners eventually take over, this would be a place worth my time and money. An hour and a half I'll never get back."], ["Weston C.", "We had chicken Pad Thai (heat level 2 1/2) and it was phenomenal. We also had the JJ's roll, spicy tuna roll, spicy salmon roll and baked salmon roll. Everything tasted fresh and was brought to us in a timely manner. The service was incredible and everyone was very friendly. We will absolutely be back in the near future."], ["Diana N.", "I was really excited to try this place and now i wish i didn't. Pad Thai was too sweet, noodles seemed like when they boiled it, they did not rinse it?!?! It was so watery that I couldn't finish my meal. Plus the portion was too small for $10.  Our waiter messed up on our order, I ordered the Tom kha gai(coconut soup) and he put in the one with the noodles which I did not ask for. And we had to also pay $10 for that.. Didn't want to make a big deal so we just paid for it. He asked us how our meal was AFTER we were finished, and didn't refill our water as well. Definitely not coming back.."], ["J M.", "Visiting family in Fort Worth.  Stumbled upon this place and thought we would give it a try. Must say, we were not dissappointed. The was really good and service quick and friendly.  You can choose the spice leve.  My wife takes it toned down and I take it to the top, as did my son.  Food was good and reasonably priced.  We will be back!"], ["Nichole E.", "Best sushi EVER!!!! We sat at the sushi bar and I had the shrimp roll special and it was phenomenal. I also ordered theCrab Rangoon as an appetizer. Everything tasted so fresh and the cream cheese mixture was spot on. I could eat it every day. Finally, they gave us a sampler portion of their homemade shrimp cocktail and WOW - I don't even like cocktail sauce under normal circumstances, but their version was absolutely incredible. The wait staff was extremely helpful, patient and friendly. I would highly recommend this place to anyone."], ["Sumi L.", "We recently moved to the area and decided to try this place out based on former reviews when it was called, \"Thai and Sushi Avenue\". My  husband was right when he said, \"it can't be good if it's Thai and Sushi\". Since it got really good reviews, I thought, \"why not? let's give it a try!\". To start off, my husband ordered a rainbow roll. That fish did not look fresh. He said it was just ok. He also ordered the tom yum pork noodle bowl. There was nothing tom yum about it. We've had plenty of Thai food all over the DFW area, and we know good tom yum when we have it.I ordered chicken pad thai. (BTW, the description on the menu is wrong, it's basically the same description for the pad kee mao, which I had to confirm with the waiter and he did say that the person who made the menu did a horrible job and they were working on it). The pad thai was alright. I've had better, and I've had worse. The noodles were more of the thinner variety, which is ok...but it could have used more flavor. My sister got the Thai beef salad. First, the meat was not even grilled like it traditionally is, and it had like 5pieces of little beef. She literally had to dig around to find it. On top of that, they used cheap iceberg lettuce--and lots of it. It was lacking A LOT of flavor. We had to ask for limes to make it more sour (the sauce is usually salty, sour, and spicy) Needless to say, she did not enjoy it. For $10 it was straight up a rip off. My little cousin got the Pad Kee Mao, which had the most flavor and the best tasting dish, but she was complaining about all the oil it was cooked it. Yup...the bottom of her plate was swimming in oil. None of us enjoyed the food. We won't be going back. I kept telling my husband we should have gone to Sea of Siam instead."]], "Thai Select": [], "Muang Lao Cuisine": [["Carrie R.", "I really like this place for the following reasons:-Friendly service -\"outside of the box\" food, meaning that while they do have standbys like yellow curry, you can get something you probably haven't tried before...unless you happen to be Thai or Laotian -The chicken broth soup with onions that are somehow soft enough to taste like onions but not have the pungent i-just-bit-into-an-onion taste-REALLY good dishes-thai iced tea that's awesomeMay I recommend the yellow curry fried rice and the salad in Laotian style?  The salad in particular was unlike anything I've ever had but it was really good.Oh and one last thing, you will get 2-3 meals out of whatever you order.  I always do.  This makes the price (which to me is reasonable anyway) even better!"], ["Paul H.", "Quiet place in the middle of a generic strip mall in NW Fort Worth, just on the south side of 820. Interior is an open space with traditional Asian decor, booths and tables. I admit knowing very little (well, nothing) about Laotian food, so I stuck strictly with the Thai end of the spectrum for a first visit.Ordered the pad ke-mao (combination meat) with a \"3\" on the 1-5 hot scale (just right). The entree came with a small bowl of soup, a clear broth with a diced starchy vegetable (potato? jicama?) that was quite good. Also ordered shrimp spring rolls we split as an appetizer, served with two sauces (traditional peanut and a sweet/spicy chili sauce). My pad ke-mao was right on the money, large portion filled with pieces of beef, chicken and a fair amount of seafood (including mussels and squid). All the food was classic to style and delicious, just the right amount of heat. Service was patient and gracious as we lingered after dinner. Glad to find a reliable Thai place in Fort Worth. I'll have to come back just to try the Lao."], ["Olivia E.", "I agree with Dianna N, this place is definately worth five stars or more! Food is absolutely awesome. It's a mix of both Thai and Laos flavors. Should you feel adventurous, and want to try something above and beyond the usual Thai restaurants then come here. It's a nice mom and pop place. They are able to accommodate large groups if you come with family. Service was nice and fairly quickly. My only complaint is the loudness from the waitresses. Just because your family owns it doesn't mean you don't have to act professionally. Loud talking and laughing is very disturbing to me and the other customers. I will probably continue ordering to-go and taking it home to avoid the unpleasant loud talking. Do order the basil fried rice, it was very different and full of fresh flavors. I also recommend the lard Na seafood plate. Delicious!"], ["Rebecca T.", "We were going to head over to D Asian Thai .... and we did, but assumed they were open yesterday night (they are closed on Tuesdays). So, we headed over to this place and I am glad we did! So good! I had the pad thai spicy level 3... nomnomnom! So good! I almost ate it all within 1 sitting. My husband had the yellow curry spicy level 4 and a coffee. We are both in love with this place and definitely plan on going back. It is very nice inside, clean, large, not cluttered. We went in and ordered our food to go around 7:30 and and left 10 minutes later. I'd say that's pretty darn fast. Good flavoring, perfect spice levels. I already want more for lunch today!"], ["Theresa L.", "The food was amazing! We got the chicken pad Thai, crab Rangoon (my favorite), and yellow curry. I would give this place 5 stars but unfortunately I found HAIR in my curry right when I opened my container. So I didn't have the chance to try the yellow curry."], ["David V.", "This is some authentic Thai/Lao cuisine. One of my favorite spots, and the construction being done on 820 makes it better.We came for lunch and ordered the red curry and the yellow curry. My yellow curry contained onions, carrots, potatoes and beef, liked it a lot bc it wasn't filled with so much vegetables like you find at some other places. The red curry was simple as well, but had egg plant which was delicious. Both were really good and had the right amount of spice. The lunches also came with some clear soup or spring roll. We chose the soup. The clear soup was really good on a cold rainy day very light and flavorful. We had also order the crab Rangoon as an appetizer. These were good because they were not really crispy but more crunchy, didn't taste like the wonton wrapper was soaked with oil, which was a good thing. The only bad thing I can say about Muong Lao is I wished they had more desserts. Overall I really enjoyed it and think they have some of the best curries around."], ["Sandy N.", "I was craving some Lao food so we drove up here from our trip to Dallas to get some.  The food was good and tasty. It satisfied my cravings. Being Laotian, I tend to compare all the foods I had and make."], ["William B.", "Try all of the currys! The Thai red curry chicken is the best I've ever had. Every plate is beautiful and delicious."], ["Tom C.", "This restaurant is the best Asian one I've ever had out of 100 others, the food is so amazing and consistent all the time, kudos to chef. One other thing to add is that they got some new waitresses recently and they are like angels, so beautiful and friendly. No one can get disappointed here!"], ["Jason T.", "I went here with my wife and two young children. The interior was neat. I ordered Pad Si-Eiew with #2 of spiciness out of 5. My wife ordered Green Curry with #2 of spiciness, and we got Pineapple Fried Rice for our child. (We first ordered Orange Chicken, but they ran out of it.)  After we placed the orders, they brought out chicken broth soup. There were horse radish and green onion in it. It was pretty good soup. My Pad Si-Wiew was good, and it was good level of spiciness....except the dish was too sweet for my taste and a little too oily. My wife said her green curry was pretty spicy for #2 spiciness, but it was tasty...except again it was a little too sweet. The pineapple fried rice was also good but too sweet and oily, so overall, those three dishes were good but too sweet. The portion was great  for the price.I think we will come back to this place to try noodle soup and salad because those dishes simply looks delicious in pictures."], ["Phil H.", "Awesome little Thai place tucked away. Love the food and service. Very clean and nice feel in the restaurant. I would go here again and again!!! 2 thumbs up from this guy."], ["Patrick T.", "My default go-to for Pad Thai.  Short commute and friendly staff... nothing else to explain."], ["B D.", "Excellent food and a fantastic staff. They always appear to be happy and attentive. Additionally the prices a good and the quantity of the food is large portions. With they were open on Sunday's, but I can certainly understand a day of rest and worship . Great job team!"], ["Alyssa N.", "LOVE this place! My boyfriend and I order yellow curry fried rice from here all the time. Best Thai food place in the area!"], ["Sandy C.", "My best friend and i came to dine in around 4pm and the place wasn't busy. Our server was great! Super sweet and she gave us chicken broth soup on the house. We ordered the Pad Thai and Pad Ke-Mao (medium spicy). They are sooo good! Awesome authentic Thai food and reasonable price. Give this place a try. You'll be blown away!"], ["Jason C.", "Great food. We've been 3 times in the last month. We have ordered different dishes each time, and they keep getting better. The curry dishes are amazing. I've had the red and mussuman. Friendly service, and they take care of us. I highly recommend this restaurant."], ["Tram N.", "The servers are friendly and their food is delish! My favorite is the spicy chicken larb and spicy thum mush! Their chicken wings are pretty flavorful and crispy. This time around I got their kow poon nam seen and it tasted like Vietnamese bun bo hue. The seafood lad na was not my favorite. The sauce was runny and not thick like how I liked it."], ["David M.", "THE best Tom Kra Gai (chicken & coconut milk) soup ever!!!!!! It's real creamy dreamy coconut milk and not watered down like sooo many places in DFW. Also the best place for Maasaman curry (chicken, potatoes in creamy coconut milk curry). We've been eating Thai over 15 yrs and this is the only place that our family will eat Thai at. It's pointless trying other places."], ["I H.", "Excellent Thai cuisine in fort worth. Level 3 yellow chicken curry. Great portion size for lunch. yum! Will definitely be back"], ["Von B.", "This is my go to spot for when I'm craving some papaya salad or some larb! And I can't handle anything spicy unfortunately but here they actually listen to me when I ask them to not make it spicy I've been to some that never listen and they always make it to spicy for me. Everything tastes so fresh here"]], "Spice": [["Patrick W.", "Food was OK but not excellent.  A but pricy for what we got for lunch.  Not a place to which we will return."], ["Shane F.", "As you all may know, I absolutely love Thai food. I've reviewed a few on here, and whenever a new one opens up, I'm all about trying it out. So, when Spice opened up on Magnolia, I simply had to try it out. Going at lunch time with two friends and colleague, we were promptly seated in the (almost full) dining room. The design is rather sparse/modern, but was very clean and still welcoming. After perusing the lunch menu (dishes come with a spring/egg roll and salad), I settled on the red curry with beef. If a Thai restaurant cannot get something as standard as a red curry right, then I automatically rule out the rest of their dishes. Asking for a spice level of 4 (ranges from 1-5, don't go to 5 unless all you want to taste are chilis), our server promptly put in our orders. The dishes came out with relative speed and I can happily say it was one of the best red curries I've had in Fort Worth in a while. Delicious, coconut-y, with plenty of beef and vegetables, and served with a fair amount of rice, the red curry was fantastic. The spice level was spot-on. My friends chose the Pad Thai (spice 3), and the pepper chicken (spice 4). I usually avoid Pad Thai since it is on the sweeter end of the spectrum, but with the additional chilis added, the Pad Thai was amazing. The pepper chicken was also outstanding. I will absolutely be back again."], ["Rachael Z.", "The food is delicious. Probably some of the best Thai food I've ever had, but the service can be a little iffy, so don't go if you're in a rush. If you're looking for an enjoyable & leisurely night out with delicious food & wine, then this is the place."], ["Lucas R.", "This is one of the best Thai restaurants in Fort Worth. The ingredients are very fresh and not over cooked. I had the Pad Ginger with shrimp and it was fantastic. The shrimp was perfectly cooked and very fresh. My wife had the Pad Thai and it was also great. Their \"1-5\" scale of spice tends to the hot side, so ordering a dish as a 3 or medium is actually rather hot. Overall this is a great choice if you're looking for Thai in Fort Worth."], ["Humberto S.", "INCREDIBLY GOOD DELICIOUS FOOD! The service was great also. The presentation of the plates went with their taste. I strongly recommend the chicken satay apettaicer.As an entree I had the teriyaki chicken with brown rice:)Love it."], ["Tina A.", "Delicious new addition to Magnolia!The service needs a bit of practice. It's a new restaurant getting service and organizational legs for sure. There was some confusion on reservations and if my party of four could be seated right away or not. We didn't have a reservation but others who called in or something did. After we were seated, a bunch of people came in and they had long waits. Perhaps because of this the first waiter seemed to rush us to put in an order. We didn't. We asked for more time and we ended up getting back our original waiter, who was kinder. The checks took forever to come and I ended up getting up to ask for them. But the food is delicious and affordable. I will def be going again."], ["Jim R.", "A week ago I was trying to decide where to take \"mom\" out for her birthday celebration dinner and we found Spice on the internet. We love the Magnolia Street area and she loves Thai food so we thought we would give it a try. It was a Friday night and we are a big family with 5 kids so I thought they would never get us in at the last minute. They gave us a fantastic table and when some delicious appetizers quickly hit the table it was clear that we hit a home run for mommas birthday dinner! We had a Coconut Curry chicken soup to share that all 7 of us thoroughly enjoyed. There was a great selection of entree options for the various tastes in my family. The flavors were outstanding and we all enjoyed the meal. We had various waiters serving us as it seemed which seemed a little bit unorthodox but they very attentive staff."], ["Alexandra T.", "I haven't had a chance to dine in yet, but every meal I've picked up has been delicious. The interior feels a bit unfinished, but it's clean and bright, with an overall modern theme. Dedicated takeout parking is a plus."], ["Stacy F.", "yummy food great prices. Went on a sunday. I loved it. going back today. I got a curry dish level 2, just the right amount of kick. the spring roll was good.try the sticky rice desert, there's enough for like 6 people, to share. it comes with slices of papaya and the rice is flavored. very good. husband got pad thai and he liked it. also try the thai tea, its delicious."], ["Joseph B.", "3.5  everything was good, but not great.  oddly enough, one of the worst red curries i've had, but one of the best pad thais.  the red curry was not bad, because it's good stuff, just worst relatively.  if i worked near there, i'd be happy to go.  as i don't, i'll likely not return."], ["FortSki G.", "Great birthday dinner at Spice last night.  The service is still really off and sloooow but the food is dang good.  If you like yellow curry, I urge you to stop in.  It is also BYOB which is great for a group... you can also order from The Proper next door.   I believe there was a FW Weekly shoot there last night  - showcasing some of their specialties. Delicious."], ["Krista A.", "The food was good. Although my pad se ew noodles were basically bottom of the box crumbled noodle pieces. The flavor was still right on and the boyfriends lo mein was excellent. Definitely on par with Thailicious or Thai Palace.On to service. Not so great. Absolutely no communication between servers and staff. After placing our order for drinks some one else came back asking what we would like to drink. Shortly after drinks were served we placed an app order and once again some one else returned to the table asking if we would like any appetizers. A different person put app plates down and it wasn't until the apps were served and they started to put more app plates down that they realized someone had already brought some. Twice after we were finished eating someone attempted to serve us another tables food. This was during an early dinner with only 3 couples eating and one party of six. They definitely need to work on their service but the food has great potential. Hope this one can make it."], ["Patricia S.", "We showed up on a Sunday evening around 6:30 and closed the place down by 9, savoring our time and the good food. Very friendly and attentive service. I picked a dish I'd never had, a steamed shrimp and veggie dish on glass noodles with lots of ginger. Delicious and attractive. My husband's shrimp curry dish was also delicious and intense, and our friend's chicken and basil noodle dish with peanuts was a hit. The only disappointment was the appetizer platter -- a variety of ho-hum fried things without much flavor, and no peanut sauce for the two chicken sate skewers. Everything else was full of flavor and very fresh tasting.  A nice touch -- long after the plates were cleared and we kept gabbing, our servers checked on us."], ["Nicole F.", "I only wish I could have gotten fried rice with my cashew chicken.  Otherwise...AMAZING!!!!"], ["Dan C.", "Great food and I mean great!! However, the owner seems not to have fixed the wait staff hospitality. The only thing holding this place back is their lack of hospitality."], ["April Sunshine H.", "Went here with my husband and some friends for a Friday night. Everything we got was delicious! From apps, the Thai tea, and our four entrees it was all good! I got the spicy fried rice and loved it, but my husband was the winner or the night with his duck dish...so rich and tasty!You won't be sorry you came. Try this new place off Magnolia out!"], ["Stetson B.", "Let's be honest. Good Thai good is hard to find and a good dining environment to go along with it is even harder.  However, there is a new place that is getting both right!I work in the Southside and really like this place. Consistently good, clean and the people there are great. My go-to is the ground chicken with brown rice. Awesome!Stetson Brandish"], ["isha p.", "Service lower my rating. The food was good but the waitstaff was a jumble of good and bad. No one was great nor accommodating.  They serious need to do  better job about training and ensuring that everyone on their staff understand customer service.We had the \"beef jerky\" is was awesome. The BBQ pork was cook perfectly. Bacon wrapped scallops were cooked perfectly. The pepper steak was also great. We ordered level 3 and it was spicy but amazing on the basil beef. I'll go back DEF get reservations. There is no waiting area no hostess, that a bit of a drawback. And, it's  BYOB."], ["Yale Y.", "Excellent egg rolls! Best Thai ever!! We had the sticky rice with mango and fried bananas. Very good."], ["Ally D.", "Went to lunch with a party of 7. Everyone ordered something different, and everyone raved. Ginger chicken, pad Thai, egg rolls, Thai tea: all great. The lunch menu has lots of options and everything is $10. Each dish comes with rice (white or brown), egg roll or spring roll, and a little salad. Many of us couldn't even finish our lunches. Definitely well priced, fresh ingredients, delicious sauces, awesome egg rolls. Our waiter was a little clueless, but even so, we got out food super fast with no problems. I wish they had jasmine rice!!"]]}