{"China Pavilion": [["Courtney B.", "I've lived near China Pavilion for the last 15 years, and I can honestly say that I only go here out of convenience. You will not find another Chinese/Szechuan style place within almost 10 miles either way, and I ain't one for driving. If another one opened up anywhere NEAR this one, I would bet my left kidney that CP would lose enough business to force a change. Now to the actual food--it is bottom of the barrel mediocre. Just barely edible in some cases, average in others. I've tried all of their basic lunch fare over the years, and i have never finished any of their coated chicken combos because of their strange, \"off\" texture and smell. They come with sauces that are heavy and sugary, and I can taste no real difference between the honey chicken and the sesame chicken (save the presence of seeds) and General Tso's chicken. The one redeeming food they have is Lo Mein--not overly oily, but not dry. Lost of basic veggies. They do have good vegetable dishes and rangoon, so all is not lost. But on those days where I choose driving versus gambling, I avoid China Pavilion."]], "Peking Palace": [], "Panda Wok": [["Sabrina B.", "I love this place! It's my favorite Chinese takeout in town. Great service and great food!"], ["Shannon M.", "The customer service was nice so I gave an extra star. The egg rolls were really weird and had a cinnamon flavor on their crusty shell. The boyfriend and I couldn't even eat those. Another thing I ordered is chicken lo mein noodles and it tasted so much like fish that that the noodles were not even edible really. Besides that, the meat itself was really really good."], ["Heather C.", "Chinese is not really my cup of tea, so I was a bit hesitant to try Panda Wok. It came highly recommended though, was in midtown (always a plus for me), and had a ton of lunch specials in the $5.95 range. Since most fast food lunches are at least six bucks these days, I figured that it was worth a try. The menu is pretty basic and has most of the same dishes that are on every Chinese menu in town. The surprise was in the preparation. Lunch started off with an egg roll and your choice of egg drop, hot and sour or wonton soup. I had hot and sour and my husband had won ton. Both were delicious, well balanced and had some depth to them. My husband had Mongolian Beef and I had Hong Kong Chicken. The preparation of each dish was perfect. There was just the right amount of vegetable and sauce, and the sauces didn't rely heavily on sweet or spicy. There was also care taken with the decor so you didn't feel like dine-in was an afterthought"], ["Patrick C.", "A calm and clean environment to enjoy delicious foods. I would highly recommend this restaurant to friends and neighbors. :-)"]], "Da Fung Mei": [], "Kung Food Panda": [["Jeremy R.", "Delicious place. It's a takeout place only. It's clean and the kitchen is open. The dinner combos are a good deal.  You get an entree, egg roll and fried rice for about $7. The rangoons are typically delicious and the egg rolls are huge. Will definitely be returning."]], "Chin Chin": [], "Mr. Chen's": [["Lin G.", "The person who loves sweet and sour chicken and crab legs at a buffet is probably not going to be a fan of Mr. Chen's.  That's okay, whatever mashes your taters.Mr. Chen's is more on the authentic side of Chinese food.  I came here alone one day on a whim and decided to be unreasonable and order two huge entrees.  I got the eggplant with pork and the tofu and intestines.  Both were really good.  I preferred the eggplant dish because I LOVE LOVE LOVE eggplants.  The intestines dish was not as spectacular but still good.  It had more tofu than intestines and is a Szechuan style dish and am not a huge fan of the spices but I plowed through and inhaled all the intestines quickly anyway.  YUMMY intestines!  The food was pretty good and the service was really good!  Especially for a Chinese restaurant!  Bravo for them.  The owner (presumably) stood around looking at everyone like a proud father watching his children scarf down food.  It was slightly unnerving but I was too busy eating to really be bothered."], ["Janny C.", "My expectations for Asian cuisine may be too high for this city.It was good, solid food.The attached Asian Supermarket is a treasure trove.Cleanliness: very goodService: Meh (It was later in the evening and the staff seemed bored, on the phone a lot and watching sports on the TVs) They were quite friendly though. Food: Here is where I'm torn. It was ok. For this area and US (outside China Town) it is pretty high standard I guess.Overall: Recommended. (We will be back to try some more)"], ["Melly M.", "I didn't eat at their restaurant, only looked around at their store. Store seemed to be stocked with common Asian stuff, clean and no weird smell. Probably will try their food next time I'm in town."], ["Boon C.", "This is a Taiwanese restaurant in the Montgomery. The restaurant is a grocery store plus restaurant. It going to difficult for them to run out the material since they have the grocery store on the side. They have claim that they the biggest oriental market of the area. I can see not many people will be competing since there not much Chinese in the area. The restaurant side has great food. Tonight we have order the Spicy Beef Noodle Soup, Beef Shank, and the Morning intestine. The intestine is cook with Szechuan spicy sauce, scallion, and soft tofu. The food is served over a hot pot. Be careful if you reach the food in the soup sauce. They are temperature hot all time. Please let it cool down before eating or it will burn your tongue.  The beef shank is Ok due to it marinate sauce. I personally prefer it to sweet sauce over the sesame oil. The best dish is the spicy beef noodle soup. It came with braise beef serve with chop pickle veggie. Their beef is also close to shank area carry minor tendon. If you braise it correctly, it is very soft and it breaks easily with your tongue press the meat in your mouth. This is how good they are. I can come back to this restaurant to have this dish only. The restaurant is just across the Eastdale Mall. You will not miss it if you are travel at US 231. They have good traffic since some of the customer shop their grocery there and kill two birds in one stone with grocery and restaurant."], ["Tessarose C.", "I had a very good experience at this restaurant! My sister and I were visiting my aunt and she took us to Mr. Chen's. We ordered wonton soup, egg drop soup, some steamed dumplings, chicken lettuce wraps, the basil chicken, and the roasted duck and rice. We got our food very quickly and EVERYTHING tasted absolutely amazing! It tasted so authentic and good. The server was also very nice and attentive. If you are in Montgomery, Alabama don't even bother going to any other Chinese, Vietnamese, or Korean restaurant because Mr.Chen's is the place to go!!"], ["Penelope B.", "This is the worst bubble tea I have ever had in my life. It was like liquid diabetes. I could barely taste anything besides the sugar, and there was enough sugar for about a gallon of sweet tea. I could feel my pancreas cringing in horror and my kidneys crying out for water, my mouth turning itself inside out in the vain hope of escaping the overwhelming sweetness and keeping my teeth. I ended up not able to drink this. Why, why so much sugar? Why so much sugar as to make sweetness into a punishment?  Have I mentioned that the tea was too sweet?  Yeah.  It was too sweet.  My review is for the tea only."], ["Frank T.", "So bad I dumped it all in the garbage after just tasting this awful \"food\".  I purchased the Chicken and Vegetable along with an order of Pan Fried Dumplings.  Dumplings were mushy on the inside, tasted as though the Dumplings had been frozen and then pan fried, disgusting.  The Chicken and Vegetable had this weird gelatinous stuff stuck to the chicken.  I did actually risk taking a bite to taste it and now I regret that decision.  You have been warned, stay away from this awful dive.  Worst and totally unauthentic Chinese Restaurant in Alabama in my opinion."], ["Quoc-Nam N.", "Our last experience left much to be desired, but our waitress this time...AMAZING!!!We were promptly seated and our drinks came out almost immediately. We ordered General Chicken, Pineapple Shrimp, and Sweet and Sour Chicken. We also ordered a hot and sour soup & an egg drop soup. These soups came out within minutes with fried wonton. They were fresh, hot and delicious. Our waitress made a mistake on our order and promptly fixed it!Everything from this place is amazing! Our entrees came out fast, fresh and hot! Try any one of them and you will not be disappointed!"], ["Dave P.", "Awesome hole in the wall! In the corner of a mall lot that doesn't have a lot of traffic, so it's easy to pass by as a regular Chinese place. The restaurant is attached to an awesome little Asian market that we walked through after dinner. Very friendly and helpful staff seated us quickly. We had delicious crab rangoons to start, very fresh and flavorful. My wife had orange chicken and fried rice that smelled citrusy and was enough for two to share in itself! Was also great leftovers the next day. I had chicken lo mein, also very good and light, with a large serving as well. We loved the food and the service was really what put this place over the top for us. Highly recommended!!!"], ["John C.", "A group of us went here and almost all of our 8 dishes came out cold.  I was not impressed by the flavor at all either."], ["Mellissa E.", "Service is very friendly! The food was served piping hot and fresh ... we started with hot green tea and egg drop soup to warm us up on this cold day ... I had the Beef lo mein, the noodles were so good and comforting. I will definitely be back to try something different. Their adjoining market is also wonderfully stocked!"], ["Cody C.", "We stumbled upon Mr. Chen's en route to Panama City. What a gem! The food was excellent. We had Sauteed String Beans, Steam Buns, and MaPow (sp) Tofu. All were wonderful, leading me to think that everything here must be good. I'll be stopping at Mr. Chen's from now on."], ["Jon B.", "This Chinese restaurant was the worst place I have ever eaten. I took my family there for a dinner while we were on the road going to South Carolina. That place was half empty so I figured that the food would be good. I was definitely wrong there were no crab legs the peanut butter chicken was old and cold, there was no white rice, there was no sweet and sour chicken, there was no ice cream for dessert, and the waitress why's everybody is as if she was the sheriff of a prison breakout. I do not recommend going here to eat."], ["David H.", "Excellent. Very fresh. Easily the best Chinese food I've found in Montgomery. Try the chicken with black bean sauce and the small buns."], ["Annie P.", "Greasy and salty Chinese food.  Americanized in every way.  Drowned in sugar and soy sauce no thank you.  Haven't had Chinese food in about 3 years but entire family opted to eat plain brown rice with seaweed and kimchi at home while the Mongolian beef and noodles slid into the trash can.  That's how bad it was."], ["Jie Y.", "Price is so inexpensive concidering the amountTaste is autentic and above average:3.5 out of fiveAmount of each dish is very huge."], ["Jina W.", "My friend and I had lunch at Mr. Chens' Chinese restaurant in Montgomery, Alabama. We ordered our main course from the lunch menu and also ordered the steamed bite size pork dumplings as our appetizer. So we both literally had one dipped in their soy sauce dip. After I had my first one, although I thought it kind of tasted funny, I didn't think much about it and just went ahead and ate it. Then when my friend started to eat her second one, I got another one and opened it; looked at the meat; and, OMG!!! it was raw pork! I was so concerned about food poisoning and I asked the person in charged to look at the food. She apologized and offered us not to pay for our meals - she literally offered anything she could. However, she blamed it on their runner picking up the raw appetizers and how busy they were.I was so angry and disgusted, I did not even touch my lunch after that. Well to finish the story, unbeknownst to me, she asked my friend to pay for half of what we ordered. Really!!!!! Anyhow after about a day, I had food poisoning! Two strikes from eating there; I definitely won't be back for the third tIme..... Horrible! First time, the food was soooo salty, tasted like everything is mixed with soy sauce and teriyaki sauce, then now this, raw pork dumplings! If y'all are not convinced that this may happen to you, just be aware that when you order your food, especially when they are busy, looked at it very closely."], ["B S.", "This place will be a pleasant surprise to most.  Hidden inside a Asian grocery store even finding it is a surprise. Very good and authentic dishes, try something new!   The store itself is very well stocked and everyone will find something they just have to have.    My daughter says to try the bubble tea!"], ["Megan S.", "On the road, my husband and I spotted Mr. Chens restaurant. It had good reviews and sounded tasty. We were not let down! The lunch special can't be beat! Great food and great service. The market attached to the restaurant is an added bonus!"], ["Doug C.", "Best Chinese food in Montgomery.  We had lunch there and was pleasantly surprised.  We tried the black bean beef and spicy pork.  They were great.  Finally real Chinese food in Montgomery.  This will definitely be part of our lunch rotation!"]], "Yong Ye Buffet": [], "Top China": [], "Hunan Garden": [], "Panda Inn": [["Victoria M.", "I have been to Panda Inn many times due to my love of Chinese food. I have tried nearly every Chine place in the tri-county area and the just s one is one of the better ones. It is a bare bones operation so don't expect bells and whistles. Good food at a good price with respectful service.i recommend the shrimp chow mien"], ["Aling P.", "Food is good but very disappointed that I couldn't switch my green onions with white. Overall food was ok."], ["David M.", "I really enjoyed this place. They customized my chicken and broccoli order and cooked it up quick. Fast friendly service, good food, and a smile. What else can I ask for? I got stuck here because if my work, and the owner never pestered me or asked me why I was hanging around. I can tell they're authentic. Their receipts even have English and Chinese printed on em."], ["Ross L.", "I was excited to have a new Chinese take away 1 mile from the house...and was not disappointed.Located in the former Quiznos at Dalraida Commons(by Publix) Hopefully these good folks will beat the Quiznos curse, Or maybe they actually know how to run a restaurant.Classic Chinese take away ambiance, Some of the Quiznos hardware intermingled with the new Panda Inn logos. It appeared (and I'm hoping) this is a family operation, there did not appear to be any confusion behind the counter (unusual for new restaurants in the Gump).The menu is classic Chinese take away with everything you would expect to find. We sampled the pepper steak, chicken fried rice, sweet and sour soup, chicken lo mein, sesame chicken and chef specialty, Hunan double delight (beef and shrimp). Everything was better than expected and the bill was only $35 for all that food. Since Chinese food is always a favorite at my house, we will definitely be going back for a follow up. Their menu show a pretty righteous $4.99 lunch specials as well.My recommendation is to try them.All the best to my new neighbors at Panda Inn, see you for my next Chinese food fix."], ["Dan R.", "Service was somewhat slow but polite. Sesame chicken had one piece of broccoli, the photo has lots of broccoli. Sauce too sweet and overpowering. Rangoons not crisp, sweet inedible."]], "China Wok": [], "No.1 China": [], "China Chef": [["Samuel H.", "30 mins from order to delivery. Food was good delivered hot no complaints. The normal stuff"]], "East China": [], "China Sea Kitchen": [], "Mings Garden Chinese Restaurant": [["J.P. M.", "Okay no joke....best Chinese resteraunt I have ever went to. I have been eating here since I was just a kid, and ihave never had a bad experience. The owner is a korean man and is always at the front to welcome you with a smile. All the waiters and waitresses are dressed very nicely, and always there at your service. The atmosphere is very nice, feels like you took a walk through China after you left. The menu has e erything with a little bit of korean food also. There Chinese food is 5 star top notch best I have ever had. I recomend the jajangmyun. One of my favorites."], ["M.C. W.", "Whether Thai, Vietnamese, Japanese, or Chinese, there are not many Asian restaurants in Montgomery that I view with any enthusiasm. The Chinese food situation is particularly frustrating, as truly excellent Chinese cuisine is incredibly appealing, and would find a welcome audience in Montgomery, a city where even mediocre Chinese restaurants continue to thrive. But such is the situation: The Chinese restaurants of Montgomery are completely interchangable. Each restaurant offers the same dishes, cooked the same way, with the same flavors, textures, and ingredients. So if you're looking for a place to have a Chinese dinner in Montgomery, there are two questions you must ask.First, are you willing to drive 90 miles up the road for a meal at PF Chang's in Birmingham?If not, are you more concerned with getting the best price, or the best overall experience?If it's a good price you're after, you can do much better than Ming's Garden. But this restaurant has been in business for several decades, and in a city like Montgomery, there has to be a good reason for that. Here, it's consistency: From the service to the food, Ming's provides you with a solid experience every time. It's for that reason that Ming's is where I go when I want Chinese food here in town, and I would recommend it to others-- it's just unfortunate that Ming's is so heavily outclassed in every area by PF Chang's."], ["justin d.", "My family has been dining at  Mings for 14 years. The best Chinese food in Montgomery hands down. Flavorful, excellent service, and you leave feeling satisfied. The owner is like family. I live in Miami now but always visit when back home!"], ["Jay M.", "I decided to try Ming's based on the reviews, but I was very disappointed. I had the Steamed Potstickers (6 for $5.95) but they tasted just like the ones you get in a big bag at Costco. Nothing special at all. I also ordered the Kung Pao Chicken ($8.95) with fried rice. The fried rice was not fried at all, it looked like steamed rice soaked in soy sauce with a few peas and carrots. The Kung Pao Chicken was not spicy at all and was covered in a dark sweet sauce that was horrible. If you like those baby corn cobs, you would love this dish. Seemed there were more of those than chicken and I counted 3 chili peppers. Very bland. I would rather eat at PF Changs or Pei Wei so I know what I'm getting. I'll skip this one next time!"], ["Kelly B.", "The best Chinese we have found in Montgomery.  Everything we've tried has been very good.  Waitstaff are a little quiet but helpful if asked a question."], ["Robert B.", "In a city full of take-out chinese and chinese buffets, Ming's stands out as the best and maybe only real chinese food resturaunt.  I cannot be a critic of what authentic chinese food tastes like, but I find Ming's to be less greasy and salty than the other chinese places in town.  Ming's has both lunch and dinner menus and has enough room to host events in.  We've used it a number of times to host company events and birthdays because the food is consistently good and the service is great without charging you a ton.  If you're hungry for chinese food in Montgomery, this is the place to go."]], "Yeung's Kitchen": [["Dug F.", "We travel through Montgomery quite often and always stop here. The food is very good and the portions are generous. The service is really good also. Great value for your money."], ["Steven L.", "This place was awesome back in the day. Cheap, large portions, quick friendly service. Now, the service is still good, the portions still generous, but the food is just not good. My General Tso's chicken tasted bland (even though I ordered extra spicy) and like it was reheated several times over the last few days. I ate maybe 6-7 bites and quit. Even the fried rice had no taste to it. Hopefully it was just a bad day, but I doubt I'll be trying it again."], ["Austin C.", "A college student's perfect Chinese place. Super cheap but good tasting Chinese food. If you get their special of the day you can feed 2 people for like 5 bucks. No joke! I like the general tso's"], ["Greg D.", "Great food at great prices! They have the nicest crew in town."]], "China Dragon": [], "Asia Bistro": [["Benita D.", "Dim sum..chinese..Japanese..Thai..all great!  Many lunch specials including Be to boxes under ś8.  We tried 6 different appetizers and a lunch special...loved them all.  Two blocks from the huge AMC movie complex..great place for meal and a movie.  Next door to Sinclair ' s East...which often runs a wait...so if you can't or don't want to wait ...eat at Asia Bistro."], ["J T.", "Absolutely no comparison in my opinion - this is hands down the best Chinese food in the Montgomery area. The best hot and sour soup, and every entree I have tried is great."], ["Karen H.", "Absolutely the best restaurant in Montgomery for Asian cuisine!!!  From Chinese, Thai and Japanese dishes, there is nothing in the menu that isn't very good. Everything is cooked to order, so your entree is always fresh from the kitchen. It is a local owned family restaurant and everyone is very welcoming and accommodating to your needs. I love Asia Bistro!!!!"], ["Charlie G.", "Very friendly service - the waiter was very careful to make sure out food was vegetarian. The food was all good & flavorful"], ["Tracey G.", "Wonderful food, fast service, great lunch prices, a lot of variety, friendly staff, nice decor and very cozy. Plus my bf got to practice his Chinese."], ["Melissa T.", "The food is pretty standard Chinese-American fare (take-out) with your eggplant in garlic sauce and pan-fried noodles. The seafood soup is similar to the instant package soups. The dessert is the only part to look forward to -- the sesame balls filled with red bean paste.  If you've never had them, you must try one."], ["M E.", "This place was a nice surprise to us. We happened to be driving through Alabama and went to Yelp (of course) to find suggestions on where to stop and eat quickly while in Montgomery. So, the reviews led us to this wonderful place that could easily be missed. We were quickly greeted by a very nice older woman behind the bar and a younger female. They were very very nice! We were going to do takeout, but decided to sit and eat. We ordered  and received appetizers immediately. The eggrolls were good, but just beware...shrimp eggroll has pork in it, which I don't eat, but they exchanged it for a veggie springroll. Next our food came out. I got the Chicken Thai Fried Rice and my husband got the Curry Chicken Thai rice. First, it was a lot of food. Then with the first bite, I could see why Yelpers gave good reviews. It was delicious and hit the spot!This will definitely be in our mind should we ever return to AL (doubt it, but at least we know where to eat if we find ourselves there again)."], ["Aubrey S.", "Great service and very reasonably priced.  The decor is standard Asian fare and is laid out well for small or large groups.  The food was not so great - my Kung Pao had a funny aftertaste and the rice was a little mushy and stale.  A solid \"meh.\""], ["Robert M.", "The food here is always great.  We fed some out of town guests and they enjoyed their Thai and Chinese meals."], ["J M.", "Great food great service and very friendly staff.  the food is always outstanding!  The Mandarin shrimp is truly outstanding. The egg rolls are fresh, hot and crispy.  One of my favorite places to eat out in Montgomery."], ["Jason G.", "One of the best Chinese restaurants I've found in Montgomery.  I usually judge on the quality of a restaurant's Hot and Sour soup and this place has the second best in Town.  One of only two places I've found in Montgomery that even tries to make it correctly.  Cashew chicken, although not unique, was flavorful and satisfying, which is really what you want anyway."], ["Haitham B.", "Very friendly service and the price is pretty reasonable. I love their selection of Thai, Japanese, and Chinese entrees(especially Japanese clear onion soup). I will definitely be back."], ["James P.", "Not great, but it's pretty cheap, and the mix of cuisines allows you to mix and match at whim.  I prefer some tempura followed by a curry or one of the Thai dishes.  Seems to be family owned and presided over by a friendly if harried older Chinese woman."]]}