{"Buffalo Wild Wings": [], "Shashy's Bakery & Fine Foods": [["M K.", "Amazing eggs benedict! Love it!DO NOT order the fried potatoes. I think they are cooking them, and then refrying them later which leaves you with a two-day-old french fry taste. Very unappetising. I have brought this up with the wait staff so hopefully they will improve what is otherwise the best breakfast experience I have had in Montgomery, AL thus far."], ["Laura B.", "More of a diner than a bakery. Not what we were expecting at all.  The place looks like a European bakery from outside and is beautifully decorated on the inside, but they only serve black coffee (no cappuccino or macchiato or cortadito).  The baked goods are very American - cinnamon rolls, chocolate chip cookies, frosted cookies, Danish, etc.   The cinnamon roll was warmed up in a microwave making it hard.   I wouldn't come back, but maybe their breakfast is good."], ["Asia B.", "I ordered lunch here a few days ago for carry out & I was very disappointed. The food was not what I excepted. Also, my order was wrong & my special request were not made. The customer service also is below average."], ["Vince H.", "The cinnamon rolls were on the extra sweet side but still pretty good. I  ordered the western omelette and it was good. My wife ordered the corned beef hash and that was awesome! I kept asking her for bites every chance I got. Service was good and the waiter was attentive. Definitely a go to place for breakfast!"], ["Elizabeth B.", "Food was good when i first visited after seeing an article in Southern Living. However staff was not friendly. I kept going back because like the design of the place.  However,  I will never go back. Owner was angry when I questioned meal.  And i don't need to pay for rude servers and owner."], ["Danielle M.", "Bummer! We tried to stop here, hungry and excited after seeing the space, the food pictures and reading some of the items on the menu, only to find it was closed on sunday! Guess if we ever find ourselves in Montgomery again, we will try it out."], ["Ken C.", "This restaurant was a very nice place to stop for breakfast. The restaurant was very quiet on a Wednesday morning, but I'm sure on the weekends for brunch it's packed. I had the ham and eggs breakfastwhich only had about of third as much ham as the picture on their yelp page but it was good nonetheless."], ["April H.", "I went here for the first time today. The waitress completely ignored us. After 6 people who came in after me got their food, I asked about my order. The waitress smirked and said she would check.I am always polite to wait staff, and nothing justifies treating a customer this way.Shashy's, you fail. You need to take a class in southern hospitality."], ["Andrea L.", "Really enjoyed lunch here a few weeks back. The sandwich I had was good but I was unimpressed with the fries green tomatoes (very few to an order and nothing to write home about). The baked goods, however, were wonderful and the venue is incredibly cool. Waitstaff was friendly and helpful."], ["Melody L.", "Shashy's is the sweetest place. Upon being told that I was going to be in Montgomery, AL for two weeks for work, I honestly did not have high expectations for my time out here. But I've been pleasantly surprised by the restaurants I've visited. Shashy's is definitely one of them. They're open until 5 pm Monday through Saturday and can't recall their times for Sunday, but feel free to give the shop a call. I did one night around six-ish and had a pleasant conversation with Jim Shashy. He told me to try to make it in, and if I did to make sure to ask for him just so that he knew I followed-up from my phone call.Anyway, I had an order of the fried green tomatoes eggs benedict with a side of cheesy grits. It was delicious. The fried green tomatoes were coated in a tempura batter and then fried. The light breading very well complimented the delicate nature of sliced tomatoes. I'd probably get potatoes instead of cheesy grits the next time around just for more variation in texture of the overall meal, but still, it was very tasty and only $10.After eating breakfast, I couldn't help myself but to take a gander at the baked goods. I helped myself to a mini cinnamon roll and a mini pecan cookie. They were SO good, and I loved how they offered most pastries in a mini size as well as a regular (super large) size. Quality was not sacrificed in the mini versions.If I lived in Montgomery, I'd definitely be a regular here."], ["Brad S.", "If there's an confluence of restaurant styles odder than Lebanese and Southern, I don't know if I've found it. And while the breakfast at Shashy's didn't really give me an opportunity to try the former, there was enough of the latter to make for a pretty great breakfast.Pancakes and waffles are too boring; I'm a Benedict man, through and through, and my mind sparked at the opportunity to try a fried green tomatoes version of the dish. I didn't realize that the presentation involved substituting the FGTs for the English muffin, which put me off a little bit because the muffin is an important part of the ensemble. All was not lost, however, because one half of the muffin was still included off to the side. The other problem with using the tomatoes as the base was a truth that seems to elude many cooks: putting a liquid on top of a fried food ruins the crust, taking it from crunchy to soggy in the blink of the eye. A liquid, say, like a thin hollandaise sauce. It's too bad, because the one corner of a tomato that wasn't doused was pretty well done. Still, the dish on the whole was enjoyable, thanks to the flawless poached eggs and wonderfully crispy bacon. Paired with some cheese grits and a cup of coffee, it was a great way to start the day.I was swindled into buying a bag of cinnamon rolls. It's not my fault - they were sitting on top of the bakery case, right next to the register, and they were only like $3 for a dozen baseball-sized glazed bits of goodness. There were plenty of other things from which to choose, too, like the world's largest bon bons. Between the food, the bakery, and Sashy's location in the Mulberry shopping district, you'd be hard-pressed to find something to complain about here. So don't."], ["Ray Q.", "The best breakfast I've had in a long time and the atmosphere was classy.The special are awesome and they have a nice variety.The Eggs Benedict on English muffins with hollandaise sauce and fried green tomatoes with smoky bacon were great.The city ham with scrabbled eggs and was fantastic as well. The ham was so big it took up half my plate and tasted great with saltiness to match.The parking here is very busy and can hold about 20 cars or so. Parking in the street is an option.I am a fan for breakfast definitely."], ["Trey-Jen M.", "to start, food was not bad, except for the pancakes (likely out of a box). unacceptable for a place like this. timeliness, horrendous for breakfast, hour or more with 4 tables in front of us. at least 2 groups came in after, served first, paid, and left before we saw food. waitress unfriendly, other waitress unfriendly. 8 orders, 3 wrong. spilled coffee, no apologies. no apologies for wait. only responded when spoken to. it appeared as though there was zero management. maybe the place recently changed owners? will never go back and would never recommend anyone go. plenty of breakfast options with a smile around here"], ["Angela M.", "Thanks to Yelp for pointing me toward Shashy's for delicious breakfast! We stopped in on our way through Montgomery, the halfway(ish) point on our drive from Atlanta to Gulf Shores.  It's easy to find off the exit, and at 8am on a Friday, there were only a couple other parties inside.  The seating is comprised of a few booths, but mostly 4-top tables.  They do have high chairs.As others have mentioned, the menu is small, fitting on one side of a 4\"x 10\" or so laminated sheet of paper, but everything is well-executed.I got the 2 egg breakfast with scrambled eggs, link sausage, grits, and wheat toast.  The grits were creamy, buttery, some of the best I've had in this setting.  Al the other items were tasty, too.  My husband got the corned beef hash, which was made from scratch, and so yummy!  Even our 10 month old loved the few bites that my husband was willing to share.I, too, would describe the atmosphere as upscale diner, with easy fast service.  Pay at the counter and try not to be too tempted by all the baked goods in the cases.#Yelp365 - 281/365"], ["Darren R.", "I have been to Shashy's  a bunch of times while staying in Montgomery this past year and always enjoyed it.  I am moving Monday to NC an decided to go there one last time today for lunch. Unfortunately, not only was the food really bad, the service was worse. I ordered the twice marinated chicken sandwich, which was tasteless and the bun was so saturated with grease it was inedible.  I wound up just eating the sandwich filling with a fork and knife. I won't go into great detail on the bad service. The waitress wasn't rude, but she just kept messing stuff up, forgetting to bring items an didn't bother to check to see if the food was ok.  All and all a disappointing end to my Shashy's experience."], ["David T.", "Food quality I would give this place a 5. Me and my girl went here on a Saturday for lunch and it was great food. Tenderloin sandwich was excellent. cheese and ham biscuit was great too. The Reuben was awesome as well.   Downside was the slow service. No one greeted us for about 10 min or took our drink order. never got a refill. For $30+ I would expect better service"], ["Katie B.", "I love Shashy's!  My friends and I go to Shashy's for brunch at least once a month.  I just moved to the south and have never had grits; after the waitress found this out, she brought me a sample of cheese grits along with the regular ones I ordered.  The food is great, the outdoor seating is great, and the waitstaff is great.  Go to Shashy's!"], ["Barbara W.", "Great lunch menu.  Get there before 11:45 or after 1 because this place fills up fast at noon. Fried green tomatoes are light any delicious.  Love the spinach salad.  Great tenderloin sandwich.  Good food!"], ["Jim M.", "I've always liked this place. I've had slow service but not bad service. It's good for breakfast and that's the only time I've been so far."], ["Melissa T.", "This is my favorite place for breakfast in Montgomery. A friend was visiting from out-of-town, so we wanted to take her some place local for southern breakfast. And Shashy's did not disappoint one bit. I ordered the scrambled egg casserole, which was divine. At first, it doesn't look too appealing since its a pile of mess on a plate. But once I took a bite, I didn't really care. The casserole was filled with a ton of ham and veggies. It came with buttered grits (you can pick between buttered grits, cheese grits or potatoes) and a cheese biscuit (you have a choice of cheese biscuit, regular biscuit, or toast). It was as homemade as you can get! My dining mates had the blueberry pancakes and the fried green tomato eggs benedict, which were both a hit. If you're looking for some authentic Southern breakfast, go to Shashy's!"], ["Jason W.", "Not being a Montgomery resident, trying to figure out new and exciting restaurants can be a bit of a challenge considering that few people from Montgomery have discovered the awesomeness that is yelp. When I started craving a good breakfast meal of eggs, bacon, pancakes, etc it was pretty tough finding anything other than chains. Chains are okay on occasion, but if you're just visiting a city for a short time there's just something wrong about not experiencing a locally owned establishment. So with the absence of restaurants on yelp, I googled a bunch until I found a tasty sounding restaurant called Shashy's Bakery & Fine Foods. In retrospect it was a pretty lucky find.Admittedly the location is a bit odd, with not much immediately adjacent except for housing and a \"Gun & Pawn\" garage. But don't let that deter you. The restaurant/bakery is in an updated gray painted corrugated aluminum siding building, but the owner has made an effort to fashion the interior into what I could best describe as an elegant art deco style diner. Their menu for breakfast and lunch isn't extremely long, but see that as a good thing, as they probably put more effort into quality than quantity. I went on a Saturday and they had a separate breakfast specials menu, off which I got a pancake breakfast plate (2 plain pancakes, 2 eggs, and bacon). They also offered blueberry muffins for $0.75 extra. Everything was delicious -  the pancakes moist and buttery (not dry and requiring bucketloads of butter and syrup like most places). The bacon was cooked perfectly - just a little crispy on the edges, but still chewy. The blueberry muffin was also good, with a slight cinnamon taste to it that was really, although I found it to be a bit crumbly for my tastes.Pricing was very good - the pancake plate was $7.95, and most other breakfast plates were around that same price, plus or minus a dollar. The service was exceptionally friendly and polite.Their baked goods are also very delicious, and the strawberry cupcake I had was a testament to that. Cream cheese frosting, real strawberries in it, and very moist. I highly recommend it!Overall, a great place to go for a weekend breakfast."], ["Matt A.", "Fantastic eatery for breakfast. I like to take business breakfasts here because they have the best blueberry pancakes in town. The omelettes aren't too shabby. either.The atmosphere is great too, reminds me a diner like you'd see in the movies, but think upscale diner without all the grease."], ["Deb L.", "Fine, fine fine and friendly!!! Great breakfast and service.  Quick jog off interstate if you are traveling. Coffee is good too! Must have a cinnamon roll for the road,,,,heated, of course. Had the veggie omelet partner had blueberry cakes. Everything YUMMY! Don't miss Shashy's, you'll be sorry ....."], ["Anne G.", "I love Shashy's. The breakfasts are just what you want to start your day. The lunches have great vegetables and sandwiches. The bakery produces some of my favorite desserts (try the chocolate eclairs!). I went with my mother and godmother this morning for brunch. My mom got the corned beef breakfast, I got the pancakes and my godmother got the biggest tenderloin salad I have ever seen. It was all fantastic.I sincerely recommend Shashy's for breakfast and lunch. Also, I just found out that they cater business events for large and small parties. I've had them cater an evening party before, so I'm sure the business lunch is great as well."]], "Mellow Mushroom": [], "Aw Shucks Oyster Bar and Grill": []}