{"Zoës Kitchen": [], "Taziki's Mediterranean Café": [["Ritchie B.", "It was a couple weeks ago that my gf and I ordered take out from Taziki's. At home, I felt like I wasn't sophisticated enough to eat my food \"correctly\". Thankfully, the food was delicious enough to compensate for my lack. I had ordered their Herb-Roasted Pork Loin, which included a side of grilled asparagus and Greek Salad. I also chose a side of new potatoes. Everything was so delicious! I recommend all of it. The only negative is that I wish there were more friendly smiles and eye contact from the wait and cook staff. I appreciate that they are busy, but it's important to remember that a good friendly feeling will make customers like me think more often of your restaurant with pleasant memories. When I tell others about you, I want to feel warm and fuzzy about the people who work there. It makes a big difference. You aren't just a chow line. Don't act like it. I recommend this restaurant."], ["Michelle P.", "We stopped here looking for a good option for gluten free food on the go. I also read through some of the yelp reviews. Although I had high hopes, my review is 3 stars because our experience was solidly average. I love that the majority of their menu is gluten free. And there were some good vegetarian options. I was also pleased with the healthy kids options. When my family of 4 walked in there was only one table with people waiting for food. All of the employees were busy performing various tasks. The gentleman that took our order was very polite. I ordered the grilled chicken and rice kids meals with a side of fruit for my kids. Very nice portion sizes. The chicken had good flavor. I was disappointed that although the kids meals come with drinks the only options were fountain drinks. 100% juice would have been a nice touch. My husband had a lamb gyro with chips and fruit. I had the tomato basil sandwich with chips and fruit. Both good...not great. Another reason for my 3 star rating was that it took about the 20 min for the food  which seemed a bit long considering there was only one other table in there. Our order was to go."], ["Mew W.", "Vegetarian and gluten free options. Stand in line order and sit.not fast food. Seems to be freshly cooked. Kids meal good and chicken cut up already. Rice with kids meal lemony flavored. Adults had lamb gyro. Not classic meat from rotisserie like hubby likes but Americanized slightly marinated and cooked to med to med well. Needed sauce so maybe order lamb and skordalia who ch is their sauce. Sandwich was dry and only one tomato chunk not wedge and little lettuce but ample raw-ish onions. Iced tea ok, fruit cup with kids. Gyros with chips- ???. Didn't try the past salad . Tomatoes and cucumbers was ok. No dessert but baklava served in plastic to go containers so not made in house. One gluten free item hummus."], ["Rhea P.", "I don't understand people who inside on a sunny day, but that was the case here.I liked the variety of vegetarian dishes offered. The food was good, and reasonable, and the atmosphere nice.Do yourself a favor and sit outside of its a great day!"], ["Svetlana O.", "I had the lamb gyro with sides of fresh fruit and replaced the chips with the jasmine rice. The cashier allowed the substitution, but was later told (when they messed up the order) that they are actually not supposed to sub chips out for future reference. I would say that is a huge con. Really should consider making any side an option for orders. They were a bit heavy on the butter with the jasmine rice. The gyro was good, but nothing more. Just \"good\" for a quick lunch."], ["Shivam P.", "We tried this place on a weekday. We showed up just before they close for a pickup order and these guys ran out of a side. The owner apologized and in fact he had the meal on the house for us. You can find mouth watering food at so many places, but you cannot find such fabulous service everywhere. Way to go tazikis!!!!"], ["Crystal W.", "The food is great and the staff is wonderful! I like the chicken gyro best. Try the tomato and cucumber salad as a side. The cookies and baklava are good. I would not recommend the chocolate cake or hummus. *if you're from the west coast, it will take getting used to. It's not the same but it's the best option."], ["Brea G.", "I go here fairly often for lunch and I haven't had a bad experience yet.I just started getting the salmon ceaser salad and it's really good."], ["Food L.", "Very slow service! Waited over 20 minutes for an order of grape leaves (to go order). Very expensive! 3 grape leaves are $6.00!! Need I say more..."], ["Betty P.", "LOVED IT!!! Best Gyros we've ever had. Also great price. Real chunks of lamb, great seasonings, fresh taziki sauce. Fabulous decor. Gonna try out their lamb roast family meal next. Can't wait!"], ["Esther J. L.", "Soft pita bread with hummus is great.Lamb Skordalia is even better if you're into grilled onions instead of fresh veggies. I don't know how strongly I feel about the weekend pasta special.. It had some funk to it the second time I ordered it.. Probably won't order it again. THE CHOCOLATE CHIP COOKIES LITERALLY MELT IN YOUR MOUTH.Please try it."], ["Nadine B.", "1 pm on August 24, 2015, we ordered a grilled salmon with roasted potatoes, Greek salad; Chicken Greek soup and a Greek salad; hummus and pita chips. Amazing culinary experience. Some of the best Mediterranean food we have ever eaten. We'll definitely be back to Taziki's Mediterranean Cafe, 2560 Berryhill Rd., Montgomery, AL, and will look for other Taziki's."], ["Crazy E.", "Lamb on bread. :-)"], ["Benita D.", "our first time at this cafe...great lamb gyros....but ...who knew...best chocolate chip cookies in town"], ["Christy C.", "The food here is good, but not great. I ordered the spicy pimento cheese which was really good, along with the lamb gyro. The lamb did not have the same juicy flavor I am used to at other Greek restaurants which is why I call it \"good\". The prices are a little high for the style of restaurant (order at counter).The servers here were extremely friendly, and the food came out really quick. I would check this place out and form your own opinion because the only thing lacking for me was really flavorful lamb."], ["K S.", "I love this place.   My food always is tasty.  Fresh salad and the pork medallions with grilled asparagus over rice is my favorite meal.  The aioli sauce that comes with this dish is awesome :)"], ["Liz K.", "Very nice establishment. I went there with my daughter to have dinner. We had the chicken plate. The chicken was super flavorful and soft. I liked how you could order wine/beer too. The service was super fast and one of the waitresses went out of her way to get my daughter a drink. Can't wait to go back and try some other food."], ["Erin J.", "New Greek-ish spot in East Chase. They don't have traditional Greek food, it's more like Ameri-Greek fusion. Can you call yourself Greek if you don't have moussaka?? LolWell nonetheless they were tasty, but not a place where I would say omg I can't wait to go back here and eat again. They're around a 3.25 star rating for me."], ["Kate G.", "Let me start by saying that Tazikis- across the board- has delicious food. I have yet to find a counter service establishment in Alabama as consistent and unique as I find Tazikis to be. Today, I had a different experience. I called ahead to order two Friday specials and was told this would take 5-10 minutes. When I arrived, I was told they had run out of pasta and our order would be at least 20-30 minutes. I was really disappointed, but to my surprise, the people at Taziki's were about to outdo themselves.The girl helping us offered to prepare something else for us on the house. Our food was prepared promptly, and when I left I noticed they had also thrown in desserts and some extra pita.Our order of two meals was small, but Taziki's demonstrated excellent customer service by making the situation right. The woman helping me was kind, apologetic, and helpful, admitting their mistake and providing a solution. Great job Tazikis and keep up the delicious food!"], ["Tricia T.", "Nice atmosphere, friendly staff, I had the chicken basil pesto gyro which was amazing! It had gods balance of tastes for me. I enjoyed the hummus and dolmades it was a lot of food for the price I paid! I also enjoyed the baklava which was a bit sweeter than most that I have had but overall I enjoyed my visit and will be back!"]], "Insomnia Steak & Grill": [["Thomas E.", "One of my favorite spots to get takeout from in auburn. The gyros are good, but the chicken tenders and wings are my favorite. The food is reasonably priced and the wings are cheaper than other places around auburn. If your into hookah they have a lot of flavors and the ones I've tried were really good. Also get the baklava, it's awesome!In short:The inside isn't very nice their food is great"], ["Beth C.", "Really big portion sizes...Really great food!   This was my first visit to Insomnia Cafe.  I didn't know what to expect.  My sister loves eating there so I decided to give it a try.The building is a little rundown, but I've lived in Auburn for 20 years.  Businesses come and go. This place has stayed. Don't judge a book by its cover! I ordered the gyro plate take away with hummus and greek salad.   The portion size was humongous!  I loved the fresh pineapple slice in the tray. The hummus was spicy delicious and warm pitas are the best food on Earth. I couldn't eat all the meat, but there was enough pita for every bite. The rice was succulent and just flavorful enough to offset the hummus. The salad was okay, but that's because I'm not a fan of oik based dressings. Overall, it was really good! I tried the baklava, which was a finger-licking delight.  My meal was around $12...crazy good price for the amount of food. I would and will eat there again. I enjoyed my meal and it's on my favorite list.  I'll be back!"], ["Arin S.", "Cheap, fast, big portions. The gyros are the best, kafta and lamb are amazing, dont forget to get fries and a drink!"], ["Hunter D.", "Insomnia is a mixed bag. I'll start with the things I love. Their kafta is pretty damn good as are their chicken skewers. The humus and pita is also enjoyable. If you're looking for a good variety of mediteranian foods the sampler salad is all you. Also, their fries and burgers are passable late at night.  On to the not so good. Inconsistent service. There's no telling when you're going to get your food or hookah. Also, this places tries to blend the American late night burger joint with mediteranian hookah stop very poorly. The mayo and mustard on the pita wraps is just gross. Also the goofy printed out eagle and tiger are weird. It just doesn't come together. All in all this place is what it is, a place to get decent food and hookah. Temper your expectations and you'll love the place."], ["Joe M.", "Best damn wings in the world. There buffalo suace  Is like nothing you have ever tried before. Absolutley amazing. Great place to grab food at 2 am."], ["Neal C.", "Atmosphere-less Mediterranean and sandwich cafe right off of Auburn's campus. Unfortunately, the place has absolutely no charm or ambience, but the prices are decent ($5-9 for a pita roll-up, sandwich, gyro, etc. which comes with fries and sometimes a drink).I would go for the gyro, which has a decent amount of lamb and very tasty tzatziki sauce. Little in the manner of lettuce or tomatoes though. The quantity was ho-hum, nothing big or small-- and the quality was pretty mediocre as well. Not bad enough for 2 stars, but certainly no 4 star either."], ["Ee Vonn Y.", "I ordered the Kafta Kabob Lebanese Meatballs Pita Roll-Up. If you order this and substitute the mustard and mayonnaise with babaganoush, it's a home run. The prices here may seem a little high at first but they really give you your money's worth. My Kaftka Kabob Pita Roll-up was $5.50 but it was a large roll so you won't go hungry even without adding a combo.The guy working here is really nice but if you ask him what people usually order here, he'll tell you that this place has the best chicken wings and burgers in all of Auburn...They're located next to a liquor store. They also have Mediterranean gifts in a glass cabinet beneath the hookahs."], ["Brea G.", "Went here to get falafel for lunch (aside from the PitaPit I think this may be the only place in town to get a falafel)The place itself is sorta run down and crappy looking inside ... almost to the point of making me concerned about my food ... so if you get something get it to go.Better yet call ahead and order for pick up so you don't have to hang around and wonder what the kitchen looks like.The guy working there was pretty nice.The food was passable but that was about it.  I might go back if I can't find any place else to get a falafel."], ["Ray V.", "Is this the only place in town for shisha?  Hookah was very good.  Can't say the same for the food."], ["Wallace B.", "A Turkish-American friend turned me on to the Insomnia. The Insomnia is one of those places that few have tried, but those that have go again. Go for the gyros, kabobs, hummus, babaganoush and other middle eastern food, not for the atmosphere. Very good food, generous portions. Prices are good considering the portion size."], ["April D.", "They have the best veggie burgers in Auburn. The inside may be a little sketchy as far as ambience but I enjoy the food."], ["Chris J.", "Is this the best thing you'll ever eat? Probably not. It does have a few things going for it though. First, they are open pretty much all the time. That, plus the liquor store next door, and you are ready to go. I usually just go on the safe side with chicken fingers and fries, which are good, but they also have a pretty large menu of Greek food. They also have hookahs that you can rent, which can be nice in the summer."]], "Taziki's Mediterranean Cafe": [["Lisa H.", "This Birmingham-based Greekish restaurant chain has really been booming. Taziki's apparently has locations in Colorado now, wow. Amusingly enough, this location in Auburn is adjacent to Mountain High, another establishment from Birmingham. I've been to various Taziki's around Alabama, and it's always a safe bet to appeal to a group, whether it be friends, family, or coworkers. At this spot, the dining area can get loud if there are shrieking kids but what can you do.Order at the counter and then seat yourself. If you can't decide, you can't go wrong with a gyro, particularly chicken or lamb. These pita-blanketed guys come with your choice of side: rice, fruit, tomato cucumber salad, pasta salad, and potatoes. The tomato cucumber salad is my go-to! Wish the portions were slightly bigger, oh well.Some friends and I shared a dinner for four recently, getting the lamb. The lamb was a bit tough and chewy but still good, excellent with the addictive thick skordalia sauce (think garlic, vinegar, oil). The Greek salad was fresh, colorful, and tasty, with non-skimpy amounts of roasted red peppers, feta, red onions, cucumbers, Kalamata olives, and pepperoncini. Rice or potatoes (we got the potatoes) round off the meal. Call a few hours ahead if you want to pick up this meal deal.In general, Taziki's is a little overpriced for the quantity you get but the food is flavorful and tasty. Try to go at off-peak times since I've been told that the parking situation can be non-existent. A Taziki's is opening up in Tiger Town too, so keep an eye out for that."], ["Jason W.", "I had a terrific dinner there ...A delicious dolmades plate made with a thin Greek rice and a ton of perfectly combined spices.The Beef gyro was good but nothing extraordinary ...A great system of order and service ... I would recommend it to any Mediterranean food fan.Like its name the Taziki sauce was great."], ["Karen C.", "Quick carry out service and friendly staff.I had the dolmades plate, which was great. The dolmades are bursting with rice. The Greek salad was tasty. I might enjoy more than a sliver of pita bread, but otherwise, no complaints!"], ["Thomas P.", "The food here was good and service was pretty quick considering it was packed. I ordered the humus appetizer and the Basil-pesto gyro. The food was good and the environment was nice. I would recommend this to people wanting a casual night out."], ["David D.", "Although the herb roasted pork loin was delicious, the entire ambiance of the restaurant was horrible. Order at the counter, seat yourself, they do bring your food to the table, but as for drink refills....you're on your own. I expect a little more for $45 dinner for 2. On top of that the dozen or so pre-teens yelling, running, jumping up and down with their oblivious parents nearby made it feel like a Greek Chuck E Cheese. Hummus, dolmades, and sweet tea ( that I got for myself) were good. Very limited dinner menu, probably decent for lunch."], ["Kati M.", "A little on the pricey side for an order at a counter, seat yourself place."], ["Al F.", "Really good food. Order upfront with friendly staff. Then choose your seat and they bring food to you. Turkey ciabatta was fantastic!  Gyro was good. Taziki sauce is kinda pickle-y for my taste but my kids(who are pickle lovers) loved it. New potatoes were good. Bathrooms are private and clean. Like other reviewers a bit pricey but that's life"], ["Heather H.", "Cute little Greek style dining place in downtown Auburn. Set up similar to a Jason's Deli (order at the counter then they bring food to you. ) Ordered the Greek salad gyro. Good value for the price, pretty tasty,  but no taziki sauce? Came with a side and chips for 6.99. Added a glass of merlot and even then the total was only $15 with tip. Decor was cute. The big thing holding me back on this review is the fact that I've had the same wrap bread and the same Greek dressing in a pizza place before. I'm sure I'll go back,  just not to try the same thing."], ["Jay H.", "This was our first visit. One I the managers saw us standing in the entrance waiting to be seated and explained the ordering process. Order first, pay, get a number, pick up your drinks and find a seat. Your order is delivered to your table. The staff were all extremely helpful and they did it all with smiles. We had a beef gyro, a lamb gyro and the Mediterranean salad with char grilled salmon. I sampled each dish and they were all delicious! Great food with a reasonable price."], ["Marisa G.", "I had Taziki's for a second time today. Both times that I have gone I have been very impressed with the place. The man who we ordered from was very kind and was happy to make a substitution for a topping on my sandwich. I had the monday special, a Chicken Portobello Sandwich. The price was around $8.50 and it came with chips and a side of choice. It was incredible! They did not skimp on the portobellos, the sauce (kind of like an olive tapenade) was delicious, and the chicken breast was huge! It was definitely the largest chicken sandwich that I have ever had. I couldn't even finish it. The person that I was with had a chicken gyro, which was equally as big and delicious. I recommend Taziki's to anyone who is looking for a quick, yet fresh and delicious meal!"], ["Audrey A.", "Casual atmosphere, as in order in the line before seating yourself, but food rivaled some of the fancier places I've been. The grilled salmon feast was cooked PERFECTLY, and they substituted grilled veggies for rice happily. Pita chips sampler platter had two dips (one hummus and one white dill dip I liked a lot) and grape leAf wrapped rice. Hubby had beef gyro and ate it all. Friendly place to go, nice atmosphere."], ["Paul K.", "This white girl food trippin i can taste the lemon i think they import that shit from mediterranea"], ["Mike V.", "Nice addition to Auburn in the upscale, casual Greek category. Really good food. There are no freezers here, only freshly cut meats. When you taste the food, the word fresh comes to mind. Nice staff and Gene O'Donnell, the general manager, is obviously very good at what he does. Can't wait until they come to Columbus!"], ["Audie H.", "My wife and I ate at Taziki's in Auburn last week for the first time.  Great location on College St, right across from Auburn University.  Easy off-street parking.  We have eaten several times at various Taziki locations in the Birmingham area.  The recipe appears to be the same.  Excellent food,  good service, nice atmosphere.   Most lunch choices with drink are around $10.00. The Baklava is truly outstanding. Highly recommended."], ["Marilyn S.", "Service was great! Food came quickly!  The lamb gyro's could have been a bit spicier! But all in all it was a good meal and pleasant atmosphere. Dog friendly for those who want to eat outside."], ["Rebecca P.", "I love Tazikis. I was excited it came to auburn, but this one it terrible. My favorite thing to get is the Mediterranean salad with salmon. On a Thursday morning, I called them while they were not busy and called in a pick up order. They told me it was going to be 30 minutes and $13 (plus tip) for a salad. Uhh ok. So I waited 30 minutes and came in and paid for my food, and it was so bad I literally went to Taco Bell instead of eating my food. Never coming back here again."], ["Isaac L.", "I was looking for Vegan Fare and while thinking I was going to settle for Chipotle, I came across this place by chance. I ordered the Grilled Veggie Plate, with hummus and mixed pita chips (soft and baked). Chipotle Who!? The food was perfectly cooked and seasoned just right. They staff were very helpful in making sure my food was meat and cheese free. Hummus was creamy and very flavorful. If there's another Mediterranean place in Auburn, I'd skip it since I doubt they can be any better than this. Thanks!"], ["Pernell M.", "I had the Lamb Skordalia Gyro. It was seasoned great and tasted good. The only gripe I have is the price. Ten dollars isn't much but if you just want a wrap-type meal you could get more bang for your buck at somewhere like Chipotle, Moe's, or even Taco Bell."], ["Iggy A.", "This place is awesome! Great food, ambiance and wine choices too! I ya haven't been yet, I recommend doing so."], ["Katherine L.", "It is nice to finally have a good Greek place in town.  The hummus with the soft pita chips are amazing.  Everything tasted very fresh.  I was surprised that my wrap came with potato chips, I would have much rather had pita chips.  Overall, the food was good and I definitely suggest a try."]]}