{"SaZa Serious Italian": [["Ali M.", "Great spot! I sat at the bar an ordered a glass of wine and the Bandito Salad with chicken. It was delicious! Fresh ingredients and full of flavor. Very friendly staff. I also treated myself to the house made cannolis... deliciousness! I read some of the other reviews and everyone is raving about the pizza which also looked great. Definitely a spot to check out while in Montgomery. PS I resisted the strong urge to ask about the bag of water hanging over the door by the bar that read 'Don't ask about the bag'...!"], ["Melinda L.", "My husband and I had the Grandma's Pizza. Very flavorful,  especially because I am usually a pepperoni  pizza kind of gal.  Delish!!  Everyone was friendly  and  I loved the decor and ambiance of the restaurant.  Can't wait to try more!"], ["Stella J.", "Grabbed seats at the bar on a busy Saturday night. The service was solid from the busy bartender. Good bottle of Pinot Noir, reasonably priced.  The Eggs Purgatory is a must try-- just ask for extra bread!  We also had the caprese salad (just ok), then the kafta lamb pizza (very good if you enjoy Mediterranean flavors; the pizza dough is wonderful, crisp yet chewy), and the pasta bolognese on the bartender's recommendation (fabulous!! I could have eaten the sauce by the spoonfuls).  Overall, the food was delicious and the service was good."], ["Taj M.", "Omg!!!  Poor service.  Average food.  Decent beer!   I ordered the bandit salad with shrimp.  $13!     It came on a bed a greens. 1/2 a over ripe avocado  3 pieces of shrimp and one sautéed garlic clove. Some cherry tomatoes. And a little bit of cheese!   $13. Dollars for it!  Told server.  Too expensive and low quality for what I paid.   Took it away.  Talked about the manager.  Comes back with same salad. Different Avocado and more greens.    Same amount of shrimp.   He missed my point.   I asked to take it off my bill and I'll stick to beer.    Not worth ordering again.  It wil be an hr later.  Manager never came out.   $13 for a side salad.   No way!   Experience service and food not worth it.The manager never came out!!!!   Photo of salad attached.  So you all know what I am talking about."], ["Erica J.", "Great location right off the riverfront in the Alley.  SaZa is rather large with counter seating facing the open kitchen.  Customer service was outstanding and food was very good.  We ordered the special of the day bruschetta with goat cheese and balsamic reduction.  Bread was toasted perfectly too.  Their meatballs were outstanding as well.  Ordered other items including pizza and everything was tasty, made fresh, and satisfying (ample portions)."], ["Michael N.", "Just like Grandma used to make!I went with a large group on Sunday night and it was like being transported back to my Nona's kitchen as a kid. There's an amazing energy coursing through the place that is amplified by the open air kitchen. I had the sea food pasta and was blown away. Fresh ingredients mix together to create a depth of flavor that truly treat the taste buds. The portions were huge too - everyone had a take home box at the end of the meal."], ["Joe V.", "Really? Food this good in Montgomery Alabama?If you have read any of my reviews, you know my rap,born and raised in Brooklyn NY.Was raised on the best pizza and Italian food in the world.This place has it going on!I read the description of Grandma's Sunday Sauce, I was intrigued.So I ordered it. It tasted exactly like the Sunday sauce I have eaten at Mom's house since I was able to walk.Meatballs to die for! Pork, beef, droooool.Sadly I don't live in Montgomery, but when I am back in March for another concert at the MPAC I will be here, eating the same great meal."], ["Becca C.", "Food was delicious, portions are generous, our waiter (Al) was very attentive and on top of things."], ["Lindsey T.", "Was searching Yelp for a yummy local place as I am not from around here. The rigatoni bolognese is fabulous! Definitely worth the trip and price! Great little area of town, with a fun atmosphere!"], ["Alex R.", "Its a 2-star anywhere but Montgomery.  Service is good.  Place is always packed.  The food is mediocre.  Everything is frozen, including the eggplant.  The pasta with assorted meat is actually tasty.  The pizza is okay."], ["Food L.", "After the 3rd time of giving this place a try I have decided to finally comment.The waiters are horrible!!!!!!!!!!!!!!!!!!!!!!!They are rude, unfriendly, grungy, smokey, dirty looking and act as though you are bothering them when you ask a question about the menu. The place is dirty - it's like it's never been cleaned. At night it's hard to tell because the place is painted with red and black walls. If they changed their entire wait staff and cleaned up the place it wouldn't be so bad. The food and drinks are good. Not amazing but good - mainly because it's the only Italian NY style restaurant in that area."], ["Betty P.", "We had the stuffed hot peppers for an appetizer, grandma's Sunday sauce pasta, and eggplant parmesan. All amazing and large portions so lunch has been taken care of tomorrow. Relaxed atmosphere, yuengling on tap (hubby loved that) and great downtown location for a nice long walk after a filling meal."], ["Amanda B.", "We were in town for my brothers Officer Training Graduation and a group of 8 of us had reservations here for dinner at 8:00. The restaurant was booming for 8:00 and the ambiance was fun; I expected a great experience. Unfortunately our server Christina was terrible. She was not friendly or accommodating at all and basically ignored our table for most of our dining experience. The food and drinks were delicious! We had grandmas traditional pizza, the  manicotti and a pesto pasta that were all really good. It's so unfortunate when you have really bad service because no matter how good the food is...the entire experience is ruined. When I return to the area I think I'll give them another chance because of the food....I sure hope they have some good service that can compliment the food!"], ["Charlie G.", "Only ordered desserts, which were both very good. Red velvet cheesecake & chocolate truffle tart are good choices.The service was excellent - Branden was very friendly and made the experience all the better"], ["Dave L.", "First, be sure to make a reservation. We arrived a little before 6 PM and had to wait for 30 minutes despite 6-7 empty reserved tables (that is, unless you want to eat outside or at the Waffle House style bar where you watch the cooks prepare meals). The food was OK. I got a cream sauce pasta with chicken. Portions are large, but there wasn't much chicken and the sauce was so thin it did not adhere to the pasta.  Taste was average. My wife got a meat sauce based pasta. Large portion with thicker sauce. Hers was not bad.  Started off with their bread sticks which were the highlight of the meal.Prices are very high. $60 dinner with 2 pasta dishes (one w/ chicken in it), bread and 1 beer.  Restaurant was quite loud, both due to patrons and kitchen noise.Beer selection is above average. Full bar available.Service was quick and courteous after our wait for a table.Overall, I give it a 'meh' rating. It wasn't a negative experience.  I won't see myself returning since Mr. Gus' Italian is significantly better."], ["Gordon L.", "We started with a disinterested hostess. Then things picked up. Good waiter. Servings were very large and everything was overpriced. Very basic menu for an Italian restaurant mostly pizza and pasta."], ["Michelle B.", "I had the eggplant parmigian- it was decent. Service was a little slow, but the place was quite busy for a week day evening. It was also ungodly hot in there. If you're staying downtown and want Italian, it's certainly worthwhile, but I wouldn't make a special trip."], ["Kevin B.", "Pretty good food..a bit pricy & gets quite loud..went there on a Friday & they're not open from 2-5pm..wtf?"], ["Kent M.", "Very busy Saturday nite here. Sitting at bar for quick service. That is going well. Ok just got foods. A seafood diablo Very good, in marinara and app of hot stuffed peppers. Really good both. Great service here at bar also. Def a plan to return food stop here."], ["Leo F.", "I came here for lunch today with coworkers.  I wasn't particularly hungry but the way the waitress described the daily pasta special made it tempting so a coworker and I ordered it.  The other coworker ordered a salmon salad.The pasta special that we ordered today was pasta with shrimp in a white wine sauce.  There was ample amounts of pasta and the shrimp was relatively large for restaurant meals.  The shrimp was cooked just right such that it was not tough.  There was just enough sauce without drowning the rest of the dish.  I finished the dish quickly and yet still wanted more even though I was full."]], "Corsino's Italian": [], "Pizza Hut": [], "Mellow Mushroom": [], "Mr Gus'": [], "Midtown Pizza Kitchen": [["Robert P.", "If you like thin crust pizza - somewhat \"real\" Italian style, this is your place. If you don't like thin crust, innovations like white sauce pizza, or  non-standard ingredients like fennel, probably not the place for you. Kind of eclectic, different place - decent selection of beers.  Really a nice change of pace for a pizza place.  Somewhat like Tomatinos, but I would say better."], ["Mark A.", "Great pizza, the best lasagna in town, and draft beer. Excellent service.  It's also very kid friendly and the staff is quite patient with the little ones."], ["Jesse A.", "The Italian chef makes everything from scratch daily. There is not another place in Montgomery that makes pizza like this....place even has stromboli. If you appreciate authentic, hand made/tossed pizza you have to visit. A great selection of draft beer on tap as well."], ["Melissa T.", "Midtown pizza is not bad but I wouldn't say it's my first choice to grab a slice in town. It is a nice little place to grab lunch with friends. The atmosphere is casual and social. The pizza's are thin crusted and toppings are always fresh.They do have a diverse selection of pies, I really like the combinations they have."], ["Luke L.", "always have a great experience here. a different style of pizza from what Tomatino's offers, which is great (because both are wonderful and we're lucky to have them both in Montgomery). add in a great selection of draft beer, and it's a winner. definitely worth a night out."], ["Anne W.", "This was an excellent pizza place! My husband and I were driving through Montgomery and stopped at Midtown (which we chose because it had good yelp reviews).  It was towards the back of the shopping area.  We came at a very early hour (probably around 5 on a Tuesday) so it was pretty empty but that was great for us.  We ordered a small vegetarian pizza and Greek salad to split and my husband got a beer.  This was a perfect amount of food for 2 of us.  The pizza was great -- thinner crust but loaded with toppings! The salad was large and tasty, and my husband LOVED his beer.  He said they had great microbrews on tap and had a hard time deciding which was to get.  We highly recommend this place!"], ["Rhett S.", "We stopped in for lunch on the way from Houston to Atlanta, having selected it based on other Yelp feedback, and enjoyed a great lunch.  I ordered the Funghi e Salsiccia Pizza and my wife had today's special - Sauteed Salmon and Shallots in a lemon-garlic sauce.  Her salmon was fresh - not strong like it sometimes can be.  My pizza was excellent!  The side salads with the balsamic vinaigrette and blue cheese were also good.  The blue cheese was a very fine crumble, not too big if you're not a blue cheese fan.  Would stop again."], ["Doug O.", "Food was good.  But, the service was horrible. Guy who waited on me had the personality of a cardboard pizza box."], ["Ed P.", "Good pizza, sandwiches and salads. Locally owned and operated. Bright and cheery. Outside seating available."]], "Papa John's Pizza": [], "Sbarro Italian Eatery": [["Nina U.", "Had some samples...still not impressed enough to eat here. Make the garlic sticks like The Olive Garden and then we'll talk."]], "Tomatinos Pizza & Bake Shop": [], "Olive Garden Italian Restaurant": [], "Marco's Pizza": [["Sarah V.", "I did not want to cook dinner tonight so we decided to order online. My husband and I ordered 2 small pizzas and the website was user friendly and they got the order perfect. The promised divert time was 5:50PM and it was delivered at 5:45PM. I ordered the pepperoni magnifico thin crust with black olives and light jalapeños. My husband ordered the chicken florentine with no red onions and both came as ordered.We paid with credit card over the Internet and tipped when he got here but you could tip online as well. I'd recommend Marcos Pizza to anyone in the area wanting delivery."], ["Shequanda Y.", "Great pizza. We have ordered pizza from this location several times and the pizza is always good. I wish they delivered in the Pike Road area!!!!"], ["Kay M.", "I was driving home from Atlanta to New Orleans in a pouring rainstorm practically falling asleep as I was driving when I realized what I needed-- pizza! I found this place on yelp and it was only a few minutes off of the interstate so I went and was pleasantly surprised. I was debating between the thin crust and the hand-tossed and ultimately decided on the latter. It was the right amount of cheese and sauce and the crust was nice and not too dense. Great flavor, but I am taking a star away because they did not have oregano to add to the pizza when I asked for it. I don't know if this is a southern thing, but people always stare at me like I have 2 heads when I ask for oregano! I grew up in the north and was a pizza cook for several years and we always offered oregano as a condiment!"], ["Ryan C.", "This place was 2 miles away from my hotel.  Ordered delivery. They called me back 45 mins later to tell me that they cancelled my order and I now have to call the other store that is closer to me and place a new order then wait another 45 mins for my pizza. Should've called me back right away or just delivered the pizza since I was literally a 4 minute drive from them. Ridiculous."], ["Thomas C.", "Ordered a Pizza for delivery - delivery man called me 4 times for directions as he stated he put my address in his gps wrong. The 5th time he called back he did not mean to call me and cursed on the phone when he realized he called the wrong number. I called the manager Derick Cook who again was very unprofessional. I ordered online and paid with a company business card. The manage stated he would issue me a refund and would take 5-7 days. I cannot comment on the food - but customer service was worse than F-"], ["Michael H.", "UpdateI ordered a pizza online too close to closing time.. when I drove it up to the store,They were already shutting all the lights. ( the order didn't come through)No frills, they just stay late for me made freash pizza for me.  A+++++++ for service.and yes, Pizza and cheesy bread is still the bomb.I stick with what I know... so I was going to order  Pizza Hut, Domino's or Papa Johns..  they my sister told me to try out Marco's.I got the two topping Large + Cheesy Garlic Bread.they had a Old World Pepperoni which was smaller rounds, but pack with flavor. The Italian Sausage was not salty and very yummy.For a delivery, - franchised pizza place, i think It is very good.  better than Pizza Hut, Domino's, ... it's what papa john was about 10 years ago.the dough is very like... Foccassia bread.  light, fluffy, flavorful .I can't wait till I go back"], ["Ed W.", "Wow, great thin crust pizza.  Found out about Marcos by accident- it was a great find.  You can order your food on line and it's at your house in 15 minutes.  Never more than 30 minutes.In addition to Pizza, they have a nice selection of Hot Italian Sandwiches on their menu too."], ["Melissa T.", "So we've had Macro's three weeks in a row now. It's absolutely the family's first pick for pizza delivery. They offer two types of pizza crust, thin-crust and classic, which are both delicious but I prefer the thin-crust. The toppings all taste very fresh. And the pizza is piping HOT everytime it gets to our doorstep. You can also order to take-out or dine in. There are a few tables and chairs at the store."], ["J.P. M.", "If you want some great pizza for delivery or pickup thats not papa johns, dominoes, or an other famous fast food chain, COME HERE!! Great pizza, My favorite is the thin crust chicken Hawaiian pie, Great prices and good timing."], ["Mark H.", "Google maps and Yelp maps showed this in wrong location on Taylor Rd.  It is just north of Applebees, (southeast of the Vaughn Rd/Taylor Rd intersection). Searching for Marcos Pizza on Google put it on the Northeast corner.  Got an ad in the free Wed East Montgomery paper and decided to try Marcos pizza.  Glad I did.  Flavor is excellent, not like the other chains cardboard pizzas.  Will definitely go back!!"], ["Bridgit G.", "it wasn't too bad. reminded me of pizza back in NY"]], "Cici's Pizza": [["Lin G.", "To an alien species visiting earth for the first time, the American buffet must resemble some sort of curious mass feeding before a seasonal hibernation for the Humongo (aka fat fucking beasts).  The only thing they didn't know was that this is not a one time occurrence of a massive feed for these beasts.  Try, all the fucking time!This buffet was focused on pizzas, with some un-recommended servings of tossed salad (mostly lettuce), dried out pasta with either red or white sauce, and a very unappetizing soup that's sat there for so long the top layer congealed and no one, not even the guy standing behind the soup counter, can say what kind of soup it is. He had to go ask someone else.  Chicken Noodle Soup.  Not for this soul.  Despite all the horror, this is Montgomery and I love me a buffet.  They had many kinds of pizza.  For the most part, they were fresh and came in small, friendly, try-me sized slices.  My favorite were the spinach and chicken.  They also had a dessert pizza that was delicious.  And some brownies.  For $6, this is what am talking about.  Though the inevitable downside of that is the clientele.  It was like sitting in on an episode of America's Most Wanted crossed with Cheaters.  These are not people you'd ever want to associate with.  I know it's da dirty dirty but come ON!  See?  This is what happens when I eat alone and have no friends.  I stare the shit out of people.Some teen boys with their girlfriend, who, at the tender age of 15, is already twice the size of a house.A creepy man sitting by himself sipping (the untouchable) soup and peering at me every time I got up to get food.  I avoided looking at him too much so can't give you much details.  A couple sitting across from each other and their toddler daughter standing on the seat.  They had about 45 pizza slices/crusts piled onto plates in front of them.  Nobody ate for at least the 30 minutes that I was there until all that food was dumped away.  Welcome to a $6 buffet guys.  The guy was staring at his phone, reading something.  The woman was talking ON the phone, relaying some drama.  And not once did I catch either of them look at each other or at their toddler, who was desperately trying to get some attention, or food, or a damn phone of her own.  The lady who takes away all the food gestures periodically to some guy outside.  Her dude is sitting in a car in the parking lot, the car's leaking fluid like a faucet from the bottom.  The whole area under the car is flooded.  Damn, not only is her bountiful salary as a plate clearing staff at a pizza buffet affording her time and effort, it's also buying his precious time too, plus the costs of keeping a broken car running for hours on end in the parking lot.  Brilliant use of resources and time guys.  The creme de la creme would have to be this table of the most obnoxiously loud group of black folks I've ever had the good fortune to encounter outside of the Philadelphia metro system.  This one big dude in particular laughed so loud from the moment his fat ass hit the seats until he waddled out, it was like he was sucking on a tank of helium after smoking some good weed and getting tickled by Dave Chapelle at the same time.  Cackles.  Thunderous, root shaking, teeth rattling, CACKLES.  With all that laughing, it's a goddamn wonder how he found the time to eat enough food to get that big.  Welcome to a $6 buffet fuckers.  This is da dirty south.  Yes I will suck it up and bring ear plugs and a blind fold next time.  Just please leave my mouth exposed to inhale those tasty little slices."], ["Rob A.", "4 Stars because I like the taste of this pizza.  I like that the cheese isn't gooey.  And the overall pizza choices in general aren't real greasy.This Cici's, as with most, is located in a strip mall area.  The area is shared with places such as Ross Dress for Less and Wal-Mart.  When you first walk in the door, you'll be greeted with a \"Welcome to Cici's\" by at least one of the employees.  You'll step up to the counter and either place an order to go on dine in, or do what most people are here to do; get the buffet.  If you get the buffet, they'll ask you if you want drinks.  The drinks cost extra, with free re-fills.  Once you pay, you'll grab a plastic serving tray and walk down the line.  First up is salad.  Grab one of the small hard plastic plates and get your salad.  The salads are already tossed and in a large salad bowl.  Use the tongs and add to your plate.  If it's empty, they will toss some more.  No choice of dressing (at least I don't think so), but the dressing they use and tasty.Next up is pasta and garlic bread sticks.  Yummy on the bread.  Really good when you get them fresh.  If the bread seems like its been sitting a while, just ask one of the workers and they will make some more.  Takes about 3 or 4 minutes.  Same with the pizza which is next on your walk through the line.  If you don't seem something you like, just ask and they will make it and bring it to your table.  As many slices or whole pizza, as you like.Sometimes I find the plates are still wet from just being washed.  And sometimes you can rub smudges off.  So, yes, it would be better if they would wipe the plates down as their washed, but ehh, it still works.  Just want you to know what to expect.The workers here stay busy and on the move.  The are constantly making pizza and meeting the requests of customers.  The keep the tables pretty clean and remove used plates often.  Always get a new plate when you go back up.This is probably more food than most people need in one sitting, but you can't beat it for the price.  And the pizza is actually pretty good.  It's not like Chicago, Boston, or New York level, but it taste good and doesn't sit in the bottom of my belly.  That's a good thing.Always friendly services, always know what to expect, clean eating, but of course a buffet can get messy at times.  All said, I'm a fan."], ["Jordan K.", "It's cheap, a buffet, clean, and friendly staff.  Can't ask for anymore than that from CiCi's!"]], "Carrabba's": []}