{"Ixtapa Mexican Restaurant": [], "Moe's Southwest Grill": [["Lawanda S.", "\"Welcome to Moe's\",  which I heared when I go to eat in or carry out and sometimes I get a chuckle because of how they say it like they're enjoying saying it, but it puts a smile on my face. Friendly people though.  When I do go there sometimes, I like to get their Close Talker when I make a stop during lunch or on my way home.  If I don't get the Close Talker,  I'll get the Billy Barou both with the steak tips including the toppings added with it also. I also like the Tomatillo sauce to use it either to put some in the Close Talker or a dipping sauce for the chips on the side which I love because it's a little spicy with a hint of saltiness in the mix.  I love their sweet tea when they have it just right, even though they do sometimes  have it too sweet like today that I have to mixed the unsweetened tea with it but not too often. My only thing is to stop being nippy with the toppings that is placed on orders by the customers because the prices is to closed to $8 or more so we should get our monies worth."], ["Joe G.", "The good: Fast service. Friendly staff. Clean restaurant. The bad: Small parking lot. Nothing especially distinct from every other Moe's I've been to. Normally I'm not a fan of MSG's franchise. I'd skip it for something else or another tex-mex/burrito chain. This particular restaurant put it back on my radar."], ["Marcia M.", "I try my darndest to support independently owned businesses and am always up for an adventure when it comes to trying out new dining establishments. You may be scratching your head as Moe's Southwest Grill is a fairly large franchise but when you're heading home to Nashville from a snazzy little vacation in Seaside... you only have so many options especially when you are a vegan. I would rather refrain from eating during the 8 hour than pop into a McDonald's. No thank you.My friends suggested Moe's as a healthier alternative and I succumbed especially when I realized that I could inhale tortilla chips and salsa. I don't know about you but I just can't have any portion control when it comes to spicy salsa and tortillas!I was pleasantly surprised by Moe's as they offered many veg friendly options including the Art Vandalay burrito which was stuffed with tofu, bean, and veggies. Add some iced tea, chips, and salsa for a tasty meal for under $10. The salads and rice bowls looked appealing too.I LOVED the salsa bar where you can scoop various versions and make visits back to refill if you inhale it the way that I do! Moe's provided a nice portion of chips which are included for free with your meal.I also really appreciate Moe's mission on providing low calorie, veg-friendly, gluten-free and sustainable products. They even promote Meatless Monday on their website!I may have to indulge in sporadic visits to the Moe's located in Nashville now too!"], ["Tabitha C.", "One of the worst Moe's that I've ever visited. They are very skimpy with their ingredients and customer service is very inconsistent. I will never step foot in this establishment ever again. One would think with the prices you'll get a bang for your buck. Instead you'll get a headache. Stay away and go somewhere else."], ["Mad A.", "Why do I do it ? Why in my travels do I allow well-meaning but misguided people to talk me into eating Mexican food outside of the state of Texas !? Poor Moe's. I am sorry that you got stuck with me but I am a TOTAL Mexican food snob. Look. Your place was spotless clean. Your staff was mostly courteous although seemingly bored out of their minds with their jobs. And why wouldn't they be bored this way? You also had a vast array of fresh ingredients which was GOOD but Moe's ? You ARE the Subway of Mexican food. You have your workers lined up behind the glass like they are at a cafeteria in a nursing home. And then Moe's.. YOU asked ME to build my own taco. Next time get your workers out from behind there so I can show them how to do it. These folks are not chef's or even really cooks, Moe's. They are assembly line workers and am I to be entertained by the sheer delight of watching them follow my orders to build my own creation? To make it more fun you should just give me one of those coin operated cranes like the ones for fetching stuffed animals at the state fair or bowling alleys for loading up my own creation. Now THAT would be entertaining !OK. I was homesick for a Texas taco and I asked for my puerco... oh sorry.. I mean my pork taco to be put into a CORN tortilla and they looked at ME like I was from another planet. I settled into resignation as you stuffed meat into a hard shell taco like the packs from the grocery store that were not really big enough to hold a hamster and then you put the black beans in it and then you charged me extra for a schmear of guacomole that would not cover one half of a bagel. Really?! And where did you order that over salted highly processed Pork meat ? By the time I got two bites into the thing, the brittle shell was falling apart. Your salsa selection was interesting at first sight but no SOUL, Moe's. No Spice. Your chips were thin and kind of flat and stale and NOT warm either. Moe's, I am beginning to tear up here. You and I had an accident and just crashed into each other. A cosmic accident like a comet smashing into the planet like Lucifer's hammer. I am sorry it happened. I know that you are too. Let's just go our separate ways and pretend we were drunk in college and it was a mistaken one night stand. It's not you.. Its probably just me. No sorry. We can't grow personally when I lie. Its really you. But HEY! To end this as friends, I can certainly tell you that your establishment was VERY clean. It really was ! Thanks for the memories!"], ["Michael M.", "Worst Moe's experience ever!!! I don't normally review chain restaurants as the are all basically the same. I will break habit if it is exceptionally good or awful.   Burritos were half the size of the ones I am used to getting back home in Oklahoma. Skimpt on everything rice, bean, and chicken. The cilantro was not chopped and was leafy. Was charged extra for bacon on a chicken club burrito. They were basically out of the chipotle sauce that goes on the burrito. Should have known that before telling me they could make it. Never been this disappointed with a Moe's restaurant."], ["Nick B.", "Welcome to Moes. I really like burritos so I am a little biased. This restaurant is clean, which is always good. I eat at this Moes often. Over time I have noticed the size of the burritos are getting smaller. I do not know if this is a trend at all the Moes but it is happening here. I love the ingredients, and will continue going to Moes. Great value for under $10.00."], ["Melissa T.", "This Moe's is pretty much the same as all other Moe's since it's a chain restaurant. However, I prefer the one out in Eastchase, which is a bit cleaner and brighter. Anyways, I still love their burritos and tacos. Most of the meals come with free chips and self service salsa bar. Also I noticed that they are going the same route as a lot of other mexican restaurants with the grass-fed beef and cage-free chicken. Love that."]], "Los Cabos Cantina": [], "Los Vaqueros": [["Esther J. L.", "This place is my FAVORITE Mexican place in Montgomery. Ixtapa is too overpriced and always crowded, Jalapeños is loud and the food is not on par.Staff is extremely friendly, feels homey and the food is great."], ["Jay S.", "There are restaurants I go to and when I go I know I will deal with a crowd while I wait to be seated. They do have their rewards, but there are also those where I know I can get a peaceful, quick meal. Here. You will be greeted by friendly folks, seated and served quickly. You can't go wrong with a draft Modelo and the taco dinner."], ["Jessica J.", "Los Vaqueros was superb!  The tacos de carne asada were fantastic (and spicy!!). Our waiter was extremely attentive and gave us a few special tips on how to dress our tacos. And of course, we had a yummy Dos Equis on draft to top it all off. Highly recommend."], ["Susan R.", "Susan MGreat food! Very fresh......did not like they were vacuuming when walked in the door. Then I had aunts bite my ankle and lower leg twice. Then vacuuming again created a terrible smell."], ["Peter S.", "On a road trip through Montgomery staying at a nearby hotel. Seeing Los Vaqueros had a 4 star rating so I thought I would give it a try. I am now convince that all of the reviews were written by the owner's children. I had an Ultimate Margarita, the trio appetizer, and the two enchilada entrée (I chose one chicken, one cheese). The $10 margarita was nothing but well tequila and bar mix - It was sickeningly sweet with no real taste of either lime or tequila. The appetizers were all frozen out of a bag from Costco - I recognized them all as Kirkland. One of the poppers was still cold inside. The enchiladas arrived covered in an unidentifiable red sauce that only tasted sour. The tortillas on both enchiladas were soggy - which usually means they were frozen as well. The most telling aspect of the meal...? The waitress (who was very pleasant) didn't even blink when I said I was done with plates that had barely been touched - she didn't ask if it was okay or anything similar. I am sure she is used to plates being left untouched.A truly awful experience."], ["Jan S.", "Getting into town after a long day on the road we went for the closest Mexican restaurant to the hotel and Los Vaqueros was it. We were greeted and seated right away, ordered drinks and were followed up on twice. The chips and salsa came, we ordered our food, I went to the restroom, came back, my fella went to the restroom and right after he left the food was on the table. It really was that quick and my no-this-more-of-that veggie fajitas order was 100% correct! I was impressed. The food is your basic Tex-Mex style food, but still good and just the right portion size. It was just what I needed! We will be back."], ["Scott H.", "Trying the carne asada...it was close to beef jerky. The salsa was like a tomato sauce, no spice to it. The upside, the service was prompt!?"], ["David T.", "I enjoy Los Vaqueros as one of the few \"Mexican\" places in town I have tried that does some things right and doesn't serve the bland food I find in a lot of places around town. The chili colorado is great. Its my go to food here and reminds me of CA. If your looking for an app I recommend the salsa and diced avocado. Has a nice spice and flavor and the avocado is fresh. Thursday and Saturday are $1.99 Margaritas. Not homemade but its $1.99."], ["Richard G.", "Great Mexican Food. Really nice atmosphere.  We stopped here the first time on a fluke.  Now go out of our way to stop here anytime we come near Montgomery.  Have had their enchiladas - delicious sauce.  Some of the best guacamole I've ever had, served extra cold and just the right amount of garlic. Good salsa too...but if they ask if you want it mild or spicy opt for the spicy as mild has zero heat and spicy is not that hot.  Anyway serious good Mexican here."]], "La Zona Rosa": [], "Taco Bell": [], "Ixtapa Bar & Grill": [], "La Coronilla": [["Joe C.", "As authentic as Mexican gets in Montgomery.  All other Mexican wanna-be restaurants take note.Note to restaurant: offering an English menu would help the non-Spanish readers.  I love that you have Spanish only menus too though."], ["Sherri M.", "I've been here in Montgomery AL for almost two weeks and this is the first good food I've eaten!!! Margherita was perfect too! Thanks! I was starting to doubt that there was anything worthwhile here."], ["Melvin F.", "Great little spot. I got the tacos al pastor. Filled with plenty of meat and seasoned well. Service was quick and friendly. The menu was exclusively in Spanish but with a limited understanding and a smart phone I didn't have any problems. Give it a shot if you are in the neighborhood."], ["Sharron B.", "Good experience here. Location looked a little sketchy at first. Food was very good traditional Mexican food, not Tex Mex. Tamales are great. Everything was great. Good amount of food for a good price."], ["eric v.", "Authentic Mexican food in Montgomery! I traveled to Mexico last year, and the food at this restaurant is similar to the amazing food I ate at the local taco stands in Mexico. Most dishes are spicy, so ask for a mild meal if you dislike spicy foods. Don't be fooled by its outside appearance. This hole-in-the-wall will be worth your time (and money). It is about 1/2 mile north of intersection of Northern/Eastern Blvd. and Atlanta Hwy. You must use frontage/service road to access it."], ["Dr. Steve P.", "What would you say about a restaurant that charges different prices than those shown on the menu when you go to pay your bill? When asked why, the waitress claimed the boss is making new menus, but the boss, who isn't there, forces her to charge the new rates and ignore the menu prices.What would you say if you went back to that restaurant six months later and the same thing happened again? This time the waitress gave the same explanation then added no one else has complained. That implies that the problem was us. Silly me, I thought the issue was that the restaurant wasn't charging us the prices shown on the menu. Or, maybe, no one complains because everyone isn't treated the same when it comes to prices here.We will not return. Food isn't the issue, but being treated fair is. I don't think this practice is legal nor is it ethical. I choose to spend my money at restaurants that play fair and deliver quality food and service."], ["Andrew G.", "Small little place. Menu is in Spanish so if you don't know Spanish you won't understand it. I ordered the steak fajitas and they were pretty bland. My wife ordered the super burrito which she enjoyed. Queso was good and so was the salsa. Most likely won't be going back."], ["Ricardo M.", "Kind of a strange experience. This place is certainly not a Tex-Mex place. It doesn't have a Jalisco tradition - that will mean something to people from the southwest - and if I had to guess I would say the food tradition is from southern Mexico. Maybe the state of Guerrero. Don't expect a normal cup of coffee. They bring you a cup of hot water with a jar of instant Nescafe. Not the end of the world. Also, the air conditioning is completely distracting. It's basically a swamp cooler that is beyond loud when it's on. And they had paranormal activity two playing on TV.Food was decent. Good seasoning, decent portions. My wife asked for a egg, potato, and cheese burrito (she's from California), and got a gigantic burrito with those items plus rice, tomatoes, and lettuce. I asked for basic potato/egg and chorizo/egg tacos on flour tortillas. I got something resembling that on corn tortillas. Overall it is not what I expected which is not their fault. It's okay, not great."], ["Charles K.", "This is the best Mexican restaurant in the city.  The owner takes great pride in his work and it shows in the meals he prepare.  This food is authentic and the salsa is very good.  This place is my favorite bc the owner also makes paleo-friendly meals.  My go to meal is a steak fajita salad and cheese stuff peppers."], ["Tammy E.", "We asked the Chef to create three dishes for us.  We were not disappointed.  The food was beautifully presented and was absolutely delicious.  I'll never order off the menu again.  The salsa is the best I have had in Montgomery.  I can't wait to bring the kids back for dinner!"], ["Jason K.", "Authentic Mexican joint!!!! Service was great, friendly staff, drinks always full, and very clean. Yes, it's a bit off the beaten path. Yes, it's kinda looks sketch. However, it's the best Mexican food in Montgomery, period! It's worth the drive!!!"], ["Doug C.", "We have ate here several times.  The food is always good and fresh.  The tacos are the real deal.  I've had the pastor, carnitas, barbacoa and chicken tacos.  All good.  Today we had the fajita tacos.  Spicy but very good!  If you are looking for real mexican food,  give LA Coronilla a try."], ["Heather C.", "Since the closing of my favorite taqueria (El Cantaro), I have been on the hunt for another sit down Mexican restaurant that serves authentic cuisine. After eating at La Coronilla a couple of weeks ago, I can say that I have found my new favorite! First, the owner is fantastic. I went by and had no idea what I wanted. He spent about 10 minutes chatting with me and suggesting options (most of which were not on the menu!). I ended up with beef cheek tacos, guacamole that they made specifically for me, and pineapple water and horchata. They make all of their horchata and fruit waters daily, and you can absolutely tell. Everything served felt incredibly fresh. As a warning, the food is spicy, so if you don't like heat, be sure to let them know."], ["Daniel D.", "The best Mexican food in Montgomery, period. This place is pretty far out there, but it is totally worth it. It absolutely stomps one of the most popular places in town. I'd rather not call them out as it is not necessary. Just get up and head over to La Coronilla you won't be disappointed."], ["John L.", "Food was so good.  Ate Mexican tacos. Authentic Mexican food. If you like Mexican and want the real deal stop at this little joint"], ["Bob B.", "Solid 4.5 stars.  I'd give a slight edge to Rico's Tacos but for a sit-down Mexican food restaurant it's a great spot and way better than the other places I've sampled in Montgomery.  amales have been good, as were the tacos.  I actually liked it better than the old El Cantaro and it doesn't even compare to the Americanized stuff - Jalapenos, Ixtapa, etc.  Give it a shot."], ["Robert B.", "Best Mexican food I've ever had in Montgomery!  I had the mole queso enchiladas for lunch with a Mexican coke (real sugar!).  Everything was such a surprise compared to normal bland Mexican food around town.  Compared to this, the best I have found is good Tex-Mex food, but this is much much better.  La Coronilla does not look like much from the outside, but trust me, it is really good on the inside!"], ["Steve S.", "Best real Mexican in Montgomery. Prices are outstanding. Address is incorrect use this 32.393099, -86.212018 to get there. It is north on 231 about .5 mile past Atlanta HWY on left side (frontage road)."]], "Las Casitas Mexican Restaurant": [["Deborah C.", "Great Mexican place! Very clean.Superb service, Chips/ drinks were always full. DH got carnitas- lots of onions, meat was a bit tough. My mother ordered the enchiladas and loved them, I ordered the steak soft tacos. Delicious!"], ["Jeff M.", "Worst Mexican restaurant I have EVER been in.  Ever, ever, ever, ever been in.  Chili Relleno was burnt and was really more poor quality ground beef than anything else.  Actually it was a burnt chili skin over something that looked like a bad meat loaf.  The taco was meager and the enchilada was...., well you can guess.  When the manager asked how the food was I told him and he made no effort to correct the situation.Go to Chipolte and get a quality meal.  Just 5 more minute down the road from this place and SO much better..."], ["Andrew K.", "The food here is not good! There are many good Mexican restaurants around this area, but this is not one of them. I ordered an enchilada and the sauce is way too sweet. I really liked that they have low prices, but after eating the food I see why. Not planning on going back."], ["Bing F.", "Located in a sprawling shopping center, Las Casitas should actually be called Casa Grande due to its high ceilings and cavernous interior that bears more than a passing resemblance to Disney's \"It's A Small World\" attraction. Chips and salsa came quickly and were decent - nice kick in the sauce. House margarita was tasty and the menu is no frills in both design and content. I ordered carnitas, which was a decent portion, not too much, served with a copious amount of onions (yes!), rice, refried beans and guacamole salad.  The pork chunks were a trifle tough but seasoned pretty well. The spicy chipotle sauce was an added bonus. That and I got four tortillas instead of the customary three. I love rebellion. The cavernous interior makes for somewhat of a noisy dining experience and the music is faint unless you're seated by the bar. Service was quick and friendly, prices were right.  A right worthy stop on life's highway."], ["Russ G.", "Same ole same ole Mexican food you get at any other place. I had \"J\" which consisted of a chicken taco, chicken enchilada and a ground beef chili relleno. Bland, needs more flavor, no more salt, enchilada sauce had plenty. Salsa tasted like it had ketchup in it, service was fast and friendly. If your looking for a quick fix and not Taco Bell, this is the place!"], ["Red S.", "Visit was on a Saturday evening. Was greeted at the door promptly. Cleanliness of dining room was above average. Chips are served warm. Salsa had good flavor, it was puréed style salsa with smooth texture and with a medium level of spicy to it. I ordered the guacamole as well to go along with the chips and salsa. The guacamole had a whipped and light airiness to it. It was a bit on the bland side in regards to flavor and spice and I didn't detect any hints of citrus in it. For the main course I ordered the Grilled Shrimp tacos. The shrimp had good seasoning and were juicy. The meal is served with refried beans, lettuce, Pico de gallo, sour cream, and guacamole, served on a separate plate. The shrimp are served wrapped in flour tortillas, which is wrapped in aluminum foil. It made the tortillas soggy served as such. It would have been improved by having the tortillas wrapped on their own without the moistness of the shrimp and steam. The refried beans were ok. They had flavor and seasoning to them which is better than many places that just open a can, heat and serve. I did not get the impression that anything was made from scratch, which, admittedly in don't expect from most Mexican restaurants. It's difficult to give a review of the Pico de gallo since there was such a small amount served on the plate. The atmosphere was family friendly, not too loud and spacing is adequate. Appears very ADA accommodating as well. In summary, I would say this establishment rated fair within its class as far as Mexican restaurants located in the area. I have been to far worse! It lacks the freshness and authenticity, but, this is mid Alabama, and that isn't uncommon. For the average family used to the commercialized Mexican food , this place will more than satisfy you. Overall, the portion sizes were adequate by typical American standards (way too much food for me to eat in a sitting though). If you are searching for true, made from scratch Mexican food, this will leave you desiring more."], ["Nick M.", "The service was great but I was unimpressed by the food. The complementary salsa was outstanding and the chips were good and fresh. The servers kept our glasses and salsa dishes full. I ordered a combo plate with a flauta, chili releno and chicken quesadilla. The food was ok but the quesadillas my wife and I make at home were better. Rather than thin strips of meat the chicken was in large chunks. This seemed to be the same chicken in the tacos and other dishes and while tender they didn't have much flavor. While the food didn't wow me I was very reasonably priced (my bill was a bit over $10). If you're looking for low-threat, 'American-ized' Mexican food that's cheap with good service this is the place for you. But don't come expecting anything special or authentic."], ["Mark C.", "Followed Craig's advice and ordered carnitas.  They were excellent and way more than I could eat despite my big appetite.  What an excellent value."], ["Becky S.", "Delicious!  And seriously great service.  The key was the special hot sauce.  The yellow one was fantastic!  We got the spicy shrimp and the tampiquena.  Both were solid.  Also the top shelf margaritas were winners."], ["Dale E.", "To me Mexican food is almost  always good, but seldom special.  This place is definitely above average.  My shrimp tacos and my wife's enchiladas were both very fresh, hot, and tasty. Service was friendly and efficient."], ["Tanica B.", "Definitely ask for additional salsas if you like a hotter salsa. Service was pretty good. We had a group of 14 and they got us in quick. I had a peach margarita and it was delicious! I had the enchilada combo with cheese sauce and rice and beans...again pretty tasty! Overall great experience!"], ["Holli D.", "Just ate a wonderful meal for $5.95 of a soft chicken taco that was delicious, refried beans which could have used more cheese & a side of jalapenos. I ordered al carte menu. The chips were warm and plentiful. The salsa was good. It was a basic tomato sauce with a little cilantro. The service is fantastic here. I told the waiter I wanted some extra hot sauce. He smiled & asked if I really like spice. I replied \"YES\"! He brought (for free) a red hot chili pepper sauce that was perfect, a green ground jalapeno sauce & the KICKER a yellow something that I could only put in my mouth once. I could tell by the burn that it was a sauce that would build on you and leave you begging for MILK!  They only lose a star for the just \"good\" salsa. I could use A LOT more cilantro in mine! ;)"], ["Tanya S.", "I was pleasantly surprised with this place.  After living in Texas for about four years I grew accustomed to bland Mexican (really Tex-Mex) food so I was expecting the same from this place.  It is not the best I've had but it was pretty good. For starters you get the complementary chips and salsa.  After looking at their large menu, I ordered the Burrito Relleno and it was delicious.  I was surprised at how well seasoned it was.  Other people I was with were very satisfied with their orders as well.  As far as the service goes, I was very pleased.  Our group was about 50 people (graduation dinner) and service was excellent.  Food came out fairly quickly and no one's order was messed up.  The price was excellent.  Our drinks were always filled and overall was a great experience. I paid just under $10 for my meal and a drink and this was at dinner time.  Great little place.  I recommend it and would definitely go back."], ["Craig S.", "The hidden gems here are when you go outside of the normal \"Mexican\" food items. The pork carnitas are great as well the the Tacos Carbon. The service is the best of any restaurant around period. Ask for the other hot sauces and they will bring you a sample of three different sources to try."], ["AJ M.", "Outstanding service, our chips and salsa and drinks never got low.  The food was good (a little bland for my taste but I'm used to Tex-Mex) and the atmosphere was great."], ["Sarah L.", "I LOVE this place! I go there often because they have the best service, food and drinks around! The atmosphere is fun with its colorful walls and openness. The waiters always make sure your glass is full and make sure to check on you."]], "Cucos Mexican Cafe": [], "Tipico De Mexico": [], "Jalapenos Mexican Restaurant": [], "No Way Jose Grill Cantina": [], "Salsaritas Fresh Cantina": [], "Tacos Favorito": [["鳥巢", "Great service! Food is authentic. Tacos and tamales at $2. Very delicious. Half the restaurant is full near closing time, but spacious enough to not feel crowded. try it out!"]], "San Marcos": [], "Taqueria \"El Campesino\"": [], "El Chido": [], "Jalapeno's in the Alley": [], "El Rey Burrito Lounge": []}