{"Old Mexico": [], "D' Road Cafe": [], "Michael's Table": [["Angi S.", "Hands down one of the best restaurants in town. The staff is always super friendly and extremely knowledgable. The menu changes seasonally to utilize great and fresh ingredients and the chef is highly creative with the menu. The decor is hip and the cocktail selection is fascinating.The spinach salad is one the best I have ever had anywhere and this is a fantastic restaurant for a romantic dinner or a fun get together with friends.If you haven't had brunch at Michael's Table then you are missing out on one of the best things about Montgomery"], ["Foodalicious X.", "Loved it!  Best food in Montgomery!  I used to live in Montgomery, but I moved to Los Angeles where I have amazing food options.  While in town for the holidays, I've had horrible food everywhere except Michael's Table.  Thank goodness for this restaurant or my trip would have been a culinary nightmare.  Best thing of all was the panna cotta.  Mezze platter was 2nd fave.  Here is what we ate:Apps:  Baby Belle Gouda wrapped in Phyllo Dough and Baked with Dried Fruit Compote (Good)Mezze Platter (Fantastic)Dinner entrees:Tamales (Mom said these were amazing)Spaghetti (I had to get it without the meatballs since I'm vegetarian and it unfortunately has all the cheese and red wine sauce on the meatballs only so I had to get my pasta with just a tasty tomato sauce and had cheese grated on top.  It was good but I would have preferred the 4 cheeses and the red wine sauce that comes with the meatballs...but sans meatballs).Desserts:Panna Cotta with Strawberry Sauce (This was the best thing we ate. Please go there just to get this out of this world panna cotta. I've had so many panna cottas in various cities and some have disappointed.  This one was as good as some of the better ones I've had in Los Angeles.  I could eat Michael's Panna Cotta every day of the week!  I hope he keeps it on the menu since it is the number one reason we will go there).Chocolate souffle bread pudding with chocolate ice cream and pine nuts (Good. I'm not a fan of chocolate, though. It didn't compare to the panna cotta for me, but I'm biased against chocolate.  I would have preferred an actual souffle, though.  It was kind of like a flourless chocolate cake crossed with a brownie but very gourmet.)Coconut Pie (good, but it was my least favorite. Didn't compare to the panna cotta).In short, please support this restaurant so that Montgomery always has a really delicious fine dining option that is comparable to big cities on the west coast and in NYC.  I would be so sad if it ever closed."], ["Joe M.", "Hard to find if you are not from the area but worth it. Authentic Vienna Schnitzel and Blau kraut. Great atmosphere and good service. Cozy warm feel of the place. We hear the spaghetti and Balls are great but more than we were looking to eat. Definitely worth a visit."], ["Norm M.", "I usually do reviews via another site. I've recently started using Yelp, and I had such a horrible experience, I'm doing it on both of this sites. Where to start??1. Went with a group of 6 co-workers for lunch. We were seated by a waiter right away, who started taking our drink orders. The chef rudely interupted him and berated him while we were sitting there. That didn't bode well. 2. The menu was small, and you could tell that this was trying to be a \"foo foo\" type restaurant. But I was uneasy about the atmosphere, and the waiter.3. The waiter came out with drinks, and after handing out half the drinks, he ended up having a couple glasses fall off his platter, dumping their contents down the back of my co-worker. My co-worker, who is a very stout individual, handled the situation very well, and quite graciously. I would have been quite pissed, and would have said something. So, after the apologies, my co-worker walked to the bathroom to try and clean up.4. As my co-worker walked to the back, we all smelled this horrible stench. It was obvious that there was sewer gas leaking from the bathroom in the back. It made your eyes water, it was so powerful. It dissipated, but then returned when my co-worker walked back in. It was strong enough that we actually asked to be re-seated outside. 5. The food was ordered, and was delivered. I ordered a grilled cheese and soup. The portions were small, and the food was bland tasting. One of my co-workers quipped, \"can we get lunch after this?\" A co-worker had a Caesar salad; the dressing was on the side, and the lettuce was actually warm. The dressing was funky smelling, like it was left-over. I also heard other co-workers mention that the tuna they ordered was similar to canned tuna. 6. After finishing, we all noticed that the linen napkins had left white fuzz all over our clothes. The waiter, who was quite nice, went to his car and got us a lint roller to help remove it. I cannot understand how this place got such rave reviews. We were the first customers of the day, and it was a mess. I would say that this was the worst lunch I've had...ever. I don't blame the waiter..accidents happen. But it was obvious that there are issues occurring at this place, and I would NEVER recommend this. BTW, a small bowl of soup, grilled cheese...was $8.00. Uh, no. Never again."], ["Brad S.", "Any restaurant that puts spaghetti on their lunch, dinner, and brunch menus is going to raise some red flags from me. Michael's Table seemed to have just a little bit too much presentation, a little too many closeups of Michael, and - as it turns out - a little too many cookbooks, knickknacks, and falderal cluttering the otherwise cozy space. Thankfully, I wasn't eating any of these things, choosing instead to hedge my bets on the cheaper Sunday brunch menu along with my favorite brunch item, eggs benedict. No English muffin to be found, this interpretation began with a base of smoked salmon, topped with a latke, crowned with the poached egg and hollandaise, and flanked with some minced red onions and capers. It was a fairly small plate, but one that did some smart things: the smoky salty salmon has a level of complexity that exceeded the ham it replaced; the potato pancake simplified the redundant starches of your typical hashbrown-muffin combo and was fried well enough to somehow hold up against the sauce; the red onions provided texture and freshness; the capers provided a bit of a sour bite. What really impressed me was the hollandaise, and its light and velvety texture the best version of the sauce I've had in a long time. It's a shame the poached egg was overdone, but given the other components of the dish, I'm inclined to look past the mistake.Other elements of the meal were pleasant, too, minus a $10 take on a mimosa that didn't justify its price. A gazpacho starter was a simple and fresh way to highlight vegetables, and ending my meal with a slice of vinegar custard pie was not only an indulgence in a lesser-known Southern specialty, but one that had more depth than its buttermilk cousin. They tried to cover up the separating (and a little dry) outer crust with a half moon of whipped cream, but it wasn't fooling me. I'd still order it again.Michael's Table is not infallible, but it is capable of presenting some creative and generally successful takes on ordinary menu items. Even the spaghetti looked pretty legit, once I saw someone order it."], ["Lanie T.", "Researched restaurants in Montgomery for Sunday Brunch, and settled on Michael's place because of a user's description of their version of eggs Benedict.  We called about an hour ahead and got a reservation right around opening time (11:00) -- arrived and there were already 3 tables and a single person at the bar. The space is small and quaint, with an eclectic collection of art, cookbooks, and different religious iconography (crosses, menoras, Buddhas).  We were seated promptly and brought water right away. Our server (a very friendly gentleman) told us about soup and specials and got us 2 bloody Mary's. They were tasty, not too spicy, not too bland.  I settled on the Benedict, of course, but was a little sad that they didn't have the smoked salmon like the user that sold me on the place had raved about.  I opted for grilled ham, and my husband actually decided to try the spaghetti and meatballs. Their Benedict was very flavorful, potato latke instead of English muffin, and a creole hollandaise that was very tasty.  I think the onion and capers could have been left off because it just isn't needed without the salmon. Our server did say that Chef Michael would be starting to smoke his own salmon soon to get it back on the menu.  My husband's spaghetti plate was huge, with 2 generous meatballs. He ate most of the meatballs and sauce but little of the pasta, it was just a very large portion.  We both really liked the meatballs, flavorful and tender. We were happy with what we chose, and glad we decided on Michaels. I would go again when passing through."], ["Wes S.", "Those who say the Gump has no class are the same who haven't tried Michael's Table. This spot blends elegance with a pleasant coziness in a unique fashion that makes it worth the time spent finding it in Zelda plaza. There's plenty of Italian influence (wine list, pasta selections, chicken scallopini, etc.) to make it a romantic date night, while there's also enough Southern hospitality (brew selection, braised ribs) to make you feel at home. My wife and I started with Sauvignon Blanc along with the Tarte De Jour (guiltlessly delicious), and then enjoyed the Spaghetti and Rissoto, both dishes we could have made at home but nowhere near the quality we received. Our waiter was professional, kind, and attentive throughout the meal. He guided our wine selection, held our entrees while we took our time on the appetizer, and boxed our left-overs without the slightest prompting. The other waiter was just as friendly as we departed, despite the fact that it was several minutes past closing time. If you're looking for a place to celebrate the mid to high victories in life in a relaxed and comfortable atmosphere, then this is your place!"], ["Sandra L.", "Great gem in Montgomery!  Quiet and quaint atmosphere with tastefully funky décor.  We really enjoyed our dinner and our server was outstanding.  I had the salmon special, which was nicely spiced and prepared though odd to place it on a bed of cheesy penne (though it was delicious).  My husband had the spaghetti and meatballs and loved the al dente pasta and spicy sauce.  We will be back."], ["Paul H.", "Michael's Table was not worth the money, and was an embarrassment that we suggested it to guests.Jager Schnitzel is a Schnitzel - with a mushroom sauce. But not at Michael's Table. And the waiters talked to us, like you stupid Alabama hicks, this is Jager Schnitzel. The group we had included people born in France, and people that lived in Germany. It was a Schnitzel, period.Two years ago - we gave this top marks on everything. 5 stars. But now, the waiter staff is BAD, the Bathroom was dirty, and the food was not what was listed on the menu.The bottle of white wine we ordered was warm. Asking for a bucket of ice to chill it, was again meet with you dumb people, no one chills white wine response.And it came to the table pre-opened?"], ["Woodward L.", "We were there for the Monday special.  Appetizer, salad, desert, and a choice of two entres.  The food was good though there should have been more choices in the entree.  We could choose a chicken dish or a veggie pasta dish.  I would have liked a meat or fish choice too.  Overall the service was excellent, the food good, and the wine list superior."], ["Jacob H.", "I reserve 5 star ratings for the truly exceptional dining experiences. That being said, I have no reservations handing down this 5 star seal of approval. The drinks are artistically crafted and the staff is knowledgable and uber friendly. Our waiter, Shane, patiently and painstakingly went over the menu and drink selections with my party of 6 and deftly matched our unique tastes to the selections offered on this evening. The menu changes frequently at Michael's table so you get opportunities to expand your palate if you dine here over a couple weeks time.  I was originally disheartened on this experience as I was unable to secure a reservation late Friday afternoon. I left a message on the machine requesting a call if things changed. Within a hour, Michael contacted me about a cancellation and we were able to secure a reservation. Thanks for a wonderful night. I can't wait to see what's next."], ["Michael H.", "Brunch fail. Kitchen took over 50 min to prepare meals for a group of 12 people with a reservation. Several dishes were served cold. Eggs were over cooked. Very limited brunch menu. Would not recommend for a group meal."], ["Alyssa M.", "We ate here last night and LOVED it! It's kind of hidden, but an amazing find. The service was the best we've had in a while and the food was delicious. The server politely explained that the were out of the beer I ordered and offered several suggestions and let me know that they'd happily take it back if I didn't like it. So, he let me taste it as if it was a bottle of wine...kind of funny and out of the ordinary. I hate sending things back so it was gracious of him to give me permission in a way. Of course, we didn't want send anything back here!! I had the tamales which were large, and perfectly prepared. Honestly, the best tamales I've ever had--uniquely prepared, but true to the roots (I can't even fathom how to make these better!). The chef was so attuned to the guests' needs that he looked out at our table to see who had ordered the steak du jour. When he saw my boyfriend he went ahead and gave him the biggest slice of beef he had to serve. Overall, personalized, impeccable service, delicious food. I can't wait for the chance to go back."], ["Candice R.", "I was lucky enough to sit outside on what was supposed to be a blistering 90 degree day. Instead it was mid 80s with the best breeze. I ordered a glass of wine and a salad, and finished with a key lime pie. Everything was very good, but I felt that it was a little pretentious. The server was very nice, but insisted on being extremely formal. Now, that's ok, but when you are mispronouncing \"du jour\", perhaps double check on the proper pronunciation or take it down a notch. Also- the reason I sat outside was because the bar was tiny, with only about 4 seats and there was somebody sitting in the middle of them. It was also a bit tricky to find. I ended up having to drive around the entire strip mall to find it. A sign pointing towards the restaurant might be nice."], ["Rob T.", "For this self-proclaimed \"foodie\", Michael's Table is an Oasis in a wasteland of Blah.Michael's Table is an intimate, hospitable, and gracious dining experience.The food is fantastic.  Chef M is always tweaking the menu!....so it is never quite the same experience.His restaurant is the only one where I ordered an interesting drink concoction....enjoyed it....then had the chef come to interview me because I was the first to order it!!(I'm still trying to concoct it at home--sans success).Don't let the location fool you!This restaurant is wonderful!"], ["Heath N.", "Went for dinner last night.  Right next to Zoe's Kitchen in the shopping plaza.  Made reservations and they called a few minutes after our scheduled arrival to see if we were on our way.  Found the place, Waitress gathered up menus and took us to our table, she was great, a pretty blonde lady who was pretty opinionated about the menu (not a bad thing). Got a glass of wine, my son ordered a Roy Rogers.  The wine she recommended was good.  The hostess/bartender/manager(?) came to the table a few minutes later and wanted to know what a Roy Rogers was... hmm.  The bread they brought was very good and a nice start.We ordered the Nosh plate.  The chevre and manchego were fine.  we'd ordered fried olives, but they were just regular brined ones. The smoked salmon and soprasetta were good, the pate' was fine.  They serve it with warm pita bread, which is an odd choice for a plate like this. 5-10 minutes later, we're less than half way through our appetizer when our mains show up, the waiter takes away our small plates and puts our mains downs.  No idea why, but I've never felt more like I was being rushed out of the restaurant.My son had ordered the filet, it was OK.  The egg, potato pancakes, grits and bacon were just too much with it.  But what was a sin was the greens.  They were crunchy. The waitress saw the look on our faces, I said they were underdone and had him scrape them onto a plate she said they'd wilt them.  They came back a few minutes alter, of course they were still crunchy.  My softshell crab was way overbattered.  The dirty rice with sausage was not good.  Gritty, lumpy, and the sausage tasted sour.  Sat like a lump in my stomach for the rest of the night.  They did comp a healthy part of the check and the waitress was great, but this wasn't the experience we were looking for."], ["Beth D.", "After moving to Montgomery from VA, we have struggled to find a \"decent\" place to eat...  Michaels Table was that reprieve!  Our experience was 5 star without a doubt.... and the food was equivalent to a bigger city's fare.... it was exactly what we were looking for.  We had a reservation (recommended, but not necessary), and were seated and fresh hot crusty bread and spiced olive oil was brought out immediately.We had reviewed the menu online and even though we went for dinner, we requested an appetizer that was specifically for lunch, and the chef sent it out.   The pizza Margarita was full of fresh flavors, a light crust and pesto to top it off... delish!  Then I ordered soup, which was great, my husband had a fresh salad.  The vegetables were crisp and flavorful, and the salad was lightly dressed.  Our main courses were HUGE, HUGE, HUGE, and full of flavor.  The restaurant cooks to order, and the taste proves it.  Once our left overs were boxed up, the hostess brought out a glass of champagne for my birthday, that was on the house...  and that was very tasty as well.  We then ordered dessert, bread pudding (OMG) and key lime tartlet (OMGOMG), and though we were filled to the brim, we let none go to waste.  Chef Micheal then came out and asked us about our meal. The service was superb, the food was a step (or 2, or 3 or 10) above the rest of Montgomery, and the price was VERY reasonable.  (about $70 for all the above!!) I was happy to see a menu with \"fresh\" written on it, and a menu sans \"fried\".... Unfortunately when we were leaving another party walked out (after seeing the menu, saying loudly \"the only thing on this menu is a $30 piece of beef\")...  we were disgusted that they didn't give it a chance, but chalked it up to the lack of food culture in the south...  IMO.  GO HERE- if you like \"cuisine\" not just chain restaurants, you'll love it.  SUPURB!  Best resturant in Montgomery, great atmosphere, great service, we will return soon!."], ["Paul A.", "I took my mother in law for her birthday.  The reviews here are spot on:  It is hard to believe this restaurant is in Montgomery.Everything we had was delicious and perfectly prepared.  The Portuguese shellfish was exceptional.  I also tasted the Jager schnitzel and the Shrimp crab cake.  The wine list is well paired to the menu.  Michael's is amazing.  I would eat here every week if I lived there."], ["James P.", "I had the Pot Licker Stew (This was great), Warm Spinach Salad & Steak Diane, while it was good, it wasn't great and the server was a very nice and helpful guy, but a little on the slow side (I think he may have had too many tables)."], ["Robbie M.", "Wow... It's hard to know where to begin in this review, but seeing that \"wow\" was ubiquitously the first word uttered after each bite, that seems most fitting. My wife and I discovered Michael's Table via Yelp today on our drive back to Nashville from the beach. It's about a 5-10 minute detour from I-65, and worth it 1,000 times over (no seriously - we are already thinking of any reason imaginable to make the trip from Nashville just to come back here!)We had the best waiter imaginable who truly treated us like family - warm, welcoming, and attentive with terrific suggestions. Their menu changes monthly, so it's probably not worth my while to describe each dish, but I can tell you that every bite was truly heaven. I would eat here every day of the week if we lived in town. (for reference, we had the gazpacho, table salad, open face Asian pork sandwich, chicken salad, cheesecake, and gelato - all a review in and of themselves, and certainly all 5+ stars). The atmosphere is very charming and has a European, Old World feel about it with hundreds of cookbooks along the wall and behind the bar - each one having surely been poured over to sift out the most amazing, unique creations that you are able to enjoy. All in all, Michael's Table is not to be missed and will be worked into all of our future travel plans!"]]}