{"Midori Sushi": [["Holli D.", "Yes, Yes, Yes....Korean at it's BEST!!!! Not sure why this place is under Japanese & not Korean, but oh well.....It is a hole in the wall...which I love!!!! At first I was a little turned off by the waitress as she handed me a menu that had English written across the front & was full of regular old basic Korean & sushi fare. I was like, um, I would like the Korean menu please. She handed it to me and stared at me...it was all written in Korean! I pointed to a picture and said I want THAT!!! She said many times \"it is very spicy\"! I wanted to be like yes, I know my Korean foods, I know my spice & I like it HOT! She brought out the traditional Korean side dishes and again emphasized the spice levels....ugh...lady I know I am white, but geeshhh!!!When she came back with my food, I had already inhaled the kimchi! She said you like.....I said I LOVE!!! It was the hottest kimchi I had ever had & I loved every crying moment!!!!Now onto the meal.......this gigantic bowl came out of soup with muscles, rice cakes, squid...lots of squid......it was truly enough for 3 adults! And by far the most magnificent flavors I have EVER put in my mouth!!! This was an amazing meal!!!  What lacked in service in the beginning quickly turned around and to top off this amazing experiences the meal was $10.99 tax and all!!! That is by far the cheapest Korean I have gotten in town that involved that much squid which is my favorite! I will be back!  The name of the soup is Jjabbong Sujebi.**Note: They do offer a sushi menu, but when I tried to order a spicy tuna roll the waitress informed me the sushi chef does not come to work until 3 pm. I was there for lunch. If you are seeking sushi, call first."], ["Danielle B.", "Came with the kids after a trip to the museum.  We had to ask for the Korean food menu since they only gave us sushi menus when we came in.  The Korean menu, as other reviewers mentioned, is written in Korean without any English translation/ description. The waitress understood English very well and made sure we didn't accidentally order anything with shellfish.  We pretty much just asked her to bring us a variety of shellfish-free Korean food for our crowd of 5.  The soup, bulgogi, pork, and noodles were all great.  They also brought out a nice variety of tasty small plates before our meal came.I notice a lot of reviewers of ethnic restaurants here in Montgomery add some details to increase their reviewer-cred.. we are from the DC area and have a lot of experience eating a wide range of authentic ethnic foods (including Korean)."], ["Narongchai W.", "Amazing and authentic! Just as if I were eating in Seoul! If you don't speak or read Korean you might have a bit of difficulty though. I love it!"], ["Teena F.", "How did everyone else get food?  I walked in and they looked at me like I was from Mars.  I was told they don't serve American Sushi and that I needed to go. \"No American menu, no thing in English\".  I left."], ["J.P. M.", "I ate here today for lunch I had the kimchi jigae with some sushi and banchan. It was very good. There menu is really traditional. So dont code here looking for boolgogi etc....there sushi is very fresh, and they give you a lot for a steal of a deal. I also saw on the menu they have all you can eat samgyubsal for like 15 dollars which is not bad, ill have to get that next time. Everything is cooked really fresh. I actually saw fresh plants were they picked the produce to use in the food, that's always a good sign....there prices aren't too bad considering how fresh the food is, and how good the see ice is. Look forward to my next visit."], ["John L.", "This is an authentic Korean and Japanese restaurant - serving home-cooked meals like your Mom would make (if she grew up in Korea or Japan).   The food is exquisite!  The food uses all fresh ingredients and is totally tasty.  One night I had the Avocado roll - most definitely the best that I ever tasted, another night a tofu dish and another night... something else, and along with each meal that I ordered I received, at no additional charge, at least 7 additional small plates of other tasty foods!  The atmosphere and service of the restaurant transports you to the Far East, immersing you in the contemporary culture of Korea.  A jewel of Montgomery!"]], "Sushi Cafe": [["Roberto V.", "I just went here today during lunch (11/24/14). The Bento Box was lack luster because the chicken can't be real. It tasted like McDonalds chicken that was cooked dry and smothered in Teriaki sauce. I physically couldn't eat more than the three bites because it was just awful. The fried rice was a bit dry and sticky (very similar to steamed white rice). I would not recommend getting the chicken Bento Box. However my girlfriend got sushi rolls and was pleased with her meal. What i tasted of her rolls was actually delightful and wholesome. If you go to this place don't expect top of the line meat, but you'll have a good meal if you stick with sushi rolls. all in all a middle of the road experience for me."], ["Josh W.", "Great sushi lunch! Fast, friendly, and attentive staff. Highly recommend for a casual lunch or even a nice business meeting. Great selection of sushi, tempura, and side items. Clean, comfortable, and very inviting atmosphere."], ["Margaret C.", "I picked up takeout from here while visiting my parents.  I ordered the Daniel special roll and it was delicious.  I really wasn't sure what to expect, but trusted the reviews on yelp and I wasn't disappointed.  I would love to eat in the restaurant sometime and try more options with my husband.  But as for takeout it was fast and yummy.  I will definitely go back."], ["Luis S.", "The food was great, the service was excellent, and the time from when we order until the food arrived was good as well."], ["Jami L.", "Love the food and always had a great experience until tonight. We have even booked our company Christmas parties over the years here. We had a company dinner and called to reserve a table for 10 people @ 7pm. We were told they do not take reservations after 6pm ... Really? But we can make a reservation for 5:45? We got here at 6:30 and were told all of our party had to be here to be seated. Then when everyone got here, we were told a table was not available and no one could tell us how long the wait. And one server asked if he could seat us and we explained we were on the list for party of 10. He replied, \"Oh I am sorry.\" And walked away. He seemed like it was a problem that we had a big party and did not want to deal with it. In my opinion as a local business owner, you need to take reservations for your busier nights. Especially for parties of 8 or more. Just a suggestion!"], ["Edward P.", "Intimate surroundings, great for small groups of friends or date night.  Good sized portions for all sushi rolls.  Tempura is very crisp with fresh vegies and the Terriaki beef is well seasoned.  I've been back many times."], ["Kelsey M.", "I luv this place....best sushi In town hands down..... great item to try Daniel roll"], ["Alice H.", "Very good food and service! A friend recommended it recently so tried for lunch today. Looked small outside but inside is  big and nicer than what I expected. Definitely coming back soon :)"], ["Jennifer W.", "This is a nicely decorated,  quaint restaurant, with a delicious menu. The lunch beef bugogi was well portioned and fairly priced. We also enjoyed their sushi :) We will definitely be back!"], ["Katie S.", "I doubted sushi in Alabama....I was wrong.  This place is great!  From the sushi to the service, I loved it!  Food had great flavor and Fish was fresh!"], ["J M.", "The BEST sushi place in East Montgomery!  I seem to always get the #4 sushi combo... Love it.  Environment is outstanding albeit small place, but my wife and I go here frequently.  Very reasonably priced and fully staffed; we never feel like we're waiting on anything."], ["Rodrick D.", "Really good spicy mayo had more of a sweet flavor.  The playboy roll was like a double fantasy but wrapped in seaweed.  Sushi was very fresh! Philly roll was in point as well"], ["Jenny K.", "Inside is very nice and the music is very lovely. Little disappointed in chirashi bowl but their tempura ice cream was very good."], ["Tabitha C.", "This place is sooooooooooooooo small. The sushi is good but the environment sucks. If you're looking to have a private conversation, please go somewhere else. You're literally bumping elbows with the other customers."], ["Jennifer W.", "Our go-to sushi place here in Montgomery. Have tried all of them around here and this is the best so far. For a crazy saucy flavorful roll, the Texas is a yummy guilty pleasure and is crazy loaded up. The seared tuna roll is also good. The times we've gotten some kid of cooked food (dumplings, scallops on a roll), it can be hit or miss as to whether or not it's overcooked (usually is but we typically only get raw rolls/sashimi). Nice, fresh fish. The seafood salad is also very good, huge proportion of dark greens with various cuts of raw fish (tuna, salmon, etc) tossed in a spicy dressing."], ["Julie L.", "Stopped by here to grab a couple of sushi rolls to go (the place is small, so it was the best option at the time to avoid a wait).  It was good as expected, since the owner used to work at Miyako, which turns out good sushi as well.  I'd pop in more often if I didn't spend the majority of my time on the other side of town."], ["Melissa T.", "Yay! Finally a decent sushi place on near the West end of town! For Montgomery standards, this place has excellent sushi and creative rolls. As Bill B had mentioned, since the owner use to work at Miyako, Sushi Cafe has similar special sushi rolls. The restaurant is a bit small, they don't have big tables, so keep your party to a minimum and try to make reservations if you can't get there early. We also noticed that there were non-stop take out orders."], ["Rob B.", "Very good nigiri and decent prices.  Some of the freshest tasting sushi I have ever had."], ["Peter C.", "By far the best sushi bar in town."], ["John R.", "Fresh sushi, friendly service, great atmosphere.  The unagi is gorgeous and melts on the tongue.  The spider roll has a perfect salty crunch in its center, and the spicy tuna - so fresh and delicous.  The Daniel's Roll is a work of art on the plate."]], "Lek's Railroad Thai": [["Wes B.", "Had lunch there today. This place is a usual stop when I'm in town, but this visit was horrible. The waitress forgot about our table and we waited an hour for our food. Oddly, they were able to get us the bill before the food even arrived.  Not impressed."], ["A. D.", "Great food. Prepared neatly with quality ingredients. Atmosphere is nice, opt for outdoor seating. We ordered basil rolls as an appetizer, fresh and delicious! Spring rolls also tasty. Basil beef was tender and flavorful. We also loved the pad se ew and fried rice. Nice place to try if you're visiting and looking for a lunch or dinner spot near the hotels downtown."], ["Esther J. L.", "It's in a hip spot downtown but the food is mediocre. I think the Atlanta Hwy location is a lot tastier but the ambiance isn't as great, for the other location is in a shopping plaza. The service was on point."], ["Beth W.", "Love the friendly staff. You must try the spring rolls. If you are short on time get there early. The spicy fried rice is my favorite entree."], ["Lauren B.", "Ordered carry out on a Monday night. Fast: was ready in less than 10 minutes. Tasty: good peanut sauce with the chicken pud thai. Not spicy. Not dry.Generous portions: had enough to take left overs for lunch the next day.  Came with two scoops of rice next to the noodle dish. A little much!Dine in only looked to have about 4 groups seated on a monday around 6p.Great carry out (or dine in) option if you're staying at embassy suites. Walking distance--it's next door. 5 stars. Can't think of anything not to like."], ["Emma A.", "Love this location. It always seems to be busy which is a good sign for any restaurant. The pad thai is to die for as are the spring rolls. The service has almost always been top notch and the food comes out at a reasonable pace."], ["J J H.", "Pud Thai is always delicious.  Best is the Spring Roll with 'to die for' peanut sauce. And, no, Lek didn't ask me to write this."], ["Scott M.", "I went to Lek's on prom night and I must say, it was probably the best part of my night. The waiters were respectful and always made sure I had something to drink, and my chicken tender and fries were amazing. I enjoyed my visit there and would like to one day return."], ["Chris W.", "Lek's has several locations, but this one is the best.  Lek is a sushi master and makes it fresh.  The food is all good, no matter your choice.  Try the Thai tea or the Thai coffee.  Both are delicious.  Parking can be a major headache, but it's worth it."], ["Steven S.", "Closed for repairs."], ["John C.", "Once again I found fantastic sushi in a restaurant other than a traditional Japanese steak house or sushi house that does it better than the other sushi establishments in town. If you want the standard slivers of sushi, try the Wasabi. Their food is good, but the standard miserly.   Then try Leks and eat hunks of fish.  Well presented, generous, and always tasty.  Their Tai cuisine is outstanding as well.  Good selection, prepared well, and something for everybody.  Service is friendly, atmosphere is pleasant.  It's a great spot, so you have to expect busy on some nights, but ...I always visit when I come to town.  One of my favorite spots."], ["Nina U.", "Ordered an entree that came with a little flavorful cup of fancy chicken soup and the spring roll with thick dipping sauce... my favorite out of my entire experience here! Came on a recommendation from a friend and it was a pretty neat place. Best part was sitting out back in the protected patio area and watching the trains go by. Best place I have eaten in Montgomery all week! Three stars compared to other Thai and sushi places I've been to but four stars for Montgomery...Chicken Panang was okay. Wish I had ordered medium spicy (didn't specify anything when I ordered) and there were huge pieces of chicken, wish it had been chopped smaller (supposed to be easy for chopsticks). The basil was delicious as were the little strips of red pepper..wanted more of that to go with every single bite of chicken. Ginger chicken was okay too- wanted more flavor, more ginger and less onions. They have regular fluffy rice but I love some thai sticky rice or at least sticky calrose rice. I had the \"Crazy\" sushi maki roll with salmon skin, eel, scallion, avocado and asparagus topped with masago. But I think it was actually topped with tobiko and it was good.   Street parking was easy on a Saturday- they don't ticket around there on weekends and after 5 pm during the week. Otherwise they say park on the 2nd floor of the parking garage. Lek's is in the visitor's center."], ["Joe G.", "The good: Food was tasty; probably the best-tasting Thai food you'll find in the Montgomery AL area. The portions were slightly smaller than most places, but it filled you up nonetheless. The bad: Despite being in one of downtown Montgomery's landmark buildings, their outdoor patio didn't resemble anything more than an outdoor patio. You can either face the brick wall, or face the ivy-covered lattices blocking the view of the rail tracks and the river. When they placed us outside, the wait staff seemed to forget about us.  The food took obscenely long to arrive, and arrived at sporadic moments which allowed sections of our party to eat at one time. At work, we live and die by the clock, and this place had no concept of a clock. Stop by if you have nothing else to do that day, but still don't mind going to bed late."], ["Jan S.", "This place was great. The service was wonderful. We were seated right away, got water right away, our order was taken right away and our server was very tentative making sure that we knew when our order was coming up. I love the fusion of Japanese, Chinese and Thai options all on the same menu. I started off with a veggie sushi roll and got the tofu veggie massaman curry. All of it was delish!!I look forward to trying other dishes on the menu in the future."], ["Rob J.", "This is one of my favorite restaurants in Montgomery.  The chicken pad thai and roasted duck are two favorites of mine.  The ambiance is nice, but not very upscale, and the service is usually pretty good."], ["Erick R.", "This is my go-to place in Montgomery. I always get Asian food extra spicy and they really lay on the spice, which is a good thing. Love their food."], ["Heather V.", "Perfect location and awesome food! I know the service is getting bad reviews but it's actually great too.  It's the lunchtime that gets everything backed up so don't let the other reviews bother you!!  I would recommend dinner so you don't have to worry about the wait.  It's in a great location right next to the river so if it's not too hot, eat outside!"], ["Tia A.", "The atmosphere was a little noisy and crowded for my preference. It looks like the outside seating might be a little more spacious and private but it was closed when we went. The menu offered only red curry sauce and no option of level of spice. The staff was friendly and everything was clean and average prices. I wasn't impressed with the food at a and neither were any of my dining pals. Mild to bland curry sauce over dry chicken. Maybe try the green papaya. I've heard it's better Thai not far from here."], ["Erin B.", "The Yum Yum roll and Bama Crunch are delicious!This place was across from our hotel in the train depot. We wanted something light and healthy and sushi usually does the trick for us. The service was extremely quick. We sat on the patio. The view isn't nice but the weather was beautiful and it felt good to be able to eat a meal outside without sweating down."], ["Gabriel J.", "Good food. I had the Kow Pud. Slow service at lunch albeit very busy... finding parking was the worst part"]], "Tokyo Japanese Steak House": [], "Shogun Japanese Steak & Sushi Bar": [], "Chin Chin": [], "Kabuki Japanese Steakhouse and Sushi": [["T. W.", "Another great experience at Kabuki!! Today was just another meal out here with great service, excellent food, and a friendly and talented chef! My wife and I chose Kabuki over every other place in this town to eat for our anniversary today and we were, as usual, satisfied completely with everything. I highly recommend this place!"], ["Michael H.", "Having eaten at several of these hibachi styled Japanese restaurants, I found this one to be little different from the rest. Nothing at all to write home about. The food was good and the seafood fresh, but the portions were much smaller than expected. Just another Japanese themed restaurant with the typical cooktop schtick. I wasn't let down enough to say I can't recommend Kabuki, I've just had better. Oxford, AL's Yume is much, much better than this...but that's two hours away."], ["Reina B.", "The hibachi lunch was good and satisfying but the hibachi chef was a misogynistic pig. I went to lunch with an old supervisor and my wife...all three of us active duty military and two of us with multiple combat tours to Afghanistan. This jerk proceeded to ask us what we did and we obliged with the answer. His response? Women can't do what men do, you're probably secretaries. I was in uniform and kept my cool. But it took every ounce of military bearing to keep from ripping this guy a new one. Another couple at a table ordered double rice on her hibachi...his answer? No diet for you. I love hibachi but he ruined it for us and me. I'll never go back. Hey management, you may want to school your chefs on what it means to live in work in a military town."], ["Yvette N.", "Amber was our waitress! Customer service was very pleasant. I'm excited about the ambience here. Dim lights, neutral, darker colors, trendy feel and background music. I had the lunch special that came with two rolls. I tried the Shrimp Cucumber Roll and the Spicy Tuna Roll. The rolls were simple, but tasty. Over all very satisfying lunch experience."], ["Lucy E.", "Hello,I just stepped out of Kabuki and from all if the reviews I read on here about, 4 of my sorority sisters and myself decided to visit. Upon arrival we sat and asked for hibachi. I was excited to eat and I even ordered a side of California rolls. In a nutshell the food has no taste. I had to ask to ask for several sauces to try and make it taste good. I ordered the hibachi chicken by the way. The California rolls were tart and I asked my waitress to return it once I tasted it. She told me I had to pay for it regardless of IG I liked it. I asked to speak w the manager who stated that no one has ever complained about the rolls so I am wrong and I would still have to pay. Overall bad experience and I don't plan on returning. Sincerely, -out of tower from Atlanta, GA"], ["Michelle E.", "Pretty delicious food! The hibachi was fun and the guy who cooked for us was pretty low-key, which was nice for us since we were talking with friends. I can understand why there's a wait (as much as it sucks) if there are several large parties in the hibachi area. Can't really do much when there's limited seating and the people that came in before you take their sweet time leaving. Overall, I would definitely go again!"], ["Tabitha C.", "This place now charges a service fee of $10.50 to eat at the hibachi grill. Really?!?! So paying $21 a plate and listening to a guy with broken English aren't enough. I have absolutely no desire to eat here again."], ["Scott M.", "My first time at Kabuki's I was nervous because i usually don't try anything outside of chicken tenders but the rice that the chef ordered did surprise me. The soup with the mushrooms were something different but I enjoyed trying something different. The chef was very funny and relaxing and performed for my party while we waited for the food."], ["Dj T.", "The decor was nice. Prompt service. However i don't like over the top service when on a date. Dial it back a tad. NO ONE LIKES WHEN YOU HOVER AROUND THE TABLE WHEN IT TIME TO PAY!!! Sheesh. I felt like i was rushed or unwelcome after the meal. C'mon let me digest and have a conversation with my date! Food prices? Eh a bit overwhelming so no famous sushi rolls for me this time"], ["April K.", "I live in Atlanta and can't find a Japanese Steakhouse that is as delicious as this place.  The fried rice is soooo good that I could easily eat a double order.  The veggies are also delicious.  If you're a vegetarian you have to tell them that so that they don't accidentally let the veggies touch the meat.  The avocado sushi is also really good!"], ["Jaime H.", "The decor is beautiful, the sushi is okay, the service strikingly sub-par, and the kitchen (non-sushi bar) food horrid and overpriced. An appetizer consisting of eight slices of seared tuna thin enough to see completely through (and that oddly enough, didn't taste like tuna) cost $9. That's absurd even before considering the absolutely foul flavor of the \"ponzu\" sauce in which those slices were swimming. This was the second-chance visit. Never again."], ["Shawn H.", "It was ok. It's a small place but the wait was long. The food was good, but I'm in no hurry to return. The staff wasn't very friendly about the wait."], ["Kisente F.", "When I think about a good hibachi restaurant I think of experiencing a good show from the chef showing off his/her skills. I would like the rice and meat served at the same time.The chefs in here do a great job in putting a show. They just need to stop putting so much butter and oil into the rice. Sadly, they serve they rice before the meat. By the time my meat is cooked my rice is in room temperature or gone. There's nothing fancy about their sushi (tried it & won't order it again)."], ["Chantelle A.", "I finally had an opportunity to try the sushi at Kabuki during the Thanksgiving holiday after my cousin raved so much about their 007 roll.  In addition to the 007, we also had the Tempura roll, Spicy tuna roll and miso soup. The restaurant is clean and the service was great although we got our order to go.After trying the 007, I noticed that the ingredients used were very fresh and tasty. I'm officially a fan!"], ["Julie L.", "Good hibachi food, okay sushi.  The sushi room is small, and echoes so much that you hear pretty much every conversation going on (good if you like gossip, bad if you don't want anyone to hear yours).  Come here for hibachi, go somewhere else for sushi."], ["Brannon W.", "On a Thursday night it wasn't too busy, food was as ordered and excellent, and service was great."], ["Joe R.", "Basically, your average Japanese steak house."], ["Melissa T.", "They have some innovative rolls.  Overall it's good, fresh sushi and great service.  I've never tried the hibachi but it looks fun."], ["Theresa B.", "I don't actually live in Montgomery, but my best guess for Kabuki is three stars.  Nothing special, but for a smaller city, it's ok.  Apparently it's pretty popular because there were a lot of people waiting for tables.  Typical hibachi grill set up for a majority of the seating but also some normal tables for ordering off the menu.  Seaweed salad was larger than normal (yum!), miso soup was normal/good.  I ordered the spider roll, sakura roll (spicy tuna + shrimp tempura) and volcano roll.  I didn't care much for any of my rolls...they were just mediocre and very mayonnaise-y and fried...(probably my fault for ordering the fried rolls).  They did seem to offer a lot of different rolls (~30).  If I go back, I'll make sure to stay away from the termpura/fried rolls."], ["Bridgit G.", "I've been to a dozen of these types of restaurants in other states (including going to 2 in Japan). I typically enjoy the experience. Our chef wasn't in to it. I couldn't have my food cooked on the grill due to food allergies (even tho this request has been accommodated before). So I had the curry chicken. It was frozen chicken strips in a very thick sauce that was like gravy. Seemed like an attempt to do authentic India but fell far short. It tasted and looked more like something out of a can. The food that did come from the grill was okay. So most likely not going back."]], "Osaka Sushi Bar": [], "Satsuki": [["Ändrew L.", "Wow this place is great, they were so nice the sushi I had was great, it was made fresh unlike some places, already rolled and it's been sitting there for a few hours. Definitely a place to go back. And the price is very good"], ["Julie L.", "Came here for sushi lunch - prices are good, but the sushi is \"meh\".  Spend a little more and head to Miyako or Sushi Cafe instead."], ["Kevin P.", "Okay so I would give this a 3.5 stars if I could.  I almost want to bump it up to a 4-star just because we're talking about Japanese food in Montgomery, AL.  I just can't though.After craving some Japanese food my fiance and I  found our way here via Yelp (Thanks!)The sushi list was pretty extensive.  The menu overall was nice and also includes some korean dishes... hmm.. Okay, anyway the Bibimbap wasn't bad though.  Though the sauce that came with it tasted underwhelming.  We had the \"Volcano\" sushi which was a baked roll.  Came out tasty enough.  The sushi-chefs looked young!  It was worth the trip.  Plus everybody that worked there seemed very approachable and attentive.  Worth going back again :)"], ["Austin C.", "I have eaten sushi from Atlanta to California. This is the best Sushi I have ever had!!! Try the Ninja rolls!"], ["Melissa T.", "We were quite surprised to find this place with three occupied tables on a Tuesday night. That was a good sign. We ordered a variety of food: sushi, sukiyaki, yakisoba. So we got a taste of the sushi bar as well as the kitchen. Overall, the sushi was fresh and the kitchen food was tasty and filling since they gave us extra fried rice with the sukiyaki (on the house). My father-in-law's biggest complaint when we go out for Japanese is that the food doesn't fill him up. Not here.  Also, our waitress was very sweet."], ["Don S.", "I loved the sushi at this place.  And I don't even like sushi. 'nuff said"], ["Emma L.", "Sushi rolls I ordered were fantastic"], ["Mr And Mrs M.", "Yummy sushi and good customer service!"], ["Ashley J.", "If you're craving specialty maki rolls or Japanese food, this is definitely a place to dine at. The sashimi is fresh and there is a wide selection of sushi.  Katsu-don is pretty good as well. Price is reasonable. I would visit this restaurant the next time I'm in town."], ["James P.", "I agree with another review that the sushi here is at least tied with Kabuki for best in Montgomery.  Very fresh, and the chef offered us a delicious salmon amuse-bouche after we finished the rolls we'd ordered.  The service is also extreme friendly.Unfortunately, the teriyaki stir-fry was a disappointment, and probably the worst I've had anywhere in town -- super-greasy ball of fried rice reminiscent of cheap Chinese takeout, and vegetables that looked like they'd been dumped out of a bag of frozen mixed vegetables and then boiled for an hour.  Rather than the big, blanched pieces of broccoli and cauliflower you typically get with this kind of meal, there were tiny diced-up wilted pieces of broccoli, carrots, and green bell peppers (?).  No water chestnuts, onions, mushrooms, bok choy, ginger, snap peas, or anything else to add a little interest.  Also over-sauced and consequently very salty.So, stick to the sushi."]], "Lek's Taste of Thailand": [["Marcie G.", "Great service!  The tokyo rolls are out of this world!  Sushi is fantastic at this place."], ["Nia W.", "Good food. Decent portions. Good prices. Quick service for take out like maybe 15 min. My only issue is they don't have a website. They said their customers know the menu. I live out of town so I didn't know exactly what they offered. But I told them what I wanted and they cooked it even though it wasn't on the menu. I would recommend."], ["Amber A.", "A client brought me to Leks- located in an old train station downtown Montgomery. We got the crab Angels- fried wontons w a creamy cream cheese and crab w dipping sauce. For entrée I got Red Curry w chicken and broccoli which was D-licious! They had covered outdoor patio and a crowd for lunch! Also had sushi but I didn't try this trip..next time!"], ["Connie W.", "Don't go for lunch.  I've always enjoyed the food but I am disappointed with the service.  Today was my last visit after many previous visits. I watched other parties come and go as I spent an entire hour and a half lunch period waiting for my food.  I waived down the waitress and then continued to wait...My party of 5 and I finally paid the bill and transferred our food in to go boxes.  We no longer had time to eat.  Instead my lunch spent the day in the office fridge.  There was no apology, offer of a discount, or other explanation.  An hour and a half wait for food is ridiculous.  The waitress said, \"see you next time.\"  Really?  No thank you."], ["Kelton S.", "Great little place to eat. Staff was super awesome and food was great! I had tofu pad tahi and my girlfriend gor chicken pad thai. Was also got the soft roll in tofu which was great!"], ["Matthew S.", "I like to check for consistency and usually hesitate to post a review until confident.  I've eaten at Lek's 3 times.  Tom Kha Chicken- fresh, tasty vegetables, chicken is very tender and full of flavor, taste of the soup is fantastic with just the right amount of tang from the coconut.  I like the Hot, I believe I could order Thai Hot and be fine with the taste.Basil Chicken - crisp vegetables, succulent meat, great flavorRed Curry - great flavor, fresh ingredients, and again perfectly cooked meatEverything I've seen from the kitchen leads me to believe they have the same consistency throughout their Thai dishes.  Also, they are the best Thai place in Montgomery.  Recipes remind me of my wife and mother-in-law's cooking."], ["Candice M.", "I always make it a point to visit this restaurant when I'm visiting my relatives in Montgomery. As a lover of Thai food, I feel pretty confident in saying that this is five-star Thai food! They get everything right--from the crispy veggies and perfectly fried tofu to the excellent service. To top it all off, they are super friendly and accommodating. Definitely give Lek's Taste of Thailand a try!"], ["Jennifer P.", "Love the California rolls. Loved the beef and bell peppers in chili sauce. Only Wished for fried rice instead of plain."], ["Crystal T.", "Best Thai food in the 'Gump.  Delicious pud Thai, spring rolls, and red curry.  Taste of Thailand soup is great too."], ["Gina B.", "If you want Thai food in Alabama, then come here. Leks is far and beyond the best thai in the state (And I say this having lived a year in Thailand!). The spring rolls are among the best I've had anywhere the world, being crispy, flavorful, and spot-on in taste. The Pad Thai is great. The red and green curry dishes are great. The hot pot and fried rice dishes are a decent choice as well. Sometimes they have mango & sticky rice, which is delicious! The sushi is decent, hit or miss depending on what you get. I'd recommend the Auburn roll. They have many other choices in a cute, Thai decorated place. If you like Thai food and stick with one of the aforementioned dishes, you won't be disappointed."], ["Jeanne J.", "Every time we visit our family in Montgomery we go to Lek,s! Every time we go the food is fabulous. This time we ordered Tofu triangles as an appetizer,the tofu was fresh and soft and the sauce they serve with it is a perfect contrast, just a little spicy.We each ordered an entre. I had Tofu Curry , the veggies were crisp and the sauce was a wonderful green curry. Delicious. We ordered a Chicken curry with red sauce that was Devine. We haven.t had a better Thai meal anywhere. We highly recommend this location. We have not been to the Railroad location."], ["Matt W.", "Lek's Taste of Thailand is a great choice for Thai food in the Montgomery area. When I lived in Alabama, I was practically a regular here!It's a bit more upscale than many Thai restaurants I've eaten at, and this is reflected in the prices.The waitstaff is very friendly and always willing to help the novice understand the ins-and-outs of the menu.The curries are all delicious, particularly with chicken. I prefer Lek's served at \"medium\" heat. Thai food is HOT, and I would advise all but the most die-hard heat-seeker to avoid anything hotter than the medium. \"Thai Hot\" is VERY VERY hot.I've also enjoyed the sushi at Lek's, which is different enough from your normal sushi to be worth trying.The decor is not as bad as other reviewers have suggested, and the restaurant seems to have lots of nice carved statues of Hindu deities and animals. I enjoy the atmosphere.If you are traveling through the Montgomery area and have a little time to sit and enjoy some very good Thai food, I highly recommend Lek's Taste of Thailand."], ["Darren L.", "Food is consistently very good.  Service is inconsistent.  Sometimes the staff is welcoming and friendly, other times, not so much.  I will continue to partonizre this restaurant because the food is always very good and a lot better than Ala Thai East which I recently tried and found disappointing."], ["Ben C.", "Green curry beef is the way to go.  Plus, the sushi is always good."], ["Holli D.", "I have been here many times. The Thai food is generally good. I got sushi this night and this is just NOT the place for sushi!! We got mutiple rolls which were bland, absolutely NO flavor. We felt like we paid $40 for balls of rice!! I am not a complainer and always try to find the positive in everything, but it's just not here other than the service...which thankfully was good. Overall, we were disappointed & left completely unsatisfied! Thai, yes here, sushi a BIG FAT NO!!!!!!!!!!!"], ["Jay S.", "Been eating at Leks for twenty years. Always excellent food and service. Get some spring rolls for an appetizer and enjoy. Can't go wrong with red curry chicken. Great for takeout too."], ["Melissa T.", "Been here for lunch twice and have been disappointed both times.  The pad thai is nothing like any pad thai I've ever had, to the point that i questioned if I had really ordered pad thai.  Unfortunately, I did order it.  I can't help it but I have to continue and describe to you what this dish was like.  So, let's start off gently, who serves pad thai with a side of rice?!?!  That was so bizarre to me. Then, the stiff noodles come sitting in a watery puddle of weird sour tasting sauce. I can't even call it a sauce,  it was more like sour water. Fried rice is pretty terrible too. Don't go."], ["Kimberly S.", "One of our family's favorite Montgomery restaurants! The sushi is wonderful, and the service is top notch...if you are looking for a family friendly atmosphere, this is the place to go! I was so surprised to read the bad reviews because in the 15+ years we have been eating here, I have never had a bad experience. Try it...you will be happy you did!"], ["Rebecca S.", "Decor is a zero, starting with the stained, sagging ceiling tiles and continuing with the bare white walls. Ordered a chicken stir fry (bland), and the chicken satay appetizer, which was served partially raw. The server removed the charge promptly, and offered to send another order with us for free, but we were too turned off to eat anything else here."], ["Jamie M.", "I dont' know what those other clowns were talking about how the food was bland and not good.  They are either retards of have no tounge becuase this place is the best thai food that I have ever tasted.  From the peanut sauce (decadently good) to the pad thai ( i like mine thai hot) it is all good."]], "Sushi Yama": [["Johann L.", "I dont even wanna give one star tho..Thats totally fucked up. I ordered Hawaiian Ramen which was cost me $8.95, and guess what.. It came with instant noodle which you can buy at the mart with only 50 cents (which called ShinRamen). You must be shitting me... why the hell waitress didnt  mention anything about this??And also, my bud got Tempura Udon... its like same way....Dear.. you supposed to make lot of profit from cheating Americans at U.S.?Good luck with that."], ["Jordan K.", "Delicious!  Came here with a group of ten for dinner.  Everyone pretty much enjoyed the food.  We had some folks that have lived in Japan so of course some of the food such as the Yakisoba was not up to par.  The noodles were thin ramen noodles.Other than that I myself had the Chicken Katsu, Spicy Salmon Rolls, and Squid Tempura Roll.  I enjoyed it with my sake and plum wine."], ["Elizabeth D.", "Most definitely my favorite sushi restaurant ever! Every time we go we get a table full of rolls and rolls of great sushi! The service is impeccable and they get the food out quick! Definitely try the yummy yummy roll!"], ["TJ P.", "Their sushi is the best i've had in town.  I always end up ordering to much food because the platter portions are huge and I still order spicy tuna rolls like a dumdum. Great service, fast service, highly suggested."], ["Douglas K.", "This place is awesome....what a great find in an area where I never expected to find great sushi!  The Yama Roll is great to start off with!"], ["Melissa T.", "From the outside, this restaurant seems a bit strange, you can immediate figure that it was previously a failed restaurant that they economically renovated into a sushi restaurant. Anyways, my in-laws love this place. We're there so often that the owners know us and would often bring us small eats on the house. The service is attentive and friendly. The sushi is pretty good for Montgomery standards. And the portions are not too shabby. The place gets pretty busy for both lunch and dinner, so I imagine the fish inventory stays pretty fresh. They also have private rooms that can accommodate bigger parties. All in all, not too bad."], ["Holli D.", "Laying at home, I got a call that friends were gathering at Sushi Yama. I arrived around 9 pm on a Thursday night. The place was empty, but that is to be expected especially seeing that they close at 10 pm. I had the tuna tataki ($8.95) & one order of Ika (not sure of the price). The tuna was the thickest cut I have ever had. It tasted wonderful! The Ika was great! I was very pleased with the service and the food. Four of us sat at the sushi bar. The place is very nice and well decorated. It is in an old Up The Creek building. I will be back!"], ["Cheng Q.", "I don't know much about the Asian history in the Deep South, but this restaurant surely is incredible in the middle of Alabama. It's run by Korean people not Japanese though, which is like every other Japanese restaurants in L.A. The decor inside is quite authentic, and its clean. Nice tasty food in the middle of maybe nowhere, the only thing that may prevent more customers from coming is that it's pretty expensive, even compared to L.A level."], ["Jessica P.", "Very impressed to find such a great place for Japanese in Alabama. Very fresh and tasty!"], ["Samuel D.", "Very conscientious staff.  New item, \"Dream Roll\" was suggested and was wonderful.  Great service, good food, great value.  I'm a business traveler and will return."], ["Lee A.", "Enjoyed the Yummy Yummy roll, Spider roll and the firedragon roll.  Great tasting sushi at a reasonable price.  Restaurant was clean and service was good.  Atmosphere was ok, nothing spectacular. We will go back for sure."], ["Steve A.", "I am so glad I found this place. Felt like i was having the freshest sushi and I know fresh! The service is great, no better than great. I enjoy talking to the staff, such nice people that make me feel comfortable. The owner is the hardest worker and the sushi is awesome, must try. You can't go wrong with this place."], ["Jennifer H.", "I was not that impressed with the sushi @ Sushi Yama.  I travel and eat sushi out often in cities all over the country.  the atmosphere @ Sushi Yama was superb.  We sat at an open booth, but they have these neat little private rooms - that would be great for a date night.  Seems very exclusive or romantic. The servers were nice, but the gal we had seemed to not be interested in helping us decide what was best, nor interested in serving us.  I'm all about RAVING Fan service, and Sushi Yama did not deliver in the service dept OR in the Sushi dept.  There are SEVERAL other places in town that rank way higher in my \"just going out for sushi\" experience:  Satsuki on Atl. Hwy, and Lek's @ Union Station."]], "Mr. Chen's": [], "Wasabi Japanese Cuisine": [["Sarah V.", "This is my second time at Wasabi and I was not disappointed. I am not one to adventure away from the basic sushi menu especially being pregnant. I ordered two rolls the 007 Roll and the Sakura Roll. They were both delicious. We ordered the edamame and it was warm and not overly salted! The service was good. The lady was friendly and she kept my water glass filled. I sometimes wished they would bring an entire water pitcher to the table. Ha. The table that sat behind me complained about something and I could tell the employees were upset by their tone. I could not understand what they were saying but the other guests were rude.  The employees could have talked in the back away from customers regardless if I could understand them. This restaurant is located in the Alley in downtown Mongtomery and one thing I hate which I'm not sure is the restaurants fault however, the restrooms are outside with a locked combo and I hate that!"], ["Susie L.", "The lunch special deals are decent, but the service is poor. It's very disrespectful to walk away from customers when they're talking to you. It's also disrespectful not to tell your customers that their appetizers aren't ready even after the entrees arrive bc you forgot or bc the chicken was frozen and needs to defrost.....The quality of the fish is... Well, it's evident that it's frozen. The tuna tataki was a failed attempt to be artful. The sliced cucumbers did not match the taste that most tatakis are supposed to give off. And there was way too much rice on the sushi. It's literally a mini snowball under the fish. If I were to go back, it'd be for the lunch specials only."], ["Josh M.", "The food here is worth 3.5 to 4 stars--decent sushi that would be nothing to write home about in a bigger city but is very good by Montgomery standards.  Service has been worth five stars every time I've been there.  But they have been out of stock on sake for more than a month.  That's like a ballpark being out of hot dogs--they're not the main reason you're there, but you very much miss 'em when they aren't.  Last straw was tonight when I called ahead to find out if they had gotten in a shipment and was assured they had.  Walked the mile in, only to find out that the dude was apparently just saying whatever he thought I wanted to hear to get me off the phone, because they had none."], ["Shirley S.", "Was really hoping to like this place, but the spicy salmon in the salmon lovers roll was quite bland. Also, I asked for my tuna hibachi to be cooked rare and it was served well done. It is also overpriced for what you get. My husband did like his hibachi filet mignon, however, and the service was fast."], ["Orion V.", "Service was not on par with what a place like this should be. Late drinks / long time between fillings.Food was good though!Could be a better experience if service was improved."], ["Svetlana O.", "Nice location. The menu has quite a lengthy list for sushi, but if there are certain ingredients that you do not want (i.e. tuna), I felt that greatly limits options down to almost 5 things. Nonetheless, I was quite pleased with my selection. This could possibly be a contender for a return visit."], ["Shayne G.", "Went on Sunday afternoon, so was very quiet. Nice atmosphere, friendly service. Tempera was ok, sushi roll with lobster, tuna, and avocado was excellent. Was disappointed the wasabi martini has no wasabi in it, so skipped that and had a dirty martini which was made very well."], ["Rebecca W.", "\"Feast on Japanese cuisine\".  All I have to say is, \"thank you for being open on Christmas Day\"!  After calling multiple restaurants on Christmas Day, I found out this restaurant was open and boy were me and my family thrilled!  The closure of most of the city left us with very few options including low-quality diners that we were just not in the mood for as a Christmas meal.  So, when I called Wasabi, I was ecstatic, when I called and they told me they were open until 9pm (with kitchen closing at 8:30pm).  I was just over happy that I was not going to be eating low-quality food in a diner with my family on Christmas Day.  On the menu, soft-shelled crab, vegetable & shrimp tempura and the \"007 roll\" caught our eyes. The waiter was very pleasant and was happy to have us as customers that evening, so he made the experience an enjoyable one. The food came out promptly and I could say that I have had better coming from big cities where Japanese eateries were on every corner.  First, the tempura was not as crispy as I normally like mine, but it was great that they incorporated different vegetables in this appetizers.  As for the soft-shelled crab, I have never had it in this form - formed into strips then deep fried - the taste was a bit awkward, but I still enjoyed the crunch, which is always a must. The \"007 roll\" was forgettable... nothing popped out at me about it and it was a bummer because it was a specialty roll and a bit pricier.  For dessert... I was ever so grateful that they had green tea ice cream... a perfect ending to a bountiful meal!  I absolutely love green tea ice cream! The flavor of the green tea was fully present and the creaminess was divine!  Honestly, I could have had multiple bowls of this for dinner."], ["Michael N.", "Sushi, hibachi, and stir-fryThis place does it all, and does it quite well. The rolls are creative and the fish is fresh. It's the best option for sushi/asian cuisine in downtown Montgomery. If you really are looking to indulge I definitely recommend finishing the meal with the Tempura ice cream. The crunchy salty tempura outside pairs well with the sweet cool ice cream inside. Its a flavor and sensory experience."], ["Ammie S.", "The food & service was excellent!!! Will be a coming back to WASABI Japanese Cuisine & Sushi"], ["Kyleah J.", "Yelpers tip: Bring your patience and an open mind. It's a cool downtown restaurant with potential. With that said... the food is pretty amazing. I had  a lunch special - 2 rolls + soup/salad. Tasty and fresh. I went to Wasabi for lunch takeout and the service was disappointing. It took about 40 minutes for 3 people to get their orders - we all ordered sushi + soup + salad. The restaurant wasn't packed and most people had their food when we came in. I do plan on giving them a second chance and try some of their moderately priced hibachi options; I will update once I return."], ["Jeff H.", "Just enjoyed a very nice meal at Wasabi! I had some Edamame and three different sushi rolls. The highlight of my meal was the \"Rock n Roll\" roll. It was so fresh and tasty that I had to order a second one! I'll definitely be back the next time that business brings me to Montgomery!"], ["Candie D.", "The 007 roll is delicious. Have been there twice in just three weeks. Our server was very knowledgeable and gave great advice. Only downside for my husband is that they don't offer anything really spicy. Will definitely be back again."], ["Annette M.", "I have to say after reading the yelp reviews we were pretty excited to come for dinner this past Sunday. Unfortunately we left a bit disappointed. While the location, decor, and sashimi was good and fresh and the presentation was nice, they really blew it on the basics... I enjoy miso soup and I have never in all my years had bad miso until Sunday. It was barely warm and tasted...off. Then the hot sake was mildly warm and cold by the second pour. Hot sake should be served hot and stay hot for several pours. I would have mentioned this to our server but she never came back until our food was served and ran off so quickly, think drop and run. She did not explain what was on the boat or ask if we needed anything else. We ordered a sushi boat and while the sashimi was good the sushi rice had a funky texture and lacked flavor."], ["Rob B.", "This sushi restaurant is really neat. It shares a building with other businesses; however, it is a spectacular design I here! I really enjoy the high ceilings with rustic brick. The bar area has these cool LED hanging lights that are multicolored bottles. Real cool look!I had an appetizer spring roll which burned the top of my mouth! Dang it!  Roll was so good I kept on eating thru the pain!For the dinner portion I had the shrimp tempura roll, the spyder roll and the green roll. All we pleasantly presented. The green roll was fantastic, but the spyder crab was a bit salty for my buds. I also had a draft beer which was only $2.75!  That was the cheapest part. The sushi here is not cheap but it is not expensive either. Good food and cheap beer will bring me back!"], ["Taheerah B.", "Wow!!!! I am super impressed with Wasabi!My friend and I came in here on a rainy night, and it was empty. We were the only people in the restaurant. Of course, we were immediately seated. The server was very upbeat and humorous. I can't remember her name, but I do remember her saying that she is from Tibet but was raised in India. I order two rolls. The sweet potato roll was amazing. The sauce that was drizzled on the rolls was a wonderful compliment. Also, I adore the slight crunch that the roll had. My second, cucumber and cream cheese, was great.  The cucumbers were nice and crisp. To drink, I order hot green tea. I didn't like the tea although it helped with the cold weather. The tea had this weird taste. Maybe I am not used to \"authentic\" green tea. My friend order the fried rice. She requested that it be cooked in oil with no egg. She order the avocado roll. She was pleased with her food. The decor was darling. It was dark with exposed piping. The perfect date night spot. I can easily see this as my new favorite dining place in Montgomery."], ["Peter M.", "Joined friends and had dinner here last night. I had the Tuna combo with sweet tea. Service was good, and sushi was good. Interior was a little dark, which seemed odd, but overall ok. It is in area called The Alley, which could explain part of it. They had a full bar with limited outside seating, but most of the area seems to still be in redevelopment. If you need a sushi fix, this will take care of that - but I wouldn't expect a lot more."], ["Jill L.", "Sushi in Montgomery? Yep, seems a little brave, but, after flying next to a Japanese citizen and sharing a cab with another, I figured that it wasn't the state's capitol that was attracting all these Asian visitors. Sure enough - Hyundai has a plant, and, where there is a large Japanese biz population, there is generally a decent sushi place. So, I deduced sushi in Montgomery wasn't that risky after all (though I didn't opt for sashimi on a Monday - I know my limits). My specialty roll was a shrimp tempura with jalapenos and avocado - delish and fresh. Miso soup was earthy, just the way I like it. Service was swift and kind. Next time I breeze through ole Hank Williams' hometown, I'll give Wasabi a try again."], ["Courtney B.", "It was somewhat empty when we came here on a Tuesday night, which created a very romantic atmosphere. The staff were all super friendly and helpful. We ordered the tuna takaki and seafood soup, which blew us away.  I could seriously write a love song for that soup. I think it healed my body AND soul. The sushi rolls were not only gorgeous, but fresh and and flavorful. The Empire roll truly impressed me. I doubt my date got more than one piece of it. I really can't go anywhere else for sushi now ( I haven't tested that sentiment, but it currently stands)."], ["Summer L.", "Dissapointed. Only went here because it was close and thw yelp reviews were good. Hibachi chicken and shrimp was dry, overcooked and bland. Chicken was so bad could only eat a few bites.  Fried rice was mediocre, had to eat with part of a torn up cup and coffee stirrers. Guess I shouldn't have assumed that just anyone could figure out that an out of towner staying at a hotel would need utensils and napkin. Vegetables also bland but we're good. Was also a little bothered by the lemon seeds i kept finding in the vegetable and chicken. I season my food with lemon too, but am careful to avoid seeds dropping in. Also had the shimp and vegetable tempura which was much better than everything else, was also quote bland but had a good sauce with it. Fast service and food prep."]], "Yong Ye Buffet": [], "Maki Fresh": [], "Arirang BBQ": [], "Street Cafe": [["Andrea M.", "Not a bad stop for some Japanese food. I usually order the beef teriyaki bento box but I didn't see it on the menu when I had came this time so maybe they stopped? I didn't bother to ask. But this time I got the beef teriyaki bowl. Decent portion of meat, vegetables and rice. The only thing I would say about this was that they put so much teriyaki sauce so there wasn't much any room for me to just get some plain rice. No complains on the customer service side. The wait staff are all very attentive and friendly and the food always comes out quick.I'd probably come to this place more if it wasn't so pricy but I guess the other Japanese spots in town are just the same price. Worthy of a stop inside for some lunch or dinner."], ["Crandall H.", "Despite what the other reviews will tell you, this is a great place to get some delicious food. I lived in Montgomery for 12 years before I moved, but now I try to come here whenever we visit! One of my favorite restaurants in Montgomery. Go for lunch and get the box :)"], ["Annie P.", "Gross.  Not returning.  We just ate rice for lunch.  The sushi was a joke.  Wasn't even rolled properly.  My box came and it looked like another customer's leftovers.  Menu is limited and not tasty.  No yakisoba or tea.  It was worse than mall Japanese fast food.  The hostess wasn't very friendly either but that's not why I gave one star.  The food was horrible."], ["meghan z.", "Have been eating here about twice a month for the past 3 years. Not by my choice. Always had decent food. not great, but not bad. Yesterday went in for lunch, food came, 2 bites in I realized the chicken was bad. Said something to the waiter, no apology, nothing. A minute later he came back and offered me a new meal. Um, no, if it was bad, why would I want more that's been cooked on the same surface with the same utensils etc. They didn't take it off my bill, didn't apologize still. I will not be returning."], ["Nina U.", "First requirement for a Japanese restaurant? Serve tea. How hard is it to keep a box of tea bags and plop a cup of hot water on the table? Tons of teriyaki dishes and okay sushi rolls. Guess businesses have to cater to the taste of customers so I can kinda excuse this selection. Do you seriously not serve tea?Salad and dressing- awesome even if it was all iceberg lettuce. love this style of dressing. Tea please. Soup - broth and mushroom slices were good too! Can I have tea?Fish cutlet served with gravy, cabbage and rice (steamed or fried rice). Okay, not sure if there was any fish in those thin slices but the breading and gravy and cabbage were good. Wouldn't order it again but I would try something else. Can I bring my own tea bag next time?Bring a jacket, it's cold inside."], ["David T.", "Went here on the recommendation of some locals when we first moved here. Started out pretty good. Gyoza were good but the sauce was thick and really sweet. Dragon roll was ok not great. Sadly it was probably the best thing we ate. Got the beef bowl combo and it was swimming in teriyaki sauce. Iv had beef bowls before at other place but never saw one with this much sauce. Got about halfway through and had to stop eating it. My girl felt the same way about her combo bowl. She stopped eating it sooner than me. Maybe it's that we aren't from here and both have a lot of experience in Japanese cuisine that we didn't like this place. Being from CA I used to eat in Little Tokyo when I'd be down in L.A. and she is Japanese from Hawaii so you can guess how that goes.  Won't be going back."], ["Julie L.", "Good place for a quick and relatively inexpensive lunch, especially if you're craving that Japanese hibachi type food, but you don't want to sit through the whole knife juggling, flame throwing show.  Skip the sushi here and go for a rice bowl or bento box."], ["Robert M.", "We always enjoy the food at The Street Cafe.  Tonight we had dinner with friends."], ["Phoebe T.", "This must be one of the last restaurants in the world that have lunch specials on Saturdays! Yay to that! I had the chicken teriyaki bento box with steamed rice. The rice was good and the salad was fine. However, the chicken wasn't too tasty. Also, the \"california roll\" is basically just a cucumber roll. It's very small and wimpy looking. The meal was decent, but I felt like I could get better quality Japanese food for the same price in New York."], ["James P.", "When I first moved to MGM a lot of people recommended this place as great Japanese/\"fusion\" food.  First off, I have no idea why it refers to itself as \"fusion\"; it's just a straight generic mid-American Japanese place.  The teriyaki stir-fries are plain and sort of dry, not much flavor.  The \"creamy pink sauce\" is \"shrimp sauce,\" i.e. mayonnaise with some spice and color, a staple of Japanese places in the south.  I don't eat it, but I agree the kind at Street Cafe is a creepily bright pink. The sushi menu is oddly limited, and I don't really trust it because it's all made in the back; no sushi bar."], ["Kisente F.", "Love the special lunch box. I've had many types of sushi here and all were great."], ["Melissa T.", "We've come here a few times for lunch but sometimes it gets a bit crowded and service slows down.  The food throughout the menu is consistently mediocre, from the udon noodles to the bento boxes.  Everything that is labeled grilled or teriyaki means the same thing, they either come in a bowl or on a plate.  There is only one sauce that they put on everything, I have suspicion that it is straight from a bottle.  The creamy pink sauce they provide on the side seems strange to me, I have never tasted nor touched it."], ["Edward R.", "Good food.  Good service.  So so sushi."]], "Miyako Japanese Steak & Sushi": [], "SHILLA Korean Restaurant": [], "Yokohama": [["Courtney B.", "Firstly, the atmosphere here is incredible--they have seating that ranges from incredibly intimate to open and airy. Their private four person rooms are HELLA romantic. Second, the food is astounding. I've eaten at (almost) every sushi place in Montgomery It's truly some of the best sushi available in central Alabama.  Their korean dishes are also delicious. Definitely one of my favorite places to dine."], ["Terry M.", "Went tonight for dinner. First and foremost it has a nicely decorated interior. Heavy doors. Subdued lighting. Flatscreen TVs on seemingly every wall (including a TV in the men's room LOL). A massive aquarium. Welcoming  calls of \"moshi moshiiii\" ring out when you enter and the wait staff moves quickly to seat you. A well-stocked sushi bar tempted me but I wanted to try the kitchen. I ordered something I figured I'd like even it weren't amazing, fried dumplings for an appetizer with a lobster and scallop combination plate as the main entree. Miso soup and a house salad rounded out the deal.  The dumplings were piping hot and crisp with a light and lightly favored pork filling. A flavorful dipping sauce came along. The lobster and scallop dish was brought out soon after, and it was gorgeous. I would have liked to see a slightly darker sear on the scallops but the main problem was a brown sauce that was coated on a little heavily for my taste. The lobster was tasty and had a little more chew to it than I'd expected. But it was good. This is not an inexpensive place but you feel like you're getting a good meal for the prices paid. I'm still curious about the last page of the menu, which features higher priced \"deluxe\" items and is written only in Japanese. I'll be back."], ["Steve L.", "Me and my friends had hibachi and sushi. It was THE BEST food ever!!!Also this place is good for any occasion and the health inspection score was 92."], ["Darren L.", "Food was good, and the service was excellent, but after seeing that their health inspection score is 77, we won't be returning to this restaurant until they get themselves at least in the 90s."], ["John H.", "Service Great! Sushi Spectacular! I would highly recommend Yokohama. In my opinion the Chef is the best in Montgomery! Restaurant atmosphere is very comfortable and the waitresses on on the spitz! This will be a regular stop for Chef Big!"], ["Jamie M.", "This is probably the best Japanese restaurant in Montgomery with the decor and food the best I have seen in a long time. our serve was nice they have romantic private room to inside table with beach.settings.  Awesome!!!!"], ["Robert M.", "After all of the great reviews, we decided to give Yokohama a try.  The dining area is bright and clean.  Sit at the sushi bar or sit in one of their enclosed dining rooms.   We ordered three rolls, one of them deep fried.  All were tasty.   Enjoyed the soup, salad and sides.  I liked the sweet tea.  We shall return."], ["Melissa M.", "Nice private dining rooms, great sushi roll selection and friendly service. We'll definitely be back!"], ["Taylor N.", "Good sushi selection, including quality nigiri and sashimi, plus all the standard Americanized dishes. A large number of small private rooms are available.Pro tip: Use the buzzer. In true Japanese style, each table has a button that you can press to get service. It's not strictly necessary to press it to have someone come to your table, but that's what it's designed for and it helps."], ["Tammy K.", "The best hibachi and sushi in Montgomery Alabama! Atmosphere is top notch and the isolated rooms if you would like privacy are great!"], ["James R.", "Best Japanese in Montgomery hands down. Extremely reasonable, friendly staff and nice atmosphere! I will definitely be back!"], ["Yen M.", "I got edamame and hibachi shrimp. The edamame was good (not like one can really screw that up) but the soup that came with my entree came out room temperature and my friend's soup was cold. The shrimp was cooked on the grill with yum yum sauce and teriyaki sauce drizzled on it which was ok. I've never been to a \"Japanese\" restaurant where the hibachi meat was not cooked with the sauce. \"Japanese\" is in quotes because they also have some Korean food on the menu, such as bulgogi, and we were also given 3 Korean side dishes at beginning of dinner (these dishes tasted mostly bland). Service was good."]]}