{"Thai Place": [], "Green Papaya Lao & Thai Cuisine": [], "Cuisine Style Express": [], "Lek's Railroad Thai": [["Dan N.", "Been here twice when I was TDYing here.Both times the service have been great especially the second time when the owner gave my friends and I \"Yummy Yummy \" sushi rolls that taste even better when it's free.I like how this place still retains some of the old railroad station architecture.  Classy casual dining setup. The food is good the two times I've been here.  I got the fried rice the first time here and then one of the fish dish with some kind of lemongrass ginger sauce the second time.  Both was delicious and you get more than you paid for too.  Will come back here if I get TDY at Maxwell again."], ["Aubrey S.", "I've been a fan of Lek's for years.  It's a perfect spot for a reasonably priced and portioned lunch.  They have a unique spin on Thai food.  Some dishes I like better than \"traditional\" Thai, some not so much.  The summer rolls with peanut sauce are on the \"100 Places in Alabama to Eat Before You Die\" list.  I also like the panang curry chicken - different, but delicious!"], ["Doc D.", "Having lived in places where there is great Thai food readily available and having had Thai food in Southeast Asia, I'm impressed with what this mid-sized Southern city restaurant has to offer. (Did that make sense???)The food here is good.  It is at least par with the standard Thai restaurant in any large city with decent Thai food.  Specifically, Lek's uses at least a whole sliced chicken breast in their  panang curry, the sauce for which is phenomenal.  The spring rolls are also worth a try. Only one minor gripe: they don't have sticky rice.If you're in Montgomery and hankering for good Thai, hit up Lek's Railroad Thai, its worth the visit."], ["Melissa T.", "I was surprised to find this place packed full for lunch. Despite the numerous amount of patrons, we were seated immediately. The dining room is quite big and beautifully decorated with findings from all over the world. The wait staff was nice, they took our order in a timely fashion, which was greatly appreciated since we were there during our lunch break from work. Although this is a Thai restaurant, they also offer sushi. I opted to pass on sushi. There is just something not right with a Thai restaurant serving sushi. Anyways. Unfortunately, I ordered the pad thai which was horrible. The noodles were stiff and the sauce was watery. At the very least, the flavor was what pad thai was suppose to taste like. My husband got the basil beef, which he enjoyed. So, mixed reviews on the food. We will have to go back to give it another chance."], ["Josh M.", "While in town doing some work, we had a little bit of time to grab dinner and found Lek's with the Yelp app. A very good find indeed.Though the facility itself is somewhat small, it is well decorated and has outdoor seating that looks out over the river. If you look at the wall near the door you'll also notice shot of Danny Devito, Steve Buscemi and Billy Crudup who all ate there while filming Big Fish.The food was very good and all three of us were very pleased. I had the cashew chicken and, though I wouldn't say it was exceptional, I liked it more than others'.I was unable to sample their sushi, but my friend said his was good. Should I ever go back, and I definitely would given the chance, I'll be sure to try one of their specialty rolls.If you're in town and a fan of Thai food, I doubt you'd be disappointed having a meal here. Definitely one I'll recommend to friends!"], ["Stacia R.", "Staying over at the Embassy Suites across the street this is one of the closer places. I ate their twice. The worst thing I had was the Reislng - too sweet. For Dinner on night one I had the Chicken & Basil. Delicious. As a table we had the fresh Spring Rolls. They were good (although I'm not a huge fan - even the peanut sauce was tasty). Night two I had Tom Yum soup with Chicken & the fried Spring Rolls. I also had a glass of that way too sweet wine. It was okay but I like the drier Reislings (and I like bartenders that know the difference).  If you are a meat eater it seems they are more than happy to accommodate! The bowl of soup had more chicken then I could eat. The Basil & Chicken was essentially a plate of meat with a few vegetables and a side of rice. I enjoyed both!! I have eaten at a handful of Thai restaurants from small towns to larger cities. They are my go to place when I want to limit my starches or increase my vegetable intake. None of the dishes I had were prepared they way I have had them in other places but the flavors and ingedients were the same and better. The Tom Yum Soup was great. If you like super spicy Thai food you would probably have to ask them to turn up the heat. Since I'm over 40 & traveling the limited \"heat\" worked well for me. Just be aware that from the menu they are incredibly toned down compared to what I've had."], ["Kevin P.", "Okay I'll start off by saying that this place serves both sushi and thai food... okay breathe.This place is decorated nicely  and is located right next to the train station (I think?)  Wouldn't know, because I thought people only rode trains in Europe...The first time i went here, I was severely disappointed with their Pad Thai.  It was  drowning in sauce.  Almost like a freaking soup.  However, because their waiter and hostess was so friendly, I just had to try the place again.The second time around, they redeemed themselves through the curry and pud see ew(sp)?  I also had some sushi which was a 2-star worthy dish in my opinion.  Not worth it -- should've known.   Thankfully the waiter was as courteous as before and made the experience good.  Lots of seating in the dining room along with an outside porch.  Worth stopping by if you're in Montgomery."], ["Emily K.", "This place is so delicious! We had a party of 7 and asked if they could get us out in 40 min and they did. Great service!"], ["Andy M.", "Pretty good Thai, but nothing too special. Kind of a strange atmosphere with the trains and all. Just went once when driving thru Montgomery."], ["Randy S.", "Leks Railroad Thai, hmm, I had the beef pad (pud on their menu) thai.  The peanut sauce was runny, I asked for \"hot\" and it had little spice.  They did have \"thai hot\" listed and maybe I should have ordered that instead.  For an appetizer we had a tempura shrimp roll, the tempura shrimp were fried so hard and brown they could bounce off the floor.  When it came to dessert I wanted mango sticky rice, the waitress said they had none.  In fact she listed 3 desserts, all of which could be had out of a box from the supermarket.  Maybe they were having a bad night, but on a friday night the restaurant was empty...  that in itself speaks volumes, I will not be returning."], ["Mike G.", "I came in here twice while staying at the Embassy Suites next door. The place is very clean and nicely decorated. The first time, I ordered the spicy chicken dinner.  It had very good flavor and just a little bit of kick to it. The second time, I came in for lunch and ordered the panang curry. Once again, I was not disappointed. The curry tasted great and the bits of chicken were very tender. My only complaint is that the soup had little bits of celery in it, is that really necessary??? I would definitely come back here again to try some of their other dishes."], ["Peony S.", "I grew up in downtown Montgomery and as a result ate here on more than a few occasions.  I always liked it as a child but have since developed adult tastebuds and have steered clear of this place.  My brother got food poisoning from here not once, but TWICE (don't ask me why he keeps going back).  The food is mostly bland, and the chicken always tastes a little \"funny\".  The sushi is usually pretty good, but thats where my relationship with Leks ends.  Sorry guys. :("], ["Melissa T.", "We stopped here for lunch driving home from a Florida vacation. It was absolutely wonderful. The service was friendly, the patio and view lovely and lunch prices were very reasonable. All food was very fresh and tasty, even the starter soup was nice homemade broth with chicken and vegetables (rather than the usual instant miso or the like). Our whole party agreed that we will definitely be back when driving through Montgomery again."], ["AJ M.", "Food was pretty good and nice service.  Cool atmosphere."], ["Scott M.", "Lek is great and his Restaurant is fantastic, it always packed. You can watch trains go by, look out at the river it is in Montgomery's historic train station. A must try."], ["Phillip B.", "Another reviewer wrote \"The best Thai restaurant in Montgomery.\"I must say I agree - but that's not saying much.I had so many people tell me that it was a great place, so I kept going back and trying different things.  I went a total of 4 or 5 times over the 4 months that I was in Montgomery and I was never super impressed. Compared to other restaurants in Montgomery - this place gets an easy 4, maybe even a 5.  Compared to the great Thai restaurants out west in places like Portland or Seattle - I can't give this place anything other than a 3.Don't misunderstand - This place is a fine place to go for lunch.  The service is quick, and the food is - well it's ok; but, you won't have a bad experience here.(A couple of specific dislikes - everything was much sweeter than I expected.  The Phad Thai had a strange sweet sauce on it that threw it off for me.On the plus side, the wine list is impressive and the decor is very nice.  I was especially impressed to find an Oregon wine - it was a nice little taste of home)"], ["Randall F.", "Lek's Railroad Thai isn't my favorite Thai restaurant in town, but that's OK because I don't necessarily come to Lek's for their Thai dishes. (Not that they're bad. I've had the Pud Thai and the chicken satay and chicken and rice soup and all were very tasty) I mostly come to Lek's for their sushi. The itamae at Lek's creates some very delicious and unique rolls. My favorite is the Bama Crunch. When I join friends at Lek's, we usually try to order different rolls and then we share them amongst each other so we all can try something new. I really like Lek's location. It is situated in the old Union train shed (now the Montgomery Visitor's Center) with ample parking in the rear. The inside of the restaurant is well decorated, too. The white parchment paper over white table cloths with water goblets and expertly rolled napkins and silverware give Lek's an upscale feel. It's a good place for a date night."], ["James P.", "I've only eaten here for lunch, as I work downtown.  I don't eat meat, and Leks is one of the worst Thai places for vegetarians I've ever seen.  Their stir-fries are served with very few vegetables, so you basically have to get tofu with the dish to have enough to eat.  Their tofu is fried in huge chunks, which is not a format I find particularly appealing.  Also, the sauce that comes on their \"spicy\" lunch dishes is some kind of thin tomato-based curryish variety that I've never experienced before; it's quite acidic and not very flavorful.I've had some basic sushi and it's fine; nothing to write home about.  The bar is uncomfortable and badly designed height wise, if you're going to be eating lunch solo.  The parking situation at lunch is also very annoying; there are always 20 or so empty spaces in the back that are supposedly \"reserved\" and subject to towing, so you have to decide whether to risk it or wait for one of the 5 or so Leks spaces to open up.  Another amenity that's lacking is the restrooms, which are located outside the restaurant and down a couple of halls next to the visitors' bureau.  Basically public bathrooms with an accompanying standard of cleanliness.  To clarify another review, it's located in the old train station that's now restored as a visitors' bureau.  Although freight trains go by outside, there's no passenger service in Montgomery."], ["M.C. W.", "Other reviewers have called Lek's the best Thai restaurant in Montgomery, and I agree. However, that isn't saying much. While the atmosphere at Lek's Railroad Thai is adequate thanks to its Union Station location, the actual food is a bit heavy on the mediocrity. If this is the first Thai restaurant you've ever had the opportunity to visit, you'll likely enjoy your meal well enough to justify having dinner there. But if you've ever eaten anything that even resembles authentic Thai food, the bland fare at Lek's will lull you into a deep, restful slumber."], ["justin p.", "Easily one of the best Thai places in Montgomery.  Okay, I realize that that is faint praise, but Lek's is pretty good.  It's kind of fancy for a Thai place though - kind of all white tableclothy and stuff.  But it works."]], "Ala Thai Restaurant": [], "Ala Thai East": [["Mariko F.", "I LOVE this place and sometimes go 3x a week! Excellent customer service and food. Seriously one of the best Thai restaurants I've ever been. I like how it is small, definitely has that family hospitality feel. The Thai rolls (fresh spring rolls), panang curry, pad Thai, and pad see ew are AMAZING! This is my favorite place to eat in Montgomery. And you HAVE to get the chicken and rice soup. It is to die for! They also deliver!"], ["Jay S.", "Another great family-owned restaurant!The guy at the table near me can't stop hiccuping. Don't play with the heat if you can't handle it. It doesn't overpower the flavor but it can get hot. I hear his friends say he got #4 hot. I enjoy the best Beef Panang I have ever eaten, anywhere. A bed of crispy fried large flat noodles is topped with a delicious creamy red curry sauce with tender strips of beef. Fresh basil leaves and softened green and yellow bell pepper slices complete the dish. Seriously one of the best Thai meals I have ever eaten,  and I say that repeatedly here. I write this as I finish my \"jimmy hot\" Beef Panang. It is literally peppered with sliced thin hot red peppers. #15 hot the waiter tells me as a nearby loud hiccup echoes through the place. If you DO like it hot, go Jimmy.Montgomery is blessed to have several great Thai restaurants. This is one of them. I have been coming here for years. Never not a great meal. Pad Thai outstanding too!"], ["Nelly F.", "The food here is really awesome. It's really hard for veggie like me to have many option in food.But i have got lots of choices here. I really love the tofu fried rice. It's so unique I love the taste yummy"], ["Doviet R.", "This was one of my favorite hot spots in the \"gump\" as some call it. I haven't been back to montgomery in years but this is one of the first places I stop to eat at. There pad thai chicken is one of the best. And there mini egg rolls come any where from 8 to 12 depending on how generous they feel that day, but I can eat an order all on my own, and you don't know me, but that's rare. They have such a great flavor and taste and with the sweet sauce that comes with it, it's addicting all on its own. Even for fried there so light! And I can't ever forget there cucumber salad, my mouth is watering thinking about it now. If you ever get the chance, I highly recommend this place if your a lover for some great thai food!"], ["Barbara W.", "Thai food obviously.  The chicken and rice soup is light and delicious. Unlike many places it has a lovely flavor profile.  Baby egg rolls (fried) are so tasty. I am big fan of the cucumber salad. Solid entree options. There are chicken nuggets and corn dogs for less adventuresome kids, but the regular menu has many meals five for kids. Friendly owners.  They have take out if you'd rather eat at home."], ["Myra Ann B.", "I eat here at least once a week when I can. The food is incredible and the family that owns the place knows my coworkers and I so well by now they don't even ask what we want when we call in an order because they already know what we want. Sweet staff, tasty food that comes in plentiful servings, and fair prices. One of my top five favorite places to eat in Montgomery. Everyone should try it at least once!!"], ["Emma A.", "Food and service is a little hit or miss. Definitely not as good as the original location. It would also help if they had a liquor license."], ["Lin G.", "The shitty thing about Montgomery is lack of good restaurants, and lack of everything else cool (aside from an awesome zoo).  Luckily, this Thai restaurant does not suck as bad as the other one I tried, Lek's Railroad.  Unluckily, I was sick when I came here and could not really taste anything.  But I ate the whole thing and it must have been good, the curry got me sniffling like I just won the Miss Universe title.  Or maybe it was just the cold that I had.  Definitely not bad for the hole that is Montgomery."], ["Anh A.", "Average food, the atmosphere is quite authentic. The-appetizer spring roll was not good, but the beef soup is quite different. Fried noodle was average. Open on Sunday."], ["Darren L.", "Despite my below-average experience many months also, I decided to give this restaurant one more shot, so I stopped in for lunch.  Thai fried rice with shrimp plus a spring roll ... $22.55!!!  Totally acceptable to me even for a quick lunch for one, provided that the food is good. Not the case.  This restaurant has awful food."], ["Ben R.", "Came here on the recommendation of someone that this was \"the place\" to go for Thai food in Montgomery. What I learned from the experience is that I won't bother to look for Thai food in Montgomery ever again. The food was very average and prepared more like generic stir-fry \"Asian\" than anything else. Everyone in the party ordered something different, but it all ultimately came out looking like some kind of basic stir fry with white rice on the side. There was no particular spice or zing to it that would identify it as Thai food, or any different from what a moderately competent mom can whip up in her kitchen with a wok and some vegetables. Prices weren't that great either for the relatively small portions. There is also no liquor license, so I hope you enjoy water or canned Coke products."], ["Scott H.", "So I went here based off of the reviews. The waitress that helped me was great, always checked in to see how I was doing. My issue is the owner/manager of the resturant. When I arrived she was unwelcoming and dismissive. I ignored her because I didn't know who she was at first. As I watched her she hoovered over this family as they tried to eat and attempted to joke with them at the expense of my waitress. I expected them to ask her to leave so they could finish, but nothing happend. Then another couple came in and she did the same thing to them...she sqwauked on how she is waiting for her liqour license. All I wanted was peaceful meal! The food was OK, actually bland for my taste. If I lived here I would never go back. For the waitress that took care of me, thank you! You deserve better..."], ["Brian C.", "I've eaten at Ala Thai several times through the years and I've never been disappointed.  Tonight I had the basil leaves with duck prepared Thai hot.  The duck was tender, flavorful and the sauce, really nice.  I asked for the dish to be cooked with fresh peppers and got an approving eye from the owner who asked \"if I was sure\".  Bring on the heat and flavor, it was wonderful.  Can't wait to head back to Montgomery to eat there again."], ["Tina C.", "Food was good but pricey, service is slow. Potstickers are not homemade, \"come in frozen\" per server. If there was another Thai place in town I would go there but there isn't so what do you do."], ["Leneen S.", "Pad thai classic was yummy"], ["Devin E.", "The food was fantastic and the service was wonderful."], ["Spiro T.", "I ordered the Thai hot pad Thai with chicken.  Hot and flavorful!  Thai iced tea was good.  Chicken satay appetizer had so much meat, I couldn't believe it.  Friendly service.  Overall, this joint offers good quality food at a reasonable price!  They definitely know what they are doing here."], ["Melissa T.", "Montgomery is not exactly the place to go to for a cultural culinary experience. So finding a decent Thai restaurant is like winning the lottery to me. And ladies and gentlemen, I have won the lottery today.Finally! A Thai place that actually serves Thai food. I have to admit I've only been to one other Thai restaurant in the area. They are a scarcity around these parts. I'm a spoiled New Yorker who use to having a dozen or so Thai choices within a three block radius of her office.We ordered from the lunch specials, which gives you a choice of egg roll, spring roll, cucumber salad or soup with your dish. The cucumber salad was very fresh and refreshing. The chicken and rice soup was bursting with flavors of chicken, lime, cilantro and scallions. Our entrees were very good too.The only negative thing I can say is that the food is a bit over priced. I can get lunch specials for less in New York City.Nonetheless I will be back."], ["Angie D.", "Best Thai food in Montgomery! The Owner is really nice and personable. I have been coming here for years and I never get tired of it. I always recommend this place to people."], ["Jim O.", "This is by far the best Thai food I have eaten! The Tom Yum soup is to die for and I also usually get the garlic chicken noodles. If you want food with flavor and high quality ingredients, stop by here or call for delivery. My wife is picking up some tonight and Im pumped! Prices are higher than your Chinese/japanese restaurants, but the food blows them away so its worth it."]], "Asia Bistro": [["Benita D.", "Dim sum..chinese..Japanese..Thai..all great!  Many lunch specials including Be to boxes under ś8.  We tried 6 different appetizers and a lunch special...loved them all.  Two blocks from the huge AMC movie complex..great place for meal and a movie.  Next door to Sinclair ' s East...which often runs a wait...so if you can't or don't want to wait ...eat at Asia Bistro."], ["J T.", "Absolutely no comparison in my opinion - this is hands down the best Chinese food in the Montgomery area. The best hot and sour soup, and every entree I have tried is great."], ["Karen H.", "Absolutely the best restaurant in Montgomery for Asian cuisine!!!  From Chinese, Thai and Japanese dishes, there is nothing in the menu that isn't very good. Everything is cooked to order, so your entree is always fresh from the kitchen. It is a local owned family restaurant and everyone is very welcoming and accommodating to your needs. I love Asia Bistro!!!!"], ["Charlie G.", "Very friendly service - the waiter was very careful to make sure out food was vegetarian. The food was all good & flavorful"], ["Tracey G.", "Wonderful food, fast service, great lunch prices, a lot of variety, friendly staff, nice decor and very cozy. Plus my bf got to practice his Chinese."], ["Melissa T.", "The food is pretty standard Chinese-American fare (take-out) with your eggplant in garlic sauce and pan-fried noodles. The seafood soup is similar to the instant package soups. The dessert is the only part to look forward to -- the sesame balls filled with red bean paste.  If you've never had them, you must try one."], ["M E.", "This place was a nice surprise to us. We happened to be driving through Alabama and went to Yelp (of course) to find suggestions on where to stop and eat quickly while in Montgomery. So, the reviews led us to this wonderful place that could easily be missed. We were quickly greeted by a very nice older woman behind the bar and a younger female. They were very very nice! We were going to do takeout, but decided to sit and eat. We ordered  and received appetizers immediately. The eggrolls were good, but just beware...shrimp eggroll has pork in it, which I don't eat, but they exchanged it for a veggie springroll. Next our food came out. I got the Chicken Thai Fried Rice and my husband got the Curry Chicken Thai rice. First, it was a lot of food. Then with the first bite, I could see why Yelpers gave good reviews. It was delicious and hit the spot!This will definitely be in our mind should we ever return to AL (doubt it, but at least we know where to eat if we find ourselves there again)."], ["Aubrey S.", "Great service and very reasonably priced.  The decor is standard Asian fare and is laid out well for small or large groups.  The food was not so great - my Kung Pao had a funny aftertaste and the rice was a little mushy and stale.  A solid \"meh.\""], ["Robert M.", "The food here is always great.  We fed some out of town guests and they enjoyed their Thai and Chinese meals."], ["J M.", "Great food great service and very friendly staff.  the food is always outstanding!  The Mandarin shrimp is truly outstanding. The egg rolls are fresh, hot and crispy.  One of my favorite places to eat out in Montgomery."], ["Jason G.", "One of the best Chinese restaurants I've found in Montgomery.  I usually judge on the quality of a restaurant's Hot and Sour soup and this place has the second best in Town.  One of only two places I've found in Montgomery that even tries to make it correctly.  Cashew chicken, although not unique, was flavorful and satisfying, which is really what you want anyway."], ["Haitham B.", "Very friendly service and the price is pretty reasonable. I love their selection of Thai, Japanese, and Chinese entrees(especially Japanese clear onion soup). I will definitely be back."], ["James P.", "Not great, but it's pretty cheap, and the mix of cuisines allows you to mix and match at whim.  I prefer some tempura followed by a curry or one of the Thai dishes.  Seems to be family owned and presided over by a friendly if harried older Chinese woman."]], "Noodles Cafe": [["Chris L.", "Fantastic food.  Wife had yellow curry and I had pho.  Both were excellent. Best Thai we've had in town."], ["Andy E.", "Disclaimer: I have not tried the thai food here, only the Vietnamese.It's consistently the best Phò I've found in Montgomery, but not by much, and there isn't much competition. The staff is pleasant and the hours of operation are more reasonable than other Phò restaurants. The new mgmt has recently expanded the Phò options, so I'll probably be coming here more often."], ["John C.", "Stopped in tonight for a quick supper on a friend's recommendation.A big sign on the window explains that they have submitted their liquor licence application, so you can not get any drinks with alcohol at the moment.A little sparse on the inside when we first walked in, with only 1 other pair of people there, made us a little nervous at first.The waitress immediately came over and sat us in a booth and was very apologetic when we asked about their lack of beer.We ordered the fresh spring rolls to start and they were great. I was a bit ambitious on the chili oil which partially spoiled my ability to taste the rest of our food. She had the cashew chicken (special not on the menu) and I had the panang curry. Both were very tasty...mine was better ;)Portions may be a bit big for people not from the area, like us. We brought home a small bit of left-overs.We'll be back and recommend to others."], ["Michelle H.", "I wanted to try pho for the first time, so we decided to go here. Cute little place and the service was great. I quickly found out that I don't like pho lol, but whatever my husband had was good."], ["Paul G.", "Great flavors. I had the beef salad. I ordered hot (not quit where I wanted on the heat) but next time will order Thai hot.  Fresh spring roll was great. My wife ordered the Panang Curry. She ordered it mild so it was a little on the sweet side. If she would have ordered hot, it would have been perfect balance (still don't understand people who order Thai mild...that is not how is is make to be eaten). BTW...they now have their liquor license. Will come back again."], ["Arin S.", "This place is amazing. I have had practically everything on their menu. If its your first time I would start with Drunken Noodle. Beware of getting things spicy. I personally have been obsessed with the Pho. Fantastic staff!"], ["Chinyere E.", "Unspeakably bad Thai food. After trying unsuccessfully to send my order back (Thai red curry with a chicken -- do yourself a favor and skip it)-- only to have the waitress try and convince me that it was normal for my dish to taste so cloyingly sweet it seemed rotten -- I walked out of the restaurant leaving my dish behind, completely uneaten. Never again.And for those of you that think this is what Thai food is actually supposed to taste like, try green papaya."], ["Tracy S.", "We ate here last month.  The restaurant was almost empty which made us nervous but all that did was provide great service to us.  The food was delicious and fast.  The fresh spring rolls were great and so was the drunken noodles.  My husband had the Vietnamese Pho soup and loved it.  My kids had the pad thai and that was also delicious.We will definitely be back!"], ["Darren G.", "My go to pho joint when in the river region. In a town that lacks cultural cuisine, this place is a pleasant surprise."], ["Kelsey M.", "Love PHO soup I can eat it everyday....best pho in town....sweet and attentive wait staff"], ["Jan S.", "I was looking for a Thai restaurant close to home with fresh spring rolls and Noodle Café fit the bill. I wanted the fresh spring rolls with veggie and tofu like on the menu. I ordered it to go and when I got home with it I discovered that it didn't have tofu. I was really disappointed since that is what I really wanted. The green curry with veggie and tofu was good though. The food was done quickly and the service was good. Next time I will make sure the tofu is included in the spring roll."], ["B A.", "I spent a year in Thailand with the military 40 years ago. I have tried many Thai restaurants and finally found one that has the right taste. The first bite I put it my mouth, it was a instant flash back to my days in Thailand. The Chicken Pad Thai and spring rolls were amazing. Definitely will be back many times."], ["Phoebe T.", "Came here with family and thought the food was pretty good. I got the chicken and mango dish which was good, although on the smaller side in terms of portion. I ordered the vegetable fried rice for my 1 year old (they don't have a kids menu) and was pleasantly surprised that there was minimal grease and a huge variety of vegetables. I'd come here again!"], ["C C.", "I had the Chicken Pad Thai and it was very good.  I didn't expect it to be so good.  Not the best I've ever had, but definitely the best Thai food I've ever had in Montgomery.  Glad that I discovered it.  I will be going back."], ["Cory B.", "I live in California but was passing through during holidays. Stopped here and had fresh spring rolls and drunken noodles. They were both awesome, and the service was very friendly. Clean place too."], ["Melissa T.", "By far the best Pad Thai I've ever had in Montgomery, Alabama!!! The green papaya salad is excellent as well but beware, it is very spicy."], ["Billy A.", "Went for lunch and was very good.  Got the green curry with only veggies and forgot to tell them to spice it up but it had a good flavor."], ["Giarc S.", "Really good Thai and other noodle place. Varied menu, but not too many choices. I had the Pad Thai- it was good and just like Pad Thai everywhere else (as it should be). A friend got the Pho and it was very tasty and HUGE.  He couldn't even finish half.Good food, reasonable cost, good service."], ["Anne W.", "Had a late Saturday lunch here. Staff was friendly and the Green Curry was very good. Will definitely go back."], ["T W.", "I went with my family to Noodles Cafe shortly after it opened. We were not impressed. The food was average, nothing special. Not even the pad  Thai made much of a splash. The crab rangoon (at least I think that's what it was) appetizers looked like something I could get from the freezer section at Costco. Why pay restaurant prices for one something like that? The server was friendly but didn't have any suggestions to help us better explore the menu. Since Noodles was new at the time we thought we'd give them a while to settle in before writing them off our restaurant options. A month later things still hadn't improved. We won't be going back."], ["Jim O.", "Food very good and fresh. Atmosphere is fine, nothing over the top. Only complaint was the waiter failed to come back to refill drinks after he brought me a huge bowl of spicy beef soup. I will be back, but please dont forget the drinks in a spicy Thai restaurant!"]]}