{"China Kitchen Chinese Restaurant": [["Johnny P.", "Really good food, great quantity and great prices. Inside eating is small area but very clean. Friendly staff. Outside looks like it's a bad area but we went during the day and had no problems."], ["Matt S.", "This is the best damn Chinese food in Columbia, hands down. I live out in Lexington and I have no problem driving over to Forest Drive to get their stuff. Their wings are impeccable, their lo mein and friend rice are just the best. Don't let the walk-in clientele run you off - the outside looks like the backdrop for New Jack City but the food is something straight out of Food Network."], ["Nicky D.", "I loooove the food here! I've been coming to this restaurant since I was a kid. Some of the patrons are undesirable but the food and service are excellent!! The shrimp egg foo young is amazing!! I love chicken wings but I much prefer the \"flat\" portion of the wing. At this establishment, you can request either all flat pieces or all drummettes! SCORE!"]], "Main Moon": [["Christopher K.", "I have given this four stars, understanding that this is a value priced takeout place in Columbia.Chinese food in Columbia is pretty terrible and I normally avoid the takeout style places but desperation drove me to survey the ones near my home.  This is the only place I will order from for several reasons.  First, the food is not greasy.  Second, they have a good number of vegetarian dishes.  Third, the vegetables are fresh and not overcooked.  Fourth, they have real, short grain brown rice.   Fifth, they are dirt cheap.When my wife is out of town and I can't motivate myself to cook for one,  this is the place I will be frequenting.The only thing that would make it five stars is if they had a few more traditional vegetarian offerings like shiitake and bok-choy stir fry, more noodle dishes or something featuring preserved vegetables."], ["K P.", "Generous portions........good food........I liked it.  Everytime I come to visit, I shall eat here."], ["Melanie P.", "Basic Chinese fare.  Veggies are not overcooked and they have brown rice.  Beware of slow service."], ["Charles C.", "This place has had a health inspection grades of B and C on multiple occasions.  I did eat there on several occasions before I noticed these horrible grades from DHEC.  The food was always decent but the fact they are always failing health inspections has me wondering......WHY"], ["Renee M.", "There is a serious lack of good Chinese takeout here in Columbia. That being said, Main Moon breaks the mold. The food is always hot, fast and awesome! In the almost 5 years I've lived here, I have never had bad service or food there. Super friendly staff and delicious food. I highly recommend the General Tso's chicken."], ["Colin W.", "There is such a lack of good Chinese food in Columbia, as other reviewers have mentioned. This place is so good! Seems a bit pricey, but you get a good portion. I had the Shrimp Lo Mein and it was very good. Will definitely return."], ["Michael S.", "Server / Cashier greeted me and took my order. I'm vegetarian. So tried the Vegetable Delight. Plastic plate and plastic Utensils. Mostly Togo?But hey, IT'S $4.55! And IT's NOT BAD. SO. ..QuickNot bad food Cheap!"], ["Michael M.", "Good food, good price, quick service, large portions. Great standby when I don't want to cook."], ["Simon T.", "Pretty decent fare,good sauce on General Tsao's.Wish they had mei fun."], ["James N.", "Food is always fresh and hot as lava. The menu is pretty extensive and very reasonable. Their wings are actually pretty good too. Never had a bad dish, just wish they delivered."], ["Jordan J.", "You know, cheap Chinese food can take a person to some terrifying places. This restaurant deserves at least four stars for beating the odds and, in dozens of meals, never taking me to those terrifying places. Will you feel like running a marathon after eating here? No, you'll probably shy away from all physical activity for a good twenty hours. But you probably won't become ill. You probably won't encounter extremely gross chunks of fatty meat or unidentifiable stuff. These are major achievements, and good odds, for this type of food.The service isn't spectacular, but it also isn't memorably offensive. The order turnaround is pretty quick. I usually stick to the chicken or veggie dishes. With a heavy reliance on onions, the veggie dishes are pretty flavorable.  It's almost always above average, and usually fresh enough to be leftover-friendly for the next day. Overall, expect unusually good versions of the type of food you probably shouldn't eat in large quantities."], ["Benjamin D.", "The best Chinese in rosewood for the price. They always give freebies like drinks at lunch. They can be inconsistent but if you become a regular they try harder to make your food good."], ["Mona lisa V.", "Pretty gross, cheap* Chinese food.  Sure, you can eat it, but you'll be sure to regret it, too.  We're talking a major hangover.  I don't want to accuse them of using MSG, but I'll take a chance on saying they probably use heaps of monosodium glutamate.  I've been to this place too many times.  Last time I was there, they gave me the wrong order, which I totally understand was equally my fault for not checking at the counter.  I realized it once I was at the stoplight on Rosewood.  They called me and told me what I already knew.  I went back and... they took the food back behind the counter.  They were still going to give it to whomever ordered it.  After I'd absquatulated with it and, yes, almost eaten the egg roll I didn't order.  My fingers were inches away.  Had I been any hungrier, the egg roll would've probably had a bite taken out of it, and it certainly would have been touched by my grimy fingers.That little episode confirmed it.  Not going back.  *N.B. The prices listed online are old and inaccurate."], ["Gwonk B.", "No frills, no soda fountain, no fan blades on the ceiling fans...but the food is good and not too expensive.  Great place to grab something and go home to eat. I'll be coming back."], ["Eater Of Food S.", "I love this place and eat here at least once a week. Take out I should say. My favorites are the sweet and sour shrimp and the garlic broccoli. Highly recommended."], ["Neal T.", "Hands down, the best chinese food in town. And the cheapest. Which is a pretty dynamite combo. Super fast, too. If you call in your order while you're on your way over, it'll probably be ready within 5 minutes of arriving, if not sooner. Lots of menu options. Something for everybody. I eat mostly vegan, and it's even easy to find something for me. The large portions are huge, so unless it's for two people or you're incredibly hungry, go with the small size. I've recommended this place to several friends, all of whom have loved it. Downside: not much seating, and very little parking. All in all, though: Highly recommended.UPDATE: I stopped eating here because I found hairs in my food on multiple visits. It's a shame, because the food is very good."], ["Alan M.", "The customer service blows. The food is"], ["Jenna M.", "I love the sesame chicken, it is always crunchy and their sauce is delicious. I would also highly recommend the veggie lo mein and egg rolls. The only negative is they don't deliver...but it is worth the drive. Definitely better than tea pot."], ["Marty S.", "Awesome General Tso's! Loved the egg roll too. Tasted really fresh. Not very greasy, even after reheating the leftovers. Yay Main Moon!"], ["John F.", "Everywhere you stay or live, there is a Chinese restaurant \"around the corner.\" Main Moon is that place for me, and a regular stop every week or so. They're fast and always right on what I order. They have awesome lunch specials that are $5, and it comes with your meal and a soda of choice. The lunch special is essentially the exact size as the dinner, and it is usually enough food to make two meals out of. Highly recommended for a great take-out option!"], ["Laura A.", "In almost all respects, Main Moon is just another strip mall Chinese restaurant, with a few Thai dishes and some sushi thrown in to widen the customer base. What sets it apart is the un-effing-believably good General Tso's tofu. It's not on the menu, but they made it for me once and then were gracious enough to feed my addiction to it for almost a year. So if you call and order it, chances are they will think it's me (which is fine, as long as you are polite). I can't say much about the other dishes they offer, except that my decidedly non-kosher friends think the pork dumplings and their accompanying \"brown\" sauce are outta sight. This is no fine dining: the service, decor, menu, and location meet all the criteria for cheap Chinese takeout. But I just had to profess my love for the one thing they do better than any of their cookie-cutter counterparts: deep fried saucy tofu ecstasy."]], "Chen's Chinese Restaurant II At Spring Valley Cmns": [["Stephanie D.", "CHENS. I love you.My uncle used to own a restaurant called China Dragon. If you liked that place, you'll love this location. Their fried rice is the only one in Columbia that tastes as good as his, and his fried rice is BANGING. Panda, Ten Ten, and all buffets have NOTHING on this kind of fried rice.I've had only a few items on their menu, but my friends say the dishes they had were great. The General Tso's chicken is my usual accompanied by some fried dumplings and cheese wontons (which comes with sweet and sour sauce). All three are great, and the portions are good. A friend bought the ribs one night before shipping off to AIT. I forgot what expression he used, but it sounded like he could kill someone because his food was amazing. Of course, egg drop soup is what it is.Only bad expirience: My brother wasn't too pleased with his schezuan chicken/shrimp combo because it only came with 5-7 pieces of meat and 5 pieces of shrimp. The container was 80% full with veggies. According to him, it wasn't worth 11 bucks. I have to agree. It did taste great though... so good, I almost got it the next day despite the lack of meat.Their food, depending on the dish, usually comes in a reusable, dishwasher-safe container. It's nice to keep to pack meals or snacks on the go. 5 stars for good food and complimentary containers I used to eat lunch between lectures =)"], ["Enrique C.", "The price for the good taste and quality will be difficult match.I'm definitely returning for their sesame chicken and fried rice."], ["Food Gives Me Joy H.", "Excellent food and great customer service! It was so crowded I thought for certain it would take a while and/or an error would be made on our order but neither were true. 25min wait and our order for a family of 6 was correct and DELISH!."], ["Will D.", "They will steal from you!!! They added a 20% tip to my take out order after I signed the receipt! 20% for handing my food to me??!!!?? I didn't eat at the restaurant, I didn't order a drink, I just place a take out order, sat on a chair, and got it from the counter 15 minutes later.The food is okay and I was thinking of going back, but now I never will."], ["Greg E.", "Ok, it was a strip mall Chinese restaurant, so what do you expect?  The chicken fried rice was extremely bland, with very little chicken.  The Kung Pao chicken was 98% vegetables and extremely spicy.  The steamed dumplings were pretty good and filled with meat.   We ate in, and had to ask for knives, plates, napkins, etc.   going forward we will be in the area often, but this place will. It be on our list."], ["S S.", "The picture is not the right location. The chen's in the picture is near two notch and polo road, in a food lion shopping center."]], "Top China Buffet": [["Anthony D.", "Could have more of a selection, would like to see some real authentic chinese recipes other than the typical Westernized American style foods. But great staff, location, and food. Not to mention, best drink prices ANYWHERE!"], ["Paige A.", "It is one of the cheaper buffets. But you get what you pay for. There is not as much selection. No sushi. No fish. And no chicken that's not fried."], ["Joyce W.", "The food is average for a Chinese buffet, but a good value for your money.  No sushi on the buffet.  Every surface, however, needs a good scrub and the furniture is in dire need of reupolstering."], ["Richard G.", "This is usually a decent location for lunch but today the rice was bland. The sesame chicken was overcooked. No tea refill from the waitress."], ["Joe B.", "Been doing take-out from this place at least once a month for decades now. I typically choose among the fried rice, teriyaki beef or chicken, sweet/sour chicken, chinese vegetables, egg rolls, egg foo yung, lo mein -- the quantity, quality and cost are all very good and it's prepared consistently each time I order. It's a bit of a drive for us but it's worth it. They never make mistakes on our order and the customer service is super efficient and cordial. Some places I've tried it can be too salty, too greasy or skimpy (like egg roll contents) -- this place I can count on consistency of flavors and quantity and enjoying a very good meal. I have occasionally tried other places that were closer but have been disappointed with their flavor/greasiness/quantity/cost so I always go back to Top China -- my go-to place when I want (Americanised) Chinese food."], ["Rachael F.", "The food was very good. I particularly enjoyed their vegetable fried rice and green beans. They were both cooked very well. I was initially thinking about giving 4 star rating because the only issue I initially found was the crab rangoons were a little odd and undercooked. They were warm on the outside, cold on the inside. Definitely not food service safe. However I found some things that bothered me enough to knock of another star. First,  it is a personal pet peave of mine when buffets have tubs of ice cream for patrons to scoop from. They're unsanitary and gross. Desert options were nonexistent aside from the ice cream and nasty cakes you find at all Chinese buffets. What really set the 3 star review into stone were the bathrooms. No changing stations were present in either restroom. I had to change my baby on the counter, which was completely soaked with water. Because of this we will probably not return until our baby is potty trained."], ["Anthony T.", "I have been going off and on for the last two years. I have not yet been disappointed. At standard lunch time (11-2), there are simply too many people to allow the food to sit in in a pool of grease as another yelper had pointed out. Not all types will appeal to everyone, however, there is enough variety to please just about anyone.The tea is good, not like at other places where one can tell they are drinking tap water.So far, the taste here is the best for a Chinese buffet. I have been to bigger buffets and even smaller. I have yet to be disappointed with Top China Buffet."], ["Todd T.", "Have gone here with family (not my choice) a few times.  Not good food at all even by buffet standards.  Floors are reallllly dirty as in I don't think they own a vacuum.  All the steak and chicken on the buffet tastes like something other than steak or chicken.  I would honestly not want to eat here even if it was free."], ["Eaton O.", "Still FRESH and a SUPER VALUE ! As good or better at much less the price. Pound for pound, better than Happy China and Columbia King. If you are in harbison, st andrews, irmo.....don't miss it !!"], ["Amos G.", "I have to disagree with these other five star ratings.  This place offers quantity over quality. It's a huge spread, but none of it tastes good! The General Tso's chicken was a soggy, spongy mush.  The eggroll was soaking in a pool of its own grease.  All the meat on the buffet, especially the chicken, was of low quality. Most dishes were bland and tasteless.  The lettuce for the salad was brown. Not a single item on the buffet was up to par. Avoid this place.As a side note, Yelp users in Irmo need to post more reviews so that results are more dependable. I was irked that I wasted my time on this place based on its five star rating (from only three reviewers). In fairness, the five star reviews were posted about a year ago. Maybe this place was better \"back in the day.\""], ["Nicholas K.", "I.Y.I.T  (In Yelp I Trust)... I'll be the first to admit that I am weary of Chinese buffets.  It just seems like a cop out.  Plus, it's hard to think that there would be much quality control in bulk preparation of rice, noodles, egg rolls, and various stirfrys.  And on top of that, how do you choose a Chinese buffet spot from the dozens of them scattered throughout the city?Well, thanks to Yelp, we now have a way to separate the wheat from the chaff, the keepers from the throwbacks, etc.  And thank heavens for that... because a bad Chinese buffet can really be a terrible experience, but on the flip side a good Chinese buffet is positively heaven sent.  The latter is the case for Top China Buffet.Boiled pork dumplings, egg drop soup, egg foo young, fried rice, crab rangoon, egg rolls, General Tso's chicken, just about anything you'd order from your favorite Chinese take-out spot is available here and you'll be happy to know it is of the same quality if not better.  Those of you who are experienced Chinese food vets know that it can be greasy at times, but here, though there is plenty of dishes that have the propensity to be greasy, nothing really is.  Delving beneath the sneeze guard yields fresh, hot food items every time.  The very capable waitstaff constantly monitors the buffet line to know what to bring out next and I hardly had to wait a minute before my glass of sweet tea was refilled.So, as hard as it is for me to give a buffet spot 5 stars, I'm doing it with Top China Buffet.  I'm not one to rock the Yelp boat you know."], ["Pamela C.", "The food was ok but FAR from the BEST!"], ["Jack Z.", "As Chinese buffets south of DC go, Top China was definitely one of the better ones. The food is very typical of Americanized Chinese food: general tsao's, beef and broccoli, pepper chicken, etc. However they do feature some quality dishes like fried shrimp, shrimp cocktail, oysters, shumai, and crab legs. The food was fresh, warm, and quite well made. What puts the buffet well above others of its kind is the astonishing price. While buffets in bigger cities get away with charging $10-20 for dinner, Top China charges only $5 for lunch and $7 for dinner! This was an incredible find for an impoverished college student."], ["Bob H.", "I've been going here for a while now and the food is superb and fresh.  For the money, it's one of the best in Columbia, SC."]], "Chinese American House": [["James S.", "I forgot I was gonna take a picture. It's never along wait. To be honest this is Garnersferry's best. I would say Columbia's but it's always somebody who swear they know some place better.."], ["Monique G.", "I've tried the honey mustard wings(a winner)I have also tried the shrimp fried rice  (mediocre) and the house lo mein (will do). I will be visiting again for the tasy wings."], ["Bradley M.", "Outstanding House lo Mein! Beef roll is Great! Very fresh and delicious! This is what I read to get and I was very pleased for what I received. If this was a small plate I would love to see how many people it takes to eat the large!"], ["Dan B.", "Why this place has all 5 star reviews is amazing. Clearly says dine in on the ads and even the sign. There's like 6 seats! How is that dine in?? Wasn't even enough seats for us to wait for take out. False advertising. Get your stuff straight. Found a buffet down the street instead."], ["Reiko H.", "One of the best house lo mien I have had. Thick noodles fresh veggies, and it came out hot. I highly recommend getting a take out because the dinning room is really small. I will definitely stop in again on my next visit to Columbia."], ["Paul N.", "This place is great the best.House Lo Mien I would and am recommending this restaurant to my friends and everyone else."], ["Karrington H.", "I love their food and never had an issue with them. I love their chicken on a stick, their rice, lo mein and WINGS! I hate they close on Sundays  I plan on ordering in a few minutes."], ["Luke T.", "Always so hot and delicious! Amazing deal and their homemade chili sauce is incredible. We love their General Tso and broccoli beef. A weekly visit for sure."], ["William W.", "Hands down my favorite place for Chinese take out in Columbia. Their wings are delicious and awesome for parties or to take to work for coworkers. Everyone always loves them. Their General Tso's chicken is my personal favorite and has a really good blend of spices. They always cook everything perfectly and are really nice when you pick up."], ["Michael H.", "Best Chinese joint on the East side of Columbia. Good portions, clean, and excellent beef egg rolls (a rarity). Szechwan beef spicy is my fav, great every time.Not a very good atmosphere for dining in. If you get your meal 'extra spicy' they will put loads of the hot peppers in it, just say 'spicy'. Drink selection is pretty poor."]], "Bamboo House": [["Kat R.", "I was scared to order here based on reviews describing bad experiences. I ordered vegetable mei fun anyway.  In a nutshell, this is everything you would expect from a Chinese takeout restaurant.  The service was fast and friendly.  The food is hot, fresh, and how I was hoping it would taste.  What more would you expect?"], ["Jermaine G.", "Ordering online for pick-up with cash was pretty convenient. Could even write a note for the General Chicken to be 'Fried Hard', and it was. Often, my request goes unfulfilled at other Chinese joints. General Chicken itself was great. The white rice, however, was like chewing gum...and swallowing it. I called and described the rice. Immediately the Chinese joint took a defensive posture and sternly explained the rice is not prepared to my taste... I suspect they get such feedback about the rice all the time. It sounded well thought out, rehearsed. I'd pay more to have rice prepared as I prefer. I expect more from my money. Never going back."], ["Kimberly H.", "Gross. Ran in here during a lunch break. They're not friendly, the chicken wings are small and fried HARD, the mini spring roll filling is just mush. No salt on anything. Best thing I got from here was the canned mountain dew."], ["Doug M.", "Whoa.  This place is a winner!  The portions are small, but the soft rolls, thin sliced meat, melty cheese, and vintage decor did it for me.  This is a blast out of the past. . . .in a real good way!  I will be back!"], ["Lola S.", "Not sure of food quality but this place doesn't deliver so you should update this on your site"], ["Michelle B.", "We ordered take-out from the Bamboo House for the first time last night.  I ordered a combination plate, which included pork fried rice, an egg roll and chicken with vegetables for $6.50.  I also ordered an order of crab rangoons for $3.50.  The food was not bad.  The crab rangoons were exactly what I expected.  The chicken and vegetables was also very good.  It was fresh and hot, though more veggie than chicken.  The container was full of the entree and rice.  The rice was ok.  Not the best fried rice I've ever had, but certainly not bad.  The egg roll was also ok.  Fried a bit hard, but fine.  The prices and atmosphere were typical of this type of small Chinese restaurant.  In fact, it was actually a bit cheaper than the place I normally go, just a few miles away.  The online menu and ordering system is what really sets this restaurant apart.  I have never seen such an extensive system at a small Chinese restaurant.  The ability to see the menu itself was convenient.  However, as someone who enjoys placing orders online, I loved that this option was available and may very well be the reason I choose Bamboo House over some other comparable restaurants in the area."]], "Eggroll Chen": [["Travis J.", "Anytime I want chinese food I come here and no where else. They have so many different choices that you can't go wrong! I've tried lots of things on their menu and have only found 1 thing I didn't like (yen su ji). It wasn't a bad dish, just didn't appeal to my tastes. The family that owns it is very nice and the entire staff is great! Honey sesame chicken is the best I've ever had anywhere! They truly live up to their name because they have the best egg rolls around! The only downside to this place is it is always so hot in there! I don't know if the air doesn't work or if they just never run it to save money, but they have fans all over just circulating hot air! Other than that, this place is the best!"], ["Becky E.", "That's gonna be a \"no\" from me.   I just wanted some reliably decent Chinese food for lunch and you figure places like this are all kind of the same:  not overly spectacular,  but good enough to hit the spot.  It's kind of hard to get Chinese food wrong,  right?  Well I stand corrected.   This was the driest/crispy - est honey sesame chicken I have ever had.   And it had a really weird aftertaste (kinda made me nauseous) that lingers until you wash it down with something.   I've had better sesame chicken at the food court in the mall on a bad day.   To add insult to injury,  it's paired with a heaping mound of greasy fried rice with little to no flavor.  It also had the weird aftertaste.  My last complaint is they require a $10 minimum on credit/debit card purchases.  I know this is not a deal breaker, but it is still mildly irritating.   I'm giving them a second star because the establishment seemed clean,  and the girl taking my order was helpful and super sweet.   Also because I haven't tried other items on the menu.   Maybe sesame chicken is not their forte? But I don't think I'll be back.   That aftertaste is still haunting me."], ["Rohan T.", "Not impressed. Saw that this was one of the few Chinese takeout spots close by that had a fair share of reviews. There was no special lunch menu and they charge for your fortune cookie. Their combos only include one type of rice (brown fried) and an entree which is the first time I've ever seen that. I've made it a habit to order general tso chicken to understand a base line, and it was not impressive. It came with fried pieces of chicken without the campus General tso sauce you'd expect. Safe to say I won't be back."], ["Sarah A.", "The \"yan su ji\" (salt and pepper chicken) is the way to go! Perfect blend of salt and pepper (too many places mess up that mixture with too much salt)! Portions are large, while prices are small! Also, the beef noodle soup was good. The general tsao's chicken was nothing special."], ["Crystal C.", "OK, Taiwanese noodle bowl. So so good. I found my missing veg crunch. I guess sometimes just certain items are the ones that make a place shine. The kimchi also not bad. The fried wontons though are declining in quality and quantity for the price."], ["Anna D.", "poor egg roll chen.. why the bad reviews? LOLI personally like this place. The only things i've tried here are the rangoon things and the taiwanese beef noodle. The rangoon, eh, i can do without... or if i'm really craving it i can probably just drive to panda express. However, the taiwanese beef noodle is always good. they have a good amount of meat and veggies in it but even then i like to take it to-go and add in more veggies. The broth for the soup is beefy and very flavorful. If i could find a place that sold tendon here i would make it and add it in. Back at my favorite taiwanese place outside of columbia, the beef noodle would be sold as a beef and tendon noodle soup. BEST THING EVER. tip: if you're calling for a to-go order, it typically takes about 15 mins. speak clearly because they could get your order wrong. if they do, just let them know, they'll switch it out for the right one. :)"], ["Adam B. J.", "Eggroll Chen is some of the top Chinese in Columbi-yeah!  Vegetarians, the Tofu Lovers should be in your regular rotation!  So good.  The Eggrolls are good too.  The soups are spectacular (especially when it is cold out).  The favorites are also up to par.  General Tso's, Sweet and Sour, Etc.  Oh, and did I mention it is CHEAP!"], ["Michelle E.", "It shouldn't surprise me, since this place is so good, but I'm updating my review with a new favorite.I tried the Taiwanese Yen Su Jee and was glad I did. Have to add it to my list of favorites. It is bits of chicken, battered and deep fried, which isn't particularly interesting on its own, but they toss the fried chicken and rice in a flavorful mix of stir fried seasonings: basil, peppers, onions, and perhaps other stuff, probably some fish sauce and/or soy sauce. The seasoning mix is terrific. Spicy without being overpowering. This is a simple dish with a lot of flavor. It is dry, not saucy, which is a nice change sometimes. As is the norm here, the portion is large; you can get a half order to try it or add an egg roll and it is perfect."], ["Michael D.", "This place was impressive....for the price and taste it can't be beat. Service was well aware of all questions I had about there menu and I ending up with 5 different items and they were all good....."], ["Luke S.", "If you pick up at the drive through, check you order, don't trust them!Out of the last 4 orders, 3 orders did not include all the items ordered and paid for.  The only order they got \"right\" was when I complained about the previous order.  On the most recent order, the wings and egg rolls where left out.  The guy who answered the phone consulted with the girl who was running the drive through window and then claimed everything  was in the order. Next the manager got on the phone. He did offer to give a credit on my next order, but I actually wanted it tonight.  I understand that mistakes happen, but 3 in a single month is too excessive.  Too bad, I have been ordering from eggroll for 15 years and almost weekly for the last 5 years.  Oh and by the way, the manager hung up on me.  I hope this gets fixed but the manager really didn't seem too interested in fixing the problem.  He was more interested in getting me off the phone.  What a shame!"], ["Andrea R.", "Had lunch here with a group of 4. The inside is small and very out of date, but there was plenty of seating available.  Inside there is a fridge with some Pepsi products and Gatorades to pair with your meal.I ordered the chicken with broccoli, egg drop soup and an egg roll. My meal also came with fried rice ($12). Unfortunately I did not enjoy the chicken/broccoli. I get weird about chicken and I felt like it needed a few more minutes to cook and I just couldn't eat it. The broccoli and sauce were good though, the rice was kind of mushy. If I were to go back I'd probably just get a vegetarian option. The egg roll was just ok; I had a few bites of it. The soup was my favorite part of the meal, I mean it's hard to mess up a basic staple like egg drop soup (but I've seen it done) so I was happy to find that it was very good. Lots of egg and great flavor, I also enjoyed the crispy wonton chips that came with it. I do have to say the portions are HUGE, I think my chicken/broccoli/rice container must have weighed at least 3 lbs, definitely could split one between two people. Also, if you call in your order to pick it up they have a convenient drive-thru line, only to pick up an order you ALREADY placed though."], ["Alec S.", "What a great American Chinese restaurant.  I ordered the General Chicken and two fried chicken wings.  The wings we very crispy and full of flavor and the General Chicken was very good.  I got lots of food for under $10.I will definitely be back for another bite!"], ["Zack B.", "Lives up to the name, egg rolls are spectacular and the rest of the food we ordered was good as well! Glad I was finally able to try this place out! Cheap prices for a fair amount of food. Definitely will be back!!"], ["Rachel O.", "While eating my first lunch at Eggroll Chen I was already planning what I was going to get next time.  The menu has lots of options - all reasonably priced, the food was prepared quickly and you get a TON of it.  I ordered the honey sesame chicken and an egg roll.  The chicken was delicious... not too sweet. The egg roll was crisp on the outside and stuffed with a wonderful blend of flavors.  The rice was just plain fried rice and it was greasy. That may be my only complaint. I would try it again but maybe make it a shrimp fried or veggie fried rice.My friend did get the fried wantons and at $1.55 for about 5 of them it is a must not miss item! They were crunchy on the outside (but not hard) and were filled with pork and cheese. Totes yum.  Just do it."], ["Mike M.", "Curry chicken for lunch. It was delicious and a portion so big you could barely close the box. I'd reccomend checking it out"], ["Tau W.", "For its price, it's excellent. I'm Taiwanese and I approve! Definitely Taiwanese soul food."], ["Simon T.", "Decent, quick Chinese.Wish seasonings were bolder,But this ain't New York."], ["Casey M.", "I'm a regular, as you will not beat the combination of quality, variety, quantity, speed, and price anywhere. I've tried everything, but my favorites are 13,18, and 53 steamed (Dynasty delight, hot n nutty chicken, and dumplings) and I've yet to find a better egg roll."], ["Arden S.", "Great food at a good price. Fast service when u order. You get a lot of food for a great price!!"], ["Garry J.", "Long staple in Columbia. The quality and consistency doesn't get any better for Chinese takeout."], ["Karrington H.", "Their  chicken wings were flavorless and I regret buying them. Egg rolls were cold when I got it but I do know they can be OK when freshly fried. I don't like their rice. Never had any soup. The owner is really sweet and friendly."], ["Sarah P.", "This place is delicious fast and affordable!! I was a little skeptical about trying it, but it had good reviews so I figured I would give it a shot. It was so good! The price is great and they give you so much food!!"], ["Ryan P.", "I went here once and got the Kung Pao chicken which was very good. Went back about 3 days later and got the general tso chicken which was basically disgusting. Tasted kind of old and thrown together, large amount of rice but chicken wasn't good at all."], ["sambriddhi w.", "Every good review about this place is true. Food was fast, fresh, hot, cheap, and extremely freaking delicious. I was in and out in five minutes and the service was great."], ["Dawn P.", "Nothing to write home about here! I have passed this establishment many times leaving or going to the nearby Whole Foods. I have read the reviews and decided to give this place a try. I am extremely skeptical of Chinese restaurants anywhwre I go. During my years in NJ there were only 2 chinese places I patronized in the many years I lived there. Today my better half and i tried out EggRoll Chen. I had the boneless chicken w/ veggies and fried rice and my boyfriend had the honey sesame chicken. Both of our chicken were DRY..... Fried rice was Ehhhhhh. Food was kinda bland. With all the \"good\" reviews given to this place, that only leads me to the conclusion that many ppl have not traveled outsided of Columbia or experienced cuisine elsewhere.  This place may be wonderful for those who have little culinary experience but for me it was Ehhhh. On a brighter note the establishment was clean, service was fast and friendly.... Those were the highlights."], ["C P.", "Food was good! The sesame chicken was cooked and sauced very well! The spring rolls were also good. However, the service was terrible. I asked the cashier for chopsticks, \"just for funsies\". He looked at me with an angry face and rudely asked \"for WHAT -sies?!\" Then rolled his eyes at me and proceeded to flick me off. I'm sure he was just having a bad day though. He might not even work there anymore.Will definitely come back for more deep fried chicken with asian theme corn syrup sauce!"], ["Christopher K.", "The Chinese food in columbia tends to be terrible but at least this one has vegetarian options.First note that this place is dirt cheap and has huge portions. This is not fine dining.  The vegetables tend to be overlooked bit plentiful.  The rice is served in massive portions and again tends to be a but overlooked.  Don't try the brown rice, it's just white rice with some soy sauce mixed in.  I've seen this several times since moving to Columbia.  Weird stuff.  You will be glad they serve your dinner in a large styrofoam container because there is no way you can eat it all none go.For vegetarians there are actually vegetarian egg rolls but you must ask for them and expect an extra wait as they fry them fresh.  There are a couple of tofu dishes on the menu but you can get tofu in most dishes if you ask nicely.  They don't advertise either of these things.No matter what dish you get it seems to have the same medley of vegetables with it so no need to explore the menu too far."], ["Ruthi K.", "Ive been eating here for years and never had a problem...until last night. Ended up with food poisoning! I will never return! I got the honey sesame chicken, so be careful!"], ["Gavin W.", "Some of the best Chinese in town. Love this place. One of the few vegetarian friendly Chinese joints in town."], ["Naturally V.", "I ordered the sweet and sour chicken and a side of mixed vegetables. I thought everything was pretty good. The food came out fairly fast and they had pretty good customer service. I also got a lot of food for what I paid for. Many places don't fill the whole box with food."], ["Dave T.", "Hot and sour soup had a weird after taste. The Emperors Shrimp was deep friend shrimp  with fried white rice. No vegetables. Very boring. I ordered to go so I didn't realize until I got home."], ["James M.", "Remember when there used to be a Hardee's across the street from the K-Mart?  I was pretty upset when Hardee;s left  and some place called \"Eggroll Station\" moved in.  I mean...I like good Asian inspired food just as well as the next fellow, but I also liked my charcoal grilled cheese burgers too.  Well, if you remember the first time you ordered the \"Dynasty Delight\", \"Dragon's Triplet', or the \"Spicy Beef\"  you knew there was a harmony that flowed though the universe and all was right with the world.  It may not be authentic oriental food, but it's cooked right in front of you and the Egg-Drop soup is the best in town."], ["S H.", "Best takeout Chinese food in Columbia! (Don't go here looking for a nice atmosphere to dine in. Take it home so you can add your own sriracha.) My favorites are the veggie fried rice (no egg) and veggie spring roll. It's consistent, tasty, not overloaded with soy sauce, piping hot and relatively inexpensive. I'm sure it isn't healthy and I try not to eat it too often, but when I want Chinese food, this is the only option I'll consider. No point in going anywhere else. Plus the staff has always been nice to us, which I've found isn't often the case at Chinese restaurants."], ["L S.", "One of the best Chinese places around. The sweet and sour chicken is awesome. Great sauce to go with it. The honey sesame chicken is good too."], ["Brianna M.", "Big portions, good price, and nice pieces if meat. The food isn't over sauced like in some Chinese restaurants. Favorite Chinese takeout in Columbia."], ["Ebony Da'na C.", "Its hard to find good Chinese in Columbia but Eggroll Chen is definitely at the top of the list! The beef noodle soup is great along with the Fried Wontons, Beef Fried Rice, and Egg Rolls. (Stick to these and you won't be disappointed!) Its definitely affordable and you can get a smaller portion of food for a cheaper price. They also have the Super Combo where you can get chicken wings, fried rice, an egg roll, and a drink for less that $7. The owner is pretty friendly and the food comes out fast. I go to Eggroll Chen once or twice a week. For the value and speediness, four stars!"], ["Bruno S.", "Best Chinese food I've had yet.  And when my wife says she loves Chinese food somewhere it's definately good. She said it was the best fried rice even better than her favorite hometown Chinese restaurants. The lomein was delicious the sauce and veggies were cooked to perfection. The kids shared the sweet and sour chicken with white rice (which I tried) and it was very tasty. The meat tasted great and like real meat not gooyee or rubbery like they are at worst. They are very friendly and the interior is very clean and nice :) and they have a convenient pick up window for take out. I will definately be coming back and telling everyone about how great this was.The portions were extremly generous considering the price. We even ordered two orders of fried wontons and evgrolls and after tax the total was twenty three dollars (we have a lot of leftovers)."], ["Mackenzie B.", "Egg roll Chen is by far the best Chinese meal I have had in columbia. The \"mamasans beef\" is delicious! Good and quick service."], ["Drew B.", "While a poor, college student, I discovered Egg Roll Chen. Their prices are affordable; more competitive than any fast food restaurant, especially considering how much one receives for their dollar. The tastes are addictively delicious. My favorites: Mamasans Beef Noodle Soup, Fried Dumplings, Beef Fried Rice, Egg Rolls, and their Chicken Wings. I've been a fan for 15 years! Best Chinese food ever! YUMMY!!!"], ["Phillip S.", "Real good eggrolls and most of what I've tried is great Chinese food u also will enjoy the huge portions. They huge!"], ["Amanda H.", "My husband has been eating at Egg Roll Chen since college. The first time he took me here (telling me that it was going to be great) I was very dubious. The old building was a bit on the frightening side. BUT the food was fantastic!The new building is much better!Your food comes in styrofoam containers...and it is not fancy in the least. Still, the food is cooked fresh and is so reasonable!Anytime we come through Columbia, we always stop at \"The Chen\"!Our favorites are #13 Dynasty Delight, the egg rolls, and the outstanding fried wontons."], ["Gwonk B.", "Salty, stir-fried food, swimming in oil and no better than any other take out is how I'd describe the food here. You can go to a buffet for what you pay here!! The cooks aren't even Chinese or asian, at that.I've been here 6 times, ordered something different each time and was disappointed every single time. The food IS fast and they're open all the time (that gets two stars), but for $10, I'd rather hit a buffet and have choices from among lots of mediocre food.EDIT:  Having written that, I've found myself going back more and more just to try new stuff and get a LOT of food.  I have to say that this place IS addicting!  OK, I'm upgrading to 3 stars.  Will probably go 4 stars in another couple of months....EDIT 2:  The more you eat here, the more you want to eat here....upgrading to 4 stars."], ["Trey V.", "Literally the best Chinese food I've ever had!"], ["Alec Y.", "This place is clean, the food is good, portions are big, and the price is about right.  I normally avoid fast food egg rolls because they are mostly filled with cabbage and tastes like left-overs but this place gets it right and are aptly named.  You can't go wrong with the House Lo Mein, Dragon Triplet with noodles, Beef Noodle Soup, or the Taiwanese Rice Noodle Soup.  These noodle soups are about as authentic as you can get on this side of town."], ["Katie R.", "Head here for a delish, cheap Chinese order! The Hot and Nutty Chicken (as everyone else says) is the best. It's like Kung Pao, if you're used to that, but better. The atmosphere is a little bleak, but the staff is friendly and funny and the food is easily 100% worth your money!"], ["Melanie P.", "Cheap food with big portions.  BUT, the veggies are overcooked, soggy.  This is weird since they have a garden in the back.  Tend to be salty."], ["Lori B.", "Salty, msg-laden chinese.  Fast food atmosphere.  Friendy and effficient.  Cheap."], ["Nick B.", "The basic Chinese staples here are okay, but the portions are huge.  The prices are very reasonable, very.  The best thing on the menu and the only reason I visit is the rice noodle soup.  Its great!  The blend of shrimp, pork, chicken, noodles and light veggies is great.  All for like $6 or $7 bucks.  Definitely worth a try for a quick lunch."]], "China Hut": [["Krystal D.", "We ordered the original and lemon pepper cut wings, for Super Bowl Sunday. They were SO GOOD! We snacked on them as leftovers for quite a few days, & they were just as yummy reheated. I gave them 4 stars instead of 5, because they were almost $50.00 for 50 wings. Instead of just charging us for 50 wings, when we asked for the additional flavor (lemon pepper) they said they'd have to charge us separately: 25 original wings and 25 lemon pepper wings. That obviously increased the price by about $5 to $8, which we felt was a bit unnecessary."], ["T E.", "Very friendly staff, inside of restaurant is very clean. Have tried several dishes but I only like their wings. Shrimp and pork fried rice are just ok, egg rolls are disgusting"], ["Joel R.", "Food is full of flavor, the owner is very courteous and staff is also. Prices are ok, only negative is the food takes a while to come out, but I still go there every couple weeks."], ["Greg T.", "I accidently left my phone at this restaurant to return 5 minutes later and find it stolen. The employees had no idea where it went.... ya right. either the clientele or employees are thieves. The food is good, location is bad. So if you want a safe eating experience STAY AWAY. I'm pretty sure their lost in found is located on craigslist if you get my drift."], ["Karen R.", "A small, clean restaurant with available seating.  I ordered the shrimp fried rice and 5 piece chicken wings. It has been over 3 years since I had good, greasy Chinese food. The restaurant is in a shady  looking part of town so I would not risk going at night since I'm new and don't know the area well."], ["Eunmi P.", "Party specials are awesome! Chicken wings and fried rice  had filled people enough!!! Love the best chicken wings in town"], ["Pamela C.", "Lemon pepper wings & house fried rice....rice has the full layout with fried egg, bean sprouts & all it's  brown not like most places that serve that yellow mess with peas in it....YUCK!! Also has a variety of other great items on the menu...."]], "Chop Stix Chinese Restaurant": [["Melissa M.", "I love the crab rangoon especially, but everything i've gotten there tastes good and is on par for what i expect from a chinese restaurant. in fact, i think it is better than most chinese places i've been to. Taste good. Quality is good. I will go there again and again"], ["Miranda G.", "Don't be put-off by the strange exterior. This Chinese restaurant has good food, large portion sizes, and low prices. Take-out is pretty much a must, but you won't be disappointed by what you get for your money."], ["Michel W.", "My go to for take out Chinese in Columbia. My boyfriend and I love the sweet and sour chicken, sesame chicken, shrimp egg rolls, crab rangoon, and lemon pepper wings."], ["Shane J.", "Let's see. Ordered 2 spring rolls, a vegetable lo mein and a shrim p w lobster sauce meal. The guy at the counter repeated the order back to me so I know he heard me right. Get the food home and the only thing they got right was the spring rolls. Got pork lo mein and some type of shrimp soup. Quality of the food doesn't matter when the restaurants incompetence is so glaring. Won't be going back."], ["Mona lisa V.", "Unremarkable.  I went to this place based on the ratings here, and I was disappointed.  They're right about part of it; it looks like your standard cheap Chinese, complete with a person taking orders who is unable to answer questions about the menu, cheap prices, a giant section of the glass storefront covered in cardboard and packing tape, an uninviting dining room and all that.  And the food lives up to the unimpressive exterior in a \"gosh, it's awfully sugary, and this doesn't look like chicken\" way.  The white rice was perfectly made, however, which was nice.Certainly nowhere to go out of the way for, but cheap and edible."], ["Matthew C.", "Looks are very deceiving. Although it's next to a chop shop and when you enter the place you may think your walking into a drug front; you can't judge a book by it's cover, because the food is very good. If  the ambiance creeps you out just take it to-go and enjoy it at your house because you shouldn't pass this place up."], ["Craig U.", "Have you ever driven by some dumpy looking place and said OMG, how good can it be? Well I can tell you this is some of the BEST chinese food we have eaten, authentic NY style as you can get, especially in SC, prices are fair and portions are large, in 5 years we have never had a problem, ding room is practically not used, 2-3 tables, take home is the bomb."]], "Sun Ming Chinese Restaurant": [["Ariel P.", "Amazing! Smelled fresh, looked fresh, and tasted fresh! Not like any chinese takeout I've ever had. The flavors are deep. They don't deliver but it's so worth the drive. 2 thumbs up!"], ["Lillian C.", "This is an impressive little Chinese restaurant with fantastic decor outside of Columbia. My SO's parents (I guess my quasi-in laws) bring me here all the time. It is definitely Chinese American (their Chinese style sweet and sour is not remotely authentic) but their food is pretty delicious if I could say so. The egg drop is one of the most flavorful I've ever had and they have a nice, interesting assortment of Chinese greens with their chicken with mixed vegetables. I also had the shrimp in lobster sauce before, which was delish."], ["Brandy B.", "This past Sunday was a sad day...I'd been cravingggggggggg Sun Ming.  I wanted some fresh \"authentic\" Chinese and Sun Ming has recently been my go-to ONLY option.We've always had excellent service dining in and to-go!We arrive around 5pm, review the menu, order a tonnnnnn of food and the waiter suggests we move to a larger table to accommodate all the food, which was great because we needed it.We moved over to one of the family tables by the wall, we're chatting, enjoying ourselves and low and behold there's a ROACH crawling down the wall.Seriously.It. Was. A. Roach.Not the \"typical\" palmetto bugs that are seen here during the rainy humid months... It was the other little nasty kind!!!!!!!!!My dad killed it with his napkin, told our waiter what happened, and I'm not really sure if there was a language barrier or if he didn't really care, but he just kinda laughed and walked away... (I don't know what I'd expect him to say or do, the bug was dead - awkward!).I'm sure the food was just as good as it was the last times we'd eaten here, but this time it just didn't taste the same.I'd say it's safe to assume a lottttttttttt of places have \"issues\" and it is what it is, but, what you don't know won't hurt you!It's unfortunate and I'm depressed now!"], ["Jacob C.", "You get what you pay for!  This place was really good!  We got the green beans and beef with General Tso's chicken.  Everything was great, service was spot on, price was fair, everything was clean, watched a football game,and ambience was cool too.  Check it out for yourselves."], ["Cherie R.", "This was probably the best Chinese food I have ever had!  All of the meat was so tender and the veggies/fruit were obviously fresh.  We tried the pineapple beef and triple treat.  We also sampled the crab puffs, spring rolls and egg rolls.  Each item was great, and not greasy as so many of these selections can be.  I was also impressed with the egg drop soup, which I always thought was only yellow, there's is white and of a perfect consistency.  In addition to above average food our server could not have done a better job, very attentive, prompt and also engaged our son and had him giggling.  My fiancé and our 10 month old son were very happily stuffed and anxiously looking forward to our leftovers!  We will definitely be back!"], ["William B.", "Love this place.  For some reason people love Miyos, but I find it just okay.  I'm pretty sure this is the place Chinese people go to get legit Chinese food.  I love everything I've tried.  The service has always been good, and the food is just incredible."], ["Ashley H.", "My foodie friend and I split half of the fried Cantonese duck and we annihilated that thing! We also had sweet and sour soup and a few spring rolls. It was so tasty, the restaurant was nice and clean- the service was great as well. I bet this place could do dim sum really well with their extensive traditional Chinese menu. Let's start a petition!"], ["Tony D.", "I ordered Mongolian Beef...it was ok, nothing special.   Friendly, fast service.  Good size portions, decent value.  Not memorable, I will likely go back."], ["C. T.", "Only reason i am not giving 5 stars is because The eggrolls lately arent made fresh they are stale and barley warm...The egg rolls up until now are the best and most authentic in the Midlands. The rest of the food is REALLY GOOD....Noone delivers in Irmo except Pizza places. they are missing so much business. With that said. This is the most Authentic Chinese food ever!!!  Most of these people are from China and rotate employees Quarterly or annually.  So its as authentic as it gets...Great Fast Service."], ["Sateesh N.", "Good food.. Decent proportion.. Not so expensive.. Would go there again..Went with a group of 10..service was fast and food was great. Vegetable curry was good."], ["Grace M.", "Best AUTHENTIC Chinese food in town. I highly recommend it. The only downside is they don't deliver. But with how good the food is, they aren't really missing out on the business, because those that patronize this place know it's worth the drive. My favorite things to get are the hot and sour soup or wor wonton soup for an appetizer. For their entree, I prefer their  lo mein, amoy rice noodles, Singapore rice noodles,or their spicy tofu. You also can't go wrong with general tso's chicken... or any chicken/ beef dish for that matter. Don't be afraid to venture out and try new things. You won't regret it."], ["Christopher K.", "I am reviewing this as a Vegetarian.    Sun Ming is one of the few places that actually has a Chinese menu with more traditional flavors than what you find in American Chinese food.   The vegetarian sections of the menu are a little light because many of the dishes are meant to be served family style as a side, not an entree.   This is easily remedied however by asking for a tofu substitution on many of their other menu items - just me smart about it.   The last time I was there, I had their fermented cabbage with pork made into fermented cabbage with tofu.  Sour, salty, fermented ... divine.   Warning, fermented cabbage is not a starter dish - you may interpret some of the flavors as spoiled instead of simply fermented.If they ever decide to serve DimSum I will upgrade them to Six Stars."], ["Furman L.", "This is my go-to restaurant for authentic Asian cuisine. Excellent atmosphere and outstanding service. A bit pricey, but worth it. Highly recommend!"], ["Tony S.", "I'll go ahead and give you guys 5star. Although u guys don't delivery but yelp has it on as a delivery restaurant.  I ordered the general Tso chkn and ribs tonight. The food is Excellent!! I hope the Foo chows don't open up a big Buffet restaurant right next to u guys serving juat as good of a food. It will effect you guys like it did the rest of the mom & pop restaurant in columbia. Gl and you will have repeat customers from us! :)"], ["Randall D.", "I am a second-generation American-born Chinese guy who knows what real Chinese food is like.  I have eaten Chinese food in Hong Kong, San Francisco, and New York City.  If you want real, authentic Chinese food that is the closest thing Columbia has to a big-city Chinatown eatery, this is it.  The place has a huge menu, including many traditional Chinese items that would be unfamiliar to those who have only eaten Americanized Chinese food.  There is a board at the entrance listing specials, including real Chinese vegetables.  The restaurant is very clean and pleasant, with excellent service.  It has some big, round tables with lazy susans for large parties.  The big tables are most frequently populated with big Chinese families.  It's a good sign.All of that said, I would advise that if you are not adventurous and would insist on ordering Americanized items like General Tso's chicken, you are missing out on what makes this place the best.  I'm sure they do a fine job on egg rolls, egg drop soup, and sweet-and-sour pork, beef and broccoli, egg foo yung, and fried rice, but that stuff is the same everywhere.  Go outside your comfort zone and order something different that you can't get at every fast-food Chinese joint in town.  Tell the server what flavors you like and ask for help choosing something from the authentic Chinese menu.  You'll be glad you did."], ["Ellen A.", "I heard the hype and decided to try Sun Ming. And it was all true! This is, far and away, the best Chinese restaurant in/around Columbia. They also have a wide variety if veggie/vegan options, (as a Chinese restaurant should). Despite that, we decided on a string bean dish under \"Meat,\" which they graciously made with tofu. It is one of my favorite dishes in general and their version is the tops. The tofu vermicelli dish was mild and comforting. Spot on Sun Ming - you now have new regular customers."], ["Coye J.", "Best authentic Chinese food! We always get the pan fried flounder and garlic green beans. The steak with pepper is amazing."], ["Tiffanie C.", "The selection is good and the staff friendly.  I orderedThe potstickers:  very good with a nice accompanying dipping sauceThe spicy beef noodle soup, in the \"authentic \" section of the menu.  About $10 and enough to feed 2 people at least.The \"spicy beef in pot\" off the \" authentic \" section.  Two chilli peppers worth of heat warning and they were right.  REALLY cleared out my sinuses.  And enough to feed 3-4 people .  About $12 on the menu but I had them add extra veggies, it normally just served with napa cabbage.Also ordered hot green tea and 2 cups of saki."], ["Eric W.", "Went here last night for the first time. I read lots of really great reviews which is why we went. I ordered general tsaos chicken which is my favorite Chinese dish. The meal is $11.95 and only comes with white rice. Upgraded to egg fried rice for (an overpriced) $3.50. $15+ for Chinese food is a bit pricey for this area.The verdict: the chicken dish was just OK. I really didn't care much for the sauce. A little too sweet and not the least bit spicy.With that said, the egg fried rice was easily the best fried rice I've ever had, which is the only reason I'm rating 4 stars. In my opinion, for $12, a meal should at least include fried rice."], ["Keith K.", "Times here: 10+  Lunch, dinner and takeout.Briefly: Sun Ming is my favorite Chinese restaurant in Columbia.  They really do everything quite well.  Let's break it down a bit, much as one would a chicken or a Supreme Court minority dissent on a recent ruling that really ticked you off.  (That Scalia is a dill-hole, right?)The restaurant itself is nothing unusual - one large room with a small bar and partitions.  Two unnecessary televisions, somewhat dim lighting.  Everything is clean however, and the larger tables are wonderful for parties.The menu is VAST, varied, and ranges from the basic and accessible General Tso's chicken and egg rolls to the more traditional beef brisket hot pot, string beans, egg foo young... and then the downright rare - fish head soup (good), chicken feet (eh), pork stomach (not braved it yet) and so on.  Really hundreds of items and it's super fun to peruse.  The fare is a cut above what usually gets passed around in Columbia, but won't win any awards for presentation - just deliciousness.Some of my favorite items include: roast duck, Wor Won Ton soup (hearty!), 5 spice pork, cumin lamb and the Mala dishes.  All the Szechuan options are welcome and you can ask the kitchen to dial up the heat till your mouth drools from numbness (in a good way).  There are a good amount of meatless options for you vegetarians out there & I'm happy to report that the Ma Po Tofu = wonderful.Service has always been prompt, friendly and accurate. I haven't seen many other mention this, but Sun Ming offers a FANTASTIC service with their online ordering via their website.  Simply place an order, select the day and time you want it ready, and pay when you pick up.  The website is clean and easy to use and my order is never-not-ever wrong.  I wish more restaurants would get on board with this idea.Sun Ming is simply delightful for groups of 6 or more, order family style and share away into the night.  Go ahead, try it, you'll like it.  I look forward to many return trips."], ["David M.", "Excellent authentic Chinese food is available here if desired.  Can't comment on the more Americanized food as I did not try it."], ["Regina W.", "Sun Ming is my 2nd favorite restaurant after Antai in Lexington. The food is amazing and the portion sizes are HUGE! The Chicken Fried Rice, Egg Rolls, and General Tso's Chicken are my favorites! Check it out!"], ["Tani P.", "Food was delicious and quick service. They serve a lot so it was worth the $$. Definitely will be back"], ["Michael Y.", "By far my favorite Chinese restaurant. The food is exceptional!  The staff is very friendly. The prices are above average, but the quality of food definitely makes up for it."], ["Kevin L.", "Columbia isn't a large city where there's a ton of real Chinese restaurants around. Usually, small cities will have your standard China Wok III or Panda Express where everything is covered in some kind of sci-fi orange sauce that's laced with MSG. Sun Ming is one of the few places that is doing it right. When going to a Chinese restaurant, be sure that there are actually Chinese people eating thereThe restaurant atmosphere is absolutely great. It's very welcoming, with traditional stained woods and traditional Chinese motif's that you usually don't see.Food has always been excellent ever since I came here in 2002. The chefs are very accommodating to your tastes, and a brief description can adjust their dishes to your exact tastes. The go-to foods for me are the eggplant, the beef and rice noodles, clay pot beef, and the green beans.My only problem is that sometimes the staff can be a bit pushy at times. It seems like they've gone through numerous managers and front of house staff, and the consistency in service fluctuates year to year.While there are definitely better Chinese restaurants, this is probably the best one within a 50 mile radius."], ["Emily E.", "Best authentic Chinese in town, this coming from a military brat that grew up in China.  Ask them for recommendations and they will hook you up with the best dishes.  Spicy eggplant is great but you really can't go wrong with anything here."], ["Roseanne R.", "We ordered take-out tonight. The food was delicious, piping hot and very plentiful.  The order was packaged well and included sauce packets and fortune cookies. The best Chinese food in Columbia!"], ["Sam C.", "I travel a few times a year to Columbia, SC and I have to say, the best place in Columbia (not even close). Food was fresh and flavor was awesome. Go for the Spicy Chicken Ding, WHAT WHAT!!!!!"], ["Chris T.", "Go for the authentic menu on the back.  All of the dishes are awesome and the portions are huge."], ["Mona J.", "Had a luncheon with 4 friends yesterday.  Not many people dining for lunch yesterday, a Tuesday, so if you're concerned about getting in and out during your lunch hour, it shouldn't be a problem.Served very quickly and very friendly service.  I asked if I could order something that wasn't on the Lunch Menu and was quickly brought the full Dinner Menu.  I ordered Chow Fun which most Chinese restaurants do not offer.  This is one of my favorite dishes and I was not disappointed.  Generous serving and I took 1/2 home with me in addition to an order of Mongolian Beef for dinner last night. My husband loves the food from Sun Ming and was looking forward to his favorite.  It was wonderful.  My total bill was $21. That was lunch for me and dinner for 2.  Not bad!My friends ordered from the Lunch Menu and had Sesame Chicken which came with broccoli and one ordered Fried Shrimp with Lobster Sauce. Their meals came with an egg roll.  All commented their meals were excellent and the price was $7.50 plus drinks each.Everybody needed a take home container.  Quality Chinese food with very pleasant surroundings at an affordable price.  We'll be back."], ["Xinling X.", "As a Chinese..., I think this is the best Chinese restaurant in this area."], ["Jeff J.", "Ordered food online.  They lost the order, had to wait an extra 20 min to cook. They rushed it and my food is raw and inedible.   No good."], ["Stefan F.", "Great Chinese food, the best in the area. This inside of the restaurant looks a bit more up scale on the outside. I ordered take out, but wished I would have stayed when I realized how nice it was. It was much nicer than the inside of the joints you see in the same complex as a grocery store. The food was also quite good. I ordered the sesame chicken and was not disappointed. The egg rolls were average however. I plan on returning whenever I want good fast Chinese."], ["Maria H.", "I've gotten tired of the Americanized Chinese buffet that you can find at almost every corner here. This place was a pleasant find for me and has authentic food and portions that I think is worth the price. I used to work at a Chinese restaurant in my hometown when I was younger and I could never find food around here that tastes as delicious as where I worked. Until now. The location is perfect for us and close to Harbison. I'll definitely be back!If you're looking for a fast Chinese take out or buffet, this is not the place. If you're looking for authentic food and a nice sit down atmosphere, then this is definitely your place."], ["Sam T.", "5 stars because of the food!!!!Sometimes, however, the people are not very pleasant...possibly a bit rude/stereotypical/not very diversely inclined \"/      but I'll leave that at thatBy far, the best General Tso's I've ever had.  Homemade duck sauce is better than anywhere.  Extremely authentic chinese food section of the menu, where you can eat REAL Chinese food and not the Amero-Chinese food.  Curry is spectacular here, the duck is sublime  just do not hesitate to try this place, and if you do, it's a guarantee that you'll be happy!"], ["F. Chandler W.", "Best Chinese food in the city. Has all the classic dishes as well as an \"Authentic Chinese Food\" menu. Fish head soup anyone? Portions are huge."], ["Nancy B.", "The food is fine but the service is usually awful and they allow the kitchen staff to smoke and frequently the smoke gets into the restaurant. When I asked why it was smoky, I was told by the server that it was coming from the kitchen workers smoking and no one seemed at all concerned about that. The servers hang out in the bar area and are not at all attentive.The attitude was \"if you don't like it, leave\". They charge extra for absolutely everything, including brown rice. As another reviewer said, at these prices, that should not be the case"], ["Mia C.", "I am not a huge fan of authentic Chinese food, but I liked this restaurant. The chicken dishes we tried were tasty and perfectly cooked. Their location is also convenient, being close to Harbison blvd."], ["J S.", "Great food the Mongolian chicken was fantastic the service was good always a favorite and one of the best in Columbia."], ["Allison C.", "Best Chinese in Columbia area. Being from Los Angeles, it is super hard to find any good authentic food in the South, besides anything fried or shrimp and grits (which I have come to love). This Chinese is almost as good as the Chinese restaurants back home, which makes me very happy :) They even have the traditional Chinese dishes!"], ["LT S.", "Good sized portions.  Better than other places I've tried in the area.  Most everything is on the sweet side but all in all very good.   Family style portions but not served family style.  Recommend asking for additional plates when ordering."], ["Laurie C.", "Great Chinese food. Not your average \"combo #5\" place."], ["Liz T.", "This is a great little SIT DOWN chinese restaurant (so hard to find these anymore!).DH and I ordered the vegetable spring rolls which were crispy and fresh. I ordered the sesame tofu - so delicious and a HUGE portion (it had to be more than a block's worth), DH got General Tso shrimp and we ordered vegetable fried rice for the table. All of our food was delicious and the service was fine. Very good!"], ["Gwonk B.", "This place serves authentic Chinese cuisine in a sit-down style.  You still get the cheap chic ambience of a buffet restaurant, but the food is higher quality.  The portions are large and soup and two entrees was $25.  It's much more expensive than a buffet, but you won't leave hungry and you will get a food quality that is very good, indeed.  The only downside is that the rice is cheaper Thai or long grain rice that isn't as nice as the short grain sticky Japanese-style rice I like.  But it's fine for eating.You really can't go wrong here and all the stuff is delicious, but remember that because it's the only place of its kind in Irmo, it CAN get crowded in a hurry.  Be prepared to wait, but be prepared to eat hearty food and leave full."], ["Jason M.", "Very Good food. The fried dishes are crunchy with a soft center. There is no cheap crappy style buffet, and the food taste like it is cooked to order. The portions are big and the House fried rice is the best in I have ever had. The price is more than what you can expect at other Chinese restaurants, but it is well worth it."], ["Don D.", "This is the only Chinese place in the Columbia area we will go to now. It has good food, a nice clean atmosphere, very good service.  Everything tastes fresh and well prepared.  It is a long way from where we live in Shandon but I've never found better Chinese food closer and some of what I've had here is horrible.   Someone who spends a lot of time in China first told us about this and I am always impressed with the number of Chinese who eat here. I always want to know what they are ordering!"], ["jimmy s.", "Best Chinese I've had in Columbia so far. Ordered the ma po tofu, which isn't on the lunch menu, but I read that they specialized in Sichuan cuisine. Asked for ma la \"hot and numbing\", a signature style in that region of China which makes use of the fragrant (and numbing) sichuan peppercorn. The dish had slight heat by no sichuan peppercorn. Other than that, good. Clean place, nice servers. Recommended."], ["Nicky D.", "Delicious food and nice people! Perfect restaurant for a date night! The ambience is lovely."], ["Epicurious E.", "Sun Ming is the only restaurant I would recommend in the area for more authentic Chinese food. The location is pretty convenient and accessible; it is off the I-26 in Irmo on St. Andrews Rd. right past the railroad tracks. All the other Chinese restaurants in this area aren't necessarily the worst Chinese food I've ever eaten (Miyo's, a very popular Chinese restaurant in the Columbia area, has decently fresh ingredients), but the flavor everywhere around here is always kind of light and/or bland, and generally just a little bit off compared to the chinese food I grew up with at home and at restaurants in the Los Angeles area. Sun Ming doesn't serve the best Chinese food I've ever eaten, but it is by far the best in this area.A random note for anyone that might be interested: I have heard that Sun Ming also serves dim sum, but I have not confirmed on what days they do this, nor the quality and breadth of the dim sum they offer.At Sun Ming, the menu have two sections, one with the standard Chinese dishes (served in individual portions) and one labeled as traditional Chinese cuisine (which I would suggest ordering off, it is in the center of the menu they provide at the restaurant). The dishes in this section are prepared family-style, meaning that they are served with the intention of everyone sharing in the dish, instead of one individual dish for each person. This is the typical way to serve Chinese food, as it gives everyone a bigger variety of food to choose and eat from.For more details, as well as photos of the restaurant and the great food here, you can visit my food blog, epicurious-eats.blogspot…"], ["Kate L.", "We took my in-laws to Sun Ming's to eat during a visit. It was the first time we'd been to eat there but had heard good things. My father-in-law and I both got food poisoning from the pork fried rice. It lasted two days and was so miserable. Never again."], ["Keith K.", "With Columbia lacking a PF Chang, this is the best place for Chineese food. You will not go wrong by trying this restaurant."], ["Miriam A.", "Delicious - the most authentic I've had in Columbia metro area.  Bean curd, Szechuan green beans, Mongolian beef, all sorts of tasty meat dishes!  The dishes are served family style and everything I've had is delicious, with the exception of the soup which was a little bland.  Crunchy fried wonton strips do liven it up, though.  The decor reminded me of the more authentic Chinese restaurants I've been to around the US, where the large tables had lazy susans in the middle.  I'd get more specific, but let's face it, you're not going there for what it looks like.  You're going there to fill up on delicious dishes and taking home half of what you've ordered.  And I fully endorse that plan.  It's worth the drive from downtown Columbia out to Irmo!"], ["Elizabeth B.", "Best Chinese food I have eaten short of the Chinese food I had in Vancouver, Canada. My friend Amber and I went here for Lunch yesterday, at lunch they have the traditional American Chinese food, next time we go we are going for dinner. Amber and I had three appetizers: Crab Puffs, Fried Wontons and Fried Pot Stickers, all of it was very good. I had hot Jasmine Tea, they bring a pot of tea to the table for that, it was so good, Amber had sweet tea, which tasted good too, for some reason Asian people know how to make really good Sweet Tea, then for our Main Courses, Amber had Sweet and Sour Chicken with Fried Rice and Hot and Sour Soup, I had General Tao's Chicken with Fried Chicken and Egg Drop Soup, It was really good. We looked at the dinner menu, it looked really good too, lot of Traditional Chinese food as well as the American Chinese food. The Lunch food was good, but the Dinner Menu looks even better. Can't wait to go back and try dinner."], ["Tyler P.", "Eggrolls are AWESOME!!!"], ["Katrin L.", "Highly recommend this place - if you are looking for traditional Chinese cooking - make sure you flip to the back of their menu. Their beef brisket was delicious !!! A bit pricey to substitute fried rice for white rice but very good nonetheless. Their spring rolls are very good too!"], ["Jay L.", "Authentic Chinese food, best around Columbia!"], ["G M.", "To locate a Chinese Restaurant of this quality  was a most pleasant surprise!   We have eaten there several times over the past few years and the quality of the food has NEVER been a disappointment - always top notch and always fresh.   I recently had a scallops and snow peas dish and both the scallops and snow peas were cooked to perfection!  The snow-peas were crunchy and the scallops melted in your mouth.   The also have a full bar with an impressive array of very reasonably-priced drinks - almost anything you would want to try or order was on the menu. The staff is friendly, helpful and attentive - never did we have to ask for beverage refills and they promptly removed used dishes from the table to make sure we have adequate room.  Sun Ming has a vast array of traditional Chinese dishes and Chef's Specialties and Szechuan Dishes - something for everyone - all prepared to perfection.  Enjoy!"], ["M D.", "Most people have come to equate chinese food with wither cheap delivery or cheap buffet.  This is neither.  They have a fantastic selection of well prepared food both American- Chinese food and real Chinese food.  One trick I learned about this place though... I have been many times, and the waitress will not come until everyone puts down their menu... So if you are reading all the menu items for fun.. be prepared to wait a long time."], ["David S.", "Darn good Chinese food and it's nice and close to my house."], ["Nicholas K.", "Authentic Chinese food without all the Americanized bull.  A bit of a hike for the downtown Democrat set but well worth it.  Pair it with a movie somewhere in the netherworld of Harbison and Columbiana Mall and you've got a date any woman would be proud to go on.  It's been a while since I've been out there but I can't shake the feeling of warmth and goodness that I associate with this place.  For Chinese food prepared with a little more love and affection than a take-out or buffet place, you've got to try this place."]], "Peking Wok": [["Pamela C.", "The beef & broccoli was very good! The service was fast and friendly.  I also tried the whole wings.  There was nothing special about the wings.  Bland tasting which is unusual for a Chinese restaurant!  Wings should be marinated to give them that Chinese flare. I give it 4 stars for my 1st visit."], ["TruIndian W.", "Definitely not the BEST Chinese food in Columbia however if you are a local maybe it is! Greasy food almost to a non edible state... service is decent ... I had vegetable lomein first I tried to distinguish what type of cheap spaghetti looking noodles that were in my dish secondly I had to search for a taste! Totally terrible!  Lastly I got sick from the two bites that  I could tolerate!  OMG gross! Oh did I mention it was an overpriced meal of vegetable lomein I suppose veggies means three pieces of broccoli!"], ["Chuck J.", "This is really good Chinese. I'm pretty picky. Love the pork fried rice and also beef with broccoli.  They give you a ton of rice for the money and don't skimp on the broccoli.  Great place to eat good food!"], ["Leonor C.", "Service is fast and friendly. Best Chinese food in Columbia. I have tried many others, and in this one their ingredients are so fresh. I had shrimp with broccoli and was delicious. The house fried rice and the noodles with curry sauce is really good. I could eat here every week!"], ["T E.", "Best Chinese in Columbia, I prefer over well known restaurants like Sun Ming. Have been eating at Peking for over a year and food is always fresh. You should always call in advance on Fridays because they get very crowded. I did not like steamed dumplings until I tried theirs and they are always great. I have tried several items including Mongolian Beef, Spare Ribs, and Orange Chicken. They also have really good egg rolls."]], "Little Panda Chinese Restaurant": [["Crystal C.", "When it comes to Chinese food, it's difficult to pinpoint that perfect place to indulge the ever-familiar cravings for saucy, savory, noodle-y goodness. Chinese food--while its very mention tends to give most of us the warm tinglies--is not all created equal.Some of the places renowned for their curb appeal lack the ability to satiate with good flavor. Quite a few establishments blaspheme the sanctity of the experience by inundating everything with generic brown sauce, too much salt, and an excess of grease.It doesn't matter where you're from: Chinese food on a paper plate, buffet-style, or eaten out of those signature folded boxes tends to elicit an innate sense of satisfaction. In Columbia, we're given an abundance of choices when it comes to great Chinese.My personal favorite has to go to the Little Panda restaurant on Forest Drive. This take-out or dine-in eatery has my vote because the focus is solely on the food(....)Read the rest of the review here: examiner.com/restaurant-…"], ["Galen M.", "Good Chinese takeout with everyday specials that include a meat, fried rice, and sweet tea for $7.  Plus it's close to Fort Jackson and the food is made to order pretty quickly."], ["Melodie D.", "Really bad! I hate writing a bad review but this was so awful! We found a menu and coupons in our hotel and looked up reviews. I called and asked a few questions about what veggies were in which of our favorite dishes and ended up ordering chicken & broccoli and chicken with mixed veg. The girl on the phone did not tell me all of the ingredients for either of them correctly and my husband and I ended up with things we both weren't happy with but even worse they forgot to put any chicken in the chicken w mix veg and hardly any in the chicken with broccoli. We were also told that coupons don't work on delivery although the coupon did not have any such rule stated on it! Very bad experience! Wish I could come up with one nice thing to say but I really can't for this place!"], ["Westwood D.", "Good, cheap, and made to order. Nothing fancy, as this is just a hole in the wall for cheap Chinese food served in a styrofoam box. Around 6 or 7 bucks for a lunch. I order the garlic chicken with white rice. Good size portions for the money. Had to knock off a star for the excessively dirty and smudged windows I had to stare at while eating. I little Windex now and then wouldn't hurt."], ["TIM V.", "Based on the three positive reviews - in 2012 - I am hoping that our family hit this place on an off night. I have had very good, even excellent, Chinese food in my life. Most of my experiences are in the so-so range. This carry-out visit failed to meet even that low bar. On the POSITIVE side, the food was ready as promised in 10 minutes. And, the location is very close to home, so it was still warm when it was served. And, as previously mentioned, the price was reasonable. We ordered the pu-pu platter - in a word, yech. A few items appeared to be freshly-fried. Most looked and tasted like they had been dipped in the vat quite a few times. I did try to sample everything, but really only so my kids would think their dad was walking the walk. Maybe they give the carry-out folks the old stuff and the dine-in crowd the better selection. You'll have to let me know. We also ordered General Tso's chicken (my go-to dish for a first time visit) and I'd give it a solid C+. I am, however, feeling a bit queasy, but it's too early to tell if this if food-related or a symptom of the stomach virus that's making the rounds. My wife got the mu-shu pork (her go-to dish). For this, she gave ME the finger. Best of luck on your visit."], ["Ryan P.", "I've been to this place 3 times now and wanted to wait to see what the food and service is like on a regular basis before posting a review.  The food is actually really good, I've gotten different things every time I've gone and enjoyed eating all of it.  The portions are very large which is GREAT, and the people that work there are always nice, the place is clean and you can actually see the kitchen from the register which is nice, all very fresh, filling, and cheap! Great place, stop by here and give it a try!"]], "Miyo's At Columbiana Place": [["Sandra R.", "Not bad. First time here. Would come again. Great variety on menu. Had shrimp and chicken pad Thai lunch portion. Just right. It's a little sterile in atmosphere more like a large airport cafeteria.  But clean."], ["LT S.", "So it's been several visits since we've moved here and comparatively speaking it's not bad.  But there is huge room for improvement.Sushi is not a big COLUMBIA thing.  I get it.  And Miyo's as a local gain has the market cornered.  This location suffers from a few fatal flaws, service being the most obvious.  Wait times always exceed expectations.  You can be greeted quickly and sat at a table but then wait 10 minutes before anyone comes over.  Or you can wait a long time to be seated all the while seeing they are not very busy and have someone pounce on you the moment you sit.  Regardless of when they do come to take your order, food generally takes some time to get to you.  If you need help with you order or have any questions, google it.  Your server will more than likely have an aversion to the dish or be clueless.And while there are exceptions, service is a weak point here.  The food have always been fresh (sashimi and sushi) if somewhat bland (soups and certain rolls).  And the staff has been friendly and apologetic.  But friendly will only get you so far when helpful and timely is an expectation of service and this place is no where near it.Three stars for fresh.  Minus two for inconsistent service."], ["Chris S.", "Stopped in for dinner with a friend and enjoyed a light meal. We ordered two soups to share; Miso and Hot & Sour along with Vegetable Spring Rolls. The sweet and sour sauce that accompanied the spring rolls was on point, but the mustard sauce was unusual. I also ordered a side of vegetable fried rice which was cooked perfectly.There was a fly roaming around the dining area which wasn't exemplary and I also disliked the wide-open floor plan.Wait staff extremely friendly and attentive. All in all a good place."], ["Julie A.", "Our experiences at Miyo's over the years never disappoint. This was our first time here in a while. Apparently they remodeled recently and transformed from a dimly lit darker ambience to now a light fresh and clean design. It pairs perfectly with the consistent quality of beautifully arranged meals. Last night I chose shrimp with a variety of fresh veggies tossed in a brown garlic sauce. Naturally delicious and satisfying with zero guilt. We left feeling full and content. The service is exceptional as the staff is relaxed, friendly and attentive. We appreciate the high standards radiated in everything about this restaurant."], ["Kimberly S.", "Every experience has been consistently better than the last. I have tried a couple of other sushi places around our area and they just don't seem to be as fresh as Miyos."], ["Alyssa M.", "I'm giving miyos a 5 since they always have good food, attentive staff, great service and a good atmosphere. I come here once a month usually and always get orange chicken and some type of sushi.I wish I took pictures but the presentation is always elegant and ingredients are fresh."], ["Miranda G.", "I had the Sushi and Sashimi lunch special. I got so much food for my money! I honestly couldn't even eat all of it. The only downside that I can even think of would be that there was a lot of salmon, and not much other fish on my plate. I would have liked a bit more variety, but what I had was all very good. The waitress was very knowledgeable and was able to answer the questions of everyone in the party. The sushi was also some of the best I have had in the Columbia area. I will definitely come here again!"], ["Brenda C.", "We just moved to Columbia and based on reviews, we decided to try this place. I have never had such horrible food in my life. No taste, cold and our seemingly 12 year old waiter did not seem to be there in body or mind. Kept repeating our order which was about as simple as you could get. My husband paid with a credit card. We did not use that card again for several days and while we were out of town we got notification that his account was hacked right after that transaction at Miyos. Several transactions were made. Of course the account was closed and now we are going through the process of clearing this up. All of the transactions were for things a young person would buy, not us."], ["Kim T.", "I'm torn on how to review this place. The food and the service were fine, a solid 3 star. We ordered a sushi appetizer and two entrees and everything tasted good. The portions were nice, the prices reasonable and every person working there we encountered was friendly. My problem was that it smelled absolutely horrendous in that restaurant. The restaurant is located right next to a cigar bar and I think the smell just permeates through the walls or something. We walked in through the doors and almost turned around to leave because the odor was very reminiscent of a reeking dumpster. I didn't understand where it was coming from but we thought that maybe it was just at the front of the building. We were seated near the back and the smell just got worse. For most of the meal I was trying my hardest not to breathe through my nose and overall it put a severe damper on our meal. To reiterate, the food was at least a 3 star, maybe even 4 but the smell coming from their neighboring building severely put me off. They have a second location that isn't attached to a cigar place that I have yet to try but I'm definitely willing to. So if the smell of tobacco bothers you (not smoke though), maybe you should stick to take out or just go to their other location in Sandhill."], ["Sheryl B.", "The food was very good. Went at the bigenning of the dinner service. So service was kinda slow. I ordered the King Pao chicken and the rice portions could have been better for the amount of chicken I received. I can definitely recommend the mochi (super good)!"], ["Sydney G.", "I'm giving 4 stars for the cucumber mojito, which was delicious. I still finding myself dreaming about it sometimes. The sushi was good. Not great, but good. I got the M Cafe and the Green Dragon, and I'd say the M Cafe was better. The seaweed salad was a little chewier than the norm, but it was still good. Also tried a bite of my friend's szechuan beef and it was pretty delish.But those mojitos though. Those were what's up."], ["Eric C.", "The location is directly beside a cigar shop, the smell of cigars is unbearable. You would think they would drop the price of the food however this is not the case. Very pricey"], ["Alexei M.", "Service was good and the food was also good. Had a few cocktails which were creative. They have a pretty creative drinks list. I had the cucumber mojito and the key lime martini. The girls were not bad to look at either."], ["Kasha C.", "Ordered the maestro beef. And oh my word was it worth it. Not for the faint of garlic hearted. Meat is tender and perfectly flavored. Crispy stir fried garlic green beans and asparagus. My friend got the chicken kabobs with the garlic green beans. Chicken was moist and tasty. And the California roll was a California roll. Service was friendly but a tad bit slow. I would definitely eat here again."], ["Jacquelyn M.", "I came here with a group of lady friends.  We had dinner before heading to the movies.  The menu is large and many options for vegetarians and vegans.  I asked the waiter to make me a sweet potato tempura roll along with a cucumber roll.  I also ordered some Godiva chocolate cake.  The rolls were good but I have had better.  Yet, this does not mean that it was bad.  I just think South Florida does it better.  I am sorry!!  The cake was huge and enough for all of us to share.  I wish that I remembered our waiter's name.  It was a tall skinny (possibly hispanic) guy.  He was hilarious and friendly.  Loved him.  Overall, this was a great experience.  In the area, def check it out!"], ["Jeremy E.", "Good food normally do takeout.  Bar staff is a little slow and really here for the servers not the bar patrons. However, when I sit and eat the server staff is excellent...Sushi is always good and their Chinese menu, while not PF Chang is very good..."], ["Rita M.", "This is one of my favorites, however, I normally get my food for take out."], ["Jaime M.", "Good food. I had the bacon wrapped scallops and they were awesome.  my daughter said she enjoyed her sushi. It's a little pricey but okay for a tray once in a while.  It appeared clean and the waitstaff was friendly."], ["Mel B.", "My family eats here weekly. Great food, good prices and restaurant is clean."], ["Doug S.", "Yelpers steered me right on this one! Stopped in off I-26 for a late Sunday lunch. I'd forgotten the traffic in this area, but anyway... Excellent from start to finish. Service, app, entree, even had Hopsecutioner on special. Just great, highly recommend."], ["Jerry C.", "Great food. It is unlikely you will be disappointed with anything off the menu. For specific recommendations, I can only speak to the sushi as that is what I always order; it is always fresh and they have really great rolls. My only negative is that a meal here can get a bit pricey for a family, but that is to be expected for good food in the Columbia, SC area, I suppose. The service is usually spot on. Overall, a good restaurant."], ["Mia C.", "Have been to Miyos umpteen times- with friends, family and as part of a work event. Love their ambience and the fusion cuisine. I usually used to order the stir fry items and my husband like the sashimi."], ["C H.", "I love the food at Miyos, however, I have been disappointed the last three visits not by the food but the smell that permeates the restaurant from the cigar bar next door. There is nowhere in the restaurant one can sit where this does not affect your meal. I asked the hostess whether other people have complained about it and she said yes, but also that she is used to it."], ["Charles G.", "My wife and I tired of the wait at Panera, and since we both like trying new places and both like Sichuan cuisine (which is what was advertised on the sign we saw) we figured we would try it. The wait time was pretty bad. The hostess disappeared for several minutes while finding a seat for us, and our server was not as attentive as my empty sweet tea glass would have liked, but the food was amazing! While it was not 100% genuine, it's some of the closest I've had in America! The quality of the food brings it from a two it would get for service all the way to a four. Perhaps being there in a more normal dining hour would help with the service, but I'm not sure."], ["Laurie C.", "Best Asian food in Columbia by far. Always fresh ingredients and great service. Maestro's Shrimp is a favorite."], ["Scott H.", "Came here on a recommendation, large portions, attentive waitress, I'm glad I checked it out!"], ["Kam O.", "Food is excellent & the service is superb!!!! Love it!!!"], ["Ashley J.", "Went here on a Saturday afternoon to celebrate my friend's academy graduation. There were four of us. I didn't really appreciate the lack of attention we got from our waiter. It took her a long time to come check on us. Whenever we had questions she seemed to be impatient. For my appetizer I got the pork & veggies spring-rolls. I didn't like them because they were full of oil. I could see the oil through the rolls. There wasn't any meat hardly. When I bit into it, oil just dripped out. For my entree I got the Shanghi. It didn't have any flavor at all. I really didn't like it. Overall I would go back to that place."], ["Lisa P.", "Love this place. Great food and atmosphere!"], ["Cola M.", "Used to be my favorite Chinese eatery but past three years Miyo's has gone up on an already pricey menu and down in quality.Until three years ago I was all to happy to pay twice as much for my entree than I could at other, nearby *nese restaurants because it was just so much better. The ingredients were obviously of a higher quality and the recipes a little different. I frequented Miyos 1-2 times/week for lunch and with family 4-6 times/month for dinner over about an eight year stretch. That changed about three years ago and after the quality of food and service began to fall my visits became infrequent until it was the rare occasion I/we went.This past Friday was our final visit.  Hoping that things had improved since our last visit six-nine months ago, we arrived with high hopes.  They were dashed as my wife's dinner arrived with a complete disregard of her requests for no this-or-that.  After convincing the young lady to have it remade (yes, we had to convince the server to take the dish back) another dish followed about 15 minutes later and was yet again wrong.  By this time I had already determined that my own dish was even worse than its already poor tasting predecessors which couldn't have imagined possible.Now this restaurant cost me three times what many local competitors charge and it offers nothing more for the money. In fact, in terms of volume, it's considerably less.Bottom line - bland food, poor service and high prices put this restaurant in the not-worth-it category."], ["Greg R.", "Miyos is one of my favorite Chinese and Japanese restaurants in Columbia.If you want a huge meal at a buffet, go down the street.  If you want pretty good Chinese, there's a few around.  If you want the best Chinese, made with really fresh ingredients that's always good, then stop at Miyos.The dishes are always good.   The sauces are rich and subtle, and the tempura  is light and delicate. This Miyos had a very modern look inside, and has a GREAT area to sit outside (covered)."], ["M A.", "We stopped in to Miyo's for a late Thursday night dinner. We did not want anything heavy so our order included the apple and shrimp salad, shrimp tempura sushi roll with soy wrap, two chicken kabob salads, water, and a pot of green tea. The hostess wasn't too friendly and not at all inviting. The waiter was awesome. He made sure our water glasses didn't run empty, the pot of tea was fresh and hot (even poured for us), made suggestion on menu after we explained what we wanted, and was very attentive without being a nuisance. The food was great. The salad was fresh with greens, carrots, and tomatoes. The meat was not overcooked and taste great. Per the waiter's suggestion we had the ginger and house dressing and they were great together as he stated. We were even allowed to order the lunch portion. This was my best experience at a Miyo's and I would definitely recommend this location and go back in the future."], ["Lewis G.", "Miyos is as good as it gets in Columbia. Never had a bad meal at any of their locations. Try the dynamite roll and Beijing duck!"], ["Bob D.", "Great place for Japanese and Chinese, and the sushi is great and arrives fast, with a diverse menu and average to good service."], ["Don F.", "We recently paid our second visit to Miyo's and I must say, it has become one of my favorite places to dine.  The appetizer was a beautiful rose made from very rare Tuna.  The Tuna was as tender and sweet as I've ever tasted.  My entree' was their Szechuan Braised Eggplant.  The dish normally includes minced chicken andshrimp, but I opted out on the shrimp.  The dish was a feast for the eyes.  The beautiful purple eggplant pieces were complemented with a generous serving of minced chicken in a rich and amber colored spicy sauce. It was to die for.  We ended the meal with their Godiva Chocolate cake and coffee.  Prices were very reasonable and the service was very friendly and efficient.  No complaints.  Enjoy!"], ["Marilee G.", "I had been told by a couple of people that Miyo's was the best chinese in Columbia. Really? My first trip was pretty nasty and resulted in my not eating but a few bites of my food. I had the coconut green chicken curry. First, I saw no coconut milk at all. Second, no green curry taste either. Third, and worst, the texture of the sauce was gooey, slimy and gloppy. . .like stick to the roof of your mouth feeling. Wow. Truly a terrible tasting meal. On the plus side, my waiter was nice and the ambiance was great. However, if this is the best Columbia has to offer, I have to learn how to cook Chinese at home!"]], "Angel Chinese Restaurant": [["Linda K.", "I remember coming here when I was in high school! The food is still good. I got the general tso as always. The restaurant is still owned by the same owner because I remember seeing the little girl (the daughter I think). I think she's in high school and saw her studying with her friend. I love small businesses like these!"], ["Anthony C.", "Only giving 3 stars because the service was good, but the food was bland and not very good portions, I had the general tsos chicken and pork fried rice and im used to getting so much food the restaurant needs to staple the plate shut.As for the restaurant itself you get a very sad feeling going in like not much business is coming in, from the outside you wouldn't know it's a Chinese food restaurant unless you looked it up first then went."], ["Stefanie S.", "Worst Chinese food ever!  Since when is lo mein served in thick peanut sauce?  And the chicken skewers were thin as paper and tasted like jerky.  I was served to go even though my for year old and i were sitting at a table.   When i asked for plates, i was given eaten on foam plates.  Sick!  Then told,  \"my bad\" by the very rude register girl.  I asked for a refund on my chicken after a few bites and was denied by the chef who argued with me that they were white meat.   Horrible food and worse service!   No wonder it was empty at noon."], ["Richard C.", "So it my first time actually dinning in. Not good start. Had a sweet tea to start and it tasted like sugar substitute was used instead of sugar. Asked for them to switch it out to a Coke.  They went to the counter cracked opened a can of coke and served me that. Ordered some wontons great portion size. The tasted was a little off  to much onion I think. For the entrées we had sweet and sour chicken and Carolina Fried Rice. Both of those were great!  No complaints. I give it four stars just because of the not so good beginning of the dinner but won me over with the Carolina Fired Rice!"], ["Shari T.", "This is the best Chinese food you'll ever get! And oh my goodness! The portions are hugeeeeee :) the staff is super nice and the delivery people deliver pretty far out. The Mongolian beef is my favorite but you can't go wrong with this menu. It seems pricey at first but when you see the portions and quality it all makes sense. Love love love Angel :)"], ["Tamara J.", "The best and most authentic Chinese food that you will get in the states. The food is full of flavor.  No matter what I get it has always been excellent. This is my favorite Chinese restaurant. The staff is also awesome."], ["Meg D.", "They are really nice and the food was very good.. Not more expensive than any other sit down restaurant"], ["Thomas L.", "Very expensive for what you get and the quality is mediocre. I ordered the general tsos chicken extra spicy. It was mild and soggy with a very small bowl of fried rice. I asked for more fried rice and it was 2.45 extra. A single veggie spring roll is 2.95. So for a spring roll, soggy mild general tsos chicken, and an extra spoonful of fried rice I totaled $18.26. I would not recommend."], ["Food Gives Me Joy H.", "Poor quality of food delivered for 2nd time. So disappointed because I really liked them for about a year but clearly it has changed."], ["Cody M.", "The food here is pretty good. I don't have a lot of places to compare it to here in Columbia but it is one of our go to Chinese restaurants when we are feeling lazy. The spinach fried rice is very good if you are looking for a healthy alternative. We usually get the standard fan fare either general tso's or orange chicken and pork fried rice and they are all good."], ["Ron V.", "Excellent food.  Went and tried their special of the day \"Thai Mango Chicken\" and it was absolutely fabulous.  Nice blend of spice along with a great taste and a little sweetness with the mangoes.  Haven\"t had anything this good at a Chinese Restaurant in Columbia yet.  What's even better is that they deliver - but only for orders 20$ or more.  We'll definitely be going back!"], ["Theron T.", "I've been a customer Of Angel Chinese Restaurant since they opened their doors as they are one of three restaurants that deliver in my area. The food is adequate and delivery is not necessarily as stated. But i highly recommend that if you go pay cash. I used my debit card to pay and my number was stolen and ran through twice on three different occasions. The first time it happened they quickly reimbursed me, it was apparent they knew they had a problem. But when it happened twice again they refused to refund and said they had no idea what happen. It is pretty obvious. As the card was run twice on the same day."]], "China King": [["Jim H.", "these guys have a awesome bit of new york style chinese food here. best in the town!"], ["Ariel P.", "I wanted to give 1 star but they returned my money after calling them about my inedible food. I hate giving such harsh ratings, but it's a place for honesty. My hope is for them to check out their ratings/comments on yelp to better their business. It was the worst chinese food I've ever had."], ["Dan G.", "Been eating here for 6+ years.  Always get exactly what we ordered.  Hot food, good quality, and great prices.  We always do pickup, but others complain about greasy food... I find it exactly like any other Chinese food place in town, but much more convenient.  If you are looking for healthy Asian Fusion they have a \"diet\" menu which are unfried items, but otherwise you just need to expect NY Style Chinese food as they advertise."], ["Sateesh N.", "Greasy.. Worse delivery time.. Bland food.. Would never order again.. Cheap though.. Ordered some noodles and egg foo young.. It took them 90 minutes to deliver.."], ["Angel S.", "Ordered for lunch, chicken was mediocre, rice had omelets instead of shredded eggs, and driver had dirty kitchen apron on. Super greasy food and certainly not worth what I paid for it. Ultimately the one word to describe it was lazy. If you can't take 2 seconds to remove an apron, chop eggs you're already stir frying, and care enough for the food you're putting out to be of quality, you probably don't belong in the service industry. This isn't my first time but it seems that no matter what I order, I regret it, so it will definitely be my last."], ["Brian L.", "If you're looking for Chinese takeout in Ballentine/Irmo this is the place to go. We always get the General Tso's or Hunan chicken combo with white rice and an eggroll. The quality of the chicken is good -- I'm picky about that with Chinese food and this place hadn't let me down yet. The eggrolls and rangoon are legit. 4 stars... It's all relative, right? It's a tiny step above the other Chinese takeout in terms of quality. And it's open until 10:30PM! Pro tip: While you're waiting, strike up a convo with the owner's little kid who's always hanging around in the dining area. (Don't worry, he will probably approach you.) This kid is a freaking trip!"], ["Bon C.", "This is a typical strip mall Chinese place. A few tables, but most of their business is take-out. And what a business it is. The food. I had a lunch special Mongolian beef with white rice and hot and sour soup. If the kitchen can make very good hot and sour soup, then the rest of the food is usually great. This once again held true for China King. Excellent soup. The right taste, heat, texture and ingredients. The Mongolian beef was also very good although a little chewy but hey, it usually is. The woman that took my order was very friendly and courteous. This is the best regular Americanized Chinese take-out joint I have found around here."], ["Lisa F.", "This place was nothing to write home about.  I went on Yelp to try to find a good Chinese restaurant as the ones in Lexington are horrid.  I drove all the way across the dam and was deeply disappointed by this place.  The egg drop soup was gel like. Gross.  The fried shrimp tasted dirty and the egg roll looked like it had pink dye in it.  Guess I'll keep looking for a good Chinese restaurant because this place is not it."], ["Julie H.", "This is the local Chinese restaurant that we go to when we want really good take out. We've been ordering from here on an average of once per week for the past year and the food has always been great.The menu is large with the typical offerings and there are more specials posted inside the restaurant. The owners are super friendly and it's always really clean. One of our faves, I definitely recommend them!*****EDITED TO ADD******  The quality of the food has really gone down hill over the past  year. Whatever you do - DO NOT ask for delivery. Last time it took 3 hours. THREE HOURS to get our food. The owner is the delivery person as well as the cook. If they get busy your delivery order takes backseat to every other order. And yes, he did show up in a filthy apron. We don't order from here anymore."]], "Miyo's": [["Eric C.", "We had an excellent lunch. I strongly recommend the   Thai Beef wok. There's definitely a great chef cooking here."], ["Dee A.", "The decor here is beautiful.  Its intimate and you can tell its carefully thought out.  I loved my server and everyone working was super nice.  But I dont know.  I just dont think its that good. This is the third miyos location that I've been to and each time I always think what am I missing?  Am I ordering the wrong stuff?  Ive never found it that fresh or that great.  Ive tried the udon noodle soup and it was pretty much flavorless even though it was full of meat and noodles.  The broth is always my favorite part of any soup and I think really shows how good it is.  This broth tasted like water.  I will say the phat tai isn't to bad.  It was a good portion and had a nice flavor.But for me the kicker are the Vietnamese summer rolls.  These were among some of the worst I've ever had and I'm including the ones we made camping once when we forgot all the ingredients and basically only had the wrapper, some green peppers and lots of love.  These shouldn't even be on their menu.  If my mom was with me (the best Vietnamese cook I know) she would've sent them back.  They were flavorless half wrapped rolls of shredded iceberg lettuce and thinly sliced shrimp with an artsy drizzle of sauce.  They actually made me physically angry to look at them.  I did like the oolong tea though and on the menu it said it was a fat burner so thats always a plus."], ["Violet C.", "Delicious!!! The food is so good.  They are always kindly accommodating. My family has added and removed things from sushi rolls and hot dishes.  You can also get steamed veggies instead of rice- at no additional charge!!  It is such a treat to be able to find great (american version of) Chinese and sushi in one place.  The sushi does not have too much rice and it is PACKED with fish.This is honestly my favorite restaurant in Columbia. Thank you Miyos."], ["Rachel O.", "I have been eating at Miyo's on the regular since college and it's just as delicious as always!I always start with the veggie spring rolls with extra duck sauce and NO mustard.  I don't know why but I despise that mustard.  Anyway... scarf those down while waiting on the main course.  I usually get the sesame chicken or the general tso chicken.  When I do get the GTC the friendly staff are more than happy to accommodate my request for it to be prepared less spicy. Boyfriend always gets the general tso shrimp which I'm not sure is actually on the menu but they make it for him when he asks for it. Sometimes... when they have it... I'll order the coconut cake.  I don't know where they get these cakes, but I would marry the baker.  The coconut cake is fantastic and light. The cream has a wonderful coconut flavor but the actual coconut flakes are on the outside.  I like to pretend that I'm at Harry and Sally's wedding when I eat it. The actual restaurant is well decorated and there's a back room that can hold about 20 (so come on and grab your jukebox money).  One tip - if you go at night then you might get some headlights in your face depending on where you sit.  There are parking spaces right in front of the building so when people pull in they might temporarily blind you so watch out!"], ["Kristine J.", "I will never forget the Cashew Caramel Cheesecake here. It was exceptionally delicious. I came to this restaurant twice and they were both great experience. The staffs were super friendly. I like the atmosphere and the decoration of the restaurant."], ["Crystal C.", "Good food, great service. I would deem it more of a Japanese fusion than pure Japanese but that really did not take away from the quality of the ingredients. It is a bit on the pricey end, especially for dinner. The lunch menu seemed to have some pretty good deals though."], ["WanderLustinDani P.", "The atmosphere was very pleasing, alot of items on menu, presentation of the food was Excellent. Food taste was ok, nothing to make the place stand out. A host of items on the menu, offering something for the whole family. The shop was both clean and tidy, having plenty seating. The hostess/ waitress was attentive at all times. Staff members there greeted us in/ out when we left. The food was more than filling. I will give Miyos a second chance oneday."], ["Jodie J.", "\"Asian Fusion \" is normally not connected with \"Authentic\" but the food here is very close to being authentic. Chinese dishes and sushi are delicious! The desert menu is limited but for that price, the portion is unbelievably huge! And, they taste good. Don't forget to try their REAL tea too!"], ["Joe V.", "We came into town to see our kids for USC parents weekend.Everyone loves Sushi so we stopped at Miyo'sWhat a wonderful experience we had!  The food was great! I had the Sashimi platter which was reasonably priced for the large assortment of fish on the plate.Son had several pieces of Nigiri and a few rolls, he loved them all. Service was prompt, We had a waiter named Mike, who was polite, prompt and provided really excellent service. So we will be back to Miyos every time we visit Columbia.Thanks to Mike and the whole staff for a great time!"], ["Eric B.", "I go here and get their salad and sushi. It's unbelievable if you know what to order. The Godzilla is to die for."], ["Lisa C.", "Very disappointed. Upon entering the staff looked almost disheveled. Waiter couldn't offer any details on Peking duck he had never served. Initial soy and wasabi dishes were metal containers u might serve a melon ball of whipped butter in. Alternative was a glass ramakin that was sufficient. Octopus salad was decent. I don't know how to judge sushi but I had an experience chewing that made me think, not fresh. We usually have an almost orgasmic experience with unagi, but this was a dead lay that left me worrying about STDs."], ["Liz D.", "This is my favorite Miyo's location (I've been to all of them--Harbison is my least fav, for comparison), and we have been going to this place probably 6-7 times a year for more than a decade. The food is tasty, service is generally good, and it's a nice looking place to have a quiet meal.I almost always order sushi when I come, largely because it's a food item I'm too lazy to make at home, but the whole menu is full of gems. They have a really nice variety to suit many tastes, so we often bring groups and guests here. Their fried rice options are my favorite in town, not too greasy and full of meat and veg. For sushi, I almost always get the summer roll, palmetto roll (shh...mayo, honey, and tuna is surprisingly freaking delicious), and the rabuck roll, but there is a pretty wide selection. One of the best deals if you want one of the basic rolls is their sushi lunch special!Drinks are a little high priced and occasionally inconsistent, but usually well-made. My biggest complaint with Miyo's is the boxing of to-go orders. Their go boxes are not sized appropriately for sushi, so when I order sushi to pick up, it's often kind of squished flat and any sauces on top end up just stuck to the box instead of on the food. Some of that is going to be inevitable with any to-go order, but some of it could be easily preventable by using taller containers."], ["Preston L.", "Been to Miyo's three times in my past two trips down to Columbia, South Carolina and I must say, although the sushi is not as good as the sushi in the Northeast, it's the best sushi I have experienced in South Carolina. The fish is fresh most of the time. Not the best grade of fish but not too shabby either. But not only is the sushi good, the rock tempura shrimp is to die for! The lightly tempura fried shrimp glazed over with a spicy mayo sauce passing my lips and stimulating my tastebuds is a feeling I'll never forget. I've had pretty good rock shrimp here in the Northeast but I must say, the best rock tempura shrimp I have had is at this Miyo's. overall, Miyo's is pretty darn good. Not phenomenal, but definitely beyond edible. And just remember,ROCK TEMPURA SHRIMP! I posted a picture of it in the photos. Check it out.P.S.When you're eating the delicious rock shrimp, don't forget to lightly dunk it in your soy sauce for epic flavor enhancement.You're welcome."], ["Peter A.", "Great serving sizes but a little expensive for dinner. Good service and a laid back atmosphere. A good place to bring friends to hang out or a date for good conversation."], ["Morgan A.", "Reagin was an amazing waitress!! She was so attentive and presented great customer service! Our food arrived in appropriate order!! We are super satisfied!!! I'll miss the Miyos in Irmo, SC!!"], ["Carl S.", "Service was solid, and the sushi and appetizers came out fast. Only issue was the price for the just ok food we received. I would give 4 stars if I ate here during a time where they had specials and the prices weren't so steep."], ["Jason R.", "The parking lot always seems full at this location, so it was time to give it a try this last Wednesday night.  They have an extensive menu with a wide variety of stir fry, sushi, and sake.  My mom and I shared some edamame, each had a cup of soup (miso for me, hot and sour for my mom), and went with a couple of stir fry options (shrimp & spinach and a 'build-your-own').  Everything was fresh and tasty and served quickly. Service was great, our server was knowledgeable and very helpful with the menu.  Management was visible as well and stopped by the table unprovoked to check on things, which is always appreciated.  All in all a good experience, worth the stop if you are in Forest Acres.  I will be back soon to try the sushi."], ["Dave M.", "Great Chinese and sushi but a little overpriced."], ["Jonathan Z.", "We have been here 2x in the last week (that in itself should tell you something).  The sushi is very good compared to what I have eaten in Columbia but the Chinese dishes we tried were the standouts.  The braised eggplant with minced shrimp and chicken is to die for.  Though a bit oily, it is just sweet, salty, and spicy enough to keep you digging in long after you're full.  The kung pao chicken is light years ahead of what you get at most places, not overly sauced, and just spicy enough.  A tofu dish and the moo-shu chicken we had were also top notch.  Service was very friendly, they remembered us from the last time we were there, and made us feel at home.  Note, the cooked food on the weekend took almost 45 minutes to get to us.  Our server told us that they have all new chefs, most of them Chinese, who speak very little English.  The language barrier has been difficult for them to overcome.  The other reason for the long wait, and this is a positive, is that all sauces are made to order.  While that translates to delicious food, it can take forever if there is a big party in the house (which there was for us both times).Try the teas to drink.  They are outstanding.  So far, this is place is a can't miss for us."]], "Chinese Cuisine and Thai Food": [["Katherine R.", "This place doesn't look like much from the outside, but the food here is great! Granted I have only tried 2 items, but they were both excellent. I am very particular about my seafood and have found a lot of Asian restaurants use frozen seafood in their dishes, but I had the shrimp curry here and the shrimp tasted like they weren't from the frozen section. The curry was wonderful! Full of flavor and a good sized portion. It had peanuts in it, which I wasn't used to, but it gave some texture to the dish. I also had the Pad Thai. I've been crazing Thai food lately and haven't been able to find anything in Columbia, so I'm really glad I found this place. The Pad Thai, like the curry, was delicious. Again, not used to the style (it came with broccoli and carrots and a fried egg on top) but full of flavor! The woman at the cash register was also very polite and friendly. I will definitely be back for more."], ["Colleen F.", "I just went here last week with a couple of my friends from school for a friend's birthday.  She wanted Pad Thai and Thai tea.  We all loved LOVED our food!!  We were a bit taken back by the location but you know...cheap rent...better food!  The owners are Ethiopian they are the new management BUT the chef is the same...have no fear!  Go give them your business...they are such good people!  We all LOVED our pad thai and we had enough to take home for later! I consider myself a foodie and I will be back.  Hope this helps the decision making!"], ["Patti N.", "What an unexpected treat!! I had an appointment nearby, and decided to take a chance on a new spot. So glad I did!! The owner Sophie was working the counter and shared her story, and the food is DELICIOUS! I stuck with the Pad Thai - straight up tasty! Thai, Chinese cuisine, reasonably priced. And the owner cooks an Ethiopian menu on Sunday's!! Great locally owned gem (owned several months, old reviews aren't Sophie!!), wish her the best of luck!!"], ["Andrea J.", "We are visiting Columbia for the weekend and found this place from other positive reviews. Great Thai food, pretty spicy but delicious! I got the Chicken Drunken Noodles but the Massamuran chicken curry, chicken pad Thai, and chicken basil (which my party shared) were also spicy and good. The owner spent a lot of time talking to us and was very nice. Overall great experience!"], ["Samantha R.", "I wasn't a big fan of this place's take on Chinese food. The rice was good but both their sesame chicken and orange chicken tasted off. The steamed dumplings also left something to be desired. Overall, everything was edible but not really worth the high price. Hopefully their Thai food is better..."], ["Joshua S.", "My go to Thai restaurant in Columbia. Has improved drastically over the past year. Never ate inside, always take out but never disappointed. The Pad Thai is a winner."], ["Amanda P.", "The couple that owns the place is so sweet! We got massaman curry and drunken noodles. Very good!"], ["Katherine S.", "Our favorite Chinese and Thai takeout. Larb chicken, soups and traditional Chinese dishes are perfect comfort foods for nights on!"], ["Scarlett F.", "Weird for dining in.  I wouldn't describe the service as friendly.  When we sat down, the lady brought us one solitary takeout menu to look over.  The food was pretty quick (we were the only people there on a Saturday night) but it came in styrofoam containers.  I had massaman curry with tofu (didn't see tofu on the menu, had to ask).  The curry could have used more potato because it was a tad heavy on the onion. Again, I liked the food but I wouldn't go out of my way to eat here again.  I hate styrofoam takeout containers and I don't understand why they haven't invested in some plates considering they do have so many tables for dining in."], ["Kristin O.", "By far the best Chinese/Thai take-out place in Columbia. I have tried numerous places and have always been disappointed. This restaurant is cheap, fast, and delicious! The food is not usually spicy but they will definitely kick it up a notch when you ask. The Pad Thai, Curry, Drunken Noodles, and egg rolls are all great. I crave this food at least once a week. I highly recommend."], ["Michelle T.", "Drove all the way from Florence for out pad Thai and drunken noodle. Amazing!!! Super fresh and just as good as it always is. Took the kids with us this time and they were in heaven! Fried bananas are awesome!!!!"], ["Kara T.", "Sold to a new owner. Quality/flavor and portion size have gone down. Prices have gone up by at least $3 per dish. No longer a customer"], ["Paul B.", "The Pad Thai noodles are some of the best I've hade in Cola! Just the right amount of fish sauce, sugar, and vinegar! They actually use eggs and fish sauce!!! I hate to order Pad Thai noodles that lack \"main ingredients\" ~  The ambiance of the place is not all that great.. They have cloth tablecloths, and it appears super clean. However, you get the feeling the majority of the patrons are there for takeout. The owners, servers, cooks are very cordial, but not over friendly :) if you're a Pad ThaI fan it is definitely worth a visit!!! PS someone needs to do a Pad Thai competition in cola lol"], ["Preston P.", "Just tried this place out for the first time, and I will definitely be coming again. The spring rolls are great, as are the drunken noodles and massaman curry.  We stopped in and ordered and had our food in less than ten minutes.  Can't wait to try the other options on the menu."], ["Jason B.", "This is a great place. I love the pad Thai and the Curry is really awesome. I have been here plenty of times and will continue to keep going."], ["W T.", "I ordered Pad Thai with chicken, and while the service was relatively fast (I didn't call ahead) there was way too much peanut and it overpowered the dish. I also ordered the highest spice level and was really disappointed - my dish was not spicy at all. In fact, it was really quite sweet. On the upside, the menu is extensive and the food was flavorful, just not the flavors that I wanted. I may try another dish in the future."], ["Jodi S.", "We routed our trip specifically to come to Columbia  and return to this yummy restaurant. Once again the food was made to order, fresh and delicious. I had the pad Thai with chicken and Rick had tom yom ga soup and massiman curry with chicken. We thoroughly enjoyed our meal and will be back next time we are up this way."], ["S C.", "Great Thai food! Humble little takeout restaurant. If you're going out with the guys and looking for inexpensive Chinese/Thai, do it. It will surprise you how good it is especially for the price. Can't be beat. If you're taking your girlfriend or wife on a date, get it to-go. The food will taste just as good if not better than the extremely more expensive Thai rivals. The interior and service is just like every other strip mall Chinese take out. Better yet pick it up yourself and they will never know. Just know what to expect when you go."], ["Bonnie H.", "As others stated, this place is a small hole in the wall BUT the food is so tasty! I got both the drunken noodles chicken and pad thai chicken. The Pad Thai was not the best I have ever had but it is still really good, about an 8/10.  The drunken noodles were the best I have ever had though! The thai ice tea was probably the worst I have had, but still good. I did finish the cup but too sweet for me and I was expecting it to be sweet but not as much as it was.."], ["Matthew R.", "The Pad Thai is not the best that Columbia has to offer but it is good enough to mention, as I ordered it twice this week.  There is never a lunch crowd so ordering is quick and easy."], ["Joseph K.", "This is a standard take-out style Chinese/Thai restaurant. Having said that, I think that it's more freshly prepared than most places I've tried. The fried rice is fluffy and not as greasy as most places. The chicken is freshly battered (or at least tastes like it). It's also nice that they have a wide variety of both Chinese and Thai dishes.  Overall, a very clean, nice place with great tasting food, the prices are low and they're very friendly."], ["Ravi P.", "One of the best thai places in Columbia.Service is slow because of all of the customers and only 1 cook but it's worth the wait.  Pad thai is the dish, I usually get mine extra spicy."], ["Tom S.", "This place has kick ass pad Thai. Also tried the rad na it was pretty good as well. The fried egg rolls were crispy and delicious. The proportions could probably be split into three meals. I wish they had I bigger menu, but what they offer seems to be pretty good. For a hole in the wall Asian cuisine that won't break the bank this is the place to go."], ["Joshua T.", "I ordered on the phone to avoid the wait because the food is decent and affordable. In still here 40 minutes later with no food. Not a good way to stay in business."], ["Jennifer H.", "Had to wait just a bit, but it was well worth it. Came in with a party of 11 and everybody had positive things to say about each meal. Would definitely come back again!"], ["Mark H.", "Much, much better than you'd expect. Non-greasy, made to order. Some of the freshest Pad Thai I ever had. For $10, you get A LOT of food. Looking forward to coming back. Don't let the low-brow ambiance fool you. This food is fantastic."], ["Shawn E.", "Worst Chinese AND Thai food in Columbia but don't worry the service is extra slow. This place is a stone's throw from my house but I've never had a decent or quick meal. Learned my lesson this time though. Never coming back."], ["Mary W.", "Food seemed fresher than most Chinese places particularly with the eggrolls that tasted homemade.  I got sweet and sour chicken and veggie fries rice. The rice was PHENOMENAL! The chicken was pretty typical but also seemed fresher than most places. I didn't like that they didn't have wontons but what they do have they do well."], ["Marko S.", "This is an old location for taste of china.  The new owners serve Thai food also. It is very well prepared. Fried bananas, drunken noodles, lo mein and Thai vegetables all excellent.  We had.a large family there and shared food. Cook willing to make most dishes vegetarian when possible."]], "China One Chinese Restaurant": [["Linda K.", "Really good braised wings! Crispy wings even with the sauce. The food was a bit salty but the braised wings were defiantly delicious. 6.75 +tax for a 7 piece with rice."], ["Denell J.", "Guy Spit in a drink and tried to serve it to me!! Hood spot needs to get shut down!!!!"], ["Pamela C.", "Braised wings & Pork fried rice!!! OMG!!! Best thing smokin....not in the best of neighborhoods but the food is good & it's my teenager's favorite...."]], "King's Chef Chinese Restaurant": [["Linda F.", "Delicious chinese food and you get more than what you paid for. How much better can it get?"], ["Pamela C.", "A \"C\" is on the door.  That should explain it all....as long as there a \"C\" on the door you won't have to worry about me spending any money here.  I don't have time to be getting sick from eating food....."]], "Chen's Chinese Restaurant I At Polo Plaza": [["Enrique C.", "Great taste!  The best from all other chain locations.  I will be back for more orange chicken."], ["Tina J.", "Haven't tasted the food yet, but the service is scandalous.  While we were ordering, the person at the counter answered the phone: seriously in the middle of our order, twice!  He then assured us that our order would be twenty minutes.  After 30 we are checking and it seems like our order hasn't even been started.  We were offered our money back.  No, what we want is service.  Hope the food is worth it!!!"], ["S S.", "Best take out Chinese in Columbia. They are always busy around dinner time, so definitely call in your order."], ["Eli A.", "Every time I come to school this is this best Chinese place to eat at..food is delish...customer service is amazing...prices perfect!!!"], ["DeMorian P.", "Great food food prices. I was looking for a Chinese place on this side of town and I think I found it. The staff is great and there are many choices to choose from."], ["Tessa G.", "I've been coming here for about 15 years and it continues to be some of the best non-fancy Chinese food in columbia. Their fried rice is always tasty. Food is nothing fancy but is always fresh. Same family has been running the restaurant since I've been going there."]]}