{"Crepes & Croissants": [["Prashanth R.", "They have one of the best macaroons I have tasted in Columbia, the only problem is there timings, they close at 3"], ["Zoe L.", "Each dish tastes fresh while the flavor is full. I will be back to devour the entire menu, one croissant at a time. The macaroons are perfect- I only wish they didn't ever being on my plate!"], ["Lisa S.", "I love crepes more than anything but this was a huge disappointment. The service was so slow and then they got our order wrong. After that, they argued with us about our order!! So rude! When they finally realized they were wrong, they cooked us one more crepe. Worst crepe I've ever had - and I've had A LOT."], ["Brandy B.", "Loved it!Came at 9:15 - we had the whole place to ourselves.Ordered the Strawberry N, Brie Croissant, & Quiche Lorraine.The owner was our order taker, chef, and server.I read previous reviews commenting on the music, and decor - I thought it was all great!(Not sure if someone informed the owner of the yelp comments but it appears he's made changes - menu at entrance and seating/open area off to the side)There were cute clean tables and chairs and ENIGMA playing over the speakers!I will def be back and hope to update my review to 5 stars!"], ["Mia G.", "I really enjoyed my \"Paris\", unfortunately my boyfriend's Croquet Monsieur was a really sad excuse for a Croquet. C'mon, guys, I KNOW you can do better than that. It's more than just a ham sandwich. I'll come back though... and eat all the crepes. Sweet girl at checkout too- that is always appreciated."], ["Maria S.", "Had a good brunch here.  The only reason I gave it only 4 stars was the 'greeting' when we arrived at the counter to order was surely 'less than' welcoming.  They sort of ignored us standing there for the longest time and spoke to someone standing behind us as if we were not standing there ready to order.  BUT, that being said, we had the following crepes between us all:  Paris, Italy, Turkey, Nutella/Banana, Classic.  The food was very filling on the savory crepes and the only one we wish maybe we had done different was the Classic because it was a little dry.  Just wish it had had more of a brown sugar taste.  But the PB Banana that our girls got was really good and we only wished we had done one with some strawberries or other fruit.Felt almost authentic when compared to similar places in Paris.  But, hey, it's Columbia, SC, so you can't be too critical of that.  They did do a good job of decor & ambiance at least enough to satisfy me."], ["Jay B.", "Great deal and food. About $11 for the CC1 combo, add $0.50 for a fountain drink. You get two crêpes (one meal and one desert) which are more than enough. Macaroons are kind of expensive for their size and taste."], ["Linda K.", "I have waited to give this place a review for the longest. I tried the place 4 times. I usually get the strawberry N (strawberry Nutella. Every time I have ordered the crepes were so SOGGY. Towards finishing the dessert the crepe has a consistency of a fettuccine noodle. The crepes are also stuffed really thin and are not filling even for a dessert. All of the crepe places in Paris, Japan, LA, Charelston, that I have had crepes in were given to me in a cone shaped paper and they never got soggy even with whipped cream put into them. Also there are hardly any varieties. They all are a combo of Nutella, a chocolate sauce, and fruit. All of the places I have been to have freshly whipped cream topping. Maybe if u have never been to a crepe place or a Good creperie then this place may be for you."], ["Amanda D.", "Delicious!  My husband got the Paris Crepe and u got the  Croque-monsieur.  His crepe was phenomenal, we would definitely get it again. The Croque-Monsieur was good too, but I think I prefer the crepes!  I originally thought it was a sit down type cafe, but it's an order as you come in and have a seat, which is totally fine.  The only thing is be prepared to wait they only have a couple of crepe irons so it does take time. We did get a crepe for dessert as well it was the Honey Moon!  Really good!  It had bananas and honey, yum!"], ["eee b.", "I love this place! I make it a point to stop in every time I'm in town and am never disappointed. The meringues and croissants are also quite delicious, and the people working there are always so very nice."], ["Grace M.", "I don't know why people are complaining. I got my order DELIVERED and it was so good I could not eat my meal fast enough. I got a salmon croissant and ordered the strawberry, banana, and Nutella crepe to share and it is amazing. It reminds me of my trip to Paris. Absolutely love. I can't wait to order again!! (Which is going to be very soon) I am assuming that the owner delivered because he was a nice French man."], ["William H.", "Food awesome but service questionable as it was not quite closing time and one of two tables left and they were out of coffee. When I  inquired was told by assumed owner we're out of coffee. Did not offer to make a pot but was out. No apology or anything.  Great food with poor service means will not be back when in town."], ["Karen S.", "I was not too sure what to expect at Crepes & Croissants (hence my 3 star rating).  I had seen pictures of what I thought were crepes before coming here and had planned on ordering several crepes for my lunchtime meal.  Looking at the menu, I figured it was the norm to order more than one crepe if you were planning making this your lunch.  So to my surprise, I was not expecting two separate plates to come out when my crepes was finally brought out to me.  I just thought two of us in our party had ordered the same crepe.  I also did not find the crepes that filling if you were making this your meal (unless some are more filling than others). You do have the option of ordering sandwiches on crossiants, but the short glance I looked at the menu, I did not see any crossaint sandwiches I would have cared for.  Another person in our party did order a sandwhich and again, did not look like you were given a big sandwich for a meal (even though chips were also served).The crepes are a good dessert option, but they are only open during lunch hours.  When I think dessert, I think evening hours after dinner."], ["Daniel G.", "Great atmosphere great food and great service what more can you ask for. Oh yea the kids love it too they where so excited to come and the staff even remembered what they order. I read one or two reviews about poor counter service and I have not experienced that yet."], ["William K.", "This was the worst breakfast experience I have had the displeasure of suffering through in Columbia. The fellow who took my order and prepared my Paris crepe seemed only interested in leaving work. He let my crepe sit for 6 minutes before bringing it to my table while he made my husband's crepe. Why he didn't use two crepe makers instead of letting my crepe get cold, I can only imagine was so he wouldn't have to clean two separate griddles.The lattes we ordered weren't prepared until after we had our breakfast, about 30 minutes after we ordered them. It wasn't overly busy either. Three tables, including ours, seemed to be too great a number for the 3 employees that were working behind the counter. Two of them though never so much as lifted a finger to help cook or prepare our lattes on time.I had ordered two sweet crepes as a treat for after breakfast but, unsurprisingly, they hadn't even started making them until we had already been there 45 minutes. Yes, it took them 45 minutes to even start thinking about making the second half of our order. Once the lattes and savory crepes had been made, I almost wish they hadn't. The latte tasted as if it was made with espresso dredged in burnt coffee grounds. It was so acrid we left the store with them and poured them out in the nearest trash can. My crepe was lukewarm at best after having spent 6 minutes chilling. My husband was severely disappointed in the luncheon meat they called ham and I have to agree.I hope Laurent turns his business around because I love crepes, but until he reviews his staffing, ingredients and training I will not return. I will actively recommend to my friends that they stay away until such a date."], ["Whitney S.", "This place is fabulous! We travel to eat...especially for different breakfast food! We were thrilled to discover one our top breakfast places was right here in town! I always get the triple treat and the iced vanilla coffee. My boyfriend always tries something different. Weve never had a bad meal. The fruit is always fresh. The staff is always so friendly. We go so often theyre like friends to us now. Cant go wrong!"], ["San H.", "This is my second time here. I've ordered to go both times. Both times my order was up speedily and delicious. Both times I ordered savory crepes."], ["Alejandro L.", "Interesting flavor combinations, decent decoration and thoughtful owner-cook-waiter. But they warmed up my creppe in the microwave. I hate microwaves. You don't do that if you want 5 stars, or more customers."], ["Ryan A.", "This is our favorite stop in Columbia. Every visit we order two sweet crepes and we split a veggie croissant. The croissants are made in-house and always perfectly flakey. The coffee is gourmet. The owner, Laurent is always a friendly host/proprietor.  We go so often they know our orders and it seems to get better every time."], ["Gram B.", "Amazing! Stumbled on this place when visiting the art museum. Delicious savory crepes and divine macaroons."], ["Katharine K.", "Good lunch place with a convenient location. It's obviously not the most authentic French cuisine in the world, but it is good for what it is. The Marne crepe is quite good, and I'm excited to try some of the sweeter crepes. The side salad that comes with the crepes has a good dressing, but all it has is lettuce, so it could use a bit more (cranberries, pecans, goat cheese?)."], ["Susan E.", "I ordered the Greenland without the olives and it was delicious!  I also shared a Nutella crepe with my friend; again - yum.  We both enjoyed the atmosphere and the food.  There are so many choices among the sweet and savory.  I can't wait to return. Love seeing new choices downtown."], ["Dee A.", "Walked in, ordered and sat down.  Ahhh, I was immediately transported back to youthful days of long ago.  Not because I grew up in France, but because of the alt-90's music playing over the speakers.  Once Sublime's April 26th 1992 came on I knew homey wasn't the vibe they were really going for here.  Although since the song mentions Cleveland I was transported briefly back to my hometown and that made me happy. I agree with other reviewers if you have a set up where you need to order at the register there needs to be a large display of the menu visible so people know what to order.  I got a sweet crepe with nutella, bananas, strawberries and whipped creme to eat in the restaurant and a chocolate croissant to go.The crepe wasn't that bad at all.  It had crisp edges and lots of nutella in it.  I could tell the strawberries weren't from a can and were mixed with sugar.  They were about one day past usage though and were starting to oxidize a lil bit.  I didn't care and still ate them because I have an iron stomach.  The whipped cream had that special swirl you can only get from a can.The decor didn't really make sense.  A good portion of the usable space was set up as a lounge.  Maybe they also want it to be a coffee shop?  It really wasn't that inviting though with an odd mix of high top tables and low ones scattered around.  It reminded me of a deli more than anything.  The chocolate croissant was pretty darn good though.  I microwaved it and it tasted fresh again.  I'm not sure if they bake them in-house but if it tastes good I don't really care.  Also, for the lady saying the sign might be racist.  There's a French flag on the door.  Underneath the flag it says \"We speak English.\"  I'm pretty sure they're just saying we may be a French place but don't worry we speak English.  Most of my family barely speaks English and I didn't really get offended at all."], ["Tara G.", "I had been wanting to try this place for some time and noticed that it had garnished quite a few favorable reviews .....unfortunately, this is not going to be one of them.  My coworker and I  stopped in this afternoon to try it out. We were the only people in there when we arrived. We both had a quiche Lorraine and a banana and Nutella crepes.....this took 45 minutes!  We both found the person behind the counter very unfriendly. ..bordering on rude. The food was marginal at best.We were very disappointed in our experience.I was really wanting to enjoy this place...the concept is unique. ..but, I doubt very much I will go back."], ["Christy L.", ".now i know what a crossant should really taste like!!! the owner makes all the food himself. today(wednesday) he was there by himself, so he did have to juggle register and food prep himself....but he seems to have a good rythm going. the prices are good. we ordered 2crepes w nutella. they were very large and he was very liberal w nutella. and then the 2 bacon, egg and cheese crossants......bacon well cooked! the pastry itself was sooo yummy!!!"], ["Rick T.", "Smoked Salmon Crepes tasted great ! The owner was really cool he talked about doing take out this year to local businesses, me and sister said it would be a great idea."], ["Rebecca A.", "Came with my mother and father when they came to visit me. We ordered two savory crepes and one sweet one. I believe we ordered a Norway, an Italy and a Sweet Lemon. My mom got the sweet lemon about 15 minutes after my dad and I ate our respective crepes. I have no idea what took so long. They were only using one crepe cooktop when they have at least two. My Italy was very bland, to say the least. I think they should use pesto instead of the measly \"basil marinade\" on the chicken which you can hardly taste at all. My dad thought his Norway was just alright as well. Not special at all. My parents were disappointed. The decor inside is totally lacking, this place looks bizarre like it was supposed to be a waiting lobby but then they decided to make a kitchen on one end. The table we ate at appeared to be a conference table. Weird. Also, the owner is supposedly French. I find this fact to be suspicious given that they advertise their desserts as \"Macaroons\" and not \"Macarons.\" A macaroon is a chewy dense coconut dessert. A macaron is a meringue cookie sandwich. A Frenchman would know this simple fact."], ["Timothy D.", "Delicious and unique."], ["Nicole T.", "I have been there twice this week.  Egg and cheese croissant both times.  First day it was 2 eggs, second visit was 1 egg - not sure which is correct serving?  Both times the croissant and cheese was way over toasted in a toaster oven while egg(s) cooked.  To the point that the croissant was burnt and the cheese was rock hard.  I watched them cook various orders during both visits and all ingredients are fresh!  I am not a crepe person, but they look delish!"], ["Natalie K.", "My Husband and I went here for lunch and did not leave happy (sadly) :( the owner was out of town and my crepes came to me uncooked (2 crepes). My savory crepe (Italy) had very dry chicken. It was not put well together. I got the honeymoon for the sweet crepe which was also uncooked and tasted terrible. I didn't finish either crepes. My Husband had a ham croissant and was unhappy with it as well. I don't like writing bad reviews but this did it for us :/"], ["Deanna A.", "If a true Frenchman dared to venture into this so called Creperie, they would be quick to leave the building swearing in a foreign language. Three microwaves, a toaster oven, and crepes with dehydrated herbs, canned beans, lunch meat for ham, and microwaved meat.  I got the Italy, with sliced mozzarella, mealy tomatoes, and what looks to be dehydrated basil.  My husband got the Texan, which one he burped, he said tasted like Texas Pete. Both of us were highly disappointed. My sons cheddy crepe had lunch meat ham in it. I would not go back to this place if it was the last restaurant in Columbia."], ["Swetha G.", "I am soo sad to be writing a mostly negative review on Crepes & Croissants!  I had bookmarked this place a few months ago and was looking forward to finally checking it out and getting a chance to sink my teeth into what I has hoping would be, an amazing crepe.  Instead my experience was just not up to par.  But before I get to the food I want to describe a few other things that did not improve the rating.As soon as you walk to the door, there is a sign on the door that says \"We speak English.\"  I'm not sure why the business felt the need to advertise that they speak English, but could only take that as a jab to maybe other area eateries where English is a second language and communication is not as smooth.  It just seemed unnecessary and slightly crass.Then there's the layout.  They have this sitting area in the middle of the restaurant that looks like a spa waiting area.  It's pretty but looks totally odd to place right in the middle of a small cafe.  It just does not blend well with the rest of the space.The ordering at the register and getting your food at your table is good in theory but not practical in reality.  They don't have a large sign of the menu on the wall so you have to get a menu at the register and order.  But if you don't know what you're getting and are deciding, then you basically have to rush to make a decision or else you'll hold up the line.  Only other option is to get a menu as soon as you get in line, but if you've never been to the place before you will not know that they have menus on the counter to look at, so you just stay in line and figure this out when you're at the register.  It would make more sense if they had a large mounted menu on the wall so as you walked in you could figure out what to get, then when you walked up to the register you could quickly order, and speed up the process.  A minor detail but one that could easily make the whole experience go a lot smoother.Now for the food, this was the biggest disappointment.  I have been to France and lived in San Francisco for several years (where there have been a ton of amazing crepe places) and  I have never had a savory crepe that was as bad as the one I had at Crepes & Croissants.  I would have sent it back, but by the time I got my food, there was a lengthy line at the register and not wanting to deal with a long wait, I just sucked it up, and ate what I could.  My friends and I had also been on a 5+ mile walk, so I was really hungry.  Anyways, to get to the point, I ordered a \"Greece\" crepe, and subbed the honey with caramelized onions and tomatoes.  What I got was a salad in a crepe pocket.  A bunch of caramelized onions were dumped in one corner and then there were blobs of goat cheese in various sections and then baby spinach leaves and a few slices of tomatoes were just thrown on, this was not a warm melted crepe with the flavors married, instead it was a salad (or some sad version of a salad) squished into a folded crepe!  It did not taste good at all but again, I was starving from our walk and not wanting to deal with the line and hassle of waiting, I just ate what I could.  While I was complaining about my food to my friends, one of my friends noticed a guy send back his entree because his egg was raw.  I'm not giving this place a one star review because my friends did not hate their food, they both ordered different croissant sandwiches, and one also got a peanut butter and banana crepe.  They seemed satisfied with their food and did not have a negative experience.  Also the service was good, not great, but it was good.  If I go back to this place I would try a croissant dish and see if it's a better experience, but as for my savory crepe, unfortunately it was a major letdown.Bummer because I really wanted to like this place!"], ["Emily E.", "Nice to have something different downtown.  I tried the Paris crepe and enjoyed it.  Slightly dry, but overall a good flavor.  Decent prices.  I'll probably go back."], ["B H.", "went there for breakfast on a Saturday morning with a friend. whenever I go to a new place I always ask the employees what they recommend. They are legit french people and were very helpful and friendly. we ordered savory crepes, they were large and delicious. Cool atmosphere, this is random-the sinks in the restrooms are pretty cool/modern."], ["Jane D.", "Love the croissants!  I go to yoga across the street & then grab breakfast here.  I can't wait to try the wide variety of crepes."], ["Packet R.", "Homemade Crepes.. What is there not to love about that.. Yummy!!!"], ["Amanda S.", "This place was awesome.  I was in town visiting friends, and one person in our crowd really wanted some crepes.  Luckily, this place fit the bill.  I was skeptical when we walked in, but the man who took our order at the register was actually French (hence the \"we speak English\" sign someone else mentioned), and the food was delicious.  I was the only person in our party who didn't order both a sweet and a savory crepe, and I wish I had!  They were all good.  Now I'm left wondering how I can swing another visit to Columbia soon."], ["Aaron Z.", "It is really the only pace to get crepes besides Pancake House.  The ambiance is rough...they are coming along but still missing something.  The crepes are pretty good and they have a large selection."], ["David W.", "Slow service. Dry meat. Bad crepes. Was very excited to try the place but am very let down after eating there."], ["Tom J.", "Amazing, savory and sweet crepes.  A casual place with four star food."], ["Morgan C.", "Pretty tasty. The savory crepes can be a bit dry, but any of the sweet crepes are delicious! Plus the croissants are amazing!!I think they're still working on the atmosphere, but its french and cute and quiet."], ["Robert B.", "I've eaten here twice and have enjoyed both meals. The service is quick and polite, perfect for lunch. I had the tomato tart, made with pastry dough, olive oil and herbs de Provence. Nice and flaky. The second lunch was the Paris crepe with white cheese, ham and an egg sunny side up. Very tasty! Both items came with a small mixed green salad. Having just returned from a vacation in France, the food seems authentic, based on my limited experience."]], "Buffalo Wild Wings": [["Trey N.", "The food and service (forgot the ladies name) was very good! We arrived early to catch a UFC fight and was able to get a outside seating right then, noted this is November but they had heaters outside. The waitress was very down to earth, social and professional. Never had to go hunting for her. The food was served very quickly and tasted very well. Price was too bad."], ["Jim W.", "Horrendous service.  We walked in and were promptly seated in the bar area, then were promptly ignored.   Though multiple servers walked by our table, none acknowledged us.   After waiting ten minutes with still no service, a man and his daughter walked in and were immediately approached for drinks.  We got up to leave & complained to the hosts about not getting a server, and they only acknowledged us with an \"I'm sorry\" and little more. This isn't the first time we've experienced this poor level of service at this location, which is a shame, as I do like their wings."], ["Ashley S.", "Happy hour from 4-8 Monday thru Friday??!! Sign. Me. Up. $3 captain and absolute drinks and tall boys, draft of course. Staff is friendly - most of the time. Good came out in a reasonable time. Food was good."], ["Celeste P.", "The wings weren't as good as the wings I had in Payson at Native Wings. Native wings is the best place for wings ever. Enjoy Payson!"], ["Paul S.", "I went to bdubs in M.O. all the time and coming to this one is bad. The customer service was good but the food is terrible. I ordered the traditional and boneless combo; I told the waitress no coleslaw and got it anyway. Then the wings were salt and vinegar and paremesan and garlic. The salt and vinegar had little to no salt and vinegar and the others were almost dry."], ["Patricia H.", "Bad bad bad customer service. Food came out fast but we went and refilled our own cups we also had to use 3 catsup bottles and not near enough. To bad they can't get it together also we never saw our waitress once she took our order. What in the world are they thinking. I can hear the staff in kitchen over the blaring music."], ["Scott S.", "Disgusting experience.  Sat at the bar.  Bartender took my order while simultaneously vigorously picking at her cuticles.  No eye contact or salesmanship.  Then watched her repeatedly biting at her fingernails between putting clean glasses away and serving drinks.  She bussed dirty dishes and then handed me my drink while holding it at the top of the glass where my mouth would touch.  Never saw her wash her hands between any of this.  Was also repeatedly using the touch screen ordering computer to enter food orders, so all the other bartenders touching the screen had her saliva all over their hands as well.  Asked for lemons for my tea.  She dug her bare hand into the lemons and plopped them onto a napkin and set the napkin in front of me.  I called over a manager, reported this unprofessional and disgusting behavior, and left without touching my food.  Maybe since it was at the bar she's used to dealing with drunk people who don't notice these things."], ["Christopher Ian M.", "We go here all the time.  At the very least once a week for the past year. The staff is always amazing and food is always on point."], ["Andrea R.", "I used to frequent the B dubs in my college town but hadn't been to one in years. We went here on a Saturday night. It was pretty crowded we were told it would be a 15 minute wait for two, however we snatched a high top in the bar section and didn't have to wait. Our server was great, she was fast and kept our water and beers full. My husband and I both ordered wings. I ordered hot and boy were they hot! Delicious, but hot! I think I was feeling a little overly ambitious but if you like hot and tasty then I would suggest going here. We also ordered french fries which I loved! They were crunchy on the outside, soft on the inside and hot!Only pit was the salads we got to start. My caesar salad was awful. I had some really old lettuce pieces and the dressing was overly sweet and not good. But, lesson learned...don't order a salad at a wing place!!We will definitely be returning!"], ["WanderLustinDani P.", "Buffalo Wild's food, sports bar atmosphere in Lexington. The flavors were exceptional. Presentation of the food was great. A host of items on the menu, offering something for the whole family. The shop is both clean and tidy, having plenty seating space and a nice bar. The hostess/ waitress was attentive at all times. Staff members there greeted us in/ out when we left. The food was more than filling, loved all the dishes thus far. I'll certainly be returning soon and would recommend this facility."], ["Steve S.", "Been here 3 times. This place has intolerable service. Constantly out of items, the wait staff is unprofessional,  inconsiderate,  beyond slow and constantly confused. We've been here 3 times during non-peak and the service each time has been an insult to this great franchise. The manager should be fired."], ["Monica G.", "It's a sports bar! I think people are expecting too much from this place. You're not going to get a dining experience like Olive Garden, you're going to get a crowded, loud atmosphere surrounded by TONS of huge TVs. I adore this place; I've had to flag down a waitress once or twice to get another beer or something, but nothing that would ever make me not want to come back. This place is perfect for watching football games, baseball games, and in tonight's case- the NFL Draft! The draft beers are always cold, the food (okay I've only gotten wings, fried pickles, and beer here...) is always exactly what I'm excepting. Always fresh, hot, and delicious. Their prices--compared to their competition like Wild Wings, Hooters, Twin Peaks, Carolina Ale House etc--are normal. $3.00 for a large Mich. Ultra draft? Yes, please. I can go to BDubs and have 12 wings, 2-3 beers, and fried pickles for $25. With all there incredible hi-def TVs, great bar food, great drink prices, and awesome sports crowd, this is my go-to for any sporting event I'm not attending. Take this place for what it is!"], ["Karen S.", "I am glad I finally was able to eat here, after the place being open for several years now.  I always went to Buffalo Wild Wings when I still lived in Ohio and was disappointed when there was none around when I first moved to Columbia.This is probably your typical place for wings and also is a sports bar as well.  Me and a Friend went here for lunch today and was not crowded, but not sure how crowded the place would be when a sporting event is happening.  Satisfied with the service I got ....."], ["Colleen R.", "It's a fun place to go, but the food is not very good.I order the spinach & artichoke flatbread and every time I get it, it is not done. It's always a sloppy, nasty mess in the center, and the flatbread is not even brown on the bottom.I was told by a manager it's because it's lunch, and they just opened, so the oven isn't hot enough yet. Why offer them at lunch then?Because that's not true. We went for dinner the other night and it was the same wy. I have never had a fresh meal there, because my dish always gets sent back two or three times, so by that time the chicken on top is dried out and nasty.Not worth the $ or the parking issues at this location."], ["Tom H.", "I ate here on business and just wanted to have some wings and beers.  This is not fine dining here. It met my expectations as I sampled three different flavors of wings and washed it down with an ice cold beer. The staff greeted me with a smile and hello when I walked in. The wait staff was great, alerting me to the happy hour specials and wing specials.  It was rocking as the games came on. Good and loud like a sports bar should be."], ["Mrs. C.", "I gotta agree with everyone regarding the food. It's mediocre at best and too pricey for the amount and quality. The service is typical....young, semi attractive girls with a few young bros, not exactly a place you want to go if you actually want to eat or drink."], ["Ed P.", "Whew...busy night here at Buffalos...we had two other groups cut in front of us- have waited for over an hour- usually our favorite place.  Feeling very upset..."], ["Matt S.", "This is one of the better sports bars in the Lexington area. The atmosphere is generally loud and fun, just the way a sports bar should be. The service is generally pretty good, although I seem to have found the one stoner in the bar for my waiter. Him aside, the service is spot-on. The beer choices are about what you'd expect from a chain sports bar, but they're served promptly. The best-kept secret in Lexington, though, is the sweet tea here. Being a Southern boy, I love my sweet tea, and this was a pleasant surprise.The food is pretty damn good, too. I tried the teriyaki boneless chicken wings, and the regular teriyaki wings. I have to say that, while I liked the boneless wings, the regular ones really were well-done. Their fries are great, especially with the salt-and-pepper seasoning they cook them with. They do a pretty good burger, too."], ["Charles K.", "Buffalo Wild Wings have great commercials, unfortunately the food, especially the wings do not live up to the hype,"], ["Chris H.", "Great Food"], ["Kel B.", "This place is overrated.  It's always loud and the service is terrible.  The chicken wings are tiny, and none of the meals are filling.  I don't think there has been one time that I actually ended up with what I ordered when I came here.  Not a great place to eat in my opinion, and I don't see the appeal."]], "Hunter-Gatherer Brewery & Ale House": [["Chris S.", "We went for a friend's going away party this evening and I was pleasantly surprised. Doesn't look like much on the outside, but it's full of character on the inside. An older building re-purposed!I had the macaroni and cheese with -- wait for it -- Goldfish crust! What?! Just divine. If you love a little crunch to your macaroni and cheese, this dish is definitely for you.There's even a cool-looking upstairs which we didn't use, but it would seem to have a unique view.Parking is available in the back and the whole place has a \"public house\" atmosphere which is just great for large groups like ours. I'll be back for sure!"], ["Lotus F.", "Used to love this place, but this last time literally left a bad taste in my mouth. Ate here a few times in the past and decided to try again since we were in town. 1. Beware, you may not get a parking spot. Depending on the time of day (classes and events) they have no spots available. There's a huge lot right by them, but that's not theirs. It's really not much worth the hassle. Got the call pot roast (good, but not fantastic) and the lamb stew. The stew was SWIMMING in oil, I mean I spooned out a few spoons of oil and I didn't even make dent. The waitress did ask if I wanted to change it, so I got the mac and cheese, which was my second option anyways. I've had this before and it was good, but it didn't taste tight. The noodles were chewy and there was ALOT of oil. I ate it because it was edible, though I had to drain it of oil (yikes a million calories!!!). Not to mention the prices kinda suck all around. The ESB was OK, but the carbonation was very lacking I won't be back!! I used to eat out all of the time, but many of these places are just so mediocre that I'd rather cook at home!"], ["Joshua J.", "Stopped in to check out the local brew and had a Trans-Am Ale; one of my buddies had an ESB. The beer was solid for Southern Craft Beer. A Manhattan and an Old Fashion were ordered by my party and they were also well made. As for food, we had the bean dip with chips and a pizza (feta, tomatoes, spinach, chicken). Both food items had great taste and came quickly. Fresh ingredients and careful craftsmanship were evident in the food.The ambiance was rustic but friendly. The service was outstanding; our waitress deserved more than we could tip. The quality of food and beverage in relation to the price was fair. The pizza is more of an appetizer for one person than a meal, but its freshness and taste is worth noting again. Overall, Hunter-Gatherer is worth stopping by for a drink or two and a small bite."], ["William B.", "A little too trendy and hipsterish for my taste, but I've had some good evenings at this place.  They brew their own beer, and that's pretty cool.  The food seems to be alright too, I haven't tried a lot of the food, but I definitely recommend for a beer.  This place has been here for years, so they must be doing something right."], ["Gwyneth J.", "Casual Hipster Brew Pub Had dinner here with some friends after the second day of the SCASL* conference and was pleasantly surprised. Sadly, no Amber Ale was available but I was given a taste of a replacement suggestion (can't remember it now - I swear I only had a pint!) but it was a bit hoppy and strong. Food...Pimento Cheese App. YUM! Can I ship a pound back to Maryland, please? From their online menu:  ESB Pimento Cheese Spread - smoked gouda, cheddar & Peppadews** blended with ESB Ale served with grilled ciabatta $7.95My Southern friends assured me that Pimento cheese is NO JOKE! That every cook has their own recipe and it varies. Mmmm love! In my quest to be almost NOT a Yankee, I must explore this phenom! For my meal I chose a Lamb Gyro (Avail also w/ chicken or portobello) with lettuce, onion, tomato, feta & tzatziki sauce & served with a small Greek  $8.95 - Very good!The waitress was lovely, and hardly rolled her eyes when we all asked for separate check. Loud restaurant, I know I'm getting old - but dag, it was hard to hear the conversation on the catwalk second floor dining area. Go here for reasonable prices, good food, casual atmosphere and a hipster brew pub atmosphere. -------------Ephemera: *SCASL South Carolina Association of School Librarians**What the heck is a Peppadew? Google told me that it's the trademarked brand name of sweet piquanté peppers grown in the Limpopo province of South Africa."], ["Elizabeth R.", "Beer is halfway decent, nothing special. The big disappointment and the reason for my 1 star rating is that the bartender was really rude and anti-social. The restaurant was busy but the bar was practically empty and I had to flag him down to get any service.  I love going to new breweries and I want to experience the beer but it's hard to appreciate the beer when you feel like you are being intentionally avoided and ignored.  Left with a bitter taste in my mouth, and not from the beer."], ["Jai R.", "The  foodand ambiance was excellent. The  ESB was one of the best beers I've tasted. The service was excellent also. Will definitely be back next time I'm in Columbia."], ["Will C.", "In house beer is excellent and matched by the exquisite meals. The atmosphere is very rustic and intriguing and the waitstaff has always been friendly. My only complaint is that I wish they had more outdoor seating - I'm always worried I'm going to get pulled over for casing the place as I drive by every so often to see how busy it is.The ESB is my favorite of their brews and I very highly recommend it. Also, I've always ordered the special here and it's always been just that - a special meal!"], ["Sherry C.", "This was the first time I have been here. I cane here because of all the great reviews I've read on yelp. It was a pretty cool place. The menu looked good and the prices aren't bad. My husband got the blackened shrimp Poboy and hash brown potatoes. I tried his hash brown potatoes and they were good. Better than Waffle House!  Lol. My husband said the shrimp Poboy was good but he wished it had a few more shrimp on it. He said he would have been willing to pay a few extra dollars for it. He also got a brewed Amber Ale beer which was good. I just had my usual rum and coke. I also had the Greek salad which was also good and fresh.  I expected more college students since its so close to campus but was pleased there were more people my age there. I'll definitely come back here. We got good service and were in and out quickly which was good since we had other places we needed to stop by."], ["Katy L.", "Awesome beer, pricey-but-worth-it food, chill atmosphere. It can be hard to get seats because it's a small place where you seat yourself, but you can crowd around the bar and poach tables/seats when they become available. I'm a grad student at USC and my classmates and I have walked over after classes for a beer and some relaxation. Great place that i'd definitely recommend."], ["Maria P.", "Food was very average.  Plates were less then generous.  Service was pleasant but very slow."], ["David P.", "With only 4 beers on tap and all brewed in the building, I was not very impressed.  Three out of four beers tasted identical and very little carbonation to boot.  I did not eat here so I can not speak of the food but the beers were meh."], ["Lisa S.", "Great unique feel! Their Mac n cheese with goldfish crumbs on top is to die for! Sitting at the bar is a blast as well if you enjoy trying their local beers."], ["Mike T.", "Well what can I say this place is just awesome!!! Beer selection is great food is even better. We had the pork chops and brisket and they succulent and tasty."], ["Mike U.", "I walked into Hunter-Gatherer Brewery on a workday after 5ish.  It was nice to see that there are people hanging out right after work and the restaurant and bar area seating was occupied.  Cool place, very eclectic...offers food and several of their house brews...along with wine and spirits.Too bad I wasn't really impressed.  I finally found a seat at the bar for my lonesome self.  Best place in the house when you're alone. Right?It took several passes of a couple of bartenders before they realize I was there and finally inquired what I'd like to have.  Wasn't really greeted, nor welcomed.  Somewhat killed my vibe of being there.  Since I was already seated and really wanted to see what their brews are about, I decided to have a sampler.  Let me tell you...Not impressed at all by their beers.  Wasn't something that I'd order a pint of and enjoy it.  It was merely tasteless and when inquiring about the different types of brews available, there was no attentiveness nor patience to provide some feedback.Was hungry, but was turned off by the poor service.  The food looked decent, but would I rather go somewhere else that I would get some service...OF COURSE!Bottom line...Bad experience, not so good beer...Blehh"], ["Eric W.", "Maybe we came on an off night, but I was definitely not impressed by this place. I've lived in Columbia my whole life and for whatever reason had never been here. I've always heard great things, so I was excited to give it a try. We went in on a weeknight around 8 or so, and the place was moderately filled. We sat at the bar, ordered some of the house-brewed beer (not great) and an appetizer of black bean dip. After waiting a long time for the appetizer, we realized it was probably never coming. I would've asked about it, but by the bartender came back to check on us, our entrees had already been brought out. I'm assuming the bartender just forgot to put it in. Either way, he never noticed it was missing and it wasn't on our bill at the end.I ordered a burger with their size of hash browns. The hash browns tasted like a dirty grill and were super greasy. I love hash browns but these were kinda terrible. The burger was OK but nothing special. I was really disappointed with this place. I will go back sometime and try something else on the menu and hopefully I can revise my review."], ["Anna B.", "Hunter-Gatherer is a great little restaurant/brewery that's just a hop, skip, and a jump away from the State House. It always has a decent crowd, so if you're coming on a Friday or Saturday evening for a dinner date, might be best to come a little early to grab a beer at the bar while scoping out a table.One thing: the pizzas are little baby portion sizes. I'd go ahead and get pizza AND salad, if I were you. Last time I went, I ordered a delicious NY strip steak with mashed potatoes and asparagus. It was so good that I forced myself to clean my plate (okay, it wasn't that hard...).They have a loft area upstairs in the restaurant. Try the wheat beer. Ladies bathroom is downstairs and the men's bathroom is upstairs. Parking is hard. Wait staff is great.Has anyone been there for happy hour? How is it?"], ["Michael M.", "I will never return. Ever. A table of 5 guys were drunkenly screaming the entire time. We couldn't hear each other talk. It was so obnoxious that the entire dining room was looking at them. They were literally screaming and cussing to the point that a few tables left. After about 35 minutes of non-stop screaming, I asked the bartender if there was anything that he could do, to which he replied, \"It's the owner's friend, so there's nothing we can do.\"  It's a shame because the food is pretty good. But until the owner cares less about letting his friends get wasted and ruin the experience for truly the entire dining room, I would never recommend it."], ["Loli M.", "First time in this place. We ate mussels, duck and blackberry pie: AWESOME. Good beer and great atmosphere:)"], ["Shay E.", "Great location and atmosphere. Diverse menu with local brewed beer. Great specials and friendly service."], ["David A.", "Really cool spot. Thought it was just a bar..which it is, but they have great food as well.  I split a few things with my daughter. The black bean dip with chips is almost more like a soup. And it is filling and delicious.We then split a greek salad and the tofu marsala. Big portions, very fresh and they hit the spot.I like the vibe here.  Will be back to try some more goodies."], ["Elizabeth C.", "This was a great and quick bite to eat!!! I loved the Mac and cheese, it was so yummy. Service was quick and attentive and I have no complaints about food I would 100% go back if in Columbia again. I would recommend to any travelers from in or out of town"], ["Mark A.", "Great lunch!  The steak chili was tasty!  My girls all had the mac and cheese with Goldfish cracker crust and loved it. This place has no easy to see sign but is right on the corner of College and Main Sts right near the campus of SC."], ["Pete S.", "Went there the other night with my lovely woman, and while there wasn't a whole lot of seating, there was a spot for us. I ordered the HG Burger with cheddar cheese, and it was very good. They don't give you an ample amount of ketchup, in my opinion. The hashbrowns are a weird, but tasty, addition. The beers are very good. I recommend their wheat beer. I would definitely recommend if you're looking for someplace in the area."], ["Tyler S.", "It must be called Hunter Gatherer because you have to literally hunt down a table.  There is no hostess, so its first come first serve.  Don't let that get you down though!  Stick around, battle your way to a table, and be rewarded for your superior attentiveness, agility, and table securing prowess, you predatory eater!  This is an awesome little restaurant in the middle of Columbia.  The atmosphere is nice and open for the most part.  If you are a Ranger of the North and the Prancing Pony is out of dark corner seats, there is a dark corner here too so you can sit in the shadows, smoke your pipe, and watch hobbits get drunk (you should probably keep the pipe outside though).  If you love beer as much as I do, this is a cool spot, but know ahead of time.  Don't expect a nice big chalkboard for of a few dozen craft beers on tap.  Expect a nice big chalkboard explaining the four beers that they have on tap.  These beers are brewed in house, and are pretty damn good nonetheless.  Our food was pretty good.  I know a place called Hunter Gatherer doesn't really sound like a place to get a gyro, we both tried them, because well, we just wanted a friggin gyro.  They were pretty good.  I've had worse, and I've had better.  They were very liberal on the tzatziki sauce, which in my opinion, could have used more.  The meat was fresh tasting and flavorful, the veggies cool and crisp, and the pita soft and warm (and didn't fall apart, yay!).  The side salad was alright, and the hash browns were pretty oily, but we both cleaned our plates regardless.  I'd definitely like to try something different next time though.  The short and sweet is this.  Competitive entrance, good beer, decent food, and cool atmosphere.  I can see myself giving it another try next time I'm in town."], ["James L.", "Great specials and really enjoyed the ambiance and brews!  The building is much older with great looking wood and brick.  I got the Veal Yeagarschnitzel special and it arrived timely and was excellent.  My son and wife both got pizza's that tasted great.  I also enjoyed the wheat beer and will be back soon to try the rest."], ["Antoinette A.", "The food was Fantastic! I ordered the burger and it was melt in your mouth amazing!  I also ordered their pale ale which was good, but a bit under carbonated. The service was great and I absolutely loved the rustic atmosphere.  I will definitely be going back!"], ["Craig T.", "I'm reluctant to give this place 2 stars because their pork chop special was really good. However, three different pizzas we ordered were barely a notch above cheap frozen pizza. It was a small flatbread type pizza with lunchables tasting pizza sauce and poor ingredients."], ["Lindsay K.", "This is a cool spot. I love the old style brewing equipment too. I've been to a few newer breweries and they are all fascinating. But you can't beat the old style look. We ordered the black bean hummus, but unfortunately I think the bartender forgot to ring it in so I didn't get that but I got the portobello gyro for my meal. Great flavor! It was filling so I took half home and ate it when I got there because it was so good. I will definitely be back to hang out and try a few more of the brews on the outdoor seating and to give that hummus another try."], ["Jessica S.", "Stopped in for a birthday lunch. Ordered the shrimp and grits. I was not impressed, especially since it came with an $18 a bowl price tag. Service was good and food came out in a timely manner."], ["Kelly R.", "We had the beer cheese and lamb gyro with the porter and it was all delicious. Fun atmosphere, not too loud at 6pm on a Friday and to the point fast, bar tenders."], ["Rebecca A.", "This place has a pretty indie feel to it. It's well established and known in the area and has many regulars. It is housed in a historic brick building that is pretty nondescript and is easily missed if you are not paying attention. Inside it is filled with nice dark wood everywhere. Kind of feels like a ski lodge. The food is pretty tasty, I love their pimento cheese. I ordered the pizza once and it was quite oily but everything else is delicious. The bar area is nice and while I don't drink beer, I've heard it's quite good. They have a pretty good selection of wine. Nice place to meet after work or school (if you're older). It's not really a place undergrads visit, so it isn't loud and disruptive. A solid pick for dinner or Friday lunch."], ["Adam B. J.", "Columbia's original Brew Pub is one of the best places to eat and drink in downtown Columbia.  They don't make special names for their brews, as they speak for themselves.  The wheat and ESB are my personal favorites.  The Chalk Board menu (specials) always give you great choice of specials to dine on.  The cab NY Strip and a fish are generally on the chalk board most days (both which I recommend).  The ESB Pimento Cheese is also great.  The service is always great, and the atmosphere is unique and keeps me coming back.  Love that they of serve hash-browns as a side instead of fries."], ["Meghan F.", "Loved this place.  I came in after a stressful job interview, had an excellent wheat beef and a catfish special.  The bartender was friendly and attentive (but not too attentive), and the atmosphere was comfy and pub like. The catfish special was creative and tasty.  Highly recommend."], ["Joni A.", "I love to try new beers, with some input from the bartender.  I've been here sitting at the bar twice, told the bartender what types of beer I usually like, and was told, \"OK let me know when you make a decision\" as he walked away.  Pretty rude."], ["Kayla M.", "Probably one of my all time favorite restaurants/bars in Columbia everything I've ever ordered has been amazing! The bartender mixes really good drinks. Not to mention the BEER that's brewed in house they do such a good job! The atmosphere is always laid back and relaxed just an all together awesome spot!"], ["J B.", "Great Atmosphere!Delicious pasta.Decent beer.Pizza Hut crust pizza with interesting toppings."], ["Shaji K.", "New city - gotta check out the breweries. This seemed to be the most inviting/closest of the bunch.Big log cabin like setup with waitresses making their rounds and one bartender in the middle of the place serving brews. Only one? All that's needed since there's only 4 drafts on tap:Wheat ale: light and drinkable, best with foodPale ale: good initial crisp, okay flavorESB: best of the bunch, full flavorOlde bastard: not as strong as was expecting for a rye, averageDidn't get to try the food, seems like an okay place."], ["Erin A.", "This place has so much promise and sometimes it is great, but other times the service is so slow and dismissive that I swear I won't waste my time and money again. But alas, I get suckered into going again at the request of a friend. Food is pretty good, but not worth the wait unless you have a few hours and a service person who will actually refill your beer."], ["Travis Z.", "Love this restaurant.  Simple craft beer that is very flavorful and the food was great."]], "Mellow Mushroom": [["Somer P.", "Stopped in for a salad for lunch. First let me say that I eat out, a lot. I eat salads, a lot. I am willing to pay a lot of money for a really good meal anytime of the day. I just spent $50 at Cafe Strudel yesterday and I'd much rather give my money to a local business anyway so it was probably a bad idea to come here in the first place, but I had heard great things and knew the wife of the owner so since I was in the area I decided to stop by since Lexington isn't exactly a melting pot for local flavors. I was excited to have one of their build your own salads since I detest the sauce they use on their pizza and have never enjoyed their pies at any other location. So I start building my salad: $3.49 for the base of spinach and spring mix. $.79 each for the 5 veggies I wanted. $1.79 for each of the \"premium\" fruits and veggies I wanted (times 2). $2.79 for avocado. $2.79 for applewood smoked bacon. And here's the kicker: $4.99 for grilled chicken.I don't know about you, but I can go to Jason's Deli, build my own salad (that I know tastes good), add a chicken breast on the side, have free soft serve and get out for $10. So next time I want a quick salad for lunch that's exactly where I will go. The service wasn't stellar. They do have the Free Times and the patio fence is made of recycled bikes which looks neat so that's what earned them one star. (Also I can't give zero stars so I had to search for a positive)."], ["Roger Y.", "Holy Siitake pizza was excellent as was the spinach salad."], ["Scott K.", "Excellent fresh made pizza.  I live in NC and have always been to the MM in Raleigh and now the one in Cary.  This one in Lexington/Columbia is very consistent with the quality of food as the others, which is fantastic.  The wait staff at this one was also very friendly and helpful.  Nearly felt like being at home except they did have a cool and different theme inside with a trippy sneaker tree to go with the bicycle fence.  Enjoy!"], ["Kara W.", "First time trying the gluten free pizza and it was very good! But the problem is that they burned the first one and took a very long time to tell us this and let us know they were making another one. Left us wondering where our pizza was. Love their creative topping combinations, they are delicious!"], ["Beth F.", "Good pizza but we had to wait 40 minutes for it. Service was slow and indifferent."], ["Stephanie C.", "Good is great especially their spinach salad and caesari pizza; however, their service is hit or miss. Sometimes it's good but beware this might be a problem."], ["Jay W.", "Mellow Mushroom has the best Pizza in the area, and also has the best craft beer selection in the area.  You can't go wrong with steak on a pizza.  The breadsticks and sandwiches are also very good.  I have never had a bad meal at MM.  Every time I have eaten there the service have been good, and some of the servers are also very knowledgeable of craft beer.  The only tissue with MM is that they have a real small parking lot"], ["Issie M.", "Good food and fun atmosphere. Hard to park. Parking lot is always full. Be prepared to jockey for a place.  Pricing seems steep on some items. I have a pet peeve about paying $2 for watered down iced tea. Adding toppings to pizzas or salads increases the cost very quickly.  I think they could do better in that aspect.  Otherwise, good."], ["Elizabeth H.", "Food was ok, service was lacking. Took about  10 minutes to get our servers attention to get our check, she was too busy eating and talking to customers at the bar. Won't bother going back, it was not busy either, maybe 2 tables."]], "Motor Supply Company Bistro": [["Sherry C.", "This is a really great place to come for dinner and Sunday brunch. They have some really great specials. We came for Sunday brunch yesterday. No valet parking on Sunday, so we parked around the corner. The service and food is always good. I had the House Smoked New York Strip Loin over cheesy potatoes, spinach, and grits. It was delicious. Their Bloody Mary's were good also. My friend had the French Toast with Blueberries. She let me try it, and it was also very good. Way too much food for me to eat though. We will be back!"], ["Matt S.", "While in Columbia for my sister's last night before moving back home to DC, she had suggested we try Motor Supply Company Bistro, as she'd heard good things and never had enough money to stop by herself.  The meal was quite a treat.We started out with the 'Artisan Cheese Board' and the 'Seared Scallops'.  I only had the scallops, so I can only comment on that but they were delicious.  The scallops were perfectly cooked and then the accompanying charred broccolini, smoked olive oil and guancale added great depth and flavor to the dish.As a meal, I went with the duck.  The breast was crispy and delicious while the leg was tender and delicious.  The pickled persimmon and sweet potato hash added a great bit of flavor and sweetness to the duck.I'd highly recommend anyone looking for a legitimately good dinner in Columbia to go to Motor Supply Company Bistro."], ["phoebe c.", "Pleased with this review from a fellow Fig writer. Relaxed atmosphere but with a tight, tiny bar (if you love bar dining). Lovely outdoor seating.Our server was attentive and helpful. It seems the menu changes. With that being said, I stated with a Portuguese fish stew (whitefish with smoked paprika and saffron), simple and delicious.Cauliflower steak... they should make a soup with the sunchoke purée! Dan enjoyed the cornmeal dusted wreck fish. The carrot cake was okay. My old fashioned/manhattan inspired cocktail, it could have been dessert."], ["Colton B.", "If you are in need of some authentic, Columbia brunch, head to Motor Supply Co. Bistro! It's fun and trendy but classy. The portions are light but the French toast will fill you up if you have an appetite. Proper serving staff and local art for sale on the wall are the cherry on top of this delectable, local find. Disclaimer: no sweet tea :("], ["Michael T.", "Stopped while traveling through Columbia on a Sunday morning and needed some brunch to help fix the night before that was spent rocking it out in Clemson!  Quick Yelp search and I landed at Motor Supply.  It was kind of hard to find, but well worth the effort.  Their brunch is excellent!  High quality, creative, fresh, and overall outstanding!  Will be back!"], ["Linda O.", "Access: 5* - We had made reservations on a Friday night and were immediately seated. Parking was no problem; free valet. Atmosphere & Comfort: 3* - Our table was in the corner and it was a little snug. It would not have been accommodating to heavier-set individuals. The chairs were extremely uncomfortable and I had to sit awkwardly forward because the back of the chair was hurting my spine. Other than that, the atmosphere and decor was nice.Service: 5* - Although I don't feel we were serviced as frequently as perhaps other places, it was adequate. I'm still giving this five stars because the manager visited us and our server had an amazing memory about the specials of the day. Also, the chef had noted that our table had a vegan diner so our server was prepared to accommodate my request.Food: 3.5* - Although I was impressed when I called ahead, asked about the vegan dish, and got the chef right away who knew exactly how to tweak their vegetarian entrée to make it vegan, there was absolutely no protein in my dish: no legumes, nuts, etc. I was secretly envious of my coworker's chickpeas that were included alongside her seafood dish. I had to eat protein when I got home. Also the Portabella steak, though appearance was unique and lovely, it had too much oil; the flavor and amount of the oil took over any existing flavor that would've been present in the mushroom.  My vegetable sides were good but nothing stellar. The bread which seemed homemade was also soft and served nicely warm. Portions were perfect.Because of the higher price, I do think this would be best reserved for a nice occasion, but I'm not sure that I would go out of my way to go again. I still would say that it is a restaurant in Columbia worth experiencing once."], ["Melanie M.", "Probably the best \"nice\" restaurant I have been to in Columbia. I had the buttermilk biscuit plate at brunch and it was delicious. It came with sausage gravy, grits, and scrambled eggs - a complete hearty breakfast!I like that the menu is written by hand and changes daily. The location is also great, right in the heart of the Vista. Looking forward to eating here again!!"], ["Catherine F.", "Food is genuinely fantastic, but the waitstaff can sometimes leave something to be desired."], ["Michael C.", "Alway great.  Menu has been different every time I have been there.  I suspect they cook whatever food looks good in the market.  Food usually sources from SC farms."], ["Manoucheka A.", "The food was good. I had the snapper and it was ok. The cheese board however was fantastic!"], ["Lydia S.", "Been here twice, once for lunch and once for brunch. Lunch was good but nothing to write home about. Brunch was an intense disappointment due to the lack of really good food."], ["Bob P.", "Original menu that changes regularly. Meal was delicious and service was good and helpful in the decision process. Look forward to future meals."], ["Bob D.", "Food was very expensive. I had the salmon which was excellent and the bread they had was top notch- reminded me of Lithuanian bread I had as a kid.Girlfriend ordered a beet salad which she said was worst salad she ever had and she can plow thru some bad food but ate the beets and did not touch the bitter greens.Excellent service and atmosphere but for the portions/food for the money, i would go elsewhere"], ["Steve L.", "Last night my wife and I had dinner with my son and his roommate for parents weekend. Food was exceptional though we had to wait 25 mins for our salads. Then the meal was timed perfectly. Small bar waiting area so I suggest you go to the restaurant very close to your appointed reservation time. Suggest the T-Bone, or the Hanger steak...wonderful. The oyster salad app was also excellent."], ["Shawn B.", "Sometimes I think I'm too easy to please, but when a place gets enough things right, they get an easy five stars from me. Great food, great drinks, great service, great music and art. It all comes together here at Motor Supply. What I especially love is that you get a healthy taste of South Carolina here. A true farm-to-table, the ingredients tasted fresh, not frozen or stale. There's a sign listing the 11 local farmers they pull from. The menu is handwritten and updated daily. My sons and I loved all the food we ordered and the local beer I selected was very good."], ["Linda K.", "I had a lunch date with my sister here and had a pretty bad experience. The food took a long time coming out and when it did some of the items were cold and some were hot. Same goes for my sisters dish."], ["Jennifer B.", "We came in for a Sunday brunch, it was busy around the noon hour. We have to admit it was a great experience.  An 8 minute wait, but it was nice to see a nice crowd.  Dress was casual, but those coming from church were in their Sunday best. The portions looked small, but it was just enough.  Perhaps I was too hungry. It was refreshing to not roll out of the restaurant knowing I overate. My hubby finally enjoyed grits for the first time that were actually seasoned nicely. I attached some photos from Sunday Brunch. We will be back!"], ["Jansen T.", "Visiting the Vista of Columbia, my colleagues from here raved about this place. They delivered in my opinion. I had the hand cut pork shoulder with their special BBQ sauce over mashed potatoes. It was a great portion and tasted delicious. The service was prompt and friendly and I loved the fact the menu changes daily. It's a truly unique Columbia restaurant that should be on every visitors list."], ["Mathew H.", "Fantastic locally sourced food with a daily menu that changes. Handwritten for an extra splash of southern hospitality, this is a great restaurant in a beautiful setting. Service, food, ambience and creativity were all outstanding."], ["Arnold B.", "An excellent restaurant. A fresh eclectic (hand written by the chef) daily menu. The duck confit sandwich was absolutely memorable. Lunch prices are reasonable. Dinner is a little pricey. But truly a wonderful restaurant."], ["Robert V.", "My wife and I just found Motor Supply Co a couple weeks ago, and have already been back twice. This will be one of our regular spots from now on. It has a cool atmosphere, friendly and helpful staff, and an amazing menu that (I think) changes every day. This place is one of the hot spots in town, so if you're not booking a reservation in advance, you will probably be waiting a bit. We made that mistake last time, but lucked out with a couple spots at the bar after a 15 minute wait.Street parking on Gervais isn't usually too bad, but they have a valet in case you don't find something on your first pass."], ["Hailey H.", "My boyfriend and I had a delicious meal at the Motor Company Bistro during a short stay in Columbia. Most impressive to us was how the restaurant sources all their ingredients from local farms. The ambiance was very nice as well. We would definitely recommend this to anyone!"], ["Erika K.", "The quality of the food is top-notch.  Everything tasted fresh and was artfully arranged.  I really liked the farm-to-table concept and the fact that the menu always changes.  Service was prompt and friendly.  While I enjoyed the ambience, I did find it a bit noisy.  Everything I tried was delicious, however the portions were way too small for the prices being charged.  My husband and I ordered one soup, one salad, two entrees (one of which was vegetarian) and one soda and our bill was $75 before the tip.  No alcohol, no dessert.  I left feeling hungry and ended up making a sandwich when I got home.  As previously mentioned, the quality of the food was superb, but one should not leave a restaurant hungry after dropping $75.  I think the restaurant needs to either lower the prices or increase their portion sizes in order to make a night out here worth the while."], ["Julie R.", "I really love the food here! I got the duck duo the last time I went here and everything was cooked perfectly. The duck had a crispy skin and was seasoned well. My husband had the porkchop which was excellent as well. Just know what you are getting into as far as the price goes! You pay  a lot for a little bit of food. I thought their portions were skimpy. There was literally a smear of sweet potato on my plate under my duck. Total of two entrees, a cheese plate, 2 cocktails and 2 beers was $122.00 without a tip. Excellent food, just some of the most expensive food in columbia!"], ["Charles M.", "Favorite nicer place in Columbia, SC hard to beat this place. They have a different hand written menu everyday and everything I have had is phenomenal here.The last time I went was for brunch, this was the first time I had been for brunch and man I have been missing out on probably the best brunch in Columbia.I had the Buttermilk biscuit plate with sausage gravy scrambled eggs with cheese grits and side of bacon. Definitely suggest trying this place for dinner or brunch if you go when it's nice out they have a sweet patio to eat on. A nicer place but definitely worth the $$ for some very high quality food."], ["Christopher K.", "This review is being written by someone that prefers to eat as close to vegan as possible but knows Columbia isn't up to speed yet so I try to eat low dairy, low/no egg vegetarian at restaurants.There aren't many nicer places in Columbia that have good vegetarian options.  Motor Supply is at least vegetarian aware and always has a vegetarian option on the menu.  When I went, that option was a cauliflower gratin.  The staff was also aware of the base stocks on the soups and thankfully one of them was fully vegetarian. I didn't order it but it's worth checking on.The cocktail list was fantastic and many of the drinks featured obscure Italian herbal liquors -something I enjoy.  I tried the playfully named 'shark with lasers'.  Delicious.If I need somewhere to fancy to take a business associate, this is not a bad option for me."], ["Roger F.", "This restaurant is currently enjoying a big financial turn-around, and you'll find it busy most nights. The mixology program is far and away the best in town, and the renovated patio is a very welcome (if loooooong overdue) improvement. They remain, however, at a concerning crossroads. The new chef seems a little more concerned with being a famous chef, and a little less concerned with consistent execution. Their commitment to local ingredients is very admirable; but if those ingredients end up in numbingly pedestrian entrées, then who cares? And the pastry program is on life support. On great nights, main courses at Motor can be world class. The desserts, however, are stuck in an amateurish rut. Motor needs to recapture the excitement and unpredictability that made their menus the best in Columbia for a while. I really, really hope they do."], ["Ray D.", "Decent food, good cocktails, menu has confusing abbreviations, valet, excellent creme brulee. Visited South Carolina for a business trip and decided to find the \"Nicest/Best\" restaurant in the area. Read a lot of good things about this place on Yelp as well as some locals said it's trendy and has a \"hand written\" menu.Parking here sucks, but they do have a Valet service which is almost necessary.  Walked in, greeted by a hostess and took to our seats. Our server only checked on us a few times and she wasn't aware of what \"gluten\" was, so I had to educate. That made me deduct a star on it's own for such a \"fancy\" joint. The inside is very odd and doesn't really remind of you a Motor Supply Company at all, the bar was bland and not much was themed. It's a cozy romantic spot with wooden floors and tables shoved in there. Started with a Carpaccio appetizer which wasn't the best I've had and lacked in flavor and the cheese was almost like eating salt. The drinks however were excellent, I chose an Old Fashioned which was properly made and served with fresh fruit. The menu had 3 or 4 confusing abbreviations as to what stuff was so we had to wait for our server to ask what certain abbreviations on the menu was. Finally we were ready to order and one in our party ordered the \"fish\" and bam she told us they were out of the fish, could have said that first! Also to note the Ribs off the bone menu option is not \"ribs off a bone\" by any means, it looks like a filet Mignon cut into slices if your thinking about that option. Tasted nothing like ribs whatsoever. My friend & I ordered the $28 rib-eye and got 2 pieces of the most fat/gelatinous filled steak I have ever had. You could literally eat only one third of this rib-eye, hence the reason for 3 stars. Was probably the worst steak I've ever eaten for a \"fancy\" restaurant. Another one of us chose the Pork Steak with Sweet Potato Puree and I have to say that was the best dish out all of them. The sweet potato was delicious as well as the pork. The dessert Creme Brulee was excellent and tasted properly cooked and toasted just the right on the top. Was a great ending to a not so good meal. Pros:--Great Drinks/Bartenders--Great Desserts--Great Pork Chop/Sweet Potato--Valet ServiceCons:--Unreadable Menu Abbreviations--Confusing style of deco/theme--Rib-eye was pure fat--Ribs off the bone was misleading (it's a filet sliced up)--Service was not on par with pricesNext time I visit SC, I will probably drive to Charleston to try out their nice restaurants, Columbia has let me down."], ["Anna L.", "Excellent service and atmosphere but waited 30min for the food to come and was not delicious. I didn't quite understand the hype. I would not go back because portion is so small and very pricey."], ["Canita C.", "I just recently met a friend, that I have not seen in a while (my daughter's god mother), for brunch after church.  I had never heard of MSCB before she chose this place to eat. I was excited, because I love farm to table restaurants. But I was a slightly bummed, because I am a planner, and it's kind of hard to check the menu for future dates.  This was also a little exciting - I must admit.I had a very hard time finding the location, I didn't use GPS, but once I got out and walked, I found it right away.  I love the décor!  I could add a couch, TV, call it home and host some fabulous parties there for sure.  The service was impeccable.  Our waitress was extremely helpful and patient.  I almost always get a mimosa when I brunch (and it's available).  But, I just wanted to something different.  We talked about a few other things, that I said no to, and I decided on the good ole mimosa.  She said if you really want something different you can get a bellini.  I said yes right away. It was not on the menu, but it was delicious!!She let us know what items were running out, which helped me decide.  I ordered the biscuit and gravy plate.  It's one of my favorite items for breakfast.  My friend ordered the same.  It did not disappoint.  The plate came with a biscuit on top of grits, covered in gravy, with a tomato and asparagus spear on the side.  It was so good, I ate everything on my plate. My one complaint would be - not enough gravy.  It was delicious and I wanted more.Earlier I mentioned that I had not seen my friend in a while.  I included that because apparently MSCB closes between brunch and dinner.  My friend had another mimosa, and me a cup of coffee, after eating.  So we were the last ones to leave. But I didn't feel rushed at all, in fact I was offered another cup of coffee.  BTW - the coffee was smooth enough to drink black.I am looking to go back again and try something different.  I wish I had thought to take a picture of my food. Next time."], ["Tamar B.", "I just left. I've heard great things about this place, but I was not impressed. First, the location has one small sign that makes it hard to see from the road. I parked and walked around until I found it. Second I walked in and the host and hostess were more involved with their conversation than they were I greeting me. I felt rude for interrupting. Maybe I wasn't received well because I came by myself to brunch on Sunday. I watched others come in after me and get sat before me. Third the waitress just came said \"hi\" and looked at me. No explanation of the menu. Just hi. I asked for a water and she dropped it off and went to talk at the host station. No explanation of the menu or anything. So I just left. Walked by my waitress (that was still talking at the host station) on my way out and she didn't even acknowledge me. I was stopped at the door because an older couple was stopped at hostess station talking before they left.  New to Columbia and trying new restaurants. Felt let down by this."], ["Lea L.", "Inconsistently delicious.I have been here multiple times for both brunch and dinner and have found myself everywhere from elated to disappointed and in-between. Brunch is consistently impressive, dinner not as much.Decor is funky and modern with walls adorned by eclectic local art. It is a cozy place that may be a little too tight for some on the most crowded of nights. There is a cute back covered patio that is enclosed in the winter. It is a nice spot for dinner but the metal \"garden chairs\" are not the most comfortable for a long laid-back meal.It is chic enough for more formal dinner wear but still appropriate for casual dress.Unless you arrive early enough to snag a convenient parking spot, use the valet.The menu is released only a few hours before each meal and features offbeat pairings (sometimes TOO offbeat) and local fares. You can expect to find a steak (usually N.Y. strip or porterhouse) dish, a pork dish, a duck dish, a pasta dish and a fish dish.I have had steaks with 75% fat and dishes that seemed like they were just thrown together. On the flip side, I have also had the best Triggerfish I have ever had. Again, inconsistently delicious.The cocktails are always above average and I cannot boast enough about the Bloody Mary's--the best I have yet to taste in Columbia, though I do wish they were larger ;). Tip: splurge for the bacon bloody.The servers are consistently knowledgeable though at times they do seem to be understaffed.I seem to leave more impressed with their brunch than dinner every visit and highly recommend the chocolate ganache stuffed french toast if you are lucky enough to catch it on the menu.Definitely worth a visit--or two. One of the best spots in Columbia.Pros:- Locally sourced ingredients- Eclectic and ever-changing dishes- Great drinks/bartenders- The brunch- Valet service- Knowledgeable waitstaffCons:- Small space- (sometimes) odd art- Inconsistent and disjointed dishes- Parking- Menu difficult to read"], ["Will D.", "Definitely weighted by location. Probably wouldn't return if located in NYC or even Charleston, but the bar here, the daily menu printing, and the dedication to farm to table are 5+ stars for Columbia. Really the only cocktail game in town.Sort of need to up your side game MSC, as much as I love protein / starch / veggie plates at home - when I go out to a restaurant I like a more harmoniously constructed plate. Haricots Verts again?I have to go to Columbia a lot. I have been here a lot - and will go here a lot more."], ["Seth R.", "Absolutely fantastic. I was traveling back from Atlanta to NY and found this gem on yelp. Needless to say every bit of my meal was incredible. I had a carrot soup to die for followed by a shrimp and sausage over grits which I can still taste just by thinking about it. I wish there was some place like this in NY. Hats off to the owner and chef!  Service and food was amazing!"], ["Jen H.", "Really love Motor Supply. I have been going since 2011 and it almost never disappoints. Always fresh farm-to-table food with local farmed ingredients often from City Roots.I have never had a salad from Motor Supply that has disappointed and tonight was no exception. The crab claw meat salad with sweet chili vinaigrette was so tasty! My mouth waters thinking about it. I also had the beet salad tonight (my staple at any restaurant if it is offered). There were so many coarse salt grains on it that the saltiness completely dominated the dish. I actually have never ever sent food back, but fortunately our waitress very graciously offered to remake it. It was much more to my liking when the salad returned without all the salt grains. Fish such as the mahi mahi are also consistently well cooked and not dry. I have had their salmon in the past as well.  The pork porterhouse was really amazing. Served with creamy sweet potatoes, the bacon gravy had a subtle cheesy quality to it. Wow, what a combo! They really complemented each other. I have had their duck (either confit or thigh form) at least twice now and it is not my favorite in terms of preparation ...it is often medium well done on the drier side as opposed to medium. For duck, I highly recommend Momo's.Finally, my only \"complaint\" is that their desserts never really impress me. Items are usually \"safe\" like a flour less chocolate cake or creme brûlée is usually on the menu. I would love to see something more innovative from their pastry chef, like at Terra. For that, I'll be docking one star because my sweet tooth demands it. :)FYI There are limited parking spots in the lot but they also offer complimentary valet parking if you dine with them. No private dining areas but the covered patio is nice when the weather is good. Oh! And did I mention they infuse their vodkas?!"], ["Bruno D.", "Disclaimer -We have been huge fans of Motor Supply for a long time.  Their previous chef Tim Peters was an unbelievable chef and created dishes that were unique, seasonal and gastronomically amazing.  Unfortunately Tim left Columbia.Current situation - The restaurant has really improved the patio area but that's where the improvements stop.  The food is alright but is no better than any of the other restaurants in its restaurant category.  They have made so many food changes (not in a good way) that I will no longer recommend this restaurant.  Mediocre Southern fare with not a lot of flavors.  I will not come back for a very long time.  The kitchen has lost its way here and I'm really disappointed."], ["Susan D.", "Wow,  brunch was awesome and service was great.   Crab cakes and grits were yummy.   What stole the show was the cold smoked salmon and a great wine recommendation from the server.  I'll remember the salmon for a very long time.   Intense smoky flavor, delicate texture  and a delicious aioli.  Can't wait to return."], ["Donald L.", "A nice farm to table dining experience. I knew it would be something special when we noticed that the menu was hand written. We had a cheese plate and opted for a bottle of wine at the recommendation of the sommelier. I then chose the vegetable plate that consisted of roasted potatoes, creamed corn (almost a cobbler) and grilled radicchio. Perfect.The staff was friendly, the place felt warm and inviting, and the food was outstanding. Highly recommended."], ["Amanda V.", "Gift exchange with my best friends. Perfect place, great food and service with awesome company. Not much more you can ask for."], ["Ramon S.", "Fine dining located next to the Social nightclub in the Vista. The atmosphere is relaxed and the customers were dressed well. Plenty of artwork to gaze while waiting. The portions are small, as I expected, so don't come too hungry. Since the menu changes daily, I won't comment on specific dishes but, instead, will describe my overall experience. The food was expertly cooked. The steak my girlfriend ate was amazing. Our server was exceptional. Bottom line : I enjoyed our dining experience but was hoping to have my first experience with fois gras and truffles. I didn't come to eat mashed potatoes and grits, however, they were delicious. The food and service was excellent which is why I gave it four stars. I'm still searching for my 5 star fine dining experience. I want to experience what Anthony Bourdain does in his show No Reservations. I want to have an experience that will blow me away. Something that will bring me to tears. I want to have a sensual out of body, out of mind experience. The search continues."], ["Chris M.", "Stopped by for a late brunch. The wait was 30 minutes but there was seating at the bar.The bartender recommended the crab cakes and wow! Best crab cakes I have had in as long as I can recall. The outside was extra crispy and the inside melting together. They must be flash fried before served. The crab cakes were served on some delicious grits.My wife had the French toast and yogurt. She spoke highly about both."], ["Dave V.", "Great service & food. If you are looking for a 'Cheffy' restaurant with a very diverse and interesting menu, make sure to try this place."], ["William K.", "A fantastic experience for my husband and I. We were celebrating our first-date-night anniversary and could not have chosen a better restaurant. The food was superb, and I applaud the chef on his craft. The meal was daring and successful, delicious and exciting. The drinks were wonderful as well though the highlight of the evening was our server who was gracious and helpful. Fully recommend Motor Supply Co."], ["James C.", "Excellent, because adding other flowery words will do any five star review an injustice."], ["Lori R.", "Best food, atmosphere and staff around. Delish changing menu. Josh makes the best custom drinks ever. Love going with friends for dinner or hanging out at the bar."], ["Brett J.", "If you're looking for a place in Columbia with great food and some choice drinks, definitely try Motor Supply.This is one of those restaurants with interesting and eclectic food matchings.  The menu changes from time to time so I can't say \"be sure to try the Duck l'orange!\"  But I did have breakfast and lunch here, and I was pleased with both.Their bloody mary's are pretty good...a little on the small side, but good craft drinks all around.  If the sports bars are too crowded, this is a good place to continue your drinking, though it's a bit more classy than the local swill holes.  I say drinking because there are no TV's here.There is an indoor area and a back patio enclosed by a gate with shade.  If you choose to sit inside, be careful where you choose, you may find the AC or a fan right over your head (and despite mutiple requests to lower them, they could not).We had a big group for breakfast, but Motor Supply wouldn't take reservations for no more than groups of 6...so we just took up a couple tables.I'll definitely be coming back to this place, I could see it being a great place to take a date, before or after some Columbia walking."], ["Candace B.", "Two words: Sunday Brunch. It was amazing!"], ["J S.", "Columbia, SC - Home to one of the best farm to table restaurants I have tried to date.  The name is misleading, as there is nothing on the menu related to automotive fluids or parts.  I had the quinoa with olive oil, infused with hot peppers and cherry tomatoes.  It was incredible.  The decor is nothing special, I liked the valet parking since there was no where to park in the general vicinity of this part of the Vista.  I can't wait to come back."], ["Danielle M.", "Amazing food, atmosphere and customer service, every time!"], ["Jo G.", "We ate a wonderful meal on Wednesday evening.  Don had wild rice and chicken soup, strawberry and pecan salad, cheese tray, and a flat iron steak.  We shared everything. Key lime pie for dessert.  Several  People told us that they could not recommend this bistro because the menu changes daily.  The menu is hand written and the ingredients are fresh from the area.So go!!!!!"], ["Dave R.", "The food in this restaurant is really unique. I ordered a vegetarian dish with fava beans polenta, green beans, and tomatoes , which was absolutely delicious. For an appetizer, they offered quail with potatoes, which was outstanding. If you like different combinations than you're going to find at your typical restaurant, this is the place for you. Give it a try."], ["Andrea R.", "Overall it was a \"just ok\" experience; we just felt that the service/food wasn't up to par with the pricing. We arrived and were seated right away, at a table right by the doors leading outside, not the best location. The table seemed so tiny. We ordered the charcuterie to start as well as the walnut, cranberry salad and a bottle of wine. They were both delicious and served promptly. We then ordered our entrée's, I ordered the steak cooked medium with mashed potatoes and my husband ordered the pork with bacon steak and sweet potatoes. Our food took almost 45 minutes to come out. We watched 3 different couples arrive/order after us and receive their meals before us, one was even done by the time we were served. So as you can imagine we were pretty hungry. Our meals finally arrived and my husband's was perfect. My steak was completely raw, like purple raw, not even rare. It took 5 minutes to flag the waiter down, which is long considering how small the place is. I showed him the meat and explained that I ordered it medium. He responded with \"the chef likes to prepare the meat rare.\" SO WHAT. I ordered it medium. He took it back and several minutes later they returned with what looked like a new steak and plate. Amazing how quickly it came out. O_o My steak was over peppered and salty, my husband agreed. He enjoyed the pork but wouldn't order it again.Looking at the unique menu we were very disappointed with the service and overall experience. So much so that we probably will not return. They do offer valet which is very convenient, free just need to tip."], ["Jon P.", "As organic farmers we seek out farm to table restaurants when we travel. Simply spectacular if you really know about and appreciate real food."], ["Kyle B.", "I love the localized, farm to table idea and the food was excellent. They do not have sweet tea and the portion sizes were very disappointing to me."], ["Clay S.", "excellent dinner. Got in late from long day of travel. This spot was recommended and did not disappoint. Walked over from Hilton. Loved that they had a fresh menu with fresh items.  Friendly waiter made some recommendations on what was best and off we went. Had a beet salad and a lovely piece of local fish (forgot variety).  All were excellent.Extensive beer list and decent wine by the glass options."], ["Ken S.", "Loved the food, menu, service, and ambience. This is one of the \"local\" spots I tend to look for. They make an effort to support locally sourced supplies as well as change the menu frequently. Two major wins in my book. Definitely worth the time and effort to eat here, especially with a few friends or colleagues."], ["Steve H.", "I go here with my Wife more than any other place in the midlands when we want a great meal. It's my \"Go-To\" place. I've never had a bad meal here"], ["Ginny M.", "Really enjoyed this restaurant! Excellent food and great service. Love the fact that the menu changes daily and utilizes farm to table, fresh ingredients. Very reasonable wine prices as well. Highly recommend!"], ["Rob S.", "We arrived 20 minutes early but were promptly seated.  We shared a seared lamb carpaccio that we both enjoyed.  I had the Italian Farro salad and my friend had the tomato soup.  Both were excellent.  For dinner I had the coulotte steak and my friend had the redfish.  By the time we finished our plates were clean.  We had a bottle of the Arcadian Sleepy Hollow Chardonnay.  Though this is not ordinarily what I wouldhave with steak, I saw it on the wine list, and it is one of my favorites and very difficult to find. We shared the cookie dough dessert, and very much enjoyed it.  Our server was in her first week on the job, and there were a few glitches, but she apologized and made everything right. She was also quite attentive and friendly.  Overall, this was a great restaurant experience."], ["Rick T.", "When I'm slightly hung over mid morning on Sunday I head to Motor Supply Man. I get a table outside order what ever the special is, could be fish or fried lobster. Everything I've had from the biscuits to the stone mill grits is superb! I wash it all down with Bloody Mary or a nice cup of coffee to soothe my soul. Lunch is also great, but get there early or suffer a line or the overflowed parking lot. Local is Better ! Local is Great!"], ["Alfredo C.", "Love the food. A little bit pricey knowing that they are some other Rest. around with same quality food. Great services. They made a mistake with one of our appetizer....so we got it free. Then we decided to share the entree, but they charge us $2.50 just to split it the entree Into a new plate.......  I will go again, but split my plate on my own."], ["Jim J.", "Visiting Columbia for business.  This place was recommended to me.  Located in an area called The Vista, I missed it twice not being too familiar with the area.  Finally found the right parking lot and valet parking.  Sat at the bar and was greeted by a very helpful bartender.  Had the pork chop for dinner at his recommendation.  Great flavor, perfectly prepared.  Paired it with a nice glass of wine that was a perfect choice. I would highly recommend this place.  A bit pricy, but great food, service, and atmosphere."], ["Rae L.", "The vegetable wrap was quite tasty!  I really wanted to taste the fish stew, unfortunately it had shellfish, which I am allergic to.  The vegetable soup was okay, fortified with fresh greens!"], ["Rick C.", "Not flexible with special food needs. Parking is a bit difficult, but it is in the Vista so that should be expected.   The restaurant itself is very cool, nice intimate setting, very good design.My experience has been they won't adjust the standard recipe very much.    For example, if you ask them to leave off the cheese, or cook something without butter or oil to make it healthier, they just won't.   Apparently everything is prepped in advance and just can't be modified, or perhaps they just don't want to adjust their perfect recipes.Regardless it is very frustrating.Now to be fair if this is not an issue for you, the location, food and service are very good."], ["Josh M.", "I just recently are here and let me tell you they have delicious food. I got a steak and it was cooked to perfection. The servers were very polite and gave us great recommendations. The drinks were a little on the pricey side but other than that I would recommend it to anyone in the Columbia area!"], ["Kris L.", "This place is super fun, good food, good atmosphere. We like this place and will continue to come back. I have never had a bad meal."], ["Dee A.", "First, my coaster was made from yesterday's menu.  Pretty cool.  I guess their menu changes everyday based on what's available.  The service was super friendly and the decor was calming.  It made me want to sit and talk all night.  We got there on a Saturday around 8:30 and the place was dying down so we were sat right away.  I had the fish dish of the night and my friend had the steak.  We both ordered craft beers, I liked my IPA better than his.  They had a pretty nice sized beer list with something for everyone.My fish was perfect (I'm sorry I can't remember the name of it).  It was served with fresh carrots and a type of puree that was light and tasty.  My friend's steak was huge.  It was a little dry for my liking but he loved it.  The portions were the right size for the price and I would definitely be back!"], ["Bret A.", "This restaurant is a little hard to find at first because the entrance is actually off the side street parking lot.  Park on the street or use their valet.  Motor supply has high ceiling with funky art and a wonderful outside seating porch. It does face another building, but the porch was much quieter than inside. The service was very good and friendly.  They have wine by the glass or bottle.  The menu includes southern gourmet items such as grit cakes with duck confit, seafood with varied pairings, steak, aritsan cheese boards and creative salads.  The mushroom bisque is fantastic - really great!!!  $8.  The CAB steak was tender and the accompanying demi glace perfect.  $29.  Most entrees are $20-30.  The only missing option was a side salad.  There entree salads look fantastic $11-13, but there is no smaller option.  The atmosphere was very social and talkative so it is a bit loud, but fun. The location is super convenient because you walk to other places along the street.  Don't miss this stop when you are in Columbia's historic district for a great meal!"], ["Mona D.", "I had heard so much about this place, how amazing the food is, how great the service, etc. so when Mom came to visit I took her there...unfortunately neither of us was impressed nor has any desire to return there considering the price tag on the meal.The best part about the entire visit was that even though we went on a rainy, cool Thursday evening we sat on the patio. Yes the patio!  They've got this semi enclosed seating area with some amazing heaters mounted on the walls and it was perfectly comfortable.  That area's loaded with ambience: brick walls, leafy plants, dimmer lighting - which was great since the inside is pretty plain: mostly bare walls, plain wood tables and much brighter lighting.After that there isn't much to say: the asparagus soup wasn't bad, the wine was just ok, the pork roast was probably good but the sauce spread all over it was too spicy and not indicated on the menu. Since the plates weren't pre-heated the food cooled off quite fast outside.All in all it was a lot of money to spend for very little enjoyment.  We'll try another restaurant or three (for the price) next time."], ["Erin H.", "My boyfriend (who is a farmer, and was visiting from Colorado) and I came here. We didn't realize how fancy it was. We sat down and each ordered a beer. The waiter walked us through the hand-written menu, giving us recommendations and a more in-depth description. We also ordered a cheese plate as a starter. Not gonna lie, I was concerned when three cheeses came out with 4 slices of bread, because it wasn't going to be enough. Thankfully the waiter brought out more bread as needed. The cheese plate was delicious. They also brought out some fresh bread with a balsamic vinaigrette and oil to dip in, again, delicious. We both ordered a bone-in pork chop and purlough. When it got out to us, we were pleasantly surprised at the portion of the pork chop, as it was a pretty hefty portion. Seasoned perfectly and the purlough was great too. We left feeling like we hadn't been ripped off for the price and portion. We both agreed that some times when you go to a higher end restaurant like this, they charge a lot of money for a plate, and you're left wondering where the rest of it is, but that wasn't the case here. Also, we both loved that everything was locally sourced and high quality. If you're looking for a nice restaurant for a special occasion, I would recommend this one."], ["K N.", "Great food, cool atmosphere, we loved it. The only problem we had was finding a hair in my food. I'm not sure if it was mine or from a cook there, but I mentioned it just in case. And the restaurant comped my meal."], ["Nat C.", "Absolutely amazing service and food.  A must for special occasions and whenever you want to treat yourself!"], ["Christa C.", "Since moving to Columbia 18 months ago, we've dined here close to a dozen times and taken many a visitor here. Obviously we love it! Wonderful, inventive food with a local, yet unique, flare. Menu constantly changes, but there is ALWAYS something new and wonderful to try. Not many places can do it ALL superbly (e.g., duck, steak, fish, salads, mussels, dessert).Great atmosphere, though a little dark for some reading the menu.Always looking forward to our next visit!"], ["Michael B.", "Food is definitely some of the finest in town, bartender karlyn is great and I love coming here.  Excellent brunch on the weekends as well!"], ["Gregory G.", "Motor Supply is one of my date night places. The menu isn't cheap and neither are the drinks but you definitely get what you pay for. Great atmosphere and food with exceptional service. If you're looking for freshly made cuisine at a local columbia establishment then look no further. Great for business meetings, dates, and the Weekend Brunch is amazing!"], ["Grace M.", "This place is amazing. The menu is constantly changing which makes it even better and the food is always fresh. The service is great and the location is quaint. You almost forget you're in Columbia."], ["Heath H.", "Top shelf once again. One of my favorite places period. Would have rated 5 star if our  server had been a bit more attentive...and I do not need a lot of attention. A few times we did not see him for quite a while...and he seemed a bit in the weeds at times...but a great support staff picked him up. I would go 4.5 if I could. I realize it is Masters week but you know it is coming. Soups, stinky cheese plate & charcuterie...outstanding. I had sous-vide flat rib over Yukon golds all sauced w/ black butter. Off the chart. Four Roses rocks was dessert. This place is the epitome of consistency. Owner Eddie Wales, Chef Fulmer & his staff continue to deliver."], ["Diana M.", "We stopped in Columbia on our way to visit our daughter in college. We had a great meal here!"], ["Annie D.", "With the rave reviews, I couldn't NOT go to Motor Supply. It's a terrific little bistro that we checked out on a Sunday night (they also serve brunch and lunch, and are one of the only area restaurants open on Sunday nights). Their menu is handwritten daily, so it changes, but it includes some really wonderful \"New American\" cuisine. If you see the bavette steak on there, you're gonna want to order it. Demi glaze, garlic mashed potatoes, asparagus and a big hunk of perfectly cooked meat. I'm still thinking about it a month later. The fiance got the biggest pork chop I've ever seen, which was also good but we both agreed the steak was the winner. So tasty, in fact, that the fiance returned there for it the following weekend with his parents."], ["Hung D.", "I don't understand the non-5 star reviews.  This place serves up awesome food.  My rule - try lunch before diner unless you're 100%.  We were visiting from Augusta. The restaurant we wanted to try was closed for lunch on Sat, Pearlz oyster bar.  Fortunately for us Motor Supply was around the corner & I remembered the good reviews.Overall food was tasty & nicely presented. Portion & pricing was great for lunch, in fact better than most restaurants in Augusta.  We sat out in the back with the plastic cover, still with a drat due to windy day.  Service & food made up for it though.  Ingredients were fresh, that's why their menu changes daily.Wife had the hanger steak with mashed potato & string green beans (haricot vert) for $14.  She was very happy with her choice.  Beef was cooked perfectly & tasty & tender.  She has eaten at Ruth's Chris & Brazilian steak houses, so she likes her steak.Daughter had the grilled Shrimps,w/Thai chili sauce over risotto & haricot vert for $13. Sauce made the dish. Risotto was cooked perfectly. My other daughter had risotto at a fine dining restaurant in Augusta the next day, it was not done right - undercooked crunchy. My other daughter had broccoli & cheese soup ($4) plus a turkey sandwich.  They were fresh & she enjoyed them very much.I had the twisted pasta in a cheese wince sauce with sun dried tomatoes, no meat, for $10.  Also added a salad ($10), hands down one of the best salads ever.   Grilled asparagus & organic broccoli w/ 1/2 grilled corn, plus slices of cucumber & tomatoes on top of mixed greens, all topped with feta cheese & olive oil. Everyone tasted the salad & agreed it was the best of 5 dishes, with the steak being 2nd.Do yourself a favor, stop by for lunch & try it out. You will be back.  MSCB has the most reviews on Yelp w/average 4 stars. Personally we think it should be higher. Just for comparison, I spent $300+ (5 people) for my wife birthday later that night at a fine dining restaurant & we all said it wasn't as good as MSCB.   Sorry no photos, we were too anxious to dive into the beautiful foods.  Sorry for the long post, but it was too good."]], "Beef 'O' Brady's": [["Mrs. C.", "Great customer service, very clean and good food. Lots and lots of TVs. Loads of different yummy salads and alcoholic beverages plus it's family friendly. Who doesn't love that? Has a little arcade for the kids too and cute outdoor seating. We we will be back!"], ["Furman L.", "This is a great, casual restaurant to grab American style food (burgers, fries, chicken fingers, etc). Everything is made-to-order and comes out extremely fresh. I have seen them serve the entire Dutch Fork Football team before a game, so they can definitely handle large (hungry) crowds. Location is average, right off of Irmo Drive. Very easy lunch spot with plenty of free parking. Lots of TV's, too. Highly recommend!"], ["Michael B.", "One would assume that a place with this name would have a steak on the menu. You would assume wrong. You would also assume that it would have Irish food and not Texmex. Again, you would assume wrong. Finally, you would assume that they would have Guinness draft. I think you see where I'm going with this.I honestly don't know how they can stay in business with that name coupled with that menu. The damn menu was like 12 pages long! WTF?What I was expecting from a place named \"Beef O'Bradys\": Beer choice: Harps, Killian or Guinness. That's it.Menu: Steak, lamb, Shepherd's Pie, Bangers and Mash, Fish and Chips, and everything comes with Soda bread. That's it.Though that's honestly what I was expecting. But that's not even close to what I got. My wife had the turkey and bacon sandwich. I asked her if it was as good as Groucho's Deli. She said, it's good, but it's not not even close to Groucho's. She did say her drink was really good. I had the \"signature\" burger. It was a hamburger served with what you could tell were frozen french fries. It was OK, nothing spectacular, and certainly not worth $9.I have serious doubts I'll ever go again."], ["Richard F.", "Great food, but doesn't matter when it's HOT as hades in the restaurant.  95 outside but 120 inside.  We were all sweating on our food!  Not enjoyable.  Maybe in the winter."], ["Patrick L.", "Weekend breakfast is great !!! You have to try  the French Toast.  Try the wings while  you watch sports on 15 +  TV's.   Service is great and family  owned."], ["Donna C.", "No complaints, typical bar food fare. Large portions, Price reasonable.  Bar area needs to be larger to accommodate football games. Would be nice to have local draft beers available. Seemed to be a little understaffed, one lady at the bar was VERY busy and wait staff for dining area was not busy at all.  We were not neglected or ignored, our service was adequate and she was friendly."], ["Jerry C.", "Very nice staff; always friendly.  The Buffalo wings are easily the best in town if you like the traditional wings.  The ribs are also very good.  I eat here more often than any other restaurant because of their to-go menu; great for carry out. For the wings, they also have \"terry hot\", which I find to be better than the traditional hot wings, but I usually order both."], ["Brian L.", "This Beef O'Brady's location is bananas. Food is on par, and service is not bad. The problem is the atmosphere -- it's not a big place and the combination of rowdy bar patrons and rambunctious children is a hellish nightmare for anyone wanting to sit and actually enjoy a meal."], ["Yvonne M.", "Love, love this place. Kind of like Cheers!  If you a Gamecock fan ( and who isn't ) then this is the place to go watch the games!!!!!!!! Good food and staff is VERY friendly. Love this joint!!! Go and visit."]], "Gervais & Vine": [["Adam B. J.", "Gervais and Vine was great when it was the only place in town that did tapas (small plates), but as owners, chefs, and managers changed it's hard not to ignore so did the quality.  I fully understand the idea of tapas, but some of the dishes here are just two small for the price.  I realize that you go here for an experience and you order several small plates etc, etc,etc.  My last four dining experiences would have me ranking this lower, but the history of the place makes me say A-OK, as I'm sure I will be back again. I just hope they step their game back up."], ["Julieann L.", "Pretty nice place to eat.  The tapas were really good and ordering a few to try out and share with the family is another great bonus too.The eggplant fries (which we saw many ordered, not just us, so a great sign), the lamb chops, filet mignon, the mahi mahi, and the seared scallops were an absolute highlight! One of the best scallops we ever tried. Downside was the pizza, we had better, and it didn't tasted that great honestly.  It was the last thing to finished andOur waitress was friendly and even when the first pitch of sangria tasted watered down,  she fixed it and it tasted somewhat better. I  don't rave about this sangria though. So the atmosphere was wonderful.Service was helpful and friendly.Tapas and dessert dishes were fantastic.Definitely a place to come and try"], ["Mona D.", "I love trying out new foods and wines. So coming on a Wed for the wine tasting of 4 wines for $7 plus tapas foods fits me perfectly. And the servers are very helpful in suggesting new wines to try.  Nice place to hang with friends."], ["Dale C.", "We usually have great food and service but this time we didn't.  Our spread that we ordered with drinks came out after our entries that we ordered 10 minutes after the spread.  One of our entries came out and it was not cooked.  We decided on something else and had to wait about 15 more minutes after we finished what we had on the table.  The dessert was good.  Will try them again because maybe an off night."], ["Gary G.", "Wish the food was goodWe went for a birthday party. The food was really not good good and the service was bad. The prices were high enough for a four star place but the food was more like lizards thicket."], ["Karen S.", "Gervais and Vine is one of those places I might not frequent on my own, but we had a group event there last night and our group was trying something different for dinner.  Gervais & Vine is probably more known for their wine(s) more than anything (they do have a wine tasting might during the week - but cannot remember day / time).  Me not being the wine drinker, I would more than likely not frequent just for wine tastings.Moving onto dinner.  Tappa = apetizers and was not sure if there would have been more of a larger dinner option than what was offered.  Most meals looked small compared to what is probably considered normal nowadays, but also reasonably priced.  I had decided to go for the safe bet and get a pizza.  I was more or less expecting my pizza to be a flat bread pizza (which it might have been - but crust was a little thicker than I was anticipating).  And there was LOADS of cheese on the pizza.  I am not much a a melted cheese person and the amount of cheese on the pizza was more than I cared for.Given the amount of people in our group (around 30), service was fairly quick after our orders was placed (but everyone was ordering when they came in - which was at different times).  There is a room towards the back of the room (where we were last night).  Not 100% sure if this room is used strictly for group events, or could be used as an overflow."], ["Angie W.", "Our server was really nice and he was very down to earth. The atmosphere was really comfortable but had a naturally formality to it. My daughter and I got stuck in race traffic and decided to eat there so we were actually under dressed. Regardless of our attire they were very courteous to us and we enjoyed our meal.We ordered scallops which were tiny but tasty.    We ordered the shrimp spread and it was very good. The fillet was very good. Eggplant fries were not very good- I think they should have used fresh Parmesan cheese and not powdered to enhance flavor. Overall my daughter and I were very pleased."], ["William K.", "My husband and I were not impressed by Gervais and Vine when we stopped in for a romantic dinner and wine. I am hoping that our next visit here will improve our regards for the restaurant, but it will be some time before that happens. There was not anything that overly impressed us, service was slower than expected and the wine did not color my memories of Gervais & Vine in a positive light. The best summation is to describe the pizza we ordered as one of our dishes. The Greek Pizza we ordered was not well cooked and in some ways could be considered soft. The dough just was not cooked well enough to serve as a base for the ingredients nor were the ingredients tasty enough to serve as the toppings alone. With tapas food, each ingredient, each dish, must boldly carry itself with spices and flavors. The flavors here fell flat about halfway through the palate and only satiated our hunger, not our desire."], ["David A.", "Loved this place. My new favorite in Columbia. Went with my daughter and her friend. We ordered a bunch of different dishes/tapas to share. All different cuisines and everything was excellent.Highlights:The flatbread with pesto was very good. The crust has a unique texture and it works!The mussels with chorizo were great. Nice sized portion as well.The hummus seemed to be blended with edamame. Not sure, but it was delicious.Had to get something not so healthy. Been trying hard to stick to my plan. When you cheat it needs to be worth it. The eggplant fries were worth every bite!Scallops were recommended by our waitress. I am not always a fan. These can be fishy. These were awesome. Melt in your mouth.The chocolate cake for dessert was devoured as well.Service, by Roxie, was very good. My only suggestion would be to space out the dishes more. Just about everything came at the same time."], ["The C.", "Amazing service and selection of wine.  We sat outside. The place was slammed but did not slow down the service or attentiveness of our server. Definitely went with her recommendations for food and wine and they were spot on!"], ["Brooke W.", "Great meal here, each dish we tried was good: gambas, Brussel sprouts, the she crab spread, and the meatballs. Plenty to choose from"], ["Catherine T.", "I've been to Gervais & Vine twice in the last month, and I won't be going back anytime soon. The service is terrible. There's a very nice man who I assume to be the manager, who serves as the hostess/bus boy/waiter - basically everything. He clearly needs some reliable help. The last time I was there was for a friend's birthday, we had a table of 7. When we finished our food, we waited so long for the check that a friend had to get up and go find our waitress. To give you an idea, we sat down at 8, and we didn't leave until 10:30p.m. And we all only had 1 or 2 drinks - it wasn't a crazy party by any means. The food is ok - nothing special, at all. The cheese plate is something you could easily create yourself from Publix. I had the scallops last time and they were horrible. They were served cold and I felt like they had been sitting awhile. I love the idea of this place, but it needs to be revamped, badly. There are plenty of better places in town."], ["Elissa K.", "Great date night place! We enjoyed our wine, pizza, crab dip, and moraccan pork throughly!"], ["Jennifer R.", "Don't come here if you're in a hurry.  A great place to relax with a glass of wine and have a few bites to eat.  Delicious! I had a great time!"], ["Tanner B.", "Love this place!  Everything I have had here was delicious and is always topped off with great service!  Usually start off with the cheese plate - there is a funky looking cheese that they have every now and then that is amazing - whiskey cheese.  2nd choice is usually the mussels - the broth I could bottle up and drink it alone.  Finally topped of with a pizza not sure what it's called but it's the one with all the meats.  Lol!  Defiantly a top choice for me in Columbia."], ["Tiffany S.", "What else do you do on Tuesday at 1pm while you're wandering around?The waitstaff and wine are top notch at this location.I don't remember our waitresses name but she has awesome hair and great knowledge of all the different wines on site.We left happy and wine(y)"], ["Vonnie S.", "I stumbled into this place one frosty night as they were one of the only businesses open after SC got hit with a nasty snow storm.  Service was awesome and quick!  I started with their brussel sprouts (delicious!).  They were cooked with warmed feta cheese and a great starter portion.  I followed up with the special for the day/season which was monk-fish with roasted potatoes.  I am huge fan of fish and hadn't tried monk yet.  To my surprise, it was light and it was cooked in a tasty wine and garlic sauce.  The fingerling potatoes were roasted well with the perfect amount of salt.I sat at the bar where everyone (incl the patrons) were friendly.  Because I sat at the very end near the cash register, my chair kept getting bumped as the wait staff went by.G&V is a quaint little place that I'd like to try again!"], ["JP S.", "expensive for what you get.  for 2 it was a wine by the glass x one for each.  3 tapas and one salad... came to $70 before tip.  Yikes.  Left hungry and filled up with a McDonalds Quarter Pounder.  Service was OK, a bit slow and the volume could be LOUD at times.  But would give it a 2nd chance,  Live music on Wed Night as advertised.  Parking could be an issue."], ["Ricardo S.", "This is not really a restaurant, it is a bar place with something to eat. Quality of some tapas are not so bad, the humus,  the cheese. But the crab was just too hot, and the duck is served with some fat on the top ?? Also, the portion is much smaller that  looks on the pictures here, and they charge $14, for the same money you could eat much more in a nice Thai restaurant. Service is not really good, and the only question asked when I was there was if I would like more wine (which meas spend more money). Don't really care about your satisfaction.DO NOT EVER ORDER PIZZA, then you realized in this place, pizza means some bread with some weird cheese on the top, no marinara flavor.In the end same woman that asked if I want to order more wine, Roberta RM Piroleau asked when I was leaving if I was happy. She seems to have no idea whatsoever about I was talking about, she patiently listen to me and gave me her card, asking me to come back. No promise of better service, just courtesy sentences like \"I am so sorry\" reminds, me an operator from a customer service of any call center.I do repeat, this place is nothing else than a bar, with no atmosphere like a Spanish tapas place, just a name and some words written in French (never specify in the menu what they serve you as \"charcruterie\" which refers to a delicatessen store, pork cool cuts, so I prefer not order it, I am sure was a wise decision, because I am sure was a good way to overpriced some cool cut of pork.If you want to get some drinks, go to a regular bar, Columbia has plenty of bars.BIG DISAPPOINTMENT !  DO NOT RECOMMEND TO GO."], ["Jay M.", "Coming from out of town for homecoming we decided to take our group out here after the game. We made reservations about a week in advance and showed up to the restaurant to find out they were closed for a private party. Don't you think they could at least call to let us know so we could make a reservation somewhere else? I assume the service inside would have matched this kind of treatment so we will avoid this place on our trip for the next game."], ["Christopher K.", "This was my first time Gervais & Vine. As a vegetarian, I found a very good number of small plates to be able to make a meal and probably come back several times without repeating too many.  I went with a small party and split a bunch of dishes - as you should when eating tapas.  The food overall was good but I kept thinking that some of the dishes were falling just short.   For instance, the brie plate would have been vastly improved had the brie been baked and served runny.  The stuffed grape leaves were good but could be easily improved by adding fresh mint, currants or toasted pine nuts to the stuffing for a little more flavor pop.  The pizza crust needs to be completely changed and made in house to take advantage of the oven that is boasted about on the menu.   Expect to eat about three small plates per person.  You might be able to get away with two if you choose particularly heavy items.Minor complaints aside, I found the atmosphere festive without being too loud and the wine list very nice.  I'll probably head back within the next month or so to try some of the dishes we didn't order."], ["Jennifer M.", "We ended up here based on the menu we saw here on yelp. As it turns out, it was the wrong menu (somehow, another restaurant's menu shows up instead). However, it was the happiest mistake ever! We were there with a small group for a work event and decided to stay despite the menu mix-up. The tapas were great sizes, and fantastic flavors. Everything we had was amazing- meatballs, shrimp, lamb, duck (my favorite), olives, cheese and more. The wine selection was good without being overwhelming and all-in-all it was a great value."], ["Emily C.", "This place is adorable, very chill and super friendly. We got great drinks and recommendations for places to go dancing. Order the  Moscow Mule and ask for a shot of their home made ginger syrup to go in it. The food is excellent. Highly recommend!"], ["Ethan P.", "First off, I feel I should say our waitress was awesome.  She was attentive and apologetic. She did an excellent job considering how understaffed the restaurant was. We ordered seven dishes but had to cancel one because the service was incredibly slow. Thumbs up for the she crab dip and the spicy gambas. Conversely, the filet mignon and the brussels were mediocre at best. The filet tasted as though it was thrown on the grill haphazardly after being cut. It was dry and boring. The brussels were overcooked and the goat cheese was an unnecessary addition. The bacon worked though. Notwithstanding slow service and a bit of disappointment with some of the dishes the wine selection was quite interesting. Hopefully this was a one-off that won't occur again. Our advice: do dinner on a weeknight for a better experience!   Stay away from the filet!"], ["Damon S.", "LOVE this restaurant! My wife and I are fans of tapas and the food here is fantastic. Very nice ambiance also. Staff is friendly and prompt every time we're there. Only reason I took a star away is because they are a little stingy with the wine, and actually have lines printed on the wine glasses for the bartender."], ["Alli O.", "This restaurant has a very fun atmosphere that would be a great place to listen to a live band and enjoy a glass of wine.  However, it is not a great place to have dinner.One of my friends had her boyfriend visiting from out of town and she wanted to have dinner and go to a few bars in Columbia.  She stumbled upon this place via Yelp and thought it would be a great option.  It would have been if we came to Gervais and Vine for wine or a small appetizer, but for dinner I was incredibly disappointed.  My husband and I ended up paying more than we would have more a normal dinner on a few bites of food!  (And my salmon was not cooked all the way through!)If you are looking for atmosphere and wine this is the place to come... dinner not so much!  The garlic-parmesan fries were good if you go!  :)"], ["Sherlene L.", "This place is one of the best in Colombia SC sat at the bar and felt so welcomed! The manager was people friendly!! He sat there an talked to me personally. The food is great. Chefs are also people friendly. I felt so welcomed. Truly great customer service. The way it should be anywhere you go."], ["Adam P.", "Having lived in Columbia for more than a decade, G&V has always provided a consistent comment upon leaving, \"why don't we come here more often?\"The food is creative, the specials are always wonderful, the wine and beer are hand selected and awesome values."], ["Mike M.", "I must say, I've missed this place! About 10 years ago, my job had me traveling in this area a few months out of the year. I got to know the restaurants in Columbia very well! Gervais & Vine was one of my favorites! For the uninitiated, tapas consists of small portions of different dishes meant to share, like appetizers, but the whole meal is that way! Today was a blast from the past of sorts! I started with an Ensalada Verde, basically mixed greens w/ balsamic vinaigrette. Next I tried Grilled Brussels Sprouts with Bacon, Feta and a White Balsamic Reduction. This was a stretch for me because I've never had Brussels Sprouts before. I have to say, personally, that the addition of the other ingredients didn't make it particularly palatable. I only managed to eat two of the ten sprouts! Luckily, the waiter was able to remove it, even though I was perfectly ok with it remaining on the ticket. I had to add Garlic Parmesan fries mainly to get the taste of Brussels Sprouts out of my mouth and rounded out the dinner with Herb Grilled Lamb Chops! Perfection! All in all, it was a very good meal. If you happen to be in the neighborhood, give Gervais & Vine a shot! You won't be disappointed!If wine is your thing (it isn't mine), I hear this restaurant has a very good wine selection!"], ["Richard H.", "Really well done. Very relaxed atmosphere, fantastic tapas, and great wine selection. Not quite like being in Spain but they're trying."], ["Magan C.", "A very cozy find on Gervais Street, perfect for that romantic evening or intimate gathering with friends. The wine list was extensive enough to accommodate anyone's fancy and there was a grape to compliment every entrée. We started with the Costa Brava and it was an exquisite blend of creamy cheese with hints of bacon. Loved it! We finished with the Gambas (be sure to ask for extra bread to sop up the sauce). The Gambas had just the right amount of spice and bold flavors with tender succulent shrimp cooked to perfection. Amazing! Can't wait To go back!"], ["Annie F.", "Delicious tapas I would recommend the gambas-great sauce, the artichoke hearts and the garlic potatoes! Delicious delicious"], ["Swetha G.", "I.had.TWO.foodgasms.tonight. Holy f$$##!!!I've been to Gervais & Vine a handful of times over the last few months but tonight the food was an A++, the best I've had at the place, EVER!  My friend and I ordered four dishes and split a dessert and everything was phenomenal.  The eggplant fries were soo much better this time than the last time I had them.  The crispy exterior and tender and juicy interior were equally PERFECT.  I absolutely loved the side honey yogurt dip and romesco sauce, they both were A-MAZING! I got my first big foodgasm from this plate alone! I also had stuffed grape leaves that were mouthwatering.  The Roman pizza was just as good today as it was when I had it the first time.  The spinach artichoke spread was heavenly.  But my ultimate and final foodgasm came from the Chocolate Hazelnut Torte, which was THE best way to end an already over the top dining experience. I fell head over heals for the chocolate fluffy ecstasy, there's no other way to say it.  Todd my man, you've got mad culinary skills!"], ["Joe G.", "This place is an absolute joke. My first experience at Gervais & Vine consisted of many different plates of overpriced, undersized, and mediocre (at best) food that was shared between a group of six friends. We came for \"jazz night\", which was listed at two different times on the menu and website, but that wasn't an issue since there was no jazz anyway. Our waiter told us that sometimes they play jazz over the sound system, but that there hadn't actually been a live jazz band in a long time. When asked how their sangria was (it is watery, flavorless, no fruit), our waiter told us it would \"get us drunk\", and while we were all pretty taken back by this unprofessional remark at the time, in hindsight- I wish it did. Perhaps then we would have been intoxicated enough to not care about the rubbery, insipid cheese plate and cold empanadas. Our group of friends had multiple Living Social deals between us, so we all fought over who could use their's on the check (only 1 per table), because nobody wanted to go back. Unfortunately, I did not win that battle, so a couple of weeks later my girlfriend and I went back to burn the Living Social deal on some wine and dessert because how bad can that be, right? Bad. It can be real bad. After a brief glance at the uninspiring, grossly overpriced wine menu, we decided on ordering a couple of glasses of port to go along with dessert. Being a fan of both the Sandeman Ruby and Sandeman Tawney ports (which they had listed on their menu), I asked our waitress how the Sandeman Reserve compared to the two. Laughing, the waitress told us that she has no idea, because \"usually, people don't ask about the dessert wines so we sort of just pour them whatever\". She said that she wasn't even sure if they actually had those wines in stock. Nevertheless, she went in the back to see if she could find out any more information on it, and came back with a sample for me to try. She said they did not have the Ruby nor the Tawney in stock, and the wine I was about to taste wasn't actually a Sandeman Reserve, it was \"something else that they just say is Sandeman\". After I asked what wine it was then, she went in the back to fetch the bottle, came back with it, placed it down on the table, and said, \"this one.\" For dessert, we ended up ordering the almond joy bread pudding, which was miserable as well. If you are looking for a tapas style restaurant in Columbia, do yourself a favor and go elsewhere. 116 and Mamas and the Tapas are both better options, as is just ordering a few different things from the McDonald's dollar menu and calling that tapas."], ["Anthony D.", "I am waivering between 3 and 4 stars.  I ended up with 4 because it was a cool place with friendly people.  But it was the pianist on site was so unbelievable talented that ultimately I have to go with four stars.  I wonder if the bar knows how good he is?!Started with a mixed green balsamic salad with Gorgonzola, strawberries and spiced almonds.  Excellent! Something so simple but was perfect!  Olives were great.  Flatbread was doughy and tasteless.  The pizza looked great on the menu.  700 degree stone oven, etc. Call me a fool for ordering pizza in SC.  It reminded me of airport pizza.  I guess I expected a thin crust, brick oven charred pizza.  Nice wine and beer selection and outdoor seating too.  I'm sure there are better places in town but worth a try.  Just don't get pizza if you are from NJ or NY like me."], ["Thomas V.", "I came once with friends and shared a bunch of tapas and a bottle or two. The wine pricing and selection is OK. But the food is poorly executed. It's one of those places that looks nice and doesn't taste bad but you leave wishing the ingredients were a touch better and the preparation was much better. Not a bad place but I would only recommend it if you are looking for a new place to try. Hopefully for you it turns out a little better than me."], ["Jeff B.", "What a wonderful owner.  I love to sit at the bar and have some small plates.  I am really excited that they are now open for lunch.  I look forward to returning soon."], ["Sam T.", "Tapas Tapas Tapas...wonderful Tapas.  They aren't like spectacular, and they certainly aren't for someone who is hungry.  If you are hungry...maybe...go to another restaurant.  If you are enjoying a good time with friends or family come to Gervais and Vine.  I have had better Tapas before, but any of their meat courses are very well prepared.  A decadent duck, fantastic fillet, and scrumptuos sirloin.I personally do not want to watch someone prepare my food, and that is what happens at this restaurant.  I also wish they had a risotto option or more pasta/rice options.   All in all...they are okay"], ["Jennifer B.", "I really enjoyed everything I tried at this restaurant. Great vibe and nice staff :)"], ["Emery E.", "Wow! Having lived in Columbia for only 6 months we finally found our spot! My wife and I get out about once per month to eat childless. We were suggested this restaurant to eat at, and they more than delivered. We love great wine, and they had delicious wine at great prices. The food was well prepared, and delicious. On top of that the atmosphere was brilliant. Not your quiet  whispering kind of place, everyone in the restaurant was having just as enjoyable of a time as we were. We typically go out and spend a lot more on subpar food, so it was a relief to have great food, great wine, great service, and a bustling atmosphere on Saturday night and spend less."]], "Liberty Tap Room & Grill": [["Willie D.", "MY 1st time here and waited less than 12 minutes for a table, waitress was friendly and knew the menu very well.We ordered 2 apps fried calamari and veggie sticks. I had the Black Angus comfort food meatloaf with mashed potatoes and brown gravy it was one of best loafs I had ever tasted! Moist not too salty and full of flavor.My friend had the shrimp alfreado pasta with huge shrimp and pasta noodle again, just full of flavors. To sum it up great service great flavors and a nice place to hang with friends and family. The prices are average for places like this....ENJOY!"], ["Aaron S.", "UPDATE: Excellent floor coverage. Conner took care of the table efficiently and glasses never ran dry for too long even given the fact that I empty cups quicker than the server usually walks away. Pleasant visit with good food."], ["Cody A.", "I am only rating the food at this place. I picked up my food and ate it in my hotel next door. I had A steak sandwich which was their attempt of a Philly cheese steak but it turned out to be a bunch of burnt meat on an oversized hot dog bun. there is a difference between a seasoned grill and a grilled that desperately needs to be cleaned.I also ordered 10 chicken wings which was a mistake. They looked like they were sitting on a hot plate for 10 hours and tasted even worse. Wings were small and very dry. I ate two then tossed them in the trash. Finally I ordered a meatball for my son to eat. when I tasted it the meat was very loose and tasted like dog food and Yes I know what dog food taste like. The best thing about this meal was the after dinner mints . i've only eaten there once but I strongly don't recommend the liberty."], ["Carolynn R.", "I have now had dinner and brunch at liberty and was blown away by my experience. For dinner we came in with a group of 11 and got just as good service as if we were a small group. The staff was all very attentive and On spot with service. Good was great from the tuna to pizza to the club it was all done very well! Brunch was way to good, Benedict was amazing, burrito, steak and eggs everything was wonderful!!! Service again was spot on I am very happy I recommend liberty to everyone!"], ["Tejas P.", "Ordered liberty chicken sandwich with fries. The fried looked and tasted old. Sanwich was ok. Its near my workplace so might go once a month."], ["Zohra B.", "Nice little place in downtown Columbia. Enjoyed the ambiance of the place, Very nicely laid out with booths and ultra long bar area. Really cool statue of liberty with little colored glass pieces to decorate her to look like the SC state flag. Very cool!!! Insane list of beers on tap. Seriously - it was a bit overwhelming. But I soon found a few that I was able to try and liked. I just recently started to venture out and try new beers, so I loved that they let me have a small taste of whatever struck my fancy at the time till I found one to stick with. We split the Club sandwich, and it was delicious!!! Half of it was more than enough for one person. My son got the chicken fingers, and the serving was as large as the regular adult servings. You do have to ask for the kids menu, bc they do not have a specific menu for you to look at. They just kind of recite the kids stuff. Would be nice if they had like a little thing for him to color or draw on or something of that nature. All in all, i really like the place and we talked about coming back next time we are in the columbia area. I am looking forward to trying the one here in Mt.Pleasant to see if its also as great."], ["Megan B.", "We came here for dinner on a Friday night. Started out with the fried zucchini and they gave us spears that seemed to equal three whole zucchinis. They were great and a lot for the money! I got the meatloaf stack and it was really good. The portion size was huge and well worth the price. My friend got a salad and the other got the bourbon chicken. They both liked theirs as well. It is a solid spot for dinner. Service was kind of slow and she forgot a few things. My friend also asked for a bloody mary and was given a bloody maria (vodka and tequila are very different)!!"], ["Caitlin J.", "Had a late night snack and drink while in town, very tasty! Also, had brunch - pretty good! Those mini muffins were really tasty!"], ["Tianna G.", "My absolute favorite eatery in Columbia, Sc. I've always received excellent service and food. Any one who has or will visit me is taken here for the shrimp and grits! Love this place."], ["Kafid K.", "Amazing filet! Great dessert! Good wine"], ["Brett J.", "Half sports bar & pub, half classy restaurant.  This is a great go to place if you need either a place for buddies or for a date.We came here for a military-related event...which mainly involved drinking.  I didn't have any food here, however the dishes I did see going to other patrons looked pretty good!The bar-staff was great.  They definitely put up with my flirtiness.  (it does help them remember you) :)  The back pub area was pretty large, wood-built, and had plenty of flat screens for the game watchers.There were also a ton of booths and a long bar area in the middle of Liberty for the more intimate sports watchers.As the night went on, we saw a DJ setting up tables in between the booths and long bar and started playing today's top music.I'll have to come back to try out the food and update this review, but from what I saw it was a great place in a great location!"], ["Robert P.", "Bad Food, Bad Service with an Attitude - Go ElsewhereI went there tonight for a nice meal as we had good experiences in the past. First, it was demanded that I present an ID to order beer despite the fact that I am in my mid-forties. We had dinner last night a few blocks away without such a demand.  Very strange. After settling on the sirloin steak, the snarky waitress strongly recommended the New York strip steak topped with pimento cheese as the night's special to be cooked medium to medium well. I received a mess as the steak was rare and bathed in pimento cheese sauce. Further, the steak was a fatty cut of meat. Upon complaining to the manager, he took off 50% of the entree price and apologized. The waitress, rather than showing concern about the botched meal, made excuses that \"they don't cook this steak all the time and the \"cooks are learning to make that meal.\"  How hard can it be?  It is a steak. The waitress could care less about my bad experience. Three co-workers who joined me for dinner were not impressed with their meals."], ["Jason R.", "This place was terrible.  We only ordered appetizers that took 45 min and showed up cold ROACHES crawled on top of the table.  Silverware had food on it.  Worst place ever."], ["Laddie B.", "As a tourist in many cities across the U.S., I rely on Yelp reviews to find good places to eat when I don't have a local's recommendation. I almost skipped this place because there were a few reviews about time and service (two things that are pretty far down on my list of things that matter to me when I'm on vacation).   So, I tried Liberty.  Fabulous food!  Everything from the salad to the entree was fresh and well prepared.  It is obvious the chef cares about taste and quality.  I also found the service was good and the time not unreasonable.  If I had 30 minutes for lunch, I would be very careful about what I ordered, but if not, and I lived in Columbia, I would be a regular here."], ["WanderLustinDani P.", "The food at Liberty's appear simple, but the flavors have basic taste. Presentation of the food was great. A host of items on the menu, offering something for the whole family. The shop is both clean and tidy, having plenty seating space and a nice bar. Staff members there greeted us when we can in, but no good-byes or Thank U when we left. I would give this restaurant another chance and try a different item for sure. I know I'll certainly be returning soon."], ["Lee C.", "I own a salon right down the street and we ordered great takeout yesterday. I had the smothered chicken and my stylist had the bbq chicken pizza! It was great!"], ["Martin G.", "Spec grill and bar. The strawberry spinach and shrimp salad was good but common. Good wait staff in bar. Big place with lots of room. Sports and classy too."], ["Karen S.", "I went here last night with a group of friends for my birthday dinner.  I was going in not knowing what to expect.  We were heading to another business in the Vista after dinner, so I was looking for something in the Vista that was reasonably priced.  My one friend had made a reservation for our group.  Good thing if you have a party, you do not have to worry about waiting a while for a table (especially on Friday and Saturday nights).  Only thing is they will seat you only when a majority of your party has arrived. Also, parking might be a pain (again especially on weekends) since there is limited parking in front of restaurant and there is quite a few places in that general vicinity.  Liberty does offer free valet parking.We had sat down and ordered our drinks.  Me and one of my friends had ordered water.  She noticed in her glass something funky in her water and my glass was severely cracked.  Our waitress did replace drinks.  Food was OK. Nothing over the top.  Really only other complaint was that either they need to up their AC or invest in ceiling fans.  It was getting quite warm towards the end of dinner and had no way of keeping comfortable."], ["Mike L.", "What can I say... Roaches, cold food, terrible specials, ignorant, fat, balding manager, lame service and awful mixed drinks. But roaches... For years. Ridiculous."], ["Emily R.", "One of my favorite restaurants in Columbia! The brunch blows me away every time. I've been over 10 times and have yet to be disappointed."], ["Colman R.", "The brunch here is crazy good! Also, before/after the world of beer festival, this is a key location to meet up for dinner. Order the Bloody Mary. You'll be impressed."], ["Matt S.", "Pretty amazing place.....great place to get some food and do an obscene amount of shots. And I'm about to steal that waitress savannah from her boyfriend...."], ["Anthony N.", "I ordered the smothered chicken with garlic mashed potatoes and green beans and the chocolate cake for desert. The chicken was good quality the sauce was amazing the potatoes had good texture and flavor. Chocolate cake was good but not quite my style will definitely be returning ordered on a friday night quick service and hot food."], ["April C.", "Finally, a review for dinner time! My friends and I ordered a lot of food and most of it was pretty delicious. To start: blue cheese chips. These are freakin' AWESOME. Another establishment also does some pretty tasty cheese chips but these reign supreme. The chips stay crispy and the sauce is perfectly velvety. I got the Caesar salad with salmon. The salad was fine but the salmon lacked any seasoning, although perfectly cooked. It just didn't taste like much of anything. My friends enjoyed the chicken chili and the BBQ chicken pizza. For dessert, we ordered the turtle cheesecake which was delicious...once we were able to break the top apart and subsequently also broken the cheesecake into a big ol' mess! It was actually a hilarious scene to behold. In the end though, it was delicious and well worth the effort!"], ["Stephanie F.", "Yum! Awesome unique beer list. Delicious food. I had the shrimp salad but with chicken and my family tried to steal it it was so good. River rat ale- on point!!"], ["Winston L.", "What can I say...This place just doesn't have it.We tried coming here as a group of about 18-20 and they wouldn't seat us at the same table or modify the configuration to at least get us near each other, mainly because they didn't want to affect how much tips each server would get according to the table layout.  They placed higher priority on how the servers were assigned then just simply seating us together. Terrible, and they were uncompromising and short with us regarding it.  All I wanted to do was sit with my friends but I got stuck alone on my own table. Gee thanks.Second, it took us over an hour to get our food. Everyone else at the other tables of our group (refer to paragraph above) got their food even though we ordered at the same time.  Then they had the audicity to say it was on its way, 30 minutes before it actually came out. I wanted to cancel my order but the manager came out and said it was \"on its way\". Five minutes later I got a cold uninspired crab dip that is nothing short of a culinary abortion.Only plus side of this place? That there is a large sign out front so at least I can see it from far away and thoroughly avoid it."], ["Michael D.", "Very nice selection of beers and some excellent food.   I had the shrimp and grits and they were as good as any I've ever had.   Everyone I was with said their food was just as good.   Took a bit long for the main course but the friendly waitress kept us topped off with water and drinks while we waited.   Definitely worth another visit."], ["Shawn N.", "We made reservations as a group, and had a few additional tag along, but they wouldn't let us sit together. Reason: they wanted to split up tips. Then, it took them over a half hour to take and deliver our drink orders. So, I ended up just going to the bar. Reason: the waitress was waiting other tables even though there were plenty of other servers standing around with empty tables. Finally, it took them two hours to get us all our food orders! Then, when we complained did they apologize or offer a comp? Nope. They only gave excuses. Reason: they split our orders and inserted another large group's order in between, and apparently they are more worried about immediate profit instead of repeat business.Additional note: my \"medium\" ribeye steak was still raw in the middle. And if you order it with mash potatoes, they serve it on top like meat loaf. Who does that? Ghetto!Not coming here again, and neither are any of the several hundred other soldiers that I have the ability to influence. Nice job Liberty!"], ["Stem E.", "GREAT beer selections - thought it would be just their own brewed beers like in Myrtle but it was much, much more.Service was not as quick as it should have been even though we were a party of 14. The place was near empty. My friend ordered meatloaf, which I wanted, but settled for Steak and Cheese, and right as all our food was coming out, Server came and told him that they were out of meatloaf..Odd that they waited until the food was coming out to tell us that. He ordered something else, which meant he had to wait for his meal, but they did comp it so....Food was ok...nothing back, but nothing that stood out."], ["Dean H.", "Excellent food in more or less a sports bar.  We had lunch on a Friday and it was not busy.  Calamari app was not rubber and was excellent.  Liberty Club had real chicken. Asian tuna sandwich was great. Sweet potato fries are crisp and a must try.  Mediterranean steak salad was excellent.  Obviously the beer list is huge, diverse and good.  Service was great."], ["Jennifer B.", "Not being from South Carolina we ventured into downtown Columbia and went here for dinner. Meal was decent. For an appetizer we had the chicken nachos. The folks I was with had the meatloaf that was very good. Service and price was good.  Lot of beer to choose from.  We will probably come again!"], ["James N.", "If you come here, get the meatloaf. It'll be your lunch the next day too because it's huge! Excellent beer selection and great bartenders. Servers are hit or miss, so I always sit at the bar. Happy Hour apps are a good deal and this is a great place for a business lunch, happy hour or dinner. Sunday brunch is great but it gets really crowded."], ["Chris S.", "Good food, and be sure to order beers off the chalkboard where there's a list of 5 or 6 cheap ones they're getting rid of. Service was bad at the bar, but decent in the restaurant."], ["Josh W.", "The food is pretty good...But the real reason I go is for that smokin' server. Savannah? I think that's her name. I would give her a big tip anytime!"], ["John F.", "We did not go to the bar, but it did look like a cool place to hang out.  By the time we left, the bar was jumping with 25 to 40 year olds.  We did eat there and I will never go back there again. We sat down, the waiter took our drink order, he had to come back twice because they did not have the drinks we ordered.  We order nachos for the table.  As soon as they were delivered I asked for plates and silverware. After a few minutes. I asked another waiter for the plates and silverware, then after more time passed I asked a third waiter for plates and silverware.  The nachos could have been good if they just put my chips on the plate.I ordered chicken which was dried out, my wife ordered a steak which she said was ok, my daughter order a burger which she said was average and my other daughter order BBQ pizza which was actually great.  The place was cool, the bar looked great, the service was terrible and the food was ok at best!"], ["Thu D.", "Great hangout place for a Friday night. I love their mix drinks - they are not stingy on their alcohol unlike some places."], ["Swetha G.", "This was the first place that I had brunch in Columbia and it was everything I was hoping it would be, and more. Hallelujah! I almost didn't go to Liberty b/c of the average 2.5 star rating on yelp. Almost! What a relief that it exceeded expectations! Service was very good from hostess to waiter. Everyone was professional and friendly. The place is pretty big and from the entrance you can be seated in the left section or to the right (which is closer to the street side), both large and roomy. We fortunately got a table on the right side near 2 tall windows and enjoyed a lot of natural light and a downtown view. Big points in my book. I love brunch with natural light, it gives me endorphins! As for the food, I was happy with it. They start you off with a very cute basket of mini muffins with butter. These bakery treats are fresh, warm and melt in your mouth! For my drink I ordered a coffee, which was brought out in a HUGE mug, the size of a soup bowl. Also a plus! For my entree I got the florentine benedict which comes with a choice of potatoes or grits, I got the grits. The benedict was good, basically it was about average. The grits on the other hand were really good. Our waiter said something about how they're made in the factory next door and are very fresh. He was right about that. Even though it was super filling I cleaned my bowl and had it all! As for money, I consider this place VERY pocket friendly. Considering the volume of food we got, plus quality service, my total was only $9 and change! With tip, I shelled out just under $13. Not bad. Not bad at all!"], ["Geoff G.", "Good flavor...lousy service on a night when the dining room was 1/4 full. Ribeye was cooked just right but the mashed potatoes were coldSalad was late. Beer was late. One of our orders was messed up. Yelp tried to warn me but I didn't listen."], ["Rodell N.", "It's a really nice sports bar/pub.  The bloody Mary is awesome, it's  almost a meal by itself. The food and atmosphere is really nice to listen to jazz with brunch,  watch the game or impress your date with a nice dinner. It's an all in one spot:-)"], ["Kristen M.", "Bleu. Cheese. Chips.  Do you know how delicious bleu cheese chips are when you're hungover?  Nothing goes better with one of their bloody marys... nothing!  I went for both brunch and a late afternoon lunch, I'll be honest, the lunch drops it down a star or two.  The service just wasn't as good as the brunch, which I'm not really sure why... At any rate, BCC and bloody mary were awesome, I also had the french toast, which was absolutely delicious.  Light, fluffy, perfect amount of powdered sugar... If you want some welcoming Sunday morning comfort food, this is absolutely you're place!  If you're coming for the rest of the food, I'd go elsewhere."]], "Fancy That Bistro & Catering": [], "Flying Saucer": [["Katie F.", "Every time I come to Columbia I've hit this place up. They have amazing food. The burgers are creative and delicious. The first time I came I had the Miguel burger. I loved the mix of flavors in it. The con to that selection though was that it was very messy. A large portion of the toppings fell out the bottom when I bit into it. My coworker and I also ordered the German pretzels. They were outstanding! I have no idea if they are frozen or baked fresh but regardless they were great. They also gave generous helpings of dipping sauce as well. Kudos for not skimping out on the cheese sauce! The second time I got the Hippie Burger. I asked for no bun and they still gave me one. I told the waitress I wasn't going to eat it, i felt really bad wasting food when they brought it out to me with the bun. Other than that though the veggie patty was really tasty. The beer selection is also really great!"], ["David B.", "I really want to like the Flying Saucer.  I've been here several times, and keep hoping it will be better the next time, but I think I've seen enough to understand what it's all about.The beer selection is great.  I enjoy trying new beers and styles that I am not familiar with...and that leads to why I am only giving the restaurant 3 stars.  The servers are generally not that knowledgeable about their offerings.  I recently went, and was interested in one of the special drafts.  I asked the server what style it was.  Her response was, \"I have no idea...I can bring you a sample.\"  Several other times, I've asked a server or bartender about one of the specials, and have almost always gotten a similar response. The servers are friendly, but in a place that bills itself as a beer bar I would expect them to know if a special pour is a pilsner, an IPA or a stout, at the very minimum.The food is, for the most part, solid bar food, especially if you stick with familiar things.  The burger/fries combo is good.  I'd love to see more interesting toppings available.  The banh mi is only a rough approximation of a Vietnamese banh mi, and is not a particularly good variation.The atmosphere varies.  I like it when the bar is relatively quiet.  On weekends, it can get pretty loud and full of \"frat-boy\" types of all ages.  Last night a guy dropped his beer, breaking the glass on the floor..  The whole place was looking his way, and he felt the need to hold up his hands and shout out \"Nobody say a f*$#ing word!\", which only drew even more attention his way!  The patio is nice in cooler weather. Flying Saucer is a chain bar/resto with a good beer selection.  If you do your homework before you come (so you can order something interesting to drink) you can have a good time here.  It's probably a good place for a large rowdy group, that's just not my scene."], ["Brandon D.", "We came here for drinks after eating out.  We decided to sit on the patio since it was such a nice night. However, it shouldn't take over 15 minutes for me to get a beer.  We looked around inside and it wasn't even that busy.  So we are not sure why it took so long.  And our server never bothered to check on us other than to bring us our check.  Overall, wasn't really impressed by this place.  I will give it another chance though."], ["Marianna D.", "I've been a server for 10+ years, and I know we all have our bad days, but the service I received today was absolutely terrible. We were \"greeted\" with a \"hold on I'm busy I'll be with you as soon as I can\" which set a bad tone from the beginning of the meal.Our server got our order wrong, didn't listen, and never brought us plates. We didn't have silverware when our food was brought out. I had brought my family who is from out of town there thinking it would be a great local spot, and we were really disappointed with the quality of food as well as the service. All in all, bad experience that was not worth the money. I will not be going back anytime soon."], ["Mark L.", "Take a unique name for a bar and grill, add over 200 different beers, a beer club, waitresses clad in tattoos and plaid skirts, a large outdoor seating area, open spacing, great pizza and fondue and what do you get?.....Drum roll please....Flying Saucer.Red deserves a shout out.  One of the best waitress/server experiences I have had in a long time.  She gave my friend who ordered unsweetended tea, the choice of sweeteners.  She let us sit and relax, checked in periodically, gave great detail in describing the food and was extremely polite and attentive.  She alone made the experience so worthwhile.Outside on the patio is fun people watching and great historical and political murals.Inside are hundreds and hundreds of plates with dedicated drinkers who have drank over 200 beers or more....Enjoy the fondue, fries or pizza.  All excellent comfort foods and great prices.  Visit the State House while you are nearby."], ["Bettina S.", "If you're into beer, this is definitely the place to be. They have a huge selection and a nice variety of seasonal options. If you want decent service or food, you might want to skip it. I sat alone on the patio. There were about three other parties there when I arrived, and two waitresses working the patio. It still took 10 minutes for someone to even take my drink order, which was done with an attitude. I ordered a burger and fries, which should be easy enough. The burger was horribly dry, the tomatoes were over ripe and mushy,  and the fries tasted like off-brand freezer fries, which were also terribly dry. I tried to get my waitress' attention to ask for some ketchup or anything to save the burger, and I was ignored. In fact, the only reason I got my server's attention was because another customer pointed out that I was trying to get her attention. There aren't many options in this town, but I still would rather go just about anywhere else for food."], ["Shannon K.", "Dropped in for a beer at Monterrey with friends, and afterward walked my husband back to his car by Starbucks. When I got back, Monterrey's or one of their crony partners (Flying Saucer, or Mamas and the Tapas), had decided to tow my car. I can appreciate the need to be judicious in guarding the limited parking downtown, but this ultra-liberal approach, aside from being wrong, cost me $135, damage to my car's front bumper, and driver side door. I would highly recommend anyone visiting downtown for an evening out to frequent any of the other Vista establishments that are more customer friendly and welcoming to their patrons. Recommendations - Cola's, Ristorante Divino, Pearlz, and Nonnah's in particular.To be avoided - Flying Saucer, Monterrey, Mamma's and the Tapps"], ["Jeffrey C.", "81 taps and hundreds of bottles to choose from. Drink 200 different as a UFO memeber get a plate/saucer on the wall! Taps always changingGood food and a new menu just posted"], ["Lauren O.", "Whoever's idea it was to put bratwurst on a pizza is a freaking genius!This has been one of out favorite go to happy hour spots for years. There have been a lot of changes to the menus over the years and we've never been super impressed with their food (besides the pretzels & bratzels) but we had the pizza today & it was perfection. We got brat & arugula and then kalamata olives on half and toasted red pepper on half. The crust was thin & crunchy, the sauce was delicious & the toppings were plentiful. As mentioned before, the pretzels are fantastic (with ranch, queso or spicy mustard). But the bratzel is where it's at. Sliced brat on top of a soft pretzel w melted cheese (my mouth is watering). The beer menus is plentiful an always changing, just keep an eye on the prices (some are up there)."], ["Johnny H.", "Few beers there before a concert. Great service and beer selection. Must have the pretzels with mustard."], ["Will C.", "Just a bar review: the beer selection is spectacular and the prices aren't so bad. Their specials are good during happy hour and the service is usually on point. The crowd is definitely a bit better than the bars in five points but it definitely has more students than some of the other vista bars. This place is great for people that want to have a conversation with a group of friends instead of the deafening bump and grind of other places. Expand your beer tastes here!"], ["Canita C.", "A co-worker and I went to Flying Saucer after work one day. For me this is a great place to unwind. I enjoy drinking beer, and better yet, trying new beer. I really love making my own 6 pack at places like Total Wine and World Market.  Apparently I'm not the only one. This place was packed to the gill, but... there was no wait! We actually ended up sitting at this long bar table thingy. This is pretty cozy for meeting new people.We both ordered a beer sampler. The one we ordered came with 5 - 4 oz samples. I ordered french fries. I love french fries, but I was shocked when I was delivered an order of shoe string fries! I was shocked, but pleasantly surprised. They were really good. My co-worker got the pretzels. They were delicious as well. We asked around and everyone one was enjoying the items they ordered. They have a pretty great menu, there is something for everyone.Bottom line, I would recommend going.  I would go back again and invite a friend. You're going to enjoy the selection, the company, the service, and the decor!"], ["Brian S.", "Great ambiance, with plenty of room to socialize. I've lived in Germany for 6 years and this bar/restaurant rang authentic German to me. The decor is awesome and the service was good. I only had the soft pretzel, so I can't really speak about their quality of food. Their menu has a wide variety of items. Overall very nice, and I do recommend it if you want to just hang out with friends and sample a wide range of draft beers and ales on tap."], ["Lisa S.", "Even though this is a chain, it always feels like your very own local bar. There is always a great fun atmosphere with an amazing beer selection. The food is of great quality as well."], ["Arden S.", "Been a while since I've been here but when I have its a chill environment. Known for its many beers, haven't eaten there in a while so couldn't tell you about the food. If u r looking for a chill place to start ur night with friends I'd suggest this place. More of an older atmosphere there alot."], ["Charlene R.", "Great food! Amazing selection of beer! Service was wonderful too! I had the prosciutto and arugula pizza, it was perfectly cooked and seasoned well with a balsamic drizzle. Perfection:)"], ["Matthew B.", "The Flying Saucer is a great place to grab a beer and relax with friends. They have ample seating and the place is almost always busy.The beer selection is overwhelming! If you're indecisive, this isn't the place for you. They offer flights of beers too, in case you're in a sampling mood.The food is your basic bar food. The burgers are solid and the pretzels are big and hearty! The staff is friendly (and usually pretty quick..., there are exceptions though) and the atmosphere is noisy. What else would you expect in a bar in the state capital?"], ["Austin M.", "We came here after a great concert to grab a few drinks before heading out.  Really cool environment with an awesome beer selection on the menu.... they didn't have the beer on the menu I wanted but that was understandable.  What wasn't understandable was our waitress giving absolutely terrible service.  Not only was she extremely inattentive,  but we had to order drinks and food multiple times just so we could get some nasty watered down queso and corndogs with obnoxiously strong mustard. I'll make it back here eventually to give it another shot if it happens... but I would be totally fine with never coming back here."], ["Robert F.", "I love this place!  So similar to the FS in Kansas City it contains plenty on tap, friendly service, and a comfortable atmosphere.  I was slightly disappointed in the plain-ness of the menu.  But it is a Bar that serves food and not a restaurant."], ["Monica R.", "We really really really liked this place. The food was good and allows you to be a little adventurous. We had the pizza with prosciutto  and arugula, Sheboygan side by side beer brats with the rocket tots. The brats were perfect and the tots reminded me of my childhood. The beers were great although they were out of our first three choices. This was a little odd as we went on a Saturday around noon. My favorite thing about this place was the outdoor seating. So laid back and a great place for groups or large parties. This is one of those places you want to take any friends or family to when they are visiting Columbia. Explore the menu and don't be scare to venture off but don't forego the tots! You've been warned."], ["Jessica T.", "So far, we really like this place. Tuesday trivia is a regular for us...haven't been there any other day of the week yet. Their pretzels and queso  are exquisite! The beer selection is overwhelming, but great for those that enjoy a vast selection. Their food menu offers a little something for everyone (burgers, chicken, vegetarian). I didn't enjoy their reuben so much, it was pretty dry. But their burgers, saucer dipster (french dip), turkey meltdown and hippie hollow are tasty. Their fries are great. My friends have had the beer cheese bread bowl and really enjoyed it. Their ranch is my fav...the salty, savory, yummy stuff. The customer service depends on your waitress and how busy they are. Hit or miss."], ["Adam B. J.", "I've been know to swing by Flying Sauce from time to time.  I go for the beer selection, the darts, and the pet friendly porch.  The food isn't the best I've ever eaten, but they have an appetizer here and there that is worth ordering.  They have an incredible beer list.  Broken down by nationality and type of beer and they have a ton of taps.  The waitresses are dressed little classier than the Tilted Kilt, which isn't my thing really, but there are definitely customers that seem to come for the eye candy.   Speaking of service, your best bet in my opinion is sitting at the bar."], ["Robert N.", "Very large selection of draft and bottled beer. Service was fast and the beer was pretty good. A frosted mug would have been nice. Very few T V sets for sports events. Limited menu. Basically a place to sit around and get drunk on beer."], ["Scott A.", "Had a very good meal here. Kale salad and the arugula pizza was really great. Would highly recommend that you try it. Also, plenty of free parking.  Overall a very good place with good service.  Nothing to complain about at all!!"], ["Rachel C.", "Meh... That's how I feel about this place.It was packed with a full house of trivia players so we sat outside. The server wasn't the best, because I think she was in the weeds with all the people inside. So the drinks came slowly, and then the second drink I ordered never came. I wasn't very compelled to order anything on the menu, so I settled on a boring chicken tenders basket, with mediocre fries. I totally choose wrong. Because our table-mates ordered a fondue appetizer, which came loaded! The cheese was awesome, with a kick of spice when paired with the warm, soft pretzels. Too bad I didn't order that, I just stole it from others. Oops."], ["Anna B.", "I've been to Flying Saucer probably ten times now, and it's a very solid place to go with friends. I've found that it's loud but not TOO loud to have a conversation, and most of the time it's easy to find a table. This is a good place to go if you want some quality beers but don't want to risk having to stand up at the bar.Trivia on Tuesdays is awesome! The questions are hit or miss, but it's a very popular spot for the game. Food-wise, it's pretty legit. I'm a gigantic cheese fries fan, and I must say that they could afford to put a little (read: a lot) more cheese on theirs. Apparently they make their own ranch dressing, and though it's not as thick as others, it's very tasty. The au jus sauce for their roast beef dip is tangy aka excellent. My boyfriend always gets the spinach and goat cheese salad and he basically worships it. Parking is decent because it has a back lot. BEWARE though, my car got towed the other day because we briefly flirted with the idea of walking down to World of Beer (we didn't), and it got towed the second we left the parking lot. I know it's not Saucer's fault, but it really sucked.All in all, it's a good place to go with friends and get the conversation flowing."], ["Steph B.", "Visited today for the 6th or 7th time. Still excellent! The menu changed a little bit, they have a new loaded version of the rocket tots but you can still order the original basic version with the habanero sour cream. So delicious every time! Tried the new 3 cheese and bacon grilled cheese with tomato bisque. The grilled cheese was great, bacon was perfection, the soup was lack luster, tasted like it could have been from a can, but all I wanted was the tots and grilled cheese so didn't matter to me. My friend enjoyed her burger. Will be back soon!"], ["Mark A.", "Had lunch here today with my family. Everyone was happy with their meal. Good choices on the menu, fair prices, and good service.  They have a boatload of beer choices and run specials each day. Great choice for a tasty meal in a casual restaurant in Columbia.  Well worth a visit."], ["Sean B.", "This place is fantastic. Reasons why:1. Huge draft beer list. Dozens of options.2. On Mondays, those draft beers are all $3. Normal price? 5-6 bucks. Not bad! Anywhere where I can get a quality craft beer for $3 is more than likely going to get 5 stars in my book, especially when you add in...3. A big patio area where dogs are allowed (even though I don't own a pet and am not gung ho about them).4. Quality service. 5. Decent food. Well at least the chicken tenders were, don't know about the rest of the menu. No complaints whatsoever. I wish a place like this was in the DC area."], ["Steven B.", "The waitress trina insulted me and said that me and my friends couldn't afford this place"], ["Joshua R.", "Food: 3Drinks: 4 (in the top 3 for largest variety of alcohol)Atmosphere: 1 (acceptable for its character, but gives me the willies) Staff: 3 (attentive, but skimpy outfits)Overall impression: You better love beer.I can dig the idea of Flying Saucer and completely understand why people join the beer club. If you like sports and beer, there is no better choice in Columbia. But if risqué outfits or a loud, American atmosphere bother you, then steer clear. Flying Saucer. I sat inside only the first of the six times I've been, and MUCH prefer waiting for a table outside; No TVs outside, much quieter, and less distracting girls walking around. The menu is mostly meat heavy dishes, but a vegetarian like myself can enjoy several non-salad choices as well. If you're looking for a boys club, this is your spot. If you're looking for a family dinner or a date, take a pass on this joint."], ["Simon T.", "I'm not a beer guy,which made it stupid to go.Decent sausage, though."], ["Peter A.", "First time in, and genuinely blown away by service and knowledge of bartender.  Her name escapes me (shame on me), but she was engaging and knowledgable.  She and the service just made this my lunch spot.  Kudos."], ["Colman R.", "Great place, sometimes the service is excellent. Some of the veteran staff there make it a really enjoyable experience. Drinks are expensive, but better than most other places will price them at, unless you're drinking light beer domestics. Then five points is more for you. I feel the do that for a reason. *clap clap*"], ["Miguel D.", "Great food, friendly staff and good prices. They have military specials everyday, just make sure to ask for them. A must visit during your stay or visit in Columbia."], ["Jason N.", "This is a more than decent place to go to try some of the over 250-300beers they have with weekly beer specials as well as a multi-facited menu selection. I have had their Brat plate which was pretty tasty. Being of direct German Decent, their attempt at a German potato salad was.... admirable.... but I think it missed the mark on vinegar selection as well as a better bacon. They also have some pretty good sandwiches here as well. It's a good place to chill and relax. inside or out with a wait staff dressed in their sexier version of a Dirndl. overall?.. not a bad place."], ["Corrine H.", "This place is ridiculous. Don't park behind this building, not only will you get towed, but the manager will also be as rude as she possibly can be about it and not vouch for you or help you. There's way other great places in the Vista and honestly it's just not worth it to chance that you may get towed because \"that's what the camera told us\""], ["Jane K.", "Awesome variety of alcohol and my boyfriend signed up for the UFO club 197 more beers to go the food is great!"], ["Emily E.", "Love the atmosphere here and the beer club seems like a fun endeavor to try to complete.  I enjoyed the trivia here, although the questions were much harder than what I'm used to, still a fun time.  Cheese fries were decent but would not recommend the Korean meatballs. I love Korean food so I had high hopes, but the sauce was so sweet as to make it not edible.  The San Miguel burger however looked amazing and I'll definitely give that a try next time I'm there."], ["Vonda D.", "This place was very empty at 1AM when we stopped for food. We ended up getting a pizza which was comparable to Mellow Mushroom! Very good!! Our waitress was extremely nice and helpful. The bathrooms were very clean, which is always nice. I did notice their extensive beer selection upon leaving the bathroom on my way back to the patio."]], "Carolina Ale House": [["Al C.", "To whom it may concern,I look forward to being contacted by your company if you require additional details about this matter.I recently visited your Columbiana Drive establishment on 7/3/15. I asked that my party (girlfriend and 20 month old child) be seated on the enclosed patio in the non-smoking section of the patio. We were promptly seated in that section and served almost immediately by Jennifer and a trainee. Our experience with them was fine. While we were eating our food a couple sat in the table next to us, which was part of the non-smoking area as well. We asked the server to do something about this issue. She informed us she would ask the manager (Robert Stolberg) to address the issue. Several minutes passed and Mr. Stolberg had not come out to address the patrons who were smoking (two cigarettes completed by this time). I got up from my table and asked the server where he was and she told me he would eventually come to our service. I instead went to the back of the restaurant and requested that Mr. Stolberg do something or clear our check if he would honor the non-smoking section of the restaurant due to health concerns. He refused and explained he was powerless to do anything since he was not issues a summons for a non-smoking offense. I was very frustrated and asked one last time if he would do anything for me and my family. He dismissively said he would not. I was upset that Mr. Stolberg did nothing, he didn't even bother to offer different seating to help relieve the smoke bothering me and my party, which included a small child. In addition the table across from us also complained about the issue and he did not come out to address them either. I was very upset about this and his lack of concern with loyal patrons and his dismissive demeanor towards those of us who complain about things that affect our health. I have mentioned this issue to a friend of mine who works at DHEC and city code enforcement since Mr. Stolberg feels he cannot control the issue himself. I told both contacts I would let them know the results of my inquiry via this letter.I am saddened by the response I received from management on this issue. I have been a loyal customer for a number of years! In summary,* Two customers complained about the smoking and the manager did not come out to address the issue, ever and we were there for close to an hour and a half.* I directly brought the matter to the manager's attention and he refused to address the customers who were smoking. I seems to me, If I performed ANY activity deemed inappropriate by management (disorderly conduct, fight, swearing, theft, etc.) management has the right to remove me from the property. By extension, management's lack of action appears to condone the act of smoking in an area in which smoking is not permitted. Please note the area was enclosed since it was raining. Does this mean those who smoke indoors would not be asked to leave. His position does not make sense to me. He never tried!* The manager refuse to accommodate my family or the table across from us who also complained. I thought if he was going to condone the idea at least accommodate me and my family since the smokers are more important. At the time I really wanted one of several things from the manager ask that he address the offending table who was smoking, a comped check for lack of action,  move my party to a different area, etc. none of this occurred!The food is great but the manager I dealt with that day it was not a good experience."], ["M. W.", "This midget manager has put women's soccer on the audio feed. Guess what else is on? That's right....NBA finals. He said someone requested soccer. Seriously what is wrong with this guy?"], ["J S.", "Okay full disclosure the sandwiches and salads are good but the wings are a total fail I had forgotten how bad they were I'm going to make myself a mental note to never eat them again. Buffalo Wild Wings wings are ten times better and cheaper"], ["Jazz B.", "The only reason that I give CAH a 4 star is not because of them...IT'S THE DANG CIGARETTE SMOKERS!  I love the outside bar but when its cold outside and the plastic things are shut and the heater is on...OMG!  Not good.  I did smell like an ashtray. I know it's outside but  it's no longer \"outside\" when plastic is down!Hey, no problems in the summer time...burn it to the cotton if you like.  The windows and fans are on.Love the food and staff...my go to place!!"], ["Shane B.", "Great choice! Loved every sip of my wide variety of brews.  We had burgers like no other today.  The triple B is a classic. It is my favorite. The beer battered fries are the way to go with that classic treat. Save room for the mud pie. You will thank me later."], ["Lindsay K.", "I would say I'm a bit of a regular here. You can't beat an outdoor patio like this. If it's cold the can close it off and they have smoke circulators so you dint leave smelling like an ashtray. Gotta try the fries, some of the best in the Soda City. I would recommend hitting up the outside bar and go see Frank one of the best bartenders I've seen in SC. Great service great food great beer selection.Also one of the only places that is always open and serving their full menu until 2am."], ["Jerica D.", "I have to give them a three because of the excellent service we received..if I had to go off food alone it would be 1 and a half. As soon as we walked in we were greeted at the door! It seemed like a very lively place because the bar and dining area were pretty packed. The hostess talked to us while we waited for our table, but our wait wasn't long. The beer prices were also very decent coming from up north.. Our waitress was also very pleasant and nice.. I order mozzarella sticks and quesadillas -- which I was not impressed by.. Seems as if they were microwaved and the mozzarella sticks had no taste. My daughter also ordered the kids burgers but the were not fully cooked. We sent them back and had them taken off. I really appreciated the manager coming by asking for our feedback and he even sent us home with the kids burgers free of charge. Like I said --this seems like a great place to come watch football , throw back some drinks and have great service.. But I wouldn't recommend the food."], ["Eric W.", "This is the best bar/restaurant combo around. Yes it's a chain but it's an extremely well-run chain.  I absolutely love hanging out at the bar on the patio. Frank is the best bartender in Columbia. The food is always fresh and delicious and the beers are the coldest you can find. As they say at the Ale House, ALE YEAH!"], ["Tonya B.", "I gave two stars JUST bc of the food, not the service. The manager on duty was horrible, and couldn't even deal with the problem at hand, and instead brushed it under the rug so to speak. The outdoor non smoking section is a great concept, but obviously people can unlearn how to read?? The staff didn't think anything of it, and no one had the courage to point out the signs clearly posted, and ask them to move. I guess if you want a good time sitting outside, you must take up smoking. Disappointed in our first time going there. Way to welcome the newly moved to town New Yorkers..."], ["John K.", "I feel like all of their food has a similar taste too it, but if you are looking for bar food it's about par for the course.  The upstairs bar is an awesome place to hang out in the summer time, especially when they open up the porch and have a band playing!  Nice hang out!"], ["Kelly B.", "Very much enjoy the fish tacos. Great beer selection. Service seems hit or miss. I wasn't happy when they stopped serving salad with entrees and my kids were sad they stopped serving corn dogs."], ["Theresa S.", "Their grilled wings are huge and by far the best wings I've ever had!! They also have an amazing beer selection! Pair their wings with a banana bread beer and that makes for a perfect night! Their southwest salad is also amazing! Best I've ever had! Definitely miss this place!"], ["Kris L.", "Got the pub burger last week and hubs had the wings. His was awful and mine was great. Good beer selection and our waiter was very personable and responsive. I feel the food is hit or miss here. But overall a good chain rest."], ["Susan J.", "We were here recently for a late dinner.  It was packed as usual.  The service was slow I think because they were so busy - hire more waiters!  It took us a while to get our drinks.  The mint in the first mojito I had, well some of it was brown and mushy, I removed it, I was desperate, I drank it anyway.  The other two seemed ok, but the first seemed as if I got the last of the mint in the bag or something, kinda gross.The food was so-so.  For a place this busy? It should be better you would think.  My husband got a burger he only ate half said it just wasn't that great.  The cheese fries - those were good!  The zingers (boneless wings) were OK. Not the best by any means, the sauce was just ok, (hot and sour) which it seemed neither hot not sour and I wondered if I got the right sauce.The noise - dear god the noise.  We could barely talk to each other and we were sitting side by side as close as you can get (what can I say - after years of marriage we are still in love) I mean I know it's a sports bar but it is so loud (sat outside) that I felt like I had just been to a concert when we left my ears were ringing!  There are so many tvs, and they all go what seems to be full blast.  I can understand being loud but this was ridiculous.The plus, you can sit outside and have a drink and smoke, but that is about it really.Sorry!"], ["Wayne S.", "Get the blackened chicken sandwich. It is no longer on the menu but it is one of the best sandwiches in Columbia!"], ["Patrick B.", "Low rating due to the smoking area. Geez, it's the 21st century and still this restaurant has a smoking section. It maybe separated by doors but the constant in and out makes the whole place stink. Great service. Food much better than the other Carolina ale place I went to in Texas. But, the atmosphere here stinks. Literally."], ["Maranda N.", "Went for happy hour and dinner. Great draft beer prices! And i had blackened salmon for dinner which was cooked well and I enjoyed it. A little bit over buttered but that's expected. I had wonderful bartender with overall prompt and friendly service."], ["Pavan P.", "Bad service! Slow to meet and seat! Waitress look old  but dingy! Food not good! Had to ask for refills! Waitresses paid too much attention to Mgr Bad service all around! Not a happy camper for a 38.00 lunch!!!!"], ["CC W.", "Let's see if I can get my review on par with this one. It's been a month or so since I and a group of friends went. Ok, so we were already a little light aka tipsy when we got there so it could have been that or maybe it really was just THAT awesome but I had a good time here. The fact that it has a rooftop bar is one of it's high points. I love love love rooftop restaurants and think every restaurant on planet Earth should have one. Maybe that's a little much but seriously, the mixture of inside and outside is so cool to me. Maybe I'm easily impressed but whatever. Back to the review....it was quite busy when we got there on a Saturday night. They had games playing on all the screens, there was a good mix of ages present. It didn't seem too rowdy to me, just the usual busy sports restaurant filled with happy, excited people. Shit, it was Saturday and spending the evening on a rooftop bar on a beautiful, starry night should make anyone happy! Food was good, drinks were decent, the waiter was a bit young and probably didn't have a clue about the questions I asked him regarding the drinks, but he was very charming and friendly and we all know that goes a long way :)Overall we left a very happy group! Hopefully I can visit here one last time before I move."], ["David P.", "Good food and service. But the place is always packed at night on the weekends. Outdoor patio upstairs is a good place for Saturday lunch."], ["Joseph G.", "Atmosphere is OK, great beer selection, there is an outdoor area at the downtown location which is nice weather permitting.. But the food was terrible.  I suppose after a few drinks one doesn't notice.. it was tasteless, dry, and just not very good.. we ordered many things too including apps, entrees, and desert.  Good place to go for a drink after work or before a night out in Cola but not a great choice if you want a good meal."], ["Renee S.", "First, our server was the nicest chap.  College grad going to grad school.  If your manager reads this, I dont know your name, but you really made our visit personable.  Peach Beer, nice and refreshing.  We want to relocate to this area in the near future and this place will fit in nicely to a favorite.  The food was decent, too.  Big portion and lots of variety."], ["Troy N.", "I've got to go with the 5 on this...for several reasons. Was just needing some dinner, I realized as the night was going on. The CAH is right down from my hotel. Came in, and as I sat at the bar, the bar staff was very nice and accommodating right off the bat. Ordered up some of their dry rub wings...which came recommended here on yelp...and they were a nice departure from the usual dry(and I mean dry) rub wings that I run across every so often. Really good flavor. The BBQ French dip sandwich creation was good, but I felt that a little side of horseradish mayo or something with a kick was needed.What really got me, though, was as I sat listening to the conversations that the bartenders were having with the guests. Genuine, caring and accommodating through and through. Willing to make alterations from the menu, thanked and acknowledged at every opportunity. Really took care of the patrons sitting at the bar.Major, major props to whomever instilled that sense of ownership and pride of service! They really do \"get it\" and it shows in the service they provide. Thanks to Justin, Courtney and the third bartender.(sorry, didn't catch her name, but she's a brunette with some nice ink on her legs, and a brow peircing or two)Thanks again! I'm here for a couple nights, and a return visit is definitely on the books!"], ["Scott F.", "Atmosphere was great! Ordered a steak med well it was pretty much rare and not chewable."], ["Cay D.", "Ok if you like a loud, sports oriented atmosphere.  Great for young groups.  Not the relaxing, quiet evening meal, especially when traveling all day.  Husband ordered Philly Cheese steak sandwich.  Nothing special.  I ordered the special of penne with Alfredo, shrimp, mushrooms, and spinach.  It was tasty enough, but the shrimp had a strong taste for being so small.  Best thing we ordered was the onion strings appetizer, which was very good while it was hot.  Great selection of beers and ales, and they specialize in barbecue, though we didn't try it.  Restaurant was recommended by hotel.  Don't expect to return, even if I lived nearby."], ["Wayne T.", "This is only my second time here but each time the service and the food has been outstanding. You've got to try the pulled pork tacos!"], ["Jon S.", "Slow, in attentive service on a slow night.   Hostess can't figure out how to hail a taxi.  Bar food.  Lots of drinks and tv's on sports make up for general apathy."], ["Laurie C.", "Food is okay. Great selection of beer. Restaurant is the loudest I have ever been in. I even had trouble orders g because the waitress couldn't hear me."], ["Will W.", "Been here several times. A good place to have drinks, eat appetizers and watch the game. For a full meal, not so much. The food is OK, but not great.  The wait staff is friendly, but have almost always gotten a part of our order wrong.  I don't know if that's our bad luck, or a systemic problem. I'll go there to have a few brews, but I will look elsewhere for lunch or dinner."], ["Dustin S.", "This place has it all, great food, great prices, great service!  It is an awesome place to watch a game, or just hang out and get in a game of pool with some friends.  Their happy hour offers the best in town, and Tuesday nights have happy hour all night."], ["Bart Z.", "Nice pub type atmosphere.  The crowd seems like mostly locals and there seems to be some regulars that all know each other.  It is more middle aged as opposed to young people, but that's okay with me as I'm not so young anymore either.  I was easily identified as an out-of-towner by a local that sat by me, but he seemed nice and we talked for a while.There are TVs, but they're kind of hard to see from the bar and I had difficulty trying to watch the NFL game that was on some of them.  The beer selection is pretty extensive and I enjoyed a couple of Franziskaner weiss beer's.  The Triple B Burger I had was good and was served quickly.  The bartenders were nice and the service was good."], ["Kyleigh P.", "I prefer other places for beer, but they do have a pretty great selection. I was very impressed with the food. I've gotten a vegetarian reuben that was amazing and some great fish and chips. I've heard the nachos are delicious as well. I've never had a problem with the service either."], ["Eric S.", "It was the only place open at 11 P.M. on a Monday night. However, the service was excellent and the food was good too. I had the Carolina BBQ burger and it was awesome. I will stop here again if I'm ever in the area."], ["Jessica B.", "I went earlier today with my boyfriend and I must say I was disappointed. We sat at the bar near the server station and heard nothing but constant complaining and arguing from the employees about being at work. If they weren't complaining about being at work it was whining about whatever else was bothering them. I have been a server/bartender for years and I get it...sometimes you don't want to be at work, but the guest don't need to hear about it. My boyfriend made the point that if they don't want to work and make money then there are plenty of people that would love the opportunity. Not to mention the food was not that great. Our app tasted spoiled and nothing else was fresh. The one shining star that actually kept us there and helped us enjoy out experience was the bartender Marissa. She was very sweet, told us the specials, took care of us and made nice conversation that was actually pleasant! If you go...sit with Marissa."], ["Jovan M.", "The previous review about (1) this being an 30-50 crowd and (2) the locals being great to the travelers are both on. I suggest the dry rub wings."], ["Matthew C.", "Great drink prices and good typical American food."], ["Jo D.", "Better than average craft beer selection and a good menu. Sure they've got all the standard \"bar food\" dishes, but they have other things as well. We went for lunch and the wraps and pitas were a hit. Most choices were under $10. Fresh ingredients and large portions. Nice, large outdoor area and very convenient to the mall. Our waiter was attentive and friendly."]], "Rockaway Athletic Club": [["Brandy B.", "1st time here - Friday at 12:30pm... went for a work lunch, and there were 16 of us.Seating isn't accommodating for a HUGE party, all I saw were booths (enough for 4 max).We all squeezed in around one of the bars in the back.The hugeeeeeee TV wasn't working (oh well, we were there to enjoy each other I suppose).We ordered to share...Fried zucchini (I wasn't a fan of the batter, too peppery)Gouda Mac & Cheese bites (the cheese was orange and boring - so I dunno if they have different Mac & Cheese bite options and we were mistakenly served the wrong ones or what - but it was pretty disappointing bcuz I LOVE me some gouda!!!!!)Pimento Cheese Fries (Rockaway is KNOWN for their pimento cheese everything - and I thought they were pretty good!  The fries were fresh and crispy and the pimento cheese was a nice addition).I ordered the Rockaway Pimento Burger add Jalapeños minus onions... twas DELISH!  The bun was fresh and soft (the bottom bun was toasted) the patty was thin (I've never liked thick burgers) with the pimento cheese and jalapeños... YUM!I'm not an expert on pimento cheese but the couple times I've been exposed to it, it's always been made with cheddar or gouda... Rockaway's seemed like it was made with Kraft/Velveeta or something.. Reaaaaallllly creamy.Our service was reasonable considering there were so many of us and the dude had other tables.  Everyone enjoyed themselves and their selections!Glad I finally tried it!"], ["Heng T.", "We came here on a weekend afternoon to watch March Madness. The location is tricky to find as its on the backside of the building so there is no sign out front. They have several tvs in the bar area and a few projectors in the restaurant. This place is mainly known for their burgers so that's what we all decided to get. All their burgers are less than 6 dollars and have different types of cheeses. We each ordered our own burger and we also got a large order of pimento cheese fries and a large order of regular fries. Our server was very friendly and gave recommendations for the menu and refilled our drinks regularly.Our food came out in just a few minutes which was great because we were starving since we didn't eat breakfast! The burgers are really big for the price you pay while the large fries for about 4 dollars was about average quantity. I ordered my burger without onions but it came with onions still so our server took it back but I got a freshly made burger within minutes. The burger tasted average but it was cheap and a nice size. The pimento cheese fries were decent but I also have had better. The regular fries are just crinkle fries that seemed to be lacking salt so we added more of our own.During our entire meal, our server was very responsive and carried some friendly conversations with us so that was a plus. The restaurant also has a pool table and ping pong table for people to use later at night when hanging out at the bar. The food was average but cheap so you get what you pay for. Not a bad spot for a quick, cheap meal if you are hungry."], ["Brandon D.", "This place is awesome!  It's a bit hard to find, but seriously, this place has great food.  We sat and the small bar and our server was awesome.  He made sure we had a good experience. I ordered a BBQ Bacon cheeseburger and it was delicious.  Cooked to perfection and nice and juicy, this is what a burger should be.  My only advice is the grill or toast the bun, it would make it a perfect burger.  The onion rings were great.  This place offers a great burger, great service, and a great atmosphere, that you must try."], ["Sydney G.", "Rockaway is a dark, grimy bar with some of the best food I've had in Columbia (which, granted, isn't a lot because I try to avoid this town like the plague).But at Rockaway is where I learned that I did, in fact, like Pimento cheese. And also that I like it on EVERYTHING. I always get their pimento burger and the pimento fries, which is like cheese fries on crack.I am also a sucker for the gouda mac and cheese bites, which are the best I've had anywhere. So good. If you're looking for a good hangover cure, Rockaway is the way to go (pun intended)."], ["Sam C.", "Very unpleasant experience this evening.  Will avoid this place like the plague. Will not be back."], ["Calvin G.", "The food is great, the service is not. On multiple occasions at lunch, I have left due to lack of service after sitting at a table for 10 minutes without seeing a server. I just left for the last time, and I hate it, I've been a customer for many years."], ["Thomas S.", "Very bad service.  The waiter raised his voice when he didn't her the order. He raised his voice with an attitude.  After ordering a mixed drink it took 15 minutes to get to me with no apologies.  You have to check out at the bar. So when I went to the bar the bartender was on her cell phone and made me stand there for over 5 minutes.  The manager was next to me the whole time at the bar and never said anything.  I will never give this place another chance."], ["Thomas P.", "I have been going off and on for years and was wanting a good pimento cheese burger so a friend and I went on April 15.  Unlike the previous times I have eaten there I was disappointed in the burger and the fries for very different reasons.  First the burger, the patty was very very thin, something I have never seen before at Rockaways, and the bottom part of the bun was dry and hard (like it was verging on going stale), and the tomato was a small salad tomato the size of a fifty cent piece (I kid you not).  Now to the fries, they were good, but there was honestly more pimento cheese than fries in the order.  Now don't get me wrong, I love pimento cheese, but it was kinda overboard.   I really think the kitchen needs more/better management.  On the plus side,the service was good and the waitstaff was nice as always."], ["John C.", "Not a great experience, got there at 7:45pm and made the wrong decision of sitting at table instead of the bar.  After about 15 minutes our waiter came by and asked us what we wanted to drink, we ordered two beers which arrived 15 minutes later.  At that time a couple sat in the both beside us, they were immediately greeted by the same waiter and received their drinks before we placed our dinner order.  The couple behind ordered their dinner about 15 minutes after we did and received their food 15 minutes before our order which came out wrong and had to be sent back which resulted in another 15 minute delay.  The couple behind us paid their check and beat us out of the restaurant by 30 minutes.  Big tip for future customers, if you are hungry, sit at the bar and not a table.  The food is good which is why I gave them 1 star and because 0 is not an option.  Also, beware of the many small children running through the bar, this place gets more kids than Chuckie Cheese."], ["Antwon C.", "As many said its easy to pass by this place. Went here for lunch and tried their pimento cheese burger it  was delicious. The burger was big for the price. Everything on the menu is a la carte but still good prices for the amount of food you get.  Got my food In reasonable amount of town."], ["Samantha A.", "We love rockaway's. We haven't been here in a while, and decided to go for Crab leg night. Unfortunately they were out of crab legs. We were a little disappointed, but decided to order other thingsHe had the boiled shrimp dinner (1/2 pound of shrimp with hush puppies and a baked potato). It was delicious, not an overwhelming plate of food, and really good for ten bucks. I ordered a bacon cheeseburger with onion rings. I usually get the pimento burger, but the bacon on this burger was excellent and I may add it to my permanent rotation. Our service was great, but the service can be a little hit or miss here. However, the beer is always cold and the food is always delicious."], ["Charles P.", "I ordered the rockaway special (Pimento Cheese Burger) and the the Pimento cheese fries.  Extensive bar list.  That have pappy on the menu for $16.50.  As a bourbon drinker that is an incredible price point."], ["Tanner B.", "Love this place!  But only bad thing I could say is last 2 times I have been here for lunch it took almost 30 mins for us to even get our drink orders in.  Granted there was only 1 server for the entire bar area (which is entirely too many tables for 1 person to handle imo).  Anyways lets get to the food I have yet to try anything else on my 10+ visits here except the spicy pimento cheeseburger! Which will not disappoint!  Don't want to ruin a good thing so I don't bother with anything else!  Hahah"], ["Nick C.", "Very unpleasant experiences the last few times. The service is poor and management is far from professional."], ["Rick T.", "This place does not have a sign so you will have fun finding it if your not from the area. But with our smart phones I'm sure it will be quite easy for all of you out there. Two things you must try here one is the food, what you ask well the duck wings here are fabulous with some beers. The second thing is not food at all but it may turn into a meal. Don't let anyone from PETA see you do this either, you have to play the lobster game when you come here. It gives you the opportunity to play 2.00 in game of chance to win a lobster in a claw machine. I won on the second try and had no clue what to do with the lobster I'd just won. Luckily the kitchen staff cooked it up for me, they kinda over cooked it but it tasted good all the same. So this is not your average place in Rosewood to me at least and that is a good thing."], ["Carl R.", "After having a great experience on my initial visit, I went back again. This time for lunch. Service was not so great, or better yet non existent. Upon entering, there is a sign that says seat yourself, so we chose a table and waited. No one came, so I got menus for everyone from the stack in the restaurant. After deciding what to order, I grabbed a worker in the bar and asked for a waitress. When the waitress came over we ordered our drinks and entrees. The food came out before our drinks. In fact, I had to ask the bartender for drinks because the waitress disappeared and still did not bring them. The bartender said she would have the waitress bring us drinks. Waiting again... By the time the drinks arrived, I was done with my burger. There was no apology by any restaurant employee, including the waitress. Instead, the waitress said here is your bill, you can pay at the bar. I went to pay, and saw other waitresses (not ours), sitting at the booth with their cell phones texting. After this experience, I have to take away my previous 5 star rating.Yes, the food is unbelievably good. The restaurant has a great atmosphere. It is literally a hidden gem. However, based on this experience, customer service did not appear to be a priority."], ["Dorothy K.", "You can't beat $5:50 for a delicious hamburger that is cooked to order. Because there is no signage on the building, this place feels like a secret speakeasy. Service is a bit slow but that's okay. They are super friendly and it's worth it.. I had the grilled pimiento cheese sandwich on French bread which was delicious."], ["Sherry C.", "VERY unpleasant experience. I will never be back."], ["Caroline M.", "This place is the worst. Their food is inconsistent. The buns are usually stale. Their staff doesn't care. It's horrible service. Don't waste your time. I am NEVER going back. Not wasting my money."], ["Ryan H.", "I may have given them more stars if the bartender had come to the end of the bar to take an order. We sat there for a solid twenty minutes or probably more like twenty five. It almost seemed intentional. At that point we left and went to cantina 76, which was great as always and had stellar service."], ["Grace M.", "You can't really find the place unless you know what you're looking for. Terrible service - servers are incompetent and pretty rude and it is S L O W... Not worth it. I would rather go somewhere else and would recommend the same to anyone. Pimento cheese fries/ cheeseburger are definitely the way to go if you must eat here."], ["Rachel O.", "The best places are always hard to find but it's definitely worth it for these burgers.Rockaways is on Rosewood Drive near the Publix and across the street.  There's no sign and the \"back\" of the building faces the street.  There is parking around back (which is the front of the restaurant).  Confused yet?  Doesn't matter... just google map it and go.  You'll figure it out!  Once you get there check out the burgers.  The pimento cheese burger is a big hit with the boyfriend.  They put a thick layer of the cheese right on top of a hot burger and it starts to melt which equals pure (and messy) deliciousness.  This is definitely not a first date kinda place. I like to build my own burger with cheese and bacon and all other heart attack inducing toppings.  They have always come out piping hot and thoroughly yummy.  Did I mention they are also ginormous? The portions are very generous considering the little prices. Moving on to the sides... onion rings, fries, zucchini sticks and my personal favorite - hush puppies. All are served with tasty dips too. Those are the sides we've tried but there are others too.There are also salads, sandwiches and wings but I have yet to try them because I can't say no to the burgers! Take your pick of one of 2 bars inside the restaurant or grab a table inside or on the deck outside. They do have televisions inside for your viewing pleasure as well.  The only reason I didn't give it 5 stars is that the service isn't the most consistent or stellar.  It's definitely not a \"fancy\" place but if you are looking for a good place to hang out with some friends, catch a game and grab a burger and a beer then this might just be your dream come true."], ["Adam B. J.", "Not sure I can say anything that hasn't been said.  Burgers are huge and delicious.  The Pimento Cheese burger is great, but the other burgers are too.  Service is hit-or-miss making it hit the 5 star mark.  Outdoor seating is nice.  Well stocked bar."], ["Jackie T.", "Great place, a Great chill atmosphere. The burgers are amazing and even better prices. Meal for two usually ends up costing 15 bucks. The apps are heated up but the burgers are the best around. Better burgers than Paulies front porch. Personal favorite is the pepper jack burger."], ["Mike M.", "This is a true \"Local's Only\" bar. As many Yelpers said, you'll pass right by it if you don't know the area.  For the food, Pimento Cheese Burgers and Pimento Cheese Fries are must haves.  Chicken wings are also great.  I ALWAYS opt for a side of hush puppies.  They are no joke.  They have air hockey, a pool table, some arcade games for the kids which is helpful because the servers are a wee bit slow.  And if you've ever read any of my other reviews, you know how I feel about this.  However, Rockaway's is the one place I don't mind the wait.  I've taken friends from out of town here and every time they come back, they always request we go there."], ["Andrew W.", "Rockaways is always awesome when it comes to burgers and pimento cheese fries. It is a staple in Columbia and always has great food, drinks, and staff. The only thing to know when coming here is that it is typically a place where you find your own seat and that it is always packed during lunch time and special events like trivia night on Wednesdays. So if you're looking for a place where you'll immediately be greeted it may not be a good choice, but if you're up for finding a preferable seat yourself get ready to experience some of the best pimento cheese themed items this side of the Mississippi has to offer!"], ["Devin S.", "Great restaurant to go with your friends for burgers and drinks. The staff is always friendly and the Gouda mac and cheese bites are awesome"], ["Derek L.", "Rockaways is a great local favorite. The service and wait times can be hit or miss. I've never has a bad burger here however. I usually stop in a couple of times a month and I keep coming back. Four star rating due to the service, which at times can be downright abysmal."], ["Ct W.", "Gave it a second try, food good, burgers and pimento fries good, service worse than the previous time."], ["Gary S.", "Went there yesterday during the USC Bowl game with my family of five. Hamburgers were the BEST, service was EXCELLENT, the beer was COLD, and USC WON. Best hamburger in South Carolina!!!!"], ["Erin N.", "Headed to Rockaways for a late lunch on Sunday.  We had the best service ever and received our food in less than 10 minutes from ordering. Pimento cheeseburger and crinkle fries were perfection!"], ["D B.", "A pimento cheeseburger is as much a staple of Columbia food culture as mustard based BBQ and this is the best place to get one. Just good honest big ole burgers and great sides including onion rings, fried okra and pimento cheese fries. It's a big place with lots of parking and seating, which sometimes causes service to run a tad bit slow. This is a must try if you are looking for a genuine Columbia dining experience."], ["Taylor H.", "You can't go wrong with the pimento cheese fries here. Service isn't the greatest though."], ["Amber G.", "The food at Rockaways is always good. It won't blow your mind, but it's good. The pimento cheese burger is a favorite with my family. My biggest complaint here is the service, which is very hit-or-miss. Customers seat themselves here, so on a busy day it often takes servers awhile to notice you. It's not a place to go for lunch if you're in a hurry."], ["Marcus B.", "I am a fan of this hidden treasure.  I remember there was a really bad snow storm when I was attending USC, and I risked life and limb to drive my girlfriend's PT Cruiser to Rockaway for a pimento cheese burger."], ["Christina S.", "My husband and I come to 25¢ shrimp fried or boiled , Monday nights almost every other week. We get the fried, and a plate of cheesy fries, too. Always yummy!! The shrimp are big, fried okra good, ghostburger is good!"], ["Drew E.", "One of the better burgers in town! Pimento cheese and jalapenos is the way to go!"], ["Chris B.", "Used to be better before it was set on fire.  Food is still good but they lost the magic they used to have.  Very hard to find or impossible.  Good burgers though."], ["Edi R.", "College, no service, so-so food and overpriced!They were NOT busy (half tables empty) and everything was wrong, and it took over an hour to get our food. - the pimento burger had almost no pimento cheese and instead of \"let me get you some from the kitchen\" the idiot's response was \"I can't cook and wait tables\" - Ordered a salad with no onions, it came with 1 cop of onions dumped on top. I asked 3x for a small plate or cup to put them in, it never came. I put them on a piece of paper on the table. (was not going to send it back- might not have ever seen it again)- one order came after everyone else had eaten - we asked for hot sauce and cocktail sauce for shrimp, etc and none of it ever arrivedAnother round of drinks - they never came - TERRIBLE hung-over-college-student service! They don't care and you know it quick!"], ["Anthony G.", "There burgers are okay but nothing special. They are definitely better than most places but I wouldn't claim that they are the \"best\". The atmosphere is great with TVs everywhere and lots of room. It's a perfect spot to watch the game, have some decent food, and drink some reasonably priced beers. It's hard to find but is worth stopping by and checking it out."]], "Cola's": [["Jamie V.", "After making the choice to go out for some \"quick drinks\" with my friends, we decided to make a night of it and enjoy some food as well.  Let me just tell you, I'm glad we did. Since we went for the drinks at first, let me start there. One look at the cocktail and special board and you'll already have a tough time deciding.  I was torn between the \"Raspberry Lemonade,\" the \"Orange Fashioned\" and the \"Blood Orange Martini.\"  After a careful consultation with the bartender (who was HILARIOUS), we decided it would be in my best interest to go with the Blood Orange Martini.  Once I got, I couldn't thank her enough.  Then...we got the menus.  So much for \"just getting apps.\"  I ended up ordering the shrimp dumplings and the Thai Beef and Shrimp Salad.  When I say that there was an explosion of flavor, I'm not joking.  Absolutely fantastic.   The salad was the perfect light dinner to go along with appetizer.  While not the cheapest place in town, you definitely get what you pay for."], ["tony T.", "What a nice surprise! Fish stew as an appetizer special was delicious - shrimp, white fish and good stock...yummy! House salad and chicken milanese was out of this world with linguine and mixed veggies. Cooked to perfection the pasta and lightly breaded chicken and veggies was worth every bite. Colleague had tilapia which was also scrumptious!While I had a nice sonoma cabernet, wanted to have the option of a draft beer which they don't have as everything is in a bottle..:'( No room for dessert but the choices looked great.Service was very good as waiter was introducing a new waiter in training who was very attentive...both of them did a great job. The trip down from New York was worth it and will be our first stop next time here.Well done Dustyn!"], ["Grace M.", "Definitely a little more casual than Garabaldi's (same owners), I think this place is great. Their crispy flounder is one of my favorite dishes and I love their cocktails. When it's really nice out, they open the garage style doors, so it is as if you're eating outside. I recommend either getting their early or making a reservation on the weekends."], ["Ron V.", "Went to Cola's on 1/3 and was really impressed.  I'd hesitated going for some time due to the prices and some other reviews, but we decided to try it.  The atmosphere is very nice and the service was great.  Our whole experience was good, from making the reservation to the final meal. There were four of us and we ordered the Grilled swordfish wiith andouille grits, two small Maine lobster tails with risotto cake, trout, and scallops.Everyone was satisfied with their entrees.  I'd ordered the Grilled swordfish with grits.  I'm not a huge fan of grits unless they have andouille or tasso with them...these said andouille. So I asked for some tasso cream gravy and the waitress suggested I get it on the side so it didn't interfere with the dish the way they prepped it. She was totally right.  When it was served it had the andouille and a nice sauce around the plate.  I immediately knew I didn't neet the tasso cream gravy.  It seems like everyone else was dunking their meals into the tasso cream gravy (scallops,  bread,) and really enjoying it. Next time we said we'd try the shrimp and grits with the tasso cream gravy!  Can't wait to go back and try it.The only thing that was below average was the Lobster tails.  I guess we're used to Lobster with drawn butter.  These were served without any butter and my wife said they were too dry....should've asked for something on the side I guess.  They also were very small, but I guess this should be expected for 2 Lobster tails for $30.Wine selection was good, water was constantly refilled, waitress was knowledgeable and at one point the manager came by our table and asked if everything was okay.  She said she had heard a comment or something that made her think we were dissatisfied with our meal.  Not sure where she got that from but we were more than satisfied with everything.  But it's good to see that the management at least acknowledges concerns at tables.One of us ordered the cinnamon bread pudding for dessert.  I'm a big bread pudding fan but wasn't that impressed with this one.  Our neighbors did like it and had half of it boxed up to take home.Highly recommend Cola's and am looking forward to going back soon.  It won't be every other week due to the prices, but we have put it on our list of one of our favorites in Columbia."], ["Mike M.", "Met up with some friends here and had a great time.  The food was decent - but the service was great and our table was ready fairly quickly."], ["Donnie S.", "Our friends bday dinner was amazing. We're visiting from Charleston and after reading the reviews here we decided this place would be perfect--and it was! Shawn was our waitress and was sort of spastic but very thorough and attentive. Our drinks and apps were fantastic (recommends the blood orange martini). Entrees were exceptional!! (Recommends the braised short ribs-- port sauce was interesting... Sweet, what do you expect, right?!) we had no room for dessert tho!! I highly recommend this place! We're very critique-y restaurant people and very culinary inclined; this place was fabulous!! Thanks Cola's for the great experience."], ["Dave L.", "Whole Crispy Flounder, Lobster Mac and Cheese, Good Wine List, and Great Service! Met a client here for dinner and though I read many mixed reviews I was surprised and impressed.We met at the bar where the bartender was attentive and professional.Next was our meal. Nice booth, though a table would have been better with again, great service.The Whole Crispy Flounder was a suggestion of one of my clients. Gave it a shot and was glad I did! Now this would not be listed as a Healthy Cooked Fish by no means, but darn it was great! Finish one whole side and boom! Turn it over and eat again!Would I return? Yes!"], ["Bryan G.", "Ordered the salmon and shrimp special and it came out in 4 min. Salmon was completely raw! I love sushi but for a \"grilled\" piece this was almost frozen in the middle. Waiter sent it back and it came back looking like it was in the microwave and had 2 less shrimp!? Went from 4 shrimp to 2... Did the cook get hungry. Will never return"], ["Jessica B.", "ZERO complaints. My boyfriend and I went for our anniversary and loved every second of it. First we sat at the bar and the amazing Alison made us each an amazing martini with fresh squeezed juice.  we ate dinner and Mandy our server was sweet, knowledgable and pleasant. We had apps, salads, entrees and dessert. Each course was well prepared, fairly priced and delicious. HIGHLY RECOMMENDED!"], ["Lisa M.", "Service gets 4,stars.  Would give 5 but really cleaning and bussing a nearby table with a spray bottle of heavily scented cleaner?   Food was good but a bit overpriced for this market.  Wouldn't be my first choice for a fine dining experience."], ["Gretchen K.", "Both my meal and my husband's were delicious.  But I want to emphasize how good the bread was that we shared.  Not sweet, just delicious texture and delicate herbs, served with a good quality butter."], ["Ken J.", "Wagyu burger. What can I say. The brioche bun while great. The brioche was not sturdy enough for the serious juice!  Had a perfectly cooked burger, a little under seasoned.  And the shoestring fries were plentiful and VERY hard to stop eating. The wait staff was great. All in all a repeat. I would simply skip buns all together."], ["Catherine T.", "Since moving to Columbia I've heard nothing but extremely mixed reviews on Colas, so obviously I had to see for myself. My overall impression: Good food, but overpriced. I went for dinner on a week night and had no issue walking right in. The space is huge and the atmosphere is nice. They have a nice drink menu, but $10 for a martini isn't something I'm used to in Columbia. That's Atlanta or Charleston pricing. Next time I'll stick with beer.To start, we had the bloody mary fried oysters - good, but not great. I wouldn't order them again, and I love oysters. I had the special entree which was a Parmesan encrusted pork chop and it was to die for. I really enjoyed it. This was the best part of the meal (luckily)The food was definitely good, however it wasn't amazing. The prices are on the level of Oak Table, and I just didn't feel like the experience was the same. I think for a \"casual fine dining\" restaurant in Columbia, $10 for a drink is just insane."], ["Jessica D.", "I absolutely love this place! I always get the almond-crusted tilapia with a substitute of their homemade Mac and cheese on the side. Their Mac and cheese is absolutely killer! I always have to get it! I love their strawberry mojito and their wine selections are amazing! The servers are always polite and knowledgeable. The only bad time I've had is when they were out of mussels and the bartender was not notified and after my date received his food did the bartender find out they were not able to make my food. The management handled it great from there. This is my boyfriend and I's go to place for a nice date!"], ["Jacob C.", "Came on a Wednesday night, was seated right away because the place was quite empty. They had the giant windows open, which created a nice breeze and the restaurant itself is gorgeous. However I was blown away by the prices and lack of pizzazz on the menu. Nothing stood out to me, nothing made me say \"wow that sounds fantastic\". I can get steak and potato anywhere, the prices and lack of creativity made it seem a bit pretentious. So I ended up spending more time trying to figure out which protein came with the most sides. I ended up with the cedar plank salmon.When it came out, again I was taken aback at how small my portion was. To make matters worse it was presented on a very large plate, making it seem even smaller. But, the saving grace is that the salmon was good. It was moist, with perfect texture and had a very nice sweetness to it. The sides seemed to be more of a garnish, since I did not get many. The salmon saved my review from being lower than three stars. Sure it was not anywhere near large enough for me, but it was great."], ["Dre D.", "Had a wonderful experience at Colas to celebrate a friend's birthday.  The service was exceptional and the food was delightful.  The atmosphere was tranquil and inviting.  This was my first time at Colas but it won't be the last.  I can't wait till my next visit."], ["Keith K.", "Cola's is a curious place... someone is finally doing something about the old John Paul's Armadillo Oil building and has sunk a lot of money into it.  I am glad for this; the space is large and needed to be reoccupied.  Sadly, the ownership forgot to spend money where it really counts: On the food.I'll keep it fairly short - I would be quite surprised if Colas lasted a year.  The food isn't \"bad\", but when judged against food at the same price point, it can't stand up  to restaurants like Motor Supply (which is just across the street) or Saluda's a few miles away.  Paying $23 for around 6 ounces of cedar-plank't salmon that is overplanked (is that a word?  It should be) and potatoes strikes me as rather silly.  The lobster mac & cheese was overly salty and runny and boring; the blackberry crisp shake sounded good on paper but was slightly sour and thin, think the consistency of a lassi.  Sigh.One bright spot: The pork shank was large and tender and was quite tasty, but for the price, it had better be.  I say 'was', because it seems to have disappeared from the current menu, alas.The atmosphere is dim and cold, full of hard surfaces, and therefore somewhat loud - generally uninviting.  The service was mediocre, neither awful nor particularly attentive.  Again, that's fine for 5 Guys, but when paying a (steep) price premium, I look for better.The beer list is short, boring, and overpriced: $6.50 for a Bell's Oberon, which is a $9.99 six-pack.  One yawns while wondering why.  Oh, and the cocktails?  Skip 'em, unless you go in for cheap flavored vodka mixed with (other thing).  At $10 a pop, get the aforementioned Bell's 6 pack in your system beforehand, or save your money for a nearby bar with real cocktail service, you'll thank yourself.Overall: Colas is Not Terrible, but also Not Exactly Good.  With restaurants nearby that offer better food and drinks and service for at or below the price, why choose Colas?  I still haven't been able to figure the answer to this question, and when I do, I'll probably revise my review."], ["Bryan M.", "Popped into Columbia last night for work and a friend recommended Cola's restaurant to me - and it didn't disappoint. Great atmosphere, great service, big wine and cocktail selection, very good food. Solid experience from start to finish. I had the filet which was cooked perfectly - no complaints. I also tried the BBQ pork spring rolls and hummus trip - again, both very good. Highly recommend Cola's if you are visiting Columbia."], ["Eater Of Food S.", "Beautiful building and decor but the food was overpriced and just average. The fries were the best and who wants to spend $25 for fries. So don't come here for a memorable meal. Boring food for the price. Our party was 10 people and they absolutely would not seat us with 9 people there. A single mom was running late and we had to stand at the bar for 20' till she got there. Not a good way to start our meal. Our waiter was good but overwhelmed and very slow until some other tables left then we got good service. So very disappointed in the food but the decor saved it a star."], ["Abe L.", "Went last night 2 1/2 years later and it still is very amateurish. The prices are professional. But what do the people of columbia know. Behind the times. The filet was cold and looked like a lump of coal , raw onion rings, i guess the chef has dyslexia..When you go out to dinner with somebody no body wants to eat while the other waits for there food to come out again...... We will not try it any more, it just not worth it."], ["May C.", "Slightly overpriced for what you get. The presentation of the plates are great, but the taste was below our expectations. We ordered the snapfish off the menu and seared scallops ...all in all, the food could have been much better.However, the blueberry mojito is to die for!"], ["Mande B.", "I am in love with this restaurant. We dined on a Monday night and I had to come back for seconds the next evening as well! The shrimp and grits are a MUST, the scallop appetizer was also finger-licking-good :)"], ["Rob C.", "I have lived in Columbia all my life and haven't had a better meal from anywhere else. This place is pretty pricey but its definitely worth it if you want something new and refreshing to put on your palette...very impressed."], ["Morgan R.", "I recently had to move from Boston to Columbia SC....a nightmare for a foodie like myself.Colas is by far my favorite restaurant in Columbia. My husband and I have been a handful of times and have never been disappointed with our meals. The food is excellent and displayed in great fashion. The service is outstanding! Every single time out server has been amazing, literally! The staff here is very knowledgable about the menu and are always trying to accommodate your every need.The only negative I have is that they used to have this pesto shrimp pasta dish on the menu and they no longer have it. That dish was amazinggg and I could eat it every day.Definitely go check this place out, hands down one of the best in Columbia!"], ["Jay C.", "It has taken over two hours to get our food. Service is horrible. Food is pretty good, but not worth the wait."], ["Gunnar P.", "Had dinner with a small party. Nice atmosphere. Menu had good variety and food was very good. Waiter took pride in knowing the menu and gave great descriptions. Nice bar with great wine selection. Service was a bit slow but acceptable. That was the only reason I didn't give it a 5 star rating."], ["Julie R.", "We went to Colas for the first time with a group of five. My reservation was for four so we started out our visit at the bar waiting for a table. I started out with a jalepeno oyster shot that was so spicy I almost wanted to cry! Ouch...After about 20 minutes of waiting, our group was getting antsy and we were about to go ask about our table when we see the hostess heading our way to finally seat us! When we finally get seated we ordered three appetizers which all ended up being great! We ordered the BBQ springrolls, the hummus trio and the shrimp dumplings. The BBQ eggrolls were the favorite and they came with this amazing mustardy BBQ sauce I wanted to dip my whole meal in. After appetizers our group ordered shrimp and grits (to die for), crab cakes (lots of crab), pork tenderloin (didn't try), spiced chicken (ehhh..ok), and a lamb burger (told it was good). Then as no dinner out is complete without dessert, we ordered bread pudding, hazelnut mousse and the chocolate brownie which came with homemade coffee icecream. I know this sounds gluttonous but we did have Five people!! The best dessert was by far the bread pudding..OMG It was delicious. It came  out with a vanilla icing drizzle and it didn't have raisins (which I hate).  Also notable was their strawberry basil mojito. It was the best I have ever had! So overall I give Colas an A! Definitely try it out but be prepared to spend some moolah...yumminess like this doesn't come cheap!"], ["Denise K C.", "Colas has been open for almost 1 month. I've been anxious to try it but it has been packed on the weekends. That tells you something.It is a Tuesday night and it's  pouring down rain with lightning and hail; a great night to try Colas. We were right. Try it during the week.We tried the Applewood Smoked Bacon wrapped Polenta. Delicious starter. We ordered the Crabcakes with Corn Salsa - 2 cakes with lots of crabmeat. It came with French Fries maybe you could swap out for a different side. We tried the Lamb Burger it was really delicious with a great combination of seasonings. Lastly, we ordered the Tilapia which was very good but you will want to order a side.We finished dinner with the Coconut Layer Cake - wow! Just try it.Love the decor. But the acoustics are loud. This is a great addition to Columbia, the menu isn't like anything else here."], ["Mackenzie J.", "The atmosphere is great. Unique older building, restored. I have always experienced great service and tasty food! My boyfriend and I have been a handful of times and have never been disappointed. Appetizers: lobster mac and cheese and the mussells. The romain wedge salad is by far my favorite! The Shrimp and Grits are rather tasty! Our last meal, we shared, was the 16 oz ribeye, with sauteed mushrooms!! Absolutely to die for! Make sure you get a side of collard greens, definitley my favorite side item! I would recommend this place for any of my close friends or family!"], ["TheHungryDad Jeff C.", "This is definitely one of those restaurants I regret not visiting sooner!!  From the outside you almost have no idea it is a restaurant.  I honestly thought it was an old abandoned building at with an old advertising art on the outside... then thought it was probably just a bar.  It was not till I happened on it here on YELP that realized it was a super nice, white-table cloth restaurant and wine bar.  Took a group of out-of-towners there and the food was all spectacular. Most of our party got seafood (Tilapia, Tuna, Salmon, or Shrimp and grits)  and one of them got Chicken.  Every thing was prepared wonderfully. Vegetables were wonderful as were the hummus and asparagus appetizers we ordered. All the bread and deserts are made fresh there in their in-house bakery. We did not try wine but they had an enormous wall, floor to ceiling, full of wines to choose from.   I honestly can't wait to go back there with my wife for a romantic dinner."], ["Meagan C.", "I don't know why this place has such few stars.  We had a reservation at 8pm on Saturday night, and the place was packed! So glad we called ahead.  Ambiance was very nice, and the hostess was very polite, even though we were about 20min early.  Our server was also very nice and attentive, and made great recommendations on food.The inventive cocktails were a rare find in Columbia - we had their Strawberry Lime Mojito, and my bf tried their jalapeno oyster shooter (which packs quite the kick!).We started with the Shrimp Dumplings, which were very good.  Great dipping sauce with an orange-zest like flavor.  Food came out quickly, no problems there.  For entrees, my bf order the flounder - absolutely amazing!! Great crisp and a wonderful sweet chili sauce.  I had the crab cakes, which were also very nice - lots of flavor without being dry!I did not think the price point that bad, for the quality of the food.  We just moved to the area, and are glad to have found Cola's, especially after some other places recommended in town with the same price point were a bit of a let down."], ["Snave N.", "Stopped for dinner on a Monday night. Shrimp and grits were excellent as was the oyster chowder (though it could have used a tad more oyster). Nice place."], ["S W.", "It is exceptional... Exceptionally expensive, exceptionally ordinary menu, exceptionally well plated and cooked, exceptionally warehouse ambiance, and exceptionally slow service for a mostly empty dining room. Similar to Garibaldis but with a bar-n-grill vibe."], ["Christa C.", "We had dinner there again last night...I'd give it a 3.5 star rating if possible. The food was good (not great) overall...service was ok. Our poor waitress was working her butt off and clearly spread to thin. She did a wonderful job, and we know that the delays and little glitches weren't her fault. One con: the noise level is deafening when full on a Saturday night. One pro: fun, lively atmosphere that will bring us back. Oh, and the lobster Mac appetizer and crab cake entree are pretty great. Skip the polenta fries and some of the blander pasta options. Wine trumps cocktails here too."], ["Ashley P.", "Went to Cola's for my boyfriends work Christmas party. The food was amazing. I ordered the filet and my steak was cooked perfectly! The wait staff was very knowledgeable and helpful. Next time we are in Columbia we will be back!"], ["Karla C.", "Great place with very diverse menu.  Party of 4 and we all had a difficult time choosing between so many great entrees.  Everyone loved their meal and the service was great."], ["Chauncey J.", "Decided to give this place a try despite bad reviews and mixed feedback. We waited nearly an hour for our food to come out & when it finally did 2 of the entrees weren't what we ordered. Server acknowledged the mistake but at this point we were all starving & didn't want to wait for 2 new entrees to be prepared. The owner did acknowledge the long wait but never stopped back by to check on us. A small gesture such as a round of drinks, dessert, or even some accommodation for the  2 entrees that were wrong could have saved this experience but no attempt was made. I approached the manager upon leaving to share my comments & concerns.  Yet another opportunity to try & improve this dining experience which fell on deaf ears. Prices are to high for the lack of service & mediocre food. A restaurant group that is this well established should know better instead of operating like it's amateur hour.I won't return nor will the 5 other people we dined with. Shelf life of this place won't last long."], ["Kimberly N.", "I have been anticipating the opening of this restaurant for over a year for two reasons:  as an architect, I was intrigued by the exterior renovations and wanted to see the finished interior, and as a foodie, I was desperate for some new food in Columbia.  First, I love what they did with the outside of the old John Paul's.  Assembly Street is in desperate need of character and, well, green stuff.  I'm also glad they incorporated a garage door to open the restaurant for al fresco dining without infringing on the narrow sidewalk.  That being said, I believe most of the interior renovations were reserved for the kitchen (which I know was probably pricey), because the dining area and bar could have been a bit more compelling--I'm hoping they'll continue to spice up the interiors with more colors, textures, and better-placed lighting (our table was very dim).  We also had our feet splashed with water from the sous chef watering the herbs outside the window we were sitting near.  It wasn't a big deal--at least for me in my sandals--and being more outgoing than my husband, I waved it off when I spoke to the managers, not realizing that the water had stained my husband's leather shoes.  Regardless, for such a weird mishap, and in spite of my non-chalance, I expected our dessert (or SOMETHING) to be comp'd.  Nope--didn't happen.Second, and probably more important, is the start of the meal.  We started with the lobster mac n' cheese appetizer, which wasn't quite as cheesy as I might have liked, but the pasta was al dente and there were generous chunks of lobster.  Problems started with our drink orders.  I ordered a gin lemonade, which I believe had cucumber and Hendrick's, and was pretty good, but my husband stuck with his normal scotch (on the rocks, with a splash of water).  His glass never should have made it past the bar, because the highball was full to the brim with ice and water which completely drowned his $15 scotch.  I was kind of shocked that the bartender was able to accomplish my muddled cocktail, but not a simple scotch and water--a fundamental that all \"fine-casual\" dining bartenders should know.  Third, my husband ordered braised pork shank with root vegetables and mashed potatoes.  His meal was melt-off-the-bone good. I ordered the lamb meatball with potato dumplings.  I was expecting perhaps knodel or gnocchi with a savory and moist meatball.  The dumplings were more like coquettes, but not lightly fried, and a bit too starchy and raw tasting.  They were bland--some egg, flour, and salt would have greatly improved their texture.  The meatball was far too lean, leaving it dry.  I'd suggest sticking with ground chuck or introducing some fat to the lamb for texture and flavor.  The tomato sauce was good.  Portion sizes were acceptable, leaving us with enough food for another meal.We couldn't decide between the s'mores mousse and berry milkshake, so we got both.  Both were pretty good, but I'd suggest picking just one and splitting it.  We suffered from sugar overload by the end of our meal.The reason, though, that I give this restaurant 2 out of 5 stars, is that I just don't think the food or ambiance quite stacks up to other restaurants in Columbia, or at least exceeds any of them.  The quality of the menu items was inconsistent, in spite of what we ended up paying for the meal.  Cola's is going to be one of those restaurants for me that was an okay dining experience that I don't plan on repeating; it's not something I'll ever be in the mood for--Cola's lacks the character in a restaurant that keeps me coming back.If you haven't tried it yet, go for it.  I won't be surprised if you have a much better experience that we did--I'd chalk that up, again, to inconsistency."], ["Noel H.", "Atmosphere was comfortable. Hostesses were positive and accommodating  when I rejected the first table.  We did not have to wait long to be greeted by our server who was pleasant and adequate throughout our meal.  Our wine selections were modest in price for the Vista area. In fact, my after dinner brandy was very low priced compared to what I normally pay. Our appetizer, scallops, was on the cold side of warm. The main entre for us both was the menu offered salmon which was served very quickly, hot and tasty. We were extremely pleased with this meal. The only negative was the lukewarm, old coffee served to us with after dinner. An alert manager noticed that I was setting the coffee cup to the side and immediately checked to see if everything was ok. I described the coffee.  She immediately replied \"I am sorry\"! \"I will get you two cups from a fresh pot\". Which she did and this coffee was Great!We enjoyed our first visit to Cola's and we look forward to returning soon!"], ["Laura H.", "Really loved the food! Had scallop app (a little salty), oyster app (not chewy at all) , trout with potato hash(yum), and crispy flounder (this place is sister restaurant of Garabaldi's). Service was a little slow but we weren't in a rush. Give this place a try!"]], "Bogarts": [["Caleb P.", "Bogarts is for sure my favorite spot in west Columbia. Excellent food all around with plenty of cheap beer plus free pool on Saturday! My personal favorite is the roaring 20s with wing chips. Awesome bartenders with great personalities to make your experience better, two thumbs up!"], ["Tamara C.", "Fun, local place. Loved Neecie, the bartender, and the wings were fantastic"], ["Bobby N.", "I think some of the best wings around & there are some good wing places in the area. My fav is Cajun Terri wings. They are not on menu but will make if you ask. Burgers are something you have to give a try also."], ["Adam B. J.", "This is a great West Columbia / Tri-City joint with great wings, burgers, and specials.   Personal favorites are the Big Country Steak, Mushroom and Swiss Burger and the wings!  CHINESE WINGS, if you are a West Columbia native and grew up eating at the Sub Cabin on Sunset Blvd, you can get the Chinese Wings of your youth here at Bogarts!  Keeps me coming.  Great Family place.  Cheap food, drinks, pool, etc."], ["Donna W.", "Took my mother and two sons for dinner.  I ordered a cheeseburger with mushrooms and with no mayonnaise and FLOPPY wing chips.  My mother ordered a cheeseburger all the way and FLOPPY wing chips.  One of my sons ordered chicken and a hamburger.  One son's order came with wing chips, the other did not.We waited about 20 minutes for our order.  When the order was served, the burger with mushrooms had mayonnaise on it.  I told the waitress that I ordered my burger with NO mayonnaise.  She said, ok can we switch the burger with your mom's and I'll get you another?  I told her No because Mom doesn't like mushrooms.  So she took the burger and told me that she'd go back to the kitchen and scrape off the mayonnaise and put on a new bun.  I told her I wanted a new burger with NO mayonnaise.  It took her another 5 minutes or so (so she scraped the mayo off, not time to make a new one) to bring it back out.  While she was gone, Mom and one of my sons tried the wing chips.  They were cold, like they had been recently removed from the refrigerator.  When she came back with my burger, I told her we needed new wing chips, since those were COLD.  We then ate our burgers, and when we were finished, the new hot wing chips were delivered.Never really had a problem before, so maybe we went on a bad night.  Seems the waitresses don't really care about the service.  Really a shame, because the food is good most of the time......"], ["Candice H.", "Local, small bar. Grabbed a quick dinner of salad and wings which were decent sized. The medium wing chips were just right and tasted great with salt and vinegar available on the tables. Manager/owner walked through thanking patrons for stopping in."]], "Skores Restaurant & Sports Bar": [], "Olde Town Hall Restaurant & Pub": [], "116 Espresso & Wine Bar": [["Sherry C.", "I came here for dinner last night and I really enjoyed my meal. The place was packed with people. I was thankful to get a table. It took the waitress a few minutes to get to us, but she did acknowledge us and told us she would be right with us, and she was. We got very good service. The food was amazing. So many choices of food. It took me forever to decide what I wanted to eat. I finally decided on the Crab Cake and Fried Green Tomatoes as my appetizer. It was delicious!  I also ordered a Pizza with Portobello Mushrooms, Pepperoni and Chorizos. It was excellent. My husband got one of the specials which was BBQ Ribs and Mac and Cheese. I sampled his food and it was also wonderful. Everything we had was definitely worth 5 stars. We will be coming back very soon!"], ["Ashley H.", "The best part of my weekends as of late has been 116's ridiculously tasty, puffy, fried potato hash browns with melty goat cheese and jalapeños. If you add their crabcakes with dreamy hollandaise and a spicy signature Bloody Mary, you have a damn good brunch on your hands. The service is always great and the vibe is pretty cool. I can't get enough of this place!"], ["Nannan T.", "It's a good place to have dinner. I like the paella very much. Their soup and salad are also tasty."], ["Rachel O.", "I meant to write this a while ago but I went back to 116 and had the marinated dolmas plate and the Wil Moore Farms scotch egg.  It was pretty much the perfect meal.  Ryan makes the best dolmas in town and the veggies and feta on the side just made the perfect bite. The scotch egg was also delectable and the 2 plates together = heaven."], ["Robert V.", "My wife and I were on the prowl for a trendy new spot for drinks and decided to give 116 Espresso & Wine Bar a shot. We were blown away! This place is seriously awesome and I regret that we showed up after already eating dinner. Nonetheless, we indulged in some wine while enjoying the views and beautiful summer evening weather with their outdoor seating, and we just couldn't pass up a delicious mango and brie appetizer. We will definitely be returning, especially after drooling over the food menu options. Prices are great hear and the atmosphere very cool."], ["Adam B. J.", "Went again on Saturday, and it was awesome again!  Same server, he's great!  I'm glad i gave them multiple chances, I'm now a huge fan!!!This is a second update, now five stars!!!This has become our go to!  Best mussels and clams in town!!! Best clams in SC!Always impeccable service!"], ["Tonya P.", "Very disappointed in this place today. I understand that you have limited space, but after a busted trip to the Food Truck Festival- all I wanted was a good brunch and some good Soda City eats, which is WHY I went to 116!! We walked in the door at 1:30pm and we were politely told by the hostess that your restaurant  were no longer seating anyone for the rest of the day?? You close at 3pm?? I'm not sure I understand this type of business. She only had 8 tables ahead of my party of 2?? Why were we turned away?? I have waited plenty of times here and I have never been turned away by any restaurant that had an 1.5 hours left in their services time. Not good business not matter how good your food is (and it is great) but really? It makes me think twice before coming back."], ["Alicia H.", "Love this place! Great food and friendly staff make this one of my favorite places to dine in metro Columbia."], ["Somer P.", "Let me start my review by saying this is my 2nd favorite place in the city. No one does hash browns like 116, but there are issues with the running of this establishment that really grind my gears. Let's start with today: arrived at 1:30pm, they close at 3. Was told by the hostess that she already had 8 people on her waiting list and she wasn't taking anymore names for the day. That is just bad business. I'm here an hour and a half before closing and you are telling me you won't take my money? That's confusing to me. Also, I love your brunch and I'm rarely off on Sunday's and when I am, I just want to be able to get my hash browns ok?Most of the male staff here is awesome. We love Ryan and John most of all. All but one of the female staff have attitude problems. I don't know if that's supposed to add to their local charm, but it's obnoxious. I've held off on writing a review for here for a long time, but it was time to interrogate reality and ask myself why I am tolerating rude waitresses, abnormally long wait times, being turned away and even in one case my fiancé and her friend were asked to leave while they were drinking coffee because they needed the table. And honestly it always feels that way, like you're being rushed to leave. Sunday funday is not about being rushed, it's about sipping mimosas and relaxing. 116, we've had some good times, but I'm really going to question myself before coming back because I just can't accept the mediocrity and refusal to expand your seating or change venues to accommodate your ever growing customer base. I want to return but I want you to interrogate reality yourself and come to these conclusions on your own. Read the book Fierce Conversations and let me know how that goes. In conclusion, this is still my 2nd favorite place in the city for now, but if you want to visit them arrive at least 30 mins before open on Sunday's and ask for John or sit at the bar. I hope they decide to expand in the coming years or I just don't see how they can continue to get business.I will also add that this was originally going to be a 2 star review but I added a star because other days of the week are not this difficult, I also enjoy their specials for events such as New Years and Valentine's Day."], ["Jill B.", "Amazing food, service and atmosphere.  I had the hash browns with goat cheese and it was the perfect combo of flavors.  All the food is fresh and perfectly cooked.  Highly recommend."], ["Linda O.", "Flawless personal first time experience here on a weeknight. Friendly, informative, and attentive service. While the menu was limited, they did have specials, and each food item was well chosen; unique food combinations and pairings that totally worked! The flavors in the watermelon and feta salad as well as the Brie were perfectly balanced. There was no way to conceal that this was fresh fresh! The small plate sizes fit perfectly into my diet. While the place is narrow and compact like a deep alley, I found it cozy and if you are claustrophobic, they have seating outside. The atmosphere was enchanting. I am making plans to go back again as they do have several lacto-ovo vegetarian offerings as well as waist-friendly options. I topped my wonderful meal off with a delicious coffee cordial which is so rare in this area. Even though this didn't effect my food, I am taking off 1 star because the bartender added chocolate chips to another customer's food item with his bare hands; no immediate hand washing prior."], ["Lea L.", "Simply put, this is one of the best brunch spots in Columbia.I have been here a handful of times for brunch and have enjoyed each visit. Be prepared to wait, we have sat at the bar a majority of our visits and still had to wait 30+ minutes.It is a small hipster-ish place with local art adorning the exposed brick walls. It gets very noisy and is always packed. All the bartenders and patrons around the bar area seems to know each other giving it a neighborhood joint kinda feel.The cocktails are amazing; inexpensive and strong. I did not like the Gazpacho Bloody Mary, it was too thick and tomato-y for me. The Nutty Rusputin was incredible, a must try if you like frangelico/hazelnut/kahlua.The biscuits and chorizo gravy plate makes frequent appearances on the specials menu and is a great twist on the classic dish. Highly recommend if you are biscuits and gravy fan.Most recently, I had a black bean and cheddar baked stuffed poblano pepper with cheddar grits and two sunny side up eggs. I have never had anything quite like it. It was one of those meals you find yourself daydreaming about.It is very well priced (Shrimp & Grits for $7? though I have heard not great things about it) staff is friendly and attentive and menu selection is unique.If you find yourself in the area on Sunday, I highly recommend getting out of bed early for this place!"], ["Allison P.", "My go-to place for Sunday brunch! You can't go wrong with a couple mimosas and an omelette. They let you get whatever toppings you want without charging extra. It's a small place but definitely worth the wait."], ["Tonia R.", "This is the best place in the Columbia area by far for brunch.  Since I eat out everyday I feel to give this local charmer 5 stars is making quite a statement. Service is prompt and polite. We'll worth the drive across the Gervais St bridge."], ["Daniel B.", "Great and unique menu full of fresh options. Excellent bar (bloody Mary's) selections. I very much enjoyed my brunch"], ["Frank M.", "This place is pretty fantastic.  Overall, the restaurant is pretty small and I'm sure would be filled up pretty fast on a busy day but it has a very nice look/feel.  I visited on a Tuesday night  (2/24/15) for dinner and there were only a few people there. Sat myself at the bar, which is a pretty decent size, and the bartender introduced himself and listed off some specials.  Decent selection of beer.I had the warm blue cheese dip for an appetizer and one of the specials, sweet potato raviolis, for an entree.  The blue cheese dip was very flavorful and hit the spot, bread was very fresh.  The raviolis were, how you say, amazing...came with a thick creamy white sauce topped with blue cheese....couldn't get enough of it.  Ryan, the bartender, is a pretty cool guy and knows his stuff.  Definitely makes the dinning experience better.  I can tell this place takes care of their customers.  If I were to go back to Columbia, this place would be on the top of my list!"], ["Rick T.", "My dining experience was once again super fantastic at 116 Espresso and Wine Bar. The moment you arrive you are greeted and have delicious drink within minutes depending on how many people are here. Last night the place was quite full, but that never stops the staff from taking care of business. We started off with a scotch egg which is local sausage fried around a egg, very tasty. Then we had a Cuban pizza with plantains which is good but I like the flank steak pizza here much better . After going through that we had another round Bells two Hearted a great beer from Michigan. And soon after that with had Cuban style shrimp on toasted baguette that paired well with the beers we were drinking. This is only my second dinner here, but I might have to change that, I hit this place for brunch at least once a month. Eating local is the best don't let anyone convince you otherwise!"], ["Theodore D.", "Showed up at 10:25 on Friday night. Kitchen closed.  Advertised as being open to 11.   So, call ahead to make sure.  NOT a complaint.  Just the facts. I like the place and go fairly often-great limited menu and wine list--but seeing the carpets rolled up all over town on Friday nights at 10:00 is irritating.  I'll go for make-up brunch soon."], ["Anthony A.", "Great food, great service. The restaurant is a bit small, and crowded. But the dining experience is still wonderful.  The service won me over and the food was fantastic. It really wasnt all that expensive either."], ["Adrianna S.", "Great food, great wine, great service! Sat at the bar during Happy Hour...loved it! Ryan is fantastic and makes you feel very comfortable. Had the crab cakes, plate with chimichurri sauce and paella. I would recommend all of them. When and if I am back in Columbia, I will definitely be back!"], ["Tiffanie C.", "I came 8pm on a Tuesday . Not too crowded , convenient parking . LIVE music! I ordered a bottle of wine $26 which I was allowed to cork and take the rest home. Ordered the daily special which was shrimp and andouille sausage over cheddar grits. Awesome and rich. Took half of it home. Also tried the cheese plate which tonight consisted of a balsamic soaked parmigian, a smoke bleau, and an apricot Stilton cheeses served with orange slices, strawberries and almonds. Total bill $53 with tax but worth it!"], ["Collin S.", "A few weekends ago, I decided to check out the brunch scene in Cola since I'm new to town and coming from the northeast corridor (DC-to-NY), brunch is a weekend pastime.Relying on the Yelp reviews, I was hyped to learn about the stuffed french toast.  However, it was all gone when I arrived.  Unfortunate, since the place was only open for about 2 hours at that time.  So next time, I suppose I'll try to get up and arrive by opening at 10AM.I got the shrimp and grits.  I normally like shrimp and grits, but this was interesting.  The standalone grits were very, very good.  However, the tabasco topping/sauce was gross and overpowered the rest of the food.  Also, there were too many peppers/onions/tomatoes in the grits.  Lastly, the shrimp was very clearly undercooked.  Veins were not visible, the shrimp was all white, and a few pieces tasted gritty and tasted like seawater...the hallmarks of undercooked and/or raw shrimp or shellfish.  Since I didn't want to spend the rest of the day listening to the NFL playoffs from the comfort of my face in a toilet, I picked around it and tried to choke down the grits.My recommendation would be to simplify the grits dish.  No need to change up what are clearly very tasty grits on their own.  And actually grill the shrimp if it's supposed to be grilled, come on.Despite my rating, I'll try to come back and try again...hopefully with french toast available."], ["Ashly G.", "Food is decent but getting a table on a Sunday for brunch is heinous. After waiting for half an hour for our table, it was given to someone else who claimed to be us.  After the hostess was informed of this, she did go and ask the couple about it. They admitted to taking our table but didn't bother getting up. Rude!  To add insult to injury, the hostess did nothing about the situation and we waited another 10 mins to be seated at the bar.  Was the food worth the wait? No.  The bartenders were, however.  They were not only professional but very charismatic which made the wait ok.  Might consider revisiting on a less busy day."], ["Ashlee F.", "Shrimp and grits were quality well seasoned, good portion with plenty of shrimp. Crustless quiche bacon spinach and Swiss the eggs were fluffy and creamy very light with Bacon crumbles, I just with the spinach were beat into the eggs rather than on top. Caramel apple stuffed French toast was good. Very rich. For a small city like Columbia the brunch was good."], ["Kenny K.", "Incredible brunch! HUGE fan of 116! In my opinion, it's the best brunch in the city. I had the chicken and waffles and it was incredible. My wife had the steak and eggs and she loved hers too. I've never eaten there in the evening, but please believe that their brunch is worth a trip. I'll be back this weekend!"], ["Amanda R.", "Their brunch is absolutely amazing.  High quality, delicious food at great prices.  Wonderful mimosas.  The hashbrowns are a must-try.  Great service and friendly staff.  I need to try dinner now!"], ["Neal S.", "Went there for a pre night at the zoo snack.Great food and service."], ["Kristy Q.", "This is a great local spot. The food is Spanish inspired and really delicious. Very small interior - but feels cozy, not cramped.  Creative cocktail list!"], ["Amanda F.", "Becoming one of my favorite gems in Columbia.  Finally got to make our way in for dinner with another couple. Server was attentive and offered great suggestions. Started off with a round of drinks - I got the American Harvest drink special - some sort of basil and vodka concoction and it was delish! Moved on to apps to share - baked Brie with peach chutney (app special), mussels, fried green tomato and crab cake Napoleon. Yum yum and YUM! One of the people with us doesn't even like mussels and said he is now a fan! The broth with the mussels is to die for! Moving on to entrees - I got the Huevos rellanos and the ensalada 116. Just stop what you are doing now and GO GET THE HEUVOS RELLANOS! Sounds weird - tuna and deviled eggs?! Just trust me and go get it!Food coming out was perhaps a tad slow but for a tapas style restaurant, I am fine with that."], ["Schylur W.", "We had krisslynn and received excellent service. The menu had a pretty good variety and the server was very knowledgable of it. Did a great job recommending items. Drank an old fashion. Wasn't a fan of their version with the sugar cube. The drink was very strong, which is good and bad. Taste was off, but obviously can't complain about strong drinks. Food tastes excellent. Great date spot as well."], ["Damon S.", "My favorite tapas restaurant in Columbia! VERY small, it's a hole in the wall. Love how they have small tapas plates as well as larger, entree size plates as well. We haven't had anything bad here! The fried green tomato small tapas plate is AMAZING! I always recommend this place to anyone looking for a new restaurant to hit up if they haven't been there."], ["Gregory G.", "This is one of my favorite spots in all of greater Columbia! If you don't mind driving across the bridge in Cayce/WestCola then check this place out. I've been coming here for years and the food is always delicious. The restaurant itself is a bit on the small side, kind of Brooklyn, NY style, but the decor is cool. The bar staff is fantastic and table service is usually great, even though some of them give you \"hipster indifference\" during the service interaction. I really have never had a bad meal here and I always bring my out of town friends here for a great bite. If you're looking for a great brunch spot too, then this is your place. Tri-Color hashbrowns...mmmm...Enough said."], ["Danita R.", "You know how you drive by a place all the time on your way to everywhere else, and you look over, see it and think, \"That looks like a cute spot,\" and you keep on driving? 116 looks like that kind of place. I was passing through town myself when a couple of friends lulled me into what seriously looks like a hole-in-the-wall. And you know what they say about gettin' your eat on in the hole-in-the-wall ...And if you don't know what they say then I suggest you go and grub on the Grilled NC Berkshire Pork Chop. \"P\" is for pork chop and perfection. (I am a terrible food photographer, but y'all 'twas scrumdiddlyumptious.) The accompanying Greek orzo pasta salad was fresh and light, and overall the plate made for a filling and tantalizingly tasty combination. You know it's good when someone else at your table keeps one eye on your plate the whole time they're eating their food! That is not at all a cheap shot to the chimichurri tasting plate, but it's just what it says--a taste. The pork chop is perfectly portioned and righteously grilled.My friends and I shared the spinach and artichoke dip. It was warm and rich and plentiful, a great setup for a filling, but not too full meal.Marvelously attentive and courteous staff; artsy-neat decor in a sweet 'n small intimate setting (just a few tables in this spot); interesting variety on a menu that uses fresh and local (and delicious) fare. A bit bummed I didn't enjoy a cup of coffee, but the sangria hit the sweet spot :) If you keep driving by this place you're missing out on good people and great food (at really great prices, too)! Stop going for the same ol', same ol' and try something new--116's staff won't disappoint!"], ["Amber G.", "I really wanted to like this place. My friends and family rave about it, so I'm going to give it the benefit of the doubt and assume that I just had a bad experience. It wasn't especially busy when went, but it took an unusually long time to get our food.  The service was friendly, though. I ordered the shrimp and grits, which I usually love. These simply weren't very good. The grits themselves were tasty, but the Tabasco sauce topping wasn't even mildly spicy and resembled canned condensed tomato soup in both flavor and appearance. The shrimp had an odd texture as well. I'd be willing to give 116 another try, but I would definitely order something different next time."], ["Michael M.", "Great food at this little restaurant on State Street. We just had a Sunday brunch 25 dollars which includes 3 entrees for 2 people. Definitely try the 3 potato hash browns."], ["Stephanie V.", "My favorite restaurant in Columbia. I've been here several times and each time the experience was close to perfect.  Food is consistently spot-on, especially the crab cakes, cioppino, and smoked tomato bisque (this coming from a girl who loathes tomato soup - seriously, just try it).  Service is always friendly, ambiance is hip enough that the place would be at home in some city infinitely cooler than Columbia, and from that side of the river, downtown glitters and gleams like somewhere you'd actually want to visit.  And reasonable prices to boot!My one gripe is that for a restaurant that bills itself as a wine bar, I think the wine list is pretty unexciting.  But if you don't find an appealing vino, a tiramisu martini or one of the other intriguing concoctions should make for a good consolation prize.Also, be forewarned that it gets super loud and crowded during peak hours (people know what's good!), and parking can be a bit of a mess, so I'd suggest going later in the evening if you want to have a conversation with someone, or with yourself."], ["Ken H.", "After deciding to visit Columbia for the first time on a whim to see a concert, we stumbled upon this little place as it was right near the New Brookland Tavern. We lucked out and scored the last table. The restaurant is setup shotgun style - very narrow. For this tapas place, it definitely adds to the ambiance. Almost all of the small plates - baked feta, mussels, and portobello cap were delicious. The only miss was the jamón y melon. The ham wasn't quite salty enough and the melon a bit under ripe. The large plates - chimmichurri sampler and pork shank special were excellent. The drinks were inspired and surprisingly cheap at $6-7 a pop. The service was very friendly and paced appropriately. You can tell they have a small staff but still work together well to get the job done. Should another trip to the Midlands be in the cards, I'd definitely double down on 116 again."], ["K P.", "We found this wonderful spot just after moving from Atlanta. We had high expectations, but 116 didn't disappoint. AND THE PRICES - what?? We're not in Atlanta anymore and maybe that's a good thing! Great little spot for dinner and brunch. We take everyone here when they're in town to visit! The restaurant is also located close to the Cayce RIverwalk, which is convenient for an after meal walk when you're just too full from all that goodness!"], ["Annie D.", "This adorable neighborhood cafe is the cafe every neighborhood should have. Especially at brunchtime. Or at wine time, I imagine.The service was so.damned.friendly for brunch. It's a small venue, so the staff let us know there would be a bit of a wait. We shared the little waiting area with some charming older ladies, who were on a double date with their husbands. It was kinda rainy and the husbands dropped them off first before they parked the car. Gentlemen, take note.I ordered the three-potato hash with gold, purple and sweet potato, peppers, jalapenos, onions and goat cheese. Also, fried eggs on top. It was spicy, tasty, starchy, eggy... exactly what I was in the mood for. It was delicious enough that I can't even remember what my fiance ordered.It's a wine bar, but they also offer a full set of Bloody Marys, spiked coffee drinks, cocktails and margaritas. Also... four kinds of Russians (not just the white ones!).Thanks for a lovely morning, 116!"], ["Brandy W.", "This place just keeps getting better and better.  My first visit was over a year ago and I remember the plantains were fabulous. On my second  visit,  they were a bit disappointing.  On my third visit they were very good but I branched out and tried the Lebanese eggplant.  IT.  WAS.  SO. AMAZING.  FOODGASM!  The dish was totally different than I expected but so light and refreshing! A flavor explosion!   In our most recent visit, every dish was excellent.   We started with the Lebanese eggplant with some awesome bread to soak up that tasty broth, then an amazing artichoke bisque,  the delicious chefs pie (flatbread pizza),  then a fantastic key lime pie from Florida.  Did I mention the $18/bottle wine special????  And the excellent service???   Sometimes it's very crowded and loud,  and this is why!!!"]]}