{"Rue 77": [["Niki S.", "Food & service were great. I had the chicken curry which was delicious and came with the best bread I've ever had! My girlfriend had the psycho burger and loved it. We will definitely be back!"], ["Searrah R.", "I have had it with this place. It's my birthday weekend I was told the kitchen would be open all night, here we are about to leave and I had no food, the number one priority of an establishment should be customer service and I didn't get that. Couldn't even speak to the owner after seeing him numerous times. Thanks for nothing rue."], ["Sed F.", "Horrible service. Walked in and no one greeted us. Sat at the bar, still nothing so we left."], ["Daniel D.", "Dear owners:Just after 10pm this evening I headed out to eat something from whatever's within walking distance that's still open. According to yelp, Rue 77 was one of them. I'm a sucker for some good Mediterranean food, and after seeing some movement in the restaurant from a block away I figured I'd be in luck. As I crossed the street to see if there's a menu posted outside, I hear a commotion. Apparently the staff is having a pretty rowdy time on a slow Monday night. I'd be cool with that if I didn't hear a gentleman screaming \"we're closed man, we're closed keep walking\" from inside, to the delight of his laughing coworkers which appeared to be wait staff. I'm sure they just had a long day, and so have I.  Honesty at this point I couldn't care less about the food, now or at any point in the future. Way to make a first impression before even stepping in the place."], ["L H.", "This place is absolutely amazing. If you have not been, GO! When I first walked in the door I was amazed - in a good way. The atmosphere is so inviting. The owner greeted us personally and he was very nice. With that being said, I was impressed with customer service...the food was delicious!! The food was fresh, seasoned well, had great presentation, and the prices are reasonable....I will definitely return."], ["Josh R.", "I've had my share of samosas but I've never tried Lamb Samosa. LET ME TELL YOU! It was amazing! I'm an instant fan!"], ["Bill R.", "Lousy food, not at all what they advertised on the website. Looking forward to a San Miguel beer, they had none .iwill not go back"], ["Christy S.", "Came in for a late lunch. We were the only patrons   We were graciously greeted. The service was excellent. The food was fabulous. The Philly Kati was yummy. The fresh made pita chips were the best I have ever eaten. They melted in my mouth. Highly recommend for the service and food."], ["Sheetal R.", "As a New Yorker who wandered into this restaurant on a business trip, I was thrilled to see Kati rolls on the menu.  The Kati Roll Company is a popular late night eating place in Manhattan, and after meeting with the owner Arif (who spent the bulk of his career in New York), it seems Rue 77's kati rolls are inspired by the New York restaurant.  While they're a little different, Rue 77 made a good kati roll of it's own.  They are soft and chewy and filled with veggie curries that tasted fresh.  As I am of Indian origin, Arif (the owner & chef) said he'd make them with medium spiciness for me (which I would suggest)."]], "Pitas": [["Linda O.", "I liked the open space for dining and you can see right into the kitchen.I loved the contemporary dinnerware but they could upgrade the paper napkins to a nicer quality to match.The service was quick, friendly, and efficient.  They got all 5 orders correct.I got the Sampler Platter appetizer (sans tzatziki sauce to make it vegan) and they immediately offered me more of another side (Wow! No one does that) so I got extra veggies which was awesome because I used the sliced cucumbers instead of the pita bread for my hummus and baba ghanouj. I thought everything was very tasty and the tabouli was packed with fresh chopped herbs and flavor. It is 0.8 miles from Providence hospital and we were in and out in an hour. I recommend!"], ["Tamara C.", "I just had lunch here. My server was terrific - can't say enough nice things about her, and am sorry I didn't get her name. Service was excellent, quick, and attentive.The gyro sandwich was tasty, but the pita was terrible! It was so DOUGH. It reminded me of a hamburger bun. That pita is the only thing that would keep me from returning - or, next time, I'll just order a salad, and skip the pita altogether.Apart from that, the place seems clean and bright."], ["Mike M.", "Falafel and pasta salad for lunch, was delicious. Service was great, proces were reasonable. Will be returning"], ["Furman L.", "When you have a craving for the freshest Mediterranean food in Columbia, Pitas should be the place that pops up in your mind. The Greek Pizza and Gyro are two of my favorite items on the menu. The pita bread is amazing (made in-house). Tzatziki is always a great choice, too. Sweet tea always tastes great. Prices are incredibly on par. A couple can easily eat for $20-25 and walk away full.Parking is easy and free in their private lot, but can get tight during the busy lunch hour. That being said, there are 10+ street meters adjacent to Pitas always available for overflow parking.  Location is great, just a few blocks away from Palmetto Health Baptist Hospital. One of the two owners is a cardiologist, so you can feel good knowing that the food served here is (mostly) heart healthy. Have dined here many times, and have also ordered takeout. Both experiences always exceed expectations.Highly recommend Pitas."], ["Chad A.", "Murm was exceptional in walking us through the menu. I had the lam schwarma. My wife had the chicken Taziki wrap with babaganush and falafels as sides. The service was uber quick, and the food was REALLY delicious. I will come here every time I am in the area, AND they offer a ACtive Duty military discount!"], ["Elaine S.", "First time trying...drive by it every day on way to work...called today to order take out for lunch...picked up right away, took order-very helpful-order was ready 3 minutes later when I arrived!  Food tastes very fresh and super yummy!!!!!  I WILL be back!!!"], ["McKenna C.", "Overpriced. Not authentic Greek food. Sub-par pita bread. I would go somewhere else. Very much Americanized Greek food. Definitely not my idea of good Greek food."], ["R C.", "I have went to some great Mediterranean / Greek places and this is not one of them.So I can only guess that I didn't order the best thing in the place since there are others that have reviewed this place and have liked it.  I ate there yesterday for lunch and I ordered a chicken gyro and an order of pita/hummus.  The Greek sauce is good, the chicken had an odd texture and the pita was totally dried out.  I tried to eat the gyro and the pita just fell apart and I had to eat it like a salad - that is fine, but not what I ordered.  The other order of hummus/pita was just as disappointing.  The hummus was much more watery/runny that it should be and again, this pita that they gave me for it was dried out....at least the hummus helped :-)  Note, the hummus had little/no flavor - quite surprising.And for the price?  $15.57 - really, for a gyro, a little bit of fries, and some hummus? WOW, I guess if they can get it and stay in business, it must work for them.  My guess is that this place stays in business by being \"just good enough\" for the people close enough at work to grab something to stave off the hunger pains until they can get home to some real food.I would suggest that if you do eat here, don't order what I did.The guy that took my order was nice and the place was clean, but  with other places around for lunch, I won't ever be stopping in this place again."], ["Frank A.", "Great Lebanese food, run by folks who enjoy what they do.Most importantly, THEY MAKE THEIR OWN PITA BREAD.  yeah... they don't bring it in - it's done right there.  Only place I know in Columbia....Decor is rather sparse and plain, but it works. I get the gyro or falafal - both are great...."], ["Mike O.", "Other than the weird stiff upper lip when I asked if there was any coffee during the lunch hour (there was) the food here was great. The hummus was a little tahini heavy, but that's okay, just watch out. I got the veggie gyro and it was delicious. I wish I had ordered the falafel gyro because I tasted it and it was very, very, very, very awesome. I would come here all the time if I lived in Col'a."], ["L M.", "Sorry, but it was awful! Maybe I ordered the wrong thing because the place was crowded. Worst pita bread ever, so tough and chewy. I ordered the chicken pita and the chicken had so much gristle, I had to take it out of the sandwich and trim it, and  WAY too salty. Had rice as a side dish and the rice tasted like chicken?! Must have cooked it in chicken broth and added MSG. An hour later I was SO thirsty! Ick.. won't be back..."], ["Rachel O.", "Boyfriend and I both thought the food was very fresh and tasty. The tzatziki burger was excellent and Boyfriend loved his gyro. The pita bread is the best I've ever had. The hummus is tasty but I think I prefer the hummus at Devine Foods. The prices are reasonable and they do have some traditional Greek food items for sale including freshly made pita bread! :-)"], ["Julie R.", "This is quickly becoming one of our favorite go to places for Greek food. Everything we have ever eaten from here has been spot on! Our favorite dishes include the kafta dinner, the gyro ( of course) and their pizzas! They make their pizzas on their awesome homemade pita bread so they are kind of more like an appetizer but totally delicious. Also their hummus and dolmas are great as well. We have always gotten takeout here so I can't speak for the service but the people who run the place are alwàys nice. I even got a free piece of backlava after ordering a big takeout order. Good portion sizes as well. This place is definitely worth a try!"], ["Jennifer W.", "I have worked two blocks from this place for 3 1/2 years and am kicking myself for not trying it sooner. I read the mostly favorable reviews and decided to go. Wow. Every compliment is true- super fresh food including crisp greens and a soft and chewy pita. On a whim I got the soup of the day (a 15 bean soup with bacon and sausage) to go and am so glad I did. Very flavorful. The only disappointment was the cocktail weenie type sausage. Didn't affect the flavor, just weird. This will be a place I return to frequently. Get past the lack of ambiance and try it, it doesn't disappoint!"], ["Crystal C.", "Pretty good, good price, quick service and nice people. Though I only got takeout, the food was decent. It wouldn't be on the top of my Greek list but I would go again."], ["Korey W.", "I was really happy I went here for lunch. very good food and reasonable prices for lunch. the only things were parking was kinda tricky at lunch time and the dinning room has a school lunchroom feel to it."], ["Jodi B.", "Nice lunch place. I had the Mediterranean pizza with hummus and baba ghanoush for appetizers. It comes with a home made hot sauce, shatta, that made everything delicious."], ["Johnny G.", "One of my \"fabfav\" restaurants  in Columbia! Mark, the owner, whips up fresh Tzatziki sauce, hummus, & homemade pita bread that keep you coming back. Really good food!"], ["Cole M.", "Great authentic Lebanese food. Not the best ambiance but really good eating. Try it.... You won't regret it."], ["Kel B.", "Pita's is delicious, authentic Lebanese and Mediterranean food!  The staff is extremely friendly too.  I have only tried a few things here, but everything I have had was great and reasonably priced.  The previous review about the restaurant feeling like a school lunchroom is true though, but the food is too good to care.  Try it!  The chicken dishes are especially good.  Not sure what they put on their chicken, but it is awesome!"], ["William F.", "I am a local chef and don't normally do things like this. Here goes...My partner and I had one of the worst lunches ever. We were slowly greeted and told to sit where we liked. There were napkins under the tables and the window casings were dirty. We chose food from our waiter's recommendations. The food was a long time coming. It probably took awhile to prepare such dry chicken. My tzatziki chicken wrap was a nightmare of flavorless sauce and large chunks of dry chicken..the unseasoned frozen fries made me sad. My partner's kofta platter was not much better. Barely warm and served with unweildy soggy salad. How can you mess up a greek salad? Even the olives were soggy. The service was lackluster.we got the untotalled check...I guess we were supposed to add it and figure out the taxes...well you get the idea.I would NEVER recommend this place."]], "Greek Boys": [["Courtney B.", "Best gyro in Columbia!!!! ...almost the only gyro in Columbia. But don't let that fool you. Their gyros are effing delicious! My only complaint about this place is that they're only open for lunch. I understand that downtown is practically empty after 6pm. But I'm almost never free at lunch. And when I am, I'm nowhere near here. So I don't get to eat here as often as I would like."], ["Emily E.", "Worked in downtown Columbia almost 10 years and just tried this place.  It was hard to get in because of being so crowded and parking is a mess, so definitely walk here if you can.  You order at the counter and then find your own table while waiting on them to bring out your order.  Don't be a newbie like me and wander around aimlessly trying to figure out where to go, enter, then go left and find the menu listed above the ordering counter.  The gyro was good but portions were slightly smaller than I would have liked.  Flavor was good.  I might come back at a less crowded time and try something else next time."], ["Dick W.", "I'd give this place ten stars if I could. Great Greek food at great prices, nice people, family owned and run, Columbia lunch iconic spot."], ["Rachel O.", "I used to go here regularly when I worked downtown and I love it so much I'm still willing to fight for a parking space to grab a gyro!Parking is a bit difficult during the lunch rush but there are lots of meters around... you just might have to drive around the block a couple of times to find something. The chicken gyro is delicious. The sauce is DEVINE!  I get 2 cups so I can dip my fries in it too. The baklava is nice and they also have other sweet treats.  The staff is always friendly and I also like that they have a separate pick up window so if you call ahead then you don't have to wait in the line! (It does get packed at lunch so I'd suggest heading over a little before noon or waiting until 1:30ish.)It might be a bit of hassle to get to but it's well worth it for a quality lunch!"], ["Haylee G.", "My boyfriend and I tried Greek Boys for the first time yesterday. We went meatless since it was Ash Wednesday and just got the Greek Salads. We weren't that impressed with the salads - seemed pretty simple (iceberg lettuce, couple of cherry tomatoes, a couple Greek olives, and a few peppercini peppers). I felt like the portions were a little small.I definitely want to go back and try more from the menu. The chicken smelled amazing and the sandwiches looked wonderful. More so, the staff was friendly and the atmosphere was clean."], ["Mark D.", "I had the Greek Salad with chicken. The chicken was tender and so tasty. It was cooked perfect and juicy not dry. This is all I had there so far but everything looks great I will be back."], ["Jay B.", "It wasn't too bad. I think the fact I went in during everyone's lunch break is what made it a little unenjoyable. The food seemed kind of rush, fries were room temperature,  and was really loud. I'll have to come back at a less busier time for sure."], ["Jason R.", "My wife and I go here often for lunch and they have never missed a beat!  The staff is very friendly and the service is fast. Usually I get the chicken souvlaki sandwich (pita) and it's always fresh and tasty. The only negative I can say is they are only open for lunch during the week.  That just makes it all the more special when we eat there!"], ["Steven G.", "Stopped in for lunch. Friendly and quick service with great good. Ordered the chicken tips which were served on a bed of rice with honey mustard sauce. The chicken was very moist and well seasoned. The side Greek salad was also delicious - fantastic dressing. As someone who was passing through Columbia, I'm glad this place was recommended to me. Keep up the good service!"], ["Joshelyn ..", "Whoever says this place isn't great, needs their taste buds checked. This place is soooo good! Those chicken tips with the rice and Greek salad are to die for! I love this place so much my coworkers and I have eaten here 3 Fridays in a row! I just hate they're not open on Weekends. Get there early because they get crowded quickly!"], ["Bryan M.", "I have worked in the area for over 5 years now, and it's no secret that Greek Boys is my favorite place for lunch. Pretty much anyone can find something on the menu that they'll enjoy, such as pasta, beef, chicken, and burgers (which I hear are really good). I'm partial to the tilapia and salmon, which can be prepared grilled or blackened and come with rice and Greek salad. Business is good, so if you visit during the lunch rush don't be surprised if seating is limited, especially for large parties. It's worth fighting the crowd though."], ["Ka T.", "Found this nice little cafe around the corner from a convention i was attending.  The place seemed very popular and the food was very good.  Had the beef tips. Only problem they had was NO Soup on a cold day.  I was pretty bummed"], ["Rick B.", "Great lunch.  Greek salad is great.  Shrimp po boy is my go-to lunch choice."], ["kido m.", "food is good, only problem I have with them is they close middle of day at 3 pm.!!! I don't get it... my lunch starts at 2:30, tried many times to have my lunch at this place, and the door always locked....!! they should change their hours at least till 5pm... so they will get way more business!!! I just don't get it..!!:( :("]], "Olive Grill Mediterranean": [["Gregory G.", "If you've ever been in Olive Grill then you've probably seen me. I eat here almost every day. The food is delis and Leslie (owner/register person) is so friendly and welcoming. My entire staff loves the food and restaurant. I can't say enough good things. I usually get their chicken which is marinated to perfection and when they have they steak you should definitely try it. The falafel and hummus are delis as well. Be prepared to sit and enjoy your meal those as everything is made to order and isn't super speedy but I guarantee you it's worth the wait.Oh! And you absolutely must try a Pecan Tart. I \"try\" them daily! Ha!"], ["Brandy B.", "Service is consistently excellent (\"sometimes you wanna go, where everybody knows your name\").Food is consistently fresh (I always get the falafel gyro, and maybe fries or a Greek salad).So glad this place is walking distance from my job - if I forget to pack my lunch, I can count on Olive Grill for a reasonably priced meal!"], ["W T.", "This place is just around the corner from my office, so I visit pretty often. I've yet to try anything bad. The gyro is deliciousssss. I usually get it with grilled vegetables and order a side of tzatziki to dip it in, but honestly it's good all by itself. Falafel here is the best I've had anywhere close by. Perfect crunch on the outside, and well-spiced with whole pieces of chickpea still inside. Bit into one once and honestly thought that I might be able to go vegetarian if all meat-less entrees tasted like that. Oh and don't underestimate the soups. You can sample whichever is available that day, and there's a bean soup that makes cold weather in Cola almost tolerable. Only gets 3 stars because the sauce portions are really small and there are no frills in presentation, but all-in-all, you should eat here because it tastes good. Period."], ["Rae H.", "I had a pecan pie tart, and the bltc.  C for goat cheese.  The bacon was thin and crisp, and served on a baguette that was perfect--not too crunchy and not too soft.  It was served with a mixed green salad that was cool and fresh.  Their house dressing is a vinegrette with lemon juice that was the perfect amount of acidity. They also have a good selection of vegetarian options if that suits your needs. Parking isn't a problem even though it's downtown because it is right beside the new city garage, and only two blocks from the old city garage on Sumter.   Catch it at the right time and there is a fair amount of street parking available,  too.The interior is clean, bright, and the family that runs it is friendly, and quick.  This is a great lunch spot with comfortable booths and a welcoming energy that makes you want to sit a spell and retreat from the usual downtown bustle."], ["Rick T.", "Thanks to Yelp I have found a new lunch spot that serves quality Lamb Pita and Moroccan stew. The stew is well balanced and the all flavors come together, pour the stew the over basmati rice and you are in flavor town. Moving on to the Hummus, well all I can say is I want more and more It has a clean fresh taste that goes well with pita bread. The Lamb Pitas are really great too, not to dry and the vegetables were fresh. The perfect amount of food for a lunch date. My meal was so good I got a regular Gyro to go to eat later. I found by talking to the nice lady that took are order and served are food that the chef is from Iran and specializes in this type of cuisine. Olive Grill hopes to one day be at the Soda City Market doing Gyros and I hope they bring their Hummus cups. I told them I would personally like to see them on Saturdays coming to represent the different types of cuisine that is ever growing on Main St. and Columbia's food scene in general. So I hope everyone will enjoy eating here as much as I have today!"], ["Adam B. J.", "My wife and I went for lunch after reading about this place.  I cooked in two different Greek Restaurants for almost three years, and I must say Olive Grill's Gyro is an A+.  We got the Mediterranean salad as a side, and after putting a couple spoon fulls on top of the gyro it was even better.  I got the Felafel Pita which was also good (more authentic after adding some of the Mediterranean salad on it).  Hummus is one of my favorite dishes so I tried the Hummus as my side.  I'd say go for one of the salads or fries.  In a town with not that many ethnic choices, Columbia does have some great Mediterranean places, and I'd get your hummus fix at one of those.  Quick, clean, and good service which is always a plus.  We will be back!"], ["Emily E.", "Just found out about this place today and gave it a try...very happy with the choice!  Very nice menu with lamb, chicken and vegetarian options.  I'd recommend any of the pitas or platters and Mediterranean salad was fresh and left me wanting more.  Prices are $10 or less.  Next time I'll try the baklava or sand tarts for dessert.  Great addition to Taylor St and very good friendly service."], ["Lissa J.", "I wish I had read the review on Free Times here free-times.com/restauran… before I dropped in. I ordered a 'gyro pita' combo which btw doesn't a gyro assume a pita? IDK - it was a little dry. I wish i had ordered some extra tzatziki sauce for it. The pita was soft and fresh however. After chatting with the very friendly lady at the cash register, I opted for the Mediterranean salad instead of fries. This was a good call. It was chopped cukes, tomatoes and onion in a very tasty oil and vinegar dressing. Just wish it were a bigger portion! If I go back I will try one of the more signature dishes."], ["Juan G.", "I found out about this place through family, and I absolutely loved it. I went with some friends and it was lovely. The atmosphere was very friendly and the service was great. I tried the steak and chicken pita and it was delicious. I'll definitely come back again!"], ["Chris K.", "Specials were a good price. But the drinks were watery,  even the tea. The gyro was a little pricey for the size. Overall it was decent."], ["Bonnie W.", "My favorite new place downtown!  I love Mediterranean food, and this place is great!  The service is WONDERFUL and the food is delicious. I really like the falafel, the gyro is perfect, and the lamb and Lima plate is very tasty.  The only thing I don't care for is the stuffed grape leaves, but that's just my personal taste."], ["Gilberto M.", "Persian / Greek Restaurant. I guess for a Persian, the rice will be ok but I was not a fan of the rice. The lamb was served as a beef stew. That is what lamb in a savory sauce means. The tzatziki sauce has a Yoplait Yogurt flavor. I preffer Pitas better but I will give them a second change in a few weeks or month. Not sure when they opened but I believe it was recent."]], "Taziki's Mediterranean Cafe": [["Adam B. J.", "If you like fast casual dining and Greek/Mediterranean food, Taziki's is a place you'll want to check out.  The food is good and it is fast.  I've had the hummus, the dalmades, the chicken lemon soup, the lamb gyro, and the chicken gyro.  All I'd order again.  My wife likes the \"Chicken Roll-ups\".  The sides are good too.  I always get the cucumber tomato salad, but my wife says the fruit cup isn't to shabby.  A little to much filler melon, but better than canned fruit some people give you.  Wish there was a location closer to our house.  Great quick dinner pick-up food, with lots of healthy options."], ["Anna D.", "overall experience was pleasant. i feel like i spent a little more money than i thought i would but the service was so great i don't mind. the cashier was such a sweetheart and even came by afterwards to ask if my hubby was okay with the side i choose for him (rice) and she even offered to change it if he wasn't happy.the two of us got lamb gyros and for my side i got the cucumber and tomatoes and like i said, hubby got the rice. we both enjoyed the food but i do wish that the pita wrap was softer. it was pretty hard and i love fluffiness. it's nothing to dock off any stars for since it's personal preference. I would suggest any lamb lovers to try it. it's tasty and light and you leave the restaurant not wanting to roll out."], ["Chad A.", "Very consistent gyros and prompt service. I usually get the grilled lamb gyro. However, the turkey club ciabatta, and beef tenderloin are crowd pleasers as well. You can also never go wrong with their dolmades plate. Best of all.......being a Soldier, they offer a 10% Military discount. It is a really great place, go try it!"], ["Rachel O.", "Taziki's has definitely grown on me.  I've been 3 or 4 times now and I must admit that I was a bit iffy on it after my first visit but every other time as been great.The last time I went I ordered the hummus with pita chips.  You can actually order it with toasted (crunchy) pitas or soft warm pitas.  Soft and warm please!  I didn't realize this but asked after they already brought us the crunchy ones and they replaced this quickly and with no extra charge. They were delicious and the staff was so nice!I ordered the Chicken feast with potatoes for my meal and it was also delicious.  The taziki sauce is totes yum - not super thick or super runny... just right! The potatoes were well cooked and seasoned (but a bit sparse... maybe that was good since I just carbo loaded on all that pita bread). Chicken was also well prepared and moist, served in strips. It also came with a Greek salad.  I felt like it was a well rounded and healthy meal. It's great for lunch or dinner! Don't miss out on that baklava or cake along the divider where you order too!"], ["Brandy B.", "Overall my experiences at Taziki's have been good.I've gotten to-go once and dined in once.On my first visit we ordered the veggie gyro w. the tomato/cucumber salad as a side, taziki dip, kid's grilled cheese w. a side of fruit, and greek chicken salad. (Combos and kid's meals come with plain old salted \"ruffles\" type potato chips and a side).The gyro didn't travel well, by the time we got home the juices from the grilled veggies had soaked thru the pita, so it was kinda messy (I'd order it again, but for dine in only).  I thought the taziki dip was too runny and didn't pair well with the baked pita chips.  My son loved his grilled cheese, and fruit.  My dad liked his greek chicken salad.2nd time, my bf and I dined in.  He ordered the lamb gyro w. the tomato cucumber salad, I ordered the salmon greek salad and we split the spicy pimento dip with soft pitas.We took our number and sat outside, I was wondering how that was gonna work out since you seat yourself and the servers have to find you - it went fine, there wasn't a long wait at all.I personally didn't think the pimento dip was spicy at all - it was more mild with the sharp taste of the cheddar, not bad, but I've had better... we didn't finish it.My bf loved his gyro and the tomato cucumber salad (the feta adds a nice twist).The salmon on my greek salad was cooked perfectly (the seasoning was a little heavy when combined with the greek dressing that comes with the salad), the salad was fresh, colorful and light - just what I was looking for!It's a nice spot to check out before shopping at Whole Foods!"], ["Mackenzie S.", "Good, fresh Mediterranean food. It's similar to Zoës Kitchen. I especially like the basil pesto chicken gyro. My mother ordered the pimento cheese sandwich which was equally yummy. A downside: they're stingy with the potato chips as a side and the baklava I ordered was stale."], ["Candace B.", "I eat here practically every month & have not ever disappointed. The veggie gyro is amazing, as is the greek gyro! Service is fantastic and I love the outdoor seating."], ["Derya S.", "I really liked the food. The meat was juice and tasty. The service was nice. Good price for what you get. The only thing I would change are the Dolmades. I never seen them this big as well warm. They are much better cold and served with some lemon juice. The taste was fantastic, but they fell apart due to size. We will be back."], ["Gwen M.", "I ordered a side or rice and humus it's veggies. The humus was way too salty and the squash had a weird texture like it wasn't fresh. The rice was also oddly salty and the portion was extremely small. The service was nice but I think overall it was overpriced"], ["Mona D.", "Interesting concept: you order at the counter, they give you a # card, you then choose any table and post the number. Then they bring the food to you when it's ready and take care of you like a full service restaurant. This was my first time and when I told the cashier she was extremely helpful on deciding what to order. I settled on the chicken gyro with basmati rice, then changed to potatoes at her suggestion. The cashier ended up serving my food and brought me a side of the rice as well to try at no charge! Nice! The gyro was loaded with juicy chicken, not overdone with seasoning but tasty. There was tazicki sauce on it but not a lot so I paid 20 cents for extra and I'm glad I did (I tend to like a lot of it). The roasted potatoes were flavorful but not my favorite since I tend to like them browned more. These were fully cooked and soft but not a hint of browning. The basmati rice was good but bland all by itself. If you got a meal where the meat and veggies were served over it then it'd be great. But as a side not so much. Gave them 4 stars just because the sides weren't spectacular. All in all it seemed like a pretty good value for the prices, great customer service and a nice ambience (I sat on the patio)."], ["Angie W.", "Customer service is good, Katrina is always smiling.Mediterranean salad, lemon chicken soup, dolmades, salmon are all delicious.The atmosphere is easy going and relaxed."], ["Mitch K.", "Really nice place with good menu, plenty of drink refills and lots of management attention asking if you need something and just checking on you.It is Greek and otherwise Mediterranean, as the title suggests, so they offer pitas, lots of salads and a variety of hot plates. Portions are reasonable and so are the prices.Order at the counter and they take care of you from there.  Food is prepared when you order it, so if it involves meat cooking, there is a bit of a reasonable wait.Super for lunch as there is plenty of room and small groups can be easily accommodated..The decor is a bit \"cold\" with lots of concrete, metal tables and chairs and glass.  Very spartan, but you are there to eat, not for the ambiance, so just enjoy."], ["Josh P.", "Taziki's is very good. The food is quality and made with fresh ingredients and the service is good. The atmosphere leaves a little to be desired, but the restaurant is clean and the food comes quickly. I've had several menu items and liked them all, but I absolutely love the Grilled Chicken Basil Pesto Gyro. I get a side of tzatziki sauce with it. Watch the olives that come on the salads. One of mine had a pit in it. :-)"], ["David N.", "So on my adventure in the good ole capitol of SC, I decided to try Taziki's...don't know much except what was provided in Yelp.  First impression not bad for decor and the smell of delicious food was in the air. The young man at the register needs to learn some customer service skills, especially in the food industry.  No help on what was good to eat or what I should try first.  Ordered the beef tenderloin Greek salad...where's the beef!?! Taziki not bad though.  For a ten dollar plus salad with two morsels of beef....unsatisfactory for a growing man!  Taziki is not bad though and worth the try.  Oh and ordered bottle water to find out they were out...so had to get refunded on that....manager on duty was not apologetic at all.  Maybe the staff just had a bad day."], ["Diana W.", "I ordered lamb gyro with taziki dip appetizer.  Everything was delicioso!! Will come again"], ["Arun M.", "The food is fresh, the people are friendly, the prices are reasonable and service is quick. They have plenty of seating including large long tables. I don't crave this type of food often but if I do I would know to come here. The fish dish was amazing and I would recommended it to anyone looking to eat lite. The only thing that disappointed me was that they serve their hummus with pita chips they make however I prefer mind with pieces of soft pita. Nonetheless once you come here, you'll know why its a keeper."], ["Danielle R.", "Quite tasty. Today I had the grilled vegetables platter--asparagus, tomatoes, squash, onions, and red peppers. I wish the onions had been sliced thicker and I'm always up for more asparagus but I was still quite happy."], ["L R.", "Cool place. I have seen it all the time. A neighbor mentioned that it was good and today I was hankering for some Mediterranean, so figured why not and drove there from campus. The lunch time rush was pretty crowded. Not so much that it annoyed you, but there was a good enough wait which is always a nice sign. I had already peeked at the menu online and knew I wanted the dolmades since stuffed grape leaves are one of my favorite foods of all time. Anyway, the ordering process was really quick, ordered the dolmades plate and an unsweet tea. Just a little over $13 bucks, so not super cheap, but not expensive either. I asked if they would be able to see me if I went outside, and the very nice cashier said that they walk all over the place so they'd find me. :) I got my number and went outside.The food came out faster than I had anticipated. I was seated for five minutes before a server came out to give me my food. YAY. I was anticipating my dolmas all day so I saved them for last. The meal comes with a Greek salad, some dressing, their 'taziki' sauce, and a crispy pita wedge. The wedge is crisp, like a cracker, not soft and chewy like I would have preferred but it was still good. The salad was GREAT and the dressing was YUMMY. I really enjoyed that and next time I will get the greek salad and a protein. Then the dolmades. Unfortunately they disappointed me. :'( They weren't tightly wrapped and were awkward to eat as a finger food. The leaves kept unwraveling. I tried a knife and fork and that was worse. Oh well, I went with it. The 'seasoned' rice was yellow (turmeric?) and not very flavorful. The grape leaves didn't taste nice and brine-y like I like. But it was very filling thanks to all that rice. At the end of my meal, I realized that I didn't have a drink. I asked one of the runners and she said that I was supposed to pick it up on the counter, but no problem she would pick it up for me. She was quick on that. I usually get unsweet tea but she gave me a sweet (not her fault - I didn't think to specify) and it wasn't the usual diabetes in a cup that is the norm. Still too sweet for me, but palatable enough on this warm day. While I didn't like the dolmas too much the service was EXCELLENT and the staff and runners were just SO FRIENDLY and all smiles. It was a great experience and I will be back! Just remember to pick up your drink at the counter before you sit. ;)"], ["Gregory A.", "The food here is awesome! You will get addicted to their famous tomato chutney aioli sauce. I put it on everything! They also give you large portions. I ordered the Herb-Roasted Pork Loin and it comes with not one, not two, but THREE delicious pork loins! Most places you would get one or two at most. The staff is great, very friendly and helpful. Sorry no pictures. I have to dive right in..."], ["Jodi B.", "Always a great meal here! Super fresh ingredients and friendly staff. Their Mediterranean salad with salmon is my favorite!"], ["Karen S.", "I am not much of a Mediterranean Food Person, but some of us had lunch here yesterday.  Concept is that you order at the counter and they bring your food out to you (unless you are ordering takeout).  Ordering counter is towards the back when you walk in and was not obvious where the order counter was when you first walk in.  Also, since you order at the counter, most places I have eaten at where you order at the counter, menus are posted on wall.  I did not see menu on wall and located paper menus. I do have to admit, it seems like there was a limited menu selection.  Prices seemed steep for what you got.  I paid $10.00 for my meal (which was a chicken sandwich, limited side of potato chips, and a side - which I chose the potatoes, and  i soft drink - soft drink was not part of the sandwich / chips / potato combination), and when I got the meal - almost looked like I had ordered a kiddie meal.  Upkeep of restaurant was nice - and I am sure it helps that the place is relatively new."], ["Eric W.", "My first visit here. I was not overly impressed with my gyro. Other meals look very good. Salads look very filling. I might try it a second time."], ["Bailey B.", "Great fresh food! I have always enjoyed my experience when I have been here, good food,"], ["Dorothy K.", "Good food for the price but the service was non-existent once my plate was served, so I'm wondering what the tip was for. I'll come back but will adjust the gratuity according to my experience."], ["Simon T.", "Decent food and drink.Atmosphere is terrible. Chaos. Have takeout."], ["J S.", "Always great , fresh ingredients and friendly service. Always try to eat here when I come back to town."], ["Christina S.", "Tazikis has become a favorite of mine. I love the lamb gyros, Mediterranean beef tenderloin salad, the tilapia feast with rice basmati rice and greek salad. Have never had a bad meal. The salmon feast is awesome, too. My father and husband have eaten the pork loin feast and it is huge, and they both enjoyed it. It is usually the first place that pops to mind when we want to eat dinner out."], ["Tj R.", "I went on a visit to cola and had the portobello chicken sandwich with cucumber tomato salad. Very good. Very fresh. Under $10, but I drank water. Restaurant was very clean, open air feel. Outside seating."], ["Rick T.", "Awesome chicken ! Awesome service !"], ["Eric S.", "Taziki's is our go to Restaurant for Mediterranean semi-fast food. We visit here at least twice monthly due to the food."], ["Joe A.", "Food is always great. My wife and I have been at least a dozen times and I really feel comfortable recommending everything on the menu. You just can't go wrong. Fast and friendly service too.  One of our favorite spots."], ["Marion L.", "Went there this afternoon for a Sunday brunch. The food was great. I order the signature Taziki pasta it was creamy and satisfying. My mom and sister ordered the herbed pork loins and they have this white sauce that's amazing. the service was great even in a packed house. I'm definitely going back."], ["Katharine K.", "I wasn't blown away by the Caesar salad and won't be getting it again, but my brother really enjoyed his gyro. The atmosphere is casual and modern."], ["Jamie B.", "Why Chick-Fil-A keeps beating out Taziki's for Free Times Best Service is a mystery to me. If you're going to give it to a place with counter service, it should at least go to a place without an obvious script.Everyone is always unbelievably nice and helpful, and it really does make a difference. The salads and gyros are all what you'd expect (but delicious), and I've always had a good experience."], ["Sateesh N.", "It's alright.. Nothing different from a typical Mediterranean restaurant.. Food was tasty.. Took less than ten minutes.."], ["Brittany W.", "My GO TO place for dinner. I drive from Columbia to Sumter everyday and when I come back after working out in the evenings I typically want to grab something quick and fast before returning to my hotel before I sleep. I literally carry around the Tazikis menu in my purse and have their number on speed dial. I call in my order and by the time I get there to pick it up it's normally ready and if I have to wait it's never more than 5 minutes. The food is really good. I try to eat healthy and avoid a lot of fast/greasy food so the selection of salads is awesome. When I want to plurge and get a feast it's normally a good size of protein with some rice that I will say, as a non rice fan, I do enjoy.Oh, THE HUMMUS IS TO DIE FOR. Sorry, in case you didn't get that the first time: THE HUMMUS IS TO DIE FOR!!!! An order of that with the SOFT (not baked) warm pita and I am in heaven. ...Gosh darn, salivating right now! Definitely a good choice for a meal, I haven't ever stayed to eat but it's cozy with plenty of space and a great atmosphere so if I had company I think I'd definitely venture out to eat out."], ["Billy H.", "I've been here several times and it is nice on decor and friendliness but the food is bad to mediocre. But they're new! If this is one's introduction to Med/Greek food what a pity. There's lots better places in town. I have tried every side except basmati rice. The 'new' potatoes were a joke, squishy and burned. The fruit looked so unappetizingly stale I was afraid to eat it. But it's fairly crowded for lunch, and must be 'first-timers'. I will not go back."], ["Lindsey B.", "I have eaten here several times.  The first two times I had the Greek salad with salmon and a glass of wine.  Excellent food, 4 star food, 3 star atmosphere, but at least we had real silverware.  Self service on the drinks. They delivered the food to the table, but after that, abandoned us.  I won't tip next time, there is no service to reward.Tonight I had the 3 item meal with fruit as a 4th. item. The chicken salad was hum-drum, not as good as Whole Foods.  The pimento cheese was so so as well, I didn't even eat it all.  The egg salad with olives didn't have any personality, I was expecting something special.  It didn't happen.  The fruit was OK, but Whole Foods next door has better. This is a nice place to see friends, and the decor is a bit noisy but not too bad.  Only two booths.  Some outside tables, but it is hot for that this time of year. If you go, stick with the Greek salad with extra of salmon.  That's the only think I know I would order from now on.  Oh, the pita chips are excellent, and one time I actually got enough the first time and didn't have to ask for more (as I usually do).  I wish this place would step it up a notch or two, it could be excellent with a little more effort. Oh, and they might consider some dining roof service -- it is supposed to be there, and sometimes is, but tonight it was non-existent."], ["Liz F.", "I disagree with some of the other posters here.  I think that the prices were too high.  For example, I ordered the Taziki Dip for $4.59 which IS a reasonable price for an appetizer but I though the portion was a too small for them to charge $5.The gyro that my husband ordered was acceptable but not great.  The meat wasn't very seasoned and it somehow tasted cheap?  I don't know how to describe it.  It wasn't bad but it wasn't awesome.I ordered the Soup and Salad.  The salad was fine and the Greek dressing was VERY good.  The soup is a Greek Lemon Chicken Soup which I thought would be Avgolemono, which it certainly is not.  I liked it but I was wanting Avgolemono.  That was MY mistake though.  The soup was very tasty and super lemony (which I love).I thought the setup was strange: order at a counter but its full service after that.  And there's a tip jar at the counter so, in essence, you're tipping before you even get any service, which I don't care for.  The employees were SUPER friendly though so I'm glad I tipped well!!!  I would pretty much return here JUST for the friendly service, I swear.  Especially since good service is so hard to find in Columbia (in my opinion).Overall, I enjoyed my food but my husband did not.  I really think that it's a little overpriced, but only a little.  The employees are the absolute best.  I think I would recommend this restaurant, but maybe wait and go on payday!  :)"], ["Emily E.", "While the prices are reasonable,  the gyro was nothing special.   I've had many better ones in Columbia.  The lamb wasn't tender or we'll seasoned and they were stingy with the sauce.   The best part was the cucumber tomato salad,  which shouldn't be the highlight of their menu.   They were nice enough but you can get much better Greek food elsewhere"], ["Kevin B.", "You want fresh ingredients? You want quality service? You want delicious flavor combinations? If you answered yes to any of these 3 questions then you won't be disappointed by any dish at Taziki's! This is my favorite restaurant in the metro area that isn't in the fine dining class. I could eat here every day..."], ["Lizzy J.", "I'd give this place 3.5 stars... giving it 4 because it's new and they are probably still working out the kinks. The staff was very friendly and the service was incredibly quick for lunch time on a weekday. The menu is fairly large and the options are reasonably priced. I liked the atmosphere, the inside is decorated nicely and there are lots of large windows.I split an appetizer sampler wtih hummus, taziki dip, and dolmades. The hummus was chunky and tasty, seemingly made on-site. The taziki dip (a chunky version of taziki sauce) was great but the pita chips were too thin, cut too large, and over seasoned. I'm not sure why they aren't using flatbread or making the pita thicker, what they are doing just isn't working. If the chips had been better, I'd be much happier. The dolmades (stuffed grape leaves) were tasty but difficult to eat. They were too big and kind of soft on the outside, but the inside was seasoned well and tasty.Also got the spanikopita \"roll ups\" - essentially 4 greek empanadas? The chicken was very tasty and juicy and came with a tomato salsa kind of thing on the side that was very good. The side tomato and cucumber salad was tasty and the tomatoes were BRIGHT red, obviously very very fresh and ripe.One annoying thing: the staff behind the counter has to get you a drink. There are no drink machines or even water coolers to use, so that's just kind of annoying. They use crushed ice and basically fill the glasses with it, so you get very little to drink."], ["Paul G.", "It's not the worst food I've ever had but most of it was terribly bland. Can't think of a reason to ever go back again."], ["Melissa W.", "I decided to try this restaurant as they were fairly new to town. I was sorely disappointed. Mediterranean food is to be enjoyed, not served fast food style from a pick-up window type counter. I was unable to eat my pork as it was extremely tough and tasteless.  I would like to say that these were problems encountered due to their newness, but unfortunately that would be wishful thinking on my part. I am hoping that their clientele are unfamiliar with Mediterranean food as if this is their first experience with it, they will not be eating Mediterranean again."], ["Greg M.", "Great menu, great staff. I visit every chance I get!! Try the mediterranean salad...or anything else for that matter. Both the taziki and the hummus are awesome starters too."], ["J M.", "Mediocre food. The service is fine. Reasonably priced. The lamb dinner was reasonably cooked but no seasoning to speak of and a strange sauce that had no flavor. The soup was ok. Salad dressing is really bad but they have oil and vinegar if you ask. The wine is reasonably priced but also, not very good. The line was out the door when we left so it seems to be pretty popular right now."], ["Sam V.", "I'm happy about Taziki's. They have an eclectic menu that can satisfy most of my cravings and their food preparers wear gloves-- very important. I've noticed that Columbia seems a bit behind the times as far a restaurant sanitation goes. I recommend giving this place a try, it's not too expensive so if you hate it you're not losing much!"], ["Jj D.", "The atmosphere is very casual and friendly. You place your order at the counter, and the wait staff brings your food promptly to the table.  Staff was very helpful and knowledgeable about the menu. We ordered the Chargrilled Lamb and Herb-roasted pork,  both meals were excellent and very affordable. We will definitely plan another visit in the near future."], ["Lisa M.", "5 star location at the new Cross Hill Market in Columbia SC - 3 star dolmades.  Had the Dolmades Plate listed in the Taziki's Feasts section.  Listed as \"grilled\" hand-rolled grape leaves stuffed with seasoned rice served with Greek salas, Taziki sauce and pita for $8.99.  Gave it 3 stars for the very tough dolmades (rolled grape leaves).  There was nothing to indicated these were grilled.  They were large but not cooked to correct softness.  The filling was a yellow rice that was very spicy.  The rice wasn't sticky enough to stay together and there wasn't much else in the filling.  Too big and not enough substance.  The side Greek salad was slim on toppings.  There was one little olive and about ten small crumbs of feta.  On the plus side I will try again to see how the gyros and their spicy pimento cheese is.  Definitely worthy of Cross Hill Market."]], "Deno's Fine Foods": [["Melanie C.", "I found this place with yelp on my drive from Asheville to Charleston.  It is a few miles off the freeway but worth the trip! I had the chicken pita with green beans and it was delicious! It came with a greek salad on the side and I demolished it within minutes. Amazing. The dressing is so good that I proceeded to dip my pita in the remaining sauce.  You can tell that this is a family owned restaurant.  Service was personable but not pushy. Just the way I like it!"], ["Kristen H.", "I ordered their lasagna and it was a big cheesy bowl of deliciousness! For dessert I had their baklava, which was very nice and sweet.  :)"], ["Jane F.", "Does not matter how good people say the food is, if no one greats you or ever take your order. It was my first time in the restaurant. Upon entering no one said anything, so I look for a table and sat down. No one said anything to me everybody just looked at me like I was a stranger in a restaurant. What was worse is I had my son with me and he asked me why doesn't anyone serve you and mommy. I said I don't know is my first time in here and will be my last. Its funny cuz I heard the waitress say I might as well go home because there's no one here and I was clearly sitting at the table waiting to take a order . The funny thing is I leave good tips but she would never know it."], ["Tyler P.", "This is GOOD stuff!!!  I am a fan of the Deno's Salad which is Greek with chicken.  The pitas are also a favorite."], ["Daniel S.", "I love this place. Great little Greek diner. Nothing bad on the menu! Daily specials provide added value. Best Greek salad and Gyro in town. Treat yourself. (Owned and operated by REAL Greek folks!)"], ["Frank J.", "Nice, family-owned place.  Everything is good, lasagna, pizza, etc. The Chicken Kabobs with greek potatos are excellent - had several times."]], "Zorba's Greek Restaurant": [["Cory H.", "Excellent service and food!Wife and I had a beef souvlaki with feta added. We also split a Zorbas Special salad. Son had fried flounder and loved it.Daughter had the gyro and enjoyed it as well. All 4 of us had a piece of baklava and loved it. Zorbas is our favorite Columbia restaurant!"], ["Robin O.", "Zorba's is one of my hometown favorites!  I  can't come back for a visit without stopping by for a Greek fix.  Although their menu offers Italian dishes, subs and more....they are Greek restaurant.  There other items are very tasty, but why go to a Greek restaurant and not order Greek foodBy far, they have the number one Greek dressing I have ever had!  I've yet to find an equal rival to satisfy my craving.  They also have excellent pizza.  A few Zorba's pizzas and a large Greek salad are enough to please any crowd. Another tummy pleaser is the Chicken Slovaki ....and lets not forget those Hreek potatoes!!!"], ["Joel R.", "I love this place. The Greek food overall is excellent- I highly recommend the gyro or souvlaki pita sandwiches, the eggplant parmesiana grinder or platter, the Greek salad, and any style of their pizza. In fact their pizza is made with a really great combination of cheese that keeps really well for leftovers. Also I've never had bad service here. Definitely a staple of Irmo cuisine."], ["Rachel A.", "Good gyros. Haven't had much else, and I usually order to go. But their gyros satisfy my craving for one."], ["Bob S.", "Outstanding in every way, one of our favorites especially the Zorba special salad. Waitresses are always friendly and attentive."], ["Crystal C.", "I have no idea why I keep forgetting this place is there, tucked in a corner of a mostly empty shopping mall, decorated with some of the most odd, but yet most special and wonderful decorating techniques I've ever seen.The price can't be beat, the ingredients are so fresh, the service quick... there really isn't anything  I could possibly complain about. I was with a medium size crowd and we did some cross testing. The pizza tasted awesome, the dalmadas... so good. I experimented and order the soup that had  a creamy lemon taste to it. I'd never experienced anything like it, but it was wonderful. I need to make an effort to get over here more often."], ["Gary H.", "Ordered the carbanaro chicken with salad. It was good sauce a little thick and strange combo on pasta for me. Maybe a lighter sauce with artichokes might be nice, but then that would make it another dish. Friendly staff and good service. The place is very over the top Greek decor which makes me wonder is this what all Greek restaurants look like or is it what we think they should look like so they do it that way."], ["Paul S.", "The service was pleasant but The food was terrible. The tea was gross. And the fried pickles with store bought ranch were ok. I ordered the gyro and it was bland tzatziki sauce was bland and the meat was bland as well."], ["Jason S.", "My wife and I eat there frequently.  Thier Greek salads are huge and delicious.  The lunch specials will fill you up and are perfectly priced.  I could eat Thier Greek potatoes daily.  I hear their pizza is good but I can't get away from the Greek food to try  it.  Thier interior is what you would guess a geek restaurant would look like.  This is one of our favorite restaurants in all of Columbia. I don't think we have ever had bad service thier and usually one of the owners is there."], ["R E.", "Been coming here for nearly 20 years and NEVER disappointed.  Best surprise is the fish  it is amazing!"], ["Melissa P.", "Don't let the exterior fool you, this is an amazing place. Quite honestly one of the greatest services I have ever received, incredibly friendly. The Sampler Platter (appetizer) was incredible, especially the hummus. The salad was great and the bread was fresh. My entreé, the Pastitsio, was delicious, it's meat was the most tender I've had in a pasta dish in a long time. I left happy and full (the portion sizes gave you a nice bang for your buck). This is a new family favorite."], ["Swetha G.", "It wasn't the best place for Greek food, but definitely not the worst either.  Here's a quick rundown of some of the dishes we had:- Spinach Pie w/Filo Dough (Appetizer) - It was good.  It was light and fluffy and easy to bite into.  They could have used a tad more seasoning though, it would've benefitted w/a pinch more flavor.- Stuffed Grape Leaves w/Lemon Sauce, a.k.a. \"Dolmas\" (Appetizer) -  It was alright.  It wasn't as tarty as most dolmas are typically made.  The lemon sauce was interesting.- Spanokopeta (Entree) - AMAZING.  The closest way to describe this dish is that it looks like lasagna (minus the marinara sauce) but instead it's texture is crispy and soft.  The filo dough gives it that pastry crispiness and the softness comes from the sauted spinach and crumbled feta cheese.  It tastes soo good, it will melt in your mouth!- Baklava (Dessert) - Disappointing.  It was soggy, overly sweet, and just a hot mess.  Elie's Lebanese Restaurant is not too far way, their baklavas are phenomenal.I wasn't too impressed with the service, our server seemed bored and took her time coming to our table.  The woman who brought our food out was clumsy and spilled stuff getting it on the table.  The hostess was friendly though.  Lastly, the place is pretty big and is good for groups."], ["Pohnpei K.", "This place is very nasty server lies about them not having a proper equipment to cook rare sirloin steak. I order rare and came out well-done nasty and she offer me to order something simple like broil chicken ahaha LOL.  And motion to me that they are Greek restaurant specialize in chicken. Anyhow how given time there I check their restroom and it was very filthy so question is what's like in the kitchen maybe worst, Even the rest of the staff have an attitude. Definitely not worth to spend money on food that are similar to Walmart product. I absolute will not recommend u to waste ur money and endanger ur health.i ask to see the owner but the receptionist say they only see their own kind of people"], ["Toni C.", "This is a great place to go with groups, kids, and/or a variety of palettes.  Ours, to which all these categories apply, had the appetizer platter (hummus, dolma, feta cheese, spinach in puff pastry, cheese in puff pastry, tsatziki (sp?).  I thought the cheese was excellent, the hummus very good, but the rest very weak, surprising since this is a Greek place.  The stuffed chicken, lamb gyro, broiled salmon, chicken tenders, regular pizza (they also have a Greek pizza which we did not try)....all got high marks.  We also ordered the moussaka which was good.Of the deserts the key lime pie and chocolate volcano got good reviews.  I had the baklava and again, oddly since this is a Greek restaurant, found it not that good.Bottom line is it's a big barn of a place, service was very good, and there's something for everyone, including a quesadilla."], ["Sabrina V.", "Went here because of family.  Not our choice.  The tea tasted like cigarette butts.  He waitress exchanged it for a coke.  The service was ok.  Our waitress was nice!  We had the 10$ Greek salad which was totally small!  You get twice the size at Grecian gardens.  We also had a pepperoni pizza.  Greasy oh my gosh!  Not the best but not the worst we have ever had.  Later that night my husband, 7 year old daughter and I were hurting from both ends!  We will never go back!  Ugh bubble guts beware!  I just get upset when my little one gets ill from a restaurant."], ["Donna C.", "Hummus was fantastic, rest of the food was good. Huge portions. Sampler platter appetizer was spectacular. Would have been a complete meal for two if they added gyro meat! LOL! House Red wine was not very good. As a side note, we had to move tables because of a screaming crying child. Then had a guy talking on speaker phone next to us at the second table! Just kinda a noisy dinner.Overall very good food"], ["Craig M.", "Zorba's is really close to my office so we eat there quite a bit. The food is usually very good & the service is as well however they have their moments when for whatever reason it's not great and the servers aren't very good. Overall Zorba's is well above average though. They have great Greek chicken & potatoes very good rice & chicken tips and the Greek salad is the best you'll find in the area! Jimmy is a great owner who cares about the customer's experience! Highly recommend Zorba's!"], ["Jason M.", "Come for the nightly specials (several options) and you will be satisfied.  Minestrone was very tasty. Fast, friendly service. Pizza is pretty good as well. A great surprise in Irmo. Too many chain restaurants here."], ["Kayla G.", "Great food here. It's been a while since I've had their pizza, but remember it being good. I adore their greek salads with salmon or chicken. Chicken souvlaki and the gyro platter are delicious as well. Portions here are always huge!Service is typically pretty good, no complaints there. Love the campy Greek decor, especially the \"cloud room.\" Highly recommend."], ["Leigh-Ann F.", "Absolute worst food I've had in columbia. The salad was iceberg lettuce, store bought feta cheese with two tomatoes and a rip off dressing they called Greek. It was $9 and I could've just bought the ingredients at the store for cheaper. The gyro was greasy and the lamb was not prepared well - some great alternatives are Al Amir and Elie's Lebanese Cuisine. Go here at your own peril. Also the atmosphere was a cheap attempt at being authentically Greek. However, the people were friendly."], ["Keith F.", "Server gave us great advice on the menu, including wine choices. Portion sizes were huge and the food was absolutely delicious."], ["Ryan C.", "Been coming here for years. First fell in love with the gyros answer slouvaki here when I was about 11. I attended campus I middle school and every Thursday the original chef of Zorba's would come and offer gyros and chicken slouvaki on the lunch menu. I love how they don't use tsaziki sauce on them too, I'm as lost 100% sure it's a spread of mayo topped with granulated garlic and parmesan pizza topping (actually I know for a fact it is). The attributes of being a seasoned chef myself. The portions are always huge, prices right. Great nightly and weekend specials (the weekend prime rib is excellent). Greek night at the St. Andrews location is as lays fun with the traditional music and belly dancers. If you are a drinker (I am not due to medical issues) they have great prices and an outstanding happy hour. Just an overall grateful tasting, priced, and fun restaurant and I'm glad it's a part of irmo. Opa! -Ryan C."], ["Gunter L.", "Great food and big portions. My only beef is the servers asking if you need change when you hand them your money. How tacky can you get?"], ["Carl R.", "Great food that tastes wonderful! The decor is very Greek. They put some money into the atmosphere when they moved here.   Unfortunately, the ceiling and decor is dirty. If you don't look up, you'll be fine though."], ["Mark S. I.", "+3 for the food. I'm serious - these guys are the most consistently tasty in Cola.+ about a jillion for the service - always with the good amount of attention, funny quips, fast delivery, coffee and / or wine glass kept filled. This is the place.What? Nothing funny here, Troop: Zorbas is the real deal. Yeah, yeah."], ["Mike S.", "It's interesting that I've seen a lot of reviews about fast service. Maybe it's different at the bar area.  I would say authentic European paced service ;)I've been in Columbia on business the last 8 weeks and I've eaten here probably 5 or 6 times, mostly because their Greek salad is awesome. I get the grilled chicken on top. It's really hard to eat decent when you're on the road so it was nice to get a good salad. The gyro was great, too. Happy hour has $1 bud lights, so even better!Really great place to eat and everybody is very friendly. I only am going back to the hotel, so the service time didn't bother me a bit. If you're friendly like they are, I'm cool with it!"], ["Rebekah P.", "I came here to review the menu as we were thinking of getting an appetizer or two to-go to supplement our leftover Pastichio from the Greek Festival. To my amazement, I see that I have never reviewed this restaurant that we have been coming to for over 30 years. We visit about twice a month or so and have rarely had anything to complain about. The service is always great, and the kooky decor only adds to it's local charm. Almost without exception, their portions are so large that I have enough left for a meal the next day. Their large salads, although not my personal favorite, are famous for their size and popularity. Their pizza is the best in Columbia, in my opinion, but only if you like cheese. Of their pizzas, the Greek pizza is just scrumptious, but only if you like feta. If I had to pick a favorite for value and taste, it would have to be a draw between their beef souvlaki platter and their gyro platter. Their greek potatoes are now excellent thanks to a recipe change quite some time ago. We love Mediterranean food, and have been to every Greek or Mediterranean or Lebanese or Syrian restaurant in Columbia. Some are more \"gourmet\" than Zorba's and I love them. But for a great blend of Greek and Italian with super value, convenience, and local flavor nothing beats Zorba's in our eyes."], ["Bob H.", "This restaurant is the one of the fastest restaurants that I have ever been to.I ordered water and I ordered the chicken tips for lunch.Before I got my water I already received my chicken tips the salad. Greek salad and the other items.Service to find out of five and food it's five out of five.I will definitely be going back to this restaurant is not expensive"], ["Angie H.", "We actually stopped to eat here because the Mexican place we were looking for was closed. I had the pizza and it was pretty good.  The crust was fresh and tasty.  My sons ordered the gyro and they both said that the meat did not have much taste.  They gave us some bread as we waited and it was okay.  Overall, the food was okay.  The service was slow--and they were not that busy.  Also, the waitress hardly came to check on us.  I would give it another try though, maybe they were just having a bad day!"], ["Denise K C.", "I drive over 15 miles from Forest Acres for the Pizza and service from Donna. Never disappointed in either."], ["Diana M.", "Gyro was just ok,  had better.  Clam chowder soup was good service was good."], ["Mark V.", "We eat at the Zorbas in Chapin SC at least once a week. Pizza, steak and Greek salads are the best. Have several really great servers too. Sweet tea is perfect (not too sweet, but just right) Today we ate lunch there. Son had ravioli and I had pork chop dinner. Delicious. Put some pics in there too. That says it all."], ["Raru R.", "We love this place. The staff is always friendly and the food is always good. Quick for carry out too.  The pizza is good, not NY good but definately good for SC.   The Greek sal"], ["Christian K.", "Large portions. I tried the chicken parmigiana. Very filling. Overall, the restaurant seemed very dirty though, so that was a turn-off."], ["Bill E.", "Great value and large portions. I love the Greek salad with Gyro meat. This restaurant is always busy and I know why. Best salad I've found in metro Columbia."], ["Lindsey B.", "Solid 4 stars. Appears to be remodeled some since my last visit. Food tonight was great. Homemade from scratch mushroom soup was excellent and manicotti about as good as it gets, with lots of melted cheese on top.  Tea was good. Waitress was very good and helped with difficult choices due to some special requirements we had tonight. Bread was good.  It was enough for two people so there was generous take home box.  The value is here over long period of time.  Those new to Columbia will not be disappointed trying out this one."], ["Tyler P.", "Zorbas pizza and salad!  It just doesn't get any better!!!"], ["Angela S.", "Horrible - I would give it zero stars if Yelp would allow me to.  We went here yesterday and it was by far the worst dining experience I have had since I moved to Columbia.  First, we walked in and there were two hostesses at the stand - one of them was on her cell phone and they were talking to each other.  They didn't even greet us until we had been standing there about a minute [there were no other guests waiting to be seated].  Then, after we were seated, I noticed how dirty the place was.  There were grubby fingerprints all over the walls, cobwebs on the ceiling, and the carpet had a nasty stench.  The decor was pretty appalling too...I'm not sure what the \"theme\" was supposed to be, but ultimately the whole place was just an eyesore.  We got our menus, and honestly there were just too many items to select from.  I'm a fan of a large menu, but it took us about 20 minutes just to figure out what we wanted because of the huge selection.  We got our food and my chicken was raw - I sent it back and it came out raw the second time so I didn't even take a bite.  My spouse's meat was bland, and his salad was soggy and over-dressed.  I also wasn't very impressed with the service.  My drink sat empty for over half the meal even though the waitress walked by three separate times.  Overall, it was a bad experience.  We paid for two meals that we didn't even eat."], ["Michael C.", "Great food love the belly dancer been there three times"], ["M D.", "I went here with my wife for lunch.  They dont have a special lunch menu, but they did have cheaper selections that seem to be just fine.  The food was ample, but nothing that really knocked my socks off.  The waitresses though were on the spot.  Attentive but not obtrusive, and that was really nice to have.  The atmosphere looks half done though, like they were trying for a nice look and just gave up on it and went for a family look.  Its good for something a little different.  I dont see myself being a regular there though."], ["George J.", "Excellent food, 7 people at our table and everyone was satisfied. great gyros, salads and dinners, huge portions, will definitely return when I'm in the area."]], "Gervais & Vine": [["Liz R.", "The menu had so many must try items and I may have gone a bit overboard...but it was worth it. We started with a trio of the dips and chose:Spinach artichoke-hands down the best I have ever tried. There was an extra creaminess to it and had the perfect balance of ingredients- easy to scope but not runny. My favorite of the trioAlmond Brie-incredible as well. The almond added an extra sweetness to the cheese that made it feel more like a dessert but not so overdone that I couldn't justify eating it as an appHummus-I know, sounds boring. But it was so so fresh and if it wasn't homemade then they definitely fooled me. Only downside is it was a little heavy on the oil for my taste, but others may prefer that. Then we proceeded to order the bruschetta, which was a plate of two medium size slices of toasted baguette covered with a heaping of one of my favorite types of tomato dishes. We finished things off with the salmon, which wasn't particularly seasoned, but was so fresh and cooked just the right amount that I didn't even need the sauce they served with it on the side. I told you we went overboard and we probably could have stopped with the trio, it was so filling, but I certainly have no regrets because everything was phenomenal."], ["John J.", "I have been to this restaurant three times.  The food and wine were excellent the two times I stayed.   Service is among the worst I have found in Columbia.   For that reason, I left on my third visit deciding to eat at Cellar on Greene instead were service is always great.  On my first visit, the hostess was irritated and shot me a snotty look when I asked for our table to be wiped down before sitting.  During my final visit, we sat at the bar for nearly 10 minutes waiting to be served before leaving."], ["Andrea R.", "Dined here on a Friday night. We made reservations which was nice because the place is quite small, a lot smaller than we expected. We were sat in a small room in the back against the wall which gave us some privacy but for a tapas place the table was very small. You would think when needing to accommodate 5-6 plates at one time that they would select larger ones.We started with the bruschetta which was really good. Two large pieces of French bread topped with a lot of tomatoes and a thick balsamic vinegar. We then had the olive plate which I loved, but I never met an olive I didn't like so maybe that's just me. We then had the Moorish pork kabobs with gorgonzola fondue for dipping; warm almond brie with mango chutney; gambas (spicy shrimp with roma tomatoes, sherry, bacon & garlic); and the garlic-parmesan fries with spicy aioli. We also ordered the petite filet mignon but our waitress never brought it out and we were full so we told her to just forget it. Overall our food was delicious and filling. With those 5 plates (olive plate doesn't count) we were SO full. Plenty of food for two. The service was great; our waitress was so nice and knowledgeable and made great recommendations. We paired the meal with a delicious Malbec, unfortunately we saw that same bottle of wine at Publix the next day which was kind of bummer considering we paid I think $36 and it was at Publix for $12. That's the name of the game I guess.We thought the prices were more than fair, our meal only came to $90 (pre-tax) for everything.  The low-lighting made for a romantic atmosphere and we will definitely be back!"], ["Stephen B.", "Well since the change of ownership a couple years back I've heard nothing good. So I decided to give it a try. Well the menu has not changed but the quality has definitely gone down hill. Sorry but it's just not the same. Go elsewhere. Enough said."], ["WanderLustinDani P.", "Greatness, Goodness, Excellent Service,Cleaniness.....hubby and I enjoyed to the fullest, we will be returning. No need to write a long review! A wonderful find close to home..."], ["Sherry C.", "I really and truly had an open mind and wanted so much to really love this place.  I've been wanting to come here for a while.  However, I hate to admit..... but I was kinda disappointed.Our waiter was really nice and very attentive.  I wish I could just give him 5 stars.  Our appetizer, which was the Costa Brava,  was very good.  I was excited to be off to such a good start.  The tapas that we ordered, Beef Paillardes and Catfish (it was one of the specials) was pretty disappointing.....They were both about 3 stars.  But the Eggplant Fries, were soggy and not very good at all.  Because I was still hungry not eating much of the other we ordered some Fingerling Potatoes.  They were pretty good.  I wish we had ordered them instead of the Eggplant Fries.  Overall, I'd like to give them 3 1/2 stars.  But since I can't, I have to just go with the 3 stars.  Definitely not worth a 4 star.  I hate to say this, but I doubt we will ever go back."], ["Jennifer M.", "This is the perfect place for a nice adult evening on the town. The food menu is superb. It is so much fun to order several small plates and share. We had the cheese plate - the manchego cheese is not to be missed. We had the shrimp and scallops tapas. They were perfectly prepared. The wine menu has a nice mix of selections and the martini menu is also interesting. A very fun and interesting place for dinner, especially when you enjoy tasting many dishes."], ["Adrienne J.", "It sincerely distresses me to write a review giving Gervais & Vine anything less than 5 stars. My husband and I have been going here regularly for at least 6 years. We LOVE the food and atmosphere, and in all times past, the service. Tonight we went in for dinner, with a reservation, and were taken into the back room to be seated. The hostess asked if the table was okay, and my husband asked if it would be possible for us to sit in the front part of the restaurant. This was met with an undisguised eye roll and sigh that was loud enough for me to ask, \"Is that a problem?\" The hostess responded, in a clearly mocking tone, \"No problem at all.\" She proceeded to seat us only one table away from the hostess stand (which was fine) and then discuss my response to her eye roll and sigh, quite loudly, with the other staff (which was NOT fine). This was all done loudly enough that my husband then asked the server, who was included in the hostess stand conversation, if our seating was a problem. Initially, I took this quite personally, but as we sat and continued with our meal, I saw this process repeated with at least half of the customers that were seated. Eye rolls, loud discussion among the staff nearly mocking the patrons, and general attitude of annoyance from the staff. We have never left the restaurant without ordering at least one bottle of wine, several orders of tapas, and at least two desserts. I was so uncomfortable by the end of our meal that we opted to head to Kaminsky's for after dinner drinks and dessert. (Which, by the way, was FANTASTIC!) It just generally seems that all of the employees hate their jobs and that all of the customers are a bother. So disappointed that the service has, seemingly, gone so far downhill at a restaurant with fantastic food and great ambiance."], ["Michael Y.", "Great experience. This place came highly recommended and did not disappoint. I tried the goat cheese, which was amazing, followed by the marinated olives, which were excellent. The meatballs were good and the Sicilian pizza was great. Great atmosphere, great service, great menu, great food. Definitely coming back here."], ["Robert V.", "This is my go-to happy hour spot with my wife after a long work week. Whenever we have a hard day our first thought is to head over to Gervais & Vine and uncork one of our favorite bottles of wine. The atmosphere is one of our favorites for just hanging out and having a light meal with great wine. The staff are super nice, always helpful with a smile, and they go out of their way for us every time. There's usually light live music in the background, a happening bar area, and good crowd. Now that we've tried most menu items, I can say that my favorites are the petit filet, almond brie, and the duck."], ["Rachel G.", "My husband and I had amazing food the last time we ate at Gervais and Vine. This time, we both agreed, was not nearly as good. It was disappointing to spend so much money, and have the food taste \"okay.\" The triggerfish special was cold when it came out, and the duck wasn't very flavorful. The best parts were the Parmesan fries and cheese plate...it should be the other way around. I'm not sure if there has been a change in chef or management, but I'm not sure if we will return in the future."], ["Rick T.", "I have had really great food here and I have had food that wasn't good at all. The servers here are really nice but, I don't think this place is consistent like maybe this place has changed hands or something. We will have to come back for dinner and give it another go. My friends say they mostly prefer to come here for dinner as the lunch is just okay."], ["Ellen R.", "I had been coming here for years and usually have a very good experience. I've recommended it to several friends. Today (10/9/2014) at lunch was the worst experience I had ever had there. I would give it one star if the food I ordered was awful. However, the tasty salmon burger and Parmesan fries are the ONLY things keeping this from being a one star review.I arrived and there was a party of 8, however they were already in the process of having their meal served to them. I placed my order and waited and waited and waited. Did I mention I waited? By this time, other diners had come to the restaurant and were seated and ordered. The place was nowhere near being packed, mind you. As I continued to wait, a 4-top, 3-top, and 2-top (all arriving after me) had already been served. The 8-top that was having food delivered to their table had long since finished eating and had left. The only table besides mine that hadn't been served their lunch was a 3-top that arrived much later than me. I think my server was avoiding me since he rarely came to check on me or when he did, would assure me that my salmon burger was on the way. At this rate, I'm thinking that my salmon is still on a boat off the coast of Alaska. So the food finally appears AFTER ONE HOUR. And the salmon burger is piping hot, so it was comforting to know that it had just been cooked and hadn't been sitting on a counter for 45 minutes, however, this means that somehow my order was the next to the last put in with the kitchen. I normally take photos of my food so I can post them to yelp, but given the serious rumbling in my stomach, the primal urge to feed took over. My server was completely oblivious to the fact that I had been clearly waiting and inexcusably long time. I think he may have been high or had a NyQuil hangover since I didn't get the sense he was 'all there' today. Needless to say, Gervais and Vine is one of my favorite places for happy hour with girlfriends or for a low key lunch, however today's experience greatly disappointed me."], ["Sherrie M.", "The food was great from what we were able to enjoy as we we forced to cut our dinning experience short do to an annoyingly LOUD patron. Kind of funny as we come from Twin Peaks next door and the working class establishment was far more QUIET and enjoyable than a \"ritzy upper class\" restaurant where apparently \"money doesn't by everything\". Hostess was a SNOB! but our waitress was AWESOME!"], ["Sheila F.", "We had a big party of 12. We had tohave ordered everything on the menu.  The filet was out of this world, she crab amazing, lamb yummy, salmon was great!!! Appetizers, wine, Brussel sprouts, asparagus, salad and cauliflower soup... I need new superlatives!!!!  Amazing food , great service and a memory to last a lifetime.  A wonderful, knowledgeable server named Kristin!!!"], ["Sarah L.", "Great food, great atmosphere, and knowledgeable wait staff. We ordered the bartender's special bottle of wine and were pleased with the selection! Must get the Brussel sprouts, garlic fries, Moroccan pork, and try their shrimp feature. Food is TASTY and the atmosphere makes it even better!"], ["John Robert B.", "Let's just start by saying that Gervais & Vine is one of my favorite places to eat in Columbia! I have eaten here half a dozen times over the past couple of years and I have never ordered anything that was great. The menu is very large, but my favorite items are: Seared Jumbo Sea Scallops, Petite Filet Mignon, Warm Almond Brie, Beef Paillardes, and Spanish Asparagus. MMMM....my mouth is starting to water just thinking about it! They also boast a large wine menu, which pairs nicely with my love of wine! If you visit Gervais & Vine during the weekend you'll dine to live music. The atmosphere is quaint, trendy, yet fancy. I will tell you that the prices are a bit on the high end, so we usually reserve eating here for special occasions and celebrations. Have something to celebrate, but don't know where to go? Look no further than Gervais & Vine!!"], ["S H.", "Gervais & Vine did a GREAT job welcoming our large group last night. They prepared a special vegan menu, set out a small spread free of charge and the chef seemed authentically happy to have us. (I did feel badly for the server who handled several odd, borderline rude questions from a lady at my table though.) I ordered the artichoke paella and was very pleased with it. It was simple but well seasoned, reminding me of Mexican-style rice. I also made sure to sample the fresh-made hummus and cornichons. (Love those!) The hummus had a nice, subtle mustard flavor. Thanks again to G&V for accommodating all of us and doing it so well!"], ["Stephanie S.", "Enjoyed a night out with the girls here. The wine selection is top notch and so it the food! We ordered 6 different items and tried them all. The garlic Parmesan fries and Brussel sprouts were yummy! Definitely check it out!"], ["Leah M.", "Excellent wine list with lots of Spanish options. We always start with a spread tray and the Costa Brava never disappoints. Keep in mind tapas are smaller portions, so be prepared to order a couple of rounds. Fingerling potatoes are a personal favorite, and actually come with enough to split. Go on a wine tasting night to chat up the expert. The price is good, and atmosphere cozy."], ["Adam B. J.", "Gervais and Vine was great when it was the only place in town that did tapas (small plates), but as owners, chefs, and managers changed it's hard not to ignore so did the quality.  I fully understand the idea of tapas, but some of the dishes here are just two small for the price.  I realize that you go here for an experience and you order several small plates etc, etc,etc.  My last four dining experiences would have me ranking this lower, but the history of the place makes me say A-OK, as I'm sure I will be back again. I just hope they step their game back up."], ["Julieann L.", "Pretty nice place to eat.  The tapas were really good and ordering a few to try out and share with the family is another great bonus too.The eggplant fries (which we saw many ordered, not just us, so a great sign), the lamb chops, filet mignon, the mahi mahi, and the seared scallops were an absolute highlight! One of the best scallops we ever tried. Downside was the pizza, we had better, and it didn't tasted that great honestly.  It was the last thing to finished andOur waitress was friendly and even when the first pitch of sangria tasted watered down,  she fixed it and it tasted somewhat better. I  don't rave about this sangria though. So the atmosphere was wonderful.Service was helpful and friendly.Tapas and dessert dishes were fantastic.Definitely a place to come and try"], ["Mona D.", "I love trying out new foods and wines. So coming on a Wed for the wine tasting of 4 wines for $7 plus tapas foods fits me perfectly. And the servers are very helpful in suggesting new wines to try.  Nice place to hang with friends."], ["Dale C.", "We usually have great food and service but this time we didn't.  Our spread that we ordered with drinks came out after our entries that we ordered 10 minutes after the spread.  One of our entries came out and it was not cooked.  We decided on something else and had to wait about 15 more minutes after we finished what we had on the table.  The dessert was good.  Will try them again because maybe an off night."], ["Gary G.", "Wish the food was goodWe went for a birthday party. The food was really not good good and the service was bad. The prices were high enough for a four star place but the food was more like lizards thicket."], ["Karen S.", "Gervais and Vine is one of those places I might not frequent on my own, but we had a group event there last night and our group was trying something different for dinner.  Gervais & Vine is probably more known for their wine(s) more than anything (they do have a wine tasting might during the week - but cannot remember day / time).  Me not being the wine drinker, I would more than likely not frequent just for wine tastings.Moving onto dinner.  Tappa = apetizers and was not sure if there would have been more of a larger dinner option than what was offered.  Most meals looked small compared to what is probably considered normal nowadays, but also reasonably priced.  I had decided to go for the safe bet and get a pizza.  I was more or less expecting my pizza to be a flat bread pizza (which it might have been - but crust was a little thicker than I was anticipating).  And there was LOADS of cheese on the pizza.  I am not much a a melted cheese person and the amount of cheese on the pizza was more than I cared for.Given the amount of people in our group (around 30), service was fairly quick after our orders was placed (but everyone was ordering when they came in - which was at different times).  There is a room towards the back of the room (where we were last night).  Not 100% sure if this room is used strictly for group events, or could be used as an overflow."], ["Angie W.", "Our server was really nice and he was very down to earth. The atmosphere was really comfortable but had a naturally formality to it. My daughter and I got stuck in race traffic and decided to eat there so we were actually under dressed. Regardless of our attire they were very courteous to us and we enjoyed our meal.We ordered scallops which were tiny but tasty.    We ordered the shrimp spread and it was very good. The fillet was very good. Eggplant fries were not very good- I think they should have used fresh Parmesan cheese and not powdered to enhance flavor. Overall my daughter and I were very pleased."], ["William K.", "My husband and I were not impressed by Gervais and Vine when we stopped in for a romantic dinner and wine. I am hoping that our next visit here will improve our regards for the restaurant, but it will be some time before that happens. There was not anything that overly impressed us, service was slower than expected and the wine did not color my memories of Gervais & Vine in a positive light. The best summation is to describe the pizza we ordered as one of our dishes. The Greek Pizza we ordered was not well cooked and in some ways could be considered soft. The dough just was not cooked well enough to serve as a base for the ingredients nor were the ingredients tasty enough to serve as the toppings alone. With tapas food, each ingredient, each dish, must boldly carry itself with spices and flavors. The flavors here fell flat about halfway through the palate and only satiated our hunger, not our desire."], ["David A.", "Loved this place. My new favorite in Columbia. Went with my daughter and her friend. We ordered a bunch of different dishes/tapas to share. All different cuisines and everything was excellent.Highlights:The flatbread with pesto was very good. The crust has a unique texture and it works!The mussels with chorizo were great. Nice sized portion as well.The hummus seemed to be blended with edamame. Not sure, but it was delicious.Had to get something not so healthy. Been trying hard to stick to my plan. When you cheat it needs to be worth it. The eggplant fries were worth every bite!Scallops were recommended by our waitress. I am not always a fan. These can be fishy. These were awesome. Melt in your mouth.The chocolate cake for dessert was devoured as well.Service, by Roxie, was very good. My only suggestion would be to space out the dishes more. Just about everything came at the same time."], ["The C.", "Amazing service and selection of wine.  We sat outside. The place was slammed but did not slow down the service or attentiveness of our server. Definitely went with her recommendations for food and wine and they were spot on!"], ["Brooke W.", "Great meal here, each dish we tried was good: gambas, Brussel sprouts, the she crab spread, and the meatballs. Plenty to choose from"], ["Catherine T.", "I've been to Gervais & Vine twice in the last month, and I won't be going back anytime soon. The service is terrible. There's a very nice man who I assume to be the manager, who serves as the hostess/bus boy/waiter - basically everything. He clearly needs some reliable help. The last time I was there was for a friend's birthday, we had a table of 7. When we finished our food, we waited so long for the check that a friend had to get up and go find our waitress. To give you an idea, we sat down at 8, and we didn't leave until 10:30p.m. And we all only had 1 or 2 drinks - it wasn't a crazy party by any means. The food is ok - nothing special, at all. The cheese plate is something you could easily create yourself from Publix. I had the scallops last time and they were horrible. They were served cold and I felt like they had been sitting awhile. I love the idea of this place, but it needs to be revamped, badly. There are plenty of better places in town."], ["Elissa K.", "Great date night place! We enjoyed our wine, pizza, crab dip, and moraccan pork throughly!"], ["Jennifer R.", "Don't come here if you're in a hurry.  A great place to relax with a glass of wine and have a few bites to eat.  Delicious! I had a great time!"], ["Tanner B.", "Love this place!  Everything I have had here was delicious and is always topped off with great service!  Usually start off with the cheese plate - there is a funky looking cheese that they have every now and then that is amazing - whiskey cheese.  2nd choice is usually the mussels - the broth I could bottle up and drink it alone.  Finally topped of with a pizza not sure what it's called but it's the one with all the meats.  Lol!  Defiantly a top choice for me in Columbia."], ["Tiffany S.", "What else do you do on Tuesday at 1pm while you're wandering around?The waitstaff and wine are top notch at this location.I don't remember our waitresses name but she has awesome hair and great knowledge of all the different wines on site.We left happy and wine(y)"], ["Vonnie S.", "I stumbled into this place one frosty night as they were one of the only businesses open after SC got hit with a nasty snow storm.  Service was awesome and quick!  I started with their brussel sprouts (delicious!).  They were cooked with warmed feta cheese and a great starter portion.  I followed up with the special for the day/season which was monk-fish with roasted potatoes.  I am huge fan of fish and hadn't tried monk yet.  To my surprise, it was light and it was cooked in a tasty wine and garlic sauce.  The fingerling potatoes were roasted well with the perfect amount of salt.I sat at the bar where everyone (incl the patrons) were friendly.  Because I sat at the very end near the cash register, my chair kept getting bumped as the wait staff went by.G&V is a quaint little place that I'd like to try again!"], ["JP S.", "expensive for what you get.  for 2 it was a wine by the glass x one for each.  3 tapas and one salad... came to $70 before tip.  Yikes.  Left hungry and filled up with a McDonalds Quarter Pounder.  Service was OK, a bit slow and the volume could be LOUD at times.  But would give it a 2nd chance,  Live music on Wed Night as advertised.  Parking could be an issue."], ["Ricardo S.", "This is not really a restaurant, it is a bar place with something to eat. Quality of some tapas are not so bad, the humus,  the cheese. But the crab was just too hot, and the duck is served with some fat on the top ?? Also, the portion is much smaller that  looks on the pictures here, and they charge $14, for the same money you could eat much more in a nice Thai restaurant. Service is not really good, and the only question asked when I was there was if I would like more wine (which meas spend more money). Don't really care about your satisfaction.DO NOT EVER ORDER PIZZA, then you realized in this place, pizza means some bread with some weird cheese on the top, no marinara flavor.In the end same woman that asked if I want to order more wine, Roberta RM Piroleau asked when I was leaving if I was happy. She seems to have no idea whatsoever about I was talking about, she patiently listen to me and gave me her card, asking me to come back. No promise of better service, just courtesy sentences like \"I am so sorry\" reminds, me an operator from a customer service of any call center.I do repeat, this place is nothing else than a bar, with no atmosphere like a Spanish tapas place, just a name and some words written in French (never specify in the menu what they serve you as \"charcruterie\" which refers to a delicatessen store, pork cool cuts, so I prefer not order it, I am sure was a wise decision, because I am sure was a good way to overpriced some cool cut of pork.If you want to get some drinks, go to a regular bar, Columbia has plenty of bars.BIG DISAPPOINTMENT !  DO NOT RECOMMEND TO GO."], ["Jay M.", "Coming from out of town for homecoming we decided to take our group out here after the game. We made reservations about a week in advance and showed up to the restaurant to find out they were closed for a private party. Don't you think they could at least call to let us know so we could make a reservation somewhere else? I assume the service inside would have matched this kind of treatment so we will avoid this place on our trip for the next game."], ["Christopher K.", "This was my first time Gervais & Vine. As a vegetarian, I found a very good number of small plates to be able to make a meal and probably come back several times without repeating too many.  I went with a small party and split a bunch of dishes - as you should when eating tapas.  The food overall was good but I kept thinking that some of the dishes were falling just short.   For instance, the brie plate would have been vastly improved had the brie been baked and served runny.  The stuffed grape leaves were good but could be easily improved by adding fresh mint, currants or toasted pine nuts to the stuffing for a little more flavor pop.  The pizza crust needs to be completely changed and made in house to take advantage of the oven that is boasted about on the menu.   Expect to eat about three small plates per person.  You might be able to get away with two if you choose particularly heavy items.Minor complaints aside, I found the atmosphere festive without being too loud and the wine list very nice.  I'll probably head back within the next month or so to try some of the dishes we didn't order."], ["Jennifer M.", "We ended up here based on the menu we saw here on yelp. As it turns out, it was the wrong menu (somehow, another restaurant's menu shows up instead). However, it was the happiest mistake ever! We were there with a small group for a work event and decided to stay despite the menu mix-up. The tapas were great sizes, and fantastic flavors. Everything we had was amazing- meatballs, shrimp, lamb, duck (my favorite), olives, cheese and more. The wine selection was good without being overwhelming and all-in-all it was a great value."], ["Emily C.", "This place is adorable, very chill and super friendly. We got great drinks and recommendations for places to go dancing. Order the  Moscow Mule and ask for a shot of their home made ginger syrup to go in it. The food is excellent. Highly recommend!"], ["Ethan P.", "First off, I feel I should say our waitress was awesome.  She was attentive and apologetic. She did an excellent job considering how understaffed the restaurant was. We ordered seven dishes but had to cancel one because the service was incredibly slow. Thumbs up for the she crab dip and the spicy gambas. Conversely, the filet mignon and the brussels were mediocre at best. The filet tasted as though it was thrown on the grill haphazardly after being cut. It was dry and boring. The brussels were overcooked and the goat cheese was an unnecessary addition. The bacon worked though. Notwithstanding slow service and a bit of disappointment with some of the dishes the wine selection was quite interesting. Hopefully this was a one-off that won't occur again. Our advice: do dinner on a weeknight for a better experience!   Stay away from the filet!"], ["Damon S.", "LOVE this restaurant! My wife and I are fans of tapas and the food here is fantastic. Very nice ambiance also. Staff is friendly and prompt every time we're there. Only reason I took a star away is because they are a little stingy with the wine, and actually have lines printed on the wine glasses for the bartender."], ["Alli O.", "This restaurant has a very fun atmosphere that would be a great place to listen to a live band and enjoy a glass of wine.  However, it is not a great place to have dinner.One of my friends had her boyfriend visiting from out of town and she wanted to have dinner and go to a few bars in Columbia.  She stumbled upon this place via Yelp and thought it would be a great option.  It would have been if we came to Gervais and Vine for wine or a small appetizer, but for dinner I was incredibly disappointed.  My husband and I ended up paying more than we would have more a normal dinner on a few bites of food!  (And my salmon was not cooked all the way through!)If you are looking for atmosphere and wine this is the place to come... dinner not so much!  The garlic-parmesan fries were good if you go!  :)"], ["Sherlene L.", "This place is one of the best in Colombia SC sat at the bar and felt so welcomed! The manager was people friendly!! He sat there an talked to me personally. The food is great. Chefs are also people friendly. I felt so welcomed. Truly great customer service. The way it should be anywhere you go."], ["Adam P.", "Having lived in Columbia for more than a decade, G&V has always provided a consistent comment upon leaving, \"why don't we come here more often?\"The food is creative, the specials are always wonderful, the wine and beer are hand selected and awesome values."], ["Mike M.", "I must say, I've missed this place! About 10 years ago, my job had me traveling in this area a few months out of the year. I got to know the restaurants in Columbia very well! Gervais & Vine was one of my favorites! For the uninitiated, tapas consists of small portions of different dishes meant to share, like appetizers, but the whole meal is that way! Today was a blast from the past of sorts! I started with an Ensalada Verde, basically mixed greens w/ balsamic vinaigrette. Next I tried Grilled Brussels Sprouts with Bacon, Feta and a White Balsamic Reduction. This was a stretch for me because I've never had Brussels Sprouts before. I have to say, personally, that the addition of the other ingredients didn't make it particularly palatable. I only managed to eat two of the ten sprouts! Luckily, the waiter was able to remove it, even though I was perfectly ok with it remaining on the ticket. I had to add Garlic Parmesan fries mainly to get the taste of Brussels Sprouts out of my mouth and rounded out the dinner with Herb Grilled Lamb Chops! Perfection! All in all, it was a very good meal. If you happen to be in the neighborhood, give Gervais & Vine a shot! You won't be disappointed!If wine is your thing (it isn't mine), I hear this restaurant has a very good wine selection!"], ["Richard H.", "Really well done. Very relaxed atmosphere, fantastic tapas, and great wine selection. Not quite like being in Spain but they're trying."], ["Magan C.", "A very cozy find on Gervais Street, perfect for that romantic evening or intimate gathering with friends. The wine list was extensive enough to accommodate anyone's fancy and there was a grape to compliment every entrée. We started with the Costa Brava and it was an exquisite blend of creamy cheese with hints of bacon. Loved it! We finished with the Gambas (be sure to ask for extra bread to sop up the sauce). The Gambas had just the right amount of spice and bold flavors with tender succulent shrimp cooked to perfection. Amazing! Can't wait To go back!"], ["Annie F.", "Delicious tapas I would recommend the gambas-great sauce, the artichoke hearts and the garlic potatoes! Delicious delicious"], ["Swetha G.", "I.had.TWO.foodgasms.tonight. Holy f$$##!!!I've been to Gervais & Vine a handful of times over the last few months but tonight the food was an A++, the best I've had at the place, EVER!  My friend and I ordered four dishes and split a dessert and everything was phenomenal.  The eggplant fries were soo much better this time than the last time I had them.  The crispy exterior and tender and juicy interior were equally PERFECT.  I absolutely loved the side honey yogurt dip and romesco sauce, they both were A-MAZING! I got my first big foodgasm from this plate alone! I also had stuffed grape leaves that were mouthwatering.  The Roman pizza was just as good today as it was when I had it the first time.  The spinach artichoke spread was heavenly.  But my ultimate and final foodgasm came from the Chocolate Hazelnut Torte, which was THE best way to end an already over the top dining experience. I fell head over heals for the chocolate fluffy ecstasy, there's no other way to say it.  Todd my man, you've got mad culinary skills!"], ["Joe G.", "This place is an absolute joke. My first experience at Gervais & Vine consisted of many different plates of overpriced, undersized, and mediocre (at best) food that was shared between a group of six friends. We came for \"jazz night\", which was listed at two different times on the menu and website, but that wasn't an issue since there was no jazz anyway. Our waiter told us that sometimes they play jazz over the sound system, but that there hadn't actually been a live jazz band in a long time. When asked how their sangria was (it is watery, flavorless, no fruit), our waiter told us it would \"get us drunk\", and while we were all pretty taken back by this unprofessional remark at the time, in hindsight- I wish it did. Perhaps then we would have been intoxicated enough to not care about the rubbery, insipid cheese plate and cold empanadas. Our group of friends had multiple Living Social deals between us, so we all fought over who could use their's on the check (only 1 per table), because nobody wanted to go back. Unfortunately, I did not win that battle, so a couple of weeks later my girlfriend and I went back to burn the Living Social deal on some wine and dessert because how bad can that be, right? Bad. It can be real bad. After a brief glance at the uninspiring, grossly overpriced wine menu, we decided on ordering a couple of glasses of port to go along with dessert. Being a fan of both the Sandeman Ruby and Sandeman Tawney ports (which they had listed on their menu), I asked our waitress how the Sandeman Reserve compared to the two. Laughing, the waitress told us that she has no idea, because \"usually, people don't ask about the dessert wines so we sort of just pour them whatever\". She said that she wasn't even sure if they actually had those wines in stock. Nevertheless, she went in the back to see if she could find out any more information on it, and came back with a sample for me to try. She said they did not have the Ruby nor the Tawney in stock, and the wine I was about to taste wasn't actually a Sandeman Reserve, it was \"something else that they just say is Sandeman\". After I asked what wine it was then, she went in the back to fetch the bottle, came back with it, placed it down on the table, and said, \"this one.\" For dessert, we ended up ordering the almond joy bread pudding, which was miserable as well. If you are looking for a tapas style restaurant in Columbia, do yourself a favor and go elsewhere. 116 and Mamas and the Tapas are both better options, as is just ordering a few different things from the McDonald's dollar menu and calling that tapas."], ["Anthony D.", "I am waivering between 3 and 4 stars.  I ended up with 4 because it was a cool place with friendly people.  But it was the pianist on site was so unbelievable talented that ultimately I have to go with four stars.  I wonder if the bar knows how good he is?!Started with a mixed green balsamic salad with Gorgonzola, strawberries and spiced almonds.  Excellent! Something so simple but was perfect!  Olives were great.  Flatbread was doughy and tasteless.  The pizza looked great on the menu.  700 degree stone oven, etc. Call me a fool for ordering pizza in SC.  It reminded me of airport pizza.  I guess I expected a thin crust, brick oven charred pizza.  Nice wine and beer selection and outdoor seating too.  I'm sure there are better places in town but worth a try.  Just don't get pizza if you are from NJ or NY like me."], ["Thomas V.", "I came once with friends and shared a bunch of tapas and a bottle or two. The wine pricing and selection is OK. But the food is poorly executed. It's one of those places that looks nice and doesn't taste bad but you leave wishing the ingredients were a touch better and the preparation was much better. Not a bad place but I would only recommend it if you are looking for a new place to try. Hopefully for you it turns out a little better than me."], ["Jeff B.", "What a wonderful owner.  I love to sit at the bar and have some small plates.  I am really excited that they are now open for lunch.  I look forward to returning soon."], ["Sam T.", "Tapas Tapas Tapas...wonderful Tapas.  They aren't like spectacular, and they certainly aren't for someone who is hungry.  If you are hungry...maybe...go to another restaurant.  If you are enjoying a good time with friends or family come to Gervais and Vine.  I have had better Tapas before, but any of their meat courses are very well prepared.  A decadent duck, fantastic fillet, and scrumptuos sirloin.I personally do not want to watch someone prepare my food, and that is what happens at this restaurant.  I also wish they had a risotto option or more pasta/rice options.   All in all...they are okay"], ["Jennifer B.", "I really enjoyed everything I tried at this restaurant. Great vibe and nice staff :)"], ["Emery E.", "Wow! Having lived in Columbia for only 6 months we finally found our spot! My wife and I get out about once per month to eat childless. We were suggested this restaurant to eat at, and they more than delivered. We love great wine, and they had delicious wine at great prices. The food was well prepared, and delicious. On top of that the atmosphere was brilliant. Not your quiet  whispering kind of place, everyone in the restaurant was having just as enjoyable of a time as we were. We typically go out and spend a lot more on subpar food, so it was a relief to have great food, great wine, great service, and a bustling atmosphere on Saturday night and spend less."], ["Erin L.", "great tapas and great sangria"], ["Lisa H.", "Smoked salmon...fabulous! Eggplant fries are the best!!! Gambas shrimp and seared sea scallops...out of this world. Super busy even on Monday night. Sat at the bar so pretty good service. Highly recommend this restaurant!"], ["Emily E.", "We tried the bruschetta, herbed flatbread, lamb chops and beef paillardes which were all tasty but the service gets an F.  Our food arrived at a good pace, however getting the attention of our server after that was virtually impossible.  It took 5-10 minutes for drink refills, and at least 10 more to get our bill.  She would walk by our table several times, clearly showing preference for larger groups (we only had 2).  My recommendation: only eat here if you have a group of 4 or more and/or have a lot of patience!"], ["Shon I.", "Great little place with some wonderful food. Really nice eggplant fries and fried Zucchini flowers. If you set at the bar you can watch the chef prepare many of the tapas"], ["K W.", "Unfortunately the only thing good I can say about this place is the atmosphere is warm and the drinks are cold.  The mussels were slimy soaking in a bowl of juice that resembled the taste of the water the mussels were washed in.  The meatballs tasted frozen.  Lastly, the flat round was not impressive, store bought with old ingredients added.  I will not be back anytime soon for the food!!"], ["Marcus M.", "The food, music, and wine...all on point!"], ["Rich M.", "My fiancé and I came here for our last date before getting married. I'm not sure if its possible for us to have had a better time. The tapas are the best I've seen in Columbia. The service could not have been better either. We loved our visit and are definitely coming back. I can not recommend Gervais & Vine enough."], ["D G.", "Food was great....service was TERRIBLE!!!What we thought would be an nice dinner took over 3 hours...there were only 2 of us. Our food took forever and we rarely saw our waitress. Yeah it was Saturday and they were busy...but don't you want your restaurant to be busy? They clearly don't have the capability to handle that sort of situation. I probably wont go back. There are too many other (and better) restaurants in Columbia."], ["Dave M.", "Great wine and tapas bar. Never a bad meal."], ["Jen M.", "Great wine and tapas! A fun place to grab dinner and drinks. The specials are usually pretty great."], ["Kirsti N.", "A gem in Columbia that is just as much fun sitting at bar watching the tapas get cooked as it is eating them. I have yet to have a bad meal here, visiting when I'm I'm town from Charlotte."], ["Gunnar P.", "I am a regular here and just have never taken the time to give them a review. I was there again on Saturday evening. The food was good as usual. Service is always great and they have and excellent wine list. It is one of my favorite places to go in Columbia. I highly recommend it."], ["Thomas L.", "Great restaurant! The wait staff is very friendly and laid back and the food is amazing! I will definitely be back again. I only wish they would take reservations. The wait for a table was a little bit long but worth it in the end (45 minutes)."], ["Kevin C.", "I have loved Gervais and Vine, so when my parents came into town, I took them there tonight. After being told our wait would be 30 minutes, it was 2 hours. We only waited because we kept being reassured we would be seated soon. Once we were finally seated, our table was cleared (slowly), we had to ask for menus, utensils, plates, and water. We were stranded for 15+ minutes without a waitress. She was the highlight of the night. The food was good too, but after an hour and a half we still hadn't received it all (it was all ordered at the same time). So we asked to speak to the owner who made excuses without actually taking ownership for the poor service. They did finally decide to cover our tab, which was the right thing to do, and while I love the food, and it was still good tonight, I have never felt more disrespected by a restaurant and it's owner. This was a 4+ hour affair and I never got my order."], ["Paul B.", "We moved to Austin from Columbia, and Gervais & Vine is one of the VERY few things that make us miss SC.  We've always had a good time when we went - frequently, a little too good :-) .  It is a Tapas restaurant, so don't expect huge portions.  Expect exceptional food & fantastic wine.If they still offer the wine club - I cannot, repeat CANNOT recommend it highly enough - it took us from total wine n00bs to, well, we're still not experts, but dammit, we're certainly had fun learning!"], ["Sally B.", "This was a staple restaurant for us when we lived in Columbia. I have NEVER had anything bad here. Kristian and all of his staff are AWESOME! They are very knowledgeable about wine..duh AND the tapas is incredible! Try it all!!!Nothing beats nice weather, sitting outside sipping some yummy wine while munching on some delectable tapas! Perfect!Also of great mention is the Wine Club!! Two words..JOIN IT!"], ["Nicole S.", "My lovely friends took me here for dinner the other night, and it was delightful.  Cute little place!  Great ambiance and they had a great little jazz duo playing as well.  The staff was very friendly and helpful with the menu and drinks.  The wine list was great and quite affordable (of course, I'm used to NYC prices).  We started with a trio of spreads, The Roasted Garlic-Buttermilk Blue Cheese, Costa Brava (blend of Smoked Gouda, Shrimp and Bacon), and the She Crab.  This started a heated debate of which one we all loved more, there were a lot of taste tests to make sure.  The Coasta Bravo won hands down, but everything else was a close second.For our dinner we had an array of delicious dishes.  The scallop and pork plates of the day were fabulous.  The Petit Filet Mignon with Feta and Balsamic Reduction was very nice.  The Grilled Shrimp with Sun-dried Tomato Pesto and Garlic-Parmesan Fries with Spicy Aioli were both delish.  The biggest disappointment for me was that the almonds on the Tapas Combo - Spiced Almonds, Olives, marinated Manchego Cheese, were just regular almonds and not marcona... which would have been more traditional and tastier.We were too stuffed to desert, but I'll be sure to try it next time I'm in town!"], ["Emily E.", "The lamb chops, herbed flat bread, bruschetta and beef paillardes were tasty but the service was horrible!  Our server spent all her time with larger parties and ignored my party of two.  We waited about 10-15 minutes to get refills and the bill. When she brought the \"bill\" there was no check in there so we ended up waiting even longer. My recommendation: only eat here if you are with at least 3 others and/or have a lot of patience!"], ["Curt K.", "Nice atmosphere! I walked in, sat at the bar, had a nice tempranillo and listened to some nice, live music. The staff was courtious as well. I'm looking forward to going back and trying more on the reasonably priced menu."], ["Amanda W.", "Have found some really nice new wines! I'm a 'Red Girl', and this lovely little place has introduced me to some reds I never even knew about! The selection of tapas is so cool - I have tried just about everything on the regular menu, and I have to say the olive plate and the cheese plate are my fav!!! I love the fact they have nightly specials (at really great prices), and the fact that the owner/chef emails us regulars with what's been going on in his awesome cooking/wine world and what's coming up at his 2 restaurants. A+++ I LOVE going there!"]], "Mediterranean Tea Room": [["Janine M.", "An amazing restaurant in Columbia! The 6oz or 8oz Grilled Chicken is the best! You get a salad and rice with it and it's a great size portion. Cool atmosphere and great place to take people who are visiting! Can't say enough good things about this place!"], ["Julie R.", "Just tried this place and I love it! I got the kofta plate which came which tabbouleh salad, hummus and pita bread, and yellow rice. Everything was delicious. I am definitely going back!"], ["Adam B. J.", "Tea Room has been one of my favorites since I moved back from Charleston in 2001.  The best hummus ever, hands down.  I love the gyro here, it is different from everywhere else.  They use hummus instead of Tzatziki, and the hand made gyro meat (I think it is more like kofta) is great.  Service is always dynamite.  Only complaint, they could cut their tomatoes and cucumbers a little smaller.  But opinions are like.... Love this place."], ["Denise K C.", "I have been eating at MTR for sooo long. I love the Salmon, my husband loves the Thursday night Spaghetti. My daughters love the Vegetarian Plate. We always enjoy the servers. We've been eating at MTR for so long that the Servers have watched my children grow up. They even watch out for my girls when they eat there on dates. It's like family."], ["Nick C.", "The food is always great and the portions are massive. Try and get David for a server if you can!"], ["Bailey B.", "Always fresh food, friendly staff, and a great experience! I have yet to eat anything here that I was disappointed in!"], ["Polly T.", "My weekly go to"], ["Jim L.", "You need to go to MTR on Thursday for the spaghetti special.   It's the best I've ever eaten....fresh and light and delicious!"], ["Ovunc Y.", "Consistently great! We order a lot appetizers, then usually share an entree. Try 'baba' and 'eggplant appetizer'."], ["McKenna C.", "This is by far my favorite restaurant in Columbia. I no longer live there and miss it like crazy (the restaurant). The Greek chicken over rice with a greek salad is ridiculously good. They have the absolute best feta and always super ripe tomatoes. I always ask for extra feta. I'm so jealous that you're reading this review which means that you're probably trying to decide if you should go there. Just do it."], ["Evan N.", "This is quickly becoming one of my favorite places to eat in the Columbia area.  Everything I have had has been awesome and has an authenic taste.  The service has been fast and friendly with no issues.  In fact, I have had the same survery 5-6 times and she takes so much pride in her approach, I thought she was the owner (she is not).  I would highly recommend this place."], ["Angie W.", "I love the humongous salad, rice and chicken breast plate. It's absolutely delicious and inexpensive. The hummus plate is also yummy.I love the local dive restaurant feel, it's cozy and welcoming. I highly recommend."], ["Somer P.", "I absolutely love everything about this place, the lighting, the atmosphere, the waitresses, the kitchen, the menu-EVERYTHING is perfect! Small joint, show up early for good seating or just call in and pick up! Either way it's the most delightful food in town!"], ["Khadija E.", "I have only been here once for lunch, and I found my falafel sandwich tasteless and messy. It dripped like crazy and eventually fell apart in my hands. The decor was cute though. I might go back just to make sure about the food."], ["John B.", "If I don't come here at least once a week then I start getting the shakes. The Greek chicken is the best! I would kill to find out how and with what they marinate it in. Mandy is the best waitress in town. #truth"], ["Aaron V.", "Finally! After trying a few other places, I was worried that Columbia just didn't offer good Mediterranean food, but this place is the one. The food was fresh and full of flavor. The service was spectacular, and the place was clean with a nice ambiance. Will definitely become a regular here."], ["Bryan B.", "I haven't been here in about 8 months, but it's the first place I think of for food when I think of Columbia. Best hummus I've ever had. Period. Great appetizers. Love the vegetarian sampler, with olives, falafel, tabbouleh, Baba ghanush, feta. Turkish coffee with authentic desserts. Wonderful lamb burgers with hummus. Can't wait to return."], ["Katharine K.", "Really good, authentic Greek food. The sweet tea is really good! The Greek salads are huge and amazing, and their dressing is to die for."], ["Gena B.", "Never had a hamburger-like Gyro before, falefel not good either.  I'm not going back, I wouldn't suggest it."], ["Lindsey B.", "Have been before, was there this week for a corporate party. Food is always excellent, I had 6 oz marinated chicken breast over rice with Greek salad.  It comes on one plate, everything, and is all excellent, and large portions.  only $9 or so.Now, the down side, parking is on the street, which is OK.  But the lighting inside made it impossible for us to see the small print on the menu, and we forgot to bring a flashlight.  The sound level due to horrible acoustics was so great we had a hard time hearing each other talk.  Needs some ceiling tiles that absorb sound.  On the plus side, the service was fast and accurate, and food came quickly considering the size of the crowd and other diners.  They have their organizational act pretty well together.  Even paying with separate checks was done better than most do it. As a value proposition it is great.  As a dining total experience falls 2 stars short of Excellent.  It could be easily fixed, but, in many years, they haven't seen fit  to fix it.  Too bad since it has great potential in an area where many dine out."], ["Dade D.", "I came in this afternoon to pick up lunch, and I have to say that the service was expedient and accurate. The falafel in the falafel sandwich was lightly fried and seasoned well, and I also appreciated the portion on the greek salad. Will definitely be coming back, hopefully to dine in so I can compliment the staff for great food and service!"], ["Swetha G.", "It's hard to give this place a fair review after eating at amazing restaurants like Elie's and Al Amir.  The food was good, but I have definitely had better.  I was also a bit disappointed to see that they don't have dolmas (\"grape leaves\") on the menu, which is a very customary dish at any Mediterranean place.  I liked the falafels in my vegetarian plate and the hummus was good too, but the tabouli was mediocre.  I asked for a small cup of hot sauce to give the food a kick, and I was given a small cup of a green dish, which looked like it had minced chilies in it.  Even with adding some of this to the food, it was just sub-par.  However the place has a nice intimate and warm environment.  It's not too noisy and is a good venue to get dinner and catch up, you don't have to shout over your meal, which is always a positive!  Service was good too, our waitress was friendly and attentive.  All in all, it's a nice environment for conversation but if you're hungry for a real Mediterranean meal and want delicious food, I'd suggest going to Elie's or Al Amir, their food is just much better."], ["Katie R.", "It's alright--not my first choice to go. It was kinda of expensive for what you get and I'd rather go to Devine Foods or Al Amir. The pita was good!"], ["Alan M.", "Terrible attitude. Still open but so reluctant to seat us we left. Prefer other places in the area!"], ["Miriam A.", "Great falafel - well flavored, lightly fried, and - if you get the falafel sandwich - stuffed along with tomatoes, cucumbers, and tahini in a pita. It's not the most authentic Middle Eastern food ever - but that doesn't mean it isn't fresh, delicious, and simple good food.  The sandwiches are a great deal and with the included salad, it's difficult to finish!  The addition has a calmer atmosphere than sitting near the kitchen and take note that there's parking in the front and a lot in the back."], ["Lori B.", "I lived in this awesome neighborhood downtown about 5 years ago and  would get their take out about two to three times a week.  My favorites were the chicken sandwich w/hummus or the greek chicken on rice and a greek salad.  Got a veggie plate and greek salad to go yesterday and it's still as good as ever.  Very nice wait staff - great atmosphere for dining it too.  Food always tastes fresh."], ["H T.", "I have been addicted to their Tea Room Gyros since college. The food is tasty and portion sizes are generous. I've always experienced friendly and attentive wait staff here. Highly recommend."], ["Karen P.", "The best place in Columbia for authentic, fresh Greek food.  The salads are delicious - and enormous!  The wait staff are unbelievable - friendly, smart and efficient.  This is one of our very favorite restaurants."]], "Zoës Kitchen": [["Linda O.", "I do appreciate that they have vegan menu items noted on the menu (and this is the reason why I keep coming back). I enjoy the veggie kabobs with a side of the braised white beans. They never seem to get our carry out order right, but the quality of the food is very good. For fast food, this is a fairly good healthy option."], ["Dante G.", "On January 18, 2015 at approximately 1500 hours Natalie D. and I, Dante G., responded to Zoe's Kitchen located at 5166 Sunset Boulevard, which is in the city of Lexington, in reference to lunch. Upon arrival we made entry through the doorway centered on the A side of the building. The actual business occupied the A-B end of the strip mall. The line follows the interior of the B side of the building to the counter. We were greeted and ordered.I went with the Spinach Wrap Ups and roasted vegetables. I thoroughly enjoyed my food. Kind of plain, but good. The roasted vegetables were the star of this meal.Natalie D. went with a Chicken Salad Sandwich and Potato Salad. She was not impressed with the food. Something about not enough mayo. What I found most interesting is there was some girl, one I had never seen before, giving me dirty looks. I wonder if she knew me. End of Report."], ["Hung D.", "Just the wife & I this time. One of the best Greek tossed salad I've had. Very fresh & lots of it. Took half home & my daughter finished it up with a smile. Wife had the chicken kabobs, not bad. Would exchange the rice pilaf for anther side   The place is very clean with bright color.   Fast food chain restaurant. We will be back & try the family meal for 4.   Open daily 11 - 9. Download their App & earn goodies."], ["Christy B.", "Food is pretty good. Customer service is horrible! There was a problem and the assistant manager, spent more time telling me he was the assistant manager (clearly a title he was proud of) than he did fixing the problem. He also continued to place blame on his staff. The issue was never resolved. I also left a message for the manager on his cell, never got a phone call back. Not convenient for catering at all."], ["Joel W.", "Cool menu, lots of choices. Food is tasty. Same menu for lunch and dinner, and I believe same menu at all locations.The property on 378 in Lexington is well managed, clean, with some outdoor seating as well.  Parking is ok (the strip mall it's in can get full in a hurry).I'd like to see them add coffee to their menu, as it would go will with the cookies and cake."], ["Karen S.", "Nice addition to Lexington.  You are able to order deli sandwiches or hot dishes.  Either way - both are made to order.  The atmosphere is new and fresh with ample seating either inside or outside (and yes - there are fans outside for when the weather permits).  Like that they had artwork by one of the local elementary schools on display.  The only disappointments was the pricing ($9+ for a sandwich, drink, and a side) where you could go to a local sub shop cheaper and at least for sandwiches - they had a limited selection of sandwich meats."], ["Elizabeth S.", "FINALLY, a fast food restaurant that won't give you a heart attack. Very good food and healthy. Highly recommend it! Kabobs are great!"], ["TheHungryDad Jeff C.", "Super fresh. Lots of variety. Not too expensive. A chain but done like a local restaurant should. All fresh ingredients prepared daily from scratch. Amazing service and little touches like real plates bowls and silverware make it well worth a visit."], ["April B.", "I went to this new Lexington location on it's first day and was impressed that it was full inside but there wasn't a long line at all. It looks like a typical Zoes, and has a great outdoor patio space with covered and open air seats. I am always impressed by the wide range of vegetarian, vegan, and gluten-free options, so this is certainly the kind of place you'd want to take a mixed bag dietary restriction group. I ordered the veggie pita pizza that comes with a Cesar salad, and enjoyed both. It's nothing to write home about, but it's fresh and healthy feeling. They have great sweet tea at this location too. The workers there were friendly and helpful. I think this will be a great and healthier addition to Lexington, which is being overrun by Bojangle's lately."], ["Mrs. C.", "I love the atmosphere, the staff and the food! Its always tasty and fresh. My toddler loves going here and enjoys the food as well. I haven't had anything from here that I didn't just love and the hummus is just DELISH!"], ["Megan P.", "Yummy yummy! Chicken salad sampler is yum! I don't care for potatoes, so I always sub pasta salad or slaw for potato salad. I've enjoyed everything I've tried from here, except med. tuna which I was already ify about"], ["Emma B.", "The food is delicious and the customer service is on point. Despite being super busy, this Zoe's Kitchen gets your food out quickly. I went with a group of friends and one friend never received his order. After waiting a little while, someone came over to apologize and have him a refund, even though he hadn't even complained. Thank you Zoe!"], ["Joe H.", "Marinara was way too watered down and way too many onions on everything  I got the Greek marinara and couldn't get passed the onions I tried picking them out and was left with some tomato water that tasted like onions. My wife who likes onions couldn't even eat her Greek salad because of the amount of onions. We left with more food on the table than in our stomachs. Waste of 20 bucks for lunch. Booths were pretty nasty as well you could see where Greek dressing has been everywhere. We left hungry,disappointed, and smelling like onions. Gross"], ["Ashley B.", "Absolutely delicious. Clean. Great service. Try the pimiento cheese sandwich!  5 stars"], ["Carol J.", "Good food once we finally got it but a 45-minute wait for essentially a fast-food restaurant is unacceptable. We were told several times by the waitress\"I'm so sorry\" but were never given an explanation. Note to Zoe's: if you want repeat customers, at least tell them why it's taking so long or offer a free cookie. Since you pay when you order, there's not much you can do but wait. While we waited, we saw numerous cars go through the drive-thru and lots of take-out orders filled. It was pretty clear that their priority is with to-go, not with the people sitting in their dining room. I would not recommend this place on a busy day or at a busy time or if you want to dine inside. Good food- not excellent or great- is not worth a 45-minute wait even in a regular sit-down restaurant. This was a big disappointment. I doubt we will ever go back."], ["Karen T.", "First time visiting Zoes. I ordered the Greek salad over potato salad to go. I was surprised at how good it was. There was a variety of lettuce including dark greens and plenty of feta cheese... Not too little, not too much. There was a lot of salad in my to go box. I was only able to eat half. The potato salad hidden under the greens was delicious. The service was great especially given that this is a fairly new establishment. Overall, I had a great experience !"], ["Trisha K.", "I've been here three times and two of those three times have been a disappointment. On  the positive side their hummus is amazing as is their potato salad. Their slaw is also very good and I love the chocolate cake. On the negative side they never give you enough pita bread to go with the hummus. On one of my visits the pita bread was hard like it had been sitting out all day exposed to the air. On a different occasion I ordered the hummus and salad plate and was disappointed to find only 6 small pieces of pita bread that wasn't nearly enough to finish the hummus with. In addition the salad consisted of nothing but lettuce, feta cheese, and ONE cherry tomato cut in half. I'm so in love with their hummus and potato salad that I might give this place one more shot but a third strike and they will be out."], ["Oli M.", "The chicken kabob was A-ok and the white beans were so good. Pretty decent gluten-free options so I would go back for sure."], ["Eliz J.", "The food was really good. Only complaint is  that it was a bit salty but still very good. A refreshing change to all the fast food chains around."]], "Arianas Greek Restaurant": [["KATHLEEN M.", "Excellent experience all around. Food, service, wine, ambiance and location were awesome!"], ["Brittany B.", "Wish I had gotten pictures of all the appetizers and entrees we tried. A group came here after a ballet a little while ago. It's off the beaten path, but worth the short drive and I will definitely be returning. All the appetizers that we got were amazing. We tried the hummus, dolmoadaki and the feta kai elies. As an entree, I tried the lamb souvlaki and it was delicious. This is one of those places where you want to try everything on the menu at least once, because it's all wonderful."], ["Willie D.", "This is one of those places where you know the food is good and fresh as soon as you walk in the door! This 5 booth and 6 table restaurant is located in a strip mall and if you blink you will miss it but don't! You walk in and the Greek decorations catch your eyes and the small cafe style layout makes you feel right at home(great for dates to im press him/her). As always when I go eat Greek I ask for the Hummus for my app and mousaka for my entree . Hummus was already smashed(so much for that fun pounding up peas) but was great with some warm pita bread. my mousaka was great and the only set back no beer license.So that meant no Uzo for me. but please go check the place out great for small crowds and just hanging out with some friends but keep in mind this is a small place a party of 50 will not work here."], ["Robert V.", "Hands down the best Greek restaurant in the Columbia area! My wife and I love our date nights out here; we can sit for hours enjoying the full spectrum of appetizers (love the Sambosa), delicious entries (favs incl the gyro plate, chicken souvlaki, and chicken karahi), well priced wine, and delicious dessert (the baklava never disappoints). And every now and then the chef will throw in an incredible special...my mouth still waters remembering a ribeye steak a few months back! Oh, and no review of this place can be complete without mentioning the incredibly delicious greek potatoes!!!The owner/chef and staff are also awesome. One time I was playing with my wedding ring and it fell off and rolled somewhere inconvenient behind our booth. The owner helped me take apart the booth to get at it :)"], ["K K.", "This is a nice tradition place just that, its small. Bought a Groupon deal. This restaurant was full . by the time we reached all the humus and pita was sold out. While asking the waitress she did not have courtesy to apologize.Got our Greek salads on the table but, had to wait 1/2 hour for silverware\" again there was no courtesy . over all the food was good, but, the servers should learn about how to treat a customer"], ["Kristen M.", "We had such an amazing meal!! Hand crafted food, made with love! The chef came out to meet with us which created a very personal experience!! Food was FANTASTIC!!"], ["Emily E.", "They either need more servers or a faster sous chef/expediter.  Waited almost 30 minutes for appetizer and 30 more for entrees.  Food was not really worth returning for compared to other Greek places in town.  Came because of a Groupon and won't be back."], ["Lois M.", "No doubt about it, this is pure and authentic Greek cuisine.  Loved the salmon as prepared by Moe, the owner/chef.   Expertly seasoned and perfectly prepared.  This was my second visit but I see many more in my future."], ["Jojo Z.", "If u wish to try their signature lamb stew, you would better call before you go. I visited this restaurant five times already, and they cannot cook lamb stew for you no matter how early you got there and they still have lamb. It is very disappointed and annoying."], ["Mary F.", "I'm rating the food, and it was soooooo delicious.  I will order here again next time I'm around."], ["Danielle M.", "Amazing Mediterranean food! I visited at 8 pm on a Saturday, and there was a nice mix of groups-from a 12 top to couples on a date. There really is something for everyone! I had the vegetarian sampler, and for $12, I had an amazing and flavorful dinner of food that you could tell was prepared from fresh ingredients. Fast service and nice atmosphere. Highly recommend!"], ["Brandon D.", "So, I go to this place just about every weekend to eat lunch.  Very quiet place, Moe, the owner is a great guy.  I love the lamb souvlaki plate.  The rice is delicious, Greek Potatoes are awesome.  And it comes with a Greek Salad with the \"House\" dressing, which is, well delicious, out of this world!  Be sure to ask to try their \"spicy salsa\" which is also delicious.  Service is great every time I come here.  The food is always cooked perfectly and tastes fresh."], ["T G.", "Went there because of Groupon and me and the wife wanted to try a new Greek place. Quiet and quaint atmosphere, only one server so don't come super hungry because it will take a little bit to get your food. Lamb was delicious! So were the spinach/feta cheese appetizers but the portions aren't huge, its just enough. Good experience and reasonable prices, we'll be going back even without the Groupon."], ["Michelle M.", "We'd stopped by on a drismal evening, after a long day of frustrations.  Purely by chance, we opted to try Arianna's, rather than one of the other establishments in this little strip. Shortly after we arrived, I thought: Let's check Yelp and see what folks say we shouldn't miss here.  I was shocked at some of the vitriol from what appeared to be people who must not dine out very often.  For example, if you show up at 2:30 in the afternoon, you shouldn't be surprised that a restaurant (closing down lunch, and getting ready for the dinner service) can't accommodate your large party. There's more I could say about the poor reviews, but that's not why you should give this spot a chance.I've learned with my bizarre collection of food allergies (colitis... so no bell peppers, cucumbers, lettuce, radishes, meat) and other things I have to avoid (diabetes... white rice) to let wait staff know as soon as we arrive. Our waitress quickly figured out which foods to make sure I avoided, and made some suggestions that turned out to be real winners.  My husband and I made dinner of several appetizers. We split the Feta  Kai Elies, a feta cheese and Kalamata olives sampler, as well as the spanakopita (technically spanikotyropita, since it contains cheese) which had a tomato and basil cause with surprising textures, that was baked into an equally surprising pastry shell.  That dish by itself will bring us back -- so many other spanakopita offerings in and around the Soda City are so bland and flat. I thoroughly enjoyed the Buranee Kado, a dish of fresh pumpkin, olive oil, and other spices; I haven't seen anything else like it in this town.  I'm willing to guess that the tzatziki sauce (alas, allergies) would have made it even better.  My husband enjoyed the beef sambosa, with more perfectly prepared pastry, filling, sauces (tomato and red pepper and taziki) and a sprinkling of cheese.  The wine list was consistent with what you might expect in a strip shopping center, which is why they got 3 stars (I'd give 3.5 if Yelp would let me).  They've put their energies into handcrafting perfect portions of food, at least the ones we tried.  This included the piece of baklava we split for dessert. In my experience, other \"Greek\" places on Sunset (Grecian Gardens and Nick's House of Pizza) are about as \"Greek\" as Zorba's or even Zesto's.Moe has done a nice job of interpreting the cuisine of his parents' homelands (Greece and Turkey) rather than relying on a sprinkling of feta cheese over iceberg lettuce to stand as proxy for real Greek cuisine.  Check them out!"], ["Adam B. J.", "Arianas has stiff competition on Sunset Blvd between Nicks House of Pizza and Grecian Gardens, but they are pretty good competitors.  Arianas blend of Greek, Turkish, and Mediterranean sets it apart from its Sunset Blvd. Greek Counterparts.  The Greek food is good.  (For lunch the Chicken Souvlaki and Lamb Gyro are great), but I'd suggest getting one of the dishes you haven't had before for dinner.  Hummus is my favorite snack, so I love that I can get a hummus appetizer here.  The portions are not as large as I'd like for the price, but maybe I'm relating them to the other Greek places.  Definitely worth a stop if you are looking for some Mediterranean offerings in West Columbia!"], ["Cynthia S.", "Why don't they show my good review? Do they like to show only the bad ones? This is a good Greek restaurant."], ["Rachel O.", "If you are on 378 and looking for Greek food I'd suggest you keep driving and go to Grecian Gardens.Ariana's has blue walls with a giant mural, a carpet on another wall and gold/bronze plates on another wall.  Pretty typical decor.  They had fake flowers in vases with water (???) but the plates, glassware and napkins were nice.  I liked the style of them.  They have a handful of booths and about the same number of tables.  It's a small restaurant.We stopped in for a late lunch.  It was around 2:30pm.  There were only 3 other tables while we were there.  When we arrived all but 2 tables were taken or dirty so had a bit of a limited selection of where to sit.  There seemed to be a meeting going on at the back of the restaurant, near the kitchen. We took a seat and a waitress came over quickly to take our drink orders.  We received our drinks from a new waitress and ordered our food.  I almost immediately received my salad (premade?).  It arrived in a small bowl that seemed better fit for an appetizer or soup.  The salad was overflowing out  of the bowl and some of the cheese and dressing dripped on the table when the waitress sat the bowl down.  As carefully as I could , I began eating it but everything was falling out of the bowl.  I used my napkin to wipe it up and it was such a mess that I had to ask for a new napkin.   The salad was fine.  Typical Greek salad.  I did try the \"Turkish\" salad dressing which was a bit different but I won't miss it. After waiting about 25 minutes our Spanakopita appetizer came.  I honestly can't imagine what took so long because it was 4 small pieces and a little bowl of marinara.  The spanakopita was crispy on the edges of the filo but gooey in the center.  This led me to think that they are frozen.  I've definitely had better frozen ones from the grocery store.  Also, for the price of this appetizer I expected a lot more.  I almost could have bought an entire extra meal for what I paid for the app.We then received our meals.  First off, the plates were \"decorated\" along the edges with stretched out slices of brown tinted peppers and some herbs.  It was very unappetizing and I immediately removed it from my plate.  I had the chicken souvlaki platter.  It consisted of 6 bite sized pieces of over seasoned chicken on top of plain white rice with a side of Greek potatoes (to me they seemed more like boiled potatoes with tomato sauce poured over it) and 2 pieces of pita bread.  Boyfriend had salmon which was a small, overcooked (his word) filet on top of white rice.  We both had tzatziki sauce. It is my favorite sauce by far and so I ordered an extra cup. That was a waste because it was the worst I have ever had.  It was incredibly runny (it wouldn't even stay on the pita bread I tried dipping it into) and was virtually flavorless. The ambiance was nonexistent.  The waitresses were cleaning the tables for the last half of the time we were there but never seemed to make much progress. They moved all the dirty plates onto one of the tables in the dining room instead of taking them to the kitchen and then tried to wipe down all the remaining tables and then sweep the floor which was a mess.  About 2 minutes before we left they turned on music. And I don't understand this part... all of the plates left water all over the table.  Condensation kept accumulating under them and the table was a mess.  Same thing with the glasses and no coasters were provided.When we asked for our check the waitress asked how everything was.  We told her it was OK.  It was. The food was fine.  I feel like I over paid considering the quality and the portion size but it wasn't bad. I ate it.  She then immediately walked to who I believe was the manager and whispered something to him and then he came over to ask us how everything was.  When I said it was fine he then said that the waitress indicated to him that we felt something was wrong.  I told him  that it was fine.  And it was.  It was fine.  But do you want fine? No.  You return to places that are great and Ariana's was definitely not great or even good.   I've had much better for less money at every other Greek restaurant I've been to in Columbia.  Let's just say that we will not be returning and would suggest you don't waste your time."], ["Rane W.", "Moved from Pittsburgh where we had good Mediterranean. However Ariana's far exceeded our expectations.  Great food. Good service.  Will definitely be back with friends."], ["Aaron Y.", "Excellent food. Service was very good. My wife has an unusual food allergy and the owner/chef spent a good deal of time talking through the menu on what would work for you. Nice, little non-chain alternative. The hummus rocked."], ["Russell M.", "Not very good at all.  Service is poor, food is pretty rough, and it is too expensive.  We were let down all the way around and we are a pretty easy crowd to please usually.  What a bummer."], ["Aaron S.", "So my review got deleted. I refuse to retype it. So heres to the shortest review ever. Amazing food. Moe is a mastermind of food (the owner) and his daughter and himself gave great service. Over the top. Amazing all around."], ["Nawfal A.", "Food surprised me - quite tasty. I have had all of the (what-Southerners-call-Greek) Greek food in the area. It's the most hideous part of the \"foreign foods\" in the city. However, with some minor, basic changes, this restaurant could solve this misery!Small location, but sufficient seating. Cloth napkins: a plus!  Attentive service. Menu: interesting and contains the standards. Food: tasty and fresh.Dislike: the motor on the fan overhead. No music or comfortable noise. The salt & pepper shakers are hideous. They need to change these out pronto! Also, the plates - awkward and a little messy. But I admit I just like the standard circle plates and care more about what's put on it."], ["Linda O.", "I appreciated this restaurant because they had so many vegetarian options.  I got food-to-go; did not dine-in. Portions were generous.  The flavor of my entrees was okay, but on the oily side. My pepperoncini was old/shriveled, but the Greek salad was otherwise good. The bread didn't taste all that fresh (at noontime). It wasn't good but wasn't completely bad either. I'm not going to make it a point to go back."], ["Julie R.", "I recently got takeout from here and while the food was ok the portion sizes suck. I got the beef kabobs dinner which ended up being literally six tiny pieces of meat on a bed of white rice. The sautéed spinach I ordered to go with it was good and the Greek salad I ordered was ok. I spent like 18 dollars on it too! What a letdown!"], ["Khadija E.", "This is an update on my previous review. I have since been back a couple of times, and I have to say, I think I am going to have to go here regularly. I have become a fan of the shami kabab. The chef (who, I think, is the owner, Mo) noticed that we looked South Asian, and so he made our food a little bit more spicy than usual. And boy, was the food scrumptious. He said that he does that for his South Asian customers. So if you want to kick things up a bit, ask the waitress to make your food Indian spicy. That's what he said we ought to ask for every time we visit. Mo likes to walk around the tables and talk to the customers, and I think that makes a big difference to the dining experience. The last couple of times he even surprised us with complimentary daal and then salad. The daal in particular was scrumptious, particularly on that cold evening. I always feel special whenever I go to Ariana's. Gold stars!"], ["Kel B.", "This place is disgusting.  The food, the atmosphere, everything.I don't even know what to say other than that Ariana's is horrible.  Do NOT get the vegetarian platter or the gyro.  Also, WAY too overpriced, especially since the food is nasty.  The waitress was nice...  so that's one good thing.Will not return."], ["Jane R.", "This is a small restaurant but high quality Greek food.  If you are looking high quality over quantity then this place is great.   I would give it 5 stars but I've only been there once. Almost Everything is made in house with fresh ingredients."], ["Athena M.", "Food was delicious. Service was excellent.  I will be back.  This will be my go-to Greek. So hard to find good authentic Greek. Very very pleased I found Ariana's!"], ["Lisa O.", "This place is a gem- wonderful, authentic Mediterranean food!  The grape leaves appetizer is amazing- and the tomato sauce to dip them in is a real find.  The lamb souvlaki is so tender; the gyro is real gyro, not the sliced frozen stuff at other places in Columbia.  Worth the trip!"], ["Becki O.", "Best Greek food in Columbia!  Chef/Owner Moe treats you like a king and queen. Tsatziki and hummus are outstanding as were the other appetizers we had. The manto steamed dumplings were good but the fried and slightly crunchy sambosas were delicious. Best lamb souvlaki gyro ever and very tasty moussaka. Highly recommend Ariana's."], ["Kinte T.", "For Greek food, the dishes were not very flavorful. The tzatziki sauce was very bland, and the spanakopita was overcooked. The hummus had a weird aftertaste."], ["Russell F.", "food was interesting...not necessarily good...very slow especially for lunch...service was unfriendly....spanikopita was cold on inside...wasn't offered dessert ...overall a very bad vibe....portion size appetizer size .... first and last time to eat here"]], "Nicks Gyros & Subs": [["Ken M.", "Awesome Greek salad and fried okrethe gyro had too much meat!!Great stop off 26Much better than fast food"], ["Madelyn A.", "NEEDS TO IRON OUT THE KINKS!My husband and I chose this restaurant because of the reviews and it also happens to be very close to our hotel. This place seems to be a local favorite because it was \"hopping\" at 3pm on a Friday afternoon.  The decor is very simple and well worn so nix the date idea and just pick it up to go. On our first visit, I ordered the chicken gyro with onion rings and my husband ordered a    traditional gyro with a Greek salad.  I loved my sandwich and my rings, they were perfect.  On the other hand my husband only liked his salad.  He said that his gyro was just spiced differently than than what he is accustomed to and was not sliced in the preferred thin strips.  To be fair, we have our favorite gyro place at home and for us, others just don't compare.  We simply love itAt 11pm, we were headed back to the hotel but needed to get a bite to eat.  Most of the restaurants were already closed, but we recalled that Nick's is open until 2am , so we went through the drive-thru.  This place was just as busy and we had to pull over to wait for our order, which was brought to our car. I ordered the catfish platter, with puppies, fries and cole slaw and my husband had a traditional burger with fries.   She had to return to get the requested sauce and when we arrived home, we realized that we had no utensils.  No problem becasue I actually carry my own pack of metal utensils so a crisis was averted.!  My fish was very fresh and delicious, I did not care for the crinkle fries sprinkled with a seasoned salt.  I like a more natural fry, lightly salted.  The cole slaw was very one note but I was able to add a shot of balsamic vinegar to spice it up.  The hushpuppies were a totalmiss because they were not fully cooked. they need to slow down and pay more attention to the details.Each time we visited, employees seemed a little overwhelmed.  They need a better ordering and processing system because they were just all over the place, confusing orders, missing items and not knowing who they had already assisted.  During the late night visit, they seemed to be having some of the same problems and they really need to work on ironing out the kinks and hire more help.  Obviously they are doing something right as evidenced by the reviews and the volume of people that always here."], ["Jessica T.", "Ok fast food. Not impressed considering Yelp review rating. The place itself is not esthetically pleasing inside or outside. Smells like grease and bleach inside. Could use a good scrub down inside and the windows need washing.My husband had the gyro and I had a chicken salad. Neither was impressive. Iceberg lettuce for salad and bland gyro. The water shares the hi-c punch soda port, so my water was lightly colored pink and tasted like hi-c flavored water without being sweet. Prices were fine. Probably won't go back again."], ["Gary H.", "Ordered the Philly steak and fries. Philly  was OK, I enjoyed the fries they had good seasoning to them. Service was good. A variety of Southern food to choose from. Ordered fried mushrooms but they will have to wait as I'm stuffed."], ["Maddie G.", "I had a great gyro with some great girls today! They shared a chicken philly with a side of fries and fried mushrooms. The amount of fries we mammoth. The only complaint would be the cleanliness of the tables. Moore (our server) helped us through the process of ordering and gave us advice. He was excellent!!!!! He was quite the gentleman, and my mom gave him a compliment after we were done eating. Hope to return for a gyro with Moores service!"], ["John O.", "I love Nicks in two notch rd and Nicks in St. Andrews rd. They have a good food and good service."], ["Sheri A.", "While the place was at least clean the food was so-so. I ordered a Gyro with fries. Part of the pita was so hard I couldn't even bite through it. Even the dog had a hard time when I gave her parts of it. I am used to a gyro that has lettuce, tomatoes and feta. I had to ask for feta and lettuce and still got very little of either. Ton of meat tho!!! Fries were kind of iffy but I'll give them a pass since I took it to go and I live 14 miles away down an extremely busy road!! (Two Notch). I might go back."], ["Amber R.", "Served quickly. The crab was very fresh and clean as well. Calamari rings were cooked just right. I enjoyed the meal all the way around! Wish there was another location. In charlotte!"], ["Shirolyn J.", "Best food and Crab legs Ever!!!! Their food is Great on Two Notch and Broad River!!!! Great prices"], ["Naturally V.", "The food was great. I ordered the Philly cheesesteak and cajun fries. I feel like I got a lot for my money. I'll definitely be back again...  The building looks nice and clean on the outside."], ["Stan M.", "Delicious food! Doesn't look like much on the outside but they have a great Philly steak. Generous portions and not to expensive."], ["Jason C.", "I had the Oyster seafood combo that came with 1/2 dozen oysters and 10 shrimp.  It was awesome.   My friend got the gyro sandwich and it looked really great, must have had 9oz of meat on it."], ["Sean U.", "Was going to go to the Waffle House next door when I saw this place. I hadn't had a gyro in a long while so I went there instead. I was not disappointed. Very good food for an affordable price."], ["Walter K.", "Pretty good. I had gyro and fries. You get a lot of fries and I mean a lot. The gyro was average pita could've been thrown on the grilled instead of just cold. I would return."], ["Annedrea D.", "I'm only giving this place 4 stars because the outside is so ugly and nasty looking.However if you can get over the looks then walk through that door and order with no fear. The food is good.The decor sucks. But the food is good. TI love their shrimp dinner. That is what I always get. It's a fried heaven. They are in no affiliation with any other Nick's in Columbia just ask them!"], ["L H.", "I've tried a few things from here before and have been very pleased. However, last night I tried the honey mustard wings for the first time - they were so hard.it seemed like the wings had just been sitting under a heating light all day and they just poured honey mustard sauce over them once i placed my order. This review is based solely on the wings I ordered."], ["Faisal S.", "Good food, reasonable prices.  Open late."], ["Bruno S.", "I love gyros and greek food in general so I was excited to find Nicks.  The staff there is friendly, polite, and our order is always prepared to perfection in a timely manner.The gyros there are made real good and their greek salad as well! I've also tried their steak & cheese sandwich and it too was scrumptious :DI will edit my review and take a picture of the take-out menu once I find it.This place is more of a take-out vs. dining in though IMO."], ["John T.", "We are from Philadelphia, so I just had to try the Philly Cheesesteak.  I was expecting a disappointment, but I was pleasantly surprised.  I highly recommend Nicks, despite the outside atmosphere.  Everyone in our group was pleased and my Philly Cheesesteak was awesome.  The roll was perfect.  Try it with just Mayo, Lettuce. And tomatoes, which is my personal favorite, called the Cheesesteak Hoagie.  Great job guys.  Good food, great prices.  This place really has potential."], ["Augie M.", "Good, very good but their new Decker location (slower) has the better cooks in my opinion. What is there not to love about Nicks? Family owned and delicious."], ["John C.", "Went here while traveling for a football game and wow... One of the best quick meals I've ever had! Don't let the outside fool you. There's such a selection that you're sure to find something for everyone, prices are very reasonable and the quality of food is bar none. The only place I've been able to get crab legs and chicken gizzards in the same meal! I would highly recommend anyone going through to look the place up"], ["Katherine L.", "Wow. I had the shrimp poboy. Although not New Orleans style(where I'm from) it was one of the best shrimp sandwiches ever. It was hot sautéed shrimp with onions, bell peppers, mushrooms, and a soft white cheese in top. I was in heaven! The place looks terrible on the outside, but that sandwich sold me. On my way back thru, I will make a special trip to stop there. Oh, and I hardly ever write reviews, but this place deserves it. Thanks for the awesome grub!"], ["Ebony Da'na C.", "Don't know what all the fuss is all about. Food was just okay, nothing special. I ordered the Philly Cheesesteak and my co-worker had the Gyro. I've heard this place was amazing so I was all excited to try a real good Philly. I got my napkins ready and everything, I was fully prepared to throw down only to be disappointed. My cheesesteak was dry and the meat tasted like the kind they would have used for the gyro. The seasoning was obviously Greek but it just tasted weird on a Philly. I do like the fact they use real cheese instead of 'Wiz. I will give them some credit though, the portions are huge and you will definitely get your money's worth. The bread was crusty on the outside and soft and chewy inside. It also tasted like it was homemade or at least baked in house. Food was out fast but the customer service was a bit lacking. Will give this place another chance or perhaps I'll hit up the other location."], ["Jasminn W.", "Their food is great! reasonable prices. Even has a drive thru.  Friendly staff. I have tried the wings, the steak and cheese subs, the gyro.  This is definitely a place  I come to visit when I go back home."], ["Brian M.", "The food was fine, the menu has everything you could want.  The owner works hard, place is clean, service was great.  This is right off the freeway."]], "Arabesque": [["Roger H.", "Sunday at 1:30, church crowd is gone and hungover college kids are still asleep. Took a second to get sat, but there was one server for the whole restaurant it looked like, so I understand. I waited tables in plenty of places where we did the best we could when we aren't sure what to expect. It just takes a skilled server with a good attitude to get it done. We got that guy. We started with a large Hummus Appetizer and Fattoush salads. There was an issue with the Damascus Bread but our server brought us some to tide us over and then a piping hot portion when it was done. The Damascus is off the chain here. Salads were delicious. Very evenly dressed and seasoned with the perfect ratio of ingredients. I got the Falafel Wrap and the wife got a Gyro Wrap. ...keepin' it simple for lunch. Presentation was on point, as they seem to take pride in the appearance of their food. See photos - I should've snapped one of the app and salad, they were gorgeous. My wife's opinion of her Gyro Wrap? \"OMG, good.\" And my Falafel Wrap was perfect. Again, even distribution of ingredients is key for me and they nail it. We took some to go because the portions exceed the average appetite but not the wallet. This place is underrated. They've got some local competition from other popular Mediterranean joints but they are slightly unique in some subtle ways. See for yourself. I think they get a bad wrap sometimes because the service is spotty but it's typical of a restaurant this size that doesn't have a ton of money to throw around and over staff with blonde cheerleader types who couldn't care less. If you can be patient and appreciate the quality of what you're getting, you'll like it...maybe even love it. I'm giving it 4 stars because of the spotty service at times but I really have no complaints."], ["Keith K.", "Arabesque is your typical Middle Eastern food joint for white people, overpriced in general, decent and comfy but nothing to lose your head over.  Nice sofa-benches good for snuggling up to your partner / inebriated co-worker, tea candle on table, low light, two inexplicable but fortunately muted televisions that ruin the otherwise pleasing atmosphere and lighting.  Generally seemed clean.Met with a friend for happy hour appetizers (half off till 7:00, score!) and tried a variety of 'em.  Hummus was on point, served with plentiful toasted pita points.  Ditto the tiny Fatayar pies, of which I could eat 'many'.  The salads did not fare as well - limp, slightly brown lettuce and soggy tomatoes and cucumbers, not for me thanks.  Stuffed grape leaves typical thawed mush, alas.  Falafels hot and crunchy, but it's pretty difficult to falafail, if you falalow me.The bottled bottled beer selection is poor - Macro Mix - however the Moscow Mule was made with Goslings ginger beer and was delightful.  Service simply average, but I wasn't expecting the world here.  So three stars, barely.  With some attention to ingredient freshness, a better drink list and some fixing of minor details this could be a fun after work drink and nibbles spot."], ["Lauren B.", "This is an all around great place with great ambience, wonderful service, and delicious food.  It's a neighborhood favorite and we feel at home there. Our favorites include: Damascus hummus, lamb shawarma, fresh baklava, unbelievable pizzas, and a super wine selection!My parents live around the corner and frequent Arabesque ever other week.  We visit from Colorado every summer and we plan our menus around what nights we're having the Turkish fatayer pizza!!!You'll love the welcoming friendly staff!"], ["Linda O.", "Yes! Perfection! This has got to have the best ambience and most contemporary, comfortable, and stylish setting in all of Columbia. The comfy cushions and most adorable chairs were heavenly. The service was impeccable. The prices are extremely reasonable. Food was exquisite and fresh! This place is vegan and vegetarian friendly as well as for those who are health conscience. I had the spinach fatayer (which doesn't have cheese) and is made with FRESH rolled dough daily (the same that is used for the Damascus bread) so it isn't oily or buttery... Absolutely perfect! Then I had the hummus with pine nuts and olive tapenade. Although these were both appetizers I made them my meal. The place was also incredibly clean and I have absolutely zero complaints and nothing but raves (I can't remember the last time I have been able to say that about a restaurant.)"], ["Taylor G.", "This place SUCKS. Ordered eggplant parmesean and lamb schwarma at 6:55 pm. Told over the phone it would be a 35-40 minute wait with zero explanations offered for this longer-than-usual wait time Arrived 50 mins after placing my order (just to give them enough time), and believe it or not, our food STILL wasn't ready. But this pales in comparison to what I'd face next...After receiving our food around 8:00 pm, we were told that our eggplant parm (listed online at $7.95) cost FOURTEEN DOLLARS. Expressing our displeasure in the consistency in the online menu versus reality, the owner then told me that my salad, which COMES FREE AT LUNCH TIME, cost me an additional $3.00 on top of my FOURTEEN DOLLAR eggplant parm. Even after discussing with the owner our obvious displeasure in the way things had gone down, we were offered no discount, and simply told \"Sorry\". This is my first Yelp review, and hopefully my last, but it was well worth it to create an account just to tell the world what a mistake it would be to come here. Oh, and top of that, the \"garden\" salad I paid $3.00 extra for came with only 1)apples, 2)lettuce, and 3)ranch dressing, despite being listed on the menu as containing sunflower seeds, cranberries, and green peppers. And the eggplant parmesean that i paid FOURTEEN DOLLARS for was below average, at best, and simply came with a PILE of unwanted, and unmentioned, spaghetti. NEVER eating here again is an understatement.Taylor"], ["Anna D.", "yeah yeah yeah... i'm ready for another trip!I came with my hubby and two other friends (another Anna from Yelp). I must say I did enjoy their hummus and babaganoush (combo appetizer recommended by the waiter-which by the way is half off all appetizers before 7pm). Both the service and the food was good. It was pretty slow at the restaurant but on a weekday i guess that's expected. For my entree i got the lamb shwarma and it was gooooood. In fact, it was so good i was talking about going there again earlier. What can i say, shwarma warms my heart and my belly. There's one other place in Kansas City that I enjoyed eating their lamb dish but it was not as a convenient drive as Arabesque is. Good thing for me i'm just a few mins of a drive to good food."], ["Faisal S.", "Hands down the best Lebanese cusine in the country. You will forget west coast cuisines. 2 thumbs up!i!"], ["Robert L.", "Fantastic food and a great atmosphere! Great for a date night! Service is excellent! Faris was an excellent server! I just wish that the baklava wasn't sold out.... Oh well, next time, I will definitely be back!"], ["David N.", "This place is amazing and a must stop if you are ever in this city.  The sampler appy, the arabesque salad, and the mixed grill were recommended by Amanda the waitress this evening. Amanda further provided descriptions of the food and was enthusiastic about everything to do with this restaurant. She was spot on! Further had a glass of the house Lebanese wine which complimented the meal. I will definitely return here and I recommend you do too!"], ["Jerel R.", "Exquisite. Arabesque has their new lebanese dinner menu. Food is even more fantastic. Who would have thought in Columbia, SC such delicious and reasonably price food?      Silvana the owner, host, and sometime cook is a gem. Outdoors. Dog friendly. FULL BAR (she's Lebanese Christian). Elegant dining room where you feel you're in the Middle East. Back room for parties. Do catering. Great place to hang as well as eat.  Jerel ps. but don't come if you're in a rush. :)"], ["Juli B.", "Seriously delicious food and always consistent! The hummus is homemade and literally the best I have ever had in my life. My go-to meal is the Damascus Hummus with Lamb and my boyfriend is a huge fan of the Chicken Parm. We order takeout at least once a month but we find ourselves craving it much more often than that. The pizzas are also great along with the schwarma (sp?) and babaganoush! Can't go wrong with anything here!"], ["Keegan C.", "Great food. Great atmosphere and excellent food. The Damascus hummus plate is generous and the Al amir salad with mint is addictive."], ["Mike O.", "Among the best restaurants I've been to in Col'a. Came here with family. We started with appetizer sampler, which was very good. I'm not a huge fan of baba ghanoush, but it was smoky and tasted great to those at the table who liked it. I'm also not a huge fan of grape leaves, but the hummus, falafel and damascus bread were awesome. The salad starters were also excellent. I don't remember the names of any of them because for some reason Arabesque doesn't publish it's menu online. Can someone take a snapshot of the menu and post it on Yelp? I had the salad that was cucumber and tomato based and others had the salad that was parsley based. Both were excellent and healthy.Our entrees were unbelievably good--truly, the best part of visiting this restaurant. I had the veggie dish that had lentils, rice and onions. The other dishes were also excellent (although I can't remember the names because I can't find the menu DARN, but they were:) lamb and rice, steak and rice, and chicken and rice. Everything was phenomenal. Huge portions. Vegetarian friendly, everything. The only aspects of this restaurant that bumped it down a star for me were that they were out of Lebanese beer on a Saturday evening, and that our server was just an odd dude. There is no other way to explain the latter, just someone who is awkward and is trying very hard. I felt for him, though. He didn't mess anything up, he was just odd."], ["Sean S.", "The food has gotten even better lately.  When I'm not in Columbia, I crave this place.  When I am, I eat here like 3 times a week.  You have to try the Arabesque hummus with lamb.  It's hummus topped with lamb and served with a large fluffy Damascus bread.  The mussels are also an excellent appetizer.  Wash it all down with an excellent Ksara wine, a Lebanese favorite, or an Almaza, a Lebanese beer.  Honestly the beer alone is worth visiting for... when I moved to Boston I hunted for a restaurant that served Almaza for weeks.  Also happy hour is from 4 to 7 pm on weekdays, and they do half off all alcohol, as well as most appetizers, making it BY FAR the best deal in Columbia.  Where else can you get any premium beer for 2 dollars?  I can't believe more people don't know about this place.  If there's one restaurant you should try in Columbia, it's this one."], ["Kim W.", "Amazing food, atmosphere and service. We started with the freshly made hummus and added some pine nuts- it was devine on the delicious Damascus bread. Then we had the mixed grill and it did not disappoint; great veggies and meats. I even tried a Lebanese Pilsner Almaza which was pretty darn good. The staff was very attentive and pleasant. We left very happy. We'll be back!!"], ["Tanay N.", "Came here for dinner the other day, we were famished.  The vegetarian appetizer plate hit the spot, everything was great especially the baba ghanouj.  The lamb shawarma pizza is definitely unique and it was pretty good but not amazing.  The chicken kabab was good, the veggies were tasty but the rice was a little disappointing.  Overall, recommended!"], ["Jonis L.", "Great place to eat if you're hungry for Middle Eastern food. The portions are huge and the staff are courteous and attentive. They made my dining experience special. The place is huge and they also have tables outside. They also have a bar but I didn't order any drinks so I can't say anything about that. Two thumbs up to Hasan  and his staff!"], ["Tallulah Jean M.", "I looked this place up and it had really great reviews. We set on our way for a nice lunch. Sadly, when we walked in they informed us that they close at 2pm and re-open for dinner at 4pm. This was a big disappointment. They need to change their times on Yelp if they're gonna do something like that. I'm sure their food is great....but..."], ["Eric S.", "Excellent option for Mediterranean food: Arabesque is a Lebanese restaurant with simple, but culturally appropriate decor and ambience. Our waitress, Lisa, was incredibly attentive. It's hard to not fill up on Damascus bread and salad before the main course, but you must because the main dishes are just as good.  I can't remember whether 50% off pizzas was Tues or Thursdays."], ["Adam B. J.", "Menu seemed very close to when it use to be an Al-amir.  Even called things Al-amir, so I'm assuming it is a part of the same restaurant group?  Very understaffed.  Two servers and one kitchen person (heard the waitress tell another table).  Hummus was dry and not as good as Al-Amir, Med. Tea Room, and others.  The sampler platter was good, and all apps are 1/2 off at happy hour which is a plus.  Wife got the Pizza and she thought it was better at Al-Amir on Main as well as the new one up Main St.  I got the Chicken Schwarma.  It was excellent.  Summer Salad, is the best side salad in town.  Server was in the weeds so service wasn't great.  Couldn't tell us what beers they served, so ended up with two Coors Lights.  Happy hour prices will bring us back."], ["Ted K.", "Best restaurant in the Columbia area. Much better than any Al-Amir. Absolutely delicious. Every aspect of the service was amazing. They have the best hummus here I have ever tasted. Their Turkish coffee is so delicious, and their baklava is the freshest of anywhere I have ever had. The owner personally came out to check on us many times, and even helped serve. I can't recommend this place enough."], ["John S.", "This place was great across the broad.  The food was good and fresh and Thursdays pizzas is half off.  The service was great...even with dealing a 30+ person group in the other room.  Wish they were closer to Harbison."], ["Karen S.", "I'm not much of a Lebonese / Mediterranean cuisine person, so it's hard to compare to some of the other places (food-wise) in the Columbia area, but thought food was food.  I had ordered the Pusha (sp?) Chicken over rice (most of their dinner selections come over rice or pita bread).  Spices on both the chicken and rice made the disk tasteful. Portion sizes were OK.  I could have done without the special sauce and vegetables that came with the dish and maybe more of the main course, as well as a slightly bigger side salad 9which there were a variety of choices to choose from).  I ordered a small portion of their Damascus Bread as an appetizer, and it was HUGE.  Our waitress had told a couple people in the party that were ordering small pizzas that the diameter of the pizza (along with the crust) was the same size of the small portion of the Damascus bread. (Beware - the seeds on the bread kept falling off!)We had somewhat of a large group last night and they were able to seat our group towards the back of the restaurant (right by the kitchen).  Could not tell if there was another room that could also be used if you have big groups dining here.  Our waitress was good on checking in on our group (there was about 15 of us in attendance).  I have to agree with one of the other yelpers, there really is not much of a hostess station to check in when you arrive (you're walking into the bar area) and made it difficult to see who might be able to direct to where my group was."], ["Jolande M.", "Food was wonderful after a rocky start. We were seated for 20 min and still no server. Don't know what was going on but my husband finally went up to the hostess stand to ask if someone could serve us. After that Trent took great care of us. Kudos to the manager for discounting our meal unsolicited. We will definitely be back!"], ["Kristen R.", "Yum! This was our first visit here and we will def be back! The food and service were excellent!"], ["A M.", "Finally I stopped by Arabesque to give it a try. Wow! I was pleasantly surprised. I had lamb kabobs and the mussels. The food arrived promptly. The portions were great. I highly recommend this place to everyone in Columbia. What really sets this place apart are the owners. They made my dining experience even better by their attention to the customers. Other restaurants in Columbia should learn  from Arabesque, what true customer service is about!"], ["Kara W.", "The food is good and fresh but service is always very slow. Not sure if this is because we are always there at lunch or if it is always slow."], ["Khadija E.", "This is an update on my previous review. I have officially stopped going to this restaurant, and I don't miss it. I have discovered Al Amir, particularly their branch called The Epicurean - their menu is almost the same as Arabesque's and their service is so much better. I have also become a fan of Ariana's Greek Restaurant in West Columbia."], ["Emily E.", "The only time I've had good Lebanese food was in CA...until today!  Was pleasantly surprised to find this place really delivers on flavor!  I tried the Al Amir salad to start which was light and crisp with citrus and mint flavors that were spot on.  The main entree I tried was the lamb shawarma with tender perfectly seasoned vegetables and delicious rice.  Also you must try the Damascus hummus and bread.  Simply amazing!"], ["Elizabeth F.", "Okay, first of all, I've worked in restaurants, and I understand it can be difficult to manage four or five tables at one time. That said, though, the service at this place was among the worst I've ever experienced. When we were seated, there was only one other group, and it filled up slowly over the almost two hours that we were there. It took forever to get our food. It was almost impossible to get a refill on water --- and when we did, the water tasted the pitcher had iced tea in it and hadn't been washed. Our salad plated sat on the table forever after we finished with them.  The waiter had zero personality and if anything seemed annoyed that we were there. He was downright crabby about having to split our check, even though he never asked how we were paying at the beginning. The food was good, though, and if the service had been better I would have given this a much, much better rating. The only thing I didn't like was the apple/feta (don't remember the name) salad. It would have been good, but there was way, way too much dressing on it. I'd go back, but only if I knew I was going to get a different server."], ["Eater Of Food S.", "I've had some bad experiences here but lately it's been better. They are trying harder with customer service. I'm still not ready to eat in due to bad experiences but the take out lately has been excellent. Our standard order is pizza, hummus, baba and fetoush salad. Really it's all excellent and delicious."], ["Michael R.", "First, right now I want to give them 1 star. At other times - I want nothing more than to give them 5 stars.The problem here is that they CANNOT seem to get take out food done with any amount of quality. It's the most amazing thing I have ever seen. My girlfriend and I love eating there in person. Food is traditional and made with care. We love ethnic food of all stripes but really enjoy Mediterranean. Add to that, the restaurant is right in the neighborhood. So, if you grab a table and they know you will see the food on your plate - chances are you will love it. If you happen to want to grab some food on the way home. PASS THIS BY. I held off writing this until the 4th time our take out was screwed. 1st was a burnt pizza. 2nd was a screwed up Damascus bread. 3rd was a really messed up salad that remained messed up after opening it to check (after the first two times) and still got it wrong. Fourth was another messed up salad that looked like to may have been dug out of the trash. I was just too tired to remember to look and correct their inevitable mistakes.So, I am conflicted. Amazing experience in-house.  However, I may never go back, period since they don't give a crap enough to take care of their customers that won't catch their errors in time to do anything about it. Be warned. They won't be open long enough if this keeps up anyway and it's a shame/"], ["Jessica K.", "Great place on Devine st! They have excellent brick oven pizzas and their falafel is amazing.  I am a huge fan of falafel and theirs gets my seal of approval. They do serve alcohol which is nice to have.  Wine and pizza always go well together. Only down side is the 4 times we have been there we had to wait almost an hour for our pizzas. We keep going back hoping it will be quicker because we do enjoy the food.  Last time we went if was incredibly warm inside, maybe their air conditioner broke, but if was hard to eat the food.  Overall I do love the place, just might get carryout next time."], ["Tyler L.", "I was really looking forward to eating here. I hadn't had Lebanese/Arab cuisine in a while and really love that type of food. I noticed the good ratings on Yelp and knew it would be great. I must be the exception because my experience was a disappointment and I will not go back on principle. Keep in mind, I love giving good reviews because they are usually shorter. But I have to be honest so people who read this will get a more accurate picture of the experience at Arabesque.I went there with my wife and another married couple that loves Lebanese cuisine. The first thing that went wrong, although small, was that they were out of the only Lebanese beer they carried. It's a Lebanese restaurant, they had Lebanese beer on the menu, but were out of it. This is a very small setback, although a little disappointing. But it turns out, they were out of a lot of beers that were on the menu that they didn't have so they server had to make a hand-written list of available beers, which was appreciated. Second, the server, although very nice, was scatter-brained. She was extremely nice but she kept forgetting things, giving people wrong drinks, leaving lots of plates and empty bottles on the table, and seeming very unsure of what she was doing and saying. She would start to say something, then say \"never mind\".  But again, she was very polite. My food was pretty good, so there is nothing to complain about there. But my friends ordered a pizza and they put ground beef all over it even though it was only supposed to be on half the pizza. I love ground beef, but evidently one of them hated it and did not want it. The server said it might take a while to make another one since they were busy. What she should have said was that they will make another one immediately since we had already been there a long time before it got busy. The manager did come out and say she would take it off the bill, which was very kind of her. And, she offered each one of us a free drink, which seemed awesome at the time. You're probably wondering why in the world I would only give it two stars at this point. I'll get to that. When the bill came, I was charged full price for an appetizer even though it was supposed to be half price due to happy hour. And the thing that got me was that I was billed for something that I didn't even order. On the menu, they have beef kabobs for $13, and beef tenderloin kabobs for $16. I ordered the beef kabobs for $13 but was billed for the beef tenderloin kebabs. I showed the server the appetizer discrepancy and where I was billed for the wrong item. She admitted that the appetizer should be half off and also admitted that she did bill me for the wrong item. She said she rung it in as the beef tenderloin and that is what I did get, but she remembered that I only said beef kebab, not tenderloin. She came back to the table with the amended check and said the manager was willing to take half off the appetizer but would not change the charge for the beef tenderloin even though we all know I did not order it. Had I known it was the beef tenderloin, I would have said something. I was eating it and it tasted no more tender than a sirloin steak, not a tenderloin. The manager personally came out to us when things went wrong at first, making things right. But when it came to wrongly billing me, she hid in the kitchen and let the server come out and deliver the bad news. I am the most forgiving and understanding restaurant patron, but the manager was basically saying that I was lying. The server even told her just to take it out of her tip, which I told her that I was NOT going to do. This was something I could not deal with, although I actually did and paid the dang bill. The free drinks for the screw ups were a nice gesture, but telling me that the bill would not be corrected to accurately depict what I actually ordered crossed the line. The manager just lost a future customer over $3. She told the server that she had already taken enough off the bill. The service was slow, the server kept forgetting things and seemed frazzled the entire time, and food came out incorrectly. All that would have been fine until the manager insisted I pay for something I did not order. That was an unwise move because I will never go back now. And I'll tell everybody I know never to go there. $3 is almost nothing to me. But not changing the bill to what I actually ordered because I ate it unknowingly wasn't cool. The server messed up, the manager was unwilling to make it right. The pizza my friends ordered was mediocre. My food was pretty dang good, not great though. But the manager insinuating I was a liar by not making the bill right and hiding in the back to let the server tell me.....well, that is pathetic and disrespectful. And that is just bad business."], ["Stephanie S.", "Amazing food, fantastic service. They treat you like family. The atmosphere is so comfortable and gorgeous, it's hard to leave. :) I would highly recommend this place and can't wait to eat there again!"], ["Wesley D.", "Big fan. Very authentic. One of the best ethnic cuisines in all of Columbia.The hummus is fantastic. I love the shawarma wrap."], ["Gilbert T.", "Wow this place was great. Tried the lamb shawarma wrap. It's was amazing.  Will def come again. The only reason I giving 3 stars is because the service wasn't that great. I get there before a waiter is about to go home and he didn't want to help me. He was waiting for someone else to get there so he could clock out. Then the waiter that ended up helping me took off to Starbucks while I was eating. I understand it's Sunday and I'm the only one here. But wtf really? He couldn't wait until I was done?"], ["Carl R.", "It didn't take long to try this place again. Another good experience. Servers have been excellent. I was able to try new dishes this time, and was very happy. I recommend the entrees they are known for. Happy hour till 7, half price beers, wine, and apps. Have to try Damascus bread too!"], ["Naomi R.", "Everything about our experience was wonderful! It's like eating at your Middle Eastern Grandmother's house. Well it was for us. Victoria prepared our food for us. We had the grape leaves and falafel for an appetizer. The grape leaves were perfect. Not too vinegary or oily. Falafel was fresh just like you find it in Jerusalem! We had the Damascus bread with lamb. Yummmmm..... The portion sizes were great and were fitting for the prices charged. Forget Al Amir. Arabesque is far above any Al Amir location which is run by the same owner anyhow. We are now Arabesque customers only!"], ["Maggie s.", "Fantastic as always. Beautiful day to sit outside and enjoy the hummus and very authentic swarma. Owners are always delightful and staff is very friendly."], ["Riz S.", "Amazing food with solid service. They're menu has something for everyone. If your a vegetarian they're falafel is crispy and delicious. Looking for ethnic fare? They're Damascus bread/Baba ghanouj/Hummus/grape leaves is filled with rich flavor and seems to be made with quality ingredients, all of which comes in the Arabesque sampler! You may not expect pizza to be a hot item at a Lebanese restaurant but it was amazing. Thin crust, beef pepperoni, chicken, and gyro meat all under a layer of melty mozzarella will make you weep in awe!"], ["Ken H.", "THE EXACT SAME MENU as Al Amir's right down the street EXCEPT everything here is about $5 dollars more expensive! C'mon people!! This place used to be called Al Amirs 6 months ago, they just changed the name and raised all the prices trying to be all schmamcy ...Perhaps in an attempt to dupe all the other retards spending butt loads of money next door at all the boutique stores that pepper Devine st. .. A candle store really!!?? (There is a newer random overpriced candle store nearby) I guess they thought they would  just change the name and raise the prices thinking no one would notice??  How can anyone think this is acceptable!! Spend 30 cents more in gas and go to the same restaurant on Main st. a mile down the road For less! But at this point, really who cares if it saves you money... Do it on principle!!"], ["S H.", "I love the food here, specifically the falafel, veggie curry and hummus with damascus bread. I'm thrilled they are within walking distance to my home. :)That being said, do yourself a huge favor and do NOT go here if you are in any sort of hurry or ravenously hungry. Because you will have an angry, long wait. They have a more European approach to service and while that's great when you've got time to relax at one of their outdoor tables, it's not so great when you are hungry and pressed for time. (They do have one server that works very hard and I've seen him scrambling about trying to cover all of his tables while another server lazily half-skips to her smaller number of tables. It's a weird description, but if you've ever spoken with her, you'd understand what I mean.)This place is very vegan friendly as well, which always gets more respect from me. We love to get it for take-out or we'll often bring our dogs and sit on their patio. They are kind enough to provide water (and one time, treats!) for our babies. This location has changed names numerous times but the food is always the same. I'm not entirely sure what's going on, I just hope they stick around!"], ["Kara B.", "My boyfriend and I dropped into Arabesque so that we could switch it up from our typical wing night. We had THE BEST experience. Not only is the food very authentic and YUMMY, our server was great. By great, I mean she got my email address so that she can email me about the local middle eastern grocery store here in Columbia, made fantastic recommendations and explained how things were made and about the ingredients, etc. This is definitely a great date night spot, but a little on the pricier side. Our meal: Babaganoush, Fatoush Salad, Mussles & Damascus Bread, Lamb Shawarma, Lebanese beer"], ["Laura H.", "I want SO badly to love this restaurant. Growing up in a Lebanese family left me with very high standards for this type of cuisine and let me just say that the food here is not the problem. It is actually the only reason our party did not walk out of the restaurant after a nearly 2.5 hour wait for our meals. The birthday girl ended up taking her entree in a to-go box because it was such an ordeal.  Our appetizers (all dips and spreads) took an hour to make it to our table and  the Damascus bread we were to eat it with took 15 more minutes.  That left us all staring at a bunch of food we weren't able to eat.  Entrees were an hour longer and one of them came out cold. Our waitress was young and inexperienced but apologized profusely as anyone should.  Mind you, we were only one of two tables in the entire restaurant.  I don't expect to ever return to this establishment solely based on the fact that if I wanted to wait 2.5 hours on Lebanese food, I would just drive the distance to Leila's in Charleston and save myself the disappointment."], ["Chuck W.", "I absolutely love this place. The atmosphere is warm and cozy. They have middle eastern music playing softly over the intercom which helps set the mood. The wait staff is VERY friendly. The humus is by far the best I have ever eaten. I had the beef tips over rice. Came with a salad. Everything was seasoned to perfection. I was a little skeptical of Lebanese food, because to be honesty, I was not really sure what it was. So glad I tried it. There was six in our party. We all love it. This is a gem of Columbia!!!"], ["Aaron Z.", "Name change from Al Amir and cultural change. Arabesque has beer, wine and Hookah! This place has way better pizza than Za's and if you are not scared try the rest of the menu, it is delicious."], ["Katie D.", "This is a joke of a restaurant.  Went here for lunch and there was one woman working the entire (busy) place, who doubled as hostess and waitress.  I should have known that the dining experience would be less than up to par when I noticed that the entire front room and bar was in the process of being renovated and had tools laying on the floor and EXPOSED WIRES hanging from the ceiling.The restaurant's single waitress failed to refill our water glasses and take our orders until we had been there 30 minutes.  They still use the menus from when the restaurant was Al-Amir.  The food was incredibly slow to come out, and when I explained that I had to get back to work and had been waiting over an hour the waitress was incredibly rude and gave me attitude and told me I was waiting because my \"falafel was the reason it was taking so long.\" (were they growing the chick peas themselves in the kitchen or something?)The most laughable part of the whole experience was when we ordered a hookah and she brought it out and asked if we had a lighter.  Then she gave us a little flip lighter and told us to hold it on the coal for at least two minutes (a task we couldn't complete without burning our fingers.)  She then gave us attitude and told us we were doing it wrong, though she couldn't light the thing without burning herself either.We were there almost a total of two hours for two glasses of water (refilled once) a glass of tea (nearly undrinkable it was so strong) and a half-baked attempt at hookah (which they didn't charge us for because nobody could light it).  All in all, I wouldn't have been nearly so upset if the waitress hadn't been so incredibly rude to us.  Don't eat here, there are plenty of legitimate businesses that provide quality Mediterranean food in Columbia.  This is not one of them."], ["Jeff P.", "We had such a great family meal here!  Every dish, side dish and salad was superb.  The waitress Shelley was so nice, I imagine she was part of the family that owns the restaurant.  Our kids liked the food as much as the adults, HIGHLY recommend."], ["Valery H.", "Friendly ambiance and newly renovated bar area! The tabouli is exactly the way my mom made it and I ordered the Turkish pizza with mint and feta and spinach- it was delicious! The waitress informed me that the baklava is made in house as well and it tasted that way too- crispy and sweet! I will be back for sure to try the lamb gyro at lunch!"], ["Ravi T.", "The falafel wrap here is legit good.  Have it with their homemade hot sauce.  Both times I have been there the service was attentive, maybe that's because both times I came in after the lunch rush and was the only one there....hrrmm"], ["Jennifer R.", "Went here for lunch with some out of town friends. Had never been before and we were all very happy with our food & experience! We had the hummus and it was delicious! I had the shwarma and it was great. Service was prompt and our waiter was very friendly. Great place-we are glad we found it & will be back!"], ["Jon F.", "Horrible Horrible Service by our waiter.  He was very unenthusiastic to us and almost seemed crabby.  I have been a waiter in restaurants before and I know having a lot of tables at once can be hard at times,  but when we got there there was only one other table eating.  We finally got our order taken and got our salads.  I would recommend asking for the dressing on the side unless you like your salads loaded with dressing.    About 15 min after us being done with our salads our food cam out and our salad plates were still sitting there on the edge of the table.  Enough said about service,  the food was pretty good tasting,  I would go back but ask for a different server if I get the one I had."], ["Kelly D.", "Not sure how food really was because service was so bad I only had a salad... The salad however was drowned in dressing and had mushy pepporcini.  We waited for at least 25 minutes before noticing half of our order sitting on the counter.  Once we noticed, we waited another 5 minutes before saying anything.  When we asked the waitress, she argued with about the amount of time the food had been sitting there and said she was waiting on bread.  However, another table that arrived after us, got bread so not sure what their problem was.  If you want snotty waitresses and really long waits, this is the place to go!!!"], ["Daisy B.", "I am giving this 3 stars because the food was good, but this is NOT the place to go for lunch or you will never get back to work on time.  We were a table of two people and there were only three tables total occupied although a few filled later.   It took almost 45 minutes to receive our food (I had to ask the waitress when we could expect our food as I had to get back to work), and the waitress (the only one) never refilled our drinks.  We watched as people who arrived later than us received some of their food before us.  Our order was not complicated (damascus hummus combo and falafel wrap) so it should never have taken as long as it did.     From reading another review, it seems they had the same experience we did although the waitress was not rude, just not attentive.But I will say the Damascus hummus combo was quite good, better than Al Amir on Main St. across from the University."], ["Melissa W.", "Arabesque is probably my favorite restaurant in Columbia. Order the Damascus bread, Baba Ganoush, or anything else for that matter. I have never ordered anything which I did not thoroughly enjoy! They also make some of the best pizza to be found in town. The wait staff is quite helpful if you are unsure of what to order, and it is a pleasure to be treated so warmly in a restaurant. I am not sure where the commenter Katie D. ate, but I can assure you that I have eaten at Arabesque over a dozen times and never had a bad experience. Yes, there are times when they are busy, but a meal is to be enjoyed, not rushed through at all costs to hurry back to work. I also question why if she were in a such a hurry to get back to work after lunch, she chose to enjoy the narhile (hookah). If you want real Mediterranean food (not the typical cookie cutter/chain food), this is the restaurant you should try."], ["Ashlee F.", "I am a service and I understand the service industry and when I went there to eat today I experienced the WORST SERVICE EVER. For starters, the coke was nasty and the table wasn't wiped down. The server had the worst customer service ever and did not care about his customers. He never asked how we were doing or how the food was and failed to take dirty dishes from the table and refill my drink. I understand waiting tables can be hard and frustrating but this was completely unnecessary. Let's just say we were thoroughly disappointed and will not be returning. So sad to see places with such great food go downhill like this."]], "Grecian Gardens": [["Samantha A.", "My grandmother was in the hospital in Lexington, and we were all hungry and hospital food wasn't going to cut it. I opened my handy yelp app and found Grecian gardens,  and decided to give it a shot. I called ahead, ordered 3 chicken souvlaki sandwiches, 3 side salads, and 3 teas to go. The nice man on the phone said it would be ready within 10 minutes. I got there roughly 10 to 15 minutes later. My food wasn't quite ready, but they have a nice waiting area in the front lobby area. They were pretty busy for 3 o'clock in the afternoon. I waited another 8 minutes or so before my food was ready. It was worth a small wait for quality food. My mom loved her sandwich, as did I. The salads were almost too beautiful to eat. Everything was fresh, homemade, and delightful. I will have to venture that way again soon."], ["Julie S.", "It was great! It was our first time and we were explained the menu items and our server was very patient with us.  She always checked on us and gave us refills when needed.  Traditional Greek food,  can't go wrong.  Also,  when you walk in,  the counter is where you pay,  you must keep walking left to get to the hostess as stand."], ["Ron V.", "I've been looking for a good Greek Restaurant in Columbia since we moved here from Chicago area.  Columbia seems to have nothing comparable to the Greek Restaurants in Chicago (which I really didn't expect it to have), but I was hoping at least they'd have the flaming cheese appetizer that is always served at the Greek Isles, Dianna's, etc in Chicago. Grecian Gardens didn't have it and I've not found it anywhere other than the old Santorini's out in NE Cola, which has been closed now for a couple of years.  Even Santorini's wasn't that good as they served it with a marinara sauce, rather than just flaming it with ouzo and lemon.  But that's another story.Regarding Grecian Gardens, I had been there for lunch with co-workers about 10 years ago and can't even remember what I had, but I thought I'd give it a try on a Friday night.  We were surprised that they had quite a bit of open tables at 7:30PM on a Friday.  We were seated promptly in a booth and a server immediately took our order.  As with a lot of Greek restaurants, they have a very full menu, with a lot to choose from.  The atmosphere is sort of a diner type atmosphere, booths and tables, and gives a certain feel unlike a fancy intimate restaurant.Based on reading other reviews my wife and friend both ordered the baked half chicken with green beans as a side.  I usually don't order Prime Rib but decided to give it a try.  My other neighbor ordered baked Tilapia and shrimp.  The girls won hands down.  The chicken was fabulous.  Very tender and juicy.  I would order this next time.  I ordered my Prime Rib medium to medium rare and it came out well done.  The taste was good but definitely was well done.  I'd order it again, but make sure I asked for it medium rare.  The neighbor liked his Tilapia/Shrimp.  We all agreed that the Chicken was the best meal.  Prices were very reasonable and both the women loved the green beans.  Service was very responsive and the only mistake of the night was that our waiter forgot to put the Tilapia/Shrimp order in with our meal so it came out about 8 minutes after the three of us had been served.  The waiter apologized  and was very nice about it being his mistake.  I would go back here just try the Baked Chicken.  The pizza looked very good so we'd like to try that also.BTW - the bread they served before dinner was some of the freshest bread that I've had at any restaurant in Cola. Excellent.Someone.... please learn how to make Saganaki and put it on the menu.  In Chicago the Greek Isles and other places always have Lamb as a special.  I would always order the nightly special of lamb regardless of what it was...it was always the best.  Wish I could find a similiar place in Cola!"], ["Evelyn E.", "Went to columbia to visit friends decided to try out greek food. So stopped by this restaurant found on sunset blvd.It is really easy to find. The food was ok but i really did like desert baklava. Very friendly staff, we ended up on the wrong side of restaurant that was for to go orders placed our orders and then realized our mistake and told staff we wanted to dine in not to go order. They quickly got a table for us and brought food we already paid for."], ["Teri B.", "We arrived in Columbia tonight very tired and extremely hungry. We love to ask the locals where there favorite local restaurants are, and the desk clerk at the Hampton Inn immediately said \"Grecian Gardens!\" Boy, are we thrilled that she did!From the friendly greeting at the door by Mr. Alex, one of the four brothers who own the restaurant,  to the wonderful service by Donna, the only thing better was the FOOD! From the Grape Leaves stuffed with meat and rice, the Greek salads, the Chicken and Steak Souvlaki,  and oh my word, the homemade bread and pitas!!!Even my husband's sweet tea was perfect. You absolutely cannot go wrong by coming to Grecian Gardens, from the front door to the last bite, you will absolutely be thrilled that you came. Thank you Grecian Gardens! !!"], ["Jessica M.", "Grecian gardens is a great place to eat! They give you free bread at the beginning of the meal and then once you get the meal the serving sizes are huge. Needless to say I totally recommend this place!"], ["Amanda H.", "Recently traveled to Columbia for a baby shower. We wanted Greek food. Based on earlier reviews, I was worried about trying this spot, but am glad we did.It was a great place for family dinner. Wait staff was pleasant and helpful. Kid/noise friendly. I ordered the spanakopita, which came with a salad, side of potatoes, and rice. The spanakopita was delicious, more spinach than phyllo. (Definitely NOT from the freezer section at cosco). Salad was mostly lettuce and feta but was fresh and delicious. Flavorful rice. My husband ordered the souvlaki, basically beef kabobs, and definitely cleared his plate."], ["Jamie H.", "I went here on a whim. I was wanting Italian and was not disappointed. The service was great, the lasagna was cheesy, meaty, and bubbling hot. My husband got a pizza and was happy. In all a good trip. I'd go back."], ["Phillip M.", "Had a great visit....a lot of food and the service was pretty good as well. The pizza was tasty and the steak was on the money."], ["Linda O.", "I agree with many others: there are not many choices or healthful selections for vegetarians. Ex: the eggplant is fried. I did have the Greek lagana pizza and a \"small\" (although there's nothing small about it) salad. I really enjoyed the soft, hand tossed style pizza (not oily at all!) I also liked the simplicity of the salad. Where to check in at is not clear. You have to walk in and head to the left to another podium if you want a seat and NOT go to the counter because that's where people pay.The highlights of the visit was the quick seating even at lunchtime, prompt service, and our server was extremely friendly and attentive as well as some other supportive staff. Good price for the portions as well.Unfortunately I think I had the only 1 thing that kind of fit within my vegetarian and health-conscious diet. So unless they expand their menu offerings I don't think I'll personally return, but I wouldn't mind recommending the restaurant for other people who are looking for good value and fast, friendly service."], ["Adam B. J.", "Nostalgia keeps me coming back to Grecian Gardens.  It was a  staple of my youth, as I grew up right around the corner.  Last night we called in an order for Pizzas and a salad.  They told us 35 minutes  which shocked me, but worse it ended up taking almost an hour.  The owner bought my buddy and me a beer because of the wait.  Pizza is outstanding, but other menu items have gone down hill in the last few years.  Our last visit my spanikopita had no filo dough on the bottom, and like 3 pieces on the top.  My wife's gyro meat was thinner than bacon, and the only gave her 3-4 slices.  When I was young the gyro meat was a large patty.  The dolmades are great.  If my wife is sick, I'm always calling in an order of the chicken lemon soup."], ["Sarah K.", "Grecian Gardens is a favorite of mine. Nothing is bad, but there are about 5 things I absolutely adore on the menu. 1. Roasted chicken. It's half a chicken, so you get white and dark meat. Fall off the bone tender and so juicy and flavorful. It's a lot of food, so I eat half of the chicken and the Greek salad that comes with it at the restaurant, and take the other half of the chicken home along with the vegetables or Greek potatoes. 2. Broiled salmon. So delicious. I get it with the Greek rice and squeeze lemon all over both. 3. Prime rib. I get it medium rare and it's  super tender and one of my favorites when I crave red meat. 4. Cheeseburger. It's a huge, fresh, hand pressed patty and it comes with steak fries and it's cheaper than you would get at a fast food place. If you want a burger, this is a great place to go that you might not immediately think of. 5. Small pizza with gyro meat, feta cheese, pepperoncini, tomato, and onions. The crust is made out of the same dough as the fresh bread they serve with the meals, and there is something else I can't put my finger on, but it's the best pizza in town. I realize none of these foods are super greeky, but I love them so much and Grecian Gardens does them so well. My mom always gets the Spanikopita and my dad always gets the Mousaka. The tyropitakia is my favorite appetizer. Its soft cheeses in flaky dough."], ["Karen L.", "When I'm in town on business, I make an effort to swing by GG's for a small house salad and an order of greek potatoes.  The food is consistently delicious and always very affordable.  The wait staff have been very helpful and the service is fast.  I haven't had a bad experience yet, so will continue to go to Grecian Gardens for their flavorful salad and greek potatoes.Cons: put the salads on a bigger plate!"], ["Megan P.", "I've eaten take out from Grecian gardens several times as it is very convenient to my job. Take out has always been decent, but food loses something in the 20 minutes it takes me to get home. Tonight decided to dine in. My husband and I scoured the menu, and we had a hard time deciding, because everything sounded good. We decided to split the large Greek Lagana pizza (15.99), and a large Greek salad(7.95). The Greek lagana pizza is a white sauce less pizza with mozzarella, feta, peppercini, and tomatoes. Our salad and bread arrived promptly. Note to self, order small salad next time. Our pizza took about 20 minutes to come out, and it was surely worth the wait. It was the best pizza I have had in quite a while. We came home with more than half the salad, and eight pieces of pizza, and we like to eat! Would have easily fed 4 people!"], ["Phil P.", "Good food at a reasonable price. Service is decent. Youngsters mostly, so be patient. Owner is committed to keeping clientele. We've been going here for Sunday lunch for years."], ["Mike J.", "Really good food and nice people.  But left me wishing I was back at some old friends where there mom's and grandma's were cooking authentic.  But for a southern place it's good"], ["Karen S.", "Not 100% how to rate this as I am not much of a Greek food fan, but was here earlier this week for a group event.  My first turn off was when I walked in the restaurant (as this was the first time I have eaten here).  When you walk in - you walk to a counter, which I assumed that served as the waitress stand and check out counter that you pay at when you leave.  As I am approaching the counter, I see one of the female employees more interested in keeping up her appearance than anything. I had then mentioned that I was here with a group and then she directed me to the waitress stand - which then was slightly down from the counter.  The host at stand was slightly more helpful as I told her which group I was with (only thinking that there have been one group here), but not realizing that they have several rooms that are reserved fro group events.  I almost made mistake going into wrong room.  I finally made it to right room for event.  The room itself that we were in was big, but there is a curtain mid room so that at least two parties could be in room at the same time.  We were only group in there, but not sure if it was up to Grecian Garden Staff or our group to split the room in half (even though for our part - it would have been beneficial to have whole room).  I felt with the amount of people we had and amount of space, we were cramped in the tables and was cramped from some of the activities we were doing that night.  It only looked like they were initially letting us order off of a limited menu for the evening, but realized after I ordered someone in our group was ordering off the regular menu --- I wish I knew that was an option - to order off of the regular menu.  Did like the chicken I ordered (as well as the bread that came with the meal), but not much of a Greek Salad person and wish I had another option for the potatoes that came with the meal as I am not much of a Greek Potatoes Person either.   Maybe my feelings would be different if I were to come here with a smaller group for a non-big group event."], ["Charles C.", "Visiting overnight on business my wife and I found this amazing family type spot close by our hotel.   When ever we are away from home we try to patronize local places over the cookie cutter chains.   Boy did we ever make the right choice.   A clean, friendly and non-noisy ( a pet peeve of mine ) very nice experience.  And the food was out of this world.  She had the Chicken  Parmigiana which was great, and I truly found something worth coming back again for, the Shrimp Parmigiana.   Hers was a massive bowl of  noodles ( pasta ) wonderful,sauce and of course chicken and cheese.  Mine was a baked bowl containing the same pasta, sauce and cheese but with 12-18 large shrimp.  I can't rave enough.  Our starters were for her was a hearty hot ( as in stove not spicy ) lentil soup.  While mine was a Greek lemon egg drop soup.   I'd never tried this before anywhere but I assure you I will ask about it every time I eat Greek in the future.    The service was warm and friendly and attentive without being intrusive.   Our food was ready very quickly even though they were fairly busy for a The time of night.  And it should be noted the were holding a wedding reception in a private room separately from the main customers.  And as I stated above, the atmosphere was perfect, and not at all loud.   And importantly the prices were amazing values.I only wish we were going to be in town longer so we could return right away.  Do yourself a favor.  Drive the 5 minutes from the big chain cardboard tasting spots every town has near the malls and treat yourself to a Gem of a place just down a block or so away."], ["Rosemary T.", "Awful options for vegetarians/vegans.The hummus is inedible. It tastes like they added sugar to it (or banana??), and it is very slimy and literally drowning in oil.The grape leaves have beef in them, so forget those.  The salads are a giant box of iceberg lettuce with 2 cherry tomatoes. I just had to throw away 2 (styrofoam-  so I guess it will live on for the next 1,000 years) boxes full of awful food.  Sorry, but, never again."], ["Adam S.", "I am surprised at the poor ratings. This is definitely one of my favorite places in Columbia, if not the favorite.The owner is always friendly. He gifted my son desserts and bread when we visited. Most of the waiters/waitresses are attentive.The food all come with big portions and they taste good, yet inexpensive. My son always wanted the gyro. Beef souvlaki is also good and inexpensive. Both pita bread and Greek potato are flavorful. Besides the regular menu items, they also have daily specials. My favorite is the New York Strip Sunday special, and chicken marsala is also quite good."], ["Omar T.", "Had lunch here for the first time. Apparently I had no idea what I've been missing. The service was prompt, but a bit rushed. We had Gyros and Greek Salads, which were excellent. The prices were reasonable and the atmosphere was conducive to conversation."], ["Jessica G.", "Ugh. Our frozen pizza came out on a cardboard circle AND the toppings we ordered were completely wrong. The entire time we were there we could hear the employees arguing from the kitchen: \"Does this taste freezer burnt to you? Can we serve it?\" It literally caused me pain to pay actual real  money for the garbage we were served."], ["Brian N.", "gyro was like out of a frozen package.  It was fried in a pan, it probably never saw a gyro rotisserie machine. why would I have high expectations of good greek food in south carolina? staff was friendly, and they had good salads and hummus, hence the 2 stars."], ["Stephanie C.", "Yum, yum, yum!  Prices are good for the amount of food you receive.  The tzatziki is fantastic as is the chicken souvlaki meal!  Service was slow after we received our meal and we waited for refills for a long time but it was a great experience!  I enjoyed the leftovers, too!"], ["Mia C.", "There is nothing special about the food or ambience. Dolmas were below average. Main courses were ok. Maybe my benchmark is high because i am comparing it against the authentic food we had in Greece."], ["Bob C.", "I've eaten here for 20+ years and know many others who have as well. Not sure why there's any negative ratings as IMHO this place has the best Greek food around. Try the Greek salad...huge and very good. The Greek Chicken is great as is their fare of non-Greek foods. They can handle large crowds and have private dining rooms for parties. I've tried other Greek restaurants as well as other popular Columbia restaurants and we consistently come back here."], ["Dan O.", "Great food!  The bread would be even better if they bothered to serve it warm.Service was slow although we weren't in a hurry. However they need to replace the nasty plastic \"glasses\" and salad plates.  Once they become worn with chips and scratches they just gross me out-  think about all the germs potentially hiding in all those scratches and crevices.Small improvements could give them 5 stars."], ["Jenny D.", "Great spot.  We were traveling on I-26 and needed a bite for dinner. We had the roast chicken and the gyro, both were yummy. Fast and friendly service.  Owned by real Greek family."], ["Kimela Anne B.", "Great house salad! Awesome ranch."], ["Matthew A.", "\"Greek\" appetizers were from the freezer aisle at Costco. Salad was so-so and the ribeye was a good cut but not cooked so well.... Scallops were broiled from frozen... All in all I can't complain for the $20 I paid. But if I visit the outskirts of Columbia again I think I'll stick to the Waffle House."], ["Horace P.", "I wish I could give this place a better review because they have the BEST anti pasta salad hand down I have ever had. The _small_ house salad is huge serving of fresh lettuce, cherry tomatoes, homemade dressing tons of ham, salami and turkey cold-cuts feta cheese and a great loaf of fresh baked bread. The small salad is more than enough for one even when I'm very hungry and never fails to satisfy. I have eaten here a few of times with the family and I found the other entrees aren't bad for geek food but perhaps because I like the salad so much I wasn't totally pleased with my selection after. The service can be very slow especial on Sundays, because they are very busy... I recommend that you give this place a try , alot of people love this place...."], ["Britteny T.", "The food is decent but what makes the experience bad is 1) the service 2) the fact that the restaurant decor is dated and 3)the front of the house is poorly cleaned. I have been to this restaurant three separate times and each time the staff was more concerned with chatting and flirting with each other and their friends coming in to visit them than taking care of tables. If the main floor is dirty I don't even want to think about the condition of the kitchen. Won't ever be going back"], ["G T.", "Consistently good lunch spot!"], ["ashley w.", "I was SO impressed with this restaurant.  The salads are FANTASTIC!  It's a nice little cozy place (not top notch, but a very nice date place) with decorations to make it feel more ancient.  The service was great--waitstaff and other were very friendly.  Prices were reasonable and the food was out of this world.  I had the roasted chicken and it was soooo tender!  I very highly recommend this place."]], "Ambrosia Greek Treats": [["Amber S.", "We ordered  gyros, she did a excellent job. They were juicy the whole way through. Definitely  going to be a repeat customer. Thank you for taking the time, you took me not only to Pittsburgh Pa. But all the way to Greece. Thanks"]], "Devine Foods": [["Sherry C.", "I really think this is a great place to have lunch.  It's been around now for quite a while.  We came here yesterday and I only got a salad.  However the service is always good, friendly, and quick.  Also the food is always good.  I sure wish they stayed open longer though.  My salad was great, and all the ingredients were fresh.  The other people in my group also liked what they ordered.  No complaints here.  I'll be back soon......"], ["Rick T.", "Man I haven't been here in along time and didn't know what I was missing, wonderful food. The Gyro and Greek potatoes tasted great all for around 10 bucks and some change. A guy name Keith seems to run the show and had are food out to us in no time flat. They will  be glad to deliver food to Craft and Draft next door if you want great food with your beer or wine. So make sure to stop here for lunch or dinner I'm glad we did today it hit the spot!"], ["Jessica D.", "People rave about this food and I love Greek food, so wanted to try it. From the plastic tables and chairs and foam plates, people don't go here for the atmosphere. The food is amazing. I had the spanakopita which was deliciousness in its flaky layers and spinach. No matter how full you are, make sure you get a cookie to go!"], ["Collin S.", "I stopped into Devine Foods for lunch a week ago on the recommendation of Grace at 700 Woodrow right across the street.While Greek food is not one of my favorites, I absolutely enjoyed Grace's recommendation to try the chicken and rice soup and grilled cheese pita.  It was very good, and left me wanting to come back for more.  Unfortunately, when I returned a few days later with a friend and his wife for dinner, they were all sold out of the soup for that day!Good prices and great staff.  I'm still not crazy about Greek, but there are some other really solid options on the menu, especially the specials."], ["John B.", "A friend calls this place the \"Plastic Palace\" because there are no dishes. Everything is served on paper plates and plastic sporks. I can over look it because the food is devine. The spanikopita is the best in town. The Shrimp Athenian is excellent. They make it in white wine and you can tell. The owners are very efficient, but some of the wait staff are a little dinghy. You'll be lucky if your waitress gives you a refill."], ["Rob D.", "I've ordered out at Devine Foods nearly once a week for the last year.  They're super friendly and service is quick as well.  They offer a good selection of Greek cuisine and  also serve up baked goods as well.  They do offer indoor seating and lunch as well, I definitely recommend."], ["Elizabeth P.", "I love having lunch here. I don't care about the plates being styro. The food is excellent, the service is great. I love it!"], ["Rachel O.", "Devine Foods is indeed divine!Boyfriend and I both like Devine Foods but I'm a bigger fan.  I love the roasted chicken dinner. It comes with a side salad and Greek potatoes.  The potatoes are absolutely delicious!  One time we asked for extra potatoes and were told that they were limited to just the one with the meals so they would have enough!  They are incredibly popular and sometimes they run out.  The chicken is great as well.  The skin is well flavored and slightly crispy while the meat is juicy and delicious.  I also think their hummus is the best I've had in Columbia.    Boyfriend usually gets the gyro.  He likes it okay but it's not his favorite in town.  The restaurant is pretty small with limited parking so we usually call in an order to pick up which they are cool with.  Definitely recommend!"], ["Michelle H.", "I've never been a person to write a review that was bad , but today that changed!!! I watched an older Greek man take metal spoon and knock a pan of food out of a young black kids hands and yell for no reason.  The child calmly picked up the mess.  When we went to leave my husband stated that because of his actions in front of our kids we would never be back; the owner said well don't!!!   This owner was the most disrespectful person I have ever seen and the lady ringing us up stated this was a calm day.  Whenever did it become ok to treat anyone like this especially a child working so very hard?   Never again will I attend this place.  And to be fair I have been here for lunch many times and the guy who runs lunch is amazing!!! So sad one bad owner/apple can ruin a place."], ["Tyler P.", "I was appalled today to watch the owner of this restaurant ABUSE one of his employees.  Worse, when confronted about the outrageous behavior, the owner said \"I can treat my employees any way I want\"!  Well, that may be true, but I can spend my money elsewhere.  And I will.  And I hope everyone else will too!"], ["Dave M.", "My favorite Greek place in Columbia. Daily specials are good, but the standard beef wrap on pita is legit. Very casual but a little overpriced."], ["Pete S.", "Best Greek restaurant in town! Angelo and Georgia have been in the same location 23 years. The specials and homemade deserts are always great,"], ["Katie R.", "As opposed to the other reviews, I'm definitely a fan of Devine Foods. It's a locals-only place and it's followers have been going there for years. I LOVE their soups and the pistachio baklava is definitely worth ordering. It's not trying to be a fancy restaurant, so take it for what it is."], ["Sam S.", "I guess this place is pretty popular, but I do not get it at all. I found the food to be gross. I got the Beef Wrap Pita and the beef was way overcooked and, thus, dry, tough, chewy, and flavorless. The taziki was not memorable and none of the vegetables were fresh or flavorful. My wife got the Chicken Pita and it wasn't much better. Her chicken was also overcooked and dry. The service was nice enough and I didn't get sick or anything, but it was one of the least appetizing meals I've had at a restaurant in some time. If this is what is considered good food in Columbia, I am not going to enjoy eating out here."], ["Roy W.", "Thought the food was good. Went with a group that wasn't a fan of Greek food. Menu was diverse enough so everyone was satisfied. Service was great. Desserts were really good."]], "Elie's Authentic Lebanese Cuisine": [["Melissa P.", "The food here is amazing!! We started our meal with the appetizer sampler which had hummus, grape leaves, falafel and baba ghanouj, The tea was delicious...it has mint in it and it is not only refreshing but so good smile emoticon For our meals, we ordered three entrees, shwarma, baked kibbeh and Nansi's shepherd's pie. I cannot even tell you which of the dishes was my favorite!! They were all so flavorful and delicious. Each of the dishes came with a small salad as well. I loved the fried pita chips that were in the salad as well. And to finish our meal, we had baklava. I cannot tell you how absolutely amazing the food was. We loved our dinners so much we ordered lunch for the next day to take home with us smile emoticonAnd I cannot say enough amazing things about Nansi, who was not only the cook and our server but also our entertainment. She has such a great sense of humor and was so much fun to talk to. I cannot wait to go back again."], ["Maureen P.", "Great food and service. Even though the location is a bit out of the way, the place was packed by lunchtime--always a good sign. I had the eggplant pita, which was just divine, topped with the best feta I've ever had. My sister tried the lemonade with orange blossom honey and mint, and it was fantastic! I definitely recommend it. We also ordered dessert, a sort of cheesecake with orange blossom honey and some cashew/pistachio baklava. As of September 2015, they don't have their credit/debit system up, so make sure you bring cash or check. And bring a good appetite, because you'll want to eat as much of this fantastic food as possible!"], ["Jane Y.", "Absolutely love this place. The owner is very personable and the food is fantastic! I usually get the chicken and have never been disappointed. Salad fresh, rice is always perfect and the sauce is just right. It is a small place so you might have to wait but they will get you in as quickly as they can. Can't wait for them to open up the back for more seating. It's small but one of my most favorite places to go."], ["Jennifer B.", "OMG!!!!! If I could give ten stars I would!  I am not very fond of restaurants in Columbia but this is hands down the best restaurant in Columbia!  The food is fresh and authentic!  I had the Schwarma which was absolutely delicious and my husband had the combination plate.  Nancy is an added bonus to this gem of a restaurant.  She makes you feel like you are eating in her home instead of a restaurant.  I highly recommend Elie's YOU WILL NOT BE DISAPPOINTED!!!  Thanks Nancy looking forward to coming back soon!"], ["Rick T.", "Tried several new dishes yesterday that had a lot of flavors going on the dishes. Swarma is the best dish I have had so far at 9.50 on the lunch menu which comes w basmati rice and salad. The owners daughter is a trip and really puts her heart into her father business and will gladly explain the dishes and how they come. She gladly gave me more rice instead of salad and got my friend with me who's wife is Lebanese to order a lot of homemade deserts to go. This is my third or fourth time here and I plan on returning if this food keeps on satisfying my hunger pains and taste buds."], ["Glenn M.", "Fantasti!  Fresh ingredients.  Fast service.  Nancy is amazing.  My new go to place!  A gem in Columbia!"], ["Natalie W.", "Really good Lebaneses food. I had the shwarma wrap with beef and lamb. Perfectly marinated and spiced with Lebanese pickles, turnips, tomatoes and onions with tahini sauce. yum!  Mint iced tea and a feisty, fun owner. I would recommend this place and revisit when in the area."], ["Lynn F.", "This is one of the strangest restaurant experiences I've had in a very long time. We were traveling with friends and the four of us needed to get lunch in Columbia. I chose the spot. When we arrived, we were surprised to find it's an old house with peeling paint and very little to denote that it's a restaurant. The sign looked unfinished, as did the interior, so I figured it must be a new restaurant and they hadn't worked out all the kinks yet. Wrong.The food was nothing special at all. I don't even remember what we had. Maybe the meatballs? There was a lamb dish involved but it was forgettable. The interior still looks like someone's home with small rooms and a residential bathroom. We asked if they were new, and were told they've been open over ten years. I guess others like it better than we did."], ["Shawn E.", "Food is good. Service is good. My only complaint is that you don't get much meat (I ordered the shawarma and lamb combo) but I suppose that means what I did get was good enough that I wanted more."], ["Mona D.", "Awesome food and great service!Be sure to ask for seating on their back patio! Nanci have us great service and great suggestions for food and wine to try. Both were excellent. We decided on the mixed appetizer which gave us the chance to try a lot of different things.  Everything was great so I'll be back."], ["Diana M.", "The food was delicious!  And the service was truly remarkable.  I felt in love with the lemonade they have.  Has rose water (which i love) and it is a very delicious drink.  I cant wait to continue coming here! I love this place!"], ["David B.", "Great food!  I love the shish taouk (chicken kabob).  The staff is very friendly and provide great service."], ["Emily E.", "After hearing great things I was excited to try this place but I ended up being disappointed.  The salad was sadly the best part.  For the entree I got the shawarma which was bland and hard to finish.  The bread seemed like very thin cheap pita bread you could buy at the store.  This might be acceptable if the entrees weren't so expensive!  Between $15-20!  For that money I enjoyed the food at arabesque much more.  The service was friendly but could not make up for the lack of flavor."], ["Zack W.", "OMG best medeterranean food I have ever had! Amazing service! Try the lamb chops and Sharma! The Turkish coffee with the pastry desert is beyond description"], ["Courtney S.", "We come here so often the owner's know us! By far the best Mediterranean food in Columbia! I always get the lamb skewers, but if this is you're first time and you're feeling adventurous, try the Tour of Lebanon. Everything is delicious, and the price is worth it because you're supporting a mom and pop restaurant!"], ["Nichole M.", "While visiting my mother-in-law who lives in Camden, my family and I were looking for something different. After checking out the reviews Hubby and I decided to give this place a try. With two kids (12 and 5) and a picky mother, Hubby and I found this place to beq hidden gem. We had the Tour de Lebanon which allowed us to sample some of the popular things on the menu. The favorites at the table were the Flafel balls, rice, ground sirlon, flat bread, and the hummus. Nancy (the owner's daughter) was amazing! She took great care of our table and the kids loved how hospitable she was considering the service was a bit slow (apparently two servers had called out). In the end all of us left very satisfied. Being from Atlanta, we'll miss the mom & pop vibe of this place.Mother said it was good but she wasn't a huge fan (mind you she's a tough critic to please). The kids fell in love with Nancy and her dessert while Hubby and I could definitely see us coming again...can you say date night?  So overall if you're in the Columbia area, tired of eating at chain restaurants and down to try something different, say off the beaten path...don't hesitate to give this spot a try."], ["Scor P.", "My wife told me I was taking her out to dinner and that it was going to be something different... but she didn't tell me what she wanted. I looked around on Yelp and found Elie's. We got there in the evening and had no wait for a table.My wife got the schwarma... and I had the shish taouk. Both were delicious. It was very similar to the food I've had over in Kuwait and Qatar. Minus the desert, it was just like being over there... but the English is much better.We met Nancy when she came out of the kitchen. She's proud of her restaurant and rightfully so. The food is delicious. My wife and I will be back again."], ["Karen S.", "This is about a week in the coming to write this review.  A (big) group of us went here to eat last week and the place was good.  First positive was that when my friend originally made the reservation, she made it for a Tuesday, thinking the restaurant was going to be open.  Hours had changed since then and Elie's was going to be closed on Tuesday, but they opened the restaurant just for our group.  Staff was friendly.  There was 20+ people in our party and food came out fast!"], ["Jason B.", "Great food.  They take great pride in their craft.  Get the Veggie Mezza if you are new to Lebanese.  Amazing flavors and as filling as a steak dinner.  Did I mention that the flavors will ruin you for ordinary American fare?"], ["Hollie T.", "This is the restaurant you visit if you want excellent lebanese food... but also if you want some of the BEST food in Columbia.  Their falafel is amazing.  Warning: If you eat their food you'll be spoiled for all other middle eastern restaurants.  I've been going there since a friend took me in 2005 and the dishes are still among my favorites.  Try their Tour of Lebanon or the Mixed Mezze if you want to try a little of many different types of food.  You must have the kebbeh!  Do not leave until you've tried it.  The shrimp is also quite good due to the way Elie seasons it.The mint tea if refreshing, but if you want some alcohol, Chateau Kefraya is sublime.For dessert, have the pistachio baklava and some Turkish coffee."], ["Kimi B.", "A friend recommended this restaurant to me about 6 months ago and WHY, WHY, WHY did I wait so long to follow her advice?!?!? Tucked away in an unsuspecting house, Elie's is one of Columbia's true gems. This statement says a lot since I'm a total food snob. The only hard core thing I have to back this up is that I did get my baking and pastry degree from the Culinary Institute of America in Hyde Park, NY, but I have lots and lots of eating experience. Anyhow, I went for lunch and had Friday's special. . .some sort of rice w/ lentils and caramelized onions. I got two falafel's on top and was truly in heaven. My friend got the same, but w/ a lamb kabob on top and she was also in heaven. My other friend got the rack of lamb and refused to share any with us. He was paying for the meal, so we let him off the hook. The friend that recommended Elie's to me said her favorite is the falafel and the baked Kibbeh and said the Wednesday special is also phenomenal. They were out of the shepherd's pie b/c the daughter of the father/daughter restaurant duo extraordinaire (Nansi) only makes it on Tuesday and says that it often runs out by Thursday, but it is supposed to be the best in SC so if you want it, go early in the week.Now, on to my area of expertise. . .pastries. We got two. The cream cheese tart was good, but the Lebanese version of the traditional Greek baklava was TO DIE FOR. Run, run, run right now and get this. I got two to go. . .one for my sister and one for me. My sister did not get hers. It is much less sweet and has a variety of nuts instead of just walnuts in it and I just can't sing enough praise for this pastry.Go. To. Elie's. Now."], ["Who W.", "The place is kind of out there, but inside it has some character. An old house converted to Lebanese restaurant. This is the kind of place I want to like, one of the few 'not a chain' places to eat in the wasteland of strip malls that is Irmo/St. Andrews. The food, however, only got to the level of ok. Humus was a bit running, falafel seemed dense and 'not that great', lamb had a quite strong flavor to it. Nothing was bad, but nothing was great either."], ["Farha K.", "While out and about in Columbia, SC I did a quick search for middle eastern food and stumbled upon Elie's on my yelp app... figured why not! The decor seemed a little dark and dated but there were quite a few patrons scattered about deep in conversation..which to me is usually a good sign. if people like to come to a place for good conversation, the food is usually good enough to make you wanna stick around. We ordered the hummus with steak bits on top, chicken kabob roll and steak roll. The hummus was actually pretty darn fantastic.. and I'm not particularly fond of hummus. The steak was cooked tender, the juices allowed to pour over the hummus on top and garnished with just a few sprinkles of fresh mint and parsley. Served with toasted wedges of pita it was a perfect start to the meal. The sandwiches however left a gap in the menu. My pita bread had already fallen apart by the time my sandwich came to the table and the steak kabobs inside had spilled out, there was way too much yogurt sauce on the kababs that it overpowered any flavor the meat may have had. Although the vegetables were fresh, they were cut and place haphazardly in the sandwich where i ended up having to eat the kababs and veggies like I would a steak salad. the bread lay in a soupy mess at the bottom of the plate. The chicken kababs were actually cooked pretty well, they were tender and juicy but again ..too much sauce and the bread was soaked through. All in all for the price tag it was a pretty decent find but they could try changing up things just a little."], ["Lyndsay K.", "Was working in Columbia today and upon consulting my handy yelp app I saw Elie's and knew immediately where I'd be eating once I finished work.Service at lunch was spectacular. Nothing I love more than someone talking about the food so passionately that I can taste it. When she came back to take my order all I could say was \"I want to just move in here and eat everything.\" I wasn't lying. I ordered the Mezza Sampler - was by far the best Lebanese food I've ever had in my life...and I've had a lot. The falafel was AMAZING. Kibbeh and tabbouleh equally great.The only downside is that living in Atlanta makes this an inconvenient location for me.  Can't ya'll open up a restaurant closer to me?!"], ["Johnathon H.", "I had a great experience here.  This place had an incredibly nice staff and way to much food for me to finish eating.  I'm not a huge fan of Lebanese food but I took someone for their birthday.  The Fried Hummus Appetizer should literally be a meal in itself.  Its really good and its a ton of food.  Also got a cake for the birthday girl and it was amazing as well.  They don't make it but they have a deal with a cake shop and it honestly pays off.  I intend to go back for the Hookah at some point myself.  Try it out, its worth it."], ["Hana M.", "Too soon to give it five stars ~ but looks like a very promising middle eastern restaurant with daily lunch specials. The atmosphere is nice and sunny, it's in a house and very open with a large patio to eat on. There is a long list of fresh lebanese drinks so skip the soda! I had a very unusually tasty mint/rose/lime/orange (something else I'm forgetting) lemonade. I had vegetarian meze plate and my favorite part was the falafels they were well seasoned  and well beyond the typical bland friend chick pea. I also liked their hummus a lot (I prefered it to the babaganoush) it was seasoned so tastfully (I got a stong taste of tahini, cumin ?, and sumac)  ~ again well beyond what hummus usually is (bland mashed chick peas)."], ["Swetha G.", "Don't walk, jog, or run to this place, jump in your car and step on the gas. Seriously! I don't know where to start with Elie's, you will be so excited after you have a meal there, before you even leave, you will already be planning your second trip, it IS THAAAAT good! First off, SUPER accommodating. Our group was close to 25 and they basically reserved about 70% of their space for us! Not only that, they even split checks! We had two servers regularly checking in on us and keeping up with our fast and crazy pace. Almost everyone in our party ordered an appetizer (some even two!), a drink, an entree, and dessert. Some people were getting multiple drinks. I don't know how they did it, but they didn't miss a beat, it was impressive! The atmosphere is simple and small. The whole place is pretty tiny with not a lot of decor, but after eating their food, you can tell where the real investment in Elie's is. So on to the most important part - the food! Oh my gosh, there are just too few places in Columbia that give you that kick and that feeling of consistent foodgasms, but Elie's will leave you MORE than satisfied but wanting more at the same time, if that's possible. On just my side of the table, amongst 5 very hungry people, we probably sampled close to 40% of the menu in just our first setting. Everything, I mean, EVERYTHING, was insanely delicious! We couldn't stop throwing food in our mouth, like vultures, like crazy people who hadn't eaten in years, we were on a food gorging marathon, it was absolutely ridiculous. I loved all the appetizers I tried, but the spinach and feta pie was a home-run. I ordered the eggplant pita for my entree, and it was soo excellently seasoned and cooked, though at that point, I had inhaled four different appetizers and was completely stuffed, I couldn't control myself and still finished my meal! We were on a roll and went ahead and got all three desserts on the menu and were lucky enough to sample their Lebanese baklava (it IS better than Greek baklava imo!), their strawberry cake (YUM, YUM!), and even their dark chocolate cake (oooh lala!). I wish I had found out the name of the cook, because that man or woman back there, really knew what they were doing, everything was sooo freakin absolutely amazing. I will absolutely without a doubt go back. Oh and people in our group who had never had Lebanese or Middle Eastern food and came out loved everything they ordered as well. The food pleased everyone!"], ["Eva F.", "Excellent food!"], ["M D.", "There needs to be another star added to this.  This place is Columbia's hidden treasure.  The food is so fresh and so flavorful!  Dont even get me started on the deserts...  They are beyond amazing!  A fair warning about the coffee though... you wont sleep for a week once you drink it.Service is superb and the quality of the food is the best.  I have spent 5 times as much on some restaurants in Columbia, but only for a quarter of the amount of satisfaction I get from here."], ["Brandon F.", "Authentic food great lunch prices and portion sizes. Always a good favorite dish is the Shish Taouk! Try it!!!"], ["Rebekah P.", "Delicious creative fare with excellent service. Heads and Tails above the apathetic renderings of Al-amir and the Mediterranean Cafe. I actually like the aforementioned restaurants but Elie's puts them in the shade. I wish the location was more in the mainstream so it would get more recognition. If you like food that is adventurousand not afraid to be bold, give Elie's a chance. With a preponderance of Greek restaurants is the area, this place outshines them all in their Mediterranean cuisine. I suggest they they give restaurant.com or groupon a chance to spread the word."]], "Bellis House of Pizza": [["Mrs. C.", "I could seriously eat their Greek salad with grilled chicken and house dressing daily. It's that delicious and huge!!! Also, try their baklava cheesecake. Holy. Crap!!! So, so good!!! The owners and staff are incredibly nice and are great at their jobs. Go here and eat!"], ["John G.", "I've beenhere a few times now and have always experienced good food with fast and friendly service.I definitely recommend."], ["Clay L.", "This was a pleasant surprise while visiting some friends in Columbia. Bellis has a good mix of items on their menu, from burgers and gyros to moussaka and pizza Bellis has a variety of food to offer.I went off on a limb and decided to try their greek burger. This ended up being a fantastic option with a great sized burger that had feta/bacon/lettuce/tomato/and some of their greek dressing on it.The burger had a fantastic mix of flavors, the meat was juicy and the dressing gave it some good acidity and tang. The only downside to the meal was the fries, they were ok, nothing special just frozen steak fries.Everyone at the table left happy, if were in the area again I could see us going back."], ["Amy Lauren S.", "Last weekend, my husband and I were in Lexington with some friends and we went out to Belli's House of Pizza for dinner. Our friends went there for pizza earlier in the week and liked it, and they had the right idea. Belli's is a local joint and seems to be family-owned, mom and pop, and the food was delicious. Like the name says, it's pizza restaurant, but they also serve Greek food like sandwiches, salads, calzones, and traditional Greek dishes like moussaka, souvlaki, gyros, and spanokopita. If you're not in the mood for pizza, you should still check it out because they offer a LOT of menu options. I had the spanokopita entree, which came with garlic bread and a house salad. The house salads are simple, they don't come with feta (but you can order it- we did), but the dressing is delicious. I like how it came on the side, and all of us agreed it was some of the best Greek dressing we've had. The salads were pretty large and came out quickly. The garlic bread was also buttery, hot, and tasty. The spanokopita I had was some of the best I have tried. The phylo dough was light and fluffy, and it was full of spinach. I could not finish my spanokopita but it was still good reheated the next day. It was a huge piece portion for only $10.95. Belli's is a great place for authentic Greek food- or many other foods- on a budget. The restaurant is not super fancy on the outside or inside, but it is one of those hidden gems beside a Publix in a shopping center. We would definitely return the next time we're in the area."], ["Emily E.", "Meh.  Greek salad was just OK.  Dressing needed more flavor.  Kept adding more to no avail.  Got the Tuscan pizza and it was good but prices here and atmosphere won't entice me to return."], ["Russel G.", "Delisous calamari and the calzone we had was amazing. Friendly staff. Definitely will go back"], ["Keegan C.", "This is a freat go to for greek pizza. Very friendly family owned. I usually opt for the Greek salad and a Pepperoni Pizza, excellent crust. I have also tried some of the pasta dishes all of which were delicious"], ["Ms. P Y.", "This place is awesome great customer service the menu is exceptional, so many item to choose from wonderful atmosphere, will definitely be back the people are very friendly"], ["Lillian C.", "Portions are ample, service is fantastic (local mom and pop joint.) Free Captain's Wafers at the table. Calamari is great (and quite affordable) and pizza looks pretty decent, but I'd steer clear of the Greek though. The kebab tasted a bit freezer burned and the chicken was something that could have been executed in a college dorm room (used to make something remarkably similar as an undergrad using herbs de provence and the chicken tenderloins). Pita is the standard food service style flatbreads you get a gyro joint. I cried a little on the inside that two mediocre greek entrees and a calamari basket came out to 37 dollars. Next time, I'll do as the locals and order pizza."], ["Jennifer B.", "Its ok....not a fan of the goo on a cracker...at least bring a plate. Pizza was solid but better is down the road."], ["Celeste P.", "We had the Greek pizza and it was very tasty and mouthwatering.  Highly recommend this restaurant. They make a salad dressing that is outstanding."], ["Kelley H.", "So much more than pizza!!! Great authentic Greek & Italian dinners. Wine & beer as well. Very needed here in Lexington."], ["Ralph S.", "Excellent!! We stayed at the Holiday Inn Express on our way to VA. We reviewed Yelp for local restaurants and found Bellis.  It was close and it had gotten good reviews. My wife, Susan, was craving Greek cuisine so we ordered take out.     I wish they had told us about their specials on the phone.  When I walked in I read they were featuring potato soup and liver and onions.  I would have ordered the liver and onions special but we had already placed our order. I did, however, get the soup to go, Lamb Gyro, and souvlaki. All terrific.    We wanted to eat in the room after a five hour trip.    The staff was very friendly and attentive.  I, of course, tipped the young waitress very well  who bagged our food and made certain it was correct. I was very happy."], ["Greg P.", "Great food with exceptional service. I had the Lasagna. My wife had the souvlaki. We were both very pleased and will certainly return when we get the chance."], ["Rocky R.", "There is nothing bad on the menu.  You can't go wrong with the house special or buffalo chicken pizza.  The super sub with house dressing hits the spot no matter if it's for lunch or dinner.Make sure to try the house dressing on some crackers located on every table.  It's addicting.  This is the favorite Greek restaurant my wife and I go to and go there at least once a week."], ["Wardlaw F.", "Some of the best food in the area. This place is much bigger than it looks, has a really friendly and direct staff as well as a feeling of family. Will be a constant place for us"], ["Joel W.", "Dinner: gyro sandwich, potatoes and salad. Food was good, not mind-blowing, but good. Service was fine, restaurant is nice inside, very comfy. Good crowd. I would go back."], ["Rebekah P.", "Great little place at the old Parthenon location.  This has a very small store front, so that you are very surprised at how large it really is when you walk in the door. So far, we have only eaten there once, but we will definitely be back. typical Italian and Greek mash up with salads, subs and burgers added for good measure.  We have not had their pizza yet, but going by the steady stream of customers coming in to pick up their take-out orders, it must be pretty darn good! Casual but not divey.  We felt right at home. Can't wait to try some more dishes on their menu, and of course, the pizza."], ["Brandy W.", "Bellis is now my favorite local pizza.  It may be the best in the Columbia area, but I can't say that for sure.  We ordered a salad with Greek dressing and the Tuscan pizza with red pizza sauce instead of the olive oil base.  I have been a Ray's fan for a long time, but this even tops Ray's!  Their salads are MUCH better than Ray's and they have more interesting pizza choices/toppings.  The crispy light crust was so wonderful and dipped int eh Greek dressing I was in heaven.  I ate everyone else's crusts!  I can't believe this undiscovered jewel has been sitting in the where many other dinky takeout places once were!  The prices were a little better too."]]}