{"2 Gingers": [["Rae H.", "I love Indian food. In fact, I love Indian food so much that one day I want to go to India and just gorge. I watch Indian movies and pay tension to what they're eating. Did I mention I love Indian food? I have been wanting to try out 2 gingers for a while. I was on that side of town, and so decided to treat myself there for lunch. I mean, it might be a little weird eat alone but I wanted to. The buffet is pretty decent, and had a variety of dishes that are not regular standards on most Indian restaurant buffets, which I appreciated. I particularly enjoyed the vegetable biryani.  While 2 gingers won't be my favorite restaurant in town, I will definitely pass that way again, and if you're around and craving Indian it's definitely a good place to try."], ["Linda O.", "They have such a cute name and logo which looked sharp on the crisp white plates and bowls. I was greeted and seated immediately. Service was attentive the entire time. I had no idea what to expect when I ordered the rava dosa but was pleasantly surprised it was nothing like I envisioned. It does have some heat to it but the accompaniments helped mellow it out. The flavors worked together beautifully in this unique dish. They presented several vegan options and offered to prepare items without butter if needed. So they were very accommodating.Everything looked clean and I liked the linen napkins. The only two suggestions I have for improvement is that I would've liked to have seen glassware (instead of plastic) and the booth cushion had a tear in it. Regardless, I would like to go again and try some other things."], ["Katy L.", "I went to 2 Gingers for the first time the other night on the recommendation of a friend who lives down the street. It did not disappoint! I got the chicken makhani (also called butter chicken) and it was delicious! My boyfriend got the chicken rogan josh and it was good as well. We are excited to go back and try more dishes!Only had a couple of minor complaints: the service is a little slow, our finished plates sat in front of us for about 15 mins before they were cleared, our check wasn't brought until about 10 more minutes later. We also had to flag a waiter down to bring us more water, and even so, he only brought enough for one person so we had to split it. This would not have irritated me as much of the food hadn't been so spicy! Everyone at our table ordered \"mild\" and we were all sweating. Idk if they just have the spice ratings for funsies or what but it was hot, and we all eat spicy food quite often. Don't get me wrong, it was delicious, but if you're wimpy about spice be careful!Overall, I would recommend it. Delicious food for a reasonable price, friendly (albeit slow) service, and good size portions."], ["Ellen A.", "2 Gingers had a rough transition from Bombay and it took a few months to get the kinks worked out, but judging by our latest meal, they are spot on again. Their dosas have always been excellent, but now they have a special dosa night every week (Thursday), too!"], ["Adam B. J.", "My wife and I dined at 2 Gingers during lunch on Friday.  I will update this review when we go back for a dinner, but my wife wanted to see how the buffet was to see if it was worth coming back to eat at night.  I thought so!  My favorite item on the buffet was the mushroom/pea dish.  It was unique and delicious.  The korma chicken and chicken tikka masala were both not bad.  The fish dish on the buffet was good.  Naan not bad.  Wish they had samosas on the buffet.  Like I said, this was A-OK.  Can't wait to come back and order some vindaloo, saag paneer, chicken makhani, and a nice large Taj.  The Yelp coupon for checking in was a great BONUS!!!"], ["Marcus R.", "I really like this restaurant. Friendly service and good Indian food. Love the chicken masala."], ["Epicurean K.", "Great food and great service. you can see the staff and management do their best and I appreciate it."], ["Samantha R.", "Just moved to the area and always on the hunt for good Indian food. 2 gingers did not disappoint! Their lunch buffet had a good variety of vegetarian and meat options as well as sauces and dessert. Everything tasted really fresh and dishes were replenished quickly. Service was prompt and the price was reasonable. I do wish they had slightly more variety (which would bump them up to 5 stars in my opinion) but I'm leaving a really happy, and full, customer!"], ["Anh P.", "I had a delicious vegetarian meal here. Started with their tasty samosas that had a bit of heat to them. Then we had saag with potatoes (also tasty) and their 2 Gingers Special Kofka (tomato based creamy sauce was yummy). I love carbs so I also got a rice dish, Peas Pulov, and it was very good. My little girl loved the naan.If you're a vegetarian and you love Indian food this is the place to be."], ["Kristen B.", "Really good food!!! The food was aromatic and very flavorful! Will definitely come back and try the buffet!!!"], ["TruIndian W.", "Nothing but TOTALLY AWESOME! If you know Indian food then 2 Gingers is the place to go. Being  world travelers my husband and I definitely have taste buds! When we were desperately seeking good authentic Indian cuisine  we came across 2 Gingers, this is the best in Columbia. Dont waste time or money anywhere else. Good food and reasonably priced!"], ["Ramon S.", "We frequently go to Delhi Palace so we were excited to try a different Indian restaurant. This place used to be called Bombay but recently changed their name to 2 Ginger. Other than minor decor changes, the place looks the same. Their buffet is until 2:30 pm and a great way to sample various dishes. We were disappointed with their selection. There was only three chicken dishes and the rest were vegetable. I was hoping for lamb, goat or something different. After talking to the waitress, Wednesday and Saturday have different meat options. There was only one desert option, rice pudding, and the rice was undercooked and slightly hard. They were confused about honoring the 10% deal from Yelp. Overall the food was ok at best. I'll stick with Delhi Palace for now."], ["Daniel G.", "If this does not say enough...... I ate here for lunch and the buffet was spectacular and so resonable priced. I have been to the west indies and tasted authentic and this is it. So good I came back and brought my family for dinner. Their menu at dinner is even better so fresh and such a pleasant experience. Everyone should try"], ["Anthony A.", "When they bought this restaurant the food was great... for a week. I've been coming here once a week for 3 years and havent had a problem. The last 3 times the food was cold (yes, cold chicken). Even when they brought a fresh tray, still cold. The waiter trash talks Amercia all the time. Their popular buffet items are always empty.  Long time customer who will never be coming back."], ["Himansu P.", "Worst Indian vegetarian food so far I had, please do not expect like it used to be in test like Bombay Grill Save your self, find some place else"], ["Justin M.", "First, WTF is \"2 Gingers\"? That is a good name for a couple of Carrot Top tribute comics, but a restaurant...not so much. Second, this place used to be so much better when it was Bombay Grill. In the Bombay Grill days, the food was more authentic and tasty. Now, it's Indian food for people who are not sure they should be eating Indian food (i.e., bland)."], ["Tom C.", "Had the lunch buffet for $7.99. I have had dinner here twice and everything has been outstanding! We're definitely going to be back. The staff is very nice. If you're in the area and like Indian cuisine, you must give it a try."], ["Lionel D.", "I was a frequent diner and always enjoyed the food and great presentation.  VERY surprised recently when I saw the name change from Bombay Grill to 2 gingers. Seems like a change of management,  presentation terrible.  Food has lost its taste,  the goat Biryani had almost no goat pieces in it,  those that could be hunted down were minuscule in size.  Waiter took forever to show you at our table with water.  Given that the place serves Indian food and being of Indian origin,  I can tell of the sharp decline in standards with the new management.  Don't waste your time and money with this place."], ["Kelly D.", "The service was attentive without hovering. Ask your server to make suggestions as he will recommend dishes that may be outside of your usual favorites. The rice and naan were fluffy but not sticky while the sauces were flavorful but not heavy. The only negative is that the spices were not very robust/ fresh and could be improved."], ["Ross T.", "Good authentic indian food. Don't be in a hurry when you go. They take their time. If you don't mind waiting a bit or your food check this place out."], ["Kathy L.", "New favorite Indian restaurant in Columbia! The lunch buffet was stocked with great dishes, both familiar and fun to meet. I've eaten a lot of paneer from every restaurant where it's on the menu, and the paneer here is the absolute best I've ever had. Gluten free options a plus."], ["Beth F.", "We had a wonderful experience. Our waiter Joseph suggested everything and didn't steer us wrong. The Meeta for dessert was very refreshing. The garlic naan was also a must."], ["Blaine H.", "Really enjoyed this restarted Indian. Paper dosa was spot on: great sambar and chutney.  Perkins was very good. Will come back to try dinners another time. Pat sum was good too. Joseph was a great sever. Great Indian beer selection"], ["Ryan T.", "I used to eat here a lot, when it was Bombay Grill. I would always get the lamb curry, but ever since this new guy has taken over, the sauce is watery and the flavor just isn't what it was. It isn't bad, but I used to drive 20 minutes to get there and it isn't worth the drive anymore. They lost whatever was making that place special. That prettyboy manager they have running the place now doesn't know what he's doing."], ["Russel G.", "food is ok wlthe spice rating are terrible ordered mild and came out hotter than others who ordered hot.not sure if our waiter is slow or just did not understand english. ordered an app as an entre and food did not come as desired was ignored by other wait staff when we inquired about the food."], ["T T.", "Went to 2 gingers with a group of friends last eve. Ordered Chicken Biryani. Was really disappointed with the taste. This place used to be Bombay Grill till Feb. I used to like their Chicken Biryani, however it seems during the transition they have changed their cooks, and cooking standards have gone down.  Since this was my first visit, I am giving them benefit of the doubt, and not being very critical"], ["Bruno D.", "The front of the house was very good and super attentive.  Food was quite good, great chicken 65 and the lamb Chettinad was quite tasty also.  The spices could have been layered into the main course slightly better, but overall quite good"], ["Josh H.", "I notice very little difference between this and the \"old\" place. I would give this four to five stars for an Indian place to eat lunch. One thing i like is that goat appears on the buffet more frequently now."], ["Chris S.", "Yikes. Probably the worst service experience I ever had. I ordered around 7:15 and got an email confirmation my food would be ready at 7:45. Showed up at that time and they hadn't even started making my order. I was told there was some kind of \"miscommunication\" and told to sit down with no apologies. I sat there in front of the host, waiter, and manager for 35 minutes with no info, long enough to see a dissatisfied couple pay and give the waiter a stern lecture about why they would never come back. When my food finally came out I reiterated my situation to the manager and he looked at me disgusted and gave me $3 off a $40 order. I would have just left the food and refused to pay, but I was pretty starving by then. By the way they are treating people I think they might be trying to close. The food was ok, but they won't be open long. Delhi Palace isn't far away, try there if you're craving Indian."]], "Shalimar Curry House": [["D. A.", "Perfect heat and seasoning.  I think it was about $7 before tax.  Omar at the counter super friendly and the chef was a delight coming out to meet me. I'm typing while I eat and it is awesome!!!"], ["Kevin S.", "Update: I think this restaurant changed ownership, as the man and woman running the restaurant on a recent visit were not familiar. My last visit was truly disappointing. The food was not fresh or flavorful. I know for a fact that the woman helping me took my plate of food to the back and microwaved it. Had she told me that would be happening, I would have said, \"No thank you,\" and walked away. Having to microwave your food means you probably weren't keeping it at proper temperatures, and that's concerning. Unfortunately, I won't be visiting again. The search for phenomenal Indian food downtown continues."], ["Jonathan D.", "Great food, and friendly staff. I'm not quite sure what authentic Indian food is like, but either way I think that most people would like this place. None of the food is particularly unusual and I'd have any of it. The set meals get you a decent amount of food and you'll be looking at paying $7-$11 dollars per meal drink included and they even had a special today where all I paid was $7 with my drink, don't think you'll come in here getting that deal though.I'd come again."], ["Rachel O.", "This is the \"Chipotle of Indian food\" except that Chipotle tastes much better.I was really excited about this place based on the other reviewers comments but the service and food I received did not match up with what I had read. I said I had never been there before and so the guy told me how it worked. You get a bowl or a plate. The plate has two meats and two sauces while the bowl has one. I picked a bowl. He asked where I normally go for Indian food and I told him. Then he started to explain all the food items which considering I just told him two other restaurants I go to for Indian food I don't think that was really necessary. I told him I don't like spicy food and asked him for the least spicy options. He also suggested I mix two different kinds if rice and mix two sauces. I said ok on the rice and no on the sauce.  I got a samosa. The bowl does not come with naan which was disappointing.  My food was so spicy I couldn't even finish it. He asked for feedback as we were leaving and I told him i thought it was too spicy and that I didn't even finish my meal he made some kind of noise and shook his head. I felt like he was being very dismissive. The cauliflower was the only thing that had any flavor and not just heat. The quality of the food, service and the development of flavors was far below what I have experienced at other Indian restaurants. Parking is also difficult."], ["W T.", "This place is an innovative idea, but the food is just ok. I ordered a bowl with both rices (one on each side to try) at the suggestion of the guy behind the counter, who was really friendly and helpful. I paid the extra $1 for lamb, and got both korma and makhni  (again one on each side) \"curries\". They're really just thin sauces - the korma is spicier than I'm used to rather than creamy and rather sweet, but the makhni is perfectly spiced and delicious. I also ordered a samosa and raita, and while the samosa was pretty well-spiced, the raita was not good to me and definitely nothing to write home about. I should note, however, that the channa masala was delicious. Overall, I'll come to this place when I have a craving for Indian flavors during lunch because it's cheap and it's fast, but if you're coming for authentic Indian food, look elsewhere."], ["Scoo C.", "Omar took great care of me. I had the awesome spicy rice, chicken and lamb. The rice has a most wonderful after-taste that is like a happy memory. I could make a meal out of just the rice. The Tandoori Chicken and Lamb were both excellent.I loved it!"], ["Milini M.", "Wow!  Shalimar Curry House really rock my world, but it wasn't necessarily the food that did that.  It was the customer service.  I had walked by Shalimar many of times and promised myself that I would visit but never did.  I finally visited because the door was left ajar.  Now let me state I love good Indian food and all the accompanying smells!  My love for Indian food started back in high school and has since been an addiction.  The exotically spicy smells that drifted from inside the Shalimar reinforced my Indian food addiction.  When I walked into the quaint establishment, I was greeted by Omar who was extremely courteous and considerate to my culinary needs.  I am a vegetarian. Often times, restaurant workers are not always considerate of a vegetarian's needs (e.g., using utensils that have not touched meat).  Omar was extremely careful to make certain that only vegetarian food touched my plate.  That is a big plus for me!  The food was spicy (just the way I like my food), and the prices were right on point! The only reason why I didn't give this place five stars is because the food needed a little salt.  Maybe they can provide those little salt packets, but this is no big issue.  Overall, I would definitely promote this restaurant as the place to go to if you crave an Indian joint that offers reasonably priced food with GREAT customer service!P.S. --- Try the Chutney if you like it spicy!!!  You won't be disappointed!"], ["Simon T.", "Not inexpensive,and not plentiful either.Sort of tasty, though."], ["Brandon D.", "This is the only place near USC to get some GOOD Indian food.  First, I am not an expert on Indian cuisine.  I go to the Indian Buffets and just sample a bit of everything and go from their.  But Shalimar is a bit different, it is like Moe's or Chipotle.  But 10 times better.  The owner was very helpful in helping me pick out stuff that I would like and even let me sample items as well.  My only complaint was they did not have Tandoori Chicken, my favorite dish. Shockingly they had beef.  They had chicken and lamb, both of which tasted delicious.  Diffidently spend the extra amount and go for the lamb, so good!   Since they were our of naan the owner gave me a samosa instead which was also delicious.  Overall, very good place to grab some great tasting Indian food if you are down town or near USC.  Price is decent, at around only $10, for what was a decent size meal."], ["Rebecca A.", "Gave it another try. Nope. Not any better. Almost worse, actually. I got chicken tikka, channa, and a samosa. My chicken tikka was sadly the best part of the meal. The chicken was completely flavorless and dripping oil. The channa was sour and I am sure that it was spoiled and nobody had noticed it yet in the kitchen. I don't think it was freshly prepared. My samosa had entire leaves of herbs and spices hanging out of it in the midst of the vegetable purée that also filled it. The taste was overwhelming and I couldn't eat it. My rice was once again incredibly oily. I can't stress enough that nobody should think that this place is representative of Indian cuisine. I don't know why I came back. I doubt I will again."], ["William B.", "You can't beat Shalimar for the quantity and quality of food you get for the price. It's Indian food served up fast and it's become my go-to lunch spot when on campus. Shalimar has a variety of options laid out behind a counter that you select to build your order, much like Moe's (next door) or Chipotle. It's a winning combination for lunch especially because you can get a whole lot of great Indian food for under $10.My only ding is that their food is not spicy and there are no options for upping the spiciness. However, no star taken off because Shalimar serves food that is full of great flavors, just not spiciness. Also, seating is limited in the restaurant but the food is perfect to take out and eat on the street."], ["Todd T.", "Great value, fast service and tasty food. Like the spicy rice and being able to put veggies on top for no charge.  Nice local Indian place with the ordering of a fast-casual chain such as Moe's.  It will usually take you longer to park than to get your food here as everything is cooked and in view for you to decide.  Great place for lunch around campus."], ["Kathy L.", "When you walk in, don't be fooled by the menu board -- you'll need to order whatever it is they decided to make and put out. We received a sauce and (cold) vegetables stacked in a \"Bowl\" as though they were forced abruptly onto a sudden marital bed of (cold) rice. We did not receive naan despite getting (and paying) for \"Plates\" that came with vegetables and sauce. The older lady (I think she said her son was the owner) who took our orders pretended not to understand the Restaurant.com coupon I brought in via smartphone, then promptly continued ringing us up on an ipad while guilting me about what a great deal I was getting. When I moved two half-full cups of water that had been left by the register so I could pay, the lady acted horrified and began complaining about the business two doors over and made some surprisingly derogatory remarks about certain groups of \"dirty\" foreigners. She continued complaining to us about these people after we paid, while we stood holding food that continued decreasing in temperature, and also once we were awkwardly seated and eating. The food was edible, but not enjoyable -- it did not taste fresh, even though we were assured upfront, without asking, that it was. We have eaten at Indian restaurants and cooked Indian food for years and know (even before the entire \"hot\" bar was turned on and explained in front of us without our asking for or needing it / also, shouldn't those things stay on?!) what to expect. The \"chai\" tasted like an English Breakfast teabag had fallen out of its paper sack into a styrofoam cup. As we stacked our trays to leave, I saw her serving Biryani unabashedly to a college student who wanted brown rice. All in all, the bathroom was pretty clean, but we're never going back."], ["Katharine K.", "Very neat concept and well-executed for the most part. I loved that I could build my own bowl, but the chicken was a bit dry. The price is right, though, and the quantities are generous. I wish they had a better selection of sauces, however. The samosas rocked!"], ["Adam B. J.", "I was excited to get Indian so close to my work.  I even applauded the \"fast casual\" approach they are using, but unfortunately it comes up a little short.  This doesn't mean I will not continue to eat here regularly as there is no other Indian alternative downtown.  Go early.  Plan on picking it up only like three tables."], ["Emily E.", "I've never been to a \"fast food\" Indian place but what a smart concept.  It's quick, inexpensive but most importantly flavorful.  I tried the spicy chicken rice with lamb korma and veggies.  The samosa on top made it extra filling and to cool off my mouth...mango lassi heaven.  It was thick and wonderfully smooth.  Will definitely be going back!"], ["Jeff A.", "Hmm, saw this and went for lunch thinking, yay, finally an Indian restaurant on my walk between offices. Most flavorless Indian food I have ever had. I got the lamb, but there was a lot of chicken in it ;(, how weird is that. One flavorless triangle of nan for the 8$ meal, a joke. No chutney of any kind, yet they weren't crowded. Lunch was 90% rice, 10 percent meat. Have they heard of salt, or spices to add to the dishes? Save yourself a disappointing bellyache and eat elsewhere. Such a shame i can't give zero stars..."], ["Bhanu K.", "Food does not have much taste or flavor to it. Be careful what you are ordering you can run up the price if ask a lot of different types of food. Its a mix and mash of things sauces are poured over meat and veggies because the sauces are poured over the meat or veggies unlike cooking them in it the flavor does not get into the food."], ["Adam P.", "This is an awesome quick, cheap, flavorful stop. If you are tired of driving to St. Andrews for Indian food/curry and/or miss Miyo's on Main, this is a great spot and I will be back again. For $7, you get a great lunch that will fill you up. For $10, you get lunch plus a drink and samosa."]], "Delhi Palace": [["Rae H.", "While this isn't my favorite Indian food in Columbia, it's top tier and delicious.The buffet is really great with a wonderful selection and solid cooking.If you love Indian food, you will be pleased.  I love their saag paneer and daal.  It's the best of that in town.  Their naan is also super flavorful and tender.  If you have a hard time with hot food youll need to ask for extra water and be sure to have raita on everything, because there is an undercurrent of heat in every dish I tried.  I love it though and was pleased.The only thing I wasn't crazy about was the lemon rice but I think that's just because I had a hard time with the peanut texture with it still being very firm and reminding me of an uncooked bean.Parking is a breeze.  Everyone is nice.  It's reasonably priced. Decorated in a lovely manner.  Go.  You'll be glad you did."], ["Amy V.", "Service was fine but food was just okay. Ordered the tandoori species and chicken tikki masala. Both lacked flavor/spices. Chicken tikki masala needed more garam masala and heavy cream."], ["Eric H.", "On a road trip, this Indian buffet is conveniently located off I-26. It's pretty decent, too. One of the major differences between this and other Indian buffets I have visited in other parts of the country, is Delhi Palace seems to make everything from scratch, even the chutneys.The Rasam soup is very hot, not quite vindaloo hot, though. I am not a fan of the jalabi dessert, kind of a dried orange jello-dipped thin pretzel. The makhani, dal, and mutter paneer were quite good. I wasn't impressed with the pakora, but it's difficult to keep pakora hot and fresh on a buffet. I will definitely be back on my travels. Overall, the atmosphere is comfortable, food is good and hot, with slightly unusual recipes, compared to my past experiences."], ["Addie F.", "Hands down one of my favorite places to eat in columbia! Service can be slow sometimes but the food is excellent. Also check out the little shop behind the restraunt."], ["Jill B.", "Very good lunch buffet.  Lots of variety.  Only downside is if you have never had Indian food there is nothing to explain what you are getting.  I would like to be able to see something that shows a title info about each item.  I was with someone who had eaten here before and they showed me what to get and it was awesome, but without her I wouldn't have known what to get."], ["Laurie B.", "Sunday evening they had a buffet and as a vegetarian, it's often hard to find options in this environment.  They had a number of dishes, all tasty but a little spicy.   I got the spinach carrot soup.  I guzzle down a bowl super quick because it was sooo tasty but ooooh, am I going to pay for it.  Quite spicy!  The potato patties were flat out addictive.  Also the vegetable pakoras.  Word of warning, don't eat the long thin thing that looks like deep fried pepper unless you mean it.  The creamy dessert balls were to die for.  Should have just eaten those for dinner they were THAT good!  For sure this isn't a place for people who can't handle some spice unless they just eat the creamy ball thingies (an option!).  It's a delicious place to experience Northern Indian cuisine...."], ["Mike B.", "Went for lunch and enjoyed the buffet very much.  Naan wasn't the best but buffet was fresh, ample, tasty and reasonably priced.   Had something new at an Indian, vermicelli pudding.  It was warm and sweet."], ["Tasha S.", "My husband and I used to love this restaurant and go really often. We didn't mind that it wasn't too fancy since the food was delicious and authentic. However we changed our minds when he found two live cockroaches strolling by the food trays... We reported it to the waitress who was really sorry and gave us a discount but we won't be coming anymore, except to buy spices at their little market."], ["Shantnu C.", "This restaurant has one of the best north India food that I have tried in South Carolina. The great thing about this place is that the taste of their food is very consistent and their service is phenomenal. The servers are very polite and try to please you in every way. I have been coming to this place for the last 9 years and was always greeted with a big smile and awesome food.  Their owner is always ready to help you out any time that you need something special. You have to try their buffet which has so many items and is very reasonably priced. Their goat curry is probably the best that you can find in South Carolina. These guys also cater. Every time I have got them to cater for my party, I was very very pleased with their food and service and cost as well as they price everything very reasonably.Their motto seems to be to please the customers. :-)Keep it up."], ["Adam B. J.", "This was my first love in the Indian food world.  My first attempt at Indian was that terrible place in 5 Points that has since closed, and I wasn't sure about Indian Cuisine.  Went to Delhi Palace 7 years ago for a Groom's luncheon, and have been an Indian food junky since.  I've tried them all in Columbia, but keep coming back here.  I like the buffet offering at lunch, but prefer to come at night and order off the menu.  I'm a hot food person, and their chicken or shrimp vindaloo will get you sweating.  My wife loves the Chicken Makahni.  Nothing like a 16oz Taj to cool you off after a nice hot vindaloo."], ["Jason A.", "Love it!  The food here is great.  I've really never been disappointed.  I order off the menu and sometimes get the buffet."], ["Blaine H.", "First time here. Very attentive and friendly service. The get the flavor right on hoy food--certainly hoy, but complex specimens. Lamb biryani was srpringly simple and unvarnished, but it tasted like biryani at an Indian wedding.  The chickpeas and potato was very tasty."], ["Ramon S.", "Excellent food! One of the better Indian restaurants I've been to. Lunch buffet for two costed $20. The buffet had a good variety of dishes to choose from. Everything I tried was delicious. The desserts were great too. The atmosphere is nice enough to invite others and large enough to accommodate groups. I highly recommend!"], ["James I.", "They are ridiculous overpriced.  The buffet bar is quite honestly a joke.  We've been here at least 5 times and same stuff every time.  2 stars simply because it does taste good.  But you have to ask yourself if the price is justified.  I say no."], ["Khadija E.", "Awful. Dingy decor with morose servers. One of them periodically flings the food while serving. The paapad is always stale, and the butter chicken has too much garam masala. I would say this is the worst Indian restaurant in Columbia, and none of them are very good!"], ["Robert B.", "Excellent Indian food! They have an evening buffet, which is unlike any other Indian restaurant I have ever been to. Usually there are only lunch buffets. The selection was great, the flavors were tasty, and the waitresses very nice. The only downside to the meal was the keema nan, which supposedly had ground lamb in it. We ordered it in addition to the buffett, but couldn't taste any lamb, though I could see tiny bits of it. They also have Restaurant.com gift certificates you should check out!"], ["ChristiAnn B.", "Disclosure:  When I lived in LA, I had great (and not so great) Indian food. And for a while (when I dated an Indian guy), I even cooked my own Indian food. As a result, I am a bit of an Indian food snob.My friend was passing through town and we decided to get together for dinner. I found out that she had never tried Indian food before (which is crazy) so I combed Yelp for Indian restaurants. I had only been to one other Indian restaurant in Columbia- which was a huge letdown and have never ventured out for Indian food in Cola again. (It was that bad.)BUFFET: 2 stars. We came on a Friday night and had the buffet. There are several options on the buffet. I tried to get a little bit of everything. My favorite was the dahl. [If a restaurant doesn't get dahl right, then you know the place is doomed.] Other items that were good but nothing special were the tandoori chicken and the chicken masala. Some items I really didn't like. The saag paneer was not tasty and there weren't even any cubes of paneer. I love paneer, so I was disappointed.  The whole wheat naan didn't taste very fresh.For dessert, there were three options: mango pudding, rice pudding, and carrot halwa. I love halwa, so I got that. It was a little different, but pretty good. My friend got the rice pudding (which looked like ranch dressing). She didn't like it. There was no gulab jamon for dessert and that's my favorite. I thought it was standard on Indian buffets? Guess not here.SERVICE: 4 stars. The service was great. We were seated right away. The servers weren't particulary friendly, but they were always clearing our plates and refilling our water glasses. Plus, my friend and I got to talking and were there for probably two hours. Nobody rushed us to leave[, but they didn't really come back to the table either]. Ambiance is pretty nice for a casual restaurant. You can check out the Yelp pics to get an idea.Buffets are always tricky when it comes to food quality. I was disappointed with this one. Maybe ordering from the menu is better?"], ["Tiffanie C.", "The buffet has a nice assortment of items both vegetarian and with meat.  They told me the heat scale is 1-5 and that the buffet was a 3.  I found the buffet to be a bit mild, but then I like spicy food. Don't let yourself get distracted by the buffet though. I ordered the LAMB Biryani and asked for it be a 4 on the spicy scale and it was AWESOME! A healthy portion I ate on for 2 days. The only thing I would say is that they ran out of Naan on the buffet and it took them a while to replenish it."], ["James G.", "Loved our time at the Delhi Palace. Great food, very pleasant and attentive servers. Very nice atmosphere. Only negative is the condition of the men's restroom. Needs some fixing up to come up to pace with everything else. Overall, wonderful time here and will definitely return!"], ["Rachel O.", "The boyfriend and I went on an Indian food test run all around town and we both picked Delhi Palace as the winner.The ambiance and decor are nice and the staff is attentive. We tried the buffet the first time we went. It's very extensive and delicious. It does include desserts.The next time we went (and every time after that first time) we have ordered off the menu - not because the buffet was bad but because what we ordered off the menu was so delicious we couldn't veer ourselves away from it!We usually take a coupon from Restaurants.com in with us. It's $25 off a $50 purchase and we end up with lots of food and take plenty home with us. We get the following:Meat SamosasVegetable SamosasMixed Appetizer Plate (non-vegetarian)Chicken Tikka Masala with riceFish Masala with rice2 orders of nan1 beer1 sodaIt's all delicious!!! The masala sauce is wonderful. I often wonder if they would just sell me a big jar of it. I could eat it on everything. The nan and the samosas are fantastic and I could drink the tamarind sauce. All the flavors are distinct but well blended.We've never had to wait for a table but the restaurant has never been empty either. There is plenty of space so you don't feel crowded."], ["Ellisa V.", "Love it! We went on a Friday night and ended up with the buffet because we couldn't decide what to order. Everything was super fresh because it was a busy night and the buffet was turned over often. I got to try a variety of food instead of sticking to my usual tikka masala or korma dishes. The servers were super friendly and helpful as well. I wish we lived closer to that side of town so we could eat here more often."], ["Mike T.", "I had the curried goat which was excellent moist tender and juicy. However my wife had the chicken and it was extremely dry and tough would not recommend that dish. The beer and the non-with the garlic topping Was also delicious.I would probably come back again and try something different. Overall we had a nice experience."], ["Paul D.", "Tasty for most part, some a bit salty.  Seemed strange to see the Mexican cook coming out of kitchen so often to replenish buffet and \"snack\" on way back to kitchen. Host made multiple trips to buffet to \"move\" things sround, sometimes picking a snack bit out with fingers. Good variety, fresh naan, tasty chutney's."], ["Courtney S.", "This place is always delicious! Go for their Sunday buffet so you can try everything. 5 stars for food, 3 stars for atmosphere."], ["Scott S.", "Man, based on the other reviews, this place sounds like the Nickelback of Indian food.  You either love it, or it's the worst thing that ever happened to humanity.  Me, I loved it (but I hate NIckelback, although their new song is kinda catchy, I'll admit), as evidenced by those 5 stars right there.  We went on a Sunday night, which is one of the buffet nights.  For $11.50, that was one great Indian buffet.  If I wasn't attempting to lose weight, I would have eaten that place into an early closing time.  They had probably 6 different dishes to choose from, along with soup, na'an, and three puddings for dessert.  I'm not sure what more there is to say.  Great service, expectedly flavorful Indian food, and no one to tell me when to stop eating it.  Perfection, in my book."], ["Sateesh N.", "Good place for vegetarians.. My friends who eat meat don't quite like it since there are less options.."], ["Beth And Jim S.", "He said: Not horrible for a buffet. Chicken was nothing special, which is sad because I love tandoori chicken. Had to ask for kheer, the buffet had vermicelli?!?!? (think kheer with broken vermicelli bits instead of rice) - to their credit, they did being me kheer when I asked. Rice in kheer was grainy. Naan not bad. Little bitty glasses for fountain drinks.  Stood around waiting for anybody to notice we were there and seat us. Sorry, I had to put the *meh* on this review. Go to Punjabi Dhaba on Bush River.  However, the Indian market behind the restaurant is killer.She said: The food on the buffet was pretty good, though not the best I've had in Columbia."], ["Paul B.", "This place is the ABSOLUTE BOMB!The food here is absolutely amazing! If you love food full of flavor this is a must try! I have to say this is one of the best meals I have experienced in Cola to date!The people are super nice, the ambiance is great, nice and squeaky clean establishment... very nice experience!We ordered...Chicken Saag - Chicken with spinach and herbs all sauteed together...Curry Lamb... Both served with some nice basmati rice. The Nan is very good also!And.. we finished up dinner with some home made, cool and creamy, mango ice cream!! They offer some very good Indian beers to boot!!This is my new - best place to eat!!"], ["Swetha G.", "Nice dinner buffet with a large selection.  For vegetarians, don't worry, there are plenty o'choices!  I really liked the okra dish mixed with their vegetarian biriyani, it blended together very well.  The pav bhaji and naan were also great.  The vegetable korma and the saag paneer were just ok, slightly on the bland side.  The dessert selection was limited w/only rice pudding and some type of mango sweet as options.  I wished they had included jamun, which is part of their regular menu.  It's a very popular dessert and is sweetilicious.I would like to go back for a non-buffet meal and order their malai kofta for dinner and have jumun and rasmalai for dessert.  The regular menu looks very appealing and worth going back for.  The buffet is ok, not the greatest.  But for $12 and change, I'm not going to complain.Service was great, nice and professional staff."], ["Mia C.", "I started liking this place better after they moved to their current location. It was located near work, so have been here several times for lunch buffet. Some of their dishes are great. But I didn't like the vegetable korma, which is a lousy version with what looks like frozen mixed vegetables."], ["Emily E.", "Great buffet!  If ordering at the table I usually get Lamb Dopiaza and the garlic naan.  Oh, don't forget to try the mango lassis; they are absolutely amazing.  Friendly, attentive service and wonderful flavor!"], ["Kim T.", "My husband and I went here with a groupon in hand after spending a day in 104+ degree weather at the zoo. I was tired and a little grumpy but that soon changed after setting foot into this restaurant. The entire staff was so friendly and the food was amazing.  I highly recommend the Chicken Tikka Masala and the garlic naan. We ordered the non-vegetarian appetizer platter which turned out to be a plate full of meats. It was tasty but next time I will stick with the pakoras (amazing). I think next time I will try their buffet. It looked to be pretty extensive but our groupon was for an appetizer and 2 entrees."], ["Jody S.", "Looking for decent, healthy food while traveling past Columbia? Delhi Palace is a great choice, right off of I-26. I stopped with my wife and two sons and enjoyed a filling and delicious buffet. My oldest son tried his first mango lassi here and loved it. Worth checking out if you want an inexpensive alternative to fast food chains."], ["Bob H.", "Warning:: want stomach cramps?Read on...I like Indian food, but this place was horrible.First step in, we are greeted by a tall young Indian man with glasses.  It's during the evening.As I go thru the menu ask questions questions about the food; he says with an attitude \"no I don't want to know what you want to eat, just drinks\"I ask for a mango drink.  15 minutes later he comes out with a a very small tasty mango drink and leaves.  It tastes great, the best mango drink I tasted!He comes back asking what we want to eat.  I then ask questions about the food and again has a bad attitude.  Obviously he is not happy for whatever reason.  I'm not picky so I just tell him that I want chicken and curry.  My friend got goat and curry.  30 minutes later the food arrives.My entree tastes great, but my friend got all bones and tendons.  The service I would give a zero, but the food was good until...i got home.Service was horrible, but I left a tip.An hour later I'm in the bathroom and let's say it's not pretty.  For the rest of the night I get stomach pains and am sick.Food tasted great, but be aware, you could end up on thr Jon."], ["Abraham L.", "There are so many hateful things that can be said about the food at Delhi Palace, and I don't want to come across as a whiner.  However, given that this place has received so many accolades as the \"Best Indian Food in Columbia\", I feel that an acrimonious account of its horribleness is merited.As an introduction, I breezed through Delhi Palace to sample their lunch buffet.  I thought the food was bland and too salty.  Since I arrived at the tail-end of lunch, and the buffet dishes were likely stale, I decided to give it a second chance for dinner.   Big mistake; I should have just stayed home and cut my losses. Instead, I sat down for dinner and ordered Pav Bhaji, Lamb Madras, and Malai Kofta Curry.The Pav Bhaji, a \"bun served with marsala\", was probably the lowest moment of any restaurant meal I've ever eaten.  I was served a ludicrously salty spoonful of onion casserole accompanied by-- no joke-- A STORE-BOUGHT, WONDERBREAD HOT DOG BUN, soaked in oil and cut into three pieces.  Cost: seven dollars.The Lamb Madras and Malai Kofta, despite being completely different dishes, tasted exactly like the Pav Bhaji-- salt, salt, and salt, with a pinch of salt on top.  These dishes had no redeeming qualities other than the fact that I did not require immediate transport to the hospital to get my stomach pumped.  (I did, however, have stinging gums and indigestion the remainder of the evening.)My conscience requires me to give Delhi Palace a second star for its prompt and courteous service, clean tables and dishware.  Regardless, I advise you to stay as far away as your can from this purveyor of culinary garbage.  You may end up collapsing in a sodium-induced seizure by merely catching a sniff of the acrid aroma drifting from their kitchen."], ["Scooter P.", "We stopped here while driving through Columbia after a quick Yelp review. We ordered off the menu, and the food was good. The buffet looked delicious, and I think we were the only patrons to use the menu. Very pleasant service, though a bit slow. The dining room was clean and interesting, but the bathroom needed some attention. Very reasonable prices. We will definitely be back."], ["Princess J.", "Tasty buffet"], ["Bien T.", "I have been a big fan of them for a while until my last visit. I loved their buffet since I prefer exploring everything but on that day, no goat, no salad, the nan is shot all the time so our table did not get enough nan. Still enjoy the food though."], ["Cindy R.", "Have dined here several times.  Without a doubt, the Lamb Rogan Josh is one of the most flavorful dishes I have ever put in my mouth. Am tempted to order other things but it's so durn yummy, I can't make myself!  The lamb is tender and the sauce is out of this world. Garlic naan also very tasty and meat samosas as a starter were good. Service is solicitous if a bit leisurely. Overall, a relaxing and tasty dining experience!"], ["V V.", "Had a very bad experience during our first visit.  We decided try again after our favorite place closed.  The food here is hit or miss (we have been 3 times and it was great once and average the other two).  Service has improved significantly - our primary complaint on our first visit."], ["Ari S.", "Awesome lunch buffet. NOt too spicy."], ["Hilda F.", "This place is delicious.  We've been there about 6 times this year and every time we enjoy our food.  The flavors are all awesome.  We've had the buffet a couple of times and it is nice because you can try a lot of different things.  The buffet has dessert which I always enjoy.But generally, I find that ordering off the menu is a better value.  We always have leftovers to take home and it is all delicious.  They will make it as spicy as you like.The staff is helpful in explaining what to try if you've never tried Indian food before."], ["Morgan T.", "This is a fantastic Indian buffet to run to if you can't manage a whole hour for lunch and crave authentic Indian cuisine.  DIETERS BEWARE: You may have to abandon your one plate rule at this buffet!"], ["Michael T.", "Went here for the lunch buffet and it was very solid.  I used to go here is a kid years ago when it was at the old location in front of the hotel, but they have vastly improved since then (that and I'm sure my tastes have matured tremendously since then).They had the usual Northern Indian/Punjabi fare found at most Indian buffets, such as Saag Paneer, Dahl, Chicken Tikki Masala, Aloo Gobi, etc.  They had Dosa on the bar which was a surprise to me.  Granted, it wasn't as good as homemade, but still a very solid offering and not something you typically see on a buffet.The Tandoori Chicken was very solid, and not dried out like it is at most Indian buffets.  The Goat Korma was very good.  The thing that sets this place apart from most others is that it doesn't come across as \"buffet food\".  Due to their higher traffic in comparison to most Columbia Indian restaurants, they are able to cycle the food a lot more, so the food is very fresh and really tastes homemade.  They also had very freshly done Naan, a pleasant Kheer and a mango pudding for dessert, and all of the other meat and vegetables were solid fare.  Two lunch buffets and a couple of drinks came in under $20, so there's really nothing I can complain about here.I would like to go back sometime and order off the menu as well, but the buffet is a very good choice for those that aren't familiar with Indian cooking."], ["Scott G.", "Compared to spice junction this place is dirty and dated.  The food is slightly overcooked and the owners never really seem happy to see you, even if you used to be a regular.  There is no reason not to drive the extra 7 or so miles to a much better place in west Columbia."], ["Nathan S.", "Great food!Before I say anything, I should note that they have moved from the 'spooky' lobby location, to a location more suitable. They're now located at 542 St. Andrews Rd, Columbia, SC 29210 The new location is better than the old, but is strangely open and quiet. This, when mixed with a dinner rush, means you will be overhearing several conversations. This shouldn't bother most people.The staff is very pleasant, and the food is delicious. I've been hard pressed to find a menu item that ISN'T fantastic; it's almost too good to be true.I'm not sure if I would suggest it to a family with infants, due to the open atmosphere previously mentioned. However, they do have some items for a picky eater.In other words, give them a try; you won't regret it."], ["Michael M.", "The food here was great.  I found that there was more variety in their buffet compared to Punjabi Dhaba.  Service was good too except we were only one of three couples there.  I received a recommendation to eat here from several of my Indian friends so you know it's authentic.  Price was about average for Indian buffet meals."], ["Craig J.", "Definitely the best Indian restaurant in the Columbia area!  I do, however, wish the owner would put another chicken dish on the buffet in addition to the tiki masala, which is great by the way.  I understand if he can't do it every day, but at least on the weekends...for me! :)"], ["Diana M.", "We had the buffee and we were quite pleased with it!  Service is great and specially the rice pudding. Was delish.   Recomend.  Would go back"], ["Lisa W.", "The greeter is welcoming. The buffet food very good. Looking forward to returning for entree."], ["M D.", "I agree with the overall spookiness of the place... Its too much room for what it actually has.  My wife and I usually go to the lunch buffet, which is great, especially for those who dont know indian food.  My only qualm is that I wish they had a spicy entree on the buffet line.  The service is lighting fast everytime I have gone, and despite being dingy on the outside and a horror show bathroom in the old lobby... The atmosphere is well done.  real glass, very clean tables and dishes...  Its a bit more for the lunch buffet than other places, but well worth it.  I found out about this place after visiting an indian doctor for an injury I got at work, and I asked him what was the most authentic indian place...  and delhi palace was his choice... Im glad I listened to him"], ["Jordan S.", "A scary looking place, but it happens to have excellent food.  Allow me to set the scene.  Delhi Palace is co-located with an old Economy Inn just north of I-20.  The restaurant is located in a separate building from the hotel that contains a kitchen and a few meeting halls.  When walking in at 6:30 on a Tuesday night, there was not a single customer in the building.   Just one waiter and some guy cleaning the place.  After we sat down, the cleaning guy disappeared and we only saw 1 waiter for the duration of the meal.   No host, NO ONE ELSE.   It was very awkward to sit, order, and eat for 35 minutes before a second customer walked in.   The restroom is out in a dimly-lit lobby, which used to serve as the Inn's check-in area.  It is also freakishly empty.  However, the food is amazing !!  I had the delicious Chicken Korma  while my wife had the Chicken Tikka Masala.  Both were served with large chunks of delicious chicken without skin or fat, tons of curry, and a hefty portion of Basmati Rice.  We also split a piece of Garlic Naan & Mango Kulfi.  Everything was delicious, and the total was $28 w/ tax.  If the place wasn't so disturbingly empty, I think I would have enjoyed it a lot more."], ["Michael S.", "We've been regulars for years and it is great that they have moved to a much nicer location. The food is consistently good - a wide vareity of items on the buffet, all the standards of Indian fare. It usually has a fairly good kick."], ["Karen D.", "I love this place.  Food is fabulous and the staff is so friendly."], ["Robert B.", "Love this place. Unusual for a buffet to be so good, but is! Nice dining area, quiet, so you can actually hold a civilized conversation, and a wide variety of dishes."], ["H T.", "Love the food here. The buffet is a great deal and has many delicious options. The waitstaff is so incredibly nice and helpful."], ["Andrew C.", "The owners were very accommodating and the food was good. Not the best Indian I have ever had but by far the best in Columbia. Take a right just before I-20 to get there."], ["Micah S.", "It took a few tries but we finally found good Indian food in Columbia. I haven't ordered off the buffet in three trips but maybe I'll work up the courage next time out. This place is a hidden gem, don't let looks fool you. You won't be disappointed."], ["Jack T.", "I'm not a connoisseur of Indian food by any means and probably couldn't identify authentic Indian food vs. Americanized. Having said that, I liked the food here. I came for the lunch buffet and enjoyed pretty much everything that I ate. I normally don't like vegetables, but I scarfed down two helpings of one of their vegetarian dishes. I will be definitely be returning."]], "Village Of India Restaurant": [["Rick D.", "Went for lunch, decided against the buffet as they weren't busy when we got there, in fact we were the only customers there! Got the lunch for 2, lots of food, delicious, tried the medium spiciness, good flavor and heat. Reasonably priced, $8 for the lunch buffet. Will go again!"], ["David B.", "Last weekend I was looking for takeout for a buddy and myself, and happened across the Village of India.  I'd never eaten here, so I decided to try the dinner for two.  As others have said, there is plenty of food there...we ate about half, and there was a nice variety of flavors and textures.  The samosas were quite tasty, as was the tandoori mixed grill.  My friend thought that the curry was too spicy, but for me it was just right.  (I ordered medium spice--mild and spicy were also offered when I ordered).I can't comment on the table service, but my take out order was ready when I asked, and was piping hot.  The food was all packed well for travel and didn't suffer from a 20-minute car ride.  I'll definitely be back!"], ["Rick T.", "Listen do not judge this place from the outside period! This place had a wonderful Indian buffet including tandoori chicken,curry chicken, samosa, tiki marsala, and some salad and desert options. I thoroughly enjoyed the curry and the tandoori chicken the items were cooked to my liking and I helped myself to several plates, that's is why I hate buffets I don't know when to quit. The staff were nice and cordial and keep bringing me and friends naan bread to soak up the goodness left on the plate. All these items ran me about 8.75 before tip, a great deal if you want good Indian food! Walk next door if your feeling adventurous and sample some of the items at Indian grocery."], ["Scott S.", "Very nice buffet.  Friendly service.  Try the Pakora veg (deep fried vegetables with a little heat). Can't wait to try again. A surprise find in this otherwise very southern town."], ["Rasheem N.", "Food was excellent and waitress was very helpful. They made a dish for me that was not on the menu."], ["Beth L.", "My husband and I just enjoyed the Dinner for Two, which could have easily fed our family of four. Everything was delicious, and the service was good. We were very happy to find a great Indian restaurant in NE Columbia. Can't wait to come back to try the lunch buffet."], ["esther p.", "Delicious! Tried them for lunch and dinner. The dinner for two is gigantic, and we had plenty leftover. The lunch is awesome because they have a pretty decent buffet, and it only costs $8/person. I have only seen one waitress there, and she's always nice. I think it's family run, which I love about it.Oh, and they open at 11:30, not 11."], ["TruIndian W.", "We visited this place on Friday  and  went for the buffet ..... wow such a terrible WASTE. The food choices were poor the heat level on the so called tikka masala was like #1 which is totally unacceptable for any Indian food. My husband and I are military and very well traveled, we read a few reviews that gave Village of India high ratings apparently those people were PAID to review.  However this place may be fine for the locals and people who truly does not know  the concept of Authentic Indian food! I also noticed that the tandoori chicken left overs were used in the tikka masala because of the fact you do not get RED looking chicken in that dish! Also, speaking of the tandoori chicken that was being served on the buffet bar was dry as dirt!  Overall, if you are looking for a GOOD Indian restaurant  we advise you to pass this place on by! Ignore the positive reviews especially if you are NOT a SC local! It seems that the locals have a poor bland sense of taste.  Village of India DESERVES a 0 rating! Poor quality of food.... lack of spices....... dry, non-edible tandoori chicken... oh my and how could I forget to mention the goat that was served in the Biryani was tough and tasteless! PASS ON BY!!!"], ["Rebecca A.", "Came here for a lunch buffet with a friend. The place is definitely nicer on the inside than the outside. It is a family owned establishment and so everybody is very nice. The lunch buffet comes with a basket of naan. I didn't try to ask for a refill but I'm sure that any request such as that would be accommodated. The place is extremely quiet so if you want a peaceful lunch to relax this is a good option. The buffet was full of standard fare. I enjoyed the paneer and chicken. It wasn't the best Indian I have ever had, but it was still good. One thing I loved was that the water is refilled very attentively. I have been to many Indian restaurants where the water cup is neglected. That is not at all the case here. One thing that I would suggest is to maybe improve the dessert offering. All I saw was mango custard. I would recommend adding something else like gulab jamun. Otherwise this restaurant is a nice quiet hidden gem for lunch."], ["Erica J.", "I tried the lunch buffet. Wasn't very impressed. Big selection but not consistent. Wait staff slow at cleaning up plates after customers left."], ["Bebs P.", "Food here is excellent!! Plenty of vegetarian and non veggie options. Tastes fresh! Service was very good and restaurant was clean/well kept.  Outside does not look like much but try it, you will not be disappointed."], ["Enrique C.", "Excellent taste and quality.  I've had Indian food in NYC, DC and LA.  This place is just as good."], ["Jim A.", "Quite a happy find. Delicious food on the buffet, extensive menu, friendly service. Modest location but clean, well-kept interior. Prices reasonable. Highly recommend."], ["Abhinav M.", "I went here on Thursday and boy it reminded me of home it was so nostalgic .The restaurant is run by very friendly people and nothing like it is nearby. The Garlic nans and the chicken tikka masala was awesome. My friend had the lamb chop and briayani which was very impressive.I am international student at USC and it's about time we got something good and desilicious.:)"], ["Aleya M.", "Best Indian food in town. The food is amazing & beyond delicious.  I stopped in while visiting family in town. I recommend if your in the area check out The buffet.!!!!! I love indian food but this is The best i have ever had."], ["Karen P.", "Rejoice Columbia - we finally have a wonderful Indian restaurant!   We were warmly greeted at the door by the owner.  The restaurant is immaculate, the food is authentic, fresh and out of this world delicious.  I despise Indian buffets - but this one looked so enticing I decided to give it a try.  I'm glad that I did too.  The menu is extensive.  We will definitely be back for more."], ["Christine M.", "Keep in mind I went for the buffet both times and I been spoiled by Indian buffet in New York CIty, First time the food was mediocre but flavorful, nothing that made me say WOW but edible and tasty. This last time it was awful. One note flavor for everything, Depressing. I would not recommend."], ["Mahima S.", "Had Best Indian food in long time.Stopped on way to Myrtle beach..worth it.loved chicken biryani and bainghan Barth's...delicious"], ["Karen D.", "Lovely and delicious food on the buffet at lunch. You are also brought light fried puffed Nan breads that are included  Extensive menu items look great.   Coming back for dinner really soon. I have eaten at all 5 of the local Indian restaurants and this ranks up at the top."], ["Taviaz J.", "Food is excellent  They have a good variety at the lunch buffet and service is friendly.  This is a hidden gem!"], ["S M.", "Definitely one of the best Indian Restaurants in Columbia, this place is out of my way but will be worth going back to. Appetizers were so fresh and my entree had perfect spice level and taste plus the Naan bread was excellent also. If you like Indian food and have been eating in the other restaurants in Columbia then head here, you will not be dissapointed"]], "Spice Junction": [["Neal T.", "1st time eating Indian Food and everything was great!Lots of variety and multiple levels of Mild and Hot and Spicy dishes.We were well pleased with the portions size and the price is very fair.Only one thing was unexpected, they had no Sweet Tea avalible not even Hot Tea, all drinks ware bottled or caned unless you want a glass of water. No matter, this resturant is now on our favorites list, Tea or not."], ["Ronnie B.", "Don't come here expecting an average Indian restaurant atmosphere; it is quite plain, and not a little dark. The food is decent quality, but one would expect better for the price. I have eaten at many Indian restaurants that are much better and at the same price-point. My wife did not enjoy her food as it was too spicy; yes we enquires about its spiciness beforehand and were given a snooty answer about how it wouldn't be a \"true Korma \" if it were to be made more mild... It was an answer which amounted to telling the customer they were wrong, without giving a positive solution to remedy her desire for something more mild.There wasn't really much meat at all in the see of red green yellow sauces, and once again, I've had way better at other places.The place was empty when we went there at dinner time.The people that work there ended up being nice enough, but we just weren't pleased with the food. If that's not right, its impossible to compensate in other ways"], ["Rick T.", "Stopped in for lunch today and the owner was nice enough to let me sample the three curry dishes and explain their menu options. I opted for the hot which has a nice red silky hot flavor and the brown which is mild that has a totally different flavor I cannot place. Two types of rice are served with the chicken curry dish for 6.99 and that comes with naan bread. The bread was warm and buttery perfect for dipping into the curry and rice. I tried to buy two more smaller pieces of naan but the owner said it was no charge as I asked nicely. So when you come here be nice not because you get free food because it's the right thing to do and the restaurant business is hard enough without people barking out demands."], ["Anna D.", "$40 for two small plates and an order or chicken tandori. hmmm, i was really hoping this was a lunch buffet like most indian places that i'm used to. Apparently though, they used to have it but decided on regular lunch plates. My hubby and i ordered:chicken tandori (not white meat!) which makes it a thumbs up in my book. I HEART DARK MEAT. whenever it's white meat it's just too dry. So when this came out I welcomed it without having to drink any extra water or soda just to get it down. combo curry dish (lamb and your choice (spinach curry)... good but small. i mean, i can't complain about the taste. i just wish it was a little more bang for your buck. Remember though, this is coming from a person (piggy) who is used to all you can eat indian buffets)Overall, i liked the food and not the amount or price for the portions. I also didn't like that there wasn't refills on drinks and that the location was kind of in the middle of no where. The good thing about being in the middle of no where... you get a ton of parking options. LOL"], ["Penelope B.", "Spice Junction had, without exception or exaggeration, the worst biryani I have ever had in my life.  Too hot, not seasoned properly, a small amount of very sad frozen vegetables buried under a large amount of rice.  Avoid."], ["Keith K.", "Times here: 5 or so, alas.The bottom line: Spice Junction used to be a halfway decent strip-mall Indian buffet with really tasty fresh Naan bread, and this in a town that cries out for decent Indian food.  (Sadly it was more way than half, but so be it.) Perhaps 3 stars on a good day, then.But now the place is no longer a buffet, but a cafeteria that serves sub-par fare on Styrofoam plates under harsh fluorescent lighting.  You get a bunch of (cheap) starches and pathetically small cups of curry-slop reheated, which you get to spoon out of your kiddie cup with the cheapest plastic utensils imaginable.  For the questionable pleasure of this you are charged $9 - $12.  The food is edible, but completely unjustifiable.  I'm sorry, but I cannot in good conscience recommend going here.  For that price you can toodle on down to Trader Joe's and buy a handful of their frozen Indian dinners and sides, which, frankly, are superior IN EVERY WAY to what you'll find at Spice Junction.For an example of what $12 can get you in another town, try the Sunday lunch buffet at the sublime Mela in Asheville.  Fresh, made in house dishes and chutneys with lots of vegetarian options for the same price simply puts wretched places like Spice Junction to shame eternal.  Save your money, kids."], ["Rae H.", "I have been a fan of Spice Junction for years now, and it's absolutely my favorite Indian restaurant in town.It's a little hidden gem, and while in West Columbia, is still convenient to most places because it's so near I-26.  It's always clean and airy, and the food is always hot, fresh, and flavorful.I went there last night and was surprised that it's no longer a buffet, so I felt it appropriate to write a review to tell y'all alllllll about it:The menu options are basically the same classics that I know and love, but now it's actually even more affordable.  I got the chicken and vegetable Thali--it came with a chicken curry of my choice (butter chicken YES), two vegetable curries (spinach, mushroom, and corn in a creamy sauce, and daal), semolina pudding, bread (paratha), vegetable appetizers, and it was more than I could eat.  I think I got more ordering the Thali dinner than I would had I gotten it off a buffet, and now you can take your extras with you.Everything is still delicious, it has an amazing selection of classics and that semolina pudding is worth going there for alone.  It's so much saffron, so much cardamom, so much amazing in my mouth.  They seriously make the best naan in town.I often take \"novice\" Indian food eaters here because the family that owns it is so wonderful at describing everything and while it has the complicated spice and taste profiles I love in Indian food, it's \"accessible\" to people who aren't adventurous eaters, too.  As is common with Indian cuisine, this place is great for vegetarians.  Not so sure about how well they accomodate other dietary needs, but as helpful as they are, I'm sure a quick call ahead might make some things workable."], ["Lissa J.", "Finally had a chance to try Spice Junction recently and was delighted. As soon as you walk in the door you are enveloped in the delicious curry-based aromas of Indian cooking. BTW what is it with those people who say they can't stand the smell of curry? I think it's one of the tastiest, most mouth-watering aromas in the cooking world. Must be one of those genetic things like licorice (yuck) and cilantro (yum!). Anyway - since I am a new customer, the buffet idea was long before my time, so I can't say one way or another if its passing is to be mourned or celebrated.This is a family-owned business, so the staff who greets you actually owns and runs the place. They are wonderfully friendly and very helpful with newbies like myself. They suggested one of the sampler platters aka 'thalis', so I got to try different types of curry and rice together. Disclaimer: if I have gotten any of the names of the foods wrong, that's on me. The menu is very complex and I am very new to Indian cuisine.First let me say something about the rice. I am not a very good cook, and I don't eat a lot of carbs, so rice is not exactly in my culinary wheelhouse. After eating the rice at Spice Junction, I don't know why I would ever want to cook rice at home again. The thalis come with biryani rice and cumin rice. I'm not sure which is which. One is the simpler version, with just some herbs and very light seasoning. The other has more seasonings and is more colorful with hints of yellow and orange.  Both are outstanding. The way they prepare their rice, it is light and fluffy, not at all sticky. I had the impression that if I wanted to sin with some carbs, if I did it with this rice, it would hardly be sinning at all.On to the stars of the show: the curry. I had the chicken tikka masala; the butter chicken (I think?); the vegetable; and the spinach/corn. All of the curries have a heat rating, mild medium and hot. The chicken tikka masala was medium and was pretty hot IMO. I am looking forward to trying one of the hot varieties as I love spicy food. I think the others were rated mild.When trying to describe curry to an SC friend, I told her it was similar to the SC dish called hash that is served over rice. The curry is in a thick gravy-type base with meats, vegetables and spices depending on which one you order.  The base may come in different colors depending on what you order; for example the chicken tikka masala was a deep orange-red; the butter chicken was more of a golden orange, and the vegetable curries were even lighter and more neutral in color. The two meat curries had generous chunks of meat. The vegetable curry was similar to a very thick veggie stew. The spinach curry was not quite as thick as the others but was very tasty. I never thought of pairing spinach with corn but the corn really sweetened it up. All of these are very good on their own without the rice if you are watching your carbs.Speaking of carbs, the naan was also very good. You know those Mexican restaurants that offer fresh-made tortillas on premises? Naan is very similar, a little lighter, maybe more of a pita or lavash flavor. They also garnished the thali platter with a little chip-like thing. I am not sure what it was. Think lighter, fresher, tortilla chip seasoned with some type of herb, maybe? IDK but it was great.I was too stuffed to enjoy much of the mango dessert but it was good also. Now that I have had a delicious introduction to Indian cuisine, I am looking forward to going back and having a run at their complex menu and ordering something else. Def want to try something they consider 'hot'."], ["Anita M.", "Excellent, fresh homemade food. We ordered off the menu and were not disappointed. This place is a hidden gem. The owners are warm and friendly. I was pleased to see items that I had not seen on an Indian menu before. We ordered a spread of 6 dishes and appetizers and each tasted everything. The food makes you feel happy, like it was made with love. Don't let the strip mall exterior fool you; you need to try this place. As an added bonus, their food safety rating is 100%. How many places can say that? :)"], ["Heather J.", "Spice Junction has been my favorite Indian restaurant in town since it opened. They used to have a buffet, but now they are a menu-only establishment. At first, this upset me, because I am way more experiential with my food choices when I know I can try a bite of this and that, and not have to commit to something that I may not like. However, I discovered that in addition to some delicious-sounding menu items, they also have meal platters (Thalis). This was the best option for me! You could pick how many different curries you wanted, and of what variety (veggie, chicken, lamb, etc.). In addition to the curries, the meal platter came with two different kinds of rice, an appetizer of your choice, papaddam (fried lentil cracker), 1/2 a piece of paratha (griddle bread), and a dessert! You also could pick two different chutneys to go with your meal. When the tray full of my hand-selected goodies was given to me, I was astounded by the amount of food...there is a LOT of food!! In this respect, the menu-style is better than the buffet because with buffets, you're not allowed to take home left overs. I don't know about you, but I can only fit so much food in my tummy at one time...regardless of how DELICIOUS it is! I was able to get another whole meal just from my left overs! And, to add the icing to the cake, all of this food only set me back 11 bucks!There are plenty of other items on the menu (to include an entire page dedicated to vegetarian choices), and I will definitely be back to explore them, but in my opinion, you really can't go wrong with the Thalis. And don't let the price of this one particular meal fool you. What I ordered was the 2nd most expensive item on the menu (2nd only to the lamb meal platter). Everything else on the menu is easily under 10 bucks. Go forth and eat my friends! You won't regret it!"], ["TheGlamMadame K.", "My husband and I were devout customers of the restaurant which serves delicious food.  However, with the changes to the business model where this is no longer a buffet, and with the limited choice of plates served to you by the owners that they plate for you from the buffet... was too much change for us.  The whole dining experience is non-existent. This was especially hard at lunch time where I only get an hour to travel there and had to wait in line for the owners to dole out the trays...one by one.   Although I love their food, there were only a few specific dishes that I would eat.  Since I can no longer pick & choose what I want for the price, it's just not worth it.  We admire the owners, but it they cared about their business...they would return the restaurant to the original buffet.  It would bring in the regulars."], ["Claire E.", "This place is NOT a buffet.  You pay more than a buffet ($17.22), get less food, and less control over portions and where you would like your food.  I like my rice smothered in Tikka Misala and to have enough to dip my Naan in and that does not happen at this restaurant.  The owners are very kind people.  I don't think they understand what the concept is in having a restaurant in America.  They do not make their own tea, it comes out of the soda fountain, and they do not do refills on soda.  You stand at a counter and choose from a menu what food items that you want.  You cannot see the food, as it is in plastic food bins at a buffet type table (food is already prepared) behind the counter.  You choose one/two or three dishes and then everything is individually charged after that.  $2.49 for rice, and either .99 or $1.99 per plate of fresh naan.  They make it fresh for you. I was in there at 12:20pm for an hour and I was the only customer.  There was one man who came in for takeout. The food was \"ok.\"  I would not make the effort to return, as there are two other indian restaurants in the Columbia area that are several dollars cheaper ($10.95 vs. $17.22) and have much better ambience than this place.  And those two places make their own iced tea.  What restaurant in the south doesn't make their own tea?  Us southern folks don't want tea out of a Coke machine. It is like the inside of an office conference room.  Very boring, without ANY indian colorful pictures on the walls.  The walls are gray....not very inspiring at all.  Tables set up as though it is a conference room. Not an issue for me, but they don't serve beer or wine.  If I went for dinner, that would be an issue.  If your in the area, the food is \"ok\" and nothing special.  I would not go 10 feet out of my way for this place."], ["Joshua H.", "Just came, super excited, to the only damn Indian buffet in town with good food, after they were closed for two weeks,  and they're not a buffet anymore. Same exact food but they're set up with a menu where you get less food for more money, and cant even try all the options.0/10 don't waste your time."], ["Brandon D.", "Don't let the location turn you off..this is one of the best Indian places I've ever been to.  The selection is on the smaller side, but the food is fresh and very tasty.  It is run by a family who makes you feel at home when you come into their restaurant.  They will bring fresh, straight from the Tandoor oven Naan bread to your table.  The Naan is the best I've ever had.  The butter chicken is delicious, something I didn't think I would like, but I loved it.  My other favorite dish is tandoori chicken, which was also delicious.  My only problem was that they serve strips of the chicken, and not pieces like other places do, but still it was excellent.  Plus the pace was extremely clean.  If you love Indian food, you will love Spice Junction!"], ["TIM V.", "Our family visited this gem tonight. My wife and I each ordered and devoured the platter (both with the chicken Tika and the spinach/corn dish). Just the right amount of heat. My daughter and mother-in-law ordered the small platter with butter chicken. Excellent. Our new go-to Indian restaurant now that Punjabi Daba is gone."], ["Chris C.", "There is no longer a buffet, but all of the lunch menu items are under $10.  I had the Chicken Thuli.  It came with chicken curry, 2 veggies, 2 different rices, naan, a samosa, and some other things that I am not familiar with.  I cleaned my plate.  It was fantastic."], ["Adam B. J.", "Can't say anything bad about the food.  It is excellent, clean, and fresh naan to the table.  Was my favorite Indian in Columbia.  The owners are sticklers to a fault about cleaning your plate.  They have signs up stating you will be charged for un-eaten food.  I haven't been back in almost a year after they charged our friends an entire adult buffet price after they gave their three year old a left over piece of naan.  I just thought that was wrong.  I'm still trying to get over that, but until I do we've been taking our business else where."], ["Matt P.", "Rahana and Hakeem, the owners we just met today, are super friendly! Their food is super tasty! For a selection of some of their dishes, they welcome giving you little spoon samples to try before you buy. We had the butter chicken curry, chicken tikki marsala, lamb curry, and a variety of chutneys and appetizers along with a nice desert. Everything was top notch! If you haven't tried Indian food, then get out of your bubble and try this out! I've had numerous different Indian food experiences and this was one of the best!"], ["B D.", "This place was good as a buffet, but when they started putting up all the signs we got annoyed. Then they always seem so damn cheap... Omitting things from the buffet over time, then closing for 2 months and coming back as a plastic and styrofoam overpriced menu only option. We went there for years... Walked in and saw the menu without the buffet and the rip-off prices... Then we looked at her with disappointment and walked out. You cheap ass bunch of greedy bastards. We have been there a hundred times, but NEVER AGAIN!!!"], ["Ingrid P.", "Great food! Great people! Come and try it! We had a variety of chicken, lamb, and vegetable dishes with appetizers and desert. All was good!"], ["sambriddhi w.", "This place is legit!!! I had the spicy chicken curry and it was amazing!!!! I can't wait to try everything else"], ["Andrea G.", "Great flavors and the owners are really nice. Very consistent food, Naan is excellent and the restaurant is super clean!"], ["Lori J.", "At first glance, you'd never walk in here. It's shaded windows make it a mystery if you drive by. But park, go in and EAT some of the best Indian I've ever had at a restaurant. I make curry at home and I'm dying to know some of their receipts. Love the fresh naan and the lentil curry, the savory rice and I could eat my weight in the cauliflower nuggets. The roti bread is delicious and I like to wrap my tandoori chicken in it with a little lettuce and chicken curry. Mmmmm I'm hungry now"], ["Karen S.", "A group of us had dinner here last night for a friend's birthday.  I was not too overly impressed with this place.  This is essentially a buffet restaurant. It seemed like they did a good job keeping the rices and meats stocked, but when it came to the side items, things could be better. I was expecting a little more for a $10+ buffet.Also, beware: they have a camera watching to see if you are eating off of others plates! You are not allowed to share buffets with anyone else - each adult needs to pay for their own meal.  One person in our group was not going to eat.  At one point, she was biting at one of her fingernails and when she left, the owners approached someone else in our party thinking she had eaten (from what they saw on the camera) and made someone pay to cover the buffet.Pluses was the bread that they brought out unlimited bread.  They were also good about taking a reservation for our groups reservation."], ["Kevin S.", "What a terrible disappointment to arrive for dinner after being devout, happy customers who drive a lot of business there, only to find that the entire business model has changed for the worse. What used to be a phenomenal, top notch buffet-only establishment that allowed customers to experience a variety of Indian cuisine is now an overpriced, menu-only restaurant. The combination plates on the menu are utterly confusing. Our group of four was so disappointed with the drastic change that we opted to walk out and probably never return. For years, we've been willing to overlook the saturation of signs with ridiculous rules, regulations, and policies; however, this is the straw that broke the camel's back for us. So, we're now sitting in Mai Thai, lamenting the end of an era over a delicious bowl of Coconut Soup and excellent Pad Thai."], ["Nawfal A.", "Really my favorite restaurant in W. Columbia. Food is always fresh and tasty. People who do not like buffets because they fear stale crusty items ought not be afraid to dine here. I adore the biryani rices.The buffet may looked smaller - only if compared to Ryan's. However, each item here is fresh and delicious. Also, the owners are very conscious of the ingredients that they use and are knowledgeable about allergies, sensitivities, etc.The owners are extremely open, helpful, and kind. They pleasantly greet customers and assist in making buffet choices if asked. They have mastered the skill of customer service in restaurants."], ["Andy L.", "Food was as good as any of these good reviews. Part of the restaurants name in \"ultimate spice combinations - how true. I had only been to Indian restaurants while living in China. Like most foreign tastes the Chinese try to imitate China's version was sad. This place wow- awesome.You better like spicy food - this takes spicy seriously. Not a lot of dishes but my tongue was on a roller coaster of fun. We had the lunch for 8.99 and it was worth it. I had almost everything. Are there too many cameras for the size place? Yes. Did that change the taste, my actions, or the experience - NO. Go here ~ it is different and you will enjoy. The west side of Columbia can be a bland place in the culinary environment. This is not bland."], ["Carmen T.", "This was the most delicious Indian food I've had. I ordered a platter with chicken tikka masala and two veggie curries, which I chose to be paneer/green pea and chick pea. The platter comes with every carb product available, two chutneys, and the mango dessert. It was amazing, as was the $8.99 price for all of that. I want them to open one in downtown Cola ASAP, but I definitely will drive back out here for this."], ["Chef R.", "YES!! Go Here!We visited the SJ for the first time today.  I expected to see tons of signs and a strict restaurant operation.  What we got was a clean and tidy place with a pleasant decor.  As for the service, we were greeted as soon as we walked in, you seat yourself and order at the counter.  We were treated to a wonderful selection of traditional Indian dishes.  The two of us ordered different combo meals and ended up with a personal buffet of sorts.  The meals come with chutney, appetizers, rice, noodles and dessert.  Really good fresh, not over the top hot, just flavorful curry, the butter chicken, tiki masala and mutter paneer, naan all really good.  I will be a regular and want to turn folks on to this place.  She did the right thing by closing the buffet, to me buffets are a potentially hazardous food. She has better control of her product and cost this way.  Restaurant business is not easy or equipped with huge profit margins.  I'll support this small business owner!"], ["Emily A.", "What a huge disappointment. I don't know how a restaurant can change their entire business model and expect their customers to be happy. I'm not one for buffets but this one was good because you could try so many different things. If people weren't paying then why the heck didn't you pay before you ate your dinner. We also spent more money and didn't get to have anywhere near the options that you previously would have had with the buffet. This is ridiculous we will probably never go back."], ["Simon T.", "Best Indian foodin the capital city.Immaculate, clean."], ["Christopher K.", "Spice Junction is a buffet-only Indian restaurant.  The food is clean and fresh tasting but obviously geared toward an american pallet.  The space itself is probably the cleanest, best kept Indian restaurant in town.The Naan is made fresh and they are willing to bring out as much as you want to eat. The appetizers on the buffet are constantly running out but that just means that they are throwing fresh ones in the deep frier all the time.  Nobody wants cold samosas.  The selection on the buffet was probably the minimum I would be happy with, only three vegetarian dishes and two of them were in heavy cream.  Spice levels were very low for my taste, but again it is a buffet.If this were the only game in town, I could make it work but I will likely be taking my business to Bombay Grill for freshly made Dosa and spicier food."], ["Kelsey T.", "Classic Indian cuisine. Got the thalis platter. It was really good. Next time I would get double butter chicken, instead of two different chickens. It was the best butter chicken I've had. The platter comes with enough food to make lunch and dinner so it's a pretty good price considering that."], ["Farid A.", "This is a disgrace to Indian food.  By far worst Indian I've had in my life. All curries were burnt when adding spices this gives the bitter taste.  Chicken samosas store bought and disgusting.  Naan store bought and way too much butter.  When walking in I was excited thinking it was a buffet instead you order pre-made food.  Drinks are no refill but lady seemed to make it up by hardly putting ice in it.  That is the cheapest thing I've seen.  Drinks out of fountain at 12c cost. She is losing money when people turn down drinks.  Also got haleem as you could guess worst haleem ever. Haleem should be sticky from the pounding and grinding of meats barley and lentils. This was more of a thick soup with a chicken base flavor.  I never wrote posts but this was a waste of money and horrible. A disgrace to such a beautiful food culture."], ["Geri D.", "I came here via yelp reviews. So glad I did. That naam bread is addicting. Pleasant owner that comes to check on you and reccomend great things to try. Great buffet set up so you can try multiple dishes. Good option for those new to Indian Food."], ["Jimmie B.", "So disappointed that my favorite Indian restaurant is not the same! The business model has changed. What was a  buffet with a great assortment of Indian dishes for all palates to enjoy is now an order by menu cafeteria-style restaurant. Cafeteria  style because the food is not made to order but dished out on a plate in front of you. The menu is very confusing and the meals are full of carbs-two dishes of rice, noodles, etc. We sent a lot of business they way-especially people just wanting to try Indian for the first time. Unfortunately we have to say goodbye because we can't afford to pay $40 for a meal we used to pay $22 for. Don't get me wrong- I'll pay good money for good food but not for an Indian cafeteria."], ["Camille B.", "No longer a buffet. The food is still delicious, but you have to select combinations from a menu now. Our favorite part was being able to try a little of everything. Also, the food is served on styrofoam with plastic utensils, which is disappointing. The owner changed format because she was losing money due to people taking advantage and not paying. I hope this works out for them. We aren't eating there as frequently as we used to. I really like the variety of the buffet. It's a shame some people had to ruin it."], ["Rachel O.", "Delicious Indian cuisine hidden in a strip mall in West Columbia? Absolutely!!!I grew up in West Columbia and it's not exactly known for its culture scene.   Usually you have to take a trip across the river into downtown to find something as wonderful as Spice Junction but not anymore!Now, I was hesitant to try a new Indian place because I found true food happiness at Delhi Palace but now it has some competition.The dining area is decorated minimally but  that's fine by me because the family and food here are the stars.  The family that runs Spice Junction could not be more pleasant.  They welcomed us, explained the dishes on the buffet and kept the hot naan coming to our table. The buffet at Spice Junction is not super extensive (I wish there would have been at least one seafood option) but what is offered is delicious and varied.  There is a section of sauces (the tamarind and cucumber yogurt are delicious) and desserts then some rice and side dishes and then the main dishes.  While I was talking to the gentleman about the items on the buffet a customer that was eating actually came up to me and asked if it was my first time there and I told him it was.  He asked me to try the spring rolls with the sauce.  He took off his wedding ring and told me that every time he comes in here he tries to get the woman that was running the restaurant to marry him because everything is so delicious!  She just laughed and waved her hand at him dismissively.   Hilarious... but back to the food.  The samosas were devine (chicken and veggie both) and the guy wasn't lying about the spring rolls - delicious!  I also tried the spinach and corn main dish which was totally new to me but had a great flavor and surprisingly a nice texture.  The best thing (besides the naan which is delivered hot and fresh to your table as long as you ask for it) was the butter chicken.  I had 2 plates!   I was so full we didn't even try the desserts but the lady did mention to us that the chatty man from before would use some of the mango dessert and mix it with some ice and make a smoothie out of it every time he comes in... he keeps trying to get her to put it on the menu.  It's a fantastic place and we will definitely be going back for lunch sometime.  Boyfriend actually said today with a breathy tone that people usually reserve for talking about mystical places like OZ,  \"That Indian food yesterday was wonderful!\"   So we will be seeing you again soon, Spice Junction.  This time I'll try to save some room for dessert!"], ["Hung D.", "3 went for lunch 1st time. I guess they serve buffet all day. Seat yourself. Lady brings out fresh naan. Awesome.   Everything self serve including seating, utensils, & drinks. Good selection & very tasty. I had no issues with signs & cameras. Here's another angle:  many signs because there's only 1 person on the floor to do the cashier, bring out the naan, & clean tables. As for the # of cameras, probably bought as a kit from Sam's or Costco so came with all those cameras. Again we had no issues & enjoyed it very much. We did not notice other customers having issues. They all seemed to enjoy including some retired folks."], ["Katharine K.", "My favorite place for Indian in Columbia. I would recommend eating at the restaurant instead of getting it to go so you can really take advantage of the buffet and get a better sample of their many great offerings."], ["Martina G.", "I rarely rush home to write a review but I just want to shout from the rooftops about how wonderful Spice Junction is.  It was well worth the drive across town, and before I leave Columbia, I will go out of my way to eat there again. $8.99 for lunch/dinner buffet for a spread this size is a great deal. It's delicious too. There are different rates for children's buffet and take out. As you enter, head towards the rear of the restaurant to the buffet line. There is always someone there to answer any questions about the food or help you with anything else. Water is also self-serve. We filled a pitcher with ice and water. What a cool concept!My favorite items were the naan, butter chicken, almond chicken, fruit salad in pudding, semolina pudding and the vegetable samosas. But everything was delicious. Next time I will try one of their salty lassis. The most impressive thing about Spice Junction is the great customer service.  Reheena (I'm sorry for the misspelling), the owner, is an incredible hostess. She greeted us warmly and brought fresh naan to our table. She offered us more bread and checked on us regularly. Her sons help out at the restaurant also. The youngest one at the register is very sweet.Another reviewer mentioned that there wasn't much of an atmosphere. I would have to disagree. It was quiet and perfect for conversing with others at your table.  My husband and I did not have to talk over any loud music or TV. The place is simply but tastefully decorated. If you're looking for something fancy, this isn't it.  I've been living out of a suitcase for weeks now and I'm grateful for places that have good food without prevention. Lastly, I judge a business on how clean its restrooms are. Spice Junction  did not disappoint. It was very clean."], ["Greg W.", "First I'm just going to say, this place was a little hard to find.  I had an address, but no description/map (I was navigating via phone), so I drive by it twice (the exterior signs were very hard to see in the traffic pattern that I was following) before I found it tucked away in the strip.  If you're looking for it as a first time customer, it's South of Carolina Wings, almost at the corner.With that out of the way: Wow!  This was my first foray into the world of Indian cuisine, so I didn't know what was in store for me.  I had my own preconceived assumptions and expectations (I was thinking spicy and hot), but was completely off in what I had imagined.  The flavors of each dish were boldly spiced, but I found everything to be sweeter than I thought it would be.  A couple people in my lunch group had mentioned heat, but I didn't get that at all (maybe my senses are dulled from years of abuse...).  Everything else has already been explained in previous reviews, so I'll just add to the notion that I can't wait to go back!"], ["angela l.", "Butter Chicken is the Best in Town.    This Indian scrumptiousness will make you want to become the adopted child of the family that own the restaurant, even if that means you will have to run the register part time. Despite the weird paranoia of all the cameras mounted to the ceiling and walls this family is very pleasant. If they are not real familiar with you they may \"linger\" around the buffet while you make your plate but I believe it is out of helpfulness in case a newbie comes in and does not know what the dishes are.    They do have a concern of the typical American that will over fill and waste a plate without respect, and the general rule is if you leave a plate of food uneaten you will have to pay extra. This ain't no Golden Corral folks! However with that said if you appreciate food and the ones that put their hearts into it than there will not be any food left on your plate. This family truly seems to want to share with you a little piece of their culture and home so that you can find peace in the butter chicken and joy in the samosas.     In case you didn't get the clue, the food is amazing! They bring you fresh hot naan to your table which is a special treat if you are having a buffet. Our usual plan of action is to get a bite or two of everything, taste and then try to decide what to fill up on. Our second trip to the buffet is to get a plate full of our favorites, our third trip is to get just a few more bites of the one thing we will be thinking about for the rest of the week, and then our fourth trip is for the mango semolina dessert. This beautifully orange colored stuff is a yummy finale to a fantastic dinner, buttery, sweet and fruitful you may want two bowls. My words of wisdom is open your mind and try it all you may find a surprise in the roasted cauliflower or a wow in the weird -what is that?- corn mixture. And be nice to the family and they may very well take you in."], ["Monica M.", "without a doubt the best Indian food around!! I was hesitant at first, after reading reviews of harsh buffet rules...but tried it anyway. I can honestly say, the rules listed (will be charged full plate price for too much food left on plate) are there because of a small few. My daughter had never tried Indian food before, and we were told not to worry about that rule, that a sample plate was acceptable for first timers. Its too bad a small few have to spoil for the rest of us, but I wanted to clarify that rule for others who may be considering this restaurant. Excellent service, a great family restaurant with caring, professional, attentive staff and AMAZING currys and Naan :)"], ["Jackie P.", "Can't get enough of this buffet. Loved the fresh naan, the paratha, all the delicious curries, and that yummy mango purée. Best Indian buffet I've ever been to.  Wanted to go back the next day for round two, but they are closed on Sundays :("], ["James G.", "Was looking for $$ to $$$ restaurant, this place kept coming up with good ratings. So what the heck. This was my first time eating Indian food so judge from there. I was greeted with a smile and warm welcome, told them this was my first time eating Indian fair, they gave me some directions and away i went. It was buffet, I got a little of every thing my plate could hold. Every bite was wonderful, warm bread was brought out, went back for a sample of the rest again it was wonderful. The only problem I had was my last trip to the buffet was to choose again. This is a Mom & Pop place two young sons working also. Food is prepared by the Husband and Wife with a little friendly competition.I would eat here once a week if I didn't live in B'ham."], ["Tim N.", "The definition of \"hole-in-the-wall\". Family-owned restaurant with fantastic service. The food is fresh and delicious with lots of vegetables. Clean, simple dining room filled with happy customers. Can't recommend this place enough!!!"], ["Jane D.", "There is a lunch buffet marked with what each dish is."], ["David B.", "We left the interstate in search of this gem, and were not disappointed. They brought fresh Naan to our table, but everything else was conveniently self-serve.  The buffet is quite extensive with lots of variety.   The location is a little hard to find if you are not familiar with the area, however we called on the phone and the owner was very gracious in helping us find our way."], ["Beth And Jim S.", "He said: place is buffet only. Family running it seems nice. Naan brought to table and very good. Curry chicken spicy. Butter chicken delicious. Goat biryani tasty but spicy. Mint chutney spicy. I guess the locals found out about this place because by 6, half the tables were full. Tandoori chicken a little dry but good flavor. The semolina dessert was really tasty.   Will be back.She said: We had the dinner buffet. Not a bad selection for the price ($8.99), The butter chicken was very good, as was the fresh naan."], ["S W.", "Sooji Halwa (semolina porridge) is possibly the best thing that I have ever tasted. Go read the comments about the butter chicken; yes, it really is that good, but did you know the secret? It's cashew nuts.Still the tastiest Indian food in Columbia or the Midlands."], ["Tessa G.", "Seems they have changed their restaurant from buffet to combination platters only (at least for lunch). You now have the option of several combinations (veggie, chicken, or both) and can also order single orders of their items. I ordered a combo lunch which comes with one chicken dish and two veggie dishes along with rice, samosa, small piece of naan, papadum, and something else (sweet) that I don't know the name of.  All was good especially the veggie dishes but not great. Naan could have been a little fresher. Overall I enjoyed it and will most likely go back for lunch again but I wouldn't say it quite lived up to expectations."], ["T H.", "Best Indian in Columbia, and I have tried them all. Great family owned place with excellent and consistent service and immaculately maintained. But the food is the best part.  The complimentary naan is provided fresh from the oven instead of cold on the buffet.  Great value and one of my all time favorites in town."], ["Kel B.", "I was SO excited to try this place because of all the great reviews.  I had never eaten Indian food before and really wanted to try it.All of the food was good!  They didn't have a big selection, but I tried everything on the buffet and everything was delicious!  Worth the ten bucks a piece for the food.  The naan was sooooo good - the other reviews are right!!!BUT!, what in the heck is up with the owners staring you down the ENTIRE time?!  As soon as we walked in we were glared at by the woman behind the buffet who just stared at us and followed as we walked down the buffet......  It was so awkward!  Also there were about seven video cameras pointing at the dining area.  It's a TINY one room restaurant.  Also, violently worded signs all over the walls about the buffet rules.  What in the world!?It was very creepy.  I liked the food, but jeez...  pretty sure I won't be coming back due to the prison-like atmosphere."], ["Gregg W.", "Great food and great service!  The proprietor was genuinely nice and friendly.  She was pleasant to talk to and was a positive addition to the meal.  She was a great server and great help.  She helped my wife navigate the buffet, since my wife has never ha Indian food before.  The naan is great...as is everything else I ate, which was just about everything!This is a small and humble restaurant that delivers the perfect match of cuisine and customer service....I left the restaurant feeling very satisfied gastronomically and emotionally....a great local business to support instead of another shoddy national chain."], ["B H.", "at first glance, I was skeptical, the exterior and the fact that it was empty when we went in made me a little worried. But I was thoroughly surprised. LOVED the food. so good. Would go back again and again. I've eaten indian food in various parts of the country and this is top notch. very nice employees and it was a clean place."], ["Denise K C.", "This restaurant has a 99% approval rating on Urban Spoon. We have been a fan of another Indian restaurant near Dutch Square, and we still are. But when the family wanted Indian, we decided to venture out to somewhere new.Spice Junction has NO Atmosphere, but it buffet style, prices are cheap and the food is delicious. And the Naan - WOW! Yes, I'll have more please."], ["Thomas B.", "Excellent naan. Buffet style...owner keeps the hot fresh naan coming. Ask for less ghee on it BTW. Vegetable dishes better than the chicken. Chicken rather dry. Incredible value. Dinner $9.62. Was so cheap I left a $5 tip. Excessive largess?"], ["Becca D.", "This is, without a doubt, one of the best restaurants in town. I've been here more than a handful of times, and the quality has never changed. The fresh naan is delicious, and they have added a warm, spicy tomato soup to the buffet which is really nice for the cold winter months. I am a vegetarian, but my boyfriend says that the buttered chicken is somewhat like tikka masala and is one of the best things that he's ever eaten. This is a $9 all-you-can-eat buffet, but the quality of the food is akin to the most expensive Indian food that I've eaten in cities like New York and London.I don't remember the exact price for carry-out, but it is less than the mediocre per-pound hot lines at places like Whole Foods and Earth Fare, and obviously the food is way better. A carry-out box would definitely hold enough food for two meals.I like Spice Junction so much that I've asked my parents to bring me here for my college graduation dinner.And as a bonus, the sweet family that runs the restaurant is almost as much incentive to love it as the food itself.In response to the post about being charged for a second adult buffet if you don't clean your plate - I saw the signs but assumed that they were a joke. My boyfriend and I both left some sauces and pickles on our plates, and no one batted an eyelash.I don't think it would be unreasonable for a restaurant to have extra charges for customers who repeatedly waste significant amounts of food."], ["Cassie M.", "Found this little gem here on yelp.   Food was amazing and reasonable.  We had the lunch buffet, which runs $8.99.  The owners are extremely friendly and kept the hot naan coming to our table.  Just make sure to finish your plates, kids, or you'll pay for the buffet twice."], ["Jo I.", "Don't let the strip mall location fool you - the food here is excellent. Buffet-style Indian like you've never seen it. Choices change daily, so there's always something for everyone. Fresh bread is brought to you as soon as you sit down, and keeps coming for as long as you can keep eating it. The restaurant is clean and the owners are friendly. This is the only place I'll go for Indian!"], ["Taylor T.", "the food is most definitely DELICIOUS! but, and a big BUT, the crazy rules is what can really push you away. i walked in to get a to-go box and a young man says to me, \"do you know how the buffet works?\" i think to myself, yes....you get what you want, they weigh it, you pay and everyone is happy??right? NO! but i have the kid enlighten me on the rules of the buffet once more, you HAVE to chose 4 items or more, and you HAVE to have 1lbs or more of food. once you are ready to pay, you will be paying a pretty penny for your to-go box. another thing i don't like, its how they charge for uneaten food, and watch you very VERY closely while eating. i thought it was just me feeling out of place until my boyfriend says to me, \"is it me, or are they really watching us\".what a shame the food is great, but the rules can leave you feeling a bit uncomfortable :/"], ["John P.", "Have tried 3 different Indian restaurants in Columbia and this one is the best.  I introduced my girlfriend to Indian food and now she suggests that we go here every Sunday.  Food: 5 starsGreat selection of some of my favorite Indian dishes.  All spiced well and good variety.  Love finishing my buffet lunch with the mango pulp and rice pudding, very refreshing.Atmosphere: 4 starsSimple decor, but its all about the food.Service: 5 starsThe owner goes to the kitchen to fix a fresh naan as soon as we walk in and they are always willing to explain dishes and answer any question that we have."], ["Todd T.", "Went here one Sunday night.  Great food!! The owners are really helpful in describing the food. Great variety of options on the buffet"], ["Paul G.", "Food is always good, although it'd be nice if they offered some variety and changed the items a little. They're always pretty much the same. But that's not what this review is about. This is about their odd customer service. They are extremely strict about their 'no wasting' ruke even going as far as pointing out to you that it's strict whike you're getting food from the buffet. They always watch you with evil looks in their eyes, like thinking you're always up to something. They're paranoia is further enhanced by the 15 cameras all over the whole restaurant. Very weird indeed for a small restaurant. Anyway, like I said... Good food, they just need to stop being so... Weird."], ["Npk K.", "\"One among the worst you will experience, customer handling is worse\""], ["Janet A.", "Excellent food and the BEST naan I have EVER had!  Highly recommend!"], ["Arulram S.", "Amazing quality of service.  Food on buffet was kept fresh and stocked, and the fresh naan that is brought with dinner is wonderful.  The fare at Spice Junction is fresh and has a wide variety for vegetarians."], ["Kama A.", "WOW!  What a Gem of a place!We stumbled across this Indian restaurant & decided to give it a try as Hubby & I enjoy spices & bold flavors.Absolutely delicious!  Very clean restaurant, even the ornaments on the walls are polished clean & not a speck of dust to be seen.   :)You sit wherever you want. (Or you can get it to go). They have a Buffet set up at the back of the restaurant. Grab your plate & pile on your selections. They also have an excellent array of vegetarian options, even if you are not vegetarian, you will still enjoy the delicious flavors of this type of cuisine.Mom & Pop style restaurant. Very friendly & helpful. If you are not sure of the dishes, the wife is more than happy to explain.I love the different salad dressings too...especially the mint chutney.  :)They continue to bring out the yummy hot naan bread to your table & you can refill your plate until you are satisfied.Don't worry if you get to the buffet & your fav dish has run out. They will cook more for you. Help yourself to the free water station. You can refill by the glass or jug. Sodas are also available for purchase if you want.The food is so yummy & flavorful & we always walk out completely stuffed.    :)We have been coming here regularlyfor 3 weeks now & we absolutely love it.It is well worth the drive. Sometimes hubby will go out of his way to stop here after work & pick up dinner.If you love spice, flavor,vegetarian options, friendly & clean restaurants...then this place is for you!"], ["Abraham L.", "When it comes to Indian food in Columbia, this is the only game in town. This is the only Indian buffet in the area that doesn't saturate their dishes with ungodly piles of salt.  Their use of spice is very sparing--too sparing for my tastes--but they do provide ample options for adding spice, such as green chiles and assorted chutneys.  The buffet is a bit heavy on chicken, but they seem to always have one (fairly good) goat dish for the fowl-phobic among us.  Plenty of vegetarian and vegan options too.  Nothing exceptional, but everything is consistently palatable, which is (again) more than I can say for other Columbia-area curry dens.The folks who work here are pleasant, helpful, and apparently dedicated to providing good customer service.  And at 9 bucks for a dinner buffet, the price is right for a night of all-you-can-eat curry."], ["Scott G.", "This Indian buffet is off the charts compared to the others in Columbia!  Super clean, amazing, gracious, kind owners who seriously love their customers.  Oh yeah the food, well it is amazing in its own right.  The tandoori chicken it's actually served spicy on the buffet and is awesome along with everything else."], ["Tabitha S.", "Great place. Good food. Amazing prices. The owners and their sons are the only people I've ever seen working, and they are fantastic. The restaurant is run incredibly efficiently, and they bring fresh naan out to your table. A great gem in West Columbia."], ["B D.", "This was our favorite place for Indian for the last year. The last two times we have eaten here we have had to RUN home to the bathroom. Please change back to the old food recipe and we will come back. Until then we are DONE!"], ["Karen D.", "Fabulous fresh food, the best I have had in a long time.  Very nice and friendly family owned place."]]}