{"Rosso Trattoria Italia": [["Simon T.", "Yo. Get a pizza.Sure, get some other stuff too,but get a pizza."], ["Roger Y.", "I really want to give this place a fourth star and it's not out of the question if they made a few changes.  The place has a lovely atmosphere indoors (although it can be a little noisy).  They have outdoor seating but I cannot understand the romance of eating at a table overlooking an asphalt parking lot. Still, they appear to fill it up, and I chalk that up to a matter of taste.I really struggled with what to order.  The folks next to us had a pizza and an order of seared scallops over risotto which looks fabulous.  Precious ordered the 6 oz filet and I ended up with the grilled pork chop.  Both of the meat dishes were very good, and Precious declared her tenderloin magnificent.  My problem was that both dishes were served with these things called potato cakes and a serving of grilled bok choi.  Now, I am a fan of bok choi, so my beef is not with it per se.  I just wonder about it being served at an Italian restaurant as a side on most of the dishes.  Getting past that, it was cooked by a quick grilling to pick up a char and then added to the plate. I don't think it was seasoned or oiled at all.  The green leafy end was tasty but 75% of it was devoid of flavor and otherwise inedible.My biggest complaint is with the creature called a potato cake.  It was ground something and then coated with bread crumbs and deep fried.  I truly could not pick up the taste of potato at all.  It had a ground mealy texture which I would have guessed as pureed beans before I would have guessed as potatoes.  In the end, the outside crunchy part had nice texture, but the dish was flavorless.  They should serve risotto or pasta as sides before they serve this concoction.Having said that, we are going back to order some of the pasta dishes and perhaps the pizza. I'd avoid the pricey meat dishes with very disappointing sides, or ask if they'll substitute."], ["Samantha A.", "We had a great meal here on a Saturday night. We made a 745 reservation the day of, and we were greeted and seated promptly upon arrival. We had a lovely little table by the window. Our server, Lilly, was amazing. We both started our meal with cocktails (a blood Orange martini and a gun fresco). Both of them were very fancy and very tasty. For the first course, we split a cheese plate. It wasn't overly large, but the array of things was very nice, the cheese was fresh, and it was plenty for two people. I paired mine with an Italian pinot grigio, he had a martini, which he loved. We decided to go old school Italian with our entrees. The menu had a little something for everyone, including some lovely seafood items. I had a Chicken Parmesan, he had a Veal Piccatta. Everything was absolutely perfect, and tasted great with the Super Tuscan we ordered. This place is a real gem, with a great, not overly fussy ambiance. We can't wait to go back!"], ["Lydia S.", "Usually really enjoy the food here. Very nicely cooked and great blends of flavors. I would not call this an Italian restaurant...more gourmet American with an Italian twist. The few cocktails I e had were fabulous. Don't go expecting much from dessert...entrees and cocktails are their thing. Be prepared for a very noisy interior."], ["Taylor M.", "Everything I ever had here has been awesome, and I've probably been 20-30 times. A few of my favorites: scampi, ragu, any of the pizzas, the charcuterie boards... I often go with the specials, which are always fresh and delicious!"], ["Rick T.", "Well can't believe I haven't tried this place out as it is pretty in my backyard or really close to me. We arrived as they opened the doors and we were sat down and given the menus. We had water which was lukewarm and not ice old as I like it to be served. Then I ordered Buffalo chicken livers, they tasted great at only 8.00 for an appetizer I thought was good. After that I ordered the wood fired beef tongue which was good but not great. The bread came out after i was on my second appetizer piping hot accompanied with balsamic vinegar and olive oil for dipping. My wife had their spaghetti something or other, I'm not good with weird Italian name dishes. The pork meatballs were huge and kinda messed up the noodle to meat ratio. It's a hearty dish that is well worth the 17.00 price. Really liked this place and give it around 3.5 stars because I would like the beer prices to be shown on the menu and it's kinda of expensive here. Don't get me wrong the stars will rise if I find better items to eat on my next visit. Would also like to see the place open at 4:30pm so people can post up to the bar and wet their appetite with some seasonal cocktails. But all in all I had a nice dinner here and plan to be back !"], ["Marquee A.", "Ok I officially hate this place. I tried it for a second time mainly because I had a gift card for the first meal they screwed up and thought ok it's an Italian restaurant how could they mess up pasta? Well they succeeded admirably. I ordered the Ragu bolognese and expected the beautiful shell noodles with a rich sauce that I saw in the pics. Wrong! What I received were egg noodles with what looked like canned dog food on top. It was totally dry and the noodles were like eating band aids . I understand now why the wine cellar is so extensive , you would have to be totally hammered to eat this crap. I'll never return."], ["Patrick K.", "First time visiting here. The first thing I noticed was how dark it was. My chair's back support was broken. The tables were too high (chairs too low). The waiter was awkward. I decided to get the Scampi di Rosso. The sauce was way too citrusy with too much lemon juice. Will not be coming here again."], ["Adam B. J.", "I've been to Rosso several times now, and it has yet to disappoint.  Rosso is a great place to eat.  The food is fabulous and the atmosphere is great.  Service is always great.  Your drink never gets empty, and they're staff is very knowledgeable about their menu (Food & Bev).  Recently had brunch there which I didn't know was an option.  It was amazing.  The menu has many farm to table options.  I'm a sucker for Bolognese and Rosso's is different and great.    I also love the seafood options.  Great place to dine.  Great place for a date."], ["Nick A.", "The atmosphere was all right I noticed when I first went in that it seemed clean I noticed they had a large wine cellar when we received our food a to go order I drove straight home within 10 minutes the food was already cold on the inside we ordered the steak and fries the steak was supposed to be medium well half of the steak was fat and the other half was rare bleeding rare I never knew a $33 steak was supposed to be half fat"], ["William B.", "Cool atmosphere.  Waiter was great.   My wife and I were very impressed.  My  bolognese, was awesome, and I loved the bread.  My wife got a vegetarian dish, and it was pretty good, but seemed to be lacking something; my guess would be the meat."], ["Danielle R.", "This is my go to place for special occasion meals. It's an upscale Italian restaurant with amazing food in a great location. It always makes me very happy to go. Usually I order the Chicken Parmigiana (my favorite Italian dish), which has been perfect every time--well cooked, crisp breading, served with garlicky fettuccine. The last time I went was for my birthday and I ordered the mozzarella fritters and the most amazing Ragu di Bolognese--a new favorite. It was amazing, extremely flavorful with perfectly cooked pasta. It was love at first bite. I considered proposing (to the chef or the pasta, I'm not sure, but the experience definitely left me extremely happy).The service is always very attentive without being obtrusive. As a side note, the chefs here also make and sell breakfast at the Soda City farmers market (or have in the past--I haven't been in a while) and it's always amazing."], ["Bailey B.", "Such a beautiful experience! Well done from service, dinner, and all the way through dessert. I greatly enjoyed myself and I will absolutely be back!"], ["Sarah S.", "This place is awesome! The location is easy to miss, nestled in the corner of Trenholm plaza. Once inside, the ambiance is very nice, seems upscale and they make great use of their space. The food is excellent and ingredients are sourced from local suppliers. My go to dish is their charcuterie board, which is a staple on their app menu. They also have a great wine selection and very competent bar tenders. What really sets this place apart from other places in Columbia is the service. I feel like I get treated like i'm related to the chef whenever I go ( i am not). The staff is very knowledgeable about the menu and specials, and can make excellent wine pairing if needed. This is probably my favorite restaurant in Columbia."], ["Dorothy K.", "Rosso is open on Monday night when most good restaurants in Columbia are closed. I ate dinner here recently with friends using a deal coupon that had come in the mail. Unfortunately they were out of the entree I had ordered from a list of 3 options. Without boring you with all the details, suffice it to say they were very accommodating of my dietary restrictions and threw something together that was delicious and also met myneeds. Nice wine list too--something for everyone."], ["Amanda C.", "Food was excellent as were cocktails. Fair prices for high quality."], ["Dee A.", "I made a reservation online with some pretty hefty requests.  I wrote that we wanted an awesome server and we drink a lot.  Somehow this place took my message and gave us the most awesome dining experience we've had in Columbia yet.  The restaurant is really intimate with low lighting and dark features.  We had a great table along the windows and the greatest server. We started with drinks recommended to us (I don't remember their names)  Mine was perfect for summer, really citrusy and not sweet and then a similar fruit martini that complimented my previous drink.  My boyfriend something like a fizzy mojito then another drink with this big-ass ice cube that he loved.  We also got their caprese salad on special with fresh mozzarella and a tangy vinegar dressing and the charcuterie board.  I asked if we could somehow get some pate on the board and not only did they do that they specialized it for us with salmon mousse, the pate special, sausage with a spicy mustard and a beet ketchup and what I think was pork belly.  So so so good.  We didn't just eat, we inhaled the entire thing.  I got the wahoo fish special and my boyfriend got the spaghetti and meatballs.  Nothing was left on our plates.  The fish was just barely done (which I like) and came with a citrus sauce and grits.  The meatballs were awesome and the sauce was thick and tangy.  I'm going to order that next time.  Our awesome server brought us a tasting of the housemade limoncello to drink with our tiramisu.  It was perfect.  The whole night was perfect from start to finish.  I can't wait to go back."], ["Alicia S.", "As soon as we arrived we immediately noticed the beautiful decor and lighting. However beside the check-in podium it's this eye soar of a storage area with random chairs and boxes. The management needs to clean out this area and maybe make it a waiting lounge for guest.The waitress was a little slow taking our order but she was very nice. The food was served hot and fresh. I had the salmon and grits and my husband had a pasta dish. Everything looked wonderful but honestly the food was very bland...."], ["Dale C.", "The food was excellent.  Service was prompt and attentive and answered all questions.  Started with the shrimp and sausage appetizer which comes with homemade bacon jam.  Excellent!  Steaks were. Cooked perfectly and the dessert was excellent."], ["Jen H.", "One of my favorite restaurants in columbia. You can ask to be seated outside (we had a baby in our party and they did not blink an eye!). The outside area is covered which is key. Inside, the dining area is one big space. They sort of partition some areas off but there is no private dining room or space.Love their cocktail selection. Pasta is great. The tagliatone is particularly good. Desserts were not so exciting to me-there is usually a standard tiramisu and in the summertime some sort of limoncello based dessert."], ["David C.", "Eaton W's review is spot on. I will try and piggy back off of his well written review. In terms of gourmet restaurants in Columbia, I think it's between Rosso and Motor Supply for who has the best food in town. They have a pretty epic happy hour from 4:30-6:30. I seriously know people who plan their Friday schedules around this happy hour. I have eaten here a half dozen times, the menu changes daily. I have never had anyhting less than an excellent meal here. As girly as it is, I am a huge fan of their Rosso-Tini, it might be a perfect drink.  The atmosphere is spot on with dark cherry wood and deeply hued shades of red pain throughout. The kitchen is semi-open: you can't see the kitchen prep tables but you can watch your pizza cook in their wood burning oven. My only complaint with this place is from time to time the service is spotty. Which is weird because the service at the other Niemi eateries is top notch. Still, who cares when you consider the quality of the food and the fairness of the price."], ["Melanie C.", "I'm a huge fan of Rosso. I've eaten there many times and have never been disappointed by the food. For antipasti, I highly recommend the risotto fritto. Although fantastic on its own, the fire-roasted tomato jam is a wonderful side. Next, the insalata di casa is a must! The greens are always crisp and fresh and the gorgonzola and glazed walnuts add wonderful texture. The citrus vinaigrette is amazing and (although I've tried), it just can't be duplicated. Amazing salad! For the main course, the chicken parmigiana is wonderful and is a perfect-sized portion. I've also had the rack of lamb and was pleasantly surprised not to see the mandatory mint jelly that everyone thinks makes the dish \"classy\". Instead, it was dijon grilled and tender enough to cut with a fork. Yum! If you are looking for a vegan option, the maltagliati is a good choice if you don't want the typical pasta and marinara dish. It was light and filling, but honestly, I would call it more of a soup rather than a pasta dish. Next, I've read some negative reviews on the desserts, but I've found them to be delicious and not bland as other reviewers have said. I think some people just aren't used to authentic Italian desserts as we here in the USA are used to our sweets having ridiculous amounts of sugar. The Italians know how to make their sweets without causing diabetic comas. Finally, the wine list is fantastic and the decor and ambience makes it a great place to enjoy a meal. It should also be noted that they partner with local farms and co-ops for their produce and use organic, free-range chicken so if supporting local farms and sustainable farming practices is important to you, then this is another incentive to try Rosso."]], "Ristorante Divino": [["Ron V.", "Based on yelp reviews we decided to give this restaurant a try after 12 years living in Columbia!  We went here for the first time Friday night.  Complementary valet parking awaits you right in front of the restaurant and eases the pain of finding parking.  We had reservations for 7:00 but arrived about 25 minutes early and were immediately seated.  I guess it may have been a little early but the restaurant wasn't too busy at this time.  Not sure if this is normal or not for a Friday night.  The restaurant is smaller than what I expected, but the atmosphere is great.  Nice lighting, tables and booths, and a it is just right for a nice dinner or a more romantic setting for a special occasion dinner.  Not too loud and you can actually hear the person your with as compared to some of the other spots we've been to.The wait staff was excellent.  Our waitress was Casey and promptly greeted us and took our drink orders. They have a nice selection of wines on the wine list and she brought out waters, fresh hot bread with olive oil/pepper dipping sauce.  I wanted to order the calamari, as most yelp reviewers had given high grades for, but when we heard the Bruschetta description we ordered it instead.  The Bruschetta came with four crustinis; two with an avocado spread with tomatoes on top and the other two had a boursin/goat cheese spread with pulled pork meat from pork shanks on top.  Both were good but the pulled pork/boursin cheese was by far our favorites.  We would order this again in a heart beat.The Wedge salad looked appetizing but we passed on a salad since we had the crustini. My wife went out of the box and ordered the Parpadelle with a wild boar bolognese sauce.  She is not a big beef person but based on the waitress recommendation she ordered it.  I had a hankering for spaghetti and meatballs earlier in the week and decided to got with that.  I generally do not order spaghetti and meatballs and was tempted to try the short ribs or the gnocchi.  The waitress hadn't said anything about the spaghetti prior to me ordering it, but when I placed my order she said \"We have the best Spaghetti and meatballs in the city\".  Our entrees came very quickly.  To my surprise my wife loved the Parpadelle. I tried a bite of it and it was extremely good.  There was a taste that was unusual and after talking with the owner that came around to our table he said that they cooked the boar meat bolognese and add cinnamon and nutmeg. That was the taste that I recognized once he said it.  We both would order this again.My spaghetti came out and looked great. The meatballs were very tender and are made with the traditional veal, pork and beef mixture with a lot of spices. They were mixed with the spaghetti and had a little melted cheese (I believe mozzarella) over the top.  This truly was the best spaghetti and meatballs that I've had in Columbia. My wife tried a bite and also said it was excellent.We had to pass on desserts for the evening.  Total bill was $78 and that was for 3 glasses of Chardonnay ($8/glass) (not including gratuity).  We decided that this was one of our favorite restaurants and will definitely go back for special occasions."], ["Jane E.", "Quiet and upscale, but comfy in the busy downtown of Columbia.  Take advantage of the valet parking. An excellent wine list and the best PEI mussels that i have ever eaten!  Excellent seafood and a diverse menu for omnivores. My only disappointment was the lobster bisque."], ["Ali H.", "The lobster bisque was nothing to write home about, but the filet mignon was EXCELLENT -- tender, perfectly seasoned, and cooked just right. I got it without the goat cheese on top and I don't think I was missing out, but my companion had the cheese and liked it. The server was wonderful as well! Will definitely return in the future."], ["Shannon K.", "My husband took me out for dinner here last week. The food is splendid, the rack of lamb cooked medium rare was spot on. The bartender though, she has a rare talent and made a number of delicious beverages for us throughout the evening. If you've an opportunity to take an evening out and want to try something worthy of a fine dining experience I'd highly recommend giving Divino a visit!"], ["Angie W.", "The new chef/owner makes this place all the better. We enjoyed our date night with friends and felt comfortable. We had lobster risotto and spicy shrimp linguini. I hate to say it but I don't remember the wine we had (although it was amazing) nor do I remember what my friends ate (although they both loved their dishes).Great evening."], ["Vida J.", "Nice evening out with girlfriends. Ordered two appetizers the stuffed peppers and an Italian sausage and pasta special. Both were superb. For my entree I enjoyed rack of lamb and lightly sautéed spinach. I also sampled stuffed trout, spaghetti and shrimp scampi from the others. This is worth a repeat performance!"], ["Erika K.", "I really enjoyed my evening at Ristorante Divino.  It's one of the pricier restaurants on Gervais, but you get every penny's worth both in quality and quantity of food.  Because of that, I definitely recommend you go hungry because you'll want to try out all the courses and otherwise won't have room.  To start out, I enjoyed the insalate divino and gazpacho (the soup of the day).  I'm used to portions being small at nicer places, so I was pleased that both the soup and the salad were satisfactory portions.  I loved the salad.  I could tell everything in it was fresh, and appreciated the juicy strawberries.  I'm not sure what the dressing was (it tasted like it had pesto in it), but it was delectable.  The gazpacho was right on point- not too garlicky and chilled to just the right temperature.  My husband enjoyed the calamari appetizer and a bowl of bisque.  The calamari plate was a generous portion and I would say you could share it easily with a party of four.  We ended up taking home the leftovers.  The calamari came with two sauces: marinara and pesto.  We both assumed the marinara sauce would be our favorite since that is what is typically enjoyed with calamari but the pesto by far took the day.  I liked that it wasn't oily and greasy like other pestos.  I don't know how they make it, but it seems like they include more basil than most pestos.  In any event, I wish I had their recipe because I would eat their pesto with a spoon straight from the jar.  For my entree, I ordered the gnocchi with the pomodoro sauce.  The sauce had a sort of smoky, bacon-like flavor to it.  It wasn't bad, but just unexpected.  I'm used to pomodoro sauces having a tangier more tomato-like taste.  If you like smokier flavors then definitely go for the pomodoro.  I'll probably try a different sauce the next time (maybe I can get them to make it with their amazing pesto).  My husband is a big fan of seafood-based Italian dishes and really enjoyed his ciopinno.  We both polished off our entrees despite the fact that we were already full from our appetizers.  We had no room left for dessert, but the options sounded rich and delicious.  I guess we'll have to come back!  I also didn't have the opportunity to try out the wine menu since I'm currently pregnant.  I'll be back to try that out as well and will update my review when I do.  Other things I really enjoyed about the restaurant: complimentary valet service and the fact that both the manager and chef came out to chat with patrons and see how they were enjoying their experience- I liked that personal touch.  In terms of things where there is room for improvement, they definitely need to fix the air conditioner as it was uncomfortably warm inside.  Luckily we were placed at a table under the air vent, so that helped.  Also, they seemed a bit understaffed when we first walked in- it took awhile for us to get seated and get our waters and menus.  In their defense, we did walk in about 40 minutes until close, so this could explain the slow start.  Overall, if you are looking for quality Italian food for a special occasion or a nice evening out, you should definitely come here.  I know I'll be back!"], ["Patrice G.", "One of the most enjoyable evenings I've ever had. We sat at the bar with Jessica. One of the most educated and entertaining mixologists I've known in a long time. From recommendations of exotic cocktails to pairings of wine for appetizers. She was dead on each time. We so enjoyed our seat that we declined to be seated in a booth. All the waitstaff and maître d George made a point of coming over to make sure we were taken care of. Our meal consisted of the charcuterie platter, baked oysters, duck salad, and mussels as our main course. The suggested cheese platter was the perfect end for dessert. Whether a local or visitor in town, you can't miss a visit and a meal at Ristorante Divino."], ["Samantha A.", "I can't say enough about how wonderful this place is. It's our favorite special occasion restaurant in Columbia (we go every New Year's Eve). This was our first time dining there now that it is under new ownership, but we weren't disappointed. We started with a scallops appetizer. It was delicious,and the scallops were the most perfectly cooked I've ever seen. Next, my gentleman friend had a lobster bisque (which he annihilated). I had an arugula salad with roasted beets, fried goat cheese, and a lovely lemon oil dressing. It was divine, and I'm not even a fan of beets or goat cheese. For entrees, I ordered the Veal Chop, which was huge and cooked to perfection with a gorgonzola crust. He had the lamb, which was also excellent. We also had a few specialty cocktails before and after dinner. They were delightful.The ambiance and service at this establishment is unmatched. From start to finish, we were treated like royalty (they even let us switch tables because I was cold). They were super busy because it was New Year's Eve, but the staff handled the crowd with grace and ease. We will see y'all soon!"], ["Marc S.", "Looking for an elegant dining experience where food is art on the plate and a ballet on your tastebuds ?  Look no further than Restaurante Divino.  No matter what dish you order - even if you can't come close to pronouncing it correctly - not only will you not be disappointed, but you will sing its praises at length with anyone & everyone who will listen !  It doesn't have to be a special occasion - any night will do, but arrive with an appetite and an open mind.  You are guaranteed to leave this amazing establishment with your head, heart, & stomach all full and very happy..."], ["Laura L.", "Had dinner at Ristorante Divino last night for the first time, and what a great experience it was. From the valet guy to the chef, the service was impeccable. The entire staff was extremely hospitable. And the food and wine did not disappoint. We started with the calamari appetizer then I had the wedge salad while my mom had the special for the night, an arugula salad with roasted beets, fried goat cheese, and a blood orange vinaigrette. The wedge salad was very good but the special was to die for (I mean friend goat cheese, come on.) For our entrees, I had the duck while my mom had the Lobster Fra Diavolo, both were excellent. I also recommend the salted caramel torte for dessert, it too was amazing.For the quality of the service and the food and wine, prices are very reasonable. I would be willing to say that this is the best dining experience I've had to this date in Columbia. And to top it off, the chef supports local farmers and producers, a big plus!"], ["Adam B. J.", "I've only dined twice at Restorante Divino, but this last trip had me wanting to go back the next day!  First let me say that this has that old school fine dining feel.  They know who they are and what they do and run with it. This is great Italian food, not total Americanized Italian.  It's not new, it's not trendy, it's just stinking good.  We started with the mussels as an appetizer.  The saffron broth was amazing.  I could have ordered a second order as my meal, but I opted for the cioppino as did my friend.  Our wives both got the Scallops.  (All of the special's sounded great, but I'm a sucker for cioppino).  The cioppino was one of the best I've ever had.  Two jumbo scallops, two or three jumbo shrimp, tons of calamari, more mussels, and two large grouper filets in another delicious saffron broth.  AMAZING.  I wanted to go back the next day, and the next, and the next.  Our wives' scallops were good, and the spinach dumplings were to die for, but compared to my cioppino I won (I had two perfectly cooked scallops in mine).   We finished with espressos and shared a creme brulee.  Perfect ending to a perfect meal."], ["R R.", "Again....Divino met and exceeded all expectations! From the duck I had to the steak my friend had, this visit beat my last.....I'm also telling you the buzz you feel here (Dan Marino...never got a super bowl ring but should of and Dick Vitale from ESPN all here in the last month) does not feel like Columbia SC.....trust me when I say its a great experience....."], ["Charles G.", "One of worst entrees I've ever had.Ate at Divino last week and ordered their Cioppino, which I have had many times before. In the past, it was OK -- not nearly the best version compared to restaurants in New Orleans or Charleston. This time, however, it was inedible: the fish pieces were as hard as a rubber eraser. Not wanting to interrupt the flow of the meal, and feeling pretty full from other courses (which were not bad), I ate around the fish (the mussels, shrimp, pasta and sauce were OK). When the waiter asked how the meal was, I told her the truth, and even asked her to take the fish pieces back to the chef so he or she could see what they had sent out. A manager did come out and apologize, and they subtracted the amount of one cocktail from the bill (I did not ask for any kind of compensation). All four of us at the table felt this response was inadequate, given the magnitude of the problem. None of us will consider this a top Columbia restaurant in the future, and it is doubtful we will return. There are much better choices."], ["J M.", "I'm from Miami and my husband it's going for 8 months to afganistan so I came to visit him to Columbia , SC and we decided to walk around the city and we where looking for a nice place toHave dinner We end up in Restorante Divino we didn't have a reservation we set at the bar with Jessica the bartender she was amazing she offer some amazing drinks and we had a blast . It was perfect ... The food was more than delicious the bread the soup the wedge salad , spaghetti and meatballs where more than amazing we are in love with the place ! The manager or owner of the place was so attentive ! Really recommend this place Great service"], ["Brett F.", "Great restaurant! The staff and food are both equally amazing. The new owners have kept the traditional favorites of this Columbia establishment and have added a breath of fresh air at the same time. The only thing I can say is that its even better than it was before. My personal favorites are the Charcuterie Plate, Lobster Caprese, and Pappardelle Bolognese, and I've never been disappointed by one of their specials."], ["Lee C.", "Everything was amazing! Started with the gnocchi Gorgonzola and shared the veal chop and the scallops!"], ["John C.", "We went there last Friday night without reservations on the night before the South Carolins / Georgia game.  We didn't mind the 1 1/2 hour wait because we were in good company and wanted to catch up since we only get together once a year for the game - but seriously get reservations!  The owner made us very comfortable, we did get seated, and we closed the place.  But the food was worth it.  We all enjoyed our meals and even had dessert.  I gave it 5 stars because of the food, service, and atmosphere.  We will get reservations next time - especially on a night before a USC football game."], ["Vince W.", "So sorry my review isn't a five ! Our meals for four people - lobster risotto, veal marsala, pappardela (however it's spelled) fabulous mussels, something I've forgotten and my wife's \"favorite bread I've ever had\" were absolutely excellent as was the service by Jake D. We had reservations for 5:30 so there were very few customers and the staff weren't distracted BUT our wait for desert was unexpectedly/unacceptably long. I hope the place deals with this issue, if it wasn't some anomaly because it detracted from an otherwise absolutely great meal."], ["Katharine K.", "This is the best restaurant in Columbia in my humble opinion. We have had a great relationship with this restaurant for years, and I have never had a bad experience. We are always greeted by name and treated very well. Fulvio, the chef, never disappoints, and the cozy atmosphere only makes it better. The only place to find food more authentic than that served by Divino's would be Italy itself!"], ["Tania S.", "It was like eating in a hotel restaurant in the 80's. The food is mediocre. I would never eat here again."]], "Schiano's Fast Casual Italian": [["Kel B.", "PROS:This place has really good pizza! I love the cheese and pepperoni! Best pizza in town now that The Whig doesn't sell pizza anymore! Their philly cheesesteak is also SOOOO GOODCONS:I do not recommend the pepperoni lovers - It is waaaay too greasy with so many pepperonis on it. Just get plain pepperoni.Also, the dude behind the counter is always a little creepy and unresponsive, but whatever."], ["Chris S.", "It was decently fast and certainly very casual. While the meal was half way decent, the service and staff were deplorable. Skip this place and head up the road to The Pizza Joint (or anywhere else) -- I wish I had.I walked in to a cashier slouching all over the register. I told him it was my first time with them and I wanted to know how everything worked. He said, \"you order here and sit there (pointed finger).\" Clearly he didn't want to be there. I then asked what their most popular items were on the menu. He said, \"the pizza.\" Clearly he didn't want to be there. I ordered a medium pepperoni, mushroom and onion pie along with cheese bread and marinara sauce with an unsweet tea.He handed me my change and a styrofoam cup and said \"Here's your cup and your number. Enjoy.\" Clearly he didn't want to be there.I pick a table and walk over to it while I wait for my order. The table is set and looks clean. There were three different televisions to watch, which was nice.Apparently it's a \"fill your own cup\" type of place. So I did. I was never told this, even though I was a first time guest and even said as much. I sort of waited to see if someone was going to do it, and I eventually just got up and did it myself. At this point, clearly no one wanted to be here....The cheese bread was actually nicely done with a light crunch on the crust but not burnt at all. I enjoyed it. The pie I ordered came out shortly thereafter and was just \"ok\" by any standard. There was certainly nothing wrong with it, but I found nothing unique about it either. Throughout the entire meal I was approached twice by two people and clearly neither of these college-aged individuals wanted to be there... In fact, one (the same man who took my order at the register) was complaining to the other about cleaning a table. She complained back to him. Clearly they didn't want to be there.When I walked in I actually wanted to be there, but by the time I was done, I, along with their front of house staff certainly did not want to be there. Also? The takeout box was so flimsy (super thin cardboard -- NOT a regular pizza pie box) I nearly dropped the thing. I can't stand it when restaurant owners get cheap and cut corners on necessary things of this sort. The only reason I didn't give one star here, is because the food wasn't terrible.**Update** the pizza pie and cheese bread do not get better overnight. I took them both home and immediately put them in the refrigerator -- I have a penchant for cold pizza pie while I watch The Today Show in the AM. I'm disappointed in this one. Pizza Hut Lover's line tastes better, if that tells you anything... The review is super close to being a \"one star\" as a result..."], ["Lydia S.", "Love me some Schiano's. Always have, always will! Strongly encourage you getting your food to go. They are perfectly nice folks, but dine-in customers are just not their thing."], ["Taylor S.", "This place has great pizza.  Picture the pizza that the teenage mutant ninja turtles ate (where the cheese on the pizza stretches as you pull away from each bite).  Yum, it was delicious! I would definitely recommend this place to friends, and I'll definitely be back!"], ["Mackenzie S.", "Good pizza at a reasonable price. They have a by-the-slice option, meaning everyone can get exactly what they want. No complaints here--I'll definitely be back!"], ["Joanne C.", "Food and service was goodParking lot was large to accommodate our large truck and trailerWe had an antipasto salad and a chicken parmesan. There was a ton of foodService staff was excellent and cordialThere were six or seven large TVs to watch sports and there is a bar. My only complaint is that the food need more spice and the waitresses should put their hair up when working with food!"], ["Amanda S.", "The best pizza in the forest acres area! We go about once a week and have never had a bad experience."], ["Angelina R.", "Very pricey...and they are 5 minutes from a military base...all the eatery places around them give military discounts...not saying we are entitled to discounts but we bring in most of your businesses currency...when I approached the manager/owner on why...he gives no discounts he had no valid reason...than he said I don't think military come here...I stated yes ..that's where I got the recommendation...he just stared and had nothing to say....very rude...won't be coming back!!!..."], ["David O.", "Been a customer for well over 30 years and have never had a problem. Great food and service. Most authentic NY style pizza around. Both locations are equally great!!"], ["Josh H.", "Schiano's pizza is ok. I personally like more sauce on my pizza, along with more grease. So if you don't like a lot of sauce and you like a drier pizza maybe you'll like schianos. And the crust I dunno just felt a little too \"crackery\" to me. The staff at least when I visited did not have the bubbliest of attitudes. But at the end of the day it was still pizza and you know what they say about pizza."], ["Eileen S.", "No one can complain about this pizza its the best, I guess people in the south do not know real pizza they are to used  to fake pizza like pizza hut etc. This is real good pizza only place I go"], ["Randy F.", "The whole experience was average. Pizza was good. The chicken fingers were good. One size for the drinks. They have a place to eat outside and tv to watch with sports. Im rating an 3 star just on it being average and nothing that really wowed me here."], ["Amber G.", "We came here for lunch because neither my husband nor I had been in a Schiano's in years. The location of this Schiano's is good, and the interior seemed clean and well-maintained. My husband ordered a pizza, and I asked the young man behind the counter if I could order a Stromboli (or \"boli\" as the menu labels them) with pepperoni instead of whatever came in them. The cashier yelled back to someone in the kitchen and got confirmation that it was possible. It took a little while to get our food, but not distressingly long. I was served a ham calzone instead of the pepperoni stromboli that I ordered. I pointed this out to the young man who had taken our order and he seemed almost angry, loudly insisting twice \"you said ham!\" I replied that no, I did not order ham, as I don't even like ham.  My husband agreed.  The employee begrudgingly took the wrong order back and came back after another moderate wait with a pepperoni calzone. I didn't argue the calzone vs stromboli point (because, honestly, who cares?). The food was fine--not outstanding but not terrible. I'd be willing to give the employee the benefit of the doubt. Maybe he was having a bad day?  While his reaction tothe incorrect order left something of a bad taste in my mouth, it wasn't a negative enough of an experience that I'd boycott the place or recommend against coming here toothers."], ["Joe R.", "Love the forest drive location!!! Great Service, never had a bad meal there!!!"], ["David Y.", "Our experience was GREAT! Sunday night, we were looking for a pizza place on Forest Drive(passed up 3 others) and decided to stop in at this new Schiano's and man-o-man was this a meal to die for. My wife and I opted on a family sized(too huge) special calzone and my son had a simple piece of cheese pizza. I'm a transplanted yankee from NY and I can't remember a better calzone.? It was created and cooked PERFECT! Keep up the great work guys! I can't wait to go back."], ["Jamil G.", "HAIR IN MY FOOD! I inform the waiter kindly and pointed at the hair! He comes back to me stating, \"I will warm it up?!!!\" I explain to him there was hair in my food and he replies \" I can't see\" WOW! Manager comes by to see me about the issue. Manager stated, \"I'm making another one.\" \"?\" BTW. He DENIES he saw anything and I said to him, \"would you like me to get it for you?\" Manager replies, \"what do you want?\" He just returns my money for the entree. Let's back up... salads were late, waiter ask why I did not get them earlier? I don't either, let me ask the waiter??? I don't know if it's me...color of my skin? There was only one family and two couples and its Friday, last and late to be served.  I was with my Family. I attempted this restaurant before, same meal...totally different.  Something to think about... NO SIGN IN BATHROOM, \"EMPLOYEES MUST WASH THERE HANDS!\" Maybe this restaurant will read this and make it happen.  Overall: SELECTED SERVICE, POOR ATTENTION TO CUSTOMER NEEDS, AND POSSIBLY UNSANITARY! No hairnets in the kitchen to include manager!!!"]], "Olive Garden Italian Restaurant": [], "J Peters Grill and Bar- Columbia/ Forest Acres": [["Sam E.", "Food and service were excellent. I was here on business looking for a good steak, good beer selection and TVs to watch Monday night football. This place had what I was looking for!I decided to go with the prime rib and it was tasty! It was huge and whatever seasoning they used was excellent. The house salad was awesome and I couldn't even finish the loaded baked potato, but the bite or two I took, that was great.Excellent draft beer selection, and the bartender was so attentive. I would recommend this fine establishment to anyone and will return if I am ever back in the Columbia area."], ["Jeff H.", "So I'm not sure what happened, but the quality of the food has taken a turn for the worse. We've gotten take-out two times recently and were pretty disappointed both times. I got the club sandwich which included processed cheese product instead of real cheese. That was unfortunate to say the least. I then decided to return to the chicken finger platter only to discover that they're using completely different tenders now. These tasted more like the frozen ones you buy from Trader Joe's or can find at Zaxby's. Not sure what's going on but probably won't be going back anytime soon."], ["Rachel O.", "This place is like the less sophisticated little brother of California Dreaming. I'm pretty sure most of the food is the same but it's more sports bar-ish and casual than I feel at California Dreaming.  It was busy and people seemed to be having a good time. I ordered the J Peters Salad. It's the exact same thing as the California Dreaming salad. I'm totally OK with this. In my opinion, most salads should be like the CD salad because it's ridiculously delicious. I'm also excited because J Peters is much closer to my house than CD so I can get on the regular. My friend and dinner companion for the evening wanted a grilled cheese sandwich. This was only listed on the kids menu. She offered to pay more for it because it's really what she wanted but the waitress told us it was against their policy to serve kids menu to adults.  So eh. Overall it seems like a cool place to hang out, watch a game, grab a drink and nosh on that tasty salad (you know you really want that honey croissant)."], ["Laura S.", "I've tried this restaurant now 3 times, and I've yet to have a 4-5 star experience.  I've eaten at similar restaurants, with much better food.  Appetizers on first trip had no flavor and were not at all as the menu described (frozen product and just plain melted cheese); second trip they were out of salad toppings for the J. Peters Salad (I only got lettuce, cheese and meat... and alot of it) and last trip has resulted in bland food.  I was hoping good things as I hear good things about the Chapin restaurant, but a no-go for me."], ["Gary G.", "Standard steakhouse food. Nice salads and homemade fries. Good service as well."], ["Nat C.", "Sunday brunch with the girls was fab. Let's call a spade a spade...It's similar to Cali Dreaming. Yes, croissants, hot bacon honey mustard dressing on a loaded salad, she crab soup similar. The service is great, bartenders attentive, and atmosphere nice. Loved the cheese dip with jalapeno.Great house salad.Fish sandwich was very nice.Spicy shrimp was delish.Wraps are huge.Best loaded mash ever.Planning to try the steak next time and the quesadilla for app."], ["Ron V.", "We went here Friday night for the first time.  My neighbor and I both ordered the Prime Rib sandwich, which everyone has been raving over.  I also tried the She Crab Soup and he had a small house salad with thousand island dressing.  My wife ordered the house salad with balsamic dressiing and the She Crab soup.  His wife ordered the house salad with the house honey mustard dressing and the potato soup.I thought the prime rib sandwich was good, but not great. It had a load of sliced prime rib on it and a  slice of cheese along with a large containier of Au Jus.  My wife took a bite of it and didn't like it, saying it had too much fat in it, which I didn't really see.  The taste was just so-so.  My neighbor really didn't comment on his sandwich, but finished it.  He said the salad was very good.  My She Crab soup was also good, not great.  But I'm comparing it to some fine restaurants in Charleston (82 Queen).... I thought it could use a little more Sherry taste in it.  But the consistency was good, not too thick and not too runny.  My wife said the same thing about the She Crab soup, saying it was adequate but also needed a little more taste, such as the Sherry that I had mentioned.  She didn't finish the soup.My neighbor loved her salad and she ordered it with the honey mustard dressing, which is the way to order it.  They also got the croissant with the honey mustard glaze similar to Cal. Dreaming has with their salad.  Very good.  She ate about half of her potato soup and said it was good.Our server was very good, prompt and kept coming to check on the table.  Atmosphere is sports bar and a little lout (to be expected) but nicely decorated.  I doubt if we would go back based on the menu. They do have steaks and two selections of fish that can be ordered grilled or blackened, but the selection was either Mahi Mahi or Salmon.  All the other fish was fried.  They didn't have any shrimp dish that wasn't fried.  Some of the appetizers sounded good but I doubt if any of us would return based on the menu and what else is available in town."], ["Sherry C.", "Yum!!!! This place is so good. I can't wait to go back and try more items because I had such a hard time picking out what I wanted to eat. The menu has so many great things to choose from. Just make sure you come here hungry. Portions are large. I had the house salad with the dressing on the side. AND it came with a croissant with honey on it for starters. ....... That was a meal in itself. I had to make myself quit eating it so I'd have room to eat my steak. Nice fresh salad!  Then I got the Prime Rib cooked medium ....... It was cooked perfect!  So tender, so tasty, and very little fat. It was a good piece of meat. I also got my baked potato with just butter and chives. It was so good, I even forgot to put on the salt and pepper. The service was excellent. Our waitress was great and she was very familiar with the menu and had many recommendations. I couldn't have asked for better service!All I can say is that this is a GREAT restaurant.  Lots of choices on the menu. I can't wait to go back!  I'm definitely giving it 5 stars!"], ["Sandra F.", "Food was okay, I ordered the prime rib sandwich since the bartender recommend it but I wasn't super impressed. It was okay but the service was great. Good uncrowded place to watch football. I would recommend this place."], ["Adam B. J.", "I had eaten at the J Peters on Anderson's Main Street with family a couple years back, so I was pleased to hear they opened a Columbia location.  Think California Dreaming, with a cheaper price tag.  Our food was great.  Service was spot on, and our wait was minimal on a Friday night.  The menu is large, so everyone can find something they'd like.  The Tuna sandwich was SUPER.  Cooked perfectly.  My wife had a buffalo chicken sandwich which was also good.  The side salad is identical to California Dreaming, and was great."], ["Jana M.", "The food here would have rated more stars but the music was so loud that the dining experience was horrible. The service was good and the food was also. I have been eating there  every couple of weeks since it opened but this latest experience has made me rethink my choices. If I return it will be for takeout.  Glad I did not take friends as we would have had to scream at one another."], ["Jim S.", "Today for lunch I enjoyed the best Blackened Tuna sandwich that I ever had and was delighted when it arrived so very fast. It was perfect seasoned and cooked to perfection w/side of vegetables with a light garlic butter sauce.This is my kinda place to enjoy a fine meal...You can't go wrong here! This place is great!"], ["Gina F.", "The food was pretty good and we got a lot of it but our waitstaff was not friendly at all. He wouldn't even make eye contact. He got our drinks messed up and spilled food on us. Edwin really needed to step up his game!"], ["Amelia R.", "Great food.  Very much like California Dreaming but better.  The salads are great too. Glad to have this addition to Forest Acres!"], ["Paula M.", "Hi. I was there Tuesday night for dinner. I had the shrimp n flounder plate. My husband had the rib plate. My son had the J Peters Chicken. We all had loaded mash potatoes and they had sour taste. The shrimp was very salty. The flounder wasn't cooked thoroughly. The chicken plate just didn't taste good to my son. I appreciate that you are giving 10% active military  discount since my son is a Captain in the Army. My husband is retired after 22 years. Thank you for that. P Mills"], ["Jerry C.", "Yikes, My 1st review... The food and service were wonderful!!! You have to have the Prime Rib sandwich!!' Excellent!!! Everything was fresh and delicious from the house salad to the chicken salad wrap! But the star was that Prime Rib Sandwich!!!!"], ["Jennifer T.", "Great service!  Cheese dip leaves much to be desired plus some (not all) of the chips were stale. The prime rib sandwich was fabulous. We should have ordered a side salad. They looked amazing!"], ["Josephine A.", "Come hungry! Their portions are very generous and the food is tasty. Their salads are amazing and I can eat those honey butter croissants all day!!! Delicious ribs but nothing crazy out of the ordinary. They fall off the bones like their menu promises. Great atmosphere to hang out with friends."], ["T D.", "Really enjoyed my meal here. Prime Rib was excellent along with the salad and croissant that came with it. Will definitely visit again."], ["Mark B.", "The food is great and the service is very good.  I got the J Peter's burger and cheese mashed potatoes.  The cheese they put on the potatoes was exceptionally good.  The burger was big enough to divide with two people.  I will be back."]], "Villa Tronco Italian Restaurant": [], "Tazza Kitchen Trenholm Plaza": [["Daniel H.", "Amazing service, amazing food! The crab cakes are fresh, bold & sweet all at the same time! Courtney the bartender is knowledgeable and friendly The care that is taken to give you a great dining experience is unparalleled! Sit at the bar and you will be super glad you did I've been outside, wonderful, at an inside table, great atmosphere, & at the bar, entertaining!"], ["Brandy B.", "I've been 3 times now.First for the soft openingSaturday for dinnerToday for lunch Overall each visit has been pleasant (staff friendly, wait for food... decent), but the food doesn't really hit a homerun for me.I've tried pizza, various salads, tacos, soup... And never crave to go back.The salads are salads - the greenage is fresh The tacos - I had the fish taco on the soft opening and the tortillas and juices from the slaw just weren't a good pairing (falling apart)The pizza - prob the best thing I've had hereThe soup - first time trying a \"gazpacho\" style soup and I didn't really like itI love the location and decor... But that's it.Maybe I'll return somewhere down the road... if a friend insists on going (what happened today) or if there's a change on the menu."], ["Nicholas S.", "I've been back to this place multiple times over the last two months and it just gets better with every visit. I have yet to eat here for dinner, but I've tried every sandwich on the lunch menu and all are stellar -- the BLTA and Italian are the standouts. Service is friendly, attentive, and fast. Presentation is immaculate and taste is even better. What else could you ask for? Atmosphere and ambiance continue to be top notch all at a price that won't break the bank. My new favorite spot on this side of town and definitely in the top five overall."], ["Amie B.", "Tazza Kitchen always intrigued me passing by it. So today I decided to venture in on my lunch break and get a bite to eat. Service is spectacular, friendly, warm, and attentive. I had the shrimp tacos, and at $12.50 I was hoping it would be very good. I was right, the shrimp were perfectly cooked, slightly spicy, full of flavor, and the slaw was delicious. The simple side salad was very small but the flavor of the dressing was great. This would be a great place for a lunch date. I enjoyed my experience here."], ["Ashley H.", "Tazza exceeded my expectations and it ended up being a meal I keep thinking about! First off, our server Mary-Gervais made the experience fun and she stayed one step ahead of us the entire time. I had heard the service at Tazza was lacking at times, but our server as well as the management were on point the night we were in. We all started with a variety of cocktails, I made the Mexicali which was reposado tequila, agave, pimento aromatic bitters, yellow chartreuse, grapefruit, and orange. A tad sweet and delicious! I opted for the poppy Cesar salad which was killer but my friends kale salad with shaved grana padano and spicy chili lemon vinaigrette stole the show. My mouth is watering just thinking about it...Then the crabcakes with micro greens and some delicious lemon remoulade type dressing. The whole reason for our visit though was dessert, my friend raved ENDLESSLY about their chocolate budino. It's a chocolate mousse/ganache topped with olive oil, sea salt and toasted almonds. It's served in a mason jar, which is pretty cute. We were most likely freaking out our neighbors with our exclamations of unrequited love though. Sorry guys, a few mexicalis and some budino make me a happy gal!I will totally be back, maybe again this weekend because it's just that good."], ["Lauren O.", "Quaint & quiet little wine bar w a great beer & cocktail list, one of my favorite spots in town. The spicy sausage & honey pizza is absolutely amazing. The spicy & the sweet on the brick oven crust is impeccable. Maybe the best crab cakes in town. No filler, just crab, falls apart in at first touch with your fork. I've also had the brussels sprouts, poppy Caesar salad & the goat cheese skillet, all terrific."], ["Larry M.", "We eat out frequently. I would have to say this is one of the best restaurants I have eaten at in a long time. The service was excellent. The food was delicious. Everything was extremely flavorful and not oily or laden with grease. Tasted very fresh. I will definitely be coming back here every time I am in Columbia no matter which side of town I am on. The outdoor seating was wonderful had a beautiful evening. The vegetables done in the iron skillet in the oven's are delicious. I had the crabcakes and they were some of the best I have ever had. Prices are reasonable for what you get I think it is a great value for excellent food and service"], ["Rachel O.", "So I've actually been to Tazza twice but have only eaten there once.We arrived at 6:20ish the first time and was told that it would be a 10 -15 minute wait.  We waited.  22 minutes later we went to ask how much longer it would be and were told it would be about 10 more minutes. I understand having to wait.  But I'd rather they overestimate on the front end than give you a shorter time and then have it double or triple.  They did offer to get drinks for us while we waited and they brought around one of their margherita pizzas for us to taste while we waited.  I'd had a long day and just did not want to wait anymore. We left but with the intention of trying it again soon.  (This seating drama is why it's missing the 5th star but I feel certain that with a bit more time that this will become a smoother process.)Attempt #2 was last night. I met a friend there at 6pm.  No wait for a table. We were seated immediately.  We both ordered a drink.  I got the Dark 'n' Stormy which was super delicious - strong but not overpowering. My friend got a strawberry drink that was on special. There were big chunks of strawberry and lemon in it and a ton of pulp.  I tasted it and it was good but the pulp did not make for a great drink texture for me. The waitress was friendly and accessible but she also realized that we were catching up and gave us some space.  I really appreciated that. I didn't feel rushed for them to turn the table or anything. It was a kinda slow night in the restaurant so maybe that's not the usual but we hit it on a good night. We hung out for 5 hours and ate slowly and there was never any pressure. We ordered dinner. I got the garganelli pasta with fennel sausage. It was absolutely delicious.  I will order it every time I go now! The cheese, sauce and sausage were an excellent flavor combo and the pasta was cooked to perfection.  My friend ordered the margherita pizza. It's an incredibly thin crust pizza and she gobbled it up and seemed to enjoy it. \"I'm totally going to eat this whole thing!\" We split and order of the salted caramel gelato and almond and orange cake for dessert.  The gelato was rich and creamy and the cake was light and moist. Dark 'n' Stormy + Garganelli Pasta + Gelato & Cake = perfect meal!   Just do it."], ["Doug A.", "Nice little spot.  In from out of town, saw the hours expected a bit more of a lunch menu than a brunch menu.  But we survived and had some great drinks and meal."], ["Rae L.", "Great food.  Okra appetizer, fish tacos with crunchy quinoa, beet salad were awesome.  Peach dessert was scrumptous!  Not too much salt or sugar; which was a much welcomed surprise!  Will return just for that health consciousness on the chef's part!  Excellent taste, textures for the taste buds!"], ["Bailey B.", "We love going to Tazza Kitchen! The staff is always efficient and friendly. The food is amazing, hand crafted, and worth every penny. The prices are a bit more than chain restaurants and for good reason, you get what you pay for. If you are reading reviews to decide where to eat, try Tazza kitchen, you will not be disappointed."], ["Ron V.", "My wife and I went for the first time last Friday. We'd been to Cafe Caterra previously on several occasions and now that it's Tazza Kitchen we thought we'd try it.  Atmosphere is still like it was, noisy on the inside.  They don't have a lot of individual tables on the inside and so you are sitting either close to others in a bench/table type seating arrangement.  Looks like they have the same chairs outside that the previous place had.  The high metal chairs in the higher tables were very uncomfortable.As for the food, we tried the chicken wings and the Spicy sausage Pizza.  The wings were very good, spicy, and not like anything you'll see at Wild Wings or the other chains.  Served with a blue cheese sauce and watermelon/melon rinds.  I would go back for the wings.  The pizza had a thin crust and was nice and crisp...pretty good flavor.  The only thing we didn't like about it was the sauce was a little too sweet. They put honey on the pizza and that probably was what sent it over the edge.  I wouldn't order this one again.Service was good.  Price of house wine was $9.00 for a chardonnay....I think very expensive for a house wine.  We had two young couples sitting at the table/bench next to us and we noticed that they had to return two of their items for not being cooked enough.  The waiter did offer them free dessert for their inconvenience, however.My wife and I agreed that Tazza's wasn't too bad but we probably wouldn't put it high on our list."], ["Rick T.", "We started off with the meatballs and brick oven bread that tasted very good. Then we had some wine from Spain to wash the nice meatballs down the hatch. After drinking the wine we tried a desert called chocolate budino which is toasted almond , olive oil, flake salt that you mix in a pudding or mousse which is only 5.00 and tasty. We also ordered a crispy arugula potato salad for later and will be back to try more items here, so far so good."], ["Peri E.", "This a is pretty nice and urban still Greek place! I like the atmosphere and the bar area! I was on a work travel and this is one of the best lunch place I would add to my list. I had the BLTA and my partner had the Italian! Both were delicious and just the right amount of meat and veggies! I highly recommend it! Enjoy it!"], ["Robert V.", "My wife and I love this spot for its happy hour. The wines are excellent for the price, and you can't go wrong with the margarita pizza and chicken tacos. The outdoor patio is a great spot to chill out and enjoy a warm SC evening!"], ["Lana O.", "I really liked Cafe Caturra and was sad when I heard they were closing.  Then this place opened and I decided to give it a try.I have now been there for both dinner and brunch and my experiences both times have been really wonderful!I loved the pizza at Cafe Caturra, and decided to try the pizza at Tazza to see how it would stack up.  There are a lot of similarities to the menus (the pizza I ordered was almost identical).  Two thumbs up!  Thin crust, yummy fresh tasting ingredients.  I also really adored their cocktails - so much that I had two even though they were about $9 a pop!The brunch was similarly delightful.  Ordered the crab cake benedict and the breakfast pizza (why not!).  The crab cake was delicious, but I honestly think I preferred the breakfast pizza just because it was so cute and creative!  Their brunch experience would be 5 stars, but I found it really annoying that you can only purchase singles or half carafes of mimosas.  Not even a full carafe--really??Highly recommend.  Buyer beware -- there was a long wait for brunch on Sunday and they do not take reservations."], ["Roger F.", "You know how you sometimes have a mediocre experience your first time at a place, and you hope it gets better, but you're pretty sure it won't?Well it was awesome to be proven wrong by Tazza. A courageous, principled wine list that (gasp!) is actually composed with the food in mind, and not simply another mishmash of cookie-cutter Cabs and Chards to slake the ignorant palates of Columbia's patrician class. And an inventive, concise menu that offers a little of everything. All this and hip ambience to boot. Forest Acres was DYING for a place like this. So happy it's finally here."], ["John Robert B.", "I ate at Tazza Kitchen for the first time a couple weeks ago and it was so great! The atmosphere is trendy and metropolitan (which I LOVE), with stained wood, metal, and brick being the decor. The servers were knowledgable, friendly, and very attentive. The food was excellent - The three of us split the appetizer of guacamole and still had some left over. For my entree, I ordered the Spicy Sausage & Black Pepper Honey brick oven pizza, which was SO good! The spice in sausage paired perfectly with the sweet honey glaze that was drizzled across the pizza. I cannot wait to go back when the temperatures have cooled down so I can sit outside by the fire pit! If you're in Columbia, you definitely need to try Tazza Kitchen!"], ["DD R.", "I highly recommend this place!  The food was excellent and the service was even better!  The wine selection was great, the food options were unique and delicious!  I am going back again today; )"], ["Win M.", "my chorizo tacos were quite good if a bit oily, but the two people I was with had burned pizza and crab cakes. In fact the pizza crust was black almost everywhere and black in spots on the bottom. While we were told that it was normal, many people mention it, and that in the future we should say something before and it would come out less charred; I do feel like it was just an excuse. Before we left I had the opportunity to see 2 plates of crab cakes and a few pizzas- none of them were charred to the point that my table's was. I find it hard to believe that every one of those people said they wanted it cooked less."]], "Carrabas Italian Grill": [], "Alodia's Cucina Italiana": [], "Travinia Italian Kitchen & Wine Bar": [["Michelle b.", "Fantastic everything! My wife and I are celebrating our 7th year anniversary!  We wanted to celebrate somewhere close that we hadn't been to before.  Checked Yelp, o'course... Great reviews...From the moment we entered we were welcomed with friendliness and a feeling of being at home. I'm a little hard to please sometimes and I'm working on that, but I have not one complaint, only accolades!The atmosphere, music, decor and stonework bar were enjoyable and beautiful. We were early for dinner but this allowed a personal touch atmosphere. Wine recommendations were delicious. Bruschetta was not on the menu but they accommodated our request. This was outstanding. Dinner - fettuccine with Shrimp was light and flavorful. My wife loved it. I ordered the pine nut encrusted salmon. Cooked to my liking. The best salmon I've had for a very long time. So happy. Side was asparagus and a Caesar salad prepared to my picky taste. And our celebratory dessert... Tiramisu. Omg. It was the best we've ever tasted. Light and fluffy perfect ingredient proportions. An added bonus was we found an extremely \"Family friendly\"  environment. So glad we were able to enjoy our special dinner here. Thank you everyone!"], ["Gary G.", "Slow night and service and food is not great. The waitress was talking with co worker and ignored us. Our bread arrived just before the meal along with our drinks. We would have ordered more drinks if they arrived in less than a half an hour. Really bad management if they could not keep up with the few tables there."], ["Michael D.", "Atmosphere and food were both great!  The food was very fresh tasting and the staff was friendly and helpful. I will definitely be coming back again."], ["Andrea R.", "Dined here on a Saturday night with a group of 4.We arrived at 7:30pm and were told the wait was 30-45 minutes, we were lucky and snagged some seats at the bar. The bartender was quick and efficient. We only ended up waiting around 25 minutes.We were sat by the large window in the back so we could see into the kitchen, kind of cool. I checked in on Yelp and received the free order of nachos, yum! They were Italian style nachos, they came with chicken olives, an asiago cream sauce and scallions. The chips were homemade and so light, everyone enjoyed them.I ordered the lasagna and my husband ordered the shrimp fettuccine. My lasagna was delicious, the bolognese sauce was 80% beef and 20% pork (or something close to that, I had to ask). There was a lot of meat, I got at least one chunk with every bite. The pasta was tender and so gooey and cheesy, perfect! My husbands shrimp fettuccine was also great, the shrimp were really tender and had a great flavor. The sauce on the fettuccine was lemon based and great. I'd have to say I do think it's on the pricey side (my lasagna was $16) BUT it was great tasting. We ordered a few bottles of wine and really enjoyed ourselves. We will definitely be back!"], ["Jessica B.", "This is the place where my husband asks me \" if I could take you to any place for dinner where do you want?\" And I always say \" Travinia\"! Love the fresh bread and the nachos!!! Such a romantic feel and the waitstaff has never let us down!"], ["Justin P.", "Every time I come here for lunch I'm blown away. Excellent food and atmosphere. The Italian nachos are amazing!! Caesar salad with grilled salmon is my favorite."], ["Melanie R.", "Just had a wonderful dinner at Travinias tonight. The food was outstanding like it always is but tonight our server Chris took our experience over the top. He was very friendly, super knowledgeable about the entire menu and made us feel like we were his #1 priority. Just by asking him a few menu questions you could really tell how much he loves the food and servers like that are your best salespeople."], ["Lori J.", "This was the second restaurant of our trip. We wish we would have eaten here the first night so that we could have eaten here again. First off, the Nachos,the best thing We've  enjoyed in a long time. Our waitress was presious and we never needed anything. We shared  small plates my favorite being  the crab cake. We will be back in town next week with the kids and we'll need 2 orders of Nachos!"], ["Cherie R.", "Delicious food, great service and a nice setting.  I actually got engaged here shortly after we finished our delicious creme brûlée. It's our favorite Italian restaurant for dine in or carry out."], ["Nat C.", "Went yesterday for a work lunch and the food was great as always. It's a great spot with a lot of affordable options.  My only issues with this visit is that while the did a super fast job accommodating our party of 9, the food order took about 40 minutes to get to the table.  That's excessive even for a large party.  Also the waiter was a total scatterbrain.  Probably just having a rough start to the day, but he brought a couple of people the wrong drinks and twice poured water into my glass of club soda.  Definitely go and enjoy, just make sure you are not in a hurry!"], ["Grant C.", "The food was great, and the waiter was very nice and came at the right time."], ["Lawrence P.", "On a recent trip to Lexington, South Carolina, we stopped in for a pasta dinner.  And we were very pleasantly surprised!!!This area of South Carolina is not exactly crawling with \"finer\" dining options.  Travinia fit the bill!!!  The décor is pleasant.  It screams comfortable.  We ordered the Zucchini Fritte which is a must have!  Great starter!!!  The gnocchi (we had appetizer portion) was excellent as well.  As a group we ordered the Lasagna Bologniese, the Rigatoni Short Rib and the Cioppino Amalfi.  All three dishes were well executed with the lasagna being my least favorite.  The rigatoni was just perfectly cooked and the short rib was... well... perfect as well.  Personally, I ordered the cioppino which is basically lobster, shrimp, calamari, local shellfish, and white fish simmered in saffron tomato broth, on a bed of pasta.  Fresh and perfect!!!  As for the wine list, they had a pretty good selection.  Again, I didn't feel like this area had too many restaurants to choose from.  To find this Italian gem and top it off with a wine list that had Caymus for only $100... again, pretty perfect!!!"], ["WanderLustinDani P.", "Sighhhh, I was recommend this place by a co- worker, so here is my honest opinion...The waitress really couldnt explain the food. When I received my dish, it wasnt what I expected. It was stuffed seafood that looked blended and stuffed into pasta shells. The atmosphere was nice, great ambiance. Presentation of the food was Excellent, jus not the taste. A host of items were on the menu. The shop is both clean and tidy, having plenty seating. The hostess/ waitress was attentive at all times. Staff members there greeted us in/ out when we left.  Im willing to try again a different item next time."], ["Omar T.", "Nothing special, but the decor was top notch and the service very attentive. We started with two Caesar salads and the lettuce was brown, so obviously it was cut ahead of time or just old. Definitely not what we would have expected. Even at chain restaurants we've managed to get salads with lettuce which wasn't brown, but we communicated it to our server who apologized. My husband had the Veal Piccata which was nice and I had the Sole which was AWFUL. I couldn't add enough salt to make it flavorful, but I tried. I didn't tell the sever as she already comped my husband's salad and his wine due to the brown lettuce. Not our intent to get anything free, just wanted to let them know so I kept this tidbit to myself. We've heard wonderful things about this place, but based on this experience I really don't see an urgent need to return. Very disappointing."], ["Mary M.", "So disappointed.  New management and new menus are NOT was this place use to be!  This use to be the place we ALWAYS went to celebrate anything and everything including my son's coming home party from Boot Camp.  Now, I can't even begin to imagine having a crowd there.  Wait staff is great, but they can only do so much with the restrictions they are given.  Give it a try for yourself and if you have never been, then you may be OK with it all.  For us locals and regulars, very disappointed."], ["Rebecca T.", "Food was horrible. Service was great. We received a spoiled appetizer and undercooked entree. The smell of the appetizer was awful. We sent it back. The second one sent out was much better. Several hours later we all became very sick. We believe it was food poisoning. We will not be returning anytime soon. We have previously dined here numerous times and had wonderful food and service. Disappointing."], ["Adam B. J.", "I'm a huge Italian food fan, and luckily there are a lot of places you can get it.  I had the Sausage and Peppers and it was good.  The bread they give you is also good.  My wife got the Veal Parm.  I've defintely had better veal, and it was a pricier menu item.  There where lots of things I'd like to try.  Service was good.  I enjoyed our meal.  Pro tip, check in on your yelp app and get a free appitizer."], ["Elizabeth S.", "Wonderful Italian food. Nice to have a local upscale restaurant. Service is always great. Has a nice wine room for a party or conference."], ["Anna L.", "So where to begin - in Lexington for business and looking for someplace to eat where the food is not fried. There seem to be a plethora of country kitchen type restaurants in the area, I was just not in the mood for that type of comfort food and I didn't want to make the drive to Columbia. Travinia came highly recommended by one of my local coworkers, had decent ratings and was not far to drive from where I was staying.I stopped in on Tuesday night and since I was dining alone, chose to sit at the bar. I was somewhat surprised to learn this was a small chain with locations in both Woodbridge and Leesburg. The menu and wine list had some nice options. This evening I was in the mood for pasta so I ordered the wild mushroom carbonara. The dish had a nice flavor and paired well with the glass of wine I had ordered, but I would have liked to see a bit more mushroom and prosciutto.So third night in Lexington and I am craving a steak and not the chicken fried variety. I remember that Travinia had a madeira filet on the menu - grilled angus filet, wine demi glace, cremini mushrooms topped with goat cheese. That with one of their wonderful wines by the glass sounded great so I headed back.I will say both times, the service was excellent. Bartenders were attentive and friendly. The hostess greeted everyone with a smile and a warm welcome. I noticed the bartenders knew many people by name - lots of regulars in this place. The space is cozy and inviting.This visit however is what caused my rating to dip. I ordered my filet medium rare - it came out more medium well to well. It was served only with garlic mashed potatoes, no vegetable. Yes, I could have sent it back, but frankly I was tired after a long day at work and just didn't want to wait for it to be recooked. The quality of the meat was not up to par especially for the price. My cut of filet was tough and grisly in parts. They were quite skimpy with the demi glace and it appeared as if the goat cheese had been scraped off the top of the steak - there was only the slightest smear. I have to admit I would have liked to see a bit more mushroom as well since it was advertised on the menu as a component of the dish. Frankly I have had better steaks at another well known Italian chain. While the atmosphere and service were great, the restaurant fell short in what I consider most important - the food. If Yelp had a half star rating, I would have bumped this to 2 1/2, but after my steak....I'll stick with a solid 2. I won't be in a rush to get out to Leesburg to try that location."], ["Elaine M.", "We called for reservations and they won't give them for 4 people. But, we were told that if we got there between 6 and 7 we would have no problem. Got there, and there was a 1 1/2 hour wait. Until the reservation process is changed, we will NOT be back. Very disappointed."], ["Betsy M.", "Cannot say enough good things about our visit there. We had a party of six and we ordered several appetizers and they were all excellent. My favorite was the scallops and risotto. We all had different entrees and they were all delicious. Our waiter could not have been more attentive."], ["Anne V.", "Had a ladies night on Thursday and had the mussels and crab cakes. Both were outstanding. The crab cakes were light and delicious. Our waiter, John B was attentive and delightful. After dinner we moved into the bar area and sat on the couches and listened to wonderful live entertainment. Great atmosphere, great food, great service!!!  Best in Lexington by far!"], ["Dave S.", "Would of given 5 stars but I thought it was a little pricey.  Two entries two salads and two ice teas           $ 62.00. Food a service excellent.  Not more two say."], ["Rachelle B.", "Absolutely wonderful food! Pasta mia nona is my favorite. Asiago cream sauce... umm hello amazing! I definitely recommend dinning here!"], ["Adam L.", "Probably the best restaurant in Lexington. Not your typical Italian style cooking though, but is very good. Tiramisu is the best and lunch is a good value. Nice place for a date and they have private rooms for groups"], ["Jacqui S.", "Absolutely loved Travinia! My coworker and I stopped while in town. Live music set a great atmosphere for a night of wine and fantastic food! A must try: sea scallops over risotto! Absolutely amazing!"], ["David P.", "I returned to Travinia Friday night with my wife.   The food was out of this world and the service was perfect.  I had a great experience.  I highly recommend this restaurant.   They also had a jazz band playing which just made a perfect night.   Thanks to all the staff and management for a great evening."], ["Karen S.", "Really love the atmosphere here. Nice Intimate place - lighting and decor make this place cozy.  Wait staff have always been pleasant the few times I have been here. First place i have ever gotten chicken picatta and by far the best ever I had.  My only complaint is the prices is on the high side for what i got - $15 for the very small pieces of chicken and not much pasta.  Price did not even include a side salad. Our waitress was helpful - suggesting a salad dressing I would like and wine that was in line for what my friend would have liked as well. They do have a wine cellar - but not sure if the wine is for sell.  There is a very small private dining area - sits around 12.  Like that you are able to see kitchen as well."], ["Laura S.", "We go to Travinias for special occasions as it is a little pricey, but well worth it! I LOVE their crabcakes, and I have yet to have a dish that I didn't love! It's a great atmosphere for romantic evenings!"], ["Lisa G.", "A disappointing Easter lunch with a party of 10.  We made the reservation and they seemed reluctant to take it earlier in the week.  Arriving at the restaurant I was surprised it wasn't crowded as usual.  It took our party 50 mins to get our food Sunday.  When we finally mentioned something to the table waitress next to us she notified someone.  The food began coming our staggered.  Some items were incorrect on the seating assignment.  The portions seemed smaller.  The waitress had the cheese in her hand but walked off and never returned with it.  A female manager finally came to the table and noted drinks weren't refilled.  As soon as everyone's plates arrived within a few minutes the manager was back asking did we want dessert and how was the check to be settled.  Ok, we're not finished and you definitely don't need the table as many were empty.  They did deduct off the bill a % but it seems something is very different.  It definitely was lacking in the \"you're part of the family\" feel and there wasn't much concern given to our delay. Not the Easter, family dinner we had hoped for."], ["Kim S.", "Consistently good. Lunch today...all entrees are around $11.  Don't count the calories, just enjoy."], ["Amelia W.", "One of my favorites and we try to dine here when we come back to town to visit friends. We went for New Years Eve and the food was wonderful - 3 in our party including me had the filet which was cooked to perfection. A must try on the menu is the nachos - instead of chips they use something almost like a wonton. Service was efficient and not overbearing. Yum!  Will definitely be back when we are back in town."], ["Joel W.", "Our go to place in lexington, sc.  Lovely restaurant, good music, nice bar area - windows into the kitchen, always cool.  Outdoor area, small private party area.  Parking is kind of a pain, but worth it."], ["Mark B.", "Fantastic food and service Friday night!  The staff did an exceptional job accommodating my party of 12 to celebrate out friend's birthday.  All in all, a perfect evening.  We'll be back again."], ["KeiKei B.", "Good food. Could do with a touch more seasoning but I'm from New Orleans so take it for what it's worth! That said I like eating here. The service alone is always worth the visit & traffic that's the norm on the busy Boulevard.  Friday Night Jazz is always a treat w/a glass of their select wine list. As one Yelper said the spinach salad w/goat cheese medallions is the best! If you choose to get another salad they will let you order 1 or 2 medallions on the side. One is plenty but some of the salads are hit or miss!  And as one other Yelper said Travinia IS NOT kid friendly. We were sitting our grandson tonight and took him with.  No kids menu, just 'half portion' that was too much for a 4 year old. Plus the styrofoam cup 'for kids' is too big. Also the atmosphere isn't conducive to small kids.  My grandson was loud & we kept getting sidelong looks as if to say \"When are you leaving?\"  And I must admit that when I heard a baby cry I did the same!  Want good Italian w/a great bar & service?  Check out Travinia's!"], ["Jim N.", "Went 2 nights during the week as we were in town for business. First night was that good that we went again 2 days later. Dustin was our server the 1st night & requested him again as he was excellent, made some good suggestions re: the menu on main courses & dessert."], ["Christopher C.", "My wife and I went here awhile back. It was a nice atmosphere although I didn't feel like it was all that far from any other Italian restaurant I'd ever been in. the food was quite good as was the service,  the pricing was on par with other upscale Italian places as well but I felt that they were a little more justified in the pricing in that the dishes they served had a bit more...panache."], ["Sylvan F.", "Went on a Wednesday and the place was very busy. We were quoted a 30 minute wait but it only took 10 minutes to be seated. We had a berry salad, Caesar salad and a lasagna bolognase with a side of pine nut orzo. All of the food was excellent and fresh and very hot. Our server was excellent and the unit and restrooms were very clean."], ["Betsy S.", "Nice place for a nice dinner and glass of wine. A bit pricey but overall very good!"], ["Lindsey B.", "Excellent food, and superior atmosphere.  For Lexington, this is about as plush as it gets.  Never had a complaint from any guest I have taken there from out of town.  I think you can safely order anything on the menu and expect it to be good tasting.  Portions are a bit large, I usually get a take out box or split with someone.  As I recall , the bread is very good."], ["Jason B.", "Delicious Italian food, great service and great atmosphere. Definitely worth the drive out to Lexington."], ["John B.", "Great food. The manager, Anderson, and his team make your dining experience Fantastic!"], ["Jennifer R.", "We had wonderful food and service here.  The atmosphere is great."], ["Myles A.", "My wife and I went to Travinia for a quiet evening out without the kids. The restaurant fit the bill perfectly. It was a Monday night during the week of Thanksgiving, so it was very quiet (might have been 4 other people in the whole restaurant). The atmosphere and lighting were quiet and subdued, and our waitress did a great job (not that she had a whole lot else going on). The food was certainly above average, and the portion sizes were much the same. I did not have particularly high expectations for the wine list, but it was actually quite good. I would highly recommend this restaurant for those looking for a quiet night out and some great food at a reasonable price. Finally, I would not recommend this place for kids. Even if they do have high chairs and claim to be kid friendly, they would be out of place."], ["Greg W.", "The best Italian food in the Lexington area, of course that's not saying much.  A beatiful building decorated with some classic rat pack art.  You will get top notch service and above average italian food.Put this resturant on your list for Lexington."]], "Il Giorgione": [["Jenny M.", "One of my of my favorite places in Columbia. Food is so delicious and authentic italian. I am italian and am very picky about restaurant italian good but I've never eaten anything that wasn't amazing here. We are so lucky to have this place!!"], ["Lynn H.", "Went there for the first time tonight for our anniversary. After living in Italy for 2 years it's the closest we've found to true Italian pizza crust as well as the toppings. Loved the bruschetta. Will be glad to go again anytime!"], ["Jay J.", "This is a great little Italian spot near Five Points.Their menu has plenty of options and the food is definitely solid! What I really like about this place is that their portions are just the right size for a person to get a comfortable meal out of it without leftovers and the prices reflect this. The food is great too (especially their fresh mozzarella!).My only gripe is service. You essentially had to flag the waitress down for everything and she did not do the little things like keeping water glasses filled. I was also a little miffed that she didn't say anything about happy hour specials or I certainly would have ordered more drinks! Oh well..."], ["Emily M.", "This is easily my favorite place in Columbia. Amazing little Italian spot, very authentic, nestled in the Rosewood area. And holy moly, they make their own mozzarella!!Cuisine: I have been four times now, and the food has always been spot-on. The portions are on the smaller side of what you'd expect from the average Italian restaurant, which is really nice -- I always have room in my stomach for an appetizer, salad, entree, and dessert, plus a glass of wine. The Caesar and Giorgione salads are well-balanced and very tasty, the pasta is heavenly, and the Siciliana pizza... WOW. It would be worthwhile to return to Gio's just for this pizza. If you like thin crust pizza that is so good it melts in your mouth, then the Siciliana was crafted just for you. Seriously. For dessert, I am especially partial to the apple cake when they have it.Beverages: Gio's has a fun selection of beer and wine. I have yet to try any of their cocktails or martinis. They do carry limonata and aranciata, if you are looking for that.Ambiance: Gio's has an intimate, cozy setting that can suit any sort of occasion. Want to pop in for a casual dinner in jeans and a T-shirt? Fine. Celebrating a birthday or graduation? That works, too. Looking for a spot for that perfect date or anniversary dinner? Gio's is perfect. They also have seating in a lovely little \"courtyard\" area outside.Staff: Joshua has always waited on my table so far, and he is awesome. He's very cheerful and attentive and is certainly knowledgable about everything on the menu. I get the sense that he is super happy and excited to work at Gio's, which I suppose is not very surprising. :) I met Monica, one of the owners, the first time I ate here, and she is lovely. I was so excited to find this place that I think I hugged her...!In short, I love this place. Definitely worth a try."], ["Cindy M.", "Great food and Service.  Great neighborhood restaurant.  Everything tastes fresh.  It is really fun to sit outside with a big group but in colder weather the inside is fine.  The owners are in residence almost every night...which we all know makes everything better.   My favorites are the Cesar salad and pizza specials.  The wine is nice as well.  I could definitely eat here once a week and it continues to take me to a happy place."], ["Shannon K.", "Dinner with friends, and my husband and I order tortellini soup. The soup arrives, my husband's \"soup\" has 8 pieces of tortellini, I am jealous, mine has 5... The shells occupy a broth which can only be the sad remains of combining a quarter cup of Swanson's chicken broth (or brodo as they call it) with a gallon of water. - that's it, bleak, desolate, and flavorless might be too kind. On to the entree', Tuscana pizza, sausage, cheese, green things, shrug it wasn't terrible, at least within the ballpark of frozen pizza, but they need to take some lessons from Hunter gatherer on how to make pizza that actually tastes like something. - Fail. With scuie'-scuie' fail sauce."], ["Kevin B.", "Had lunch here about two weeks ago and dinner several months before that and both meals were excellent!   Between what I ordered and what my friends ordered that I tried I have had the pizza, the pasta rapini, the Praianese salad and the bruschetta.  The hardest thing I will face on my next visit will be deciding whether to choose a new dish or repeat one of those as they were all outstanding!Service is efficient but not intrusive and the owners could not be nicer.  The restaurant is casual and authentic Italian.  If you are looking for a real taste of Italia this is your place.  If your idea of good Italian food is Ragu or the all you can eat special at Olive Garden, keep walking."], ["Swetha G.", "Thanks to a Living Social deal I was able to get $16 worth of food and drink for a bargain $8, have to say this definitely helped with the experience!What was good:- The decor.  They kept most of the look similar to what it was like when Virtu was around.  The main difference was tall wooden tables instead of average length tables.  The space still had a warm, calm, and inviting feel to it.- The service.  The lady who greeted me was very nice and so was our server.- Accessible parking behind the restaurant.  No meters, no quarters, and no time wasted searching for a spot, right on!What was mediocre:- The food.  I had their Quatro Stagioni and subbed the olives and prosciutto with basil instead.  It was served with a fried egg in the center which was really interesting.  The basil elevated the taste and gave the pizza freshness that it otherwise missed with the other ingredients.  The main reason the pizza was mediocre, and I should've said something when I got it (my fault), was that it came out cold.  I think it was sitting out while they prepared my friend's pasta dish, so by the time they brought both out, hers was warm, and mine was cold.  I also wasn't a huge fan of the artichokes on the pizza, they just tasted bland and lacked punch.  I think the Margherita pizza would probably be a lot better as the basil was really good and I'm sure having more of it on a pizza would've been a hit.  Next time I'll give it a try.- Slow service.  While our server was very nice, she was still on the more laid back side.  My friend needed a few minutes longer to look at the menu, instead of coming back in five, it felt like she gave us an extra 10-15 minutes before checking back.  During lunch, ten minutes can feel a lot longer.- They have the same price for lunch and dinner.  Most restaurants charge lower prices during lunch service so this wasn't the most pocket friendly for the area.  If I didn't have my Living Social deal I probably would not have had lunch at Il Giorgione.Overall:I wasn't overly excited about Il Giorgione but I also felt it was a fairly decent first experience.  I wouldn't mind going back and giving it one more try.  Like I said the basil was great so I would be glad to get another pizza dish that had more of it, or even order the Tortellino alla Stefania which is cheese filled pasta, an entree that caught my eye.  For wine aficionados, they do have a nice Italian imported selection, a plus for those who like a good pairing."], ["Patrick N.", "Drove by and the the place had a large \"For Sale\" sign in front .  I don't know if they game moved or went out of business."], ["Anne A.", "Wonderful, wonderful wonderful. We love the food, the atmosphere and the folks!  The owners are down to earth, friendly and so warm and welcoming. We feel right at home. We eat there several times a week and look forward to our trips there! We are never disappointed with the service, the food and the friendship we find there.  I cannot recommend Il Giorgione enough! Please go!"], ["Diana C.", "I yelped this restaurant when I went to Columbia to see my boyfriend graduate from the Army. We decided to go for a small intimate restaurant where we could talk and catch up. When we arrived we were greeted by the owner and his wife. Very friendly people, the food is very authentic and delicious. My boyfriend and I enjoyed our time there and when we asked for directions to a nearby mall, the owner was more than happy to write them down for us. Great service, great food!"], ["Christa C.", "This is a solid option for Italian with a semi-authentic menu and casual atmosphere. Perfectly pleasant, and we'd go back. Cute space, sweet waitress. I'd give it 3.5 stars if I could. It just didn't blow us away, and the place settings kind of turned us off (just too cheap looking). Pizza leftovers were great the next day, cold."], ["Ken J.", "Perhaps it was an off night. We arrived around 6. Counting us there were 4 customers.  The waiter a friendly guy. The food. Well different story. The caprese was quite good.  The pasta very under seasoned. When asked how our meal was we both told the waiter and the owner the food was ok. Truly nothing special. The owner stopped by to ask if anything was wrong and we both stated the pasta tasted like the pasta water was not salted. She stated it was and ended the conversation. With the choices in Columbia spend a bit more get much better."], ["Jonathan Z.", "Not just the best pizza in Columbia, but the best food we have had period. If you don't know where it is, it is literally attached to the former Dianne's on Devine. Just park out in front of Dianne's and you'll see it.   All wines are Italian (as should be in an Italian restaurant), and the food is clearly made by people who know and have traveled Italy. The pizzas are traditional, very thin crust, and very tasty.  Mozzarella is made in house every day which is obvious when you taste it with any of their salads. I had the Prianese salad to start. Fresh arugula, Italian tuna, mozzarella, fresh lemon, and olive oil. That's it....simple and delicious. The mozzarella oozes a little bit of milk when you cut it, mixing with the olive oil and lemon, to form a dressing.  The small portion of Italian canned tuna on top is a revelation for those who have only eaten Starkist or Chicken of the Sea. My wife's Caprese salad was also delicious.  We had a Margherita pizza and the Quattro Stagioni, a \"fpur corners\" pizza with an oozy egg in the middle. Cut the egg and it oozes on the pizza.  Yum.  Crisp crust and a good balance of ingredients, again very fresh and their own herbs from out back as well. The desserts are also homemade. Our son had the chocolate gelato and devoured it. My wife and I split the little cannolis which are 2 bites each and were also superb. Since moving to Columbia from big cities, we always lament over the food scene here. Good restaurants are rare and we had sort of given up, just preferring to cook ourselves instead of waste money.  Over dinner here, we kept saying to each other how excited we were to find this spot, and it's close to 5 Points! Our server Melissa also just moved here from Atlanta and studied in Italy with the same USC international program as George the owner. If you love true Italian (and PLEASE don't call Pasta Fresca true Italian), get  the word out....GOOOOO!!!!!!"], ["Christy W.", "Wonderful meal. The Caprese Salad was easily the best I've had. They make the mozzarella fresh every day and it's sublime. Had the pizza for dinner - wonderfully thin and crispy crust. The wine was all Italian and superb. I highly recommend!"], ["Jane D.", "This is a new place on Devine St (next to Diane's) you will miss if someone doesn't tell you about it.  The food was fabulous.  Even the kids loved it. The place is geared toward adults but friendly to well behaved kids.  We had salad, bruschetta and ham pizza.  All was delicious.  The wait staff was attentive and friendly."], ["Liz C.", "Neighborhood gem. Great authentic Italian food. Caprice (mozzarella made fresh daily) best in town. Wine list good (not extensive). Good bread. Staff friendly and knowledgeable. Owners genuine and delightful. Love the portion size.  Good specials. Prices reasonable. Comfortable outdoor dining also. A favorite of ours."], ["Howard L.", "The BEST pizza I've had since Sicily!  Amazing thin crusted Napoliatana pizza  w/anchovies, oh my!  What a wonderful meal!  My wife had the Scampi dish chock full of sweet local shrimp with a magnificent sauce.  The salads were crisp and ever so fresh!  A quiet refined setting, modern and with a lovely, helpful wait staff made our visit all the more delightful.  5 Stars for sure!"], ["Ray T.", "Was introduced to this wonderful spot on Devine St. by a good friend and it truly is a gem of a restaurant. Full bar, great Italian menu, with fresh ingredients and very reasonable prices. Friendly and efficient staff make you feel right at home. Very nice, casual and cozy atmosphere. Highly recommended!"], ["Brandi B.", "I can't express how pleased I was by this place. I went for lunch today and shared a few dishes with my friend. We had the soup of the day, which was simple and delicious, as well as the bruschetta of the day, which was almost like a really fresh hummus. We sat on the porch, which was very nice and quiet. The Siciliana pizza was die for, and our server, Taylor, was just great. I will definitely be back. If you appreciate fresh food and simple but  authentic Italian, you definitely need to try this place out. We are lucky to have a place like this in Columbia."]], "Schiano's Italian Eatery": [["Christine M.", "I came here because I was told they had New York style pizza and originally living in the Bronx for 20 years I was ecstatic to have some New York style pizza in South Carolina! I was heart broke that it wasn't really New York style pizza it.. It was not even close. However the pizza is still pretty good just a tad too salty and believe it or not too cheesy .The service is always slow every time even with no one else there. If you  do check this place out try their cheesy garlic bread it is to die for!"]], "Moe's Grapevine": [], "Columbo's Italian Eatery & Prime Steaks": [], "Delucca's Italian Foods": [["Kel B.", "Extremely delicious, small, medium priced Italian restaurant with a great staff.  We tried the pizza and the Chicken Parmesan, both of which were tasty and served fast.  The pizza is probably the best in Columbia!  The staff is very nice and act as if the customers are part of the family.  The meals run from ten dollars up, not especially expensive.The only thing I dislike about Delucca's is how crowded it is because of the tiny restaurant.  Otherwise, it's perfect.  I will definitely come back."], ["Whitney S.", "Deluccas is our favorite spot to eat in Columbia for dinner. The food is always fresh and tastes wonderful. Just the bread and special butter is enough to make me go!! Some of the staff knows us by name at this point. We love coming here. Never had a single problem or complaint. Weve tried several different dishes over the years and I cant pick a favorite. You cant go wrong with Deluccas!"], ["Nancy B.", "do not understand how anyone could rate the food in this place with any stars at all. The food is so bland and tasteless. The bread is ok, the salad is ok but the tomato sauce is bitter and the marsala sauce has no taste at all. The chicken is rubbery and tastes like it is fake. The meatballs are tough (cheap meat) but edible. They are the size of golf balls though. The service was ok. The atmosphere is such that you are right next to strangers. Some mat like that. I didn't. Bottom line is that if you want decent food that tastes like something, do not go here"], ["Mark H.", "For central South Carolina, Delucca's is an oasis of Italian goodness, and would respectably hold its own in larger markets. The produce they use in their salads is unbelievably fresh: some of the reddest tomatoes I've ever seen in my life. Bread is brought to your table steaming fresh. Their vodka sauce is off the chain. You'll be very glad you discovered Delucca's and will want to tell your friends about it."], ["Phillip S.", "A fantastic hidden food gem..great staff awesome foods and majestic butters! Love this place def b back for more!"], ["Jim S.", "Delucca's is a real gem. They have a large menu but every dish is outstanding. I have eaten here for over 4 years and have never had a bad experience. I especially like the fresh croutons in the salads, the beef and pork ravioli, both lasagna options, and the stromboli, among many other favorites. Their new location is much bigger and much nicer. If you go at lunch ask for Brenda. If you go more than 2-3 times she will remember your name and what you like. She is a superstar."], ["Lindsey B.", "This is, as good as it gets, food wise.  The salad is marvelous, the best in town.  Every entree sparkles, enough for two people I think.  Staff is tiny, but the place is very small as well.  Chef is the entire deal here, he is fantastic.  Had stories in the newspaper about him.  if you are serious about food, this it he place to go.  Don't expect much atmosphere, just take a friend and savor the goodness."], ["Kelly O.", "Best Italian place I've found thus far in Columbia!! This place is AWESOME!!! The service is quick, and every dish I've had here has been wonderful. It's a very small, cute place. I hear they are moving to a bigger location very soon. I look forward to going back again!!"]], "Carrabba's": [], "Ember Woodfire Pizza and Grill": [["Rachel H.", "Came here for the first time with family and was decently surprised.  Brother and sister in law had a coupon for a buy one get one free pizza.  How it worked- we ordered a 16\" pizza and received a 10\" cheese or pepperoni pizza.  We ordered a BBQ chicken pizza for the larger pizza and a pepperoni for the small pizza.What's Hot- Clean.  For me, good hygiene is always important at a restaurant, especially where you need to eat with your hands.  You can also see in the kitchen, which I think is nice to see how the chefs work and that everything is kosher.- Good flavor.  The toppings weren't lacking.  It wasn't overly flavored or lacking in flavor.- Fresh.  You could tell the ingredients were fresh and pizza was made to order.  Observations- This place was not busy, especially for a Saturday night.  I don't know the reasons, but it does make me wonder why this place doesn't seem to have good business.- The salad section stated that they came in bread bowls, which doesn't seem appropriate for a pizza place.  I wanted some veggies to balance out the meal, but not if it was going to come with a whole bunch of other carbs.  The crust is already enough, which deterred me from ordering anything else on the menu.- The crust didn't seem to be cooked evenly.  Maybe it's because of the pizza oven, but it seemed a bit off.  For example, one side of the pizza was a bit charred, while the other side was lighter and more doughy.- Remember that because it's wood-fired pizza, that means the crust is thinner.  Be ready to order more if you come with people who have large appetites, like my husband and brother in law.Final AnswerI am willing to come back again, but it may not be my first choice.  The quality of the pizza is good and fresh, but I've had better.  It's definitely worth a try."], ["G H.", "My husband and I came here after buying a Groupon. It was $29 for two glasses of wine, soda or beer and two entrees. We got here really early (5PM) and there was only one other table on a Saturday night. The manager (I presume) seated us right away. I was debating whether I should add this part of not to the review, but it really did affect my dining experience...you know that moldy smell when you leave clothes in the washer for too long? I caught a whiff of that every time the manager walked by us. As for the Groupon deal, you get a choice of any of their soda, any of their beers and only the house red and white wines. All the entrees are included but there is a $4 upcharge for the ribeye and the salmon (which were the most expensive items on the menu). We started with the garlic knots appetizers and it came with 3 generously sized deep fried yummy goodness. It was slightly greasy cause it was deep fried and then had been drizzled in olive oil but we didn't mind it. I got the sausage, pepperoni and mushroom pizza which was delicious. My husband got the shrimp scampi but was very bland unfortunately. The place is very clean and the service was good. If we come back, it would probably be for the pizza only."], ["Katrina W.", "Great restaurant. We had a Groupon so we stopped by. We had the Bruschetta which was perfect. We both had lasagna which was fantastic.  Will definitely be returning."], ["Michael S.", "My wife and I wanted some pizza while the dog was at the nearby vet, and thought we'd give Ember a shot. We were greeted by the friendly manager, and immediately seated. I ordered the philly cheese steak pizza and my wife ordered the pizza bianca. After waiting 30-45 minutes the manager informed us that their had been a mistake in the kitchen regarding the pizzas, and that our entire meal would be comped. The pizzas soon followed. The crust was on point, and the toppings fresh. Tried to pay the bill, but they would not hear of it. Good food, exemplary service. Look forward to returning to try the other pizzas."], ["Michael M.", "I have a new favorite restaurant in Columbia! I thought Travinia was the best until I tried this place! The wood fired pizza is phenomenal, something this NY native never thought he'd say. It was flavorful with fresh toppings and creative choices. The salmon and capers is wonderful and the margherita pizza is comparable to what you might enjoy in Italy. The caprese salad is a winner. The garlic knots were a bit greasy, but very flavorful.The ambiance is great, it's hip and casual but a great date night place. The outdoor patio is beautiful and great for a nice warm day.I'm not sure why there are negative reviews. This is not just fantastic by Columbia standards, this would be great in any city!"], ["Robin S.", "Friendly people, great food.  Thanks for suggesting putting veggie burger on spinach wrap, it was delicious."], ["Ne'Cole V.", "Update your hours. So I don't waste my time driving over there. I'll update my review when we actually get to eat there."], ["Thomas P.", "Not sure what the last people experienced but I had fast service and great food. Pizza wasn't greasy and the salad was way more than I could eat."], ["Bobbie B.", "Had lunch there after church. There was one other couple in the restaurant. I sent my chicken Parmesan sandwich back because it cold. They put it back in the oven, but it was still cold when they brought it back. The chicken was not freshly cooked, and tasted like it was going bad. Maybe left over from the previous night? We didn't eat our lunch. Just paid for it and left."], ["Tash S.", "Fabulous wings!!! The best in town....both hot and Italian. The location is great as NE Cola is in need of restaurants. Staff is friendly and accommodating. They have GFree options. Hope they do well."], ["Jeff S.", "Best hot wings in Columbia, hands-down.  Great new local business in NE Columbia, where we are in desperate need of restaurant options.  They have great gluten free pizza too."], ["John S.", "We were looking forward to trying a place close by that specializes in wood-fired pizza.  When we arrived the place looked nice enough and we were promptly seated.  Noticed that a lot of people were waiting around at their tables and that should have clued me in.  The guy that sat us said that our server would be with us only to have him show up 10 minutes later to tell us that he'd be taking our drink order.  Tried to order draft beer but he told us that the menu was incorrect and that they only had bud light on draft and few bottles.  So we ordered a bud light.  15 minutes later and the bartender had left to go somewhere and our waiter hadn't shown up.  When I found him at another table I told him that we were leaving.  The two other couples near us were still at their tables waiting on the check with dirty dishes.  Felt sorry for them.  They are obviously under staffed and under managed.  Won't be going back.  Total waste of 30 minutes.  Later, Travinia was good though."]]}