{"Rue 77": [["Niki S.", "Food & service were great. I had the chicken curry which was delicious and came with the best bread I've ever had! My girlfriend had the psycho burger and loved it. We will definitely be back!"], ["Searrah R.", "I have had it with this place. It's my birthday weekend I was told the kitchen would be open all night, here we are about to leave and I had no food, the number one priority of an establishment should be customer service and I didn't get that. Couldn't even speak to the owner after seeing him numerous times. Thanks for nothing rue."], ["Sed F.", "Horrible service. Walked in and no one greeted us. Sat at the bar, still nothing so we left."], ["Daniel D.", "Dear owners:Just after 10pm this evening I headed out to eat something from whatever's within walking distance that's still open. According to yelp, Rue 77 was one of them. I'm a sucker for some good Mediterranean food, and after seeing some movement in the restaurant from a block away I figured I'd be in luck. As I crossed the street to see if there's a menu posted outside, I hear a commotion. Apparently the staff is having a pretty rowdy time on a slow Monday night. I'd be cool with that if I didn't hear a gentleman screaming \"we're closed man, we're closed keep walking\" from inside, to the delight of his laughing coworkers which appeared to be wait staff. I'm sure they just had a long day, and so have I.  Honesty at this point I couldn't care less about the food, now or at any point in the future. Way to make a first impression before even stepping in the place."], ["L H.", "This place is absolutely amazing. If you have not been, GO! When I first walked in the door I was amazed - in a good way. The atmosphere is so inviting. The owner greeted us personally and he was very nice. With that being said, I was impressed with customer service...the food was delicious!! The food was fresh, seasoned well, had great presentation, and the prices are reasonable....I will definitely return."], ["Josh R.", "I've had my share of samosas but I've never tried Lamb Samosa. LET ME TELL YOU! It was amazing! I'm an instant fan!"], ["Bill R.", "Lousy food, not at all what they advertised on the website. Looking forward to a San Miguel beer, they had none .iwill not go back"], ["Christy S.", "Came in for a late lunch. We were the only patrons   We were graciously greeted. The service was excellent. The food was fabulous. The Philly Kati was yummy. The fresh made pita chips were the best I have ever eaten. They melted in my mouth. Highly recommend for the service and food."], ["Sheetal R.", "As a New Yorker who wandered into this restaurant on a business trip, I was thrilled to see Kati rolls on the menu.  The Kati Roll Company is a popular late night eating place in Manhattan, and after meeting with the owner Arif (who spent the bulk of his career in New York), it seems Rue 77's kati rolls are inspired by the New York restaurant.  While they're a little different, Rue 77 made a good kati roll of it's own.  They are soft and chewy and filled with veggie curries that tasted fresh.  As I am of Indian origin, Arif (the owner & chef) said he'd make them with medium spiciness for me (which I would suggest)."]], "Sahara On Main": [["Zhihao Z.", "Very close to the business school. Shawarma is soooo good. Love their pizza too, try Damascus or Turkish with grilled chicken."], ["Chad A.", "Thisis the best middle eastern food I have found in the area. I especially like the babaganoush and all their salads. Their falafels are uber tasty, and for all my pescatarian friends and meat eaters, you won't be disappointed. The prices are very reasonable, and our server Daniel was highly attentive. Its like a trip to the middle east in your own backyard. Enjoy, as you won't be disappointed. So put down the BBQ for an evening Columbia, and expand your palette."], ["Regular C.", "Kind, caring waitresses and good food. Relaxing atmosphere. When they get busy, it's pandemonium, but they do the best they can for their costumers and are always nice as well as respectful."], ["Robert V.", "This is an excellent Middle Eastern food restaurant that my wife and I like to visit whenever we're in this part of town and want to switch things up a bit. The food is great and so far I've enjoyed the fish options (tilapia and salmon) and the Pascha chicken. The turkish coffee goes well with the desserts afterward. Parking is a little tight out front, so you may have to find a spot on the street if it's busy, but that shouldn't be a problem."], ["Anita M.", "The Damascus hummus is excellent. The rest of the food we tried was solid. Along the way we learned that they bought Al Amir and have kept the cooks and the same menu for the short term. They hope to customize the menu a little bit more in the future. I certainly am looking forward to tasting some Moroccan food, as advertised. The decor has been updated since the Al Amir days but some of the furniture still looks old and tired. They also added a dessert case but most of the dessert seem like different versions of the same baklava. And their baklava is only made with pistachios or cashew, no walnuts. We tried the five-item sampler dessert plate and everything seemed bland. There were no rich flavors to be found. But, I would come back for the Damascus hummus, for sure."], ["Leigh B.", "Great food. For appetizer we ordered Damascus bread and Babaganous which was enough to share with 6 light eaters and fantastic. Highly recommend. As my main dish I ordered a gyro and feta salad. The gyro is what you would expect. The salad was just OK. I was in a party of six and 3 of the orders arrived wrong but the waitress fixed the problems. Definitely will eat here again."], ["Rebecca A.", "Sahara On Main- formerly Al Amir- is almost exactly the same as it was under the former management. They still have the same weekday specials. I love their hummus so much. They drizzle some olive oil on top and it is so decadent. The Damascus bread is fresh and baked in house. It's so delicious to mop up your hummus with. My favorite is the beef gyro with pickled cabbage. I love pickled cabbage! It's pretty solid middle eastern food. I once ordered the curry chicken and didn't care for it. The chicken was dry and the curry was very thin and soupy. Everything else on the menu is great though! Will be coming back many times for sure."], ["Miranda G.", "The food was so delicious! We have been looking for a good Mediterranean restaurant in the Columbia area and we have definitely found our new favorite! The Pascha chicken entree was delicious and it was so much food - I had leftovers for lunch the next day. The lamb gyro was also very good. And everything was so reasonably priced! We will definitely be back soon."], ["Eric W.", "Great food! Good attentive service.  Damacus bread was the best i ever tasted! Great hummus!"]], "Olive Grill Mediterranean": [["Gregory G.", "If you've ever been in Olive Grill then you've probably seen me. I eat here almost every day. The food is delis and Leslie (owner/register person) is so friendly and welcoming. My entire staff loves the food and restaurant. I can't say enough good things. I usually get their chicken which is marinated to perfection and when they have they steak you should definitely try it. The falafel and hummus are delis as well. Be prepared to sit and enjoy your meal those as everything is made to order and isn't super speedy but I guarantee you it's worth the wait.Oh! And you absolutely must try a Pecan Tart. I \"try\" them daily! Ha!"], ["Brandy B.", "Service is consistently excellent (\"sometimes you wanna go, where everybody knows your name\").Food is consistently fresh (I always get the falafel gyro, and maybe fries or a Greek salad).So glad this place is walking distance from my job - if I forget to pack my lunch, I can count on Olive Grill for a reasonably priced meal!"], ["W T.", "This place is just around the corner from my office, so I visit pretty often. I've yet to try anything bad. The gyro is deliciousssss. I usually get it with grilled vegetables and order a side of tzatziki to dip it in, but honestly it's good all by itself. Falafel here is the best I've had anywhere close by. Perfect crunch on the outside, and well-spiced with whole pieces of chickpea still inside. Bit into one once and honestly thought that I might be able to go vegetarian if all meat-less entrees tasted like that. Oh and don't underestimate the soups. You can sample whichever is available that day, and there's a bean soup that makes cold weather in Cola almost tolerable. Only gets 3 stars because the sauce portions are really small and there are no frills in presentation, but all-in-all, you should eat here because it tastes good. Period."], ["Rae H.", "I had a pecan pie tart, and the bltc.  C for goat cheese.  The bacon was thin and crisp, and served on a baguette that was perfect--not too crunchy and not too soft.  It was served with a mixed green salad that was cool and fresh.  Their house dressing is a vinegrette with lemon juice that was the perfect amount of acidity. They also have a good selection of vegetarian options if that suits your needs. Parking isn't a problem even though it's downtown because it is right beside the new city garage, and only two blocks from the old city garage on Sumter.   Catch it at the right time and there is a fair amount of street parking available,  too.The interior is clean, bright, and the family that runs it is friendly, and quick.  This is a great lunch spot with comfortable booths and a welcoming energy that makes you want to sit a spell and retreat from the usual downtown bustle."], ["Rick T.", "Thanks to Yelp I have found a new lunch spot that serves quality Lamb Pita and Moroccan stew. The stew is well balanced and the all flavors come together, pour the stew the over basmati rice and you are in flavor town. Moving on to the Hummus, well all I can say is I want more and more It has a clean fresh taste that goes well with pita bread. The Lamb Pitas are really great too, not to dry and the vegetables were fresh. The perfect amount of food for a lunch date. My meal was so good I got a regular Gyro to go to eat later. I found by talking to the nice lady that took are order and served are food that the chef is from Iran and specializes in this type of cuisine. Olive Grill hopes to one day be at the Soda City Market doing Gyros and I hope they bring their Hummus cups. I told them I would personally like to see them on Saturdays coming to represent the different types of cuisine that is ever growing on Main St. and Columbia's food scene in general. So I hope everyone will enjoy eating here as much as I have today!"], ["Adam B. J.", "My wife and I went for lunch after reading about this place.  I cooked in two different Greek Restaurants for almost three years, and I must say Olive Grill's Gyro is an A+.  We got the Mediterranean salad as a side, and after putting a couple spoon fulls on top of the gyro it was even better.  I got the Felafel Pita which was also good (more authentic after adding some of the Mediterranean salad on it).  Hummus is one of my favorite dishes so I tried the Hummus as my side.  I'd say go for one of the salads or fries.  In a town with not that many ethnic choices, Columbia does have some great Mediterranean places, and I'd get your hummus fix at one of those.  Quick, clean, and good service which is always a plus.  We will be back!"], ["Emily E.", "Just found out about this place today and gave it a try...very happy with the choice!  Very nice menu with lamb, chicken and vegetarian options.  I'd recommend any of the pitas or platters and Mediterranean salad was fresh and left me wanting more.  Prices are $10 or less.  Next time I'll try the baklava or sand tarts for dessert.  Great addition to Taylor St and very good friendly service."], ["Lissa J.", "I wish I had read the review on Free Times here free-times.com/restauran… before I dropped in. I ordered a 'gyro pita' combo which btw doesn't a gyro assume a pita? IDK - it was a little dry. I wish i had ordered some extra tzatziki sauce for it. The pita was soft and fresh however. After chatting with the very friendly lady at the cash register, I opted for the Mediterranean salad instead of fries. This was a good call. It was chopped cukes, tomatoes and onion in a very tasty oil and vinegar dressing. Just wish it were a bigger portion! If I go back I will try one of the more signature dishes."], ["Juan G.", "I found out about this place through family, and I absolutely loved it. I went with some friends and it was lovely. The atmosphere was very friendly and the service was great. I tried the steak and chicken pita and it was delicious. I'll definitely come back again!"], ["Chris K.", "Specials were a good price. But the drinks were watery,  even the tea. The gyro was a little pricey for the size. Overall it was decent."], ["Bonnie W.", "My favorite new place downtown!  I love Mediterranean food, and this place is great!  The service is WONDERFUL and the food is delicious. I really like the falafel, the gyro is perfect, and the lamb and Lima plate is very tasty.  The only thing I don't care for is the stuffed grape leaves, but that's just my personal taste."], ["Gilberto M.", "Persian / Greek Restaurant. I guess for a Persian, the rice will be ok but I was not a fan of the rice. The lamb was served as a beef stew. That is what lamb in a savory sauce means. The tzatziki sauce has a Yoplait Yogurt flavor. I preffer Pitas better but I will give them a second change in a few weeks or month. Not sure when they opened but I believe it was recent."]], "Mediterranean Cafe": [["Kathy C.", "Great food and great service as usual! The baba ganoush is really good and fresh. He Greek salad is also fresh with lots of feta. Tonight we had the grilled salmon and shrimp. Cooked perfectly and excellent flavor. This place is always good!"], ["John S.", "My wife and I went here for lunch a few days ago and it was ok.  Nothing to write home about.  We got a chicken and a gyro sandwich.  I have eaten gyros before but this one was unique.  I did read the description and tried something new.  If you have eaten a gyro before this has their spin on it.  My wife's meal, chicken sandwich, should have just said a chicken wrap and not sandwich.  The sandwich/wrap was almost as the same as my gyro. I just feel that they should not have called my gyro a gyro because it did not have tzatziki sauce on it.  Everyone knows that gyros always have tzatziki sauce but I did try something new and it was a nice try but a strikeout for me."], ["Coye J.", "Best food in Lexington! Great food, fresh, healthy selections, and great atmosphere! We go here almost every week and its consistent!"], ["Jim M.", "Ate here Saturday night and ordered the double pork chop dinner.  One chop arrived with the plate and sides with a promise of the second chop later.  The second chop arrived after about ten minutes, probably cooked in an oil and garlic sauce, completely different than the sauce the original came in.  A bruschetta appetizer was passed around the table and was dry and tasteless.  This place is not serious about food and someone in the kitchen is just following some formula left behind by someone long gone.  Very disappointing."], ["D J.", "We had a party of six so I did not want to make a fuss over the inedible   mess they served up. Others in my party had better experiences so I am just commenting on mine. I ordered the shrimp scampi, what arrived should never have left the kitchen if a real chef was on duty. Nice sized shrimp sautéed with mushroom slices served over cold yellow rice floating in 1/4 inch of red colored flavorless  grease. Rice was under cooked and the over all flavor was Cajun ??? Just plain nasty! I sent it back to be micro waved to heat it up. No help there. Explained to the server that the dish was a great disappointment and please tell the \"chef\" because I am sure they would want to know. There was no feed back and no mention of the meal or my disappointment . They do not apologize for the bad experience or attempt to offer compensation . Service was okay . A few other incidents at the table leads me to think the kitchen needs better management . This was an expensive meal we did not get value for."], ["Anna L.", "First night in Lexington and by the time my meetings finished for the day (8:00 pm) with no lunch I was starving. This place was right next to my hotel so decided to stop in for a quick bite. They close at 9:00, but it was obvious when I walked in at about 8:30, they were ready to go home - no customers, well into side work. However, I was warmly greeted by the two ladies working that evening.I ordered a Greek salad with chicken to go and a glass of wine while I waited. Service was quick and I had my salad before I finished my wine. I headed back to my hotel to enjoy my salad. Let me start by saying the chicken was so flavorful and there was a nice amount on the salad. They were kind enough to put the dressing on the side without my asking - much appreciated. The salad was served with warm pita bread - again very fresh and tasty. It was loaded with tomato and cucumber which was a plus as well. However, the entire salad was iceberg. For some reason I expected romaine or some other dark leafed variety in addition. There was almost too much feta cheese. I also expected kalamata olives - there was one. Yes - just one olive and one small  pepperoncini! I thought kalamata olives were an important component of the Greek salad, but apparently not at the Mediterranean Café.While I appreciated them throwing something together so close to closing and the friendly service, I would probably not stop by again if I were ever in Lexington."], ["KATHLEEN M.", "Nice setting! No TV's so we had great food and conversation! Delicious kabobs with fresh veggies. Lamb chops were the special and did not disappoint."], ["Charles E.", "I've eaten here several times and never been disappointed.  Great selections on the menu and well prepared food.  You may even bring your on wine.Very friendly staff and good atmosphere.  Love it!"], ["Phylis B.", "Quaint restaurant with a cozy feel. Attentive serving staff and a nice sampling of wine. I had the chicken kabobs which were well grilled, juicy & flavorful. The salad was perfectly portioned so I wasn't overly full by the time my entrée arrived, and I loved the yellow rice.  I dined on the patio to enjoy the beautiful evening weather and the only thing that could have made the rating a 5 star would have been if the patio bug control was better. (Light gauzy nets draped to keep the flies away could only add to the ambiance.)  Other than shooing them away, it was a great meal."], ["Cynthia S.", "The gyro has hamburger meat on it and the yogurt sauce was runny. There aren't any items on the menu with lamb."], ["Mary B.", "The restaurant had only 2 servers the Thursday we were there and they hustled but were seriously understaffed.  My Kofta medallions were good- well seasoned with yellow rice, hummus and tabouli.  My companion had what was described as broiled shrimp with black olives and feta and a wine sauce.  What he got were shrimp swimming in a soup bowl-very messy to eat and not what he anticipated.  Doube we'd come back."], ["Sim L.", "Honest customers have to take the brunt of the owner's mistake...I purchased a restaurant.com gift certificate ($25, if you spend $45).  The owner refused to accept it, saying that he broke his contract with them because they were selling $100 gift cards when he only authorized the $25 ones.  I told him, in that case then, he should still accept my $25 gift card.  But he said no because it was too old.  I showed him the gift certificate clearly says \"This certificate does not expire\".  He disregarded what I thought were valid points.  He then kept saying how he should never have entered into a contract with restaurant.com because it lost him money.  Well, that is his problem, not mine!  Had he done the right thing, owned up to his mistake and honored the gift certificate, I would have respected that and returned again to support this local business.  Unfortunately, the owner was smug and greedy when it came to dealing with a situation that is clearly his own fault.The food was AVERAGE."]], "Gervais & Vine": [["Liz R.", "The menu had so many must try items and I may have gone a bit overboard...but it was worth it. We started with a trio of the dips and chose:Spinach artichoke-hands down the best I have ever tried. There was an extra creaminess to it and had the perfect balance of ingredients- easy to scope but not runny. My favorite of the trioAlmond Brie-incredible as well. The almond added an extra sweetness to the cheese that made it feel more like a dessert but not so overdone that I couldn't justify eating it as an appHummus-I know, sounds boring. But it was so so fresh and if it wasn't homemade then they definitely fooled me. Only downside is it was a little heavy on the oil for my taste, but others may prefer that. Then we proceeded to order the bruschetta, which was a plate of two medium size slices of toasted baguette covered with a heaping of one of my favorite types of tomato dishes. We finished things off with the salmon, which wasn't particularly seasoned, but was so fresh and cooked just the right amount that I didn't even need the sauce they served with it on the side. I told you we went overboard and we probably could have stopped with the trio, it was so filling, but I certainly have no regrets because everything was phenomenal."], ["John J.", "I have been to this restaurant three times.  The food and wine were excellent the two times I stayed.   Service is among the worst I have found in Columbia.   For that reason, I left on my third visit deciding to eat at Cellar on Greene instead were service is always great.  On my first visit, the hostess was irritated and shot me a snotty look when I asked for our table to be wiped down before sitting.  During my final visit, we sat at the bar for nearly 10 minutes waiting to be served before leaving."], ["Andrea R.", "Dined here on a Friday night. We made reservations which was nice because the place is quite small, a lot smaller than we expected. We were sat in a small room in the back against the wall which gave us some privacy but for a tapas place the table was very small. You would think when needing to accommodate 5-6 plates at one time that they would select larger ones.We started with the bruschetta which was really good. Two large pieces of French bread topped with a lot of tomatoes and a thick balsamic vinegar. We then had the olive plate which I loved, but I never met an olive I didn't like so maybe that's just me. We then had the Moorish pork kabobs with gorgonzola fondue for dipping; warm almond brie with mango chutney; gambas (spicy shrimp with roma tomatoes, sherry, bacon & garlic); and the garlic-parmesan fries with spicy aioli. We also ordered the petite filet mignon but our waitress never brought it out and we were full so we told her to just forget it. Overall our food was delicious and filling. With those 5 plates (olive plate doesn't count) we were SO full. Plenty of food for two. The service was great; our waitress was so nice and knowledgeable and made great recommendations. We paired the meal with a delicious Malbec, unfortunately we saw that same bottle of wine at Publix the next day which was kind of bummer considering we paid I think $36 and it was at Publix for $12. That's the name of the game I guess.We thought the prices were more than fair, our meal only came to $90 (pre-tax) for everything.  The low-lighting made for a romantic atmosphere and we will definitely be back!"], ["Stephen B.", "Well since the change of ownership a couple years back I've heard nothing good. So I decided to give it a try. Well the menu has not changed but the quality has definitely gone down hill. Sorry but it's just not the same. Go elsewhere. Enough said."], ["WanderLustinDani P.", "Greatness, Goodness, Excellent Service,Cleaniness.....hubby and I enjoyed to the fullest, we will be returning. No need to write a long review! A wonderful find close to home..."], ["Sherry C.", "I really and truly had an open mind and wanted so much to really love this place.  I've been wanting to come here for a while.  However, I hate to admit..... but I was kinda disappointed.Our waiter was really nice and very attentive.  I wish I could just give him 5 stars.  Our appetizer, which was the Costa Brava,  was very good.  I was excited to be off to such a good start.  The tapas that we ordered, Beef Paillardes and Catfish (it was one of the specials) was pretty disappointing.....They were both about 3 stars.  But the Eggplant Fries, were soggy and not very good at all.  Because I was still hungry not eating much of the other we ordered some Fingerling Potatoes.  They were pretty good.  I wish we had ordered them instead of the Eggplant Fries.  Overall, I'd like to give them 3 1/2 stars.  But since I can't, I have to just go with the 3 stars.  Definitely not worth a 4 star.  I hate to say this, but I doubt we will ever go back."], ["Jennifer M.", "This is the perfect place for a nice adult evening on the town. The food menu is superb. It is so much fun to order several small plates and share. We had the cheese plate - the manchego cheese is not to be missed. We had the shrimp and scallops tapas. They were perfectly prepared. The wine menu has a nice mix of selections and the martini menu is also interesting. A very fun and interesting place for dinner, especially when you enjoy tasting many dishes."], ["Adrienne J.", "It sincerely distresses me to write a review giving Gervais & Vine anything less than 5 stars. My husband and I have been going here regularly for at least 6 years. We LOVE the food and atmosphere, and in all times past, the service. Tonight we went in for dinner, with a reservation, and were taken into the back room to be seated. The hostess asked if the table was okay, and my husband asked if it would be possible for us to sit in the front part of the restaurant. This was met with an undisguised eye roll and sigh that was loud enough for me to ask, \"Is that a problem?\" The hostess responded, in a clearly mocking tone, \"No problem at all.\" She proceeded to seat us only one table away from the hostess stand (which was fine) and then discuss my response to her eye roll and sigh, quite loudly, with the other staff (which was NOT fine). This was all done loudly enough that my husband then asked the server, who was included in the hostess stand conversation, if our seating was a problem. Initially, I took this quite personally, but as we sat and continued with our meal, I saw this process repeated with at least half of the customers that were seated. Eye rolls, loud discussion among the staff nearly mocking the patrons, and general attitude of annoyance from the staff. We have never left the restaurant without ordering at least one bottle of wine, several orders of tapas, and at least two desserts. I was so uncomfortable by the end of our meal that we opted to head to Kaminsky's for after dinner drinks and dessert. (Which, by the way, was FANTASTIC!) It just generally seems that all of the employees hate their jobs and that all of the customers are a bother. So disappointed that the service has, seemingly, gone so far downhill at a restaurant with fantastic food and great ambiance."], ["Michael Y.", "Great experience. This place came highly recommended and did not disappoint. I tried the goat cheese, which was amazing, followed by the marinated olives, which were excellent. The meatballs were good and the Sicilian pizza was great. Great atmosphere, great service, great menu, great food. Definitely coming back here."], ["Robert V.", "This is my go-to happy hour spot with my wife after a long work week. Whenever we have a hard day our first thought is to head over to Gervais & Vine and uncork one of our favorite bottles of wine. The atmosphere is one of our favorites for just hanging out and having a light meal with great wine. The staff are super nice, always helpful with a smile, and they go out of their way for us every time. There's usually light live music in the background, a happening bar area, and good crowd. Now that we've tried most menu items, I can say that my favorites are the petit filet, almond brie, and the duck."], ["Rachel G.", "My husband and I had amazing food the last time we ate at Gervais and Vine. This time, we both agreed, was not nearly as good. It was disappointing to spend so much money, and have the food taste \"okay.\" The triggerfish special was cold when it came out, and the duck wasn't very flavorful. The best parts were the Parmesan fries and cheese plate...it should be the other way around. I'm not sure if there has been a change in chef or management, but I'm not sure if we will return in the future."], ["Rick T.", "I have had really great food here and I have had food that wasn't good at all. The servers here are really nice but, I don't think this place is consistent like maybe this place has changed hands or something. We will have to come back for dinner and give it another go. My friends say they mostly prefer to come here for dinner as the lunch is just okay."], ["Ellen R.", "I had been coming here for years and usually have a very good experience. I've recommended it to several friends. Today (10/9/2014) at lunch was the worst experience I had ever had there. I would give it one star if the food I ordered was awful. However, the tasty salmon burger and Parmesan fries are the ONLY things keeping this from being a one star review.I arrived and there was a party of 8, however they were already in the process of having their meal served to them. I placed my order and waited and waited and waited. Did I mention I waited? By this time, other diners had come to the restaurant and were seated and ordered. The place was nowhere near being packed, mind you. As I continued to wait, a 4-top, 3-top, and 2-top (all arriving after me) had already been served. The 8-top that was having food delivered to their table had long since finished eating and had left. The only table besides mine that hadn't been served their lunch was a 3-top that arrived much later than me. I think my server was avoiding me since he rarely came to check on me or when he did, would assure me that my salmon burger was on the way. At this rate, I'm thinking that my salmon is still on a boat off the coast of Alaska. So the food finally appears AFTER ONE HOUR. And the salmon burger is piping hot, so it was comforting to know that it had just been cooked and hadn't been sitting on a counter for 45 minutes, however, this means that somehow my order was the next to the last put in with the kitchen. I normally take photos of my food so I can post them to yelp, but given the serious rumbling in my stomach, the primal urge to feed took over. My server was completely oblivious to the fact that I had been clearly waiting and inexcusably long time. I think he may have been high or had a NyQuil hangover since I didn't get the sense he was 'all there' today. Needless to say, Gervais and Vine is one of my favorite places for happy hour with girlfriends or for a low key lunch, however today's experience greatly disappointed me."], ["Sherrie M.", "The food was great from what we were able to enjoy as we we forced to cut our dinning experience short do to an annoyingly LOUD patron. Kind of funny as we come from Twin Peaks next door and the working class establishment was far more QUIET and enjoyable than a \"ritzy upper class\" restaurant where apparently \"money doesn't by everything\". Hostess was a SNOB! but our waitress was AWESOME!"], ["Sheila F.", "We had a big party of 12. We had tohave ordered everything on the menu.  The filet was out of this world, she crab amazing, lamb yummy, salmon was great!!! Appetizers, wine, Brussel sprouts, asparagus, salad and cauliflower soup... I need new superlatives!!!!  Amazing food , great service and a memory to last a lifetime.  A wonderful, knowledgeable server named Kristin!!!"], ["Sarah L.", "Great food, great atmosphere, and knowledgeable wait staff. We ordered the bartender's special bottle of wine and were pleased with the selection! Must get the Brussel sprouts, garlic fries, Moroccan pork, and try their shrimp feature. Food is TASTY and the atmosphere makes it even better!"], ["John Robert B.", "Let's just start by saying that Gervais & Vine is one of my favorite places to eat in Columbia! I have eaten here half a dozen times over the past couple of years and I have never ordered anything that was great. The menu is very large, but my favorite items are: Seared Jumbo Sea Scallops, Petite Filet Mignon, Warm Almond Brie, Beef Paillardes, and Spanish Asparagus. MMMM....my mouth is starting to water just thinking about it! They also boast a large wine menu, which pairs nicely with my love of wine! If you visit Gervais & Vine during the weekend you'll dine to live music. The atmosphere is quaint, trendy, yet fancy. I will tell you that the prices are a bit on the high end, so we usually reserve eating here for special occasions and celebrations. Have something to celebrate, but don't know where to go? Look no further than Gervais & Vine!!"], ["S H.", "Gervais & Vine did a GREAT job welcoming our large group last night. They prepared a special vegan menu, set out a small spread free of charge and the chef seemed authentically happy to have us. (I did feel badly for the server who handled several odd, borderline rude questions from a lady at my table though.) I ordered the artichoke paella and was very pleased with it. It was simple but well seasoned, reminding me of Mexican-style rice. I also made sure to sample the fresh-made hummus and cornichons. (Love those!) The hummus had a nice, subtle mustard flavor. Thanks again to G&V for accommodating all of us and doing it so well!"], ["Stephanie S.", "Enjoyed a night out with the girls here. The wine selection is top notch and so it the food! We ordered 6 different items and tried them all. The garlic Parmesan fries and Brussel sprouts were yummy! Definitely check it out!"], ["Leah M.", "Excellent wine list with lots of Spanish options. We always start with a spread tray and the Costa Brava never disappoints. Keep in mind tapas are smaller portions, so be prepared to order a couple of rounds. Fingerling potatoes are a personal favorite, and actually come with enough to split. Go on a wine tasting night to chat up the expert. The price is good, and atmosphere cozy."], ["Adam B. J.", "Gervais and Vine was great when it was the only place in town that did tapas (small plates), but as owners, chefs, and managers changed it's hard not to ignore so did the quality.  I fully understand the idea of tapas, but some of the dishes here are just two small for the price.  I realize that you go here for an experience and you order several small plates etc, etc,etc.  My last four dining experiences would have me ranking this lower, but the history of the place makes me say A-OK, as I'm sure I will be back again. I just hope they step their game back up."], ["Julieann L.", "Pretty nice place to eat.  The tapas were really good and ordering a few to try out and share with the family is another great bonus too.The eggplant fries (which we saw many ordered, not just us, so a great sign), the lamb chops, filet mignon, the mahi mahi, and the seared scallops were an absolute highlight! One of the best scallops we ever tried. Downside was the pizza, we had better, and it didn't tasted that great honestly.  It was the last thing to finished andOur waitress was friendly and even when the first pitch of sangria tasted watered down,  she fixed it and it tasted somewhat better. I  don't rave about this sangria though. So the atmosphere was wonderful.Service was helpful and friendly.Tapas and dessert dishes were fantastic.Definitely a place to come and try"], ["Mona D.", "I love trying out new foods and wines. So coming on a Wed for the wine tasting of 4 wines for $7 plus tapas foods fits me perfectly. And the servers are very helpful in suggesting new wines to try.  Nice place to hang with friends."], ["Dale C.", "We usually have great food and service but this time we didn't.  Our spread that we ordered with drinks came out after our entries that we ordered 10 minutes after the spread.  One of our entries came out and it was not cooked.  We decided on something else and had to wait about 15 more minutes after we finished what we had on the table.  The dessert was good.  Will try them again because maybe an off night."], ["Gary G.", "Wish the food was goodWe went for a birthday party. The food was really not good good and the service was bad. The prices were high enough for a four star place but the food was more like lizards thicket."], ["Karen S.", "Gervais and Vine is one of those places I might not frequent on my own, but we had a group event there last night and our group was trying something different for dinner.  Gervais & Vine is probably more known for their wine(s) more than anything (they do have a wine tasting might during the week - but cannot remember day / time).  Me not being the wine drinker, I would more than likely not frequent just for wine tastings.Moving onto dinner.  Tappa = apetizers and was not sure if there would have been more of a larger dinner option than what was offered.  Most meals looked small compared to what is probably considered normal nowadays, but also reasonably priced.  I had decided to go for the safe bet and get a pizza.  I was more or less expecting my pizza to be a flat bread pizza (which it might have been - but crust was a little thicker than I was anticipating).  And there was LOADS of cheese on the pizza.  I am not much a a melted cheese person and the amount of cheese on the pizza was more than I cared for.Given the amount of people in our group (around 30), service was fairly quick after our orders was placed (but everyone was ordering when they came in - which was at different times).  There is a room towards the back of the room (where we were last night).  Not 100% sure if this room is used strictly for group events, or could be used as an overflow."], ["Angie W.", "Our server was really nice and he was very down to earth. The atmosphere was really comfortable but had a naturally formality to it. My daughter and I got stuck in race traffic and decided to eat there so we were actually under dressed. Regardless of our attire they were very courteous to us and we enjoyed our meal.We ordered scallops which were tiny but tasty.    We ordered the shrimp spread and it was very good. The fillet was very good. Eggplant fries were not very good- I think they should have used fresh Parmesan cheese and not powdered to enhance flavor. Overall my daughter and I were very pleased."], ["William K.", "My husband and I were not impressed by Gervais and Vine when we stopped in for a romantic dinner and wine. I am hoping that our next visit here will improve our regards for the restaurant, but it will be some time before that happens. There was not anything that overly impressed us, service was slower than expected and the wine did not color my memories of Gervais & Vine in a positive light. The best summation is to describe the pizza we ordered as one of our dishes. The Greek Pizza we ordered was not well cooked and in some ways could be considered soft. The dough just was not cooked well enough to serve as a base for the ingredients nor were the ingredients tasty enough to serve as the toppings alone. With tapas food, each ingredient, each dish, must boldly carry itself with spices and flavors. The flavors here fell flat about halfway through the palate and only satiated our hunger, not our desire."], ["David A.", "Loved this place. My new favorite in Columbia. Went with my daughter and her friend. We ordered a bunch of different dishes/tapas to share. All different cuisines and everything was excellent.Highlights:The flatbread with pesto was very good. The crust has a unique texture and it works!The mussels with chorizo were great. Nice sized portion as well.The hummus seemed to be blended with edamame. Not sure, but it was delicious.Had to get something not so healthy. Been trying hard to stick to my plan. When you cheat it needs to be worth it. The eggplant fries were worth every bite!Scallops were recommended by our waitress. I am not always a fan. These can be fishy. These were awesome. Melt in your mouth.The chocolate cake for dessert was devoured as well.Service, by Roxie, was very good. My only suggestion would be to space out the dishes more. Just about everything came at the same time."], ["The C.", "Amazing service and selection of wine.  We sat outside. The place was slammed but did not slow down the service or attentiveness of our server. Definitely went with her recommendations for food and wine and they were spot on!"], ["Brooke W.", "Great meal here, each dish we tried was good: gambas, Brussel sprouts, the she crab spread, and the meatballs. Plenty to choose from"], ["Catherine T.", "I've been to Gervais & Vine twice in the last month, and I won't be going back anytime soon. The service is terrible. There's a very nice man who I assume to be the manager, who serves as the hostess/bus boy/waiter - basically everything. He clearly needs some reliable help. The last time I was there was for a friend's birthday, we had a table of 7. When we finished our food, we waited so long for the check that a friend had to get up and go find our waitress. To give you an idea, we sat down at 8, and we didn't leave until 10:30p.m. And we all only had 1 or 2 drinks - it wasn't a crazy party by any means. The food is ok - nothing special, at all. The cheese plate is something you could easily create yourself from Publix. I had the scallops last time and they were horrible. They were served cold and I felt like they had been sitting awhile. I love the idea of this place, but it needs to be revamped, badly. There are plenty of better places in town."], ["Elissa K.", "Great date night place! We enjoyed our wine, pizza, crab dip, and moraccan pork throughly!"], ["Jennifer R.", "Don't come here if you're in a hurry.  A great place to relax with a glass of wine and have a few bites to eat.  Delicious! I had a great time!"], ["Tanner B.", "Love this place!  Everything I have had here was delicious and is always topped off with great service!  Usually start off with the cheese plate - there is a funky looking cheese that they have every now and then that is amazing - whiskey cheese.  2nd choice is usually the mussels - the broth I could bottle up and drink it alone.  Finally topped of with a pizza not sure what it's called but it's the one with all the meats.  Lol!  Defiantly a top choice for me in Columbia."], ["Tiffany S.", "What else do you do on Tuesday at 1pm while you're wandering around?The waitstaff and wine are top notch at this location.I don't remember our waitresses name but she has awesome hair and great knowledge of all the different wines on site.We left happy and wine(y)"], ["Vonnie S.", "I stumbled into this place one frosty night as they were one of the only businesses open after SC got hit with a nasty snow storm.  Service was awesome and quick!  I started with their brussel sprouts (delicious!).  They were cooked with warmed feta cheese and a great starter portion.  I followed up with the special for the day/season which was monk-fish with roasted potatoes.  I am huge fan of fish and hadn't tried monk yet.  To my surprise, it was light and it was cooked in a tasty wine and garlic sauce.  The fingerling potatoes were roasted well with the perfect amount of salt.I sat at the bar where everyone (incl the patrons) were friendly.  Because I sat at the very end near the cash register, my chair kept getting bumped as the wait staff went by.G&V is a quaint little place that I'd like to try again!"], ["JP S.", "expensive for what you get.  for 2 it was a wine by the glass x one for each.  3 tapas and one salad... came to $70 before tip.  Yikes.  Left hungry and filled up with a McDonalds Quarter Pounder.  Service was OK, a bit slow and the volume could be LOUD at times.  But would give it a 2nd chance,  Live music on Wed Night as advertised.  Parking could be an issue."], ["Ricardo S.", "This is not really a restaurant, it is a bar place with something to eat. Quality of some tapas are not so bad, the humus,  the cheese. But the crab was just too hot, and the duck is served with some fat on the top ?? Also, the portion is much smaller that  looks on the pictures here, and they charge $14, for the same money you could eat much more in a nice Thai restaurant. Service is not really good, and the only question asked when I was there was if I would like more wine (which meas spend more money). Don't really care about your satisfaction.DO NOT EVER ORDER PIZZA, then you realized in this place, pizza means some bread with some weird cheese on the top, no marinara flavor.In the end same woman that asked if I want to order more wine, Roberta RM Piroleau asked when I was leaving if I was happy. She seems to have no idea whatsoever about I was talking about, she patiently listen to me and gave me her card, asking me to come back. No promise of better service, just courtesy sentences like \"I am so sorry\" reminds, me an operator from a customer service of any call center.I do repeat, this place is nothing else than a bar, with no atmosphere like a Spanish tapas place, just a name and some words written in French (never specify in the menu what they serve you as \"charcruterie\" which refers to a delicatessen store, pork cool cuts, so I prefer not order it, I am sure was a wise decision, because I am sure was a good way to overpriced some cool cut of pork.If you want to get some drinks, go to a regular bar, Columbia has plenty of bars.BIG DISAPPOINTMENT !  DO NOT RECOMMEND TO GO."], ["Jay M.", "Coming from out of town for homecoming we decided to take our group out here after the game. We made reservations about a week in advance and showed up to the restaurant to find out they were closed for a private party. Don't you think they could at least call to let us know so we could make a reservation somewhere else? I assume the service inside would have matched this kind of treatment so we will avoid this place on our trip for the next game."], ["Christopher K.", "This was my first time Gervais & Vine. As a vegetarian, I found a very good number of small plates to be able to make a meal and probably come back several times without repeating too many.  I went with a small party and split a bunch of dishes - as you should when eating tapas.  The food overall was good but I kept thinking that some of the dishes were falling just short.   For instance, the brie plate would have been vastly improved had the brie been baked and served runny.  The stuffed grape leaves were good but could be easily improved by adding fresh mint, currants or toasted pine nuts to the stuffing for a little more flavor pop.  The pizza crust needs to be completely changed and made in house to take advantage of the oven that is boasted about on the menu.   Expect to eat about three small plates per person.  You might be able to get away with two if you choose particularly heavy items.Minor complaints aside, I found the atmosphere festive without being too loud and the wine list very nice.  I'll probably head back within the next month or so to try some of the dishes we didn't order."], ["Jennifer M.", "We ended up here based on the menu we saw here on yelp. As it turns out, it was the wrong menu (somehow, another restaurant's menu shows up instead). However, it was the happiest mistake ever! We were there with a small group for a work event and decided to stay despite the menu mix-up. The tapas were great sizes, and fantastic flavors. Everything we had was amazing- meatballs, shrimp, lamb, duck (my favorite), olives, cheese and more. The wine selection was good without being overwhelming and all-in-all it was a great value."], ["Emily C.", "This place is adorable, very chill and super friendly. We got great drinks and recommendations for places to go dancing. Order the  Moscow Mule and ask for a shot of their home made ginger syrup to go in it. The food is excellent. Highly recommend!"], ["Ethan P.", "First off, I feel I should say our waitress was awesome.  She was attentive and apologetic. She did an excellent job considering how understaffed the restaurant was. We ordered seven dishes but had to cancel one because the service was incredibly slow. Thumbs up for the she crab dip and the spicy gambas. Conversely, the filet mignon and the brussels were mediocre at best. The filet tasted as though it was thrown on the grill haphazardly after being cut. It was dry and boring. The brussels were overcooked and the goat cheese was an unnecessary addition. The bacon worked though. Notwithstanding slow service and a bit of disappointment with some of the dishes the wine selection was quite interesting. Hopefully this was a one-off that won't occur again. Our advice: do dinner on a weeknight for a better experience!   Stay away from the filet!"], ["Damon S.", "LOVE this restaurant! My wife and I are fans of tapas and the food here is fantastic. Very nice ambiance also. Staff is friendly and prompt every time we're there. Only reason I took a star away is because they are a little stingy with the wine, and actually have lines printed on the wine glasses for the bartender."], ["Alli O.", "This restaurant has a very fun atmosphere that would be a great place to listen to a live band and enjoy a glass of wine.  However, it is not a great place to have dinner.One of my friends had her boyfriend visiting from out of town and she wanted to have dinner and go to a few bars in Columbia.  She stumbled upon this place via Yelp and thought it would be a great option.  It would have been if we came to Gervais and Vine for wine or a small appetizer, but for dinner I was incredibly disappointed.  My husband and I ended up paying more than we would have more a normal dinner on a few bites of food!  (And my salmon was not cooked all the way through!)If you are looking for atmosphere and wine this is the place to come... dinner not so much!  The garlic-parmesan fries were good if you go!  :)"], ["Sherlene L.", "This place is one of the best in Colombia SC sat at the bar and felt so welcomed! The manager was people friendly!! He sat there an talked to me personally. The food is great. Chefs are also people friendly. I felt so welcomed. Truly great customer service. The way it should be anywhere you go."], ["Adam P.", "Having lived in Columbia for more than a decade, G&V has always provided a consistent comment upon leaving, \"why don't we come here more often?\"The food is creative, the specials are always wonderful, the wine and beer are hand selected and awesome values."], ["Mike M.", "I must say, I've missed this place! About 10 years ago, my job had me traveling in this area a few months out of the year. I got to know the restaurants in Columbia very well! Gervais & Vine was one of my favorites! For the uninitiated, tapas consists of small portions of different dishes meant to share, like appetizers, but the whole meal is that way! Today was a blast from the past of sorts! I started with an Ensalada Verde, basically mixed greens w/ balsamic vinaigrette. Next I tried Grilled Brussels Sprouts with Bacon, Feta and a White Balsamic Reduction. This was a stretch for me because I've never had Brussels Sprouts before. I have to say, personally, that the addition of the other ingredients didn't make it particularly palatable. I only managed to eat two of the ten sprouts! Luckily, the waiter was able to remove it, even though I was perfectly ok with it remaining on the ticket. I had to add Garlic Parmesan fries mainly to get the taste of Brussels Sprouts out of my mouth and rounded out the dinner with Herb Grilled Lamb Chops! Perfection! All in all, it was a very good meal. If you happen to be in the neighborhood, give Gervais & Vine a shot! You won't be disappointed!If wine is your thing (it isn't mine), I hear this restaurant has a very good wine selection!"], ["Richard H.", "Really well done. Very relaxed atmosphere, fantastic tapas, and great wine selection. Not quite like being in Spain but they're trying."], ["Magan C.", "A very cozy find on Gervais Street, perfect for that romantic evening or intimate gathering with friends. The wine list was extensive enough to accommodate anyone's fancy and there was a grape to compliment every entrée. We started with the Costa Brava and it was an exquisite blend of creamy cheese with hints of bacon. Loved it! We finished with the Gambas (be sure to ask for extra bread to sop up the sauce). The Gambas had just the right amount of spice and bold flavors with tender succulent shrimp cooked to perfection. Amazing! Can't wait To go back!"], ["Annie F.", "Delicious tapas I would recommend the gambas-great sauce, the artichoke hearts and the garlic potatoes! Delicious delicious"], ["Swetha G.", "I.had.TWO.foodgasms.tonight. Holy f$$##!!!I've been to Gervais & Vine a handful of times over the last few months but tonight the food was an A++, the best I've had at the place, EVER!  My friend and I ordered four dishes and split a dessert and everything was phenomenal.  The eggplant fries were soo much better this time than the last time I had them.  The crispy exterior and tender and juicy interior were equally PERFECT.  I absolutely loved the side honey yogurt dip and romesco sauce, they both were A-MAZING! I got my first big foodgasm from this plate alone! I also had stuffed grape leaves that were mouthwatering.  The Roman pizza was just as good today as it was when I had it the first time.  The spinach artichoke spread was heavenly.  But my ultimate and final foodgasm came from the Chocolate Hazelnut Torte, which was THE best way to end an already over the top dining experience. I fell head over heals for the chocolate fluffy ecstasy, there's no other way to say it.  Todd my man, you've got mad culinary skills!"], ["Joe G.", "This place is an absolute joke. My first experience at Gervais & Vine consisted of many different plates of overpriced, undersized, and mediocre (at best) food that was shared between a group of six friends. We came for \"jazz night\", which was listed at two different times on the menu and website, but that wasn't an issue since there was no jazz anyway. Our waiter told us that sometimes they play jazz over the sound system, but that there hadn't actually been a live jazz band in a long time. When asked how their sangria was (it is watery, flavorless, no fruit), our waiter told us it would \"get us drunk\", and while we were all pretty taken back by this unprofessional remark at the time, in hindsight- I wish it did. Perhaps then we would have been intoxicated enough to not care about the rubbery, insipid cheese plate and cold empanadas. Our group of friends had multiple Living Social deals between us, so we all fought over who could use their's on the check (only 1 per table), because nobody wanted to go back. Unfortunately, I did not win that battle, so a couple of weeks later my girlfriend and I went back to burn the Living Social deal on some wine and dessert because how bad can that be, right? Bad. It can be real bad. After a brief glance at the uninspiring, grossly overpriced wine menu, we decided on ordering a couple of glasses of port to go along with dessert. Being a fan of both the Sandeman Ruby and Sandeman Tawney ports (which they had listed on their menu), I asked our waitress how the Sandeman Reserve compared to the two. Laughing, the waitress told us that she has no idea, because \"usually, people don't ask about the dessert wines so we sort of just pour them whatever\". She said that she wasn't even sure if they actually had those wines in stock. Nevertheless, she went in the back to see if she could find out any more information on it, and came back with a sample for me to try. She said they did not have the Ruby nor the Tawney in stock, and the wine I was about to taste wasn't actually a Sandeman Reserve, it was \"something else that they just say is Sandeman\". After I asked what wine it was then, she went in the back to fetch the bottle, came back with it, placed it down on the table, and said, \"this one.\" For dessert, we ended up ordering the almond joy bread pudding, which was miserable as well. If you are looking for a tapas style restaurant in Columbia, do yourself a favor and go elsewhere. 116 and Mamas and the Tapas are both better options, as is just ordering a few different things from the McDonald's dollar menu and calling that tapas."], ["Anthony D.", "I am waivering between 3 and 4 stars.  I ended up with 4 because it was a cool place with friendly people.  But it was the pianist on site was so unbelievable talented that ultimately I have to go with four stars.  I wonder if the bar knows how good he is?!Started with a mixed green balsamic salad with Gorgonzola, strawberries and spiced almonds.  Excellent! Something so simple but was perfect!  Olives were great.  Flatbread was doughy and tasteless.  The pizza looked great on the menu.  700 degree stone oven, etc. Call me a fool for ordering pizza in SC.  It reminded me of airport pizza.  I guess I expected a thin crust, brick oven charred pizza.  Nice wine and beer selection and outdoor seating too.  I'm sure there are better places in town but worth a try.  Just don't get pizza if you are from NJ or NY like me."], ["Thomas V.", "I came once with friends and shared a bunch of tapas and a bottle or two. The wine pricing and selection is OK. But the food is poorly executed. It's one of those places that looks nice and doesn't taste bad but you leave wishing the ingredients were a touch better and the preparation was much better. Not a bad place but I would only recommend it if you are looking for a new place to try. Hopefully for you it turns out a little better than me."], ["Jeff B.", "What a wonderful owner.  I love to sit at the bar and have some small plates.  I am really excited that they are now open for lunch.  I look forward to returning soon."], ["Sam T.", "Tapas Tapas Tapas...wonderful Tapas.  They aren't like spectacular, and they certainly aren't for someone who is hungry.  If you are hungry...maybe...go to another restaurant.  If you are enjoying a good time with friends or family come to Gervais and Vine.  I have had better Tapas before, but any of their meat courses are very well prepared.  A decadent duck, fantastic fillet, and scrumptuos sirloin.I personally do not want to watch someone prepare my food, and that is what happens at this restaurant.  I also wish they had a risotto option or more pasta/rice options.   All in all...they are okay"], ["Jennifer B.", "I really enjoyed everything I tried at this restaurant. Great vibe and nice staff :)"], ["Emery E.", "Wow! Having lived in Columbia for only 6 months we finally found our spot! My wife and I get out about once per month to eat childless. We were suggested this restaurant to eat at, and they more than delivered. We love great wine, and they had delicious wine at great prices. The food was well prepared, and delicious. On top of that the atmosphere was brilliant. Not your quiet  whispering kind of place, everyone in the restaurant was having just as enjoyable of a time as we were. We typically go out and spend a lot more on subpar food, so it was a relief to have great food, great wine, great service, and a bustling atmosphere on Saturday night and spend less."], ["Erin L.", "great tapas and great sangria"], ["Lisa H.", "Smoked salmon...fabulous! Eggplant fries are the best!!! Gambas shrimp and seared sea scallops...out of this world. Super busy even on Monday night. Sat at the bar so pretty good service. Highly recommend this restaurant!"], ["Emily E.", "We tried the bruschetta, herbed flatbread, lamb chops and beef paillardes which were all tasty but the service gets an F.  Our food arrived at a good pace, however getting the attention of our server after that was virtually impossible.  It took 5-10 minutes for drink refills, and at least 10 more to get our bill.  She would walk by our table several times, clearly showing preference for larger groups (we only had 2).  My recommendation: only eat here if you have a group of 4 or more and/or have a lot of patience!"], ["Shon I.", "Great little place with some wonderful food. Really nice eggplant fries and fried Zucchini flowers. If you set at the bar you can watch the chef prepare many of the tapas"], ["K W.", "Unfortunately the only thing good I can say about this place is the atmosphere is warm and the drinks are cold.  The mussels were slimy soaking in a bowl of juice that resembled the taste of the water the mussels were washed in.  The meatballs tasted frozen.  Lastly, the flat round was not impressive, store bought with old ingredients added.  I will not be back anytime soon for the food!!"], ["Marcus M.", "The food, music, and wine...all on point!"], ["Rich M.", "My fiancé and I came here for our last date before getting married. I'm not sure if its possible for us to have had a better time. The tapas are the best I've seen in Columbia. The service could not have been better either. We loved our visit and are definitely coming back. I can not recommend Gervais & Vine enough."], ["D G.", "Food was great....service was TERRIBLE!!!What we thought would be an nice dinner took over 3 hours...there were only 2 of us. Our food took forever and we rarely saw our waitress. Yeah it was Saturday and they were busy...but don't you want your restaurant to be busy? They clearly don't have the capability to handle that sort of situation. I probably wont go back. There are too many other (and better) restaurants in Columbia."], ["Dave M.", "Great wine and tapas bar. Never a bad meal."], ["Jen M.", "Great wine and tapas! A fun place to grab dinner and drinks. The specials are usually pretty great."], ["Kirsti N.", "A gem in Columbia that is just as much fun sitting at bar watching the tapas get cooked as it is eating them. I have yet to have a bad meal here, visiting when I'm I'm town from Charlotte."], ["Gunnar P.", "I am a regular here and just have never taken the time to give them a review. I was there again on Saturday evening. The food was good as usual. Service is always great and they have and excellent wine list. It is one of my favorite places to go in Columbia. I highly recommend it."], ["Thomas L.", "Great restaurant! The wait staff is very friendly and laid back and the food is amazing! I will definitely be back again. I only wish they would take reservations. The wait for a table was a little bit long but worth it in the end (45 minutes)."], ["Kevin C.", "I have loved Gervais and Vine, so when my parents came into town, I took them there tonight. After being told our wait would be 30 minutes, it was 2 hours. We only waited because we kept being reassured we would be seated soon. Once we were finally seated, our table was cleared (slowly), we had to ask for menus, utensils, plates, and water. We were stranded for 15+ minutes without a waitress. She was the highlight of the night. The food was good too, but after an hour and a half we still hadn't received it all (it was all ordered at the same time). So we asked to speak to the owner who made excuses without actually taking ownership for the poor service. They did finally decide to cover our tab, which was the right thing to do, and while I love the food, and it was still good tonight, I have never felt more disrespected by a restaurant and it's owner. This was a 4+ hour affair and I never got my order."], ["Paul B.", "We moved to Austin from Columbia, and Gervais & Vine is one of the VERY few things that make us miss SC.  We've always had a good time when we went - frequently, a little too good :-) .  It is a Tapas restaurant, so don't expect huge portions.  Expect exceptional food & fantastic wine.If they still offer the wine club - I cannot, repeat CANNOT recommend it highly enough - it took us from total wine n00bs to, well, we're still not experts, but dammit, we're certainly had fun learning!"], ["Sally B.", "This was a staple restaurant for us when we lived in Columbia. I have NEVER had anything bad here. Kristian and all of his staff are AWESOME! They are very knowledgeable about wine..duh AND the tapas is incredible! Try it all!!!Nothing beats nice weather, sitting outside sipping some yummy wine while munching on some delectable tapas! Perfect!Also of great mention is the Wine Club!! Two words..JOIN IT!"], ["Nicole S.", "My lovely friends took me here for dinner the other night, and it was delightful.  Cute little place!  Great ambiance and they had a great little jazz duo playing as well.  The staff was very friendly and helpful with the menu and drinks.  The wine list was great and quite affordable (of course, I'm used to NYC prices).  We started with a trio of spreads, The Roasted Garlic-Buttermilk Blue Cheese, Costa Brava (blend of Smoked Gouda, Shrimp and Bacon), and the She Crab.  This started a heated debate of which one we all loved more, there were a lot of taste tests to make sure.  The Coasta Bravo won hands down, but everything else was a close second.For our dinner we had an array of delicious dishes.  The scallop and pork plates of the day were fabulous.  The Petit Filet Mignon with Feta and Balsamic Reduction was very nice.  The Grilled Shrimp with Sun-dried Tomato Pesto and Garlic-Parmesan Fries with Spicy Aioli were both delish.  The biggest disappointment for me was that the almonds on the Tapas Combo - Spiced Almonds, Olives, marinated Manchego Cheese, were just regular almonds and not marcona... which would have been more traditional and tastier.We were too stuffed to desert, but I'll be sure to try it next time I'm in town!"], ["Emily E.", "The lamb chops, herbed flat bread, bruschetta and beef paillardes were tasty but the service was horrible!  Our server spent all her time with larger parties and ignored my party of two.  We waited about 10-15 minutes to get refills and the bill. When she brought the \"bill\" there was no check in there so we ended up waiting even longer. My recommendation: only eat here if you are with at least 3 others and/or have a lot of patience!"], ["Curt K.", "Nice atmosphere! I walked in, sat at the bar, had a nice tempranillo and listened to some nice, live music. The staff was courtious as well. I'm looking forward to going back and trying more on the reasonably priced menu."], ["Amanda W.", "Have found some really nice new wines! I'm a 'Red Girl', and this lovely little place has introduced me to some reds I never even knew about! The selection of tapas is so cool - I have tried just about everything on the regular menu, and I have to say the olive plate and the cheese plate are my fav!!! I love the fact they have nightly specials (at really great prices), and the fact that the owner/chef emails us regulars with what's been going on in his awesome cooking/wine world and what's coming up at his 2 restaurants. A+++ I LOVE going there!"]], "Nick's Gyros & Grill Seafood": [["Alyssa M.", "I always get a philly or wings. They've been so good that I haven't bothered trying anything else. It's usually packed on weekends but staff is friendly and it's always worth the wait."], ["Jeff M.", "My wife and I saw \"Nick's Gyros\" as we were passing by. I asked her if she wanted Greek. \"Sure!\"What we found was a Americana/Soulfood fast food restaurant with one Greek thing on the menu: the Gyro combo (relegated to #4). Other things on the menu were shrimp, crab legs, hot wings, burgers, fried fish, Philly cheesesteak, etc. I like all these things . . . But I was expecting falafel, Greek salad, babaganoush, pita, olives, baklava, etc.There was a tv in restaurant tuned to a James Bond movie. The volume was so loud we could barely hear each other talk. We waited at least 15 mins for our gyro combos. When we got them, the fries weren't ready and the gyros were lukewarm. The guy behind the counter said he would bring the fries out to us. After finishing off our gyros, we still hadn't got our fries. My wife went up and asked for them. The employees were cutting up and joking and had forgotten.The gyro was pretty tasty, but the overall experience ruined it"], ["John O.", "Good food ,,, nice service ,,,?I like nicks in St. Andrews The nice crab legs And good gyros , Philly cheese steak is the best in town"], ["Simon T.", "Don't bother reading.The menu needs just one thing:the gyro with fries."], ["Dy Y.", "The shrimp and oysters were out of this world delicious!  Friendly service. The coleslaw tasted like it store bought. Yuck. Only bad thing there."], ["Tony S.", "Grt place to eat.. One of my favs..  Ordering me some now.. lol Yelp is dumb and keep forcing me to say more. Fml hitler is alive????"], ["Willie D.", "Great items on the menu and food is tasty and fresh.Dinning area is clean and great service."], ["James I.", "Misses one star simply because the drive thru line is always so long.  They have the best gyros and chicken wings.  They cook them hard (warning you now) so if you like them that way you will love this place.  I do wish they could have more sauces but you can't expect much more from this sort of place.  They have the typical kinds.  I've been here at least 10 times and once they forget to give me my drink and the other time the chicken was cooked a little too hard.  I thought I was eating horse meat.  But the other 8 or so times have been so great it's hard to complain.  Recommended."], ["Taylor H.", "The gyros are really good, but this food has to be the second greasiest I've ever eaten (only second to Five Guys). If you order take out, your fries will be soft by the time you get home because they put a bunch a hot, greasy fries in a very small paper bag and close the top."], ["Tiffanie C.", "The good:  Chicken livers awesome! Gyro looks good but haven't tried it yet. Fast, friendly service with a smile . French fries are thick cut and not soggy. Clean interior, didn't visit the bathroom.The bad: my fries had a fishy after taste which made me think maybe they use the same fryer for all fried foods. Not bad if say you're frying chicken or egg rolls, but I'd say. Segregate the seafood yeah? I'm just not into fish flavored French fries...."], ["Don B.", "The food was tasty we had wraps and they were substantial; but the wait was way too long. about 30 minutes on a friday afternoon. Would not return if I were in a hurry."], ["Elizabeth H.", "Best gyros I have had since we moved here. No where in the Columbia area have we found gyros cooked the right way, on a spit, except for here. Believe me, we have tried them all. Far above any other gyros in this area. Staff was awesome and welcoming."], ["Iris D.", "The staff who took my order called it \"Jy-row.\" Enough said."], ["Jon F.", "Good place to go late at night to have a quick bite to eat.  Good prices.  I would recommend this place after having a few beers at night."]], "Taziki's Mediterranean Cafe": [["Adam B. J.", "If you like fast casual dining and Greek/Mediterranean food, Taziki's is a place you'll want to check out.  The food is good and it is fast.  I've had the hummus, the dalmades, the chicken lemon soup, the lamb gyro, and the chicken gyro.  All I'd order again.  My wife likes the \"Chicken Roll-ups\".  The sides are good too.  I always get the cucumber tomato salad, but my wife says the fruit cup isn't to shabby.  A little to much filler melon, but better than canned fruit some people give you.  Wish there was a location closer to our house.  Great quick dinner pick-up food, with lots of healthy options."], ["Anna D.", "overall experience was pleasant. i feel like i spent a little more money than i thought i would but the service was so great i don't mind. the cashier was such a sweetheart and even came by afterwards to ask if my hubby was okay with the side i choose for him (rice) and she even offered to change it if he wasn't happy.the two of us got lamb gyros and for my side i got the cucumber and tomatoes and like i said, hubby got the rice. we both enjoyed the food but i do wish that the pita wrap was softer. it was pretty hard and i love fluffiness. it's nothing to dock off any stars for since it's personal preference. I would suggest any lamb lovers to try it. it's tasty and light and you leave the restaurant not wanting to roll out."], ["Chad A.", "Very consistent gyros and prompt service. I usually get the grilled lamb gyro. However, the turkey club ciabatta, and beef tenderloin are crowd pleasers as well. You can also never go wrong with their dolmades plate. Best of all.......being a Soldier, they offer a 10% Military discount. It is a really great place, go try it!"], ["Rachel O.", "Taziki's has definitely grown on me.  I've been 3 or 4 times now and I must admit that I was a bit iffy on it after my first visit but every other time as been great.The last time I went I ordered the hummus with pita chips.  You can actually order it with toasted (crunchy) pitas or soft warm pitas.  Soft and warm please!  I didn't realize this but asked after they already brought us the crunchy ones and they replaced this quickly and with no extra charge. They were delicious and the staff was so nice!I ordered the Chicken feast with potatoes for my meal and it was also delicious.  The taziki sauce is totes yum - not super thick or super runny... just right! The potatoes were well cooked and seasoned (but a bit sparse... maybe that was good since I just carbo loaded on all that pita bread). Chicken was also well prepared and moist, served in strips. It also came with a Greek salad.  I felt like it was a well rounded and healthy meal. It's great for lunch or dinner! Don't miss out on that baklava or cake along the divider where you order too!"], ["Brandy B.", "Overall my experiences at Taziki's have been good.I've gotten to-go once and dined in once.On my first visit we ordered the veggie gyro w. the tomato/cucumber salad as a side, taziki dip, kid's grilled cheese w. a side of fruit, and greek chicken salad. (Combos and kid's meals come with plain old salted \"ruffles\" type potato chips and a side).The gyro didn't travel well, by the time we got home the juices from the grilled veggies had soaked thru the pita, so it was kinda messy (I'd order it again, but for dine in only).  I thought the taziki dip was too runny and didn't pair well with the baked pita chips.  My son loved his grilled cheese, and fruit.  My dad liked his greek chicken salad.2nd time, my bf and I dined in.  He ordered the lamb gyro w. the tomato cucumber salad, I ordered the salmon greek salad and we split the spicy pimento dip with soft pitas.We took our number and sat outside, I was wondering how that was gonna work out since you seat yourself and the servers have to find you - it went fine, there wasn't a long wait at all.I personally didn't think the pimento dip was spicy at all - it was more mild with the sharp taste of the cheddar, not bad, but I've had better... we didn't finish it.My bf loved his gyro and the tomato cucumber salad (the feta adds a nice twist).The salmon on my greek salad was cooked perfectly (the seasoning was a little heavy when combined with the greek dressing that comes with the salad), the salad was fresh, colorful and light - just what I was looking for!It's a nice spot to check out before shopping at Whole Foods!"], ["Mackenzie S.", "Good, fresh Mediterranean food. It's similar to Zoës Kitchen. I especially like the basil pesto chicken gyro. My mother ordered the pimento cheese sandwich which was equally yummy. A downside: they're stingy with the potato chips as a side and the baklava I ordered was stale."], ["Candace B.", "I eat here practically every month & have not ever disappointed. The veggie gyro is amazing, as is the greek gyro! Service is fantastic and I love the outdoor seating."], ["Derya S.", "I really liked the food. The meat was juice and tasty. The service was nice. Good price for what you get. The only thing I would change are the Dolmades. I never seen them this big as well warm. They are much better cold and served with some lemon juice. The taste was fantastic, but they fell apart due to size. We will be back."], ["Gwen M.", "I ordered a side or rice and humus it's veggies. The humus was way too salty and the squash had a weird texture like it wasn't fresh. The rice was also oddly salty and the portion was extremely small. The service was nice but I think overall it was overpriced"], ["Mona D.", "Interesting concept: you order at the counter, they give you a # card, you then choose any table and post the number. Then they bring the food to you when it's ready and take care of you like a full service restaurant. This was my first time and when I told the cashier she was extremely helpful on deciding what to order. I settled on the chicken gyro with basmati rice, then changed to potatoes at her suggestion. The cashier ended up serving my food and brought me a side of the rice as well to try at no charge! Nice! The gyro was loaded with juicy chicken, not overdone with seasoning but tasty. There was tazicki sauce on it but not a lot so I paid 20 cents for extra and I'm glad I did (I tend to like a lot of it). The roasted potatoes were flavorful but not my favorite since I tend to like them browned more. These were fully cooked and soft but not a hint of browning. The basmati rice was good but bland all by itself. If you got a meal where the meat and veggies were served over it then it'd be great. But as a side not so much. Gave them 4 stars just because the sides weren't spectacular. All in all it seemed like a pretty good value for the prices, great customer service and a nice ambience (I sat on the patio)."], ["Angie W.", "Customer service is good, Katrina is always smiling.Mediterranean salad, lemon chicken soup, dolmades, salmon are all delicious.The atmosphere is easy going and relaxed."], ["Mitch K.", "Really nice place with good menu, plenty of drink refills and lots of management attention asking if you need something and just checking on you.It is Greek and otherwise Mediterranean, as the title suggests, so they offer pitas, lots of salads and a variety of hot plates. Portions are reasonable and so are the prices.Order at the counter and they take care of you from there.  Food is prepared when you order it, so if it involves meat cooking, there is a bit of a reasonable wait.Super for lunch as there is plenty of room and small groups can be easily accommodated..The decor is a bit \"cold\" with lots of concrete, metal tables and chairs and glass.  Very spartan, but you are there to eat, not for the ambiance, so just enjoy."], ["Josh P.", "Taziki's is very good. The food is quality and made with fresh ingredients and the service is good. The atmosphere leaves a little to be desired, but the restaurant is clean and the food comes quickly. I've had several menu items and liked them all, but I absolutely love the Grilled Chicken Basil Pesto Gyro. I get a side of tzatziki sauce with it. Watch the olives that come on the salads. One of mine had a pit in it. :-)"], ["David N.", "So on my adventure in the good ole capitol of SC, I decided to try Taziki's...don't know much except what was provided in Yelp.  First impression not bad for decor and the smell of delicious food was in the air. The young man at the register needs to learn some customer service skills, especially in the food industry.  No help on what was good to eat or what I should try first.  Ordered the beef tenderloin Greek salad...where's the beef!?! Taziki not bad though.  For a ten dollar plus salad with two morsels of beef....unsatisfactory for a growing man!  Taziki is not bad though and worth the try.  Oh and ordered bottle water to find out they were out...so had to get refunded on that....manager on duty was not apologetic at all.  Maybe the staff just had a bad day."], ["Diana W.", "I ordered lamb gyro with taziki dip appetizer.  Everything was delicioso!! Will come again"], ["Arun M.", "The food is fresh, the people are friendly, the prices are reasonable and service is quick. They have plenty of seating including large long tables. I don't crave this type of food often but if I do I would know to come here. The fish dish was amazing and I would recommended it to anyone looking to eat lite. The only thing that disappointed me was that they serve their hummus with pita chips they make however I prefer mind with pieces of soft pita. Nonetheless once you come here, you'll know why its a keeper."], ["Danielle R.", "Quite tasty. Today I had the grilled vegetables platter--asparagus, tomatoes, squash, onions, and red peppers. I wish the onions had been sliced thicker and I'm always up for more asparagus but I was still quite happy."], ["L R.", "Cool place. I have seen it all the time. A neighbor mentioned that it was good and today I was hankering for some Mediterranean, so figured why not and drove there from campus. The lunch time rush was pretty crowded. Not so much that it annoyed you, but there was a good enough wait which is always a nice sign. I had already peeked at the menu online and knew I wanted the dolmades since stuffed grape leaves are one of my favorite foods of all time. Anyway, the ordering process was really quick, ordered the dolmades plate and an unsweet tea. Just a little over $13 bucks, so not super cheap, but not expensive either. I asked if they would be able to see me if I went outside, and the very nice cashier said that they walk all over the place so they'd find me. :) I got my number and went outside.The food came out faster than I had anticipated. I was seated for five minutes before a server came out to give me my food. YAY. I was anticipating my dolmas all day so I saved them for last. The meal comes with a Greek salad, some dressing, their 'taziki' sauce, and a crispy pita wedge. The wedge is crisp, like a cracker, not soft and chewy like I would have preferred but it was still good. The salad was GREAT and the dressing was YUMMY. I really enjoyed that and next time I will get the greek salad and a protein. Then the dolmades. Unfortunately they disappointed me. :'( They weren't tightly wrapped and were awkward to eat as a finger food. The leaves kept unwraveling. I tried a knife and fork and that was worse. Oh well, I went with it. The 'seasoned' rice was yellow (turmeric?) and not very flavorful. The grape leaves didn't taste nice and brine-y like I like. But it was very filling thanks to all that rice. At the end of my meal, I realized that I didn't have a drink. I asked one of the runners and she said that I was supposed to pick it up on the counter, but no problem she would pick it up for me. She was quick on that. I usually get unsweet tea but she gave me a sweet (not her fault - I didn't think to specify) and it wasn't the usual diabetes in a cup that is the norm. Still too sweet for me, but palatable enough on this warm day. While I didn't like the dolmas too much the service was EXCELLENT and the staff and runners were just SO FRIENDLY and all smiles. It was a great experience and I will be back! Just remember to pick up your drink at the counter before you sit. ;)"], ["Gregory A.", "The food here is awesome! You will get addicted to their famous tomato chutney aioli sauce. I put it on everything! They also give you large portions. I ordered the Herb-Roasted Pork Loin and it comes with not one, not two, but THREE delicious pork loins! Most places you would get one or two at most. The staff is great, very friendly and helpful. Sorry no pictures. I have to dive right in..."], ["Jodi B.", "Always a great meal here! Super fresh ingredients and friendly staff. Their Mediterranean salad with salmon is my favorite!"], ["Karen S.", "I am not much of a Mediterranean Food Person, but some of us had lunch here yesterday.  Concept is that you order at the counter and they bring your food out to you (unless you are ordering takeout).  Ordering counter is towards the back when you walk in and was not obvious where the order counter was when you first walk in.  Also, since you order at the counter, most places I have eaten at where you order at the counter, menus are posted on wall.  I did not see menu on wall and located paper menus. I do have to admit, it seems like there was a limited menu selection.  Prices seemed steep for what you got.  I paid $10.00 for my meal (which was a chicken sandwich, limited side of potato chips, and a side - which I chose the potatoes, and  i soft drink - soft drink was not part of the sandwich / chips / potato combination), and when I got the meal - almost looked like I had ordered a kiddie meal.  Upkeep of restaurant was nice - and I am sure it helps that the place is relatively new."], ["Eric W.", "My first visit here. I was not overly impressed with my gyro. Other meals look very good. Salads look very filling. I might try it a second time."], ["Bailey B.", "Great fresh food! I have always enjoyed my experience when I have been here, good food,"], ["Dorothy K.", "Good food for the price but the service was non-existent once my plate was served, so I'm wondering what the tip was for. I'll come back but will adjust the gratuity according to my experience."], ["Simon T.", "Decent food and drink.Atmosphere is terrible. Chaos. Have takeout."], ["J S.", "Always great , fresh ingredients and friendly service. Always try to eat here when I come back to town."], ["Christina S.", "Tazikis has become a favorite of mine. I love the lamb gyros, Mediterranean beef tenderloin salad, the tilapia feast with rice basmati rice and greek salad. Have never had a bad meal. The salmon feast is awesome, too. My father and husband have eaten the pork loin feast and it is huge, and they both enjoyed it. It is usually the first place that pops to mind when we want to eat dinner out."], ["Tj R.", "I went on a visit to cola and had the portobello chicken sandwich with cucumber tomato salad. Very good. Very fresh. Under $10, but I drank water. Restaurant was very clean, open air feel. Outside seating."], ["Rick T.", "Awesome chicken ! Awesome service !"], ["Eric S.", "Taziki's is our go to Restaurant for Mediterranean semi-fast food. We visit here at least twice monthly due to the food."], ["Joe A.", "Food is always great. My wife and I have been at least a dozen times and I really feel comfortable recommending everything on the menu. You just can't go wrong. Fast and friendly service too.  One of our favorite spots."], ["Marion L.", "Went there this afternoon for a Sunday brunch. The food was great. I order the signature Taziki pasta it was creamy and satisfying. My mom and sister ordered the herbed pork loins and they have this white sauce that's amazing. the service was great even in a packed house. I'm definitely going back."], ["Katharine K.", "I wasn't blown away by the Caesar salad and won't be getting it again, but my brother really enjoyed his gyro. The atmosphere is casual and modern."], ["Jamie B.", "Why Chick-Fil-A keeps beating out Taziki's for Free Times Best Service is a mystery to me. If you're going to give it to a place with counter service, it should at least go to a place without an obvious script.Everyone is always unbelievably nice and helpful, and it really does make a difference. The salads and gyros are all what you'd expect (but delicious), and I've always had a good experience."], ["Sateesh N.", "It's alright.. Nothing different from a typical Mediterranean restaurant.. Food was tasty.. Took less than ten minutes.."], ["Brittany W.", "My GO TO place for dinner. I drive from Columbia to Sumter everyday and when I come back after working out in the evenings I typically want to grab something quick and fast before returning to my hotel before I sleep. I literally carry around the Tazikis menu in my purse and have their number on speed dial. I call in my order and by the time I get there to pick it up it's normally ready and if I have to wait it's never more than 5 minutes. The food is really good. I try to eat healthy and avoid a lot of fast/greasy food so the selection of salads is awesome. When I want to plurge and get a feast it's normally a good size of protein with some rice that I will say, as a non rice fan, I do enjoy.Oh, THE HUMMUS IS TO DIE FOR. Sorry, in case you didn't get that the first time: THE HUMMUS IS TO DIE FOR!!!! An order of that with the SOFT (not baked) warm pita and I am in heaven. ...Gosh darn, salivating right now! Definitely a good choice for a meal, I haven't ever stayed to eat but it's cozy with plenty of space and a great atmosphere so if I had company I think I'd definitely venture out to eat out."], ["Billy H.", "I've been here several times and it is nice on decor and friendliness but the food is bad to mediocre. But they're new! If this is one's introduction to Med/Greek food what a pity. There's lots better places in town. I have tried every side except basmati rice. The 'new' potatoes were a joke, squishy and burned. The fruit looked so unappetizingly stale I was afraid to eat it. But it's fairly crowded for lunch, and must be 'first-timers'. I will not go back."], ["Lindsey B.", "I have eaten here several times.  The first two times I had the Greek salad with salmon and a glass of wine.  Excellent food, 4 star food, 3 star atmosphere, but at least we had real silverware.  Self service on the drinks. They delivered the food to the table, but after that, abandoned us.  I won't tip next time, there is no service to reward.Tonight I had the 3 item meal with fruit as a 4th. item. The chicken salad was hum-drum, not as good as Whole Foods.  The pimento cheese was so so as well, I didn't even eat it all.  The egg salad with olives didn't have any personality, I was expecting something special.  It didn't happen.  The fruit was OK, but Whole Foods next door has better. This is a nice place to see friends, and the decor is a bit noisy but not too bad.  Only two booths.  Some outside tables, but it is hot for that this time of year. If you go, stick with the Greek salad with extra of salmon.  That's the only think I know I would order from now on.  Oh, the pita chips are excellent, and one time I actually got enough the first time and didn't have to ask for more (as I usually do).  I wish this place would step it up a notch or two, it could be excellent with a little more effort. Oh, and they might consider some dining roof service -- it is supposed to be there, and sometimes is, but tonight it was non-existent."], ["Liz F.", "I disagree with some of the other posters here.  I think that the prices were too high.  For example, I ordered the Taziki Dip for $4.59 which IS a reasonable price for an appetizer but I though the portion was a too small for them to charge $5.The gyro that my husband ordered was acceptable but not great.  The meat wasn't very seasoned and it somehow tasted cheap?  I don't know how to describe it.  It wasn't bad but it wasn't awesome.I ordered the Soup and Salad.  The salad was fine and the Greek dressing was VERY good.  The soup is a Greek Lemon Chicken Soup which I thought would be Avgolemono, which it certainly is not.  I liked it but I was wanting Avgolemono.  That was MY mistake though.  The soup was very tasty and super lemony (which I love).I thought the setup was strange: order at a counter but its full service after that.  And there's a tip jar at the counter so, in essence, you're tipping before you even get any service, which I don't care for.  The employees were SUPER friendly though so I'm glad I tipped well!!!  I would pretty much return here JUST for the friendly service, I swear.  Especially since good service is so hard to find in Columbia (in my opinion).Overall, I enjoyed my food but my husband did not.  I really think that it's a little overpriced, but only a little.  The employees are the absolute best.  I think I would recommend this restaurant, but maybe wait and go on payday!  :)"], ["Emily E.", "While the prices are reasonable,  the gyro was nothing special.   I've had many better ones in Columbia.  The lamb wasn't tender or we'll seasoned and they were stingy with the sauce.   The best part was the cucumber tomato salad,  which shouldn't be the highlight of their menu.   They were nice enough but you can get much better Greek food elsewhere"], ["Kevin B.", "You want fresh ingredients? You want quality service? You want delicious flavor combinations? If you answered yes to any of these 3 questions then you won't be disappointed by any dish at Taziki's! This is my favorite restaurant in the metro area that isn't in the fine dining class. I could eat here every day..."], ["Lizzy J.", "I'd give this place 3.5 stars... giving it 4 because it's new and they are probably still working out the kinks. The staff was very friendly and the service was incredibly quick for lunch time on a weekday. The menu is fairly large and the options are reasonably priced. I liked the atmosphere, the inside is decorated nicely and there are lots of large windows.I split an appetizer sampler wtih hummus, taziki dip, and dolmades. The hummus was chunky and tasty, seemingly made on-site. The taziki dip (a chunky version of taziki sauce) was great but the pita chips were too thin, cut too large, and over seasoned. I'm not sure why they aren't using flatbread or making the pita thicker, what they are doing just isn't working. If the chips had been better, I'd be much happier. The dolmades (stuffed grape leaves) were tasty but difficult to eat. They were too big and kind of soft on the outside, but the inside was seasoned well and tasty.Also got the spanikopita \"roll ups\" - essentially 4 greek empanadas? The chicken was very tasty and juicy and came with a tomato salsa kind of thing on the side that was very good. The side tomato and cucumber salad was tasty and the tomatoes were BRIGHT red, obviously very very fresh and ripe.One annoying thing: the staff behind the counter has to get you a drink. There are no drink machines or even water coolers to use, so that's just kind of annoying. They use crushed ice and basically fill the glasses with it, so you get very little to drink."], ["Paul G.", "It's not the worst food I've ever had but most of it was terribly bland. Can't think of a reason to ever go back again."], ["Melissa W.", "I decided to try this restaurant as they were fairly new to town. I was sorely disappointed. Mediterranean food is to be enjoyed, not served fast food style from a pick-up window type counter. I was unable to eat my pork as it was extremely tough and tasteless.  I would like to say that these were problems encountered due to their newness, but unfortunately that would be wishful thinking on my part. I am hoping that their clientele are unfamiliar with Mediterranean food as if this is their first experience with it, they will not be eating Mediterranean again."], ["Greg M.", "Great menu, great staff. I visit every chance I get!! Try the mediterranean salad...or anything else for that matter. Both the taziki and the hummus are awesome starters too."], ["J M.", "Mediocre food. The service is fine. Reasonably priced. The lamb dinner was reasonably cooked but no seasoning to speak of and a strange sauce that had no flavor. The soup was ok. Salad dressing is really bad but they have oil and vinegar if you ask. The wine is reasonably priced but also, not very good. The line was out the door when we left so it seems to be pretty popular right now."], ["Sam V.", "I'm happy about Taziki's. They have an eclectic menu that can satisfy most of my cravings and their food preparers wear gloves-- very important. I've noticed that Columbia seems a bit behind the times as far a restaurant sanitation goes. I recommend giving this place a try, it's not too expensive so if you hate it you're not losing much!"], ["Jj D.", "The atmosphere is very casual and friendly. You place your order at the counter, and the wait staff brings your food promptly to the table.  Staff was very helpful and knowledgeable about the menu. We ordered the Chargrilled Lamb and Herb-roasted pork,  both meals were excellent and very affordable. We will definitely plan another visit in the near future."], ["Lisa M.", "5 star location at the new Cross Hill Market in Columbia SC - 3 star dolmades.  Had the Dolmades Plate listed in the Taziki's Feasts section.  Listed as \"grilled\" hand-rolled grape leaves stuffed with seasoned rice served with Greek salas, Taziki sauce and pita for $8.99.  Gave it 3 stars for the very tough dolmades (rolled grape leaves).  There was nothing to indicated these were grilled.  They were large but not cooked to correct softness.  The filling was a yellow rice that was very spicy.  The rice wasn't sticky enough to stay together and there wasn't much else in the filling.  Too big and not enough substance.  The side Greek salad was slim on toppings.  There was one little olive and about ten small crumbs of feta.  On the plus side I will try again to see how the gyros and their spicy pimento cheese is.  Definitely worthy of Cross Hill Market."]], "Olive Garden Italian Restaurant": [["Sandra R.", "First visit to this location. Great customer service. Our waitress Ariel was wonderful. Very friendly and attentive. Lunch was fast and fresh."], ["Karen S.", "This review is pretty much for a new concept that Olige Garden is doing (though not sure if it's for this particular location or vast majority of Olive Gardens) and if othe restaurants in general do this as well.It's been a while since I've eaten at an Olive Garden and when we were seated, I noticed that they had little computer things on the table, which is used three fold (if not more). O me thing you can do is play trivia (but at cost) while waiting for your meals.  Also, you can order appetizers on this gadget (but not your main course - you still will have your order taken by the wait staff) - but not sure if ordering meals in the future will ever be done on these. The major difference is your waiter / waitress no longer brings your bill to you at the end of the meal (but you still get the Andre Mints!), your bill is electronically put on here. The tip is figured automatically (depending on how much you want to tip percentage wise) and you sign electronically (even though I wish there was a stylus available to use). Even though we were not splitting our bill on our recent visit, there's that option (but not 100% sure how it works). Also , you have to use a credit card to pay on the thingy, and if you're paying cash, assuming the wait staff would need to handle your bill.A couple of other features I saw, but didn't use was there was a \"call server\" button - so not sure 100% if that works, as well as an \"order beverage\", button as our waitress took our drink orders (though we were ordering non alcoholic beverages) and if you in fact use this feature, if it's only for \"adult beverages\"."], ["David W.", "Olive Garden is my wife's favorite restaurant and we travel a good bit so we've been to Olive Gardens all over the country. The food here was the worst we've ever encountered. All of the pasta was overcooked and the sauces were terribly bland. It tasted like TV dinner or school food. The salad was devoid of the things that make it a salad. A big bowl of lettuce does not a salad make. The Tuscan soup, though, was probably the best I've ever had. My son's kids pizza was, I feel certain, a toaster pizza.My wife doesn't like to kick up a fuss though, so we didn't complain. I wasted over $100 at this place. Heed my warning and stay away!"], ["J G.", "By far the best Olive Garden location I've ever visited. We never miss a chance to stop for lunch when traveling through South Carolina. The staff is always quick and welcoming and the food is always perfect!"], ["Roseanne R.", "Met with friends for lunch/shopping day last Saturday. Great bar service. After being seated, service was super slow. We were there for over two hours and had to flag down our server for every need and for our check. Have been going to this location for years and have never had a problem."], ["Robert B.", "My wife and I had two different coupons for two different promotions, each said \"Limit one coupon\" and we assumed that meant per promotion, since many restaurants print the coupon whether it's per promotion, per customer, per table, etc. Food and wait service was great! But then they wouldn't take our coupons, just one. We are on a right budget, so we brought enough cash, but now we had to pay more. The manager wasn't very helpful, but the waitress was! She suggested we split the bill, bc it's one coupon per bill. Manager allowed us, but it cut the value of one of the coupons in half for some unexplained reason. Manager blamed corporate.So I emailed corporate, and they were very responsive! They said they'd pass along our suggestion for better clarity on coupons, and they mailed us a ten dollar gift card (I asked for a gift card, but didn't specify how much - we lost five bucks due to the coupons not working out as expected). I was pleasantly surprised! Good job OG!"], ["Ishah T.", "Went to eat here today in the afternoon with my sister, we didn't have to wait too long so that was a nice change. However we have both noticed that the first salad and bread they bring out is always always the pits (wilted salad and stale bread) but the second batch is great! Why is that? Anyway something unusual happened that made us both uncomfortable: a family was seated the next table over from us and for some reason the dad was upset and moved them to another table across the room, I mean they totally abandoned their drinks, salad and bread. The manager was apologizing like crazy but I have no idea why! They really upset the atmosphere though. Weird."], ["Grace M.", "It's usually pretty busy on the weekends, but it's with the wait if you want good breadsticks, salad, and soup. I've honestly never gotten anything else off of their menu, so I can't give a full 5 stars, but I've never been unimpressed with their soup and salad or breadsticks. It's in a pretty good location because it is within close proximity to the mall, movies, and other shopping alternatives such as Target and TJ Maxx."], ["Miranda G.", "It was quite busy when we went so we had to wait for about 30 minutes for lunch. Once we were seated, our waitress was as attentive as could be expected considering how busy it was. The food was good and we really enjoyed the salad and breadsticks that just kept coming! A pretty good deal for the money. Would definitely eat here again, but maybe at a less busy time."], ["Kevin S.", "I used to love this Olive Garden location but the past three times I have been consistently been unimpressed. Either the food quality is poor or the service is awful (no joke, I was once at the restaurant for 3 hours from the time my family and I were seated to the time we left!!!!). I hope this critique will help the management make some necessary changes to improve this restaurant to what it used to be!"], ["Regan M.", "I have had a love affair with Olive Garden for at least 15 years now.  The stuffed mushrooms are my favorite.  Tonight I was served a plate of shrooms in which one was missing it's stuffing.  The manager apologized and brought me a complete new order.  This is excellent service- apologize, fix it and go one step further!  Awesome job OG.  Thanks for keeping me a satisfied customer all these years!"], ["Lynne L.", "We visit this location of Olive Garden on a fairly regular basis and we find that the service is always excellent and the restaurant is very clean and pleasant to visit.  We love the salad and all this soups and have never ordered anything on the menu that we didn't love.  Tonight I had the 3 for $11 and it was superb.  I had the salad, shrimp caprese and chocolate mouse.  Our service was excellent as always.  The one and only small complaint that I had was that our bread was not as fresh as it normally is.  the end of the bread sticks were hard.  I am sure if I had complained they would have brought more because that is the type of service they always have.  This location is always welcoming and enjoyable."], ["Megan P.", "Our waiter was very good. We were told 15 minute wait which was more like 7.  We ordered drinks and the bruschetta appetizer immediately. The bruschetta took longer than it should have. The bread was dry and hard, but the topping was good. Food was good as usual. I had stuffed chicken marsala, and my husband had chicken scampi. It was busy and the table next to us was enjoying the never ending pasta bowl a little too much. We were seated between 2 large parties, so we didn't get the peaceful date night we had hope for. Upon leaving we were approached by a pan handler in the parking lot. I told my husband to go tell the manager, who did attempt to get the man to leave, however he quickly went inside. This left the man walking just a few steps behind me yelling at my husband at I. I finally told the pan handler I didn't care if he was old, I'd still bust him up, and after following us to the car he scampered off to Starbucks."], ["Evani P.", "Disgusting! Terrible service and the waiters are so rude and SLOW. Everything tastes so frozen now, not sure what happened to their taste but only thing that's half decent is the salad"], ["Lisa S.", "All I can say is all you can eat soup, salad, and breadsticks! Gnocchi to die for!"], ["Bob H.", "I go to this specific olive garden about twice a month.  The service is always friendly as I step thru the door.  The wait time isn't bad.  Once seated, they normally offer you wine, but I pass; just want the food.I always get the never ending soup bowl.  The service thus far has been great.  Wait time for food is anywhere from 15 or more minutes.  Even during peak hours they do their best to be friendly, which isn't the same as other restaurants.  This review is subject to change however as of now, I give it 5 out of 5, one of my favorite places in the Harbison area of Columbia."], ["Kyleigh P.", "Olive Gardens in general are great, and this one is definitely no exception. Service is great. Food is amazing. Prices aren't that bad when you consider the quality. I've never had to wait too long either."], ["Dorothy C.", "After assisting a family member move back to Columbia ot was time to eat.  We worked through lunch knowing Olive Garden was our choice for dinner.  Like any restaurant, the wait is relentless at the mass hour.  We arrived for the early bird special and were seated upon arriving.  Good pleasant service.  Try the mixed grill.  Wonderful.  Light, healthy meal."], ["Scott G.", "Just say no to the busiest restaurant in Columbia.  Do yourself a favor and try something different for the same price, Italian food is amazing and there are plenty of other places to eat around town!"], ["jeff a.", "Predictable.  Bottomless salad bowl and friendly waitress were the best parts.  It was better the last two times we ate there.  My new chicken dish was awful.  A bit pricey at $47 including tip for 3 people drinking just water.  Bright, clean, friendly atmoshpere. They push the expensive wine.  Why can't anybody have a decent carafe of house wine for less than ten bucks?   Except for the vegetarian in the group, I'd eat at the ale house up the block.  That's real food and lots of beer choices."], ["Adriane C.", "Me and my family of ten are on vacation and had dinner here the other night and it was a wonderful experience! We walked in without a reservation and after a short wait our table was ready, equipped with two of the friendliest and sufficient servers i have ever met. Having been in the resturant business for a few years and a fan of eating out i have never had a better experience. We never had to ask for anything, and the second the breadsticks or drinks were gone from the table a new batch was delivered. The staff took the time to sit and talk with us, and they were a genuine group of people, they took away the stress of eating out with a big party and we had a great time!"], ["Matthew C.", "Jennifer was amazing and our soup & salad was so great, it's definitely what you should order. Great prices and tasty food."], ["Brittany and Tim L.", "Not much to say. It is a chain Italian resturant. The all you can eat bread sticks and salad is my favorite. The seafood pastas are all good as well as the stuffed shells."]], "Mediterranean Tea Room": [["Janine M.", "An amazing restaurant in Columbia! The 6oz or 8oz Grilled Chicken is the best! You get a salad and rice with it and it's a great size portion. Cool atmosphere and great place to take people who are visiting! Can't say enough good things about this place!"], ["Julie R.", "Just tried this place and I love it! I got the kofta plate which came which tabbouleh salad, hummus and pita bread, and yellow rice. Everything was delicious. I am definitely going back!"], ["Adam B. J.", "Tea Room has been one of my favorites since I moved back from Charleston in 2001.  The best hummus ever, hands down.  I love the gyro here, it is different from everywhere else.  They use hummus instead of Tzatziki, and the hand made gyro meat (I think it is more like kofta) is great.  Service is always dynamite.  Only complaint, they could cut their tomatoes and cucumbers a little smaller.  But opinions are like.... Love this place."], ["Denise K C.", "I have been eating at MTR for sooo long. I love the Salmon, my husband loves the Thursday night Spaghetti. My daughters love the Vegetarian Plate. We always enjoy the servers. We've been eating at MTR for so long that the Servers have watched my children grow up. They even watch out for my girls when they eat there on dates. It's like family."], ["Nick C.", "The food is always great and the portions are massive. Try and get David for a server if you can!"], ["Bailey B.", "Always fresh food, friendly staff, and a great experience! I have yet to eat anything here that I was disappointed in!"], ["Polly T.", "My weekly go to"], ["Jim L.", "You need to go to MTR on Thursday for the spaghetti special.   It's the best I've ever eaten....fresh and light and delicious!"], ["Ovunc Y.", "Consistently great! We order a lot appetizers, then usually share an entree. Try 'baba' and 'eggplant appetizer'."], ["McKenna C.", "This is by far my favorite restaurant in Columbia. I no longer live there and miss it like crazy (the restaurant). The Greek chicken over rice with a greek salad is ridiculously good. They have the absolute best feta and always super ripe tomatoes. I always ask for extra feta. I'm so jealous that you're reading this review which means that you're probably trying to decide if you should go there. Just do it."], ["Evan N.", "This is quickly becoming one of my favorite places to eat in the Columbia area.  Everything I have had has been awesome and has an authenic taste.  The service has been fast and friendly with no issues.  In fact, I have had the same survery 5-6 times and she takes so much pride in her approach, I thought she was the owner (she is not).  I would highly recommend this place."], ["Angie W.", "I love the humongous salad, rice and chicken breast plate. It's absolutely delicious and inexpensive. The hummus plate is also yummy.I love the local dive restaurant feel, it's cozy and welcoming. I highly recommend."], ["Somer P.", "I absolutely love everything about this place, the lighting, the atmosphere, the waitresses, the kitchen, the menu-EVERYTHING is perfect! Small joint, show up early for good seating or just call in and pick up! Either way it's the most delightful food in town!"], ["Khadija E.", "I have only been here once for lunch, and I found my falafel sandwich tasteless and messy. It dripped like crazy and eventually fell apart in my hands. The decor was cute though. I might go back just to make sure about the food."], ["John B.", "If I don't come here at least once a week then I start getting the shakes. The Greek chicken is the best! I would kill to find out how and with what they marinate it in. Mandy is the best waitress in town. #truth"], ["Aaron V.", "Finally! After trying a few other places, I was worried that Columbia just didn't offer good Mediterranean food, but this place is the one. The food was fresh and full of flavor. The service was spectacular, and the place was clean with a nice ambiance. Will definitely become a regular here."], ["Bryan B.", "I haven't been here in about 8 months, but it's the first place I think of for food when I think of Columbia. Best hummus I've ever had. Period. Great appetizers. Love the vegetarian sampler, with olives, falafel, tabbouleh, Baba ghanush, feta. Turkish coffee with authentic desserts. Wonderful lamb burgers with hummus. Can't wait to return."], ["Katharine K.", "Really good, authentic Greek food. The sweet tea is really good! The Greek salads are huge and amazing, and their dressing is to die for."], ["Gena B.", "Never had a hamburger-like Gyro before, falefel not good either.  I'm not going back, I wouldn't suggest it."], ["Lindsey B.", "Have been before, was there this week for a corporate party. Food is always excellent, I had 6 oz marinated chicken breast over rice with Greek salad.  It comes on one plate, everything, and is all excellent, and large portions.  only $9 or so.Now, the down side, parking is on the street, which is OK.  But the lighting inside made it impossible for us to see the small print on the menu, and we forgot to bring a flashlight.  The sound level due to horrible acoustics was so great we had a hard time hearing each other talk.  Needs some ceiling tiles that absorb sound.  On the plus side, the service was fast and accurate, and food came quickly considering the size of the crowd and other diners.  They have their organizational act pretty well together.  Even paying with separate checks was done better than most do it. As a value proposition it is great.  As a dining total experience falls 2 stars short of Excellent.  It could be easily fixed, but, in many years, they haven't seen fit  to fix it.  Too bad since it has great potential in an area where many dine out."], ["Dade D.", "I came in this afternoon to pick up lunch, and I have to say that the service was expedient and accurate. The falafel in the falafel sandwich was lightly fried and seasoned well, and I also appreciated the portion on the greek salad. Will definitely be coming back, hopefully to dine in so I can compliment the staff for great food and service!"], ["Swetha G.", "It's hard to give this place a fair review after eating at amazing restaurants like Elie's and Al Amir.  The food was good, but I have definitely had better.  I was also a bit disappointed to see that they don't have dolmas (\"grape leaves\") on the menu, which is a very customary dish at any Mediterranean place.  I liked the falafels in my vegetarian plate and the hummus was good too, but the tabouli was mediocre.  I asked for a small cup of hot sauce to give the food a kick, and I was given a small cup of a green dish, which looked like it had minced chilies in it.  Even with adding some of this to the food, it was just sub-par.  However the place has a nice intimate and warm environment.  It's not too noisy and is a good venue to get dinner and catch up, you don't have to shout over your meal, which is always a positive!  Service was good too, our waitress was friendly and attentive.  All in all, it's a nice environment for conversation but if you're hungry for a real Mediterranean meal and want delicious food, I'd suggest going to Elie's or Al Amir, their food is just much better."], ["Katie R.", "It's alright--not my first choice to go. It was kinda of expensive for what you get and I'd rather go to Devine Foods or Al Amir. The pita was good!"], ["Alan M.", "Terrible attitude. Still open but so reluctant to seat us we left. Prefer other places in the area!"], ["Miriam A.", "Great falafel - well flavored, lightly fried, and - if you get the falafel sandwich - stuffed along with tomatoes, cucumbers, and tahini in a pita. It's not the most authentic Middle Eastern food ever - but that doesn't mean it isn't fresh, delicious, and simple good food.  The sandwiches are a great deal and with the included salad, it's difficult to finish!  The addition has a calmer atmosphere than sitting near the kitchen and take note that there's parking in the front and a lot in the back."], ["Lori B.", "I lived in this awesome neighborhood downtown about 5 years ago and  would get their take out about two to three times a week.  My favorites were the chicken sandwich w/hummus or the greek chicken on rice and a greek salad.  Got a veggie plate and greek salad to go yesterday and it's still as good as ever.  Very nice wait staff - great atmosphere for dining it too.  Food always tastes fresh."], ["H T.", "I have been addicted to their Tea Room Gyros since college. The food is tasty and portion sizes are generous. I've always experienced friendly and attentive wait staff here. Highly recommend."], ["Karen P.", "The best place in Columbia for authentic, fresh Greek food.  The salads are delicious - and enormous!  The wait staff are unbelievable - friendly, smart and efficient.  This is one of our very favorite restaurants."]], "The Epicurean By Al Amir": [["Alec S.", "I can say that my Gyro was the best I have ever had.  My waitress was very attentive and the price was reasonable.The food was a little slow coming out of the kitchen even though there were only a few customers.I will definitely be back."], ["Judi L.", "We had the chicken schwarma, Damascus bread, a tabouli salad, and falafel with pita and tzatziki, with Turkish coffee and Turkish tea.I love the authentic environment and music. No distracting tv is WONDERFUL!  The server was young and American. I wish she had a better knowledge of the foundation of menu items, but she made up for it in enthusiasm. The schwarma came on saffron rice and had good flavor. The Damascus bread was awesome! Better than their pita, which was also good. The falafel is not worth it. It is very mild in flavor, and the crust was rather hard and dark, almost burnt tasting. Not a fan of their tzatziki, either, but the star of the table was by far the tabouli salad. It was light, lemony, and so refreshing!Next time we'll try the beef Pascha. Overall, Al Amir is a good restaurant and a great addition to downtown Columbia."], ["Chelsea B.", "This is terrible. Friendly owner and server but struggled walking out with $40 less in my wallet and the worst chicken \"shawarma\" and rice I've ever had. I'm honestly not sure how people enjoy this dish it is so bland and flavorless and the texture is even off. The Al-Amir salad was at least good but how can you really mess up cucumbers and tomatoes in lemon juice and olive oil? Go else where. It's not worth it."], ["Jennifer B.", "The food and service was really good. The Damascus bread was fresh. I had the Al Amir Calzone and my date had the lamb shawarma entree. The only reason I gave them 4 instead of 5 was because the calzone was little doughy on the bottom. However, I tasted that lamb shawarma with the saffron rice was perfect! The lamb was tender and well seasoned. The pineapple coconut cake was the perfect!"], ["Michelle E.", "I've not eaten at this location before, but have been to the S Main restaurant. For this one, tonight, I was disappointed. I got the Pascha Chicken with the Al Amir salad. I asked for a side order of feta for the salad. I've had the salad many times before at the S Main location, but here it wasn't as good. I strained to see any parsley or mint on the plate, but there were plenty of cucumbers. It needed salt even after I added the feta.The Pascha Chicken comes with rice, but it was parboiled. There is no mistaking the texture of parboiled rice. It is a convenience item for a restaurant, but really should not be served in as nice a place as this one. The chicken was not up to par either. It all looked good, but there was no flavor. Lots of paprika to add color, but I had to salt the heck out of everything.The restaurant itself is very nice and the staff were all nice, if a bit slow. It wasn't very crowded, probably only 6-7 tables, and I think when there is less to do everything slows down. I would give the decor and staff 3.5 stars.I always try to give a place a second chance. If I get back here, I hope it will be better. Perhaps it would be better at lunch instead of dinner."], ["Chase N.", "Pretty good food. But seriously, charging $1.50 for water during the boil advisory? Not happy."], ["Devine S.", "The salmon was dry lukewarm and overcooked the saffron rice was lukewarm the only hot item on the plate was the grilled vegetables which were very tasty. The Damascus bread was delicious but it needed more olive oil on it . The food was bland and in need of some  seasoning. Main Street downtown location."], ["Adam B. J.", "Another Al Amir with the same great middle eastern / Mediterranean cuisine.  They seriously have the best babaganoush ever.  I love the Damascus hummus (i prefer combo of chicken and veggie), but the kabobs, wraps, and schwarma are all menu high points.  My wife loves the pizza.  It's served on Damascus bread.  She gets the gyro one with gyro meat, pepperoncinis, onions, and taziki sauce.  They have burgers at this location as well as some other American favorites.  No need for a DD, they don't serve booze."], ["Anna B.", "I don't know where I've been or what rock I've been under, but I didn't realize Al Amir had opened up another branch on North Main. I've long been wanting to try out their Mediterranean goodness at their restaurant by Moe's on the other side of the State House, but as fate had it - this was where a coworker decided to pick for his special occasion lunch.Anyway.Now that everyone knows how I GOT to this restaurant, let's talk about the restaurant itself. First of all, it's in a stellar space. There is a bar area, a spacious eating area, and clean bathrooms. Architecturally, it's particularly pleasing... especially for Columbia. They were quite busy at lunch on a Friday, so I have to say that the waiter service wasn't extremely attentive. It speaks volumes, though, that the waitress apologized profusely that she couldn't attend to our needs as well as she would have liked.I ordered the gyro - and it was very good. The lamb was sliced just right (read: thin) and was crispy on its edges. We also ordered some Damascus bread for the table. It's the Mediterranean version of pizza dough (kind of), and it is good to eat by itself.All in all, a good experience. Oh! And it is VERY reasonable priced. All of the downtown Columbia business people should rejoice!"], ["Emily E.", "I didn't even realize Al-Amir opened another location until a few weeks ago, and the fact that it's only a few blocks from my office might make this a new go-to lunch spot.  They have a HUGE amount of space inside, nicely arranged with plenty of greenery and plenty of natural light (unlike the Al-Amir that's on the State House side of Main St).  My favorites here are the Al-Amir salad (tomatoes, cucumbers and cilantro in an olive oil/lemon dressing that is refreshing), the Damascus Hummus (ask for the grilled vegetables with whatever meat you get) and the Lamb Shawarma.  Tried the lamb kabobs today for the first time and enjoyed them.  Good addition to Main St.  I'll be back soon.  Service was fast enough to get back to work within an hour, plus they have a coupon on Dealsaver.com!"], ["Brandy B.", "I was discussing my plans to try another Lebanese/Mediterranean place with a coworker and she stated that she worked at Al Amir for 4yrs, almost everything if not all was made in house and she didn't have a bad thing to say about the place.I realized this newly opened location is walking distance from my job so when I got off my bf and I walked down the ever growing main st to get here.The restaurant appeared pretty empty from the front door and there wasn't a host/hostess... We kinda scanned over the menu while waiting to be greeted.A cheerful man (who turned out to be the owner) came around the corner, greeted, and sat us - as we walked to the table our feet were making the sticky noise as if someone has moped the whole floor with a dirty mop.The dining area was very big and well lit, so it wasn't very intimate - I liked the fact that there were many different international groups of people seated throughout the restaurant.A server came from the back and asked if anyone had taken our drink order - she took our order and ended up being our server.We ordered...spicy feta dip - verrrrry spicy and verrrrry good (it was so spicy I actually coughed after the first bite), it didn't look too appealing when she placed it on our table and the pita served with it looked like it would be bland and boring, but it was actually very fresh and tasty!baba ghanouj - good, typical, I think my bf liked this more than the feta dip... it was also served with the same pita bread.mahi mahi w. grilled veggies special - since I've been trying to avoid meat I opted for this - the fish was cooked perfectly, the grilled veggies and rice were good too (it tasted like a meal that I'd cook at home when I'm on my \"clean\" diet).lamb kabobs w. grilled veggies - my bf really liked it - the owner who was very present in the dining area, chatting with various guests, stopped by after we'd begun to eat and brought out a plate with extra lamb and veggies and said that he thought the kitchen shorted my bf on some meat - ok cool.I ordered my mom some grape leaves Togo (bcuz my coworker specifically said these were made in house - mom thought they tasted much like the ones available on the bar at fresh market - which are very good).The total with tip was a little over $60.In closing, I'd eat here again - the food was very good and service was good too!"], ["Mona D.", "I was so happy to discover this restaurant soon after I moved here. And each time I eat there the foods delicious and freshly made. My favorite starter is the Damascus bread with baba Ghanoush. The menu says it comes with pita but you can sub in the Damascus bread for $1 up charge and it's worth it.  Their baba Ghanoush has a perfectly smoky eggplant flavor. For the meal I've settled on the chicken shwarma over rice not because anything else is bad (I've not tried them) but because I KNOW this ones so yummy!After chatting with the owners one night (they're usually there and very friendly) I ordered the house made tzatziki sauce to go with instead of the standard tahini and my oh my is it delicious. My only complaint is they don't serve alcohol, for religious reasons, to me the food is enhanced by a great glass of wine. Tip: you can order food to go then stroll to Wine Down or Grapes And Gallery, they'll serve a great glass of wine and don't mind at all if you eat the food there!"], ["Carol S.", "While attending a conference in Columbia a group of us had dinner at Al-Amir.  Everyone enjoyed the food especially the pizza on Damascus breas, the curry, the Sampler platter and the feta salad.  I enjoyed the lentil soup most of all; deliciously spiced and flavorful.  We indulged in dessert - small tarts made of cookie dough filled with lemon for some and chocolate infused with almond oil for others; just a few bites, a perfect sweet ending.  They also had fresh baked cakes that looked great but the delicious food left no room for a whole slice of cake.I'd return if I find myself in downtown Columbia again."], ["N G.", "I had the eggplant special.  Overall presentation was not nice.  The cheese on top was charred as well as some of the noodles.  Most of the noodles were aldente which as good.  The eggplant was overcooked and disintegrating.  Overall the flavor was okay.  The dish was greasy.For the price it was not worth it.  For $8.95, it should have been of higher quality or had more noodle and eggplant.  You can get similar quality from a hole in the wall pizza joint for $5.95.The service was polite and friendly."], ["Frank A.", "Great ethnic food.  The Damascus hummus with Damascus bread is top-shelf.  I've had the veggie hummus plate several times, along with numerous other plates - have never been disappointed. I think this location is far better than their previous ones..."], ["Gregory G.", "Took my cousins here a couple weeks back to expand their food horizons. I really liked it and surprisingly they did as well. I've been to the many incarnations of Al Amir restaurants. I really like this type of food and they do a pretty good job with it. The location is great and part of the growing main street revitalization if not on the edge of it a little. I would definitely recommend this to anyone coming to the downtown area."], ["Liz D.", "I've loved Al Amir at every single one of their locations in Columbia, but this one might be my favorite yet.A little further down Main St. (north of the State House), both the parking situation and the actual restaurant space are much better than at their location southward on Main. It's really a nice, airy-feeling space. It's a little less decorated, but looks great.We came in for lunch yesterday, and at a little bit of after 1, the place was nearly deserted. Really surprising, because we had a great experience. Friendly, fast service, and delicious food.We shared a sampler platter of hummus, baba ganouj, damascus bread, grape leaf rolls, and falafel. It was big for two people, and every piece of it was great. The damascus bread is especially good--soft, airy, with a lovely tahini taste.For lunch, we both got kebabs (I got the kufta, my friend got the lamb). I'd say the lamb is slightly better, because the kufta was a little dry, but both were great. The kebabs come meat and grilled veggies over either rice or pita bread, and make a great lunch-sized portion.I'll so happily come back to this Al Amir!"], ["James R.", "Incredible Mediterranean food. Best in Columbia we've found! We tried their pizza with chicken, and their appetizer sampler. The sampler knocked our socks off. Hummus and baba ghanouj were just like I've had in the Middle East. Well worth it!"], ["Stephenie B.", "Not sure how the restaurant has ranked so many stars.  The service was just meh.  The waitress was nice, but service was slow and she was not familiar with the menu.  We started out with the sampler platter ~ the hummus and baba ghanoush were decent, the stuffed grape leaves had no flavor, and the falafel seemed to have been frozen, it had no taste at all and the texture was off.  The tabbauleh and the Al Amir salads were OK.  We ordered a lamb kebab and a vegetable kebab.  The lamb was a tender cut, but was served well done rather than rare as ordered and this ruined the lamb for us.  The vegetables were of a nice variety, but were also over cooked.  All in all, this is not a place we will visit again."]], "Tabouli Mediterranean Restaurant & Bar": [["Greg W.", "I'm not as critical as the previous two reviews, as I never took the opportunity to eat here when it wsa Al-Amir and can't make the comparison.  I will agree, however, that the food was really pretty bland and overpriced but that the atmosphere was cool and the bar was huge.  Our service wasn't bad, but we were there at 5pm on a Wednesday and were the only ones in the place.My wife and I both had the lamb shwarma and my daughter got the pizza based on the owner's assurance that it was the 'best in Columbia', and we also had an order of falafel to share.  The portions were respectable but that point is moot when there's no real desire to keep eating."], ["Spencer S.", "This place has changed names a million times and always is the same bad food (first al-amir which was the best of the changes, then saffron, now tabouli). I really wanted to love this place. I really wanted a good arabic/mediterranean restaurant in my area. Unfortunately this place has failed on all levels in my opinion. Poor service, bland and boring food, overpriced. It is a cool looking place with a HUGE bar (WAY too big I think). I had the hummus (really unauthentic and in general not good) and the chicken shwarma (bland and tasteless). I would recommend checking out anywhere else in the area."]], "Zoës Kitchen": [["Chris S.", "Co-workers decided on the lunch spot today, and to my surprise they selected Zoe's. I'd heard about this place before but never went myself. Our take-out order was great!I had the chicken kabobs with Greek salad and rice pilaf. Savory chicken perfectly grilled with tangy grape tomatoes , onions and peppers. The portions are huge and quite satisfying, even for mid-day appetite. My meal came with pita bread slices which I didn't try, but there's always next time -- and trust me, there WILL be a \"next time\" with this establishment for me."], ["Anna-Marie W.", "Zoës Kitchen has 105 locations in 15 states and is growing.  A fast food concept, Zoës Kitchen offers fresh salads, sandwiches and entrees such as pita pizzas and kabobs.  There are no greasy burgers, no fries or onion rings- Zoës has sides such as roasted veggies, rice pilaf and fresh fruit.We skipped the Tomato Bisque Soup and the Hummus and Chips appetizers and went straight for the sandwiches.  A signature item of the South, I opted for the Pimento Cheese sandwich- and was offered to have it grilled at no additional charge.  On rye bread, the cheese was spicy and gooey.  The only thing I didn't like was the shredded lettuce, at least not on the grilled version.Chad had the albacore tuna sandwich on 7-grain bread.  It was decent though it had more shredded lettuce and tomato than tuna.We went healthy with our sides- I ordered the braised white beans with rosemary.  They were good but not impressive.  A little too mushy for my taste.Chad had the rice pilaf- a nice change from fried onion rings or fries that are normally found at a fast food place.  And it wasn't really fast food- nothing as sitting under a heat lamp waiting to be ordered- everything was made fresh.One thing not normally found in a counter service concept was the Hibiscus Green Tea.  A tastier alternative to the soda fountain.It's nice to find an alternative to the cluttering of greasy fast food joints found everywhere.  We hope Zoës Kitchen expands into the Orlando market soon as we hear the egg salad sandwich and the salmon kabobs calling our names for the next visit.The downtown Columbia restaurant is located on Main Street just down the street from the State Capital building.  This location closes at 3pm, however, most of the other Zoës Kitchen outlets are open later so be sure to check your local store's hours."], ["Adam B. J.", "Zoes is a great place to pick up a lite & healthy lunch.  I go weekly for the Hummus and Salad plate.  I've used them for catering several timesfor work and it has always been good and fresh.  A lot of bang for your buck when catering!  Their coleslaw is different but super yummy!"], ["Kathy B.", "If there were more than 5 stars I'd give them to Zoe's kitchen. Fast service and quality meals.  The grilled turkey sandwich was yummy, the Greek salad outstanding. For healthy alternatives, Zoe's has a great selection."], ["Michael M.", "The manager I spoke to was great. Had an issue at their place previously, and he offered to buy me lunch. Coming from Hawaii it's refreshing to find a healthy food place. The entire staff has excellent people and customer service skills. I value the diversity on their staff, which is unique to see on Main Street. Food is great tasting just like at other Zoes. They will bring you extra utensils at your request. Hah. Will return, good people."], ["Rebecca A.", "For the uninitiated, Zoë's is a chain and this particular location closes at 3 PM each day and is not open on the weekends. They serve Americanized Mediterranean food and place an emphasis on fresh, healthy foods. I think they do a pretty good job of that! I've never been disappointed. I always get the chicken and slaw pita with the pasta salad side. It is very tasty and doesn't weigh you down like a heavy meal would. Table service is attentive and polite. I enjoy coming to Zoe's and consider it a great part of downtown Columbia. I do wish that they were open on the weekends or for dinner but I do understand that their hours are the way they are because of the nearby office buildings."], ["Kevin A.", "When it takes 30 min to get your lunch, I don't care what the food tastes like. I won't be back."], ["Valencia W.", "I'm not new to Zoe's but I am new to this location and this Zoe's delivered.  What I wasn't counting on was all of Columbia, SC being at Zoe's at lunch time so when I wished I would've just ordered online ahead of time.  The line moves relatively fast but if you are hungry EVERYTHING seems to take a long time.  I was greeted well and they were very nice when it came to taking my order and such.  I waited a little while for my food and that was expected as all of Columbia was ahead of me.  It's not a big deal.  It shows that this place does deliver if there is such a crowd.  I ordered a grilled chicken pita for lunch.  Nothing big just something to hold me over.  The meal was good and I would drop by this place again after I check out the rest of what Columbia has to offer.  The good thing is that this place is really convenient so I am very happy for that."], ["Liz K.", "Ok Listen, I love Zoe's..the food is pretty good but good Lord I am so sick of them constantly running out of everything lately. Today I ordered a chicken salad sandwich with pasta salad on the side. I ordered online which made me provide my phone number. I get there to find out they were out of pasta salad..why didn't anyone call me? What if that had been a deal breaker for me?  I overhear a girl wanting the veggie pita pizza and the girl said \"we are out of that\". Last week they were out of fruit salad, cucumber sauce, multi grain bread, etc. WHY are you running out of things Zoe's? This is beyond irritating and makes me want to take my business elsewhere.."], ["Lindsay S.", "Listen, I used to love Zoe's.  LOVE IT.  But the last couple times I've had lunch there, I've been decidedly underwhelmed.Let's start with the spinach roll-ups, which I had ordered every couple weeks for months.  Never had I noticed that they contained mushrooms.  Mushrooms aren't listed in the name of the dish, nor in the ingredients underneath.  I can only assume they never contained mushrooms before.  Recently, I found mushrooms in my spinach roll-ups.  And they weren't tiny mushrooms; rather, they competed with the spinach for the predominate ingredient.  I decided they'd made a change and kept eating; I wasn't too bothered.  The next time I went, however, I took a close look at the menu board - still no mention of mushrooms with the spinach roll-ups.  I asked the girl at the counter if they had mushrooms, and she said they did; I asked whether they could make the roll-ups without mushrooms, and she said they were \"part of the mix.\"  I don't know what mix she's talking about.  All I know is that when I'm eating in a restaurant that advertises all its food made fresh daily, I don't expect (or want) to hear references to a \"mix.\"I didn't ask why they failed to list a major ingredient of a dish on the menu board, but figured it wouldn't get me anywhere.OK.  So I didn't want mushrooms on this particular day, so ordered the grilled veggie \"stack\" without the portabello.  It was terribly average.  Although some of the veggies were grilled, the tomatoes were uncooked (and slightly cool), and the onions looked like they'd been sauteed and caramelized.  The fococcia bread on which it was served was also cool - untoasted, ungrilled.  Listen, if you're going to serve a grilled veggie sandwich, at least make sure everything is the same temperature.  The sandwich contained two types of cheese - a feta in the spread, and what looked like a mozzarella.  The double-cheese-duty made the sandwich overwhelmingly salty.  It was also hard to eat... like, fell apart on me the minute I picked it up.  Fail.FINALLY (and most disappointing), the braised beans side dish, which I used to dream about, has become dreadful.  When I first began ordering it, the beans were firm and held their shape, and sauce was creamy but not too thick.  There was just a hint of rosemary.  Now, it always appears the beans have been braised within an inch of their lives (or like they've been sitting around on a warmer all day) - they're flaccid and falling apart, which makes the sauce thick and porridge-like.  In addition, Zoe's has been salting the hell out of them recently.  They are nearly inedible.Oh, Zoe's.  I'm so disappointed in you."], ["Donna W.", "We order from here quite frequently for our lunch at work.  Always a good meal.We usually get the chicken kabobs and brown rice, a Greek salad (with a bottle of homemade Greek dressing) and a chocolate fudge cake.  The chicken and rice is delicious!  When we order, we order the onions on the side for the salad.  They are very strong, and they put alot of onions on the salad.  The chocolate cake is more like fudge.....very dense.  Good, but rich!!They deliver and furnish all necessary paper goods."], ["David S.", "Excellent choices and has outdoor seating. Service is very quick and the prices are good."], ["Rick B.", "Great lunch and energy.  For your side, choose the pasta.  blend of tomatoes, feta, and basil that is just fantastic.  The chocolate cake is awesome."], ["Vic B.", "Lovely little gem downtown.  Good food.  Good service.  Used Google maps to find it.  Had read a review that the chicken kabobs were very good.  I tried a hot wrap instead which was really tasty.  The menu has a mediterranean flair but not over the top.  If I go back, I think I'll try the shrimp kabobs. They have fresh made hummus on the menu.  The young man at the counter was friendly and helpful.  I didn't necessarily care for the basil in the pasta salad but it was fresh.  I sat outside and they brought me my dish with a smile and took my plate when I was done although there is a place for you to bus your own dishes when you're done.  I would definitely highly recommend this restaurant to a friend and would eat there again!"]], "Pitas": [["Linda O.", "I liked the open space for dining and you can see right into the kitchen.I loved the contemporary dinnerware but they could upgrade the paper napkins to a nicer quality to match.The service was quick, friendly, and efficient.  They got all 5 orders correct.I got the Sampler Platter appetizer (sans tzatziki sauce to make it vegan) and they immediately offered me more of another side (Wow! No one does that) so I got extra veggies which was awesome because I used the sliced cucumbers instead of the pita bread for my hummus and baba ghanouj. I thought everything was very tasty and the tabouli was packed with fresh chopped herbs and flavor. It is 0.8 miles from Providence hospital and we were in and out in an hour. I recommend!"], ["Tamara C.", "I just had lunch here. My server was terrific - can't say enough nice things about her, and am sorry I didn't get her name. Service was excellent, quick, and attentive.The gyro sandwich was tasty, but the pita was terrible! It was so DOUGH. It reminded me of a hamburger bun. That pita is the only thing that would keep me from returning - or, next time, I'll just order a salad, and skip the pita altogether.Apart from that, the place seems clean and bright."], ["Mike M.", "Falafel and pasta salad for lunch, was delicious. Service was great, proces were reasonable. Will be returning"], ["Furman L.", "When you have a craving for the freshest Mediterranean food in Columbia, Pitas should be the place that pops up in your mind. The Greek Pizza and Gyro are two of my favorite items on the menu. The pita bread is amazing (made in-house). Tzatziki is always a great choice, too. Sweet tea always tastes great. Prices are incredibly on par. A couple can easily eat for $20-25 and walk away full.Parking is easy and free in their private lot, but can get tight during the busy lunch hour. That being said, there are 10+ street meters adjacent to Pitas always available for overflow parking.  Location is great, just a few blocks away from Palmetto Health Baptist Hospital. One of the two owners is a cardiologist, so you can feel good knowing that the food served here is (mostly) heart healthy. Have dined here many times, and have also ordered takeout. Both experiences always exceed expectations.Highly recommend Pitas."], ["Chad A.", "Murm was exceptional in walking us through the menu. I had the lam schwarma. My wife had the chicken Taziki wrap with babaganush and falafels as sides. The service was uber quick, and the food was REALLY delicious. I will come here every time I am in the area, AND they offer a ACtive Duty military discount!"], ["Elaine S.", "First time trying...drive by it every day on way to work...called today to order take out for lunch...picked up right away, took order-very helpful-order was ready 3 minutes later when I arrived!  Food tastes very fresh and super yummy!!!!!  I WILL be back!!!"], ["McKenna C.", "Overpriced. Not authentic Greek food. Sub-par pita bread. I would go somewhere else. Very much Americanized Greek food. Definitely not my idea of good Greek food."], ["R C.", "I have went to some great Mediterranean / Greek places and this is not one of them.So I can only guess that I didn't order the best thing in the place since there are others that have reviewed this place and have liked it.  I ate there yesterday for lunch and I ordered a chicken gyro and an order of pita/hummus.  The Greek sauce is good, the chicken had an odd texture and the pita was totally dried out.  I tried to eat the gyro and the pita just fell apart and I had to eat it like a salad - that is fine, but not what I ordered.  The other order of hummus/pita was just as disappointing.  The hummus was much more watery/runny that it should be and again, this pita that they gave me for it was dried out....at least the hummus helped :-)  Note, the hummus had little/no flavor - quite surprising.And for the price?  $15.57 - really, for a gyro, a little bit of fries, and some hummus? WOW, I guess if they can get it and stay in business, it must work for them.  My guess is that this place stays in business by being \"just good enough\" for the people close enough at work to grab something to stave off the hunger pains until they can get home to some real food.I would suggest that if you do eat here, don't order what I did.The guy that took my order was nice and the place was clean, but  with other places around for lunch, I won't ever be stopping in this place again."], ["Frank A.", "Great Lebanese food, run by folks who enjoy what they do.Most importantly, THEY MAKE THEIR OWN PITA BREAD.  yeah... they don't bring it in - it's done right there.  Only place I know in Columbia....Decor is rather sparse and plain, but it works. I get the gyro or falafal - both are great...."], ["Mike O.", "Other than the weird stiff upper lip when I asked if there was any coffee during the lunch hour (there was) the food here was great. The hummus was a little tahini heavy, but that's okay, just watch out. I got the veggie gyro and it was delicious. I wish I had ordered the falafel gyro because I tasted it and it was very, very, very, very awesome. I would come here all the time if I lived in Col'a."], ["L M.", "Sorry, but it was awful! Maybe I ordered the wrong thing because the place was crowded. Worst pita bread ever, so tough and chewy. I ordered the chicken pita and the chicken had so much gristle, I had to take it out of the sandwich and trim it, and  WAY too salty. Had rice as a side dish and the rice tasted like chicken?! Must have cooked it in chicken broth and added MSG. An hour later I was SO thirsty! Ick.. won't be back..."], ["Rachel O.", "Boyfriend and I both thought the food was very fresh and tasty. The tzatziki burger was excellent and Boyfriend loved his gyro. The pita bread is the best I've ever had. The hummus is tasty but I think I prefer the hummus at Devine Foods. The prices are reasonable and they do have some traditional Greek food items for sale including freshly made pita bread! :-)"], ["Julie R.", "This is quickly becoming one of our favorite go to places for Greek food. Everything we have ever eaten from here has been spot on! Our favorite dishes include the kafta dinner, the gyro ( of course) and their pizzas! They make their pizzas on their awesome homemade pita bread so they are kind of more like an appetizer but totally delicious. Also their hummus and dolmas are great as well. We have always gotten takeout here so I can't speak for the service but the people who run the place are alwàys nice. I even got a free piece of backlava after ordering a big takeout order. Good portion sizes as well. This place is definitely worth a try!"], ["Jennifer W.", "I have worked two blocks from this place for 3 1/2 years and am kicking myself for not trying it sooner. I read the mostly favorable reviews and decided to go. Wow. Every compliment is true- super fresh food including crisp greens and a soft and chewy pita. On a whim I got the soup of the day (a 15 bean soup with bacon and sausage) to go and am so glad I did. Very flavorful. The only disappointment was the cocktail weenie type sausage. Didn't affect the flavor, just weird. This will be a place I return to frequently. Get past the lack of ambiance and try it, it doesn't disappoint!"], ["Crystal C.", "Pretty good, good price, quick service and nice people. Though I only got takeout, the food was decent. It wouldn't be on the top of my Greek list but I would go again."], ["Korey W.", "I was really happy I went here for lunch. very good food and reasonable prices for lunch. the only things were parking was kinda tricky at lunch time and the dinning room has a school lunchroom feel to it."], ["Jodi B.", "Nice lunch place. I had the Mediterranean pizza with hummus and baba ghanoush for appetizers. It comes with a home made hot sauce, shatta, that made everything delicious."], ["Johnny G.", "One of my \"fabfav\" restaurants  in Columbia! Mark, the owner, whips up fresh Tzatziki sauce, hummus, & homemade pita bread that keep you coming back. Really good food!"], ["Cole M.", "Great authentic Lebanese food. Not the best ambiance but really good eating. Try it.... You won't regret it."], ["Kel B.", "Pita's is delicious, authentic Lebanese and Mediterranean food!  The staff is extremely friendly too.  I have only tried a few things here, but everything I have had was great and reasonably priced.  The previous review about the restaurant feeling like a school lunchroom is true though, but the food is too good to care.  Try it!  The chicken dishes are especially good.  Not sure what they put on their chicken, but it is awesome!"], ["William F.", "I am a local chef and don't normally do things like this. Here goes...My partner and I had one of the worst lunches ever. We were slowly greeted and told to sit where we liked. There were napkins under the tables and the window casings were dirty. We chose food from our waiter's recommendations. The food was a long time coming. It probably took awhile to prepare such dry chicken. My tzatziki chicken wrap was a nightmare of flavorless sauce and large chunks of dry chicken..the unseasoned frozen fries made me sad. My partner's kofta platter was not much better. Barely warm and served with unweildy soggy salad. How can you mess up a greek salad? Even the olives were soggy. The service was lackluster.we got the untotalled check...I guess we were supposed to add it and figure out the taxes...well you get the idea.I would NEVER recommend this place."]], "Arabesque": [["Roger H.", "Sunday at 1:30, church crowd is gone and hungover college kids are still asleep. Took a second to get sat, but there was one server for the whole restaurant it looked like, so I understand. I waited tables in plenty of places where we did the best we could when we aren't sure what to expect. It just takes a skilled server with a good attitude to get it done. We got that guy. We started with a large Hummus Appetizer and Fattoush salads. There was an issue with the Damascus Bread but our server brought us some to tide us over and then a piping hot portion when it was done. The Damascus is off the chain here. Salads were delicious. Very evenly dressed and seasoned with the perfect ratio of ingredients. I got the Falafel Wrap and the wife got a Gyro Wrap. ...keepin' it simple for lunch. Presentation was on point, as they seem to take pride in the appearance of their food. See photos - I should've snapped one of the app and salad, they were gorgeous. My wife's opinion of her Gyro Wrap? \"OMG, good.\" And my Falafel Wrap was perfect. Again, even distribution of ingredients is key for me and they nail it. We took some to go because the portions exceed the average appetite but not the wallet. This place is underrated. They've got some local competition from other popular Mediterranean joints but they are slightly unique in some subtle ways. See for yourself. I think they get a bad wrap sometimes because the service is spotty but it's typical of a restaurant this size that doesn't have a ton of money to throw around and over staff with blonde cheerleader types who couldn't care less. If you can be patient and appreciate the quality of what you're getting, you'll like it...maybe even love it. I'm giving it 4 stars because of the spotty service at times but I really have no complaints."], ["Keith K.", "Arabesque is your typical Middle Eastern food joint for white people, overpriced in general, decent and comfy but nothing to lose your head over.  Nice sofa-benches good for snuggling up to your partner / inebriated co-worker, tea candle on table, low light, two inexplicable but fortunately muted televisions that ruin the otherwise pleasing atmosphere and lighting.  Generally seemed clean.Met with a friend for happy hour appetizers (half off till 7:00, score!) and tried a variety of 'em.  Hummus was on point, served with plentiful toasted pita points.  Ditto the tiny Fatayar pies, of which I could eat 'many'.  The salads did not fare as well - limp, slightly brown lettuce and soggy tomatoes and cucumbers, not for me thanks.  Stuffed grape leaves typical thawed mush, alas.  Falafels hot and crunchy, but it's pretty difficult to falafail, if you falalow me.The bottled bottled beer selection is poor - Macro Mix - however the Moscow Mule was made with Goslings ginger beer and was delightful.  Service simply average, but I wasn't expecting the world here.  So three stars, barely.  With some attention to ingredient freshness, a better drink list and some fixing of minor details this could be a fun after work drink and nibbles spot."], ["Lauren B.", "This is an all around great place with great ambience, wonderful service, and delicious food.  It's a neighborhood favorite and we feel at home there. Our favorites include: Damascus hummus, lamb shawarma, fresh baklava, unbelievable pizzas, and a super wine selection!My parents live around the corner and frequent Arabesque ever other week.  We visit from Colorado every summer and we plan our menus around what nights we're having the Turkish fatayer pizza!!!You'll love the welcoming friendly staff!"], ["Linda O.", "Yes! Perfection! This has got to have the best ambience and most contemporary, comfortable, and stylish setting in all of Columbia. The comfy cushions and most adorable chairs were heavenly. The service was impeccable. The prices are extremely reasonable. Food was exquisite and fresh! This place is vegan and vegetarian friendly as well as for those who are health conscience. I had the spinach fatayer (which doesn't have cheese) and is made with FRESH rolled dough daily (the same that is used for the Damascus bread) so it isn't oily or buttery... Absolutely perfect! Then I had the hummus with pine nuts and olive tapenade. Although these were both appetizers I made them my meal. The place was also incredibly clean and I have absolutely zero complaints and nothing but raves (I can't remember the last time I have been able to say that about a restaurant.)"], ["Taylor G.", "This place SUCKS. Ordered eggplant parmesean and lamb schwarma at 6:55 pm. Told over the phone it would be a 35-40 minute wait with zero explanations offered for this longer-than-usual wait time Arrived 50 mins after placing my order (just to give them enough time), and believe it or not, our food STILL wasn't ready. But this pales in comparison to what I'd face next...After receiving our food around 8:00 pm, we were told that our eggplant parm (listed online at $7.95) cost FOURTEEN DOLLARS. Expressing our displeasure in the consistency in the online menu versus reality, the owner then told me that my salad, which COMES FREE AT LUNCH TIME, cost me an additional $3.00 on top of my FOURTEEN DOLLAR eggplant parm. Even after discussing with the owner our obvious displeasure in the way things had gone down, we were offered no discount, and simply told \"Sorry\". This is my first Yelp review, and hopefully my last, but it was well worth it to create an account just to tell the world what a mistake it would be to come here. Oh, and top of that, the \"garden\" salad I paid $3.00 extra for came with only 1)apples, 2)lettuce, and 3)ranch dressing, despite being listed on the menu as containing sunflower seeds, cranberries, and green peppers. And the eggplant parmesean that i paid FOURTEEN DOLLARS for was below average, at best, and simply came with a PILE of unwanted, and unmentioned, spaghetti. NEVER eating here again is an understatement.Taylor"], ["Anna D.", "yeah yeah yeah... i'm ready for another trip!I came with my hubby and two other friends (another Anna from Yelp). I must say I did enjoy their hummus and babaganoush (combo appetizer recommended by the waiter-which by the way is half off all appetizers before 7pm). Both the service and the food was good. It was pretty slow at the restaurant but on a weekday i guess that's expected. For my entree i got the lamb shwarma and it was gooooood. In fact, it was so good i was talking about going there again earlier. What can i say, shwarma warms my heart and my belly. There's one other place in Kansas City that I enjoyed eating their lamb dish but it was not as a convenient drive as Arabesque is. Good thing for me i'm just a few mins of a drive to good food."], ["Faisal S.", "Hands down the best Lebanese cusine in the country. You will forget west coast cuisines. 2 thumbs up!i!"], ["Robert L.", "Fantastic food and a great atmosphere! Great for a date night! Service is excellent! Faris was an excellent server! I just wish that the baklava wasn't sold out.... Oh well, next time, I will definitely be back!"], ["David N.", "This place is amazing and a must stop if you are ever in this city.  The sampler appy, the arabesque salad, and the mixed grill were recommended by Amanda the waitress this evening. Amanda further provided descriptions of the food and was enthusiastic about everything to do with this restaurant. She was spot on! Further had a glass of the house Lebanese wine which complimented the meal. I will definitely return here and I recommend you do too!"], ["Jerel R.", "Exquisite. Arabesque has their new lebanese dinner menu. Food is even more fantastic. Who would have thought in Columbia, SC such delicious and reasonably price food?      Silvana the owner, host, and sometime cook is a gem. Outdoors. Dog friendly. FULL BAR (she's Lebanese Christian). Elegant dining room where you feel you're in the Middle East. Back room for parties. Do catering. Great place to hang as well as eat.  Jerel ps. but don't come if you're in a rush. :)"], ["Juli B.", "Seriously delicious food and always consistent! The hummus is homemade and literally the best I have ever had in my life. My go-to meal is the Damascus Hummus with Lamb and my boyfriend is a huge fan of the Chicken Parm. We order takeout at least once a month but we find ourselves craving it much more often than that. The pizzas are also great along with the schwarma (sp?) and babaganoush! Can't go wrong with anything here!"], ["Keegan C.", "Great food. Great atmosphere and excellent food. The Damascus hummus plate is generous and the Al amir salad with mint is addictive."], ["Mike O.", "Among the best restaurants I've been to in Col'a. Came here with family. We started with appetizer sampler, which was very good. I'm not a huge fan of baba ghanoush, but it was smoky and tasted great to those at the table who liked it. I'm also not a huge fan of grape leaves, but the hummus, falafel and damascus bread were awesome. The salad starters were also excellent. I don't remember the names of any of them because for some reason Arabesque doesn't publish it's menu online. Can someone take a snapshot of the menu and post it on Yelp? I had the salad that was cucumber and tomato based and others had the salad that was parsley based. Both were excellent and healthy.Our entrees were unbelievably good--truly, the best part of visiting this restaurant. I had the veggie dish that had lentils, rice and onions. The other dishes were also excellent (although I can't remember the names because I can't find the menu DARN, but they were:) lamb and rice, steak and rice, and chicken and rice. Everything was phenomenal. Huge portions. Vegetarian friendly, everything. The only aspects of this restaurant that bumped it down a star for me were that they were out of Lebanese beer on a Saturday evening, and that our server was just an odd dude. There is no other way to explain the latter, just someone who is awkward and is trying very hard. I felt for him, though. He didn't mess anything up, he was just odd."], ["Sean S.", "The food has gotten even better lately.  When I'm not in Columbia, I crave this place.  When I am, I eat here like 3 times a week.  You have to try the Arabesque hummus with lamb.  It's hummus topped with lamb and served with a large fluffy Damascus bread.  The mussels are also an excellent appetizer.  Wash it all down with an excellent Ksara wine, a Lebanese favorite, or an Almaza, a Lebanese beer.  Honestly the beer alone is worth visiting for... when I moved to Boston I hunted for a restaurant that served Almaza for weeks.  Also happy hour is from 4 to 7 pm on weekdays, and they do half off all alcohol, as well as most appetizers, making it BY FAR the best deal in Columbia.  Where else can you get any premium beer for 2 dollars?  I can't believe more people don't know about this place.  If there's one restaurant you should try in Columbia, it's this one."], ["Kim W.", "Amazing food, atmosphere and service. We started with the freshly made hummus and added some pine nuts- it was devine on the delicious Damascus bread. Then we had the mixed grill and it did not disappoint; great veggies and meats. I even tried a Lebanese Pilsner Almaza which was pretty darn good. The staff was very attentive and pleasant. We left very happy. We'll be back!!"], ["Tanay N.", "Came here for dinner the other day, we were famished.  The vegetarian appetizer plate hit the spot, everything was great especially the baba ghanouj.  The lamb shawarma pizza is definitely unique and it was pretty good but not amazing.  The chicken kabab was good, the veggies were tasty but the rice was a little disappointing.  Overall, recommended!"], ["Jonis L.", "Great place to eat if you're hungry for Middle Eastern food. The portions are huge and the staff are courteous and attentive. They made my dining experience special. The place is huge and they also have tables outside. They also have a bar but I didn't order any drinks so I can't say anything about that. Two thumbs up to Hasan  and his staff!"], ["Tallulah Jean M.", "I looked this place up and it had really great reviews. We set on our way for a nice lunch. Sadly, when we walked in they informed us that they close at 2pm and re-open for dinner at 4pm. This was a big disappointment. They need to change their times on Yelp if they're gonna do something like that. I'm sure their food is great....but..."], ["Eric S.", "Excellent option for Mediterranean food: Arabesque is a Lebanese restaurant with simple, but culturally appropriate decor and ambience. Our waitress, Lisa, was incredibly attentive. It's hard to not fill up on Damascus bread and salad before the main course, but you must because the main dishes are just as good.  I can't remember whether 50% off pizzas was Tues or Thursdays."], ["Adam B. J.", "Menu seemed very close to when it use to be an Al-amir.  Even called things Al-amir, so I'm assuming it is a part of the same restaurant group?  Very understaffed.  Two servers and one kitchen person (heard the waitress tell another table).  Hummus was dry and not as good as Al-Amir, Med. Tea Room, and others.  The sampler platter was good, and all apps are 1/2 off at happy hour which is a plus.  Wife got the Pizza and she thought it was better at Al-Amir on Main as well as the new one up Main St.  I got the Chicken Schwarma.  It was excellent.  Summer Salad, is the best side salad in town.  Server was in the weeds so service wasn't great.  Couldn't tell us what beers they served, so ended up with two Coors Lights.  Happy hour prices will bring us back."], ["Ted K.", "Best restaurant in the Columbia area. Much better than any Al-Amir. Absolutely delicious. Every aspect of the service was amazing. They have the best hummus here I have ever tasted. Their Turkish coffee is so delicious, and their baklava is the freshest of anywhere I have ever had. The owner personally came out to check on us many times, and even helped serve. I can't recommend this place enough."], ["John S.", "This place was great across the broad.  The food was good and fresh and Thursdays pizzas is half off.  The service was great...even with dealing a 30+ person group in the other room.  Wish they were closer to Harbison."], ["Karen S.", "I'm not much of a Lebonese / Mediterranean cuisine person, so it's hard to compare to some of the other places (food-wise) in the Columbia area, but thought food was food.  I had ordered the Pusha (sp?) Chicken over rice (most of their dinner selections come over rice or pita bread).  Spices on both the chicken and rice made the disk tasteful. Portion sizes were OK.  I could have done without the special sauce and vegetables that came with the dish and maybe more of the main course, as well as a slightly bigger side salad 9which there were a variety of choices to choose from).  I ordered a small portion of their Damascus Bread as an appetizer, and it was HUGE.  Our waitress had told a couple people in the party that were ordering small pizzas that the diameter of the pizza (along with the crust) was the same size of the small portion of the Damascus bread. (Beware - the seeds on the bread kept falling off!)We had somewhat of a large group last night and they were able to seat our group towards the back of the restaurant (right by the kitchen).  Could not tell if there was another room that could also be used if you have big groups dining here.  Our waitress was good on checking in on our group (there was about 15 of us in attendance).  I have to agree with one of the other yelpers, there really is not much of a hostess station to check in when you arrive (you're walking into the bar area) and made it difficult to see who might be able to direct to where my group was."], ["Jolande M.", "Food was wonderful after a rocky start. We were seated for 20 min and still no server. Don't know what was going on but my husband finally went up to the hostess stand to ask if someone could serve us. After that Trent took great care of us. Kudos to the manager for discounting our meal unsolicited. We will definitely be back!"], ["Kristen R.", "Yum! This was our first visit here and we will def be back! The food and service were excellent!"], ["A M.", "Finally I stopped by Arabesque to give it a try. Wow! I was pleasantly surprised. I had lamb kabobs and the mussels. The food arrived promptly. The portions were great. I highly recommend this place to everyone in Columbia. What really sets this place apart are the owners. They made my dining experience even better by their attention to the customers. Other restaurants in Columbia should learn  from Arabesque, what true customer service is about!"], ["Kara W.", "The food is good and fresh but service is always very slow. Not sure if this is because we are always there at lunch or if it is always slow."], ["Khadija E.", "This is an update on my previous review. I have officially stopped going to this restaurant, and I don't miss it. I have discovered Al Amir, particularly their branch called The Epicurean - their menu is almost the same as Arabesque's and their service is so much better. I have also become a fan of Ariana's Greek Restaurant in West Columbia."], ["Emily E.", "The only time I've had good Lebanese food was in CA...until today!  Was pleasantly surprised to find this place really delivers on flavor!  I tried the Al Amir salad to start which was light and crisp with citrus and mint flavors that were spot on.  The main entree I tried was the lamb shawarma with tender perfectly seasoned vegetables and delicious rice.  Also you must try the Damascus hummus and bread.  Simply amazing!"], ["Elizabeth F.", "Okay, first of all, I've worked in restaurants, and I understand it can be difficult to manage four or five tables at one time. That said, though, the service at this place was among the worst I've ever experienced. When we were seated, there was only one other group, and it filled up slowly over the almost two hours that we were there. It took forever to get our food. It was almost impossible to get a refill on water --- and when we did, the water tasted the pitcher had iced tea in it and hadn't been washed. Our salad plated sat on the table forever after we finished with them.  The waiter had zero personality and if anything seemed annoyed that we were there. He was downright crabby about having to split our check, even though he never asked how we were paying at the beginning. The food was good, though, and if the service had been better I would have given this a much, much better rating. The only thing I didn't like was the apple/feta (don't remember the name) salad. It would have been good, but there was way, way too much dressing on it. I'd go back, but only if I knew I was going to get a different server."], ["Eater Of Food S.", "I've had some bad experiences here but lately it's been better. They are trying harder with customer service. I'm still not ready to eat in due to bad experiences but the take out lately has been excellent. Our standard order is pizza, hummus, baba and fetoush salad. Really it's all excellent and delicious."], ["Michael R.", "First, right now I want to give them 1 star. At other times - I want nothing more than to give them 5 stars.The problem here is that they CANNOT seem to get take out food done with any amount of quality. It's the most amazing thing I have ever seen. My girlfriend and I love eating there in person. Food is traditional and made with care. We love ethnic food of all stripes but really enjoy Mediterranean. Add to that, the restaurant is right in the neighborhood. So, if you grab a table and they know you will see the food on your plate - chances are you will love it. If you happen to want to grab some food on the way home. PASS THIS BY. I held off writing this until the 4th time our take out was screwed. 1st was a burnt pizza. 2nd was a screwed up Damascus bread. 3rd was a really messed up salad that remained messed up after opening it to check (after the first two times) and still got it wrong. Fourth was another messed up salad that looked like to may have been dug out of the trash. I was just too tired to remember to look and correct their inevitable mistakes.So, I am conflicted. Amazing experience in-house.  However, I may never go back, period since they don't give a crap enough to take care of their customers that won't catch their errors in time to do anything about it. Be warned. They won't be open long enough if this keeps up anyway and it's a shame/"], ["Jessica K.", "Great place on Devine st! They have excellent brick oven pizzas and their falafel is amazing.  I am a huge fan of falafel and theirs gets my seal of approval. They do serve alcohol which is nice to have.  Wine and pizza always go well together. Only down side is the 4 times we have been there we had to wait almost an hour for our pizzas. We keep going back hoping it will be quicker because we do enjoy the food.  Last time we went if was incredibly warm inside, maybe their air conditioner broke, but if was hard to eat the food.  Overall I do love the place, just might get carryout next time."], ["Tyler L.", "I was really looking forward to eating here. I hadn't had Lebanese/Arab cuisine in a while and really love that type of food. I noticed the good ratings on Yelp and knew it would be great. I must be the exception because my experience was a disappointment and I will not go back on principle. Keep in mind, I love giving good reviews because they are usually shorter. But I have to be honest so people who read this will get a more accurate picture of the experience at Arabesque.I went there with my wife and another married couple that loves Lebanese cuisine. The first thing that went wrong, although small, was that they were out of the only Lebanese beer they carried. It's a Lebanese restaurant, they had Lebanese beer on the menu, but were out of it. This is a very small setback, although a little disappointing. But it turns out, they were out of a lot of beers that were on the menu that they didn't have so they server had to make a hand-written list of available beers, which was appreciated. Second, the server, although very nice, was scatter-brained. She was extremely nice but she kept forgetting things, giving people wrong drinks, leaving lots of plates and empty bottles on the table, and seeming very unsure of what she was doing and saying. She would start to say something, then say \"never mind\".  But again, she was very polite. My food was pretty good, so there is nothing to complain about there. But my friends ordered a pizza and they put ground beef all over it even though it was only supposed to be on half the pizza. I love ground beef, but evidently one of them hated it and did not want it. The server said it might take a while to make another one since they were busy. What she should have said was that they will make another one immediately since we had already been there a long time before it got busy. The manager did come out and say she would take it off the bill, which was very kind of her. And, she offered each one of us a free drink, which seemed awesome at the time. You're probably wondering why in the world I would only give it two stars at this point. I'll get to that. When the bill came, I was charged full price for an appetizer even though it was supposed to be half price due to happy hour. And the thing that got me was that I was billed for something that I didn't even order. On the menu, they have beef kabobs for $13, and beef tenderloin kabobs for $16. I ordered the beef kabobs for $13 but was billed for the beef tenderloin kebabs. I showed the server the appetizer discrepancy and where I was billed for the wrong item. She admitted that the appetizer should be half off and also admitted that she did bill me for the wrong item. She said she rung it in as the beef tenderloin and that is what I did get, but she remembered that I only said beef kebab, not tenderloin. She came back to the table with the amended check and said the manager was willing to take half off the appetizer but would not change the charge for the beef tenderloin even though we all know I did not order it. Had I known it was the beef tenderloin, I would have said something. I was eating it and it tasted no more tender than a sirloin steak, not a tenderloin. The manager personally came out to us when things went wrong at first, making things right. But when it came to wrongly billing me, she hid in the kitchen and let the server come out and deliver the bad news. I am the most forgiving and understanding restaurant patron, but the manager was basically saying that I was lying. The server even told her just to take it out of her tip, which I told her that I was NOT going to do. This was something I could not deal with, although I actually did and paid the dang bill. The free drinks for the screw ups were a nice gesture, but telling me that the bill would not be corrected to accurately depict what I actually ordered crossed the line. The manager just lost a future customer over $3. She told the server that she had already taken enough off the bill. The service was slow, the server kept forgetting things and seemed frazzled the entire time, and food came out incorrectly. All that would have been fine until the manager insisted I pay for something I did not order. That was an unwise move because I will never go back now. And I'll tell everybody I know never to go there. $3 is almost nothing to me. But not changing the bill to what I actually ordered because I ate it unknowingly wasn't cool. The server messed up, the manager was unwilling to make it right. The pizza my friends ordered was mediocre. My food was pretty dang good, not great though. But the manager insinuating I was a liar by not making the bill right and hiding in the back to let the server tell me.....well, that is pathetic and disrespectful. And that is just bad business."], ["Stephanie S.", "Amazing food, fantastic service. They treat you like family. The atmosphere is so comfortable and gorgeous, it's hard to leave. :) I would highly recommend this place and can't wait to eat there again!"], ["Wesley D.", "Big fan. Very authentic. One of the best ethnic cuisines in all of Columbia.The hummus is fantastic. I love the shawarma wrap."], ["Gilbert T.", "Wow this place was great. Tried the lamb shawarma wrap. It's was amazing.  Will def come again. The only reason I giving 3 stars is because the service wasn't that great. I get there before a waiter is about to go home and he didn't want to help me. He was waiting for someone else to get there so he could clock out. Then the waiter that ended up helping me took off to Starbucks while I was eating. I understand it's Sunday and I'm the only one here. But wtf really? He couldn't wait until I was done?"], ["Carl R.", "It didn't take long to try this place again. Another good experience. Servers have been excellent. I was able to try new dishes this time, and was very happy. I recommend the entrees they are known for. Happy hour till 7, half price beers, wine, and apps. Have to try Damascus bread too!"], ["Naomi R.", "Everything about our experience was wonderful! It's like eating at your Middle Eastern Grandmother's house. Well it was for us. Victoria prepared our food for us. We had the grape leaves and falafel for an appetizer. The grape leaves were perfect. Not too vinegary or oily. Falafel was fresh just like you find it in Jerusalem! We had the Damascus bread with lamb. Yummmmm..... The portion sizes were great and were fitting for the prices charged. Forget Al Amir. Arabesque is far above any Al Amir location which is run by the same owner anyhow. We are now Arabesque customers only!"], ["Maggie s.", "Fantastic as always. Beautiful day to sit outside and enjoy the hummus and very authentic swarma. Owners are always delightful and staff is very friendly."], ["Riz S.", "Amazing food with solid service. They're menu has something for everyone. If your a vegetarian they're falafel is crispy and delicious. Looking for ethnic fare? They're Damascus bread/Baba ghanouj/Hummus/grape leaves is filled with rich flavor and seems to be made with quality ingredients, all of which comes in the Arabesque sampler! You may not expect pizza to be a hot item at a Lebanese restaurant but it was amazing. Thin crust, beef pepperoni, chicken, and gyro meat all under a layer of melty mozzarella will make you weep in awe!"], ["Ken H.", "THE EXACT SAME MENU as Al Amir's right down the street EXCEPT everything here is about $5 dollars more expensive! C'mon people!! This place used to be called Al Amirs 6 months ago, they just changed the name and raised all the prices trying to be all schmamcy ...Perhaps in an attempt to dupe all the other retards spending butt loads of money next door at all the boutique stores that pepper Devine st. .. A candle store really!!?? (There is a newer random overpriced candle store nearby) I guess they thought they would  just change the name and raise the prices thinking no one would notice??  How can anyone think this is acceptable!! Spend 30 cents more in gas and go to the same restaurant on Main st. a mile down the road For less! But at this point, really who cares if it saves you money... Do it on principle!!"], ["S H.", "I love the food here, specifically the falafel, veggie curry and hummus with damascus bread. I'm thrilled they are within walking distance to my home. :)That being said, do yourself a huge favor and do NOT go here if you are in any sort of hurry or ravenously hungry. Because you will have an angry, long wait. They have a more European approach to service and while that's great when you've got time to relax at one of their outdoor tables, it's not so great when you are hungry and pressed for time. (They do have one server that works very hard and I've seen him scrambling about trying to cover all of his tables while another server lazily half-skips to her smaller number of tables. It's a weird description, but if you've ever spoken with her, you'd understand what I mean.)This place is very vegan friendly as well, which always gets more respect from me. We love to get it for take-out or we'll often bring our dogs and sit on their patio. They are kind enough to provide water (and one time, treats!) for our babies. This location has changed names numerous times but the food is always the same. I'm not entirely sure what's going on, I just hope they stick around!"], ["Kara B.", "My boyfriend and I dropped into Arabesque so that we could switch it up from our typical wing night. We had THE BEST experience. Not only is the food very authentic and YUMMY, our server was great. By great, I mean she got my email address so that she can email me about the local middle eastern grocery store here in Columbia, made fantastic recommendations and explained how things were made and about the ingredients, etc. This is definitely a great date night spot, but a little on the pricier side. Our meal: Babaganoush, Fatoush Salad, Mussles & Damascus Bread, Lamb Shawarma, Lebanese beer"], ["Laura H.", "I want SO badly to love this restaurant. Growing up in a Lebanese family left me with very high standards for this type of cuisine and let me just say that the food here is not the problem. It is actually the only reason our party did not walk out of the restaurant after a nearly 2.5 hour wait for our meals. The birthday girl ended up taking her entree in a to-go box because it was such an ordeal.  Our appetizers (all dips and spreads) took an hour to make it to our table and  the Damascus bread we were to eat it with took 15 more minutes.  That left us all staring at a bunch of food we weren't able to eat.  Entrees were an hour longer and one of them came out cold. Our waitress was young and inexperienced but apologized profusely as anyone should.  Mind you, we were only one of two tables in the entire restaurant.  I don't expect to ever return to this establishment solely based on the fact that if I wanted to wait 2.5 hours on Lebanese food, I would just drive the distance to Leila's in Charleston and save myself the disappointment."], ["Chuck W.", "I absolutely love this place. The atmosphere is warm and cozy. They have middle eastern music playing softly over the intercom which helps set the mood. The wait staff is VERY friendly. The humus is by far the best I have ever eaten. I had the beef tips over rice. Came with a salad. Everything was seasoned to perfection. I was a little skeptical of Lebanese food, because to be honesty, I was not really sure what it was. So glad I tried it. There was six in our party. We all love it. This is a gem of Columbia!!!"], ["Aaron Z.", "Name change from Al Amir and cultural change. Arabesque has beer, wine and Hookah! This place has way better pizza than Za's and if you are not scared try the rest of the menu, it is delicious."], ["Katie D.", "This is a joke of a restaurant.  Went here for lunch and there was one woman working the entire (busy) place, who doubled as hostess and waitress.  I should have known that the dining experience would be less than up to par when I noticed that the entire front room and bar was in the process of being renovated and had tools laying on the floor and EXPOSED WIRES hanging from the ceiling.The restaurant's single waitress failed to refill our water glasses and take our orders until we had been there 30 minutes.  They still use the menus from when the restaurant was Al-Amir.  The food was incredibly slow to come out, and when I explained that I had to get back to work and had been waiting over an hour the waitress was incredibly rude and gave me attitude and told me I was waiting because my \"falafel was the reason it was taking so long.\" (were they growing the chick peas themselves in the kitchen or something?)The most laughable part of the whole experience was when we ordered a hookah and she brought it out and asked if we had a lighter.  Then she gave us a little flip lighter and told us to hold it on the coal for at least two minutes (a task we couldn't complete without burning our fingers.)  She then gave us attitude and told us we were doing it wrong, though she couldn't light the thing without burning herself either.We were there almost a total of two hours for two glasses of water (refilled once) a glass of tea (nearly undrinkable it was so strong) and a half-baked attempt at hookah (which they didn't charge us for because nobody could light it).  All in all, I wouldn't have been nearly so upset if the waitress hadn't been so incredibly rude to us.  Don't eat here, there are plenty of legitimate businesses that provide quality Mediterranean food in Columbia.  This is not one of them."], ["Jeff P.", "We had such a great family meal here!  Every dish, side dish and salad was superb.  The waitress Shelley was so nice, I imagine she was part of the family that owns the restaurant.  Our kids liked the food as much as the adults, HIGHLY recommend."], ["Valery H.", "Friendly ambiance and newly renovated bar area! The tabouli is exactly the way my mom made it and I ordered the Turkish pizza with mint and feta and spinach- it was delicious! The waitress informed me that the baklava is made in house as well and it tasted that way too- crispy and sweet! I will be back for sure to try the lamb gyro at lunch!"], ["Ravi T.", "The falafel wrap here is legit good.  Have it with their homemade hot sauce.  Both times I have been there the service was attentive, maybe that's because both times I came in after the lunch rush and was the only one there....hrrmm"], ["Jennifer R.", "Went here for lunch with some out of town friends. Had never been before and we were all very happy with our food & experience! We had the hummus and it was delicious! I had the shwarma and it was great. Service was prompt and our waiter was very friendly. Great place-we are glad we found it & will be back!"], ["Jon F.", "Horrible Horrible Service by our waiter.  He was very unenthusiastic to us and almost seemed crabby.  I have been a waiter in restaurants before and I know having a lot of tables at once can be hard at times,  but when we got there there was only one other table eating.  We finally got our order taken and got our salads.  I would recommend asking for the dressing on the side unless you like your salads loaded with dressing.    About 15 min after us being done with our salads our food cam out and our salad plates were still sitting there on the edge of the table.  Enough said about service,  the food was pretty good tasting,  I would go back but ask for a different server if I get the one I had."], ["Kelly D.", "Not sure how food really was because service was so bad I only had a salad... The salad however was drowned in dressing and had mushy pepporcini.  We waited for at least 25 minutes before noticing half of our order sitting on the counter.  Once we noticed, we waited another 5 minutes before saying anything.  When we asked the waitress, she argued with about the amount of time the food had been sitting there and said she was waiting on bread.  However, another table that arrived after us, got bread so not sure what their problem was.  If you want snotty waitresses and really long waits, this is the place to go!!!"], ["Daisy B.", "I am giving this 3 stars because the food was good, but this is NOT the place to go for lunch or you will never get back to work on time.  We were a table of two people and there were only three tables total occupied although a few filled later.   It took almost 45 minutes to receive our food (I had to ask the waitress when we could expect our food as I had to get back to work), and the waitress (the only one) never refilled our drinks.  We watched as people who arrived later than us received some of their food before us.  Our order was not complicated (damascus hummus combo and falafel wrap) so it should never have taken as long as it did.     From reading another review, it seems they had the same experience we did although the waitress was not rude, just not attentive.But I will say the Damascus hummus combo was quite good, better than Al Amir on Main St. across from the University."], ["Melissa W.", "Arabesque is probably my favorite restaurant in Columbia. Order the Damascus bread, Baba Ganoush, or anything else for that matter. I have never ordered anything which I did not thoroughly enjoy! They also make some of the best pizza to be found in town. The wait staff is quite helpful if you are unsure of what to order, and it is a pleasure to be treated so warmly in a restaurant. I am not sure where the commenter Katie D. ate, but I can assure you that I have eaten at Arabesque over a dozen times and never had a bad experience. Yes, there are times when they are busy, but a meal is to be enjoyed, not rushed through at all costs to hurry back to work. I also question why if she were in a such a hurry to get back to work after lunch, she chose to enjoy the narhile (hookah). If you want real Mediterranean food (not the typical cookie cutter/chain food), this is the restaurant you should try."], ["Ashlee F.", "I am a service and I understand the service industry and when I went there to eat today I experienced the WORST SERVICE EVER. For starters, the coke was nasty and the table wasn't wiped down. The server had the worst customer service ever and did not care about his customers. He never asked how we were doing or how the food was and failed to take dirty dishes from the table and refill my drink. I understand waiting tables can be hard and frustrating but this was completely unnecessary. Let's just say we were thoroughly disappointed and will not be returning. So sad to see places with such great food go downhill like this."]], "Boeshreen": [["Kara B.", "Loved our dinner there of delicious Libyan food this evening. The lamb, soup (both lentil and Libyan were fabulous), garbanzo and onion side, white beans, and eggplant squares were worth a future return trip. The wait staff were friendly and attentive (coming by our table to check on how we liked the food), and the decor is intriguing. My favorite parts of the decor are the historical signs near the door about the cafe in Libya. Oh, and the other great news is that Decker Blvd now has a cafe as well. One half of Boeshreen is restaurant and the other half is a cafe with a full coffee and dessert menu. We ordered creme baklava, sesame cookies, and regular baklava to take home and devoured the desserts immediately. I will order all of them again. Double thumbs up for this addition to the Columbia dining scene, and lucky us that it's our neighborhood."], ["Monserate M.", "It's so pretty inside... You forget what side of town you're on! Everyone was super attentive and kept making sure we were doing well. It's cafeteria style ordering which isn't always aesthetically appealing, but everything looked good-not great - but not \"I don't want to eat that\" I'm glad we moved forward! You get a choice of Libyan or lentil soup with your dish, then you pick rice, vermicelli, or couscous as your base and top it with your choice of garbanzo stew, vegetable stew & one other. We had the couscous with garbanzo stew and rice with vegetable stew. They sure were tasty! You get a side on top of that and have the option to add a protein. We got stuffed peppers as the sides and roasted chicken. The peppers were a little bland but salt is a good thing! The chicken was well seasoned. All in all, I'd go again. They gave us tabouli salad, bread and their hot chili sauce on the side at no cost. It's a lot of food for around $11 a plate! One thing... I would love the food to be HOT and not on the warm side. Looking forward to trying the coffee. I recognized one of the barristas from a different coffee shop in town so you'll be in good hands. Took some pastries to-go... Will update you later :-)"], ["Emily R.", "This place is amazing! It should be a \"destination spot\" on Decker. The owners have worked so hard to redo the location into a beautiful new space, showing their love of sharing their food and culture with others. The cooks, servers and even the owner greeted me and helped me explore their buffet of food options, all in a Mediterranean style with a Libyan twist. Both times I've been they shared several free samples, clearly just for the sake of allowing our table to try more new foods (and for the joy of watching people enjoy their cooking!).  My favorite dish was the Libyan soup (a chicken stew that is beautifully spiced) but you really can't go wrong. Try this place out!"], ["Mark R.", "This is a very interesting new Mediterranean restaurant on Decker Blvd. opened by the family that has owned and operated a chain of same-named restaurants in Libya since 1925. The pastries and coffee are great with choices not available elsewhere in Columbia. I cannot wait to try the meals! They have put a lot of money and work onto opening a very nice space for a meal or hanging out with a coffee."]], "Pita Pit": [["Lauren H.", "The only thing that was negative about this place was finding a place to park. And there's no bathroom inside. Other than that it was a great experience! The two guys working were awesome and helpful. They made conversation with us the whole time. The food was delicious as usual! It's definitely the place to go if you're looking for something healthy and filling."], ["Courtney B.", "Food is ok. Nothing special.But the service is consistently rude. Have your game face on before walking in the door."], ["Brandon D.", "I don't know why I haven't gone to this place sooner.  It's amazing!  I really didn't see anything I like on the menu, and the guy working said I could build my own.  So I did.  I ended up ordering the philly with bacon with provolone and cheddar cheese.  It was cooked fresh and all of the toppings were fresh.  The pita was delicious.  I will diffidently be back!  If you haven't gone here before, check it out!  You will not be dissappointed."], ["Kate P.", "I love my pita pit. It's a really great late night option when basically everything but cook-out is closed. Also, as far as fast-ish food goes, it's relatively healthy. I always load mine with fresh veggies, and if you wanted to you can forgo the pita and have the whole thing as a salad (honestly never tried that so I can't speak to how big they are, but I know the ingredients are good!) The only thing that sometimes stinks is that when you're having pita pit for lunch or dinner, sometimes you want a side dish (other than a bag of chips...) and none of theirs have ever appealed to me. They might be delicious, who knows, I've never tried them and I've never seen anyone else try them either..."], ["Russell M.", "Oh my god. This place is the best. Everywhere should deliver this late and be as accommodating as pita pit. Good job everyone that works here."], ["Chelsey W.", "Definitely gone down hill. Food is still reasonably decent, but it's been more of a let down each time. Staff..... Absolutely horrible."], ["Aaron S.", "Wow! Nothing helps soothe a inebriated stomach like Pita Pit. Needless to say, I pre-gamed a bit too heavy before going to Sharky's in five points. At what I think was 1am my friends and I made a trip to Pita Pit. What a relief! All the staff was friendly, and kept refilling my complimentary water cup with no hesitation. The food was delicious. I got a buffalo chicken on wheat. I asked for extra buffalo sauce and two different employers added extra sauce so mine was burning!!! Very good. I didn't know the hummus was extra, unlike the pita pit in Greenville, but that's okay. It was delicious without it. I love the great fresh toppings, the alfalfa was great, and my friends loved that I suggested we come here. They hadnt been before and they were so impressed. Thank you employees for putting up with my loud obnoxious friends, as I tried to control them in my intoxicated state of mind. I am a functional drunk, so I did my best. Food 5/5 friendliness 5/5 freshness 5/5. Will definitely be returning very soon!"], ["Faith S.", "Small place BIG taste ,,, red hummus and fresh pita chips blackbean wrap ,, friendly service"], ["Christian R.", "Amazing how you can find this kind of a jewel in Columbia. The pitas are made fresh to order, with the choice of either white or wheat pita bread. We ordered a beef gyro, to which I can NEVER pronounce correctly, and 2 prime rib pitas, all of which were to die for. The neighborhood it is located in is not too comforting, but the restaurant itself is divine! The wonders that come off of that 4 square foot grill. Food: 10/10, Service: 9/10, Freshness: 10/10"], ["Beth And Jim S.", "She said: After having eaten at the Pita Pit in Charleston, WV, I couldn't wait to find one near here to give it another try. The food at this location was fine (not as good as my visit to the other one, though). My favorite item is the gyro. (This is a \"fast food\" version of a gyro, but still tasty. My husband and I both love gyros, so I wish he could have been with me to add his review.)I also ordered a side of hummus and pita. The hummus wasn't great. I don't know if this location uses a different kind than the other one did, but I didn't care for it. It was gritty and thick. The texture and taste just seemed off to me.The dining room is small, but clean. My only real issue is the lack of a public restroom.  If this doesn't bother you, then you'll probably like this place."], ["Joshelyn ..", "I LOVE Pita Pit!!! Anyplace that offers reasonably priced healthier options after hours is always a plus! My chicken pita with the works gave me life at midnight, and no I wasn't drunk. The customer service is decent compared to other reviews I've read about them but I mean put yourself in their shoes, they're serving mostly drunk college kids at night so I wouldn't expect a \"welcome to Moe's\"/Chick-Fil-A type of service. And no they weren't rude either. The quality of the food was amazing! I am beyond satisfied."], ["Jane D.", "my kids love it because you can create your own sandwiches."], ["Clara S.", "I have lived in Columbia for the past 8 years, and I have been to Pita Pit many times.  It is a small restaurant (limited seating), excellent for take out, with a pita selection set-up similar to a subway restaurant.  You can choose what kind of basic pita you want, and then add toppings, cheese, and different sauces.  They have chips and drinks to grab as well.  Also, they deliver, which is convenient. Even when trying new things here, I have never had a bad experience, and the staff has always been friendly.  All the toppings are always fresh.  What more can you ask for?  This is DEFINITELY a popular restaurant in the area, especially if you are looking for something that is potentially healthy.  This restaurant definitely deserves at least 4 stars."], ["Scott G.", "I am supposed there are not more rating here.  They usually get a 99%+ DHEC rating and have gotten a 100% in the past.  Open from 11am - 4 am on Fridays and Saturdays it's always great and filling.  I am a guy who can eat alot of food and the portions are large. My personal favorite is the gyro with feta, mmmm so good.  Used to eat here at least once a week when I was a student at USC!"], ["Roel F.", "This place has only been reviewed a couple of times, which no doubt explains the ridiculously low rating! I very much enjoyed my visit to the Pita Pit. Service is quick and relatively friendly, the place is spotlessly clean and the pita I tried was very tasty! (I was recommended the Greek pita and chose a bunch of Mediterranean toppings to go with it. The combination was super tasteful.) Portions indeed are not huge, but I found the pita to be decent in size. I have not tried the falafel (see one of the previous reviews), but I will try to do so on one of my next visits to see if it is any good. Overall, I can only recommend Pita Pit!"], ["Frank T.", "Paid like $6.00 for a small pita sandwich which was more of a snack than a meal. It tasted alright, but I wouldn't be excited about this place even if the portions were decent-sized. Meh."]], "Elie's Authentic Lebanese Cuisine": [["Melissa P.", "The food here is amazing!! We started our meal with the appetizer sampler which had hummus, grape leaves, falafel and baba ghanouj, The tea was delicious...it has mint in it and it is not only refreshing but so good smile emoticon For our meals, we ordered three entrees, shwarma, baked kibbeh and Nansi's shepherd's pie. I cannot even tell you which of the dishes was my favorite!! They were all so flavorful and delicious. Each of the dishes came with a small salad as well. I loved the fried pita chips that were in the salad as well. And to finish our meal, we had baklava. I cannot tell you how absolutely amazing the food was. We loved our dinners so much we ordered lunch for the next day to take home with us smile emoticonAnd I cannot say enough amazing things about Nansi, who was not only the cook and our server but also our entertainment. She has such a great sense of humor and was so much fun to talk to. I cannot wait to go back again."], ["Maureen P.", "Great food and service. Even though the location is a bit out of the way, the place was packed by lunchtime--always a good sign. I had the eggplant pita, which was just divine, topped with the best feta I've ever had. My sister tried the lemonade with orange blossom honey and mint, and it was fantastic! I definitely recommend it. We also ordered dessert, a sort of cheesecake with orange blossom honey and some cashew/pistachio baklava. As of September 2015, they don't have their credit/debit system up, so make sure you bring cash or check. And bring a good appetite, because you'll want to eat as much of this fantastic food as possible!"], ["Jane Y.", "Absolutely love this place. The owner is very personable and the food is fantastic! I usually get the chicken and have never been disappointed. Salad fresh, rice is always perfect and the sauce is just right. It is a small place so you might have to wait but they will get you in as quickly as they can. Can't wait for them to open up the back for more seating. It's small but one of my most favorite places to go."], ["Jennifer B.", "OMG!!!!! If I could give ten stars I would!  I am not very fond of restaurants in Columbia but this is hands down the best restaurant in Columbia!  The food is fresh and authentic!  I had the Schwarma which was absolutely delicious and my husband had the combination plate.  Nancy is an added bonus to this gem of a restaurant.  She makes you feel like you are eating in her home instead of a restaurant.  I highly recommend Elie's YOU WILL NOT BE DISAPPOINTED!!!  Thanks Nancy looking forward to coming back soon!"], ["Rick T.", "Tried several new dishes yesterday that had a lot of flavors going on the dishes. Swarma is the best dish I have had so far at 9.50 on the lunch menu which comes w basmati rice and salad. The owners daughter is a trip and really puts her heart into her father business and will gladly explain the dishes and how they come. She gladly gave me more rice instead of salad and got my friend with me who's wife is Lebanese to order a lot of homemade deserts to go. This is my third or fourth time here and I plan on returning if this food keeps on satisfying my hunger pains and taste buds."], ["Glenn M.", "Fantasti!  Fresh ingredients.  Fast service.  Nancy is amazing.  My new go to place!  A gem in Columbia!"], ["Natalie W.", "Really good Lebaneses food. I had the shwarma wrap with beef and lamb. Perfectly marinated and spiced with Lebanese pickles, turnips, tomatoes and onions with tahini sauce. yum!  Mint iced tea and a feisty, fun owner. I would recommend this place and revisit when in the area."], ["Lynn F.", "This is one of the strangest restaurant experiences I've had in a very long time. We were traveling with friends and the four of us needed to get lunch in Columbia. I chose the spot. When we arrived, we were surprised to find it's an old house with peeling paint and very little to denote that it's a restaurant. The sign looked unfinished, as did the interior, so I figured it must be a new restaurant and they hadn't worked out all the kinks yet. Wrong.The food was nothing special at all. I don't even remember what we had. Maybe the meatballs? There was a lamb dish involved but it was forgettable. The interior still looks like someone's home with small rooms and a residential bathroom. We asked if they were new, and were told they've been open over ten years. I guess others like it better than we did."], ["Shawn E.", "Food is good. Service is good. My only complaint is that you don't get much meat (I ordered the shawarma and lamb combo) but I suppose that means what I did get was good enough that I wanted more."], ["Mona D.", "Awesome food and great service!Be sure to ask for seating on their back patio! Nanci have us great service and great suggestions for food and wine to try. Both were excellent. We decided on the mixed appetizer which gave us the chance to try a lot of different things.  Everything was great so I'll be back."], ["Diana M.", "The food was delicious!  And the service was truly remarkable.  I felt in love with the lemonade they have.  Has rose water (which i love) and it is a very delicious drink.  I cant wait to continue coming here! I love this place!"], ["David B.", "Great food!  I love the shish taouk (chicken kabob).  The staff is very friendly and provide great service."], ["Emily E.", "After hearing great things I was excited to try this place but I ended up being disappointed.  The salad was sadly the best part.  For the entree I got the shawarma which was bland and hard to finish.  The bread seemed like very thin cheap pita bread you could buy at the store.  This might be acceptable if the entrees weren't so expensive!  Between $15-20!  For that money I enjoyed the food at arabesque much more.  The service was friendly but could not make up for the lack of flavor."], ["Zack W.", "OMG best medeterranean food I have ever had! Amazing service! Try the lamb chops and Sharma! The Turkish coffee with the pastry desert is beyond description"], ["Courtney S.", "We come here so often the owner's know us! By far the best Mediterranean food in Columbia! I always get the lamb skewers, but if this is you're first time and you're feeling adventurous, try the Tour of Lebanon. Everything is delicious, and the price is worth it because you're supporting a mom and pop restaurant!"], ["Nichole M.", "While visiting my mother-in-law who lives in Camden, my family and I were looking for something different. After checking out the reviews Hubby and I decided to give this place a try. With two kids (12 and 5) and a picky mother, Hubby and I found this place to beq hidden gem. We had the Tour de Lebanon which allowed us to sample some of the popular things on the menu. The favorites at the table were the Flafel balls, rice, ground sirlon, flat bread, and the hummus. Nancy (the owner's daughter) was amazing! She took great care of our table and the kids loved how hospitable she was considering the service was a bit slow (apparently two servers had called out). In the end all of us left very satisfied. Being from Atlanta, we'll miss the mom & pop vibe of this place.Mother said it was good but she wasn't a huge fan (mind you she's a tough critic to please). The kids fell in love with Nancy and her dessert while Hubby and I could definitely see us coming again...can you say date night?  So overall if you're in the Columbia area, tired of eating at chain restaurants and down to try something different, say off the beaten path...don't hesitate to give this spot a try."], ["Scor P.", "My wife told me I was taking her out to dinner and that it was going to be something different... but she didn't tell me what she wanted. I looked around on Yelp and found Elie's. We got there in the evening and had no wait for a table.My wife got the schwarma... and I had the shish taouk. Both were delicious. It was very similar to the food I've had over in Kuwait and Qatar. Minus the desert, it was just like being over there... but the English is much better.We met Nancy when she came out of the kitchen. She's proud of her restaurant and rightfully so. The food is delicious. My wife and I will be back again."], ["Karen S.", "This is about a week in the coming to write this review.  A (big) group of us went here to eat last week and the place was good.  First positive was that when my friend originally made the reservation, she made it for a Tuesday, thinking the restaurant was going to be open.  Hours had changed since then and Elie's was going to be closed on Tuesday, but they opened the restaurant just for our group.  Staff was friendly.  There was 20+ people in our party and food came out fast!"], ["Jason B.", "Great food.  They take great pride in their craft.  Get the Veggie Mezza if you are new to Lebanese.  Amazing flavors and as filling as a steak dinner.  Did I mention that the flavors will ruin you for ordinary American fare?"], ["Hollie T.", "This is the restaurant you visit if you want excellent lebanese food... but also if you want some of the BEST food in Columbia.  Their falafel is amazing.  Warning: If you eat their food you'll be spoiled for all other middle eastern restaurants.  I've been going there since a friend took me in 2005 and the dishes are still among my favorites.  Try their Tour of Lebanon or the Mixed Mezze if you want to try a little of many different types of food.  You must have the kebbeh!  Do not leave until you've tried it.  The shrimp is also quite good due to the way Elie seasons it.The mint tea if refreshing, but if you want some alcohol, Chateau Kefraya is sublime.For dessert, have the pistachio baklava and some Turkish coffee."], ["Kimi B.", "A friend recommended this restaurant to me about 6 months ago and WHY, WHY, WHY did I wait so long to follow her advice?!?!? Tucked away in an unsuspecting house, Elie's is one of Columbia's true gems. This statement says a lot since I'm a total food snob. The only hard core thing I have to back this up is that I did get my baking and pastry degree from the Culinary Institute of America in Hyde Park, NY, but I have lots and lots of eating experience. Anyhow, I went for lunch and had Friday's special. . .some sort of rice w/ lentils and caramelized onions. I got two falafel's on top and was truly in heaven. My friend got the same, but w/ a lamb kabob on top and she was also in heaven. My other friend got the rack of lamb and refused to share any with us. He was paying for the meal, so we let him off the hook. The friend that recommended Elie's to me said her favorite is the falafel and the baked Kibbeh and said the Wednesday special is also phenomenal. They were out of the shepherd's pie b/c the daughter of the father/daughter restaurant duo extraordinaire (Nansi) only makes it on Tuesday and says that it often runs out by Thursday, but it is supposed to be the best in SC so if you want it, go early in the week.Now, on to my area of expertise. . .pastries. We got two. The cream cheese tart was good, but the Lebanese version of the traditional Greek baklava was TO DIE FOR. Run, run, run right now and get this. I got two to go. . .one for my sister and one for me. My sister did not get hers. It is much less sweet and has a variety of nuts instead of just walnuts in it and I just can't sing enough praise for this pastry.Go. To. Elie's. Now."], ["Who W.", "The place is kind of out there, but inside it has some character. An old house converted to Lebanese restaurant. This is the kind of place I want to like, one of the few 'not a chain' places to eat in the wasteland of strip malls that is Irmo/St. Andrews. The food, however, only got to the level of ok. Humus was a bit running, falafel seemed dense and 'not that great', lamb had a quite strong flavor to it. Nothing was bad, but nothing was great either."], ["Farha K.", "While out and about in Columbia, SC I did a quick search for middle eastern food and stumbled upon Elie's on my yelp app... figured why not! The decor seemed a little dark and dated but there were quite a few patrons scattered about deep in conversation..which to me is usually a good sign. if people like to come to a place for good conversation, the food is usually good enough to make you wanna stick around. We ordered the hummus with steak bits on top, chicken kabob roll and steak roll. The hummus was actually pretty darn fantastic.. and I'm not particularly fond of hummus. The steak was cooked tender, the juices allowed to pour over the hummus on top and garnished with just a few sprinkles of fresh mint and parsley. Served with toasted wedges of pita it was a perfect start to the meal. The sandwiches however left a gap in the menu. My pita bread had already fallen apart by the time my sandwich came to the table and the steak kabobs inside had spilled out, there was way too much yogurt sauce on the kababs that it overpowered any flavor the meat may have had. Although the vegetables were fresh, they were cut and place haphazardly in the sandwich where i ended up having to eat the kababs and veggies like I would a steak salad. the bread lay in a soupy mess at the bottom of the plate. The chicken kababs were actually cooked pretty well, they were tender and juicy but again ..too much sauce and the bread was soaked through. All in all for the price tag it was a pretty decent find but they could try changing up things just a little."], ["Lyndsay K.", "Was working in Columbia today and upon consulting my handy yelp app I saw Elie's and knew immediately where I'd be eating once I finished work.Service at lunch was spectacular. Nothing I love more than someone talking about the food so passionately that I can taste it. When she came back to take my order all I could say was \"I want to just move in here and eat everything.\" I wasn't lying. I ordered the Mezza Sampler - was by far the best Lebanese food I've ever had in my life...and I've had a lot. The falafel was AMAZING. Kibbeh and tabbouleh equally great.The only downside is that living in Atlanta makes this an inconvenient location for me.  Can't ya'll open up a restaurant closer to me?!"], ["Johnathon H.", "I had a great experience here.  This place had an incredibly nice staff and way to much food for me to finish eating.  I'm not a huge fan of Lebanese food but I took someone for their birthday.  The Fried Hummus Appetizer should literally be a meal in itself.  Its really good and its a ton of food.  Also got a cake for the birthday girl and it was amazing as well.  They don't make it but they have a deal with a cake shop and it honestly pays off.  I intend to go back for the Hookah at some point myself.  Try it out, its worth it."], ["Hana M.", "Too soon to give it five stars ~ but looks like a very promising middle eastern restaurant with daily lunch specials. The atmosphere is nice and sunny, it's in a house and very open with a large patio to eat on. There is a long list of fresh lebanese drinks so skip the soda! I had a very unusually tasty mint/rose/lime/orange (something else I'm forgetting) lemonade. I had vegetarian meze plate and my favorite part was the falafels they were well seasoned  and well beyond the typical bland friend chick pea. I also liked their hummus a lot (I prefered it to the babaganoush) it was seasoned so tastfully (I got a stong taste of tahini, cumin ?, and sumac)  ~ again well beyond what hummus usually is (bland mashed chick peas)."], ["Swetha G.", "Don't walk, jog, or run to this place, jump in your car and step on the gas. Seriously! I don't know where to start with Elie's, you will be so excited after you have a meal there, before you even leave, you will already be planning your second trip, it IS THAAAAT good! First off, SUPER accommodating. Our group was close to 25 and they basically reserved about 70% of their space for us! Not only that, they even split checks! We had two servers regularly checking in on us and keeping up with our fast and crazy pace. Almost everyone in our party ordered an appetizer (some even two!), a drink, an entree, and dessert. Some people were getting multiple drinks. I don't know how they did it, but they didn't miss a beat, it was impressive! The atmosphere is simple and small. The whole place is pretty tiny with not a lot of decor, but after eating their food, you can tell where the real investment in Elie's is. So on to the most important part - the food! Oh my gosh, there are just too few places in Columbia that give you that kick and that feeling of consistent foodgasms, but Elie's will leave you MORE than satisfied but wanting more at the same time, if that's possible. On just my side of the table, amongst 5 very hungry people, we probably sampled close to 40% of the menu in just our first setting. Everything, I mean, EVERYTHING, was insanely delicious! We couldn't stop throwing food in our mouth, like vultures, like crazy people who hadn't eaten in years, we were on a food gorging marathon, it was absolutely ridiculous. I loved all the appetizers I tried, but the spinach and feta pie was a home-run. I ordered the eggplant pita for my entree, and it was soo excellently seasoned and cooked, though at that point, I had inhaled four different appetizers and was completely stuffed, I couldn't control myself and still finished my meal! We were on a roll and went ahead and got all three desserts on the menu and were lucky enough to sample their Lebanese baklava (it IS better than Greek baklava imo!), their strawberry cake (YUM, YUM!), and even their dark chocolate cake (oooh lala!). I wish I had found out the name of the cook, because that man or woman back there, really knew what they were doing, everything was sooo freakin absolutely amazing. I will absolutely without a doubt go back. Oh and people in our group who had never had Lebanese or Middle Eastern food and came out loved everything they ordered as well. The food pleased everyone!"], ["Eva F.", "Excellent food!"], ["M D.", "There needs to be another star added to this.  This place is Columbia's hidden treasure.  The food is so fresh and so flavorful!  Dont even get me started on the deserts...  They are beyond amazing!  A fair warning about the coffee though... you wont sleep for a week once you drink it.Service is superb and the quality of the food is the best.  I have spent 5 times as much on some restaurants in Columbia, but only for a quarter of the amount of satisfaction I get from here."], ["Brandon F.", "Authentic food great lunch prices and portion sizes. Always a good favorite dish is the Shish Taouk! Try it!!!"], ["Rebekah P.", "Delicious creative fare with excellent service. Heads and Tails above the apathetic renderings of Al-amir and the Mediterranean Cafe. I actually like the aforementioned restaurants but Elie's puts them in the shade. I wish the location was more in the mainstream so it would get more recognition. If you like food that is adventurousand not afraid to be bold, give Elie's a chance. With a preponderance of Greek restaurants is the area, this place outshines them all in their Mediterranean cuisine. I suggest they they give restaurant.com or groupon a chance to spread the word."]], "Green Olive Restaurant": [["Jay M.", "Great wraps and a very good salad for just 7.95. The side of hot sauce was some of the best I've had."], ["Matt H.", "This is one of those places that has potential, but is not living up to it...yet. The food was very nice! I had a mediterranean chicken salad. Everything was crisp, fresh, and tasty. However, there are a number of things that make this place sub par:The servers are nice, sweet, but seem to lack some basic service training, and it showed in a few ways, in addition to coming across insecure. There were also not enough people working here- either that, or the servers are not active enough. The food also took quite a long time to come out considering there were only 3 or so seated tables.The decor is ok, could be more interesting and warm. Architecturally, there is a lot of wasted space (huge walk way between table areas). They could make better use of this in design.On my salad, I asked for no cheese, and an added side of tahini. Most places I go to (and I eat a lot of Mediterranean) do not charge for a small side of tahini. My bill listed 1.50 for it...now, I don't mind a small charge, but this is quite high for a few ounces, especially since I had feta removed from my salad which saved them money.So, overall- the food is worthy...the wait, the service, overall atmosphere, and billing choices, basically everything else is all questionable and sub par. I say this because I like small businesses and I want them to succeed. Make some changes, and you can be a great!"], ["Will C.", "This is where the old Mio's was - they kept the \"nice\" inside and added some generic outdoor tables. It was nice yesterday so we sat outside for lunch.The waitresses are nice, friendly and helpful. We ordered quickly and got our food quickly. I got the Shepard's salad and the vegetable curry. The Shepard's salad is pretty much just cut up cucumber, tomato and onion which is great, but it was poorly if at all seasoned and the puddle at the bottom wasn't oil or vinegar any more than it was juice from the tomatoes. The curry was probably the worst I have ever had out to eat - it consisted of zucchini, squash which were fine in a yellowish, tasteless \"curry\" broth with absolutely no spice other than the pretty dusting of seasoning across that and the rice. It's this exact kind of meal that gives vegetarian meals a bad rep! Also no salt or pepper on the table which could be because we were outside.Anyway, I was left disappointed wishing I had ordered a different dish. The other dish ordered by our table was the eggplant and it looked spectacular while receiving rave reviews. At this point I surmised I was just unlucky with my ordering choice and sitting at a pepperless table. I'm sure the Gyro, eggplant, etc are much better - what was I thinking ordering curry at a Greek-centric Mediterranean place?The bill came and it was reasonable for a lunch for two at close to $18. I had received good enough service and I had a $20 and a $5 dollar bill which means if I left that I'd be giving almost a 40% tip. Now, having worked in the service industry for a longish time, I am often empathetic of service industry workers and would just leave the $25 instead of asking for change and awkwardly taking a couple dollars back.I put $25 in the bill folder and didn't expect it back. Now, knowing people usually don't go leaving 40% tips the waitress brought it back with change in it - a $5 and a $1. THIS IRRITATED ME - I wanted to leave them a really nice tip and I did anyway but in this situation you ALWAYS bring back 6 $1's. Always. I know this is just a small detail, but it's something that really rubbed me the wrong way - it's either completely thoughtless or thoughtful with the wrong intention.So 2 stars while ordering the vegetarian curry which should be wiped off the menu, if not this entire earth. I might update my review if I venture back here to try something else."], ["Rick T.", "As I arrived the staff had just finished setting up for lunch today service. I quickly ordered the lamb curry lunch special at once on the menu instead of beef or chicken and red bean lentil soup instead of salad. It may have been a dollar or two more dollars but I like lamb dishes. The soup had a golden color with small beans shredded up in the bowl with small onions. It was the highlight of the meal, it would be great to try in the middle of winter or on a cold rainy day. Now moving onto the lamb curry, everything was cooked perfect I felt it may have needed something more to make it pop. But anyways I enjoyed the meal and the service. This place is open 7 days a week from 11am to 10 pm except on Sunday's which is 9pm one hour earlier. They are located right beside Wich Wich and right behind the State House. Street Parking is available if you get there early enough before the lunch rush."], ["Suman K.", "Good Food.. every time :)"], ["Milini M.", "Tucked away near the State House, this restaurant is like the cute guy/pretty girl that sneaks up on you.  You know what I mean -- the person you didn't realize was cute enough to date until they were right in your face?  That is what Green Olive is like.  With its simple exterior, the Green Olive is another addition to Columbia's sea of Mediterranean restaurants. Walking in, you are greeted with exotic music and authentic art that hovers over tables and booths that accompanies a flat screen t.v.   The atmosphere has a laid - back vibe that support a modern-traditional décor. The food was... a - okay...  It wasn't bad food.  But it wasn't a spiritual experience either.  The food served the purpose of being a nice backdrop to nice a restaurant.  I ordered the spicy vegetable curry.  Now let me tell you --- I LOVE spicy food!  The hotter the better!  If my nose is not running and my eyes aren't tearing up after eating spicy food, then the food fails my litmus test.  A piece of my soul leaves me when the spice doesn't deliver.  In this case, the spicy vegetable curry:  DID. NOT. DELIVER.  There was no heat.  No runny nose.  No teary eyes.  A piece of my soul is still curled up in a ball pondering its existence   But other than that mishap, the food was decent.    The falafels are great (read my previous post on my falafel fetish), and the hummus was delicious. Also, as person who \"eats with her eyes,\" I really appreciated the presentation of the food! I am deep believer that the food can be a - okay if the service is superior.  Excellent service can be penance for mediocre food. The service was excellent!  The young lady who helped our table was warm and attentive to our restaurant needs. And any questions I had about the menu was promptly answered.  Also, at the end of the meal, the beautiful young lady asked for feedback.  This is important because this cues me to believe that the restaurant is really interested in improving the experience it provides.  This is how good restaurants become great!  By listening to the customer, restaurants can deliver better quality in its food and atmosphere. The prices were relatively reasonable.  As I have stated in my previous posts:  You don't pay for the food.  You pay for the experience. And the overall experience made me feel comfortable shelling out my money.  I did not feel like I was being robbed or that I was overpaying. All in all, I would recommend this new restaurant!  I think as the Green Olive evolves it will find its place in the Columbian Mediterranean restaurant scene.  I give this restaurant a B+."], ["Vida J.", "Another Mediterranean offering in Columbia.  The spicy feta appetizer was pleasantly surprising. The tabbouleh salad was a little dry and could use a little more citrus. The gyro wrap was well seasoned. I also ordered a side of olives and the portions were plentiful. Parking not the best during lunch."], ["Angela S.", "I stopped in at this place at an awkward time, around 3pm on a Thursday, but my server, Christopher, was still very attentive and pleasant. The chicken gyro wrap was delicious. Not too garlicy and the chicken was tender and well seasoned. My side shepherd's salad (a pleasant suprise that I could choose any of the salad options as my side) was also fresh and well seasoned. Tasted just like what I was used to eating when I lived in Turkey. Also, props on the super clean bathroom! That's always a good sign for a restaurant!"], ["Emily E.", "I liked this restaurant the first time when it was called Al Amir.  Menu is almost identical, which made me sad.  Was hoping for something unique.  Service was on the slow side even though it wasn't too crowded for lunch.  Lamb shawarma had a very sweet taste, almost like too much cinnamon or nutmeg added.  Roasted veggies were good, as was the Shepherd's salad."], ["Tom K.", "Stopped by during evening dog walk- the waitresses were very welcoming for both my dog and I bringing us both water (his in a dog appropriate dish)! Ordered the Gyro platter and chose the Feta salad (small salad comes with dinner). The salad was small in name only! Generous portion of fresh lettuce, green peppers, olives, tomatoes and feta with a tasty dressing.The Gyro platter had real shaved meat- crispy edges with moist flavorful meat- the real deal instead of the typical pre-formed gyro meat one often gets served. The meat was accompanied by grilled peppers, onions and mushrooms with both on a bed of rice. All in all, a delicious, fresh, authentic and well prepared meal!"], ["Adam B. J.", "I ate at Green Olive for the first time at lunch today.  I was feeling simple, so I got a Gyro.  It was one of the best I've had in town in some time.  While dining I ran into a work colleague who is from Turkey (I say this becuase he's told me there was no good Turkish food in town).  He thinks this place is great and told me to try the Shish Kabob.  I'm will definitely be back to try it and other dinner options.  I've read some poor reviews, but I think they've worked some kinks out.  My drink never got close to being empty and everything was quick.  Our server was great, and she had help running food and keeping drinks full.  Can't wait to go back."], ["Soha E.", "The food is good the service is slaw and bad We was big group five women with 8 kids the waiter was very slaw and confused we tried to help him but he chooses not, we spent almost un hour waiting for the food then tow have there salads the others wait and the kids asked for hot sous , and they added 1,25  for each kid"], ["Rebecca A.", "I came right when they opened and haven't had the chance to come back to see how things have changed. This location is directly next to Which Wich and apparently used to be a Miyo's. The decor is a carbon copy of the Epicurean higher up on Main. The menu is also very similar to Al Amir/Sahara. One reviewer is confused, though, and seems to think this place used to be Al Amir, which is not the case. Sahara is the one that used to be Al Amir. Anyway, my friend and I ordered our respective foods and then had to wait over 45 minutes for our food, which were both wraps. Our total lunch experience was an hour and 20 minutes long, which was not great for us as we had to run to class down the street to make it back in time. The food wasn't bad, but this place is honestly nothing special with two more exactly the same restaurants on the same street."], ["Jason M.", "My wife and I along with a group of friends ate here on a Sunday evening recently. The place was almost deserted except for another group. The menu looks like a near duplicate of Al-Amir's. It took quite awhile (10-15 mins) to get our drinks. One member of our party did not receive her drink when they brought out everyone else's. It took another 10 mins for her to finally receive it.We started with appetizers that we all shared. The hummus and bread was ok and the  little fried feta pastries were actually really delicious.  The entrees came out in a reasonable amount of time. I had the shwarma and my wife had the curry. Both of our meals were ok, not terrible but not the best. Once the meal was over it took quite awhile to get the bills settled because the waitress disappeared.One other note: the air conditioning system was extremely loud. When it cycled on it was very hard to heard one another.Overall if you want Mediterranean food then I would recommend Al-Amir.  If they are full then The Green Olive is a decent substitution."], ["Chris S.", "If I could give no stars, I would -- because the overall experience was just that awful. We stopped in for lunch after hearing they had just opened. We walked in and the dining area was extremely humid and hot. I ordered an appetizer and we all placed our order for the main course as well. We waited quite a while and when our food did arrive, it arrived all at once. My side salad, appetizer and main course. Who does that? I was unhappy and said as much to the gentleman that brought out our food and all he said was, \"oh, sorry\" as he walked away.My salad was a total joke consisting of iceberg lettuce, one tomato slice and two olives. The appetizer was a pleasant surprise and was good. I ordered the \"hot\" curry chicken and it was not at all hot, but extremely mild and the chicken in the dish was rubbery and all dark meat. I understand people make mistakes and that the opening days of a new restaurant are challenging. But \"oh, sorry\" and walking away shows me they could not have cared less. They earned this rather unpleasant review all on their own."], ["Christina B.", "I went into this restaurant the other day and was pleasantly surprised.  The chicken shawarma was delicious and the waiter recommended me to get a cup of red lentil soup as a side--best decision I ever made!  Overall, the food was very good and the employees were very nice and accommodating.  I enjoyed the atmosphere and can't wait to visit again soon!"], ["Todd F.", "They changed the gyro ... Now officially the worst gyro I've had Columbia. How sad. This change is a bad sign of a kitchen cutting corners.The owners (see below) say the original gyro will back soon. Good news!"], ["Jose G.", "The service is excellent, the hostess are nice, they make you feel home!! Food I delicious!!"], ["Jarlath O.", "Five of us lunched here today and everyone thought it was great. Big servings, salads very fresh and tasty, mains hot and tasty, prices favorable, service prompt and friendly, clean bathrooms, nice restaurant ambiance, spacious and comfortable. What's not to like. Will definitely return."], ["Khadija E.", "The service was good but my lamb kabab tasted/smelled raw. The booth seating was too high and made me very uncomfortable. Also, I don't know what it is with the Mediterranean restaurants in Columbia - at least the Epicurean, Sahara, Arabesque, and Green Olive have almost identical menus, even the way they arrange the plates and the plates themselves. There is no difference in the eating at any of these places. Enhhh."], ["Dan H.", "We stopped by in Columbia so our 1 year old could run around and I could visit USC. The service was on the OK to slow side and the food just ok."], ["Kim V.", "The spicy feta dip was awesome! The small was big enough for two people to share. I also got the Caesar salad and it was also tasty."], ["Cihan A.", "One of the best value restaurants in town. First of all it is very affordable. I ordered the gyro plate which was delicious. My server Mary provided an awesome service. The food came out fast. The restaurant is clean and fresh. They take pride in their service and their food. I would go back again. Furthermore, I strongly recommend it to everyone. I noticed that they fixed the height of their booth due to some feedback. That shows that the owner is open to contsructive feedback. I like that."], ["Ali H.", "I have eaten here twice.  The first time I ordered their lunch chicken curry to go.  It came with a side of jasmine rice and a salad, so very good value.  The curry was nice and spicy just the way I like it!  Since I had a great first experience, I met a friend for lunch there a few weeks later.  Granted, it was 2:00 and they were in the middle of a shift change, but very poor service overall.  There were only two other tables dining in at that hour.  After waiting for fifteen minutes for someone to take our drink order, my friend finally walked over to the hostess stand and asked one of the three employees standing there to help us.  I got the beef kofte wrap and lentil soup, and both were very good.  We had no problems after that.  So, I will probably go back, but maybe after they have had some time to work out the new restaurant kinks (or maybe I will stick with a to-go order)."], ["Galo N.", "Food is delicious; prices are very reasonable; staff is efficient and friendly. I will definitely be back. I highly recommend!"], ["Sara M.", "Good restaurant.  I had a play of baba ganoush with lamb and bread and tabbouleh.  I like the baba ganoush better at Al Amir, but I might like the bread better at Green Olive.  Space still reminds you of Miyo's.  Service was very pleasant; waiter was attentive and did a good job.  Look forward to more meals at Green Olive."], ["Kelly N.", "Friendly and prompt service; immaculately clean and nicely decorated; menu is well priced.  But food left quite a lot to be desired.  Caesar salad was entirely overdressed, and the meat on the gyro and beef pita sandwiches was very overcooked and sandwiches terribly salty.  This place is new and I suspect with a little more mileage, could be terrific.  I'd give it another try in a few months.  Just not yet."], ["Cole H.", "I ate here during dinner time and it was very relaxed. Service was great and I had a cute waitress who recommended the chicken shawarma with pyaz salad so that's what I got. Though the portion size was smaller than expected, it was fair priced and the quality was phenomenal. I ordered the baklava for desert and it was some of the best baklava I've ever tasted and made for a great treat. I have never been a fan of Mediterranean food but this place has put it on my radar and I will be returning."], ["Chuck W.", "Great gyro. Friendly service. I really liked this place. My friend had beef tips and said they were very good also. Only drawback is they serve no alcohol and would have enjoyed a glass of wine with my dinner."], ["Kevin A.", "My favorite Mediterranean restaurant in town so far. I order Chicken shawarma and side of green olive salad and came out very tasty. Great looking decoration all over the walls! The prices, quality, and atmosphere is excellent.  Definitely will be back!"]], "Al-Amir On Main": [["Buds Work Boots B.", "We are travelling from Chicago to South Carolina and we rolled into this town called Columbia, SC,on 9/29/15 at 3:51pm we were looking for a good halal restaurant, turn out to be the only one there besides this market, so we went to this restaurant and it's in commercial area, its on the corner of the complex, so, we entered , we got seated right away, it is a huge restaurant but it could use a little better  decor, it didn't really look like a Middle Eastern restaurant , we ordered, Sultan Combo, cost 16.95 a little expensive , I think it should be  12.95  because you only had about  5 pieces of chicken & 5 pieces  of the Lamb  with a little bit of rice  and vegetables,, so my friend Got the lamb shawarma, cost 10.95 with rice ,the food was excellent, the chicken and the lamb on both plates was moist with perfection. I'm glad this restaurant has a really good cook because we enjoyed the food but for me since, I don't like a lot of oil in the rice it was a little bit oily for me ,but other than that, its a great meal and we also had ice cream afterwards I had the something turtles,it's with two different types of chocolate chips large size 3.75, well worth it  and my friend had a pistachio  ice cream which was also delicious I recommend this restaurant I met the owner he's from Syria, I just thought it was a little funny, me being this big white Texan guy, I told him I speak Arabic so, I started talking to him in Arabic at first, he returned in Arabic and then he continued in English, everything that I said in Arabic, he replied  back in English, I think he was brushing up on his English, or he couldn get over the fact that this white boy from Texas was talking to him in the Arabic he might have felt he was in the twilight zone"]]}