{"Takosushi": [["Brad R.", "Unforgettable Roll for me and Crazy Susan for Alli. The wine is good and so are the tempura asparagus. They serve sushi and Mexican and both are great. Place is packed and food is awesome."], ["Cindy D.", "Another Saturday lunch on girls day out was exceptional !!!  This is our go to place.  The sushi is out of this world good.  Best ginger salad ever as well !!!"], ["Gina G.", "This place as answered my dreams sushi and mexican infused my two favorite foods to eat yes totally what I'm talking about my place to eat when I'm in town"], ["Brandy B.", "Fun experience today!I'd been holding back on this review bcuz I wanted to give them an \"official\" chance.The concept/idea is kinda cool/weird - the menu looks awesome... but our first experience via 256togo... Ugh!!!I don't remember what we ordered (there were 3 of us and we all hated it)!!!!!  Butttttt, that was over a year ago and all these tempura asparagus pics that keep popping up called me in!)We dined in around 4:45/5... waited to beat the crowds and not be elbow to elbow with other patrons.We were overwhelmed by the menu... so many options, so little stomach.We opted to split the green chili fries (looked like vomit or dog food... but we didn't let that deter us!), and tempura asparagus to start (both were good).We split the biggest loser and firecracker shrimp.  The biggest loser was okay... kinda had a raw flour taste (too much going on and maybe wasn't \"cooked\" long enough), the firecracker shrimp were delicious!!!!Service was excellent and we were out before the crowd!We plan to return very soon!"], ["Sam C.", "Have been coming here for some time now.  The decor is bold with red walls and southwest art displayed around the restaurant.  I come here primarily for the sushi.  The sashimi is of a thicker cut and not sliced thin as can be found in many local Sushi restaurants.  The Sushi is always fresh and the rolls are great.  I have been working my way through the list of rolls (2 pages) and so far the Tomahawk Roll is my favorite.  If you are a sushi fan, your best option is to order the Bento Box.  You get a Miso Soup, Cucumber Salad, Chef's choice of both Sashimi and Sushi with a roll of your choice.  You need an appetite to finish it off; especially if you order one of their appetizers....  our favorite is the Tempura Asparagus.My Bride is not a huge Sushi fan but she does enjoy the Pork Potstickers and Veggie Eggrolls.Parking is a bit of a challenge.  There is lot behind the restaurant but it fills up quick.  Street parking is available.  If you haven't been yet, it is worth the trip downtown."], ["Lauren O.", "Love this concept. The best of two worlds... Latin & Asian cuisine (not fusion - just 2 different menus). The happy hour specials are amazing! 4-6:30 on weekdays. $2 tacos, $5 nachos, $3 tempura asparagus, $5 junior sashimi plate & lots of drink specials. My favorite things to order are:Tempura asparagus (one of the best apps in town)Crazy caprese salad (a perfect summer lunch)Chorizo nachos or chicken & chorizo tacosQueso (with beans) dipAnd most of their rolls are fantastic It's a small place, so it can be hard to get in but it's totally worth the wait, just get a drink at the bar (they do take reservations for parties of 5 or more)."], ["Joshua F.", "Amazing restaurant! Great food! My girlfriend loves sushi and I love Mexican so this is win win for us. The portions are worth the prices, the service was really good as well."], ["Sherry C.", "This is a great restaurant.  I'm not the biggest Sushi fan around, but I still love this restaurant and I can definitely find items to order. The service is always excellent. I love the Miso Soup and the Cucumber salad. Both of those items are a \"must have\" when I come here. I also LOVE the pot stickers!  They're always good. I also get the Ebi. I'm a big fan of shrimp. Great atmosphere. Great food. Great drinks. Great Prices. And Great Service. I definitely recommend this place!"], ["Austin M.", "I can honestly say this is my favorite restaurant I've been to in Columbia. The whole idea of mixing southwest food with sushi seemed a bit odd at first but it did NOT let me down. There's a great selection of beer, the sushi was amazing to me even though I'm not a sushi connoisseur but I thoroughly enjoy it. I didn't get a chance to try the tacos but the green chili queso was delicious. The restaurant is a little bit on the smaller side and you may need to make reservations but I'd say definitely give this place a shot, you'll love it!"], ["RJ A.", "One of the only places I've found in Columbia that serve Ahi Poke.  I went in for a quick dinner ordered a bowl of miso soup which there was nothing special about, but the Poke...was really great.  They got some fresh yellow tail tuna in as I sat down and they asked if I would like that for my Poke which I thought was really cool to offer me the freshest fish.  The marinade was a perfect balance and didn't over power the fish.  I surprisingly ate all of the small side beet salad which was surprisingly really good.  It came with a scoop of steamed white rice which was just the right amount for the meal.  I will regularly come in for some Poke from here on out."], ["Will C.", "Meh. Don't let the unique name fool you, the food is chain restaurant quality. The southwest part of the menu has me thinking \"frozen from sysco\" and the sushi is pretty good at best. Happy hour has really good specials which makes it worth the trip for me once in a while - good food and drink deals!"], ["William B.", "I really like this place.  It's been through some ups and downs, but overall the food is good, and I've always had great service.  Parking is okay, I recommend grabbing a metered spot after 5.  The asparagus is awesome, and the fish tacos are great too.  It's a bit pricey, but at happy hour it's insanely cheap."], ["Stacie M.", "Went here for the first time since the end of 2014. My first time I got the fish tacos they were spectacular, instantly fell in love. I came this time and got oysters (one for $2) and they were the best part of the meal, in all honesty. We got the firecracker roll and it was good for the price but wasn't anything I'd particularly return for. And the fish tacos this time gets a thumbs downs. It was really bland and I didn't get that zingy taste as I usually do. We ordered a Bloody Mary and I don't know if it was the mix they used or something but we had them take it back. Too spicy (and I like spicy so that's telling you something)I probably will only go back if I plan on just ordering sushi and oysters. But those tacos are a no go."], ["Michaela B.", "I love that hey have poke, and they do a good job with it too! Also, my steak tacos were cooked just right, seasoned well, and tender. I wish the joint had a little more ambiance, but service was good. Good beer list... We just had a great time."], ["Miranda G.", "The food at Takosushi was all pretty good. The sashimi and nigiri was tender and flavorful. The miso soup was a little weak, but still tasted good. We both ordered the Bento Box and got more food than we could eat! The rolls are huge, and the two we tried were both very good. The menu is pretty confusing, as there are some inaccuracies, but our server was able to clear it up for us. Overall, the food was good and we would definitely return."], ["Furman L.", "I've had my one and only experience at Takosushi. Background - I have spent significant time in Atlanta and New York, and know a good sushi from a bad one. After waiting 45 minutes after my reservation, my party of 3 was seated. Note that there is really no place to wait here because the restaurant is so tiny, so you kind of just stand around and look at everyone trying to eat their dinner. Sushi was terrible. I literally could not finish my sushi because I was starting to get that gut feeling that I would get sick if I continued to eat this food. Location is great, right across from the Statehouse. Parking is free if you can find a spot in their parking lot with maybe 15 spaces. The experience was rushed and cramped, especially for the price. There is a lot of room for improvement."], ["Stephen R.", "Ok finally ate here, tried a few times but they had standing room only and I do not wait for food. I ate here during lunch when most roads were closed for a run. I started with the largest jalapeño poppers known to man. They were fantastic....not nuclear but filling and the wasabi sauce was perfect. They were covered in a homemade like crust and filled with cheese.Then I made room for scallop tacos. They were fried (crispy on outside juicy inside) and all the ingredients were fresh (guacamole, tomato, lettuce). The beans were plain, and the salsa was meh but it was a filling lunch for sure!The waiter was all over it, refilled my drink, made great recommendations and got me a to go cup for my tea."], ["Arlene D.", "I don't get it and the sushi was horrible. Rice was hard flavors not good. We started with calamari for an appetizer and they were chips. Calamari should not be hard like chips. Rainbow roll, spider roll were dry and unflavorful. The waitress was very nice."], ["Michael L.", "Great food, service and atmosphere. Gets a little loud and hectic but a overall fun and exciting atmosphere. The Fish Takos are the best and the sushi is amazing."], ["Eric H.", "I went into Tako Sushi not realizing that \"Tako\" in context of their title isn't meant to be \"Octopus\" in Japanese (plenty of places do this). Rather, after my experience I'm pretty sure it's a deliberate and confusing play on words where \"Tako\" is literally replacing \"Taco\" with a k. Let me explain. The concept this place has going for itself is Mexican-Japanese fusion. The interior reminds me of a diner (with a sushi bar) in Albuquerque--southwestern art/pottery everywhere. That's totally cool/hipster/modern and I'd be willing to buy in. The problem is the majority of their menu items don't fully commit to any combination of Mexican and Japanese cuisine and the few that do are pretty weak offerings that feel/taste like neither. Smoked salmon quesadilla/southwest tuna tartare... really though? Honestly all of that would have been okay if their distinct menu items (I had a few rolls) were good. Unfortunately, they weren't anything spectacular. Bottom line, if you're looking for nigiri/sashimi/Japanese food in general, this is not the place. Their burgers or their tacos might be alright but I wouldn't have high expectations based on my experience with the sushi. It's beyond me why this place doesn't try and sell itself more as a fusion place because I wouldn't be opposed to having a beer or two with some chips and guac here. Don't get it twisted though, go elsewhere for your sushi fix."], ["Robert V.", "Interesting mix of Far East meets southwest. This was just my first visit, so I can't comment too much on the menu, other than my wife had some delicious carne asada that made me jealous!I had the grilled tuna, which was good, but I didn't like the pairing with beans...odd aftertaste. They're good with substitutions, so be creative and ask away! I had extra veggies, which were great.The decor and atmosphere were well done, and the hot green tea excellent."], ["Toni S.", "The service was good. The waiter was friendly. The hostess was wearing a really short thin romper and whenever she bent over to do something her butt came out. The food was good but I was just confused. It wasn't even a fusion. It was two separate menus. One for sushi and one for Tex Mex. the decor was Southwestern and you wouldn't even realize they served sushi until you saw the sushi counter. Other than that it was just ok."], ["YumYum Y.", "Boyfriend and I were hungry and we were in the area. So we looked this place up. The place is pretty small. It had parking behind the building. Wouldn't be great for large parties or kids. Its pretty quiet when we came. The waitstaff was friendly. My boyfriend and I both ordered sushi. I can't remember what he ordered but I had this veggie sushi that was defried on the outside. It had carrots and i believe edamame. I can't recall what else was in there but it was so good! I haven't had such a unique sushi in forever! I don't know what it is but the outside of the sushi (the fried part) was such an amazing texture! It was so yummy! We both enjoyed our sushi. We both ordered a meal, he ordered a burger. I can't recall the name. But he said it was alright. While I ordered the stir fry mix. veggies with chicken. It was horrible. The chicken was over cooked and the dish came out to look like a soup. There was nothing \"stir-fried\" about it. The veggies had so much variety and it was minced. I was confused. I didn't ordered a soup.. I ordered just a plain stir-fried chicken and veggies. How do you make a soup out of that? The broth defiantly had soy-sauce in it.. but strangely enough there wasn't any seasoning. It was very bland. The only thing I enjoyed about my dish was the tiny rice they gave me. So, sushi was fantastic. Entree was not so great.If I lived around the area I would get only sushi to-go."], ["Mike M.", "Why does this place not have 5 Stars?! It's a unique experience but the sushi is phenomenal and the tex mex is equally just as good.  As a lover of both, this is my version of heaven on earth.  The cucumber roll is a surprise.  I highly recommend it.  And ask for additional sauce for it.  My friends and I end up dipping our other rolls into it.  It's a little cramped in there but they do a good job of making sure patrons are not right on top of each other."], ["David W.", "First visit 05/03/2014. I'm pretty tough to please when it comes to food. I like good stuff and Takosushi delivered. I asked for sushi not listed on the menu and the chef was pleased to deliver (masago with quail-egg in a cucumber)!  My wife had the portabella mushroom quesadilla (Portadilla) with Goat Cheese and it was fantastically divine!The waitress (pretty Asian girl.. forgot name... too much hot sake ;)  was delightful and efficient. The atmosphere was a-buzz with much merriment by the full house of diners. Great time, we will return!Have been back a few times and the place is still hoppin and has great sushi and service."], ["Monica P.", "This place must have had a menu revamp.. I gave it another try over a year after the first time and was very pleasantly surprised! I had an awesome craft beer and a very tasty sushi roll (Greenville roll). That visit prompted me to visit several times since. Great service each time with a relaxed vibe. Check it out again if you haven't been recently!"], ["Scott P.", "We had stir fry and fish tacos with homemade guacamole to start. Outstanding. Great atmosphere but even an old guy like me thinks the music is too old and 'classic radio rock' based"], ["Zoe D.", "This was probably a 2 1/2 star experience, bordering on 3 star.  I generally don't consider any place that has less than 4 stars and at least 100 reviews.  I had ruled Takosushi out for lunch but it got rave reviews from 3 different people at the hotel I was staying at so we decided to give it a try.  First off, I should say that the service (Kaetlyn) was good.  She was attentive, friendly, offered suggestions.  That being said, the food was okay.  The nachos were plentiful but truly nothing special.  The burger was good, served with specialty mayo, flavored ketchup and a side of guac as requested, but still didn't stand out as anything special.  Too many exceptional places to try...I'm going back to my 4star-100 review minimum standard and chalk this one up as a learning opportunity."], ["Doug F.", "Came here for business and a local colleague suggested this place for dinner. Had a few apps - very yummy:1) Fried Calamari - crispy and not oily at all. Dipping sauce was yummy2) Fried asparagus - good - tasted great but is a little hard to eat - 3) Cheese fries with sausage - OMG - it's the devils work. Then ordered a small salad (to counter act the fried food) with a great dressing. Also ordered (okay, we all shared the apps, I know what you're thinking) the Poke (they pronounced it wrong but) and it was as good as any I have had. We lived in Hawaii for a year (yes, hate me now) and ate poke all over the place. This was as good as any I had there. The beer was good - nice selection and happy hour drafts were less expensive. The only reason for the 1 star deduction is that the prices were a little high. Friendly server - had an honest opinion when asked about 1 dish. I always appreciate when someone is honest enough to say that something isn't her favorite. All in all a very good meal. Left stuffed."], ["Adam B. J.", "This place is great as my wife loves Mexican and u love sushi.  We both agree that the sushi is better than the Latin fair, but neither are bad.  Their sushi is amazing!  Lots of off the wall rolls, all if which are divine!  The apps are great too!  TUNA POKE!  Civiche!  Yummy!!!"], ["Maranda K.", "Nothing is perfect! Ever!  But The Crazy Roll at this place is almost like having to have crack right now or death will soon ensue.  Our server was AWESOME!!  She gave us suggestions and we took them without hesitating and loved every minute of it.  From the stiffed jalapeños to the lobster roll!  It was amazing.  The chorizo in the stuffed jalapeños was to die for, but the vinegarette that came with it was to die for.  My husband and I always bet what the bill total will be, and I totally thought we spent $100 but we only spent $68, so of course the rest went to our wonderful waitress!!  ITS A MUST TRY!!!!"], ["Rachel O.", "Holy Palm Beach, Batman! Boyfriend and I just went here for date night.  We were both newbies but had heard good things so we decided to check it out.Parking is less than ideal.  There is a lot located behind the restaurant and down a little hill but it was full so we ended up parking close by on the street.  The hostesses were very nice and told us it would be about a 15 minute wait.We sat at the sushi bar and a waitress approached us and asked if we'd like to go ahead and order.  I said we were waiting for a table and she just walked away before we could ask for a drink.  Another waiter was nice enough to bring us some water.  He ended up being our waiter for the evening. The decor is bold and a bit odd.   Red walls with lots of Native American artwork.  There are a lot of tables in the restaurant but they are super close together.   It was almost like we were having dinner with the people seated next to us.  We were seated near the back of the restaurant and could see staff carrying bags of trash in and out which was less than ideal and the women's restroom ran out of paper towels but they were quick refill them.On to the food and super drink...  I ordered a Palm Beach because it was fruity sounding but the drink I received was SUPER strong.  I don't know how much alcohol was actually in there exactly but lets just say that it was well worth the $8.  Boyfriend got a couple of beers and was happy with the selection.  It wasn't to extensive but they had good options. We ordered the Shrimp Shumai app and when we received it they were still cold... almost frozen in the center.  We spoke to the waiter and he brought us a new order.  They were hot but nothing to write home about.We both ordered sushi.  I got the Shrimp Tempura roll and the Firecracker roll (fried tilapia).  The shrimp tempura roll was alright but there are others I prefer more.  The Firecracker roll was amazingthough!  I would definitely recommend it. The spicy apple mayo sauce was delicious!  Boyfriend got the Alaskan roll (snow crab) and the Tuna Tataki (ahi tuna) which he thought were tasty but didn't rave about them.  They are large rolls but I still found them a bit pricey.   Our bill came to a little more than $60 before tip.  Overall, I felt that it was just alright.  I'd definitely order a Firecracker roll to go but other than that there's not too much drawing me back to this place."], ["Dedrick L.", "Amazing........"], ["Richard T.", "This is one of my favorite sushi places anywhere.  Started off with the tempura asparagus app which is amazing although you hardly taste the asparagus due to the breading and combination of sauces. The unforgettable roll is unlike anything you'll have at any other sushi joint. This roll is appropriately named. The only complaint would be the seating because everyone is jammed together due to the size of the restaurant."], ["Colman R.", "Great deals to be had here! Having those deals while I was going through college was great.  Now that I can afford to come back to this establishment more often, I see that there is a variety on the menu and a great deal of skill in the chefs hands. Excellent service as well."], ["Yvonne R.", "Amazing food! Best sushi ever!!!!! Loved everything we had. Service was awesome. Very affordable."], ["Cody M.", "Very good sushi. The best I have found in Columbia, S.C."], ["Grace M.", "This place is absolutely terrible. The sushi chef is the only thing that makes it worth going... WHEN the fish is fresh. The last time I went I got food poisoning from the bad tuna, and my dads friend went a week or so before me and also got sick. The restaurant is cramped, the hostess is never anywhere to be found, and the service is mediocre. The only reason I am giving this establishment one star is because the sushi chef is friendly and knows what he is doing... I also know he has nothing to do with the quality of the fish."], ["Bill S.", "Excellent sushi! We had a combination of 8 different special rolls. Every one tasted very fresh, and I really enjoyed the sauces that were used on the rolls."], ["Leah B.", "My first sushi was here, and I'd love to go again! It was very tasty, and I didn't have any complaint about the food.It was however a bit dark to see much, so it was actually hard to read the menu and even eat. My dad and I ended up getting out his iPhone for light at we're using that to see."], ["Annie D.", "As I was driving downtown from the airport, I decided that I wasn't likely to leave my hotel once I checked in for the night, so I should probably hunt down some dinner first. For once, I didn't comb Yelp first. I just drove around and found something that looked decent.The pretty good:-My server was very friendly and helped me figure out what I could order rice-less that would still be delicious.-The seaweed salad/nori salad was big and tasted fresh.-The cucumber wrapped roll with shrimp, crab, avocado and asparagus was pretty tasty. It comes with a wasabi vinaigrette on top, which is a little sweet (not spicy at all) but it works. It comes rice-less anyway, so no substitutions needed. It actually inspired me to try making something similar at home.-The sushi menu is large and they have a lot of creative maki available.-Prices (at least in comparison to sushi in Minneapolis) are fair.-Free parking in the backThe could-be-better:-I've never visited a sushi bar where you have virtually no interaction with the chefs right in front of you. It was kind of strange.-I don't quite get the concept. As a lot of the previous reviewers have mentioned, from the name one expects a Mexican-Japanese fusion, but it's not fusion. You can get tacos or maki... but there's no taco-inspired maki or tacos made with sashimi. Not that I would really want that, but it seems to me like it would be a much more inspiring concept than just two polar opposite cuisines served under the same roof."], ["Erica J.", "Love the sushi and the tempura asparagus. Didn't like the tex-mex so much but seems to always be busy & has parking."], ["Marcus B.", "The sushi only get 3 starts, but the tempura asparagus pushes the rating to 4 stars. I am definitely a fan."], ["Tj R.", "Sushi was average, service was really good. Happy hour is LEGIT. $2 Kirin draft, $2 tacos, and 4-5 other specials. Hard to beat."], ["Scarlett P.", "Interesting combination, Mexican and Sushi.  I was a little hesitant but definitely intrigued to try out this new fad.  I will be coming back, the cucumber salad roll, spicy tuna and dragon rolls were terrific."], ["Murray M.", "I've only eaten here once, and I will never return.  This place has some of the worst sushi I've ever experienced.  For reference, I studied abroad in Tokyo, Japan and have eaten A LOT of fantastic sushi.  If you want good, authentic sushi in Columbia, SC, then I recommend Inakaya.  If you're wanting Mexican food, then maybe this place would be okay, but I can't say for sure as I had the sushi.  One thing I've always wondered about this place is its name - I know the name \"Takosushi\" was supposed to be a clever turn on the Japanese + Mexican food combo, but Tako in Japanese means Octopus, so it seems they're really just naming the restaurant Octopus Sushi - overall, the entire concept just really isn't working."], ["Taylor H.", "The place is small and you're likely to feel like you're sitting with the people at the tables on either side of yours. At least the chicken nachos are good."], ["Reese A.", "The very best sushi Columbia has to offer!  Exceptional!"], ["Jaymie M.", "The queso dip with chorizo was very tasty, but the sushi rolls get a solid 'meh' from me. They weren't bad, but they weren't orgasmic either. Especially the yasai (veggie) roll. The veggies didn't seem especially fresh and they had a strange taste to them. The rainbow roll was good enough, but I'd have expected higher quality for what I paid for it. My friend's crazy roll was a good deal better, but again, the sushi is pricey for the quality. Maybe I'll give it another go for lunch.Highlight of the meal: The Takosushi Mojito and Bellisimo cocktails. Late night, I'd go here for drinks and a snack, but maybe not the rolls."], ["Misty B.", "Wacky concept, well executed. No bad dish ordered. I do agree that the prices are a tad bit difficult to justify given the ambience, but if in a different setting, the food itself is worth the cost. Expect to spend 10 minutes with the menu -- a ton of wildly opposing Mexican/Asian options unless you already know what you want."], ["Dawn P.", "I went here 2wks ago for a little lunch and to get familiar with my new town. I read the reviews on Yelp and decided to give this place a go. It was empty so I sat in the back by the sushi bar. The two young Japanese guys at the bar kept me entertained. I had the Fried Asparagus for an appetizer and it was so yummy. I then ordered Mexican which is nothing out of the ordinary in terms of my culinary experiences. It was ok. I wish I had went with some sushi instead. This place got really busy around the 12-1pm hour and filled up quickly. I see this place is popular and I will be back to taste their sushi rolls and other Japanese treats another time."], ["Mark K.", "So it's weird sounding but, chips and queso with sushi actually works. The space is a little cramped, you sort of feel like you are going to be bffs with other customers but the waiters are attentive and the bar has a fairly decent selection. Not a great beer place, but plenty of well drinks. The sushi compares with any other non traditional sushi place. It's a good date spot, but plan on walking. The parking is not awesome. Overall it's a great start or end to hanging out in the Vista."], ["Justin Y.", "Worst meal in a long time.To start we had some server in his mid-twenties who was not very attentive. I ordered a simple dish of grilled fish, vegetables, rice and beans. The vegetables were reasonably well prepared but were piled like slop next to an ice cream scoop of white rice with some burnt tasting red sauce. The tuna, which I ordered medium rare came out well done and drier than what I have eaten out of a can. To add insult to injury, the dish which was priced at $9.95 came in at $2 more because of some sticker they put on the very bottom of the menu that said tuna was upcharged (no mention by the server). I have never been a fan of the dimly lit restaurant, odd mix of food, lousy preparation and awful floor plan, but this was the final straw. This is the last time I will be eating there even if it is a block from my office.If you have to go, just get the sushi. Stay away from everything else."], ["Morgan M.", "Went to Takosushi for the first time a few months ago, and I've been a fan ever since. Great food (LOVE the Crazy Roll and the salads) at a great price. Definitely my favorite sushi place in Columbia."], ["Lisa V.", "Not a fan of the ambiance for the price of the food.  A little high for mediocre food.  5 stars for the sushi.  I liked the flavor combos and I'm pretty picky with sushi.  The rice wasn't overcooked or messy or too vinegary.  Fish was fresh tasting.  We had the samurai (not a fan of the crab and mango glaze though I thought I was going to like it because of it... Hubs liked it) and tomahawk (my favorite!).  I liked the fried asparagus with spicy mayo and eel sauce.  2 stars for the tacos.  Just not a fan.  I have had better at an actual Mexican joint. Small portions and they should stick with just sushi. If you want sushi, it's worth a try if you're in the area.  I'd like to try elsewhere for the price point."], ["Helena G.", "This restaurant was a pleasant surprise. I wasn't sure about this Japanese/ Mexican fusion but worked great. For $14.95 we got a bento box (miso soup, cucumber with crab stick, a sushi roll and sashimi). It was a good deal. The fish was fresh and the sushi was well done. It's why I'm giving 4 star.The staff was super friendly."], ["Brandy W.", "The name is a little off-putting.  Every time someone would mention this place I thought, \"That sounds weird\".  My first experience with Takosushi was picking up some sushi to go.  I was not impressed with the ambiance but we enjoyed the rolls at home.  A friend convinced me to go back and dine in recently.  The place felt different when dining in with many patrons there.  It may also have had to do with the new management and menu.  The sushi chef sent out some sample rolls while we were waiting - they were delicious! The manager is very friendly and helpful.  On my second visit dining in, he remembered the rolls I liked.  So far I've tried the tempora asparagus (delish!), Super Crunchy, Jesse, and Crazy Susan and they are all fantastic.  The service is friendly and very good.  One of my favorite things are all of the new beers -there are some excellent and unique choices.  It's really difficult to find restaurants that have interesting good food AND beer selection!  I've now been to Takosushi 4 times - I like it that much!  I have yet to try the Mexican food there, but one companion seemed to really enjoy a burger and fries.  Surprisingly, they have some great dessert choices (including creme brulee!) but I haven't tried any of them yet. Our dining companions ate them so fast we never got a bite!"], ["Isaac S.", "Can't go wrong.... order pyramid roll or crazy rolls and be prepare for a party in your mouth.  Good service... little pricey but worth it."], ["Keith K.", "Times eaten here:  Once.Takosushi boasts perhaps the most bizarre and ill-executed menu in downtown Columbia.  My one and only time here, my party had the (mis)fortune of getting assigned The World's Most Bored Waitress.  I had to ask for water three times before giving up and getting it from the bar.  I hate to harp on bad experiences that aren't funny, so let's just leave it there, shall we?The food, such as it is, is typical overpriced Vista-Sysco crap.  How does one make bad guacamole?  I don't know and don't want to.  The space is loud and annoying and reeks of the \"shiny surfaces and granite\" decor philosophy.   The drinks are pricey, and the food, while grudgingly edible, is just so terribly mediocre that why would you bother?  I had the \"Sumo soup\" on some misplaced whim and it was really just a collection of noodles and kitchen leavings, with a few tiny bits of meat to be had.  One piece of salmon, about quarter sized, should not allow you advertise \"salmon\" on the menu for the item.As an educational aside, that same $14 will buy you a much better bowl of actual soup at Pho Viet a few miles away with enough left over for a beer or bubble tea.  Alternatively, it'll snag you roughly 23 cans of King Cobra and a 10# sack of generic ice.  Probably a better time all around, assuming you have access to a park bench or unoccupied porch.  Watch out for officer Arvelo though, he loves busting freedom loving men such as ourselves for the simple crime of enjoying the Big Snake in public.  Bottom line: Columbia has much better sushi (Inakaya Watanabe, Sakura, heck, even Camon) and Mexican (Real Mexico, Mucho Margaritas, El Mariachi)  and you should go to all of those places before going here.  My party of 8 was so generally underwhelmed that we left as soon as possible and fled into the night to get drinks in a place that was happy to serve us.Alas, Takosushi, it's not me, it's you."], ["Charles R.", "Joan Rivers says the dress slits should not be so close, yet the host was close. Chips and salsa where pretty good! All with free refills."], ["Jia K.", "management is horrific. But their happy hour special keeps me coming. wait staff is mediocre but the manger on duty is worse. They are not friendly at all. It's taco's are great sushi around here is not worth it! might as well go to a Chinese Buffet if it's sushi that you want!"], ["Emily E.", "My favorite rolls are the lobster and unforgettable (wasabi vinagrette is amazing).  It's rather pricey, but not outside the realm of most sushi places in the area.  I haven't tried any of the mexican dishes.   Seaweed salad is also good.  Service is good, but nothing exceptional.  Not the best bang for your buck, but they do have very unique sushi you can't find elsewhere and definitely more on the gourmet side."], ["Crystal C.", "Trying to explain this place is actually more difficult than I thought, but ironically the way I have found to explain it with one co-worker was \"You love sushi right? What about your spouse?\" ... their answer:\"oh my spouse hates sushi, their favorite is Mexican.\" This is the the restaurant they can both go and get their favorites. They have plain cheese quesadillas for the picky kid and were even kind enough to work up some teriyaki diced chicken with a side of white rice for the same picky thing. I have bounced around the sushi rolls and have yet to be disappointed. They have sushi/sashimi platters for 2 or 4 now too that left us painfully stuffed and in heaven. The parking is a bit weird and the place isn't very big, but it has a lot of atmosphere and good people running it."], ["Vivian J.", "Came here because it was the only sushi place open on Sunday and we really wanted sushi.The service was very good. The server was attentive and courteous. As for the rolls, between my bf and me, we had the Volcano, Dynamite, Samurai, and the Unforgettable. Our favorite was the Dynamite, and our least favorite was the Volcano because it was too fried in oil. We're from the West Coast, so our expectations were realistic, but this was just OK for what it was."], ["Courtney B.", "The combination of Mexican and Japanese food sounded a little weird to me at first. But then I tried it. It's so much better than I expected. I had chips with salsa and queso dip to start. Then finished the meal with the firecracker sushi roll. It was delicious."], ["Carl H.", "Great combination of selections for Sushi and Mexican. There were three of us and we all loved our dinners. The Asian Wrap was the winner of all the dinners though."], ["Cristine C.", "I come here VERY often. and order take out. and delivery [via 56].At first, I wasn't sure about the taco+sushi idea, but as you can tell, I've fallen in love. Takosushi offers a casual atmosphere but great service. The margaritas are good, the sushi is always amazing - get the Cary's roll and thank me later. I get the grilled tilapia tacos nearly every single time.. and the tempura fried asparagus is awesome, too.It's nothing extravagant, but definitely worth a try!"], ["Tanay N.", "Mexican and Japanese food in one place?!  We only had rolls the first time I came here, but we mixed it up with some enchiladas the second time.  The rolls are generally very good; we have tried dynamite, crazy, and a few more.  I wasn't a huge fan of the Japanese bagel because it was salty, but the rest of the rolls have been consistently good!"], ["Swetha G.", "Their green chili queso dip is lip smacking good. Our server told us that the portion size is generous so I had it as an entree instead of an app, and so glad I did!  She was not kidding, they give PLENTY of food and it's very very reasonably priced.  I can't believe for dinner on a Friday night I paid less than $10 with tax and tip, and left full and satisfied, amazing! I would give this place more stars but the atmosphere is not so great, tables are too close together you feel like you're crashing other people's meals, and it is way too noisy, so it's not the ideal dining environment. The food and service are both good though.  They have quite a decent vegetarian selection too."], ["Paul B.", "MEXANESE?It's not Mexican Japanese fusion- Just a joint with a split personality... Mexican and Japanese food with one place to sit your butt... This place has a nice cozy feel to it- not too big and not too small...nice music playing, good food, a place you can go and dilly dally, frittering away your time on food and drink. :)The steak tacos are very good! They use a nice Garlic Cilantro Pesto marinade that gives the steak a great flavor! Served with rice and beans. I have tried the Posole, which was a complete disaster... Thick and goopy and way over spiced with cayenne pepper- should of stuck with the more traditional and safer morsels...I've eaten here several times, however I haven't sampled the Japanese fare other than the Potstickers and Edamame...oh well, next time PS- they serve up a great Top Shelf Margarita!"], ["Roel F.", "Takosushi is not as interesting a restaurant as one might think based on the name, because the place offers Mexican and Japanese dishes, rather than combining both cuisines in one eclectic and potentially interesting mix. So yeah, the question is whether there really is a demand for a restaurant that does both? (Based on the large number of customers that were dining on the evening I went, I guess there is.)The atmosphere at Takosushi is pleasant, nice interior and music. The service is pretty good as well, friendly and fairly quick. Unfortunately, however, both the Mexican and the Japanese food are pretty mediocre! Which makes one wonder why one would go to this 'Japexican' rather than to a decent Mexican or Japanese restaurant? Seen the prices Takosushi asks for its food, I would suggest the latter option!All of that being said, Takosushi is not a horrible place to eat. So if you ever find yourself in a situation in which the group is evenly split between people that want Mexican and people that want Japanese... then you know where to go!"], ["jack q.", "We stopped in for a late lunch and ordered a variety of things, both Asian and Mexican.  Everyone had told us to get the fried asparagus and the 5 of us scarfed down 2 orders.  Very tasty.  Everyone tried something a little different and we all shared.  Not saying that the sushi \"goes\" with a mole sauce, but everything was fresh and tasty and our server, Brianna, was great.  I'd certainly go back next time we're in town."], ["Mike B.", "We were in town visiting from Paris, and our local  friends suggested we go to Takosushi for dinner. \"Mexican-Asian fusion\" was the way they described it, and I was very excited to try it out. Unfortunately, their inept hostess and completely unhelpful manager on Sunday night (Sept. 2) alienated me forever before I ever got to sample their faire. We arrived at about 7:30 pm and put our names on the list. We were told we'd have to wait an hour. Well, if you've ever been in Columbia this time of year, you know you don't hang out on the sidewalk waiting to get devoured by the mosquitoes, so we headed down the street to Flying Saucer for a drink. We came back forty minutes later, but the hostess shocked us with \"Oh, sorry. I looked for you, but you weren't here. It'll be another 45 minutes because you're back on the bottom of the list.\" We argued with her a bit, but she just kept whining this unacceptable response. The manager was unfortunately no better, unable to explain to us why they couldn't seat us at an open four-top just 10 feet away. It surely wasn't the kind of Southern hospitality my mama taught ME to show to MY guests.So, here's my two cents worth: If a host or hostess wants to overestimate your wait time so they can then become your hero when they call you early, that's a real gamble. Better to give an honest estimate so they don't screw over their clientele like Takosushi did last night. Or maybe at Takosushi, they're just so inept they don't know how to estimate wait times. Either way, it's time for somebody to get a new job.Thankfully, Motor Supply Company was able to take us, and we ended up having a marvelous dinner with great food, top-notch cocktails, and fantastic service.Too bad Takosushi ruined its reputation for me before I ever tasted something out of their kitchen. Maybe the food is all it's cracked up to be, but the service sure as hell isn't ... and because of that, I'll never know."], ["Dan C.", "WOW. This restaurant was amazing. Takosushi had the craziest sushi ever. We ordered at least 2 platters and together that was about 40 pieces.They also had Mexican, which, actually, is a nice mix. Takos(As they call them) and Sushi is good.Our waiter, Chris, was very friendly.Also, the sushi was SO FRESH.I would recommend this restaurant to anyone."], ["Todd T.", "We tried some sushi and a couple of the taco dishes here.  Nothing we had tasted worthy of the cost of the food.  I have had better tacos for half of the price.  Service was fine, but I have no desire to go back due to feeling ripped off for the quality of the food and price."], ["Gilbert T.", "Being that i eat a lot of sushi and i was so far away from home (san diego) I Wasn't  sure what I was getting myself into. I have tried a lot of restaurants out here that didn't live up to the hype. I was really satisfied with this place. sushi was great!!"], ["Bill R.", "Was dam good.. Had 4 different rolls all of them were good. If I am ever down south I will be coming back."], ["Matt Y.", "Ate here as a congratulatory meal for my girlfriend, who had just finished BCT training at Ft. Jackson.I am not a fan of sushi, and maybe her months of deprivation had skewed her tastebuds, but according to the girl her 2 orders of sushi(Fat Boy Roll and Triple Tango Roll) were fresh and excellent. Lots of flavor from the sauces but not overpowering.For an appetizer we shared some guacamole, which was above average, although not super memorable. The green chile queso with chorizo was excellent though, and both went well with chips.I ordered the chile rellenos, which were very very good. Stuffed with cheese but not overly greasy and very crisp coating and skin, which to me makes or breaks it.. The side of beans was unremarkable, but honestly I gorged on the chiles, and couldn't really care less.Service was excellent, and when we explained the occasion of our being in Columbia, the waitress gave the girl a free drinkl, which was super nice."], ["Julie R.", "I ate here two times in less than a week. The lettuce wraps are amazing! Lots of great veggies in a tasty sauce with these great fried asparagus spears that taste mildly coconutty. Their sushi was great too. I went here with two friends and we just tried whatever each of us had on our plates. The quesadillas are good too. Kind of a weird combo of foods but very tasty. I dont recommend ordering the sake however bc the large comes in this tiny little vessel and is kinda expensive compared to other places i've been. Definitely worth trying this place!"], ["B H.", "being from California I pride myself on my sushi dining. this place was pretty comparable to the sushi I've had in the Bay Area. Great service, great rolls. We ordered several kinds. definitely going back."]], "Chapala Mexican Restaurant": [["Caleb B.", "Absolutely Sublime!!My girlfriend and I found this pace and everything is awesome!!  They have a fresh, well executed, twist on Traditional Ameri-Mex.Best in Columbia!  Must try"], ["Valerie M.", "Great place!  Chapala came highly recommended and I am so glad we visited.We ordered Vulcan en Fuego and I must say it was awesome! The chicken was well seasoned, the steak tender and the shrimp juicy & plump. The handmade guacamole by tableside was super fresh and tasty.For drinks we ordered Sangria and while it was not the absolute best I tasted it proved complimentary to our meal.The staff was super friendly too!!The decor could have been a bit better though- the lighting particularly could have been softer and our table was a bit too far away from the benches for comfort.Overall, very pleased though. Would definitely visit again and recommend as well"], ["Kimberly S.", "3 words Vulcan en fuego! One of my favorite things to eat. Comes with your choice of refried beans, black beans or a side of rice. Chips and salsa are always full and the waiter we had recently was awesome! Great food here"], ["Heather A.", "This is the best place we've found in Columbia.  I've lived in Atlanta and Charlotte so I'm far from impressed overall as far as mexican places go.  With that said... we haven't found anything better in Irmo and when we need a Mexican fix this is where we head.  Don't get the table side guac, it was the worst i've ever had and worse than my friends pre-prepared side that came with his meal.  Just don't."], ["Taylor S.", "This place was awesome!  They had amazing chips and salsa!  Their queso was great and so was their food!  My boyfriend and I had the number 8 and 7 and they were both perfect!  We will definitely be returning to here!  The only thing negative I have to say is that the frozen margarita had a little too much mixer in it and which made it a little too sweet and juicy but my boyfriend had the 'on the rocks' margarita and he said it was perfect!"], ["Chester M.", "Good food, great prices, Lots for your money."], ["Lindsay K.", "Great food. The staff is always friendly. Make sure to try out the specialty drinks, they come in a clay pot and are perfect for sipping on the patio. And now they have black beans too! I love coming here."], ["Yvette P.", "This is our first time while vacationing in SC. Our kids who love Mexican food, especially my son-in-law who is an excellent critique of Mexican food, was very happy his wife found this restaurant on our way back home to GA.  After trying many Mexican restaurants here in the south and being unhappy, he found one he is willing to travel the 1 1/2 hrs to. The table side made guacamole was excellent. We had chicken tacos, rice and beans which were very good. The south uses white cheese not the orange. The refried beans are very, very mashed, but good. Enjoyed the rice with chopped tomatoes. Since I am from CA, I asked for a Cadillac Margarita with Grand Mariner and unfortunately they didn't know what that meant because they asked me two times what I asked for.  Come to find out, at least according to our guacamole maker, they are called Texas Margaritas. This restaurant pre-makes a very large batch which includes the Grand Mariner. It was good, but weak which is fine with me. Our service was a bit slow, but everything else made up for it. Oh yes, the chips and salsa were warm and tasty. My daughter said her corn tortillas were good as was her fajitas.  My son-in-law forgot to ask for cheese enchiladas forgetting in the south they default to ground beef. However he said they were pretty good and he doesn't care much for ground beef, that says quite a lot coming from him. I loved the Mexican music played.  So if you find yourself in Columbia or passing through, try Chapalas in Irmo."], ["Eric W.", "Come here all the time. Love the food and atmosphere. It's much better than other Mexican joints in town. Great lunch specials and the food is always fresh."], ["Jack N.", "Muchisimas gracias a Alicia, porque eres muy amable. The service was actually very attentive such that my drink never fell below half mast and I didn't have a chance to lack for any need I might have desired.Overall, the menu is slightly more tailored to the American palate that I might have cared to see, though my Torta Loca was reminiscent of the splendid fare served by the street vendors in several Mexican cities. It was exceptionally authentic and delicious in and of itself.  I was not impressed with the Tacos De Camarones, but the Agua de Jamaica was bursting with the robust flavor I appreciate very much."], ["Kelly B.", "Pleasantly surprised.  It's tucked back from the road and didn't know it was there for a while. Always enjoy the margaritas and queso. The taco salad is good, but seems to grow, as I can never finish the whole portion."], ["KeiKei B.", "Well yes ma'am!  And that with my southern drawl yall!!!  Had unfortunate business but was able to relax and chill with some Tex-Mex.  It was a little loud in there due to the Elvis impersonator.  The crowd had a great time.  I did as well with my food.  I needed to pick me up.  Had the burritos and rice and beans and yes ma'am!!  Highly seasoned like I like and amped up with little to no cheese (I know I am a weirdo).  That said I had three, 3 y'all, margaritas!  Yes ma'am!  And they were worth every gulp!"], ["Mary D.", "Finally, a Mexican restaurant in Columbia that isn't the same at the one next door.  I have been back several times, and ordered something different each time, and it is always good.  Each dish actually looks different and tastes different than the other. Don't settle for any more bad Mexican slop on a plate and come to Chapala's!!Great food, great service and love the patio!!"], ["Emily E.", "A welcome addition to Irmo!  I ordered the fish tacos and was pleasantly surprised by the generous amount of well seasoned fish that paired well with the cilantro.  The sauce was served on the side and had a great spicy kick.  The margarita was strong and hit the spot!  Service was incredibly prompt and friendly.  Sitting in the bar area was perfect for catching some March Madness action."], ["Sateesh N.", "Good chips and salsa.. Guacamole dip was best.. Food wasn't that great though.. Very economic though.."], ["Ryan C.", "Ate here for the first time a few weeks ago and was surprised.  Much better than your typical monterrey or casablanca linda. Salsa was amazing, especially the extra hot kind. Service was great, I ordered the Chile Poblano's and to my surprise it was actually prepared in the right manor and stuffed, unlike the rest of the slackers who just put the filling down and lay a pepper over it. But it was AMAZING. My girlfriend at the time got the Carnitas which were perfectly tender with just the right amount of lime and cilantro and the avatar salad was great. Definitely my new mexican spot. -Ryan C."], ["Alan F.", "Read the reviews was pretty excited to try it out. Went there on a Saturday night and it was not overly crowded. Most of the crowd was eating, or close to finishing their meals. Took awhile for the server to eventually make it to our table. The service and the food was horrible! We never got the appetizer we ordered. After watching many people come in and receive their food eventually-another server came by and asked us what we ordered. She must of placed the order at that time. Our order was wrong and the food was below average at best. It took well over an hour to receive our simple order. It was the first time in my life I did not want to leave a tip. This placed showed potential but it was heartbreaking to eat there. Btw: it looks more crowded than it is. Looks like they have the employees park up  front to create a ruse of being busy."], ["Jane N.", "The food is pretty good and the best part is that the chips are gluten free.  All of the wait staff doesn't understand GF but I did go in one day and ask the manager.  he told me that the chips were in a dedicated fryer and gave me some ideas on what I could eat.  We've eaten there several times and I think I have had one minor reaction, cross contamination I'm sure.  But, 1 out 10 isn't bad and we will continue to go there."], ["Eaton O.", "Potential ! Salsa/chips...spicy but good. Tacos el or de pastor and chorizo were very fresh, tasty and something different. Chicken Quesadilla, fresh and plentiful. Atmosphere and decor...eh, average..... pretty much what it has been since every other place in there. Service was fine. They did offer a Sat night Nacho Fajita @ 6.50...looked good and seems like a deal l and heard mon was Fajitas. Give it a try... IRMO/HARBISON (unlike Chapin) needs this place !!! Try it."], ["Ashleigh S.", "I have been three times now and I can say I truly enjoy this restaurant. The food is fresh, standard tex-mex, but very well made. Tnere is a chicken with rich seasoning, mushrooms, Bell peppers, onions and other veggies that was so moist. The margaritas are far better than the sickly sweet junk at other chain Mexican spots in town. The staff shines above the rest. We came on a Saturday night with a Party of 12 and they were more than accommodating. They graciously moved us outside, it was a rare cool/early fall night, and attended to all of our needs. They surprised us all by putting a sombrero on my hubby's head, serenading him, and smooshing whip cream in his face! It was a perfect birthday. I highly recommend Chapala's in Irmo!"], ["Will W.", "Great Mexican Food. Better than the usual slop at other local chains. My favorite is the Tacos Al Pastor. Get it with corn tortillas and you will not disappointed! Gets 4/5 stars only for small lack of ambiance."], ["Tyler P.", "Excellent food and super friendly service.  Be SURE to try the California Burrito.  Amazing!"], ["Tim P.", "This review was written when restaurant was newly opened. The place was packed. It took a while to get our orders in but the food came out lighting fast. Everything was great. The shrimp diablo was quite spicy and delicious. Overall the menus is standard tex-mex fare.  The staff was friendly and family run.  This location has been the home to many restaurants.  This one will make it based on my experience."], ["Shannon W.", "We love this place!  Fast, friendly, wonderful outdoor seating-a rare thing in this area.  The fish tacos are amazing and the chicken soup (yes, chicken soup) is now my go to crave if I am in need of comfort food."], ["Julie P.", "I was recently in town visiting family and we went here for lunch. The staff was very friendly and very helpful. My brother is on a gluten free diet and they smeared him clear of any sauces that may have caused an issue. I had the fajita nachos and they were very good. They had shrimp, chicken and steak. I was pleasantly surprised at the amount of meat. Some places skimp on the meat to cheese ratio.  One of my other brothers order the carne asada tacos. He exclaimed that they were excellent. All in all one of the best Mexican places I have been to in awhile. We definitely go back next time I am in town."]], "Monterrey Mexican Restaurant": [["Curt K.", "I've been eating here for about 14 years. The people are wonderful, hardworking and make a quick, consistent lunch. This is your typical, quick mexican food place.Try their carne' asadas (steack and onions). Great deal!Also, they are willing to cook up anything you like. I often have chicken enchiladas with no cheese and topped with burrito sauce."], ["Leslie Y.", "They're closed as of 2/10/15."]], "El Salto": [["Micah L.", "I have had consistently delicious food and great service at this newer Mexican spot. The owners are really nice and go the extra mile to make a solid product that will keep me coming back."], ["PhatPhuck M.", "Typical chain style americanized mexican food.I knew it was going to suck when he brought our tacos to the table in hard shells.You could add the name On The Border or San Jose or Chi Chi's and the food is the same."], ["Simon T.", "When judging Tex-Mex,chile relleno is key.Theirs is just perfect!"], ["Rick T.", "Spoke with the owner Israel over my fantastic lunch,this is what he said. He is planning on adding a new design to the restaurant outside to serve food and have more seating for customers as on weekends it is getting to be too crowded. I was also informed that the menu would be more authentic on the weekends as he has a larger Spanish crowd from the local neighborhood which is great for people who are bored to death with this Americanize Mexican food. Israel is bringing talented chefs and cooks that specialize in making specialized dishes from scratch from neighboring states. One more thing I learned from are chat is that he still has the old Gyro machine from my ole Dino's and may use it in the future to create a dish. Seeing what the cooks were eating made me really want to dive in his new menu. These are the kind of business and owners I can get behind in Columbia's every growing food scene. Staying true to his roots but also not afraid to think outside the box and put a new dish out there for us to try. Oh and I haven't eaten here three or four times and had nothing but great service and great meals with friends and family since the opened not to long ago."], ["Sydney R.", "I had planned to go to the place next door, but it was very clear to see rhat this location had a better atmosphere, so the short trip was made to this location instead. While a bit small, the place is nicely decorated with a pleasant atmosphere, fans going to keep the place cool.The service, while they came by a lot, was very sweet. The chips come with a salsa that was spicier than expected, the cheese sauce INCREDIBLE, and eventually a spicy sauce that came around that I never tasted.There's no margaritas, but there is a mango water that is really worth the try. All prices are very reasonable, and the quality of the food is honestly incredible. The food is hot and very, very good, very fresh, and the trip is worth it."], ["Mark R.", "Excellent service and really good Mexican food! They have dishes not served in  other Mexican restaurants in Columbia.  I had the Pollo Asado with their house marinade which was tasty. The server was happy to substitute black beans and salad for the enchilada. A good selection of beers and tequila and they will have draft beers soon."]], "El Burrito": [["Elizabeth R.", "El Burrito makes my 100% favorite food in all of Columbia. I love it and I go there at least once a week, and that has been true for more than a decade now. I usually do takeout, but they have a really nice patio where you can enjoy your food. I always get the deluxe mean bean burrito, with hot salsa, and add lots of free toppings. The free toppings you can add are chopped up fresh jalapenos (my favorite 'cause I like the heat), extra hot salsa, chopped onions, lime wedges and cilantro. I think that is really, really cool.Sometimes I also get guac, and let me tell you, their guac is really good! It's got actual 'cado chunks in it, so you know it didn't come out of a big plastic guac bladder or anything like that. They also have free chips and salsa one day a week (Wednesday?), and other really good daily lunch and dinner deals. They have good beer and soft drink options too--pretty sweet!I think you should go eat here because it is so good. The menu is small, but everything on it is the best possible version of itself. The folks who work at El Burrito are also the best! The hire nice, offbeat people who do a really good job with the food and with the customers. If this place ever closes down I'm going to cry so hard my face will look like it was attacked by bees. Please don't ever close, El Burrito. My face is already not that great to look at.UPDATE: Free chips and salsa is on Tuesday, not Wednesday. I had some last night as a reward after I fixed my own AC unit. I am pretty handy."], ["Jeanna P.", "I really am giving the place a 1 star based solely on the charm of the place and the friendly staff. The food was not worth rating. The verde beef was dry and bland, there was nothing chipotle about the chicken. Had to add spinach cheese sauce to burritos to make them bearable."], ["Elizabeth F.", "Is it the most amazing burrito/taco/salad that you've ever had? Probably not. Does it do the job in the pseudo-Mexican desert that is Columbia? Yep. For the cost, the place isn't a bad deal, and the food is generally pretty decent. Now, if you're coming from California where muy muy delicioso burritos are the norm, then yeah, you are probably going to be disappointed. But if you're just craving a burrito and don't want to go the corporate Moe's/Qdoba/Chipotle route, then this is your place. Try the extra spicy salsa. It's not that spicy, but it adds a good flavor to the otherwise unmemorable chips and/or whatever entree you order. The hot salsa that they add to the meal isn't by any definition actually hot---and this is by Midwestern white girl standards, so a pretty low bar to hurdle--so if you want any sort of spice, you have to add the extra-hot."], ["Meg F.", "Really yummy food. Service was polite and quick.  Loved to eat outside on the patio and enjoy the warm weather."], ["R R.", "Just rediscovered eb and it's still the wholesome, fresh and edgy kind of place I remember."], ["Adam B. J.", "When I first moved back from Charleston in 2002 all of my friends kept telling me this was the best place in Columbia.  At this time like most of my friends I was a vegetarian.  I'll have to say, I felt sorry for Columbians at that point as I had just left a culinary mecca with limited veggie places at that time, but much more than Columbia had.  Since then I've seen the error of my ways (or ignored them) and not only started eating meat, I started craving El Burrito all the time.  Truly the best salad (with chicken and beans, plus add some of the fresh jalapeños and a little more lime juice) and cheese dip ever.  Favorite lunch spot.  Especially when the weather is nice.  Alas now that I'm sort of mature (unlike in 2002) I'm not able to enjoy one of their delicious cold cervezas as often, but I always want to.  Five Points staple!"], ["Joshua R.", "Food: 5Drinks: 4 (no original creations, but a good selection of cheap beer)Atmosphere: 5Staff: 4Overall impression: Take this joint for what it's worth - the perfect taco stand.You cannot beat El Burrito for a cheap meal- once you locate it. Unmarked except for a \"Bienvinedos\" sign on the front of their blue, concrete building, you will need someone to take you your first time. Never cheap in taste, but SO much value for the price. With varying specials every lunch and dinner, you can walk in with $5 and leave completely satisfied. There isn't much seating, so be flexible in your solutions, and if you have more than 3, you'll need to sit outside. The staff is very flexible and very precise, but don't expect to be attended to after you get your food. However, if you ask them for anything, they'll gladly hop the counter to help. Everyone I have brought here ends up bringing their friends the next time. You'll hate not knowing about El Burrito sooner."], ["Kate H.", "Being a Californian in Columbia faces has it's challenges, but the lack of good Mexican food may be the hardest. This is where El Burrito comes in. WOW. I had a beef and chicken taco both meats were fresh and seasoned amazingly. Also had a side salad and their vinaigrette is out of this world good!! But I have to say their salsa is right on the money. I definitely recommend the hot salsa verde and lots of the triple hot sauce they have. AMAZING. If you are stopping through 5 Points definitely swing by El Burrito and see if Kats there!"], ["S H.", "I've lived in Columbia for years and have never been here until last night. I was always curious about it and I'm slightly embarrassed to say I thought the name of it was \"Bienvenido\" all this time. Yeah, I know that's Spanish for \"welcome\" but it's the only sign outside and sometimes I'm a bit slow! :)Anyway, I'm really glad we tried it out last night. With these local joints, especially those catering to the college ground, the counter staff is often a bit surly and why do I get the impression they are mocking me for not understanding the ordering process?Well, that wasn't the case at El Burrito. The guys behind the counter were very friendly, despite us being a bit older than their regular customer AND not knowing if we should sit down or order at the counter. (Order at the counter for the record.) We stood there looking like idiots for a good 30 seconds trying to determine what to do. The best part was that I felt good after eating there, not bloated and regretful. I had the mean bean burrito (black beans with brown rice), deluxe (tomatoes and lettuce), no cheese or sour cream with mild salsa. My husband had the same with spicy salsa. We split guacamole and chips. The burritos were HUGE, fairly priced, fresh and the black beans weren't a soggy mess that soaked through the burrito. (See? It can be done Moe's, Chipotle, Salsarita's, etc.!) The guacamole was great and while the chips were pretty salty, I enjoyed them. While I was eating, I noticed a sign on the menu board saying the rice and beans were never cooked in animal products and everything was fresh, etc. Being vegan, I was THRILLED. I'm looking forward to Spring to be able to enjoy their cute little patio and a cheap beer with my dinner. Nice work, El Burrito. I can see why you've been around for years!"], ["Anh P.", "Delicious vegetarian options. Love that the base of their burritos & tacos are brown rice & black beans, a great combination of two ultra healthy food items."], ["George H.", "Yelp has led me astray once again. I have no idea what others are talking about but the chicken burrito I had today was very bland, over priced, and not worth the trip. They charge extra for simple things like lettuce and tomatoes. If you don't spring for the \"deluxe\" you're basically getting meat and beans. The burrito I got was called chipotle chicken, yet I tasted no flavor in the chicken. Nor did I get any sour cream in my \"deluxe\" burrito. Honestly for the price I paid for the burrito, chips/salsa, and a drink, chipotle would have been a better option. Plus chipotle would have been cheaper. So overall, not worth it. People who like this place must like bland food. And whoever compared these burritos to ones in California has obviously never had a burrito from California"], ["Erin W.", "Best burrito in columbia, hands down."], ["Robbie B.", "Affordable, tasty, hip, quick, and convenient - the testament for El Burrito would be the clientele alone, locals down to the quiet guy at the end of the bar, if the food weren't so damn fresh, simple, and, lemme say it again, affordable!  Here's the dish on El Burrito:Fresh: AKA the word my friend'd say mouthwateringly as he'd corral me to go to the El. I don't know of a Mexican-styled restaurant where I walked away feeling so good about myself and so full at the same time. Tip: start with the basics - mean bean tacos (I say crunchy, but a past self sez soft) with hot salsa, and load em up with fresh cilantro, chopped onion, and more sauce. For the spicy type, lay on those fresh chopped jalapenos too! Go the distance: request their cilantro salad dressing. Guh gu ga. Mention this dressing to a local and watch him do back flipsSimple: People may complain, but I love the straightforward menu. You got tacos, burritos, salads. You got sodas, but best of all you got beers. Mickey's Malt Liquor, PBR Tall Boys, Sierra Nevada, Corona. Make note of the daily and nightly specials, like DOLLAR tacos. Cute: Love, love the patio. Nice breeze and you can watch the confused schmucks line-up and hate themselves in the drive-thrus for Chick-fil-a and Cook out. Small interior with a long, tiled bar. Poster art in the bathroom. Cool staff. Just don't look behind you, above the front doors, when you walk in - odd photos of dental work in-progress from the 60s (wtf?).You might miss it - it's that sky-blue building with the 'Bienvenidos' sign just outside the hub of Five Points. They got bluegrass on Thursdays, too!"], ["Keith K.", "Times eaten here: 3.  Won't be back to eat as I've never enjoyed the food.El Burrito has a nice little outdoor patio where you can watch bony hipsters, hopped-up college kids and the panhandlin' homeless roam free through 5 Points as Nature intended.  (More fun than it all sounds, honest.)  El Burrito also has a decently fun summertime Thursday bluegrass night around back in their crunchy-glass parking lot, as well as amusing graffiti in the (men's) bathroom.  So, that's two stars right there.Sadly, the food is dreadful.  Round, cheap chips what disgorge out of a huge Sysco box, unheated, unappetizing, uninteresting.  The food is all unusually bland, and the M.O of the restaurant seems to be to upcharge you for things that should be free to begin with, like sour cream and tomatoes.  The base salsa is wretched, the \"spicy\" isn't, but is somewhat tolerable.  The menu is also surprisingly limited, which I wouldn't complain about if they were \"doing it right\".  They are not.  The service is minimal, but they do carry Mickey's malt liquor, so there's that.  Also advertised is a vegan option, which is welcome.  I have not yet dared to try the chili.Honestly, if you write 'Burrito' above your door but are rolling burritos that fall somewhere south of Moe's, you may want to re-evaluate your business.  Apart from the 'atmosphere' and occasional music night, there is really no good reason to visit El Burrito.  Instead, I recommend Real Mexico or El Mariachi when you want a burrito worthy of the name."], ["Mona lisa V.", "I really wanted to like this place. Nice outdoor seating and very cool interior with bar where you can eat, too. Menu is simple and easy to read. Staff was very friendly and quick.Unfortunately, the food was unimpressive. I should've known when I walked in and wasn't greeted by an inviting smell. I'd say it's closest in quality to Moe's, because I remember the only time I had Moe's the burrito was dry and the most memorable part was the undercooked beans. Similar deal at El Burrito.El beans were frustratingly undercooked and bland. If they'd had a flavor, I could probably have overlooked their dry, chalky interior. Maybe they salt the water when they soak the beans. Maybe they just don't soak them long enough. Whatever it is, it was unfortunate. The chipotle chicken was also dry and somehow watery at the same time. Overcooked. It was like something made in a crockpot and reheated for lunch the next day. It was the culprit for the water that oozed out constantly. Also, the regular burrito is $5.50. The \"deluxe\" is $7. All the \"deluxe\" option adds is tomatoes, lettuce and sour cream. At first I wasn't sure if that was a joke. But I ordered it anyway and thought they'd forgotten to add the \"deluxe\" additions until I discovered the romaine lettuce quintet in my burrito. Call me cheap, but a dime for each one-inch piece of lettuce is somewhat steep. Oh, and two pieces of a flavorless tomato. Twenty-five cents a pop, same size as lettuce. At this point I'm wondering if these vegetables were blessed by the Pope, hence the price. No sign of the $0.50 sour cream until I spotted a tiny smudge one of the five pieces of lettuce. Easily the most bland, overpriced burrito I've ever eaten."], ["Jordan R.", "A previous reviewer said \"typical gringo burrito\" and I used to have similar sentiments. However, \"gringo burrito\" is now a food genre all its own and once you realize its not \"authentico\" then I think the expectations change a bit. This is a place that does what it does (keeps it simple) and never changes, for better or worse. There's not a lot of variety but when you go to El Burrito, you know what you are getting into. For more authentic fare, go to Real Mexico or Taqueria Jasmine.El Burrito is a place for a good, cheap meal with a decent, cheap beer. It serves that function very well. Outside seating is nice for groups when its not too hot out. Go for the deluxe bean burrito and a cold High Life (or Pacifico if you wanna splurge). If the hot salsa doesn't do it for you, there are diced jalapenos at the bar. Its not a stretch to say you can eat here for less than $5, have a relatively healthy meal, and leave happy. Not too many places that you can say that about."], ["Becca D.", "El Burrito is one of my favorite restaurants in Columbia. I usually get the mean bean deluxe tacos, which are delicious, filling and very reasonably priced. The micro-greens from City Roots farm are a really great addition to the menu. The environment is perfect, and the people who work there are some of the nicest in town."], ["Pam C.", "Our office has been picking up salads from here since they opened. I wish they would bottle the dressing.  The salads always have the freshest ingredients.  We're known to drink up any leftover dressing, it is that GOOD! My daughters used to get the burritos, but since they've tried one of the salads, it is hard to go back and order something different. I do appreciate that they use the healthier brown rice and the best Freshest greens available."], ["Sean Y.", "A bit of a hole in the wall, with a burrito bar setup.  The chipotle chicken burrito was lackluster. It was a typical gringo burrito.  I was a bit surprised to see the two white women behind the counter, but I gave them a chance. It was overall a bit bland. The hot salsa was not spicy; it was a major disappointment.  I'd go to Chipotle instead next time."], ["Bridget U.", "I love the food and the people who work here.  The atmosphere is nice.  You may have to swat away a few homeless seeking money but nothing too tragic.I love the vegetarian burrito and my dad and brother love their beef burritos.  They roll fresh to order, the burritos are huge and worth the mullah.  They use fresh ingredients and even local, I think.They have good soups, guacamole, and cheese dip.  They give out jalapenos, onions and cilantro as well as extra salsa/spicy-red-sauce to augment your burrito with.They have been doing bluegrass night for a long time so I would venture to say it is good stuff- have not experienced it yet for myself.  Support a great local business that is a cute place to be."], ["Paul G.", "Been going here for over 10 years regularly and they never disappoint. Always awesome. The best"], ["Phillip S.", "Easy, simple, fresh food all the time, food cheap place to get down"], ["Saluda F.", "Always great food and a cold beer."], ["Mike H.", "Didn't blow me away, but for amateurs they did all right. At the large chain burrito places you're given more upfront customization options for your entreé. Here, unless you say something, they won't ask. If you want a Coke or the like to drink, then you'll have to grab the bottle out of the fridge. You may want to stick with a beer. It just seems to have a better fit. The dining atmosphere is unique, but I rather felt as though I was eating in an overly decorated bathroom. If you are looking for a place to eat by yourself or with one other friend, the small dining space works exceptionally."], ["Seth J.", "If this were LA I couldn't go any higher than three stars. For Columbia, SC though, it's pretty darn good!The salsa is very authentic, hot and spicy, reminds me of an LA taco truck! The flavors in everything else bear little resemblance to Mexican, despite the name, but the ingredients are fresh and the chicken is delicious.Burritos are good and the chicken salad is very very good."], ["Cammy K.", "Delicious burritos. Friendly staff.  And bluegrass night in the parking lot rocks the house.  The crowd there tonight for bluegrass reminded me of my crowd in Lawrence, KS (oh how I miss you, Lawrence)I didn't find the menu too limited.  The chips and cheese with spinach is good, and the beef burrito is wonderful.Fast, affordable, casual, fun!  I'll be visiting again soon."], ["Tony H.", "Excellent Mexican food! I would eat here again.  Food is fresh and very tasty. If you are in the USC area, eat here."], ["Nicholas K.", "IF you can't make it to Taco Bell, try this place out.  The plusses are fresh ingredients, large portions, cheap price, and tallboys of Pabst with whatever you order.  You also get a choice of cilantro, jalapeno, and fresh salsa to go with whatever you order.  It also has a great Thursday night happening when it's warm.  It's called bluegrass night which basically is an excuse to get the weekend going early, drink cheap beer and listen to moderately good bluegrass outside.  The funny thing is is they never seem to order enough of the cheap PBR and past 7 o'clock or so if you want to drink there, you gotta get the doubly expensive Mexican beer.The three stars I gave is for this somewhat shady practice (just order up some more cases of PBR - WTF?) and for their VERY limited menu.  There's like three things on it - big burrito, little burrito, salad.  Chicken or vegan. That's it.  No beef, no pork, no enchilada, no rice side, nothing.  Even though it's a glorified burrito stand, for a restaurant run by a supposed gourmand, I'm sorry but that seems a little bit limited."], ["Debi S.", "Here's a tip. If you get the burrito, ask for the salad dressing in it.  It's the bomb!"], ["Chip O.", "Quick and cheap if you're looking for an in and out place to eat.They also have live music, so you should grab a beer, good fresh burrito and sit down and enjoy!"], ["Kel B.", "I have been to El Burrito about 5 times since moving to Columbia.  Mostly I have been with a friend who likes it, but I have never been a big fan.  The food is just plain bland.  No flavor at all...  the burritos are also always soaking wet, dripping out dirty water all over the place.  Ick.  I do enjoy the atmosphere, but the food just isn't worth it.  Also, I have had my order messed up three times there (very simple orders picking straight from the menu, no changes)."], ["Jordan J.", "I relocated from Columbia about a year ago to a much larger city. I can say with confidence that I have thought about how much I miss El Burrito more often than I can count. There are few places that compare. For such a concentrated menu, they accommodate to many dietary restrictions and choices, and, although the dishes are basic, they offer great salsas, limes, cilantro, etc for those who wish to add some additional flavor. Additionally, they support the community, especially the arts and WUSC, and put on great shows.  As for the service, I may have encountered a distracted staff on occasion,  but never out and out rude service. My only gripe, which I feel guilty about even mentioning because people deserve to have time off, is that the last holiday I was in town they were closed and I had to manage what can best be described as crippling disappointment for an eleven hour car ride home. All around, a great community establishment, worth supporting even if they didn't have great food, but they do. Try the soup some time."], ["Eva F.", "excellent. one of my favorite places."], ["ro b.", "fabulous food and atmosphere. i would eat here three or mo times per week if i lived in columbia. so, ill settle for each time i visit. good healthy selection (with vegan options) of tacos, burritos, salads and soups not to mention nice selection of beer and sake. the atmosphere is a breath of fresh air in a small carolina town. good people, good vibes and fab food."], ["Andrew C.", "It was very fresh and the staff was very friendly. I have been trying to make it for Thursday night bluegrass for a while now and it always seems to rain or it is too late in the season. I really enjoyed the experience."], ["Jack T.", "Food was ok (slightly better than fast food), but the redheaded bitch that served us totally ruined the experience. Absolute lack of service, scowled whenever we asked for anything. I might as well have gone to Taco Bell...I probably would have received better service there. Not ever going back."], ["Ind R.", "Quick & cheap burritos, tacos, and salads made with fresh, quality ingredients. The tacos will give you the biggest bang for your buck, but will also break apart in your hands. Plenty of vegetarian options, additional self-serve salsa and condiments available. Great food, but the rice can be a little dry.Little indoor seating, so be prepared to sweat it out at an outdoor table. The porch is really nice in the right weather, despite the unfortunate view of Harden street. Will the construction ever be over?Blue Grass night every Thursday in the back parking lot (seasonal). Was always popular when I was a regular."], ["para l.", "Most excellent burritos with fresh and tasty insides. Several vegetarian and vegan options. PBR tall-boys. Good music playing on the outside patio; an occasional live show. By far the best spot in 5 Points. Also be sure to check out the excellent poster-art and prints in the bathrooms, mostly from old shows that were in town."]], "Chipotle Mexican Grill": [["Michael L.", "Great flavor and food as with any Chipotle. But, the service here is lacking. Parking sucks. Order, pick up, and take to a place of your own enjoyment."], ["Brittany C.", "Food is good. Service, not so much. The \"dining room\" seems to be quite dirty after a rush, as though they don't have enough staff to keep it clean."], ["Li S.", "After a busy day I was looking for something quick to eat, and saw this Chipotle was nearby. I've been to Chipotle's across the country, and they never seem to disappoint. The service at this one might be the one exception though. There was something off about the staff. The guy who started my order just stared at me blankly until started ordering. He didn't say a single word. I ordered a quesadilla and the next lady who put it together and put it on the grill handed it to me, uncut- one massive quesadilla. I know that quesadillas aren't the most common item on the menu, but has anyone ever been served a quesadilla that was just one massive piece? After asking her to slice it up for me, she rolled her eyes, and sliced it. Then I had to ask for sour cream... the sour cream that usually comes with the quesadilla. As I stood there wondering if at any point I had said something to the lady to offend her, I noticed her eye rolling, sighs, and general disdain for each and every one of the customers. It was very off-putting. Overall, the restaurant was clean, food was good, service was bad."], ["Tiffany M.", "This is the first time I have been to a Chipotle and been disappointed. The bowls are normally filled with great ingredients, not here. The bowls were less than 1/2 full and the customer service was lackluster."], ["David D.", "Good food terrible customer service!! The representative was whispering to her co worker the whole time taking my order."], ["John T.", "Came here a year ago and it was so bad they reimbursed us. Tried it again and it still sucks. Dirty, tasteless, chips were stale. You get the impression this place is managed by a highschooler or not managed at all. I agree that higher ups should close this location.Don't judge Chipolte on this location. Drive to Pooler, GA if you are in the mood because that's how bad this one is. No wonder no around here likes Chipotle."], ["Lindsay K.", "What can I say, it's Chipotle! Across the board these restaurants are always clean and the staff is always friendly. The food is always fresh and I like that they do their best to use meat from family farms located in the US. The menu is super simple and you get to choose the ingredients that go into the burrito, bowl or salad. This is a fail safe place for a good meal!"], ["John S.", "Great food and service but no cheese dip for the chips and not enough parking. Again great food and service."], ["Zach R.", "Chipotle should be ashamed of this one.  Filthy dirty restaurant with rude employees.  Every visit in past 3 months, they are out of drinks."], ["Michel W.", "The actual food is great. The service from this location is horrible. The only reasons I give 2 stars instead of 1 is because the food is really good and corporate responded to my issues and TRIED to correct the situation.Because of corporate, I gave this location a 3rd try by dining in (after 2 incredibly frustrating online ordering experiences) and this location still got it wrong. I have now moved to Charlotte so I will try a Chipotle here, hopefully with better luck.If you want your order correct, go to a different Chipotle."], ["Natasha C.", "Two words! Patron Margaritas! I like Chipotle. We don't have one in the Augusta area, but I've always fancied the place. When I visit areas that have one, I always stop in. Well I was on my way to an event that I knew was going to have a bunch of finger foods that would upset me, so a friend and I decided that we'd eat at Chipotle before the event. She had never been before, so we had to go. I always have a hard time deciding on whether I want a burrito or a bowl. I was wearing my event ensemble, so the bowl seemed like a safer choice. It was around 2:00 p.m. and I ordered a Patron Margarita as well. You're judging! You know they saying...\"It's 5 O'clock somewhere.\" Plus it goes perfectly with the menu. I like that Chipotle isn't complicated. The menu is very simple. If you add more, you pay more. Really basic stuff. This particular location had a very industrial feel. I can't remember if they all look this way or not. This location is located off the very busy Harbison Road. Depending on the time of day, it can be hard to get to. There is also a Starbucks next door, so parking is scarce because of all the Starbucks  loitering Lol! The staff was friendly. The restaurant and restrooms were clean, which is always a plus. Overall, my friend loved it. She even called her fiancé to tell him that they served Patron Margaritas. I believe the surprise comes in because you just don't expect this restaurant to serve alcohol. One of my favorite quick stops. Thumbs up!"], ["Emily E.", "I may be slightly addicted to this place but I make no apologies.  Their food absolutely deserves five stars.  Fresh cilantro lime rice (white and brown options), several juicy meat options and fresh (organic when possible) locally sourced ingredients keep me coming back.  You can get burritos, salads or tacos.  I love their hot salsa because it actually has a good kick to it.  Be careful going here because once you taste the heavenly blend of flavors rolled up in a warm tortilla, you'll be hooked just like me."], ["Kristen V.", "This isn't really \"fast food\", but I'd classify it as FASTER food.  I prefer it that way, actually.  We'd never been before and the guy working the counter very happily explain the process for us.  My husband decided on a steak burrito, and I had the steak bowl.  Everything was very fresh, and I caved and paid the extra $1.80 for their (made fresh daily) guacamole.  The brown cilantro rice was yummy, though my husband thought it was \"too cilantro-y for him\".  Personal preference I suppose.  The corn salsa was really good, and though I consider the guac pricey, I also consider it worth it.For \"fast food\" it was overall a bit pricey.  Steak Burrito, steak bowl (with guacamole), bottle water, and fountain drink was a little over $20.00.  Not something for a regular quick lunch, but I would recommend it to friends to try out!"], ["Sam V.", "Beware of this Chipotle. I used to frequent here until I found a sizable piece of plastic in my food. I told the \"manager\" (one of the several young employees) about it. She took a report, took the piece of plastic in a container, and said she would be sending the issue off to corporate. She didn't offer any other help aside from that. Weeks later, corporate never called, problem never resolved, my business never returning!Also, to the ones who missed it, this Chipotle received a \"B\" health code rating at one point."], ["Jason R.", "Personally I prefer Chipotle over all of the tex-mex style restaurants.  The ingredients are always fresh and the restaurant is always very clean.  Most importantly not much can compare to the barbacoa!  My suggestion is to get it in a bowl and then you can mix all of the ingredients so you don't just get a huge bite of meat and the next bite is nothing but beans and rice."], ["Brian L.", "More like, Chipolt-bae! Unlike the previous reviewers we've never had a bad experience here. It's delicious and I love it. I mean, they aren't going to win any customer service awards, but dude... There's a reason why they're working at a Chipotle. All they're doing is scooping wonderful goodness into your bowl, and they've got that down like two flat tires. All in."], ["Greg M.", "The dirtiest place in the area how sad the staff were spraying cleaner near the utensils drink area and sprayed the utensils with cleaner check your fork before use"], ["Amy A.", "Not what you'd expect from a Chipotle.  The service was slow, the food prep area was dirty and covered with spilled ingredients and the guacamole was brown.  They had no forks so we ate our burrito bowls with spoons. We drove 20 minutes out of our way to eat here and boy were we disappointed. Even the kids commented on \"what a mess that place was.\""], ["Jane N.", "Food is good and they can usually do gluten free.  They will change their gloves when you tell them you have a flour allergy.  However, there is a lack of training and you have to watch the employees before you order. I have seen them touch the spoons with their hands that were in the flour tortillas and touch the tortillas with the spoon which contaminates everything in the bin.  I used to eat here frequently but the last couple of times wasn't worth it as I watched them contaminate the bins with flour.  I love Chipotle and some restaurants are better than others at the cleanliness and avoiding cross contamination.  Unfortunately, this isn't one of the good ones."], ["James I.", "Great food.  Doesn't receive 5 stars simply because some of the people that work there act as though they can't hear your order.  Also, many times the workers in standing near the middle walk way talking and having fun while a long line of people are waiting to order."], ["Whippaa M.", "Staff is super friendly.  Food is fresh and delicious.  Quick service. Clean restaurant.  Love this place."], ["Lisa F.", "I love the Chipotle brand as a whole, but this particular one, I will never patronize again.  I've been eating at Chipotle since one of my good friends introduced me to it in Charlotte while I was living there and I was ecstatic to find out that they had some places in Columbia.  I've always ordered my food the same way at every Chipotle: two scoops of rice, a scoop of chicken, a scoop of pintos, two handfuls of lettuce, and cheese. I drove all the way from the heart of Lexington, across Lake Murray Dam (a 20 minute drive)  to this particular Chipotle and got hit with this all of a sudden, brand new, \"portion control\".It started off well.  I got my two scoops of rice but when it came to the chicken, the girl put a HALF scoop as well as shook some chicken chunks off.  There was only chicken on one side of my bowl.  She didn't even try to spread it out.  I asked for a little more to go to the other side and she told me \"That's extra.  We have portion control rules.\" What the hell?  I've been eating Chipotle a good while now and I've never heard of \"portion control.\"  As a matter of fact, I've ordered this from y'all before and I've never had a problem.  Then when I got to the girl with the lettuce, she BLATANTLY ignored my request for two handfuls of lettuce and MUMBLED under her breath \"Like she said, we have portion control rules.\"  I about reached across the counter.  How RUDE! It's lettuce for Christ's sake. It's WATER! You have portion control on WATER?! Ugh!  But you have no problem about packing guac over the rim of the container for the people before me.  How's that portion control?!It couldn't have been because I was overweight.  I'm not bigger than a green branch from a tree, so I don't know where this BS came from.  I know every time I go to the Forest Drive Chipotle, I never have a problem with my order so I guess I'll be going there from here on out. Maybe I'll give the one downtown a try.  I'm going to \"portion control\" my money from this Harbison location."], ["Dixi S.", "I was just thinking about dinner and thought \"Chipotle.\" Then I thought \"no.\" This is the reason why...Service. I was quite a regular at this location until several months ago.  I believe it was around March of this year.  I used to get the same thing every time - same salad, same drink. It was really good. One time, there was a long line at the counter.  When I finally got to order, they didn't have the steak for the salad.  I had to wait for it. I had to wait after a long line the next two times I was there.  On the third time, I told the person at the register about it because there were several people ahead of me who also had to step aside because they also wanted steak.  He basically said that they don't keep a lot of inventory because they don't want the meat to sit too long because it was a sensitive meat.  A woman who worked there was next to the counter, and she explained the same thing to me.  She gave me a buy one get one free coupon card.  So, I got home and opened my food to eat it.  And guess what?  There was no steak in my salad.  Omg!  I called to let them know.  I talked to another person.  I explained to him what happened, and he told me to use my coupon to get my replacement salad.  Ugh!  I was pissed I was leaving to go out of town for the week, and when I got back, I got my replacement salad.  I didn't use my coupon.  I just wanted what I paid for . They did give it to me free.  I never used the coupon card.  I think it expires soon. End of this month. I do like the steak salad that I got there.  The prices are fairly okay.  But in my experience there, I spoke to a few people, and they all told me the reason why they run out of meat.  No one ever acknowledged the other side of why they should NOT run out of meat so they can better serve their customers.  No one ever said about talking to their management to see if they can improve their process.  All I got was the reasons why it is the way it is, so I took it as that, and whether I'll take it or leave it.  I choose leave it."], ["Kam O.", "Good & Good! The staff persons are super friendly & helpful.  I'm not a burrito person but the bowls are excellent.  I was a little hesitant on my first visit because the choices are limited. I was very mistaken. The food is really tasty. The taste is fresh & light; no more Moe's for me."], ["Michelle B.", "Not impressed! Let me start off by saying I've been to several other Chipotle's before and have always been a fan. My visit to this location in particular felt like all that was missing was a parade of dancing dogs...because I felt like I was at a Circus. The staff looked like a bunch of clowns, from the service I received to the way the staff looked.  One person on the line (poor girl was trying her best) she yelled to the clowns in the back twice for help, they were too busy booty dancing in plain view and adjusting their nose ring to care.  When they finally decided to help the service was terrible, they simply just lacked common sense or don't give two sh!ts! I won't spare you with all the details that occurred at checkout (it got worse). As I sat down and ate my \"cold\" food and somewhat stale chips, I continued to watch the rest of the show in awe.  The service I received was on par with a Wendy's or McDonald's, but who knows maybe these employees were rejects from those establishments."], ["Adam C.", "I have loved Q-doba and Chipotle at first taste but knew that Moe's was the favorite down here in SC.  Well, finally a Chipotle was opened around Columbia and I'm so damn excited. Finely marinated meats, rice and vegetables with the correct spice/flavoring, you can tell this is one step above Moe's where I admit the taste is fresh, but if I bought lettuce sour cream chicken etc my burrito could taste exactly the same as Moe's."]], "Cantina 76": [["Isabel E.", "Some background about myself, I am originally from Texas and nothing can beat the Tex-Mex experience there, but this is as close as it gets! I have never had a problem with the waitstaff or the service. The biggest problem I ever have is parking, but that is everywhere in Columbia. Every time I eat here, my mouth is watering for more and I cannot wait to come back to stuff my face full of the chips and salsa, tacos, or taco salad. Their margaritas even rival the ones in Texas. They are so good! (even though I prefer them frozen most of the time) They are worth the price tag. So overall, this is a great place to bring friends and family or if you are just craving some good Mexican food, I highly recommend coming here."], ["Anna B.", "Cantina 76 is always uber busy on weekday evenings. In my experience, though, that usually means that a restaurant serves items that keep people coming back. I get the chicken pesto and chicken teriyaki every. single. time. I know, I know -- I should branch out. But why mess up a perfect combination? The thing I don't like about Cantina 76 is that the salsa and chips aren't included. I know it's a \"step up\" from San Jose's and Monterrey's, but I really, really wish they were included. That being said, if you can splurge and get the queso and/or guacamole, it's totally worth it. In my experience, the original margarita (super cheap at happy hour) is great. The waitresses/waiters/hostesses/hosts are always uber young, and sometimes it seems like they're more interested in looking good or talking to one another than delivering great service. Even so, it's still worth taking a chance on Cantina 76. They always have sports games on the TVs and the bathrooms are (mostly always) clean."], ["Heng T.", "When I want Mexican food in Columbia, this is my go to spot. They also have another restaurant on Main St, just minutes away. This place can get really busy on weekend evenings so be ready but they have a waitlist system that uses texting to alert you so you can go somewhere else while you wait which is great since there are some small shops around the area. The restaurant has both indoor and outdoor seating with tvs all around so it is a great place to come watch sporting events. It has a small parking lot so most of the times you are going to have to find street parking.One of the downsides of this restaurant is that chips and salsa aren't complimentary with your meal unlike most Mexican restaurants. You have to pay 3.49 if you want chips and salsa but we never do that since they have a Tres Hombres option for 9 dollars but is a combination of salsa, queso, and guacamole. All of their dips are fantastic and they will bring you refills for your chips. That trio is definitely enough for a few people to share. As for the regular menu, they have an assortment of entrees such as quesadillas, tacos, burritos, enchiladas, chimichangas, and much more. As for drinks, they have margarita specials throughout the week so be sure to check those out. The tacos are probably their best feature but I enjoy their enchiladas as well since they come with chili sauce surrounding the enchilada. They have a variety of different tacos including fish, shrimp, beef, chicken, and pork and the majority of them are 2.99. I generally get a few tacos combined with the Tres Hombres and that is plenty of food for about 10 dollars. For service, I have had ups and downs. It just depends on your server and how busy the place is. The food itself comes out pretty fast and I have never had an issue waiting long for my food even with a packed house. Nice environment combined with great food so it never fails to disappoint!"], ["Rick T.", "Service here today was terrible at best my friends. Had to leave my table after ten minutes to get water from the bar after ordering with our waitress. Queso dip wasn't hot or even warm. No one bothered to refill glasses or to check on how the food was or to see if we needed anything. This use to be one of favorite spots but after today I will probably only get food to go at the bar at least I'm not ignored there."], ["H P.", "Lots of veggie and gluten free options! Friendly, quick service. Tacos tasted fresh and delicious. Would come again!"], ["Matt K.", "Fast service, incredibly fresh ingredients, polite staff, and a mixed atmosphere... what else can you ask for? This place seems good for casual outings with a friend (outside area), the office happy hour (bar area), or a family dinner (restaurant). The prices are reasonable, the service was quick, and the food was great. There is typically a bit of a wait here and, in our experience, the estimated time to be sat was off by a good amount but it's worth the time. Definitely a solid choice for Tex-Mex while in the area!"], ["Sherry C.", "Cantina 76...... Mexican........ Oh the dips and chips were good. I could have just made a meal off those. I got the Queso Dip, Guacamole, and Salsa combo. That was so good!! I was stuffed already just eating the trio. But since I had already ordered other food, I might as well stuff myself. I had the Beef Enchilada and the Vege Refried Beans. It was really good. I had a bite of the Chimichanga and it was also really good.We had a great server. She was good at explaining all the menu items. Good food......good service...... I'll definitely be back. Lots more yummy items on the menu I want to try."], ["Eric W.", "I've been here twice now, and I think it's pretty OK. There's nothing particularly BAD about the food, but nothing that really makes me say WOW. I think the real problem, is that I was expecting Cantina 76 to be kind of like Taco Boy is in Charleston. Taco Boy has a similar concept, but executes on a much higher level. But this isn't a TB review, so I'll keep the focus on C76.I went for my second time last night with a fairly large group. Food came out quickly, which was nice, but none of the flavors were great. I ordered three tacos: BBQ Brisket, Buffalo Chicken, and Roasted Chicken. The roasted chicken was BY FAR the best of the three. The BBQ Brisket was advertised as having a mustard-based sauce, but came out with a red sauce. Kind of confused my flavor anticipation. The service was pretty okay. Like I said, the food seemed to come out pretty quickly, but the actual server was not very attentive. I ordered a beer when we sat down and I was never asked if I wanted a second one. Luckily, I had a water, too so that helped extinguish the mouth fire that the buffalo chicken taco ignited. If I come back here I'll probably just stick to the chips and cheese dip, which are both great. The tacos don't do much for me."], ["Paige F.", "Adorable Mexican restaurant.  Every time I visit my best friend in Columbia, she takes me here.  That outside seating area is really nice.  We came around 8:00 on a Saturday night and it was crowded.  We waited about 20 minutes and then were seated outside.  It was so cute out there with lots of string lights.  The margaritas are really good.  I had the Devine and the Prickly Pear.  I recommend both.  The tacos were delicious and reasonably priced as well.  I had the buffalo chicken and the fish.  Both were excellent.  I would definitely recommend this place for a nice dinner with friends."], ["Ashley H.", "If you're looking for tapas style Tex-Mex this is the place for you. Between my friend and myself we had the Peruvian shrimp, BBQ pork, fried fish and chicken tacos. The fried fish came with a jalapeno cream sauce and pickled jalapenos, yum! It was by far my favorite. We went in on a Wednesday night and our bottle of wine was surprisingly half off, score! The chips and salsa (or in our case, queso) you had to order. This was at a minimal cost so no biggie. The service was alright, very hands off. They were busy though so I'll cut them some slack. I'll be back for cheapish, quick tacos and half off wine!"], ["kido m.", "2 of us walked in and stand by the bar about 5 minutes, and noone even knowleged there are customers! so we decided to ourselves in middle of dining room, as soon as we sat down, \"our server\" run to us and asked us to move to another table!!  oh btw, dont ask anything extra.., they will charge you sky high and say thats how they do! food was ok, but their customer service is bad!!  that was my experience at Cantina, and wont be back!"], ["Lisa S.", "I absolutely love coming here because of the amazing atmosphere. The chips and queso are great although the queso is small if you're sharing. I do have one complaint though - while the food (tacos) are seasoned well, the chicken in the taco often comes out burnt. This is disappointing because it would be an amazing taco otherwise."], ["Adam B. J.", "Honestly I had to simmer down a day or two before writing this review.  I'll start by saying our food was good.  No complaints there.  I love their Main St. location, and would give them 4-5 stars.  The reason this gets three stars instead of 1 or 2 is the fact that the food was good.  My wife and I came to this location after walking down the \"side walk sale\" on Devine Street Saturday 1/31/2015.  We were eating an early dinner so we decided to go have some nachos and a couple beers.  When we entered it was obvious they were on a wait.  We asked the hostess if the bar was first come first serve, and she said yes.  As we sat down we heard the bartender speaking to a server and say \"grrr, I don't want to be busy.\"  Off putting, but we just figured it was an employee venting to another employee.  The bartender went on to give us poor service, and repeatedly bother us/attack us about the sporting team my wife and I were wearing shirts of.  She hadn't even spoken to us or taken our order when she came up and said \"I hate your shirt and your shirt\" and then walked away saying something under her breath.  At first I figured she was trying to be funny/cute and just came off a bad way, but she didn't speak to us unless it was to say something else ugly about our team.  I know I sound like a little cry-baby, but it was over and over again.  We would have stayed for another round of drinks, but my blood started to boil and I didn't want to say something to her.  I'm still kicking myself for tipping her 20% after she made our visit absolutely horrible.  I'm sorry, I didn't sit at the bar to pay to be accosted.  She wouldn't even let us leave without making another dig.  I understand having team spirit, but she didn't say who she was pulling for, she just said things over and over again about our team.  Unprofessional doesn't even cover it.  Unbelievable!  We'll take our business to the Main Street location, and hope that this was just one terrible employee."], ["Taylor S.", "This place is really good, but not the best Mexican in Columbia.  Their queso is really good and their chicken tacos are as well.  The only thing that sucks about this place is that you have to pay for your chips and salsa.  What sit down Mexican restaurant makes you pay for the chips and salsa?  It's ridiculous!  But I must say their chips and salsa is really good though.  I think cantinas may have the best on the rocks margaritas in town also.  The prickly pear was my favorite!"], ["Willie D.", "Went with some fellow Yelpers after a event next door and was not really that hungry so me amd my other half split a plate of tacos. She had tje BBQ shrimp tacos and me the Roasted Chicken and Peruvian Shrimp tacos. I also ordered a Corona beer with a frosted mug. Strike 1 was the frosted mug was a chillled glass and I let it go for now. Sp our food arrived and I was impressed so this made up for the non frosted mug. Our food arrived and we were very impressed with the portions of the tacos. Fresh and soft tortilla s and flavors werw great on all 3 of the tacos. At $2.99  a piece and great flavors  we both agreed we will return soon."], ["Will C.", "Good specials and good tapas! The one on Devine has more of a restaurant feel and the one on Main St. has a more bar-like feel. I do prefer the newer main street location, their outdoor seating and the young adult crowd. Definitely the best tapas I've had since moving down for Connecticut!"], ["Ellen R.", "This is on my list of 'usual suspects' when I go out to eat. It doesn't hurt that it's about a mile and a half from my house! Sometimes it does get pretty busy when the happy hour crowd is there, but the wait typically isn't that bad unless they have large parties. The tres hombres is great for sharing since it has salsa, guac, and queso. I typically get the tacos. My favorites are the chicken pesto, BBQ brisket, and the smoked pork. I've heard the Peruvian shrimp is good too and I would try it if I wouldn't go into anaphylactic shock. I'm not much of a margarita person, but they do have two for one margarita Wednesdays, so I don't mind breaking the rule every now and then. Parking can be a pain since their parking lot is tiny, but parking along the streets isn't too difficult to find. Given the a la carte nature if the menu, you can pretty much order as little or as much as you want. I think it's relatively inexpensive given that I typically get a couple of tacos and split a dip."], ["Rachel O.", "I've been to Cantina 76 four times and it just keeps getting better.The first time I went was with a large group for book club.  I wasn't sure what to get and it was loud but then again... we were with a large group.The second time was for lunch with coworkers I was not fond of so company ruined that visit.  The third time I went with another group of people and we sat on the patio.  I ordered the Peruvian shrimp tacos (Lightly fried shrimp, sweet sesame chili sauce, topped with a jalapeño cole slaw) and The Pama (Tequila, Pama Pomegranate Liqueur, sour, triple sec, lime juice, simple syrup and cranberry juice) and I was sold.   Yum to the 10th power.  I could have stayed on that patio all day eating and drinking.   I had such a wonderful experience I told the Boyfriend that we HAD to go back.So on the 4th trip I had the same thing because it's THAT delicious.  Boyfriend loved what he got too.  They have weekly specials and Happy Hour from 4:30 - 7... all drinks $1 off (which makes PBR $1) and Margarita Wednesdays and Corona Fridays!  I'm going to stick with The Pama."], ["Jason F.", "Some reviews are not fair to the restaurant for what it really is; however, The Cantina doesn't help by advertising itself as a Mexican restaurant. This is NOT a Mexican restaurant. It isn't even a Tex-Mex and I'm not sure what to call it. It's more of a niche tapa mexi-style quick bite food venue with nice decor.Like most reviews show there are limited food options and it seems they try really hard to \"up class\" the food. The dishes look pretty and taste ok.  A standard soft taco is $2.99......The chimichanga is priced more than a standard entree at a Mexican restaurant but at the size of an appetizer. The food isn't bad but isn't great either.What put the final nail in this 2-3 star coffin is the chips and dip are not complimentary. Seriously?"], ["Chelsea W.", "Nice little spot that serves fresh mex. Nothing mind blowing, but I would go back for a nice lunch. I had the loaded queso and it was disappointing. The texture was a little glue like, not very fresh tasting, but I liked the pulled chicken and pico mixed in. I also tried the brisket and pesto chicken tacos. Brisket was good, nothing special, but I was a big fan of the pesto chicken! Definitely not what you find at a normal Mexican restaurant. The margaritas are pretty good, it's nice to find a place that doesn't use terrible sugary marg mix!  Was disappointed in how sweet my strawberry basil marg was, but my husband got the Cantina and it was really good. Overall fun, trendy, and fresh- but don't expect the best Mexican you've ever had."], ["Rhett R.", "I love this place. I'm a local and I seriously don't even know how may times I've been to cantina. Happy hour has great drink specials. I always get the trio of dips and then 2 or 3 tacos and I am stuffed! The honeysuckle marg is my fav! This is awesome fresh modern Mexican food."], ["Lauren F.", "Funky tacos made with quality ingredients. You wont find traditions mexican flavors here, such as al pastor or Carnitas; instead they have BBQ, buffalo, sweet-chili tacos. Not your average mexican place but has good and different variations of mexican food! One of my favorite places to get tacos in the area. And half off margs everyday (besides sunday) before 7pm!"], ["Maggie C.", "The tacos are so unique, fairly priced, and delicious! Although the joint isn't that big, the outdoor seating is great. I have never had a bad experience at Cantina, and even when there is a wait I get my food fast!"], ["San H.", "Even though I gave Cantina one star, let's start off with the good. The restaurant was clean. It had a really great ambiance. Lots of natural light. Great color scheme. However, there is limited parking. We got a pretty good spot but you have been warned. Also, we had to wait entirely too long to even be acknowledged. We had several staff look at us for several minutes but none spoke. Even if you don't think it's your job to seat, you should still greet. We were sat right in front of their doorless kitchen, where we got a front seat to the wait staff and the kitchen staffs horse play and personal conversation. Not only that, there was a female server around our age, with shorts that gave a full view of the bottom of her ass! Which would be fine if we were at hooters or if they had some kind of raunchy theme. The menu was lacking options. The food was terrible. Our appetizer was just okay. Not an expensive restaurant but too expensive to taste so pedestrian. One of the sauces was really great but the awful menu and awful service was the star for the night. This restaurant was all over the place. Sad because we really hope to enjoy ourselves."], ["Gregory P.", "Excellent tacos in a great atmosphere. Drinks are fantastic, too. Especially the strawberry basil margarita. Highly recommended!"], ["Arden S.", "Great clean restaurant! Way better than San Jose. Food looks way better than any Mexican restaurant I've been too. Prices are very good as well. Happy hour specials are great! Also in a nice clean location"], ["John C.", "Great Tex Mex, if you get the salsa with a side of blazing hot habernero, proceed with caution.  The tacos are tasty and creative, my wife and I split 4 so we can try the different varieties.  Most of the time this place is crazy packed, so have a plan B or C in mind.  I would suggest Night Caps, Henrys or Define Foods if you don't want to wait for a table."], ["Trevor S.", "Great atmosphere with decent food. Has a college town feel. I would definitely go back the next find I'm in town."], ["Chris S.", "They keep things simple on the menu, and their kitchen doesn't disappoint. However, the service is perpetually awful. On more than one occasion I've had to wait a considerable amount of time to order off the menu. Once the order is in, things move as they should. Don't let the terrible wait staff keep you from enjoying the great work going on back in the kitchen. The Taco Salad w/chicken is my \"go to,\" and the salsa is a \"must have.\""], ["RJ A.", "The Peruvian shrimp tacos are my favorite!  The guacamole, queso, and salsa sampler is a perfect appetizer for any meal you get here.  I like the Devine location over the Main St. location because of size.  This location is larger than the Main St. location which can often be loud since everyone is in close proximity.  They always have a special taco that has always been on point.  Parking can be a hassle during peak times so be aware of that."], ["Dawn W.", "Good tacos! The dirty queso is really yummy too!! I had the teriyaki taco which was good albeit salty. The brisket taco was more sweet than spicy but meat was good nonetheless. Fried chicken taco was spot on.  Husband loved his Peruvian shrimp tacos.  Waitress was just ok. She wasn't overly friendly and just attentive enough to get by. Also table they put us at was filthy and food was all over the floor which sucked.  Took away a star for that."], ["Gia J.", "This place is great. My only complaint is that the service was slow to be so slow. We just went for drinks and appetizers. They have individual tacos that range for about $2.99. The BBQ shrimp taco is amazing. Definitely check it out! A great place to go for a happy hour with outside seating."], ["Nancy C.", "Food was tasty. Service was friendly and fast. Peruvian Shrimp taco and the roasted chicken enchiladas with red beef chili sauce were tasty. Rather loud at 5:00pm on Wednesday."], ["Ðëvïlîshlÿ Ð.", "Chimi's are great and stuffed full. Can't go wrong with that or the taco salad. Service was the best I have seen so far in Columbia. I would come back for sure."], ["JOSH B.", "Gourmet tacos? At this price?! They should charge more, or they might go broke from me eating so many! Nom nom nom."], ["Robert P.", "I always enjoy Cantina 76 and absolutely recommend it if you have a margarita or taco craving. Their margaritas are the best in town in my opinion. With a variety of styles and tequilas, there's something for most. Best deal is the B1G1 house margaritas at happy hour. Tacos are wonderful and fresh. My favorite is the Peruvian Shrimp.  Try the guacamole. Also a winner. The service is great too. The right level of attention without feeling rushed. It's a place you can stay 20 minutes for a quick lunch or 3 hours with a crowd for afternoon drinks."], ["Amber C.", "The tacos are great, especially the shrimp taco. The drinks are a bit weak. I had two margaritas. The atmosphere was nice. I would go back just to try more tacos!!!"], ["Bailey B.", "Food was not traditional Mexican by any stretch of the imagination. Rice pilaf does not equal Spanish rice. What Hispanic theme restaurant does not have a blender to sell frozen drinks? Yep, Cantina 76. Parking? Yep, like 20 spots. Enjoy the frustration and color me disappointed."], ["Ellen A.", "This one really teeters between a 3 and 4, but given the generally sad state of Mexican food in the area, I'll go with the 4 and re-evaluate next time. First, though, it is really strange that they don't have burritos. Espcially since they do have a chimichanga. I also realize that they bill themselves as a \"taquiaria,\" so more like tapas or small plates, which means that they make more money per diner than they would with entrees.Having said that, the enchiladas were much, much better (and hardier) than I expected. Both the green sauce and the red sauce were delicious and, from reading another review, I see that they can make them vegan, too.The tacos were also a solid choice. There is only one veggie taco option, but you can pair it up with other small plates. The prices were reasonable (I think the enchillads are the better deal - and I always think the veggie options should be cheaper than the meat) and the staff was friendly."], ["Sophia V.", "I LOVE Cantina! One of the best in Cola. I was so excited to take my friends from out of town there. It was slightly busy when we went, 20 minute wait which is to be expected. After we were sat, I was shocked at the service we received. Our server was almost entirely absent, and we waited about an hour for our food.... which is extremely rare. I complained about my entree being cold and the waitress was extremely dismissive and rude; she literally rolled her eyes and walked away from me as I was speaking...I asked to speak to the manager and he completely changed the tone of our meal. Adam the manager is amazing!!!!! He came to our table, sat down and listened to our complaints and provided the best customer service I have ever experienced. He completely took care of the situation and made sure we finished our dinner on the right note. I got the chicken enchiladas to replace my entree and they were amazing. It was refreshing to see management that truly cares about their customers and goes above and beyond to make sure they had a good experience. We were extremely impressed with the customer service and we will definitely be back thanks to Adam."], ["karen w.", "What Mexican restaurant charges for chips and salsa?  This one... not a good value overall. I will say the salsa was freshly made, but when I asked for a side salad with salsa as the dressing option , I was charged $1.49 for the salsa. I don't normally have to pay for the dressing for a salad. :( And for the nachos, you get five chips with cheese. REALLY?The restaurant has a nice, busy, upscale wannabe experience, but I am sure I can find better value and equally enjoyable experience somewhere else."], ["Erin L.", "Continuous great and friendly service! New location is great as well"], ["Carl B.", "Amazing Mexican cuisine in a chic downtown environment!  Great bar, amazing options - nachos and chimichanga are fantastic!  Many gluten free options - strong recommendation!"], ["David C.", "In all if you want \"Mexican\" food and you dont want to run for the border or go to your standard canned experience and want fresh better quality food, I suggest try spending your money here. I just thought I would cut to the chase with my review and you can read on to the particulars if you like. I really like the inside of this building with the vaulted ceiling. The menu is simple, food on one side with drinks on the other. The menu is all a la carte and from the taste, its southwest flavors. We had a cheese dips, enchiladas, a fish taco, and chimichanga. The cheese dip and chimichanga were great. I got a bean, chicken, and beef enchiladas with the green sauce and the bean and beef were great. The chicken enchilada suffers from what every chicken enchilada I have had suffers from. The chicken was dry and stringy.. The search for the great chicken enchilada continues. The fish taco was good they just need to go a bit lighter on the amount of jalapeños they put on top. So a lot to like about this place now for the things that I found a bit off. If you want chips they will cost you extra(not really that bad since gorging on chips isn't a great thing), the table we had was so wobbly it took a little engineering with napkins to level, and even though I like simple menus I feel the menu was too simple or maybe the explanation of exactly what the dish is was a bit lacking. When I say what the dish exactly is, a la carte to me means I order a few things(almost like tapas) like I ordered 3 enchiladas since they are priced per enchilada, the tacos are per taco, which works right up to the chimi in that the thing was huge and came on some rice which made it plenty for a full meal. some niggles but wouldnt keep me from going back"], ["S H.", "This is currently my favorite restaurant in Columbia, hands down. Haters can hate, but I crave the guacamole and veggie tacos (ordered vegan, but still delicious). I'd eat here every day if I could afford it and my husband agreed to it. :) The only downside is how busy it is for dinner. We typically go on Fridays though, so it's a bit easier to pass the wait time with the $2 Coronas. But seriously, I'd wait hours to eat at Cantina."], ["Drew E.", "One of the few restaurants in Cola that beats out its competitors in Chas (Taco Boy, Zia Taqueria, White Duck, etc.)! Tacos are well-priced and well proportioned!"], ["Joanne M.", "Went here on a trip last week. Gotta say I really loved this place. Got the surf and turf tacos and HOLY SH*T they were good. Went on a busy Friday night and was still seated relatively quickly and the service was great. I think our server was heighley maybe? Anyways I would go once a week if I lived in Columbia. Also, they use flour tortillas instead of corn which really helps the things not fall apart, you can eat your whole taco without having to break out a fork"], ["Taylor H.", "They have amazing chicken teriyaki tacos. Also-- try the dirty queso. It's like 7 layer dip, but without guacamole. If you go during happy hour, definitely take advantage of the 2-for-1 original margaritas."], ["Swetha G.", "So I went to Cantina 76 last week when I was on yet another \"vegan try.\"  Not the smartest move on my part to go to a Tex-Mex restaurant with that diet, but surprisingly there were actually options on the menu for me.  The chips with salsa were good.  Very generous portion of basket of tortillas and the salsa had flavor (not the best I've had but it was not bad). I asked for two enchiladas with just veggie refried beans and requested both red and verde sauces, assuming they would come out vegan.  They brought me a plate of the enchiladas but the sauces had cheese in them.  When I asked our server if it was possible to get them without the cheese, she was very sweet about it, and took my plate back instantly.  They were very quick about bringing me a vegan plate and I really appreciated the accommodation and friendly service.  The sauces tasted pretty good and for my first vegan Tex-Mex dish, I wasn't disappointed.I'm not a big fan of the atmosphere (with the dark lighting and choice of tables and chairs), it has more of a sports bar vibe than a nice dining out decor, but the food is not bad and the prices are very reasonable, so wouldn't mind going back."], ["Andy O.", "Tex Tex tapas. Nothing to do with Mexican except the name of the restaurant. Cheese and lettuce in tacos. Nothing else to say."], ["Alex W.", "Really enjoyed the tacos I had both times I've been here. Shrimp, brisket, chicken, veggie: you name the taco, it's delicious!"], ["Laura B.", "The first time I ate at Cantina, I was horrified at what they were calling tacos.  I'm from the West coast, and have been continually disappointed in what passes for Mexican food in Cola.  But the fantastic margaritas urged me to return to Cantina.  On margarita night (Wednesdays?), margaritas are cheap and plentiful and damn good.  I attempted the tacos again, and putting aside my idea of what a taco is supposed to consist of, I developed a taste for their tacoesque creations. The best ones were Peruvian shrimp, veggie, and the smoked pork.  They are unique and addictive and well-priced.HOWEVER.  For the past three months or so, each time I go to Cantina, I have a disappointing experience.  The last time I went, I noticed my food had the overwhelming flavor/burn of Vicks Vapo Rub.  It was confirmed by my dining pal.  I think whoever was in the kitchen was wearing Vicks and it got in the food!  I have also gotten mild food poisoning from Cantina twice now.  Something has gone downhill about this place -- I don't know if they hired a new chef, or they have a staff member who is infecting the food with bacteria and/or Vicks Vapo Rub, but I will NOT be eating there anymore.  It seems cleanliness/hygiene may be lacking in the kitchen.I will continue to go there for margaritas (I can't quit those), and for the good service.  If you go at lunch-time, it's usually not too packed.  But if you go for dinner, be prepared for the parking lot to be full!"], ["Landy A.", "The wife and I ate here on a Wednesday night. Delicious tacos! Also, weekdays until 7 there is a happy hour with dollar off drinks. If you haven't tried Cantina yet, you must check it out."], ["Allie S.", "I went here to eat tonight with my mom and let me tell you it was amazing!! I'm from Boston (college touring down in the South) and I was very impressed with the quality of food. I got a Buffalo Chicken taco, it was good but not amazing. Then I got the Chicken Teriyaki taco and it was fabulous!! Coming from a girl who only eats plain tacos, the meat was tasty and the sweet sesame chile sauce was to die for. Plus a taco is only $2.99! In Boston, it would probably be about $5. I wish there was a Cantina 76 in Boston, this place is wonderful!!"], ["Meagan C.", "We have been here a couple times before, and it has always been okay, but last night was really disappointing. We came in around 8:00, and the restaurant was maybe half full.  The hostess seated us in the front wing (windows facing Devine St), around the corner from the rest of the restaurant, so we were basically isolated from the rest of the diners.  That would have been okay, except that a couple of servers came and sat down later behind us to do their sidework and rollups and were very loud - and singing. Really inappropriate while guests are having dinner next to you.We had the Dirty Queso for an appetizer, my boyfriend had a chimichanga for dinner, and I had the chicken \"nachos\".  I put the quotes because their nachos were 6 large fried tortillas with beans, cheese, and chicken, and an overwhelming amount of jarred jalapenos.  I picked off 75% of those, and the only thing I could taste were the beans - pretty flavorless.  I do like their salsa, but it was not enough to save the meal.  My boyfriend enjoyed the flavor of the chimichanga, but it was really small for $10 - most places would give you two that size for the same price.  Food was hot, but I would recommend the tacos next time - I've had those before and liked them.Our server, I think her name was Morgan, was inattentive and distracted.  We ordered drinks first, but she completely forgot about them and did not bring them until we reminded her and had FINISHED our appetizer.  We usually really like their honeysuckle margaritas, but both tasted overwhelmingly like lemon - maybe because mine had about half a lemon sitting in the bottom of the glass.  Despite forgetting them, they remained on our tab.We don't get to have a lot of date nights, and we both agreed - disappointing we wasted our night here."], ["Chad H.", "Love, Love, Love Cantina 76.Good tacos in Columbia, SC are hard to find, but if you like a wild taco with a bold flavor this is the place for you.If you are looking for classic mexican tacos with steak or chicken you might be disappointed.Cantina offers a couple different taco options instead of your conventional taco meats. I highly recommend the buffalo chicken or peruvian shrimp taco, but all of the options are great.Cantina also has a great bar with good happy hour prices."], ["Robert D.", "Great place.  They can serve you within 5 minutes of ordering.  Best margaritas in town.  Delightfully dressed staff & female customers. HIGHLY RECOMMENDED for well-dressed college girls and chic guys."], ["Mitch B.", "We came across Cantina 76 this morning and decided to head over there for a late lunch. This turned out to be a great decision. The food was amazing, service was great. It is a great scene. Another review was dissatisfied with the fact they do not have burritos, it is true they are not on the menu but they modified another item on the menu to create a burrito and my kids went crazy over them. There were enough options to where I will need to go back. My family was completely satisfied."], ["Steven D.", "Menu is a little weak for me but it's a very contemporary Mexican style dishes. Plenty of tacos to choose from and later decide your favorite. Atmosphere was excellent. Will be coming back fo sho."], ["Jim M.", "Mi dios! The wait was twice as long as they said, the short margaritas were $6 a piece, and the nachos were no bueno.Redeeming qualities include hardworking USC coeds providing great service and anticipating needs. The \"contemporary\" mexican tacos and food were just what one might expect for the location in Columbia, SC. Music was too loud but staff was very accommodating with TV channel selections for NBA finals. A better bet for no frills mexican but great quality is Tio's downtown. Adios mi amigos, no mas deniro para me!"], ["Scott F.", "Great food and atmosphere. Extremely busy on Monday night.!!!!!!!!!!!!!!!!!!!!!!!!!!!!"], ["Randolph J.", "Came for lunch on a gameday. Great buzzing atmosphere.  Busy but not overwhelmed.  Bartender attentive and pleasant.  Had 3 honeysuckle margaritas.  Delicious.  Food order taken promptly and delivered within five minutes.  Had the fried chicken tacos and salsa with chips.  All were very fresh, hot, and tasty.  Highly recommend for a fun energetic lunch."], ["Geoff G.", "The bland and generic ingredients seemed to have been banned from the kitchen at Cantina 76, as what we had was pretty damn good.The daily taco special was the Smoked brisket & Gouda w fried banana peppers. The flavors were deep and rich, and the Gouda was the right touch. The fried peppers were crispy and light. This was the highlight of the meal as the other two tacos  (\"Peruvian\" shrimp w slaw and a spicy aioli sauce was a bit too salty and the pesto chicken was tasty) were good but paled in comparison a bit.The staff were friendly and laid back college types. Happy hour prices on beer were decent and the bar was active for an early weeknight. Good stuff."], ["Skoot E.", "Wow!  I'm very surprised at all the negative reviews here.People are complaining that the tacos are too small?... They're only three bucks, what do you expect?  It's sad how gluttonous Americans have become!  We expect 14 lbs of food served in a trough for the low-low price of three dollars.  Sad.They're \"street tacos.\"  You're expected to eat a couple/few.  If you want a \"homewrecker\" to fill your colon in one fell swoop, go to Moe's.  Cantina isn't that kind of place.And it's NOT expensive.  2 for 1 margaritas on Saturday!  Who else has drink specials like that on a Saturday?  On Thursdays, you can get PBR cans for one dollar.  If that's too rich for your blood, then drink them at home where they're about 50 cents.Order a margarita (or two on Saturday), an order of nachos to share with a couple people, and a couple tacos and you have a great meal for less than $20 per person.  If that's overpriced for you, then stick to fast-food.The Peruvian shrimp tacos, and the surf-n-turf tacos are amazing.  So are the beef nachos.The ambiance is decent... not exactly my style, but it's not bad.  The service has always been excellent for me.  They have a covered patio to sit outside when the weather is nice, so that's a big plus for me.I also like that it's a bit removed from the college kids at Five Points."], ["Paul M.", "If you're familiar with Mexican cuisine or spent any time in a tex-mex state, you'll be disappointed here. We went with mid-size group on a Saturday night. It wasn't busy, the service was fine, and the food came out fairly quickly. Overall the food is OK, but calling it Mexican food demands imagination. The menu is brief and bland.  If you like having your tongue destroyed by the fiery depths of spicy hell, look elsewhere, there were no spicy dishes that stood out. There are no traditional Mexican dishes here... carnitas, carne asada, mole, barbacoa, cilantro, jalapeños, serranos, cumin, queso fresco... nowhere to be found.  The salsa was tasty but they charge for it.  The queso dip is average at best, and tasted of processed cheese. The brisket taco was especially dry despite a half-hearted attempt to save it with an abundance of overly sweet BBQ sauce. The tortillas are standard factory tortillas, and not particular high quality ones either. For $3 a taco, I expected a little more.   Yes, stuff is served in tortillas, and they serve decent margaritas, but the resemblance to Mexican cuisine ends there.  You need to be careful on the margaritas, some of them come with sour mix in them which is an abomination in margarita land."], ["Seth J.", "Worst taco ever. Not like in a funny sarcastic way, but in a serious \"that was the worst taco I've ever eaten\" sort of way. Refried beans and bland cheese microwaved in a tortilla for 15 seconds. The truth is that all restaurants get some of their ingredients in big plastic food-service bins, but rarely does the taste of plastic really shine through in the food."], ["Emily E.", "Loved the Peruvian Shrimp Taco; great, rich flavor and a chili sauce that has just the right amount of spice.  Very decent prices here, especially for lunch!  Chips and salsa were mediocre, but everything else made up for it."], ["Marty S.", "Peruvian hypeMargarita 2 for 1Surly service...boo.-M.S."], ["Lana O.", "I really enjoyed this place! I was walking down devine street shopping, and I passed it and thought it would be a great place to stop in for dinner!  It reminds me a lot of Taco Mamacita in Nashville (y'all can read my review of that).  You can order single tacos, or entrees, plus sides and drinks etc.  My boyfriend and I opted for the single tacos.  They were so good! My favorite was the pesto chicken.The margaritas were also incredibly tasty and not at all pricey.The restaurant itself was also SO cute, which I was not expecting from the outside.  We went for a late dinner and it was perfect for a quiet little dinner just the two of us :)Hope this place does well, because it's my fave mexican place in Columbia so far!"], ["Christopher K.", "Super limited menu.  Think of it as Mexican Tapas.  The food is fantastic, well prepared and filling.  Good vegetarian options considering how small the menu is.  This place isn't cheap but not terribly expensive either.  They charge for chips and salsa, i know that is a deal-breaker for some people.  I'd order about three items for a hearty meal and two for a light meal."], ["Drew L.", "Not your typical Mexican restaurant, so if you're looking for standard Mexican dishes covered in white cheese this is not your place. I would describe it as a upscale taco joint, though not upscale it is nicer than most all taco joints. The food is simple but tasty. Chips and salsa are not free! But they're good, plenty of cilantro in the salsa. The tacos were all good, bland ingredients mixed well to create wonderful layered tastes. Peruvian shrimp was the best. The only bad part was the service, our particular waitress was no where to be seen but another was always looking after us, so apparently they know they have service issues. BUT, I do recommend this place and will be going back. Oh yeah, most of the servers were really hot."], ["Michelle S.", "Cantina is sometimes amazing, but more often the food is inconsistent, or plain bad.  Fabulous margaritas disguise a multitude of sins?  When they first opened, the food was more consistent.  They may be on the downward slope of a slow death?  (I hope not. Cantina 76 is close enough to walk home. :-P )When the jalapeno slaw is good, it's amazing, especially on tacos.  I always order an extra side of slaw.  I have enjoyed the veggie, pulled pork and fish taco, and ordered them all at least 6 times.   Specials can be interesting. My husband said the \"peruvian\" taco was either bland, or disgusting. Maybe both? Don't get it. Get the pulled pork.The waitstaff is nice enough.  I don't recall anyone awful.  They are always accommodating to my 3 year old, which is probably a big reason why we keep coming back. Unfortunately, Cantina has problems with quality control.  The same dish can  run the gamut from over-salted to under-seasoned.  The salsa is nothing to write home about, but guacamole is pretty good.  When in doubt, drink up!  The agave nectar margarita is quite tasty."], ["Nate D.", "Tacos were good, however there aren't many food options. Tacos, quesadillas, enchiladas, and salads--that is it. Drinks were good. However the service was terrible. Don't go here in a rush. Good environment."], ["Jane D.", "Overpriced.  If you order the brisket taco, nachos or guacamole, you will enjoy your meal.  No free chips here.  Nothing authentic.  This is a good place to snack while you grab a beer or margarita.  It is good lighting for intimacy though noisy due to groups of 4+ and the sports on tv.Park across the street at the old Strobler if you can't find parking elsewhere."], ["Sam V.", "I wonder if the majority of Columbia gets overly excited by new atmospheres that use low lighting and have big screen TVs. Ever seen the crowd at a \"Carolina Ale House\" or \"Wild Wings\"? This place is no exception.In reality, Cantina 76 needs to close and most likely will.  While the 'ambiance' is  alright...everything else isn't. The manager is an idiot and a bit of a creep. I don't like saying these things but I'd feel like I was doing Columbia a disservice by not. A close friend of mine had a long coarse black hair in her food--something that could happen anywhere. However, the waitress and the manager both handled it like it was a usual occurrence. They weren't apologetic or helpful. I'd stay away. The portions are small and bland--the food is expensive for what it is."], ["Gwonk B.", "I went here for lunch and got the special.  You get 3 tacos and a drink for the money and, although the tacos are very tasty, they are really small and you'll leave hungry unless you want to drop $20 on more tacos.No free chips and salsa and the beer can really rack up a bill in a hurry.  I'd go here if I was already full and wanted a single taco and a beer.  I wouldn't go here to eat if I was hungry.  It's pretty overpriced."], ["Tanya M.", "Very over priced and the portions were very small. I'm a small girl and I left hungry. The mixed drinks weren't very good either. Not impressed at all."], ["Nicole M.", "This is your typical \"Americanized\" Mexican restaurant. I went here on a Friday night around 8pm, and was seated surprisingly fast for how packed the place was. They have very nice outdoor seating and the $2 Coronas were an added bonus. Our waitress was very friendly and we started out with some delicious chips and queso for an appetizer. When it came down to our entrees I was definitely happy with my choice. One member of our party ordered a chicken quesadilla- nothing impressive there. Normal portion size, and expected flavors. My boyfriend ordered the chimichanga. This was DEEP fried and definitely contained more fried tortilla than any other ingredient. It was almost overwhelming. I ordered an array of tacos. They have a portion of the menu with about 10 different tacos, all for $2.99 each. I tried the Chicken Pesto Taco, BBQ Brisket Taco, and the Peruvian Shrimp Taco. The Chicken Pesto Taco was a little disappointing. I was expecting the thick green pesto sauce that you get on pasta- and there wasn't much flavor at all. The BBQ Brisket Taco was very good, and it comes with a lime to squeeze on top which gives it a nice kick. My favorite was the Peruvian Shrimp Taco. The shrimp come lightly breaded and are topped with a sweet chili sauce and jalapeno coleslaw. I will definitely return for the Peruvian Shrimp Taco and look forward to trying their other unique tacos!"], ["Seth J.", "The margaritas are pretty good.The bean taco was a spoonful of flavorless beans on an awful tortilla microwaved to lukewarm. Ground beef tacos were better, though only by comparison...actually they were pretty awful too. Shrimp taco was just ok.All the ingredients were bland, generic, and boring."], ["David W.", "Food is good -- good variety of tacos and appetizers. Atmosphere and drinks are also good. This place is definitely a step up from your average, \"slop on a plate\" Mexican restaurant. Prices tend to be a bit high, but overall, not bad."]], "Tacos El Puebla": [["Ashley A.", "I have been here a ton of times and the has always been great. They have great late night hours for the weekend. The quesadillas are AMAZING!! The staff is super friendly and they always have great service. This is definitely the best street Mexican food in the city."], ["Kathy L.", "If you're looking for authenticity, you might have to look behind some big chain restaurants on Garners Ferry. And you have to make sure you're looking during these times:Thursday - 11:00am-11:00pmFriday, Saturday - 11:00am-12:00amSunday - 10am @ Owens FieldOnce we found this truck, it's been bittersweet to revisit restaurants where they served what we once believed to be \"authentic\" Mexican. I do not say this to denigrate all Mexican food in the city because there are some exceptional establishments in Columbia; this food truck is clearly among their ranks.The menu includes: tacos, tostadas, empanadas, quesadillas, chimichangas, chimichangas, burritos, tortas, tamales, sopas, horchata, and huaraches (the most expensive item is $3.50)The meat selections: asada, al pastor, lengua, pollo, barbacoa, chorizoNow, we have only had tacos. But we have had many tacos, so let's talk about them. The soft corn tortillas in which they come make it a gluten-free experience (if that's your thing). Of course every selection is seasoned and cooked perfectly (to be fair, neither of us have ordered the \"lengua\" so you'll have to just go with our blessing and respect there) and is topped with cilantro, lime, and onions... but have you ever been served radishes with your tacos? Neither my wife nor I had ever heard of such scandal, but turns out that it's a culinary tradition that we've been missing without knowing.Now we have been schooled, and few tacos in the city will ever again quench this thirs... wait, radishes aren't liquid so I can't make this metaphor work (but perchance by now my enthusiasm is as clear as it needs to be).In summary: We'd hate to wait in a longer line, but want to see more business at this hidden gem."], ["Chad A.", "I have looked all over the Columbia area for authentic mexican food that uses queso fresca (it may be called queso blanca) instead of the horribly cheap velveta kinda stuff. Its quick and really tasty food here."], ["David C.", "Dropped in for dinner Friday night and had a taco, burrito and huarache. I had pastor, asada, and chicken.  I won't be going back, but if I was I'd go with chicken. The carne asada was literally more than half fat. The fact that this place is in Columbia is why I gave it 3 stars. If I got served that in California I would have thrown it away."], ["Rico R.", "It's really not that hard and still they messed my order up. I ordered a machaca torta and a al pastor taco, the wife ordered a pastor tostada. And we got a machaca tostada I went back several times to try get my order straight and no joy. After 30 minutes if going back and forward and cold food, I finally get my torta, which was good but not excellent, definitely not 30 minutes good.My wife got a chicken with rice and beans plate, not in the menu, so the guy charged us eight dollars for it, keep in mind that a similarly sized burrito with rice and beans is 3.50, can you see why I'm furious yet?Anyways, there we're two tables with a few broken/ rusty chairs (most were missing parts) which were adequate but not preferable.The service was horrible, the dude did NOT want to be there, we were not greeted when we arrived, the dude never smiled with us or any of the customers.In all, save your money and go somewhere else where they appreciate your business."], ["Todd T.", "We have been here about 3 times so far and I have really enjoyed the tacos. Some days that might not have all the meat selections, but everything is always fresh and really tasty. They are right accross the street from Labrasca's and there is a bit of street parking nearby."], ["Tyler G.", "This food truck has the best tacos in the area! I tried the tacos asada and al pastor.. Both were delicious! All of the ingredients were fresh. The staff was excellent and at $1.75 per taco you can't beat the price!"]], "Real Mexico Restaurant Y Tienda": [["Emily D.", "This hole-in-the-wall establishment is always a fantastic experience, from their salsa (and, when you ask, their spicier sauces) and cheap beers to start, to their full menu. My husband and I are vegetarian, though most of our friends are not, and nobody ever leaves here with a complaint on their lips. It's been a minute, but last time I was there they had a summer squash quesadilla that hit the spot. I've yet to sit inside- there are picnic tables on the sidewalk with umbrellas, which is where I will always gravitate, even in the heat of August. There are some complaints about the run down ambiance, but let's be honest, sometimes that's what makes a place and if it keeps a few people out, fine-more seating for me."], ["Cameron G.", "I'm not from Columbia, so I can't compare it to other restaurants in the area. But I thought it was just average.I got the #8 on the lunch menu. It had eggs, beans, rice, and three flour tortillas. That was virtually the only vegetarian meal on the menu. (I tried to have them make me a vegetarian version of a torta or burrito, but that ended up being more hassle than it was worth.) My food was \"A-OK\" -- 3 stars. The portion size was average, and the meal tasted average. I got it to go, and they were pretty fast. I wouldn't be opposed to returning, but I wouldn't go out of my way for it."], ["David B.", "This place was PACKED on a Wednesday night. So naturally, I'm getting excited and my mouth is watering. I took the yelp advice and went with the chipotle chicken tacos, and I was not the least bit disappointed. They're hefty and delicious, with deliciously marinated chipotle flavored meat. I'm getting hungry just thinking about them. These 5 tacos come served with a side of lime for that authentic touch. Chips and Salsa were quality as well. This is one time when it's okay to follow the crowd... they will lead you in the direction of delicious Mexican food."], ["Chris S.", "Tried out this eatery for dinner and was pleasantly surprised. It's doesn't look like much but they are doing authentic-styled things back in that Mexican kitchen. I still have no idea what to do when entering the establishment. I found some random dude and asked him where to sit, he found me a place. There should be signage that either says \"Seat Yourself\" or \"Please Wait to be Seated\". It was slightly confusing.Food was delicious, service was appropriate, ambiance really needs some TLC."], ["Amanda B.", "Well I could rant and rave about this place! The service in this establishment is very good. They constantly ask if everything is okay and genuinely seem to care about the experience of their restaurant. The chipotle chicken tacos were absolutely impeccable. Exactly everything you would want in a Mexican meal. Spice, zest, fresh ingredients and saucy chicken! The onions were sautéed perfectly. Everyone at my table enjoyed their meals and drinks. I had a tequila sunrise. Everything I experienced from this restaurant was positive. A++"], ["Simon T.", "Legit Mexican.Lengua tacos? They got that.But still great for kids."], ["Teddy D.", "These just might be the best tacos i've had in Columbia SC.  I've eaten here a few times on my way to the coast and have never been let down.  Last night was no different.  The packing lot was packed, although annoying, is a good sign.  Nearly every table full, another good sign.  Although the place was busy, the service was still solid.  My wife and I ordered a plate of tacos and the mole enchiladas. Mole enchiladas were good, the tacos were great!  We got a mix, barbacoa, lingua, asada and a few more.   Just overall another great meal here.  This will likely become my super regular stop in my highway 20 travels."], ["Jennifer B.", "Fantastic fresh food!  The chipolte ribs are delicious!  Do not let the looks of the outside fool you because this is by far the best Mexican food in Columbia.  I am very picky so this says alot that I like a restaurant in Columbia ( non chain restaurants are a rarity here).  Staff is very friendly and service is fast."], ["Mike L.", "With the pictures and positive reviews we had high hopes for this place but it just goes to show you the difference in the REAL Mexican you get in Arizona, and what you get every where else.  Not a lot I miss from my AZ days but the Mexican food is on the list.  Why is there a need to cover everything in this white cheese sauce?  That doesn't make it Mexican and the restaurants between SC, and GA seem to have people fooled into believing you need this white mess.  The Chimichanga lacked flavor and the Caldo de Camaron tasted like it was prepared with week old shrimp.  The Mole wasn't bad, and the Rice and Beans were also ok which gives this place a 2 star vs a 1.  I guess I need to come to the realization that my bar is too high and get line with these standards.  Thank goodness for that Chipotle that opened down the road....and trips home!!!!"], ["Rob K.", "Legit Mexican food and drink.  Wow, if you leave here hungry you're a damn fool.  They even had Victoria beer here and I haven't had that since traveling to Cuérnaváca years back. The loco bean dip is unreal.  Anything with Chorizo is my kryptonite. The shrimp tacos with corn tortillas were perfectly cooked with nice char on the tortillas.  Well done.  The torts Cubana is a wild creation but tasty.  Can't wait to go back and try more delicious food.  Muy sabroso!!!"], ["Michelle M.", "Delicious, fresh, fast.Started with Real Margaritas. Great flavor. Yum!Had the Grand Guacamole appetizer.....it c OK message with fresh guacamole,  taquitos, and cheese quesadillas. It was superb. The taquitos were crisp and non greasy. Same with the quesadillas. The guacamole was phenomenal!  Next we ordered steak chimichanga and Santa fe chimichangas. Both very very good, fresh tasting, and not greasy. I would recommend this place to anyone and I will definitely  be back!!"], ["KATHLEEN M.", "Good service and good food! We came because of the reviews for \"real\" Mexican, but I guess it depends on where you come from! We lived in Tampa and had an all time favorite authentic Mexican restaurant there.Still the best we have had in Cola!"], ["Michelle G.", "Wow finallllly a gooooood Mexican restaurant!! The food was just amazing!! I had a Torta and loved every bite!! Service was awesome and the horchata was actually horchata no powder mix it was so good!! Chips and salsa were also good!! This place gets packed! It's worth the wait!! And the waitresses are sweethearts! Love love love it here lol my sister and I are so glad we found this spot and gave it a try!! I know she won't mind the 23 miles we would have to drive to get there it's just that good!!!"], ["Chad A.", "Very tasty and as close to authentic as you may get for Mexican food here in Columbia other than maybe one or 2 others. Guacamole grande is awesome and most options are tasty. Go at a time before 6:30 or your gonna wait, as this place gets real busy, but they are quick."], ["Will C.", "I got take out from here and what a spectacular treat. This Mexican food place is packed around dinner time, too many cars for the parking lot. From the outside, this place is nothing special - it's sort of sketchy looking, if anything. From the inside, the description is pretty much the same. It's not a \"nice\" place, it's more of a hole in the wall that makes up for it with delicious, delicious food.I ordered the Cubana Torta and it's everything you could want on a \"I'm going to eat horribly\" kind of evening. This place is special, definitely go try it!"], ["KD M.", "Best Mexican food this side of the Mississippi. Really. House margaritas are better than any. Not too much sour mix, like most. (They claim homemade). I think it is. Loco bean dip? I wanna subscription. With auto-delivery. It goes on the mixed grill, just as well as a chip scooping goodness. I always get one to go.Chipotle chicken tacos... awesome. I'll return for a long time cuz the menu is extensive and I want it all."], ["Mrs. C.", "Best Mexican food in town. Too small and too crowded with hardly any parking but wow, it's just so worth it! My husband had the best tasting margarita we've had in town and his sandwich was incredible. I had a delicious shrimp salad that I crave everyday since. We will definitely go back!"], ["Joel B.", "Great food I'd give that a 5.Great service also a 5.It's the environment that brings my overall score to a 4. Would I come back? YES! Over and Over. Great salsa and chips, and the food that followed was top notch. Like others boast, this is a truly enjoyable location. I first thought it had so many reviews because it's the only spot in this town, but that is not the case. The small location stayed full well past 8 on a Tuesday night. When locals and travelers are making a point to stop, you know you've hit a sweet spot. I'm glad these places succeed by good old fashioned focus. Yes the place is a bit run down as a mom and pop, and some financial re-investment is needed, but like everyone else here, I can overlook it for the good eats."], ["Sherry C.", "This is a popular restaurant on Bush River Road. The parking lot and restaurant were packed. We were seated immediately due to the fast service they offer. When we first arrived we got warm chips and great salsa. For dinner I had the Tres Amigo.... Beef Taco, Chicken Enchilada, and Beef Burrito. All were very good. The service was very fast and the waitress was very friendly and helpful. Drinks were refilled promptly. The register had some cool Mexican Candy by it. So tempting. Prices were good too. I'd come here again."], ["Ron V.", "Well, our last visit was so good my wife and I went back for lunch today to try out a couple of other items on the menu.  We got there at 12:40 and for a Saturday late lunch time the restaurant was doing a great business.  We were immediately seated in a small booth at the front window.  The chips were warm, the salsa was great.  I wanted something different and I really like Tortas,   I'd seen the Cubana Torta on the menu but it looked a little crazy for me (too much stuff, sort of like some of those Diners, Drive-in and Dive sandwiches that you can't eat because they're so large).  The menu says it has steak, ham, chorizo, fried egg, hot dog, and other ingredients.  So I wasn't going to order that.  So I asked the waitress what Torta she recommended.  She and another waitress both said the Cubana.  Well, I ordered it along with a draft Dos Equis beer. The beer came out in a frosted mug with a lime.  Excellent.  When they brought out the Torta I thought my wife was going to fall out of the booth!  It was huge and had ham, sliced hot dog and a fried egg hanging outside of the Borillo bun.  Along with that it had steak, chorizo, lettuce, beans, avocado, jalapeño, and cheese.  It was excellent.  My wife asked me how it was and I told her fabulous.  She said she wanted a bite (she would never order it, but wanted to taste it anyway).  She loved it.  I could only eat half of it and took the other home for tomorrow's lunch.  I highly recommend. My wife ordered the chicken fajita quesadilla and it also was excellent...and huge.  So far we have not had anything at this restaurant that was bad.  We will be back again!  Best Mexican food we've had in Columbia!"], ["Reese L.", "Best Mexican in Columbia!  Santa Fe chimichangas are my favorite, and the service is great too."], ["Kevin H.", "Fantastic service and food!! Got the chipotle chicken tacos and they were amazing. They had just enough of a kick/spice to them for me. Wish I lived here to go here more."], ["Becky T.", "To be honest I'm not sure why there are so many 5 star reviews for this place. Salsa is bland tasted like just blended tomatoes. Chorizo is very grisly. Chicken has zero seasoning not even salt. The bean chorizo queso dip is bland as well. Only thing decent is the verde sauce. Too bland for us won't be back."], ["Rachel L.", "This place lived up to it's ratings.  Wednesday lunch time was packed.  As other reviewers have commented, the chipotle chicken tacos did not disappoint.  The meat was tasty and the toppings were fresh.  Service was friendly and helpful.  I wish we lived closer!"], ["Sam C.", "I'd like to give this place 3.5 stars but it's not an option so it gets 3.  Maybe it was an off night but I have had better.  The place was packed and but the service was great.  The chips and salsa were very good.  Both the green sauce and the red sauce were very good.  There is heat in those bottles so be careful.  I had the El Pollo Loco and my bride had Tres Amigo.  She had no complaints which is why I wanted to give the 3.5 stars.  My chicken on the other hand was like rubber, it had been way over cooked.  I should have sent it back but the rest of the dish was good and I was hungry.We will give this another shot."], ["Molly H.", "Really good food! Excellent guacamole and queso. Always excellent service. Very fresh. Best Mexican in Columbia hands down."], ["Erin F.", "Read the reviews and had to go. The chips were hot and crispy and the salsa was perfect. I got the Cubana torts and my boyfriend got the California burrito. Both were amazing. Huge torta, full of juicy goodness. If we are ever back, thats where we will go!"], ["Robert R.", "stop that real on my way to myrtle beach south carolina. It's located very conveniently to I 20. Got my food to go. Chipotle chicken tacos which were excellent. The parking lot was packed. Was lucky to get a spot. Ran in and ordered my food. It was ready real fast.  would highly recommend you giving this place to try if you're in the area or just passing through."], ["Andy L.", "This place was amazing. I even started to lick my plate. Food was great ac was blasting. So I was super comfy. Eat here... Eat here now!"], ["Charles P.", "Get the special.  What is the special?  It doesn't matter.  You should order it because it will be amazing."], ["Derek C.", "Thank you.  Thank you for restoring my faith that I do not have to travel out of state to find a good taco.  For you southern folk, or anyone who is a lover of the swine,  I highly recommend the carnitas tacos.  5 street style tacos(meat, onion, cilantro, corn tortilla) filled with very well seasoned slow roasted pork were what I had been searching for since being in Columbia.  The chipotle chicken tacos were also good with the charred onions, but I still have to give the nod to the pork.  The only reason for not 5 stars is the check out process of having to weave your way around tables to go pay at the counter, but it's whatever.  Anyways, hasta la vista."], ["J D.", "Tacos so good!! Real deal. Can't ever go wrong with this place. Service was excellent and very attentive."], ["Joni A.", "Visited Real Mexico on Saturday night.  The carnitas tacos were the best.  So completely full of flavor.  Salsa was great.  I'm already craving it again."], ["Monica P.", "Amazing!  Best tasting Mexican food ever!!  It was truly a wonderful experience!"], ["Ashley H.", "I love Real Mexico. I've been on a binge lately. Anytime I frequent the place, whether it's a busy Friday night or lunchtime, it never takes more than a few minutes to get a table. This is especially great because the establishment is a bit small.Try the loco bean dip- the chorizo, fresh cilantro, tomato and onion topping is so delicious. It's hard to save room for the rest of the meal once it hits the table. My friend suggested to try soup anytime they had it and is an adventurous eater so I got a taste of his birria, (goat and chili stew) and it was on point! They gave him a generous portion of meat and the broth was flavorful and steaming hot. The lengua tacos are great too, served on corn tortilla shells with cilantro, lime and onion. My ultimate favorite though is their chillaquilles. Trust me on this one and get the  steak milanesa as your protein. it's a skirt steak lightly breaded and fried served with an egg (mine is over medium) and verde soaked tortillas, beans, sour cream and cheese. It's pretty ridiculous."], ["Rick T.", "Is this food authentic Mexican I don't know I'm not an expert, but in can tell you it's the best Mexican food I have had in quite some time. To start off it's all on what you order, we had people in our group that wanted tacos and rice the safe option of course. I asked for something the waitress would eat here, she recommended the chipotle grand quesadilla with a green tortilla so I said what the hell give it to me. The entree the waitress recommended was about 8.99 and worth every penny. I enjoyed the chips and salsa and all the food I sampled here. Service could be a bit quicker here but I'm glad the food was good. We had a great time here and will return even though two dudes were discussing their feelings and how they plan to win their women back rather loudly. Very weird but I guess when your eating on Bush River you will run into weirdos !"], ["Elizabeth L.", "Ate dinner there last night around 7.  Restaurant was crowded but we were seated immediately and the staff was friendly.  The homemade guacamole is delicious and worth the $5.99. We ordered shrimp tacos and barbacoa beef tacos -- fresh and delicious!  Real Margaritas were on point--not that disgusting sweet margarita mix that you often encounter. Relaxing, friendly vibe in a locally owned restaurant with fresh, authentic Mexican food. We'll be back."], ["King L.", "Chips and salsa alone are worth the 5 star rating:  they are highly addictive.  Great food across the board.  Also dog friendly patio."], ["John V.", "The Real Mexico sign makes you feel like it's going to be another of those not quite a regular mexican restaurant places. Semi authentic maybe... But no, this place is damned amazing. The food was great, the servers were friendly and mostly accurate (they seem to have confused Coke and Water at some point during my visit there). Good food for a good price, and with damned good quality to go with it."], ["Tammy T.", "This is Real Mexican food! It's very authentic and I've enjoyed everything I ordered. The servers are always pleasant and I've met the owner a few times. Very nice man! Great for families as the environment is very welcoming. Everyone I've recommended are now hooked. Go in and try for yourself. You won't regret it."], ["Nevin H.", "This place is awesome!!! As someone who has lived for an extended period of time in S. America and Mexico, this is by far the best Mexican food I've had in Columbia... Staff is super friendly and owner is as well.  Anything with the Chipotle chicken is fantastic and all reasonably priced!This is one of my go-to's... Have eaten here tons of times and  I am never disappointed."], ["Jack N.", "La comida aqui es muy autentico y muy rico tambien!This restaurant exists among a sea of options, but highly distinguishes itself as a local treasure for distinctly authentic Mexican fare and an ambience equal to most any worthwhile restaurant in Mexico.Do not let the crowds deter you, even if you have to get creative or walk a distance to park, it is worth the visit.Everything on the menu is delicious, so be bold and try something new!Los sopes son muy delicioso, como los sopes de mi ex-suegra."], ["Racquel U.", "Ok that was great!!   We almost didn't go in because of appearance...so glad we did!!  Only wish we lived here so we could eat here more!!   I have never written a review on yelp only used to find restaurants!!  But this place required one!!  I had the fish tacos sooo very good!!!  I want more!!  But headed home!"], ["Somer P.", "I have been consuming mexican food (read: texmex) since the age of 6 months old when my mother decided that I looked like I wanted some salsa so she gave it to me... Having said that I have searched my entire life for texmex that I could not live without... Sure, you've got monterrey's and casa linda, but nothing compares to Real Mexico. First of all their salsa is on point. Not too spicy, not un-spicy. Then the large cheese dip is exactly that: LARGE! I appreciate their abnormal amount of cheesy goodness in a bowl. And their margaritas are reasonably priced and don't taste like gross pre-made mix. I've never had a bad entree. Ever. Pick anything. You will be pleased.The staff is friendly, they remember our faces and we know their names and it's truly a \"third place\" experience for me. I appreciate you Real Mexico. Please never change!"], ["Michelle H.", "Good food...service a little on the slow side but they're always busy too.  Big servings."], ["Michael K.", "Real Mexico, real deal! My wife and I hit this place every time we come to her hometown of Columbia. I just can't get enough. Words can't describe this place, just go."], ["Erin T.", "Love everything I tried here except the fish tacos as the fish was overlooked. The elotes was yummy and the dips are awesome. Especially like cheese dip!!!!!"], ["Dhi G.", "Generous portions and the food is good.If your in Columbia and want authentic mexican food come to Real Mexican"], ["Christina H.", "Man this place was delicious. Don't be deceived by the decor or location, both of which scream average cheap Mexican microwave. Our family stopped here before a Sunday visit to the zoo (we are from out of town and selected the restaurant on proximity to Riverbanks and, of course, the reviews). The food was excellent - as others have recommended the chipotle chicken tacos were awesome. For vegetarians there is a good choice on the menu, grilled vegetable quesadilla. Prices were reasonable but note they do not take AmEx. We will absolutely return next time we need a casual meal in Columbia."], ["B M.", "Just passing through on the way home from the beach. Most authentic meal I've had since returning from Mexico. The shrimp tostadas are indescribably good and literally melt in your mouth thanks to the perfectly seasoned guacamole base."], ["Cherie R.", "This is one of my finances and my favorite places.  Great food and service.  We stumbled across this gem about 2 years ago and have dined in as well as gotten carry out several times, consistently we are very pleased with our experience.  Will definitely return again and again."], ["Allan W.", "Great food and a lot of it. You will not leave hungry. Every friend that I take there tells me it is the best Mexican food they have ever had.  The atmosphere is a little drab, but if they were in a fancier place, the prices would be much higher.  Great chips and salsa before the meal, too.  Try the Pollo Loco. Dynamite stuff, baby!"], ["Keegan C.", "Excellent Mexican food. I found Real Mexico by way of Yelp a few years ago and still visit at lesst once a month. The service is great, owners are very friendly and best of all the food is delicious. I even like the quirky interior."], ["Kevin F.", "The BEST authentic Mexican restaurant in Columbia.  Discovered on Yelp and highly recommended for my Yelp friends.  Most definitely 5 star quality food."], ["Stuart P.", "As many have said, the chipotle chicken tacos are delicious! The cheese dip is great! Don't get a large unless you plan on eating a lot of cheese! Horchata is delicious and free refills! Prices are good as well as the atmosphere."], ["Eric W.", "I guess I just don't get the hype. I've been to Real Mexico on at least three occasions now, and I've yet to be impressed. Real Mexico is routinely one of the most reviewed and highest reviewed restaurants in Columbia on Yelp, so I'm obviously in the minority on this, but I just really don't get it.I ordered the Chipotle Chicken Burrito, which was good, but if I'm honest I felt like I could get a better burrito at Moes or Chipotle. Yes it's different than the other local Mexican places in town, because most burritos are served smothered in a red sauce, etc. This was a burrito you pick up with your hands and eat - a real man's meal.Anyway, the food was pretty OK in my opinion. I feel like every time I come here that I must be ordering wrong, because everyone else is so blown away by this place. I won't name drop, but if you look at my check ins you can see that I've found another Mexican joint that I feel is much better.The air conditioning wasn't working much (if at all) when we came. It was so hot inside that we had to leave earlier than desired. The server was unattentive.Overall, I do like that they have a different menu by comparison of other similar places, but I don't feel it's amazing by any means."], ["Mike S.", "I could be an expert witness in Federal court regarding Mexican food. I'm amazed that when I travel just how lousy Mexican food could be. This place was on par with many of my few favorites just North of the border here in sunny Southern California.Try the seafood platter, you will think you are in Baja!"], ["Jonathan W.", "Darn good mexican, authentic and gringo choices. Tres burritos was great, cheese dip great, margarita cheap, salsa a little too sweet with not enough bite for me, but still good, service good. Soccer on TV."], ["K N.", "Loved it! I got shrimp tostadas with lettuce added. It was the perfect girl's night retreat away from my new baby. Loved the chips, quest, and salsa too. It was a little pricey, but in my opinion well worth the price! No wait either!"], ["Sean B.", "Great food every time. Love the Tortas, Chimichanga and the fajita burrito."], ["Justin S.", "The best Mexican food in columbia, i have eaten at all of them several times over the past 10 years. Most authentic and a definite bargain."], ["Brandy B.", "It didn't knock our socks off as I was expecting/hoping.We got a small order of queso dip to start and the chipotle chicken tacos and steak chimichanga as entrees.The queso was delicious, it tasted like the queso you'd get at San Jose's, Monterrey's, or Casa Linda - so I was happy (my bf was turned off by the fact that I ordered the queso, our waitress obliged, went around the corner and was back with the dip in less than ~20secs), I'm assuming they have it waiting in a crock pot or something since it's such a popular app... I really didn't like the steak inside the chimichanga - it was rubbery, hard to cut, and had a funny taste... I took 5 bites or so, trying to make myself like it (dumping queso, and salsa on it) but it just wasn't gonna happen.I thought the chipotle chicken tacos were great, especially with queso on them!Queso usually makes most things taste better (just not my chimichanga)."], ["Lauren F.", "The most authentic Mexican food in the columbia area! Do not let the look of the place (it is a dive) scare you off.. the best mexican food ive found yet! Traditional/authentic mexican flavors, huge margarita menu, and prices are soo inexpensive. GET THE TACOS"], ["Coye J.", "We plan our weekend around when we can eat lunch here! It's amazing! Get here early! Love the Aguachiles( which is not on the menu) the al pastor tacos are amazing also."], ["Shirl M.", "Very good authentic Mexican food.  The parking lot is always packed."], ["Jason R.", "Pulled off the highway as we were passing through and was very satisfied with this restaurant. Parking lot was full but that's a good sign in my book. Food was very tasty and economical. Service was prompt, courteous, and friendly."], ["Jennifer A.", "My kids were not happy until the food came and my picky eater went from boy, I wish we were at Applebee's to this is the best food yet!!  Excellent!"], ["Alisa J.", "The food was excellent. Very tasty and fresh. Service was adequate. I can't wait to return here! The place was packed, but they seated us pretty quickly."], ["Ted K.", "Bottom line: this place is awesome! Upon first impression, this seems to be a little hole in the wall restaurant. It seems to be a little grungy, and the name doesn't help that impression. However, upon seeing how many good reviews there were I gave it a try. It's absolutely delicious! The food is amazing here, and the amount of food for the price is great too. Parking is a little bit of a hassle, as it's a small parking lot and the place is packed. The service was very fast. I got the Parrillada, it seemed a little expensive, but turned out to be absolutely delicious and plenty of food, well worth the price. I also got the top-shelf margarita, the price was great and it was pretty big. For sure, come here!"], ["Lisa E.", "We were traveling from Charleston to Nashville and craved food near Columbia.  Yelp reviews steered us to Real Mexico.  Like others say, it doesn't look like anything special from the outside and it delivered on food and service ... enough that we will likely come back on future trips that warrant a stop near Columbia.  The salsa and chips hit the spot and the Chipotle chicken tacos were very good.  We also enjoyed the grilled corn and zucchini quesadilla. It is a different take on vegetarian and was really good.  The one area that needs improvement is the margarita.  The mix versions can only do so much.  We hope to be back in the near future."], ["Ramon S.", "Finally! A Mexican restaurant I enjoy eating at. Being Hispanic myself, I have been mostly disappointed with my Mexican restaurant experiences because of the american'ised dishes that are often heavy and bland. But here, everything was delicious, even the chips and salsa. I ordered the maltajete which is a stone bowl filed with sizzling beef, chicken veggies and CACTUS! How cool is that? I plan to come again to sample more dishes in the near future. The Margheritas are from a mix so don't expect much but they are served in large glasses and only cost $5. After a couple they start to taste better anyways ;)"], ["Taylor S.", "When we pulled up to this restaurant I thought it was a joke haha.  The outside was kind of corny and the sign was missing a letter or two...but OH MY GOSH the food was SOOOOOOO GOOD.  The chips were nice and hot and we each got our very own salsa (yayy double dipping).  The prices were very low for what you got, and the food was excellent.  The rice, the beans, the tacos, mmm! This is a must go to!"], ["Jessica M.", "Every day driving by this restaurant and we never gave it a try until tonight. I'm disappointed that I wasted so much time away from this restaurant! The food is great and there's no American twist from what I can tell. I had the chimichanga and it was wonderful. The only bad thing is there wasn't a happy hour but that's probably best ha! This is definitely our new and forever Mexican restaurant! Nom nom"], ["Jordan H.", "Dive Mexican food at its finest.  Did take out and it was amazing."], ["Lars D.", "Excellent food and service.  The lackluster ambience actually adds to the experience of the place somehow."], ["L. W.", "All I can say is Wow.  I went in with high expectations from reviews here,  and those expectations were met!Don't let the location fool you,  this is the real deal.  Parking is tight so plan ahead of you're coming over at lunch or dinner.I ordered one of each of the tacos available on the menu.  My favorites:  Starting with Pastor, marinated and seasoned just right with a little kick and fresh pineapple.  These were some of the best pastor tacos I've ever had east or west coast.  Chipotle Chicken stepped it up a notch in heat with only a hint of chipotle not overpowering & plenty of roasted chicken & lime flavor left to enjoy.My Wife enjoyed the Chimichanga.  I grabbed a bite of the wheat chicken chimi,  filled with corn, black beans and all the right stuff.  A great southwestern flavor.  Well cooked perhaps flash fried,  no hint of grease.Salsas were excellent across the board.Excellent service, accepts most major credit cards,  supports gringos with staff that speak English perfectly & plenty of Iced Tea available to drink along with a full bar and beers available,  and .. Major credit cards accepted.Short summary five stars well earned I will be back!"], ["Maurice E.", "Not sure the hype on this place and this is the first time yelp has sent me to a place after researching that led to a bad meal. Not real Mexican food. Dumb southern gringo texmex."], ["Erin A.", "Best Mexican food in Columbia. Hands down, best al pastor tacos. The only problem with this place is the tiny parking lot. If you can get a spot, you will love your experience."], ["Anthony R.", "Oh boy was this good! My wife and I stopped here as we traveled and in a way I regret it. I want to go back soon but it is not likely to be on my way often. If you live nearby you are fortunate indeed! My wife and I agree that we would stop in at least once a week!"], ["Taylor H.", "I always get something different here; it's all good. The last time I got fajita enchiladas. I would definitely recommend them!"]], "Eric's San Jose Mexican Restaurant": [["Brad T.", "We come here at least once a week and love it. Friendly atmosphere and all the waiters/waitresses say hello to the kiddo"], ["K P.", "Today's service was lacking and our guacamole was brown and the lemon that came with my tea was brown and gross. I won't be going back there."], ["Matt H.", "Been here about 10 times. My daughter went to school with the owner's son for a couple years. Today's visit was great. Had a young lady who was as nice as could be. Helped make a special meal to combat my daughter's special dietary needs. If you're really thirsty for a margarita and don't have anyone to split a pitcher with... Just get the large. Trust me. You could wear it as a hat when you're finished. My waitress' name was Patricia. Be sure to ask for her."], ["Nat C.", "It has been a few years since I'd been to Eric's and I was sorely disappointed. Quality was not what I remembered and the service was very slow. I hope it was just an off day."], ["Loretta J.", "Really standard Mexican-style slop. The restaurant is dated and the floors are greasy-slippery. This is why I wear boat shoes. The chips and salsa were the best part. Lots of cilantro in the salsa and the chips were fresh fried. The waitress steered me away from the chili rellieno. But they are pretty standard, right? No this was an accident on a plate. Next time, I will listen."], ["Emily E.", "Pretty standard Mexican.  No complaints. Fast seating with food coming out fast and hot.  Can't beat the free chips and salsa.  Location seems a little run down, but there is plenty of parking."], ["Grace V.", "Gross. My menu had salsa another customer had spilled all over it. The waitress wiped it off with a dry napkin in front of me. Flies everywhere. Salsa tastes like spicey onions. Terrible."], ["Nick C.", "I've been coming here all my life and after tonight's visit it will be a while before I return. Our service was awful. The food used to be a lot better. Their was the worlds smaller pepper in my chili rellano and when we went to check out I told the girl to split the checks and instead just charged everything on my card and couldn't speak a bit of English or understand what she had done. The only reason I'm giving them 2 stars is because how nice the owner is when he is around. Very disappointed."], ["Michael M.", "Meh xican food. Unfortunately, most Mexican restaurants in Columbia are rather bland Americanized semi flavorless places and this one is no different.The duct taped booths and dark dank atmosphere shouldn't turn you away, but there forgettable food just might. I've tried their chimichanga, tacos, burritos, and chili rellanos and I wouldn't say I was impressed with any of them. Certainly nothing to write home about.I've certainly had worse but at the same time you may as well just go to Taco Bell and save yourself a couple of bucks in a few minutes. That would be just as authentic as this overrated place.In any other town, I'd probably give it two stars, but I am grading on a curve."], ["Eli A.", "So yes it's called Eric San Jose...big deal...a white/black guy name but who cares...food is delicious and yes this is coming from a Hispanic with a Mexican wife...and she approves of this food....Food: taste fresh and great portions no complains hereFacility: clean well kept and very Mexico!!!Employees: great!!! very well spoken and bilingual...Overall: great place great food great people...Stop by and enjoy the place!!!! Viva Mexico!!!!"], ["Samantha A.", "We frequent Eric's. It's close to home, fairly economical, the service is GREAT, the atmosphere is fun, and the food is fabulous. I always get a medium Texas margarita (made with cuervo gold and grand Marnier, as a margarita should be). I always order a fajita salad, or Eric's Burritos, or Carne Asada. My boyfriend loves to get a big Pacifico or Dos Equis. He's a big fan of the La Favorita Steak, Pollo Fundido, and chicken tacos. Ask for some of the homemade hot salsa. The service is always amazing, and we will always be huge fans of Eric and his staff. Great place."], ["KT E.", "I once enjoyed the quick, inexpensive, basic Mexican combo meals, but after this last trip I cannot go here anymore. The floors are slick with grease, there is visible food debris on the kitchen floor and the window sill next to my booth had visible rodent droppings. I should have left but stayed with the kids for a meal that wasn't great. What's a Mama to do when she just wants an enchilada? Wish we had gone to Moe's, Chipotle or Cantina 76."], ["Rachel O.", "Quick, fast and pretty yummy Mexican food! I've been to this location several times and have never had to wait for a table.  The restaurant is older and some of the booths are worn, ripped etc.  Free chips, salsa and water hit the table almost as soon as you do.  I always ask for mild salsa and they bring a small boat of it over. It's super tasty.My favorite things to get are the chicken nachos (you can also order a half order for super cheap) or the chicken chimmichunga. You can substitute side items (I get the rice instead of beans) which I like too. It's good, solid mexican food for pretty cheap."], ["Simon T.", "Eric? Mexican?About as authentic asthe name would imply."], ["Jacey L.", "With having so many other Mexican options in Columbia, don't waste your time here. They have a very limited menu. What Mexican restaurant doesn't have chorizo?? My friend and I both ordered the Mexican burrito plate, and it comes with one beef and one chicken. I ordered mine as both chicken, and they made our order the same way, both chicken! Poor guy missed out on his beef burrito!! Just a waste of time."], ["Laurin N.", "Lots of space and food was good. Celebrated cinco de mayo there. We had a great time. Wish they would have played music."], ["Darome B.", "Quesadilla was drippy bit but margaritas were  I'm torn on this place.They brought out dirty glasses but I told them take back"], ["Howard K.", "I've been here many times since moving to Columbia in 2008 and it's always been a good experience.  There's generally no chit-chat from the staff--they just take your order and your food will almost always come out quickly. They have unlimited chips & salsa, which are really tasty and honestly half the reason to come here.Their food is really straight forward.  It's not exotic or mind-blowing....just spicy, cheesy, greasy, tasty Mexican food.  It's not expensive and it is pretty child friendly.  I gave it four stars instead of five because it's a dated restaurant and not the cleanest.  I've only had one or two instances where the waiter was slow, but it can be frustrating when you can't find find your waiter nor get the attention of other waiters to help you out.  I recommend getting a margarita, Eric's Burritos (two big chicken burritos covered in white cheese sauce, and when they bring chips to your table, order a side of queso sauce (it's a bowl of cheesy heaven)."], ["Mike K.", "About as authentic as a schnitzel in a deli. Awful margarita, tiny shrimp in fajitas, mediocre chips and salsa, rib eye asada that had little flavor and was thin sliced (okay maybe that was sliced authentically). Lots of cars outside got me in once but never again. Not worth the low cost of entry."], ["Caroline M.", "The service was awful. Our server only brought us our drinks. We never saw her after. Somebody brought our food and then another brought the check after we sat there waiting for 20 minutes to say we needed the check. The food is better than the service that's for sure."], ["Jarek F.", "Great place for groups!!! I am here in Columbia for my brother graduation at Fort Jackson and he graduated today. We all decided we would like to try Mexican and this place was recommended by a local. The place was really close to out hotel (best western at fort Jackson). I am a big fan of Mexican places because I like nachos. I don't eat red meat so decided to get chicken nachos. first off the chicken was rubbery and no flavor. the beans, sour creme; and cheese was all mixed together like a soup. I also got a house Margarita which was good and strong. only reason I am giving it a strong 3. I will also say great place for groups because we were a fairly large group.over all food was okay but service was great and the drinks."], ["Miranda G.", "Pretty average Mexican food. We did get a lot of it for our money though, which was nice. However, when we went to pay, the woman behind the counter ignored us - eventually someone else came over to help, though he was on the phone the whole time and didn't talk to us. All in all, the quantity and quality or the food was pretty good, but the service was lacking a little."], ["Grace M.", "Yummy Mexican food and the service is pretty good. I'm only giving it four stars, because its better than most Mexican places downtown. Like every other Mexican establishment, I always get the chicken and cheese quesadilla with a side of rice. I'm a pretty picky eater."], ["Macy M.", "Food was awful. Smothered my quesidilla in what tasted like American kraft singles. They claim that was the only cheese they had. (In a Mexican restaurant. . -_-) steak was weird and chewy.  Server was inattentive."], ["Carl R.", "If you have. 30min lunch break, they can serve your food almost instantly. That's why I like this place. The owner is nice too. However, food became mediocre a few years ago, but has been getting better. I honestly believe they switched suppliers because there was a big difference in taste. The sliced tomatoes for example were no longer juicy fresh. They became tasteless, and appeared to be previously frozen. The unlimited chips and salsa still tastes good to me. As I said, it has gotten better since a few years ago. They have remodeled some too. I have to agree with the other reviews though regarding the margaritas being too sweet. They are! They may seem pricey, but the serving size is huge! Its like drinking from a fishbowl. I recommend getting the pitcher for $20. It can go a lot farther. Of all San Jose restaurants in SC. I'd have to say this one is the best location."], ["Jaymie M.", "I'll admit to being skeptical even before I set foot in the door. It's a Mexican place named 'Eric's', afterall. But I was driving by, it was lunch time, I was hungry...Unfortunately, it turned out my suspicions were accurate. The chips weren't fresh, sure they were warm, but that's about all. The salsa hit on one of my pet peeves as it was very, very mild and hard to distinguish from poor quality marinara. Yea, they're free with your meal, but so what?I ordered 3 tacos asada(steak tacos) with a bowl of hotter salsa on the side. I was speaking to the waiter in Spanish, and he asked me what I wanted on my tacos. I said, 'con todo los cosas tipicas'...he continued to ask me repeatedly if I wanted 'cilantro', 'cebolla', etc. Yes, I know, white people speaking Spanish are suspect, but I swear I know what comes on a taco in most places.After a while my plate finally came out, I guess it was getting towards post-lunch and the kitchen was slowing down. But the meat wasn't very tender, more on the chewy side with bits of fat and gristle in it. The saving graces were the many slices of lime on the side and tomatillo sauce. While they weren't the worst tacos I've ever had, I can honestly say I'd have preferred taco bell.There's got to be better Mexican or Hispanic eats somewhere in Cola, right??"], ["Nancy B.", "Wait staff was nice but food was bland and boring.  Not sure I would recommend this to anyone I knew."], ["Mark O.", "So traveling through this garden spot when we spy Eric's San Jose (hint one we should have moved along). Quickly read about it on the Yelp app and thought it might be ok, reviews were all over the board. So we stop in, order some cheese dip (not to bad...standard white cheese though bland flavoring) and a fajitas for two (beef and shrimp). The food did come out fast, though with fajitas I would prefer they come out grilled and tasty. The meat looked more boiled then grilled and the onions and peppers taste like stew. Like the cheese dip, both meats were bland in flavor. Overall it wasnt the worst experience in Mexican food we ever had.....but doesnt even rank in the top 100. Definitely wouldn't go back."], ["Mike M.", "This was the Mexican restaurant that I grew up going to. So I hat to have to give them a terrible rating. They have just gone down hill. The last time me and my family went my wife ordered a taco salad which is what she always got there. This time though the beef tasted like rotting fish. And it wasn't just her salad, my sons taco also tasted like fish. And the service has gone downhill as well. It took 15 minutes for them to take our drink order and after we got our drinks they didn't come for our food order for another twenty minutes. Then the food came out too fast which I guess should have been a sign that it was not going to sit well."], ["Lee F.", "Food is good. But I haven't seen service this bad in a while. We had to find the server and then he chastised us when he didn't hear our order correctly. I live around the corner but I won't be back for a long while."], ["May C.", "It is true what the other reviewers have said about this place. The serving staff are very friendly. Which is great! But you can't satisfy your appetite with friendly smiles, and good service.The food was at best mediocre. The beans and rice, items that are very hard to get wrong did not have any flavor. And the meal itself lacked taste. The chips were okay, and the salsa was obviously not fresh.A large margarita which is way to sweet costs 10.00. The flan also seems out of a frozen container ... I've had better Jello flan.It was very disappointing."], ["Kara B.", "Rubberband in my salsa... and then once the manager came over, he put the rubberband on his wrist and played with it. Ick ick ickkkkk.Not very clean but margaritas are good."], ["Bob K.", "Pretty much a typical \"American\" style Mexican restaurant - that is, you will find the usual offerings (tacos, fajitas, chips & salsa, nachos, etc.)  You will not find the more authentic dishes as typical in Mexico (think of the great moles, ceviches, stews, etc.)  In fact, I think the menu was pretty small and limited.   Seeing very little that caught our eye, we just sampled the supreme nachos - and they were just a meh... Nothing to write home about!  They are pretty quick with chips and salsa and seem to have a reasonable selection of cold beers.  The small margarita is small - really small - so you may be better served getting a larger size.  The place always seems to have a large crowd, although it tends to skew to the young adult age bracket.  There are better Mexican restaurants to be had in Columbia."], ["Todd B.", "All three people I went to dinner with here agreed the food is of poor quality and way too salty to include the canned salsa. There is no excuse for canned and salty chicken!  The portions are huge, but I'd like to see a lot more quality and less quantity with maybe some fresh vegetables for flavor without salt.  It's seriously some of the worst Mexican food I've ever had.The drinks are cheap and the wait staff and management do a great job which is why this restaurant gets 2 stars."], ["Michael V.", "Consistently good food, but fairly indistinguishable from a half dozen other Mexican restaurants in town. What keeps us coming back is the outstanding friendly neighborhood staff. They are nice, helpful, fun, and great with kids. We always have a great experience there. The best food on the menu is the flautas, and the worst is the chile relleno, which has a postage stamp size piece of poblano under it instead of the whole pepper you can get some other places."], ["Adriana K.", "Mediocre food.. Service was ok. We caught them after the lunch rush so they were partially empty. Food was warm.. Not too fresh. Don't think I'll be back."], ["Jason N.", "All-in-All, this is a good restaurant if you are looking for well cooked food for a decent price. I've noticed a trend in \"Mexican food\" here around the Columbia / Sumter / Florence areas... I think its a regional thing because having been to mexico on more than one occasion, the food in southern mexico tends to be different than northern mexico and the food around here feels northern all the way. That Said, Eric's cooks and his menu do a good job with the preperation of the food. If you had to look at the cross section of a mexican restaurant and decide... what makes it good over bad... besides the general cleanliness, menu, dining room concept, service, and staff... and IMO... are the basics of rice and frijoles preperation, sauces, and tortillas... On these points alone, Erics falls just a bit short in Tortillas and Rice, as these items just didnt feel like they were homemade in the least. the Tortillas definately had a out of the bag feel.. and the rice was dry and fairly bland... the beans were ok... but I think they could use some more love from seasoning and depth of flavor.. and less of that canned taste... realizing that hig volume foods make it more difficult to prepare these kind of things.. and keep them cheap.. plus you have to consider where the restauant is located in the grand scheme of things ecomonically... I get some of that to a point.. that it can't always be helped.. but I believe you CAN enhance flavors regardless of what container they come out of.. now, the good points, the rest of the food was seasoned well and came out fast.. temperatures were good and the chips and salsa with Quesso was also not bad. The Service was good and the waiters were always walking around and checking to see the levels of drinks and food was without always asking if you were doing ok... there is a subtle art to doing that well. overall I would reccommend going here for the lunch specials... some of the drink specials and dinner menu... I would just temper that with some of the things I highlighted below... and a bit of a dated dining room concept which I think could use some modernization... this is a good place and I think for the money most everyone with a normal palet for lightly seasoned northern mexican food will be happy."], ["Stacy C.", "The owner was very nice! The food was some of the best Mexican we have had in Cola! Can't wait to go back! :}"], ["Marty S.", "Not calienteIt's no Little MexicoArriba to door-M.S."], ["Crystal C.", "The San Jose restaurants have a great deal of recognition in Columbia, so it was with great anticipation that I tried Eric's San Jose on Garner's Ferry Road. For me, I felt the whole experience to be wanting for a few different reasons.A south-of the-border motif set the tempo positively, and this particular San Jose offers outdoor seating for patrons who wish to enjoy the milder temperatures. I am somewhat discerning when it comes to Mexican food, so my apprehension began when I received my chips and salsa(....)Read the rest of the review here: examiner.com/restaurant-…"], ["suzanne v.", "Wasn't impressed with really anything, and I was hoping the good reviews were right.Yes, you get chips and salsa; it's a Mexican restaurant. They were good.Yes, the margarita is as big as your head; but they use waaaayyyy too much pre made margarita mix, I actually got a stomach ache from it. Gross!I had chicken mole; the vegetables were way overcooked and the chicken was dry.My server was MIA most of the evening; empty water glass and waiting 15 minutes for the check. Will not go back!"], ["TheHungryDad Jeff C.", "Good salsa. Ok chips"], ["Phillip S.", "Want to get ur mex food on and quickly well this is ur place I believe it's pretty legit I'm down with their hot sauce and regular crunchy tacos"], ["Paul B.", "Friendly Atmosphere!My wife and I took advantage of the recent Groupon Coupon For this place- (it work well, with out a hitch!) The restaurant is truly a friendly place to get a bite to eat- it's fairly busy with people in and out, but not overly busy on this Saturday for lunch. An eclectic bunch of people here- if you like to people watch it's a nice place to be. It's nice and clean with plenty of wait staff..The mistake I made was to order something out of the norm- I ordered chicken mole with rice and beans, and a side of chicken soup- I like to be adventurous with the menu choices- try to mix it up a little here and there...I don't think this is the place to try that~ However, If they have it on the menu, they should try to do it well??  Oh-well I'll still rack it up to being my poor choice.The mole sauce taste like it was out of a can, kind of like flavorless brown gravy. The chicken soup was equally as flavorless- taste like they put some water in a bowl with some chunks of chicken, a few slices of squash and avocado, and a scoop of rice-- eh, me thinks it was el-blando!My wife, on the other hand, ordered \"the good stuff\" tacos el-carbon with rice and beans. Nice and flavorful carne asada... Oh-well, next time get the ole Chimichanga with a nice cold Corona and limeI will go again- It is a nice little Mexican restaurant, nothing too special but nothing too bad either."], ["Jason R.", "Owner is a friend of mine* Food is pretty good and served really fast. Get a giant margarita, that's what they are known for. There always seems to be a million servers working and most of them with some level of a language barrier. If you have a coupon, read the fine print because they aren't budging on the restrictions. The dining room is in need of a little updating. This place does get packed for sure. Hopefully they will be around for a while."], ["Marcio G.", "I have been coming here for 15 years. I have never had a bad plate. Even my parents, whom live out of town, request to come here. It's fresh, fast, and not expensive at all!"], ["Crystal C.", "It really does not stand out as any different than a lot of the Mexican chains in this state. Bland, lackluster, the service was good and they try hard to get it done. I just.... its like the same old thing I have had at several others, and no I try to order something different constantly. I wish it felt a little more authentic, had some kick to the food... something"], ["Katie R.", "My favorite Mexican in Columbia! Super fast service and the best queso I've ever had. They will refill your chips/salsa for free, and I've filled myself up entirely on those alone. It's usually got a good crowd, but I've never had to wait more than a few minutes to get a table and typically it's immediate seating. Ask to see if Eric himself is in the house!"], ["Sam V.", "Somehow I always feel nervous about eating here. Even before their rating went down to a B and then back to an A, I had a strange feeling about patronizing Eric's SJ. HOWEVER, I do eat here and I do find it tasty. The place is large and the service is fast."], ["Benjamin S.", "Nice atmosphere and good service.However, it's pretty expensive for very mediocre Mexican food.  Most entrees are close to $10 and many are not especially noteworthy.  The food isn't bad, but it is over priced."], ["Tina D.", "Hate going to Mexican resturants cause I always have bad luck. Decided to try this place since it was voted #1.  Well my husband and two year old sat down and started on our chips and salsa. My two yr old wouldn't eat for some reason. I am 8 month pregnant and feeling uneasy. I look up to see a roach crawling on the wall. I lost my appitite. My two yr old saw it and yelled out \"eww a bug\"! Ppl all around us kept eating. As the waitress comes over ask if everything is okay and we showed  her the roach and she tried to grab it and it jumps on to the table behind us. Gross!!! The manager came over and said sorry, but didn't offer to give us our food for free even tho I wouldn't eat mine anyways. I was pregnant and didn't want food positioning. The floors were sticky and the bathroom was gross. I can't believe ppl voted this place #1 ppl here in SC must love extra meat on there food. Nasty!!!"], ["Renee M.", "San Jose is close to where I live and my daughter loves their cheese quesadillas, but it's hard to mess those up. I've always had good service but the food can be hit and miss. I've had awesome food here and I've had terrible food. To me, good queso and salsa is a must and unfortunately theirs varies by visit."], ["Earl S.", "I ordered the steak ranchero, which was not bad, but I was on the toilet about 1 hour after eating there ,with the runs. No joke"], ["Lindsey B.", "I eat here 16 times a year, probably, and I like the low prices and the salsa and chips.  I get a salad -- huge and pretty good.  And chile relano .. it is not gourmet, but it is hot and good.  I also like the atmosphere and parking.  They have fast and good table service, wait staff are efficient.  The out door patio is covered, sometimes live music, and is excellent for casual birthday parties and such.  Owner takes personal interest in running the place correctly."], ["Emilio A.", "AAAAAAARIIIIBBBBBAAAA!!!!! Speedy Gonzales is what I have to say about the San Jose's on Garner's Ferry! The speed at which they bring out the food from the time that you order is telling truth of the Mexican work ethic. Not only is the food out fast, but it comes out hot and fresh! I don't know if the great salsa and the chips is what preoccupies you and makes it seem faster, but that can't be because I can barely finish a basket before the food is out. I particularly like to mix my salsa with tapatio hot sauce it adds flavor to an already bold salsa! I also was able to enjoy a fish bowl of a frozen margarita! I was able to drink that for the whole meal. I enjoyed the shrimp and steak fajitas! They were exceptional and were very filling to the point that I had to take a good amount of it home. That is something to say when you're drinking a margarita as big as what I had! If you enjoy fast, excellent service I would recommend San Jose's on Garners Ferry 10 out of 10 times! They always seek to satisfy their customers the first time around. They are willing to put forth the extra effort to make sure that you will come back to visit them more!"], ["Reggie R.", "Good meal! Chips were tasty, not greasy. Tacos good. Rice and beams very good. Service friendly & attentive. Would eat here again."]], "Hola Mexico": [["Alex R.", "Fast service from the moment we walked in the door on a Saturday afternoon. Dos Equis on tap, which was nice and cold and properly served with a lime wedge. Salsa has a nice heat if that's your thing. I enjoyed it. I had a taco and two enchiladas, both had plenty of meat (I was pleasantly surprised). My wife had the shrimp quesadilla, which was loaded with shrimp, again pleasantly surprised. This is now my go to spot for Mexican in Northeast Columbia. Nothing bad to say."], ["K P.", "Consistent, fast service. Large portions. My favorite is the chimichanga! Hands down THE BEST, freshest salsa and chips around."], ["Brandy B.", "I've been twice - once for take-out, once for dine in.I knew a couple ppl that were ranting and raving about how good the place was (typical southern Mexican) so I thought I'd give it a try... wasn't anything to write home about (can't recall what I ordered besides queso), and as Rachel stated... the queso is runny!  I could eat queso with a spoon, that's how much I love it... lol... If the queso doesn't coat my chip within one to two dips... no bueno!!! I dragged my bf here to dine in a year later, hoping maybe things had changed... unfortunately not.  -it smelled like sewage in the place, and the closer you got to the bathrooms the stronger the smell, then to try to remedy the it, they had the door open and flies started to congregate at our table (not good for the appetite).-queso was runny still (not sure what their recipe is, the queso consistency/flavor is usually the same at these places).Service is decent though."], ["Emily E.", "Nothing I'd really come back for, but no complaints.  The burritos had copious amounts of queso and tender chicken.  The salsa was a little spicy for my taste (and I usually like it hot!).  They had a lot of people and seemingly not enough servers, but they were doing the best they could."], ["Kenneth C.", "Interior decor is simple, basic and no frills.  Staff are down to earth, know their menu and helpful.  Good food.   We had the three bean burritos, chicken quesadillas, delicious chicken soup served with avocados and chicken wings for the kids.  A must try."], ["Eric W.", "Stopped in here on a Sunday afternoon for lunch. Meh. Salsa was a little too spicy and very peppery tasting. Didn't taste very salsa-y. The menu is your standard chain tex-mex variety. Nothing at all special on the menu that I could see. The food itself wasn't bad, just nothing to brag about. Definitely not in the running for best Mexican spot in Columbia (or even on Two Notch Rd)."], ["Olimpia E.", "If you were raised with authentic Mexican food then you would know the deference but if not then yeah you can try it I personally would not go back"], ["Chris S.", "Great place to eat. I come back every time I'm in town. I usually get the #1 on the combinations. Chips and salsa are excellent.   Staff is very pleasant. The cheese sauce is good too. They have fried Ice cream for dessert that we love to get."], ["Rick T.", "Food is getting a tad better and I heard someone say they are making their own beer concoctions which is cool, but get back to the roots of cooking your own native food or least put it on the menu for people who want real Mexican food."], ["Christi R.", "The food was good until a giant cockroach fell from the ceiling on us! Sorry but we won't be back!"], ["Jason D.", "The fact that this place has a score of four stars makes me really question the validity of Yelp users in Columbia, SC. This is quite possibly the worst attempt at Mexican food I've ever seen, and I lived in South Korea for three years, so I've seen some poor efforts. The food lacked flavor. There was seemingly no seasoning on the beef or chicken. The burritos were an epic failure. Also ordered the chile rellanos- a go to dish for me. Tasted like the cake right out of a can, got some (ok, a ton) enchilada sauce dumped on them and brought to the table. I read another review that said you'd be better off at Taco Bell.i couldn't agree more and I actually uttered those words mid meal. Adios Mexico."], ["Aja H.", "Nothing special to me. Just your typical Tex-Mex restaurant. I had the shrimp tacos which was really good. My nephew had the two burritos. He didn't like them that much because they tasted like they had American cheese on it. My sister had fish tacos and she said there were not seasoned at all. In fact she had to put salt on them. The service was really fast and the staff is friendly. The reason why I am giving them 3 stars is because you only get one free refill. This didn't bother me, but being here with children and having only one free refill is hard."], ["Mona D.", "I stopped by on a Saturday just because I was nearby. Ordered the special combo with 4 taquitos (2 chicken/2 beef) which comes with guacamole, lettuce, refried beans, sour cream and Mexican cheese over the top. Enough food for two! And delicious! Very flavorful without being spicy hot. The atmosphere is very casual, and service is just ok. But my food came out in record time piping hot.  I'll stop back when I'm in the area."], ["Leo C.", "I don't care for decor but I do care about food. Love this place. It has more flavor than the other local Mexican restaurants."], ["Nat C.", "This place is SO good!  You cannot beat the price, either.  While it's all good and very easy to hurt yourself with the massive portions, I'd recommend chowing down on the hot, fresh chips with queso and guac, then order the regular beef tacos, soft tortilla, with the fresh cilantro.   Just do it, you'll love it, you'll eat like 20 and have a happy tummy."], ["David C.", "Good but not great. Friendly staff. Good chips and hot salsa which can tone down if ask for mild sauce. All food enjoyable but nothing outstanding."], ["Steve H.", "Food was good.  A little spicier than I am used to but still great,  Services was great.  Really enjoyed it."], ["Mary B.", "I want to say many good things about Hola Mexico. I really do. I've been a few times and the food is good, although a little pricey for what it is. The chicken quesadillas are good. The salsa needs some work. The customer service needs even more work. That is the main reason I gave them two stars. Every time I have been there the service has been extremely slow even if they were not busy. Two friends and I went for lunch on Cinco de Mayo. I knew it was going to be busy but we were not even acknowledged when we entered the restaurant. We stood at the front waiting to be seated. Nothing. We eventually went to sit at the bar where we got no service. After sitting there for about ten minutes we left."], ["Pattie P.", "I have been here a couple times.   The service is not exceptional.  The margarita's are not good, they are filled with the syrup and hardly any liquor.  I could not finish the whole drink because it was too syrupy and sweet.   The food is average.  The salsa is good and spicy....  Their prices are a little high for their items but the food is average."], ["Brian M.", "Food is fresh and good.. Prices are slightly above what you expect , but the food will not disappoint..margaritas are not the greatest, but dos Equis works just fine"], ["David O.", "This is one of the best Mexican restaurants around. Very authentic style dishes. My favorite is the chimichanga. We absolutely love this place. They make their own salsa fresh each day and it is SO good!! Service is always fast!"], ["Jeri L.", "Found this place on Yelp while traveling west on I26 in SC.  Service was good and fast. The chips were hot salsa was good guacamole was homemade. I had the enchiladas they were great my husband had a taco and chile rellleno he enjoyed them as well and all was on the lunch special list! Half a mile off of the highway you couldn't beat it for the price!!"], ["Mande B.", "Salsa is tasty! This is an order by number kind of mexican joint - everything you'd expect."], ["Kara T.", "Best we have had since moving to Columbia!"], ["Chris H.", "This place has outstanding food at inexpensive prices!  We're Mexican fans and happened upon this place by chance. (We're visiting from Massachusetts.). Service was friendly, quick and efficient. The general decor was nothing to write home about, but, after all, we went for the food. We highly recommend!"], ["Jennifer R.", "Nothing outstanding or special - if you're looking for unique, go elsewhere.  If you're looking for some solid Mexican food, where you like what you know and you know what you're getting, then this is a great spot!"], ["Kay E.", "This is my go-to for Mexican around here. It's just some simple, delicious, a bit above  average Mexican food. Nothing too fancy. The food is fresh and comes out very fast.The service is \"ehh\"..I give it 2 stars. I agree with everyone on the Margaritas, too much mix... I would absolutely recommend this place. There is so much more I would love to try! The chips and salsa are great..as well as the queso and guacamole. I'm not a huge fan of re-fried beans, but theirs are very flavorful. So far my favorites are the Chimichanga and Fajita Quesadilla. It's a lot of food for a reasonable price."], ["Jamie S.", "Best Mexican food by far. Don't waste your time anywhere else. My family eats here at least 3x a month and the food is always consistently delicious!"], ["Elizabeth T.", "This was the best Mexican food I have eaten! I loved the salsa! It was smooth and spicy. I was pleasantly surprised that you got baked chips a cheese dip with fajitas. Overall a great experience."], ["Laurie P.", "This place is delish.  Why is there never a crowd for lunch?  I don't know but damn, I'll take it!  Yes, it looks like a kinda seedy re-do of an old fast food joint, but inside it is a mecca of Mexican deliciousness.  With pinatas as decorations.  Keep it classy, Hola Mexican!Also, you can get a margarita the size of your head for a little lunch-time pick me up before you head back to the office.  Score!"], ["Chris S.", "Their prices are a bit higher than I'm used to. They Charged us $10 for a Chicken Chimchanga and we didn't get rice with it. Only beans. I'm not sure if they know what seasoning is. The chicken tastes like they didn't put any type of spices in it all. Pretty bland. While the salsa was hot, there was nothing else in it besides tomato and jalapenos. Hey guys, how about putting in some celantro or onions. While it's not a bad place to eat, I've been to many places that were a lot better."], ["Tommi O.", "i had lunch on a tuesday afternoon. the place was empty. the food was nothing more than average. mediocre salsa. taco salad, jalepeno poppers flan tasted like imstant caramel pudding."], ["Bob B.", "Simple, clean and friendly. A little hard to find (next to Wells Fargo). Food came out fast and hot and made to order. Shrimp Quesadillas were great!  Tamal very good, as was the Chili Relleno.  Margaritas needed a little work - too much mix."], ["Tomeca F.", "Food was excellent! We stopped by on our way home to Georgia.  My kids ordered their usual and my husband and I tried something different which we all enjoyed. Very clean and pleasant atmosphere. Service was fast and very good."], ["Tamara B.", "Authentic Mexican this place is not!! This is the first time I've ever written a review about any restaurant - I would have done better at Taco Bell.  The Margarita was all bitter mixer and the salsa was watery. We didn't even finish our drinks or food. TERRIBLE!"], ["B B.", "Fantastic. We were vacationing a few miles away and dropped in for a quick Monday lunch (tent camping at Sesquicentennial Park). We love Mexican and they got it right at Hola Mexico today. Got the chicken enchilada (shredded & tender) with cheese dip on top instead of the standard enchilada sauce. Delicious!! Fresh chips, plentiful lunch portions. Restroom spotless & pleasant smelling (rare anywhere!). Quick service and $5 lunch combos. Try it!"], ["Michael T.", "This is without question the best Mexican food in NE Columbia.  Manuel, the owner, has been in the Mexican restaurant business for years, and opened this spot up about 10 years ago.  Yes, they offer the traditional Americanized menu, but he does it very well.  All high quality ingredients and home made sauces.  Try the chile de arbol salsa!He also does some of the more traditional Mexican dishes.  A good friend of mine from Mexico tells me that they are the only place in town that she'll eat a Chile Relleno.  The salsa and queso are great, and unlike most other similar restaurants in town, he makes his own chips in house.Service is always great, though there is a language barrier.  If you want to go off menu, talk to Manuel and he'll be glad to accommodate.  Please don't waste your time on Monterrey, San Jose, Casa Linda, El Chico, Don Pablo's, etc etc.  This is the best Mexican in Northeast Columbia.  If you're willing to drive, I would recommend Real Mexico over this, especially if you are looking for authentic fare, but this is your best bet if you live on this side of town and don't want to drive half an hour."], ["Dog L.", "Good fajitas. Very quick service. Ditch the Fox News."], ["Kinsley M.", "Best Mexican food in Columbia, SC! Great staff highly suggest!!!"], ["Leo W.", "The best chile rellenos on either coast.  I've been coming here for the past ten years and never have I been disappointed .  Lunchtime is my preferred time to go as it is much less crowded usually.  Fresh chips and salsa, tasty meals and yeasty Mexican and domestic draft beer.  I've never had their margarita, but it is made from all fresh ingredients.  At midday I frequently order \"special lunch #1\" which is a chile rellenos, a huge taco, guac salad and beans.  Mostly covered with toasted cheese.  It is toasted in a real oven, not a microwave.  The owner, Manuel, is a perfectionist and it shows in the restaurant which is clean throughout.  OK, part of the menu is \"order by number\" for non-Sunday lunches.  But this is a convenience for the guest.  I recommend Hola Mexico without reservation, and you do not need a reservation."], ["Jessica F.", "Twas a Sunday afternoon, 2pm authentic Mexican restaurant time. We pulled up to what appeared to be an abandoned McDonald's.  the wind blew a chilly gust.  Against our instincts we went inside.  My friend gasped \"this was the place!\"  Our captor lead us to the dark table in the corner.  Mercifully, richie rich was on tv 4 feet above us.  Although there was no closed captioning, this was a highlight.  Chips and salsa were underwhelming to the point of individually salting each chip.  When asked for a hotter salsa, the waiter took it as a challenge. My co detainee was sweating from the heat.  Around the time richie was showing his poor friends his personal McDonald's (which was torturous), our waiter took our orders. The food sucked and we left quickly.  Will consider returning."], ["Krista A.", "Mmmm.... best mexican food in Columbia. Seriously, try the enchilada quesadilla. It's also very reasonably priced and VERY fast. The salsa and chips they give you to start with is very tasty too."]], "Taqueria Guadalajara": [["Vanessa K.", "I'm from the west coast and have Mexican decent in my family so when it comes to \"real\" Mexican food I'm very picky and judge the food on its taste and the way it's made bc I grew up on it, and this place is dead on. I consider myself a regular here. I would definitely recommend this restaurant if you want real Mexican food."], ["Collin S.", "Don't let the low star review fool you - this place has legit Mexican food. Yes it is in a more run down part of town. Yes it is not the best when it comes to decorations. However, the food here is good. Pico de Gallo served fresh, as in you have to wait while they chop it up - and they use jalapeños!I opted for tacos and a side of beans but I think she forgot the beans. No worries, since the tacos were so doggone good. I really enjoyed the al pastor tacos, which are my favorite at any taqueria and the salsas were very tasty and spicy. Very good heat, not overwhelming at all. My co-worker wasn't a fan, but I think she was expecting tex-mex. This place is not that at all, it is REAL Mexican food. They don't serve \"chips and salsa\" just like you don't get that in Mexico. 4 stars for having great food but for needing a little more air conditioning - you'll sweat a little from the heat and from the spicy food! Looking forward to trying the sopes and carne asada entree at some point too!"], ["Esteban I.", "Came  in on a Sunday, do not comeIn after 12 this place gets packed. I sat down ordered three tacos de Asada and a coctel de camarones (shrimp cocktail). The shrimp cocktail was served in a bowl like cereal the shrimp tasted old like they've been in there for like weeks. Awful experience. Don't expect quality Mexican  seafood from this place. The tacos, the tortilla wasn't full cooked so the tortilla was soggy and broke as I gripped the taco. The horchata drink was good and the Asada meat was good. This place is only good for their tripas (tripe) and their green taco salsa. Won't go back again, my search for tacos in cola continues"], ["Joseph C.", "The best authentic food here in columbia.  From the tacos to the tortas. You won't go anywhere else after this place."], ["Jen H.", "Unassuming store front tucked in the corner  of this plaza on Decker. Has all the basics of a taqueria like tacos, tortas, quesadillas, sopes...Aguas frescas included melon, pineapple, tamarind and soursop (guanabana). No horchata unfortunately but wow, I've never found a place that offered soursop aguas fresca so that was a treat. Jukebox plays incessant loud music. Ample seating with at least one high chair available. The waitress spoke very limited English but they do have a menu in Spanish and English so you can order off the menu by number.Tacos (lengua, al pastor, asada, chicken) $1.75. Delish served with radish, lime slices and the 2 sauces (red and green salsa verde which is my personal favorite).  Menudo is served on weekends. El Mariachi still has the better caldo de res but this is a great sit down taqueria."], ["Tania G.", "Authentic! Love this place... Highly recommend it. I was sketchy at first but once I went the first time I haven't stopped!! They always have \"Aguas Frescas\" and the tacos are the best I've had in Columbia yet."], ["Jane K.", "My favorite mexican food in Columbia besides the taco truck down the street its the best i can find other than my hometown in California. The food is very authentic and they don't use ground beef for anything !"], ["Leonor C.", "Good authentic Mexican food. Small place but comfortable restaurant. Not expensive at all. The mango juice is delicious."], ["Kay E.", "We were sad to find this place right before we left Columbia. These are REAL tacos...not Americanized Mexican food. (which is still good to me). So simple and delicious...beware the green salsa on the table if you're not good with spicy things...I thought I was pretty good with spicy, but that about killed me....but my boyfriend didn't seem to think so. So, just depends on your taste and what you think is spicy. You must give this place a try! I think the bad reviews are from people who think Taco Bell is real Mexican food."], ["Mike M.", "I had always wanted to try some truly authentic Mexican food here in columbia. And when my friend turned me onto this place I was blown away. San Jose   can not touch this with a ten foot stick. My favorites are the lengua and al pastor tacos."], ["A T.", "Service was horrible!  Employees were not friendly. Food was okay. Did not serve chips & salsa. Only people in restaurant were Hispanic so figured it would be great. Located in a run down area. We went so since it had good reviews on Yelp."], ["Michael T.", "This one was a little tough for me to assign an actual rating to.  I have been here several times as the owner is a friend of a friend.  I am giving this place 3 stars based on it being a Mexican restaurant.  If I were to just rate it on being a Taqueria, it would be higher.I'm a firm believer that if you're very good or great at one thing and not very good at others, you should either get better at the others or not do them.  That being said, Taqueria Guadalajara is very good at doing tacos, but is average on most of the rest of their menu.  The joint is a mom and pop (and kids) and aspires to be nothing above that.  The food is served on wax paper in plastic trays or on disposable plates, and you're served plastic utensils.  It is also part of a growing trend of ethnic restaurants that has a store (tienda) attached to it.So let's talk about the tacos.  Real tacos are remarkably different (and tremendously better in this Yelpers mind) than their Tex Mex cousins.  They should be served with a couple of soft corn tortillas, onions, fresh cilantro, and a slice of lime to squeeze over.  This is exactly how Taqueria Guadalajara serves them.  You have a wide choice of meat options, as the point of the taco should be a vessel to highlight and accentuate the meat.  My personal preferences are the al pastor and chorizo.  The lengua (tongue) is an interesting choice if you want to go outside the box.  I've tried the barbacoa and wasn't a big fan as they use cow cheek which was too fatty for my liking.The other highlight of Taqueria Guadalajara is their sopes.  If you haven't had one before, it's kind of like a tostada, except the base is made of masa and is rather thick.  The sope you get here is fried perfectly to crisp it but keep it light and fluffy on the inside.  You can get whatever meat on the sope that you choose, just like the tacos.The rest of the food on the menu, I can't speak very highly of.  Most of the dishes are under seasoned and underwhelming.  I haven't tried their tortas but tried most of the rest of the menu.  I would recommend staying away from the seafood as a general rule.  It all tastes like frozen product.Bottom line, if you're looking for a great Mexican restaurant, there are plenty of better options in Columbia.  If you're looking for a good, authentic taco, this is a pretty good choice."], ["Paul B.", "This is the read deal!This is a very good \"real\" taco stand style Mexican restaurant! If You want nacho cheese or queso goober sauce stay away from this place- however, if you want a simple taco or burrito made from tasty meat accompanied with cilantro, lime, and good old fashioned HOT sauce this is the place to go!The menu here is a stark as the decorations- It's simple tacos and burritos-  and you can even get Tacos Lengua!! The menu list about seven or eight different types of flavorful beef, chicken, and chorizo choices that can be stuffed into what tasted like homemade tortillas (?)They also offer menudo and tortas, however I didn't try these.I was raised in Cali most of my life- this place is as close to the mom and pop Mexican meat market/ taco stands, that were as plentiful there as BBQ places are here in the south. These taco stands were very plentiful in Cali- it's nice to find one here!If you want a basic taco fix you have to try this place!  Sit down with a nice spicy taco or burrito and a cold Corona- no extra frills other than \"the beef\"!"]], "San Jose Mexican Restaurant": [["Rob B.", "We were driving back to Charlotte from Myrtle Beach and needed to stop for dinner since our stomachs were rumbling. We opted to sit down as opposed to stopping for take out, and San Jose seemed like a viable option. The interior is large and the place is definitely family-owned, which is always nice to see. The menu features your typical Mexican fare such as the combination platters as well as Mexican specialties. For dinner I ordered my Mexican go-to...carniatas ($10.50.) The carnitas were prepared differently compared to how I usually see them, as the meat came out still attached to the bone. The meat was a little fatty but overall was very tasty. The rice and beans were both cooked well, which is something I don't always find at Mexican restaurants. The missus ordered the vegetarian combo A ($7.50), which consisted of a bean burrito and a cheese enchilada. The cheese enchilada was stuffed with rich, heavy cheese which ended up not being too appetizing, as it was simply too much. San Jose ended up being nothing spectacular, but was still a decent stop. I don't know if I'd go out of my way to stop back in again, but if we happen to be in the area around dinner time again then maybe I would go back."], ["Oscar B.", "***LUNCH VALUE, BUT NOT FOR DINNER***Here's the blunt of my review: For the quality and flavor of the food, paying for higher-priced plates doesn't make a difference. Go cheap here instead.Lunch Specials are available 11:30--2:30 Mon-Sat, with most specials priced at $5.50 and higher. ESTABLISHMENT: The restaurant looks deceptively more appealing from the outside. As you park and walk up to the building, your expectations are higher than they should be. (I advise that you check your expectations at the door or you'll experience a disappointing reality.)As you walk in, there is a bar immediately to the left and a reception booth directly in front of the entry. The interior cleanliness and maintenance of the furnishings are not on par with the expectation set forth by the grand presentation as you walk in from the outside. For the location of this restaurant, you would think they would at least spiffy up the place in order to attract more local diners and keep their business. The salt shaker was greasy. The floor was dirty. The workers were loud and vulgar (speaking vulgarly in Spanish). If I went to a hole-in-the-wall, I'd expect this type of ambience but in exchange for better food.SERVICE: The server was quick. He refilled my cup when it went empty, took my order and had my food out just 9 minutes later. (It could be due to little business at the time I arrived) FOOD: -Chips and Salsa- The flavor of the chips hit me like cigarette smoke in my mouth. I don't know if this could be due to old chips or 'recycled' chips being used. Once the thought crossed my mind, I left them alone so as to not disgust myself at the table. The salsa (for the chips) tasted as if it was sitting in an open container for days in a fridge full of other food...definitely not a fresh taste. I usually LOVE eating chips and salsa while I my food arrives at Mexican restaurants. This put a damper on my taste buds and my meal already.-Carne Asada- Let's start with the bad; the meat did not have enough (or perhaps any) seasoning. It tasted as if it had been cooked on the iron over remnants of other food, allowing some browning on the steak. But the meat itself did NOT have flavoring as if there was absolutely no preparation of the steak before it hits the heat. The rest of the platter was actually delicious. The avocado, tomato, lettuce preparation seemed fresh. Also, the beans and rice actually had plenty of flavor--surprisingly better tasting than the steak itself.-side of tortillas- I had asked for flour tortillas, but was given corn instead. I decided not to raise the issue. By this time, I just wanted to enjoy what I could from my meal and make the best of it. OVERALL: They have a happy hour and a bar, so perhaps their forté is partying and not food. If you do chose this place, come when you have a lunch crave for Mexican during your work day. But seek out better places if you have the time. It doesn't have to be more expensive for Mexican food to be of higher quality. It just requires a staff that prides themselves in maintaining a high standard for quality Mexican food. People who know the difference will become loyal patrons of such establishments."], ["N S.", "Service is great. The waiter was friendly and kept a meticulous eye on our drink level..food was bombastic,  loved the churros."], ["Megan M.", "Don't give your business to cheaters and law breakers like Gregorio Leon!! San Jose Restaurante Mexicano at 801 Sparkleberry Lane will have to pay 11 employees $170,666 after investigatorss discovered that servers and kitchen staff were paid less than federally mandated minimum wages and were not adequately compensated for overtime work, according to a labor departmentRead more here: thestate.com/2012/06/12/…"], ["Jay C.", "A very good place to taste Mexican food outside of Mexico. I stop by during my trip for a dinner and it was great. Try the combintion Fajita.  I ordered for 1 person choice but, it easily can feed 2..."], ["John H.", "Solid Mexican restaurant. Not amazing quality, but consistently pretty good with good atmosphere and service. Good enough to put into the regular rotation."]], "Cecilia's": [["Samantha A.", "We happened to be on the St. Andrews side of town last night shopping and decided to try Cecilia's. Wow, what a gem. I have friends who rave about this place, but neither of us had ever been. We're glad we tried it.It's tucked back in a little strip mall. White tablecloths and an interesting blend of Mexican and southern decor. We got there kind of late on a Saturday night, around 830, and we were the last customers, but they were happy to take care of us. He ordered the burro fajita which comes with rice and beans, and I ordered the fajita chimichanga with rice and beans. Both dishes were excellent and filled with really well seasoned steak and lots of fresh veggies. The refried beans and rice were very clearly homemade and very authentic. Cecilia herself was our hostess, and she seemed like a lovely lady. We had huge dinners (with plenty to take home) and two beers for under 30 bucks. We really enjoyed it and will be back!"], ["T. H.", "Great Mexican food. Cecilia is a very nice lady and loves to see her customers happy. I just wish I could find the recipe  for her green sauce. If anyone knows , please let me know.The wife and I use to eat there every weekend. I have tried everything on the menu and love it all."], ["Lindsay K.", "I used to come here for lunch which I coined \"Mexican Mondays\" when my office was around the corner. They are very accommodating and will do what they can for special requests. The service is a little slow so don't come here if your in a rush. They are also closed from 2-4 but the food is all homemade. You won't find any of that mushy refried bean from a can mess here. It's real food that's real good. The decor is pretty dated and it feels like your walking into someone's mother's house when you first come in, but don't let that deter you from ordering. I stopped by after not being back for a while because our office moved, and the server still remembered me and my order along with the special requests! For sure one of the top Mexican restaurants in town, it's a hidden gem."], ["Rae H.", "I have had this place bookmarked for while. I had heard from people that it was delicious.  The reviews were all so overwhelmingly positive that I had high hopes.  I'm sorry to say that my experience did not live up to my expectations. My food was lukewarm, my chili poblano was soggy, and everything was a greasy mess on my plate.  I have had better Mexican food at most of the restaurants around here. I don't think that this is authentic  any more so than the others in town.  The lady running the place was very nice as the other reviewers have suggested.  Maybe it was an off night, there was hardly anyone else in there. That could also be a testament to declining quality.  I am sorry to report that I wasn't greatly pleased.  I so wanted to be.  I am not ruling it out as a possibility in the future, but I'm not in a rush to go back.  All told I just consider it so so."], ["Doug J.", "Hands down the best authentic Mexican food I've had in South Carolina. Ever. I can't say enough about the quality of the food. Reasonable costs, not just the same-o same-o menu you get at most Mexican restaurants."], ["Dinesh A.", "Good value and allot of food. Salsa wasn't that great. But the shrimp is really well seasoned. Good appetizers. A little slow service from the ladies, but the gentleman running the place makes up for it. Worth checking out if your in the mood for Mexican food"], ["Heather A.", "We knew something was wrong when there were only 3 other customers the whole time we were there. The salsa was good, chips were just ok. My chicken tacos didn't taste or look like chicken. The guacamole was good though."], ["Dawn W.", "New to the South and Mexican food here is a bit different for me.  That being said Cecelia's is the best we've had In columbia. Love the service and the food.  My favorite is crispy tacos with beef. The refried beans ROCK."], ["Ree C.", "Cecelia's has the best authentic Mexican food I have ever eaten. She even has goat on the menu. Try the guacamole and you will never want anyone else's."], ["Holly K.", "My favorite. You walk in and you do have to wait a few minutes before someone realizes you are there but no big deal for me. We always get the chicken quesadilla,  they are seriously the best. Not sure about any of the other food. The owner is very kind and friendly."], ["Dave M.", "We had heard great thing about this place but hadn't tried it until now. WOW!  This is definitely a gem. Our experience was great service, great food at great prices and even leftovers for the next day. I would have loved to try some other unfamiliar dishes they had listed but we went with Fajitas and a combo plate with my favorite Chili Relleno (best to date for me) We found out afterward that they would have put together a tasting plate so we could see what the other dishes were like. We will definitely be back and next time try some new dishes."], ["Ian H.", "We walked in tonight and it was empty...We waited by the door for a minute before leaving because we saw no staff...It was like walking into a restaurant on The Walking Dead.  We could either clear the joint of walkers or go elsewhere.   We chose to leave.  Never saw anyone."], ["Craig M.", "Cecelia's is amazing! By far the best Mexican food in Columbia & the surrounding area if not the entire southeast! The food is bursting with flavor the portions are enough for you to eat on it 2 or 3 times. It will spoil on Mexican food, after you eat there you won't be going back to Monterrey's or San Jose... Forget about it! Cecilia's is locally owned & if you're familiar with the area, and remember Little Mexico from years ago. The original cook from there is the owner of ceceilia's you must try it!"], ["TheHungryDad Jeff C.", "absolutely the best mexican in the entire city of Columbia. and be sure to say hello to Cecila when you visit!"], ["Mauricio O.", "The BEST and ONLY Authentic Mexican Food in town."], ["J J.", "Real authentic Mexican food! Family owned & great atmosphere. My family & I eat here often. The fried ice cream is one of our favorites!"], ["David B.", "Here's the deal with this place.  If you like great, authentic Mexican complete with goat on the menu, you have to try this place out.  If you enjoy good margaritas, good chips and salsa and great service, then forget about it.  They have no liquor license and their chips and salsa are terrible. Cecilia and her young boy helper run the show out front with an obviously top notch chef in the back...seriously good!  But I've been spoiled by Chili's I guess (sad to say) and their greasy chips, margaritas and cold beer being served quickly.  This place has beer and wine along with sangria but that's about it.  The food makes up for it I guess but I wish they had the other component."], ["Michael W.", "This Mexican Restaurant has the perfect combination of authentic home cooking and tastes for the American taste-buds. We tried two dishes, Burro Fajita and Mole Ceciliano. The Burro Fajita was stuffed with stir fried tender steak, round onions carrots, zucchini and cheese. The Mole Ceciliano with pork cubes was a house specialty. The Mole' Poblano had the perfect combination of chocolate, cumin, nutmeg and cinnamon that suited our tastes perfectly. I highly rec commend this place to everyone."], ["Korie k.", "Pretty decent food. I tried the \"once\" which is a combination of tamales, fajitas, tacos, and tortas with rice and beans. It made a good lunch but I tired something very generic.  Will be definitely coming back to try something more adventurous."], ["Nancy B.", "We used to love this place but the last 2 times we have gone, the food hasn't been great. Our order was sent back 4 times because it was significantly wrong. The refried beans taste like they are out of a pork and beans can. They seem like they go with hot dogs, not Mexican food. The enchiladas had, literally, nothing in them. It was dough and gravy, nothing at all inside..I wish the place would get back to the way it used to be but in this case, it is 2 strikes, you are out. We will not be returning."], ["George H.", "What a wonderful experience we had my wife, myself and our 2 children decided to have lunch a new to us rest.  Cecilia's was fantastic.WOW what a find.  A most delightful surprise wonderful service great food and a quiet environment. A true diamond. Portions were huge even for the kids.  Best homemade refried beans. Fantastic fajitas ever. Hot chips great salsa and wonderful service what more do you want in a rest. A must go!!!"], ["Angela S.", "Love, love, love!  I literally do not have a single negative thing to say about this restaurant.  The food is always hot and fresh, the salsa is great, and the service is wonderful.  The environment is quiet and friendly, and the wait staff is always right on top of everything.  I love everything about this place and will continue to go there.  The only \"flaw\" would be the decor - it could probably stand to be updated, but since it doesn't affect the taste of the food, I don't really care."], ["Emily E.", "I wish I could recommend this place, but the service was awful.  The waitress was very awkward and belittled us for ordering steaks, and they were not cooked as we had ordered.  She made us feel uncomfortable our whole meal, and the food was not great for the money we paid.  We did meet the owner, Cecilia, when we paid and she was quite nice, but that did not make up for the rest of the experience."], ["John C.", "Cecilia's is straight out the best Mexican restaurants in town, have been there a dozen times and the food is always good. The mole sauce is the best I've ever had. They offer a wide variety of authentic Mexican dishes. When you enter Cecilia's you won't think it's much but you'll be greeted by a smilling host that is eager to serve you. If you like a real Mexican food and not just the stuff that's on the combination menu head to Cecilia's and you'll be pleasantly surprised with steaks, chicken and seafood and many many more options than you're used to at traditional Mexican restaurants.  Oh and I almost forgot to mention their burritos are almost as big as your head and their chimichangas are as big as your forearms so bring an appetite because you're sure to need it because Cecilia's is going to fill you up."], ["Robert B.", "I don't get the negative reviews here. This is a friendly, relaxed place with good food. My tamale and enchilada, while having too much cheese on it, was delicious. I love tamales and the one I had here was as,good as any I've had. The tortilla chips seem home made, corn based. If you prefer the thin flour based chips in your chain restaurants, too bad. Please give this place a try."], ["Horace G.", "Although Cecilia's sits rather inauspiciously in a non-descript strip mall, the food and the service are anything but ordinary.  First, the food is delicious and the portions are very generous.  Free, bottomless baskets of nacho chips are served while you wait.  The chips are saltier than most that I've had before, and the added salt actually offered a slightly new flavor, which blended well with the fresh, tomato-paste based salsa (tasty but rather spicy salsa verde is also available on request).  I ordered a Salmon Burrito with Mexican Potatoes on the side. Dish was nicely mixed, with delicious fresh guacamole, tomatoes, and cilantro complementing the burrito's flavors perfectly.  Melted cheese \"drizzled\" (dumped?) over the top was a little on the heavy side.  In addition to the great food,  Senora Cecilia is a most attentive and generous hostess, who shares not only her food but her language and heritage with pride and dignity.  This makes the experience that much richer.  She does almost everything in two languages, so that anyone with an interest has the opportunity to build/practice her Spanish as part of the experience.  I've eaten at many, many Mexican restaurants all over the East coast, and in Nevada, New Mexico, and California, and this was among the very best.  !Muy bien, Senora!"], ["Shekhar P.", "My family has become a regular at Cecilia's (once every two weeks) and have spotted many regulars in the past two years we have been enjoying authentic and tasty Mexican fare.The welcoming Chips (always fresh and warm) & Salsa (my favorite is the green concoction which is extra hot) are great. Goes very well with a pitcher of perfect Sangria. The menu is fantatstic (even the Combos ROCK!)Pork in Mole is excellent so are the shrimp dishes (wife loves Cozumel). The beans are from scratch and so is everything else. Cecilia's is the only place in Columbia that serves tender and succulent \"Cabrito\". Do not miss the flan - even if you have to pack 1/2 of your dinner in a doggy bag. Cloyingly sweet and heavenly creamy, a perfect ending for a memorable meal.Service is exceptionally good; during my first visit, I was told : No senor, the cabrito is not very tender and cabrito is the costliest dish no the menu; go figure! . Mrs Cecilia takes care of the front and her husband tends the kitchen.Totally unassuming place but with great menu (prices are between $9 & $14) and great service (priceless)."]], "Taqueria Jalisco": [["Elizabeth R.", "Ok, so for five years I had this really tough job over in the Irmo area, which is just not my jam. Nothing against the place, I'm just more of a downtown kinda lady. It was a pretty grueling stretch of time, but ultimately I got a lot out of it, not the least of which being Taqueria mothertrucking Jalisco. (Incidentally, this one odious coworker from that job always used to \"correct\" my pronunciation of the restaurant's name like, \"Actually, it's tok-eee-AIR-uh Jalisco,\" and I got so sick of it, I finally sent him a link to the entry for \"taqueria\" on this website that had audio pronunciations of Spanish words, and he never apologized, but he also never said it again, so that worked out pretty well.)Look, there's nothing fancy about this place, but what it does have is a hell of a lot of magic! They have the best free chips and salsa in town, a huge menu with a million good options and tasty simple cocktails. Their quesadillas fill me with joy--the spinach one and the mushroom one are my favorites. Get some beans with 'em, and then you've got a bean dip to go with your salsa dip to go with your magical quesadilla! ABRACADABRA!More great things about Taqueria Jalisco:- Incredibly friendly folks work there, exclusively, and they work FAST! Your waitperson is going to get your drink order right away when you sit down, and that drink is gonna ride up to your table with some chips and salsa in tow, in about 2 minutes flat. I think there must be a time machine back there in the kitchen because orders fly out of there like nonviolent flavor missiles. This is really important when the place gets jammed up with hungry people come lunch time.- They have a nice mix of tables, booths and bar seating for solo diners and groups of all sizes. They have a great big booth for large parties, and if the party's too large for the jumbo booth, they're gonna add some more tables and chairs to it until everybody fits. - The prices are INCREDIBLE, like to the point that I almost want the place to raise them a bit 'cause I feel like they deserve it. I guess the fast turnover and killer good eats/happy bellies keep them well in the black, but damn, you get some good quality and quantity for your dollar when you eat at Taqueria Jalisco. Like, more than you even deserve.- The ladies room is always clean; no frills, but clean and functional and spacious, so you can transact your turlet business, wash up, and then stand back to check your various parts in the mirror without bumping into anything. It's probably great for ladies with kids too, but I wouldn't know about that. I also can't vouch for the men's room. I'm just not a man, ok? If you're over in the St. Andrews area, and you want a good meal, quickly and for a bargain basement price, you'd be crazy not to hit up the Taqueria Jalisco!"], ["Prashanth R.", "Hands down best authentic Mexican restaurant around, people serving are very friendly, and the food is awesome."], ["Megan H.", "Excellent food and outstanding service. We ordered chicken fajitas and al a carte tacos with rice. Their hot sauce is off the chain good!!! The portion sizes are huge and the cost is low. We will be back!"], ["Noel E.", "Brought the family for lunch and the food was AWESOME!!!!!! Had the Pulpo and shrimps and scallops with ceviche was on point. The Guacamole was fresh and tasty with the fresh chips. I've found my new Mexican Restaurant to eat at in Columbia."], ["Emily E.", "Good food and decent menu prices that compare to most other Mexican joints in town.  Nothing particularly stood out, but definitely worth a try if you're in the area."], ["Betsi S.", "We always enjoy lunch here. Great food and nice people. My husband loves the chimichangas."], ["Paula E.", "My favorite is the Tortilla Chicken Soup!"], ["Lissa J.", "Agree with other reviews the food was okay, nothing special. I ordered the Jalisco Special lunch dish with taco, enchilada, and choice of rice or beans. Made the mistake of ordering the beans which were basically a refried bean slurry. The taco was okay. The enchilada was okay. The chips were a little stale. The salsa was too runny and bland for my taste. The atmosphere was cheerful and clean and the service was decent. I just need to stop trying to find decent Mexican food in this part of the country."], ["Cyndi A.", "Ordered fajitas for two. They arrived in under five minutes. Can you spell MICROWAVE? Mushy vegetables. Dry beef and chicken. Rubbery shrimp. They stirred in their houses salsa (more like a thin taco sauce) to give the dish some liquid. Rather gross I must say."], ["Scott R.", "Great food!  Great service!  Great portions!  Has a mom&pop atmosphere.  My wife and I have tried numerous Mexican restaurants around the Columbia area, and we have found our new favorite.  Check it out for yourself!"], ["Mia C.", "I remember this place only because it is the restaurant we went to on my first day at work. I was concerned about the cleanliness of this place in general. Food wise, nothing special - same as what they call Mexican in this part of the country."], ["Paul B.", "Another A-ok Mexican joint... nothing special, nothing great... Kind of skimpy on the bang for the buck...I love potato burritos- spicy potatoes with cheese and peppers.. so when I saw this on the menu I had to give it a try! It was nothing very special~ The beans are very good- taste like home made lard :)Not Good - Not bad... small place... could be a little cleaner..."], ["Nancy F.", "We have been frequenting Taqueria Jalisco for something like six years now and their food is excellent and extremely consistent.  Guacamole I like more than my own, and that's saying something.  All the seafood dishes are fresh and well done.  An expanding list of specials that includes favorites like tamales and the burrito verde.  Excellent, warm, friendly service.  You will not be disappointed."], ["Hana M.", "Hmm maybe it was a slow hour (6 on a sunday shouldn't be) but we had the feeling that the food had been sitting arond and then was microwaved to order. One thing i lked was the multitude of sauces we got, i was able to drown out the bland dish in verde hot sauce!"], ["N G.", "Great place and the wait staff is very friendly.The food is good and rich.  The only negatives I have is the amount of salt in the dishes and cheese sauce.  If your order has cheese and you want to control how much is put on, ask for it on the side."], ["Michelle S.", "Jalisco used to be AMAZING, but it seems to have gone downhill.  The soups are still a good choice, as is the taco al pastor (with the green sauce).   I inexplicably lurve the potato burrito.  They are wonderfully accommodating if you have children."], ["Greg R.", "Really solid Mexican place.  I used to visit southern Arizona a fair amount, and this place comes pretty close to the food I got there."], ["Marko S.", "Great authentic Mexican food. Service is excellent, quiet and courteous."], ["M. P.", "Good place: started off with salsa that does not have chunky tomatoes but is more like a runny paste with spices. [Was great.] The Fajitas Jalisco were very good. Seems more authentic than El Chico, although both are great Mexican food places in Columbia."], ["Ariel Z.", "Truly authentic. I absolutely love the food here, such friendly service, and hot meals. Their chips and salsa are always really fresh and homemade tasting, definitely my favorite Mexican place."], ["Brad W.", "Not bad.a little overpriced. One of the waiters looks like that li'l fella who used to yell \"the plane, the plane!\".....except this guy was giga big.  Instead of Tatu he'd be Shamu. Anywho I'd recommend ."]], "Casa Linda, LLC": [["Hilda B.", "We went here because we like dining at different restaurants. This is the second Mexican food restaurant we've been to since we moved here. We ordered queso with chips. Very good. The salsa was ok.  My husband and I split a dish called \" los compadres\" 2 chimichangas one beef and one chicken. Rice and beans. Really have no complaints about it. Very tasty. Our daughter ordered the shrimp fajitas. I wish I had read another review regarding this dish. For the amount of money. I think it should've been a lot more than 7 shrimp! We counted them. The skillet is loaded with onions and green peppers.  Not very happy with that dish. It was good. But..... The amount was disappointing. Maybe they should cut back on the veggies and add more shrimp. The staff were nice and friendly."], ["Sandra R.", "First visit. Great service. Friendly staff. Food was fresh and tasty. Chip and salsa great!"], ["Kirby K.", "I'd give this place zero stars if I could. I don't know why I've been back so many times -- I'll bring that up with my therapist tomorrow when we continue to work on my self-hatred issues. Most recent abominable dish ordered: pollo fundido with zero flavor and literally half an onion just sitting on the plate. Not chopped, just half an onion. If you want good food, go to Taqueira Jalisco. I'd literally rather eat Taco Bell than Casa Linda ever again."], ["Chris S.", "It's starting to get a touch run down inside and the salsa is disgusting. Did I mention the salsa was not fresh and disgusting? Also, the salsa is gross. BUT, beyond that it's convenient and fast while being light years ahead of a fast food taco joint. Great for lunch, too, so be sure to ask for their lunch menu."], ["J D.", "Favorite Mexican restaurant in the area. Tacos al pastor is the closest to the real thing. Yum! Chips and salsa always great."], ["Estefani D.", "After having gone here, we honestly could have gone somewhere else to get a better meal for our money. My friend had ordered the shrimp fajitas and there honestly were seven shrimp on that plate and the other 95% of the dish were onion and bell peppers. For the $13 she paid for the dish, it was obviously not worth it. I had ordered the Mexican stew for $10, which for the price was also not really worth it. The only enjoyable part was our waiter who was a very nice and funny guy. Definitely will never come back to this place again."], ["Rachel O.", "This Casa Linda is my favorite Casa Linda and I'm totally bummed that is a million miles away from my home off the traffic ridden Harbison Blvd.That said... I always find the food fresh and plentiful and inexpensive.  I'm a big fan of the chicken nachos but my favorite is the chicken chimichangas. You get two HUGE chimichangas covered in that delicious queso (you can also get them with beef but I like the chicken), rice and a \"salad\" of lettuce, tomato, sour cream.  It's easily enough to feed two people or you can take home the left overs! The staff is helpful and friendly.  I never had to wait or ask for a drink refill and my special request for mild salsa was brought to the table immediately.Also, when I asked for a \"large margarita\" I was told they had small and medium or I could order a pitcher.  I went with the medium and when they brought it to the table I exclaimed \"THAT is a medium?\"  So be sure to enjoy that! Casa Linda is one of my favorite places near Harbison and is sometimes worth braving the traffic for all on it's own! (But you know I just have to pop by Ross too...)"], ["Erica W.", "I was in South Carolina for a business trip, and decided to take a shopping trip at night at a nearby mall when my new friend/fellow business person decided to stop here for dinner because we didn't want food court food at the mall.I ordered the carne asada and it was definitely yummy.  I think I might have been eating it wrong - what am I supposed to do with the flour tortilla that comes on the side with my dish!?!Service was non-existence, although when the waitress did show up she was nice.  I liked the fact that when they served the complimentary chips & salsa, we each got our own dish with a carafe of salsa to pour in.  I like that since I am a double-dipper with my chips.Would I come back? Maybe.  If I am ever in the area again."], ["Lindsay K.", "The food here is good but you can't beat the $1 tacos Monday and Tuesday. You can get beef, chicken or bean. If it's not taco day, I usually get the potato dinner. It's not in the menu any more but they still have it. I just can't resist grilled potatoes mixed with Mexican food!"], ["Karen S.", "This review is more or less for the customer service we received when we at here last week. There was five people in our party and came in at 11:30 on a Sunday morning for lunch before heading to a movie we were trying to catch. We got seated fairly quickly as the restaurant was not busy, but it went down hill after that. It semed like we waited 20 minutes for a server to come and get our orders after we were seated ( and we needed to remind the server at that we needed to order). Me not being the Mexican food person that I sm, I just ordered tacos, asking for no tomatoes and sour cream on the tacos as well as soft taco shells. They got the no tomato and sour cream part right, but hard shells instead of soft, and guacamole was on the tacos as well (not being a guacamole person, was not fond of having guacamole on the tacos so needed to scrape off and not lesving much to eat after that). Then it was getting near time for us to leave and had to pin down our server again to bring us our bills."], ["Ty T.", "I've been coming here for about a year and have watched a steady decline in customer service. Come in today and can't get any help other than the prick that keeps hovering over me and asking for my order every 4 minutes. Heaven forbid you come in and expect service during a damn soccer game. Screw this place. There's too many other restaurants around to put up with this bullshit."], ["Chris S.", "My favorite Mexican restaurant in the area! With the delicious fajitas for 2 and a great happy hour we always leave there happy and without spending too much money.The staff is great too. Our go too place even though it's a bit of a drive, It's worth it!"], ["Libby W.", "Casa Linda offers the best weekly specials in all of Harbison! From the daily food specials to the happy hour, if you're looking for a good deal and quality food with service, go to Casa Linda. Dave (the manager) is always at the bar and good for friendly conversation."], ["Connie P.", "Havent been back since my husband and I were there and ordered the fajitas for 2. We got them and the chicken had a big melted was of plastic wrap in the middle. They only offered to recook and the waiters thought it was funny. Could not eat after that. I use to manage a restaurant ans would have comped the meal and then some. And  would have gotten  on the amy servers that laughed. They didnt even try to hide they were right behind us. Wo t go back"], ["Jane N.", "I contacted them to find out if they had Gluten Free options.  I spoke with the manager and his answer was \"No\".  I told him I found that rather surprising since Mexican food is very easy to make gluten free.   At that point, he did ask the head cook and got a \"depends on what you are looking for.\"  That manager's initial \"No\" indicates to me that they aren't interested in dealing with any type of food allergies or restrictions.  Fortunately, there are other Mexican restaurants in Columbia that have great food and are willing to deal with the allergies."], ["Jaime M.", "Love the food here. great bar. sometimes the service is lacking because they are always so busy and seem under staffed."], ["Robbie A.", "I love this place, great food, great atmosphere, great mexican chips.  You should come here if you have never been here, it is absoulty great. Not to loud and not too quiet."], ["Damond F.", "Friendly atmosphere. Food was average but we got the average Mexican food. Definitely worth a visit."], ["F. Chandler W.", "Monday and Tuesday are $.99  tacos. You can't beat that. Oh and the $6 happy hour pitchers of Dos Equis. Service continues to be spot on and very accommodating."], ["Blake A.", "In my opinion, it's just your average Mexican restaurant. Good food, but not amazing. What they do have, however... is amazing salsa."]], "Salsarita's": [["WanderLustinDani P.", "Typical Tex Mex quick food, all the dishes Ive eaten here has tasted fresh. Ive eaten a few times at this locations, so far good, no complaints. Portions are fair and I always have left overs. Facility was clean, workers seemed to be tentative to trash and ice. Im sure hubby and I will return for more in the future! Customer service is a plus!"], ["Dom Q.", "Good food. But they scam you into buying more expensive items.  I bought the two tacos and chip combo. It is advertised as 6 seventy something.  They charged me 9.75 at the end for getting some grilled vegetables. I don't understand how vegetables are worth that much. Never going back there again. Lost a loyal customer."], ["Dale C.", "This is a great place to grab a quick lunch or stop by after work for drinks and chips and salsa.  The food is always fresh and great.  The staff is friendly and helpful!  Everything I have had there is wonderful and one of my favorites in the downtown area!"], ["Todd T.", "This Salsarita's is very consistant in their quality. They have a small parking lot to the left of the building but you would be better of with parking on the street.  Free Wifi as well. They usually always have some type of student specials for USC students and do great promotions for things like exam week.  They also have happy hour at this location.  I enjoy the daily specials for lunch during the work week."], ["Michael M.", "I would have given 3 stars based on food alone. I gave 2 stars because I was annoyed that the hours are wrong on the website. I came in at 10:00pm on a Thursday, after specifically checking the hours on their website (which says they are open til 11:00pm on Thurs). I got to Salsarita's and the employee told me they were closed. When I mentioned that the website said otherwise, she was hardly apologetic and said that the hours had changed 6 months ago. Well, if its been 6 months, why not update the website so as not to inconvenience your potential customers?Food is mediocre - pretty similar to Moe's. Burritos don't include chips/salsa and are same price as Moe's. For my money I'd head to Chipotle."], ["TheHungryDad Jeff C.", "Food was excellent. Chips were awesome. Salsa and Queso were great. Meat was fresh and seasoned well and prepared quickly. The prices are too high. even for specials.  $650 for 2 tacos then add on $2.99 for chips and drink?  WAY to high priced. sad because it is really pretty good."], ["Andy P.", "Tried the salsaritas after seeing the review. Tacos  were excellent. Added gauc on the taco and NO extra charge WOW.Ordered the two taco chips , salsa (by the way best hot salsa around) and a drink all for $6.49 Great value for the food and next will try the TCBY"]]}