{"Tienda Jasmine Authentic Mexican Restaurant": [["Joshua C.", "It's a Mexican grocery store and restaurant. Hands down the best Mexican food I've had outside of Mexico. If you're feeling a little adventurous and want to try some authentic Mexican, Tienda Jasmine is the spot. Chips and guacamole are handmade. I agree, the pescado frito is superb. I could see why locals would feel apprehensive to go to Tienda, the area in West Columbia is not so good. But it's a must try in the city! Chances are that no gringos will be there. If your Spanish is rusty, might be pointing to the menu but well worth it. Menus are in Spanish but they also have some in English they just came out with. I go here at least once a week. Highly recommend."], ["Tiffanie C.", "I've had awesome authentic Mexican food, and this was not it. Anyone can have a bad day, so I probably will try them again, but this was disappointing. First of all, not everything on the menu is available all the time. I wanted either the chicken or the beef soup but only the seafood soup was available.  I also wanted carnitas tacos but that wasn't available either, so I got the carne asada tacos.The tacos : I liked the fresh cilantro and onion, but the meat was disappointing. It was full of gristle, dry, tough, and pretty bland. I've definitely had Better, and I WON'T be ordering that again.  The soup: I know it's most likely a cultural thing, but... I'm American.  I don't eat my shrimp with the heads or the shells on, so I took on the arduous task of deshelling the shrimp.  I have to admit that there were at least a  dozen of them in my bowl.  A problem besides being completely whole was that they were so overlooked that they fairly disintegrated once out of the shell.  Also in the bowl was a whole, poorly cleaned blue crab.  It was so mushy, and the meat in the body had latched onto so much of the spice that it was impossible to taste the sweetness of the blue crab.  The shells were so soft that trying to get to the meat was nearly impossible, the meat itself incredibly mushy. There were hints of other seafood, I got a small piece of fish, and a small piece of baby octopus tentacle.  The broth was very flavorful, and maybe a bit too spicy as I felt the heat overwhelmed the potential of the seafood to give you great flavor. I will NOT be ordering the seafood soup again.  It's just not my thing.  If you can tolerate the soup the way it's served, it's a great value for the amount of seafood you get.  Also note, no one speaks English, and they indicated they didn't serve beer even though beer is on the menu.  Also I'm not certain if chips and salsa is something you have to order or if it's complimentary.  I was not offered chips and salsa but all the other tables ( with Latinos) got served chips and salsa.  So ... It just made me wonder if maybe I'd got snubbed."], ["Diana M.", "I couldn't agree less with the previous review. I've been going to Tienda Jasmine now for months- every time I visit Columbia, SC (once or twice a month) I stop by. This is where you go to get real Mexican food in the area. You can tell because the restaurant is always busy with the Mexican locals. The outside and inside is nothing to write home about...but the food is amazing! Best Mexican food I've ever had in the states, and on par with the food I've had in Mexico. Tortilla chips are homemade and so is the guacamole...always so fresh. The pescado frito is my favorite, and portions are very generous. Definitely worth a visit!"], ["J M.", "TRUE Autentic Mexican food! The staff is very pleasant. The food is always fresh to order hot and tasty. Any one that doesn't agree obviously needs to head back to Taco Bell because they don't know what good food is. You will think you are on a tropical island in Mexico. Home made tortillas and tortilla chips are the best. A deli inside with marinated fresh meat too!"], ["Shekhar P.", "The one star is for the Horchata (because try you may, it is difficult to screw up a horchata)Now the food:The \"welcome\" chips were dripping with oil. Some of the chips were limp!The tacos were overly greasy and overly seasoned. The \"Al Pastor\" was more like ground seasoned pork, and very very sour. The chorizo had less sausage amd more ground mush.My partner had ordered chicken flautas. once again no flavor, boiled ground chicken wrapped in a tortilla and dipped in warm oil. Rubbery mess.I had ordered a torta Milanesa. It was a disaster. Burnt bread, mishmosh of stuff inside with \"brown\" slices of avocado.I politely requested a Box, took the mess out of the restaurant and dumped it. Seriously bad place."], ["William K.", "I cannot recommend this restaurant enough to folks looking for fantastic and authentic Mexican food. I have gone many times over the past few months and have never once had a poor dining experience there. Their tacos are fantastic, the meat tender and juicy, the vegetables crisp and the beers cold. The waitress who is always there when I go is a delight and very helpful. If you want great food and a good deal, go here, you'll be happy you did."]], "116 Espresso & Wine Bar": [["Sherry C.", "I came here for dinner last night and I really enjoyed my meal. The place was packed with people. I was thankful to get a table. It took the waitress a few minutes to get to us, but she did acknowledge us and told us she would be right with us, and she was. We got very good service. The food was amazing. So many choices of food. It took me forever to decide what I wanted to eat. I finally decided on the Crab Cake and Fried Green Tomatoes as my appetizer. It was delicious!  I also ordered a Pizza with Portobello Mushrooms, Pepperoni and Chorizos. It was excellent. My husband got one of the specials which was BBQ Ribs and Mac and Cheese. I sampled his food and it was also wonderful. Everything we had was definitely worth 5 stars. We will be coming back very soon!"], ["Ashley H.", "The best part of my weekends as of late has been 116's ridiculously tasty, puffy, fried potato hash browns with melty goat cheese and jalapeños. If you add their crabcakes with dreamy hollandaise and a spicy signature Bloody Mary, you have a damn good brunch on your hands. The service is always great and the vibe is pretty cool. I can't get enough of this place!"], ["Nannan T.", "It's a good place to have dinner. I like the paella very much. Their soup and salad are also tasty."], ["Rachel O.", "I meant to write this a while ago but I went back to 116 and had the marinated dolmas plate and the Wil Moore Farms scotch egg.  It was pretty much the perfect meal.  Ryan makes the best dolmas in town and the veggies and feta on the side just made the perfect bite. The scotch egg was also delectable and the 2 plates together = heaven."], ["Robert V.", "My wife and I were on the prowl for a trendy new spot for drinks and decided to give 116 Espresso & Wine Bar a shot. We were blown away! This place is seriously awesome and I regret that we showed up after already eating dinner. Nonetheless, we indulged in some wine while enjoying the views and beautiful summer evening weather with their outdoor seating, and we just couldn't pass up a delicious mango and brie appetizer. We will definitely be returning, especially after drooling over the food menu options. Prices are great hear and the atmosphere very cool."], ["Adam B. J.", "Went again on Saturday, and it was awesome again!  Same server, he's great!  I'm glad i gave them multiple chances, I'm now a huge fan!!!This is a second update, now five stars!!!This has become our go to!  Best mussels and clams in town!!! Best clams in SC!Always impeccable service!"], ["Tonya P.", "Very disappointed in this place today. I understand that you have limited space, but after a busted trip to the Food Truck Festival- all I wanted was a good brunch and some good Soda City eats, which is WHY I went to 116!! We walked in the door at 1:30pm and we were politely told by the hostess that your restaurant  were no longer seating anyone for the rest of the day?? You close at 3pm?? I'm not sure I understand this type of business. She only had 8 tables ahead of my party of 2?? Why were we turned away?? I have waited plenty of times here and I have never been turned away by any restaurant that had an 1.5 hours left in their services time. Not good business not matter how good your food is (and it is great) but really? It makes me think twice before coming back."], ["Alicia H.", "Love this place! Great food and friendly staff make this one of my favorite places to dine in metro Columbia."], ["Somer P.", "Let me start my review by saying this is my 2nd favorite place in the city. No one does hash browns like 116, but there are issues with the running of this establishment that really grind my gears. Let's start with today: arrived at 1:30pm, they close at 3. Was told by the hostess that she already had 8 people on her waiting list and she wasn't taking anymore names for the day. That is just bad business. I'm here an hour and a half before closing and you are telling me you won't take my money? That's confusing to me. Also, I love your brunch and I'm rarely off on Sunday's and when I am, I just want to be able to get my hash browns ok?Most of the male staff here is awesome. We love Ryan and John most of all. All but one of the female staff have attitude problems. I don't know if that's supposed to add to their local charm, but it's obnoxious. I've held off on writing a review for here for a long time, but it was time to interrogate reality and ask myself why I am tolerating rude waitresses, abnormally long wait times, being turned away and even in one case my fiancé and her friend were asked to leave while they were drinking coffee because they needed the table. And honestly it always feels that way, like you're being rushed to leave. Sunday funday is not about being rushed, it's about sipping mimosas and relaxing. 116, we've had some good times, but I'm really going to question myself before coming back because I just can't accept the mediocrity and refusal to expand your seating or change venues to accommodate your ever growing customer base. I want to return but I want you to interrogate reality yourself and come to these conclusions on your own. Read the book Fierce Conversations and let me know how that goes. In conclusion, this is still my 2nd favorite place in the city for now, but if you want to visit them arrive at least 30 mins before open on Sunday's and ask for John or sit at the bar. I hope they decide to expand in the coming years or I just don't see how they can continue to get business.I will also add that this was originally going to be a 2 star review but I added a star because other days of the week are not this difficult, I also enjoy their specials for events such as New Years and Valentine's Day."], ["Jill B.", "Amazing food, service and atmosphere.  I had the hash browns with goat cheese and it was the perfect combo of flavors.  All the food is fresh and perfectly cooked.  Highly recommend."], ["Linda O.", "Flawless personal first time experience here on a weeknight. Friendly, informative, and attentive service. While the menu was limited, they did have specials, and each food item was well chosen; unique food combinations and pairings that totally worked! The flavors in the watermelon and feta salad as well as the Brie were perfectly balanced. There was no way to conceal that this was fresh fresh! The small plate sizes fit perfectly into my diet. While the place is narrow and compact like a deep alley, I found it cozy and if you are claustrophobic, they have seating outside. The atmosphere was enchanting. I am making plans to go back again as they do have several lacto-ovo vegetarian offerings as well as waist-friendly options. I topped my wonderful meal off with a delicious coffee cordial which is so rare in this area. Even though this didn't effect my food, I am taking off 1 star because the bartender added chocolate chips to another customer's food item with his bare hands; no immediate hand washing prior."], ["Lea L.", "Simply put, this is one of the best brunch spots in Columbia.I have been here a handful of times for brunch and have enjoyed each visit. Be prepared to wait, we have sat at the bar a majority of our visits and still had to wait 30+ minutes.It is a small hipster-ish place with local art adorning the exposed brick walls. It gets very noisy and is always packed. All the bartenders and patrons around the bar area seems to know each other giving it a neighborhood joint kinda feel.The cocktails are amazing; inexpensive and strong. I did not like the Gazpacho Bloody Mary, it was too thick and tomato-y for me. The Nutty Rusputin was incredible, a must try if you like frangelico/hazelnut/kahlua.The biscuits and chorizo gravy plate makes frequent appearances on the specials menu and is a great twist on the classic dish. Highly recommend if you are biscuits and gravy fan.Most recently, I had a black bean and cheddar baked stuffed poblano pepper with cheddar grits and two sunny side up eggs. I have never had anything quite like it. It was one of those meals you find yourself daydreaming about.It is very well priced (Shrimp & Grits for $7? though I have heard not great things about it) staff is friendly and attentive and menu selection is unique.If you find yourself in the area on Sunday, I highly recommend getting out of bed early for this place!"], ["Allison P.", "My go-to place for Sunday brunch! You can't go wrong with a couple mimosas and an omelette. They let you get whatever toppings you want without charging extra. It's a small place but definitely worth the wait."], ["Tonia R.", "This is the best place in the Columbia area by far for brunch.  Since I eat out everyday I feel to give this local charmer 5 stars is making quite a statement. Service is prompt and polite. We'll worth the drive across the Gervais St bridge."], ["Daniel B.", "Great and unique menu full of fresh options. Excellent bar (bloody Mary's) selections. I very much enjoyed my brunch"], ["Frank M.", "This place is pretty fantastic.  Overall, the restaurant is pretty small and I'm sure would be filled up pretty fast on a busy day but it has a very nice look/feel.  I visited on a Tuesday night  (2/24/15) for dinner and there were only a few people there. Sat myself at the bar, which is a pretty decent size, and the bartender introduced himself and listed off some specials.  Decent selection of beer.I had the warm blue cheese dip for an appetizer and one of the specials, sweet potato raviolis, for an entree.  The blue cheese dip was very flavorful and hit the spot, bread was very fresh.  The raviolis were, how you say, amazing...came with a thick creamy white sauce topped with blue cheese....couldn't get enough of it.  Ryan, the bartender, is a pretty cool guy and knows his stuff.  Definitely makes the dinning experience better.  I can tell this place takes care of their customers.  If I were to go back to Columbia, this place would be on the top of my list!"], ["Rick T.", "My dining experience was once again super fantastic at 116 Espresso and Wine Bar. The moment you arrive you are greeted and have delicious drink within minutes depending on how many people are here. Last night the place was quite full, but that never stops the staff from taking care of business. We started off with a scotch egg which is local sausage fried around a egg, very tasty. Then we had a Cuban pizza with plantains which is good but I like the flank steak pizza here much better . After going through that we had another round Bells two Hearted a great beer from Michigan. And soon after that with had Cuban style shrimp on toasted baguette that paired well with the beers we were drinking. This is only my second dinner here, but I might have to change that, I hit this place for brunch at least once a month. Eating local is the best don't let anyone convince you otherwise!"], ["Theodore D.", "Showed up at 10:25 on Friday night. Kitchen closed.  Advertised as being open to 11.   So, call ahead to make sure.  NOT a complaint.  Just the facts. I like the place and go fairly often-great limited menu and wine list--but seeing the carpets rolled up all over town on Friday nights at 10:00 is irritating.  I'll go for make-up brunch soon."], ["Anthony A.", "Great food, great service. The restaurant is a bit small, and crowded. But the dining experience is still wonderful.  The service won me over and the food was fantastic. It really wasnt all that expensive either."], ["Adrianna S.", "Great food, great wine, great service! Sat at the bar during Happy Hour...loved it! Ryan is fantastic and makes you feel very comfortable. Had the crab cakes, plate with chimichurri sauce and paella. I would recommend all of them. When and if I am back in Columbia, I will definitely be back!"], ["Tiffanie C.", "I came 8pm on a Tuesday . Not too crowded , convenient parking . LIVE music! I ordered a bottle of wine $26 which I was allowed to cork and take the rest home. Ordered the daily special which was shrimp and andouille sausage over cheddar grits. Awesome and rich. Took half of it home. Also tried the cheese plate which tonight consisted of a balsamic soaked parmigian, a smoke bleau, and an apricot Stilton cheeses served with orange slices, strawberries and almonds. Total bill $53 with tax but worth it!"], ["Collin S.", "A few weekends ago, I decided to check out the brunch scene in Cola since I'm new to town and coming from the northeast corridor (DC-to-NY), brunch is a weekend pastime.Relying on the Yelp reviews, I was hyped to learn about the stuffed french toast.  However, it was all gone when I arrived.  Unfortunate, since the place was only open for about 2 hours at that time.  So next time, I suppose I'll try to get up and arrive by opening at 10AM.I got the shrimp and grits.  I normally like shrimp and grits, but this was interesting.  The standalone grits were very, very good.  However, the tabasco topping/sauce was gross and overpowered the rest of the food.  Also, there were too many peppers/onions/tomatoes in the grits.  Lastly, the shrimp was very clearly undercooked.  Veins were not visible, the shrimp was all white, and a few pieces tasted gritty and tasted like seawater...the hallmarks of undercooked and/or raw shrimp or shellfish.  Since I didn't want to spend the rest of the day listening to the NFL playoffs from the comfort of my face in a toilet, I picked around it and tried to choke down the grits.My recommendation would be to simplify the grits dish.  No need to change up what are clearly very tasty grits on their own.  And actually grill the shrimp if it's supposed to be grilled, come on.Despite my rating, I'll try to come back and try again...hopefully with french toast available."], ["Ashly G.", "Food is decent but getting a table on a Sunday for brunch is heinous. After waiting for half an hour for our table, it was given to someone else who claimed to be us.  After the hostess was informed of this, she did go and ask the couple about it. They admitted to taking our table but didn't bother getting up. Rude!  To add insult to injury, the hostess did nothing about the situation and we waited another 10 mins to be seated at the bar.  Was the food worth the wait? No.  The bartenders were, however.  They were not only professional but very charismatic which made the wait ok.  Might consider revisiting on a less busy day."], ["Ashlee F.", "Shrimp and grits were quality well seasoned, good portion with plenty of shrimp. Crustless quiche bacon spinach and Swiss the eggs were fluffy and creamy very light with Bacon crumbles, I just with the spinach were beat into the eggs rather than on top. Caramel apple stuffed French toast was good. Very rich. For a small city like Columbia the brunch was good."], ["Kenny K.", "Incredible brunch! HUGE fan of 116! In my opinion, it's the best brunch in the city. I had the chicken and waffles and it was incredible. My wife had the steak and eggs and she loved hers too. I've never eaten there in the evening, but please believe that their brunch is worth a trip. I'll be back this weekend!"], ["Amanda R.", "Their brunch is absolutely amazing.  High quality, delicious food at great prices.  Wonderful mimosas.  The hashbrowns are a must-try.  Great service and friendly staff.  I need to try dinner now!"], ["Neal S.", "Went there for a pre night at the zoo snack.Great food and service."], ["Kristy Q.", "This is a great local spot. The food is Spanish inspired and really delicious. Very small interior - but feels cozy, not cramped.  Creative cocktail list!"], ["Amanda F.", "Becoming one of my favorite gems in Columbia.  Finally got to make our way in for dinner with another couple. Server was attentive and offered great suggestions. Started off with a round of drinks - I got the American Harvest drink special - some sort of basil and vodka concoction and it was delish! Moved on to apps to share - baked Brie with peach chutney (app special), mussels, fried green tomato and crab cake Napoleon. Yum yum and YUM! One of the people with us doesn't even like mussels and said he is now a fan! The broth with the mussels is to die for! Moving on to entrees - I got the Huevos rellanos and the ensalada 116. Just stop what you are doing now and GO GET THE HEUVOS RELLANOS! Sounds weird - tuna and deviled eggs?! Just trust me and go get it!Food coming out was perhaps a tad slow but for a tapas style restaurant, I am fine with that."], ["Schylur W.", "We had krisslynn and received excellent service. The menu had a pretty good variety and the server was very knowledgable of it. Did a great job recommending items. Drank an old fashion. Wasn't a fan of their version with the sugar cube. The drink was very strong, which is good and bad. Taste was off, but obviously can't complain about strong drinks. Food tastes excellent. Great date spot as well."], ["Damon S.", "My favorite tapas restaurant in Columbia! VERY small, it's a hole in the wall. Love how they have small tapas plates as well as larger, entree size plates as well. We haven't had anything bad here! The fried green tomato small tapas plate is AMAZING! I always recommend this place to anyone looking for a new restaurant to hit up if they haven't been there."], ["Gregory G.", "This is one of my favorite spots in all of greater Columbia! If you don't mind driving across the bridge in Cayce/WestCola then check this place out. I've been coming here for years and the food is always delicious. The restaurant itself is a bit on the small side, kind of Brooklyn, NY style, but the decor is cool. The bar staff is fantastic and table service is usually great, even though some of them give you \"hipster indifference\" during the service interaction. I really have never had a bad meal here and I always bring my out of town friends here for a great bite. If you're looking for a great brunch spot too, then this is your place. Tri-Color hashbrowns...mmmm...Enough said."], ["Danita R.", "You know how you drive by a place all the time on your way to everywhere else, and you look over, see it and think, \"That looks like a cute spot,\" and you keep on driving? 116 looks like that kind of place. I was passing through town myself when a couple of friends lulled me into what seriously looks like a hole-in-the-wall. And you know what they say about gettin' your eat on in the hole-in-the-wall ...And if you don't know what they say then I suggest you go and grub on the Grilled NC Berkshire Pork Chop. \"P\" is for pork chop and perfection. (I am a terrible food photographer, but y'all 'twas scrumdiddlyumptious.) The accompanying Greek orzo pasta salad was fresh and light, and overall the plate made for a filling and tantalizingly tasty combination. You know it's good when someone else at your table keeps one eye on your plate the whole time they're eating their food! That is not at all a cheap shot to the chimichurri tasting plate, but it's just what it says--a taste. The pork chop is perfectly portioned and righteously grilled.My friends and I shared the spinach and artichoke dip. It was warm and rich and plentiful, a great setup for a filling, but not too full meal.Marvelously attentive and courteous staff; artsy-neat decor in a sweet 'n small intimate setting (just a few tables in this spot); interesting variety on a menu that uses fresh and local (and delicious) fare. A bit bummed I didn't enjoy a cup of coffee, but the sangria hit the sweet spot :) If you keep driving by this place you're missing out on good people and great food (at really great prices, too)! Stop going for the same ol', same ol' and try something new--116's staff won't disappoint!"], ["Amber G.", "I really wanted to like this place. My friends and family rave about it, so I'm going to give it the benefit of the doubt and assume that I just had a bad experience. It wasn't especially busy when went, but it took an unusually long time to get our food.  The service was friendly, though. I ordered the shrimp and grits, which I usually love. These simply weren't very good. The grits themselves were tasty, but the Tabasco sauce topping wasn't even mildly spicy and resembled canned condensed tomato soup in both flavor and appearance. The shrimp had an odd texture as well. I'd be willing to give 116 another try, but I would definitely order something different next time."], ["Michael M.", "Great food at this little restaurant on State Street. We just had a Sunday brunch 25 dollars which includes 3 entrees for 2 people. Definitely try the 3 potato hash browns."], ["Stephanie V.", "My favorite restaurant in Columbia. I've been here several times and each time the experience was close to perfect.  Food is consistently spot-on, especially the crab cakes, cioppino, and smoked tomato bisque (this coming from a girl who loathes tomato soup - seriously, just try it).  Service is always friendly, ambiance is hip enough that the place would be at home in some city infinitely cooler than Columbia, and from that side of the river, downtown glitters and gleams like somewhere you'd actually want to visit.  And reasonable prices to boot!My one gripe is that for a restaurant that bills itself as a wine bar, I think the wine list is pretty unexciting.  But if you don't find an appealing vino, a tiramisu martini or one of the other intriguing concoctions should make for a good consolation prize.Also, be forewarned that it gets super loud and crowded during peak hours (people know what's good!), and parking can be a bit of a mess, so I'd suggest going later in the evening if you want to have a conversation with someone, or with yourself."], ["Ken H.", "After deciding to visit Columbia for the first time on a whim to see a concert, we stumbled upon this little place as it was right near the New Brookland Tavern. We lucked out and scored the last table. The restaurant is setup shotgun style - very narrow. For this tapas place, it definitely adds to the ambiance. Almost all of the small plates - baked feta, mussels, and portobello cap were delicious. The only miss was the jamón y melon. The ham wasn't quite salty enough and the melon a bit under ripe. The large plates - chimmichurri sampler and pork shank special were excellent. The drinks were inspired and surprisingly cheap at $6-7 a pop. The service was very friendly and paced appropriately. You can tell they have a small staff but still work together well to get the job done. Should another trip to the Midlands be in the cards, I'd definitely double down on 116 again."], ["K P.", "We found this wonderful spot just after moving from Atlanta. We had high expectations, but 116 didn't disappoint. AND THE PRICES - what?? We're not in Atlanta anymore and maybe that's a good thing! Great little spot for dinner and brunch. We take everyone here when they're in town to visit! The restaurant is also located close to the Cayce RIverwalk, which is convenient for an after meal walk when you're just too full from all that goodness!"], ["Annie D.", "This adorable neighborhood cafe is the cafe every neighborhood should have. Especially at brunchtime. Or at wine time, I imagine.The service was so.damned.friendly for brunch. It's a small venue, so the staff let us know there would be a bit of a wait. We shared the little waiting area with some charming older ladies, who were on a double date with their husbands. It was kinda rainy and the husbands dropped them off first before they parked the car. Gentlemen, take note.I ordered the three-potato hash with gold, purple and sweet potato, peppers, jalapenos, onions and goat cheese. Also, fried eggs on top. It was spicy, tasty, starchy, eggy... exactly what I was in the mood for. It was delicious enough that I can't even remember what my fiance ordered.It's a wine bar, but they also offer a full set of Bloody Marys, spiked coffee drinks, cocktails and margaritas. Also... four kinds of Russians (not just the white ones!).Thanks for a lovely morning, 116!"], ["Brandy W.", "This place just keeps getting better and better.  My first visit was over a year ago and I remember the plantains were fabulous. On my second  visit,  they were a bit disappointing.  On my third visit they were very good but I branched out and tried the Lebanese eggplant.  IT.  WAS.  SO. AMAZING.  FOODGASM!  The dish was totally different than I expected but so light and refreshing! A flavor explosion!   In our most recent visit, every dish was excellent.   We started with the Lebanese eggplant with some awesome bread to soak up that tasty broth, then an amazing artichoke bisque,  the delicious chefs pie (flatbread pizza),  then a fantastic key lime pie from Florida.  Did I mention the $18/bottle wine special????  And the excellent service???   Sometimes it's very crowded and loud,  and this is why!!!"], ["Emily E.", "Did not even know about this place until I tried it for brunch today.  Be prepared to wait if you're coming on a Sunday, but that being said, it was worth the wait.  It's packed for a reason!  The chili rubbed sirloin was amazing, as was the ensalata served with tuna.  I love that they use locally sourced ingredients.  Service was good and the decor is really cute.  I hope more places like this open on State St, because it really is a good location."], ["Keith K.", "Times I've been here: 20+116 is one of the best little hole-in-wall coffeshop / bar joints in the city.  Just over the river off Gervais, don't miss it.  Competent service, $3 sangria at happy hour (unf) *excellent* espresso - one of the few places in the city that gets it right - and solid, well made food.  The food portions are 'small' (read: reasonable), and the specials change often.  The coffee itself is good, but not standout.  116 is the only place in town I've found that makes good alcoholic coffee beverages.You should try: Lamb hot dogs, mussels, anything with chorizo, the strip steak, any pizza that sounds good.  Tabasco shrimp and grits.  Cheese plate. You can't go wrong anywhere but that's what I usually find myself gravitating towards.What could improve?  There's only one bathroom, which seems occupied far too often, and the beer selection should ditch the mass market crap and embrace more local beer; South Carolina has lots.  They don't server PB&J here, so why the Coors?  I'd also like to see more whiskey behind the bar, but to be fair, this is a White Russian / wine sort of joint.So, FIVE STARS... really?  Yeah, sure.  I'm librul that way.  Columbia has so few bright spots that the ones that stand out need the attention.  I will continue to enjoy 116 and throw 'em my money."], ["Who R.", "Iberia-inspired tapas at a low price, cava happy hour on the reg, and absolutely zero pretentiousness? Yes, please.  This place is just great.  I recommend the shrimp and grits for lunch and anything with choriza at dinner.  Great city view from the patio to boot."], ["Mrs. C.", "Excellent food, excellent customer service and excellent selection on wine and beer. You really couldn't ask for more!!! I absolutely recommend and definitely do yourself a favor by purchasing one of their specials!"], ["Swetha G.", "I have been to 116 SEVERAL times since my original review.  I've been there for dessert, brunch and dinner, and the place is consistently good with service and quality of food.  I have had wine, dessert, cava, brunch items, apps, entrees, pretty much every variation on the menu, and I am without fail, ALWAYS happy with the food on my plate and the service I've received.  Some favorites include their veggie ratatouille, their goat cheese dip (heads up, it's seasonal), their coffee (I think I had four cups the last time I was there for brunch!), and all of their desserts. Whoever is running 116 is doing a phenomenal job.  I especially appreciate the use of fresh and local ingredients, it definitely translates well in the food, and they have yet to miss the mark.  If you haven't been to 116, I highly, highly recommend giving this place a shot, you will not leave disappointed, they deserve to be in the restaurant business and they KNOW what they're doing!"], ["Ray T.", "A very charming and well-run bistro featuring a creative and eclectic menu and nice wine selection. Excellent service and ambiance in a clean, cozy atmosphere. Columbia needs more fine eateries like this."], ["Merry D.", "I loved this place. Husband said \"I probably wouldn't repeat\". He had trouble getting past the decor and how LOUD it is. However, he really enjoyed the Caesar salad (dressing is excellent) with anchovies, and the Cuban shrimp. The Cuban shrimp is buttery and garlicky and spicy. I wanted to drink the broth. We wanted to try the Scotch eggs,but they were out. I enjoyed the cheese plate too. The Cuban Pizza was ok, needed more chorizo and less roasted red peppers. Try the Cherry Moch Manhattan, it has Kahlua in it but trust me, it works. Husband had streak and mashed potatoes. I tasted them of course. Loved the wine reduction. Steak was more done than medium rare which was a little disappointing. I want to try the Sunday Brunch but will have to go without him! Oh, if you like Cabernet, try the Gladiator, it was wonderful. Almost forgot dessert. We ordered the lemon bars, Key lime pie and blueberry lemon cheesecake. All were great. The lemon bar was tart and had a great texture, not eggy at all. The raspberry sauce it sat upon was perfect. Tart, and not sicky sweet or gooey."], ["David W.", "Hands down, this is the best food in Columbia and the perfect spot for a date night. Service is great, the bartender is excellent, and they consistently have delicious specials. Great menu options for vegetarians, poultry eaters, and red meat eaters alike. Compared with other upscale restaurants in Columbia, this place doesn't wear out your wallet too much. I've never felt like I overpaid when I went here."], ["Abigail M.", "The things that I like about this place (have now dined/drank twice, both times outside) is that I can walk up after walking my dog (ok, carrying) on the riverwalk, sit down and enjoy a glass of wine and munch - dog in tow. They even brought him a water bowl. There are very few places in Columbia that are dog friendly, so this stands out to me. Service has been good each time. It's a cool spot. I love the state street crowd. I understand that many do not, but I \"grew up\" sitting at Courtyard (old name, same location) drinking coffee and \"discussing philosophy.\" The things that I do not like about this place is that they food was not memorable. I have heard that their brunch is much better; however I'm not sure that I will give it a chance after the two times that I have eaten dinner here. The wine list was also not memorable considering it is a wine bar. The first time I visited, I would have loved to sit inside, but they had live music that night which was way too loud for the small space.All in all, I will probably return for brunch and a follow up review."], ["Jonathan R.", "Tried out 116 for a small birthday get together and it was great. We sat out front in perfect weather and with a great view of the downtown area. The food was delicious, service was very good, and the drinks were great. Can't wait to go back."], ["Chris Q.", "I'll make this short and sweet...the food, drink, service and atmosphere was excellent.  I loved every last bite, perfect and thank you!"], ["Julie R.", "yum! Cute place...great food...good wine...goooo!"], ["Simon T.", "Best bloody marys I've had in a long, long time."], ["Tanya M.", "Love this place. Been here for dinner and brunch and I am never disappointed. The food is unique and oh so yummy. Oh, and the price is just right."], ["Aaron Z.", "Pleasantly surprised, the food was great and the prices were even better. Brunch was the heat.....I think it is my new favorite breakfast spot."], ["J J.", "Had Sunday brunch here. Great atmosphere, great food."], ["Martin V.", "I think this place is very good. Their sweet potatoe pancakes, cinnamon rolls, and everything else are fantastic. They don't scrimp on coffee, even if you get something fancy, and they have a bar you can grab a drink at while you wait for your table. If you are looking for parking, they have a lot directly behind the restaurant. Prices are reasonable, and it's busy without being too loud to carry on a conversation. I would definitely check this place out if you are looking for fresh, tasty breakfast food. Waits can be around 20-30 minutes on weekends though, so if you are starving, come early."], ["Reginald W.", "Expert and excellent throughout. This is my second visit here and I have been pleased with decor, lighting, wine choices--and recommendations, today the Tempranillo Anciano from Spain--and last but foremost, the food and service!  Noise level a little high but it was a Friday night and tastefully exposed brick walls that add to ambience tend to be a little echoey. Highly recommended and fairly priced."], ["Jarrett H.", "Amazing food and brunch! Everything is gourmet cooked and super fresh. Like a 5 star meal at a 2 star price. You will love it!"], ["Brian H.", "116 is not simply a restaurant, it's not just a cozy bistro tucked in a familiar warm happy place at the corner of State and Meeting Streets. It doesn't simply contain a happy group of epicureans who are overjoyed to deliver their wares to both wide-eyed newcomers and longtime friends.And it sure as heck ain't just an Espresso and Wine bar.Generations ago, talented chefs would open their homes to both travelers and neighbors. This being a regular activity for them, they would often either grow their own food or collaborate with a few local farmers who offered the best quality options. With these ingredients, they created culinary masterpieces which complemented their highly-creative beverage offerings.It wasn't done because market research showed that this would lead to higher profit margins. It wasn't because they wanted to win any national awards. It wasn't because they expected the folks from Stouffer's to show up one day and offer to license their recipes.It was because they didn't know any better.Run by a couple of Ryans (Whitaker - chef and owner, Ditman - cocktail crafter and longtime family friend), 116 is not a cause, it is an effect. The cocktails are beyond creative, they are inspired by the tastes of a well-traveled, well-educated functioning alcoholic. Whitaker, who was slated to be an engineer or doctor or some other allegedly \"higher\" pursuit, instead found a path which allowed him to explore his true joy - being complimented daily and fully deserving it (while also being given a constant excuse to eat, drink, and be merry).Odds are, if you step into your average nightclub, approach the bar, and order a \"Chioggia Beet American Harvest Cocktail\", you'll be quickly escorted out by security and asked to never return. However, this is just one of the many custom cocktails designed by folks who have nothing better to do than figure out how to get drunk off of beets.Next time you're ordering the \"seasoned\" grilled chicken at your nearby chain grubbery, be sure to ask if they're using \"North African\" spices, or see if you can get a Chili Coffee rub on your steak. When the server explodes, flinging button-ized messages of \"If God didn't want us to eat bacon, why did he make it out of bacon.\" and \"ask me about our Chicken Chili Flingers\" throughout the room, just tell 'em to cook your steak well done and reconstitute it with your tears as you think of the meal that could have been.\"Oh, well that steak's gotta be expensive!\", you say, and you'd be right... but only if this were 1934. $10 is pretty damned cheap for a specialized culinary masterpiece and you know it.Frankly, I've worked in food and beverage for years, I've seen the margins and food costs and etc. etc. and I have NO idea how they do it. These are no fools, they've got to be making enough to at least get by, but with $3 sangria/wine/draft beer specials during happy hour, $7 shrimp and grits during their Sunday Brunch, and a whopping $5.50 for a pizza (of course, they NAIL you on the toppings - .75/ea for Capicolla Ham, Chorizo Sausage, Portabello Mushrooms, etc), I just don't see how they do it. Every morning after I go there, I double-check my bank account just to make sure the $100+ meal and beverages I've just consumed didn't put me over my limit, only to find that I spent $30.$30 by myself? Well, I've been known to 'enjoy' their drink specials a bit much, and as a beer man, I'll tell you that this \"Espresso and Wine bar\" sells itself short on the name. Sadly \"Beer Bar\" doesn't sound as classy, but their selection is extensive, and far from pedestrian (yet they're cool enough not to give you stinkeye if you order a Bud Light... they may, however, offer for you to taste an alternative).After an appetizer, dinner, a 'few' drinks and a well-deserved generous tip, you'll eventually manage to force yourself out the door only to long for the cozy and warm speakeasy atmosphere, the inspired and devoted servants, the \"this is so much better than a gin & tonic\" libations, and the truly unmatched dining experience. The good news? They're open Tuesday through Sunday and they're always happy to see you come back and assuage yourself of the burden of having to dine anywhere else."], ["Cheryl W.", "Specials are always a great choice... Changes daily. Staff is great and friendly. Drinks are always tasty. Great tapas and always fun to share with friends over a bottle of wine. Yum!"], ["William K.", "Went here for espresso on a Saturday night and was not overly impressed by the quality of the coffee. The barista was unfamiliar with the techniques of pulling a shot and my boyfriend and I had very different cups of espresso even though they were made by the same barista. For a store that emphasizes espresso in its name, I would have expected a bit more quality in such product."], ["Jen H.", "@116 is a wine and espresso bar located conveniently next to cafe strudel on state street. parking is all along the street. currently they offer breakfast, lunch and dinner as well as a sunday brunch. starting july 2010 though, they will only have dinner service but will be starting a saturday brunch. closed on mondays though.coffee/espresso menu is reminiscent of cool beans by the USC campus as i believe the owner of @116 previously owned cool beans. worth a visit!"], ["Pumpkin P.", "Cute & quaint... In a hipster/ artsy area of Columbia, if there is such a thing. They were having a special & the glass of wine I ordered was only $3! I ordered a watermelon/ feta/ pesto salad, which sounds odd, but it was soooo good. I'm going to try to recreate it at home. It was definitely the best part of my dining experience. I also had the mussels, which were decent but I've had better. The bartender was super friendly, & even gave me tips on other area restaurants. I got to 116 around 6ish on a weekday & the place was slow, but was full once I left. Get there early, because this place is pretty small and fills up quickly."], ["Paul M.", "So the Census guy frowned at me when I tried to put down @116 as my religion, because if I could, I would spend every sunday brunch here.  I had the hashbrowns and eggs.  No, they're not like Waffle House hashbrowns (although those are tasty), these use potatoes so obscure you'll be the envy of all 13 hipsters in Columbia.  And they're delicious, with some peppers and cheese in there and... oh I have to stop.  Normally, food this good is accompanied by a massage and a corkage fee, but here it's so ridiculously relatively cheap that it's almost insulting.  You can get a full gourmet brunch and coffee for around $10. Napolean never had it this good.   Portions are just right, as in you won't walk out with that mixture of satiety, regret and shame you get from eating breakfast at the Shoney's buffet.  But if you routinely duck and/or turn sideways through doorways, you might want to double up on your order. Decor is great.  Not sure why Captain Prudington below docked a star for it, the place is fine and has art 'n old crap on the wall.  What more do you want? Window treatments aren't on the menu. Oh, and this place has the gastronomical balls to wrap stuff in a bacon and charge a lot for it.  They get away with it.  We're talking bacon-wrapped prunes stuffed to the (proverbial prune) teeth with jalapeno cream cheese.  It works.  I'm salivating just thinking about it and I no longer fear becoming old. Do it. Go eat there.  You'll love it.  And I say this just from going to brunch. I'm sure dinner rocks too.   Actually, second thought, hold back a bit, it's crowded enough and I don't like waiting."], ["Paul B.", "Coulda, Shoulda, Woulda~This is a place that seems to be on the edge of greatness! It has all the makings of being a great little dive-diner. The location is cool- \"Vista West\"? Just a little on the rough side? I can buy in to that. The Menu seems very good. I love the Cuban/Spanish spice touch, with the flank steak and empanadas! I love the whole spicy beef and potatoes feel, with no french fries! Garlic-Bleu cheese mashed potatoes Yes! The portion could of been a little bigger :)I ordered the Coffee Spiced Flank Steak: Tender Choice Flank Steak Coated with our Spicy Chili Coffee Rub and served with Garlic Mashed Potatoes 9.00$ This entree was very good. The steak was very flavorful, very tender, ordered medium rare and it came out just right! Maybe a little piece of flat bread / pizza bread would of been good with it?This is on the Sunday brunch menu: Steak and Eggs: Ancho Chili Rubbed Sirloin Steak with Two Eggs and Toast. This sounds so good -it should be on the menu ALL the time-with a nice cold one! Diner food YEAH!  with the mashed potatoes! OH well, thinking out loud... They have a lot of cool stuff on the menu.The service was great! Our server, Lizzie? was very attentive and hospitable The only con- \"The place could of been a little neater\"?? That was one comment from someone in our foursome.I will definitely go back. I want to try a Cuban Empanada!"], ["Leary C.", "Have been going to 116 since soon after it opened. Wonderful, creative specials each night. Never disappointed with any of the standard menu items. Menu changes frequently and Ryan W (the owner/chef) uses lots of fresh, local ingredients to come up with the daily specials. Prices are extremely reasonable. Have moved away for a while but still try to get to 116 every time we are in town. Had not been there for about 3 months and when we were there recently the bartender and server both remembered our drink preferences and things we like on the menu! Did I mention that Ryan D. is probably one of the best bartenders in Columbia?? My wife likes to just let him make up new drinks for her. @116 should be right there on your list with Motor Supply, Mo Mo's, and Gervais & Vine for must-frequent places in Columbia!"], ["G T.", "No long winded review here, 116 is just great food, drink and service at a fair price!"], ["Stu T.", "As far as brunch in Columbia goes, 116 is tied for tops with Motor Supply and Cafe Millwood in my head. Their specials are fantastic and the menu changes often. Portions are... smaller than \"American\" size, but honestly just right for those of us who aren't gluttons, and the price is certainly right. I can do two brunches with drinks for under 20 bucks with tip? Hell yes. Take note: the three potato hash browns are not actually made with a quantity of three potatoes, but rather from 3 different kinds (yukon gold, sweet potatoes, and PURPLE potatoes) of spud. And it's more of a home fries style cooking, but comes with goat cheese and jalapenoes and is fantastic.Haven't been out for dinner or the evening scene yet, but it's a kooky little rough-around-the-edges location in West Columbia and that almost guarantees it'll be fun. I would probably do brunch here every weekend if I could."], ["Karen T.", "We just had the appetizers, but I would compare their presentation and taste to the best in Columbia.   The small size of the restaurant makes it very appealing, as it seems like a European or big city eatery. The beverage selection was good and the bar area is very appealing."], ["Eaton W.", "The mussels, $11, are enough to feed two or three people...especially if you order other tapas. Ask for extra bread or a spoon to enjoy every last bit of the sauce."], ["Amanda A.", "Pretty decent food, but small portions. Ports Ella was delicious, but needed more. GREAT atmosphere and friendLy staff."]], "Gervais & Vine": [["Liz R.", "The menu had so many must try items and I may have gone a bit overboard...but it was worth it. We started with a trio of the dips and chose:Spinach artichoke-hands down the best I have ever tried. There was an extra creaminess to it and had the perfect balance of ingredients- easy to scope but not runny. My favorite of the trioAlmond Brie-incredible as well. The almond added an extra sweetness to the cheese that made it feel more like a dessert but not so overdone that I couldn't justify eating it as an appHummus-I know, sounds boring. But it was so so fresh and if it wasn't homemade then they definitely fooled me. Only downside is it was a little heavy on the oil for my taste, but others may prefer that. Then we proceeded to order the bruschetta, which was a plate of two medium size slices of toasted baguette covered with a heaping of one of my favorite types of tomato dishes. We finished things off with the salmon, which wasn't particularly seasoned, but was so fresh and cooked just the right amount that I didn't even need the sauce they served with it on the side. I told you we went overboard and we probably could have stopped with the trio, it was so filling, but I certainly have no regrets because everything was phenomenal."], ["John J.", "I have been to this restaurant three times.  The food and wine were excellent the two times I stayed.   Service is among the worst I have found in Columbia.   For that reason, I left on my third visit deciding to eat at Cellar on Greene instead were service is always great.  On my first visit, the hostess was irritated and shot me a snotty look when I asked for our table to be wiped down before sitting.  During my final visit, we sat at the bar for nearly 10 minutes waiting to be served before leaving."], ["Andrea R.", "Dined here on a Friday night. We made reservations which was nice because the place is quite small, a lot smaller than we expected. We were sat in a small room in the back against the wall which gave us some privacy but for a tapas place the table was very small. You would think when needing to accommodate 5-6 plates at one time that they would select larger ones.We started with the bruschetta which was really good. Two large pieces of French bread topped with a lot of tomatoes and a thick balsamic vinegar. We then had the olive plate which I loved, but I never met an olive I didn't like so maybe that's just me. We then had the Moorish pork kabobs with gorgonzola fondue for dipping; warm almond brie with mango chutney; gambas (spicy shrimp with roma tomatoes, sherry, bacon & garlic); and the garlic-parmesan fries with spicy aioli. We also ordered the petite filet mignon but our waitress never brought it out and we were full so we told her to just forget it. Overall our food was delicious and filling. With those 5 plates (olive plate doesn't count) we were SO full. Plenty of food for two. The service was great; our waitress was so nice and knowledgeable and made great recommendations. We paired the meal with a delicious Malbec, unfortunately we saw that same bottle of wine at Publix the next day which was kind of bummer considering we paid I think $36 and it was at Publix for $12. That's the name of the game I guess.We thought the prices were more than fair, our meal only came to $90 (pre-tax) for everything.  The low-lighting made for a romantic atmosphere and we will definitely be back!"], ["Stephen B.", "Well since the change of ownership a couple years back I've heard nothing good. So I decided to give it a try. Well the menu has not changed but the quality has definitely gone down hill. Sorry but it's just not the same. Go elsewhere. Enough said."], ["WanderLustinDani P.", "Greatness, Goodness, Excellent Service,Cleaniness.....hubby and I enjoyed to the fullest, we will be returning. No need to write a long review! A wonderful find close to home..."], ["Sherry C.", "I really and truly had an open mind and wanted so much to really love this place.  I've been wanting to come here for a while.  However, I hate to admit..... but I was kinda disappointed.Our waiter was really nice and very attentive.  I wish I could just give him 5 stars.  Our appetizer, which was the Costa Brava,  was very good.  I was excited to be off to such a good start.  The tapas that we ordered, Beef Paillardes and Catfish (it was one of the specials) was pretty disappointing.....They were both about 3 stars.  But the Eggplant Fries, were soggy and not very good at all.  Because I was still hungry not eating much of the other we ordered some Fingerling Potatoes.  They were pretty good.  I wish we had ordered them instead of the Eggplant Fries.  Overall, I'd like to give them 3 1/2 stars.  But since I can't, I have to just go with the 3 stars.  Definitely not worth a 4 star.  I hate to say this, but I doubt we will ever go back."], ["Jennifer M.", "This is the perfect place for a nice adult evening on the town. The food menu is superb. It is so much fun to order several small plates and share. We had the cheese plate - the manchego cheese is not to be missed. We had the shrimp and scallops tapas. They were perfectly prepared. The wine menu has a nice mix of selections and the martini menu is also interesting. A very fun and interesting place for dinner, especially when you enjoy tasting many dishes."], ["Adrienne J.", "It sincerely distresses me to write a review giving Gervais & Vine anything less than 5 stars. My husband and I have been going here regularly for at least 6 years. We LOVE the food and atmosphere, and in all times past, the service. Tonight we went in for dinner, with a reservation, and were taken into the back room to be seated. The hostess asked if the table was okay, and my husband asked if it would be possible for us to sit in the front part of the restaurant. This was met with an undisguised eye roll and sigh that was loud enough for me to ask, \"Is that a problem?\" The hostess responded, in a clearly mocking tone, \"No problem at all.\" She proceeded to seat us only one table away from the hostess stand (which was fine) and then discuss my response to her eye roll and sigh, quite loudly, with the other staff (which was NOT fine). This was all done loudly enough that my husband then asked the server, who was included in the hostess stand conversation, if our seating was a problem. Initially, I took this quite personally, but as we sat and continued with our meal, I saw this process repeated with at least half of the customers that were seated. Eye rolls, loud discussion among the staff nearly mocking the patrons, and general attitude of annoyance from the staff. We have never left the restaurant without ordering at least one bottle of wine, several orders of tapas, and at least two desserts. I was so uncomfortable by the end of our meal that we opted to head to Kaminsky's for after dinner drinks and dessert. (Which, by the way, was FANTASTIC!) It just generally seems that all of the employees hate their jobs and that all of the customers are a bother. So disappointed that the service has, seemingly, gone so far downhill at a restaurant with fantastic food and great ambiance."], ["Michael Y.", "Great experience. This place came highly recommended and did not disappoint. I tried the goat cheese, which was amazing, followed by the marinated olives, which were excellent. The meatballs were good and the Sicilian pizza was great. Great atmosphere, great service, great menu, great food. Definitely coming back here."], ["Robert V.", "This is my go-to happy hour spot with my wife after a long work week. Whenever we have a hard day our first thought is to head over to Gervais & Vine and uncork one of our favorite bottles of wine. The atmosphere is one of our favorites for just hanging out and having a light meal with great wine. The staff are super nice, always helpful with a smile, and they go out of their way for us every time. There's usually light live music in the background, a happening bar area, and good crowd. Now that we've tried most menu items, I can say that my favorites are the petit filet, almond brie, and the duck."], ["Rachel G.", "My husband and I had amazing food the last time we ate at Gervais and Vine. This time, we both agreed, was not nearly as good. It was disappointing to spend so much money, and have the food taste \"okay.\" The triggerfish special was cold when it came out, and the duck wasn't very flavorful. The best parts were the Parmesan fries and cheese plate...it should be the other way around. I'm not sure if there has been a change in chef or management, but I'm not sure if we will return in the future."], ["Rick T.", "I have had really great food here and I have had food that wasn't good at all. The servers here are really nice but, I don't think this place is consistent like maybe this place has changed hands or something. We will have to come back for dinner and give it another go. My friends say they mostly prefer to come here for dinner as the lunch is just okay."], ["Ellen R.", "I had been coming here for years and usually have a very good experience. I've recommended it to several friends. Today (10/9/2014) at lunch was the worst experience I had ever had there. I would give it one star if the food I ordered was awful. However, the tasty salmon burger and Parmesan fries are the ONLY things keeping this from being a one star review.I arrived and there was a party of 8, however they were already in the process of having their meal served to them. I placed my order and waited and waited and waited. Did I mention I waited? By this time, other diners had come to the restaurant and were seated and ordered. The place was nowhere near being packed, mind you. As I continued to wait, a 4-top, 3-top, and 2-top (all arriving after me) had already been served. The 8-top that was having food delivered to their table had long since finished eating and had left. The only table besides mine that hadn't been served their lunch was a 3-top that arrived much later than me. I think my server was avoiding me since he rarely came to check on me or when he did, would assure me that my salmon burger was on the way. At this rate, I'm thinking that my salmon is still on a boat off the coast of Alaska. So the food finally appears AFTER ONE HOUR. And the salmon burger is piping hot, so it was comforting to know that it had just been cooked and hadn't been sitting on a counter for 45 minutes, however, this means that somehow my order was the next to the last put in with the kitchen. I normally take photos of my food so I can post them to yelp, but given the serious rumbling in my stomach, the primal urge to feed took over. My server was completely oblivious to the fact that I had been clearly waiting and inexcusably long time. I think he may have been high or had a NyQuil hangover since I didn't get the sense he was 'all there' today. Needless to say, Gervais and Vine is one of my favorite places for happy hour with girlfriends or for a low key lunch, however today's experience greatly disappointed me."], ["Sherrie M.", "The food was great from what we were able to enjoy as we we forced to cut our dinning experience short do to an annoyingly LOUD patron. Kind of funny as we come from Twin Peaks next door and the working class establishment was far more QUIET and enjoyable than a \"ritzy upper class\" restaurant where apparently \"money doesn't by everything\". Hostess was a SNOB! but our waitress was AWESOME!"], ["Sheila F.", "We had a big party of 12. We had tohave ordered everything on the menu.  The filet was out of this world, she crab amazing, lamb yummy, salmon was great!!! Appetizers, wine, Brussel sprouts, asparagus, salad and cauliflower soup... I need new superlatives!!!!  Amazing food , great service and a memory to last a lifetime.  A wonderful, knowledgeable server named Kristin!!!"], ["Sarah L.", "Great food, great atmosphere, and knowledgeable wait staff. We ordered the bartender's special bottle of wine and were pleased with the selection! Must get the Brussel sprouts, garlic fries, Moroccan pork, and try their shrimp feature. Food is TASTY and the atmosphere makes it even better!"], ["John Robert B.", "Let's just start by saying that Gervais & Vine is one of my favorite places to eat in Columbia! I have eaten here half a dozen times over the past couple of years and I have never ordered anything that was great. The menu is very large, but my favorite items are: Seared Jumbo Sea Scallops, Petite Filet Mignon, Warm Almond Brie, Beef Paillardes, and Spanish Asparagus. MMMM....my mouth is starting to water just thinking about it! They also boast a large wine menu, which pairs nicely with my love of wine! If you visit Gervais & Vine during the weekend you'll dine to live music. The atmosphere is quaint, trendy, yet fancy. I will tell you that the prices are a bit on the high end, so we usually reserve eating here for special occasions and celebrations. Have something to celebrate, but don't know where to go? Look no further than Gervais & Vine!!"], ["S H.", "Gervais & Vine did a GREAT job welcoming our large group last night. They prepared a special vegan menu, set out a small spread free of charge and the chef seemed authentically happy to have us. (I did feel badly for the server who handled several odd, borderline rude questions from a lady at my table though.) I ordered the artichoke paella and was very pleased with it. It was simple but well seasoned, reminding me of Mexican-style rice. I also made sure to sample the fresh-made hummus and cornichons. (Love those!) The hummus had a nice, subtle mustard flavor. Thanks again to G&V for accommodating all of us and doing it so well!"], ["Stephanie S.", "Enjoyed a night out with the girls here. The wine selection is top notch and so it the food! We ordered 6 different items and tried them all. The garlic Parmesan fries and Brussel sprouts were yummy! Definitely check it out!"], ["Leah M.", "Excellent wine list with lots of Spanish options. We always start with a spread tray and the Costa Brava never disappoints. Keep in mind tapas are smaller portions, so be prepared to order a couple of rounds. Fingerling potatoes are a personal favorite, and actually come with enough to split. Go on a wine tasting night to chat up the expert. The price is good, and atmosphere cozy."], ["Adam B. J.", "Gervais and Vine was great when it was the only place in town that did tapas (small plates), but as owners, chefs, and managers changed it's hard not to ignore so did the quality.  I fully understand the idea of tapas, but some of the dishes here are just two small for the price.  I realize that you go here for an experience and you order several small plates etc, etc,etc.  My last four dining experiences would have me ranking this lower, but the history of the place makes me say A-OK, as I'm sure I will be back again. I just hope they step their game back up."], ["Julieann L.", "Pretty nice place to eat.  The tapas were really good and ordering a few to try out and share with the family is another great bonus too.The eggplant fries (which we saw many ordered, not just us, so a great sign), the lamb chops, filet mignon, the mahi mahi, and the seared scallops were an absolute highlight! One of the best scallops we ever tried. Downside was the pizza, we had better, and it didn't tasted that great honestly.  It was the last thing to finished andOur waitress was friendly and even when the first pitch of sangria tasted watered down,  she fixed it and it tasted somewhat better. I  don't rave about this sangria though. So the atmosphere was wonderful.Service was helpful and friendly.Tapas and dessert dishes were fantastic.Definitely a place to come and try"], ["Mona D.", "I love trying out new foods and wines. So coming on a Wed for the wine tasting of 4 wines for $7 plus tapas foods fits me perfectly. And the servers are very helpful in suggesting new wines to try.  Nice place to hang with friends."], ["Dale C.", "We usually have great food and service but this time we didn't.  Our spread that we ordered with drinks came out after our entries that we ordered 10 minutes after the spread.  One of our entries came out and it was not cooked.  We decided on something else and had to wait about 15 more minutes after we finished what we had on the table.  The dessert was good.  Will try them again because maybe an off night."], ["Gary G.", "Wish the food was goodWe went for a birthday party. The food was really not good good and the service was bad. The prices were high enough for a four star place but the food was more like lizards thicket."], ["Karen S.", "Gervais and Vine is one of those places I might not frequent on my own, but we had a group event there last night and our group was trying something different for dinner.  Gervais & Vine is probably more known for their wine(s) more than anything (they do have a wine tasting might during the week - but cannot remember day / time).  Me not being the wine drinker, I would more than likely not frequent just for wine tastings.Moving onto dinner.  Tappa = apetizers and was not sure if there would have been more of a larger dinner option than what was offered.  Most meals looked small compared to what is probably considered normal nowadays, but also reasonably priced.  I had decided to go for the safe bet and get a pizza.  I was more or less expecting my pizza to be a flat bread pizza (which it might have been - but crust was a little thicker than I was anticipating).  And there was LOADS of cheese on the pizza.  I am not much a a melted cheese person and the amount of cheese on the pizza was more than I cared for.Given the amount of people in our group (around 30), service was fairly quick after our orders was placed (but everyone was ordering when they came in - which was at different times).  There is a room towards the back of the room (where we were last night).  Not 100% sure if this room is used strictly for group events, or could be used as an overflow."], ["Angie W.", "Our server was really nice and he was very down to earth. The atmosphere was really comfortable but had a naturally formality to it. My daughter and I got stuck in race traffic and decided to eat there so we were actually under dressed. Regardless of our attire they were very courteous to us and we enjoyed our meal.We ordered scallops which were tiny but tasty.    We ordered the shrimp spread and it was very good. The fillet was very good. Eggplant fries were not very good- I think they should have used fresh Parmesan cheese and not powdered to enhance flavor. Overall my daughter and I were very pleased."], ["William K.", "My husband and I were not impressed by Gervais and Vine when we stopped in for a romantic dinner and wine. I am hoping that our next visit here will improve our regards for the restaurant, but it will be some time before that happens. There was not anything that overly impressed us, service was slower than expected and the wine did not color my memories of Gervais & Vine in a positive light. The best summation is to describe the pizza we ordered as one of our dishes. The Greek Pizza we ordered was not well cooked and in some ways could be considered soft. The dough just was not cooked well enough to serve as a base for the ingredients nor were the ingredients tasty enough to serve as the toppings alone. With tapas food, each ingredient, each dish, must boldly carry itself with spices and flavors. The flavors here fell flat about halfway through the palate and only satiated our hunger, not our desire."], ["David A.", "Loved this place. My new favorite in Columbia. Went with my daughter and her friend. We ordered a bunch of different dishes/tapas to share. All different cuisines and everything was excellent.Highlights:The flatbread with pesto was very good. The crust has a unique texture and it works!The mussels with chorizo were great. Nice sized portion as well.The hummus seemed to be blended with edamame. Not sure, but it was delicious.Had to get something not so healthy. Been trying hard to stick to my plan. When you cheat it needs to be worth it. The eggplant fries were worth every bite!Scallops were recommended by our waitress. I am not always a fan. These can be fishy. These were awesome. Melt in your mouth.The chocolate cake for dessert was devoured as well.Service, by Roxie, was very good. My only suggestion would be to space out the dishes more. Just about everything came at the same time."], ["The C.", "Amazing service and selection of wine.  We sat outside. The place was slammed but did not slow down the service or attentiveness of our server. Definitely went with her recommendations for food and wine and they were spot on!"], ["Brooke W.", "Great meal here, each dish we tried was good: gambas, Brussel sprouts, the she crab spread, and the meatballs. Plenty to choose from"], ["Catherine T.", "I've been to Gervais & Vine twice in the last month, and I won't be going back anytime soon. The service is terrible. There's a very nice man who I assume to be the manager, who serves as the hostess/bus boy/waiter - basically everything. He clearly needs some reliable help. The last time I was there was for a friend's birthday, we had a table of 7. When we finished our food, we waited so long for the check that a friend had to get up and go find our waitress. To give you an idea, we sat down at 8, and we didn't leave until 10:30p.m. And we all only had 1 or 2 drinks - it wasn't a crazy party by any means. The food is ok - nothing special, at all. The cheese plate is something you could easily create yourself from Publix. I had the scallops last time and they were horrible. They were served cold and I felt like they had been sitting awhile. I love the idea of this place, but it needs to be revamped, badly. There are plenty of better places in town."], ["Elissa K.", "Great date night place! We enjoyed our wine, pizza, crab dip, and moraccan pork throughly!"], ["Jennifer R.", "Don't come here if you're in a hurry.  A great place to relax with a glass of wine and have a few bites to eat.  Delicious! I had a great time!"], ["Tanner B.", "Love this place!  Everything I have had here was delicious and is always topped off with great service!  Usually start off with the cheese plate - there is a funky looking cheese that they have every now and then that is amazing - whiskey cheese.  2nd choice is usually the mussels - the broth I could bottle up and drink it alone.  Finally topped of with a pizza not sure what it's called but it's the one with all the meats.  Lol!  Defiantly a top choice for me in Columbia."], ["Tiffany S.", "What else do you do on Tuesday at 1pm while you're wandering around?The waitstaff and wine are top notch at this location.I don't remember our waitresses name but she has awesome hair and great knowledge of all the different wines on site.We left happy and wine(y)"], ["Vonnie S.", "I stumbled into this place one frosty night as they were one of the only businesses open after SC got hit with a nasty snow storm.  Service was awesome and quick!  I started with their brussel sprouts (delicious!).  They were cooked with warmed feta cheese and a great starter portion.  I followed up with the special for the day/season which was monk-fish with roasted potatoes.  I am huge fan of fish and hadn't tried monk yet.  To my surprise, it was light and it was cooked in a tasty wine and garlic sauce.  The fingerling potatoes were roasted well with the perfect amount of salt.I sat at the bar where everyone (incl the patrons) were friendly.  Because I sat at the very end near the cash register, my chair kept getting bumped as the wait staff went by.G&V is a quaint little place that I'd like to try again!"], ["JP S.", "expensive for what you get.  for 2 it was a wine by the glass x one for each.  3 tapas and one salad... came to $70 before tip.  Yikes.  Left hungry and filled up with a McDonalds Quarter Pounder.  Service was OK, a bit slow and the volume could be LOUD at times.  But would give it a 2nd chance,  Live music on Wed Night as advertised.  Parking could be an issue."], ["Ricardo S.", "This is not really a restaurant, it is a bar place with something to eat. Quality of some tapas are not so bad, the humus,  the cheese. But the crab was just too hot, and the duck is served with some fat on the top ?? Also, the portion is much smaller that  looks on the pictures here, and they charge $14, for the same money you could eat much more in a nice Thai restaurant. Service is not really good, and the only question asked when I was there was if I would like more wine (which meas spend more money). Don't really care about your satisfaction.DO NOT EVER ORDER PIZZA, then you realized in this place, pizza means some bread with some weird cheese on the top, no marinara flavor.In the end same woman that asked if I want to order more wine, Roberta RM Piroleau asked when I was leaving if I was happy. She seems to have no idea whatsoever about I was talking about, she patiently listen to me and gave me her card, asking me to come back. No promise of better service, just courtesy sentences like \"I am so sorry\" reminds, me an operator from a customer service of any call center.I do repeat, this place is nothing else than a bar, with no atmosphere like a Spanish tapas place, just a name and some words written in French (never specify in the menu what they serve you as \"charcruterie\" which refers to a delicatessen store, pork cool cuts, so I prefer not order it, I am sure was a wise decision, because I am sure was a good way to overpriced some cool cut of pork.If you want to get some drinks, go to a regular bar, Columbia has plenty of bars.BIG DISAPPOINTMENT !  DO NOT RECOMMEND TO GO."], ["Jay M.", "Coming from out of town for homecoming we decided to take our group out here after the game. We made reservations about a week in advance and showed up to the restaurant to find out they were closed for a private party. Don't you think they could at least call to let us know so we could make a reservation somewhere else? I assume the service inside would have matched this kind of treatment so we will avoid this place on our trip for the next game."], ["Christopher K.", "This was my first time Gervais & Vine. As a vegetarian, I found a very good number of small plates to be able to make a meal and probably come back several times without repeating too many.  I went with a small party and split a bunch of dishes - as you should when eating tapas.  The food overall was good but I kept thinking that some of the dishes were falling just short.   For instance, the brie plate would have been vastly improved had the brie been baked and served runny.  The stuffed grape leaves were good but could be easily improved by adding fresh mint, currants or toasted pine nuts to the stuffing for a little more flavor pop.  The pizza crust needs to be completely changed and made in house to take advantage of the oven that is boasted about on the menu.   Expect to eat about three small plates per person.  You might be able to get away with two if you choose particularly heavy items.Minor complaints aside, I found the atmosphere festive without being too loud and the wine list very nice.  I'll probably head back within the next month or so to try some of the dishes we didn't order."], ["Jennifer M.", "We ended up here based on the menu we saw here on yelp. As it turns out, it was the wrong menu (somehow, another restaurant's menu shows up instead). However, it was the happiest mistake ever! We were there with a small group for a work event and decided to stay despite the menu mix-up. The tapas were great sizes, and fantastic flavors. Everything we had was amazing- meatballs, shrimp, lamb, duck (my favorite), olives, cheese and more. The wine selection was good without being overwhelming and all-in-all it was a great value."], ["Emily C.", "This place is adorable, very chill and super friendly. We got great drinks and recommendations for places to go dancing. Order the  Moscow Mule and ask for a shot of their home made ginger syrup to go in it. The food is excellent. Highly recommend!"], ["Ethan P.", "First off, I feel I should say our waitress was awesome.  She was attentive and apologetic. She did an excellent job considering how understaffed the restaurant was. We ordered seven dishes but had to cancel one because the service was incredibly slow. Thumbs up for the she crab dip and the spicy gambas. Conversely, the filet mignon and the brussels were mediocre at best. The filet tasted as though it was thrown on the grill haphazardly after being cut. It was dry and boring. The brussels were overcooked and the goat cheese was an unnecessary addition. The bacon worked though. Notwithstanding slow service and a bit of disappointment with some of the dishes the wine selection was quite interesting. Hopefully this was a one-off that won't occur again. Our advice: do dinner on a weeknight for a better experience!   Stay away from the filet!"], ["Damon S.", "LOVE this restaurant! My wife and I are fans of tapas and the food here is fantastic. Very nice ambiance also. Staff is friendly and prompt every time we're there. Only reason I took a star away is because they are a little stingy with the wine, and actually have lines printed on the wine glasses for the bartender."], ["Alli O.", "This restaurant has a very fun atmosphere that would be a great place to listen to a live band and enjoy a glass of wine.  However, it is not a great place to have dinner.One of my friends had her boyfriend visiting from out of town and she wanted to have dinner and go to a few bars in Columbia.  She stumbled upon this place via Yelp and thought it would be a great option.  It would have been if we came to Gervais and Vine for wine or a small appetizer, but for dinner I was incredibly disappointed.  My husband and I ended up paying more than we would have more a normal dinner on a few bites of food!  (And my salmon was not cooked all the way through!)If you are looking for atmosphere and wine this is the place to come... dinner not so much!  The garlic-parmesan fries were good if you go!  :)"], ["Sherlene L.", "This place is one of the best in Colombia SC sat at the bar and felt so welcomed! The manager was people friendly!! He sat there an talked to me personally. The food is great. Chefs are also people friendly. I felt so welcomed. Truly great customer service. The way it should be anywhere you go."], ["Adam P.", "Having lived in Columbia for more than a decade, G&V has always provided a consistent comment upon leaving, \"why don't we come here more often?\"The food is creative, the specials are always wonderful, the wine and beer are hand selected and awesome values."], ["Mike M.", "I must say, I've missed this place! About 10 years ago, my job had me traveling in this area a few months out of the year. I got to know the restaurants in Columbia very well! Gervais & Vine was one of my favorites! For the uninitiated, tapas consists of small portions of different dishes meant to share, like appetizers, but the whole meal is that way! Today was a blast from the past of sorts! I started with an Ensalada Verde, basically mixed greens w/ balsamic vinaigrette. Next I tried Grilled Brussels Sprouts with Bacon, Feta and a White Balsamic Reduction. This was a stretch for me because I've never had Brussels Sprouts before. I have to say, personally, that the addition of the other ingredients didn't make it particularly palatable. I only managed to eat two of the ten sprouts! Luckily, the waiter was able to remove it, even though I was perfectly ok with it remaining on the ticket. I had to add Garlic Parmesan fries mainly to get the taste of Brussels Sprouts out of my mouth and rounded out the dinner with Herb Grilled Lamb Chops! Perfection! All in all, it was a very good meal. If you happen to be in the neighborhood, give Gervais & Vine a shot! You won't be disappointed!If wine is your thing (it isn't mine), I hear this restaurant has a very good wine selection!"], ["Richard H.", "Really well done. Very relaxed atmosphere, fantastic tapas, and great wine selection. Not quite like being in Spain but they're trying."], ["Magan C.", "A very cozy find on Gervais Street, perfect for that romantic evening or intimate gathering with friends. The wine list was extensive enough to accommodate anyone's fancy and there was a grape to compliment every entrée. We started with the Costa Brava and it was an exquisite blend of creamy cheese with hints of bacon. Loved it! We finished with the Gambas (be sure to ask for extra bread to sop up the sauce). The Gambas had just the right amount of spice and bold flavors with tender succulent shrimp cooked to perfection. Amazing! Can't wait To go back!"], ["Annie F.", "Delicious tapas I would recommend the gambas-great sauce, the artichoke hearts and the garlic potatoes! Delicious delicious"], ["Swetha G.", "I.had.TWO.foodgasms.tonight. Holy f$$##!!!I've been to Gervais & Vine a handful of times over the last few months but tonight the food was an A++, the best I've had at the place, EVER!  My friend and I ordered four dishes and split a dessert and everything was phenomenal.  The eggplant fries were soo much better this time than the last time I had them.  The crispy exterior and tender and juicy interior were equally PERFECT.  I absolutely loved the side honey yogurt dip and romesco sauce, they both were A-MAZING! I got my first big foodgasm from this plate alone! I also had stuffed grape leaves that were mouthwatering.  The Roman pizza was just as good today as it was when I had it the first time.  The spinach artichoke spread was heavenly.  But my ultimate and final foodgasm came from the Chocolate Hazelnut Torte, which was THE best way to end an already over the top dining experience. I fell head over heals for the chocolate fluffy ecstasy, there's no other way to say it.  Todd my man, you've got mad culinary skills!"], ["Joe G.", "This place is an absolute joke. My first experience at Gervais & Vine consisted of many different plates of overpriced, undersized, and mediocre (at best) food that was shared between a group of six friends. We came for \"jazz night\", which was listed at two different times on the menu and website, but that wasn't an issue since there was no jazz anyway. Our waiter told us that sometimes they play jazz over the sound system, but that there hadn't actually been a live jazz band in a long time. When asked how their sangria was (it is watery, flavorless, no fruit), our waiter told us it would \"get us drunk\", and while we were all pretty taken back by this unprofessional remark at the time, in hindsight- I wish it did. Perhaps then we would have been intoxicated enough to not care about the rubbery, insipid cheese plate and cold empanadas. Our group of friends had multiple Living Social deals between us, so we all fought over who could use their's on the check (only 1 per table), because nobody wanted to go back. Unfortunately, I did not win that battle, so a couple of weeks later my girlfriend and I went back to burn the Living Social deal on some wine and dessert because how bad can that be, right? Bad. It can be real bad. After a brief glance at the uninspiring, grossly overpriced wine menu, we decided on ordering a couple of glasses of port to go along with dessert. Being a fan of both the Sandeman Ruby and Sandeman Tawney ports (which they had listed on their menu), I asked our waitress how the Sandeman Reserve compared to the two. Laughing, the waitress told us that she has no idea, because \"usually, people don't ask about the dessert wines so we sort of just pour them whatever\". She said that she wasn't even sure if they actually had those wines in stock. Nevertheless, she went in the back to see if she could find out any more information on it, and came back with a sample for me to try. She said they did not have the Ruby nor the Tawney in stock, and the wine I was about to taste wasn't actually a Sandeman Reserve, it was \"something else that they just say is Sandeman\". After I asked what wine it was then, she went in the back to fetch the bottle, came back with it, placed it down on the table, and said, \"this one.\" For dessert, we ended up ordering the almond joy bread pudding, which was miserable as well. If you are looking for a tapas style restaurant in Columbia, do yourself a favor and go elsewhere. 116 and Mamas and the Tapas are both better options, as is just ordering a few different things from the McDonald's dollar menu and calling that tapas."], ["Anthony D.", "I am waivering between 3 and 4 stars.  I ended up with 4 because it was a cool place with friendly people.  But it was the pianist on site was so unbelievable talented that ultimately I have to go with four stars.  I wonder if the bar knows how good he is?!Started with a mixed green balsamic salad with Gorgonzola, strawberries and spiced almonds.  Excellent! Something so simple but was perfect!  Olives were great.  Flatbread was doughy and tasteless.  The pizza looked great on the menu.  700 degree stone oven, etc. Call me a fool for ordering pizza in SC.  It reminded me of airport pizza.  I guess I expected a thin crust, brick oven charred pizza.  Nice wine and beer selection and outdoor seating too.  I'm sure there are better places in town but worth a try.  Just don't get pizza if you are from NJ or NY like me."], ["Thomas V.", "I came once with friends and shared a bunch of tapas and a bottle or two. The wine pricing and selection is OK. But the food is poorly executed. It's one of those places that looks nice and doesn't taste bad but you leave wishing the ingredients were a touch better and the preparation was much better. Not a bad place but I would only recommend it if you are looking for a new place to try. Hopefully for you it turns out a little better than me."], ["Jeff B.", "What a wonderful owner.  I love to sit at the bar and have some small plates.  I am really excited that they are now open for lunch.  I look forward to returning soon."], ["Sam T.", "Tapas Tapas Tapas...wonderful Tapas.  They aren't like spectacular, and they certainly aren't for someone who is hungry.  If you are hungry...maybe...go to another restaurant.  If you are enjoying a good time with friends or family come to Gervais and Vine.  I have had better Tapas before, but any of their meat courses are very well prepared.  A decadent duck, fantastic fillet, and scrumptuos sirloin.I personally do not want to watch someone prepare my food, and that is what happens at this restaurant.  I also wish they had a risotto option or more pasta/rice options.   All in all...they are okay"], ["Jennifer B.", "I really enjoyed everything I tried at this restaurant. Great vibe and nice staff :)"], ["Emery E.", "Wow! Having lived in Columbia for only 6 months we finally found our spot! My wife and I get out about once per month to eat childless. We were suggested this restaurant to eat at, and they more than delivered. We love great wine, and they had delicious wine at great prices. The food was well prepared, and delicious. On top of that the atmosphere was brilliant. Not your quiet  whispering kind of place, everyone in the restaurant was having just as enjoyable of a time as we were. We typically go out and spend a lot more on subpar food, so it was a relief to have great food, great wine, great service, and a bustling atmosphere on Saturday night and spend less."], ["Erin L.", "great tapas and great sangria"], ["Lisa H.", "Smoked salmon...fabulous! Eggplant fries are the best!!! Gambas shrimp and seared sea scallops...out of this world. Super busy even on Monday night. Sat at the bar so pretty good service. Highly recommend this restaurant!"], ["Emily E.", "We tried the bruschetta, herbed flatbread, lamb chops and beef paillardes which were all tasty but the service gets an F.  Our food arrived at a good pace, however getting the attention of our server after that was virtually impossible.  It took 5-10 minutes for drink refills, and at least 10 more to get our bill.  She would walk by our table several times, clearly showing preference for larger groups (we only had 2).  My recommendation: only eat here if you have a group of 4 or more and/or have a lot of patience!"], ["Shon I.", "Great little place with some wonderful food. Really nice eggplant fries and fried Zucchini flowers. If you set at the bar you can watch the chef prepare many of the tapas"], ["K W.", "Unfortunately the only thing good I can say about this place is the atmosphere is warm and the drinks are cold.  The mussels were slimy soaking in a bowl of juice that resembled the taste of the water the mussels were washed in.  The meatballs tasted frozen.  Lastly, the flat round was not impressive, store bought with old ingredients added.  I will not be back anytime soon for the food!!"], ["Marcus M.", "The food, music, and wine...all on point!"], ["Rich M.", "My fiancé and I came here for our last date before getting married. I'm not sure if its possible for us to have had a better time. The tapas are the best I've seen in Columbia. The service could not have been better either. We loved our visit and are definitely coming back. I can not recommend Gervais & Vine enough."], ["D G.", "Food was great....service was TERRIBLE!!!What we thought would be an nice dinner took over 3 hours...there were only 2 of us. Our food took forever and we rarely saw our waitress. Yeah it was Saturday and they were busy...but don't you want your restaurant to be busy? They clearly don't have the capability to handle that sort of situation. I probably wont go back. There are too many other (and better) restaurants in Columbia."], ["Dave M.", "Great wine and tapas bar. Never a bad meal."], ["Jen M.", "Great wine and tapas! A fun place to grab dinner and drinks. The specials are usually pretty great."], ["Kirsti N.", "A gem in Columbia that is just as much fun sitting at bar watching the tapas get cooked as it is eating them. I have yet to have a bad meal here, visiting when I'm I'm town from Charlotte."], ["Gunnar P.", "I am a regular here and just have never taken the time to give them a review. I was there again on Saturday evening. The food was good as usual. Service is always great and they have and excellent wine list. It is one of my favorite places to go in Columbia. I highly recommend it."], ["Thomas L.", "Great restaurant! The wait staff is very friendly and laid back and the food is amazing! I will definitely be back again. I only wish they would take reservations. The wait for a table was a little bit long but worth it in the end (45 minutes)."], ["Kevin C.", "I have loved Gervais and Vine, so when my parents came into town, I took them there tonight. After being told our wait would be 30 minutes, it was 2 hours. We only waited because we kept being reassured we would be seated soon. Once we were finally seated, our table was cleared (slowly), we had to ask for menus, utensils, plates, and water. We were stranded for 15+ minutes without a waitress. She was the highlight of the night. The food was good too, but after an hour and a half we still hadn't received it all (it was all ordered at the same time). So we asked to speak to the owner who made excuses without actually taking ownership for the poor service. They did finally decide to cover our tab, which was the right thing to do, and while I love the food, and it was still good tonight, I have never felt more disrespected by a restaurant and it's owner. This was a 4+ hour affair and I never got my order."], ["Paul B.", "We moved to Austin from Columbia, and Gervais & Vine is one of the VERY few things that make us miss SC.  We've always had a good time when we went - frequently, a little too good :-) .  It is a Tapas restaurant, so don't expect huge portions.  Expect exceptional food & fantastic wine.If they still offer the wine club - I cannot, repeat CANNOT recommend it highly enough - it took us from total wine n00bs to, well, we're still not experts, but dammit, we're certainly had fun learning!"], ["Sally B.", "This was a staple restaurant for us when we lived in Columbia. I have NEVER had anything bad here. Kristian and all of his staff are AWESOME! They are very knowledgeable about wine..duh AND the tapas is incredible! Try it all!!!Nothing beats nice weather, sitting outside sipping some yummy wine while munching on some delectable tapas! Perfect!Also of great mention is the Wine Club!! Two words..JOIN IT!"], ["Nicole S.", "My lovely friends took me here for dinner the other night, and it was delightful.  Cute little place!  Great ambiance and they had a great little jazz duo playing as well.  The staff was very friendly and helpful with the menu and drinks.  The wine list was great and quite affordable (of course, I'm used to NYC prices).  We started with a trio of spreads, The Roasted Garlic-Buttermilk Blue Cheese, Costa Brava (blend of Smoked Gouda, Shrimp and Bacon), and the She Crab.  This started a heated debate of which one we all loved more, there were a lot of taste tests to make sure.  The Coasta Bravo won hands down, but everything else was a close second.For our dinner we had an array of delicious dishes.  The scallop and pork plates of the day were fabulous.  The Petit Filet Mignon with Feta and Balsamic Reduction was very nice.  The Grilled Shrimp with Sun-dried Tomato Pesto and Garlic-Parmesan Fries with Spicy Aioli were both delish.  The biggest disappointment for me was that the almonds on the Tapas Combo - Spiced Almonds, Olives, marinated Manchego Cheese, were just regular almonds and not marcona... which would have been more traditional and tastier.We were too stuffed to desert, but I'll be sure to try it next time I'm in town!"], ["Emily E.", "The lamb chops, herbed flat bread, bruschetta and beef paillardes were tasty but the service was horrible!  Our server spent all her time with larger parties and ignored my party of two.  We waited about 10-15 minutes to get refills and the bill. When she brought the \"bill\" there was no check in there so we ended up waiting even longer. My recommendation: only eat here if you are with at least 3 others and/or have a lot of patience!"], ["Curt K.", "Nice atmosphere! I walked in, sat at the bar, had a nice tempranillo and listened to some nice, live music. The staff was courtious as well. I'm looking forward to going back and trying more on the reasonably priced menu."], ["Amanda W.", "Have found some really nice new wines! I'm a 'Red Girl', and this lovely little place has introduced me to some reds I never even knew about! The selection of tapas is so cool - I have tried just about everything on the regular menu, and I have to say the olive plate and the cheese plate are my fav!!! I love the fact they have nightly specials (at really great prices), and the fact that the owner/chef emails us regulars with what's been going on in his awesome cooking/wine world and what's coming up at his 2 restaurants. A+++ I LOVE going there!"]], "La Isla Bonita Restaurante": [["Ginnette R.", "The best Puertorican cuisine in Columbia, SC Fort Jackson area. Delicious home cooking. I felt like home. Closed Mon-Tues"], ["Rob Z.", "I was in Columbia, South Carolina for my son's graduation at Fort Jackson.Stumbled upon this place when I got off the interstate.Saw my proud Puerto Rican flag and had to inquire.We all went there after my son's ceromony and was not disappointed.Owners made me feel like family and had my favorite Puerto Rican beer....Medalla.I had a Mofongo with Pernil (Roast Pork with Plantains and Pasteles (Meat Pies) and a little salad.Made me feel like I was back home...Will definitely be back if I'm ever in the area.They only reason I'm giving it 4 stars is because nobody cooks better that mom...lolProud of Mi Gentes..."], ["Gilberto M.", "I know that it can happen anywhere but unfortunately for us we found a tiny cockroach inside the beans. I couldn't finish my plate because of an upset stomach. The hot sauce and the green sauce were great. Mofongo was dry and the passion fruit juice was not that great. The Medallas beer were great, you can not At least for a long time I will not return here. Unfortunately is the only place close to home in Puerto Rico.   Too bad it happened to us the first time. I have been wanting to go to this place for a while. I can now say I went there."], ["Tashie W.", "The food is not worth the price. Please don't base your idea of Puerto Rican cuisine or restaurants off this place. Despite that comment I have to admit the food isn't the worst so when I don't want to cook but have a severe craving I give in and settle for the only Puerto Rican restaurant in Columbia that I've found."], ["Karen S.", "I was not sure what to expect going here with a group of friends last week. First of all, this place almost sits in the middle of nowhere and I almost passed the place up (and it did not help it was after dark when I came here). And the restaurant is not that big to begin with, and it did not help that there was a big group of us going (like 20+ people in our group). I arrive a few minutes late and since the place is not big, there is not much parking. Big group + small parking = not a good thing. I wound up parking slightly past the restaurant. I do agree with some of the other yelpers that the place could use an uplift.On to the food. Not having eaten much puerto ricin food, I was not sure what to expect. My first disappointment was that the menu is not that big. I am not sure if it is just the restaurant, or if puerto rica does not have much in the way to offer in the way of food. Not sure exactly what the name of the dish I ordered, but essentially it was fried chicken pieces in some kind of edible bowl. Chicken was OK, but could have done without the bowl.  There was another chicken dinner I was eyeing, that did not have a bowl, but rice, which I wish I had known the beans came on the side or I would have ordered that instead since most of the \"bowl\" wound up in the trash. Really the only plus was for the size of the group, the food came out fairly quickly after we ordered. If I lived or worked close to restaurant, I might give an"], ["Ir M.", "Real Puertorican Food!! - I love this place... Malta's, Empanadillas, Carne Frita, Mofongo, Mondongo y Cuajito todo fresco y delicioso.Love the plastic utensils, plates & bowls.....great idea! - a little place away from home. Mi Isla del Encanto. Te Amo!#"], ["Rick T.", "This place is like minutes from my house and it has changed hands many times so I was skeptically of going as the other places were hit or miss. We arrived and the owner said she didn't have English menus for her specials. That didn't matter because my friends from Puerto Rico instructed me to get the mofongo with roasted pork as it was her favorite dish. So I ordered some empanadas and some potato balls with beer. The appetizers were good with the hot sauces she had on hand. After scarfing down the apps we moved on to the roasted pork mofongo. Picture a bread bowl w roasted pork, but instead of bread it's plantains. It was really filling and it took both of us to finish it. This is a no frills small mom and pop place that is what it is. I went back with some friends and few days later after a night out and the owner let me try a few new things that I didn't get to on my first visit. You can catch this place at the Latin Festival in August I'm told by the nice lady who owns this spot."], ["Rico R.", "Service was great, I didn't had enough money with me and the nice lady gave me a water bottle for free. I had arroz con gandules and pernil and it was REALLY good, the wife had steak with onions and it was really good to. The mofongo with shrimp a gentleman ordered smelled great, you should try that too.The price was very reasonable and the only down side was the parking size."], ["Pj P.", "Great little place just off I77.  It' small, has a short menu? But the food is authentic, has a homemade caring vibe and the help is fast and friendly.. Watch for their specials on their Facebook page.  Today they had beautiful fried snapper."], ["Mark W J.", "I lived in Puerto Rico for many years, and I love the food, the music, the culture. Being in this small establishment this past weekend was so much like being in a mom-and-pop place out in one of the small towns on the Island. Yes, the parking is crazy and crowded; exactly like in Puerto Rico. Yes, the dining room is small; exactly like in many places in Puerto Rico. This is not a watered-down-for-mainland-American customers version of cooking. It is comida criolla cooked by Puerto Ricans for Puerto Ricans the way you would find at abuela's house, if you are lucky enough to be invited. The rice and beans brought back great memories. The mofongo was something you can't find done right most places. Classic salsa music playing on the stereo. The clack and rattle of the domino playing near the cash register was like I heard so many weekends in Puerto Rico. Icing on the cake, as far as I was concerned. What a nice surprise to find Isla Bonita right next to the interstate in Columbia, SC! Dinner at Isla Bonita is much cheaper than a plane ticket to the Caribbean nowadays. You can get a real taste of life in Borinquen here."], ["Angel R.", "Food is always good and hot! A little slice of Home per say. When he prices come down, review stars will go up! Be ready to pay over $1.50 for a can or juice.... Ridiculous."], ["Ed M.", "A little too casual with plastic plates and utensils to earn a 4 star.  Good tostones, not overcooked as some places tend to do.  Mofongo was good, washed down with a malta at a reasonable price."], ["mirelys m.", "I want to like this place because my allegiance is always to the little guy, the underdog, the humble hard working small family business owner. First of, they need a small business loan and remodel this ugly old dirty shack of a restaurant and please get rid of the Puerto Rican flag curtains...oh lord sacrilegious!' It made me feel like I was walking through some ghetto ass borough in NY city where everyone feels the need to hang Puerto Rican flags from all their windows.  That isn't pride people that's straight up ghetto... Please stop it now! Oh and don't get me started with the clear plastic table covers, you know the kind that stick to your elbows, and the plastic plates and yes you guessed it the plastic utensils they give you to eat a dried up overly fried pork chop!!!! Wait it gets better, the pastry empanada warmer in the counter...OMG!!! That boy  hasen't been wiped clean since the day it was purchased. This reminds me of my mothers good old saying that went a little something like this \"We have no control of being born poor, but do we have to be dirty too? \". I took a glance at the kitchen and again it wasn't pretty. I'm 100% sure these people can't pass city inspection, it just isn't possible. And can someone please tell me why are there iron bar rails in the windows and door, are we about to get shoot up? What are we trying to keep out or stop from coming in? Mmmmmm I wonder. If the food isn't going to be all that great, and the place isn't much to look at then at least give me something to work with like maybe good ambiance or relaxing atmosphere or cold beer. Anyways, I ordered the Cuban Sandwich, ok here we go, aside from the pork been tender and well seasoned they added a thick (not thinly sliced piece of cheap ham, some white unknown processed cheese (not swiss cheese) and tons of mayonnaise ( no traditional spice mustard).  Look I lived in Miami for many years I know Cuban Sandwiches.  Also, they have no restaurant ventilation system because my hair and clothes smelled like I was the one slaving in that kitchen the entire night. I will end this review on a positive note. The only reason for my one star is for the female server who seems to be the only one running the show. She was great, very attentive and sweet. The rest of the useless men she has working in there need to be fired because all they did was followed her commands."], ["Natasha C.", "The place is great!! My family and I ordered all of the appetizers and I ordered two entrees just for myself and i wasn't disappointed. The roast pork mofongo was on point and the alcapurrias tasted almost as good as my abuela. Happy to have this little slice of home in the middle of the south. The only reason I'm giving it a 4 and not a 5 is because they didn't have avacado or bistec empanisado which I think are a must have at any Latin establishment. I will definitely be coming back!!"], ["Senita K.", "The place looks like a dive, but the food was very good.  I enjoyed the alcapurrias. The rice w/pinto beans were good and so was the pernil. They need to keep the place immaculate otherwise people will not go there."], ["Leonor C.", "Awesome food! This is authentic puertorican food. I had papa rellena, which was fresh. Empanada de beef, really good. I also ordered mojongo with shrimp and octopus. This is the best mojongo I ever had. It had so much flavor and the octopus was so tender. They served alcohol as well. It is a very comfortable atmosphere. It feels like home. The employee was a sweetheart, and gave us perfect service. They will be open for the 24th of December and probably have great food."], ["Michelle E.", "I had high hopes for this small, neighborhood restaurant, but I was not impressed. We sampled three appetizers. All were deep fried, which isn't a problem, but it seemed like the plantain ball was over cooked and the empanada did not appear to have been made on site. It looked and tasted like a frozen, mass-produced product. What a disappointment!We ordered the Mofongo with garlic-sautéed shrimp and the rice with roasted pork. The shrimp were frozen salad shrimp and although the sauce was okay, I couldn't get past the disappointment of those salad shrimp. I expect that kind of thing from a big line buffet, but not a specialty ethnic restaurant. The plantain basket had little flavor. I added a good bit of salt.The rice with roasted pork was more disappointing. The pork looked like it had been cooked at least one, maybe two days earlier. It was dry around the edges. You could tell that there was potential for goodness, because the sauce had a good taste, but frankly, it was like getting leftovers. It wasn't fresh. The rice was okay, but seemed old, too. It broke too easily, like it had been cooked and held and then over steamed. The fried plantain that came with the plate needed seasoning. It was bland. The salad dressing they brought to the table added some flavor to the plantain.I'd never eaten Puerto Rican food, so I asked my friend if he thought it was supposed to be bland. He has been to Puerto Rico and said that he'd expected it to be much more seasoned. It was as if there were no spices or seasonings added to the food. It was bland and boring. I was disappointed.The place is small with cheap tables and chairs and plastic tablecloths. That's okay. I sort of expected that kind of thing. Everything was served on styrofoam plates. The bottled water ($1) was brought out with a small paper cup. On the plus side, it seemed clean and neat and I had no stomach upset after eating there, so they are probably taking care of the kitchen cleanliness and food handling. It seemed like everyone who was there knew each other, possibly family? Which is great. Love to see that kind of support, but I do not believe the quality of the food will bring non-family members back for a second time. Once was enough for me. I was hopeful that this would a great, local flavor type place where I could take friends for an unusual dining experience. But I won't return and definitely would not take another friend there. I'm really sorry  to say that, for I had high hopes. This place needs some spice!"], ["Shanti M.", "Real authentic atmosphere. I felt like I was back in  Puerto Rico. The food was hot and fresh. Also very very tasty. I'm a Nuyorican so this was a pleasant surprise to find real Puerto Rican food in the middle of The South. I will definitely be recommending this place to family and friends."]], "Arkos Mojo Grill & Martini Bar": [["Faye L.", "Must go to enjoy. This cafe is exceptional. Drinks and food very good. Already recommended to a number of couples since going last week.  treat yourself to excellent service and an enjoyable meal.  Cheers!"], ["Brad R.", "Dinner was amazing, only reason not 5 star was the wait on the first Mojito and the entrees. Alli had the Baja Pescado Tacos, they were excellent and I had the Mofungo which was also excellent. The Mojito was very good and server was awesome."], ["WanderLustinDani P.", "The food, flavor, atmosphere was very pleasing, much to be desired, presentation of the food was Excellent. Not a huge menu, but offering something for everyone. My husband enjoyed the homemade tacos and calamari. Martini's were on point!!! The shop was both clean and tidy, having plenty seating. The hostess/ waitress was attentive at all times. Staff members there greeted us in/ out when we left. The food was more than filling, loved all the dishes thus far. We will certainly be returning soon and would recommend this facility. My husband and I loved this place."], ["Emily E.", "Last night I had a hankering for something that would excite my taste buds, and the run of the mill restaurants in Columbia just wouldn't cut it, so I ventured out to the brave new world of Lexington to give this place a shot.   After seeing the rave reviews of the Avocadotini, I started with that and finished it in less than a minute (tipsy alert!!)  The avocado gave it such a great texture, so it reminded me more of a smoothie than a martini, but oh so very delicious.  It was Taco Tuesday, meaning several of their tacos were only $5, and I tried the Ahi Tuna ones.  They give you the option of flour tortillas or wonton tortillas, so I went with the safe option, flour.  They were lightly grilled on the outside and the sesame crusted tuna was cooked perfectly.  The flavors in the taco worked really well together and I was wishing I had ordered more than 2, but the kitchen closed at 8:50, so that was somewhat earlier than I had expected for a weeknight, but that just means I'll have to come back soon.  Honestly all the entrees and tacos looked amazing, so it was really hard to choose.  I want to come back to explore the rest of their menu and hopefully check out their rooftop seating which seems to only be open on the weekends.The patio tables are nice and there was live music as well, so it made for a relaxing evening.  The only disappointment was seeing ceviche listed on their website menu, but it was not on their actual menu.  When I asked about it, I was told it was only available seasonally and that \"drink\" might be back in the fall, ha!  It's so hard to find good (or any) ceviche in Columbia!  I will be back, this place has a very unique menu and the taste does not disappoint."], ["Pate A.", "Went for Sunday dinner and found a brunch only menu.  Kinda disapointed in that.  I was looking for authentic cuban food but found a more tex-mex food.  The atmosphere is more like the bar scene with loud music that I could barely hear my wife talk.  Fun and festive,  loud, yes if that's what your looking for.  I had an omelet that was really good though.  My wife's food was scrambled eggs were good too.  Wait staff was good too.  It's a good place if that's the type you want.  We were looking for a more family oriented authentic cuban restaurant which didn't seem to work.  We just came back from south Florida so we missed the food and gave this a try."], ["Michelle C.", "Ew this place was gross, food and surroundings. The bathroom was horrible. God and the bartenders sucked. They were incredibly unprofessional."], ["Jason M.", "My wife and I, along with another couple, went here on 4/18/15. My initial impression was the place was rather small.  The other couple with us, who had been here several times before, assured us it would be amazing. We started with an appetizer of Yucca fries and assorted salsas. The yucca fries were amazing and a must have. The salsas were also fresh and exceptionally balanced between sweet and spicy.We ordered several martinis around the table. Between us all we had several Avacadotinis (very tasty), several La Rosa (I would recommend as a desert drink, very sweet), a Caramel Appletini and a Cranbiscus. All of them were expertly mixed and very good.For the main course I had the Shrimp and Grits and the other three had the Chimichurri Steak. My entree was superb. It was rich and creamy with a bit of spicy flavor from the andouille sausage and chorizo. The rest of the tables steaks were cooked to perfection and had a lovely presentation.Throughout the meal our waiter took the time to explain what each item was and the ingredients that went into it. He was knowledgeable on each menu item and drink we asked about. I especially appreciated the attentive service he provided. I know it can be hectic and their time is precious but I was very thankfully for his services.Overall I highly recommend this establishment. Great food, great drinks, friendly staff and all for the right price."], ["John S.", "If I could give 10 stars I would.  The food was on point across the menu.  We got the trio salsas for $11, tomatillo, mango, and the other one I cannot remember. Note: they cook the chips to order (only two bowls of chips).  A dollar a bowl after that.  Trust me the chips and salsas were off the chain.  Taco Tues is worth going to.  Two sizeable tacos for $5.00 and margaritas $5.00 same night."], ["Scott P.", "My son and I went last night for the first time. Got the free chips and salsa via yelp app. Chips and and salsa were both very fresh, salsa was a bit bland for me. The little man had the Cubano which was excellent. I had the bbq pork tacos. The pork in them is good and flavorful but the whole thing together just becomes a big pile of mush with with no texture at all. I appreciated the server who seemed genuinely interested in why I didn't eat much of it as he wanted to let the chef know. I like that  Also, great beer list and very interesting cocktail menu."], ["Andrea R.", "We just moved to the area and were so happy to have found our new favorite hang out spot!!! We went here for the first time on a Friday night and sat upstairs in the new rooftop deck area. We were thrilled that they had an acoustic guitarist there, even more thrilled that he was excellent! We ordered some drinks and some guacamole. I guess the owner thought we waited long for my wine so he gave us a free order of salsa for the wait; it was really nice and showed that he went out of his way to please us! The salsa was good and the guac was ok, I think it was little on the limey side for our liking.  My husband ordered the Pollo Loco (chicken tacos) that he said were excellent. They came with wonton strips and he really liked the lime aioli! I ordered the Camarones Gordos, which was a shrimp and chorizo salad. This might be one of the best salads I have ever had. The serrano-lime vinaigrette was SO GOOD. From the first bite to the last I loved it. Instead of croutons my salad came with wonton strips which I thought was different but fit so well, it also came with bacon. I think I probably had 5-6 strips of the crispiest most delicious tasting bacon. Overall it was a fantastic meal. We really enjoyed the atmosphere; the string lights and music are a perfect setting. The owner came over and talked to us for a bit and explained how they were planning to have live music almost every weekend which was music to our ears! We love relaxing, having some drinks and listening to live music.  We will definitely be back!! Great food, service, people and environment!We've been back a few times since our first visit and I just had to give an update! We went for brunch, oh man was it good! I had pancakes, extra crispy bacon and eggs..everything was soo good! The pancakes had a unique taste to them, much heavier than average but I really enjoyed them. The bacon was spot on! My husband ordered the shrimp and grits, we both agreed they were probably the best shrimp and grits that we've found so far down here! We also enjoyed the $10 bottomless mimosa special, you can't go wrong!We then returned on Thursday night which is also Ladies Night and $5 martini night! I enjoyed the avocado martini SO much! Wow, it was so different, I was scared at first but I ended up loving it! I ordered the chimichurri steak which was outstanding, I ordered extra chimichurri because it was that good! It also came with a corn in a cream sauce and potatoes cakes, overall fantastic meal. My husband ordered the shrimp tacos which he really enjoyed, along with the mango salsa, we can't wait to come back!"], ["s w.", "Awsome waiter that made us feel welcomed and made great suggestions for dinner.  Food was awesome, small portions but flavorful.  Dirty martini slightly too dirty but waiter took them back and made them over."], ["Ruth J.", "I was a little more than skeptical of a Cuban restaurant in Lexington & I almost declined the invite...really glad I didn't, because this little place is kinda awesome. The service is great! The food is authentic & delicious...shocking for Lexington, right?! The manager or owner, I'm not sure which he was, came around to chat and discuss the food. As Hispanics we're pretty snobby when it comes to food, but the chef shut us right up with one bite... It was impressive. The drink menu is pretty eclectic and not overly ambitious, which is great. The drinks were well made and authentic as well. BRAVO!! Loved the area too. Cute little spot, tucked behind the Flight Deck. You'll be drawing crowds to Lexington for sure!!  This place is well worth it. We really hope they add on desserts soon. Great job!!!"], ["Karen S.", "Kudos for Arkos making their restaurant have a nice, intimate feeling (not too big), and quick service after orders were placed.  They do have rooftop seating as well (mainly for outdoor music performaces on Thursdays and Fridays - I think).Do have to admit, their focus might be more on thier martinis / bar service more than food, as there was not a big menu of food items to choose from, mainly appetizers or smaller dishes that could be shared among your party.  Do like that there is a different specialty of food here (Cuban) that is close by to where I live, but even after looking at the menu, there were really only a couple of dishes I would have ordered since some of the other combinations of food I was not too overly thrilled about (and am currently on a very tight budget)."], ["John W.", "Drinks - fantastic! Food - fantastic!Atmosphere - meh...Interior design - nice try...Background music - meh...Avacadotini - 7.50Pescado Taco - 9.00Camarones Diablo Taco - 10.00Water - freeThe food is amazing but the restaurant as a whole is confusing. They can't seem to make up their minds as to who they are. Are they a high-end Mexican restaurant? (Then maybe they could get some great interior design and ambiance ideas from Salud Mexican Restaurant in the Ten Eleven Galleria in Camden SC). Or are they just a dark, small, uncomfortable bar serving great Mexican food and playing loud american pop music. Also, I was surprised that they had no dessert. It just doesn't make any sense to not have at least one home-run dessert that is as authentic and creative as the rest of your menu."], ["Shane W.", "Excellent food! Had bbq tacos and fish tacos and both were great. They have many different salsas. My wife ordered a pineapple mojito and loved it. We could tell that all the ingredients, for both the food and drinks, were very fresh. Not much on the menu for kids, but they did happily make something special per our request for our 4 year old. All in all we were very happy to find this place with such a unique and delicious menu in Lexington. We look forward to going back again!"], ["Linda O.", "I heard \"so-so\" reviews from friends about dinner, but had one good recommendation for brunch. Therefore I chose my first experience as brunch. I selected the only protein containing vegetarian option: stuffed french toast filled with Brie and mixed berries. To my disappointment, they didn't have sugar-free syrup so I had to eat it dry. The Brie and blueberry filling was okay, but it only had evidence of blueberries (not mixed as stated). The taste of the Brie didn't stand out either. The outside of the thick french toast was oily (not buttery which would be more becoming of french toast). I ended up only eating the filling because of this. If they would have coated the grill with butter for this entree, used a variety of berries per menu description (or maybe say seasonal - not mixed - berries?), had sugar free syrup or offered a fresh fruit puree, and gave me utensils for my to-go order, this entree COULD have been good.I did have friendly service, liked the uniqueness of a Brie stuffing, and I admired the trendy interior. So I am giving it 1 star for this one food item, but 3 stars in other categories."], ["Emma M.", "Delicious! Went for the first time today, looking for somewhere new. Talk of brunch and mimosas were mentioned and we happened to see their brunch sign in passing. Bottomless mimosas for $10. Can't go wrong with that. The pineapple juice was splendid as well. What did we order? Shrimp n grits. And their mojo burrito. Both amazing. We would definitely come back again. Smaller intimate dining room with outside seating as well. Definitely worth the stop on a Sunday afternoon."], ["Joshua E.", "I was in town for a few weeks on business.  We ate here the most!  Their tacos are amazing!  At the time of posting this they had deals on tacos every Tuesday.  Grab the chicken taco on Tuesday for $5, and the steak taco if it's not Tuesday.So good, and all of the staff were super friendly."], ["K A.", "Everything here is delicious! The avocadotini and mango guacamole are great and so were our entrees! Even the live musician was impressive. It's a great place for a date night!"], ["Becky F.", "Good food. Very unique. Disappointed in the lack of martini choices though. You would think a martini bar would have numerous choices for drinks. The martini's that they offered were standard. Nothing really different. Would be nice to see a much larger martini menu."], ["Tish B.", "Traveling with only one night in Lexington area with help of Yelp we choose Arkos.Honestly this staff received us as if we were family returning, truly a \"cheers\" atmosphere. Bartender was a perfect 10, and later the owner came over to make sure we were satisfied,  really, we loved this place so much we wanted to do our next meal there but it was time to head North.We will be back.Have another sign made, put outside to left of current sign so others do not miss, we almost did."], ["Stephanie D.", "Went for brunch, although the food was good I was left wanting something more. The name states Cuban fusion but its more fusion then Cuban for sure. The drinks are well made, the price a little high for the amount of food you receive."], ["Heather T.", "Excellent food, excellent drinks, excellent service and atmosphere. Best food we've had in South Carolina since we moved here two months ago."], ["Carrie S.", "Really amazing food and friendly staff.  Will be back soon.  Highly recommended.  Everything tasted fresh and service was excellent."], ["Candy J.", "This might be our new favorite!!! We go fairly regularly to Tonella's Bistro right beside Arkos and decided to try it out. We went just for a few cocktails and an appetizer, thinking if its any good we will come back for dinner. It was probably the best taco I've ever had, a great mix of bbq pork, pickled slaw, and homemade guac! Hubby got a mojito and gin in tonic, which he liked. I tried the Ginger Bliss first, which was refreshing. But the real prize of the night was one of their signature drinks - Some kind of Martini made with Alvacado. I know what your thinking...Alvacado? But its blended with orange and mango and its so smooth you could easily get in trouble drinking them.We will be back for dinner and as fast as we can get there. We were also told they serve brunch on Sunday's but its best to make reservations."], ["Elisha B.", "Great food (both dinner and brunch), great drinks, and great service.There's not many places in Lexington that have interesting menu selections like Arkos, but what really sets this place apart is the service; especially from the owner, who always makes it a point to talk to everyone.  It's really the best customer service I've seen anywhere.  The martinis are also equivalent to martinis to martinis you'd find at 4 and 4 star restaurants, like Oak Table (but without the 4 or 5 star prices).  My favorites there are any of the fusion tacos, the avocadotini, the plantains, and anything on the brunch menu."], ["Lisa S.", "Unacceptably slow service. Shrimp appetizer was burnt. We were seated in the back next to a closed door, which I assumed was not in use during busy times because it was literally 6 inches from my chair, but it was used by all the waitstaff with outside tables, so I was constantly grazed by servers running in an out. A manager of sorts did apologize about the slowness, but only after the server had said \"it'll be right out\" several times. When the food finally came out, half of it was cold. Again they apologized, and we did get a discount, but I was totally turned off by this point. I had lukewarm fish tacos, which were meh."], ["Merry D.", "Very happily surprised to find this gem in Lexington! Great cocktails, try the Avocadotini. Don't worry, you can't taste the avocado, but it gives it nice texture. We tried the jerk quesadilla, spices were very good. Ahi tuna tacos were very good, but the wonton \"taco\" shells were a little odd. The Cuban sandwich is VERY good. Great bread, yummy ham. The mofongo was yummy but I felt it needed either more or larger shrimp and some rice to help cut the richness of the sauce and plantains. Caipirinha(Brazilian cocktails) were excellent. The space is small,  little dark, odd layout. Not enough seating. But the staff was great. We will definitely be back."], ["Jim M.", "This has become our regular hangout. The staff is super friendly and the food and drinks are excellent."], ["Courtney G.", "Great drinks but unless you like seafood or really spicy food, you're out of luck for dinner. I'd go there for a drink but wouldn't stay for the food. If the menu was a little more diverse I'd stick around. The drinks are still good though!"], ["Paul M.", "Lexington has been suffering a lack of restaurants that actually serve good food outside of the usual SC comfort food crap.  They have a nice menu influenced by Spanish and Latin cuisines without being generic Mexican food. Think ceviche, interesting guacamole, gourmet tacos, and other tapas-like food. The atmosphere is nice too. You can eat on the patio if the weather is habitable. It's one of the few places in Lexington that you can grab a drink and not feel out of place for forgetting to wear your Guy Harvey t-shirt."], ["Jeffrey H.", "We went to Arko,s for the second time last night. For the second time service was polite but painfully slow. The food arrived to the table Luke warm. I had ordered the chimichurri beef with crema corn. The steak was overdone with no evidence of a rich fresh chimichurri as expected. The corn was obviously frozen corn in an area with some of the finest in season corn around. It was a disappointment for me and my date,"]], "Pepe At Soda City": [["Rebecca A.", "I love Pepe! The people who run it are very friendly and will answer any questions you have. My favorite is the sirloin pastelito, which has a slightly sweet filling. It is SO GOOD. I will come every Saturday that I can for sure. Stop by while you're at Soda City, you won't regret it!"]]}