{"Sawasdee - Authentic Thai Cuisine": [["Thomas D.", "I absolutely love the curry duck!"], ["Daniela B.", "This resonant can truly be a hit or miss. My family and I have come here multiple times over the years and it has slowly declined in quality. The good used to be incredible, and it was one of my favorites. The service has always been great, and have never had a complaint, but the food has left much to be desired. We ordered shrimp fried rice, and the shrimp were incredibly small and looked like the frozen kind you buy from Walmart. Their coconut soup had a strange after taste, and a funny fishy smell as well. The food was very sodium heavy, and I felt almost ill afterwards. I'm disappointed in the quality of the food this time and will probably not return in the future. It makes me sad that such an incredible restaurant that I reccomended for years has gone down hill. I'm not sure if they've gone under new management recently, or have a new cook. Hopefully things will get better."], ["Julie M.", "Love this place!  Atmosphere is casual and quaint. Building isn't anything to brag about but the food is. Took my son who had just returned from Thailand and he said it was as good as any food he had while there. Portions are good. Prices are fair. Love it!"], ["Scarlett F.", "It's good in the sense that Thai food is simply delicious.  But Thai Kitchen is way, way better. My main issues are that one of the tofu dishes we ordered came with not 1, not 2, but THREE types of meat in it (and no tofu), and the tofu in the dish that DID come with tofu was totally uncooked.  Ew.  Bake or fry that stuff, please.  I wouldn't go out of my way to eat here again.  Thai Kitchen all the way."], ["Melencia J.", "Sawasdee doesn't look like much from the outside (or the inside for that matter), but the food is the best Thai in the area. It takes awhile to order and get the food sometimes, but it's close to work and on my way home so it's a convenient place for lunch and take home dinners. I frequently order the Tom Yum Goon (spicy shrimp soup). It is very simple, but hits the spot. The warm broth is  flavored and spicy--complimented with tail on firm shrimp, mushrooms, tomatoes, and onions. My other go to dish is the Pad Kraprow (basil  with peppers and onions) I usually have it with fried tofu and add broccoli. The flavor profile isn't very complicated, but it's a great lunch portion for the price. I wish they had brown rice more consistently, otherwise they give you a good helping of steamed rice for the meal. If you eat in, request a spice tray if you like your food with more of a kick."], ["Tyler G.", "Great service.  Food came out quick.  Best papaya salad in town.  I love their curry dishes and got spring rolls this time which were very good."], ["Monika M.", "Note: my review below was based on a single visit and bad experience with the server. I have received a very nice apology from the owners. Sawasdee will continue to be one of our favorite restaurants in the Aiken area!!What on earth has happened with your Warrenville location, Chuck?? We walked in on 5/7/15 at 7:15pm with friends who had never been here. First words Jeliza(?) welcomed us with \"you better order fast, because we close at 9:00\". Ok, we pretty much know what we like, but it still took about 25 minutes for her to take our order. Beers arrived with warm mugs!! We were very reluctant to order the whole meal at once and made it VERY clear that we did NOT WANT appetizers and main dishes brought at the same time. Well guess what Chuck, everything came together about 45 minutes later. Sorry, but I had to raise my voice. Her answer \"you said you wanted it all together\" .... NOT!!! When she brought the main dishes back, they had completely dried under the heat lamps. What a huge disappointment, not only to new guests, but especially to patrons who have frequented your restaurant for 3 years (ever since we moved to Aiken) and have bragged about it to many , many people. By 8:30 the waitress said she was starting to clean up now, because she wanted to get home. We always gave you excellent reviews on Yelp, not for tonight's service, for sure!!We hope you will actually see this post, Chuck - we are so disappointed and embarrassed in front of our friends!"], ["Alex G.", "Great,  food a must go when you want excellent service and food.  Bring the family and friends! !!"], ["Chelsea S.", "For this little hole in the wall of a place the food and service is amazing!! Some of the best Thai food I've ever had!"], ["M W.", "One of our family's little traditions is that we take out-of-town guests to our local Thai restaurant, so with all the guests we have, we've been here often.  We've never had bad service, bad food (my least favorite was a seafood stew that tasted too strongly of ocean for me) or bad iced thai coffee.  Oh, that coffee...Do not be fooled by the \"middle of nowhere\" location, old building and sign or the intriguing Asian decor.  The food is incredible.  Some of our favorites are Chicken or Shrimp Pad Thai, Beef Gang Panang Curry, Duck Curry and their amazing chicken/coconut milk/lemon grass soup.  I recommend getting a fried rice and eating your curry over that rather than the white rice.  Just that much more flavor!  Ahhhh...I'm getting hungry.  The front of the house is typically covered by the owner.  The kitchen is run by various family members.  They are all so helpful and will accommodate you in any way possible.  My wife and I have both spent time in Thailand and are aware of the differences between this [slightly Americanized] food and truly authentic Thai food, but for a small SC town like Aiken, I couldn't be more pleased with this food.Go try it."], ["Heather B.", "This place is great! The whole family got different things and enjoyed everything. The coconut curry and pad thai are excellent!"], ["Matthew T.", "Terrible food expensive and small small portions. This is not authentic Thai food. I guess it is good for middle of  nowhere South Carolina     waste of money"], ["Tripzy D.", "My favorite place in town, hands down! Never had anything I didn't love from this gem.  The servers are super nice. And the Pad Thai, oh, don't get me started on it."], ["Tom S.", "Delicious food and great service.  Green curry is delicious as is the coconut soup.  Pad Thai also fantastic.  Owner is always very friendly.  I could not recommend any higher!"], ["B A.", "Not as good as I had hoped. Service was a bit slow and the curry I had was average. Prices for lunch were extremely reasonable. Definitely a nice change of pace, but probably not a place I would go to often."], ["Steve J.", "Great Thai place - family run ;  great food , good value and great service.   Place is not a lot of splash and glitter - but don't let the looks fool you - quite a nice gem.   Good for takeout also -   It is one of our favorite spots in the area and we put it on the place to take family when they visit from out of town."], ["Xuehui Z.", "I love Thai food and this place serves really good Thai food. My husband and I both ordered curries (different ones) and they were both really good. It was definitely spicy enough for our taste. Our appetizer was also very good,  If you look at the building of this restaurant it might stop you from entering but the food is so worth it!"], ["Bill M.", "Great Thai food, good prices, and friendly staff.  The dinner menu has an amazing number of dishes, and lunch  has a sub-set of those with a spring roll included (and about $1.00 less.)  You can get the dinner menu anytime; lunch is Mon-Sat 11a-4p., dinner Mon-Sat 4p-9p.If you want it Thai spicey just ask, and get some fish sauce with Thai peppers and lime juice to add to taste.Note:  Warrenville is just out of Aiken, SC.  730 Augusta Rd. (hwy 421)"], ["Fred F.", "Huge selection of Thai food, and the prices are very reasonable. Lunch specials are even less expensive, but you can easily take four people for supper, have appetizers and dessert, and come out spending under $100, which is great for what you get. There are better Thai restaurants out there, but none of them are anywhere close to Aiken!"]], "Bangkok Restaurant": [["Jason M.", "The food was good and service fast. It is in the top five Asian places to eat in Columbia excluding higher end Japanese steak houses. The server/owner was very nice and quick with the meal."], ["Bien T.", "Please DO NOT eat here. I ordered the sampler platter which has some wings, egg rolls and chicken satay. The chicken satay was RAW, totally RAW. I am pregnant and this scared me out so I vomited all the food I ate there immediately after I arrived home. They said \"sorry\" and offered $5 off that meal. I wonder if DHEC rate is correct for this place. I will not come back to take any chance of getting sick. Also, their menu looks like a copy menu of the other nearby Bangkok restaurant. If the owner is serious doing business, I would suggest him/her to shut this restaurant down and change the menu/ business name and fire the cook."], ["Michael A.", "Horrible!! I stopped by for lunch, when i walked in i was the only person there. I waited for a few moments to see if the girl over on her phone was going to tell me where to sit, but she never looked up at me so i just picked a seat. She then got a menu and brought it over but never stopped looking at her phone. I quickly decided on the Pad Thai, an old Thai favorite of mine. Again she is sitting in the corner on her phone. I did the universal close the menu and look to signify that i was ready to order for a few minutes before another waitress came over to take my order. Pad Thai, egg rolls, and Thai tea to drink. The drink was delivered and it was more like Thai milk rather than tea. So milky to the point she later brought some more tea to cut the milk but it was still too much milk. She brings out my food and its fried rice instead of Pad Thai. When i said so she responded \"you ordered K2, thats fried rice\", when K2 is in fact Pad Thai. It was taken back to be corrected. Later i got what i ordered. However, there were only 5 small pieces of beef on a large plate of noodles, the dish was very bland, and the noodles were gummy and chewy. I have had less than great food in the past and this experience ranks pretty high on the worst list. Save yourself the indigestion and find another Thai place if thats your craving. Not to mention that it was very slow and i was late getting back to work."], ["George F.", "I always get the chicken pad thai. It's a huge portion and addictive to say the least."], ["Ashley A.", "2.5 StarsThe shining star of the meal was the Sampler Platter we got for the appetizer, which included 2 chicken satay in a sweet peanut butter sauce, 2 chicken wings, and 2 egg rolls. While waiting for our meal this guy comes up to our table in the restaurant asking for gas money. That he is from out of town and his 80 year old dad went to the VA and now they are stranded. He was super aggressive and reeked of beer. After he left the table my husband asked the lady behind the counter if he comes in a lot, and she goes \"Oh yeah he is in here all the time.\" WHAT?!I ordered the Panang Curry with chicken. One of the things I love to do when I get a curry is to pour the sauce over the rice. This curry sauce was watery like they thinned it down with water. And the rice wasn't anything to write home about, so I had this watery sauce over bland rice not worth the $11."], ["Michelle E.", "This was my second visit since new owners took over, and my first in the new location. I am sad to report that the food now pales in comparison to what the past owners served up. The new location leaves me feeling nostalgic thinking about the old place. Today, I got the lunch special--chicken satay with fried rice. The chicken was very dry and there wasn't enough sauce. They did bring me more peanut sauce when I asked, but it was the consistency of a thin soup. It also did not have a strong flavor or the spice it used to have, possibly because it was so watered down. There was always something special about the fried rice here. There was a flavor I could never really identify. Whatever it was, they left it at the old location. It simply was not the same, nor was it good. The person I was with had eaten with me one time at the old location, with the new management in place. After lunch today, he doesn't wish to return. The new dining space is cold and dark. The tables in the booths seem old, like they brought them from the old restaurant. Honestly, it looks as if they packed up the decorations and the pots and pans from the old restaurant and then, without any paint or fixing walls where the old decor was removed, just moved in and starting cooking. I'm not sure I will return. It is not the same great Thai restaurant that I've raved about and patronized for many, many years. I'm so disappointed."], ["Beth M.", "Do NOT eat here. The original Bangkok is back in business across Garner's Ferry in the old location. Go there. This food is mediocre at best. In the 30 minutes I've been here, two tables have sent back food. This is on par with bad, cheap Chinese."], ["Jill F.", "If you like spicy thai food come here! The guy who owns the restaurant is kind of a dick but it seems he's not there too often (only 1/3 visits) the women that work there are amazing though. They are friendly, fast, and never stopped smiling... I ordered the beef larb and asked for it thai spicy. It was the perfect amount of spice, my mouth was on fire (in a good way of course ;) )  The ingredients were super fresh and the dish was topped with mint, basil, and scallions, soooo good! Looking forward to trying more menu items and I hope this restaurant stays longer than the last 2 at this location ;P"], ["Paul D.", "I just had take out dinner from this restaurant. I had never been here before and it was kind of a fluke that I ended up getting food here. I thought I was calling the place across the street called \"new\" Bangkok. Perhaps I should have given them 4 stars for the creativity of the name.   When I called the lady was sure to tell me which place I was calling and their location just so I was aware and wasn't confused. It's a good thing because I don't live her and would have went to the wrong place!  I ordered massuman curry, spring roll and wonton soup. ALL 3 we're really good. When I go to Thia restaurants and the curry is really soupy it really irritates me. It was not here. Consistency was right on. The soup was very flavorful and the spring roll was really good. The chef gave me two crab Rangoon as a thank you for coming. They were really good as well. I don't have any complaints. It was a great experience. They also made sure there was plastic wear and napkins in the bag which is a pet piece of mine when ppl forget. I travel a lot and ppl always forget to put them in. After I made the call and called the wrong place, placed the order anyway, I thought I should look at the reviews. I was SCARED. The reviews aren't very good. I'm so grateful I had a polar opposite experience than some of the others. Cheers Bangkok!  Job well done!!"], ["t g.", "Yes, the old place was nasty but the food made you think you were in heaven. New place is just nasty. So very disappointed. I loved this place.New owners, or younger generation family, would be more suited to something other than serving food to human beings. I never minded the less-than-genteel old place because the top-drawer food quality/taste more than compensated for any ...problems. Now that they've moved across the street,  the wonderful food I expected has been replaced with something that smells and looks like canned la Choy chow mein ."], ["Dave M.", "We were regulars at the old location and judged other Thai restaurants against the quality of what the Bangkok served. I guess the New location left the quality behind when they moved. Their Satay went from what was the best we've had to one of the worst we've had. Three of the 5 pieces of chicken were inedible and the peanut sauce was runny like a soup.(bland) The Pad Thai was okay similar to what I can cook at home but no where near the quality of the old place. The Tom Ka Gai soup (our usual favorite) had canned white mushroom slices in it. I will not be back here. I will at least try the New Bangkok which has opened in the old location and is rumored to have the original cook there. We will see"], ["Deb D.", "This was nothing like the old location. I got my standard pad thai. It was very runny, didn't have any taste and it was loaded with bean sprouts,  I also got Tom Kha Gai soup...hummm I don't know why, but there was sausage in my soup in which I picked out.   I probably should  not have eaten any of that food, but I was so hungry after waiting for nearly an hour for my food which I had called in to pick up.  I will not be going there again and I hope that I don't get sick tonight."], ["Gunter L.", "Been eating at this place ever since they opened up in 1994. Went to the  new location for the first time yesterday and the service was terrible. The server knew nothing about the menu, she tried to overcharge us, she brought out my buddy's entrée 10 minutes before mine came out, and she never refilled our drinks. I cannot comment on the food since you can't really enjoy the food when the service is so bad. Will not be going back."]], "Mai Thai": [["Gregory P.", "Before eating at Mai Thai, I thought the only Asian cuisine I liked was Japanese (well, the American version of Japanese). I really dislike Chinese cuisine, and actively avoid generic \"Asian cuisine\" restaurants. Mai Thai has disabused me of this notion.The garlic and black pepper chicken was outstanding, very tasty without pungent acidity and odor of Chinese of food. I also tried the drunken noodles; that will be the dish I order on my next trip to Mai Thai, which can't come soon enough.The service was highly attentive and the price was really a bargain for plentiful portions.Mai Thai gets a \"Highly Recommended\" rating from me."], ["David B.", "No doubt, this is Thai food done right. I believe the awards on the wall proclaiming best Thai in the area. Just don't go in expecting your typical hole in the wall joint. While it's in a small strip shopping center, it's pretty nice in that little spot, and a little pricey too. I got the seafood basil special and I was out the door $20 later, happy and full."], ["phoebe c.", "I forgot to make a note we had been here, with friends, on a business trip last year.  It was so good I don't want to forget that it's an option when we're back in town.I know I had the pad Thai, simple but good. Everyone enjoyed their meals. I'm sure one can't go wrong here. It is tiny so seating is limited and a long wait might happen"], ["Janet N.", "I'm very picky with Thai food - having grown up on the outskirts of Thai Town and a father who eats it once a week AT THE VERY LEAST.Comparing it to authentic Thai food that I've grown up with- it's mediocre. The dishes cater to the taste bud of the white man (LOL, jk... or not) but it's still good in it's own way. -The coconut soup was missing a few ingredients and tasted so bland.-first time ever I had soft-shelled crab at a Thai restaurant, and it definitely was a winner, for me!-Rainbow duck was extremely bland, just no flavor whatsoever and not sure about the choice of vegetables used to pair with my favorite veal.-Drunken noodles is the less sweet and spicier version of Pad See Ew and it was OK. Just a tad bit too sweet, in my opinion.Service was good- ladies attended to most of our needs even though place was pretty packed! Would I come back? Maybeeeee..."], ["Andrea D.", "If you want something authentic this is the place to go. For as long as I have been looking for a great Thai restaurant this has met all my expectations and more. Service is wonderful. I will certainly be coming here to get my Thai fix from now on."], ["Lauren O.", "2 trips here and I'm in love. Finally found my go-to Thai place in town (after 9 years). Don't let the area of town or strip mall location put you off. Very well priced (lunch is between $8-12/person) and most come with a cup of soup & small salad. My husband got the Pad See-ew with calamari & I got the green curry with shrimp (which had the perfect amount of burn).Can't wait to go back & try something new!"], ["Julie R.", "I love this place! They have a tasty pad Thai and the best fried shrimp ever. They give you a peanut sauce to dip the shrimp in which is just awesome! If you go for lunch you get a little soup and salad with your entree which is a nice touch. Don't let the outside of this place scare you, the inside is decorated super cute!"], ["Monica R.", "Columbia does Thai ...Columbia does Thai reeeeeaaalll good! My boyfriend loves two things more than me... Thai and Indian ... Food not women (better not be women). So what better way to celebrate his birthday in our new city than by checking out Mai Thai! I had the masaman curry and he had the two friends panang and both were outstanding but the masaman was the winner. We also had the Thai rolls and the golden angels both were banging! I would do without the coconut ice cream and would not do without a Chang (Thai beer). I am so so so happy we found this place...it is very indicative of Columbia's culinary diversity!"], ["Tom R.", "I'm working in the area and found on yelp, so yes it is small and can take time to get a seat but I was alone and greeted seated right away.They are very busy even at 8pm, from salad to seafood Thai basil dish everything was outstanding! Very friendly good service!"], ["Prashanth R.", "Not a great fan of Thai.. Ordered green curry with chicken and Thai coffee.. Delicious food.. And friendly staff.."], ["Chris R.", "Amazing Thai food!!! Great price and I recommend going when you're hungry or gave a empty stomach because it will fill you up quick!!"], ["Rachel O.", "Mai Thai? MY Thai! I've been twice now and am definitely in love. On the first trip I was a little apprehensive with the exterior but the inside is lovely! It is dimly lit (but well enough to see your food and companions) and decorated nicely. I loved the different salt and pepper shakers on the tables. I had the angel wings appetizer. They are fried, delicious and full of cheese. They are very rich so these might be best for sharing.  On the second trip boyfriend and I split the sampler. The Mai Thai rolls are legit. I'll get them every time I go from now on. The spring rolls contained celery which is like my least favorite thing on the planet. It also came with 2 angel wings. Everything was crazy hot and fresh. Both times I got the Two Friends Panang for my entree. So delicious! It came with jasmine basmati rice (small charge for brown) and contained chicken, shrimp, broccoli, carrots, peppers, snow peas and pineapple.  It was excellent and enough for two meals. I took some home on both trips. For dessert the first time around I ordered the Mai Thai Bananas which came with banana spring rolls, coconut ice cream and a berry and chocolate sauce. I wasn't a huge fame of the coconut ice cream so we just got a plate of the banana spring rolls when I went with Boyfriend. It came with honey and whipped cream. It also came with sesame seeds but we asked for that to be left off. The banana spring rolls are a light and sweet way to end your meal. I wish it came with honey and chocolate sauce.The staff was friendly on both trips and we didn't wait an inordinate amount of time for our food. It is a small place so think twice before you go with a group of more than 4 but they do have a little bar area where you can grab a drink while you wait or hang out while waiting for a take out order."], ["Nick B.", "Great food and very authentic.. Shrimp and chicken Pad Thai is the best dish here in my opinion. They take a long time to make the food however it is done well and no corners are cut. They give you a lot of food and good service. Must try!"], ["Nikka S.", "The boys an I came for lunch food was good we had the shrimp fried rice and the massaman curry the boys had the Thai tea I had the plum wine of course  then we topped it off with the Mai Thai banana desert. Thing just kept going up hill from the time we started."], ["Mike T.", "We came here for lunch on Monday. We were very impressed by the quality of the food. The wide variety of entrées that are available is fantastic. The menu warns you that it's \"not a fast food restaurant\" so you do have to wait a little bit but it's well worth the wait."], ["Food L.", "This is my first visit and regret being there. The place was so noisy and the food is not that great. I would a little longer if the food is worth. It was not served hot. I will not visit again or recommend to a friend."], ["David P.", "Excellent Thai food.  100+ positive reviews are not wrong.  I got the spicy basil chicken and number 5 hot and it was \"lick the plate after finishing\" good.  I would definitely eat here again if I come back to Columbia."], ["Anthony N.", "I'm no expert on Thai food, but based on my past two visits, I will gladly give this place 5/5. The atmosphere is nice, the portion sizes are great, the prices are definitely reasonable, and most importantly--the quality of the food is terrific!The \"golden angels\" appetizer---a MUST. It's basically fried cream cheese wontons, but there's something really special about them. Very, very full of flavor and I'm impressed because I HATE cream cheese. In addition, the fried calamari is awesome. Most restaurants will fry with a ton ton ton of batter, and you can feel \"greased out\" from those places. However, the fried calamari here was very \"meaty\" and delicious.We shared a shrimp pad thai and also a chicken pad see ew. The shrimp size is great, unlike the tiny Walmart-sized frozen shrimp many places cool. The noodles in the pad see ew are wonderful and addicting!Again, not an expert on Thai food... But there's no reason to not keep coming back to this place!"], ["Adam B. J.", "This is most likely my favorite place in all of Columbia.  Its in a small old strip mall in West Columbia, but don't let the outside fool you.  This is great authentic Thai.  There are other Thai options here in Columbia that are good (with much larger price tags), but the food is not any better, the staff isn't any nicer,  and the intimate setting is no better.  Mai Thai has the best soft shell crabs I've ever tasted.  Sometime my wife and I will just get two orders of soft shell crabs and the Tum Yum soup and split it as our meal.  Favorite entrees are Massaman Curry with Chicken, Drunken Noodles (tofu is my personal favorite with this, but my wife likes it with chicken or shrimp),  and the Mai Thai duck!  Thai hot 3 for my wife Thai hot 5 for me (but I LOVE SPICY FOOD).  Great little hole in the wall Thai in West Columbia no less!LOVE LOVE LOVE"], ["Trisha W.", "My favorite Thai restaurant.  I always start with spring rolls, very light and crispy.  We ordered Drunken Noodles and chicken fried rice.  Both were absolutely delicious.  This place is very small so be prepared to sit quite close to others and the wait can be pretty long, but it is so worth it!"], ["Kristy G.", "Penang curry chicken was the best part of my meal- and the starter soup.  Unfortunately I ordered, but didn't care for spring rolls - I only had one bite.  Sadly the restaurant wouldn't remove the item from my bill.  In fact, the sever didn't even ask manager which I found extremely dismissive. Also they don't take Amex FYI.  Would have given higher star review had my server even attempted to satisfy my dislike of their spring rolls."], ["Will H.", "Best Thai food I've found in Columbia. A small restaurant with a laid-back atmosphere that's always busy but worth the wait."], ["Heather A.", "Food here is great.  The place is tiny and the wait can be very long.  5 of us came Sat at 6:30.  We waited 45 min to be seated, and our food took about 30 minutes to come out.  We ended up being there almost 2 hours when it was all said and done.  Portions are large and the service was great.  Just make sure to go early or be prepared to wait!"], ["Jimmy M.", "Best Thai restaurant in Columbia. Coconut soup is outstanding, Pad Thai is fantastic also. I try to come here at least once a month."], ["Ali H.", "I have been going here since it opened. You would never guess it from the outside, but this place has the best Pad Thai in town. The coconut soup is also a favorite of mine. It is a small restaurant so be prepared to wait a few minutes if it's a peak dining hour on a weekend. Worth it!"], ["Jennifer R.", "I loved the curry.  I have never stepped into this place when it wasn't busy, which is good for the business, but not for the wait!  It is awesome to call in and go pick up food, though.  They're fast and good with that.  For that matter, you can walk in, go to the bar in the back, and order your to-go food.  Have a drink, play on your phone for a few minutes, and you're out the door in a few minutes with dinner.  YUMMY dinner."], ["Aaron B.", "I really enjoyed my experience. Stopped in for lunch and ordered the rainbow duck and it was great, and I'm a big fan of duck."], ["Ramon S.", "Coming from Asian girl the food was okay.  We have been everywhere but i can't find anything that beat the Thai restaurant in PA where we found that  basil thai fried rice.  The service was great though but please make sure you are not as hungry when you go there because the waiting time is terrible.  We have to wait almost 20 min for our appetizer and waiting time for the main course is almost an hour.  We almost decided to leave because we are so Hungry.  Well anyways the price wasn't too bad anyways so I guest that's why the food wasn't great either.  Still searching for a real authentic thai resto......"], ["Kristin M.", "Lunch was excellent.  Chicken noodle soup has an amazing broth, great Penang curry, and the peanut sauce is truly amazing.  Fresh veggies and lean meats so healthy as well."], ["Adam H.", "I read about Mai Thai on Yelp while traveling for business and decided to check it out.  It was Friday night, so I didn't expect a thai restaurant in a strip mall to be very busy.  I was wrong.  The place was packed.  I found a spot at the bar and ordered a favorite dish of mine, Drunken Noodles.The dish was served sizzling hot (temperature) and with just the right amount of spice.  The noodles were cooked perfectly and the peppers, snow peas and onions had just the right amount of crunch.  Even for being very busy, the service met my expectations.  I would definitely return."], ["Jason N.", "My girlfriend approached me and said \" I feel like Thai tonight \" and I was off to the Yelp Races to find the answer!... Well the reviews on this place were all pretty accurate. you know what they say about places that seem \" Divey \" usually you get a good surprise, and that's what we got here. The exterior is definitely something more than a few might pass up as its located in a older style strip mall, but inside the decorations were of a modern nature, mixed in was a traditional Thailand theme of color and décor. The place inside is definitely small and fills up fast so that is something you will want to take into consideration when visiting i.e. day of the week and time of day. We got there a little past 7pm on a Friday and there was one table.. and it stayed that way until 10pm. So, the best option to ensure some decent seats would be to get there between 5 and 7.. probably after Thursday til the weekend... We started with appetizers and like many reviews, we tried the Calamari and the Angel Wings... While the Calamari was larger and tasted pretty fresh, the batter was somewhat bland and a bit too greasy, but not something that I wouldn't try again if the place was a bit slower. The Angel Wings (6 per order), well they were downright awesome, similar to a Rangoon, but altered with the type of cheeses inside, definitely Rich, but if sharing, with 2 or more people, totally worth a try. The main course choices were the Drunken Noodles and the Pad Thai(beef) ... I feel as though Pad Thai , albeit street style food, represents an important cultural link to know how well a Thai joint is linked with flavors and spices, so I tend to order this every time I try a new place, to see how they treat their version. I was not overly disappointed at all, the noodles were good, the spices and flavors were all well balanced, the beef was good although slightly bland, when mixed as an all in one bite with the other ingredients, it was tasty... I felt like they could have added just a touch more veggies, but I would get this again... The Drunken Noodles were also very well done, with solid flavor profiles, spice levels were on point ( low to med ) doneness and chew of the noodle itself, with only a similar comment about the amount of veggies which could have been a touch more, but totally worth getting again.The price points on this meal were definitely in the bargain range.. both of us with Saki and wine, appetizers, Food, Tip came to a few bucks shy of under 50bucks and we went home with leftovers, so to me this is what makes this place a definite return stop in the future. I cant say this place is the BEST in Columbia, as I haven't tried all of the other places yet, and there are \"a lot\"... and my 4 is based on a few things... 1. it was my first time there, so I don't know about consistency just yet and that is important when giving 5 ratings , at least to me... 2. there were on this visit, some very minor things with the calamari being just a bit greasy; which could have been attributed to the level of business at the time.The Service was good even when busy, but do not expect rocket fast service, go there with the aim of having some time between orders, so don't be in a rush if you go at the times I quoted in this review. all in all, great place!.. look forward to a second trip to see if the 5 comes out in an update!"], ["Mary S.", "First time eating Thai. Had the sweet and sour beef and it was very good, loved the pineapple chunks."], ["Dawn W.", "Lovvvved! We pulled up and debated about how good it could really be based of how it looked from the lot. We went in and we were surprised at how cute and clean it is! The two girls working the front were great, quick and friendly!  We had the cream cheese fried wonton appetizer and they were amazing!!!!!! We both had pad Thai beef and chicken. Both great. Chicken a tad better.  I asked for level 3 spice because I'm from Seattle where Thai is spicy! The level 3 was a decent balance.  Also loved the jasmine tea!  It's about half hour from home but we will travel for it."], ["Linda O.", "This is NOT the place to go if you are looking for quick and friendly service. The space and number of tables is highly limited and they won't let you sit at the bar because it \"blocks the take-out service.\" I waited 15 minutes before I decided to find a staff member to ask if I could be seated. My presence was never acknowledged. Then I waited another 10 minutes. This was at 1:15pm on a week day.Consider this place as \"take out only\" and one may have a better experience."], ["David B.", "Good food!  The Hot a Basil Chicken is good, but not the best.  The springs rolls are good, but a little pricy for the size.  All in all, id eat here again."], ["Kenny K.", "Best Thai food in the city, without question! The Massaman Curry was so good! Thai Tea is a must! My friend had the Wild Shrimp and raved about it. Don't forget the Thai Donuts for dessert!"], ["Karen S.", "First place that I ever ate Thai Food at - and far the best Thai Food I have eaten compared to some of the other places I have eaten at.I ordered take out tonight and called ahead (as the other time I did carry-out and did not call ahead, I had to wait about 20 minutes for them to prepare my dish).  And my food was still hot by the time I got home - which is about 20 minutes from the restaurant.  Warning: restaurant is small - so probably not good for big groups of people, but nice and Intimate if you have a small group/And the portions are HUGE! i had enough left over from my dinner for lunch tomorrow!"], ["Raul R.", "I've eaten here several times and the food has always been good.  The food has great flavor and the staff is friendly. You should check it out!"], ["Dee A.", "I first went here with my parents when I moved down.  We drove up to the mirrored front and wondered what kind of theme they were going for.  Turns out it doesn't matter.  This place was wonderful.  The service was so great.  Everyone working there was so nice.  The food was amazing.  My favorite dish was the green curry with chicken.  It was a large portion with a spicy coconut milk broth and just a little sweetness.  The pad thai was a little sweet but still some of the best I've ever had.  We also tried the drunken noodles which was full of vegetables.The whole experience was great right down to the homemade coconut ice cream.  I've been back a few times since and will keep coming back."], ["S H.", "BEST THAI FOOD IN COLUMBIA. On our most recent visit, my husband got the panang curry w/ chicken and I got the drunken noodles w/ veggies only. We also split the spring roll appetizer. He was in love with his curry, so much so that before I could even eat 1/4 of mine, his was completely gone. Somehow I managed to save 1/2 of mine to take home, but it wasn't easy. Both dishes had great flavor, with mine having small hints of anise and perfectly cooked vegetables - crisp but cooked just right, no hint of sogginess. The spring rolls were very simple but did not disappoint. (Tip: This is the place to order an appetizer b/c the wait for food is longer than you'd typically expect. So worth it though!)During our meal, we looked at each other and said, \"Why do we even go to Basil when Mai Thai is so much better?\" This last experience has caused me to revamp my Basil review. Somehow Mai Thai is just so much fresher, more flavorful and they aren't trying to rush you out the door, meaning you can enjoy your meal or date night with your significant other. :)The icing on the cake was when I forgot my take-out container on the table. We were driving out of the parking lot when I realized what I'd done and ordered my husband, \"Go back!\" He turned the car around and we spotted the waitress running across the parking lot, taking my container to various parked cars looking for us. How sweet!"], ["Pamela L.", "The food is great... However the service leaves much to be desired. Waited 30 mins before someone even came to get our drink order, at the end of the night we had been sitting there for 2 hours before we got our food. There were only 3 people on staff and the place was packed, so I'm sure on a slow night the service would be as exceptional as the food. Unfortunately that was not the case during our visit."], ["Liz D.", "Mai Thai is wonderful! Looks like a closed store front in an ugly little strip mall. Once you open the door, it's beautiful!The service can be a little slow sometimes, but it's always nice. The food is fantastic! My favorite things on the menu are the curries (particularly the Panang curry) and the Drunken Noodles, but I've had so many things and they've all been fantastic.Went yesterday for lunch, and the place was packed. Still, we got a table for 2 in under 10 minutes. Lunch specials are really decently priced (we got food for 2 with Thai teas and an extra drink for under $25), so this is a good way to enjoy them inexpensively. Everything was fantastic!"], ["Jennifer N.", "My absolute favorite Thai restaurant of all time! I've been to Thai restaurants in Greenville, Atlanta, Spartanburg, etc. Nothing compares to Mai Thai. I highly recommend their signature pad Thai or pad see ew! My boyfriend loves their duck curry. The quality and taste is consistent. Don't let the sketchy area fool you, Mai Thai is the best around. You can't get better Thai food anywhere else. Love, love, love!!!!!"], ["Carolyn G.", "You must ignore the exterior of this restaurant to get to the treasure inside. Looks like an X rated dive from the outside, but inside it is a nice, small sit down restaurant. The service was fine, but it did seem to take a while for the food to arrive. We ordered the spring rolls to start. My entree, the drunken noodles was awesome with just the right amount of spice. I ordered them with the steamed tofu. The dish was loaded with vegetables and good enough to order again. My daughter ordered the chicken pad Thai which was good, but next time she will try another dish. Overall a pleasant surprise worthy of a return visit."], ["Troy F.", "So, first impressions:  when I walked up to this little hole in the wall joint with the two-way mirror outside walls, I thought I was walking into a massage parlor and the only thought that crossed my mind at that moment was, \"I hope it has a happy ending!\"  But I digress, this gem of a place is an absolutely fantastic Thai restaurant.  From the menu items to the Asian waitresses with the unmistakeable Asian accent, it is one of the best places to grab some authentic Thai cuisine.  I will MOST definitely be coming back to this little treasure!!"], ["Joel W.", "Doesn't look like much from the outside, but it's lovely inside.  Food was very good, menu wasn't overwhelming, but had many choices. We started with buffalo shrimp and then had pad Thai, grouper and black pepper & garlic chicken.  Very happy.  Would go back."], ["Gregory G.", "Nom nom nom. Best Thai food in town! Don't let the scary run down strip mall setting fool you. When you walk through the doors its super cute and run by the sweetest little Thai ladies. The waiting area is tiny and so is the restaurant so getting there earlier is advised. The decor is cute and clean and the staff is very friendly (but super slow! Never in a rude or uncaring way but I think its just standard for them.) I've never had a bad dish and the sake is tasty. They're closed on Sundays and open for lunch so give them a shot whenever you can."], ["Jeni N.", "Best Thai restaurant in Columbia, hands down. My friends and I carry out, but dine in just as often. They also serve lunch! The servers are so sweet and attentive. Their tom yum soup is warming, delicious, and good for the soul. I love the cashew nut--stir fry blend of veggies and a meat. And of course the classic favorite, Pad Thai, never disappoints. I've had the Rainbow Duck a few times too--not bad. That's just to name a few of my favorite dishes. I've never had a meal that disappoints here. OH, can't forget dessert! Mango and sticky rice. Trust me, you won't regret it."], ["Paul W.", "Food is good for what Columbia has to offer. If you go for lunch, go early. It will get packed real quick. Dinner seems to be little over priced for me and way too close to next table to my comfort. Good is good though."], ["Kelsey T.", "I went for lunch and had the cashew chicken. It was fresh and flavorful. A lot of big cashews and fresh veggies. I got 4 star spicy and I would go up to 5 next time because it was too mild for my taste in Thai. Perfect size portion and not too pricey either. I will definitely be back to try more of their menu."], ["Christa C.", "Best Thai in Columbia, hands down. The word is out, so it fills up quickly. Service is efficient dining in, and we've never had a hiccup with our takeout order.Love their noodle entrees in particular. Only wish they delivered!"], ["Rob K.", "This is the best Thai restaurant in all of Columbia. Without question I've eaten here a dozen times and never had a bad meal. Lunch or dinner you can't go wrong."], ["Lynette P.", "Great food and great service! The food is very tasty and server was nice enough to accommodate my party ordering additional items. Everything was correct! If you want to avoid the long waits and crowds, don't go during peak hours. I came here in the middle of the afternoon, on a week day and it was not crowded at all.Will definitely go again and highly recommended!"], ["Stephanie V.", "Whenever I hear that depressing Kanye West song, \"Runaway,\" and he says \"let's talk over mai tais, waitress top it off...\" I think not of the fruity tropical concoction, but of my hands-down favorite take-out spot when I lived in Columbia.  As others have noted, it's located in a depressing strip mall and the outside looks alarmingly like an adult toy store, but the inside is clean and usually crowded with adoring regulars.  Service is pleasant, but if you are ordering take-out, be prepared for a long wait (up to 45 minutes at times).I usually ordered the same thing, which took some serious devotion considering their long menu of tantalizing options.  I'd start with the coconut soup and appetizer sampler (so what if they say it's for two and I'm only one? How could I even think of sharing such a box of delicately fried deliciousness with anyone??).  If you're not in the mood to splurge, just get the Mai Thai roll - it's amazing.  My go-to dish was panang curry.  The green curry is similar and also delicious, but a good bit spicier - *almost* too spicy for me, and I have an above average tolerance.  To top it off, I would sometimes order the cheesecake tempura.  You would love it, unless you hate things that taste good.  Once I ate the whole damn piece sitting in my car right there in the sketchy parking lot, and I didn't care who saw.Oh, and the prices are pretty cheap, too - I'd usually get all of that for about $30 - so go ahead and indulge."], ["Qi G.", "Worst dining experience ever. I ordered Beef Pad Thai. The beef was really hard to chew and I did not like it. I told \"the person in charge\" that I did not like it and she just kept me: \"You ordered it yourself! We cannot do anything about it, can't take it off or switch to another dish.\" Never been to a restaurant with such bad attitude and service. After talking/arguing for 10 minutes, she finally agreed to give me some side tofu for the hard-to-chew beef. Definitely not coming back."], ["Taylor H.", "This place gets super crowded because they have amazing food! Try the drunken noodles!"], ["April B.", "I LOVE Mai Thai, but I generally only prefer to get takeout, as the few times I've been in for lunch I wasn't able to get in an out in a hour. Go sit inside when you have the time. The drunk noodles are my absolute favorite, with the garlic and black pepper coming in a close second."], ["Gary G.", "I have had friends say this it the best Thai food in Columbia, but I have been disappointed each time I have been here. Green Curry is hard to screw up, but they do. Even the pad thai was a greasy mess, with sweet sauce. Go somewhere else, any place is better."], ["Tracie D.", "First, I have been coming to Columbia with some regularity for three years. Dinner options exist in downtown but it is lunch places near the office that tend to trend toward Bojangles, Chik a Filet, Subway, etc.. The other option was an Applebee's which is, well, an Applebee's for crying out loud! Was a little hesitant when a colleague mentioned going out for Thai this week. Wow, was I happy he did!! Hands down the best lunch I have had in Columbia. The place was packed, the service amazing, and food incredible. Great presentation and even better quality. A must do if you are in the area."], ["Adam H.", "Walked in at about 8pm on a Thursday evening. The place was busy (typically a good sign). I'm staying at the hotel a few blocks away so I was looking for something I could take back and eat in peace - I didn't want to occupy their table space. After waiting many minutes, I finally caught the attention of the hostess. I told her I'd like to please place an order to go. I was told that I was not allowed to get food to go. I had to wait for a table and eat there. Ridiculous. I don't mind waiting for food and I was very polite. This isn't a 5 star establishment, it's a tiny joint in a run down strip mall. Last time I checked, money is money. Glad I don't live here so I don't have to worry about giving them another shot."], ["Rob G.", "I had the Shrimp Fried Rice, HUGE portion. Service was friendly and fast, no complaints, I feel they charged the right price for the perfect amount of food. I am definitely going to stop by the next time I'm in the area."], ["Unknown S.", "I generally don't write reviews, but I had horrible experience twice that's why I m writing one. This place is shit, lot of peoples like it for some reason,  But the quality is very bad. Moreover they take too much time to serve."], ["George H.", "Absolutely a fantastic place to eat. Was a bit wary after seeing the outside of the building but opening the door proved beauty is more than skin deep. The inside was nice and quiet and we were seated immediately as we arrived. The  servers were very fast and responsive. My wife order Chicken Pad Thai and I had Penang Curry. The starter soup was one of the best soups that I have gotten to start a meal. It was more than just broth but had chicken and lemon grass in it. The salad came with what tasted like honey mustard and was not very large. The courses came out and they were fantastic. The meals were rich with flavor. My curry could have had a little more heat behind it but is was fantastic nonetheless. We sat down at 11:30 and were done by 12:15  When we left there was already a line waiting for seats so get there early. Easily the best place for Thai food in Columbia"], ["Becca D.", "The location (in one of the more run-down strip malls along Sunset blvd.) and weird mirrored exterior of the restaurant might be a turn-off for anyone who hasn't been before, but the food at Mai Thai is consistently good and very fresh. The presentation of the food is a major bonus - everything was beautiful, and the rice was served in the shape of a heart. The interior is well-decorated and intimate, but it can get pretty noisy on busy nights.You should definitely plan ahead if you want to take a date here, though, because there is frequently a wait to get a table, and the food preparation takes a while (which is, as others have said, a testament to the freshness). So don't come here if you're already hungry!Mai Thai isn't my vote for the best thai food in town, but it is definitely the best thai food within its price range."], ["Jessica H.", "We love this place!  The Angel hair with chicken is worth the wait. My kids love the spring rolls. The Tom yum soup is my hubby's fave. It is always packed at lunch."], ["M. P.", "I will agree with the other reviewers about the exterior of the place - I almost didn't go in because it looks very rundown especially if going for dinner.  The servers are not very friendly - went there with my husband and kids and we each ordered our own entrees.  I enjoyed mine very much (the drunken noodles) however my husbands tasted off (he had a chicken curry dish).  He sent his back and told the server that it tasted off but they refused to take it off the bill!  The servers response to my husband was \"next time try something different\"!  I couldn't believe it - will not be going back."], ["Sateesh N.", "Sucks. Takes forever to take the order and get your food. Worse customer care. Would never go there.. Food is great though.."], ["Chris S.", "Great Food. We love this place. Hot Basil Chicken is my recommendation 5 peppers and ask for the spice kit!! They can make it hot.... Best Thai in Cola!!!"], ["ken r.", "I don't want to leave a good review because I 'm selfish and the place is crowded already.I agree with all the other positive reviews.  My favorite Thai food in the area by far.Please don't go when I'm going so I can get a seat."], ["John B.", "Pad Thai is amazing, the best we've had in years. Dumpling and spring roll appetizers are delicious and the Salmon Chu-Chee was fantastic."], ["Amanda F.", "My little Thai gem in Columbia! Don't let the outside fool you; come inside and find a quaint Thai joint with amazing food. Service can be on the slow side at times but the food is well worth the wait. I try to make it here as much as possible to satisfy my Thai cravings and am always thrilled with what I get. I dream about the coconut soup and have to get it every time I come. I have tried many different curries and noodle dishes and have yet to find one that even slightly disappoints!"], ["Allison C.", "Yummy! We went for lunch. Although food takes a little bit to come out, it is worth the wait. Service is so friendly and they do their best to be quick at lunch. I ordered the panang curry with chicken and quickly devoured my plate. Mom ordered fried grouper with ginger lunch special and it was really good too. I will definitely recommend this place. Based on others' recommendations, we did try the homemade coconut ice cream. It was delicious, but hard to eat because it was too frozen. I think their freezer is too cold of a temp..."], ["Hollie T.", "At first glance, you're walking into an adult store with a mirrored exterior in a rundown strip mall... but then you're in Thailand: a quiet corner of Thailand with pleasant people and exotic smells.Try the Jasmine Rice soup and one of the curries and you can't go wrong."], ["Thomas B.", "Very long wait for my Drunken Noodles at lunch time. 30 minutes. No apology. Waitress was stressed out --made me anxious.Food was OK."], ["Janelle A.", "Amazing food! There's a little wait time after ordering but that's because it's super fresh and flavorful! A great place for true Thai lovers! We ordered the fried calamari and panang chicken! Yum!"], ["Lenny B.", "Best food and amazing desserts. The donuts are out of this world. The waitresses are very friendly and keep your drinks filled."], ["Roel F.", "Mai Thai is an excellent restaurant! The food is yummy, the service is friendly and the prices are reasonable. Alright, Mai Thai does not look like much from the outside, the place looks like pornography or massages with a happy ending are on sale, but the inside is very agreeable. They tried their best to add a touch of Thailand to the place and it worked. The interior has a pleasant, cozy feel to it.In good Thai tradition, the service is very friendly. The drinks came quickly, but unfortunately we had to wait a little while for the food. Luckily, I was in good company and the wait was not too bad.We started with two appetizers, the Mai Thai rolls and the dumplings, both of which were very tasty. (Granted, we had to wait for a little while before the appetizers came out.) The entrees were nice as well. I opted for the hot basil chicken and I very much enjoyed the dish. One piece of advice, though, if you like your Thai food decently spicy then you should ask for a spiciness of five on their scale of five! The entrees of the other people at my table were also very nice. (Granted, we had to wait for a little while longer before the entrees came out.) The food was not only tasty, but there also was plenty of it.The prices at Mai Thai are not excessive, about ten to fifteen dollars for an entree, which is another plus about the place.In short: I highly recommend Mai Thai!"], ["Mia C.", "Best thai food in Columbia area. Have been here couple of times with friends. They have great vegetarian options. All the curries i've tried were great.  Ambience also not bad. Must go if you live in Columbia."], ["Brianna B.", "Didn't seem like much from the outside but it's beautiful inside! And the food is wonderful, well-prepared, and clean! We stopped here for dinner as we were traveling down I-26. Definitely worth it!"], ["Ashu S.", "This is one of the best restaurants I have been to in Columbia. The decor is amazing and the servers are friendly. I love the food so much that I keep coming back every week."]], "Thailand Restaurant": [["Cynthia S.", "My husband and adult children takeout lunch two or three times a month, since it is in walking distance from our business.  Our mail carrier ate there daily, until he retired.  Our students always order before the 8:00 class, since they close at 9:00. Just a reminder that they close for an hour in the afternoon, between lunch and dinner.  The food is excellent and the portions are large.The website posted on Yelp is incorrect."], ["Eduardo J.", "We have been here about four times and the food is always excellent! Noodles and stir fry are awesome"], ["Vatch S.", "Best papaya salad in Columbia!!!!! The service is awesome! Thai ice tea is real....we will definitely be back again and again :)"], ["Ashley H.", "I can't believe I haven't reviewed one of my favorite spots! I work a mere 2 minutes down the road from Thailand and hit them up for lunch at least once every two weeks.The same lady works lunch (and probably dinner) and is very good at remembering just how I like it order things, which I always think is impressive. Sometimes there isn't a seat in the house but she runs around and is attentive. I wish I could remember her name (I'm terrible!) Did I mention it's also way cheap? I used to love to frequent Thai Lotus when they were around but their prices were a bit high for basically the same amount and quality as Thailand. I have explored the menu and had a number of items but I always go back to my tried and true. The mussaman curry with tofu is delightfully sweet and I add a touch of chili paste to balance it out. The tofu is a little crispy and the potatoes cooked perfectly al dente to me, I don't like soggy potatoes in my curry.The \"noodle soup\" if I am correctly recalling it's name, comes with your choce of beef, chicken, seafood or tofu. The broth is on point and comes with noodles, onion and cilantro, it cures what ails ya. Portion size is huge, I always have a ton left over. Their other soup, the Tom Kha with coconut broth, cilantro, mushrooms and chicken is another favorite. Basically, their soups rock. I love this place, it's a diamond in the rough and I can always get in and out quickly."], ["Ryan H.", "My wife and I ate here as we try to do every time I visit Columbia Sailing Club and have been here at least 10 or 20 times over a very long period of time.  We got there and as usual seemed like it was very slow.  But amazing how much to go orders they were doing.  And everyone seemed like they were regulars.  We ate in peace and had the Pad Thai, the Peanut Sauce with Shrimp and the sample plate of apps.  Should have skipped one of the entrees and or the sample plate as we were full pretty early in the meal.  Really very consistent over the years and will keep coming back.  Shame that many do not eat inside and as a non-local not sure why.  But we really enjoy this place every time.  See you next time we are in town!"], ["Suman K.", "Good homemade Thai food... Avoid coming at closing hours... They sometimes close early."], ["Linda K.", "The paneng curry was cold and they give you so much rice you don't have to ask for more. The lady working/owner is so sweet."], ["Robert V.", "My wife and I randomly came across this restaurant while driving around that part of town and decided to give it a shot. Great decision! The ambiance is great and food even better. Our waitress was very helpful."], ["Anna L.", "As we entered the restaurant we were greeted by a nice lady right away and we got seated right when we got there. We ordered the sample appetizers that came with fried gyoza, spring roll, fried calamari and fried tofu. I got the yellow curry with chicken as well. First of all, the fried samplers were too fried and burnt that you couldn't even taste the calamari inside and the spring rolls, and fried gyoza didn't seem that authentic to me. I don't recommend that you order any samplers because to be honest it wasn't worth $9 to me. The yellow curry was very spicy and I believe all of their curries are spicy. What disappointed me was that the curry was more of like a soup consistency rather than a traditional Thai curry. I tried the carrots and potatoes in my curry which was not fully cooked and literally could hear the potatoes and carrots go \"crunch crunch\" in my mouth. I really enjoyed the flavor of the curry so that was the only thing that kept me eating. I've been craving thai food but very sad to say my cravings were not satisfied. On the bright side I saw tapioca bubba drinks on the menu so I might come back only to try that since they don't have that anywhere in the mainland!"], ["John V.", "Left quite a bit to be desired. We were looking for something different in the area and came across this place. The food was just okay. It wasn't that it was terrible, but it surely was not all that great either. Some of the food was overcooked (fried items especially) and other were undercooked. The rice was chewy and odd, the curry was rather bland and the sampler platter wasn't very good either. Not bad, but surely better could be had elsewhere"], ["Sateesh N.", "Affordable and large proportion.. Average taste though.. Very quick service.. Go there frequently.. The food is just about average."], ["John S.", "Good food and service. Fast but got there at 5 when they open so that may be why.  Good all the way round."], ["Ed P.", "Food is incredible today-  chicken-green bean stir fry- awesome.  The place is packed- nice to see.  Service is excellent- great atmosphere."], ["Roger Y.", "Good not great Thai food, at least what we ordered.  We were one of only two couples on a Friday night at 7:30.  Service was spotty.  The waitress was quick to take our drinks orders and bring them, but then disappeared.  My wine was off, and it took me a couple of attempts to get her attention to replace it, which she did promptly.  After ordering, our food did not take too long and service was otherwise fine.We ordered the sampler appetizer tray which consisted of all deep fried things that were tasty, just fried all at the same time, so the smaller things like calamari were tough while the egg roll was fine.We ordered a yellow curry dish with chicken, potatoes, sliced carrots and cashews.  Very tasty.  Nothing fancy, just good.I'll probably come back and try some other dishes."], ["Missy S.", "Total hole in the wall with awesome Thai! Pad thai is wonderful and even a little spicy. Definitely worth taking a chance!"], ["Emily E.", "This place looks like a hole in the wall but their food is fantastic!  My favorites are the red and green curry.  Huge portions and decent prices with friendly service.  The tom yum and tom kha gai soup is wonderful either as a starter or the main meal.  Give them a shot!"], ["Mike G.", "Fantastic! Best Thai in Columbia. We had green, cashew, massaman curries and Tom Yum. All promptly served and authentically delicious. All were large servings. Couldn't have been better."], ["Arulram S.", "Appetizers and food were well made. Taste separation could have been better.  You could tell flavors were blended together.  Service was very quick and the lady who was serving was very helpful in making dish decisions and very curtious.  Would return again."], ["Taylor H.", "A colleague really wanted Thai food and I obliged her thinking I wouldn't like it-- I was wrong. I have become a regular here! I recommend the tom kha chicken soup, pad see-ew, and the panang curry with chicken. Friends have enjoyed the pad thai and thai fried rice."], ["Ajay C.", "A few days ago, we had food at this restaurant. At that time, we had mentioned that the food be less spicy but it was too hot for us. We told this to the person working at the restaurant and she said it might be because of the different spices that were bought there. Then, after our food was done, she handed us the bill which we paid by our credit card(s). we did not include any tip as the food was spicy contradictory to what we had ordered and also the price was higher than normal lunch hours. She said its dinner-time rates that were applied.Today, when we went there for lunch, she arrongantly said \"We serve here only for tips. The other day you two guys did not tip.\" She also commented about our country-of-origin and said that you people always do this kind of stuff.Before today, I was eating there regularly and tipping her even for to-go orders! But not anymore. I will never ever go there again. But the discrimination and racist comments should be stopped. This is definitely not a way to speak to the customers as soon as they step in a restaurant."], ["T E.", "The decor was nice, restaurant was clean, and staff was friendly. I went at 7pm which I consider dinner time and the restaurant was empty. That should have been my first sign. I got the calamari and pad thai with squid. The calamari was fried too hard and had no taste so I gave it to my dog. The pad thai was also bland, and the noodles cooked so long they were stuck together. I threw it away. It was a total waste of money and my time."], ["Naomi R.", "I give 2 stars because we used to frequent this restaurant and loved the authenticity of the food. The atmosphere and servers were a delight. However, after about 4 months we returned yesterday and upon ordering noticed a full grown roach lying next to my feet. I just couldn't... We left. I doubt that we will return. They have an A grade on the door but the roach said so much more. Sorry that we've lost another favorite restaurant in the Columbia area."], ["Kim W.", "Repeat after me...cashew nut chicken. I saw the photo on Yelp and decided to order something different. Being from the Bay Area, I though I had a leg up on Thai food but that dish was the BEST that I have ever had at a Thai restaurants. Chunks of white meat chicken with cauliflower, cabbage, mushrooms and cashews. The sauce was so savory that I'm still dreaming about it. I'd visit the south again just to eat that dish again. Perfection!"], ["Ryan W.", "terrible, the owners have lost all interest in business!  Only table in restaurant and received old thai tea that tasted of unwashed tea urn! This was served by a girl who sat two tables down and played on phone and did homework! My curry consisted of Microwaved Rice which was so dry the grains were crispy outside and mush an inch into the bowl, the broth was separated from being microwaved and was full of raw vegetables and OLD GRAiNY shrimp!  I have been coming here for years even was there on opening night when it was known as thai cuisine!  Do not eat here columbia has some fine eating establishments, this is no longer one of them! The only positive of the whole night was that the $17 frozen deep fried duck drowned in mai ploy sauce was hot!"], ["Kate P.", "Been twice so far- first time the Tom kha gai (they call it coconut soup) was amazingly good. Like I wanted to order extra to take home. Second time was a little bland but I added wet chili and it was delicious again. First time I had the pad thai and it was good but saucier than I usually like it, and again not spicy which is strange for a Thai place. I'm sure you can ask for it spicy, or just add chili yourself to taste which is what I did. Second trip I had panang curry, which was different from how I've usually had it prepared since here it came with mixed veggies and usually I've only seen it with green beans and peas but it was good. Someone mentioned the sauce being too watery but that's not unusual, still holds the flavor well and this one actually was spicy enough!  Overall, I would recommend it as long as you don't mind doctoring up your meal a little bit."], ["Thomas H.", "Very good and reasonably priced. Authentic Thai food at this off the beaten path place that savvy locals know about. Get in on the secret and try it out!Don't let the outside appearance fool you. It's nothing fancy but the food is awesome!"], ["Rick M.", "The food was terrible. I asked for the beef soup filled with vegis. I got broth with 3 pieces of mushrooms floating on it. Sent it back and left. Will never returnNo ambience, terrible service and terrible food"], ["Keith K.", "Times eaten here: 40+Food: Tasty and unexciting.  The menu is static, but covers the bases pretty well.  You won't find anything unusual or odd here, just Pad thai, curries, Tom Yum, larb, the obligatory fried rice / chicken wings, etc.This little Thai joint is never busy, but does provide a quick n easy ThaiFix when you're in the mood.  I hear tell it is subsidized by the Thai government to promote tourism, which is entirely believable.  The takeout is absurdly fast, lunch prices reasonable and I've found the food quite consistent, all told.Thailand is run by honest to goodness Thai folk and is reasonably clean.  The food isn't going to wow you, but it's quite satisfying and homey; portions are also large.  Highly recommended if you want a some unassuming Pad Thai or curry.  This is my favorite Thai restaurant in Columbia not named Baan Sawan."], ["Nichol H.", "From the Fresh Spring Rolls to the Pad Thai and Masaman Curry. Fresh, flavorful and satisfying! The end."], ["Tommy G.", "Excellent food. Always tastes fresh.  I've tried pretty much every curry dish and they're all great."], ["Diana M.", "The thai iced tea is amazing. They gave us a soup on the house very delish. Portions are pretty big.The food was really good.  Got basil fried rice with chicken.  My husband got the penang curry and he saidit was really good.  I would absolutely come back to this place!!!! I really recomend it!!!"], ["Danielle D.", "Incredibly delicious food. Everything tasted and smelled fresh - all the veggies were clearly just cut and cooked for my meal. I loved the tom yum soup, even the mushrooms were just perfect! Very happy and will absolutely be back."], ["Ari S.", "Very good food! Authentic for sure"], ["Scor P.", "Went there based on the other reviews and I wasn't disappointed. Coconut soup was delicious, fried calamari was tasty, pad Thai with chicken was awesome, and pad Kee mao was perfect. I will definitely be back... my son won't stop raving about the coconut soup. It was awesome!"], ["Jeff A.", "It is really hit or miss with this one. Green curry, red curry and fried rice are good. Chicken wings are small and greasy, fish dishes that use flounder use frozen fillets which are terribly mushy in the broth. Saw bugs last two times I went there, one crawled up my kids leg. Avoid or get take out if you dare."], ["Llaniceli C.", "I've eaten here several times, every time has been a pleasant experience. The food is fresh with good flavor. It's never crowded or loud, the service is great. Take-out is a breeze. You get plenty of food for the price. If you want to try Thai food I definitely recommend this restaurant."], ["Scott G.", "If you can't drive out to Mai Thai as an Irmo resident, this is the place to go.  The pad Thai spicy tofu is really good and huge portions.  Go here for super fast service and it's right down from Harbison!"], ["B Preston L.", "Excellent dinner as always.  Staff is always very courteous and helpful without being intrusive.  Seasoned perfectly - I like medium spicy, and several restaurants consider medium to be much spicier than I like, but Thailand is always spot on.  I had Pad Thai with tofu, and it was perfect."], ["Rebelyelp R.", "Went for lunch.  Quick service.  Food was flavorful and enjoyable to eat.  Reasonably priced."]], "Golden Chopstix Vietnamese & Thai Restaurant": [["Michael M.", "Made to order from scratch so it takes a little longer but it is well worth the wait. I love the chicken Pad Thai."], ["Angie W.", "I am truly disgusted by the conditions. There was food splattered on the wall.  Tiny ROACHES were crawling on the wall next to us and on the table, and in the napkins on the table. Gnats were swarming our heads. I politely mentioned the bugs to my friend but didn't make a big deal. This is how I know I'm going to heaven because if my friend didn't love this place, I would have ran out calling the health department.I ordered the pad Thai which is a very common dish. It was a hot pile of noodles covered in peanuts. Very little flavor and very little to distinguish textures between the bean sprouts and the noodles. It tasted like it was all microwaved and blobbed together. I did not even want to try the other dish on the table which was a red curry.I really wanted to love this place and offer up 5 starts. It's local owned and the owner greeted us. Known for this beautiful wall mural dedicated to Vietnam veterans who signed acknowledging their service. All great until you sit down."], ["Gary G.", "We both tried two different curries and both were bland. Thai curries should be rich, spicy, with intense flavors. These had none. They were edible but why waste calories on boring food."], ["Eric C.", "The opening hours described are wrong. Watch for exact opening hours as the restaurant closes at 2pm to reopen only at 5pm."], ["Kristine J.", "We came here because it was recommended by another friends. We were quite a big group with seven people. The service could be better even though it was not bad. The food was quite in the middle. I could not deny that Vietnamese buns was good. It is an authentic dish but the flavor works well together. However, my friends told me that Pad Thai was a little too salty for them. The desserts were great. Unfortunately, we could not try the sweet rice mango because they ran out of sweet rice. But the Thai donuts and fried bananas were delicious. I did stop by the Asian store next door. That place sells good Asian products with reasonable prices."], ["Robert V.", "This was such a nice find thanks to fellow Yelpers! There are a few good Thai restaurants in Columbia, but this is my favorite. I haven't yet tried the Vietnamese side of their menu, but I'm excited to get around to it! Prices are right, service great, menu authentic, and all of the other things you'd expect from a hole-in-the-wall gem."], ["M H.", "This family run restaurant is FANTASTIC!!  Highly recommend any of the curry dishes, the Vietnamese Bun, Saigon Chicken, Summer roll, Tom Kai/Yum Soup, and the SUSHI!  It's a bit of a little hole-in the-wall, but those are usually the best ones!  The family is super kind and fantastic cooks!  Try this place out!!"], ["Jeff D.", "I've eaten in thai restaurants across the US, Canada and in Europe. This is one of the best! Fried wontons, Vietnamese egg rolls are amazing. My fav meal is Mussamun curry. Best anywhere. Great service. Friendly management. Gladly drive out of my way to eat here."], ["Cindy M.", "Yes, have come back again! Tried the pad Thai and it was amazing. Definitely recommend this little hole in the wall. One of the best kept secrets in Columbia area"], ["Karen S.", "I have been wanting to try this place for some time now (as it is down the street from one of my friends house).  We were having a get together at her place last night and I had suggested getting take out for dinner.  I have to agree with the other yelpers that the strip mall that this is located in is not the best, but do not let that deter you from giving this place a try.  Service was good (even though we only ordered take out).  Food was also good as well (I ordered Chicken Pad Thai).On a side note, the gentleman that was helping us mentioned Friday nights are a busy night for them, where as Saturdays are on the slower side."], ["Xinling X.", "love the bun noodles with fried tofu there! will go again! The red lighting is kind of weird though,haha."], ["Kimberly A.", "I used to live right up the street from this restaurant. The Pho is excellent, the atmosphere is comfortable and. The staff is friendly. The food is more Thai..but very good"], ["Tom S.", "The food could probably get three stars. My pad Thai was not very good, but was alright for what I paid for it. My wife's dish was beef  and veggies in a peanut sauce with white rice. I thought it tasted better than mine. I gave it two stars because we ordered it to go and they said it would be ready in 25-30 min. I show up 25 mins later and they said it would be a min. 25-30 mins later I left with our food. So either they were very backed up (it didn't look busy), or they forgot to put my order in and didn't want to tell me. Either way I won't be going back. Their is another Chinese Thai combo restaurant in Columbia that was good and comparable price, I would go there."], ["Agata C.", "Complete hole in the wall, this place serves some of the best Thai and Viet dishes I have ever tasted. Whether you go for the Tom Gha Kai, the Vietnamese bun or any of the curries, you will not be disappointed."], ["Brittany M.", "Wow.  Completely surprised by this hole in the wall.  This place is the real deal.  Everything on the menu is amazing.  Its all hand made and freshly prepared for you so you will wait a little while, but it is so worth it.  The Bun will blow your socks off and you won't be able to stop eating the gigantic bowl of Tom Gha Kai.  Do yourself a favor and go here now!"], ["Jenn S.", "Wow what pleasant surprise! Great food, fast and courteous service, very clean, and did I mention just how delicious the food!!!  Definitely stopping here again. Easy to find off I 26  in a nice older shopping strip.   And a wall dedicated to any & all who may have ever been inVietnam.   Saigon pork!!!!!"], ["Amanda W.", "MUST HAVE THE VIETNAMESE BUNS!  A noodle dish with bean sprouts, lettuce, cucumbers, carrots, cilantro, and more, plus either chicken, shrimp, or beef - I always get it with chicken and order it \"medium hot\".  They serve it with that yummy special broth stuff and after you pour it over the noodles, stir it all up, add a little red pepper sauce if you like it hotter, and dive it baby oh yeah it's the STUFF!  We always have the soup, the spring rolls (roll them in the lettuce leaves), and the Vietnamese Buns and by the time we're done, we   are    done...... haha!"], ["Sonja W.", "I am a pho junkie, i could eat pho for breakfast, lunch and dinner!  so, i took my friend and my stomach to try this restaurant out.  chopstix is in a strip mall and looks like a hole-in-the-wall (always a promising trait!).  i asked the waitress about the pho, and sadly enough, they didnt put beef tendon or tripe in their soup!  i was disappointed, my friend was relieved.  ;)   so, i went with the pad thai instead.  my friend ordered the pho.  for appetizers we had the spring rolls (not chinese -fried- style, but the fresh, rice paper vietnamese roll) and they had a dumpling deal (5 for $5).  the spring rolls and dumplings were great!  my pad thai was pretty good as well.  the noodles werent the typical flat noodles, they didnt seem as wide as i've had them.  but, this dish wasnt as sweet as other places, like thai wasabi.  thats a good thing depending on your mood.  sometimes you feel like walking the edge of a blood sugar rush, sometimes you dont.  i appreciated not having a sweet lunch that day.  my friends pho was so-so.  the restaurant was a bit stingy with the side veggies (bean sprouts and that green weed thingy) and there wasnt any basil.  i love the fact that the customer prepares their own pho with the sauces and veggies. not having basil is sinful!!  this is one of the \"musts\" of pho!!  the broth wasnt that savory either, although part of that could be contributed to my friends poor pho-making skills.  for dessert i ordered the mango sweet rice.  i have this dish every chance i get.  i give it mixed reviews.  it came in something like a rice \"patty\" that was about a half inch thick.  they didnt have the custard in the rice like i've had at other places, but the center of the rice had a nice texture so i didnt miss the custard as much.  the outside of the patty was a little dry though.  all in all a cheap meal.  for the 2 appetizers and the pho, pad thai and rice dessert the cost was approximately $30.i'd eat here again for the pad thai, so i have more confidence in the thai cuisine.  not so much in the vietnamese cuisine.  the biggest disappointment is the omitting of beef tendon, but then again, that may not bother you as much!  =)    so there!"], ["Brien H.", "Great fresh food! They are one of the only asian restaurants that I know that actually hand makes everything. Definitely try the Vietnamese Buns!"], ["Chip O.", "This place has decent Thai food. I really like the amazing thai dish. Everything is cooked to order, so prepare to wait for a while. I give it a solid C."], ["Bryan H.", "From the outside the Golden Chopstix looks something beyond sketchy, it is located in a strip mall that all but condemned, but if you swallow your trepidation and go on in you will be rewarded. The place without question has \"dive appeal. It is owned and operated by local couple and their kids. I eat there a couple times each month/ The service has always been friendly and relaxed. Now to the important part the food. At restaurants I frequent I normally try different things each visit, variety being the spice of life and all. The Golden Chopstix is an exception, I have become addicted to the Vietnamese Bun, and I can not seem to break away from it's spicy pull. It is a noodle dish, with a chili vinegar sauce, topped with chopped fresh cilantro, carrots, cucumbers and your choice of chicken or shrimp. For apps the egg-rolls are decent and homemade. The soups have all been excellent. I would recommend the Golden Chopstix with hesitation."]], "Lucky Corner": [["Dy Y.", "This is my favorite place for Korean food!  The buffet is small but always DELISH! There is a number of different things each day along with the regular fried rice and egg rolls. Food is always fresh and hot. Chinese, Thai and Korean dishes are always great. Service is excellent!  You can order off the menu anytime as well."], ["Loren P.", "We had take out for the first time from this restaurant. I had the sesame chicken which was terrible. My husband enjoyed the spicy beef and I know several other people who like this restaurant. If we try it again it will be awhile."], ["Connie M.", "I love this place!!! IF you want FRESH, HAND Prepared FOOD, this is the place to EAT! Miss Oye is one of the sweetest, hardworking ladies I know and she spends countless hours pre-paring the food for each day!  The Buffet is awesome and the food is always fresh and HOT!! You have to try it!!!"], ["Steve B.", "I give it 4 stars simply because the buffet is pretty small! However the food on it is always fresh! The beef bulgogi is some of the best I have ever had!! Highly recommend it!!"], ["Kenneth C.", "Worst lunch buffet I've ever had in my 22 years on this planet.  I should have spent 7 bucks on peat moss and that would have been more appetizing. Will never return."], ["Sandvich C.", "For about $7.50 you get a large, styrofoam container of green or red curry and one of the small Chinese take-out styled containers of rice. The red curry is very delicious, but it could use more vegetables. There is some slices of green bell peppers and some unidentifiable, julienne-cut vegetable. Their \"Thai Hot\" isn't spicy at all, so you shouldn't have any issue with spicyness.The inside of the restaurant looks nice enough. There isn't much of a selection if you're going to eat at the buffet since there is only one table. There is a decent amount of seating and what looked like a banquet table in the back.Anyways, I'll definitely come back for the Thai curry."]], "Thai Orchid": [["Angela H.", "Thai food is my favorite and we found this little hole in the wall on the way home from out of town. It looks a little sketch from the outside because it looks like an abandon fast food drive thru, but the inside is all decorated very authentic and beautifully. The food was delicious! I got pad thai and my boyfriend got panang curry, they were both to die for! Orangeburg was not that impressive of a place, but this little spot is a gem!"], ["AJ M.", "Don't mind the exterior and try it out if you're looking for some traditional Thai food. They have all your typical dishes including Pad Thai, all the noodles, all the curries, as well as some main entrees.The interior is filled with heavy and intricate chairs and tables with some Asian decor hanging on the walls. It's obvious they spent some money on the interior after taking over an old Hardees.I had the red curry w/ chicken and it was good. I would say pretty much the same in most cities. But having this option in Orangeburg without having to go to Columbia or Charleston is a plus!"], ["Jade Y.", "I came here on my birthday just to get something not too fancy bc I already celebrated on another day and the reviews were really good. Well, the food was great; it would've got 5 stars just for the food but... I did not enjoy the service. Our waitress walked to the table in front of us, set down some menus then walked away. She didnt say hello she didn't say my name is \" \", she just walked away. It took her 10 minutes to ask us what we wanted to drink and she shitting till didn't introduce herself; There were only 2 other tables with 2 people sitting at them so it wasn't crowded her anything. Then it took her a while to come back and take our order as well. She never spoke to us at all. She actually seemed rude. Someone I was with said \"hello, what's your name\" towards the middle of our meal and she said ashley or something. He said nice to meet you and she just walked away. I don't like confrontation or to make anyone feel bad but she did not deserve a tip at all but I left her $3 anyways. Great food, not so much a great server."], ["Jim H.", "Like other folks, I think the only issue I had was service; there were two servers for five tables of people, place was three quarters empty. I tried to make eye contact, but the young lady didn't seem to understand. Never got a refill on my drink, which sat empty on my table for half an hour. By the time I could ask for the wifi password, my meal was finished. Mostly an older crowd when I was there. I had the satay and pad Thai, which were both decent. Not the best Thai I've had, but it was good."], ["John C.", "This place is the real Thai and for Orangeburg a real gem!  I come here often and love the drunken noodles as well as the spicy tuna sushi.  They will spice up your dish as you like it from no spice to native.  I like very spicy food but I cannot eat the Native - just too spicy.  So be careful.  I usually order \"hot\" but last week I ordered very hot which they took as native.  Won't make that mistake again.  The service is very attentive, the food is terrific, the inside decor is great - don't judge this place by the outside - it's an old Hardees but the inside has been transformed.  BTW - every time I come here for lunch the crowd gets larger so the word is getting out that this is a gem."], ["Ryan A.", "Doesn't look like much from the outside but do not be fooled - this place was quite a treat!   We're from charleston and wasn't expecting much from an oburg Thai restaurant, but the food was amazing!!! And the service was great too!.  You can tell they put a lot of thought and effort into the food and the whole experience.  Keep up the good work guys !!!"], ["Greg M.", "Best Thai food that I've ever eaten.  It's a family run restaurant and the parents cook while the daughters wait tables.  The food is authentic and absolutely delicious.  I've been there 4 or 5 times and once even ordered something not on the menu - Pad Prig King and it was absolutely spot on.  I wish they would move to Charleston.  I would eat there every night!!Greg M."], ["JP S.", "Don't judge a book by its cover! We've consistently enjoyed the cuisine at Thai Orchid since we moved to Orangeburg earlier this year. Just $6.99 for lunch menu items which include a cup of soup and a spring roll."], ["Jennifer B.", "Excellent food. Best kept secret in Orangeburg. Great service and cute intimate setting. The quality of taste and portion is great. Lunch specials are a value at $$5.99. Regular prices are fair for the taste ranging from $6-12 depending on your meat/seafood choice and house specialities. Also have fresh delicious sushi. It's a nice change from the mundane of the town."], ["Kim G.", "First and foremost, I love Thai food. Having seen previous reviews, I went into Thai Orchid for lunch yesterday with high expectations. The food was absolutely on point. I had Pad See Ew w/ chicken... and soup and an egg roll was served before the meal. The tables are very nice and the ambiance is great for a casual lunch date, a business meal, a celebratory dinner, and/or anyone who just enjoys Thai food. The ONLY reason why Thai Orchid fell short of 5 stars, for me, is because it didn't seem to be staffed very well during lunch time. By \"staffed\" I mean if there were a few more waiters/waitresses I have no doubt that the customer service would have been perfect. Nevertheless, you have to try this place!!"], ["Richard R.", "Excellent food and I love Thai food! I was surprised to see that this gem existed in Orangeburg. The staff was nice and made you feel welcomed. I will say it is like stepping into another world. ( in a good way) the. Outside is plane and looks like an old Hardee's or something but the inside is beautiful and peaceful. Definitely coming back again!"], ["Cee T.", "I was very impressed by the lunch special for $6.99 I got soup, a spring roll and my entree. I ordered tea that they served in a reallllllly hot, tea pot. Very nice touch. Yeah the outside looks horrible but the inside is cute. Staff are very nice and attentive. They also serve sushi but the prices are a little steep compared to other cities. They also have jazz on the first Friday of the month. Overall, a very hidden gem for Orangeburg. I will come back at least once a week."], ["Doug G.", "So-so entrees and appetizers. The worst mango / sticky rice I've ever been served."], ["Larry M.", "Our family was in town this weekend for a convention. We have had a hard time finding very many good restaurants in the local area. Thai Orchid definitely stands out as one of the best we have tried! We eat Thai food a lot and theirs was definitely some of the best we have ever had anywhere. The coconut soup was far and above the best I have had in any Thai restaurant anywhere! I am thinking about ordering a gallon of it to take home with me. All the food was delicious and vegetables were very fresh. We came in with a large crowd and the servers were very friendly. They took their time and did not seem rushed. They got all of our orders correct and even had the checks separated correctly. The food came out relatively quickly and was delicious. We come to town three times a year for conventions this will definitely be on our regular list."], ["Lee B.", "Ordered beef with cashew in a sweet and sour sauce and tofu in red curry. Both dishes were excellently prepared and just the right level of spice requested.The vegetable spring rolls ordered as an appetizer are wonderful.Overall an excellent dining experience."], ["Adam N.", "Do not let the old Hardees exterior fool you. Once inside, you will see you are not in your stereotypical Asian restaurant. The tables and chairs are SOLID, hand-carved wood. And the food is better than the expensive Thai restaurants I frequented as a student in Charleston. The food was fresh, well prepared, and professional. The waitress/hostess was available but not overbearing. My wife and I were pleasantly surprised to find this diamond in the rough, in -- of all places -- Orangeburg. We will go back, more than once."], ["Emily E.", "Had a lovely experience here.  I'm not familiar with Orangeburg but decided to give it a shot with a friend and we were not disappointed.  The wait staff were very sweet and attentive and you could tell they put time and thought into the decor.  The tables had intricately carved designs and the rest of the interior made you feel transported to Thailand.  For a starter we tried the shrimp in a blanket (the name made me chuckle) and definitely enjoyed that.  They were served with shrimp chips, yay!  My salad was just the right size and had a tasty Peanut dressing.  For my entree I tried the crispy Bangkok duck, and it was perfect.  The duck was actually crispy and not fatty, which I thoroughly enjoyed.  The house sauce was infused with a lot of spices, and medium was just the right spice level for me.  Came with cooked vegetables and rice, so it felt decently healthy, too.  Highly recommend if you're ever in the Orangeburg area looking for some culture and a tasty meal."], ["Kimberly A.", "hands down some of the best Thai food that I have had in years. They have a very vast menu with lots of wonderful choices. Not to mention they have some of the freshest seafood especially sushi in all of Orangeburg"], ["Evan C.", "The Thai Orchid is hands down my favorite restaurant in town. I don't live in Orangeburg anymore, but if I go home, this place is one of my first stops. Excellent food, great service, and all around great experiences every time. Highly recommend checking this place out- it's definitely a hidden gem!"], ["Patricia B.", "If you like Thai food (and even if you're not sure if you do) do not miss this place.   We've had Thai food all over the US and the UK and this may be the best I've had.  These folks have recycled an old fast food place - outside is still a bit rough but if you let that deter you you're going to miss some fabulous food.Inside is very nicely done, cozy and quiet.  Staff is very friendly and attentive but not at all annoying.   We felt very at home.  Everything came quick and hot.When Thai Orchid says crispy duck it's really crispy - best I've had since London.  They also deliver spice - real spice - it's optional but you can go \"Thai native\" with the heat here.  Good Thai food isn't there without the veggies being done right - we had Bangkok Crispy Duck and Chicken Red Curry.  15 different vegetables all perfectly fresh and al dente - no mushy \"Chinese buffet\" happening here.  We're talking flawless Thai veg preparation.The flavors of these dishes hung together so well.  After mining the crispy crispy duck out the mix the vegetables with sauce were like a second entree and I'm no vegetarian.Add a generous cold Thai Iced Tea or hot tea in cool flavors (mint chocolate, lychee, Thai orchid, lemongrass), and you're good to go.They also have a complete separate sushi menu - didn't try it but if it's up to the standards of the Thai food there it might be a great place to go straight sushi.They also have a big beer and wine selection.Yes it's Orangeburg.  Yes it's an old fast food joint with the drive through still attached.  No it's not closed just because it looks like it is.And yes it's some of the best Thai food you'll ever have.  Just do it.You're welcome."], ["Anvess G.", "Absolutely loved this place. My family and I were in town for a bible assembly and we're not familiar with any restaurants in the area. I got on yelp and found this little gem. We had a group of 10 when we went. I have to admit from the look of the outside of the building if I hadn't read reviews on this place I would've kept driving. However, we stopped. Can't say good enough things about this place. Amazing food, Amazing service, beautiful tables. I will definitely go again next time we are in town. DON'T MISS OUT ON THIS PLACE!"], ["Scooter P.", "I could not agree more with the previous reviewers. The food is fantastic! The building is not. Super friendly and attentive service was spot on. The pineapple duck was wonderful. Also had the pad Thai, and it did not disappoint. This is truly a diamond in the rough!"], ["David T.", "Found this place while passing through on Rt 26. Its only a few minutes farther than the conveniently placed fast food at the highway and hotels bit worth the trip. From the outside you may pass as it looks like a closed drive thru place from the side. But the food will change all that.  My wife and I both agreed it was one of the best Thai dishes we've ever tasted!  We ordered the green curry, Pad chicken, House fried rice and the spring rolls.  To top it off, the service and the Thai iced yea we also excellent!"], ["Ed S.", "It was awsome, atmosphere service and food A+. Sushi was great. I was with a picky crowd and everyone was impressed."], ["Chris C.", "Best inexpensive sushi in Orangeburg! Don't judge the food by driving by the simple building and simple signage. You are missing out, if you don't go inside and try something on the menu. I'm still kicking myself for not trying this restaurant out sooner!!! Great service, great food!!!"], ["Dare A.", "Great Thai food!!! one of the best Thai places i've been to ...not for the decor as that's just ok but the food ...very deserving of all 5 stars. be sure to try to crispy duck basil ....mm mmm"]], "Baan Sawan Thai Bistro": [["Dave J.", "Goddamn amazing.  Questions?  Didn't think so...Thai is freakin' awesome and the place is chill as hell.  Period.  I almost don't want to say all that bc I'm worried about it being crowded with fatties trying to eat and having to wait now..."], ["Adriana A.", "I'm glad my colleague took me to this Thai restaurant the last time we came to Columbia. My first time I had red chicken curry. I thought it was quite good and a generous portion. Last night, we all ordered Tom kha with matzo balls, which we all loved. It was a great fusion idea. We also had pad Thai, which was good and had a strong sesame flavor. The green curry read alright but disappointing. Still, if recommend if you're in town."], ["Theodore D.", "8:45 on a Friday night in June and the doors were already closed to arriving patrons.  I should have expected that since it seems to happen repeatedly.   3 times so far this year.  I didn't inquire whether they had just filled up and wouldn't have time for a subsequent seating, which would be a reasonable excuse, I suppose. Anyhow, great food--really really good-- or else I wouldn't bother anymore.   Lesson learned: if you're thinking about it, call ahead."], ["Tai B.", "Baan Swan is fine dining style Thai food.  It's a cute little restaurant, maybe 15 tables, and you are greeted and seated immediately. Because it's fine dining it's more pricey than typical Thai food. This isn't a problem for me except that two elements were a miss for me. The Chicken Basil is really really basic. I've had better basil chicken at less fancier places. Also the have 5 levels of spicy, but if you like spicy you have to go really high in number. I ordered my basil as a 3 (significantly hot) and I think it's more of a mild. To be fair I think Baan Swan specializes in curry. They have 5 different types each served 2 ways (so I guess 10 types).  But I didn't order the curry.  My colleagues did and enjoyed it. The service the night I went was incredibly slow. It took probably 20 mins for my colleagues soup to come out as an appetizer, 40 minutes from when we ordered til when dinner came out. Fine dining or not, this is unacceptable."], ["Albert P.", "Really good service with food done superb.  Our server was John and very knowledgeable as to the flavor nuances of the 3 curries. Crispy duck was outstanding. The special was pheasant sausage and excellent."], ["Jarlath O.", "Happy with the service but not the price, the food and certainly not the cleanliness. I had a curry dish with chicken and she had curry with beef. The beef was very tough and the chicken was just so. Taste and presentation was good. For the quality of food and with the failed aspirations to grandeur, it was too expensive. $76 for two including tip was about $20-$30 too much. As to cleanliness, look around as you go to the rest room, if they care nothing of the filthy doors in that area, what is it like behind the scenes. Love That dining but not this."], ["Brandy B.", "This place has been on my radar since I started yelping - I'm always eager to try non-chain local joints.We arrived on Tuesday around 7:10, there were only 3 spots available in front of the restaurant (1 was taken, 1 was handicapped designated) and maybe a combined 10 or so, along the side (for parallel parking) and around the back of the building... which were ALL taken.  We opted to park down the hill to the right of the restaurant in spots that were labeled SHARKYS etc and hoped we'd have a car to come back to.We were able to get a table squished off into the corner without a wait, the restaurant was loud and crowded - I didn't get the cozy intimate feel I was hoping for (there was a larger group on the other side of the restaurant that seemed to be having a good time so I'll attribute the loudness to that).I ordered the calamari appetizer and shrimp pad Thai.We ordered at 7:20ish, my appetizer took maybe 10 or 15 mins to hit the table (not bad considering it was crowded in my opinion for a Tuesday and there were only 2 servers).The calamari was good - I was hungry - it was fresh, crispy, tender and the batter had a nice black pepper flavor that went well with the sweet plum sauce.The entrees didn't arrive until 8:15 and by then I was bored, and my app and drink had started to settle in my belly so I wasn't as hungry or excited to eat.This was my first time trying Pad Thai, it had a vinegary taste that I didn't like much, so I picked out a few shrimp and ate a couple bites of the noodles - trying to like it more with each bite, I ended up taking more than half of it to-go.Hopefully someone at home will enjoy it more.Our server was polite, I didn't think we got as much attention as I'd like or expect from a \"fine dining\" establishment (didn't get a refill, didn't check in with us to keep us updated on the progress of the food, didn't  check to see if we were enjoying everything once we got it).Glad I tried it, but don't think I'll be back anytime soon."], ["Kamil B.", "Exceptional Thai food! This is one of the best Thai restaurants I have ever been to. I was here on a business trip with 3 of my colleagues.  Three of us ordered curry dishes and we are very impressed with the flavors. I had the Penang curry (spicy level 4 Southern Thai style) with the catfish. It was divine. My colleagues had the green curry and they loved it. One person in our group didn't get a curry dish and wasn't as impressed, so maybe curry is the way to go here.Also, try the Tom Kha soup with some Chang Beer. The go well together. Service is longer than normal and prices are slightly higher than your run of the mill Thai restaurant, but believe me it is worth it.If I ever come back to Columbia I know exactly where to go."], ["Dorothy K.", "Love this place. The first time I ate here years ago I was disappointed by the high prices relative to other Thai restaurants where I had eaten. This is a completely different sort of place I would describe as casual fine dining. Eclectic artwork, innovative beer and wine list, charming proprietor, and most of all, incredibly tasty food. Personal favorites include the green curry, the wild boar BbQ, and the warm rice pudding."], ["Milini M.", "I use four categories when I am rating a restaurant: 1.) the restaurant's overall atmosphere; 2.) The quality of food; 3.) Service and 4.) Prices. With that preface, I rank Baan Sawan Thai Bistro relatively high in each category. The intimate bistro is accentuated with a clever touch.  Walking inside, I was greeted by a garland doorway decorated with festive lights that led to a screened - in porch.  Inside, the restaurant was quite small, but displayed interesting art and warm colors that lent itself to a calming atmosphere.  Additionally, the waiters were neatly dressed and displayed great professionalism. Yet, the food was the main attraction for me!  **Confession Alert**  I like flashy and pretty things!  Maybe it's the inner kid in me, but it's something about great presentation that makes me believe in magic.  And, man, this food was pretty magical!  My guest and I initially ordered the Satay, and I was astounded at how well - presented the dishes were! It was like the chef had re - invented himself into the culinary Pablo Picasso!  The dishes combined the aromatic colors with just the right level of spiciness.  And that was just the appetizers! Our main curry dishes were just as impressive.Warning: The prices are expensive. Yet, I do believe the bistro puts on a great show that justifies the steep prices.  Of courses, I would not eat dinner here every night, but I would come in once in a while for a fancy date or to treat myself as an upscale gift.  All in all, I would recommend this beautiful Thai restaurant, and I give it four stars!"], ["Roger F.", "Just a great experience each time. Sammy--a co-owner and the usual bartender--is a delight, so try to sit at the bar if available. However, don't hesitate to grab a table if the bar is full. The food is consistently brilliant. Unless you have allergies, please let the kitchen do their thing. Please don't get a million modifiers. It just doesn't make sense to pay money for a chef's expertise, and then change his recipe all around when you order. The curries are my favorite, but Chef Alex nearly always has two or three very inventive and delicious specials. Pound for pound, the wine list is the best and most principled in town. It's a TEENCY bit pricy in terms of markup, but I chalk that up to the restaurant being tiny, and the family needing to make in margin what they can't make in volume. Anyway, you won't find ANYONE else in Columbia who puts more time or thought into their wine program. Yummy Thai comfort food and the city's best wine list--I think that'll keep me coming back."], ["Emily E.", "This place has been on my to-do list for well over a year now, and tonight was the magical evening I got to cross it off.  My thoughts: lovely converted house with a intimate atmosphere.  Not that much seating, so do be aware if you're coming in a time crunch.   Staff was great in describing the specials, being very hospitable, and making us feel like welcome guests.The menu seemed to have the typical Thai fare, along with some really interesting sounding desserts I wish I would have been able to try.  Also seemed to have an extensive wine/drink menu, but I wasn't feeling the alcohol bug tonight for some reason, so I didn't try any of that.  Their specials surprised me.  Pulled pork in a Thai restaurant?  Never would have thought to pair that with curry, but my friend ordered that and loved it.  I also love that they clearly outline their spice levels.  I ordered a 2 (medium) and it wasn't quite hot enough for me, so maybe I'll go with 3 next time and get the juices flowing.The red curry had a wonderful flavor but the rice for some reason tasted like flowers to me, and not in a good way.  I left the rice on the plate, which saddened me because that's normally one of my favorite parts of the meal, but hopefully next time it won't have that taste.  The presentation of the food is well thought out, and artistic, however for my money, I must say this place is a little too expensive for what you get.  It's tasty and really can't complain at all about the substance, but I get more bang for my buck at Thailand restaurant because of their bigger portions and cheaper prices."], ["Erin T.", "Sheesh all the high reviews and fancy blogs I was expecting amazing and all I got was higher priced Thai food that tastes like I cooked it because the meat was grissly and steamed so kinda bland. And it was cut in a plain way like I could've done myself. I guess the wine list was nice but overall won't be back :("], ["Crystal C.", "I am seriously missing my Laos mama and her awesome cooking so I have been searching for a place that can even touch her cooking. This is not it though. This is more of a Thai fusion, which means American enough to make palatable to the non-adventurous while still offering a few things that can be labelled \"Thai,\" the chicken-coconut soup is indeed wonderful and usage of kefir lime, but for the price, I would have preferred something more authentic."], ["Gary G.", "This was our last visit to Baan Sawan. We use to love this place. The food use to be excellent and was probably the best Thai food in Columbia. Not anymore. Now the place is nearly empty on a Saturday night and the food is NOT good. I had spicy noodles that were so greasy that it was nasty. My friend had yellow curry, that was worse. What happened here? The last few times we have come here it has been poor to bad. We have come back to Baan Sawan hoping they would fix their problems, but they apparently are on the way out. Sad..."], ["Linda O.", "Enchanting and intimate dining experience with a diverse menu, excellent service, and delicious cuisine. I loved the wide selection of vegan and healthful options. If you are one that avoids eating out because of the impact on your health or wasteline, this place will be a breath of fresh air.  It was indeed a bit pricy, so you may want to reserve this restaurant for a special occasion. I was truly satisfied with my dining experience here."], ["Grace M.", "SLOW. But the food is pretty good. The restaurant is small and the hours are a bit odd, but the quality of food makes up for it. The portion sizes are decent too. I had the Tom yum soup and the pad Thai. Spicy is the way to go with everything! Their peanut chicken is okay, but isn't the best."], ["Mali C.", "Very delicious. It pains me to give this place anything but 5 stars.  I love Thai food. I love that it was a converted house.  Being half Thai I feel like it is my specialty.  The boars cheek mussamun was sooo tender, succulent perfection but a little sweet for my taste.  The panang was great also a little sweet and lacking lime leaf.  The Tom kha soup creamy awesomeness.  That all being said the service was absurdly slow.  A person in my group was allergic to shellfish.  The waiter was not helpful in coming up with alternatives.  I know Thai dishes get cooked with fish sauce often or oyster sauce sometimes but there are easy alternatives (especially if this is a made to order restaurant). I was sorely disappointed. I really loved everything but the lack of accommodation and the extremely slow service time. All in all. Food was amazing, our server was nice but my companions who had to sit at another table had a server who was rude, unaccomodating and practically yelled at them.  I won't be retuning  because of that."], ["Luna Z.", "We ordered Yum salad, 3 flavored duck, and seafood curry. Yum salad is delicious, flavorful, worth 4.5 stars. I don't like coconut milk in the curry too much, so i ordered northern styled curry. It is good, but not impressive. About the 3 flavored duck, the duck is crispy, but the flavor is actually quite simple, it's kinda boring to finish the whole dish. The overall experience is a little bit disappointing, I'm not very motivated to come back again."], ["Dee A.", "I'm not sure if I went to the same place as all these reviews.  After reading about the peanut curry I decided to order some to go.  First is the price.  Are you kidding me?  For a pretty small sized portion I ended up paying around 17 or 18 bucks.  If it was the best curry I had ever had the price would be perfectly fine.  But here's a secret.  Get some coconut milk and add curry powder and  creamy peanut butter to it and you'll have the same exact taste as the peanut curry.  It was sickeningly sweet.  I got it extra spicy and it was pretty mild.  The chicken in it was good though.  The servers were friendly but for what you're paying vs what you receive it really is not a good deal at all."], ["Angie W.", "I absolutely love this place. I love the small intimate feeling of the restaurant. I love the great service and attention. The food is superb.This is a great place to go on a date in Columbia. Thumbs up!"], ["Swetha G.", "I've been meaning to check out Baan Sawan for quite some time and am happy to say I finally got around to it last night.  We had dinner at the place and as so many yelpers have already written - they offer fantastic food and great service.  They definitely lived up to their online reputation.  We started off with two crispy vegetable spring rolls.  They serve the appetizer in a small bowl cut into two's and rested on a very sweet sauce.  Something about the sauce blended in with the texture and seasoning of the rolls just worked and it was probably one of the best vegetable spring rolls I've had a Thai restaurant!  We were off to an amazing start.  My glass of Cataldi Madonna Trebbiano d'Abruzzo 2011 was light and smooth and went well with all the food.  I loved that they let me try a bit before ordering.  My friend had a Thai beer and seemed to like it just as well.  For our entrees we had a pad thai with tofu and a green curry with chicken and were happy with all the flavors.  I particularly liked the curry options on the menu and the explanation of the heat levels (1 to 5 for most, except the green curry is only served from 3-5).  3 is hot, 4 is super hot, and 5 is extremely spicy with still somehow maintaining the food's sapidity.  Our food was a three and it was perfect for me.  They also gave a small cup of spice to amp up the heat if we were so inclined.  We wrapped up our meal with a dish of chocolate mousse and savored the fluffy airy chocolate chef's concoction. To me Baan Sawan is bordering on a 5 rating.  If I hadn't had dinner at Blue Elephant at Murrells Inlet, to me the best place for Thai food in SC, I might give Baan Sawan that perfect rating, but it falls slightly below the caliber of Blue Elephant, so it's getting a 4.75 score.  It is a close second though.And lastly, I'm being redundant here, but echoing what others have said, the restaurant is a little hard to find, so drive slow if you're turning from Harden, and you'll see it on the left side of the road not shortly after.  It's easy to miss, so just take your time.  Devine has two lanes so people can pass you if they're in a rush.  I think that covers it all.  Bon appetite!"], ["K H.", "Me and my wife went there just to see what everybody on here was talking about. I got to say this place is really good and the atmosphere is really nice and not too bad far as the place being expensive. I love it and would go again"], ["Liz D.", "Baan Sawan is lovely! I've been several times over the last several years, and it is always a great experience.The restaurant itself is small, located right between Five Points and the Devine St. shopping area. Inside, there is bar seating and about a dozen tables, so it's nice and cozy. It can get crowded later in the evening and on weekends, but tends to be a little more open during the week.Last time I went, we ordered the chicken satay as an appetizer. It was tasty and arrived fairly quickly. We also ordered a bottle of wine and three different curries within our group; everyone seemed to really like their food. I ordered the tofu mussamon curry, at a spice level of 3. I would have prefered more spice, so I would consider knocking it up to a 4 or 5 if you like a lot of spiciness. Still, it was delicious, tofu was perfectly crisp on the outside and soft inside, and it was plated beautifully. I also personally prefer the panang curry (simply a personal taste), but try to check out different things each time I go.The food is a tad pricy, but it's high quality and totally worth it. I've seen mentions that the service is slow on other reviews, and that can absolutely be the place when they are busy (it seems to be a small staff). Still, I completely enjoy my meal every time I go and always look forward to coming back, so I don't think it is prohibitively so!"], ["Kelly B.", "I ordered the pad basil with tofu to go and I absolutely enjoyed it until I found a shrimp in my food. This was so upsetting considering I do not eat shrimp. I had to throw out the rest of my food which was more than 2/3. It ended up being such a waste of money because I was already too far away and couldn't turn back to make them aware. I suggest they be more careful not to mix foods like that considering people may even have food allergies. I don't eat shrimp for religious reasons and I couldn't have been more disappointed. For that reason, I would never eat here again or recommend it to anyone."], ["J F.", "Great find in Columbia! Server at bar was awesome and let us sample many things. Went way beyond he call of duty. I had curried tofu and it was best I had ever had. Friend had curried Boar ribs and it was amazing. Don't be fooled thinking this small off the beaten path is not worth it or authentic. It was fantastic. This might be one of the best restaurants in town. Service was unreal!!"], ["Nancy Z.", "Excellent service, really personable. Vegetarian friendly. Had the Gewürztraminer wine (Delish), and the panang curry (ordered a 2 in the spicy level and it felt like 3-4)."], ["Thomas V.", "This is definitely a great Thai food spot. I've had some amazing stuff in California and DC and I can't imagine finding Thai that is much better, especially considering this is Columbia. They offer spice/hear levels 1-5. I would recommend the 2 as a minimum if you can handle any amount if heat. The coconut based curries should also add a point of heat for great flavor.I like moderate heat and I would recommend. \"3\" is great on about everything \"4\" on the coconut milk based stuff"], ["Jerry H.", "Hip vibe and really easy to miss this set back location. The stars of the show was the fried tofu skewers and yes, it's the intro to Thai Food but I love Pad Thai, this spot got it right.  Destination spot when in the Columbia area."], ["Amy K.", "Delicious.  Definitely a place that my husband and I need to visit more often.  Fresh, local ingredients,  pleasant atmosphere, friendly staff...what more cold you want."], ["Dorcas B.", "Always delicious and exceptional.   Whenever I'm in Columbia, this is a place I count on going to and enjoying the meal.   Excellent food and great wine selection.  You could easily drive right by and miss this small restaurant... but I urge you to find it- it is well worth repeat visits!  Best recommendation?  Even my parents- small town folks- make excuses to stop here whenever we're in town!"], ["Stan F.", "You will not find better Thai food in the Columbia area.  Flavorful curry. Great service and personality.  Can't wait to get back to Cola."], ["Xinling X.", "I think it's just okay. Prefer the Bangkok restaurant though. This one might be a little bit too fancy for me...Great place for dates though."], ["Joan H.", "The wait was so long it was painful--an hour and a half after we ordered.  Menu selection somewhat small. By the time we got our food, all charm was moot.  We were in the middle of eating dinner and were told if we wanted to order dessert, we had to do so then as the kitchen was closing--so rude.  7:30 on a Thursday is apparently not the time to go, but we won't be giving another time slot a chance."], ["Mike T.", "This was our first visit to Baan Sawan. Sam, Marshall, & Macey were great hosts. Sam has an extensive knowledge of wines & beers. Marshall knows \"your perfect spice number\" ( you will have to visit to understand what that means ). The trout was outstanding as well as the vegetable & spice pairings that complemented each other so well. The calamari was the best  we ever had (& the most unusual). The desserts & French press coffee topped it all off. If you want something out of the ordinary & you like Thai.....you've got to try this quaint restaurant."], ["Abraham L.", "Baan Sawan is a godsend for lovers of spice.  Every bite of their \"hot\" dishes bursts with the flavor of peppercorn, thai basil, and exotic chiles grown in the owner's garden.  It's difficult to find genuinely spicy food in Columbia, and near impossible to find the sort of complex, nuanced, and imaginative spice combinations available here.That said, Baan Sawan suffers from a lack of consistency.  Many of their dishes-- especially the non-\"hot\" selections-- are simply lackluster and do not merit their over-inflated price tag.  Once you find a good dish, stick to it; you might find yourself disappointed if you engage in too much exploration of their menu.  (My personal favorites are the Three Flavored Duck, Garlic & Pepper, and Tod Mun.)"], ["Aaron Z.", "Authentic, clean food with local ingredients. The normal menu is good the weekly specials are unique and one of a kind."], ["Becca D.", "My parents took me here to celebrate after an awards ceremony at USC, since I wouldn't normally be able to afford this kind of meal. I've eaten a whole lot of Thai food in my 22 years, and this is the best, without a doubt. I ordered a spicy green curry. My parents ordered a bone-in fish, and they absolutely agreed with me. They say it's even better than Basil, which is their favorite Thai restaurant in Charleston.Baan Sawan also has an excellent beer and wine list. You can tell that the people who run the restaurant really care about the quality of their food, and they curate their menus accordingly.The restaurant is tiny and surprisingly well-hidden, considering its location just outside of 5 Points. However, the inside is well-lit and nicely decorated. It isn't cramped or stuffy, as the tiny scale of the building might suggest.It would be a perfect place to take a date or anyone that you're looking to impress."], ["Kiki W.", "This is hands down the best Thai food in Columbia, SC! And wherever we go we tend to include Thai food in our dining repertoire, so we've sampled quite a few. Unfortunately the prices are a little high, so we didn't want to come here too often. Only for special occasions.We love the fragrant iced tea, panang curry that can get REAL hot/spicy but still creamy and sweet, excellent pad thai, of course, and oh, my absolute favorite is the Yum Salad, that I cannot find anywhere else!! It's spicy and very flavorful and you'll keep licking the plate and wishing more!"], ["Roel F.", "How about I start by explaining my score (a whopping five stars)? When I joined Yelp I promised myself that only the very best restaurants would receive the top score. In the case of Baan Sawan, I doubted a long time between awarding the restaurant four or five stars, but eventually I decided upon the latter. Let me try to explain.There really is nothing bad I can say about Baan Sawan. The food is tasty and the price is right. I have to admit the portions are not very large, but they do not need to be at a restaurant like this. The wine and beer list is out of the ordinary and not overpriced. Service is friendly, professional and fast. The ambiance is pleasant and the surroundings are cozy. In short, Baan Sawan offers an exciting and tasty dining experience!However, there is something that bothers me about Baan Sawan, but I cannot quite put my finger on it. I get a distinct 'almost precisely right, but not quite'-feeling. Were it the tastes that were not quite pronounced enough? Was it the food that arrived a bit too quickly (because that too should be avoided in my opinion)? I plan to go back to Baan Sawan in the next couple of weeks to find out. In the mean while, I will rate this restaurant the maximum of five stars... even though it really should be four and a half."], ["Blixa S.", "A favorite every time I come to Columbia! I hope to be back soon! Three flavor Duck is a must! The owner knows his beer and wine so expect to find a nice selection of both!"], ["Jonathan Z.", "A very small, nice, Thai place on Devine a few blocks from Five Points, Baan Sawan makes some very tasty Thai food.  You can order your food on a spice level of 1-5 (5 hottest).  Since heat is all relative to the person eating it, I will say that my heat tolerance is pretty high.  I don't have much problem eating a few raw jalapenos for example.   I had the Tom Yum soup, a nice broth with kaffir lime, lemongrass, chiles, and herbs with a little chicken in it.  I took it as a 4 on the spice level which was pretty hot but I slurped down the whole bowl.  For dinner, I had the Seafood Curry in broth also at the 4 spice level.  It was very good, seafood was properly cooked, vegetables crisp, some basil leaves, and occasional little bits of pineapple for some sweetness.  Very tasty with a couple of glasses of water on the side.  My wife had the basil chicken as a 2 on the spice level and her food was very good too.Overall, a very pleasant find in Columbia, better than some of the Thai we ate in Atlanta.  We look forward to our return here."], ["Gary C.", "Summary (for those that can't make it past the next paragraph) - Impossibly great Thai food, and quite possibly one of the best hidden gems in a city full of surprises.How it started - definitely easy to miss, Baan Sawan Thai Bistro has street signage that is barely legible, and from its outward appearances, looks like a completely renovated duplex... But, in not judging a book by its cover, once you enter in, has a pleasantly warm interior, with a decent amount of natural light set against hardwood flooring.  The menu is helpful (great for Thai first-timers who have no idea what they're looking at, awesome for Thai experts looking to expand their taste horizons), and whimsical (wine menu posts descriptions in haiku, and food is decoded with a spice meter that helps you rationalize your selection).How it continued - my brother and I shared everything, family style:Appetizer - Calamari - lightly battered, impeccably tender, with a sauce providing a faint kick of spice and the light tang of sweetness... like a stiff jab to get your senses flowing in anticipation of the...Main Courses - Three Flavor Duck - listed as a regular menu item, this was intensely flavorful, juicy, with the right amount of heft.... just like a right cross combination, dizzying us just in time for the...Bison Sausage Noodle - sold as one of the specials of the day, featuring tender bison on a bed of mixed vegetables and flavorful gravy, this was the knockout punch we were waiting for...How it ended - by way of 3-round knockout, we declared Baan Sawan the heavyweight Thai champion (at least of the Southeast, and possibly of the U.S., besting even Las Vegas' Lotus of Siam)!"], ["Anita F.", "If you are looking for imaginative flavor (and aren't afraid of some heat); a rather cool, fun atmosphere for adults (wouldn't consider taking a few kids - Mom won't appreciate the atmosphere and food); Great \"date night\" kinda place; with great desserts and an exquisite unusual beer & wine selection - this is it! A perfect place to sit back, take your time, experiment and spend a fun evening. Alex makes the food sing (w/ interesting presentation) and Sammy knows how to be refined yet not stuffy (great at suggesting the newest and most unusual from the bar).If you really aren't into trying new flavors, don't want to dress up a bit, looking for a quick bite with the kids, don't get into unusual wine &/or beer (either don't drink or are a Bud Light kinda person) - you may be somewhat disappointed ...Just sayin' ... ;-)"], ["Trey G.", "A friend of mine suggested we try Baan Sawan for dinner last night.  I had never seen it (though, I spend little time on Devine Street, so I've missed much) but found it and was even happier to find they have their own parking!   My friend had already arrived and had a table.  The place is small, but well appointed. It was somewhat distracting to see an office door in the wall of the bar area.  From my seat, you could see it constantly open and close.  A bit distracting.  A curtain or something else that made less noise and draws less attention would be a far better thing. The wine/beer menu surprised me - it wasn't, say, Barley's or Liberty Tap Room in scope of size - but what they did offer was excellent and very reasonably priced.  I started with the spring roll with meat and my friend started with the veggie spring roll. Both tasted excellent and had clear, clean flavors. The sauce that was on the plate, however, needs work. It really did not compliment or enhance the flavor of the rolls and occasionally became a bit too bitter on the tongue.  The beer helped.  Staying away from the sauce - the roll was excellent.She had shrimp pad thai and and I had three flavored duck. A noteDuring the ordering process the spice scale was explained.  1-3 are your typical mild/medium/hot - 4 and 5 are significantly hotter - and Holly (our excellent waitperson) said the chef doesn't eat above a four.    Thinking that was serious business on the spice end, I opted for a 3 with a side of spice.   Caveat: I'm one of *those* people who loves Phaal and all things spicy.  The 3 wasn't even warm.  The extra spice didn't help (think garlic/chili paste with something else in there - about a \"medium\" salsa heat).  If you know you can handle heat and you like heat - I'd start with 4.  Holly did warn us that the food would lose quality after 4.  I disagree. For some people, yes, that is true. The palate gets lost with all the heat and you can't taste anything.  For some of us others, though, the heat opens up everything and flavor profiles are enhanced.   The duck, though mild, was incredibly good.  The flavors were clean, bright, and paired well with the duck.   The shrimp pad thai looked incredible. In some places you get three or four shrimp and a ton of veggies.  In this case there were plenty of shrimp and I am told it was some of the best pad thai my friend has ever had. We opted to split the fried bananas for dessert.  My friend and I agreed it was a bit too much dough and not enough banana, but not bad.   On the whole, Baan Sawan is a rare jewel in Columbia -  and I look forward to returning there."], ["Tanya M.", "Really small, but really good. Best Thai in Columbia!"], ["Jen M.", "Best Thai in Columbia... The staff is outgoing. Impressed by the wine selection and quality of the food. The spice in my curry was spot on. Def. my favorite restaurant in the Five Points area."], ["Harpreet K.", "First thing I see on the specials menu: Pulled Pork Penang. That is what I'm talkin' about!! Authentic? No. Legit? YES! Columbia, South CARO-LINE-AAA, is surprising in a lot of ways. First of all, they are about to elect a Sikh-Methodist woman governor - google Nikki Haley - and that about blows my shit (politics aside). Second, they have some of the best Thai food I've ever had in my overly indulgent life (and I spent three months in South East Asia with some munchies like you would not believe! It was like Brokedown Palace up in that piece, minus the going to jail and wanting to die part). Anyways, per usual, I digress. ENTER, BAAN SAWAN. Awesome ambiance, including a huge flowering pot of Jasmine near the entrance. With the sultry warm air and the sweet smell of Jasmine perfuming everything you're transported to a completely different place. The restaurant itself is on top of a hill, so I literally felt like I was entering a tree-house restaurant or something - fab.U.lous. Second, the wine and beer list is truly diverse and impressive. Pricey, but so worth it. My friend ordered a fancy french beer in a 780ml bottle, the thing cost him $18 bucks! I'm from San Francisco, so anytime something costs too much and looks and tastes gorgeous, SIGN ME UP! As for the food, wow - my gulf-caught shrimp and red curry was absolutely delicious - the freshness of the ingredients was immediately apparent, as was the chef's clear understanding of the nuances of a good curry. Purrr-fect! I ate the entire thing, no problem. I'm trying to be a little more \"mindful\" of what I eat these days, so I asked myself if I needed another bite and responded: \"F*ck you Oprah voice, I'm eating this mutha-f*cker whole. STAND DOWN.\" ....Yeah, I'm gonna get that looked at.... bottom line, this ranks as the best meal I've had in 2010, and my favorite restaurant in Columbia!"], ["Josh S.", "A hidden gem in 5 points.  Best thai food in columbia for sure.  I'd recommend the red curry.  My only small complaint is that they give too much rice in proportion to how much curry is on the plate."], ["Web F.", "Good food, upscale, a little expensive but worth it."], ["Gunnar P.", "Great food and service. They have a great menu and the service is wonderful! Willing to give you recommendations and the bar has a great selection of wine and beer. I will be back frequently!"], ["Alice L.", "This Thai restaurant is very pricey and I only feel ripped-off at the end of the dinner service. The food wasn't as good as I had expected. It was simply spicy - every dish. I couldn't taste anything and I kept drinking water the whole night. Most of the other customers ordered wine, but we skipped that. The restaurant is very tiny. I guess that makes it unique. The atmosphere is okay. I think if I had ordered items from their special menu, my dinner would have been nicer."], ["Diana M.", "Food was good but NOt worth the price and the extreme log wait."], ["Betty R.", "Tod mun (chicken/shrimp patties) were flavorful and crisp, and duck matzoh balls (the special app of the day) were frickin' fantastic - fluffy, spicy, and totally unique. Spicy noodles with shrimp were delicious, and a HUGE portion. The wine and beer program is awesome - lots of interesting finds, and Sam, the proprietor/bartender/philosopher, is more than happy to share them all with you. We sat at the bar and had a blast, winding up the evening watching Muppet clips on Sam's laptop. Thanks to a friend's suggestion, Baan Sawan will make me dread my next trip to Columbia a LOT less."], ["Michael G.", "The atmosphere is very comfortable. It has the feel of a place that only a few people know about. The food is really good (try the duck confit!), but it's a little pricier than it should be."], ["Jen H.", "decent thai food but not entirely authentic.  it's not quite fusion either...the taste of several of the staple dishes are quite americanized with some dishes being less spicy and more sweet than they should. the waitstaff and servers are all very pleasant. the atmosphere is nice for a special occasion or date. parking is based on the street though there is a tiny lot infront of the restaurant.  other restaurants in town offer better thai food but if you're looking more for thai food + atmosphere, baan sawan is your place. as for me, food is #1 so i gave this 3 stars."], ["Laurel B.", "The food is very good by any standards, and the atmosphere is very nice.  It's pricey for Asian food.  But the quality of the ingredients is excellent.  I tried the salad, soup, red curry, sashimi-grade salmon special, and pad thai, and it was all great.  Service is slow (but very pleasant) so order your appetizers right away.  (Slow means they are making it to order, so I'm not complaining even though I nearly perished of hunger.)"], ["Jaime N.", "I stopped in a while back and got a fabulous peanut curry dish with chicken.  I also was impressed with their unique selection of beers, and my server was knowledgeable enough to suggest one that went well with my meal.  The renovated bungalow is as cute as a button.  It is a little pricey for Thai food, and I would probably eat here once a week if it were a little less expensive."], ["Who W.", "This is good Thai food for Columbia. Perhaps a bit pricey for Thai, and it tends to be spicier than normal 'south carolina spicy,' but in general it is good food. Also, they tend to be a bit outside of the US version of Thai, so expect to see some different stuff. One thing to note, they do not take reservations (although the page here says they do)."], ["Charlie G.", "Baan Sawan takes the delicious spiciness that is Thai food in general and adds equal parts fresh ingredients, excellent preparation and pleasant atmosphere.  These are all welcome additions over your average Thai restaurant.  Moving to a place one block away has been one of the finest decisions I've made in my life.  A word of caution from a humbling experience though: the spice scale runs from 1 to 5 here.  On my first visit I heard 1 to 10, ordered a 5 and have been able to infuse any object with hot, hot spice directly from my fingertips ever since.  While this Midas like ability has its pluses in the kitchen, the pain of the acquisition and the rate at which I go through keyboards these days makes me say you're better off without it."], ["Ind R.", "Excellent memories of the red curry...Baan Sawan is nice enough for a special occasion, without feeling pretentious or stuffy. The food is phenomenal! Plenty of vegetarian options. Last I checked, they only serve dinner, no reservations, no take-out. Be prepared to wait on weekends. Great service the few times that I've been!"]], "Thai House": [["Bo L.", "Excellent Thai food and super friendly service by the owner. All the ingredients are incredibly fresh, and they cook to order. This is a great place to stop when you're on I-95 -- it's right off the exit."], ["Ineke S.", "Excellent food and a welcome respite from the chain foods and fast food along the I95!This small restaurant in a gas station strip mall doesn't look like much from the outside, but it offers a delicious array of Asian food: Thai, Chinese, Japanese, Vietnamese and even some Korean.I had the lunch special with ginger chicken, teriyaki salmon, sushi, salad and fried rice. Generous portions and delicate but distinct flavors. My husband had a seafood soup where he could adjust the spiciness from a level 1 to 10. The Thai fried rice is excellent and my son enjoyed his beef pho, although he said the ingredients weren't entirely authentic (no bean sprouts, cabbage and onions instead).The owner is delightful. He is chatty, but not annoyingly so. He made sure we had everything we needed and I heard him walk other diners through the menu offerings, making suggestions where appropriate."], ["Jerry L.", "Really good food!!!It's a little restaurant in a less than attractive gas station strip mall, but don't let that keep you away. Delicious spring rolls, hibachi, and pad thai, all freshly prepared!! It's a shame we're only passing through or else I'd be back often."], ["Craig H.", "Excellent food but service is horrendously Slow. Had Penang duck and a bottle of happy Buddha beer. Great flavored. Took about 25 minutes for the waitress to take an order, and it looked like the cook came over to take orders and deliver the order."], ["Mae A.", "Great little hole in the wall! Traveling from Orlando back home to NY and found this great review on yelp. So glad we came here and avoided all fried chicken and fries that makes you feel gross after you eat. They have a great variety of Asian cuisine! Highly recommend!"], ["Paramjit S.", "This is a real treat. Owned and operated by a family from Thailand. Good food and very efficient and friendly"], ["Liza R.", "Great option for normal food on our way back from Florida. Thanks to Yelp we were able to have a good and tasty meal. Very attentive service."], ["Fran D.", "A great deal make your own meal.  I chose angel wings and half spicy crab, with 3 flavor flounder topped off with a Thai beer!  Excellent!  We also had spring roll, sweet and sour soup, and curried chicken.  Again yum!  Finally chicken wings, house salad with ginger dressing and fried rice!  No complaints!  Delightful people.  Again, don't get turned off by the location  - the best is inside not out!"], ["Elizabeth B.", "If this book had a cover it would be ragged and worn but upon opening this tale you would find it to be a most amazing experience. While the outside does not look like much, the inside, food...drinks...service are amazing.... Highly recommend the build your meal if it offers items you will enjoy.  Traveling from NY to FL and will most certainly stop if in the area again."], ["Mark W.", "Don't be frightened by the gas station parking lot.After all, you are in a small southern town.I grew up in SC...people used to always hang out at the \"filling station\"Sam, the owner, is a genuine friendly man and has been a cook for decades.He, with the help of his family, deliver a great meal in a cordial atmosphere.I recommend the Pad Thai. It's a little bit sweet, a little but spicy, with a good peanuty flavor.It's a great place to start, if you haven't had Thai cuisine before.Sam will even adjust the amount of spice for you in case you're afraid of it being too hot.I have had Thai food in Boston and Seattle.Sam can hold his own at this place...in Santee!"], ["James P.", "I got yellow curry. Very much Thai style with a good service. Restaurant is clean wits a good ambience."], ["Gerald F.", "A really great find off the culinary desert of I 95. Tasty Thai food,pleasant and helpful service, and a knowledge of vegan requirements.  Totally excellent!"], ["Chris G.", "A tiny, family run, authentic restaurant where guests are treated like family. Ignore the exterior!!!!! The food is amazing and the hospitality blew me away! Everything we ordered was made fresh and was delicious.  Great place to take kids. Very convenient location just off I-95."], ["Jonathan H.", "Good Thai food (I had green curry) good value for money, and very friendly service.  It seems the locals love the fried rice- I was the only one eating in at the time but at least five people came in to pick up fried rice... Not sure if it is that good or if small town South Carolina just doesn't dig Thai.  If it's the latter, come on people, give it a try!"], ["Linda H.", "We ate here when we stopped midway for the night on our way to Florida. We're proud to call ourselves foodies, originally from NYC, and live to eat good food. Exhausted after a long day of driving, we just wanted a non-fast food meal. Boy, did we hit the jackpot. Truth be told, we set our expectations pretty low considering where this restaurant is located. The place is owned and run by a warm and friendly man, his wife, who does all the cooking and his adorable daughter who waited on us. It is clear they make it their mission to make their guests happy and they deliver in every way . We ordered pad thai, green curried chicken, general tsao's chicken for our little one and a flounder special for our daughter. Apps were spring rolls and sushi, made to order. It would be an understatement to say we were blown away at how delicious everything was. Honestly, this little hole in the wall restaurant, tucked away in a strip mall behind a gas station, with kitschy decor and all, rivals the best Thai restaurants in NYC. You won't be disappointed."], ["Valerie C.", "Appearances are deceiving. While it looks like it's basically at the gas station, give it a chance because the food is excellent. The pad Thai was wonderful, but the green curry was really excellent. Worth timing lunch or dinner around when you pass through Santee on I-95."], ["Joe C.", "I arrived at this small Resturant. It is a bit funky but good looking except that every table was dirty with dirty dishes old food from previous guests. At first I thought there must have been a rush and had not had a chance to clean them. I sat down once they cleared one table. I ordered a nice meal and they made up for the messy tables which remained dirty throughout my meal."], ["Ryan C.", "If you are thinking about eating here, think no more and just do it. Food is excellent, staff/owner is friendly. It is very fresh and expertly prepared, so well worth the wait. Create your own meal is a great value. Delicious :)"], ["Martin G.", "It's hard to find healthful Asian food close to I-95 in SC, so hoping this small restaurant thrives.  This has quite good food, moderately priced, with excellent service, and a very extensive menu including large sushi offerings.  For appetizers we had teriyaki chicken, dumplings like shumai (Chinese).  For entrees, the specialty crab/seafood dish was fine, and the green curry was OK but the sauce was almost certainly bottled. Vegetables were not overpowered by sauces and presentation was good.   House fried rice was very good (there is Hawaiian and Thai versions as well), Service attentive to spiciness."], ["Ron L.", "What a surprise!     The seafood curry was  delicious and beautifully presented.   The  rad nah was as good as we've had in any major city.....(we're from Los Angeles, where Thai restaurants are ubiquitous!).  The mee krab was a new twist .....savory, not sweet, and very satisfying.   Two thumbs up for Sam and Tina."], ["Garrett D.", "The best Thai restaurant I've ever been to. Sam, the owner cuts no corners and uses the freshest ingredients. The chicken pad thai is unbelievable and the service is first class. Do yourself a favor and check it out if you haven't already."], ["Sarah B.", "Great place to eat! Yummy Thai and easy to get off I 95. Lots of great Vegetarian and Vegan options. Will come here again!"], ["John R.", "Very good!! Everyone loved the sushi and the special. The staff was very friendly. Will visit again when in town."], ["Renae C.", "Great sushi here! Best I've had in a very long time. A little slow but fresh sushi. Two thumbs up."], ["Rebecca T.", "+ took a chance and had a wonderful meal to nom on in the car instead of having to get bojangles. :)+ right off the freeway next to all these gas stations, subway, and other fast food chains so it's a good chance to get a break from that food if you've been on the road. I've had one too many subways on the road now... + great combo meal and price with entree (curries, pad thais, and stir fried dishes) and 2 apps (egg rolls, rolls, and dumplings). + super friendly and cute family runs the place.+/- takes longer than bo time but worth the 15 min. besides, you can get some gas, stretch and walk around before you have to drive for another 4 hrs til your next stop."], ["Paul B.", "Great Thai Food!This is a great little family run business! The food is very good! The Pad Thai is good as well as the Panang curry chicken!It's one of those strip mall places next to a gas station~ It has seating for around 20 people- The proprietors are very nice, the teenage kids (usually doing their homework at a back table) act as servers - and you can hear mom and dad in the background cooking and yip yappin :)You can't go wrong ordering up some take out from here if your in the neighborhood!"], ["Patti S.", "An awesome vegetarian option while traveling thru via Rt. 95.  Simple little place in a strip mall, nestled between the fast food, gas station, truck stop right off exit 98.  I ordered the fresh spring rolls, the made-to-order piping hot and delicious Jungle Soup (a.k.a. Vegetable soup) and vegetable fried rice.  All fresh, ample portions.  My husband had the egg roll, hot and sour soup and tofu Pad Thai with a side of in-house roasted hot spice mix, served in a cute little kitty canister. He enjoyed his meal as well.  We will remember this little treasure for the next time we are driving through.  CLOSED BETWEEN 2-4 PM!"], ["Mauricio G R.", "We stopped at Santee, SC. Saturday 17 on our way back to FL where we leave. We chose the Thai Cuisine 2 as our dining place and we did not regret. The chicken pad-thai I had was fantastic as well as the vegetable dish my wife ordered.  Previously, my son and I have enjoyed some teriyaki wings with sesame seeds, and after that, I took care of a California roll made in front of my very eyes! This great dinner was topped of by a house-made mango ice cream my family enjoyed. I opted for the sugar-free coconut ice cream. Both kinds were delicious. Owner Sam and his daughter worked very hard to please us and other costumers filling up the house at that time. All we can say is this: it is worthwhile to plan a stopover in Santee, just to enjoy the thai and other asian delicatessen at this place.."], ["Frank T.", "I was visiting relatives who live in santee who had recommended this restaurant.  I know santee pretty well as my parents retired here 20 years ago.  I live in the ny/ nj area where there are a lot of great thai restaurnts and this is the real deal.  It's truly a family operation and the owners are exremely nice people who make everything from scratch.  The soups are authentic home made, nothing is mass produced.  Because everything is made from scratch, the wait for your food can be a few minutes longer than in a chain restaurant, but the wait is well worth it.  The other reviewers are also correct about the location.  It's tucked away behind a gas station next to a convenience store.  Those who find it will be in for a pleasant surprise."], ["Julia S.", "Don't pass this place by! It's a gem hidden away in a gas station strip - so from the outside it looks just horrible. You will be reassured once you are inside ! You can eat in, carry out or have it delivered. I was driving through Santee on a road trip and stopped for the night. This food was amazing! It's the real deal! I was blown away at how good it was. You won't be disappointed."]], "Taste of Thailand": [["Jennifer T.", "This place grows their own herbs and spices in the back and the portions were huge. The food was good considering this is a small place in a small area. The waitress was friendly and was apologetic when the food came late. I would go back again if I crave thai food when I am at Sumter."], ["Armand D.", "Updating my review because Susan recently added a new item to the menu that deserves praise; Thai Noodle Soup. It may not sound like much but it is really, really good and worth coming in for (She serves it only on Saturday). It is very similar to a Vietnamese Pho so if you like that then you will definitely like this although I like it better than any Pho that I've tried. It's a perfect blend of beef broth, vegetables, herbs and spices and chicken. She also uses real, fresh garlic cloves as opposed to garlic flavoring and you can definitely taste the difference. There are two sizes; a regular bowl ($5.99) and a large bowl ($9.99). We get the regular bowl and it's plenty filling. Last weekend my 11 year old tried a bowl - he doesn't like Thai food, but he said it looked good and wanted to try it so we got him a bowl and he loved it, much to my surprise. If you're looking for something different to try, I highly recommend it. We used to drive to Columbia just to get Pho so we're thrilled to have something like this in town. Now if we could only get a good sushi place in Sumter..."], ["Lindsay H.", "This by far is the worst Thai place I have ever been too! I walked in & was the only person there. That should have been my sign! I ordered a drink. After 10 min they brought it. Then when I received my drunken noodles it really tasted like they were a day old & reheated. It was dried out and the staff never even came to see how I was. Then the worst part was when I paid $15.00 for day old noodles! Save yourself! Don't waste your time!"], ["Josh S.", "I went here for the lunch buffet. They had about 12 dishes on one bar. All that I had were flavorful, some were spicy, some were not. They had another bar where you could build your own lettuce wraps. Everything was very good."], ["Lauren C.", "The food is great but you need to call at least 45 min ahead."], ["Michelle C.", "Family run, great people who are very welcoming. I don't make it out for the lunch buffet.  The dinner portions are large, full of flavor, and cooked from scratch.  I was surprised by the cute interior:  the facade is not very cultural.  I had driven by almost a year before I ever stopped.  Don't miss your chance to eat here!"], ["Paul C.", "Been here twice.  Dirty never had any good on the buffet.  This time my wife was eating and found a huge black hair about 6 inches long in her food.  We paid for the drinks and left.  Never going back."], ["Robin W.", "Not great. I met a friend here for lunch at 1130...they let us in but apparently they did not plan on opening this early. The buffet was mostly ready at least but it seemed more Chinese than Thai. The orange chicken and the pork(?) and onions were pretty good, but I thought the pad thai was super bland and everything else was really spicy. Finally I saw two bugs resembling young roaches climbing the walls...not a good sign in broad daylight. I won't be back."], ["Keyana H.", "They have large portions, so you may have leftovers if you don't come in hungry.  Great authentic flavors. Fresh herbs grown right out back. Dated building but clean interior. I would recommend this restaurant for the home cooked Thai food experience."], ["Leslie L.", "We love this place! I've had the pad Thai both times and it's outstanding. The service has been exceptional. Definitely will be going back again."], ["Ally R.", "The red curry was delicious. It was different than any Thai curry I have had before (very heavy on lemongrass) but I really enjoyed it. Service was good and you get free refills on thai tea!"]], "Fusion": [["Michelle H.", "Great food, great friendly service.  Lunch specials come out super fast, other dishes fast as well.  Great selection of Japanese food and sushi, and Thai food tastes authentic as well.  Portions are fairly big and I always tend to take out leftover...depending on how hungry I was, because the food is so good!"], ["Greg P.", "Highly recommended. We have not had a bad dinner here. Quick friendly service at reasonable prices. The chicken and shrimp hibachi was delicious."], ["Kelsey F.", "What an awesome little find! I couldn't have been more surprised to drive through Newberry and find a GOOD Asian fusion restaurant. The service was speedy, waiter was funny and polite, food was good and not over spiced, and the prices were VERY reasonable. My two complaints would be the limited menu and the absence of a vegetarian soup. I had the red tofu curry and my friend had the alligator roll. Don't let the facade of the building turn you away - delish stop!"], ["Cindy N.", "BEST Thai we have had is the US!! Super surprised. Fantastic service. Larb salad to die for. Perfectly cut nite-sized sushi. We will definitely be back :)"], ["Josh C.", "Highly recommend this restaurant! The service was amazing. They were extremely friendly and fast with the food. We loved the steak, filet mignon, and fried rice. Our favorite sushi was volcano roll, shrimp tempura, and summer roll."], ["Kimberly G.", "Highly recommended this restaurant. The atmosphere is great, staff is very friendly, they remember you even if it's been awhile since you have visited. Prices are great also. The FOOD...is fantastic."], ["Marilyn C.", "Ok.. We have been by this place many times and did not go in because it does look like a dump... In what use to be the Hardee's...we Read the reviews... And this place really lives up to them... We called to make sure they were open, as we were stopping on a Sunday evening... The owner met us at the door...he and his wife are super friendly!  We ate the Summer Roll at his suggestion... And we were not sorry \"delicious!\"....oh yes, the inside of the restaurant is very nice.  Miso soup the best I've ever had!.. Next course.. Pad Thai with chicken... We will be back!!!  There's lots of good things in his menu... We're going to go thru them... One at a time.nice to finally have a good restaurant fairly close to us!"], ["Frank D.", "I happened upon this gem of a restaurant while in the road to Columbia. It was close to 9 pm and I figured McDonalds was my only option. Fusion was across the street from McDonalds. Sure, it was more costly but the food was excellent and the service very friendly. I even liked the music (Sinatra, etc.). I hope to come here again."], ["Michael B.", "1st, was born-raised in Newberry....fast forward that I recently moved from Houston TX with its Mecca of many versions of any food-fare one desires back to Newberry SC...skeptical is the feeling as I entered the doors....amazed as the waiter engaged me of the menu, plus he was infatuated with my daughter...a hidden gem of Fusion or tastes found in or of countries of the West Pacific."], ["Rachel N.", "A pleasant surprise. We were traveling back to southern GA from our trip in Asheville, NC when we said we need to find dinner. Which can be sketchy in the middle of no where. This place was so welcoming. Not scary at all. We walked in greeted by a friendly man who told us to sit wherever we wanted. From there we ordered the Alaska and Alligator rolls. Along with the combo steak and shrimp hibachi combo meal that came with rice, sautéed cabbage which is the best cabbage I've ever experienced. The shrimp were jumbo big shrimps. The steak was nicely marinated. The Alligator roll had a wonderful flavor beginning to end. Our waiter made sure our drinks were always filled and the atmosphere you just wanted to meditate and take a nap there because it had such a relaxing zen-like atmosphere. The icing on the cake was my visit to the ladies room where I discovered a nice updated music soundtrack as I danced over to the sink to find scope mouthwash, dixie cups and gourmet flossing sticks. Great for all of you on first dates hoping for smooches after. Overall, this was a wonderful experience. Highly recommended."], ["Alyssa M.", "I was pleasantly surprised by this restaurant.  Lunch specials are plentiful, affordable and delicious. I had chicken fried rice to play it safe but will be sure to try something more adventurous next time. Very clean and upscale looking when you get inside. Waiters all were very friendly and seem to like their jobs. That's a big factor in a successful business."], ["Mary M.", "On business, looked up a restaurant on yelp in Newberry, SC. Surprised a Thai option rose to the top!  Like the reviews say, not much to look at outside. Nice inside. Great service. The coconut soup was really good and much more food than I expected. Had green curry chicken. Very tasty. Solid meal, pleasant experience. Glad I made the stop!"], ["Lisa P.", "Okay the place from the outside looks crappy and shady but once you walk in its nice and looks very cozy. The service is awesome!! The waiter was friendly and the owner was very nice! I am always happy with the service. The sushi is amazing and made very well.Bottom line, I will return!"], ["Don F.", "Sushi is incredible!  The Koko Special roll is my favorite.  I started with the  coconut soup. Lightly spicy with nice chunks of tender chicken and mushrooms.  Awesome!"], ["Jay R.", "we love this place, my wife has discovered she likes saki, the white sauce is great on just about everything, very friendly staff, we recommend stopping in when your in town,"], ["Lily H.", "Fusion is a regular visit for my family, with 5 out of the 7 of us being gluten intolerant. (Not me, thank God)  I have never had anything I don't like here. Their sushi is delicious and there's a wide variety of rolls to choose from. My nephew is 7 and likes a special roll that isn't always on the menu, but the sushi chef makes it for him anyway. I love the curries. I'm a wimp when it comes to spice but I can't stay away from those curries! Also, never say no to a sake martini. The owner always says \"sake make you happy\" and he has made me a firm believer in that!"], ["Priscilla C.", "One of the best I've had since moving from SF Bay to SC 18 months ago.  (Figure THAT out.) They really try & do their best with what they do. It's not necessarily exactly what they attempt, but I give them an \"A\" for trying & coming close.Their sushi menu consists of 3 raw items....& if I remember correctly, 6 \"cooked\" varieites. Speaking with them for a while, I must say they are very nice people who love what they do.  However, they have both cash and logistical issues with buying local, fresh ingredients.I appreciate the food I get here but don't expect that the menu translates to the product.  There just isn't the availability of fresh produce & herbs here to complete it."], ["Ryan H.", "Very friendly and fast service. The food is really good as well. Try the volcano cooked roll! It is very good."], ["Candace F.", "This was our second visit while on route between Asheville and Charleston. The food is good and the service is great!  Give it a try."], ["Sandy S.", "Fusion is the best restaurant in Newberry for Thai and Sushi. Comparable to any Japanese and Thai restaurant in any large city, they offer remarkable food at affordable prices and go out of the way to make your visit there amazing. The owner and staff are friendly and knowledgeable and always willing to go that extra mile. The next time you are in town and want a great experience, give Fusion a try. You won't be disappointed."], ["John S.", "This place has become a family favorite.  My overly picky kids love eating here.  The Japanese entrees are good but the Thai food and sushi are fantastic.  The sauces are all made in-house and are excellent.  The owner makes you feel welcome and often will bring a free cocktail to the ladies at your table.  You can't go wrong with anything on the menu here!!"], ["Emily T.", "Everything I've gotten here has been good.  Not quite up to par with Cozy Yum Yum or Siri Thai in Athens, GA, but still a great place to eat.  I have ordered something different every time and have thoroughly enjoyed each thing I ordered.  The sushi is also very good, even the cooked variety. The staff is extremely friendly and welcoming.  This is the most visited restaurant for me and my husband in this city."]], "Thai Chili": [["Jeff C.", "After being in Korea for a few years, I had fallen in love with Thai food and thought I'd never enjoy, truly good, Thai again. Fortunately, I was wrong. The food here is phenomenal and so are the people that work here. Everything that I have eaten has been on point and the portions will, assuredly, leave you satisfied! Give it shot."], ["amanda s.", "There were two Thai places on 441, the other one closed, so I decided to try Thai Chili, I only know to get Pad Thai noodles at Thai restaurants, and this one does not disappoint.  The parking lot is like the surface of the moon, littered with craterous holes, but once you get inside its nice.  They have a portrait of the king and queen of Thailand at the front counter, which gives an authentic impression.  The people are very friendly, even when you walk in 10 minutes before closing.  The pad thai is delicious and the take out portion is good for 2 meals."], ["Ed X.", "I just had lunch there today -- This Thai food is as good as any I've ever had... Food and service are wonderful.  Interior is nice and peaceful.  It doesn't look good from the outside, but on the inside it is awesome.  If they ever re-vamped the parking lot, they'd have people driving in from downtown Sumter and even Columbia. If you work in our around the base, this is a complete no-brainer for lunch .. (or to take dinner home.)"], ["Scott H.", "What a wonderful surprise! Had the Masman curry... thai hot Wow!  I've traveled all over the world &this is  food solid thai Ambience is non-existent but the FOOD is great. We will be  making the hour drive again for this"], ["Jasmine G.", "Used to go here almost day when I was stationed at Shaw AFB.  Location was perfect it was located right outside the side gate and they had fast service with great customer service.  I swear they knew each customers name and favorite dish.  I never had any issues and every person I took loved it just as much as I did!  My ultimate favorite dish was the Pud Thai Guy (Thai Spicy) with an order of Spring Rolls.  The Thai Tea is really good there too!"], ["Sean L.", "By far the best Thai in town.  I always go for pineapple or red curry with tofu, and haven't been disappointed once.  The outside is very unassuming, and I actually questioned if they were still in business on my first visit.  Everyone that works here is very friendly and the service is quick.  Their little daughter is frequently playing in the restaurant or parking lot when I have gone, and loves talking to those around her.  My only complaint is very minor - the take out portions are much smaller than what I am used to up north, but still more than enough to fill me up.  Just not enough to have lunch leftover for the next day"], ["John H.", "Off the beaten path but everything I had was very good!"], ["Jonathan C.", "i really like this place.  very small dine in area but the food is always fresh and tasty."], ["Kristen R.", "This the best Thai in the Sumter area so far. I had the pad thai and my husband had kung pao beef. The food was good & the service was great. They were very friendly and attentive. Also good for take out!"], ["Wendy M.", "When I travel on business I always try to avoid the chain restaurants so YELP comes in real handy!On my latest trip to Sumter, SC I didn't have much hope of finding anything unique as my hotel is nestled between an Outback Steakhouse and a Chilli's Restaurant (neither is an option in my book). I decided to Yelp Thai restaurants and luckily I got five hits in Sumter.  I just got back from Thai Chili and have to tell y'all it was FANTASTIC! I had the Tom Yum  Vegetarian soup to start (delish) and a couple veggie sushi hand rolls (had to take one home) and an order of fried banana's that I'm munching on now.  I highly recommend this spot if you ever find yourself in this neck of the woods :-)"], ["Michael F.", "Went here cause I've read the rave reviews. Again, the front decor isn't much but it's so refreshing once you enter inside the restaurant.The waitresses were really nice and promptly let me sit at any of the tables available. The lunch specials were priced rather cheaply and for $6.99, you can have Pad Thai along with rice, a salad and fried spring roll. I opted for the curry (goes for $7.99 with rice). Note that I ordered the yellow curry which isn't on the lunch special but they let me have it at $8.79. It was served with a cup of steam rice and a bowl of delicious yellow curry with chicken. I ordered it as medium (you can get mild, medium, spicy and Thai spicy) and it was delicious! I couldn't let the curry go to waste so I ordered another bowl of steam rice to help finish it off.Lots of Air Force members here during lunch and I can see why it's popular. Will come again in the future to try out their Pad Thai as well as their Fried Banana dessert. Friendly service, awesome decor and most importantly, delicious food is what makes Thai Chili a legend in these parts. You must try it!"], ["TruIndian W.", "I have visited Thai Chili on many occasions and each time the service and food was great! I am from a very lagre city in Oklahoma to my suprise this place was tops for a small town it is small, quite, and warming. The cook is always greatful to honor my special request of my pad thai. Overall I have been in Sumter for one year and Thai Chili is by far is the best place in Sumter to dine! Service with a smile!"], ["Sandvich C.", "You pull up into a large, barren parking lot encompassing this tiny, pathetic excuse for a restaurant. As you walk past the laughably, unshaded outdoor concrete seating, you wonder what sort of horrors lie inside such an ugly building.You walk inside and are greeted by a friendly, bubbly cashier. You walk to the order counter across the small, crowded dining area and look through their main and sushi menus(Which they have plenty of copies for you to take with you.).You order the yellow curry and wait about fifteen to twenty minutes. Once you pay for your food and are bid farewell by the cashier, you drive back home and untie your plastic bag of goodies. The rice they serve you is packed into a small take-out box, while the curry is sealed with a taped lid in a medium-sized styrofoam container.You dump the rice out into a bowl and then pour the curry over it. The carrots and potatoes(I think?) are cookie-cut into flower shapes, there is a decent amount of chicken and a delicious amount of curry. You savor every bite.Gentlemen..."], ["Erin B.", "Best Thai food I've had possibly ever - and I'm from a large city and had many a good Thai meal!  This is definitely home cooked, authentic stuff served up by a very caring and friendly proprietors.  I was so glad I stumbled on the review and made the trek out to this away from the chains by my hotel in Sumter."], ["Ellisa V.", "It doesn't look like much on the outside, but the inside is decorated well and the servers are wonderful. Its family owned and operated and the sisters are incredibly friendly and helpful. The food is consistently awesome and they can make accommodations for different tastes and levels of spiciness. The portions are plentiful for price. Try the Thai Tea, it is amazing here!"], ["Tom R.", "Nice people and great food...fresh crab rangoon and calamari are my fav here...don't let the tiny outside fool you. The menu and settings are huge!!"], ["Brian B.", "Very impressed with quality and taste of food. Took about 30 mins to get food...one cook on the night we went (week night). Perhaps there are more cooks on the weekends...?"], ["Jordan S.", "This small restaurant stands alone on 441, right across from Shaw Air Force Base.  In the past 2 1/2 years, this is the 3rd restaurant at this location.  I was drawn to this location after seeing their high health inspection scores on the news.  (97%)Thai Chili is a small restaurant with room for about 30 guests, as well as a few outside tables.  (Completely exposed to sunlight, with no awning or umbrella)  The premises are unkempt, with weeds sprawling out of every crack in the parking lot and sidewalk.  Food is typical, I had a Chicken Ginger lunch special for $6.50, which included salad, soup, egg roll, and egg fried rice.  It was very filling and cheap. Based on food alone, I would call it \"good.\"  What  stands out here are the waitresses.  Two sisters double as hostess/waitress and are extremely friendly and talkative."], ["Mellisa L.", "The two sisters no longer work here, they have moved to lexington with a new restaurant, but the new owners are still very nice.  I still like going here for the Mint Chicken (which I always get), but my friends say it has gone downhill in the Curry dishes, so I only gave it 4 stars."]], "Asian Bar-B-Que Thai Cuisine": [["Stephanie N.", "Pad thai is amazing.  Appetizers are great and their sauces are always delectable.  Only downfall may be the service. But the owners are great people!!!  Love it.  Best thai in sumter."]], "Grilled Teriyaki": [["Charlie M.", "This one of my favorite places when i come to Columbia! Its late night, inexpensive, good and simple! I love coming to this place after a night out in the city! I normally order the Grilled Teriyaki plate that has chicken, veggies and rice.... and of course, I add tonssssss of \"white sauce!\" My late night bill was only cost $7!! It's normally crowded late night, with loud music and tons of college kids in khaki shorts! lmao! But I love it! It should be on an episode of 'Drive in, Diners and Dives'"], ["Christy M.", "My husband and I stopped in for sushi. Do yourself a favor and DO NOT get the sushi. It was the WORSE I've ever had. You couldn't even chew through the wraps.  I have had sushi at grocery stores that was way better than that. When I told the waiter about the wraps they use on their sushi, her reply was: \" Yeah, we get complaints about that a lot.\" And then said, \"don't worry, I'll knock 10% off.\"This place really needs to stay with Teriyaki and NOT sushi. If your going for sushi, Runnnnnnnn in the other direction!"], ["Walter R.", "Worst food ever. Mayo sauce was actually mayo i think. If you want to get food from here sit on the toilet as you eat because it'll make you shit immediately. If you're drunk and in 5 points i understand stopping by here"], ["Ct W.", "I have eaten here off and on for years and the food has always been the same, fair to good. Today was my last day eating there, 3 large roaches, 2 of which I killed , all within our eating area. After I killed the first one the waitress looked at the roach and walked over throughout the rest of the time I was these. I am a tough person and do not get grossed out often but was pretty disgusted.  Never again."], ["Taylor S.", "This place isn't exactly good, it's just convenient when you want to get something quick that will fill you up.  It's not too expensive and it is open pretty late especially on the weekends.  I wouldn't recommend taking someone on a date here though."], ["Will C.", "It gets four stars for a take out restaurant, but It should be take out only. The service was pretty horrible and I'm not one to complain. It was busy, but there's never an excuse to bring one dinner plate out and the next over 15 minutes later. I had a nice time watching my girlfriend eat her food and then her watch me. I want to give them the benefit of the doubt but once the chef yelled my order was ready our waitress stayed in the kitchen cutting something up and I wasn't served until a waitress from another section brought it over. It just seems too unorganized to not be terrible any time it's busy. It might be fine during the in-between times but stay away during the rushes unless it's for take out."], ["Robert R.", "Great for dinner with friends and late night runs. This place stays open into the night to cater to the regular crowd of college goers. Busy times are sporadic, so if you want a quiet dinner scout it out and make sure of what kind of atmosphere you are going to get."], ["Megan B.", "Grilled Terriyaki is a solid spot for some cheap and fast late night food. It is open super late. It is definitely a college crowd. The chicken Terriyaki is my favorite. As others have mentioned the white sauce is like crack--so addicting! It's not gourmet but it's good teriyaki for a great price! No complaints here"], ["Stacie M.", "I used to love grilled t, as they're under new management, their hours have no expanded. But with this their service has gone down to almost nothing, literally.... (Sat down for ten minutes and no one asked me anything before I got up and left today) & their menu selection has dwindled to basic Japanese food.Basically, I wouldn't suggest going here these days. It's not worth it anymore."], ["Noe F.", "Grilled Teriyaki is great! It's a great place for a college student as it's open late, and the food is awesome. Their rice is amazing with the white sauce. While the service isnt 100% what it could be, I still really like going there."], ["Chad H.", "You're not going to find a better place to eat at 2 A.M. on a Friday then Grilled T.The atmosphere is fun and the food is very good for the price.Try to still with the Chicken instead of the beef and load up on extra sauce!"], ["Ken K.", "College kids know what is good, fast and cheap. Followed a group of them to this place. Actually pretty good, fast and....you guessed it!  cheap!"], ["Ishea B.", "My husband and I found ourselves craving some teriyaki chicken so we decided to give this place a try. He had previously eaten here before and remembered the food being tasty. We both ordered the teriyaki chicken, gyoza (dumplings), miso soup, and spring rolls.Pros:The service is great, the food comes out fast, the portions are huge, and it's a cozy place.Cons: Overall I didn't find the food to be anything special... The white sauce everyone is freaking out over I'm still questioning. It literally tasted like nothing. I liked how cozy and diner-ish this place seemed but it quickly filled up and was a tad bit uncomfortable. It's so small that it gets noisy pretty fast and can make for an annoying dinner. The portions are also large, which is nice, but I found them to be 60% rice and 20/20 veggies and chicken. This didn't work for me. Nobody needs that much rice.This wasn't a bad place and I'm sure it's a hit with the college crowd, but I don't think I'd be making any repeat trips for an entree, though I would come back for the miso soup and spring rolls."], ["Kaity J.", "Know what you're going here for. Is it gourmet, high-quality dinning? Of course not. Look at the place. It's small, slightly grungy, and in the heart of 5-Points surrounded by bars and college students. In all honesty, I've never had anything from the place besides the grilled teriyaki chicken. The first time I went, I was about to order something else and my girlfriends told me that they forbid it. I'm glad I listened to them. Oh, and the white sauce must be infused with cocaine. It's phenomenal and addictive and everything that is good in the world."], ["Ne'Cole V.", "I wish I could give this place a negative score. We were the first patrons in on a weekday and it seemed like a chore for the server to help us. She was an old witch. The tea was spoiled. The calamari was the worst I have ever had. I think this is one of the cases where restaurants are using cow tripe and passing it off as squid. The chicken tasted like it had been in the fridge for 3 days. We barely ate any of it and took the rest home for our dogs. My husband and I were both sick after eating there. Also, could you afford to put in a ventilation system so you don't have to leave smelling like smoky old chicken??? P.S. How drunk do you have to be to eat here??"], ["Toya C.", "I never had hibachi food before my boyfriend had took me to Miyabi in Harbison. There we paid almost $50 for the 2 of us to have complete meals. Here at Grilled Teriyaki a co-worker introduced it to me during our lunch break. Same service, way.....CHEAPER. Restaurant - small and cozy. Hours - stay open to late. Not a place for a super romantic dinner, but with a college budget it would do.Parking - MeteredService: they prepare meals before you just like other Japanese restaurants. You can watch as they prepare the food. Meals - you receive a soup or salad before your meal and then your meal. I ordered the chicken meal and the serving is huge, enough for 2 people to eat easily. It comes with a plate full of rice, some grilled vegetables on the side (zuchini, broccoli, and onions), and your meat. The chicken, shrimp, and steak are all good and seasoned well. I loved it so much, that I took my boyfriend and he was shocked to see how great the food was and the price. He loves it. He's got me hooked on the white sauce they give you to put on your meal - it tastes so good on the rice. Its got mayo in it ( i can't tell what else)Price: fair (definitely less than $15 per person, HAVE NOT HAD a bad experience yet. Would recommend it"], ["Katie R.", "Grilled T--it's a quintessential college dive. Greasy, slimy hibachi style food, it's fast and filling. I wouldn't get the chicken, but go for the steak. The white sauce is INFAMOUS in town and if you ask any Gamecock student they'll have been there. Funny though, Grilled T is packed from midnight-3 because last call is 1:30 so everyone floods GT after a night of drinking. The service is SO fast and they pour a great diet coke."], ["Kim Z.", "5 points staple. Late night chicken plates were a staple of long weekend nights of drinking. The white sauce is the BEST! Mix the rice, chicken, and a souffle cup of white sauce all together, then drunkenly shove it into your mouth. Heaven. The staff is always friendly no matter how crazy it gets in there. Prices are very reasonable."], ["Courtney B.", "It's an amazing alternative to bar food, late at night, when you're drunk. It's even better when you're sober and remember the taste. Seriously, it's great. They're cheap and fast too! What more can you want?Get the teriyaki chicken plate with vegies and rice and pour white sauce over everything. Incredible!"], ["Michael W.", "Not great, but not bad, esp. for the price.  Healthy portions of food. Environment is slightly cramped, but manageable.  Staff is very friendly.  Would definitely go back."], ["Michele D.", "In my quest for good food in Columbia, SC, I was 0/4.  I was hoping the fact that the Grilled Teriyaki was so busy with people was a good sign.  Meh.I wasn't terribly hungry and elected to order the kid size of the chicken teriyaki.  My waitress was a young girl, and had to come back to me to tell me that she couldn't let me order the kid size because I was an adult.  I looked at her for a good few seconds before I responded and I must've scared her because she immediately said, \"The the the o-o-o-wner said that you can't order it.\"  I briefly smiled sweetly and told her I would take a side portion of chicken teriyaki and a side portion of rice.Not so hungry diners beware, don't order from the kids menu.  :(The chicken was a little saltier than I would have liked, and instead of receiving steamed rice, I received fried rice.  Oh well, it wasn't the worst food I'd had, but I was still on a quest to have good food in the South..."], ["Trish A.", "Like a previous reviewer said, the place is good in a cheap[-ish], late-night food kind of way. Take it for what it is.We ordered the mushroom tempura as an appetizer, and it was... mushroom tempura. Simple as that, and it really hit the spot. It was served with your standard sweet chili sauce, which can be purchased at any grocery store with an \"International aisle.\" I ordered the Hibachi Vegetable plate, which comes with the house soup (or salad), seasoned and grilled veggies, and rice. I'm pretty sure the house soup was a clear dashi broth, something like a suimono. It's not supposed to be extremely flavorful, so don't complain about that. The veggies were fine. The rice had a soft but chewy texture as it should, and it just tasted of soy sauce. That wasn't a problem for me, since that's how we sometimes eat rice at home. It's not plain rice, but it's not typical fried rice that has bits of eggs and veggies.The girl at the cash register overcharged me by 1-2 dollars, while undercharging my cousin by about $1. Not a big problem since we asked her to split the tiny mushroom app 3-way and it confused her, but still. I was irked for a bit."], ["Nicholas K.", "Ummm, the only way I'm going here is if it's past ten o'clock and most other restaurants in Columbia are closed (why is that?), I'm exceedingly drunk, and I live and/or am currently near Five Points.Just because these three conditions happen to apply to a healthy dose of young Columbians living near the University doesn't make this a good place to eat.  Put enough sauce on something and it's bound to taste good to somebody.  Too bad this place isn't the used-CD store that would buy my Columbia House rejects for $4 apiece that it used to be."], ["Kelly R.", "I'd had take-out from here a few time and the food has always been so-so, though I appreciate their menu choices and their friendly staff. I would recommend the teriyaki plates over the sushi plates (great if you're looking for a heaping portion), since the sushi tends to be sloppily thrown together and topped with sauces that don't seem like they belong on sushi. A great late-night atmosphere that mostly attracts a college crowd."], ["Sam V.", "This place is fine by me. Yes, the upkeep and cleanliness could be a little better... but really it seems to all work out. I think perhaps one of the better things about this place is their wait staff, they work crazy hard. It's tough to come here on a Saturday or Friday night, very very packed."], ["Spencer S.", "You have to know what you are getting into when going to grilled teriyaki. Like, you can't expect to do anything involving moving for 12 hours afterward. And you can't expect to be outside of 20 feet of a toilet. That being said, I love it. I believe the white sauce has some sort of addictive drug in it. I have been known to put it on everything (including the salad and tempura). It's pretty much your run of the mill Japanese steakhouse sans onion volcanoes and overused jokes. It's a great late night place. It's not fancy by any means, but its cheap, filling, and relatively fast."], ["kido m.", "after i tried 3 times to get in...finally i had a chance to try Grilled teriyaki.  why they close mid of day... i guess they making too much money so no need much business!! anyway, the portion, and price was just fine, but the quality of food was not good at all.  kinda  disappointed...and they need to clean this place lil better...and servers have to wear  proper clothes!!"], ["Kacee G.", "You should definitely know what you're getting into before you go to Grilled Teriyaki, as it makes it an infinitely better dining experience.Cheap, fast, filling and open late. Grilled Teriyaki is almost exclusively filled with college-aged young adults indulging in the heaping mounds of rice and chicken/beef that are basically a step up from mall food court asian fare. Very little is remarkable about this place but it is great if you are just looking for lots of yummy (but average) food late at night. Their main draw is the mysterious white sauce that comes with any teriyaki that should be generously slathered on chicken and rice for that extra kick of unnecessary but delicious fat.Their portions are pretty big and mean two meals for one price. Diners over 22 should be prepared to feel old."]], "New Bangkok Restaurant": [["Nik S.", "I love when I have to come down to Columbia from Charlotte to the hairdressers, because they are right next door to this fabulous, unassuming eatery.  I was told to try the fried wontons and absolutely fell in LOVE!! They are made fresh daily with ground chicken instead of that Yucky imitation seafood \"meat\". The Thai fried rice is enough to feed a family of 3! The Egg drop soup is tasty as well.  Please fairy food mother...keep the bad weather away so I can travel down the highway to enjoy New Bangkok every time I need my \"doo\"-did!"], ["Simon T.", "Unassuming placein an ugly-ass strip mall.Go there anyway."], ["Michelle E.", "I'm so happy that my favorite Thai restaurant is back in business! This is the original Bangkok Restaurant, open in the original location. Tell your friends and family. I had the Kao Phat and satay yesterday and they were both excellent and just the way I remembered them. I happened to be back in the area today and decided to grab dinner there and the fried wontons and Tiger Tear were also wonderful.The restaurant has been updated with fresh paint, new wainscotting, and a new counter and divider. The tables and chairs are all new, too, along with white tablecloths."], ["Ellen A.", "I hate to be the voice of descent, but lunch here is not great.  I tried the veggie lad nah, spicy. It was in some sort of barely-there broth without even a hint if spice. Upside was that, unlike other places, it was not dripping in oil. It seemed like many people ordered egg roll and wing type dishes, so maybe their bland lunch reflects consumer preference? Now, their curries are spot on, but, for some reason, they don't offer these as lunch specials. And their dinner prices match Baan Swan, but without the atmosphere."], ["Gillom S.", "Looking for some Thai food and found this hole in the wall place. Menu had a lot of different options. I ordered the Thai shrimp fried rice (F3) minus the tomatoes and had them to make it spicy. I was not disappointed when I got back to my room. Plenty of shrimp and lots of rice. Their Thai ice tea was very good too."], ["Emily E.", "Had a great dinner here and loved the red curry.  The owners were very friendly and there was not much of a wait for food to come out.  Decent prices in a very unassuming location.  Check it out!"], ["John V.", "The food was inedible, and we left after barely touching it (no one seemed to notice). 25 bucks for soup, an entrée and Thai teas. The tea was fine but very sweet. The pad thai, which should be a simple go-to dish at a place like this was unbelievably greasy and had questionable shrimp. I got a soup that had a decent broth, but the chicken was rubbery and tasteless, and the soup was full of woody leaves and lemon grass stems (a few are normal and good, but it has hard to take a spoonful without ending with something inedible in my mouth).  *To top it off, the table cloth was damp and my arm started burning after I rested it on the table. Then I saw an employee pouring Clorox straight from the bottle onto the table next to ours. There was bleach on our table cloth and that's what was causing my skin to burn. Never again."], ["Richard P.", "Just passing through and I always try to support local businesses instead of chains. I tried this place since the hotels off the highway are in a sea of garbage fast-food and chain restaurants. I'm a tenured Thai food eater, and I appreciate a range of quality. Two major flubs. I ordered green curry \"as mild as humanly possible.\" I also ordered Tom Ka Gai and Thai iced tea. The Thai iced tea was smallish and the sweet overwhelmed the smoky flavor of the tea. it's always sweet, but usually the tea balances it out. Not so with this one. The waitress delivered the green curry first (no soup?) with enough rice to feed a Thai family for a month and a smallish portion of green curry (with chicken). The first bite was a shock. It burned my face off. It was also full of bamboo shoots which I'm not terribly fond of and the only other discernible vegetable was green and red peppers. Disappointing. The chicken tasted like cardboard. Why\" I dunno. Maybe it was frozen or cheap or who knows. The hotness was disappointing. I told the waitress that I ordered this mild and she just smiled wryly and subtly communicated with a look, \"I'm not taking it back and you're going to pay for it.\" She said, \"I know,\" and walked away smiling with Southern Girl fake charm. Well... OK then. I ate it and suffered the consequences... I sweat profusely even thinking about hot spicy food. I really do like the flavor of it, but my body hates it. I could only stomach half of the dish when another waitress appeared with some water. I told her that if the soup wasn't ready, I don't want it anymore. She smiled wryly again and said, \"They made it.\" Again, no explanation or apology. She took another 5 minutes bringing it to me. Whatever. It was unremarkable with flabby limp lifeless ingredients. The chicken tasted like cardboard, the mushrooms looked beat up and the kaffir lime leaf seemed to have been frozen or something. Anyway. I paid the $30 for my dinner and won't be back. I might have given the food another chance with different choices, but I really didn't like how they didn't care that I wasn't satisfied or that they ignored my request for mild spice and didn't care about that."], ["Scott W.", "Walked in, nobody was there... Yelled to the back, \"hey, anyone here?\"  Nothing... Too bad..."], ["Emily G.", "Finally tried this place after hearing it was back to its original location. This is on the opposite side of the road as Walmart. Anyway it is small inside. There were several people eating in and about 5 people got take out while I was there waiting on mine. The ladies inside are so nice. I got the C3 Gang garee with chicken, and C8 Gang puk (just veggies) which are both coconut red curries. I asked for them hot, and it was definitely hot, but not intolerable. So if you like reasonably hot food, you can probably go up from medium to hot.  I got it to go, and got a ton of food, and it was very, very good. There are probably more than 10 different veggies in the C8. Now, it is not an 'upscale' Thai place, and this was only my first visit, but I will definitely go back! If you want good Thai, I would definitely try it!"], ["Aaron K.", "Took a chance with this place, good Thai food, right price and clean rest room. I would recommend this place to people trying Thai food near by"], ["Vida J.", "Glad they are back in business. Enjoyed my Tom Ka Kai, Lemon Pepper wings and Thai rice. With the weather warming up I'll be back soon for my summer favorite Beef Salad."], ["Michael M.", "Small place with an inconspicuous front, but when you get your food you realize why this place gets good reviews. Very good food with good sized portions, and reasonably priced."], ["Bonnie H.", "Does this place even exist? We drove around twice and never found it... Ended up at Basil thai."], ["Derek K.", "Excellent, authentic Thai food.  Some of the best yum beef (yum nua) and num tok I've ever had.  Completely nuanced with flavor.  Friendly, attentive service.  Great feel to the place, the ambiance was intimate and relaxed.  Can't recommend it enough."], ["Dave M.", "We have been coming to this little hole in the wall restaurant for about 15 years. I was sad to see it close and then I was excited to see it was being renovated and waited for it to reopen. I then became confused because there was the Bangkok across the street and the New Bangkok in the original spot. Both seem to claim to be the original one. This was my first visit to the New Bangkok. I was a bit skeptical after my experience of getting a huge order at the other Bangkok and found most of it to be big disappointment. However I decided to try the New Bangkok and I was not sorry I did. I ordered our usual  Tom Ka Gai and Satay. The soup was excellent as was the satay. Tasted just like I remember at the Old Original Bangkok. We will definitely be back and bringing our friends. The little hole in the wall restaurant is back just looking a little nicer now."], ["Victoria Y.", "I ate here with my boyfriend tonight. He got the pad Thai (they spell it Phad Thai here) and I got the panang curry w/ chicken. Both were great and the portion size for the pad Thai was generous. The staff was friendly and attentive. Food came out quickly. Can't find any reasons to give less than 5 stars!"], ["Gunter L.", "Just got back from eating there and the food and service were both great, unlike the Bangkok across the street. I'm so glad they reopened at the original location."]], "Thai Garden": [["Michael F.", "After a long day of driving, I decided to get some Thai Food. I remember seeing Thai Chili (they will be visited in the future), I thought I was heading there. Instead, I saw Thai Garden and stopped.The outside looks rather drab, just like most of the country buildings out here. Inside, it's a different story. Nicely decorated tables, a TV which plays movies for the customers and very friendly service. The place looks like it can seat about 30 people.The waiter/waitress was very friendly. Got me a sweet iced tea and ordered the Satay chicken and shrimp rolls to begin with. Main course was going to be Seafood combination pad thai.The Satay chicken was good, gave me 4 chicken skewers with peanut sauce and cucumber/onion salad. Forgot to mention they started me out with salad that had some wontons in it. Delicious.The shrimp rolls were awesome! 4 fried shrimp rolls along with sweet sauce. It's funny, cause the waiter dropped one of them on the floor and apologized and came out with a new set. Great service!The main event was the combination seafood pad thai. Great serving which included fried talapia, mussels, shrimp and squid. Ordered mine not too spicy and it was outstanding! Couldn't even finish it and decided to take the rest home. Prices were ok, $4.95 for the Satay Chicken, $5.95 for the rolls and $8.95 for the Pad Thai. Add in the Sweet Ice Tea and it cost a bit over $20. However, they do honor a 10% military discount so don't forget to ask if you work/live in Shaw AFB. They also do take out and give you a take out menu before you leave. Other than the prices, this place was really good. If Thai Chili was packed, I suggest giving this place a whirl. I heard their lunch was ok too!"], ["Rebecca D.", "They will over charge you and if you don't eat all of your food they give you less each time you come in."], ["Shawnika D.", "PERMANENTLY CLOSED!!! Don't know what happened, but I was heart broken  BUT... When it was open, it was amazing. If it is ever open again, I suggest the green curry with chicken"], ["Ed X.", "This is what I would expect a Thai restaurant to be -- not some Americanized Thai place in a suburban shopping center -- but one in Thailand.The funky, Thai-inspired decorations, Thai staff, Thai music -- even Thai videos combine to create a lovely ethnic vibe.  If you're adventurous & appreciate genuine Thai food & atmosphere, you'll love it.The staff are super-friendly, and the food is wholesome and delicious, with generous portions.  Amazing that Sumter County has a restaurant as cool as this one -- a true hidden gem."], ["Kyle K.", "Amazing food! It's a hole in the wall for sure but there's really nothing like it! Their Pad Thai is fantastic as well as their Spring Rolls! A++"], ["Ally R.", "Great thai food, I have had a couple of the dishes and they have all been awesome! Definitely a hole in the wall, but the best thai food in Sumter. Go to this restaurant rather than the one down the road. And beware, hot actually means hot! Delicious."], ["Kevin J.", "Phenomenal!  Quite a gem where I would least expect to find it.  I had the massaman curry.  Definitely up to spec!"], ["Lou M.", "First of all, the food was not bad.  This is not the reason I'm giving them such a low rating.  The food was average if you could order it from the menu in the first place.  it took us a few tries to finally order something that they would be able to make, whether it was due to the amount it time it would take to prepare during the lunch hour rush or the fact that their deep fryer was shot.  I've been to many, many Thai restaurants...this one was not in my top ten."], ["Alec Y.", "I really like their Pad Thai...very tasty!  They also serve in fairly big portions.  Don't let the looks of this place scare you away.  It may not look like a PF Chang but their food is ten times better; PF is so overrated and yuppy anyways.  The lady is really friendly and the service makes the food even better."], ["Lydia G.", "Don't let the outside looks of this place keep you from trying this little place. They have some of the best Thai food in Sumter! Loved the chicken Pad Thai, and they have the BEST spring rolls!"], ["J K.", "Great Food, Amazing Service!  The building is a hole, thus the 4 stars.  If you like peanut sause you NEED to order anything named Amazing.  Everything with that name is peanut based and is in fact AMAZING!"]], "Chinese Cuisine and Thai Food": [["Katherine R.", "This place doesn't look like much from the outside, but the food here is great! Granted I have only tried 2 items, but they were both excellent. I am very particular about my seafood and have found a lot of Asian restaurants use frozen seafood in their dishes, but I had the shrimp curry here and the shrimp tasted like they weren't from the frozen section. The curry was wonderful! Full of flavor and a good sized portion. It had peanuts in it, which I wasn't used to, but it gave some texture to the dish. I also had the Pad Thai. I've been crazing Thai food lately and haven't been able to find anything in Columbia, so I'm really glad I found this place. The Pad Thai, like the curry, was delicious. Again, not used to the style (it came with broccoli and carrots and a fried egg on top) but full of flavor! The woman at the cash register was also very polite and friendly. I will definitely be back for more."], ["Colleen F.", "I just went here last week with a couple of my friends from school for a friend's birthday.  She wanted Pad Thai and Thai tea.  We all loved LOVED our food!!  We were a bit taken back by the location but you know...cheap rent...better food!  The owners are Ethiopian they are the new management BUT the chef is the same...have no fear!  Go give them your business...they are such good people!  We all LOVED our pad thai and we had enough to take home for later! I consider myself a foodie and I will be back.  Hope this helps the decision making!"], ["Patti N.", "What an unexpected treat!! I had an appointment nearby, and decided to take a chance on a new spot. So glad I did!! The owner Sophie was working the counter and shared her story, and the food is DELICIOUS! I stuck with the Pad Thai - straight up tasty! Thai, Chinese cuisine, reasonably priced. And the owner cooks an Ethiopian menu on Sunday's!! Great locally owned gem (owned several months, old reviews aren't Sophie!!), wish her the best of luck!!"], ["Andrea J.", "We are visiting Columbia for the weekend and found this place from other positive reviews. Great Thai food, pretty spicy but delicious! I got the Chicken Drunken Noodles but the Massamuran chicken curry, chicken pad Thai, and chicken basil (which my party shared) were also spicy and good. The owner spent a lot of time talking to us and was very nice. Overall great experience!"], ["Samantha R.", "I wasn't a big fan of this place's take on Chinese food. The rice was good but both their sesame chicken and orange chicken tasted off. The steamed dumplings also left something to be desired. Overall, everything was edible but not really worth the high price. Hopefully their Thai food is better..."], ["Joshua S.", "My go to Thai restaurant in Columbia. Has improved drastically over the past year. Never ate inside, always take out but never disappointed. The Pad Thai is a winner."], ["Amanda P.", "The couple that owns the place is so sweet! We got massaman curry and drunken noodles. Very good!"], ["Katherine S.", "Our favorite Chinese and Thai takeout. Larb chicken, soups and traditional Chinese dishes are perfect comfort foods for nights on!"], ["Scarlett F.", "Weird for dining in.  I wouldn't describe the service as friendly.  When we sat down, the lady brought us one solitary takeout menu to look over.  The food was pretty quick (we were the only people there on a Saturday night) but it came in styrofoam containers.  I had massaman curry with tofu (didn't see tofu on the menu, had to ask).  The curry could have used more potato because it was a tad heavy on the onion. Again, I liked the food but I wouldn't go out of my way to eat here again.  I hate styrofoam takeout containers and I don't understand why they haven't invested in some plates considering they do have so many tables for dining in."], ["Kristin O.", "By far the best Chinese/Thai take-out place in Columbia. I have tried numerous places and have always been disappointed. This restaurant is cheap, fast, and delicious! The food is not usually spicy but they will definitely kick it up a notch when you ask. The Pad Thai, Curry, Drunken Noodles, and egg rolls are all great. I crave this food at least once a week. I highly recommend."], ["Michelle T.", "Drove all the way from Florence for out pad Thai and drunken noodle. Amazing!!! Super fresh and just as good as it always is. Took the kids with us this time and they were in heaven! Fried bananas are awesome!!!!"], ["Kara T.", "Sold to a new owner. Quality/flavor and portion size have gone down. Prices have gone up by at least $3 per dish. No longer a customer"], ["Paul B.", "The Pad Thai noodles are some of the best I've hade in Cola! Just the right amount of fish sauce, sugar, and vinegar! They actually use eggs and fish sauce!!! I hate to order Pad Thai noodles that lack \"main ingredients\" ~  The ambiance of the place is not all that great.. They have cloth tablecloths, and it appears super clean. However, you get the feeling the majority of the patrons are there for takeout. The owners, servers, cooks are very cordial, but not over friendly :) if you're a Pad ThaI fan it is definitely worth a visit!!! PS someone needs to do a Pad Thai competition in cola lol"], ["Preston P.", "Just tried this place out for the first time, and I will definitely be coming again. The spring rolls are great, as are the drunken noodles and massaman curry.  We stopped in and ordered and had our food in less than ten minutes.  Can't wait to try the other options on the menu."], ["Jason B.", "This is a great place. I love the pad Thai and the Curry is really awesome. I have been here plenty of times and will continue to keep going."], ["W T.", "I ordered Pad Thai with chicken, and while the service was relatively fast (I didn't call ahead) there was way too much peanut and it overpowered the dish. I also ordered the highest spice level and was really disappointed - my dish was not spicy at all. In fact, it was really quite sweet. On the upside, the menu is extensive and the food was flavorful, just not the flavors that I wanted. I may try another dish in the future."], ["Jodi S.", "We routed our trip specifically to come to Columbia  and return to this yummy restaurant. Once again the food was made to order, fresh and delicious. I had the pad Thai with chicken and Rick had tom yom ga soup and massiman curry with chicken. We thoroughly enjoyed our meal and will be back next time we are up this way."], ["S C.", "Great Thai food! Humble little takeout restaurant. If you're going out with the guys and looking for inexpensive Chinese/Thai, do it. It will surprise you how good it is especially for the price. Can't be beat. If you're taking your girlfriend or wife on a date, get it to-go. The food will taste just as good if not better than the extremely more expensive Thai rivals. The interior and service is just like every other strip mall Chinese take out. Better yet pick it up yourself and they will never know. Just know what to expect when you go."], ["Bonnie H.", "As others stated, this place is a small hole in the wall BUT the food is so tasty! I got both the drunken noodles chicken and pad thai chicken. The Pad Thai was not the best I have ever had but it is still really good, about an 8/10.  The drunken noodles were the best I have ever had though! The thai ice tea was probably the worst I have had, but still good. I did finish the cup but too sweet for me and I was expecting it to be sweet but not as much as it was.."], ["Matthew R.", "The Pad Thai is not the best that Columbia has to offer but it is good enough to mention, as I ordered it twice this week.  There is never a lunch crowd so ordering is quick and easy."], ["Joseph K.", "This is a standard take-out style Chinese/Thai restaurant. Having said that, I think that it's more freshly prepared than most places I've tried. The fried rice is fluffy and not as greasy as most places. The chicken is freshly battered (or at least tastes like it). It's also nice that they have a wide variety of both Chinese and Thai dishes.  Overall, a very clean, nice place with great tasting food, the prices are low and they're very friendly."], ["Ravi P.", "One of the best thai places in Columbia.Service is slow because of all of the customers and only 1 cook but it's worth the wait.  Pad thai is the dish, I usually get mine extra spicy."], ["Tom S.", "This place has kick ass pad Thai. Also tried the rad na it was pretty good as well. The fried egg rolls were crispy and delicious. The proportions could probably be split into three meals. I wish they had I bigger menu, but what they offer seems to be pretty good. For a hole in the wall Asian cuisine that won't break the bank this is the place to go."], ["Joshua T.", "I ordered on the phone to avoid the wait because the food is decent and affordable. In still here 40 minutes later with no food. Not a good way to stay in business."], ["Jennifer H.", "Had to wait just a bit, but it was well worth it. Came in with a party of 11 and everybody had positive things to say about each meal. Would definitely come back again!"], ["Mark H.", "Much, much better than you'd expect. Non-greasy, made to order. Some of the freshest Pad Thai I ever had. For $10, you get A LOT of food. Looking forward to coming back. Don't let the low-brow ambiance fool you. This food is fantastic."], ["Shawn E.", "Worst Chinese AND Thai food in Columbia but don't worry the service is extra slow. This place is a stone's throw from my house but I've never had a decent or quick meal. Learned my lesson this time though. Never coming back."], ["Mary W.", "Food seemed fresher than most Chinese places particularly with the eggrolls that tasted homemade.  I got sweet and sour chicken and veggie fries rice. The rice was PHENOMENAL! The chicken was pretty typical but also seemed fresher than most places. I didn't like that they didn't have wontons but what they do have they do well."], ["Marko S.", "This is an old location for taste of china.  The new owners serve Thai food also. It is very well prepared. Fried bananas, drunken noodles, lo mein and Thai vegetables all excellent.  We had.a large family there and shared food. Cook willing to make most dishes vegetarian when possible."]], "Thai House Buffet & Sushi Bar": [["Tim M.", "Currently the best Thai place in Sumter. Good food and customer service. The only drawback is that they sporadically close. Might want to call to make sure they're open."], ["Honest C.", "Several of my friends like this place and I've given it multiple tries over the last few years without success. This last time I went when a friend was in town for the first time in years and she wanted to go here. I can honestly say I've never had any food from this establishment I enjoyed other than the fried bananas. Everything seems to be bland and covered in tasteless sauce. I've tried duck, chicken, rice, noddles, and so forth. I don't know what else to say other than it just isn't good especially for a place where I end up spending 40 dollars for an appetizer and a meal that are always just bad. I stopped somewhere else for food on the way home last time I went."], ["Sarah J.", "Ordered two Chicken Pad Thai's for takeout a couple days after Christmas. When I got them home, the noodles were very, very dry and lukewarm. I only drove a couple blocks away, so it didn't have enough time to change on the way home. Not great."], ["John K.", "The only thing I have to say about Thai House is that they have great sushi!  If you are looking for sushi in Sumter, this is definitely the best spot!  They have amazing specialty rolls and also have rolls for the less sushi-inclined clientele."], ["Lauren L.", "This place was a great dive spot for me in Sumter. Not the best atmosphere but delicious food and I remember the service being very attentive. I'm not big on sushi but my parents loved trying their many varieties. My favorite meal  was the chicken fried rice. Simple but most places can mess it us, the Thai house had it tasting like delicious comfort food!"], ["Derrick T.", "This is the best Thai and sushi that you'll find in Sumter!!! The food is delicious and their customer service is good too!!!"], ["Rudy C.", "Food came out quickly.  Good food at good price.  Friendly staff.  Parking lot is small, but extra in back.  Had pad Thai noodles."], ["Alli O.", "This restaurant has a very casual feel and the staff is very friendly.  You can tell that the staff knows their regulars and gets to know them.  My husband and I have been trying to find a sushi restaurant in Sumter, and from reading the reviews I was hoping this would be the place.  Unfortunately the sushi wasn't great, but we really enjoyed being there and I am sure their Thai food is delicious."], ["Lindsey G.", "So disappointed... our realtor told us this was the best Thai place in Sumter.  Overpriced, pad thai very dry without taste, and the green curry I had very lacking. Had their house roll for sushi and it tasted nasty. Still searching for a place to eat thai in Sumter :o("], ["Stephanie V.", "While visiting Sumter, my husband drove me from the airport straight to Thai House. I wasn't disappointed and somewhat surprised that there is such a great restaurant in town. Definitely a gem.The menu is plentiful and loaded with options to choose from. I decided to get the Pad-seelew and hubby ordered the Thai Lo Mein. Both were delicious plates. For an appetizer, we ordered the fish cakes which are a bit spicy and hubby couldn't stomach more than 1. I happily finished them off... Thai tea is good and a great retreat from the regular soda or tea. Service is excellent and friendly. Prices are cheap for Thai fare. Mango sticky rice (seasonal dessert) was packed to go and tasted delicious when I returned to the hotel to enjoy. No complaints here, and will definitely come back if I have an opportunity to visit Sumter again in the future."], ["Alyssa R.", "I love love love their pad Thai but their prices are far too expensive in my opinion. Great little place with lots of character and ambiance.  I would love if they had more customers, but I think their prices are ultimately what is inhibiting them from being as popular as they could be."], ["Jordan S.", "This is the type of place that needs Yelp to get along.  I'm certain that the majority who pass by the Thai House would not venture in because it looks like a dirty hole in the wall from the outside.  As a sushi fan, it still took me 18 months to get my butt into the Thai House because I didn't want to die.Service here rocks!   So freakin friendly!  You get a hearty hello and a big smile as you walk in.  The owner (presumably) makes the sushi/sashimi himself and seems to know each one of his customers.  This place stays pretty busy, too. Thai Tea is also freaking amazing.  This is not the most popular place for sushi in Sumter.  (Kobe is) But, it is the BEST."], ["Alisha W.", "Good service, Best sushi in town! They give you a great hello and a big smile as you walk in.  The owner makes the sushi/sashimi himself and recognizes each one of his returning customers.  This place stays pretty busy, too. Thai Tea is also freaking amazing.  My husband and I absolutely love it here!"], ["Og S.", "If this place was in New York, I'd find a bunch of things to nitpick at but we're in Sumter, so really it was great.  We ordered a roll - 8 pieces, $5; sea weed salad (massive) $5, duck curry, $15 and pad thai $10, and everything was good. Chang beer was vile, but really who didn't see THAT coming? Good food.  Our check was wrong though, miscalculated by $17. I don't know if anything should be made of that. I will go back (not like there are options in this town) and assume it's an honest mistake, the waitress apologized when I pointed it out. Just FYI."], ["Greg W.", "With Swanthani's gone, Thai House is the most consistant and flavorful in Sumter. And spicey!  I love spice and heat but their \"thai hot\" slowed me down... I agree that they need to create a bigger presence for themselves outside because I know a lot of people don't even notice them.  And I, too, have noticed different chefs/cooks each time I've been there."], ["Jason N.", "The Thai House is one of my little secret jems. You wouldn't think to walk by it if you stopped inside and sampled some of the food they have to offer. It is run by what I believe to be a family..but since my time here, 6 plus years now, I have seen a few different groups of chefs...now all of the \"chefs\" are usually thai women or a blend of southeast Asian, all of whom take the practice of \"home cooking\" to its local finest. now, while I can not recite the menu verbatum, they have a coconut milk and chicken soup that is both spicey and sweet with a lemon grass after taste that is amazing while clearing out your nose slightly hehe... granted as most who love thai know, it can be SPICY!! if you ask for it, but they will temper it down to your liking. Their other traditional dishes like Phad Thai are always well flavored and cooked excellent... all of their dishes, to include a more recent addition of a small Sushi bar, have allowed them to branch out and get a more diverse customer base. Their sushi quality in my opinion is 2nd to that of Kobe, but it is good. The seating is somewhat limited, but I have never had trouble getting a seat even on a thursday or friday night. The restrooms are small but pretty clean... all in all I can't say enough about this place, I think the only thing stopping me from giving them a fifth star is that some of the appetizers are fairly plain or easily overcooked,this specifically applies to Chicken Satay... some might say the place needs to be bigger or modernized.. I'd say its good the way it is... the only addition I would make would be to make their kitchen more modern and spaceous..."], ["Brittany and Tim L.", "i agree with what jason has to say. i just wanted to add stay away from their dumplings. i dont know what happened but they came out green and tasted like they were pickled."]], "Basil Thai Cuisine": [["Andrea R.", "Dined here with a friend for lunch. My friend was already seated when I arrived so I just went to her table, but then we sat around for 15 minutes with no waiter service, eventually she flagged someone down and asked them to please tell our waiter we were ready to order...considering the place was pretty empty that kind of sucked.However, the food more than made up for the shaky start. We ordered the Tom Kha Gai to start, chicken breast in a coconut milk broth with cilantro and scallions...yum! This was my first time trying this soup and I was a huge fan! We ordered the shareable portion and it was plenty for 2, could even stretch for 4 people.For my entrée I ordered the Prik King with chicken, it's chicken in a spicy curry sauce served with green beans and rice, I asked for brown rice instead of the white. My meal was delicious! The curry sauce was spicy and very good, the green beans were crispy and the chicken was so tasty.  I also ordered the Thai tea with my meal which I was so happy to see they offered!I've had Thai at a few places back in Virginia/Washington DC that were outstanding and did not think I would find a place that compared here in South Carolina but I was wrong! This place is definitely worth checking out if you're looking for great Thai food!"], ["Jessica T.", "Went here for lunch on a week day. The place is nice and by no means a hole in the wall. Their portions are small for the price. For more than $10 Pad Thai, I ate the entire portion on one sitting. I am used to getting three meals or family sharing portions out of Pad Thai and Curry dish selections at authentic Thai restaurants and for around $7.95. Their spiciest option is barely a moderate heat and for Thai food that is a negative for us. My medium spice Pad Thai had no heat to it at all.The Pad Thai was still tasty and my husband's Red Curry Chicken was tasty. He thought that for the price, they could have put more chicken in the dish."], ["Karen S.", "I so really want to like this place, but might have had too high of expectations. A group of us was in the area and came here sort of at the last minute. Have to admit we got seated pretty quickly for not having a reservation and 10 people were in our group (but then again it was a Thursday night). The place looked nice (since it's sort of on the new side) and has ample seating.Really what went downhill was the only Thai Dish I've had and like is Chicken Pad Thai. So went to order and apparently the dish is Chicken and Shrimp Pad Thai. Since everything is cooked to order, they were able to make the dish without the shrimp. Food did come out quickly after we ordered, but portions seemed smaller than I was anticipating (given price and what I've had at other places."], ["Michael M.", "On a recent trip to visit a friend in our old neighborhood in the Rosewood/Devine St. Area of Columbia we had the wonderful pleasure of dining at \"Basil\". The restaurant is a lovely and lively place with excellent service and the best Thai food I have ever come across. This area needed some better choices in the dining realm  and now it has this jewel in its crown. Bravo and bon appetite. It will be a regular on my list of must dos in Columbia."], ["Rick T.", "Wonderful Thai lunch at Basil today I tell ya ! Seated quickly and then the crispy wings with dipping sauce came out in a flash. But the real reason why my lunch was so great was the red beef curry with bamboo shoots and rice, spot on. I sampled other dishes and they were delicious too. Can't wait to try more dishes next month."], ["T E.", "Second time having dinner at Basil and they didn't disappoint. Both times the service and food were great. I've had appetizers stuffed shrimp, fried wontons which are so different than any other Thai restaurant, and several cocktails and entrees. I have not been disappointed and will continue to dine."], ["Brandy B.", "My first visit was shortly after they opened.  I loved the decor, music and ambiance of the place.I ordered the Crispy Red Curry Duck and I wasn't impressed... I've eaten duck many times and love it (I've always had it baked or rotisserie style), so when I read the menu description (deep fried to perfection and spicy), I just knew I'd enjoy it... unfortunately that wasn't the case, the skin was wobbly and fatty (yes, I know duck is fatty, but I wasn't expecting the squishy texture when it's described as \"crispy\").I'd never had red curry before either and haven't had it since.  The presentation of the dish was beautiful, the taste just wasn't to my liking.My friend ordered the Beef Pad See Eu, I tasted a bite (and wished I'd ordered that instead).I went again a few weeks later and met a friend at the bar, we just had drinks and were able to chat with one of the owners for a bit (he made drink suggestions and chatted about favorite hangouts in Charlotte), very friendly!  The drinks were good.My boyfriend and I went again on a whim, we were in the area and it was a little after 9:30... Basil was open until 11pm.We sat outside, the temperature was perfect.We ordered the fried wontons (so freakin yummy) as our starter.We split the Beef Pad See Eu (playing it safe), and Basil Chicken... I loved the Pad See-Eu, perfect blend of sweet and salty, the beef was tender and paired well with the noodles, broccoli and egg.  My boyfriend loved the Basil Chicken, it too was very tender.For dessert we got the fried bananas and the strawberry shortcake cheesecake (which is also sold next door at Whole Foods - lol).Both were delicious!!!! Since I've stopped eating meat, I've been back and ordered a shrimp dish (can't remember the name) and tofu pad see-eu, which is no where near as good as the beef! :(Service has always been great... we'll be back!"], ["Pam J.", "We just had an incredible experience here!  Food was amazing, as was service! Our server, Arnim was so personable & his suggestions were outstanding!  The manager, Sue, made us feel so special!  Highly recommend & we will be back! This will be listed among our favorites!"], ["Chad A.", "While there food here is good, I can't justify the price for it. I feel that I am paying for a high rent and interior designer. The service was the most on point part of the meal, VERY attentive.For this place to be a bit more successful, just come down on prices a bit, and see why the Greek place across the parking lot stays busy. I know apples to oranges, but my point is still valid."], ["Jessica D.", "I went to dinner here last night with my mom.Atmosphere- it's more upscale than most Thai restaurants. It reminds me of some of the Thai restaurants I've visited in DC or Atlanta. It's sleek and modern, and my only complaint is that the tables are kind of close together. I could easily overhear what the table behind us was talking about throughout the meal.Service- Our server was aloof. She dropped the food off and then didn't come back. Fortunately, another server refilled our drinks and took our dishes away to pack up the leftovers. Price- For two entrees it was close to $40.Food- I ordered the green curry with chicken. It was really good with delightful chunks of eggplant mixed in and the seasoning was great with just enough heat that didn't overpower the flavors of the curry. My mom ordered the sweet and sour chicken dish and really enjoyed it as well.Cleanliness- I don't usually include this in reviews, but this place was extremely clean. I ran to the bathrooms and was impressed that it was spotless and everything (even the garbage can) is hands-free.  Extra star just for the above-average cleanliness."], ["Emily E.", "Why is this place SO expensive?!  Their food is good but there are many other Thai places in columbia with food that's just as good but at lower prices.  The larb was good but I found the duck dish to be overly sweet.  Masaman curry was delicious."], ["Kim L.", "A little pricey but it is really good food. The service and atmosphere were excellent. I went with a big group so we tried several appetizers. Chicken satay was a 5 star, eggrolls get 5, and the soup gets a 3, but everyone else loved the soup so it is probably just me. I loved my pad see eu dinner. I highly recommend it."], ["Brandí M.", "Fantastic dish---we are simple kind of boring Thai eaters.....we like the pad see ew and it was brilliant.  But for three dishes to take out, it was $60.  And there was barely enough for a lunch leftover.  Very pricey for what you get.  I'm a fan, but probably only going back for lunch.  The flavor was delicious though.  So, yay there."], ["J K.", "Highly overpriced. Just spent over a hundred and twenty dollars at this place and didn't like the appetizer or dinners. We shared the Tom Yum Kung and the fish sauce was so overwhelming I couldn't a lot of it. The Basil Duck was extremely fatty and there was not much flavor. We also had the Red Curry Crispy Duck which was also one note. Both dishes had more fat than meat. For these prices the food should be amazing which it wasn't. Very disappointing."], ["Mary D.", "Very happy to see this particular type restaurant in this area.  Love it!  We had dinner, my husband & I shared the Pad Thai It was enough for two. The Pad Thai was so delicious, the service was excellent.  The ambience was so relaxing after a long day.  Our waitress Caroline was very attentive to our needs & service.  Thank you very much Caroline, we will be back."], ["Rachel A.", "Great food. Service was a little slow, but I wasn't in a rush. And the food made it worth it. A little pricer for a Thai restaurant than I've seen compared to other restaurants but if you're prepared for that then it's fine."], ["Mark B.", "We sat at our table for a good while before a waitress finally came over and took our order to spite the fact that it was a slow night and the wait staff was mostly hanging out and socializing at the food pick up area.  I ordered a bowl of Tom Ka Guy soup.  When my soup arrived I noticed the portion was much smaller than I had gotten in the past.  I mentioned this to my waitress who agreed it was less than it should be.  Later the manager came over and I showed him my portion and he got a small cup of soup and added it to my bowl that still fell short of what I had gotten many times in the past.  Later he brought over a soup bowl full of water to show me what a normal portion should be.  (This made it worse in my opinion.) I doubt we will ever come back.  I noticed the owner was not in the building.  I will try to contact him at the Charleston location to let him know whats going on when he is not there.  One thing I know for sure, South Carolinians wont tolerate cut portions especially at the prices they charge.  What a shame.04/04/15 Followup: I called the Charlotte branch 2 days ago after finding out that is where the owner was located.  I left a message with the manager about my experience at the Columbia branch and was promised a return phone call from the owner but to this day I have not received a phone call.  I'm starting to think nobody gives a rat's ass."], ["Simon T.", "Mediocre Thai.Comically expensive.Pretty light fixtures?"], ["Grace M.", "This place is great. I typically eat dinner later in the evening, so it is never super busy. But, I have been here when it is busy, and the food and service is still quick and great. Aaron is a great server. Their is a great cocktail selection and the bar is a good size in comparison to the establishment itself. I love the Thai hot pad Thai, red duck curry, and Tom yum soup! Fabulous. Be forewarned, the \"Thai hot\" is fairly spicy! But I love it. I tried the medium, and it just didn't cut it. Their peanut chicken skewers are good as well, if you don't want to venture off too far, in terms of trying new food."], ["M M.", "Ambiance is great.  Hostess was quick and attentive. Server was also quick to greet me.  Food is healthy, served hot and shortly after ordering.  Not many vegetarian options but my order (Red Curry with Tofu) was great.  Definitely recommend this place."], ["Bonnie H.", "Too pricy. Everything we tried was really tasty. Nice little cafe/bar. Terrible wait staff."], ["Tammy H.", "I love this Resturant. The Pad Thai with peanut sauce is excellent. The service is great!!!!"], ["Elyn B.", "So, I've been to the Charleston location several times and I've always loved it. Yes, it is expensive, but I've felt it was worth the price.Sadly, the Columbia location does not seem up to par. The dishes just weren't very special. I'd rather go to Bangkok (on Garner's Ferry) and pay half the price for twice the food and just not worry about the ambiance. I'll take the money I save and put it towards my next trip to Thailand."], ["Sotith S.", "Jesus what a great find. Ordered the beef larb and it was so good. This is coming from a family that makes larb constantly. Sorry mom. This was very very good. Then had the crispy red curry duck which was amazing. Everyone here is right. Ask the whole doing on that martini. Really good martinis."], ["Melissa C.", "well, I got an entire plate of pad Thai dropped in my lap tonight. don't worry, we paid for everything but the entree that ended up on me and the floor. likely to smell like Thai food for at least a year. stay classy."], ["Amanda F.", "If I loved the atmosphere here more, then I could have given more stars. But considering they just built this place from the ground up, you would think that they would have put more thought into the design.They do not take reservations so we showed up at 6:45 on a Friday and were told it would be about 45 minutes for a table for 5. There is a large communal table in front of the bar and they let us know we can drink there but not eat. (Odd, but ok?) We sit at the table thinking they had a cocktail server or something for it, but no, you must go to bar, order, and they will  bring it to you. Which would be fine, however this bar is TINY and they have HUGE chairs with tall backs on them blocking every access to the bar. So we yelled over a poor couple to try and get drinks while we waited.One hour and 15 min later they get us a table. We are sitting there and have ordered our drinks from the server, when the owner comes over and wants to know what our last name is because they think they sat the wrong table. Ummm what? We told him our last name and he said \"Ahhh, ok I will take care of this\". He didn't ask us to get up but what an odd thing to tell your table - you texted us to let us know that our table was ready so how did everything get so confusing?I will say that the food was very good - everyone loved their meals. It did take alot longer than expected for the food to come out, especially since by this point they were not that busy anymore. Highly recommend the duck salad - similar to a lettuce wrap and very good! Also the wontons were delicious! We will most likely come back and hope they have more kinks worked out!"], ["May L.", "Good ambience but expensive small plates of food. I now understand why their review was pretty bad. I probably will not eat here again until I have extra money I just like to throw on food can't even filled me up."], ["esther p.", "Tried this place for the first time last week. Went in for lunch at 2 PM, because we didn't know they closed at 2:30. My husband and I are pretty quick eaters, so we decided to eat and try to get out before they closed. Hostess was extremely nice and seated us quickly. The food was pretty good as well, but it came out within just a few minutes so I don't think they cook it as orders come in. The reason I'm only giving it 3 stars is because our waitress was short with us and a bit rude. She answered questions with short responses; I'm assuming she was agitated that we came in so close to closing. Also, she didn't inform us that it would cost extra for some peanut sauce for the fresh spring rolls (they came with a sweet and sour type sauce...most other places give peanut sauce). The food was okay, but they lacked for service. I don't think I would come back here again."], ["Carl R.", "This place gets 5 stars. The waitress was perfect. Food was excellent. Everything went smoothly. I ate the pad Thai which was very good. It was a nice portion. Some would need a box. The chicken and shrimp wontons were great also! There is happy hour till 7pm and the drinks are $5. A bit pricey for Happy Hour, as many other places charge $3. However, I would recommend this place, and will be going back to try new dishes. Apparently, each one has a unique flavor."], ["Drew E.", "Love the one(s) in Charleston. Food is great here--and a welcome sight in this part of Columbia. Went when it first opened and my only complaint is the noise--all the bamboo that goes with the Southeast Asian motif was just bouncing noise off of everything!"], ["Bonnie W.", "Was exited to try this place. The atmosphere and service was excellent, but the food was not my favorite.  I got the egg rolls to start, which were very tasty, but the pad Thai I ordered was kind of mediocre, the cilantro on top was black around the edges, and I found the tips of the green onions that you would normally discard in my food. It was pleasant, but it's not going to be my first choice in restaurants, I expected better quality food for the price. The chairs were the comfiest restaurant chairs I've ever sat in, though..."], ["Dana M.", "Iv read a few bad reviews of this place and I'm not sure why. We came on a Saturday night and the place was totally empty. We had the entire restaurant to ourselves...a little romantic I say. We ordered the red curry duck and the pad Thai. Totally delicious!! The sauce for the duck was to die for and the pad Thai was full of so much flavor! A must try! The lychee martini is soooo good also. Go see for yourself! Basil is worth the try!"], ["Paula J.", "Loved all the food I ordered it was so good and fresh. The staff was friendly and did a great job recommending dishes. I will be coming back!!"], ["Josh H.", "Their fried rice is the best fried rice in the city. The basil rolls are also interesting and fresh. But let me repeat: their shrimp fried rice is the best fried rice in the city. Period. But it's important to remember to request it be served with a spice tray."], ["Katie M.", "Went through the hassle to make a yelp account to give this place a good review. Got fried wontons for an app and the crispy duck both of which were amazing. Service was quick and our waiter was very attentive and nice. Can't wait to go back"], ["Paul V.", "There are times I am willing to wait for good food but what kinda fine dining doesn't have a real wait list instead post it notes and an unusual staff that would rather talk to each other than take care of the customer.  Take a hint go around the corner and get some authentic German from Julie's"], ["J S.", "The service was slow and manager was rude. The duckk was overcooked. I will not  be back. Maybe people in Columbia are not used to fine dining but this is a poor excuse 4 a restaurant that promotes itself find dining"], ["J H.", "Love this place! Fantastic Thai food. Chicken coconut soup, basil tilapia and Green curry eggplant are my favorites! Some says it's pricey... And I guess it is if you compare it to china hut, but it's a completely different class of food. It's comparable to M Vista. Try it for lunch if you don't want to spend dinner menu prices. I love that Columbia is getting some of Charleston's great restaurants!  I hope more people support a privately owned restaurant that took a chance on Columbia!"], ["Susan H.", "Love this place.  I have had the beef salad several times.  The meat is cooked perfectly.  The dressing is delicious.  The pad Thai is wonderful.  I had basil chicken during my last visit and it was very good too.  The pineapple mojito was excellent - not too sweet, which was my worry."], ["Rob C.", "Overpriced garbage thai food...miserable experience. The atmosphere is so so...very hard to hear or carry an audible conversation. I got a very small amount of chicken for 15 dollars. When I go out to eat dinner I don't plan on leaving and grabbing something from across the street to fill me up...If you decide to go to basil plan on leaving with an empty wallet as well as an empty stomach. Very diappointed.."], ["Sateesh N.", "Excellent food. Bit pricey.. Great ambience..Been there couple of times and the food never disappointed me. Pad thai and vegetarian fried rice were good enough.. Would love to go there again.."], ["Mitch B.", "Honestly it was a little pricy compared to the average Thai restaurant I have been to but it was like no other Thai restaurant I have been too. it was slightly upscale compared to most Thai places. I would have to say it was worth it. Our appetizers set the bar really high for the remainder of the meal. I would definitely go back. So many menu items caught my eye. If you are in the area try it."], ["S H.", "Definitely good, but lacking a lot when you compare it to Mai Thai. Basil is much quicker, larger, more modern and has a better location. The food is fresh and tastes great. However, I always feel like they are rushing me out of there, the portions are a bit small and it's a little pricey."], ["Colleen C.", "Their website says \"Dine with us and celebrate quality cuisine made with the finest, freshest ingredients.\" However they don't tell you their entrees have MSG in them. I would not have expected that I have to ask such a thing at a restaurant that is supposedly billed as a upscale restaurant.  Prices are also a bit steep - 2 people, 2 drinks each, appetizers and entrees - over $100. Might go back for appetizers and drinks but probably not for dinner. Also charged an extra dollar for an order of peanut sauce with the entree - seriously?"], ["Iris D.", "Tom Kha Gai is life changing. Crispy Red Curry Duck will make you want to slap your momma it's so good. Then, the Pad Thai will make you slap your grandma. So,  I suggest you don't come here for Mother's Day lunch. Could get ugly."], ["Marty S.", "Pad thai - me oh myShrimpy goodness too, thank you (sir)I be back to eat.-M.S."], ["Phillip S.", "Pad thai is pretty damn good add that really spicy condiment and you're set for the evening and hell its probably enough for two if you're into sharing and all. Would have busted out the 5 stars but the price really kills this place for me as a regular spot"], ["Aaron Z.", "Not your typical stir-fry grease bomb. Clean, healthy Thai food with great presentation. Restaurant is nice, very trendy, doors open at 5pm for dinner.  Get in early to avoid the yuppies."], ["Cor B.", "no- I have been to the basil thai in Charleston, sc more than once, and this does not live up to the name.  Skip it.  Go to the one in Charleston."], ["David W.", "Best I've ever had. Great staff, and the food makes my mouth water just thinking about it writing this. I had the Seafood Hot Sour Soup and the Red Curry Duck! Sensational!"], ["Diane S.", "I really enjoyed Basil.  I didn't care for the Basil Rolls appetizer, but I'm sure some do.  They were cold and the consistency of the outer wrapping (rice paper) was not appealing to me at all.   My husband had chicken wontons and they were delicious!  For an entree, I ordered Vegetables Delight with shrimp. It was quite good.  My husband had Sweet and Sour Chicken and said it was delicious!  Our waitress was very friendly and the service was fast."], ["S M.", "I ordered tonight for the first time from Basil, i have eaten in the Charleston restaurant and it was amazing but i really am not impressed here in Columbia. My basil rolls were good but not kick ass and my soup was not the flavors that i normally comes from that type of soup, maybe they do it different at Basil but not impressed. Next came my papaya salad, a dish that is actually hard to get in Columbia because green papaya is seasonal so in anticipation i was so disappointed when it was mushy and just not like papaya salad in any Thai restaurant i have eaten in. Next i got the ginger chicken entree and as much as i really loved the taste never in a million years was it worth $16.00 for the portion size so sorry Basil i would rather drive over to Mai Thai and get the same food for half the price. My bill was $50.00 to try your menu."]], "Santee Thai and Chinese Kitchen": [["Veronika F.", "Don't go by Yelp direction and just plug in address in your GPS or you won't find it. This is very casual place but food are very tasty and fresh! They also have free range eggs that picked daily and it's $3 per dozen. Need place to checkout..!!!"], ["Leslie W.", "A secret hole in the wall next to a nail place and Hampton Inn.My husband ordered the sweet and sour flounder- excellent.I have decided that I should give up meat as the last three meals I ordered in various restaurants have been disappointing. I think I just do not likeMeat anymore. The duck I had was unimportant in the dish to me but the fried rice and mixed vegetables were delicious. Even the white rice was good.Also had spring rolls to start- crispy and came steaming hot.Their special tea is a taste treat an you get a little green candy at the end that is a taste treat but I cannot figure out what the taste actually is."], ["Peter S.", "Great food.  We had no sushi as we were somewhat intimidated bysmall size and volume of sushi sold.  All of the food we ordered was amazingly good.  Nine out of 10 spiciness ordered however translated to about five out of 10 or six out of 10 for me. Obviously this is a personal issue only.  Flavor freshness and tastiness of everything was superb.   Very small venue.  Seems to be family owned and run restaurant.    Anytime I'm in the area I will clearly make an effort to be here again for dinner."], ["Joseph D.", "A good restaurant.  Food is fresh, well prepared, and spiced to order.  I was very pleasantly surprised how well the dinning experience was...go yelp."], ["Deborah D.", "I have driven by this place hundreds of times on my way to and from church and my children's school. The little strip mall it's located in is sort of dingy and it's connected to a convenience store/gas station. A family member kept posting check-ins here so I thought I'd give it a try. I'm so glad I did. The restaurant is small with maybe a dozen tables, but the food is excellent. It is a family owned business that uses ingredients grown at their own farm. The sushi was fresh and the servings were generous. I'm sure this will now be a regular stop on our way through town."], ["Lindsay M.", "I'm pretty sure this is actually the Thai and Asian Cuisine on the other side of 95 attached to the Mobil gas station.  We drove to the location identified on the map, but there was nothing there.  Anyway, the Thai restaurant we did end up at was wonderful.  A big surprise due to the location.  Service was friendly if a little flaky.  Give it a try!  You won't be disappointed!"], ["Ron L.", "Simply delicious.  If you like Thai cuisine  this is  the place to go!  What a pleasure to find  delicate flavors and fresh ingredients, particularly after a long day's drive!   You won't be disappointed!"], ["Vinny G.", "If you're traveling on I95 in this area this small unassuming Thai restaurant is worth a stop.The service is friendly although it can be slow when busy, and the food is authentic and always very good.On our last trip we had spring rolls, blackened noodles, General Tso chicken and a variety of soups. All were well prepared, spiced just right and fresh tasting.The restaurant is very small and sits in a tiny strip mall, but don't let that put you off from visiting them. You'll be pleased that you gave it a shot."], ["ELJON G.", "Although I live in Jacksonville, Fl this is my home. When I come home there are two things that we always make sure to get. BBQ (from my other spot) and Thai and Chinese food from the Thai House. I love Thai food and my kids prefer Chinese and this place provides both and get it right. It some of the best Thai food I've had."]]}