{"Gabatoni's Restaurant & Cocktail Lounge": [], "Saputo's": [], "Olive Garden Italian Restaurant": [["Pam B.", "Very good food and the service was excellent.  Walked right in and didn't have to wait on a table.  Decor and atmosphere were both very nice.  Nice how you can just scan your card at the table now to pay and be on your way!!   It's great when you can buy your dinner and get one to take home as well.  Great promotion and lunch tomorrow on you!!"], ["Kait S.", "It is to Macaroni Grill as Apple Bees is to Ruby Tuesday. Like the awful, microwaved perversion of a red-headed step child. On a serious note: the meal went south fast right after the salad. Everything was covered in thick, bland sauce that left my taste buds mortified."], ["Abby S.", "My husband and I eat out regularly, and Olive Garden has always been our go to Italian restaurant. However, the last time we went left a bad taste in my mouth. We had gone when their advertised entree was a stuffed chicken breast. The display picture showed a large chicken breast with cheese stuffed in the middle. However, when i go it it was two, 4 oz chicken breast with a little cheese in the middle. I was very disappointed in the size, and to top it off, the sauce was supposed to be a mushroom sauce, but it tasted like cheap soy sauce. I was going to pay for it until I found out it was $18!  I would go there again for the soup salad and breadsticks lunch but that is it, i will have to find a new place to eat the next time we crave Italian"], ["Anthony E.", "Spent many Birthday dinners here. The best place to gather with friends and family!endless bread sticks and salads. I always get the Tour Of Italy which is wonderful. Fills you completely."], ["Bert B.", "Lucky I didn't have to drive too far from the restaurant. Diarrhea set in about 30 minutes after dinner on tuesday night the 4th February. The restaurant was a very busy due to the snow in the area. Just thought everyone should know be where."], ["Ben S.", "Called them on the phone...Me: \"How long is your wait right now?\"Door whore: \"Uh, I don't know.  Did you want me to find out for you?\""], ["Alice K.", "Unlimited pasta bowl with the choice of salad or soup in just 9.99$ !!! Who wouldn't love it. But it tooook so long to get the pasta.! May be that's the way of them making people full with just soup or salad and bread which is also unlimited. Great deal after all though. I might go again :D"], ["Jason L.", "Decent OG location, food was good, service was good.  Prices were average.  Not much else to say..."], ["Jason G.", "I wouldn't take a dump in Olive Garden."], ["Robert G.", "Olive Garden is not my favorite Italian restaurant.  Normally i think it's just good enough to get by in a pinch.  On this visit i was pleasantly surprised.  I'm not sure if they've had a change in kitchen staff since my last visit or what, but everything was good.  There were 7 of us our party, including one five year old.  A brief wait on a Wednesday night but nothing bad.  Our server was exceptionally friendly and very attentive.  I can't remember her name or i would suggest everyone ask for her specifically.  The calamari appetizer was the best i've had in a long time - lightly breaded and cooked perfectly, not all all tough or rubbery like you often find around here.  I ordered the lasagna and everything tasted fresh.  It didn't seem like it had been sitting under a warmer for half an hour.  Of course the salad and bread sticks were just as good as they always are.I don't know if this was just a stellar night from an otherwise average restaurant or if it has really stepped up its game.  Based on what i tasted, i'll probably be back to find out."], ["Edward B.", "Olive Garden is what it is.  Nothing special Italian, pricey, but tasty.  You can get WAY better food at a local, non-chain place, but my sons wanted to go here.  It was good, but too expensive.  The service though?  Amazing.  Our waitress was great and her smile was killer."], ["Jeremy W.", "Olive Garden is always kinda the standard nice place.  Food is usually tasty, but nothing special.  We usually prefer to find non-chain places to eat."]], "Mario's Pizza": [], "Monical's Pizza": [["Sonna E.", "I was leary because of the 3 star rating. Glad we went! The pizza is amazingly good.  We got the pan. Not as thick as other pans I've had.  But the crust! Crispy and delish! Bread sticks are fairly unremarkable, not worth the price imo. Can't say enough about the pizza tho.  My daughter had the tortellini and liked it as well. Get. The. Pizza.Our service was really good too. The girl was attentive and friendly."], ["Leslie S.", "I always get a salad with red dressing and pizza with pepperoni and minced garlic every time I have the fortune of passing through a town that has a Monical's.  But something was off here.  The salad tasted fantastic as usual, but the pizza was NOT the same pizza I remember, and two of my co-diners agreed.  I'm not sure why the pizza here doesn't taste the same as other Monical's.  Granted, I haven't been to a Monical's in about a year or so, so maybe they changed recipes at all of them?  Hope not."], ["Scott H.", "Best thin crust pizza ever, hands down! Pepperoni, salad, sweet & tart dressing - game over! The only reason this place doesn't get 5-stars is because they do not offer Dr. Pepper. Although I'm always passing thru when I stop to eat, and conveniently it's across the street from a gas station, so I get my pepper fix. Always pick up an extra bottle of dressing to take back to the hometown too! I love this place!"], ["Cameron T.", "Its great that they have a gluten free pizza. The pizza is so-so. The service is crap. Ordered ahead. Said it would be ready in 20 minutes. Got there 20 minutes later and they hadn't even put the pizzas in the oven yet. No explanation. No typical \"would you like a drink while you wait.\" Just swiped my card before I even knew I was set to wait another 20 minutes, and went back to ignoring me."], ["Joseph S.", "It's a chain, expect restaurant chain service but the best go to pizza for the money."], ["Jason L.", "Anyone else put the French dressing on their pizza at Monicals? I grew up eating this way..."], ["Nabih E.", "I went in there with a friend for lunch. As we walked in the greeter pointed us to sit at a table. He did not say hello, he did not talk to us, he was not smiling, and it sounded more like an order. It was 15 minutes before our waitress showed up, and then it was 10 minutes for our water and salads to show up. We ordered 1 large thin crust pizza with 3 toppings. We did not get our pizza for another 30 minutes. We were seated by the door and so my friend and I started timing people's wait before they were greeted as they came in through the door. One couple waited 3 minutes before they were even recognized, once they were the conversation was \"how many? follow me\" again there weren't any friendly hellos nor smiles - you can almost sense a tension between the staff. Our salads were below average, taste and quality wise. The salads had some lettuce, some carrots, very little tomatoes and cheese. the pizza was big enough for both of us but it was salty, much saltier than any other pizza experience we've had.  In summary, we were hoping for a quick, good pizza experience and this wasn't the one."], ["Vince H.", "This has to be one of the worst places for service we ordered the stuffed crust pizza and it took over 40 minutes to get the pizza in a half full restaurant, the waitress brought our drinks and never even checked on us until I went and made my presence known. This was my first time coming here and it will be the last. Don't waste your time coming here, to bad they don't have a rating below 1."], ["Jim H.", "Ok, so this is one of the best thin crust pizzas in existence.  The crust is crispy, the sauce is perfect, the cheese is just right, and all of the toppings we have picked have been fresh and cooked to yummy perfection. We like the family pleaser, comes with a big bowl of salad, pitcher of pop or iced tea, and then your pizza.  I have been eating Monicals for over 18 years.  Once, on a dare, I ate a piece with hot sauce and found it was great.  To really mix it up, try dipping in the sweet and tart salad dressing.  The contrast of the hot and sweet make it a whole new experience.  Maybe not for everyone.We used to live in central Illinois but now we live in St. Louis, where they say St Louis pizza is thin crust from Imos.  Now that is a thin crust pizza that's confusing.  Apparently the more plastic the cheese (they use provel cheese ) the better.  Needless to say, every time we are near a Monicals Pizza, we indulge in the good stuff, which tastes like plastic NEVER!  We love it.  Please move to the Lou and show them what real pizza tastes like."], ["Brian P.", "My family is new to area and decided to try this pizza place.  Sorry to say we were disappointed.  We waited an inordinate amount of time for two small kids pizza and spaghetti,  I asked for manager because no one came by to say there was a hold up.  Assistant manager came by and said sorry for the wait, it is Friday and they had a lot of take out orders.  Well I explained this was our first time to come and were disappointed about the wait.  He looked at me as if it was my problem and why had I bothered him.  Food was not any better.  Pizza was marginal and pasta was watery.  There are much better places in town that appreciate their customers and serve quality food."], ["Mike H.", "Not sure I understand the popularity of this place. Food-eh, service-eh, price-ouch."], ["Truman W.", "I've come to the conclusion that they have a management problem.We've loved Monical's Pizza for nearly 40 years.  My wife and I went to a Monical's on our first date.  We were very happy when Monical's came to Springfield.   I still think their pizza is the best when they're on their game.   When relatives come in from out of state, they ask to go to Monical's.  But their pizza is expensive and quality varies widely day to day.    Our weekly or bi-weekly Monical's pizza has become 3 or 4 times per year.   Very often the pizzas are short of cheese; $18 to $20 is a lot of money to pay for a 16\" paper thin flavorless pizza and we were getting that way too often.   My brother's family has given up on Monical's after the experiences they had the last two times they came to Illinois.   We started avoiding carry-out because there's no easy avenue of redress when you're served a bad pizza.   In two of the past four dine-in visits, they've attempted to overcharge us by approximately 20%.   They're pretty blatant about it.   It's clear management is aware of the practice (ringing up ala carte prices for the Family Pleaser).I still love my Monical's pizza but going to Monical's is too much like gambling.   You're going to lose more than 1/2 of the time.   We'll keep checking back from time to time to see if they get their stuff together.   I'd hate to think the Monical's of my youth is gone forever."], ["Dave L.", "Really great thin crust pizza.  Also love the pepperolies.  We found this restaurant in Pontiac, IL and we stop at any location we can when we are passing through.  If you live near one - lucky you!  If you are passing through give it a try!"], ["Garret W.", "Monical's pizza is definally one of my favorite places to get a pizza from. There pizza is mostly a \"thin crust\" style of pizza which  is covered in tasteful ingredients with good proportions. One thing that you will definaly have to try at Monical's is a salad with there signature French dressing. Also there building is a new improvement over there last location. With the new building having more open room.   Now for the cons!  The serving staff is pretty bad. I'm not saying that they are not polite, because they are. I just get lousy service. So now I always order to go. The price for pizza is also kinda high, but  it is delicious and so I will always come back!"], ["Melissa H.", "This was my first time dining in their new building, which is a huge improvement over the last.  Their pizza was great, as always, but I think our waitress was in charge of all the tables.  She only came around once to check on us, but I felt sorry for her!Monical's, please hire more service to accompany your new look!"], ["mike l.", "I'm not gonna bring up how miserable the waitress was. or how the special, world-famous \"sweet french dressing\" is just generic-brand ketchup. I will say I was quite surprised at how great the pizza was. Thin, with just the right amount of sauce, toppings & cheese. Hey Racanelli's, take a trip to IL and learn something about how to make your pizza edible. You could probably upgrade your customer service & hire the miserable waitress."], ["Fred M.", "I am from Chicagoland and I ordered an Italian Beef.  BIG MISTAKE!  I could call the sandwich a 'French Dip', but not an Italian Beef.  Monical's did not have 'hot giardiniera' to put on the sandwich.  They didn't even know what is was.  However, the service was very friendly and fast."]], "Noodles & Company": [], "Bocardi's": [], "Lake Pointe Grill": [["Konner D.", "Repeat patron here. Lake Pointe is consistently good. I've never waited long for a table or my meal. I've tried much of their menu, but now I usually just get the Grilled Italian sandwich. It's amazing. Their pizzas are also very good. I'd recommend it as a social meeting place as its a bit louder most days."], ["Chris C.", "This was recommended by the hotel staff as better than the Cracker Barrel.  I think it was a good choice with prices that were comparable for the items that were similar. Nice little bar and grill.  We had the club sandwich and got talked into a haystack - Texas toast with spicy grilled chicken strips covered with white sauce and french fries.  I am not a big fried foods fan, and I still pretty much cleaned my plate.  The waitress was right \"you have to try it once\".  Most people around us were eating pizza and that did look good too."], ["Jeff W.", "Stopped after coming back from STL ....1ish for lunch.  Horrible server and slow service. Buffalo chx horseshoe just tasted like Tabasco sauce only....Margarita pizza ok....had to ask for the pizza sides 2x (chs,peppers, plates etc)  may not be back.....to pricey for such a bad experience"], ["Connie F.", "Found this on Yelp while visiting Springfield area. The pulled pork and pork tenderloin sandwiches were very good. Service was fast & our server was very nice. Would come here again if in area. Should have taken pics.  Sorry !!"], ["Elise B.", "We found this place on a recent trip passing thru from Chicago to St. Louis. The meatloaf is outstanding, however the shrimp and grits is even better. Just the right Cajun heat!  We had to stop in again!  The wood fire special Italian beef pizza was great.... Could use a big more beef, but the flavor were just right. If you stop please try the portabela fried mushrooms that they prepare fresh. I can't say anything bad about this place bartender was friendly and chatted with us even though we were there during busy time. The wait staff is average, when busy they tend to stress a bit as there were several large groups.  We will stop again for sure. Can't wait to try something new!"], ["Alessandra C.", "We stopped here on our way back from a trip to Chicago and it was by far the best restaurant meal we had on our entire trip! The service was very friendly and the food was spectacular, especially the chocolate lava cake we had for dessert. Would highly recommend!"], ["Amber O.", "The prices were reasonable, you get a lot of food. I wish the tropical martinees had been colder.. I would still like to try the pizza though"], ["Frank P.", "The food is always delicious. Great service reasonable prices and good food. What more can you ask for. Never had a bad meal or bad service there. Would highly recomend them to anyone"], ["Jennifer M.", "Underwhelming.  I took my family there for dinner last night. Service was good, atmosphere is nice. The food left a lot to be desiring. 1) Gumbo. This is what I ordered. It wasn't bad, it seemed nice and fresh. My main complaint here is that there was zero heat to it. A good gumbo has a slow heat, something that sneaks up on you. The rice on top was also inadequate, and the corn bread was not very good.2) Margarita pizza. Sister ordered this, and I snagged a piece. The crust was crispy but chewy (if a bit overcooked). The one complaint about this pizza isn't even really a complaint. Whenever I've had Margarita pizza before, the basil was cooked on the pizza. On this pizza, the basil was placed over the cooked pizza. It wasn't bad, just different. 3) Cajun pizza. Dad ordered this. Disliked it so much he gave it to me to take home. I took it to work for lunch. This crust DOES NOT hold up to being put in the fridge overnight. It loses the crisp, and just turns soggy. As far as the flavor...it's just awful. There's no other way to describe it. It was like someone tossed some sausage (I can't even call it andouille..it wasn't spicy), shrimp and Lawry's on a cheese pizza and called it \"Cajun\"Side complaint: Someone told me this place was over priced, and on a cursory glace of the menu it did not appear that way. Well, what I failed to realize is that almost none of the meals come with a side. Want a side? That's an extra $2 minimum. If I'm paying $15 for an entree, I should not have to pay another $4 for a side salad. Given that I liked the Margarita pizza, I will probably give this place another go.  I think the problem here is that the restaurant is simply trying to be too diverse in it's offerings. Find what you do well and do it. For this place, it appears to be the pizza and horseshoes (didn't even get to try a bite of my mom's, she liked it that much) Do not order the Cajun options if you like Cajun food."], ["April W.", "Amazing wood fire pizzas! Oh and stuffed meatloaf! Great atmosphere friendly staff. Nice bar that you can have a drink after dinner."], ["Grant H.", "I come to Lake Pointe Grille quite a bit as I work just down the road and it's the only choice for a sit down restaurant on this road outside of Cracker Barrel and don't want to shove a copious amount of food in your face. The portions are great, not too big and not too small. I'm partial to the grilled Italian sandwich and the buffalo chicken horseshoe. Service has always been good and the price is comparable for the area. Will continue to repeat business."], ["Tre A.", "This place is the bomb!!! One of the best Ahi tuna, Stone oven pizzas and bread puddings I have ever had! Kind of pricey, but you pay for quality, great great quality. If you have never been here, I highly recommend that you go here at least once. You will want to return for more!"], ["Sarah M.", "Food is delicious! Caesar salad is personally a favorite.   Great atmosphere and service."], ["Noelle B.", "This place is a local favorite! I have honestly never had a bad meal here. Service is always great as well. Their wood fired pizzas are phenomenal, but you really can't go wrong with anything you order! The white chocolate blueberry bread pudding dessert is a must order!"], ["Andy C.", "Good wood fired pizza, nice atmosphere and good service."], ["Betteanne S.", "Traveling from St Louis to Chicago and wanting something different than the usual chain restaurants. Used yelp to find this restaurant. Excellent choice. I had the BLT salad and a cup of Potato Soup, both were delicious. On our next trip through Springfield we will try the Pizza. Easy access to interstate 55 makes this a great travel stop."], ["AJ M.", "I was in Springfield for a few days for work and decided to try this place.  The staff was friendly and very nice.  I ate there twice in two days... sad, I know, but the food was really good both times.The first day, I had the seafood risotto.  This entree was very good and very filling.  It had shrimp, scallops, & pieces of salmon, which was unique for a seafood combo dish.  The seafood tasted good, the risotto was filling, & the sauce was very tasty.  Overall, this was great.  Everything about it was delicious.  Hands down one of the best entrees I've ever had in Springfield. On the second day, God created the sky... I mean, I had the stuffed meatloaf.  This was probably the first time I've had meatloaf in 10 years but wanted to try something different.  This dish was very good; a thick meatloaf slice, wrapped in bacon, and a hole in the middle with 2 different cheeses.  This was very delicious but the only downside was that it was a single slice.  I left the table satisfied but not full.  So if you have a big appetite I'd look at another menu item."], ["Lasairiona M.", "The spinach dip wasn't hot, luke-warm at a push, but it was tasty, though please, PLEASE don't stick the crostinis in the dip to serve, they go SOGGY at the bottom where they were in the dip.  I liked that we got more crostinis offered too.  The pizza was delicious, we got one between both of us, it was large enough and we struggled with the last few pieces.  We got simple pepperoni, as I had read the reviews on Yelp that too many toppings make for a soggy-bottom, so we kept it 'light'.  Loved it! Wasn't too busy, wasn't too expensive, service was great, food was quick, parking was ample - only advice is to bring a sweater!"], ["Wadcutter ..", "Food just OK. Not bad but nothing exceptional. 2 stars for the food. The service bumped it up to 3 stars. Inside decor really bland. Looks like the place just opened and they hadn't finished decorating.We'll probably come back only because friends frequent this place. It's not a place we'll go to otherwise."], ["Am D.", "Friendly service by Keegan, nice patio, great food. We had the buffalo chicken horseshoe and blt salad. Easy on/off access to 55."], ["Lisa M.", "Their pizzas are very good; but, the BLT Salad was excellent!    I would definitely go back and have these items again.  The service was also very good."], ["Eric C.", "Service was slow and the pizza was lackluster. Even though it was the end of the night, we waited almost ten minutes for a second drink order. Had hoped for better."], ["Holly K.", "Have had the calzones here a few times as I live nearby and it's convenient but usually the are cold in the middle, tried the pizza and the crust was a little soggy, moved on to the chicken on my next visit but it was REALLY tough.. Service is usually good but that's about it.."], ["Dustin O.", "This was a quick stop on our way up to Chicago.  We were pretty hungry and ran in for lunch.  I got one of their wood fired pizzas, a BBQ chicken if my memory serves.  It was very good!  They say it is best as single serve, but it is easily sharable.  I can put down some food, but I sadly left one piece behind.  I just had no room for it!  The GF had a salad that was good and fresh as well.  I would definitely stop here again on our way up!"], ["Brooks R.", "Good, attentive, friendly service.However, bland food. Food did not seem like it came from fresh ingredients.Don't go there if you're expecting a food experience. Works in a pinch if you're starving, but this is a far cry from fine dining.The biggest turn off was the large television in the dining area that broadcasted ads for local businesses. Tacky!"], ["Trista T.", "First of all, we had amazing service Our waitress was awesome, especially since we had such a big group.  She never let a drink go empty, kept all of our food and tickets separate and correct, and she was just super nice.  Everyone at my table got a variety of things and I didn't hear a single complaint; in fact all I heard was munching on good food.  I had the tomato basil soup that was good.  I also had a BLT salad.  Neither was life changing or anything, but I definitely ate every bit."], ["Mimi L.", "I've recently had both their brisket sandwich, and their margarita pizza. It's one of the only places in town that makes this classic pizza, and they do so similar to that I've had in New York City. It's fresh, the dough has the appropriate bubble and the sauce is perfect. The only thing I would change is the thickness of the fresh mozzarella. It could use a little more thickness to compare to traditional margarita pizza. As for the brisket, everything was perfect with one error. The fat wasn't trimmed off the brisket. Even after the butcher trims the fat, you have to trim even more yourself. For brisket fat is tough and, well, disgusting. Nearly every piece had 1 inch width of fat. I took the time to cut it off and the meat, with a toasted bun was perfect. Be sure to ask for the fat trimmed! Over all, it's great, and still a 4/5. Enjoy!"], ["Caitlin P.", "This place isn't worth the hype. It's pricier and the food is mediocre. Their pizza is okay, pretty dry and almost inedible (rubbery) when it's reheated."], ["Rebecca A.", "While visiting Springfield I also checked out the Lake Pointe Grill.  Glad I did because it was really good.  I ordered the raspberry lemon martini to drink.  Good, but hard to justify a $7 cocktail in Springfield when I was out drinking $1.25 Bud Light bottles the next evening at a tavern.  Three of us shared two half salads, the Apple Jack and Asian.  The Apple Jack was great and the Asian was beautiful to look at but could have used some salt or a more flavorful dressing.  I found the taste kinda boring.  For meals we shared the creole pizza and white garlic pizza.  Both excellent!  WAY too much food but taking home leftover pizza is not a bad thing at all.  Will definitely go here again next visit. :)"], ["Danielle D.", "Really good!We were in the way to Chicago and this was the best health option! The food was fast and good!!!!I can come back again..."], ["Tabitha H.", "Delicious marinara and pesto sauces. Good crust. Unfortunately the garlic bread has chicken broth in the spread. Didn't really care for the atmosphere."], ["Dee L.", "The staff are very friendly, attentive and informative about the selections. The food is always delicious whether you order a horseshoe, pizza, or entree from the wide selection of options.  The cheese sauce for the horseshoes is arguably one of the best in a town well known for cheese sauce & horseshoe varieties."], ["Kristin B.", "Spinach artichoke appetizer was just okay.Pizza was very good.  Excellent crust.White chocolate blueberry bread pudding dessert is very much worth saving room for.  Beautifully served, too.Staff, a little distracted but not unfriendly.Nice place over all!"], ["Tom T.", "Excellent pizza but over-priced and only one size available. Dining room kind of bland and noisy but bar area is comfortable. Very good food.Update:Service has really taken a nosedive here. Food is decent but overpriced. Refuse to sit in the noisy, bland dining room. Bar only for me."], ["Angie S.", "Shrimp and grits....amazing.  White chocolate blueberry bread pudding....even more amazing and this coming from a chocolate loving, bread pudding hating individual!Pizzas are good although less is more with the toppings and sometimes the center crust can be soggy."], ["Leah H.", "Great pizzas.  I like how they have lots of options for them.  You can pick whatever topping you like.  They have shrimp and steak to choose from too.  I like the shrimp, steak, onion, and mushrooms.  Delicious! I have been there a few times, and I just cannot get past their pizzas but the other items that were referred at my table looked great and was well liked by the others in my party! Great food at a good price."], ["Todd B.", "The atmosphere is really great, easily 5/5 stars. The place is well done on the inside. The food is good too, we'll say a 3.5/5. My mark-down is for the service. Almost anytime I'm there, whoever is waiting on us is a prime example of how not to work in the service industry. Rude, uninterested, slow wait-staff. This is the type of stuff that will have me on the fence about a return trip - The food's good, but it's nothing that isn't done elsewhere. As someone in the industry myself, I notice the little things. Where are managers making sure things are being done right? They're lucky a town like Springfield has no real quality establishments otherwise business would dwindle. The lone Toronto Rd. restaurant helps out a lot, but even that won't stay the same forever."], ["Warren W.", "Stone oven pizzas? Yes please! Great service and a menu that has something for most people. Definately recommended if you have a gorup that cannot decide what they want to eat."], ["Nathan B.", "I went Wednesday, October 15th.  On my way there, I had a first impression that the restaurant would be an outdoor restaurant.  But I was incorrect.  The interior of the restaurant was quite intriguing, not what I had expected in the slightest.  While I was sitting, I had noticed that across from me there was a brick oven which I thought was an exquisite touch to the décor of the restaurant.  As I looked around the restaurant, I noticed all the chairs and tables were made from a polished wood, which added to the bar-like atmosphere that the restaurant gave off.  When the waitress came up to me and asked what I would like to get, I told her I would like a glass of lemonade and a pizza with pepperoni and sausage for the toppings, as well as a Caesar salad.  She came back about 10 minutes later with my meal, and as I took my first bite, I loved it.  The pizza tasted warm, as if fresh from the oven.  The smell of the pizza made my mouth water and I could tell it was cooked from the brick oven.   The Caesar salad looked as well as tasted fresh and tasted scrumptious.  The lemonade was fresh and the right amount of sweet and tangy.  The service was splendid and attentive.  I never had to get her attention for anything."], ["Magen R.", "I tried out Lake Pointe again and was really impressed. I had the Philly steak with the Mac and Cheese side. The Philly steak was great and the Mac and Cheese was out of this world though! Everyone else was very satisfied except the service was a bit slow. Living nearby with that Mac and Cheese so close is going to be very tempting!"], ["Asia B.", "First time eating here and was very pleased. Amazing food. Amazing price. Huge portions. Fast service. Will definitely be back."], ["Greg L.", "Oh, this place is a keeper for certain.  What a terrific surprise!We stopped in on a quick trip to see family in Springfield and were wowed by their wood oven baked pizzas, and awesome they were.The pizzas are larger than individual pizzas but perfect if you wish to share, or take some home as leftovers.  The two I highly recommend are the Margherita (fresh tomato, basil, cheese, sauce) and the Cajun (Andouille, peppers, onions, cheese).  Both are made with love, and have wonderful flavor.  Loved the Margherita but there is nothing getting in between me and that Cajun pizza next time I go.  You can keep the menu---that is the pizza for me.  You have to try it to understand.  Thankfully I was the recipient of kind sharing...Their Caesar salad is also terrific, and the beers ice cold---I am told that is a Springfield thing, and if true, this place lives up to the local mandate.The menu is extensive beyond pizzas to include fresh fish and several outstanding entrees that we enjoyed watching others enjoy.  A very busy and obviously popular place, we recommend going early, and being patient.  Sidenote:  Drop your guests at the front door and leave whoever draws the short straw with the task of parking the car.  A large parking lot, if you go during prime time, you will see how popular this place is when you try to find an open, and legal parking place.  Don't understand?  You will---trust me."], ["Richard L.", "My favorite restaurant to eat at in springfield. You've gotta try their horseshoe sandwiches."], ["Matthew G.", "I've been there a few times.  Been there 3 times now and only had one server who was rude (is that good?).  The food is average.  It's a place to stop, but not a common place for me and mine."], ["Beth H.", "Everything about lake point grill is on point. Unique menu that offers a wide variety of delicious selections for everyone. I go there probably more than I should. My friend usually gets the same southwestern or apple jack salad. I'm all over the menu , I know I'll be back and I enjoy the nice tasty variety. The staff is knowledgeable and friendly. Courtney, Lisa, Jill, and Shannon are just great!"], ["Amy S.", "Dang! The Italian grilled sandwich is GOOD!"], ["Brittany H.", "We dined here on Easter Sunday and were very pleased with our food. I am from Springfield, IL but currently live in Saint Louis, so when I come back \"home\", I must indulge and take a few bites of my boyfriend's horseshoe (which is typically a Corner Pub or D'Arcy's shoe). He had the Lake Pointe Grill meatloaf horseshoe from and my gosh the sauce is to-die-for! By far my favorite cheese sauce in Springfield. I had the Apple Jack salad. I planned on eating half and taking the other half home, but I did not leave with a doggy bag. I have been craving this salad ever since! Oh and the pizza is delicious, after all, they are known for their brick oven pizza. Great food, great service!!"], ["Tim B.", "Good music in the background and excellent service from Brittany.  The garlic cheese bread with sauce was excellent as well as the pizza. (a little greasy but delicious!)"], ["Katie F.", "Lake Pointe isn't phenomenal, but it never disappoints. The pizza is thin, crispy, and good, but I prefer their entrees -- a salmon dish that comes with pasta is really good, though I can't remember the name. They have good toasted ravioli as an appetizer. My family had a special event here last year and the staff was extremely accommodating and wonderful -- and the food was good, too! It's not exactly fine dining, but you can't go wrong here. The biggest downside? Location. It's far from most of the central Springfield neighborhoods, even if you live on the west side."], ["Tom T.", "Excellent!  One-time shot meeting an interview candidate.  Restaurant was packed in the middle of the week, seemed to be mostly regulars and everyone seems to be happy regulars.  There is a wood-burning brick pizza oven and pizza is clearly the main event.  So imagine my surprise when I ordered a seafood dish and it was fantastic!  But even more notably the service was fantastic and very friendly.  Would definitely recommend and if my events take me here again, will definitely eat here again."], ["Lindsay L.", "I think people in Springfield must have trailer park taste buds because this is hands down the best place to eat in Springfield. I moved here from Chicago a year ago and the food is pretty awful everywhere I have been until we stumbled upon this place 3 weeks ago and have been back twice. Between the two of us, we have had the pizza, calzone, pork chop, and almond crusted pork medallions. The food would be good in Chicago and that is saying a lot. People here get offended when you say food is better in Chicago and think that means you are stuck up, but why wouldn't food be better in the 3rd largest city in America?? I grew up in Columbus OH which is a test market for large cities in the restaurant industry and then lived 10 years in Chicago, I know good food when I taste it. I actually read on here where someone complained about the floor at Lake Pointe, to which I say, \"You need to get out more.\" It is very nicely decorated and the waitstaff was excellent. The only complaint would be that they could get some booths, everything seems super out in the open, the 2nd time we set in the bar and that was a little more intimate. Hands down the very best restaurant in Springfield."], ["Isabelle L.", "Well, 7 PM Monday night yet the place is packed and now I know why: full bar, relaxed atmosphere, great food. The wood oven pizzas are usually delicious and will set you back $10 -14. They also have sandwiches, salads and traditional entrees; tuna, meatloaf...all in the $16 range. My little complaint this time: ordered the margherita pizza and yes all ingredients were fresh and tasteful, yet the dough was undercooked and I just didn't appreciate how soggy it was. Free wi-fi and good service also a plus although a few misses like the waiter bringing the bill without asking if we wanted dessert. So overall a good experience but room for improvement."], ["William H.", "Visited LPG recently, and was not impressed. Their pizzas were supposed to be good, and I felt that they definately fell short of that. Also the menu had a small icon to reveal a \"LPG specialty\" Apparently the only 2 specialties were the horseshoe and some bluberry cobbler thing. Would only revisit if someone else was paying."], ["Jeremy W.", "Their pizzas are great! Haven't ever ordered anything else.  Service is also pretty good."], ["A A.", "A nice addition to South Springfield/borderline Chatham scene, which until recently seemed a little short on restaurants serving real (ie. not Taco Bell/Burger King/Subway/Wendy's) food. Capacious and airy interior, with enormous floor-to-ceiling windows that fill the restaurant with ample natural light. Noteworthy: the wood fired pizzas. I had the Steak and Crimini Mushroom, which was giant, unique--a nice spin on the typical meat/mushroom pizza--and mouth-wateringly delicious. My only complaint was that the juices from the pizza gathered near the hollow center of the plate,  soaking though the dough and causing the last few pieces to become soggy. Still, a good experience overall. Granted, I've had better outside of the city, but I would venture to say that this is the best pizza I've had in Springfield. I'd definitely recommend it if you're in the area."], ["Eric S.", "LPG is relatively new in SPI; on my recent trip there LPG was highly recommended. LPG is located in a strip mall, next to El Presidente Burrito, in South Springfield. Inside it is very open, with wall to ceiling windows with plenty of seating. We arrived at around 5pm and the place was getting packed. Since they have a wood burning pizza oven, we decided to give them a try. I started off with a small house salad, which was good, the highlights being the croutons and the red wine basil vinaigrette both which were really tasty. On to the pizzas- the menu claims that they are best enjoyed individually or as an appetizer between two people, so we ordered one pizza per person. Imagining that we would be served small sized pizzas, we were shocked at the pizzas that made it to our table. They had to be at least 12-14\" long and were more like a meal for two people, not appetizers (maybe Midwesterners have bigger appeties?). We ordered the margherita, artichoke tomato and a \"build your own\" of red pepper, mushroom and spinach. The favorites were the margherita and the artichoke tomato pizzas; they were both really good. Of note though, the pizzas were slightly different than any other pizza that I've had from a wood oven- the black char and bubbling was missing; the dough was a little thicker than I'd prefer. The wine list was fair with relatively affordable prices; service was amateurish but not horrible. Compared to other pizzas I've sampled, and trust me Phoenix has some phenomenal pizza, LPG was decent and I'd 3 out of 5 considering it's in SPI."], ["Vu N.", "I love this place!  I wish it was opened earlier when I first got to grad school.  Great Italian American food.  Their pizzas are seriously the best I've had in a long time. Good service, easy parking and close to the University of Illinois at Springfield campus."], ["Ted C.", "I have to say the newer openings with Springfield, it can be hit or miss. Lake Pointe Grill falls somewhere in between. I walked in at around 4 and the place was empty and no one was at the hostess station. I thought they might have been closed but I heard people talking over at the bar area and peeked over, there were two staff members one eating at the end of the bar and the bartender. I decided to sit at the bar and eat. The soup of the day, Chicken florentine was quite good, chicken, artichokes, and spinach in a cream based broth. Excellence in a small cup, the marinated grilled pork chops, eh okay for 13.95-kinda pricey for Springfield. I've had better for a few bucks more but really, no complaints. Their beer selection is fairly large but all bottles, nothing on tap, it makes me wonder why. Also, they need to work out some kinks, the staff was definitely a bit amateurish, but it was quiet and I'd imagine some hijinks, just not at that level. Hard for me to take them seriously at this point in time, maybe with some polishing up it can be a place that will be good, perhaps even great."]], "Papa Frank's": [], "Mangia Pasta Steak Seafood": [], "Joe Gallina's": [], "Joe's Italian Pizza": [["Bethany S.", "Our family's favorite local pizza. Great crust, super cheesy - just know that it's closed on Mondays & tends to be busy - so call in your order early!Their other menu options are decent, but the pizza is the main attraction."], ["matteo h.", "My love of this pizza is well known to those in certain circles. My personal fav in this town where thin crust rules. Cant get in to Joes? Head over to Gabitonis. you'll thank me,You can get in to Joes?? Sit down and get ready. Let me lay it out for you. This place is bare bones. One TV in the corner and theres probably a Cub game on. No booze. Let me repeat . No booze.This isnt about you and your cool friends having craft beers and cracking wise about the other customers. talking about all the fantastic stuff you do on  a regular basis.  Let that go. Stop being a tool and try to get your head around this pizza.Order a large thin crust. Thin is only available in large and thats what you want. thin. If you can't handle the fact that you may have to take some home then hit the salad bar at Ruby Tuesdays.Large thin , I recommend the Joes special. Because , well it is special. There is enough cheese on there for two pizzas and its hard to stop eating it. It really is that good. great sausage , great sauce and lots o cheese.I've heard the other items on the menu are great too. Just can't bring myself to stray from that pizza..Closed on Mondays.One more time.Great pizza"], ["Megan M.", "Best pizza. Great crust, excellent cheese and toppings. This is a great treat. if only they delivered ..."]], "Palermo's Sicilian Cucina": [["Joe D.", "I love this place because it is a true Italian experience. Unlike that chain Italian restaurant that shall remain unnamed, this place is fantastic. The inside is reminiscent of an Italian villa. It's not huge, but that's what makes it special. Appropriate dining music and good wait staff helps to complete the experience. The food is excellent, but if your not use to this type of menu, you may be caught off guard. It's not a traditional pick an entree. You get to pick your type of pasta, sauce and toppings( such as chicken, mushrooms etc...). I find this to be superior to other restaurants because it gives you more options. This is real Italian flavor, too. Not some mass produced chain food. Price is medium. It's not cheap, however, it's not over priced either. $12-15 for an entree. You get a good amount of food and a large piece of focaccia bread with it. Come here if you want a nice romantic evening and pleasant atmosphere."], ["David N.", "This place is very good the Palermo salad was excellent very large portion of lasagna was good did not have cheese in it strictly a meat sauce but still was good I had the rigatoni with the arbiter auto sauce was very good The mozzarella sticks were excellent service was very good"], ["Ben S.", "Always great service.  Family-run (which is a rarity in this town) and that is a big plus for me.Food has been great each time we've visited.  They introduced my daughter to a misto sauce which she asks for at other places and it befuddles most servers.  Good family atmosphere although the deserts are more niche than most kids usually like.  My favorite is the one which involves a stuffed pastry, caramelized crust, and an amaretto cream."], ["Jason G.", "Great pizza and polite service, I think they have a pizza and movie night which is a unique offering."], ["Rebecca F.", "Went last night for the first time after cruising by the Olive Garden to see people standing and waiting as usual.  Small place, all tables, quaint, was obviously some other restaurant prior to this.  The food was much better than Olive Garden!  Menu- you have choices of type of pasta, sauce, toppings kind of a 'you build it' pasta bowl served with a big hunk of bread (which was great).  Cannoli was small but tasty.  Service was very friendly."], ["Patricia H.", "I did like the ambiance and friendliness of those that worked here.  The pizza ordered was just alright.  I went there a second time and ordered a salad, only to find that the mushrooms had come from a can and were slimy."]], "III Tomassos Italian Bistro": [], "Pizza Hut": [], "Mariah's Restaurant": [], "Bella Milano": [], "Luca Pizza": [["Joel A.", "Great pizza. If you order 3 toppings you might as well load it up with more. Additional toppings are free. The extra garlic was wonderful. Great service and friendly."], ["Jon D.", "Our usual favorite ratting doors are closed in Sundays so we tried Lucca for a change.  We have to add this place to our list of faves!  We started off with the spaghetti and meatballs and migrated to the pizza.   Outstanding on both!  Friendly staff too.  Oh, and is open on Sunday!"], ["Geneva L.", "I have many fond memories of this place from when they were at the mall and their new location. They have some of the best pizza and the slices are bigger than the plate! When they were in the mall you would have to stand and eat or walk because the place would be so full and not enough seats in the little place. The best move they ever made was getting a little resturant with more seats!! I remember my mom being at jenny craigs saturday afternoon and my sister going over and getting pizza in their new location it was such a treat. Everytime I come back to Springfield this is one of my must stop places. I have noticed year after year the qualtiy and service has not chaged a bit! Kudo's to you Luca's Pizza!!"], ["DieBullen ..", "We ordered a pizza to be delivered to a local hotel. They were fast and the delivery guy was great, very friendly. The pizza was delicious...gooey with perfect thin crust. The sauce was sweet and exactly what we wanted. I wouldn't hesitate to order from them again."], ["Michael A.", "A great local pizzeria to take someone from out of town, before going to the movies or just satisfying the crave for a tasty pizza. The crust and sauce is what makes a good pizza and they have done a good job."], ["Norm S.", "Absolute garbage!  Pick up a pizza half cooked and terrible cheese and crust.  This was the only decent NY style pizza in Springfield until the original owners sold out.  New owners don't know a pizza from a hamburger. Don't waste your money.  I'm disgusted."], ["Noelle B.", "Luca is good stuff! It's as close to NY style pizza as Springfield can get. Pretty inexpensive too in comparison to other places in town."], ["Bill P.", "Been eating this pizza for at least 20 years.  Whenever I come back to town I always get a slice or two.  True New York style pizza.  Best deal in town for awesome tasting quality food."], ["Ron L.", "Best pizza delivery on the NW side of springfield that I've found."], ["Holly L.", "Went here based on Yelp 'nearby' search and weren't expecting much since we are from the Chicago area and have some of the best pizza places in the country nearby! We were so pleasantly surprised! Had an 18 inch pepperoni pie with extra cheese, it was excellent!! While we stood in line to order (I would recommend phoning in your order ahead of time on Friday as it was quite busy) my husband said, 'it will probably be wonder bread with sauce and cheese!' No way, the crust was excellent, had plenty of cheese and the pepperoni was tasty (but a bit greasy!).Salad was simple, but plentiful and homemade italian dressing was good.A few downsides; They don't really have the customer in mind that are eating in... We split a large salad and had to ask for plates and were given the 'small' pizza pans that were really huge. We didn't like was that the pizza was too large to keep on the table with 3 plates. I guess not that many people must 'eat in'... They might rethink that strategy, maybe get those pedestals or something that the pizza can sit on while you eat. Also didn't really like fact that we had to bus our own table between salad and pizza otherwise there would have been no room at all. Even with all that, I would still go back, maybe more often carry out than eat in but seeing as we are from out of town, that was our best choice.We would definitely recommend this place!"], ["Jennifer D.", "Found this place on Yelp. It's in a strip mall and not much to look at, but don't let that stop you. The pizza is excellent! The crust, sauce, cheese, and toppings are all just right. My husband had the chef salad and said it was great, he especially liked the salami in it. They even served bottled beer, so that's a nice bonus."], ["Jason L.", "I moved away from Springfield about two years ago and I miss this place tremendously. The atmosphere good and the pizza is amazing. If you are in Springfield and want to try good pizza; you have to visit this place. Oh and the garlic cheese bread is to die for."], ["Beth L.", "I'm so glad they put a Luca pizza on the northend! I love love love their pizza. Their Stromboli is also very delicious. I like that you can get a slice or a whole pie."], ["Charles V.", "I ordered pizza from here at 8:52 PM and we had to call back twice to ask when the delivery driver would be here. He finally showed up at 10:19 PM. Needless to say I wouldn't pay for the order and he wouldn't give it to us for free since we had to wait so long. This is the 2nd time this happened this month from this pizza place. The first time I figured it was bad luck but now I know it's just how this place operates. I will gladly eat in, but I will never order delivery from there again."], ["Pranay N.", "We were quite surprised to see an option to add your own toppings for pizza by the slice, turns out they just throw the toppings on the cooked pizza. Either ways, the pizza was quite good and the prices are reasonable. Great lunch place!"], ["Brianne G.", "One of my top three pizza places, anywhere. Priced the way pizza used to be priced before the reign of the chain and their $5-$10 pizzas, but absolutely worth it.You can tell the crust is made from scratch, and the sauce is sweet and tangy. Also, CHEEEEESSSEEE. Yum. So greasy, but in a good way. Skip the chain, order some Luca's."], ["Warren W.", "Best delivery/take-out pizza in town, and is in the running for best Pizza in town."], ["Katie L.", "Fantastic pizza and something for the whole family.  The guys behind the counter treated us like we were regulars even though it was our first time. Helpful suggestions and ideas paired with friendly smiles made it worth the drive off the highway. If we were staying in the area we would definitely come back!!"], ["Ben S.", "Certainly the best NY style pizza in Springfield!  Love the fact that we can get an 18\" divided into quarters so everyone in the family gets what they want on their portion."], ["Elizabeth K.", "We were visiting Springfield for the night and needed a place that was good and fast so we could get the kids to bed at a decent hour. This place was fantastic. It's nothing to look at, but the pizza was terrific and it was super quick. My kids loved it and the staff could not have been nicer or friendlier. This is a gem in Springfield. Our family can't wait to go back!"]]}