{"Howard Wang's China Grill": [], "China Bowl": [], "Howard Wang's Uptown": [["Elise w.", "Everything was great. The sesame chicken is nice juicy chunks of chicken with just the right amount of sauce. None of that all breading no meat crap you get at cheaper Chinese places.Their shrimp toast is different than the usual. It's shrimp stuffed toast instead of toast with a shrimp spread.Me and three other people ordered delivery and everyone was happy with their food. They aren't trying to fill you up on rice either. None of us ordered rice and our entrees were more than enough. If you're looking for high quality Chinese delivery, here it is."], ["Melinda I.", "So, so, so disgusting.  We ordered several things and they were absolutely inedible.  Omg this place is gross."], ["Cassidy C.", "Last night for Valentine's Day my boyfriend and I went to dinner at Howard Wangs. Our server, Corey was fantastic. Unfortunately the food was very bland. I have been here before and have had a good experience but this time I was disappointed. He got salmon and it was particularly burned, the grill marks were black and you could taste the char. I got the yellow curry and it had little to no flavor and was not satisfying at all. ( I guess that's what we get for going to a Chinese restaurant and not getting Chinese food )"], ["Kelly M.", "Delicious Asian dining with an excellent wait staff. Highly reccommend."], ["Leah D.", "Went here on my sister's birthday a month ago. Best meal I have had in a long time. We thought we had ordered too much food but we finished it all. We had a great waitress she was very attentive and sweet. I will definitely go back!"], ["Valerie J.", "Best quality Chinese food in town. Order delivery with friends and watch a sex in the city episode!"], ["Katie E.", "We came to dinner here a few days ago with some friends in from out of town and my newborn twins.. David, our server, took absolutely awesome care of us, and besides recommending an awesome bottle of wine, also informed us that Thursday is half price bottle of wine night!  Delicious food, great service, and overall wonderful ambience. Will definitely be back soon!!"], ["Krystal R.", "Howard Wang's quickly just joined my list of favorite china bistro's...after 1 visit. The Mister and I had drinks, he had beer and I had the ginger mint mojito. My drink was nice, it was more ginger than mint which was alright with me! We started out with spicy edemame and steamed potstickers. The edemame was great but they basically just threw powdered spices on the top of the pile (to make them spicy) so unless you're down to mix up the bowl to really get the spices spread out, I would stick to just regular edemame. Can't complain too much since the edemame was free with my Yelp checkin, so it was still a win in my book. The potstickers though? THEY WERE SO MEATY!!! These were the MEATIEST potstickers I've ever had. They were just DELIGHTFUL! Not soggy nor over-crisp on the panned side. Everything on the menu sounded great and I couldn't figure out what I wanted which is usually a great sign. Our server was nice and suggested the lo mein. Figured it was a safe bet even though I usually don't go that basic. I got the chicken and pork lo mein and it was wonderful! The noodles were perfectly cooked (not slimy, not overdone) and the meats and veggies were cut in pretty big pieces which I like as it's easier on your chopsticks. The veggies were crisp and the flavor was fresh. Chinese food can sometimes have an odd, lingering, smell or flavor but none of that was happenin. The Mister got the Mandarin sweet and sour chicken and shrimp. The meats and veggies were awesomely cut with the veggies being crisp just like my meal but the FRUITS TOOK THE CAKE! Not only was there pineapple but there was mango and dare I say it....lychee....yes folks...there was lychee....add the sweet and sour sauce and the fact that it had JUST the right batter to meat ratio on the crust and this dish was the perfect sweet and sour. For dessert we had the fried vanilla. It was GREEEAAAT. A ball of vanilla ice cream fried with a light batter. The outside isn't really sweet but it's nice. A big drizzle of chocolate on the outside. It's enough for 3 people to have a good taste. So if you can handle a dessert, it's worth a try. Given everything tasted really light and fresh so nothing seemed too processed. Great decor and vibe inside the restaurant. Overall, I really enjoyed it and I'll be back for sure!"], ["Kat D.", "What an awesome dining experience!  Loved the food, but had great service by DAVID (who is actually new there).   I've become a regular since December...recently moving to Dallas.  Prior to my recent lunch visit, I felt it wasn't memorable...food tasty...but service experience was not memorable.   DAVID, however, and the GM during the shift last  Friday midday made it a visit to remember.  With a visiting cousin from Florida, they were helpful also in giving ideas for things to and places to go while in Dallas.  THE MUSIC IS ALWAYS PERFECT in this place - clean - tasty - ....you know you're in a good place when the SOUP is memorable.   GO.  I promise you will not be disappointed!"], ["Elisa T.", "The food is good but most of the time I do delivery and they are always missing items or sauce. It's ridiculous"], ["Robert Z.", "Just another chinese place. Won't blow you away but it will satisfy your chinese need.  A little expensive but it is uptown.    Nothing jumped off the menu."], ["Nazia H.", "This place was so-so, but we did have good service so that's where the 3 stars are coming from. The food itself was a little lackluster and did not deliver a punch in flavor that I want in Chinese food. Quality was good though (not overly greasy or MSG-laden). Prices are high for what you're getting. I came here with a group of people who chose the restaurant, but I likely won't come again."], ["Roddy S.", "Had the veggie dish, was really good. Clean veggies and good tofu. Edamame were ehhh. Wife had a pork dish and she gave it a thumbs up. Great service and clean place."], ["Thomas J.", "I would eat at HW's every week if my work & school life weren't so hectic!  The reverse happy hour has some amazing food & drink specials (I tend to belly up to the bar and take up 3 spaces with all the food I order), some of the BEST Hot & Sour soup (I usually take a bowl to go with me each time I'm there), and very accommodating every time we plan a group dinner.  Last time I was there, Howard himself chatted with me and my dining companion at the bar and bought us a round of drinks.  The friendliness streams down from the owner, to the management, and the FOH staff.  Being in the industry, you can easily recognize when someone truly cares about your dining experience and when they just want your tip and for you to leave them alone.Great upscale Chinese & Korean dishes (The Bulgogi is amazing... second only to what I make, of course!), great prices, and a friendly & outgoing staff.  Never disappointed!"], ["Jennifer G.", "Shame on you Howard Wang's for trying to force me into a useless valet service... I was so annoyed that I actually went and ate somewhere else - which is shame because I really wanted your pork lo mein.If you've been here you know there is a garage in this building you can park in - we pulled into the garage where we've always parked before and there were valets standing literally AT THE spot where I normally park my car wanting me to hand over my keys so that I'd then feel obligated to tip them - they gave me the \"its complimentary valet\"  - call me cheap but I see NO POINT whatsoever in having a valet take my car and park it FOR ME from the spot that I'd normally park it myself. Absolute nonsense. I could see if they were at the entrance to the garage and saving me a few steps (still absurd and ridiculous still, but at least you'd be giving the appearance of making my life easier), but this was not the case. I was 3 feet from the spot I have parked in myself the last 3 times I've visited this place for Saturday brunch."], ["Heli M.", "Duck Pad Thai at Howard Wangs? I think I just might. Sound's expensive? Nope. Sounds delicious? Yep.Best part? They deliver. Quite surprising considering this is a bit shnazzier than your average neighborhood takeout joint. Can't speak on the ambiance or service, as I take advantage of the delivery option every time. Another great dish to try: Sweet and Sour with your choice of shrimp, beef, chicken, etc. Or how about the General Tsos Chicken? Yea, I know it's a common choice but you'll notice the difference between this version and your average Chinese takeout. Fresher ingredients and wider selections of rices and healthier sides."], ["Jaime G.", "I've lived in Uptown for three years and never tried this place until last night. While the seemed a bit empty for a Thursday evening, I really loved this restaurant.We had great service all night. The menu has a really large selection, and for someone like me who is not a big Chinese food expert, having the waiter point out a few things was nice. The shrimp toast was my favorite. All of the other dishes were very ood.The ginger mojito was also excellent. Overall, I'd definitely go back here!"], ["Rad-eek-I O.", "Best Chinese food in dallas! I have had 15 different items off their menu. You won't hear me talk about food like this so hear me now when I say, Best general tso chicken EVER!!!  One of the few restaurants I would like to franchise! Please come to Frisco!!!"], ["Lamont G.", "extremely overpriced appetizers. 5-6 potstickers for 8 bucks? They could have at least tried to spice them up insteaf just grabbing them from a frozen bag and panfrying. The beef sizzling plate was a letdown, unflavorful and the slices of beef were too thick.imo, If I wanted to eat steak or chewy beef I'd go to a steakhouse haha.  The egg foo young was the only saving grace though, it had great flavor a good portion size and they didn't skimp on the sauce. bathroom sink design looks pretty baller too, nice find whoever picked that out."], ["Debleena D.", "Food- good and tastyPortions- bigger than usualService-excellent!!! We walking in ten minutes before closing time and they did not turn us away even though we were a party of 6. They did not hurry us and served fresh food ."]], "Bistro B": [], "Royal Wok Chinese Restaurant": [], "Lai Lai Chinese Restaurant": [], "New China Town": [], "Chef Wang": [], "Royal China": [], "Asia Wok Restaurant": [], "Betty's Best Around": [["Christine L.", "It's not just a name, it's the truth! Betty's is the reason I LOVE Dallas night life! Open until the early morning hours and the best part.... THEY DELIVER until the early morning hours. This is my FAVORITE spot! Highly recommended!!!"], ["Renee E.", "Let me start off this review by saying this is the first EVER negative review I have posted on yelp. Having worked in the customer service industry for most of my life, I usually take a situation that doesn't go quite right and chalk it up to a bad night or bad circumstances; however in this case I could not just let it go. The reason I am compelled to write this review simply boils down to customer service and expecting the same level which I have delivered on many different occasions. So on Sunday of this Labor Day weekend 2015 we placed an order for delivery while visiting a friend of ours. We had placed orders in the past with Betty's Best and had great experiences so thought nothing of ordering as well as recommending this place as we have to friends many times before. On this night however, after placing our order at 10:23 PM, when an hour past and we hadn't received our order in the time promised, we called to locate it.  From this point on, over the course of several calls, we were told several times it would be delivering shortly (which was never the case), I was hung up on 3 times, told I was being unreasonable, at one point I was handed off to a customer to I guess convince me we were being unreasonable?, was at one point asked \"who else can you call for delivery food at this time?\" (See below for other options), asked if I just wanted to cancel my order, and finally told I should live in a better area for their delivery.  When we finally got the food......over 2 hours after initially ordering it.....I not only got better customer service and understanding from their delivery person, but it was at that point I learned that the person I had been talking to for over an hour was the OWNER, John! I am sorry, but where is your pride? And why not acknowledge that earlier when we asked to speak to a manager or owner?  After tipping their delivery person 20% of the total amount of the bill and not penalize them for John's rudeness, I called back to inform John I would not be signing the receipt for the charge given our interactions over the past hour. He finally and reluctantly told me our charge would be refunded, but still showed no remorse for his behavior or apologized for ANY of the interactions that had transpired.Let me say this, as I told John on our final interaction on the phone, this entire situation could have been made right by simply delivering ANY customer service. When you are short staffed and overloaded on a busy holiday weekend, simply tell people that up front. I have dealt with many establishments that do that and it works quite well. If you make a mistake on quoting a time when you can fulfill an order, simply apologize and people will generally understand, BUT under no circumstances should you EVER hang up on a customer.  John didn't deliver any customer service though. Instead he resorted to defensiveness, blame and excuses.......and at the final interaction when I told him I had hopes he would at some point adjust his behavior so I didn't feel the need to write this review......I got indifference.It is sad because they really do make quite good food, but the level of customer service that their owner delivered is inexcusable and not worth ones time.So in response to John's question on who else you can call for late night food I say this.........for pizza try Greenville Ave pizza Co. and for Asian Cuisine try Sunrise Asian Cuisine. This business is not the only late night game in town and certainly isn't worth the rudeness you may receive for an order you could have made yourself in the same amount or less time. Save yourself the grief in dealing with John, who clearly doesn't care to maintain any customer relationships."], ["Kaia V.", "Why don't the chinese places near me velvet their chicken!? I've had it up to here with this non-velveted regular chicken. It's not tender. It's not sliced thinly. It's just not right. Otherwise, food is a-ok. Fresh broccoli in the chicken with broccoli, and the egg foo young was pretty good though a different take than how New Big Wong used to serve it up. Delivery is reasonably fast (within the hour)."], ["Sara R.", "Beware of their delivery personal, one of their drivers yelled at me because he was giving the wrong apartment number and building number. I should have refused the food after waiting 45 mins and paying $30, but I was hunger and it was too late to order take out from another place. I used to like Betty's Best Around.  I guess it's time for me to found another Chinese take out."], ["Jen D.", "They delivered my food in less than 30 minutes! The General Chicken is delicious. I will definitely order from here again."], ["Richard H.", "Little hard to give this place 2 stars. Betty's Best Around is mainly a Chinese take out restaurant with only three dine in tables. The late hours and delivery really keeps this place going.Our group ordered the Orange Chicken, Schezuan Beef, and Best Around Beef. The chicken dish was not bad, but there was almost no beef in the other two dishes. The lack of meat in dishes seem to be a pretty common problem, but it isn't a hard fix. However, because of this problem, I think the dishes are too pricey."], ["Stephanie H.", "Tasty food and quick delivery!"], ["Kelly L.", "Everything we've ever ordered has been delivered fast and hot. I've tried a different dish each time and ALL of them have been great. After being disappointed by several other Chinese delivery places I'm glad we finally tried Betty's."], ["James R.", "A bit overpriced for a take out place and the broccoli is not cooked. Not really worth it."], ["Darian S.", "Betty's is awesome! Fast delivery, everyone that works there seems to be nice, delicious food, open really late!"], ["Olutomi O.", "This time its the bean curd family style. Betty's just knows how to do it right, plus the late nite hours and delivery!!"], ["Chad M.", "This was a time we expected hipster chic.  It seemed Art Deco from the front and we had high expectations.  Well we could not have been more wrong.  No hipsters and no chic.  It is mainly a Chinese take out place.  We gathered that by the 3 tables that they had, the surprised look when we decided to \"dine in\" and the fact that they served us on paper plates.  Food wise it is basic Chinese.  Better than fast good Chinese but not high end.  I had chicken curry with a good sauce but very little chicken.  The Mongolian beef was the same...where is the beef?  For take out we may go back.  Not sure yet!"], ["Jessica H.", "I randomly found this place on yelp and ordered delivery. The ordering process was easy and my food came right on time. I ordered the beef and broccoli with to vegetable egg rolls. The food tasted good and not like some of those other questionable Chinese places. All around I would definitely revisit Betty's next time I have a Saturday night Chinese craving"], ["Olivia Y.", "As far as Chinese delivery goes, this is one of the better places around. The crab rangoons are crispy with a good pastry to cream cheese ratio. The orange chicken had the right amount of heat and flavor. The sesame chicken was also good, and the portion sizes are great for what you spend. Delivery was prompt and I'll order from here again."], ["Steven S.", "This is some of the best delivery I have had. I looked and tried many others before finding this place. Good flavors and cuts of chicken. Also, they always deliver pretty fast even on the weekends. Other negative reviews forget that this is a Chinese delivery place when they rant so harshly. If you read this,  it is definitely worth trying to see if you like it."], ["Jennifer C.", "Mehhh thank you for trying, please try again. This is under another miss in my quest for Chinese food. I think I need to venture north. I had the chicken wings and chicken friend rice. It was ok, not bad juts ok."], ["Kara P.", "This was by far the best takeout I have ever had. Seriously. I got orange chicken and fried rice. The chicken is all white meat, there are no nasty chewy bits, and the flavor is a perfect blend of spicy, tangy, savory and sweet. The fried rice is plain- no veggies- but still pretty darn good. My fiancé got the chicken lo mein, crab rangoons, and vegetable spring rolls. I stole a few bites of the lo mein and it was awesome. He said the other stuff was way, way above average too.Over all, the place is awesome and totally worth the drive downtown. They also deliver and have late hours. We'll definitely order again."], ["Amanda C.", "Ordered a few different items: sesame tofu, chicken/broccoli, & curry shrimp.Sesame tofu showed up as sesame chicken and the chicken/broc was so salty it was inedible.Overall, I wouldn't recommend."], ["Kaitlyn S.", "Betty's the shit. Especially late at night when you're drunk or.... ya know. Super fast, too! Get the orange chicken. Don't ask questions, just do it! ;)"], ["Paul P.", "Not sure what's changed but whatever it was, it was for the good. My wife and I ordered last night and on top of the order being better than I remembered the last few times, the delivery driver went above and beyond. I live in a complex that can sometimes be difficult to enter, but the driver continued to try till he got a hold of us. Bravo."]], "Ming Place China Bistro": [["Robby W.", "I'm biased because I work here, but I only work where the food is good. This is truly the best Chinese food I have had. We use quality meats and fresh vegetables. It's family owned and operated, so we will do our best to give you a good experience. P.S.If it is busy and I forget your soup, let me know so I can make it right!"], ["Bobby L.", "I really wanted some good Chinese food. Food that was more Chinese than Panda and cleaner than your run of the mill Chinese places in the area. That's when I came across Ming Place. I've passed by on many occasions when making pit stops at the Starbucks next door. There always seemed to be people waiting outside. A quick Yelp research revealed that I should give it a try.I can't remember what I exactly had. I know I had a shrimp dish, a chicken dish, and eggplant. I tend to have a good memory so that may be a testament to the a-ok nature of the food. The food definitely seemed a bit cleaner than some other places around and was good. The staff was nice and attentive. Not much to complain about at this place.For generic Chinese food, this may be one of your better places in the area."], ["Jennifer C.", "Mehhh, just like the caption says. I have had better and will continue to find the ONE when it comes to chines food. Very clean and nice establishment and the staff was very friendly. I ordered orange chicken and crab wontons. The food was just ok, I probably won't go back unless I am really desperate."], ["Carla L.", "After spending 10 mintues attempting to place my order on line with no luck, I contacted the restaurant to place order for delivery. Website clearly states \"Delivery\" or \"Pickup\"... woman who answered the phone informs me they do not have delivery. That would have been nice to know before I wasted half my lunch on outdated information."], ["Michael W.", "I like this place. I've been several times now and I really haven't ordered anything that hasn't been fantastic. I think the best that I had was the lemon chicken, but the general tso's was good too (although it could use a little more broccoli). Wait staff is friendly and quick and will split a check 8 times without complaining. Appreciate the free edamame too!"], ["Emily A.", "After reading reviews on this place we decided to check it out cause it was in the area, and boy are we glad we did!! We started off with hot and sour soup which came out at the perfect temperature & the taste was awesome, I could have finished a whole bowl I think.. Then we ordered the dinner portion of orange peel chicken and added veggies for a $1.50 . This was by far the best orange peel we've EVER had, it was really hot and fresh when it came out and the breading around the chicken was crispy and the sauce was so delicious. It was the perfect portion to split too! We will definitely be coming back here when we're in the area, soooo good!"], ["Courtney S.", "Robert S., we ordered delivery through Grub Hub so they do deliver via delivery companies."], ["Dallas G.", "I would give this restaurant 4 stars for the food, but other factors lead me to give it 3.We ate there when it was cold and windy outside.  There is no separation between the entry door and the tables.  So when the door is opened, a rush of cold air comes into the restaurant , cooling me and my hot food instantly.Our waiter was appalling .  He rushed us with our order, spilled hot tea on me and then had the nerve to charge $2 extra for an extra bowl of rice.  This rice cost the restaurant roughly 3 cents.  He appeared to be on drugs and I complained to the owner.  So beware if he is still employed there.  He is the only non-Asian employee.    The food, especially the chicken wings and egg foo young are good so I highly recommend takeout."], ["Anthony B.", "This place gets pretty crowded. It seems the waitstaff can't handle it.The Food:Not bad for generic chinese food. You get decent portions for lunch. It does take awhile to get your food however, due to the large crowd.  At least the food is pretty good, it'd be pretty depressing to wait a long time for crap, so, that's a plus.The Service:Pretty bad. They rarely come by to see if you need anything. They always seem to be in a state of chaos, its pretty funny actually.Don't come here if you need a quick lunch, they make you wait it out."], ["Brandon S.", "This is a great Chinese food restaurant!!  The quality and taste are superior. It truly is authentic mandarin flavor. I would highly recommend this food."], ["Dino Paul T.", "I dint know how else to say this, but great food second time here and the impression is as good as it was the first time around, not sure your preference in Chinese food but whatever it is, I'm sure they will satisfy your fill so I give it a 5 for atmosphere and service."], ["Bill R.", "Very good local family place. Like the salt and pepper shrimp and Lemmon Abe chicken. Service is good enought not fancy but a good meal anytime we have so very few Chinese food places in Dallas this will have to do"], ["Andrea G.", "Fantastic lettuce wraps-very flavorful. Ordered the \"Lemmon\" chicken--OMG Rock & Roll!! Wait staff super friendly. Will def be back!"], ["Carl B.", "Well, ever since August Moon closed which used to be on Preston Rd, I've had a hard time finding a really good Chinese restaurant.  My litmus test for them is their orange chicken.  Ming's doesn't stand up to that challenge.  Their is not enough orange peel in it to give it that orange flavor, nor is it spicy.  Unfortunately, a lot of Chinese restaurants seem to use the same sauce no matter what you order.  The hot and sour soup is very good and their fried rice is light and flavorful.  This is still about the best that I've found around the Oak Lawn area though it seems a bit overpriced - $12.00 for orange chicken and it only comes with the rice.  Some other places include the soup and a egg roll."], ["kay w.", "Right off of 35 and inwood.....Wow, this place in a gem in the rough. Small amount of parking though.Walked in, immediately seated and asked whether to go or eat in.After declared to go, received menu and about 5 minutes to browse the menu.They were super busy and there was definitely packed traffic going in the opposite direction towards Highland Park.Ordered honey sesame chicken and fried chicken wings.Now let me break this down: the honey sesame chicken with $2.50 side of lo mein noodles; the lo mein - just sauced and oiled enough. The honey sesame chicken, just glazed enough with a smooth flavor. Mixes perfectly with the lo mein noodles.The fried chicken-- OMG! Now please understand that I can fry chicken and in my family so can generations that taught me, but here? Perfect crisp, not too salty, great flavor, hint of garlic......everything you need for a great piece of fried chicken.All of this for 23.00......will be back, they have stepped their game up!"], ["Tracey S.", "I have been here twice and I don't have anything bad to say. The food is wonderful and the service is excellent. The restaurant is extremely clean as well as the restrooms. It's hard to find a place like this and will defiantly stop here every time we are in town."], ["Rosy H.", "I really like this place. That should be good enough. But it's not going to be, because you're a thorough researcher dedicated to your exploration for food.So what's great about this place? The service, for one. My friend and I ordered hot and sour soups, and they brought us complimentary edamame. The waitress was always great about asking us if we needed anything, and I heard her giving a patient, thorough run down on the dishes to an indecisive couple.The food is also great, and full of flavor. I loved my Mongolian beef on its bed of fried rice, and I had a crap ton of left over beef pieces by the time I got full--they are not skimpy!I also liked the atmosphere--midway between a cafe and a restaurant, you feel comfortable to chat up your friend, but not so intimidated that you can't talk about that awful thing Cindy did last week at work."], ["Brandy L.", "They have the best egg rolls and honey chicken with brown rice on the planet! Very nice and always smiling there. Super fast service too! Right on the corner of Inwood and Lemmon"], ["Daniel A.", "Fantastic place to eat. Food was delicious and service was top notch. We are visiting from El Paso and were craving some Chinese food. Thanks to the reviews on yelp, we decided to try this gem and are we ever glad we did. The general chicken had just the right kick and excellent flavor. The chicken lo mien was on point and generous. We will be back on our next trip to Dallas!"], ["Diego S.", "Ever hear that saying that a first impression is finalized within the first 7 seconds?  Well, I can say, after visiting Ming Place on the evening of 11/21, I believe that wholeheartedly.Before I get to the food, Ming Place, you just gotta understand that your waitstaff is what can make or break your reputation.  The night I visited, it was dead with just two tables.  The spiky haired guy who took me to my table and ended up being my waiter was just awful.  Zero attempt at being courteous, no eye contact, mumbled a few words that didn't make it into a complete sentence...and that was just in the first few seconds of my first visit.  Know where I'm going with this?When I inquired about whether the fried rice had egg, instead of just politely telling me yes it does, he said \"We make it in a big pot so if you don't want it, get steamed rice.\"  Um, OK.  Thank you?  At this point, he clearly did not want to be working that night and I almost just walked out.  But, decided to see what else could go wrong.I ordered the Kung Pao chicken and asked the waiter No peanuts.  He never looked at me while taking my order and was more interested in what was outside in the parking lot.  He just said OK and walked off.  Guess what my plate was full of? Ding Ding!I also ordered hot and sour soup which was OK.  More egg drop tasting than anything.  I didn't feel like possibly having my Kung Pao spit on by said waiter so didn't say another word.  Just picked out the peanuts and tried to eat as fast as I could to get the hell out of there.  The dish ended up being unmemorable and void of any flavor.  White meat chicken was used so that is a plus.  It was hot so that was good too,  I guess.On a positive (?) note, he did treat the other customers in the same crappy way during my visit.  So, it wasn't just me possibly reacting to his d*ck attitude with my own d*ck attitude.I am blown away at other reviewer's experiences.  Could it have been an off night for this guy?  Maybe...but when you are in the service industry, there is no such thing as an off night.  I get it, I work in the service world.  Sometimes, you just don't want to work and deal with people.  But, you know what?  You suck it up and do a great job regardless. Otherwise, get another job that allows you to put in your worst effort."], ["Chris H.", "Excellent service and great Chinese food! I recommend orange chicken or jalapeño chicken with fried rice. Their hot and sour is the best in Dallas! Mongolian beef was not so good and no delivery. Overall quick Chinese food is worth it."], ["Steven S.", "Atmosphere is ok, but the service and food were outstanding.  You can pay far more and get far less. We would most definitely come back!"], ["Walt M.", "This place is fast clean and friendly. I got the seafood wok. It is almost $22 and one of the most expensive things on the menu but it is a giant plate of shrimp fish scallops mushrooms and vegetables. Very good"], ["Kerry D.", "In town for work and needed to kill time before check-in time at hotel. This place was close and looked decent. It was decent, but that's about it. Spring rolls were flavorful, but greasy. Beef flat noodles were just ok - I've made better at home and I'm not Asian. Small servings and overpriced. Service however was awesome!"], ["Jody G.", "Unfortunately, first impressions are everything and Ming Place blew it. First of all, the dinner prices definitely do not match the ambiance. After a clearly frazzled employee seated us, we ordered iced teas and looked over the menu. Our waitress was extremely distracted and obviously 100% focused (for whatever reason) on another couple on the other side of the restaurant. As minutes passed, we watched her bring them a number of things as she hurried from the kitchen (right past us) to their table over and over. We tried to flag her down after about 15 minutes of watching her do so, and she gave us the \"just a minute\" hand gesture from afar. Alas, her focus from the table of what I can only assume was royalty could not be broken, so we tossed some cash for our drinks on the table and went next door to Better Burger (yum). I wouldn't be surprised if she still hasn't noticed."], ["Sarah F.", "I love this place! I haven't ordered anything from here that I didn't love. We always get crab wontons and dumplings (fried or steamed...both delicious!) I love their sesame chicken, but have tried other things that were also really great! Pickup is super easy and it is always quick when we eat in. Great service and very friendly staff! Highly recommend!"], ["Sam S.", "Best Americanized Chinese I've found in Dallas. I like a lot of other places for various reasons (close to home, good soup, etc.)...but this place has them all beat hands down. Food is always hot, fresh and delivered with a smile. Everything tastes right. Egg drop soup is addictive and has real flavor...unlike other places that literally taste like an egg dropped in water. No amount of soy sauce or chili oil can save bad egg drop soup. Thankfully, Ming's is awesome. Egg roll is always hot. I like a meat egg roll, but the one that comes with the combo is good. Moo goo gai pan is a 5-star dish for me. Chicken and veggies in white sauce is boring to most...and a lot of places don't get it right. Ming's does. You can really taste the subtle flavors that make this dish one of my favorites. Fresh vegetables and chicken. Large portion. Fluffy fried rice. I'm a weekly patron and a big fan."], ["John R.", "looks nice inside, people are nice.  Got the combo fried rice, it was very greasy to the point it looked like soup in the bottom of the plate.  It was decent, not bad.  As far as coming back this place is not for me."], ["Laura B.", "First off, I wish I could give 1/2 stars on Yelp. this may be a 4.5!Dallas is severely lacking in good Chinese food- no idea why but it's true- enter my recent discovery of Ming Place!While other places have ok entrees and good greasy wontons and such, this place delivers on yummy entrees and all-around delicious food.This is probably the first place is Texas that even gets my vote for a good Sesame Chicken (my fav) and it not only gets my vote it gets a giant gold star! It was super delicious. Other main plates we tried were good but I couldn't stay away from the sesame chicken goodness! Two things:1- They don't deliver and sometimes it's a hassle to drive in this area (traffic and all) but it's so worth it.2- They are incredibly nice! The first time we ordered online and got a phone call regarding our order of Green Tea Ice Cream. It wasn't their season for ice cream and they kept apologizing profusely to not give it to us. The bf upon return with our yumminess immediately went, \"I can't explain it, but they were so incredibly nice I want to go back tomorrow.\" That's always a huge plus with us!Try the wontons, orange peel chicken, etc but 1st try the sesame chicken!"], ["Tony S.", "Combination Fried Rice was really good.  Egg rolls need some help."], ["Harvey A.", "Been going to Ming Place China Bistro for a few years now. The food is good but the service is a bit spotty sometimes.We went today for lunch and it was pretty empty but were completely ignored by the male waiter. Not sure what was going on but he never even came by to ask for drinks or take our food order. Just when we were about to get up and leave a female waiter came and apologized for the delay. She was very friendly.Have had similar problems with the same waiter in previous visits but today it was even worse.The food is 3.5 stars and service is 2 stars. If you're willing to put up with the one waiter they seem to have, then give it a try."], ["Taylor S.", "I was underwhelmed.  It was completed dead when we went.  i think they may do a good amount of take out/delivery business.  We watched a decent number of people come in to pick up food.  I had one of their flat noodle dishes and just didn't think it was anything special and thought it was a little expensive.  They do seem to be one of those places that has lunch prices and dinner prices for basically the same dishes.  We were there at dinner so we had the dinner dishes which didn't seem to be particularly bigger or come with anything special to make them dinner dishes.  I will say the staff was really nice.  We got lost a little bit because since there weren't any other customers, there wasn't a buzz of waiters checking on people.  We had to go grab someone to get our check but it wasn't a big deal.  I thought the people were nice and I don't mind restaurants without many other people, but I just didn't think the food was particularly great."], ["Monica A.", "Fried potstickers: 4 stars. Excellent. Fresh and flavorful.The hunan chicken: 3 stars. Not very flavorful. But I will say it seemed healthy. Not much salt, so you can add as much as you want. But not spicy at all.Service: 4 stars. Really sweet wait staff with smiles on their faces. Loved that."], ["Heather N.", "I finally found a decent Chinese food place in the Uptown area.   I have not dined in here yet but I have gotten take out a few times from here. Orders are prepared fresh & I don't have to wait long at all. I have had the Mongolian Beef & egg drop soup. Both are delicious. Portions are generous & the staff is very kind. I look forward to dining in here soon."], ["Gary J.", "My wife and I have eaten here on several occasions.   The food and the service have been consistent.   The food is good, but, if you compare it to Pei Wei, Ming Place comes in 2nd place."], ["Frances G.", "If there is one thing I am certain about in this world, it's spice. I love it. I can't get enough of it. Jalapenos. Red Pepper Flakes. Siracha. Habanero. Whatever the source of the spice - I am loving it.Considering it is a Chinese Bistro, I was so eager to try the deliciousness of Ming Place. Chinese food usually equates to awesome levels of spicy that make my tongue dance. I am sad to report the Hunan chicken and tofu stir fry with veggies was not to my standard of spice. The chicken was tender, the tofu was fried just right, and the veggies were on par. However, it left a lingering of bland on my taste buds. Although, the hot and spicy soup was delish! It was thick and full of peppery flavors, but the entree lacked that umph. You know? Needless to say, the food is not bad or poor quality, just not to my liking of Chinese fare. The service, on the other hand was beyond friendly and fast. I will definitely return mainly because the service was impeccable. They even bring you a complimentary egg roll once you sit down. This establishment serves well as a speedy lunch destination. Therefore, I am eager to explore their dinner options as the food might have better quality. The more time for preparation, the better the meal."], ["Robert M.", "Continues to be our favorite Chinese place in Dallas. We usually carry out, so can't say much about the wait staff. The food is always hot, fresh and delicious. Moo goo gai pan is the best in town. Shrimp Fried rice is great too. We call them a couple times a month and have never been disappointed."], ["Desirae B.", "At 9pm I was starving and needed some din din, fast. We were over at the Salv Army on Harry Hines after getting off work late and time just slipped away. Got on my handy dandy yelp app and found this place 1 mile away and closing in 30min....They greeted us and we were seated next to a table of two guys who were apparently regulars here and offered us great suggestions. A soup not on the menu - chicken and vegetable. They highly recommended the ginger salmon but no matter how good they claimed it was, I just never like salmon and have tried it so many different places and I give up - I just don't care for salmon. So I told my husband to pick a chicken dish and our table neighbors suggested General Tso's. We ordered the crab rangoons, the soup and the General Tsos and shared everything. The crab rangoons were some of the best I've ever had - hot and fresh. The soup was very light and the vegetables were still crisp and not cooked to mush. The general tso's was the 2nd best I've ever had - lightly breaded and stayed crisp without an overload of sauce.But the real highlight is the service here, friendliest chinese restaurant I've ever been to. It's a shame it's not closer to my office because I would make it a weekly regular."], ["Lauren T.", "Love this place! We have never been disappointed. My sister was in town and wanted Asian food so I suggested we come here because we always had a great experience. She loved it and requests it when she comes back to town! Fried rice is delicious and light - not heavy and greasy at all. The wonton soup is fabulous! All of the entree we've had have been great too. Love. Love."], ["Guneet J.", "Worstttt service ever. Food maybe good but the hosts have absolutely no sense of customer service. Waiters were busy on their cell phones while customers were waiting. Real shame! Never coming back!"]], "P.F. Chang's": [], "The New Lin's Kitchen": [], "Moon Wok": [], "Monkey King Noodle Co.": [["Miguel S.", "Well I was never a big dumpling/ noodle type of guy. My wife wanted to bring me to this place and she would talk about how good and how great this place was. So finally I decided to try it for myself. Bad idea, I should have stayed away. The fat kid inside me can't stop thinking about dumplings now.Very small place with limited place to sit/ park. Who cares!! This place is delicious.Yes I said it so what.. I have tried several things on the menu but my all time favorite to this day are the chili wontons, OMG my mouth is watering as I type. If I had time I'd go get 2 orders but sadly for me the drive is about 45 min to an hour depending on traffic. I wish they were closer to me but I'd probably be like 300 lbs. I don't know if to be mad at my wife for telling me about this place or to be glad. I probably should act mad, so she can drive and bring some deliciousness to me. If you have a chance to come try this place do so, but don't be mad at me when you can't stop thinking about it. Fat kid status for the win. The prices are average but I would pay a bit more for these. I don't want to pay more but I will. Thank you Lila for bringing me here ."], ["Matt B.", "I have to start by addressing some of the other reviewers that complain about \"bland\" noodles and dumplings. This place serves their food very traditionally without covering everything unnecessarily in salt (which our society has become accustomed to - ::looks at man salting each chip at Mi Cocina::). This isn't Panda Express and you're not gonna get some mediocre food covered in a soupy sweet n sour sauce. The sauce that comes with the dumplings isn't just soy.. it's soy + vinegar + one or two other ingredients. This place is good if you know what authentic Chinese/Taiwanese food looks like and tastes like. It compares to some of the better Chinatown hot spots in NYC. Get the spicy beef noodle soup and an order of pork dumplings and you're set. Call in your order if you're afraid of long lines or show up late Thursday evening to sit up on the rooftop. The only small knock is the make-shift ghetto tables outside. 2 thumbs up for a perfect product."], ["Lily F.", "I was really impressed with this place at both the food and the execution.  This is my kind of restaurant where you can place your order and start eating in less than a minute.  A kind of fast food that actually took hours to make but thankfully all before the customers show up.   My spicy beef noodles were really tasty. I was expecting the soup to be saltier from the pics (really dark broth) that other Yelpers took but noticed my broth was a lot lighter.   But because I always add a crap ton of rooster sauce (what I call Sambal/sriracha) it makes it saltier and yummier.  Although the noodles were a little big than what I was expecting it went very well with the large chunks of beef.  I was also surprised at how much beef comes in a serving.  Whereas ramen usually comes with only a piece or two of pork, at MKNC you could very easily get a bite of beef with every slurp of noodles if you believe in yourself hard enough.  Beef rationing skills.The set up really reminds me of the thousands of food stalls in Asia especially with the little plastic chairs and tables where people can sit down and eat in the back.  I definitely support these types of restaurants and hope more of them show up.  By the way, in a setting like this, it's okay to sit with strangers if there are no open spots.     No need to take out everything in your purse, put your feet up, and make a fort out of the chairs because you're trying to reserve a spot.  I personally just want to eat and leave.  This isn't Starbucks where you can spend half your day trying to drum up ideas for a novel, lady.  Yeah, I'm talkin' to you, blondie!  Anyway, if you ever want to sit next to me, I'd let ya."], ["Jenu K.", "Watch the making of tasty hand pulled noodles by standing outside and looking through the front glass window for few minutes. Making of seriously the good noodles .The beef with hand pulled noodles in a spicy soup are honestly my favorite noodles despite all the noodles and ramen places I've been to in DFW. The meat is perfectly tender and the soup is perfectly seasoned for a totally combined best taste with hand pulled noodles. Cucumber salad and few different kind of dumplings are well worth a try. The dumplings are quite good with steamed and light fried crispy but not to the point of burnt. The cold cucumber with Kimchi or something like Kimchi sauce is great. Small hole in the wall shop for takeout. Forget the ambiance because there's none, just expect good food with nothing fancy, just few serious tasty offerings."], ["Richa T.", "Definitely a cute concept, but I just wish the food were a little better.Pros:+ Super quick - I mean, like lightening fast quick. I placed my order, and before I could put my credit card back into my purse, they already had my order out.+ Homemade noodles!!!!+ The dish I ordered was light and refreshing for sure. Cons:- All the noodles are fairly similar. Not as much variety dish to dish as I was hoping.- I wish they could make it a little spicier!!! Adding pepper and Sriracha just wasn't enough for my personal taste."], ["Chris F.", "I could have picked anywhere in Dallas to eat and I picked here. Boy, am I glad I did! I had the spicy chicken soup - lip-burning delicious! My friend had the pork soup. Again, delicious. We shared the wontons in chili - soooo frickin good! Maybe have to go again tomorrow...even walking in the rain!"], ["Julia B.", "What's not to like?!? I've had almost everything at this place and I love it.I always ask everything to be spicier than the standard - I personally think the spicy beef has zero spice - while flavorful and still delicious, I love it with an extra little kick.NOTE: If you order dumplings, it will take longer. They will serve people who were behind you that just ordered noodles before you so don't freak out!! Your food and delicious dumplings are coming!!"], ["Olivia H.", "Old school beef noodles in Deep Ellum?! Who would've guessed? My friends and I more or less stumbled upon this place when searching for lunch, and were pleasantly surprised. I ordered the spicy beef noodles ($8) and cucumber salad ($3), and everything seemed pretty authentic. The noodles were fresh and cooked the right consistency (nice and \"Q\"), and the cucumber salad had all the usual flavors (chili oil, garlic, etc.). If I wanted to be picky, the beef could have been a bit more tender and the broth should be more flavorful (it wasn't really spicy at all, despite having three red dots on the menu). But I'm just happy I found a place that nailed the noodle texture."], ["Mandee N.", "Apparently MKNC was having a crazy day, we missed out on all of the noodle soups. They ran out and were completely dry of soup broth. HUGE BUMMER. And especially because we drove quite the distance just for their Spicy Beef Noodle Soup. We made do though -- ordered their Spicy Wontons and Dan Dan Noodles (sans broth).The BAD -- maybe because it was towards the end of the night, and they were closing within the half hour, but the Spicy Wontons were quite salty. It didn't help that the Spicy Sauce was doused all over the wontons, saturating it completely. Edible, but you'd have to take sips of water in between bites.Although great for food-styling photos, the bowls that the Dan Dan Noodles were served in, were terrible for actual usage and consumption. Because the ground beef and sauces were overflowing on top and the noodles were packed tightly underneath, it was difficult to get a bite in with both noodles and toppings, without spilling all the goodies everywhere. And especially hard to mix everything together for the perfect meat:noodle bite. Suggestion -- serve noodles/noodle soups in larger/wider brim bowls. FYI - Outdoor seating is behind the shop, right by the trash receptacles. After sunset, the outdoor lighting isn't great either. We had to use our iPhone flashlights to see what we were eating, lol.The GOOD -- Authentic flavors. Chewy hand-pulled noodles. What we ordered -- the wontons and dan dan noodles left us wanting for more.Will definitely come back the next time in town for the Spicy Noodle Soup."], ["Tracy M.", "I've been back.  I still haven't tried the beef soup that everyone raves about but I love the dan dan noodles and the spicy wontons!"], ["Uche M.", "Heard great things about this place so decided to give it a try. I asked the guy at the window what people usually get and be suggested Dan Dan (pork), so that's what I got. Noodles were a bit too thick for my liking. But other than that it was great and tasty. Definitely plan on going back."], ["Kym B.", "I ordered the chicken noodle soup and after the first bite I almost drooled all over the place. The broth is super flavorful and seasoned to perfection. The noodles are hefty and there was chicken in every bite. The portion size is substantial for a $8 cup. Be warned that they're only open for a couple of hrs during the weekdays and there may be a line."], ["Taneicesaya S.", "If you want a great seasoned broth and noodles and chicken, this is it.  Oh yea I got mine extra spicy.  The cashier and beautiful her pinknails with glitter on them we nice. I could just eat the broth alone. I'm will be returning and this location was recommend by some Fire Ladies.  They also told me to get it extra spicy and it's scrumptious and NOT HEAVY on my stomach."], ["Barbara C.", "Thank you sweet baby Jesus for these delicious Wontons and Soup Dumplings!I freaking love the food here. It is SO good. Pro tip- the 'spicy' annotation on the menu, really isn't spicy at all. Order moar of the spicys for xxxtra bang!Side note:I saw one review from some proud California native complaining that they were disappointed because they felt that MKNO dumplings weren't 'authentic' enough....Well go back to California then. You're closer to Asia out there so why are you expecting more authentic Asian food in Texas?The irony is that their frame of reference for 'authentic' is authentically Californian and not Asian. Anyway, I like my wontons and dumplings Texan with some good ole' Deep Ellum swagger. Keep rockin MKNO, you're doing just fine ;)"], ["Stephen K.", "Wait time can be really bad. Especially around 7 or 8. The food is a little bit better than average but I gave it three stars because of the wait time"], ["E. O.", "Interesting concept to order to go, unfortunately there isn't any space to sit down to eat. Food came fast and was tasty."], ["Suzi Z.", "Ordered spicy noodle soup and the soup dumplings. This was my first and probably the last time coming here. The beef turned out to be ground beef?! Which was different from the photos. And the noodle's consistency is closer to spaghetti than Asian pulled noodles. I can see why some people might like this place but if you know what beef noodles are supposed to taste like, you might want to look elsewhere. The soup dumplings were decent though."], ["Jordan N.", "This place is alright - I ordered the soup dumpling, and I thought it had a good flavor, but I'm not convinced that there was enough \"soup\" in it compared to the other soup dumplings I have had before. The dough was certainly thick, but it did hold up the dumpling well even with the chopsticks.I thought about trying other things in the menu but there wasn't much else that caught my eye the day I went. Maybe I was put off that at least half of the items in the menu were all spicy.I'll give it another try eventually once I can figure out what else to order - but it certainly would help if they had indoor seating since it is hot out in Dallas during this time of the year. The staff is friendly though."], ["Charlotte J.", "I hate to rate such a sweet little noodle shop so poorly. Especially one that makes their noodles fresh and has fast, efficient service. But it's been several hours since I ate my Garlic Peanut Noodles, and I'm still feeling greasy and somewhat ill. Here's my take away:Pros:   - Great, thick, fresh-tasting noodles. And rightfully so, they make them right on site and it shows!   - Fast service. I got in line for lunch on a Monday at 12:01. I had my food by 12:08. That includes waiting in a line three people deep. Cons:  - I ordered the Garlic Peanut Noodles (the only vegetarian noodle option) and they were just okay. Like I said, the noodles themselves were fresh, but the topping (\"Wok-toasted peanuts and garlic, house chili oil, and hints of sesame and soy + cilantro\" according to their website) was just plopped on top. Really hard to spread around in the carton. Consequently, I ate a lot of the noodles plain, and when I got to the bottom of the carton there was a lot of topping just sitting there, uneaten. - These noodles are SPICY! I realize now that on their website they warn you of this by calling the dish \"Spicy Garlic Peanut Noodles\", but that's not on the menu at the restaurant. Usually I don't have a problem with spicy, but this dish made my eyes water and my nose run. I probably would have ordered a different noodle dish if there had been any other vegetarian option, but this one was my only choice if I wanted noodles. - My meal isn't sitting very well in my stomach. In fact, as time has passed, I've felt progressively worse. Greasy, unsettled, vaguely ill. The eating experience itself was adequate, it's the aftermath I'm having trouble with. Reading other reviews, it's possible I just ordered wrong, and this was a fluke. If that's the case, I'll update my review in time."], ["111 1.", "Amazing and authentic Chinese soup dumplings.  A must try.  It was flavourful and very fresh. I wish I could go there everyday for the soup dumplings for breakfast. Then I will have a happy life. Be aware the dumplings do have a lot of soup in It.  So when you bite try to suck the juice out at the same time. So I won't drip everywhere or shot into your friends eyes.  Plus the juice is the best part.  You can not waste it."], ["Jay H.", "Yay! I'm a fan. Definitely describes my feelings about MKNC!Monkey King is a noodle spot on Main Street in Deep Ellum. It's a pretty small establishment that serves noodles, soup, dumplings...the whole nine. There are a few seats on the roof, but for the most part you either need to take it to go, sit in your car and eat, or just stand on the sidewalk and enjoy. I did the last option that I mentioned. It was close to closing time so I quickly ran up to the window and ordered. I simply got an order of the edamame and tofu dumplings and a bottled water. Trust me, the one order of dumplings were pretty filling, they give 10 of them. Keep that in mind so you won't over order. It was only a 10 minute wait, so it wasn't that bad, plus I was being entertained by the guy making noodles in the window. It's hard to look away from the tossing and spinning of the noodles that he makes look so easy. Once I got the dumplings, I cracked open the plastic container. A lot of steam and the wonderful aroma of the dumplings poured out of the plastic case. The dumplings were done perfectly! The flavorful, creamy inside of the sealed dumpling matched perfectly with the salty dipping sauce! So good! Writing this review is making me want more. I killed them and went on my way. Monkey King is most def a stop that I will be making often in the future. Especially on cold days...I wouldn't mind spending it out on the Main St. sidewalk eating some hot, steamy dumplings!!!"], ["Candy R.", "I'm so in love with this place! The noodles are made from scratch, which causes the noodles to taste a little different every time you visit. Yet, you can be confident that every time you visit it will be delicious! I've had the spicy beef, spicy chicken and the dumplings. My favorite is the spicy beef, it's not too spicy it's just right to still have flavor. I also order the dumplings, you have the option of ordering fried or steamed, I usually get half and half cause they will both kick your taste butts. The building it's self is cute as a button; it's tiny with a huge line around it most of the time. It has a nice roof top, and just recently additional sitting on the back. I really love this place!"], ["Mandy L.", "Loved this place! Unfortunately the patio wasn't open and we had to sit out back but the weather was so nice that we didn't even mind. The backyard didn't have that great of lighting, but there was plenty of space.We brought a bottle of red and ordered the spicy beef noodles, the spicy peanut noodles and an order of the wontons with chili sauce. The portions were more than enough! I would recommend sharing an entree and an order of wontons/dumplings if you're staying out and don't want to have leftovers. The people working there were super nice and even though there were a ton of people there on a saturday night, the wait to get the food was less than 15 minutes.The only real downside was that I felt like there were too many noodles in relation to the amount of meat. I absolutely loved the peanut buttery taste of the spicy peanut noodles, but I had to dig around for the meat. My roommate who got the spicy beef said the same. Overall, good option for a BYOB low-key date when the weather is nice."], ["Jessica P.", "I'll preface this review by saying I'm (very) far from a Chinese food expert. I stumbled across this hidden gem in Deep Ellum and decided to give it a go. It's a stand alone shack, yet the line was still pretty long. We didn't wait too long, maybe ten minutes, and both got the spicy beef noodles. This was on a really unforgiving Texas summer day (aren't they all?) so it was a little inconvenient to eat outside. This seems like an unfair thing to complain about though, because their whole \"business model\" currently is being a stop and go kind of place. However, I would suggest installing misting fans or something of that nature. We did stay and enjoy our noodles here though, but sat at one of the stools in front of their kitchen/cashier area. The broth was savory and flavorful, and not overly spicy. The noodles were al dente, while the beef was very well seasoned. I'd say it was hard to enjoy the food because it was so hot so I'm really itching to go back and then enjoy it in the comfort of my air conditioned home."], ["M M.", "I'd recommend to anyone stuck in a rut to drive over to Deep Ellum and try out the noodles at Monkey King.It's a great change of pace from the semi-premade Sysco, Ben E Keith world that we generally inhabit. I ordered the Dan Dan noodles. I really liked the consistency of the homemade noodles but the turnoff for me was the red chili powder in the broth. This is really just a matter of personal preference though, so I don't want that to impact my review. If you're a fan of beef chili, this will seem familiar and you'll like the Dan Dan option a lot. I\"ll be headed back for the homemade noodles in the cold vinaigrette or the garlic noodles."], ["Jessica J.", "I've been here several times and will continue to return. Good, hearty food. Reasonable prices. My favorite is the chicken wonton soup. Love it! Spicy beef noodles are good too, but make sure you ask for them to be spicy. I liked the soup dumplings the least. They were good, but a little too doughy for my taste. They're moving to a new location on Main and in Carrollton. Awesome."], ["Thy N.", "I don't know what the hype is all about, but don't get your hopes up. I got beef noodle and steam dumplings last time I went. Nothing special about the beef noodles or dumpling. I just had way better. The price is okay, but the seating was horrible. there wasn't any seat for us, and the seating upstairs was closed. And no one works there even care to ask. Oh  to be fair there were chairs but no table. We ended up having to sit in the car.  I don't think I will be back!"], ["Joanne V.", "I like the concept of this place! It's unique in its own way. You can see the owner busily making the noodles by hand. Located in Deep Ellum, it's street parking. May the odds of finding parking be in your favor during rush hour. I got the beef noodle soup and the steamed soup dumplings.  The beef noodle soup had flavor but I had to add the chili oil to give it a kick for my liking. The steamed soup dumplings were good, like other reviewers mentioned, just wished they put more soup in there. The seating upstairs were full so we sat downstairs on the sidewalk. Luckily, someone just left right when we got our order. The prices were reasonable, but the seating sucked especially during peak hours..but that's understandable for a small place."], ["Danny N.", "We love eating here! They used to have a rooftop, but apparently it was closed down. The seating is  to a few plastic tables in the back behind the shop, so many people choose to take the food to go. There is always a line, but the wait isn't too bad. We usually go with the soup dumplings and spicy beef soup. They pull their own noodles here, and they're the best I've ever tasted."], ["Mitchy M.", "I am a newbie to this Monkey King and I had no idea of what I was stepping into when I arrived.  The concept seemed appealing and interesting, so I didn't have a problem trying something new.  Let me warn you.. get there before 2pm, unless you decide to come for their dinner hours.   Otherwise you're fresh out of luck, because they aren't open all day.  This is a street style eatery with a couple sidewalk tables & bar stools.  They also have a upstairs patio, which is accessible by the spiral stairs on the side of the building.  On a hot day you're going to roast up there.  And I don't need to work on my tan.  However on a cloudy or cooler day it's perfect. I ordered the Hot Spicy Beef Noodle and Pork Dumplings.  The price wasn't too bad.  The Beef Noodle came out quick and the dumplings came out a few minutes later.  And I'll admit that I thought I enjoyed eating noodles or pho type soup... well I was wrong.  You really have to love noodles, because there is a hell of a lot of noodles!  They were very generous on the beef ( it wasn't spicy according to my taste buds), but dang I didn't expect the amount of noodles.  The pork dumplings and the accompanying sauce was good.  Their smallest order was a total of 8 nicely sized dumplings.  I'd say it's worth splitting with a friend. What did i learn?  I'm a novice on the noodle love.  Am I complaining.. heck no!  I'm just saying for all of you noodle lovers.. this is your spot."], ["Jenny C.", "Came in the winter time during the coldest weekend where it was 20 degrees. Did not know it was a food stand.Warning: No indoor seating. This is a food stand.Food (3/5)-Soup Dumplings ($8) - Disappointed. The skin was way too thick and there was NO SOUP!!! Can't call them soup dumplings. No soup.-Beef noodle soup ($8) - Noodles and soup was pretty good. Could be spicier. Beef was not tender. But for this price I'd rather go to a sit down place that is more authentic and gives you larger quantities.Maybe I need to give it another try when it is warmer."], ["Zachary K.", "I was very excited to try this place as it had very good reviews and I am a sucker for Asian food, especially soup dumplings. Yesterday, we had lunch there and it was an utter disappointment. We ordered the spicy beef noodle soup and the soup dumplings which seemed to be two of the more popular dishes. As other yelpers stated, the seating was not so great but that is ok if the food were to make up for it. We got our food and it didn't look very appetizing from the start. The soup dumplings were hard and almost looked if they had been sitting out for a couple hours. The consistency was terrible and when I bit into them to try and drink the soup out before I ate the dumpling the soup would pour out everywhere. As for the spicy beef noodle soup, it was extremely bland and I  not sure why they call it a soup because it was pretty much a cup full of some kind of chili oil. The beef on the soup was extremely tough and chewy. For being such a \"hole in the wall\" I would expect much higher quality food than what I was served yesterday. I am not sure if my experience was an off day but I am not sure what this place can do to improve the quality of there food. I know I will not be back at this restaurant and I hope I can find real Asian authentic food in Dallas."], ["Torry C.", "Soup dumplings!!! So amazing and delicious. And the chicken soup is also awesome. The soups come with a ton of noodles and they're home made. Really really good. Wish it was open later !"], ["Amy Z.", "This is the closest to authentic Chinese food in downtown Dallas - but that, unfortunately, doesn't say much. Sure the prices are alright and the setup is cute, but the food fails to deliver.Today, I asked if the Dandan noodles could be made with less spice, and the curt response was \"it's not that spicy.\"  I only asked because I found it too spicy last time. They could've said, \"sorry, it's a premixed broth,\" or something to that effect -- in which case I'd order something different. After all, it's my own fault that I can't handle spice like a good Asian. As it turned out, the lady at the counter was right - it's not that spicy this time, thanks to their inconsistency. But it was excessively oily, and I now feel nauseated although I didn't slurp on the broth. The dandan noodles themselves have a consistent texture, but the width is quite varied, with the thinner strands resembling the beef noodles. The spicy beef noodle soup is \"alright\" according to my various companions. The soup dumplings have a good amount of broth, but are very salty.I understand they're trying to appeal to an Americanized palate with the heavy-handed ingredients, but it doesn't fly in my books."], ["Heather S.", "In my mouth.. right now.. Monkey King is just amazing.. granted I'm not a hardcore dumpling snob- but I enjoy them  just the same. I've been here 5 times now and they are if anything consistent regardless of how busy they are or what time of day. I agree with my fellow yelpers about the huge awkward tip screen when you pay with a CC. There is no service beyond taking your order at the window and screaming your name from the same tiny hole in the building when its ready for pick up. So the food- I cant agree with some of my yelp homies, ive had some pretty foul dumplings and I really flove MKNC and everything on the menu. Where else in DFW can you see a lovely, strong-armed tall drink of water flinging noodles around with that intensely focused face? uh, nowhere.. I could just sit and stare at him roll that dough the whole time, and I usually do, but not in a creepy way.. haha. But for real try to wiggle into the window and watch the magic- this dude is hardcore and you know the noodle are fresh off his manly floured hands cause he drops them straight into the boiling pot when he's done.The chili wontons are by far my favorite- there is always the perfect amount of saucy heaven on top of the generously bulging dumplings. I am also of fan of the spicy beef noodle soup- but I ask for an extra side of the chili sauce and cilantro to pump it up. The Chicken soup is bland to me- but again you can doctor it up and its very satisfying on a rainy day. I'm not a big fan of the soup dumplings only cause I'm so uncoordinated when it comes to the bite and slurp technique and I usually have to commit and stuff the whole thing in my mouth- not cute on a date, ladies. The basic dumplings and soups are always available- I've had some seasonal slaws, marinated cucumbers and other various items- so grab a few friends so you can try everything."], ["Dave G.", "A chef friend of mine recommended Monkey King. We both agree that we'd like the noodle-man to live in our garages and just make his noodle for us. I wish I could slide open a window in my kitchen and have him hand me a bowl of his beautiful, hand stretched noodles. Maybe my friend and I can do like a noodle \"time share.\" A window-service fresh noodle and ramen restaurant in Deep Ellum, Monkey King Noodles is one of the best, freshest concepts to come to Dallas in a long time. (Yes, I know they have been here for awhile, but forgive me for not getting around to them sooner. Still fresh.) The spot has a bay window where a chef makes the noodles fresh, right in front of you. It's a culinary show and a great way to pass the time while waiting for your food. The process is fascinating and gives you a real sense of the artistry in the kitchen. Side walk tables and a roof top \"dinning room\" for seating. MKN is not a high church dinning experience. No one will unfold your napkin and put it on your lap for you, but if you care about food this is a great place. You will wait in line. The seating will be ad hoc. You will get a styrofoam container and a plastic form (and chopsticks). The food will be worth it. Standouts are the dumplings and the pork dan-dans. I always get a side of the spicy cucumber salad, too. Go. Eat noodles."], ["Tanya A.", "Had super high expectation for this place based on all the great reviews and the suspense built up from waiting to have it.Upon arriving, there was a line, which was the longest part of the process. Got to the window to order and was immediately handed my food. My friend noted, it was faster than fast food.Based on the demand, they might have come up with an efficient way of getting people their food, but I feel like it probably jeopardized the quality of the food itself. It's no wonder they got it to me so quickly. It was cold, and the sauce/gravy was not mixed in the noodles. It seems like it was thrown on top of the noodles and defrosted not so well. Had they just had a wok nearby and heated it up/mixed it up before handing it me, I'm sure it would have tasted way better. None the less, I liked the flavors. I got the spicy garlic peanut noodles. My friend got the beef noodles, and she said the beef was terrible. It was chewy, not melt in your mouth, and did not taste fresh. She did agree that the flavors were good though.Overall, I want to go back, just because of all the hype, but this time I'll try the dumplings."], ["Sang H.", "This place is delicious!! They make the noodles right in front of you and the broth comes out hot. They have a lot of selections you can choose from. You can also go up the stairs and eat next to their stand."], ["Fei S.", "Chinese fast food that are actually authentic Chinese food! I came here with colleagues for lunch. Ordered Spicy beef noodle soup and port buns. Everything is great!! People work here are also very friendly. Super impressed."], ["Una B.", "I ate two entire orders of dumplings and then spent the rest of the day wanting to die. This was entirely too much food to consume, and although I wanted to stop with about 5 or 6 dumplings remaining, I took it as a challenge to finish. Stupid me. Don't be like me. Soup dumplings were ok, and served with  black vinegar with ginger but I also like chili paste at the ready to consume with the dumplings.  Not having my usual accompaniment actually made me focus in on the taste of the dumplings and honestly, that was actually pretty bland. The other, pork variety that I got didn't fare much better as I also had an overall feeling of blandness. Wontons in chili sauce that I sampled from a friend's order was better. I still want to try the spicy beef, but I definitely need to be dressed appropriately to dig into that. (no white, I splatter!)"]], "Noodle Nexus": [], "A Wok Express": [], "China Bowl Express": [["Leslie D.", "This is the best Chinese food I have ever tasted in my life! I moved away from Dallas and cannot find any place that compares to this ! The portions are huge, and everything tastes amazing!! I make it a priority to eat here if I'm ever in town. Def recommend the Beef Broccoli, combination fried rice, and egg rolls!"], ["Mando D.", "Ok..this is the worst place to come eat..The owner assaulted me..for finding out that their tartar sauce was spoiled...Do Not Eat Here..after today the Board of health is going to be notified of there cleaning and storage habbits...You eat here you put your health on the line....No Joke..For your safety Do Not Eat Here."], ["Qudus O.", "Fairly priced, large portions and fast service. The staff is quick and will respond promptly with your order. I have been going to this restaurant for the past year and will continue going here."], ["A C.", "Great Chinese food! I'm extremely picky. I've tried Ryen, A Wok and Rice Bowl Express - didn't like any of them. Chewy meat, weird after taste and just plain grossed me out. Chinese food can go either way, we all know that.I was in a rush and had a craving - was just about to drive to Panda Express at Town East but was passing this place. Lived here two years and never had noticed it.Pulled up Yelp - decent reviews (not that I always agree) someone mentioned not as good as Panda and I almost drove off. I like good Chinese food or Panda never fails.This place hit the spot!! Yay! My new go to place - Panda doesn't hold a candle. I used to love a place on Ferguson/Shiloh that delivered but they closed down months ago. If you know what I'm talking about and liked that place, you'll like the food here too!"], ["Shelby M.", "I've been a regular for years. Always so good and fresh! Almost always get it to go and it's still good by the time I get home and great for left overs. The staff is super friendly. This food is soooo cheap for what you get."], ["Brittany W.", "I'm so glad that I took a chance on this place! Was very apprehensive at first because it was a drive thru and the appearance. However, this turned out to be one of the best Chinese restaurants that I've eaten at. So far, I have tried the Sweet and Sour Chicken, Mushroom Chicken, and Moo Goo Gai Pan....all were excellent! Oh and very reasonable price, it was only about $13 for the two of us."], ["Valerie A.", "Went here yesterday. Don't try the teriyaki chicken. It tastes like they bought it frozen and didn't heat it nice. Also they serve very large portions. More rice than meat. Expensive water bottles, I could buy for 2$ a 12 pack !"], ["Gustavo C.", "The staff is super friendly and don't mind if you add or take out items from their original plates! The ice tea is really good!"], ["An N.", "The only place I know of where I can get Mexican drinks and good Chinese food. I have been coming here a long time and will always come back. I usually get the horchata and combination fried rice"], ["Christian C.", "For a cheap Chinese restaurant, you get what you get. Don't expect much, but for me, I love this place. For a $8 meal you'll get stuffed. They're plates are a little bigger than ones given to you at Panda Express. The food is great as well considering the low price. If you're on your lunch break and don't know where to go with the 10$ you have, consider going here."], ["Bob P.", "Been looking for a good Chinese take-out place in our area and tried China Bowl Express based on the reviews. I will agree with the other reviewers the portions are large. We had the sesame chicken, kung pao chicken, hot and sour soup, fried rice, and egg rolls. The sesame chicken really didn't have much flavor and the fried rice was missing the egg, peas, carrots you expect in fried rice. The egg rolls reminded me of something I might pick up in the frozen section of the grocery - no flavor. The hot and sour soup was not up to par and was the worst of the selections we tried. The best dish was the kung pao chicken, which was spicy and had crisp vegetables in a flavorful sauce. Overall, not a stellar dining experience."], ["Trino L.", "Good food great service good price for a large portion of food.."], ["Darren C.", "Adequate food, OK service, relatively clean. Saw the owner refill her own dirty plate in plain view of customers - a city health code violation. I still go every once in a while when I'm tired and don't want to travel far from home..."], ["Austin R.", "The food here is some what cheap for a medium portion. It's not as good as a panda express. Why am I comparing it because you absolutely can not compare this place to any other place it does how ever have good food but a medium price to like 7$ for fried rice with chicken"], ["D B.", "I love China Bowl-- great cheap Chinese takeout with the convenience of a drive-thru.  Food always fresh & portions are very large. I love their Egg Drop soup."]], "Shanghai Restaurant": [["Kaitlin F.", "Wasn't a fan. We got the curry chicken,  generals chicken, cream cheese wontons and hot and sour soup.Soup was bland, the wontons were small and the chicken dishes weren't very good at all. Kinda disappointed in overall taste."], ["Cecilia N.", "We ordered delivery on a Wednesday night. The food arrived hot and fresh and in a reasonable amount of time. I ordered the Orange Shrimp. It was delicious! I loved that the sauce was a little bit spicy and it wasn't too thick or syrupy sweet. Just the right amount of kick and sweetness. The hubby ordered the shrimp fried rice. He said it had enough shrimp in it. He loved the steamed pork dumplings. We will definitely be ordering again!"], ["Tan Y.", "Very good restaurant!!! Warm staff !!Wonderful boss!!!Great environment!!Nice food!! Very reasonable price !The food taste so good!! I am a Chinese who grow up in China, and I have tried many many Chinese restaurants in California, New York and Texas.this place is among the top of all these."], ["Thomas V.", "Came for a late lunch and ordered  xiao long baoDrunken chickenBirds nest or pan fried noodles, with seafoodHot and sour soup We were the only ones there and it was about 3:00pm. I won't say anything about a restaurant and how they look.  But I will say,  the restroom odor does need to be neutral at the least. I will rate the orders based on the order they came out. Bowl: hot and sour soup.,  I've had better,  we weren't given fried wonton to enjoy with the soup though.  Would rather go to first Chinese bbq. Dish: drunken chicken,  came out looking juicy and moist.  But something about it looked odd. Upon touching the chicken with my bare hands,  I was expecting it to be piping hot.  surprise! It was as cold as the ice tea I bought at QT prior to this visit.  Taste was a bit odd especially with the temperature of the chicken but I got used to it.  It tasted Alright.  3 of 5 stars. Birds nest/pan fried noodle (seafood) : broccoli was soft,  water chestnut didn't taste fresh,  seafood pieces were actually seafood bits (where are the big O shrimp and scallops?),  noodles were nice a good thickness in size,  but the amount of noodles given could be more.  It was overly sauced and the sauce was quite strong. If you order please inform them to add less sauce or add more noodles. FINALLY,  APPETIZER  XIAO LONG BAO: The appetizer came last and was ordered first,  even ordered it ALONG with our waters for the table.  Now , the moment of truth comes to light.  I've had my fair share of XLB,  and I came here because I trusted the yelp Reviews.  BIG MISTAKE! they indeed did come out hot and was served with a side of black vinegar.  I was expecting to bite a bit of the top off and blow it til it cools down and just throw the whole thing in my mouth.  The wrap they used for the XLB was not soft,  it was still a bit hard much like pasta you pull out a bit too early,  it was tough.  And looking into the XLB,  there is no soup in sight on half of them.  That's the main point of soup dumplings!  Now I feel like I paid 5.50 for 3 soup dumplings and 3 regular dumplings. I've had much better XLB.  If you are hunting for some head to Royal China. Service: they were friendly and nice at least...  Except I don't like hearing people cutting their nails while I'm eating my food.  Makes me cringe a bit about the food when it's being brought out to me."], ["Leo S.", "I have been come to this restaurant for seven years. I love the new renovation！Shanghai resturant defintely have the best 红烧肉(pork) in DFW area."], ["Kaia V.", "If you want cheap bad Chinese food for white Americans DO NOT go to shanghai restaurant! The food here is authentic, though the menu features a bit of a mix of northern and southern Chinese food. The highlights of the yearly Chinese dinner I attend here include the duck, the spicy cabbage banchan-type premeal dish, the fish soup, and separately, the dessert soup that contains little rice dumplings and is just the most delicious and one of the strangest things I've ever found myself squee over. As for their other offerings - the whole fish always seems to be mostly skin. Not sure where the fish meat goes but it is hard to locate on the platter! I'm not a fan of their sliced rice patty dish as I find it too chewy. Their spicy squid is quite nice, however, and tastes the way you'd expect any spicy squid dish at any Asian restaurant to taste. The whitefish in what seems to be a cornstarch sauce, and the baby shrimp in a similar sauce were both tasty and cooked perfectly. The fish soup is super light on the fish but the pieces you do find are again perfectly tender and well seasoned. If you like pork, they also make a pork shank that the rest of the folks in my group devoured like wild animals, so it must have been remarkably delicious. If you are Chinese, have Chinese friends, or at least have had authentic Chinese food and know what to expect then shanghai restaurant will be pleasing to you. If you are not any of those things, probably best to avoid this place unless you're super adventurous, or order really boring things from the menu!The staff are always wonderfully accommodating and provide excellent service with a smile regardless of whether you speak mandarin or not, but things are arguably facilitated if you have someone who does in your party. The location is a bit difficult to find now that the overpass on Preston is in construction mode. The restaurant is in a strip mall just south west of the intersection of Preston and the 635."], ["Danielle P.", "Soup dumplings sucked along with everything else that was overseasoned. Save yourself the trip and go somewhere else.The soup dumplings aren't as great as everyone says it is.. there was barely any soup in it.. practically none, really. The meat inside was overseasoned, and the dough wasn't cooked thoroughly.The sauce in the pan fried noodles were overseasoned and they drowned the noodles in the sauce so it made it really hard to eat.The drunken chicken, which I assumed was chicken boiled in beer, came out cold which made me believe it was old chicken they boiled up from before and took out of the fridge and cut up to serve to us. Just tasted like regular boiled chicken.The hot and sour soup was so-so. Nothing spectacular. Just like any other place, really.I wouldn't come back. Especially, after seeing our server cut his nails at the front desk while we were eating. Gross. The bathrooms are dirty too, and the lights in there were filled with dead bugs."], ["JULIE N.", "Sorry, but I was hoping it was good like it use to be. Great renovations, but poor quality food. I rather have the old decor with better food quality. We ordered what Shanghai pork, xiao long bad, egg foo young, and baby crispy chicken. None I can rate good. Change in chef and ownership for sure."], ["Darcy C.", "My canned coke was good... I ordered vegetable lo Mein (how could that be messed up), veggie egg rolls and crab rangoons. The lo Mein had a weird taste... I took one bite and was done. The egg rolls were okay. I've definitely had better and the crab rangoons were very disappointing.... I will not be back. I spent $20 on food that ended up in the trash."], ["Anthony B.", "Dumplings. Its all about dumplings.  To be honest, I haven't really tried anything else but that here, so my review is pretty much just based on dumplings.The establishment is a pretty generic chinese/asian restaurant, but its of a decent size so it seats a lot of people. Their menu has about 4 million items, but like I said, I've only had about 4 things on the menu.The juicy pork dumplings are tasty, as are the potstickers. With that, we usually also get the green onion pancakes and their corn chicken soup. The chicken soup has a slight odd yellow color to it, but I haven't died yet so I assume its legit. The dumplings can take a little while to make it to the table, so its good to order some munchies to pass the time.Its pretty cheap too. I think we typically end up only spending about 10 bucks a person on average."], ["Diana M.", "As a returning customer, I was delighted by my most recent visit to the newly renovated Shanghai Restaurant! With new management in place, Shanghai has refined its menu selection and interior decor while still maintaining its reasonable prices and welcoming service. As with most Chinese restaurants, Shanghai offers a good mix of both Americanized Chinese (\"Popular\" section of the menu) and Authentic Chinese (\"Traditional\" section) dishes. Not all the dishes we ordered were truly Shanghainese cuisine, but we still found our whole meal to our liking - made with fresh ingredients and well balanced in flavors. The top highlights included -1) Xiaolong Bao - savory and entirely hand made from scratch!2) Defatted Pork Shoulder - melt-in-your-mouth dish without being over-indulgent. 3) Beef with Fresh Spiced Pepper - tender beef with a nice spicy kick. Overall, a wonderful meal showcasing an old establishment in new light!"], ["Matthew L.", "I don't think 3 stars does this restaurant justice. I ordered take-out so maybe there's a different experience when you eat in. The hot and sour soup was both hot and sour. Most places don't ask your desired spice level for soup but this one did. I managed to get a slight burning sensation on my lips which means the food had some spice and I am happy. The dry sautéed string beans were as good as any other place I have had them. I also got moo shu beef. The filling was flavorful and the pancake was thin enough to not taste too breast and strong enough not to break when I ate it. Finally, the Szechwan fish. Tender, flaky and delicious. My only complaint is they were a little skimpy on the rice. The containers were not completely full leaving some of the people at the table feeling a bit rice deficient. The decor is not much to look at and it's a little strange to see the traditional italian red & white checked table cloths covered by plastic sheeting at a Chinese restaurant."], ["A W.", "We can't dine in just 9:10pm so disappointing why can't the restaurant close 9:30 pm and we rush to get there and we can't dine in"], ["Victor X.", "I visited this restaurant and had a dish called Yellow Fish. The dish was delicious, and was amazing. There was another good dish called Chinese Squash and Soy bean."], ["Jenny W.", "Tl;dr: This review is largely irrelevant if you're not coming here in a large group of 50 people to celebrate the Lunar New Year, with largely unidentified entrees placed before you. Some of the meat dishes (e.g., soup dumplings, lobster) were overly seasoned. If you have any food restrictions, things will be a challenge.  I was invited to a special event attended by ~50 people. I'll start with the positives. The banquet menu was expertly crafted, and included some dishes that were exclusive to the celebration of the Lunar New Year. The execution, from start to finish, was extremely impressive for such a small restaurant (~10 tables, 4 of which we occupied). The service, overall, was accommodating enough.But it seemed as though the supply could not keep up with the demand. The food came at irregular intervals (overlapping dishes to start, then 10-15 min in between), and without any announcement of what ingredients each dish comprised (despite the servers being forewarned of food restrictions). As an omnivore, I jokingly (but actually, seriously) took the role of taste-tester for some of my dinner companions, as it was sometimes difficult to visually distinguish vegetable from meat, and red meat from poultry. Who would have thought that a huge pot of soup, brimming with green veggies, would contain chunks of fish lurking beneath its surface? Some of the dishes, including the soup dumplings and most of the seafood, were overly seasoned. The lobster tasted as though its meat had been pulled out of the shell before being soaked in brine, tossed with pepper, and put back in. As the night went on, the service began coming apart at the seams. The intervals between courses stretched longer and longer. Glasses of water were only served to a select few. A long awaited wine glass eventually came in the form of a styrofoam cup... which was amusing at best. But there were some food highlights. The veggie dishes were actually the most pleasing. The tofu skin, wrapped around mushrooms or cut into strips and served with edamame, was savory and delicious. The flavors of the bok-choy served with shiitake mushrooms, sauteed green beans, and eggplant in garlic sauce were very well-balanced. Looking at the seafood, the fish filet in sauce, though salty, was enjoyable in small amounts. Finally, a glutinous rice dessert, served with pockets of red bean paste in its center, was near unforgettable (though probably exclusive to the New Year event). It is unfortunate that I could not review this restaurant in its \"normal\" setting.  Heck, it's harsh to criticize a restaurant that was willing to bravely take on an order for 50 people, and came up just a little short. But if the banquet experience was any indication, this place is worth a visit if you're in the area... but not worth a long trip."], ["P H.", "Very disappointing.  We ordered the large wonton soup. The wontons were mushy in the middle. The Kung Pau Shrimp and Shrimp in garlic sauce tasted exactly the same. The only difference was one had peanuts in it. The fried pot stickers were very greasy. All the food was delivered luke warm so we had to heat everything in the microwave. This has been our favorite Chinese restaurant.  Wondering if they have new ownership. I may try one more time before I make my FINAL decision."], ["Sarah Y.", "It's become a tradition for me and my friends to come here for chinese new year dinner...and every year it gets bigger and bigger. This year we had 40+ people around 3 banquet tables. This restaurant isn't very big at all, so the three 12-14 seaters dominated more than 2/3 of the dining room space. The service is top-notch, 5 stars for sure. We had about 15 courses preplanned by the restaurant, brought out one after the other, with all three tables getting the dishes at the same time, hot and fresh. If this little chinese restaurant felt the heat, us diners were none the wiser. they satisfied the incessant requests for water, forks, tea, more water, another plate, hot sauce from 40 people with patience and speed. the owners seem to have been doing a lot of the heavy lifting themselves serving and cooking, which i enjoy seeing at chinese restaurants because it's personal.The food was above average (but not really 5 stars) and for the big part, authentic and traditional. Keep in mind that the pre fixe chinese new year dinner is NOT their typical menu offerings. I think it is more authentically chinese and better prepared than their regular menu. Standouts were the xiao long bao (soup dumplings...probably best in dallas that i've had) that were beautifully plump, filled to the brim with soup, and importantly not leaky, and had tasty meat filling. Also good were the green beans, peking duck, assorted small cold dishes, and the tang yuan dessert (sweet gluttonous rice soup). However, there were several other dishes that i felt like could easily be replicated in an americanized chinese restaurant. For this dinner service, it was $28/per plus tax...which is a fantastic price for the amount and variety of delicious food that we had. We had a lot of leftovers too! They also very gladly handled massive wads of cash and about 20 different credit cards."], ["Laura L.", "Went in for an order to go, and two Chinese employees were sitting at a dining table where customers sit.  They were snapping a huge pile of green beans by hand.  I thought, \"Either this place is totally unprofessional, or that's just a bit of interesting local color.\"  I hoped it was the latter, but found out it was the former.I am a vegetarian and love firm, crispy tofu with black mushrooms in a brown sauce.    There aren't many restaurants that have it on the menu, but most that have the ingredients will make it for me.  I went in to get an order to go and asked them whether they had black mushrooms and firm tofu. The man who waited on me said he'd have to ask the chef.  He came back and said that yes, they did, and they would make it for me.  We agreed on the price.I didn't check my order before leaving, which I should have done.  When I got home, I discovered that they had used the slimy, soft tofu that I dislike and had just barely sauteed it, not deep fried it.  It was yukky.  And the mushrooms were the tiny, everyday common variety.  And the sauce was bland.  Not going back."], ["Alicia T.", "Disappointing.  I grew up going to Shanghai, which still exists in the same shopping center at Preston/LBJ as it did 30 years ago.  Awhile back, while searching on Yelp for restaurants that served Pu-Pu Platters, I stumbled upon some good reviews for Shanghai.  My memories instantly soared back to the dark, clubby dining room, complete with fancy cocktails with plastic animals on the glass rims and searing my own beef skewers over an open flame on the red tablecloths.  The food was always delicious and the booths were rounded and roomy enough to sit a table of 4 comfortably.  Last night, my mother and I decided we would treat my daughter to the memories I held so fondly.  We were let down in more ways than one.Walking into the current incarnation of Shanghai was like a slap in the face.  Instead of roomy booths being cloaked in dark, Chinese mystery, we were greeted by a bright, sunny room with plastic checkered tablecloths.  Our initial shock aside, we sat down in the tiny booth, barely enough room to squeeze in two fairly small adult women and an 11 year-old child.  Cramped but willing to give it a shot, we asked to see a wine list or a drink menu.  Nope.  No liquor license.  Damn....I could have really used a Mai-Tai to curb my growing disappointment.  We decided we could live one meal without booze, so we moved onto the HUGE menu.  Despite the breadth of their massive menu, there was no Pu-Pu Platter.  We were debating on cutting our losses and heading back to Plano to go to Yao Fuzi, but our waitress kept appearing at our table pressuring us to order.  Seriously, this is one of the largest menus I've ever been presented with so her omnipresence was a little annoying (especially since I had no wine to quell my growing agitation.)Giving into pressure, I ordered the spicy dumpling appetizer for the table.  That was the high-note of our meal.  My daughter ordered the spare rib appetizer for her entree.  It was the grossest looking thing I've ever seen.  Seriously, the ribs were bright pink.  Not as in under-cooked pink, but like chemical-laden neon pink.  Needless to say, they were left untouched.  My mom ordered the Moo-Shu pork.  It was decent if on the greasy side.  I ordered the Jumbo Shrimp with Garlic Eggplant.  The shrimp was okay, but the eggplant was barely cooked and void of flavor.Our waitress brought over our check with 3 fortune cookies about 5 minutes after our plates arrived.  She never even bothered asking if everything was okay or how our food tasted, which, I suppose is fine b/c it all pretty much sucked.  However, I will say that the place was very clean which is why I gave it 2 stars instead of only one.We paid our bill and high-tailed it out of Shanghai.  It goes without saying that we won't be back.  Sometimes memories are best left remembered."], ["Sean S.", "This place deserves no Star!!  I am from shanghai, and always looking for good Shanghai food wherever I go.  I normally don't mind service much as long as good food is served.  I got greeted by a nice young hostess.  When she asked me if I want to drink anything, I hesitated and said \"let me take a look\" as I received a menu from her.  Somehow the man (he might be the owner because no owner would've kept anyone like him!) got pissed, and repeatedly said to the poor girl \"just a drink, what the heck does he want to look at?!!\" in Mandarin (I guess he didn't think I was Chinese, or...)So, I threw the menu at his face and walked out."], ["Ariana D.", "This was a delivery order. I ordered the edamame and this was good because it wasn't too salty. I also order the pork roll and this was good...full of pork! The pot stickers were also pretty good. I'll order from them again since the price point is good and the delivery didn't take too long."], ["Jacalyn W.", "Not sure what people are expecting from a small family owned, non-hipster business.  The food is very good...The egg foo young was amazing.  All of our dishes were very tasty - I wish I lived closer.  No it's not PF Chang service, but it's not supposed to be.   It's a neighborhood restaurant the serves tasty, authentic (that may be the problem) Chinese food."], ["Stephen K.", "Man...this was torture. I was the only person there Saturday at lunch. Should've  taken the hint. Scallion pancake was average to poor. XLB dumplings tasted frozen or store bought...yuck. Take my advice: go to Royal China where they are expensive ($8.50) but made by hand right in front of you. Finished with panfried mixed noodles. No flavor to any ingredient. Chewy beef. Ate like 5 bites. Only bright spot: hearing waitress take a phone order and say about 8 times \"the suicide pork comes with rice\". Suicide pork?? Damn. Why did I eat here?  I can only hope it was her accent on sweet and sour pork, but she repeated it so many times that's the only thing I enjoyed in the whole meal. Not coming back."], ["Christina K.", "I came here searching for xiao long bao's (juicy steamed dumplings), although we also ordered green onion pancakes (meh, not impressed). I was pretty impressed by their XLBs: good size, decent amount of soup filling, black vinegar/ginger dipping sauce and 2 choices of fillings - pork and crab powder. I personally would stick to the pork ones since i'm not a fan of crab powder. Don't expect great service...we slurped our water for a good 20 minutes before someone finally got up from hand making their crab rangoons to refill our glasses. However, the prices are decent and their food is very authentic."], ["Yaofu Z.", "The food taste pretty authentic, but tend to be on the salty side. The owner and the waitress seemed to argue over something. And the owners' kids seem to play around in the dining area as well. It is definitely quite casual and family feel. It also seems somewhat empty during meal time."], ["Josh M.", "A very quiet family owned restaurant located right behind spring creek BBQ. The one thing I really recommend is the juicy dumplings located under the appetizer list. Usually when you order soup dumplings in Dallas they come out as wet dumplings. I ate:Green onion pancakeBraised pork ribPork soup dumplingsPeking style pork minced noodleAll of these dishes were pretty good but the dumplings were the main event"], ["M. L.", "Food is mediocre and service is terrible. The only time I would order from them is when nothing else is available."], ["Jessica N.", "Such a great family owned spot for Chinese! They carry both an \"American Chinese\" menu as well as more of an authentic menu.Easy website for online ordering. Offer both delivery, done in and pickup. Would recommend the xiao long bao!!!!"], ["Steven R.", "I was caught between 3-4 stars. I went with three after careful deliberation.The food was pretty fine. It's the same basic Chinese menu as many places but was still delicious. I had beef in a garlic sauce of some sort (spicy). My friend had some strange raw vegetable sort of meal in soup. It was very authentic looking.The menus are very vague about what things are, and some of the wait staff is not so good with their English. I think it would have been good for someone to advise us more on what we were getting. We did ask what something was but got a pretty vague explanation.There was a little boy sitting near us by himself - I believe the child of someone who worked there - playing a video game on his phone or some handheld console that we found somewhat annoying. I wish someone had asked him to turn the volume lower.Service was fast and responsive.I would probably dine here again and feel okay about recommending it. Ultimately a good experience."], ["Katrina M.", "This place has very authentic Chinese food for relatively cheap. The language barrier made communicating with the server a little difficult, which would probably deter most people, but talking to his wife later was quite enjoyable. If you don't know what to get, I suggest trying some of the dishes I ordered:Shanghai style pork - bite size chunks of tender pork braised in a very tasty brown sauce Stewed pork with taro - slices of pork belly braised with slices of taro and steamed bok choi. The meat melts in your mouth. It was a near perfect dish. Soup dumplings aka xiu long bao - the wrapper was a little thick for my liking, but the flavor made these my favorite (compared to Kiran Court and Monkey king noodle company- sorry guys!). Pretty cheap too, if I remember correctly. Drunken chicken - a cold dish of boiled chicken soaked overnight in rice wine and broth. I make this quite a bit at home. While this one was good, it was a little too salty for my liking. I would probably still order it again.. Black bean spicy fish - I don't know if that is the correct name which is unfortunate because I will try to get this again. It was my favorite dish of the night, and definitely rivals the spicy fish dishes I've had at royal sichuan and sichuanese cuisine. We only ordered it after asking our waiter's wife about her favorite fish dish. Sautéed pea vines - again not sure about the name. This was delicious and the veggies tasted very fresh. Shanghai style duck - served cold. Also too salty for my liking. This is the only dish that I would not get again. Overall, I highly recommend this place. Definitely a hidden gem in Dallas. It wasn't the best Chinese food ever but it was very authentic, good, and cheap. Service will be fine if you just say the letter-number codes for each dish."], ["宇佳", "so delicious!!! like it! will come second time!the environment is so good!!! so many kinds of dishes！the cheesecake is so good as well as the soup!"], ["Denise H.", "Not even 1 star! Could barely get though ANYTHING except the hot sour soup. Had potatoe leak pancake, chicken potstickers, Mongolian beef and S/S pork lunch specials. We will NEVER be back even it ass free. Service was good."], ["A S.", "Man and I were doing a roaming food tour of Dallas when we stopped in at Shanghai exclusively for their xiao long bao! They offered two types of the juicy soup dumplings (on the appetizer menu): pork and pork with crab. We ordered the pork and sat back for a 15 minute wait during a very slow mid-afternoon. At this point, all we could do was the inspect the scenery: typical Chinese restaurant with about 20 plastic covered tables and booths, posters of Asian cities plastered on the wall, and golden cat and buddha greeters at the door. No flatscreen tv mentioned in earlier Yelps, but there was a laptop sitting at a back table blaring Asian sports and variety shows. The menu itself seemed Americanized, with descriptions fully rendered in English, but there were definitely some authentic gems listed. Too bad, we were on our one-dish tour...but we are definitely intrigued enough to come back for more.The xiao long bao of course were great! I loved that these were big, super juicy and well seasoned. I've had Royal China and Jeng Chi and found theirs anemic and dry, so I have to say these are the best I've tried yet.Service was admittedly slow-paced (after all, we had ordered only one make-from-scratch appetizer split between two people) and typical of other ethnic Chinese places we usually haunt, meaning we're no strangers to neglect. Despite that the staff were sitting down to their own lunch by the time we polished off the XLB, they still managed to take care of our refills and our check.We'll be back."], ["Melissa R.", "Honestly the food is good but to be honest the customer service is terrible. Our waitress only came once to check on us and didn't even refill out drinks. We had to literally call for her across the room to get us drinks."], ["TJ O.", "We have really enjoyed this place for chinese delivery (a dozen times), until dinner was delivered tonight. They did not get our order correct. They were 0 for 2 getting the entrées right (the chicken was OK and the beef was not edible). Sent soggy shrimp eggroll instead of pork eggroll that we ordered. Owner did not make it right so they have lost a loyal customer. This is just plain BAD business. Highly recommend you go somewhere else. They don't even deserve 1 star!"], ["Amanda Y.", "The salad \"ma lan xiang gan\" is my favourite and you really need to try it:)  Also you have to get the Xiao Long Bao of course~the filling was juicy and  had excellent flavor.Drunken Chicken is on average.The last thing I will order again is the pork ribs which is hard to eat.The waitress is a little slow. I will go there again to try some new."], ["Anne S.", "Worst. Service. Ever.  I have literally NEVER had such a bad experience.  Yeah, it's \"authentic Chinese\" which means \"authentic service\" which means crappy service, and I'm used to that.  But this service was in a league of its own: absolutely jaw-droppingly bad.First of all, we walk in and aren't even greeted for a good five minutes.  Finally, someone takes us to a table.  We're seated RIGHT under a TV that's so deafeningly loud that we can't even hear each other.  We ask them to turn it down, and it takes them about 30 minutes to finally get around to doing that.Two tables are seated immediately after us -- one couple and one group of five.  Both of those tables are delivered menus and drinks first.  Both of those tables are delivered their food first.  Once we finally get our menus, the waitress returns in under a minute to take our order.  When we tell her we're not ready (hello!!), she ignores us for the next fifteen minutes.  We finally order and proceed to watch those two other tables get their food -- including some of the same dishes we ordered, like soup dumplings -- before us.Another 30 minutes goes by without a single waitress stopping to ask how we're doing or refill our drinks or anything.  We never got a single refill the entire evening, and considering how salty all the dishes were, I was feeling almost dehydrated by the end of the meal.  Oh, and my boyfriend's tea was served as a tea bag in a cup of hot water, instead of the traditional pot-and-tea-leaves that all the other tables around us received.  He was not happy about that.Finally we get our food -- some of it, at least: soup dumplings and a plate of steamed veggies.  No sign of our two main dishes.  We finish the soup dumplings and the veggies.  They finally bring us our first main dish (duck in an admittedly yummy but sugary and salty sauce).  This is about an hour after we ordered.  We eat the duck (or what there is to eat of it, since it's mostly bones and wing pieces with no meat).  We're still waiting for our other entree, walnut prawns.  We watch another table near us get a plate of walnut prawns.Almost TWO HOURS after we first ordered, we give up on our second entree.  Not a single waitress in the place has bothered to stop by our table the entire evening.  Our drinks are never refilled, and only 1 out of 2 entrees ever arrives.  We give up on the walnut prawns and decide to ask for a check.  We can't even get a waitress to pay attention to our waving arms to get us a check.My boyfriend walks up to the counter, where about three OTHER customers have taken it upon themselves to dig through the pile of bills, find theirs, and bitterly fork over some money so they can leave.  (But hey, I bet they at least got all of their food.)  When my boyfriend finds our bill and basically tackles a woman so that he can pay, she mentions that no one is leaving tips tonight.  NO SHIT.  In fact, I was so pissed that I was trying to convince him to walk out with me without even paying.  If I had been able to speak Chinese, I would have demanded to have our meal comped.  But my boyfriend, being a softie, feels bad for the lady and leaves a tip anyway.I snag five fortune cookies on our way out so that we at least get our money's worth out of the tip.  I'm about to tell the woman standing by the door (who has been standing there waiting for someone to help her for almost an HOUR) not to bother, but at that moment, she gives up anyway and leaves without her takeout order.  Good call.The lady who finally took my boyfriend's money apologized for forgetting our entree and said that they were just exceptionally busy.  Um, okay, you have a TINY restaurant with an ABUNDANCE of waitresses.  There is NO EXCUSE for service this bad.  They had absolutely NO system for waiting tables (we never even had a regular waitress).Furthermore, why did the two tables near us get their food before us?  And actually GET their food?  Was it because our table had me, the only white person in the place?  Man, I hope not.  I don't even want to go there.Horrible, horrible, HORRIBLE.  I'd sooner starve than go back there (because you'll starve or die of dehydration either way, but you'll save money by not going).UPDATE: I GOT FOOD POISONING LATER THAT NIGHT!!!  YAAAY!!!  {death glares}"], ["S Z.", "Horrible experience we had at the restaurant at Christmas Eve. The service was lousy, slow and unprofessional, using untrained serving staff, totally unacceptable. None of the dishes was freshly prepared. We talked to the table next to us and they shared symmetrical feelings. It was so funny. They disgraced chinese cuisine industry in our country."], ["Tim M.", "This used to be one of our favorite restaurants.  However the restuarant was recently bought by one of the employees and has entered a decline.  The quality of the food has completely changed.  I ordered egg foo young twice, and it came completely burned, as did the scallion pancake.Portion sizes are inconsistent and the server had a hard time speaking English, so half of what we ordered never appeared.  Also, the atmosphere is very depressing.  Like the previous reviewer there is a little kid \"haunting' the dining room playing video games and watching movies.  It is very sad."], ["Una H.", "I ventured out with my sis Christina H. long and far, all the way to Shanghai (Restaurant) to find the perfect xiao long bao. Steamed soup dumplings hot off the steam cooker, put on the spoon with a couple soft reassuring breaths on the dumpling to cool it off. Bringing it into my mouth to savour the taste that is.. wha.. what is this!? This isn't what I came for!? All the reviews on Yelp and Chowhound and Citysearch have all blindsided me on this one. Perhaps it was some sort of sick karma that I was led to this so called dumpling house that specialized in my favorite type of dumpling. I look away, disgusted at what I bit into. The meat is cold, even though it gives off the impression of freshly steamed, and that alone just makes me spit it out in disgust. Xiao long bao? Not coming back.Next, I move to my fried rice. I like fried rice because one, I can eat at a Chinese establishment without looking like I don't know what else I'm ordering and two, I just like fried rice. However, Shanghai Restaurant was just egging me on, making me dislike it even more. It was oily, days old rice (I can tolerate a few days, but this rice was.. at least a week + taste wise) and drowned in soy sauce and saltiness.Thanks for the horrible memories!"]]}