{"la Madeleine": [], "Toulouse Café and Bar": [["Tatyana N.", "Was looking for Parisian cuisine and decided to try them out for lunch. They have an outside patio sitting that's really nice, can be nosy as its right by the road. The ambiance was good but the music was kinda off for the atmosphere. The manager was really friendly and he let me suggest some music which he liked so much I got comped a dessert.    I had the lobster bisque with a side salad. The bisque was the best I've had in Dallas so far but food quality doesn't justify the prices which were more on the higher side.     The crémé brûlée was also average. Still in search for a better Parisian experience in Dallas"], ["Jessica S.", "Great food and service. The bloody Mary's have a lot of flavor and they can substitute vodka for tequila in it upon request, giving it even more flavor. It was a bit chilly on the enclosed air conditioned patio, but had a great view. For the price was expecting larger portions, our omelets were half the size of omelets we've had at other restaurants, and they charged a dollar to add onions to the omelet. The service was great, all we had to do was look up and the waiter was at our table. Overall out experience was great, and will be back."], ["Thuy L.", "this place is a nice place for brunch, even though the place is busy, but the wait wasn't very long.  we shared several dishes but one of my favorite was the poulet roti.  the chicken was nice and tender; even the white meat is juicy! the sauce  was light which definitely compliment the spinach and cherry tomatoes. everything tied well together.  however the service wasn't that great.  the waiter was forgetful and wasn't that attentive.  initially I was only going to give this place a 3 star rating, but the waiter I had the first time I was there was a lot better!"], ["Kaia V.", "I've only ever been to Toulouse twice. The first time was a few years ago, and I must have totally ordered the wrong thing because I didn't come back until friends dragged me here on what I'll refer to henceforth as \"the duck hunt\". Fast forward to the other night, after 10pm, Toulouse is not only still open, still serving food, but also pretty empty. Great news for us - excellent service, quick food delivery, and intimate setting. I think everything we had could be written up as a stand out dish - the duck and chicken were both superbly rendered with crispy skin and cooked to the appropriate wellness. The gnocchi were also fantastic - perfect little doughy pillows. I wish it had been served with a brown butter sauce as described on the menu, but the red sauce accompanying it was pretty tasty too. Don't even get me started on the garlic and herb butter sauce surrounding the escargot. That plus their warm table bread was so good I can't imagine why whoever I was with when I came here the first time let me leave without stuffing that kind of delicious into my face. Wine by the glass is about $8-10. They had a nice chenin blanc when I was there the other day that was both affordable and paired well with the variety of different types of poultry and pasta/bread that I shared with my generous and obviously-educated-in-what-to-order-at-Toulouse dining companions. If you're hungry after 10pm on a weekday for duck and or snail, this is the spot. Parking is also plentiful in the area (2hr spots all around Knox) if you dine a bit on the late side."], ["Allison B.", "Fabulous for brunch and lunch! This place has excellent staff and menu. I suggest the bistro chop salad with Salmon and a glass of rose. Can't go wrong!"], ["Rob K.", "Highly recommended.We had a light New Zealand pinot with our meals. I had the trout almondine with roasted red baby potatoes and green beans. It was delicious, although I had to set my mind right about all the glorious melted butter on the fish.Gal Pal had the Spring Crab Rissotto and, while she didn't lick the bowl clean, I could see that she was tempted.Desserts were an amazing Grand Marnier souffle and a very decadent chocolate mousse. Both were delicious. The decor is old school French bistro, there are tables on the patio as well as within the comfy dining area. Our waiter's service was exactly the way I like it: helpful, but unobtrusive.I took way too long to try this wonderful French restaurant. Don't make my mistake, you need to visit it, just please leave a chair and a dessert spoon free for me!"], ["Ankita J.", "Good salads and cheese platter.I am a fan of a cheese and a french bread and this place just had the best of what i wanted. I loved the food and next time i will have creme B."], ["Eve N.", "The place is very nice and the service top notch. Between the 3 of us, we had the quiche, the calamari, lobster salad and the scallops with ratatouille. The food was very good, except the lobster salad - the salad itself was scrumptious, except the lobster that didn't taste quite right (I don't know if it wasn't fresh or it was previously frozen...). Great for people watching too. All in all, I would go back and recommend it to others. It was pricey but worth it, and you definitely got what you paid for. The staff was so nice and inviting, definitely another reason to go back, attentive but not always hovering over. Can't say enough good things, great experience."], ["J B.", "In early November on a trip to Dallas, we went to Toulouse. It was still warm enough to eat outside under their quaint French awning. The food and the service were wonderful and warm, like a Parisian Bistro. We ate: The Petite Gougere...I hadn't had these since I was in France many years ago. They were so good-addictive-we could've eaten and entire basket of them... Mussels Green Room. I loved the slight piquant. My husband had the Toulouse Salad and loved it. Then we couldn't help but order some french fries...and they were so good. Cannot wait to go back for a Croque Madame- next time."], ["Robert D.", "Came in for brunch and wow!  I had the Beef Hash and first words out of my mouth after the first bite was wow.  Not your mother's southern corned beef hash, the beef tasted like slow cooked short rib meat, incredible.  The potatoes were perfectly cooked along with the poached eggs. All of the flavors melded together to make a fantastic pallet pleaser.My wife had a Shrimp BLT and it too was excellent.  They don't skimp on the shrimp.  The service was top notch and polite without being intrusive.  I highly recommend this place."], ["Dazden C.", "Had brunch one Saturday morning....fantastic service and food"], ["Carolyn H.", "Location, location, location!  I love this place's vibe and it sits so close to the Katy you can practically feel the wind when the bikes pass.  Ok maybe not that close.But the patio is so charming that it makes you want to order just one more glass and stay awhile.Over the years (and most recently this weekend) I've had brunch, lunch, dinner and dessert here.  The food isn't always perfect...but it isn't ever downright bad, either.  Usually it is good, and it's French, and there are beignets and café au lait on the menu, so what's not to love?  ...Maybe just the attitude of the place.  It seems that 50% of the time, the attitude of the owners and staff is a bit TOO French..."], ["Tami V.", "Went here for brunch and it was perfect. The patio was super nice. I had no idea about the area and where I should park so I called them to ask and they were beyond friendly and helped me out. We didn't have to wait a second to get our table. The table was a bit too small for my appetite but it wasn't that bad. I got the cream cheese and smoked salmon bagel as well as the french onion soup. The soup wasn't the best but the bagel was nicely displayed and tasted fresh. I was happy I didn't give up this place to go have brunch in any other place!"], ["A K.", "Went to this cute little place for Sunday brunch. They have indoor seating and a covered patio. We opted for the covered patio to be seated immediately. Despite the chill coming to Dallas, it was quite comfortable and you get a great view of Katy Trail. Although it looked a little crowded with all the tables they are able to fit on the patio, it didn't feel that way at all. The service was prompt and friendly. I didn't feel like we were ever waiting for food or the bill. Also, we told the waitress we were sharing two dishes, and she was kind enough to serve them on separate plates!We tried the eggs florentine and the orange french toast. Both were delicious and came in perfect portion sizes. The eggs florentine is like an eggs benedict with lump crab and vegetables instead of canadian bacon. The orange french toast is infused with an orange flavor and comes with a side of berries, bananas, and cream. My plates were wiped clean. They serve Mighty Leaf tea for any tea drinkers out there. We wanted to try the beignets with cappuccino sauce, but held off thinking it would be too much food. They also have a lot of other brunch options that sound amazing. Will probably be coming back soon."], ["Ryan V.", "Excellent. I had the lobster risotto and creme brûlée; it was incredible. Well the creme brûlée was alright. It's definitely not my favorite dessert. I will definitely go back. Liked the ambience as well."], ["R C.", "I've been here for brunch as well as dinner and both dining experiences were superb.  It is located adjacent to Taverna and share the same valet service.  My boyfriend and I were lucky and seated immediately on a late Sunday morning on the covered patio, which has air conditioning.  We thoroughly enjoyed our eggs benedict and croque madame with coffee, while watching various folk pass by on the Katy Trail.  I'm a sucker for bread and butter and if you are too, you will definitely enjoy the butter here, which is creamy, with the right hint of savoriness.  My second occasion was two weeks later for a girlfriends birthday and again the experience was quite wonderful.  The braised short ribs were tender and the chanterelle mushrooms just added that extra umph to make your tastebuds dance.  My friends' seared scallops and steaks looked delicious, but I was too involved with my own dish to sample :).  At the end I had to go back to the bread and butter! Come to Toulouse for a wonderful dining experience."], ["Orna G.", "Great breakfast. Very friendly service. The food is exactly what I wanted, tasted good but was not too calorie laden."], ["Renita T.", "Went here for dinner with a group of 8 and we were all so pleased! The food was delicious! The truffle Mac and cheese was rich and decadent and the fries were so good! The Bellini I had was yummy and light!"], ["Shannon A.", "This place is just ok. Went there for brunch and felt like the choices were very limited. And also the mimosa, which was less than 8 oz, it was $8.50. For how small it was, I thought it was the $1 mimosa specials going on but nope."], ["Gina I.", "I have never had such amazing beignet in my life!!! I still crave it from Boston. Everything else was okay but I was so impressed by the beignets, I hunting for them in Boston."]], "Cacharel Restaurant": [["Steve H.", "Cacharel has quickly become our go to special celebration restaurant.  My wife and I went to celebrate our 25th anniversary on this occasion.  What a great time we had.  We were seated at a table with the \"Billion $ View\" (it prominently features AT&T Stadium for the uninitiated).  The service was crisp without being intrusive.  The food was absolutely fantastic.  In fact, I highly recommend the upcharge for the Buffalo steak.  It was easily one of the best steaks I have had in some time.  The desserts are great, too.  Where else can you have a half a peach with some ice cream and still talk about it months later.My only disappointment echoes one other post, the staff does not seem to pay any attention to the suggestions/notes left on Open Table.  I have done that the past couple of trips, but to no avail.  Oh, well.  Guess I'll either start calling ahead or telling the host/hostess."], ["Barb J.", "Oh Cacharel. Your cuisine is so overpriced, but if that's the case, it should be all about the dining experience. Abacus you \"ain't.\" I had a Groupon. They require you to make reservations and only go for the evening meal. Of course they do. N'est pas? I called on an early Saturday evening. Had plans to celebrate my friend's birthday. She was under the weather so I asked if they could accommodate a party of one in a Saturday night. I was told, \"just come, just come.\"And so I did. I was seated very promptly the furthest away from the windows. I was next to another single lady. Honestly, I live not far from Six Flags. A ninth floor view is not going to tear me up if I don't get it.What I wanted for a very expensive meal (cheapest is $50 prix fixe, don't drink anything but water). As they bring me a beautiful asparagus soup, I heard the other lady they placed in a corner thank her Garçon. Any time he addressed her? He addressed her as \"Dear.\" We spoke after she paid her check. She agreed the \"dear\" was very offensive. But she just wanted to spoil herself about once a month. I've been spoiled, and Cacharel is not it, even with the $84 price tag on a steak. I'm used to having the same person as my server. I felt like a leftover. One brought me a wine list and later a nice fume blanc. Another took my order and maybe brought my soup. After that, my food was slapped on my table and then I was ignored. Cacharel...Georges Cinq you are not!!! I did have a very nice meal. The pork chop was interesting. Even though the meat closest to the bone was blood red, I prefer a juicy pork chop instead of a dry one. The Irish Creme Brûlée was nowhere close to how great Pappadeaux's is. But then this is all about the nice dining experience. Oh, and because I was a single woman dining there, I could not get the attention of any of my many, many different servers to bring me the check. In disgust, I stood, went to the Hostess stand, and requested my check.As a single party of one (Ha!), go across the street to Saltgrass. I have 2 more groupons. Call me an idiot. Never bought a Groupon before. I'm stuck having to go back here. I'll share my pictures."], ["Carmen N.", "My boyfriend and I were greeted by the staff at the door. Everyone was very helpful and welcoming. The food was amazing he had the Kobe steak and I had the diet mignon. Our view was beautiful. We used a grupon so the price wasn't too bad without it,it is pricey!"], ["Dianne M.", "When we visit Dallas to see our daughter, we visit Cacharel.  Love the location, ambience and FOOD!"], ["LIberty K.", "Thanks for the owners replying to my review about putting in a bar here somewhere that faces the stadiums etc, for Arlington residents and tourists. You asked me how I heard about you? I have lived in North Arlington all my life, so grew up going to your restaurant as a child. At 34 years of age now I go to Piccolo Mondo when I want a cocktail and dinner, or if Im flying solo to the bar. The bar there does not take away from the fine dining, In fact it adds to it. Just the type of crowd a 5 star restaurant brings in is refined, so noise is never a problem."], ["Bill R.", "For those unfamiliar, this restaurant is on the ninth floor of a bank building. The beef menu is a la carte and there's a price fixe menu for everything else. It includes an app, entree and dessert. For $49. Good wine list with reasonably priced bottles. They bring bread to the table, but it is on par with the most average store bought dinner rolls. Needs improvement. Started with soup of the day. Butternut squash. It tasted good, but it had the consistency of water. Not sure how you get a soup that thin. Entree was pan seared salmon. Excellent preparation and well executed. Perfect sear on the outside and tender throughout. Sits on a bed of diced celery root, snow peas, and cherry tomatoes. Very clean dish. They told me I couldn't have the lava cake for dessert. No explanation...even when i pressed for one. Whatever. Second choice was chocolate soufflé. It was really good and came with fresh whipped cream on the side. I should mention the terrific staff. They are all courteous and attentive. Great atmosphere for date night. Outstanding views overlooking the football stadium. Cacharel is clearly a respected establishment in the area. They've done something right for 30 years. Aside from my gripe over the watery butternut squash soup and not having the lava cake, I'd say thumbs up."], ["Damon D.", "Greeted at the front door by the owner was only the beginning of what turned out to be a fabulous food fiesta. Everything we ordered was top flight. The service was personal to the point where it was if we had our own private waiter. The most difficult thing is deciding what it is you're going to order. If you have never been there go, but don't let the location throw ya. Great views, service and food await you."], ["Christy C.", "I want to start out by saying this place used to be my favorite place. My husband took me last night and we were very disappointed. We drove and hour to get there and once we sat down we were ready to leave! I made reservations on open table and it asked me if it was a special occasion and I explained yes and that we would prefer to be by a window. I think the restaurant ignores this.Before going we looked at the online menu and we had our heart set on a particular entree. We get there and that's not even an option. I'm a little irritated because first we couldn't get the table we wanted and now they don't have the meal I want. I asked why do they have online menus if you don't serve this food? They said it was for an example. So it's an example of food they don't have. That's dumb! So we left! Won't be back. I just wanted a perfect evening with my husband and this restaurant ruined it!"], ["Brittany M.", "Great dining experience in Arlington. I would recommend this place to anyone visiting the area and looking for a great meal. Service was great and ambiance couldn't be better. Five stars from me!"], ["D And C W.", "This place was okay for me. Went with the in-laws for Christmas Eve dinner. I got a three-course meal with the watercress salad, the salmon entree, and the creme brulee. The salad was good and presented well. The salmon itself was good, but I didn't care for how it was paired with the ratatouille. Also, the ratatouille had a nice taste but the texture was a bit mushy for me. My favorite part of the meal was the creme brulee. D got steak, which was yummy. If we ever go back, he wants to try the lamb, and I'd like to try the pork chops.(Update Jan 21: bumping up one more star for the owner because he seems to definitely care about his place, and I think if I tried a different dish, I'd like it more.)"], ["Lauren M.", "Hubby and I were here for Restaurant Week 2013 and had reservations at 7:15pm.  No wait to be seated and I had requested a table at the window, which they accommodated.  Not very crowded, maybe 5 other tables during our whole visit.Hubby started with the gazpacho which was light, tasty and well-presented.  I opted for the Caesar salad, which was fair, but nothing special.  Our waiter, Keith, was professional, polite and very quick.  Water refills were immediate when the glass was half empty.Hubby got the yellow tuna with the peppercorn sauce and he said it was better than he expected.  Very salty and he is a salt maniac.  I got the beef medallions, medium rare, also with the salty salty peppercorn sauce.  I am also a salt freak, so if we noticed how salty it was, I imagine it would be inedible for many.I got the Irish Cream creme brûlée, which was perfectly crispy in top, filled with velvety custard with a fair amount of Irish cream flavor.  Hubby had the signature chocolate soufflé, which never disappoints.Overall, I would go three stars, but Keith our waiter and the table with a view bought them another star.  The normal prices aren't ridiculous, so we will likely go back again."], ["Glenn V.", "The service, the ambiance and the food was great! Great wine selection as well."], ["Larry M.", "My good friends were celebrating a milestone anniversary on Monday, June 8th and the restaurant was very accommodating to allow me to pay for their dinner even though I was out of town.  They made their evening special.  I look forward to dining again at this outstanding restaurant on my next visit to Arlington.  Thanks to the staff!"], ["Abcd E.", "This is one of the best place for French food in the DFW area. We have tried both the French Room and Saint Emillion. This place is better, and less pretentious than the French room, and can match SE in terms of food.In particular, i have a very nice escargot dish where the Chef has used a clever sauce to make escargot light (typical escargot dish is greasy) and tasty. My wife has a scallop dish which combines good fresh scallop (expected) and a light salad with sauce that complement both. The highlight, however, is the souffle. My wife is a big souffle affectionate and we have had souffle all over the country (including michelin star restaurants). This place has one of the best souffle. The  chocolate version is done in a classical manner (with whip cream instead of sauce though). There is no fancy tricks but just good old fashion quality control.In fact, she likes it so much that we went back again within a week (which is unusual for us to hit the same French restaurant within such a short period of time). The second time around, we are impressed by both the appetizer (scallop + risotto), soup (a mushroom soup), entree (buffalo tenderloin, and duck breast). Of course, we had souffle again. This time, we have both the chocolate, and apricot. The apricot version include a bit of macadamian nuts which contrasts well with the soft texture of souffle.It is quite apparent that the focus of this place is food. The care of preparation has shined through. We certainly will be going back."], ["Porscha J.", "Great food and great service. Reasonable prices and great portions. I can't wait to go back. The Pumpkin soup and Pecan crusted chicken is a must try."], ["Emily Y.", "OK, so I prepared myself to be underwhelmed - when I see a restaurant located atop a generic office building with a prix fixe menu, I pretty much know what to expect. Dined here to celebrate my Aunt's birthday - it's one of her favorite places in town. Overall we had a very pleasant experience. The ambiance is very peaceful and not cheesy at all like you sometimes see in these places. It was not crowded at all, so we were able to hear each other talk. My cousins' 8 and 13 year old boys were with us, and our waiter was able to fix them chicken tender plates the pickiest eater would love. It was refreshing to not have gigantic portions of anything set down in front of me. My scallop with the creamed leeks was delightful, and my family enjoyed the endive salad and pumpkin soup as well. The buffalo tenderloin was prepared wonderfully (tender and not overcooked), and the giant pork chop was perfect, according to my uncle. As far as desserts go, the chocolate soufflé was just meh, but the crème brule is not to be missed. I wouldn't rush back here on my own, but if my aunt invited me, I would not say no. Overall a very pleasant experience and a nice place to celebrate special occasions. It is also hilarious to hear the screams coming from Six Flags as you walk from your car inside the building. Torn between 3 and 4 stars, so I will go with 4."], ["Joyce G.", "I recently moved to Arlington since losing my beloved husband of 32 years and after hearing wonderful reviews I decided to come for my 62nd birthday.  I had the pecan crusted chicken with the basil mashed potatoes and for dessert the chocolate soufflé.  Most delicious and the restaurant is lovely.  Also noticed a nice gentleman speaking French seated across the room from me.  A most lovely experience on a warm sunny day.  Joyce"], ["Tiffany T.", "My best friend and I were in Arlington for a well deserved vacation. We decided to try something different and stopped here. The service was great, the food was absolutely amazing. She ordered the pork ribs and I ordered the duck breast. Both were seasoned perfectly. Nothing was dry, overcooked or undercooked. Best pork ribs and duck breast we've ever eaten, hands down. Presentation was beautiful. We ate our meals as the sun was setting. Overall wonderful experience.Only thing was that the restaurant was located inside of an unmarked office building next to a few other office buildings. We had a bit of trouble figuring out where the restaurant actually was, but when we found it, we were not disappointed."], ["Robert C.", "This hidden restaurant is on the 9th floor of an unassuming office building is a great place for an upscale luncheon or a date with a Francophole. The ambience is good and the view of Arlington is second only to the Six Flags tower observation deck. The lunch prices are a bit steep (although better than dinner) but the cuisine is authentically French. No other options like this in Arlington. The wine is a bit pricey; Even bottles of German table whites with a twist top commanded 3-5x the store price. To clarify on my rating, I give this place a solid 3- 3 1/2 stars rated only against fine dining restaurants."], ["Judy D.", "Awesome food, superb service, classy place! Well worth the money! Great place to celebrate a special occasion."], ["Mimi T.", "My aunt and I came here for dinner tonight with a 9PM reservation. Unfortunately, we didn't show up until 9:30PM (her fault). This is my 4th time at the restaurant, and it was the worst service that I've experienced here. Probably because we came in so late. We never got our waters refilled. I ordered hot tea, and no one gave me more water for my tea.The food was good. I had the sea bass with cauliflower risotto. I think that's my favorite dish, and 2nd would be the scallops. The chocolate souffle is always a pleasure to have. Soup of the day was pumpkin- tasty after the initial 2 slurps. It was quite an acquired taste.Our main waiter was very unhappy when we showed him our Groupon. Too bad, you have to accept it, Sir! I've had this guy as a waiter before, and he was always nice except for tonight. Probably because of our timing.TIP: DON'T MAKE RESERVATIONS HERE PAST 8PM!!"], ["Tiffany D.", "I have been hearing about Cacharel all my life and was a little underwhelmed honestly. The escargot appetizer was the highlight of the night. It quickly went downhill from there. My entree was the chicken crepe. It was a little too salty and rich. i would suggest getting something else. For dessert, I had the Gran Marnier souffle. It was beautiful but way too sweet for my liking.I'm not going to dissuade you from coming here, I think everyone should experience this place. It's a little gem inside Arlington. I would highly suggest you not order what I had. Thankfully, the menu is constantly changing."], ["Lynn F.", "Excellent food. Excellent service. Thank you Yelp for directing me to Cacharel after reading the positive reviews. They were right on target!"], ["Wendell H.", "The food is very good, quite upscale.  I've been there 4 times and have always enjoyed my food and those with me did too.  I've never had poor service, my experience has been quite the contrary.  The view is interesting, though not breathtaking.  Clearly, whatever its faults or shortcomings, this restaurant is in a league by itself in Arlington."], ["Stella W.", "Because we bought a Groupon a long time ago and it was about to expire at the end of the month, so we decided to visit this place on a Friday night. At first we were a bit worried about the service because of the negative reviews by some of the Yelpers.  However to our surprise, our server was very attentive and nice.  We were seated next to the windows and it had a view of the parking lot, freeway and Six Flags. The food was quite ok too, but we don't think it is worth it at the regular price without a Groupon."], ["Portia H.", "Unless you like being robbed, STAY FAR, FAR AWAY!!! $171 for both got us:Luis and I went here for my birthday, Nov 29, 2012. I had called ahead and reseted a time.  We got there on time but, we had to wait for a table in the foyer and I was tempted bolt,  even called my my alternative birthday plan, the Improv. But to my dismay we decided to stay:( The ONLY authentic thing about this French restaurant is the host. He's from France. When the host first took us to a table is it was far from the scenic window? And that's the draw for this restaurant. It faces eastward and since it's on the ninth floor you have a view of Six Flags. The reason we went here is because we'd gone before.and we didn't have to leave town.   It was going to be our close \"go to\" place in Arlington.  NOT!!! They have a fixed menu and we would have been smart to not veer from it.   But it was my birthday so we decided to live it up and order the steak and lobster. The concept at this restaurant is to order the complete meal including dessert after being seated.  The last time we visited Cacharel we allowed ourselves to be bum rushed into ordering the dessert soufflé as soon as we were seated, and were disappointed. So we said up front that we would skip dessert this time because it took an act of God for us to eat the lousy soufflé last time that just \"had to be ordered up front with the meal\" so that they could prepare it.  They shouldn't have bothered.When the lobster arrived the waiter commenced to slice the tail meat from the shell. I noticed that he didn't have to tug...Hum?  When I bit into the lobster I could see why he didn't have to tug. The cook went WAY past the time that the lobster changed from opaque to translucent. It tasted like briny mush in my mouth. Where was the fresh sweet taste of the lobster?  Pas ici!   Accompanying the poor excuse for lobster tail was a little piece of steak. The baked potato had been baked in the microwave and it paled in comparison to a Wendy's baked potato.  It arrived at the table mushy, no crust, lukewarm, barely warm enough to melt the butter.  The plates weren't hot. At Del Friscos they warn you about the hot plate, go there instead!  Cacharel's is so lousy it is not even worth a review. The restaurant uses the building's bathroom so you leave the ambiance of the restaurant and walk out into the flourescently lit hall turn right and use the \"common area\" restroom.  It is like being at a high school recital. Cacharel should get right behind Jerry Jones and go looking for some talent to cook at this restaurant."], ["Mark L.", "Great food and great place for a romantic evening."], ["KW M.", "We went to Cacharel for Mother's Day.  Arlington is not a big city so while they boast views, there's really nothing to be viewed.  If you want to see the Cowboys stadium, go to an event there.  The steak was poor quality and cooked medium had no pink, out or inner. Dinner rolls served without butter. Caesar salad served without dressing.  I called to discuss our experience and the manager, Brandy talked the entire phone call and told me it was their best Mother's Day ever and that she has a masters degree.  I am not sure what that had to do with our family's experience.  If you are looking for a fine dining experience, go to Dallas or Ft. Worth."], ["Brian J.", "Upscale Atmosphere, Excellent Food, and Attentive Service.  The view of Arlington's Entertainment District is neat at sunset.  They had a live guitar playing romantic music.We went for restaurant week, and my wife ordered off that fixed price menu.  I was not excited about the first course offerings, so I went with the al carte menu.Highlights were my Filet, Potato Gratin (insanely good), & Creamed Corn.  My wife fell in love with her sea scallop appetizer and beef medallions.  We both finished with their rightfully famous Chocolate Souffle.  Yum."], ["Chuck M.", "We dined at the restaurant last night to celebrate our 21st anniversary. John, our server, and the staff, took excellent care of us. My wife had the chicken entrée and I had the duck. Both entrées were beautifully presented, seasoned perfectly and incredibly delicious. The whole evening was very memorable and a wonderful way to celebrate a milestone in ones life. For dessert, my wife had the Irish Cream Cream Brulee and I had Cacharel's signature dessert, the chocolate souffle. What a way to end the evening, the desserts were decadent. If you want a special evening out, I highly recommend Cacharel in Arlington."], ["Mike P.", "Very good atmosphere and good food. Beautiful view."], ["Lisa F.", "Simply amazing! Can't tell you how many amazing meals we have had there. The environment and customer service are stellar as well. This is our go-to place for celebrations, and we get here as much as we can. They never let us down. If you haven't tried their desserts, you aren't truly living, btw!"], ["Jenn M.", "I went here for a Valentines Day dinner, while the food was tasty it was highly overpriced. It's a set price menu so even if I didn't want an appetizer I was charged for one anyways. With that being said the food was delicious. I had the baked scallop starter and it was surprisingly a bigger portion than expected. I then had the beef, it was perfectly cooked but the potato and steamed asparagus sides were minimal. I would have come here for dessert alone, I had the Baileys crime brûlée....perfection and my date had the chocolate soufflé also incredible. Overall, if I had the option of having just an appetizer and dessert I would defiantly return, but while my entree was good I cold have passed on it. But if you are looking for a ritzy night out in Arlington this might be a good choice."], ["Andrew L.", "Admittedly, nice places to eat are scarce in the Arlington area. There's chain restaurants everywhere you look and the only non-chains tend to be Asian or Mexican. Cacherel is a breath of fresh air amid the bright lights and subpar food (I'm looking at you highlands area). My gf went here on a date after getting tired and frustrated at the lack of good food around here. They have a fixed menu which includes an appetizer, main, and dessert, or you can choose from their full menu. Personally, I think $50 is a great deal for a well prepared meal. Their escargot with mushrooms, grapes, and garlic was excellent. My gf got a very substantial pork chop with curry, and I got bronzini with vegetables. Both were cooked perfectly and tasted great. The creme brule was standard as was their chocolate soufflé, but still well done and delicious. If you want a nice, classic french meal that's well executed with nice atmosphere and service, check this place out. Just don't forget to dress up."], ["Ann T.", "I had one of the most pleasant dining experiences ever at Cacharel. And for that, I give this restaurant five stars. Our server was wonderful, and the food was beautiful. My favorite part of the meal was the pumpkin soufflé (seasonal), and I loved the view. Some say that Six Flags is the only view you get, but I actually saw DFW and all its beauty."], ["Tim G.", "I went here a while back and had an amazing experience. This used to be a place that got around by word of mouth. Now it seems to not be so exclusive. I heard about this place originally from our limo driver while going to a concert a friend was playing at.Service was on par with fine dining and our food was a hit. The wife had Duck and butternut squash soup and I had Buffalo with the same soup. I can say that the buffalo was probably the best piece of meat I've ever had. There is no other place that can beat my cooking when it comes to meat, this one did. The vegitables were crisp and fresh and soup was delectable. For dessert we shared the soufflé that was out of this world! If you have not been here and want a great dinner with your significant other, drop by. Make it around sunset and be sure to get the table that is all the way to the window where you can see downtown Dallas and Ft Worth."], ["Brandy C.", "I went here with a huge group and was absolutely blown away. Ohmygawshwowthatwasgood! Coming here, the place was very unassuming. It's an office building that looks like where I'd go to get my teeth cleaned. But you go up the elevator and that's where magic happens. So many amazing dishes and drinks served with great service.There is a fixed menu and a regular menu. I went with the regular and got the buffalo. There aren't words to describe how good this was. No words. I could have cut it with fork it was so tender, juicy and flavorful. If that wasn't enough, I had some of almost all of the sides (creamed corn, spinach, mashed potatoes, gratin potatoes, more) and they were all amazing. Then I stuck my spoon in a couple people's desserts. I'm pretty sure there's nothing they do wrong here, but if I ever get the chance to come back, I'm all over that buffalo and gratin. BTW, this place is just a bit away from DFW airport (where we were staying and holding meetings), so if you can get away for a bit, DO IT."], ["David D.", "This is a great restaurant for a business meeting or a special occasion. The atmosphere is high class and the food is five star. I had the lamb shank and wild mushroom soup with pumpkin  soufflé. Add a great bottle of wine and you are in heven."], ["F R.", "I have mixed reviews for this restaurant. First, the bad:- Waited...and waited...and waited to be seated. There was no host/hostess on the Saturday night I/we went even though the restaurant wasn't busy. We had to find someone to seat us. - Restaurant has a very old, kind of dingy \"Las Vegas Sands\" feel to it, with an older crowd. - A high rise view, but not exactly the best. The view is of the street below and the roller coaster at Six Flags. Meh.- For the higher prices we paid (need to lower them) and the decent  variety/selections on the menu, the food slightly missed the mark.. Now for the good:-Once seated, service was very good, very attentive & professional - with everyone we encountered.- Food looked beautiful, and was brought out in a timely manner. My filet was good, but a little overcooked and lacking seasoning. The spinach/goat cheese salad was delicious. The asparagus was a little too crunchy. The escargot was good, but not as flavorful or tender as it could be. The bread pudding was good, but not decadent as I expected it to be - rich, sweet and creamy - it was kind of bland.The live music was nice to listen to and not loud. All in all, the food was above average, just slightly off. I would like to eat here again and see how everything is a second time around.I would recommend this restaurant - I still had a lovely experience here."], ["Tim G.", "This is my most favorite restaurant in Arlington.  Very quiet, great views and outstanding food."]], "Bazille": [["Stephanie L.", "What I appreciate here more so than the food (which is pretty good, but nothing extraordinary) is that, like the Nordstrom store itself, they take care of the customer. Let me explain: I came here on a slow Sunday evening, but we had to wait to get our order a little longer than I would have expected. And on top of that, when our food came, it turned out that the chef had prepared the wrong order for my mom! So she had to wait an extra 15 minutes while they prepared the correct dish. I was actually pretty upset. However, when the check came, the waiter (who I believe was dealing with his own issues since he was also working at the bar) had removed my mom's dish from the check because of their mistake. I appreciated how he recognized their mistake without us having to point it out or complain. (I don't normally complain at restaurants because I don't think it's worth it, but if service/something is bad, I'll make a mental note to just not come back in the future.)The menu itself isn't huge, but I thinK they have a great selection. They have great \"fancy\" salads and classic dishes with a little twist (like on their special/seasonal menu, lobster mac and cheese, BBQ chicken pizza, etc.) They prices are a little high, but the atmosphere is nice, and you can expect the same Nordstrom-quality customer service, which is why we will come back in the future."], ["Jason B.", "Bazille is another place I had bookmarked.  So it was time to check it out. Bazille is located on the 3rd floor of Nordstrom.  Food is fantasitc, for this they deserice 5 stars. What did it for me was the service....well, the lack of.  1:30pm we got sat...1:43pm the server finally came over (no need to give out his name.)  I am not sure if he was about to go home or just having a bad day or both!....but we got to feel the effects of it.  There was no introduction, no suggestions, no recommendation, or the question of \"have you ever been in before\"  I felt I was taking up this guys time.  With this being my first time in, this place did not appear to be a kind of place that delivered rude service.  At any rate, we finally ordered.....2:40pm we received our food.  I had seen the server walk back and forth a few times....he never checked on us, and it was clear, we were is only table.  As I was watching him, I noticed he was eating off plates on a table close to the kitchen...I get it, he might have been on break....it just appear to me and my guest that he was eating left overs from an un bussed table.....surely not! So back to the 2:40pm.....we got our food, after we track down another server and ask her to bring it to us. We ate, finished conversation, paid the manager and never saw the mysterious server ever again.  I will give this place another shot.....if I see this guys again, I will ask to move to someone else section."], ["Anne S.", "You know, this place is fine, but I have two complaints:1. CALORIE COUNTS on every single menu item?!?  WTF!  Thanks for robbing me of my blissful ignorance.  I had to order the special because the waiter didn't tell me how many pounds it would add to my thighs, thank goodness.  That eggs benedict served on crab cakes was pretty awesome, though.  Three stars for that dish alone.2. It's surprisingly noisy for the type of restaurant it is (aka not a bar).  During peak eating hours, it can be hard to hear people, especially if you're with a large-ish group."], ["Chris H.", "Your perfect order: Cilantro Lime Shrimp Salad and Ginger Peach Tea (add splenda as needed). Add a cup of Crab Bisque if you are really hungry. Don't question me, I've been a professional eater for decades. You're welcome."], ["Jacobie D.", "I loved everything. The Crab Bisque the Salmon w/HerbRisotto and the Crab Mac & Cheese. I can't believe I've never tried this place before. The service was top notch and the interior is nice. I can't wait to try other things on the menu."], ["Karen L.", "I've always heard great things about bistro N (but also forget it's hidden on the 3F)! Finally had the chance to try it on a Saturday night. This place is perfect after shopping! They have a range of food from salads to pizzas to sandwiches and seafood. I tried their salmon and it was delicious! Lobster mac and cheese is another winner! I heard their brunch is great, so I'll definitely be back for that!We had a large party, and they were more than accommodating. Hostess and wait staff were attentive and friendly. They didn't make us feel bad for being a big group! Bonus brownie points for that!"], ["Maria E.", "This was my first time trying this place out. I would say the environment is very chill and relaxed. My bf and I were sat down very quickly! Our waitress was amazing! Super attentive and very kind!  We ordered fries as an appetizer and my bf had a pizza which is made in a fire over! Definitely coming back for more pizza! And I had the chicken with angel hair pasta very delicious I must say! Over all I had a great experience and I love the idea of it being inside of Nordstrom! High five guys!!"], ["Grace K.", "DELICIOUS!  Who would have thought that a restaurant at Nordstrom would be this fabulous?  I've dined here a few times (lunch and dinner) and I have enjoyed every meal.  My favorite has got to be the fries with the kalamata olive aioli dipping sauce.  OMG to die for - even for someone like me who doesn't fancy olives.  I usually ask for two of those sauces because it's that good. . and my friend, Melody L. likes to steal my fries sometimes.I've seen many come for just a drink/dessert.  It's a great place to unwind after a long day of shopping. They have a really nice bar with live music on the weekends.  When they open the blinds for dinner, you can see a bit of the city lights.  Kind of pretty, even though the Macys sign is the brightest light you see.I've had the honey chipotle chicken, asian chicken salad, veggie & 3 cheese pizza, and a couple other dishes.  Honestly, they're all great.  And I recently discovered their delicious bread pudding with white chocolate and raspberry drizzle...soooo yummy!  I've never had their breakfast, so that will be my next meal there..this weekend!"], ["Jessica V.", "Best Mac and cheese I've ever gotten, just disappointed of how small it was. Drinks and appetizers were good but not amazing for the price point. It's a great place to stop for a bite while shopping though."], ["Reham M.", "I visited this restaurant today for the 1st time and I really like it the food is really good and deliciousI visited the restaurant with my friends today  and definitely I'll come back with my husband for the next time . ...and the last thing is  the staff very wonderful"], ["Cynthia C.", "Brought mom here for lunch with the fam. Busy on a Sunday but not too bad if you come a little later. We came around 1pm.  3rd floor in Nordstrom. Yes, it's INSIDE Nordstrom. Reservations were made for a booth near the window & had some delicious food. Everything they had was of great quality & big portions. I had the prosciutto arugula pesto pizza $11-- it was DELICIOUS. Highly recommend it. Enough leftovers for another meal or snack! Salads were crispy & refreshing. Caesar doesn't come with chicken, but you can add extra chicken & they give you alot. Also got to try the prime rib french dip $15. It was good & huge & came with fries. Personally, I'm not a huge french dip fan & I'd probably try the croque madame next time. I'd come back again :)FYI- menu online is outdated. Posted pictures of lunch menu as of May 2014."], ["Melissa D.", "Absolutely LOVE the wild mushroom risotto! I always add a side of their delicious roasted chicken. The Brussel sprouts are mostly good if they aren't too charred. The hummus appetizer is nice for sharing. I highly recommend the crab Mac and cheese and tempura battered asparagus. Service is spotty, I've had wrong drink orders and the wait time for refills can be lengthy. Aside from the spotty service I'm always very impressed with the food quality and freshness. It honestly doesn't feel like you're eating in a mall, you could be at any fine dining establishment!"], ["Steve S.", "Jamie and I dined here tonight, first time ever, and had a splendid time.The room itself was lovely, modern, and well lit, a very nice place to be.Service was first class, from promptly seating us at the window booth we requested on open table to perhaps the best waiter I've ever had, Manny, whom I recommend highly.The food was excellent, as well.  We started with french onion soup, which was perfectly constructed with top notch ingredients, a  nice crab cake dish with fried asparagus spears, and a nice lightly dressed green salad and grilled half tomato to cut the richness of the excellent citrus cream sauce.  I had the crab stack, a nice california-style lump crab salad with avocado, cucumber, tomato, and mango, shaped into a layered cylindrical tower.We'll be back here in the near future, now that we have a good reason to go to the mall ;)"], ["Tom L.", "Worst Bloody Mary ever. Watered down tomato juice and vodka. Plus, the server apparently had much better things to do than wait on us while sitting at the bar."], ["Sarah J.", "I travel a lot for work and as a single female, dining out late at night can be a drag by myself. If I am ever near a Nordstrom cafe or restaurant, I always go there! The food is consistently excellent, service is comparable to a 5 star establishment and they are always located in well-lit malls. This trip to the Bistro was unique! The table next to mine was a group of traveling food critics. They ordered what seemed like everything on the menu. I thoroughly enjoyed eavesdropping on their conversations about the food and halfway hoped they'd invite me to join their table. I think that the food critics would agree with my five star assessment of the place! Oh! And as a side note: they have really nice live music on certain nights of the week!"], ["Kathryn Y.", "Lime. Cilantro. Shrimp. Salad. Best salad ever. Get it. Bread is yummy and service is good."], ["Andy P.", "Cilantro.Holy cilantro Batman.It was on the fries, the pita, the sandwich...it was really overpowering. The risotto was done well but had a very potent citrus taste and the excessive amount of cilantro just killed the other dishes. I normally like it, but this was just overkill. Honestly for the prices I don't see myself going back.The service was intermittent. It would be good for 10 minutes, then we wouldn't see our waiter and he would forget the drinks we had ordered.It wasn't terrible, but I've definitely had better.**edited 'was' to 'wasn't'"], ["Anna H.", "I LOVED there cilantro lime shrimp salad ! It was so delicious! I had to try it out since my friend keep talking about. The atmosphere was very relaxing and service was great. Can't wait to come back to try their oven bricked pizzas."], ["Erin J.", "First, let me just say that you can get a great steak (better than many $50 steaks) and some super good fries for less than $25 here. I could honestly leave it at that and feel confident that my review matched the 5 star rating, but I'll continue.I love that you can take the buzzer with you around the mall! It makes waiting for a table much better.I have tried a good bit of their food at this point, and have always been satisfied with both taste and presentation (which is not something I usually notice--it's cool that this restaurant seems to put that effort in.) The service is pretty great, although understandably slower when they are busy. I need more reasons to go to Northpark so that I can eat here."], ["Nick M.", "I got the berry salad and crab bisque! Wow Wow! Every bite was heaven! I can't wait to try more there."], ["Magnus L.", "I didn't know they had a restaurant and I wish I hadn't known. I've tried their cashew chicken stir fry. It's very bland and peppery flavor, not spicy hot more like way too much black pepper. The service wasn't great on this visit, even though I ordered among the first in a party of about 20, I was one of the last to served. Two others in the party that had ordered the same dish didn't even get any cashews. I think I'll pass next time."], ["Mary K.", "The cilantro-lime shrimp salad was great! Service was swell and I got a discount because my sister used to work here. It was my first time also - just to get a snack....great atmosphere and food."], ["Shiloh K.", "Very classy atmosphere. However, I still felt comfortable in jeans and a t shirt after a bout of mall shopping during Christmastime. Seems like it would be a nice place for a business lunch or dinner as well.Service was excellent, our bartender had recommendations for tasty cocktails. Their blue cheese stuffed olives that they put in a dirty martini are to die for...not as strong of blue cheese flavor as you'd think. They had very nice live music as well, a saxophone player to serenade while patrons were enjoying a meal or drink. Cool place to relax your tired feet after or in between shopping trips!"], ["David A.", "Gracious service and a relaxed atmosphere made for an enjoyable lunch at Bistro N.  My Bistro Club was delicious, my iced tea glass never empty.  Stop in and enjoy a delightful meal in-between shopping stops!"], ["Sophia G.", "Very nice place, the atmosphere was great! Went there for my birthday today April 14. They have very good lunch entrees but the best is the crab salad, it sells fast. You have to be fast in ordering that because they have ran out a few times. I was dressed casually and it was fine. The best of the best was dessert, the chocolate cake with carmel and toffey icing was to die for. Good place for a girlfriend lunch!"], ["Sarah D.", "OMG two words. Pomme Frites. French fries. Aaa-Ma-Zing!!!This place is on the 3rd floor of Nordstrom and I think, the best place in the mall to eat lunch. It is beautifully classically decorated. Not to intrusive and not annoying. The food is heavenly. All the sandwiches come with the french fries from heaven and a kalamata olive dipping sauce that I could eat by the bucket full, face first and YUM! The club sandwich is practically perfect and uses green beans!They also have some wonderful salads and pizza too. BUT my favorite thing, after the french fries and dipping sauce, is the Crab Macaroni and Cheese. Ok I know it sounds weird but just trust me? It's like heaven in a bowl. It is so rich and so very very tasty. Parmesan and a ton of other white cheeses mix together with pasta and whole lump crab meat. mmmm I'm hungry just thinking about eating here. The Iced tea is also very very tasty and satisfying. The service is always quickly and very friendly. I have never had bad service. I've also never had a longer than 10 minute wait for a table. The bistro also serves alcoholic type drinks but I've never partaken. If you're looking for a place for lunch Try the Bistro. It is uber tasty and one of my favorite places to eat in Dallas. Period."], ["David G.", "Best French Onion Soup- Crab Stack - Salads - White Chocolate Bread pudding and service I have had in Dallas. I love the decor Do your self a huge favor when shopping at Nordstrom North Park and take a meal break at the Nordstrom Bistro You will love it."], ["Janea M.", "I love their crab bisque.  With a salad and a glass of wine.  It makes it easier to take the mall.  (Did I tell you I hate malls and shopping?)   Probably should go later and just have a martini or two if I am going to do that.   They have great bar that is the perfect spot to meet friends from out north.  Easy on/off freeway location, nice valet service and good food.  Surprisingly consistent and of course, it is Nordstrom's, so there is an expectation from the staff you will be satisfied.  They work hard to make sure that you are.  Their salads from the bistro are pretty close to those they serve in their coffee shop on the lower level outside the store if you are in rush.  Good quality, fresh Go food."], ["Donna B.", "The Salmon with Gazpacho relish atop green beans and roasted potatoes was out of this world good.  One of the best preparations of Salmon I have ever eaten.  Wish I could get the recipe for the relish!"], ["Danny C.", "Nice place and atmosphere, doesnt feel like its in a department store. Menu is a bit static but food generally good. Good service."], ["Julie G.", "I love Nordstrom Bistro! Their salads are fresh and their fries are crazy awesome! Even though they have the same thing every time and nothing really changes. I remember back in the day when they had incredible panini's and I'm sad they dont have them any more! Some of the items on the menu are kind of \"fancy\" but everything is delicious and I love going there!"], ["Scott B.", "This is a great restaurant. Real fresh ingredients prepared by skilled chefs. Steaks are great.  Pastas are solid. All is good. If you have never been, give it a shot."], ["Dallas T.", "Another lovely lunch at Nordstrom Bistro N!  This time it was a very special luncheon for 5 great women - who have known each other their entire lives - cousins and friends.  I have never had a bad experience here.  I've been here with the husband, I've been here with the kids, I have celebrated special birthdays here - and the food and service is fantastic.  Two of us arrived early for the luncheon so we enjoyed a glass of wine at the bar and then moved on to our table once the other women arrived.  They have two round tables near the front that can easily accommodate 6 - I always like to sit here, if possible, but the tables near the windows are nice as well.  I have tried many different things and have no complaints.  Yesterday it was the french onion soup and shrimp risotto.  I'm not sure what the house chardonnay was, but it was served perfectly chilled and had buttery, smooth finish.  Three women ordered the salmon and no one was disappointed.  If I had to pick my absolute favorite item off the menu it would have to be the flat iron steak with pomme frites - it is decadent!  Chad was our waiter and he was awesome!  Funny, observant and gave us 5 star treatment!"], ["Amy B.", "I totally forgot about Nordstrom Bistro, but I love it & will purposely meet friends & shop at Northpark just so I can eat at Nordstrom Bistro.  One thing you need to understand about the restaurants in Nordstrom:  this is not to be confused with the Nordstrom cafe or coffeeshop where they might serve food- like at the Galleria.  It is NOT the same!  The only Nordstrom in Dallas that actually has a \"Nordstrom Bistro\" (the full-blown restaurant) is Northpark.Ok, moving on...!  Sarah did a really good job summarzing the food & the service.  It is a very comfortable place to eat in too- the design is beautiful.  It is very consistent & the flavors are very gourmet.  Other than the damn good pizzas & soups (crab bisque is GOOD!), I also really enjoy the salads-like the asian chicken salad with edamame, crispy red peppers, julienned carrots and wonton crispies served in this yummy teriyaki, sesame vinaigrette.  It is served in a big white bowl with 2 long thin breadsticks.  Oh, and the pomme frites with aioli sauce- SO GOOD!!  Tip: you can order their kids meals- like chicken tenders w/ pomme frites & aioli dipping sauce or grilled cheese and they are really good- especially if you're on a budget.  You can also split dishes or do half & half (like one person get a salad & the other a burger or pizza- makes for a YUMMY meal).  They have the best iced tea- I stop by all the time & just get an iced tea to go from the bar which they have no problem getting for you which is wonderful to quench your thirst while you are shopping.  It is perfectly brewed tea & you don't need to add any sugar, imo.They also have a bar....so if you are a fan of having a glass of wine before you shop, or just want to meet friends there, it is a good place for that.I would definitely recommend the Nordstrom Bistro for lunch over dinner just because the menu is very similar but the prices are cheaper.  For lunch, with drinks, I usually get out of there for about $15-20, but it is worth it & we usually get a side of the pomme frites w/ aioli dipping sauce or get them as an appetizer.  Those things are killer."], ["Dan D.", "Yes, Nordstorm has a hidden treasure on the third floor.  There is a full bar and table service.  You will find artwork on the walls in this upscale eatery.  The food is flavorful and presented well.  You will find salads and soups, sandwiches and pizza, or steak and seafood.  There is something for every budget.  You can enter through the outside Northeast door via elevator and there is valet parking if you are dressed for the theater and don't want to go through the store dodging shoppers to get to the third floor."], ["Olivia M.", "They have really good French Onion soup here.  Also, the salmon nicoise salad is terrific.  This is a nice little spot in the mall if you are looking for a quiet break from the hustle and bustle of the mall.  Good spot to meet friends too before or after shopping."], ["Sonia E.", "I fell in love with this place in San Antonio first. I ordered the crab bisque and then I ordered the bread pudding....yeah at first I was like ewe, no thanks to the bread pudding but then after they brought it to me I noticed it was different than anything I have ever seen...covered in white chocolate and raspberry's it melted in my mouth. If you get anything there try the bread pudding!!!! I give it 5 stars!"], ["Lindsay T.", "The food is excellent; the service leaves a lot to be desired. Both times that I dined at Bistro N I found that the servers were anti-social and not attentive. I absolutely love their food - the sandwiches are fabulous. If I could dine there without having to be served - it would be a more enjoyable experience for me."], ["Penny K.", "N Bistro is located on the 3rd level of the North Park Mall's Nordstrom. I come here once a month for a light brunch or when I'm craving their blue cheese & pear salad (my favorite salad in Dallas). This salad is so delicious, it's the only and same thing I order each time I go. Made up of basic salad greens, radicchio, crumbs of blue cheese, sweet glazed pecans and drizzled with dark cherry vinaigrette, it's perfect by itself or paired with a cup of crab bisque. Don't forget to ask for fresh bread and olive oil (only available per request and its free)."], ["Joseph B.", "Joe didn't necessarily eat here, but Joe did enjoy the bar very much. After a long few hours of shopping and browsing, Joe needs a good shot of Crown and then another Crown with a splash of water to nurse while resting his feet. Joe doesn't remember the bartender's name, but Joe went during the afternoon...so whoever usually bartends, then that should be your guy. He was very generous with the Crown!  Joe thanks you!"]], "Madrina": [], "Mercat Bistro": [["Monika G.", "My husband \"surprised\" me with Saturday night reservations (after I bugged him about wanting to try this place out for the last several weeks) and we showed up around 7ish. The setting is exactly what I would expect from a little bistro in Paris. Absolutely quaint and beautiful. We're quickly seated in a cozy section of the restaurant and immediately greeted by a really friendly server. They had several French wines that I wasn't familiar with and she was really great at explaining the flavor profiles without being snooty at all. We ordered the Fried Almonds to start and for our main entrees, I ordered the Sea Scallops and my husband ordered the Jamon Iberico. Get the almonds! They were fantastic -- drizzled in olive oil and fried rosemary, and totally unlike anything I've ever had. My sea scallops were perfection and served on a bed of risotto. (So so so good that my husband kept asking for bites and ended up eating half my plate.) The Jamon Iberico is just ok. It's one of their House Specialties, and it's not that it's bad -- it's just not great. It would be better suited as a shared appetizer, rather than an entree. My husband kept mentioning throughout the dinner that he wished he had ordered something different because he was still hungry. (It was essentially cured ham slices and several slices of a baguette.)We'll definitely be back, but we'll probably save this place as a \"special occasion\" restaurant since it's decently pricey. Dinner ended up being around $135 with the almonds, two entrees and two glasses of wine."], ["Ann M.", "Don't go for brunch! We went to Mercat Bistro today for brunch (Sunday) we won't be back anytime soon. The food was good. The service was so terrible it didn't matter the food was good. Our waiter Andrew was the worst waiter. He has clearly never been trained. We sat for 15 minutes before we took out beverage order. It took another 20 minutes for our beverages to be delivered. Then he didn't return to take our food order for another 15 minutes. I ordered a chocolate croissant, which sat on the bar waiting for him to bring it to us for 10 minutes. Our food was delivered by a very friendly man, wish he had been our waiter. All of Andrew's tables were frustrated, it wasn't just us. The wonderful staff dressed in all black was great. Attentive, friendly and quick. They refilled it glasses, responded to requests (for silverware and a napkin) and served our food before it got cold. We had to give our check and credit card to a woman in a skirt and jacket (hostess?) because Andrew never came back to get it.Rebecca the hostess was awesome. She pitched in on Andrews other tables, getting drinks, assisting and being generally helpful. What a lousy experience. I'm so disappointed. It was one of my favorite spots, not anymore."], ["Daphne A.", "Delicious food. Sure their menu is not purely French, but who cares? The food is made with quality ingredients and is reminiscent of the French bistros that I've enjoyed in France. The service is attentive -- almost too attentive and the indoor and outdoor seating is great for a date night or with a group of friends. While I would love to give it another star, the only reason I am not is because when my friends and I were dining outside on a Saturday night, 18-wheel trucks kept pulling up next to the restaurant and idling their trucks, releasing air pressure, etc. While the restaurant is beautiful, it was like eating in the parking lot of a truck stop. This is beyond their control and not sure if this happens every night but a major distraction nonetheless."], ["IRAIS F.", "I absolutely LOVE Mercat Bistro. It has never disappointed me and quickly became my \"go-to\" spot for brunch and special occasions. I came here one day with my friends for brunch and we sat out on the patio and had the best time. The weather was perfect and we didn't want to leave. Normally, Mercat closes from 3pm-5pm, but the restaurant stayed open for us so we could keep enjoying the day. The manager, David, was so incredibly nice and even took us on a mini tour of the new restaurants that will be opening in Dallas. It was amazing and sealed the deal for me that Mercat is an extra special place and goes above and beyond for their customers.The food is absolute perfection every time I go. I've been for cocktails, pastries, brunch and dinner, and I've never had anything I didn't thoroughly enjoy. The sheshito peppers are a must as an appetizer and I'm not even one to eat peppers. Also, get the goat cheese with honey. Every bite is heaven. And of course you must have a croissant, cheese Danish and even the almond croissant. For brunch, the Eggs Neptune are pretty awesome. Very flavorful and light. If you want a heart brunch item, then get the Croque Monsieur. It's epic and delish.As far as dinner items go, everything is delicious, but the scallops with mushroom risotto is my all time favorite. The scallops are cooked perfectly and the risotto is creamy and balances the scallops just right. If you happen to be there on a Monday for dinner, then get a side of the special table side pasta. They make it right at your table inside of a giant cheese wheel. It's rich, so share it with a friend...it's a must. I'm a huge cocktail drinker and absolutely love the St. Flora. It's a champagne drink mixed with St. Germaine and is sweet but so refreshing. Definitely a great alternative if you don't like mimosas. For dessert, I'm not huge on desserts, but all of the ones I've tried there have been delicious. However, if you're looking for a night cap instead of dessert, then the Tourbillon is out of this world. It's a coffee drink that is poured over a chocolate ice ball. It like Christmas and Godiva in a glass. Only bad thing is that it's seasonal. Check and see if they have it and if they do, GET IT."], ["Kerry N.", "Loved it! This quaint restaurant is perfect for a ladies lunch or a romantic dinner. The quiche was excellent as well as the pastries and desserts. I love the eclectic China the dishes are served on. We will be back!"], ["Christina R.", "Hidden away in the shadow of a high-rise office building, this restaurant is the best French cuisine I've tasted outside of France. My top 3 faves:1. Their delicious, rich proprietary coffee blend that is made in Colorado by the owner's friend & isn't sold anywhere else in Dallas.2. Flaky, buttery, hand-made fresh Croissants (please bring the ham & cheese back!)3. Quiche so dense & rich that you don't need to eat another meal later The ambience is lovely & romantic: outdoors on the patio under umbrellas & string lights, or indoors with rock salt candle votives flickering on the tables & the dark wood throughout."], ["Kortni K.", "Came here for brunch this morning for the first time and it was outstanding! The service was wonderful and the food was even better. Mercat Bistro has an amazing take on eggs Benedict super light but delicious - some of the best I have ever had. The quiche was delicious too - also get fresh squeezed Oj!"], ["Joe R.", "So, have been coming here since the place opened, and it has only gotten better.  Great service, great staff, great good...BUT, for some odd reason they decided to change their staple and famous almond croissants!! Wth were they thinking?? People(including myself) would fight tooth and nail for these artisan wonders of the Dallas pastry world, and now they are a notch (just barely) above Pillsbury Croissants! Whomever made this decision needs to be tarred and feathered for committing such gastronomic blasphemy!. It gets one star for staff, one for the dinner and other menu items (minus 1 for mgmt decision to allow this change, minus 1 for the Pillsbury croissant)"], ["Mindy C.", "Sunday morning brunch here was not busy at all. We made reservations 15 minutes before we planned to arrive and it was not a problem. Although, for the restaurant not being busy, we got sat at a less than ideal table. We asked to be moved to the window and the host completely ignored us. They put us right up front, near the hostess stand, and the chairs were not comfortable. One side of the table was a cushioned bench and the other were these old wooden chairs. The tables were TOO CLOSE TO EACH OTHER also. Another party was attempted to be seated next to us and when they asked the host for another table due to the closeness, they were accommodated. How lovely... We parked across the street and apparently had gotten there before valet had the chance to set up, so we parked for free. Not that this is what you should aim for but just a note. We had no idea they had valet in that lot before arriving. It was only after we were leaving the restaurant that we saw the entire set up, but it was no problem getting in our car and leaving. This being said, I think valet may be your only choice to getting parking relatively close to the restaurant. We opted to sit inside due to the heat, but the PATIO would've been great in nicer weather. The patio is a decent size with numerous tables and I completely see the potential in this place. They have lights strung around the patio and I'm sure it would've made for a great place to have dinner. We arrived expecting to be able to get scotch eggs. They apparently only offer them during dinner, so we were pretty disappointed. The breakfast/brunch menu is short with not many options. I know this is a French restaurant, and I'm not sure how naive this will sound, but I had expected it to be more French-like. They did have the small decorative plates though haha. The wait staff came over WAY TOO MANY TIMES to ask us how our food was. Literally our waitress asked us, she walked away, then another waitress asked us seconds later. It was overkill. Not to mention, they kept interrupting our conversations to ask us if the food was all right. Anyways, for being a French restaurant, there were only two crepe options. For $13 a crepe order, you'd think you'd get more than one crepe too. We passed, also because they were not unique crepes in our opinions. No offense, but I could make a strawberry crepe at home. From the other reviews, my sister and I split the Croque Madame. I'm glad we did because the plate was very filling for us both. We got ours with fries, because why not ? I liked the dish (with my added hot sauce), but I would try other dishes before ordering this one again."], ["Abi G.", "Disappointment.My boyfriend and I had a reservation here on a Sunday. The hostess was awful. We told her our names three times and were left standing for a really long time. Waitresses kept walking by and asking if we needed help. A manager came and talked to her for a bit. We kept waiting.A table behind her was open the entire time. The table was set, even. Finally, we were seated there. The white china plates were pretty. Too bad there was a dead fly on my boyfriend's. The hostess took the plate, shook off the fly, and started to put it back down. We had to tell her we wanted a clean plate. So we were off to a bad start.Our actual waitress took a while to get around to us. She was really nice and quite apologetic, but they must have been understaffed. I think she was doing the best she could because she looked very busy.THE FOOD:The almond croissant and lavender latte I ordered were very tasty. My meal was so-so and kind of cold. I ordered a chipotle benedict sandwich. Not really worth waiting around forever for.My guess is it's the atmosphere that brings most people here, because the service wasn't very good and the food was so-so. If you like Uptown, this is the atmosphere for you. There was a very loud DJ outside (even for Sunday brunch, which is kind of weird) and the crowd is the too-cool-for-you type. I won't be coming back."], ["Heli M.", "Local ingredients. French inspired. Intimate, cozy interior. Open, romantic patio with beautiful, upscale cafe seating and magical strung lights. Add in spectacular, attentive customer service and there's only one place that comes to mind: Mercat Bistro.How I overlooked this place, I may never know. It is pretty hidden... but I guess that's how it retains it's secret hideout feel. Their charcuterie was beautiful and equally appetizing: a variety of cheeses including a unique type of goat cheese and ricotta, honey, prosciutto. Their pomme des frites were served french style alongside mayo instead of ketchup, homemade and delectable. For the main course, we went for the rotisserie chicken and the Cobia fish (served alongside king crab) which were both juicy, tender and mouthwatering. The meal was so great and I loved how the staff allowed us to take our time and enjoy each course. By the end of it all I was so stuffed and happy that I moved outside to enjoy a second glass of wine and some fresh air. The patio area had me sold.Also--- It's so close to the AT&T PAC and the Winspear that it will be on our must-dine list before our next show!"], ["Charlotte J.", "Overall, our experience at Mercat warrants something closer to 3.5 stars. But since I can't give increments of stars (and since the food was ultimately very good) I'm rounding it up to four. Here are a few things I would do differently if I were to go back to Mercat.   -  I would come earlier. We made reservations for 1:30 PM on Saturday, and the kitchen closes at 2:00. We found out that by this point they've run out of many items, especially their housemade pastries and croissants, which I was very much looking forward to trying.  - I would sit inside. Even if the weather forecast says it's going to be sunny and 80 degrees, Mercat's patio (while lovely) is right in this little corridor under concrete, where (at least at 1:30 in the afternoon) there is no sun and such incredible wind that the tables were shaking. It really made the dining experience less than pleasant.  - I would ask what comes on the side of a dish before I order it. I ordered the Fresh Vegetable Crepes and my boyfriend ordered the Hatch Chile Crepes, and since the menu didn't say anything about them coming with any sides, we ordered a side of breakfast potatoes to share. The waiter didn't blink an eye. When the crepes came, there was already healthy portion of potatoes on the side of both. To the waiter's credit, he apologized for not telling us originally that our crepes would come with potatoes, and took the second order of breakfast potatoes back. The crepes themselves were good, although not what I expected. Both were more like an omelet wrapped in a crepe. My boyfriend called it the \"French Breakfast Burrito\". The breakfast potatoes were nice, very crispy with the right amount of salt. When we found out that they were out of almost all their pastries, we ordered one they still had available (a small loaf of banana walnut bread) and a bowl of fresh fruit to share. The banana walnut bread was really a cake, almost too sweet, very decadent. The bowl of fresh fruit was lovely. We also shared a decaf nonfat latte, which was very nice. I have no problem with the quality of the food, which is why Mercat is getting 4 stars from me. Give them a try for brunch sometime, just come early enough to get a croissant before they run out."], ["Vendredi C.", "Listen. You must come here. Why you ask?Of course the food is delicious. I, and everyone I know who has tried them, are hooked on the Mercona almonds. But the atmosphere is even better. The whole environment, the plates, the music - it's all as classy and relaxing as you could desire, and you so you won't want to leave.But want to know a secret? Stop by sometime in the morning or afternoon for coffee. Not only will you have a delicious drink, but you'll get to hangout with Stephen, who you will love and who will make you a great drink. Talking with him will make everything seem right with the world.Also, the wine selection is quite good and the servers will be able to tell you all about the different options."], ["Linda D.", "What an amazing small restaurant that provides exquisite food and service!  This restaurant is tucked right behind St. Anne's so it can be easily be missed if you access the restaurant off of Harwood; The entrance to the restaurant is actually behind Harwood. No need to worry about parking because they offer complimentary valet. I love that this bistro doesn't just serve wine exclusively but also have an open bar. Their selection of cheeses are amazingly good and of all flavors to combine with all sorts of sliced exquisite meet with bread. I had a dish of cobia fish with shredded crab laid on top of a full layer of cream that tasted like lemon buttery heaven.   Oh my!! this sauce melted in my mouth and I wanted more after almost licking my plate clean. I also had a serving of the braised short rib which was so tender and very hearty!  We finished our meal with an amazing cheesecake dessert that was absolutely divine!Great CMYE thanks to Heli who was so personable and engaging!"], ["Jill L.", "Lovely French ambiance and cuisine. Service is attentive and professional and the menu, though not vast, is a lineup of the usual suspects. Pastries here are divine!! Brunch was delicious, will return for dinner soon."], ["Tall G.", "I had brunch here with a friend in November 2015.  The restaurant itself is very quaint and feels like you're actually in a Parisian bistro.  The menu has all kinds of enticing items on it.  I ordered the quiche Lorraine which was a cheesecake-sized portion that was velvety and absolutely delicious.  They must whip those eggs in a blender to get a lot of air in order to make the quiche that tall and smooth.  My friend had the green chili crepe, which I tried and thought it, too, was outstanding.  The service was fantastic and I would highly recommend it.  One small note was the basket of pastries, although very delicious, was overpriced for having 4 pastries in it.  We also enjoyed a carafe of mimosas for $15 which were very good and more champagne than OJ... the way they are supposed to be!"], ["Zaira M.", "My friend and I walked in five minutes before the kitchen closed for lunch. We were unaware that they were closing and when we found out we let them know we would be happy to come back while their kitchen was open. They insisted on seating us anyway. Once we got to our table we sat around for about ten minutes waiting for someone, anyone, to come by. Eventually the hostess came back and apologized and said she would take our order despite the kitchen closure. She assured us it would be no trouble. Within five minutes we had our lattes and ten minutes later we had our crepes. I had the hatch chile crepe. It was really good and the potatoes were spicy. After placing our order our service was excellent. The manager even came by to apologize and to let us know about future events. Will definitely need to come back to check it out again."], ["Marianne C.", "Beautiful bistro, excellent food, great wine, phenomenal service, nice patio and valet is complimentary. Thanks to our Yelp Event to meet our CM Heli, I wouldn't even know that this place is here.It's tucked away in the corner of Harwood and Moody. All in all, I enjoyed my time and left very satisfied with this place. I would definitely comeback."], ["Emily H.", "My favorite thing about Mercat is you literally feel like you are in a French bistro. Floral plates, beautiful teacups, fresh flowers. It's one of those places where you walk in and say \"omg so cute!\" Perfect for a girls brunch! Their quiches are made in a really unique way, super fluffy filling (like 3\" tall) that just melts in your mouth (almost pudding like--I know it sounds weird but it works). I've never had quiches like the ones at Mercat that it makes it so hard to eat a quiche anywhere else. Coffee is legit too. It'll give you the shakes. :)"], ["Brian R.", "I'm an easygoing reviewer, easy to please and seldom look to find fault.  Mercat Bistro proves in my experience to be a delightful little bar with the makings for something great.A perfect spot for breakfast, I greatly enjoyed the quiet, pleasant aesthetic.  The Chai latte was unexpectedly, subtly exquisite.For breakfast I ordered the ham and cheese omelet with spinach.  This was expertly cooked, and delicious.  I found the spinach rather difficult to eat as this was served under the egg as a form of stylish flat omelette.  The difficult spinach was a forgivable sin, particularly given the attention to detail in our made-to-order crispy bacon, which was incredible.Overall I found Mercat Bistro to be very enjoyable and would definitely go again.  I would note, this Bistro can be a tad on the expensive side if you get extras, our breakfast for two ran at ~$50 since we got the bacon and coffee."]], "Rise No 1": [], "Bouchon 1314": [["Drew C.", "I'm so happy this restaurant opened three blocks from my house!  I'd been hearing for months that a wine bar would open in this location, but then I learned a couple of weeks ago that's it's a full-scale French restaurant and my interest was piqued.Inside is very pretty.  Exposed brick, dark wood furniture, mural on one of the walls.  Long bar that goes 2/3 of the way down the opposite wall.  Very friendly, knowledgeable staff.  The owners went from table to table asking everyone about their meals and if they needed anything.As for the food itself, everything was amazing.  My girlfriend and I agreed that the spinach artichoke dip is the best we've ever had.  It comes on an appetizer plate with hummus, pita bread, and lots of green olives.  I had the pasta of the day - lobster ravioli - and it was fantastic.  Large chunks of lobster, rather than just pureed lobster like you usually get.  Delicious sauce, and it came with barely-cooked carrots and asparagus, which is my favorite way to cook them.My girlfriend loved her pear and beet salad that came with arugula and goat cheese.  She got the \"vegetable jardiniere\", a $5 side dish that easily could have been an entree.  It had a large portion of perfect mango couscous, a heaping helping of wilted spinach, and lots of barely-cooked veggies (carrots, asparagus, squash, and maybe something else.)Prices are very fair considering how high the quality of food is.  I ran into a neighbor there, and it was his third time to visit in less than two weeks.  I have a feeling that's the type of place this will be - lots of happy regulars.  I intend to be one."], ["H K.", "Bouchon 1314 pops perfectly! Salads that provide a cacophony of flavors, perfectly grilled meats of such quality that they melt in your mouth, desserts worth the calories, an owner who will help you pair the perfect wine or beer with your meal, and an ambience that evokes casual and intimate elegance, Bouchon 1314 is a new star in the culinary constellations of Dallas.With an art deco mural on one wall and the others showcasing the wine selection, Bouchon 1314's ambience was warm and inviting. The din of many conversations with classic jazz as an undertone set the mood.  The owner, Jean-Michel Sakouhi, makes everyone feel special.Caesar salad was perfection with a clearly traditional French house made dressing complete with anchovy garnish and homemade croutons. Beet and arugula salad combined the nuttiness of arugula and tanginess of goat cheese in vinaigrette with citrus undertones.  Accompanying the arugula were 4 savory balls of fried goat cheese that exploded in the mouth with a moment of crispiness followed by a burst of soft, tangy goat cheese. I have found a new addiction.It's difficult to capture the incredible flavors of the entrees with words.  The filet mignon, grilled perfectly by Chef Victor, all but melted in the mouth with the perfect amount of char outside and tenderness inside.  The swordfish was equally lovely with char and flakiness.  Delicious when eaten plain, the meats' respective sauces elevated their counterparts to an ethereal level of savory succulence.  The sides, asparagus, carrot, and potatoes au gratin, were perfect accompaniments for the perfectly portioned steak and swordfish. The au gratin was tender and firm at once and as flavorful as my mother-in-law's (which is quite a compliment). The mushroom risotto was fresh, creamy and light and the sauce had just the perfect amount of rosemary and savory goodness.Crème Brulee and flourless chocolate cake were crispy on the outside and gooey on the inside. I cannot wait to try the chocolate mousse next time I'm ready for an evening sharing a splendid meal with good company when we're in no hurry. Salut!"], ["Heather L.", "Dallas has needed a restaurant like this for a long time! It has an affable owner checking on the tables and welcoming guests.We started off with the mussels. I am sure the type rotates by what is in season but these were Prince Edward Island mussels. They were cooked perfectly and were the tender type of mussels, not the small chewy kind.  The portion was not huge which is preferable for an appetizer. The mussels came in a Provençal broth and came with plenty of yummy crusty bread to soak up the rest of the sauce. The only thing I would suggest here would be to put salt on the table. When eating the broth by itself, I would have liked to have added a little salt to it.Next for me was the kale salad with blue cheese and pickled onions. The salad was warm so kale was tender. It also had bacon in it so made it a great combo with the blue cheese. My husband had the mixed green salad with Bouchon's house dressing. It was a very good fresh salad with some vegetables in it as well.I had the Manhattan steak from the regular menu, and my husband had the lamb shank special. My steak was slightly overcooked but had excellent flavor with the bone attached. It came with some cheesy gratin potatoes that were also good and some fresh asparagus that was cooked well.  The lamb shank came on a bed of Israeli couscous with yellow squash and zucchini.  It had rosemary and a sweetness to it that went well with the meat. The shank was super tender and fell off the bone. For dessert, we went with the flourless chocolate cake. It was good but nothing extremely notable about it.  The other two options were mousse and crème brûlée, neither of which appeal to me but know many others that love these. And for the wine...oh the wine...wine is one of the main reasons to come here. The list is large with lots of the world represented (not just California) and excellently priced. The wines I know were at least 25% cheaper than other restaurants. You can also go look at the wine on the walls and not just look at the list itself. Great concept!  I would come here just to hang out at the bar, order a cheese or charcuterie tray and drink a bottle of good wine or bubbly for a reasonable price.The decor is pretty with dark wood and comfy chairs. Part of the room has beams on the ceiling which gives the decor a French feel. There is also a long, inviting bar. However, I think they only have wine and beer now. One thing I would suggest is putting little candles on the tables to warm up the glow of the room. The location is also great. It is west of the crazy part of the Bishop Arts District.  The strip where Bouchon is located looks like a cute little downtown area. Another great perk compared to the main part of Bishop Arts is that we easily found a parking place without having to valet!No reservations taken so far. If you like an interactive, talkative server, ask for Patrick. He was a pleasure to be around!Great food, wine, decor, and neighborhood. What else could one want? Highly recommend!"], ["Francesca B.", "What a lovely addition to Dallas dining ! I have been to Bouchon twice in the past month. The atmosphere is warm and inviting and it is low key. The wine prices are very good and the menu has options for everyone. The salmon was perfectly cooked and the lamb shank was melt in your mouth tender. I can't wait to return!"], ["Roxy T.", "Great place to have brunch. The calamari is on point! They are actually open on Sunday's from 10am-3pm to tame your brunch needs! Wine prices by the bottle are the best you will ever see!"], ["E R.", "Wonderful hospitality and service.  You will like this place! The wine prices are very reasonable and the atmosphere is warm and inviting, nice but not stuffy.  They did a nice job with the room, but I do hope that the metal doors are only temporary.The food will keep you coming back.  The dishes are classic, with no hipster element at all.  It's very old school, but well done.  It was nice to see entrees, fully composed, with a start and vegetable on each plate.  Because of this and the wine prices, this place is a good value and should be perfect for the neighborhood. We especially enjoyed the mussels, the Caesar salad, the calamari and the lamb shank. Heck, even the short rib burger was special.  They do, however, need to get the frites crispy.  We will certainly be back soon and often."], ["Zachary W.", "By far one of the best meals I've had in Dallas. We had the calamari and mussels and both were outstanding. I wish I could just bathe in the sauce we dipped the fried calamari in, it was that good. Also had the pork tenderloin and tiramisu for desert. Definitely plan on coming back for sure."], ["Amy S.", "I wanted to love this place since it's right down the street.   the have hey front door that looks like it's the janitors door. I wanted the food to be good and it was Subpar .....the pizza tasted like digorno and I spent $80 on three drinks and a charcuterie board not worth it. waitstaff look like they had been up for 3 days it was very unorganized and disappointing. sad"], ["AC D.", "One of my new favorites.  Approachable and affordable with classic French cooking styles I love.  Wine is more than fairly priced!  GEM."], ["John B.", "Great French food. Great service. Reasonable prices. Welcome to the neighborhood Bouchon 1314!"]], "Le Bilboquet": [["Christy B.", "What an amazing experience that accompanied the best pommes frites in dallas. The ambiance is unlike any other. Truly one of the best restaurants."], ["Holly D.", "Great date night! My husband & I had an excellent experience. The restaurant was busy but it was Friday night. We had a reservation and were seated immediately. The tables were close together but we couldn't hear the people around us so it was fine. I ordered the Cajun chicken, based on a recommendation, & my husband ordered the Branzino. Both were perfectly prepared & delicious. We were nervous after reading the review in D Magazine, but that review couldn't be further from our experience. We'll definitely be back!"], ["Nick B.", "Not really impressed at all. Took my wife here for our anniversary as the restaurant next door was unexpectedly closed. They seemed standoffish as we entered but promptly sat us down despite us not having reservations. The place was less than half full but they decided to seat us at a table sandwiched between a support beam for the building and the kitchen door on a small table for 2.  The rolls are hard and it would be great to have small plates for the bread as it is hard to butter them. Even olive garden gives you plates.The service was good but waiter was shocked we didn't order wine and flinched in a way that made it awkward. I had lobster soup that had an odd flavor and the tilapia plate and wife had arugula salad and salmon.  the salad was simply arugula and a light oil lemon dressing. Probably cost them fifty cents to make and they passed it off for $11. The fish plates were both alright but you can find comparable meals at chain restaurants. Nothing really stood out. ..especially for the price. I would have happily dropped $300 on a nice meal that night but was disappointed with having to pay the $88 bill we got."], ["Alice S.", "Really enjoyed the beet salad and the crab.  Great service from Sana, who went out of her way to ensure it was a memorable exprience.  I will return again the next time I'm in town."], ["Rose Ellen D.", "Have been here twice & spent several hundred each time.  First time for brunch - food and service were good - the place is absolutely darling. Had an amazing chicken dish with salad. Last night we arrived at 5:30 for wine and appetizers. Service was just ok. Once it got busy, they forgot about us, and it felt like they wanted us to leave. While I waited for my friend to finish her wine, I had to ask for water refills. Finally they did ask us to leave, but more on that later. We started with the steak tartare and asked for the fries crispy. It arrived with regular fries on the side and an EXTRA order (big bowl which they charged us for) of crispy fries. We asked for mayonnaise and ketchup which we received. Then we ordered the lemon tart for dessert and it was awful. The texture of the crust turned into what I can only compare to communion in my mouth It was nearly burnt and separated from the tart. It did not taste fresh. The lemon was overpowering - not light or refreshing. It had a terrible aftertaste. Perhaps it could have been sweeter, although I understand it will be tangy. So we told them and they brought us a nice chocolate mousse instead. They charged us for the tart but not the mousse. We decided that was ok, and also that we wouldn't mention the extra fries. Then someone from the staff (hadn't spoken to us before) came over to our table and told us someone with a reservation was waiting and could we sit outside. We were uncomfortable, offended, and not finished, but we stood and went to valet stand to discuss another place to finish our evening. My friend went back in to get her vest - in our rush to leave she had left it at the table. While she was putting it on she told them that we were sorry we took up their table but didn't like being asked to leave and felt rushed out. He insisted that he'd only suggested we finish up outside. We said it's cold! He said it's lovely outside with our heaters. We said no, we're cold (shivering) and we wanted to order a glass of wine but will go somewhere else. Bottom line: I won't be back. $250 later, you shouldn't be shoved out for a reservation and treated that way. Where is the hospitality? It's really too bad because it started as a nice night. The place got loud and busy and at some point we (the customers) were no longer valued. Too many lovely choices in this city, and especially that neighborhood, for such faux pas. We ended up paying the valet, parking across the street for free at Cafe Madrid... where we were greeted warmly, seated, served and attended to in the most gracious, relaxed, quiet way imaginable."], ["Jackie K.", "Food was OK, service was terrible: very French.  For that kind of money, I'd go to Boulevardier instead: yelp.com/biz/boulevardie…."], ["Mark C.", "Great restaurant. Elegant, fun, and hip, with delicious food. A little taste of France in the middle Dallas. I'd wait for it to get a bit dark for the lights to dim inside and the music to go up. Alternatively go in on a Saturday brunch where they DJ-only once a month. All the food is good. Cajun Chicken (ask for salad and fries) or steak au Poivre are my favorites, and of course Chocolate mousse for desert."], ["Leesa A.", "Went for a special lunch with a dear friend.  The patio is lovely.  Our waiter, Garrett, was very friendly and accommodating.  We order 2 salad nicoise.  Garrett remarked that was great because the tuna just came in today.  Image our surprise when it came to the table with canned tuna, not fresh seared tuna.  When we said this is not what we were expecting, Garrett agreed and took the plates to chef.  Stephan, the arrogant whatever he is,  condescendingly explained this is the french way of making the salad.  I countered with my multiple experiences of having the salad in various french cities with seared tuna.  He said it wasn't a problem to make them the way Garrett implied they would be made.  Not until we got the bill did we see the up charge from $17 to $24 for the salad nicoise.   SO RUDE!  A $6 up charge for righting the wrong?  That $6 cost this restaurant so much more.  Never will I or my friend go again.  Never will we recommend it.  Never will we give a positive review to anyone who even thinks about going."], ["Janie T.", "Pure perfection!  Excellent service, excellent food, wine & cocktails.  Atmosphere is also outstanding!  Highly recommend!"], ["Roxanne M.", "First of all, let me say that in my business, we think a lot about the \"customer experience\" and where it begins.Mine began with making my reservation through Open Table.  Le Bilboquet, their confirmation email said, requires you to call them the day of the reservation to confirm your table.  Really?  But that's why I reserved through Open Table!  Precisely so I would NOT have to call the restaurant.  Still, on the day of I picked up the phone to confirm my reservation with Le Bilboquet.  The woman who answered the phone was clearly distracted and seemed rushed.  Rather than a warm and welcoming \"Great!  We're looking forward to seeing you this evening!\", I got a rather cool and rushed \"yes.\"Well, I didn't want to talk to you either, lady.When we arrived, our waitress's warmth made up for the initial coolness of the confirmation phone call. She was really delightful.  And the manager came around during our meal to make sure that we were pleased with the food.  We were.However, it's not uber outstanding.  The restaurant is nice.  It's high-end and trendy.  You know the sort of place.  A little too noisy, and the tables are too close together for my taste.  In fact, later in the evening when the restaurant was starting to clear, the music seemed way too loud (we hadn't noticed it so much when the noise was from the voices of the patrons).  For the expense, you can have food that is as good at The Grape or Savor (which I recommend over Le Bilboquet).  Those restaurants are also less noisy, and the service from start to finish is warmer.i was telling my daughter about my experience with this restaurant.  And that it is the same group who run Le Bilboquet in New York!  \"Oh\", she said.  \"That explains it.\""], ["Christopher B.", "Another tough review to write. I think this restaurant is pricier than it should be for what it offers. The wines are well marked up for sure. A mix of quite old fashioned presentations - molded lentil salad (which tasted very good btw).The delivery was more New York than Paris. Much too rushed. Waiter too intimate/engaged. Didn't understand cues - like when we were ready to order. So while the food was (mostly) excellent, the atmosphere/ambience let it down.What did we have?The crab/avocado salad, the pate and the lentil sald. All pronounced excellent.The chicken (a bit spongy, maybe overbrined?). Well seasoned and tasted good. The scallops - very nice. A medium filet that was very good indeed (the person who had it, said \"best filet ever.\". The ray which was done with wine, capers, shallots. Way too much in the way of capers, etc. Poorly balancedThe desserts were frankly pitiful. The one we wanted they were out of (the fondant), so we were comped a mousse substitute). But nah... I expect fabulous desserts at a French place."], ["Tuan N.", "I transported my wife's taste buds to Paris for our V-day date and she couldn't stop smiling from ear to ear. We had the Blanquette de Veau about a year ago in Paris and she could not replicate it in her own kitchen. She loved it! She did mention the onions were not as sweet, flavorful and soft as Paris, but she didn't care. She devoured the entire dish and we ordered another one to take home. Come to find out, the chef grew up eating this divine home cooked meal and it's his grandma's recipe! We've tried many authentic French restaurants, even in Vancouver and unable to find this dish. I don't give out 5 stars willy nilly, but everything was great in our book. The ambience, the friendly staff, the food, the cozy table setting and music resembles Paris in every-way. We can't wait to go back. What we ordered:-Pate de Campagne Maison-Les Endives Roquefort-Blanquette de Veau -Lamb Shank special with fettuccine -Profiteroles"], ["Holly E.", "Awesome date night! It was pouring rain and a little chilly as we made our way in. It was cozy and casually elegant. I knew a good dinner was in store. I noticed this place driving by for the past couple of months, then a well heeled friend tipped me off that I should try, so it's been on my priority dining list. She thought I'd love it and was correct. The wine list is global and has options for all budgets. I ordered a filet mignon with pepper sauce and frites. My handsome date had the steak tar tar. I nibbled on his plate, and he on mine. The dishes were both excellent and of highest quality ingredients. Toulouse is French fast food. La Bilboquet is quality and the pepper sauce was perfectly done! I thought I must be in Paris or Montreal with the ambiance, delicious dishes, and don't forget the pouring rain. The tar tar had capers and anchovies. My mouth is watering as I'm writing this review. My steak arrived at the right temp. After dinner, we shared the Profiteroles for dessert with a glass of port. I think I licked the plate. No disappointments! This is the type of restaurant we need in this area. I can't wait to go back for lunch on a beautiful day and sit on their patio. The service was friendly and impeccable. Another note about the ambiance that I appreciated was the music. Most restaurants you hear loud talking. Yes, you hear the talking here, but at just the right level, there's also music. Yes, I want music while I eat! Loud enough to discern, but not so loud that I can't enjoy a conversation. Classic R&B is a great choice of music because everyone enjoys from your grandma, to your 4 year old. Dallas take notice- they get it right at Le Bilboquet."], ["James L.", "As my friends know... this is my favorite French restaurant in Dallas. Love the atmosphere, food has now improved to be consistently good!!.. And service has vastly improved.... If you tried this a while ago and did not have a great experience.. go back, its really worth trying again!!..."], ["A L.", "Went for brunch with a few friends. The service was awful--like steal water off another table awful. The signature dish was okay, and the burger was very good. The brunch prices were reasonable, but no one in our party was impressed enough to go again."], ["Terry C.", "Officially now my favorite restaurant in Dallas.  Tonight I had the grilled Wedge Salad which was delicious (would like some bleu cheese crumbles next time), the Artichoke appetizer was perfect.  Again, had the chicken, cannot imagine even trying anything else on the menu the cajun chicken dish is so perfect.  Had the greatest waiter tonight, Ryan.  Very attentive and fun, made the dining experience even more enjoyable. Requested table by the windows which was the perfect place to sit.  Can't wait to go back!"], ["Jill L.", "Working lunch with a few folks. It was the first time for us so we tried one another's orders, and the food was outstanding. Salads, halibut, ginger soup were gorgeous, but the steak tartar is probably the best I've ever eaten. Raspberry dessert was both exquisite aesthetically and delicious. Service was miserably slow, but the 1 waiter was doing the best he could. Management should staff better. Lunch took over an hour + parking and drive time, which was a problem for a few of us. Overall a good experience, but they should improve their service time during the week at lunch."], ["Yelp U.", "Can't say the food is great. But I somehow just like their old style of setting. You can almost smell the mildew at this old place. But for that, I'll give them a 3-star (instead of a 1 or 2-star ;-) Just an unexplained feeling about an old place lol :) no, don't go there for the food, but for smelling the mildews lol :)"], ["Timothy S.", "-The Short-At this price point, there are many other restaurants that can provide a better dining experience than Le Bilbouquet. The food tasted good, but not exciting in the least - and the prices seemed mismatched to the experience. The service was more stiff and cold than their dress would have led one to believe and the rolls were terrible. However, the espresso was fantastic.-The Long-I am from New York, and my partner and I never got a chance to try the New York location while we lived there. We were ecstatic to find out there was a location that had just opened up here in Dallas with the same chef and food, and decided to try it for lunch. There was not yet a Yelp review when we went there.We went on a Thursday afternoon to find about a third-full restaurant with a neatly dressed older crowd, asked if we had reservations [we did not], then promptly seated without hassle.Off the bat, we noticed some odd things for a restaurant of this price range and reputation:1. The servers were dressed in a variety of mismatched clothing such as jeans or khakis - this just seemed out of sync with not only the crowd and atmosphere, but also the coldness of the service.2. The rolls brought to the table were absolutely terrible. They were noticeably cold in the middle as if they had been heated from frozen, as well as very dry and crumbly - similar to those served on an airplane - but cold.3. Not having wine with our lunch did not seem appreciated - we were planning on having espresso after lunch.4. A man with a measuring tape kept measuring the entire depth of the restaurant directly behind our table . This could not have been done before or after hours?The Lunch:One of us had the halibut  which was well seasoned and cooked to perfection and served over arugula and cherry tomatoes. The vegetables were well selected and fit the dish. Overall the dish was deemed to be refreshing, but very safe - and made an excellent plate for a light lunch.I had the Cajun Chicken - The portion was very large. The light cream sauce drizzled over the chicken was very good and the chicken was cooked perfectly. The chicken was served with fries and a small salad. This dish was pretty good overall, but made for a big lunch compared to my counterpart.We finished off the meal with espresso - this was probably the highlight of the entire experience. It was extremely smooth and still had the richness and boldness of a proper espresso and, of course, served with a small square of dark chocolate.Conclusion:All in all, this reminds me of my greatest complaint of New York restaurants; too many of them are able to simply ride on their laurels instead of relying on a solid menu with quality to sustain their business. Our experience at Le Bilbouquet left us confused as to what the restaurant is striving for as far as pricing, clientele, service, and menu.I do understand that Le Bilbouquet has not been open very long at this location and may have opening kinks, but if other's first experiences are like ours, it will only have ever been new."], ["C W.", "If you're hankering for a Francophile fix (or a Midtown Manhattan jones, for that matter) this is it.  Le Poulet Cajun, mussels and steak tartare are standouts.  Classic bistro fare executed flawlessly."]], "Addison Café": [], "Parigi Restaurant": [["Philip C.", "Top freakin notch restaurant.  Food is always fresh and delicious.  I think food took some time to come out but you can watch them in a very open style kitchen, preparing and decorating your dishes.   I saw who I assumed was the head chef / owner? coming out and making her rounds talking to a lot of regulars at the restaurant.  This place is very popular. One thing I did not like about France or Europe in general was I was not a big fan of french food.  Here is a much better translation of pastas, fish, meats, and fresh vegetables that really taste amazing.  There was one dish that came with cucumber sliced so thinly you could eat it and it had the consistency of pasta.  I was amazed.  I have only been here once but I plan to make this joint a regular!"], ["Stephanie P.", "My favorite place in DALLAS! Hands down."], ["Laura G.", "Terrific dinner last night!  The salmon over ribbons of zucchini was one of the best restaurant fish entrees I have ever had.  Beautiful use of garlic, cherry tomatoes, and a seasoned broth. Amazing. Oscar the bartender took excellent care of me, and helped me choose from the small, but universally tantalizing menu.  Lovely ambience, too.  I would have preferred a table to the bar, but they were quite busy on a Tuesday night. If I am back in Dallas, I will be back to Parigi."], ["Sandy S.", "I can see why Parigi is consistently noted as a Dallas favorite. Since recently moving to Dallas and living a stone's throw from Parigi, I have found myself coming back more and more. The staff are so friendly, welcoming and helpful in guiding me through the fabulously creative menu. Whether I have been with family or friends of all ages, the staff always accommodate. Looking forward to returning many times!"], ["Christian M.", "Absolutely amazing restaurant and staff. My partner and I go there every year for our anniversary and the food is always impeccable."], ["Real Fine F.", "This is one of Dallas's very best.Parigi always has fresh, delicious, nutritious offerings on a frequently rotating menu. They also always have vegetarian options. The lunch and snack menu (2:30-5) both have ridiculous deals for almost entirely-local sourced, perfectly cooked, healthy dishes. Both fish dishes in my photos were just $14.The veggies are allowed to shine. There is beautiful balance. And the plates served are such lookers with lovely color, texture and nutrient combos.Listed in the front of each menu are all the local farm + ranch sources from which Parigi buys its meat + produce.It's really hard to find clean, not-too-rich, artfully prepared slightly fancier food that's truly good for you in Dallas. Parigi nails it. Janice is my hero."], ["Jennie Z.", "Really wanted to love this place. Super close cute neighborhood restaurant with a nice patio...although it overlooks Oak Lawn so the view is not so great..but we all know Dallas doesn't care about view when we have an excuse to Patio-drink!Food portions were pretty good. The Lobster BLT Trio ($13) was a bad choice for a starter. 3 small baguette slices with a tiny bit of lobster in the middle of each slice. Bread was too thick, couldn't taste the lobster, and too oily all-together. Risotto ($19) was ok, too many bell peppers for my taste (do they really come in risotto??) Fish was pretty good -can't remember what kind of white fish. Seared/grilled and topped with a cream sauce, with oyster mushrooms and marcona almonds on the side ---loved the mushrooms, just a tad too greasy tasting, but all-in-all better than the risotto.Will hopefully come again to try the other dishes."], ["Jennifer P.", "We beat the lunch crowd but we were still seated in the very back corner of this tiny restaurant. I was met with annoyed glares from staff when I asked to move but they obliged. No big deal though. I ordered the risotto of the day and it was simply divine. All was forgiven! When the lunch crowd began piling in, service became scarce. Our lunch service took 90 minutes but I'll definitely be back...when I have the time for an extra long lunch. Added benefit = lovely patio scene. I can't wait to try more Parigi food!"], ["Michael Y.", "Mediocre food in a pretty presentation but overpriced. Waitstaff is friendly though... Always appreciated."], ["Lee S.", "First let me be clear: very good food and good service.  My gripe is an automatic 20% gratuity for parties of 5.  This should be guest decision, not an decision made by ownership.This is absolutely unusual, and totally odd for Dallas' better restaurants; Al Biernats, The Palm, Fearing's, Capital Grill, French Room, Abacus, Perry's, The Mansion, FT33, Oak, NHS, etc., have no such policy.   The industry standard is an automatic 18% for sprites of 8 or more.  An automatic 20% for parties of 5 is unheard of, and not an accepted practice in the business.   You won't even see this in NYC, LA or SFO.SO, just be fore-warned that 20% is automatic for 5 people.  And yes it is on the menu.  Big deal, you are already down the path by then.  Diner Beware."], ["Cassandra D.", "I went there this weekend for the first time.   We sat outside and the service was wonderful.  The food was delightul.  We had the lobster omlette and the coffee which was loaded with liquours.   It was just a lovely experience.  Oh the dessert was awesome -- a coconut creme cake with a lemon citrus filling -- absoluley decadent.  I will certainly go back soon!"], ["Logan W.", "A Dallas institution!A comfortable meal with friends on a weekday is shared no better place than parigi...A menu for everyone, a lively atmosphere with (the owner) Janice's smile popping from table to table...Year after year I appreciate it more and more...The patio is also great for a languid Sunday brunch or an evening with friends..."], ["Frances G.", "A local gem imbedded in the Oak Lawn hood. I've always wanted to try it as it is just two blocks from my house, but time and time again I find myself losing the 'where should we eat battle' when I suggested Parigi. Well, all those you doubted me - eat this!The French-inspired bistro resonates a light and airy, casual dining spot yet with an elegant flair. After noticing the over-the-tops-sized fresh floral arrangement adorning the bar, you start to notice its nostalgic value as it recalls a bar the Bohemians where used to drink Absinthe. In fact, the whole restaurant reminds you of a lovely Parisian afternoon with high ceilings, bistro styled tables, and remarkable artwork with pops of stark, bright colors. As I surveyed the room, I started to realize the restaurant's popularity amongst 'ladies who lunch' and then had a thought: they have good taste, so I know I am in a good place. The menu boasted a creative medley of fresh seafood from the likes of crab, lobster, and tuna, but also stayed closed to the classics, as well. Out of shear curiosity, I ordered the deconstructed California roll. It was presented in a cylinder mold and embellished with a generous amount of ginger with layers of fresh crab, avocado, and delicious wasabi rice below. It comes highly recommended from me!"], ["Daniel L.", "I went with 2 friends to get a quick bite for lunch.  What a surprise it was.  I noticed at least one person per table was enjoying a Rigotoni, so I asked the server what the were having.  He said it was the Chicken Rigotoni.  I orderd it as well as my friends.  We all enjoyed it.  Can't wait to go back and try some other dishes."], ["Vip B.", "I've lived in Dallas forever and have never been to Parigi. Well, that changed this past Saturday...and I absolutely loved it.The restaurant has a boutique feel, simple yet classy. We had a table in front of the kitchen and the service was outstanding even at 8:30 on a Saturday night.We had a nice Sancerre with a cheese board, tuna tataki, mozzarella salad, and Texas lasagna. Every dish was fresh and delicious.My new favorite restaurant in Dallas!"], ["Trini R.", "Dinner - January 2013.Very nice venue, interesting décor, cute & cozy.Outstanding patio dining, can't wait for summer.I was a 'wanna-be' vegetarian for the night, and was able to have a pretty decent meal here with couple options at Parigi.Appetizers - 1. ARUGULA AND PEAR SALAD - light, very refreshing & delightful2. PIQUILLO PEPPERS - GOAT'S CHEESE, PESTO, PINENUTS; a definite winner, not too spicy, cheesy and full of flavor, innovative, pretty presentation- and yummy!Entree - ACORN SQUASH - QUINOA, PEAS, CARROTS, PARSNIPS, SPINACH AND ASIAGO - tasted good, but needs to be jazzed up. Needs more spices, maybe a spicy Alfredo sauce, a gorgonzola sauce, a pesto sauce - something was missing. Just cause I eat vegetarian, doesn't mean that I eat bland all the time.Cappuccino- delightful, served with honey of course!"], ["Natalie P.", "It had been years since I last visited Parigi, so I decided to take a friend today for her birthday lunch!  We arrived at noon and were seated promptly.  Aside from them not having the bottle of wine we ordered, everything went great. Our waiter was extremely apologetic when he came back with the news, and his attentiveness continued throughout our visit. The cheese board with brie and manchego was huge and delicious, with plenty of crackers and fruit.  We needed about three more people to help us finish it. We also split the seafood pappardelle, which was great.  Plenty of lobster, a few crab claws, and perfectly cooked noodles in a white wine garlic sauce.Overall, I really enjoyed myself and will probably return with my husband soon to try it for dinner!"], ["Krystal G.", "Glad I found this place. I've never been big on French food but I may be now. The risotto was one of the best I've ever had and it was for lunch. The veggies were so fresh and it was a good portion size so I didn't feel like a whale after I ate it all. The second time I went back ready for more risotto, they apparently have a \"petit menu\" after 2:30 so I tried this lobster crab shrimp pasta and it was super yummy. The prices are in reflection of it being a more upscale restaurant but with food this good I'm willing to pay. Both times though the service wasn't up to par. If you are going to be upscale you need spectacular service. I was left for at least 15 mins without being checked on each time. Both times I needed water. Hopefully they work on this."], ["Louise S.", "We were in Oak lawn strolling round on a blissfully mild fall day when I saw PARIGI tucked away off the pavement.I could have easily missed it, except on this warm afternoon the patio was full of pretty people looking relaxed and happy. Hungry? I was nowI had actually read about this bistro months earlier and was impressed with its claim for using sustainable foods and its partnership with local farmers, so i was intrigued.Their website is actually very impressive with photos from various travels and farmers markets as well as personal notes about the Parigi owners and chefs.The decor wasrather plain which didn't matter too much as their waiters/waitresses were all gorgeous (so many pretty people down Oaklawn).On first glance this restaurant feels like it has a personality disorder. Parigi (which is actually the Italian word for Paris) says it models itself on the \"bistros ofParis,with a New York feel\" HUH?I didn't really get the feel of either of these locations from the decor (or the food) and thought Parigi would be better homing in more on its farm friendly side.Hubby got theRoasted Acorn Squash stuffed withquinoa, peas,carrots, parsnips,spinich and Asiago cheese for $12Presentation was stunning and it was true fall comfort food stuffed full of veggies and cheese! Hubby thought the cheese was too much but I thought it was great and such a simple idea executed so wellI ordered theDeconstructedCali roll with sweet lump gulf crab, cucumber, avocado, nori rice, ginger soy and wasabi for $13 Again, the presentation was wonderful and I felt like I was tucking into art! Actually this dish looked more like an ahi tower than anything elseFirst taste and I wasn't impressed. The lump crab meat was lovely but flavourless. I began destroying the artwork of the dish by squishing it altogether, much they would in a sushi restaurant (the waitresshad notsuggested this) and suddenly the taste was transformed from blah to bammmmmm!It wasinstantly a wonderful array of flavours all at once, creamy and spicySo despite the confusing genre of this restaurant it still gets my seal of approval and I look forward to returning for more seasonal samples in the near future"], ["Samantha C.", "A very unique place. Lots of locals. It is true that the locals really do come in from their back door. The hostess stand doesn't even face the front! I loved the open atmosphere of the kitchen - you can literally see the cooks do their work! I would not recommend the escargot - the garlic/butter sauce was delicious with bread but the escargots themselves had NO FLAVOR! The deconstructed California roll salad was awesome! Loved the dressing and the crab was super fresh. It was an overall delicious, light dish that would be perfect for lunch (or a dinner appetizer, as I ordered it). I ordered the grilled  fish of the day (grouper) with a salt & pepper rub. Loved it!! It was served over sautéed brussels sprouts with bacon and shallots - sooooo good! Probably my favorite part. The bacon juice did a great thing for those sprouts. I got a side of zucchini pasta - yuck! Not what I expected! I thought it would come with some pasta sauce and extra flavor but it literally tasted like shaved and boiled zucchini with no flavor. My friend got an Alfredo pasta with peas and bacon - her dish was awesome! We did not try any desserts because we were so full but the dessert menu was very enticing. I didn't love it enough to become a regular but I would like to go back for the destructed California roll salad, the sautéed brussels sprouts & to try their desserts!"], ["Danny D.", "The best Caesar Salad and Stacked Lump Crab I have ever had in Dallas...the only place that does a better Caesar salad is Venice Beach, CA...Parigi should use sliced cheese instead of grated cheese but it's still pretty good"], ["Grace S.", "So glad I finally tried Parigi!As with most higher-end restaurants, the menu isn't very long.  But what's on it is delicious.  For an appetizer, my friends and I shared the \"Cali Roll\" Deconstructed.  It didn't have any one distinct flavor that dominated the dish.  It was simply a fresh, clean tasting dish where you really just tasted the ingredients -- crab, avocado, cucumber.For the entree, I ordered the lamb osso bucco.  The lamb was so moist, tender and flavorful.  Melt-in-your-mouth good.  The creamy yellow grits that came with the dish wasn't my favorite - it made the dish as a whole a bit too heavy for my taste - but I would still recommend this dish.For dessert, we shared a chocolate molten thing with ice cream.  It was so good even the non-dessert-loving member of our dinner party enjoyed it.Finally, the interior is small, cozy, and classy and the service was friendly and competent.  A lovely dining experience overall."], ["Margo H.", "Love to sit and bar and have champagne with pate and cheese...Sunday brunch is the best to \"see\" and be seen."], ["J L.", "It's delicately placed off of Oak Lawn, small yet serene and inviting. We loved the lighted trees on the street side of the patio. The oven roasted fish was perfect. I didn't care for the farro risotto, but that's just me. It reminded me of steel cut oats....that I like for breakfast. But the chicken risotta was yummy. The hostess was a bit on the snippy side. Hey, we've all had bad days. It's ok. SHAYLA (I hope I read that correctly on the ticket) was AMAZING. Too often we complain rather easily about places and don't give credit where it's due. She gave perfect service and had such an awesome personality. We took forever talking and deciding what to order and she was so laid back and nice. Service makes or breaks a dining experience. I don't care how good the food is at a place. If the service is perfect it can make up for mediocre food. But we got both great service and delicious food. The house pinot was really nice...I cant remember the name. Definitely want to try their brunch."], ["Deborah P.", "We ate here on Halloween for the first time.  Cheese plate was amazing.  Rest of our food was good, but the service was not so great.  It appeared that a few of the regulars were getting great service, while the other tables were getting little.  Experience may have been due to Halloween, but they were not very crowded.  Do not think I would return."], ["Jonathan W.", "Recently on a vacation to Dallas, I visited Parigi's Neighborhood Restaurant on Oak Lawn Ave. I heard through the gay grape vine that it was a super HOT restaurant in town and that their menu focused on both local and sustainable products, so indeed, I was waiting with delicious anticipation to stopover once I arrived. When my party of seven and I sat down, the waitress immediately asked all of us what we wanted to order for cocktails. There was only one menu on the table and she appeared irritated that nobody knew yet what they wanted. Finally, she brought over extra menus and took our drink order with a sour attitude. I ordered a glass of Guigal's Côtes du Rhône. I was impressed. It was a lovely soft earthy wine that was kind of seductive. As I was enjoying my seductive wine, a lady with Chardonnay breathe from another table made it a point to carve out a spot right next to me and chat for fifteen minutes about why gun control is wrong. What's up with people in Texas and their guns? Finally, when it was time for me to order my food, she got the hint that I didn't want to talk to her and that it was time for her to leave. For appetizers, I tried their deviled eggs. It was nothing extra ordinary. If deviled eggs are going to be on the menu, I think they must have a \"kick\". It would be a good idea for them to add a unique spice or sauce... just to jazz- it-up some. For my main meal, I ordered the heart healthy acorn squash stuffed with quinoa, peas, carrots, spinach, and asiago cheese. It was savory. I love quinoa, I love spinach and I love good cheese.  However, like the deviled eggs, it too was bland. In fact, I wish I smuggled-in some hot-sauce. Regarding ambiance, the restaurant had a nice high-ceilinged dining room. The tables were covered in white tablecloths. The lighting was graceful and they showcased some neat art and over-the-tops-sized fresh floral arrangements.In sum, the service was poor. The waitress seemed almost put-out having to serve us. The food was dull (but well presented). The wine selection was excellent and the atmosphere had an elegant flair."], ["Rob B.", "5 out of 5.  I brunch pretty damn hard in this city and I put my body through quite a bit of rigorous training and exercise regimens to be able to compete with some of the city's top brunchers in head-to-head competition each and every week. So when someone mentioned Parigi as possible brunch showdown location I was a little concerned as, not only had I never been there, I'D NEVER EVEN HEARD OF IT. Whatever. I wasn't going to let that stop me. So I lied.  I pretended that not only had I heard of it, I'd been there several times and that the food was real solid and then asked how come they'd never been there and ended it with a resounding \"OMG, we HAVE to go if you've never tried it\".I instantly became OP.  Was I going to be the OP that delivered...or was I going to be a F...not deliver. Well, long story short, not only did I deliver I blew the doors right off the safe and showed everyone what was inside and it was everything you thought it would be and way, way more and then it was like on top of that I gave everyone cats.  Thanks for being awesome Parigi it would have really hurt my street rep if you sucked.  I just had an awesome Bday brunch here and I've just got to say this place really left an impression.  We're not the easiest group to handle and our size was almost half the restaurant and we will drink all the champagne you have and then bang our fists on the table until you call the cops. So, I was initially a little concerned and well, quite frankly, that was stupid.  Before I even got in the door of this place I was blown away to their attention to detail and just how much they genuinely cared about my experience.  The food was crazy good in an authentic, delicious, unique kind of way that made all the options really cool. Not only was every plate immaculate the service was AMAZING and they really made brunch the best part of my day. Nothing else had a chance.  So thank you.  Here have some of these internet stars and a few kind words no one will read.TL;DR - Parigi.  Food was great.  Service was great.  I had a great time. OP opened safe."], ["Tori T.", "Today I was treated to lunch at Parigi. I had the BEST server - Micky! She was so nice and explained all the items to us. I had the chicken and dumplings and the table shared a cheese plate. Everything was PERFECT! I will think of that cheese plate on a lonely Saturday night. I NEED to come back for dinner."], ["Hunter J.", "Best bartender in town! Creative drinks, food is flavorful, and very lively crowd! My favroite place and Janice the owner is delightful! We will return often!"], ["Jen B.", "I didn't even know this place existed until we went to a work lunch here.Everything looked so good on the menu but I settled with the catch of the day, salmon, served with brussel sprouts.  It was amazing.  Everyone else's meals looked good too, they included the risotto of the day, a burger, etc.  They seemed to have such a large variety of meals that anyone could be pleased with the selection.  The place had the feel of upscale but not the price with an average of $15 a plate, not the cheapest but not upscale pricing either.  I would definitely go again."], ["Laurie-Jo S.", "This is one of favorite neighborhood restaurants......stylish, intimate and cozy with an open kitchen that turns out fabulous food brought in  from local sources.       Janice Provost, owner and chef, makes you feel like you are eating in her personal kitchen.....we have loved getting to know her over the years."], ["Roxanne K.", "The uppity attitude I experienced would have knocked them down further, but the food and swiftness of service kept them at 3 stars. Two friends and myself went after a wonderful wine/cheese tasting for dinner. We strolled in at approx 9:05 and the man said he had to check to see if the kitchen was still open? According to their hours (10:00pm) I found this surprising. So, I sit down at the lovely table in this obviously semi-snob based atmosphere to browse the menu. Then realize I need to use the ladies room. I stand to find it and am immediately met with someone \"Do you need something?\" .... yes, the restroom room? Do you have one of those here? \"We have two of them\" I respond \"Wow, you all sure know how to splurge around here...\" it wasn't a demure \"can I help you question\" it was more like a \"what are you doing out of your seat\" comment... Pesto was a bit watery but the risotto scored with my friends and the gnocchi scored  points with me. I also liked the champagne as well. The flavor of the spicy red sauce alone was worth the 4 stars from me... however, the caesar was a disappointment.  Voted best of D? Really... sopping in dressing in some parts and too many croutons... it was heavy handed in general and I just stopped at some point. Pricey.. some flavor, dramatic decor in bright lighting... limited parking.... small interior... Ok food... meh..."], ["Heather W.", "Services was great. Food was amazing. I was with a large group and got a little of everything. Texas lasagne yummy. The beef tenderloin came with a magic sauce! The only thing that didn't impress was my Texas Mule. But the food made up for my drink."], ["Jackie K.", "I arguably had the MOST AMAZING DESSERT EVER at Parigi today!  I'm a chocoholic, and words cannot described how much I loved Parigi's \"chocolate goo.\"  It's hard to describe, but I'd say their \"chocolate goo\" was a combination of warm pudding and chocolate cake--absolute heaven!  And topped off with oatmeal chocolate chip ice cream, the \"chocolate goo\" was just divine.For food, I'd recommend the daily fish (I had salmon), and the knuckle sandwich was great too.  The service was friendly and prompt--thumbs up to Parigi!"], ["Jackie C.", "This place was so cute!! I went here today with a friend and had their Acorn Stuffed Squash! It was perfect!! Healthy, filling but light and hit the spot. Highly recommend it! It has an awesome patio to sit out and chit chat with a friend on. I will be back!"], ["Scott L.", "On foot in my neighborhood Keiland suggested we have lunch at one of the cute restaurants on Oak Lawn.  I was striking a blank and then I realized what he was talking about was Parigi's, a place I've been avoiding for years because of a perceived older stodgy clientle and a perhaps predictable overpriced menu, you know a fancy cafeteria for wealthy retirees on Turtle Creek.  But I was wrong.  Inside cute young waiters and a mix of down to earth locals shared a space that felt both a little luxurious and a little homey.  Our waiter was simple and professional and so was the menu: beginning with a list of their local vendors, entrees like eggs benedict, a deconstructed caliornia roll and fish specials seemed both a bit special and comforting in the $12 and up range.We both ordered the burger which was spot on and made with good ingredients.  The clean kitchen is open and exposed to the back dining area.Parigi's is a great little bistro that is easy to overlook with a lack of hype under it's treed canopy.  Not too fussy but with a vacation vibe that is perfect for a relaxing lunch with a good friend or family.The recipes might not be making any earth breaking discoveries, but this is a solid good experience.  Open every day for lunch and dinner except for Sunday, which is brunch only.  Waiter says reservations are a must for Sunday brunch."], ["Ter T.", "Our visit started with an attentive waiter who was enthusiastic and helpful who explained the wine list and menu. His shift was ending which he apologized for and handed us off to another waiter who was not as attentive. We had to pour our own wine refills even though he passed the table with empty wine glasses on it. We had to ask twice for the check. The food is ok; probably better but the lack of attentiveness did not help the taste. The problem with this restaurant is that the kitchen opens into the dining area. The wait staff congregates there and at the bar spending too much time socializing with the other employees leaving the customers to fend for themselves too often"], ["Jennifer S.", "I love this neighborhood gem of a restaurant...it is hidden and completely unassuming, but good quality food in a great atmosphere.  The wine selection is excellent and reasonably priced, the service is top notch and the food is flavorful and well presented.  Our group started with the brussel sprout salad (yum!) and then we had the beef stroganoff, the oven roasted chicken with thai coconut sauce and the sea scallops - everything was flavorful and downright delicious!"], ["Doug P.", "Had lunch at parigi the other day and I was blown away. The baked garlic appetizers and fried mushroom with truffle ranch were simply amazing. I had their risotto with canadian bacon as my main course and it was cooked to perfection. Their chocolate glob dessert topped with vanilla ice cream is something to dream about!"], ["Natalie V.", "I suggested to my party of six that we try Parigi for Sunday brunch as it came highly recommended from a good friend. Unfortunately, it simply didn't deliver and we all left completely underwhelmed. First, when we arrived as it opened at 10:30, we were told we could be seated without a reservation only if we were out of the table by noon. Um, ok? The place was essentially empty but if that's how we're welcomed into your fine establishment, alright. Frankly, none of our three couples wanted to drive elsewhere and we figured we could probably swing a 1.5 hour brunch.  After we were seated we were confused because half of the party had different versions of the menu than our counterparts. Completely different dishes.  We asked about this and were immediately told, oh, that's our old menu, you shouldn't have received that. Yet, we weren't offered current menus.  Instead, our waitress grabbed the hostess who confirmed some of the dishes were no longer available, but told us the chef could probably make the dish if we wanted. Ok? So, I opted for the chicken and waffles from the current menu. I figured it was simple enough and about time I finally tried this highly regarded chicken and waffle pairing. Two of my friends inquire about the chef's omelette and market price and are told it's $13. It wasn't until right before our food came out that the waitress informed them that it was actually $16.50. Honestly, this wasn't a huge deal, it's not like this was going to break the bank. But, it's a matter of principle. Your staff should know your prices and technically it was over 25% more expensive than you said it was. Fast forward, our food comes out, and I end up with just a single waffle. No chicken. The server doesn't even bother to mention that I've received an incomplete order. Fortunately, our waitress noticed and notified the kitchen. I coerce all of my friends to go ahead and eat since they were politely waiting for the rest of my dish. Eventually, the waitress brings two chicken tenders on a small plate and apologizes for the error. Cool, great! All is well in our world. I cut into the chicken, take a bite, look down and notice the center is completely raw. I cut into the second tender. Same story. We call the waitress over. She picks up the plate, says, that's odd and nothing else and walks away with my undercooked chicken.  Ten minutes later, as everyone else is finishing up their meals, I receive two new chicken tenders. No apologies. No offer to comp the dish for sending it out incomplete and then serving chicken raw. It was crazy and totally unexpected from what I gathered was an upscale restaurant. And, after it was all said and done, I really didn't enjoy the dish. The waffle was ordinary. I didn't like the side of honey syrup (this may just be me b/c I don't like honey that much) and the chicken tenders, when cooked properly, were relatively bland. I really wanted to like this place and am giving it two stars because though she wasn't very friendly, our waitress was at least attentive. And, my friends said their meals were fine.  Again, they weren't raving about how delicious they were, but they weren't bad.  For that, it gets two stars. Sadly, as young professionals who enjoy fine dining, I can't imagine any of us will be back with so many other great restaurants in DFW."]], "La Madeleine French Bakery & Cafe": [], "The Old Warsaw Restaurant": [["Steven J.", "I was a little nervous after my grandma picked this restaurant for her 80th birthday and I read the reviews. The place isn't as bad as some of the reviews say, but the restaurant is definitely a mixed bag. When we first got there, no one took our drink order for about 10 minutes. We thought it was pretty unusual for a place where the waiters wear tuxedos to fail at this basic task. But, once they took our drink order, the service was decent from then on. The food and menu is very traditional and expensive, but it had a good amount of flavor. The escargot was pretty great and my steak/lobster was tasty. However, myself and several other people ordered mac and cheese as a side, but they gave us all mashed potatoes with no explanation. That was pretty disappointing, but I didn't press the issue. As a 20 something, this place is a little too stuffy and fancy for a date at my age. But, it was a decent place for this type of occasion."], ["Ivy J.", "Okay I'll help the Old Warsaw out a bit since the reviews are horrible lol. I've noticed that most that are unhappy came during a holiday & ate from a special menu (which apparently isn't too great).I've been here twice with my mom on a Groupon, once for lunch (which I think they no longer offer) & today for dinner. We had extremely pleasant service both times & thoroughly enjoyed our meal both times. Over both visits I've tried their crab cakes, red snapper, ribeye, salmon, scallops, Apple pie & carrot cake & I loved ALL of it! They even ended the night by giving us red roses. The biggest drawback is the price. Even with the Groupon covering $60 of the meal, we still ended up spending over $100 which included tax, overage & tip. Although the food was awesome I have found comparable food for lower prices elsewhere. I don't think they should be in the same $ range as Nick & Sams & they are. The first time we came there was only one other party & the second time 2 parties came after us. As empty as they always are & as horrible as the reviews are I don't see them staying open much longer. It was so bad the waiters were sitting in the back room on their cell phones... bored. In closing I would only return with a good Groupon or cheaper prices. Food & service was great!"], ["Kasey B.", "I ate here several years ago and enjoyed it so much! Recently I stayed in dallas again and reserved a table at Warsaw. The hotel butler said they had  changed ownership, but we're still \"not bad.\" Should have been my first clue.  It was full that night as it was a holiday weekend. And boy did they pack us in like sardines - tables literally touching each other!Now for the worst part, the food. The change in ownership must have made some more changes. The filet was just so-so, not to mention not cooked-to-order. The ceasar dressing was very bland. Bread was no better. They still use fixed menus, which in and of itself isn't a bad thing. But the place as a whol ehas just lost that certain panache it used to have. I won't be going back, especially not with a Capital Grille jsut across the street!"], ["Joseph M.", "I will start this review with the bill, and you can determine for yourself if it was worth it : $302.53 for dinner for 3. I drove up in my car, and the valet was nowhere in sight. After I nearly park my own car, the first sight as I enter the dated, melancholy interior, is a gigantic, dirty fish tank. Inside the 8 foot tank is a depressed electric eel and a 4 foot shark, both too crammed to move. If you listen closely, you can hear the two of them hoping and begging that the eel's current will be enough to kill them both to take them out of their misery. Then, I have to stand by the front desk, unattended, for a full five minutes before anyone notices us. After we are seated, rather haphazardly, I realize the palpaple air of sadness. I looked around, and I was sure that at least 4 of the five couples around me were planning divorces, due in no small part to the depressing atmosphere. The other part that troubled me about the couples was their blatant disregard for the dress code. I was in a suit, the waiters were in tuxedos, and the rest of them were in short sheeve buttonups and jeans. I almost walked out of the place when a whole family walked in the funeral-home like establishment dressed in tshirts and shorts. Clearly this was the place to be!.....when Eisenhower was president. Now that you have a feeling for the decor and atmosphere, I'll discuss the food. I ordered off of one of their fixed menus, and started with the \"salmon tartare.\" I am relatively certain that what I was served was a can of \"salmon fancy feast\" cat food on two shreds of lettuce. Course two was beef Wellington, to which I was completely ambivalent. Not as bad as the the tartare, but clearly not worth the $50. Course three was a NY cheesecake, with the consistency of chewing gum. My table ordered three drinks in total, a martini and two vodka tonics, so you can imagine our surprise when the drinks totaled to $60 on the bill! Thank God we caught it and complained, because they certainly weren't very understanding when we complained. My overall impression of the place is that it is not worth the money you pay for it. To sum it up in one notion, it is like when you bring the rest of your family to your favorite restaurant as a child, only to discover it a much sadder, darker, colder place than before, something that you wished you left in your memory."], ["Jeremiah R.", "I have to admit; I was worried because they officially have the worst billboard ads; They went from using camera phone photos of generic Dallas blondes hugging fat guys, to grabbing google images of  foreign starlettes that couldn't have approved their image to be used (In Feb 2014 they had  Aishwarya Rai Bachchan; so either they are the luckiest little place in Dallas or they need too figure out better promotion... I almost consider offering just because I feel sorry for their taste). Don't judge too harshly however. Beside, I recognized the name when we walked past them in the cold so.....After a night at the opera, we needed somewhere to eat when we found ourselves by the crescent (Arcador Pomodor closed apparently...). Without reservations, the warsaw was  able to seat us around 9:30pm. We were starved by then. For a valentines day, 3 course dinner, at the 11th hour it was reasonably priced. They had a piano and violin player; very clean; and the cozy and \"dated\" ambience is not problem for an \"old-fashioned\" drinking couple like us. I like feeling some legacy in a place. Next we will go through the courses1) AntipastiI had the smoked salmon. Hit the spot. It could have used some dill and lemon. My wife had a tomato and mozzarella salad that looked kind of sad and messy. Glad I didn't order it; otherwise it would have ruined 1/3rd of my meal. She didn't finish it if I recall; but doesn't care for smoked salmon. 2) EntreeI had the steak, with wild mushrooms Loved it. Steakhouses have  a habit of over-salting everything; not here.  I will admit that I ordered it medium rare. One half of the steak was cooked perfectey; the other half was too bloody so asked them to cook it more. They took care of me and I finished everything. My wife had the salmon; and she says that it was good. It must have been, because I didn't get to try any. 3) DesertI had the carrot cake, she had the german chocolate. It was good; but I didn't get to finish it because my wife reminded me that she doesn't need more of me to love to love me more ;) I can't say that the Warsaw will be in regular rotation; but as an occasional intimate steak dinner it is actually enjoyable."], ["Arlene F.", "Booked a reservation through open table for Saturday night 8/9/14 at 7:15 to celebrate my sister in laws birthday.  She was visiting from Florida.  My husband and I had told her about the unique dinning experience.  We should have known something was wrong when we first arrived.   The maître d was challenged to find a table yet the entire main room was empty.   After 30 minutes a large group filed in and totally disrupted the entire atmosphere.  Then the service at our table and the others near us went down hill fast due to the 120 size private group. The restaurant should have closed the place for the evening to the general public. They never called us to warn us and provide the option to reschedule.  Terrible customer service.  They should not have charged us at all.  We will never return and will be sure to tell all about this experience."], ["Juli S.", "I gave this place one star because zero wasn't an option. We eat out a lot and have good to bad service, but this place broke the record for worse service ever. First of all they try to pass themselves off as a high end restaurant. More like frozen food heated by mexicans in the back.First of all, get there and are greeted nicely by the coat check girl, who promptly took our coats. We then talked to the Maitre' D who asked us for our reservation and we gave him our name and he stares at his monitor without saying a word to us for at least 3 minutes. Then suddenly he starts talking to the group who came in behind us all the while ignoring us. He directs them to their party by going around the corner and showing them their seat. 5 minutes later he comes back and never looking at us or paying attention. Then out of the blue he waves his hand at us and says, \"come here!\"We get a table that looks like they were arrange for maximum occupancy not comfort. We sat in a center row table that was arranged in two rows almost 2 feet from the table in front and back of us. The whole time we were there, we sat and stared at someones backs, because the seats were arrange on one side of the table next to each other so each table behind stared at the too close for comfort backs of the people in front. We order New Years Eve special which was the only option that evening. We waited about 20 minutes for the waiter who didn't get any bread or water, was handed a special holiday menu. We looked at the menu and decided on appetizers so waited, waited and waited then had to call one of the staff and told him to find our waiter.When the waiter got there, he told us we were not allowed to order just appetizers, but we had to decide on everything at once. We were confused but decided on the rest of our menu and had to wait another 20 minutes for the waiter who never showed so we had to flag another staff member to tell them we were ready.We order Lobster Bisque and Avocado Lump Crab meat as appetizers. First the lobster bisque was brown and you couldn't taste any lobster. Also it looked like they added curry powder so all you tasted was the slight watered down flavor of spicy curry. The lump crab meat tasted like it was out of a can. No seasoning or marinade so all you could taste was this bland crab meat that had the texture of crab meat but no flavor. For our entrees, we order the 22oz bone in rib eye and 14 oz lobster. Rib eye was order well done. When it arrived it had the biggest piece of bone I had ever seen.   On one end the bone diameter was literally 1.5-2 inches and the bone was at least 6 inches long. I think the bone itself was 15oz. The other half was the meat. The outer edges which are usually marbleized so you get some fat was about 1 inch of fat with a small sliver of meat. When we cut this part out, we noticed there wasn't a lot of meat left but what was there, was rare meat, bleeding red. We mentioned we ordered the steak well done to the waiter who called the manager. Manager comes over and immediately starts to accuse us of  eating most of the steak.  I mentioned the point is we order a steak well done not rare in the middle with fat around the sides. He continued to argue. So we just dropped it and wanted to just get out. The lobster was a fair size, but I swear this restaurant uses everything frozen and bought from Walmart. The lobster had no flavor as if it was sitting in a freezer for weeks before finally being served. We were so tired of waiting as we have been in the restaurant for over 1.5 hrs now so we didn't finish our entrees and we were ready to leave so we asked if the desserts could be packaged to go. The waiter refused or mumbled something so I though he meant it was coming right out so we decided to wait. Another 20 minutes later our dessert comes out. we order Chocolate Mousse Cake and Apple Pie with ice cream. The mousse cake tasted like something from Walmart store bought. It was the first mousse cake that was not smooth and soft but hard. The apple pie looked like it was a boxed package pre sliced, and they threw it in the microwave because a part of it was warm and the rest was cold as ice. Needless to say we didn't bother finishing, we asked for our checks paid and left. Worst eating out experience EVER."], ["Chris B.", "I have to agree with some other reviewers, the ambiance is a little dated. I think the food is still amazing, some of the best in Dallas, but if they took some time to update their interior to NOT look like Jack Ruby took a date there back in the 60's, they would probably be able to compete with all the newer, high-end restaurants in Dallas.Warsaw, I implore you to modernize your interior...your food is amazing, let a modern ambiance reflect that..."], ["Kylie O.", "Second posting!! Yelp removed previous one because the owner paid!!! The worst experience ever. All the menu is so overpriced! Me and my husband had a reservation for our anniversary. We had to wait for 10 minutes to be seated, and they weren't busy at all. When we came in nobody greeted us. It looked like they just ignored us. It smells so musty (all the time I wanted to sneeze) and dark inside like in an old cellar. It seems like their interior has never been refreshed. My husband's steak was overcooked. I'll never recommend this place to my friends. Thank you, The Old Warsaw for \"the best\" dinner ever!!!"], ["Tom H.", "I am from CA and went to The Old Warsaw with a large group (+50 people) on Saturday eve.  Knowing that most readers will not go deep into a review let me start by saying that the steak was delicious, perfectly prepared and was easily cut with a butter knife.  Not figuratively; we literally used butter knives to cut out tender steaks.Service: Friendly but a little slow at the start.  I think because we were big group as once we got going everything flowed nicely.Decor:  Old, dark; they have held on to the old school steakhouse feel.  There is a wall with pictures of celebrities that have visited the restaurant.  I would encourage them to reach out to more recent, relevant stars to see if they can upgrade some of the pictures.Food:  I already told you about the fabulously prepared steak.  Others at the table I with me had the salmon with lobster and they said it was very good.  The desserts were amazing; homemade vanilla ice cream!There are several negative reviews and as I am sure there have been here and there issues, just as you will find at any restaurant but The Old Warsaw deserves more than the overall 2.5 stars it has.  If you are looking for a classic, old school style steakhouse with a few French items on the menu and you are OK to spend a little, I encourage you to give The Old Warsaw a try."], ["Tricia P.", "The worst experience! The venue is stuffy, it smells of mold, it's dark, the food was alright, but the experience was horrible. I will not waist my time going into all of the details as to how horrible my experience at this restaurant was, but this is how it ended. I didn't eat even 1/6 of the food on my plate, I let the waiter know that I wanted my food to go, he took it to the kitchen and packed it. When I got home and looked at my food they had only packed the meat portion and none of my meat toppings, sauce, or sides. I paid $60 for my dinner and was treated horribly at the restaurant. Then they stole my food when they said they were packing it to go for me. I called and spoke to the manager letting him know what happened. He called me back the next day and said they would be refunding $20 of my $160 check since they neglected to pack more than half of my dinner plate. I thanked him and thought it was over. Again, The Old Warsaw was a great disappointment. They never refunded or credited my card. I will never go here again. I have never been treated so poorly. Believe the bad reviews!!!! They are all true!"], ["Chris V.", "The food was ok. The atmosphere was great, with everyone dressed formal and the violinist. The service was great as well. The decor was lacking. It smelled musty as soon as we walked in the door. It looked old and with the smell it made the place feel dirty. I'm not scared to pay for a meal if it's worth it, but this meal was not. It's one of those places everyone says you must try......it's not really!! And yes they use ikea silverware. I didn't see it on the plates. Makes you scratch your head and say Really????"], ["Jenna W.", "I dined here on a Saturday with my parents and boyfriend to celebrate my mother's birthday. To be honest, I was pretty apprehensive because I had heard way more negative than positive things about The Old Warsaw. First of all, the service feels European, which is a huge plus for me. Sure it takes longer to get your drinks and food, and you'll have to ask for the check. But I personally enjoy not having a waiter interrupting the conversation every 5 minutes to \"check on us\". I thought that the menu had a decent variety of steaks and seafood. You can order a la carte or choose from 2 prix fixe menus. The food was impressive, but I don't think I'll find myself craving anything I had. I started with the lobster bisque. It had a bit of a kick to it, and was not as creamy as most bisques. My entree was steak Diane and a lobster tail. Both tasted great! Now that I've had some time to think about it, that was the most tender steak I've ever had. The chocolate soufflé was huge and pretty mediocre, something tasted off about it. My parents really enjoyed the raspberry soufflé, though. I have heard people say that the decor is extremely outdated and I agree. There is also a noticeable musty smell when you first walk in. I'm pretty sure that my boyfriend and I were by far the youngest people in there, and we're both 25. Some younger-looking people eventually trickled in later in the evening, but this is definitely a much older crowd than expected for the Uptown area. Overall, this wasn't a bad experience by any means. However, I  don't think I'll find myself wanting to go back."], ["Tiffany R.", "Gnat was in my lemon drop that was giving to me... The food was okay but NOT for $50 a plate..."], ["C S.", "Nothing to be thankful for with our dinner on Thanksgiving day.  The place was half empty when we arrived but it still took almost 15 minutes to be seated, with a reservation.  The booth was dirty, covered in crumbs and we had to clean ourselves.  The charger plates--all 3--on the table were also dirty and they seemed upset when we asked for clean ones.The menu is a set mine, with three choices of menus and multiple options with each different menu.  We all opted for a traditional turkey dinner, tried two different salads and three different desserts.  Everything was a disappointment.  When we asked the waiter a question about the turkey, he had to run and ask someone, and this was forwards the end of their day.  Not encouraging.My two companions requested dark meat turkey while I opted for the traditional breast.  It came with dressing, potatoes, cranberry sauce and vegetables.  The salads came in a timely manner, but the presentation left much to be desired.  All the ingredients were there, we think, but hard to tell. The tomato mozzarella was easier to find everything.  Portions were skimpy on salad.When the main dishes arrived, we almost sent them back and walked out.  I was SHOCKED!  The turkey came out in shreds, no nice slices to be seen anywhere, drowned in gravy.  The servings of the sides were literally the size of a tablespoon, with the dressing burned, the cranberry sauce runny and potatoes tasteless.Desserts we tried included the pumpkin cheesecake, chocolate mousse cake and the carrot cake.  The portions here were large but the carrot cake was so dry it crumbled when you cut into it, the pumpkin cheesecake tasted store bought.  The chocolate cake was the best of the three and not bad.When you want a memorable Thanksgiving experience, only come here if you want a miserable experience to remember!  Cross this one off your list--permanently.  What used to be a place of grandeur and wonderful food seems to have become rundown, cheap, dirty and lackluster."], ["Charles H.", "This review is not about the food because I never had the opportunity to eat at The Old Warsaw during my father's 69th birthday surprise dinner.  How did that happen Charles?  I am glad you asked.My mother made reservations at 8:30.  I arrived early at 8:15 or so.  My family wasn't there, so I took a seat in the dark bar area.  I will come back to the dark bar.  I had a Jameson (neat of course).  I asked the hostess to let me know when my party arrived.  I waited and waited and waited and waited, went to the restroom, then waited and waited.  Around 9, I call my brother...voicemail.  My mom...voicemail.  I leave, the receive a call from my mother who apologized for missing my call and then said this, \"Sorry you missed us at dinner.\"  I asked how that was possible because I was at there, waiting.  She said they arrived on time.  I am already pretty irate because I was thinking no one showed up and no one called.  I realize that the hostess never came to let me know my party arrived.  My mom thought I could not make it to the dinner.The best I could figure is that they must have come in when I went to the restroom.I go back to the restaurant and ask to speak to the manager because I missed my father's 69th birthday surprise dinner.  I speak to the same hostess and someone who seemed like the head waiter.  I asked them why no one notified me when my party arrived.  They just kept apologizing and then he offered me a drink to pacify me.  I asked to speak with the manager.  After waiting for 10 minutes, I was told the manager was too busy counting money to come see me.  They didn't even offer to take my name and number for the manager to call me.Back to the dark bar.I was the only black person in the restaurant when I arrived, the only person at the dark bar, which is probably why they forgot about me.  They couldn't see me.  Also, my family is black but putting all of that together was a bit much for the staff.I am glad to know I am not important enough for the manager to stop counting money and offer an apology.  I could have combed the restaurant, but I am thinking at a place like The Old Warsaw, they should remember to get the guy at the bar when his party arrives.  I am thinking this is what they do, especially when I say, I will be at the bar and they say, we will come get you when your party arrives.Bottom line is that it is clear that without status, wealth or some other qualities of which I am not aware, The Old Warsaw could care less.  I didn't ask for a free meal and didn't take the drink.  I really wanted the common courtesy that should come with missing such an important family event.  I am going to call them to see what they do.  I will keep you posted."], ["Jennifer S.", "What can I say? Not impressed. We came here on a Saturday night and were seated in the overcrowded area down front. My chair was touching the table behind Us. The servers were constantly rushing by and literally holding trays over my husband's head as they passed. That's how tight it was. Our server took forever to come to our table and when he did, it was just a \"what can I get you?\" No mention of specials, no introduction. We ordered our wine and entrees all at once, for fear he might never come back. The waitstaff seemed to be very rushed and overextended. The food was okay. I had the filet and my husband had the bone-in ribeye. They were good but nothing to write home about. I will say that they do truly know the definition of \"medium rare,\" unlike so many other steak places. The Italian cream cake was good.There was a pianist and a violinist present that night, and they took requests; we enjoyed them a lot. If I ever come here again (and this is a BIG if), I would be sure to request one of the 2-person tables against the wall. Those people seemed to be better taken care of than the \"cattle call\" couples' tables in the front. Honestly, they should consider reducing the number of tables in that area from 6 to about 2."], ["Leslie B.", "The WORST \"high end\" restaurant in Dallas. By far the worst restaurant experience I've ever had. I can't believe this place has been in business for so long. Who in their right mind would think this is good? I went there with my fiancée for my birthday after it was highly recommended from or of his friends. We walk in and it smelled like a mix of old woman cheap perfume and a nursing home. No hostess was available to seat us. We had been waiting a good 10 mins and were thinking about just going to sit at the Nick & Sam's bar (Oh I wish) when the hostess finally came up. She seated us in what looked like the wine room. It seemed okay but a waiter came by every 5 mins during our entire time sitting there and needed a wine directly behind where I was sitting. I had to get up out of my seat (while I was eating) to let him get bottles of wine. Our food was horrible, gross and disgusting (no exaggeration). The appetizers and entrees looked like a lean cuisine frozen dinner gone bad. I'm certain the meals are frozen then microwaved. Our dessert looked like a previously frozen Albertson's cake. Then, to top it all off, they give a white rose to the women at the end of the meal. HELLO - a white rose signifies death. That's that they give people at funerals. Maybe it was their way of signaling the end of our horrifying experience. The worst $200+ we've ever spent (I had 2 glasses of wine and he had iced tea. The crappy food cost that much).  Please do yourself a favor and do not go here!"], ["Deborah M.", "I was very disappointed.  We made reservations for our anniversary evening and was surprised to find the place empty.  Well, after the food started arriving I completely understood.  The appetizer was very good but my steak was so undercooked I couldn't eat it.  The lobster tail was inedible and the dessert was certainly not worth the price nor calories.  I ordered decaf coffee to end my dismal meal and at 2:30 in the morning, I was certain it was not decaf.  The service was mediocre, he really wasn't too carried away with his job to say the least.  My advice, find another high end steak place, Dallas has a lot to offer but The Old Warsaw is not one of them."], ["Eating Out S.", "So disappointing.  I tend to be very forgiving, having been in the industry my whole life, but our experience was inexcusable, considering how much they are asking you to pay.  There was no host to greet us, and as we politely greeted the person that did notice us and walk to the host stand, he honestly looked indifferent and confused that we wanted a table, AND we had a reservation and it was only 6pm.  Service was very awkward and inconsistent, to say the least.  Servers did not even speak in full sentences.  \"Want drinks?\"  I held my tongue for the sake of my friend, but if it was me and a closer friend, and I was the one paying? - I would have stood up, paid for my drinks at the host stand, and left.  It was a total joke.No music.  We sat in silence for over 45 minutes, waiting for the pianist and violist to start.  Salmon was extremely salty.  Truffle Mac and cheese was flavorless and seemed like it was watered down.  No offer to ever refill cocktails or ice tea.  Had to ask for the wine list after dinner was already served.  No offer of coffee or tea.  Asked for hot tea and the manager was flustered and said he \"didn't think they had any.\"  Then he said, \"Oh wait, let me check,\" and came back with a display box with more than 15 empty spots and only 4 spots filled with unidentifiable brands/kinds.  If that's really all you have, present them on a small plate, for heaven's sake!  There are so many great restaurants in the area, don't waste your time and money, thinking that since this restaurant has been around so long, that it's for any good reason."], ["Paige B.", "It's a shame that such a historic restaurant is being marred by terrible service. My two experiences at The Old Warsaw have been tainted by a festering carbuncle disguised as a scowling waiter. Condescension abounds. And my, how it is unwarranted. Even the kind and talented musicians cannot compensate for a barren restaurant that is continuously laid to waste by pompous staff. I have never seen an \"upscale\" restaurant in Dallas so desolate on a Friday night, much less two. One waiter in particular can be seen screaming at the litter of busboys frantically trying to appear busy in an overstaffed restaurant. His interaction with the patrons is interleaved with breathy impatience and eye-rolling that would put the prissiest valley girl to shame. There was no knowledge of the menu beyond how to use it to assault my collarbone. My apologies. I was just in the process of arranging the wadded napkin that was so generously thrown into my lap by a silly, self-important lunatic.Paying for tasty, albeit exorbitantly priced food should have some justification through excellence in the service. This restaurant is capable of something so much better. Please, Old Warsaw, lance this boil and save yourself!"], ["D G.", "Old school place.  Went here high school prom 19 decor not changed much.. my by strip good. Wife riveted gristle.  Monday slow night. Smaller wait staff. Took long for desert and then check. Staff was polite"], ["Damon B.", "Went to dinner last night for a small company holiday dinner (16 of us in our party). The piano and violin combo was nice. The violin player made several trips to our table during our 3 hour dinner. We ordered a lot of different appetizers and I stayed with the Caviar ($75 for order) but the jumbo shrimp was also great.For an entree, I had the 24oz bone-in rib eye, cooked perfectly medium rare. The flavor was great, as with any piece of meat, you want the flavor of the beef. It came with asparagus, and I got a side of the potato's au-grautin, my wife had the Chateaubriand, cooked perfectly and a side of cream spinach. She liked them both.Our wine was the, Casa Lapostolle Cuvee Alexandre Merlot, a nice wine from Chile. For dessert, we finished with the German Chocolate, it was great. The service is lacking. They try, but are not polished and do not understand true fine dining. The waitress knocked over two drinks, and when the waiter took our order, did not get the order from the women first. When he came to me, I asked if he could take my wife's order first, and he was shocked. He forgot my side of potatoes and did not bring me my coffee at the end of our meal.Overall, what made the dining experience OK, was the company of people that we were with. If I did not have great conversation, music, the Christmas spirit, I might give this 2 1/2 stars instead of 3. However, everyone in our party had a great time, loved the food, and the wine."], ["James C.", "My wife and I went there for an early Valentines dinner, on Friday 2/13/15.  It was by far, the worst experience dining out that we have had.  We only met our waiter once who greeted us, and asked if we were ready to order.  Never even got his name, or saw him again after taking our order.  The refills, very sparse in between, for water and bread we done by two separate people who never spoke to us.  My filet was grossly undercooked, and I never got a chance to tell anyone ,as the waiter never came back. We never even received out dessert we had ordered.  I went up to the front to complain, but was handed the check instead by the waiter.  After asking for a manager to speak with, I voiced my experience at their restaurant. the manager, who turned out to be the owner, wouldn't tell me his name because  he know I was going to post a review on yelp.  He volunteered to take desserts off the bill, since we never got them but that was it.  No apologizes, he just said the restaurant was busty and we would have to understand.  I explained that we were paying for  good food and a great experience, and received neither, but he didn't care.  We will NEVER go back, and I would advise everyone else to steer clear."], ["Lauren T.", "FOOD: 3 starsATMOSPHERE: 5 stars in the romantic departmentI can't remember what I ate when I came here, which tells me the food wasn't that memorable. However, it wasn't bad... I think I enjoyed what I ate with no complaints. But I am mostly writing this review for the atmosphere... It is truly lovely. Super romantic with very dim lighting. If you want to feel like you went back in time to a swanky dining room in The Titanic, then come here. Literally! It is warm, beautiful and great for a romantic dinner spot with the one you love."], ["dean d.", "Old School restaurant with old-school menu and old customers and attentive but aloof waitstaff. Worth savoring once in a while. Fixed menus have all the classics no one else serves, for Steak Diane to Beef Wellington. Come once, it's memorable."], ["Maria G.", "Ordered the \"Holiday Special\" with the price listed on the menu, which is very reasonable at $39, but when the bill came the price was $10 more per person. Check your bill at this restaurant. They promptly changed the bill amount after our request. The salad greens were yellow and mostly inedible. The wine list has some great Bordeaux at good prices but unfortunately have not been stored properly. The desserts were supermarket quality. The best things about this restaurant were the generous cognac pour and the live piano music. Much better restaurants in the Dallas area! First and last time at this restaurant."], ["Travis H.", "I've had overpriced food before and it's usually overpriced for a reason.  However, this time it was just overpriced to have a price tag on it attracting people with deep pockets and poor taste buds.The multi-course offering was the best part of the experience alongside a very nice waiter.  The Brie soup was the only dish I liked, skip the bone-in fillet, skip the lobster crepe, skip the bread, skip the place all together."], ["Joe K.", "Excellent restaurant for your classic french dining style experience.  It's a great date place, as the surroundings are very romantic.I don't frequent this place, as it is a very expensive restaurant.  But it's a nice place to go if you want to splurge or if you have a coupon.  Keep in mind that two people eating the \"Nightly Special #2\" (their standard four course meal) will run you $140.00 before tip.  Here's what I recommend.:Course 1 (Soup) - Brie Cheese SoupCourse 2 (Appetizer or Salad) - Crab Cakes (if they have them.)Course 3 (Main Course) - Get a steak.  I think I had a filet mignon once here that was awesome.Course 4 (Dessert) - Either the Grand Marnier or Chocolate Souffle.Anyhow, it's a great splurge.  Make sure to bring plenty of cash so you can tip the entertainment and the valet."], ["Matt R.", "How is this place open? Walked in and smelled a mix of white diamonds perfume and rotten crab shells. No host to seat us for a good five minutes and when we were seated it was in an awkward row of tables in front of a piano player and violinist. We had a bad feeling and hit yelp to see the underwhelming 2.5 stars. After a cocktail we decided to eat elsewhere much to the chagrin of our waiter who didn't greet us or speak a lick of english. Its been in Dallas forever but dont let that fool ya."], ["Paul H.", "A Dallas institution, but it's becoming a bit antiquated.The food is usually of a very good quality, but at the prices charged, it is not a good value.The atmosphere is old person stuffy, but nice, and suitable for a romantic dinner.  I hate to say it, but the place smells kind of musty.Their entrees are relatively pedestrian.  I will say the desserts are very, very good; the chocolate souffle is the best thing there..The service here is always very good. They are attentive without hovering.My only real complaint?  The freakin' violin.  Look, I like the violin as much as anybody, but it's like a gun: it should be used with discretion.  I was trying to conduct a business dinner with a prospect who was female. Ten minutes after we sit down,  they sic the violinist on me, I guess assuming it was a romantic dinner.  The only thing I was trying to romance her out of was some business.  Anybody with a whit of common sense could see it wasn't a \"date\" but ol' Paganini kept sawing away.  We couldn't talk, we couldn't concentrate...it was a real pain in the ass.  I slipped him $20 to buzz off; it was more like extortion money than a tip."], ["John D.", "Are you kidding me ?  Way overpriced - terrible service and below average food.With all the nice restaurants in Dallas hard to see why this place is still open.  Maybe when the old time clientele moves on they will come out of the time warp and either revamp this place or sell the real estate.   The Old Warsaw has served it purpose and is stuck in time with outdated overpriced food, service and atmosphere."], ["Jean S.", "horrible food. nice atmosphere. acceptable service I will never return."], ["Ada H.", "We went there for a company dinner. Lets see. Service - didn't ask what I wanted to drink just dumped Chardonnay into my glass at the bar. I noticed the wine bottle was dusty, but then the wine had a sour smell. Asked for a Shiraz instead responded by a grumpy face. My coworker got a whiskey and coke, and he said it was terrible and had to get a beer. How do you mess up whiskey and coke???Food - pea soup they served was for everyone yet half my table didn't get it. Pea soup was eh pea soup. Then our apps we ordered came out. I got Smoked Norwegian salmon which tasted like what I buy at Tom Thumb in the prepackaged seafood aisle. The entree - ribeye was half overcooked and half perfect. I started on the wrong end and ate half. (Later I asked for the other half to go. Waiter said OK and never came back with my To Go.) Lobster tail - half was tender and the other was dry and rubbery. Truffle Mac and cheese - dry. Biscuit was non memorable. Shiraz was terrible. Yeah, don't ever go people. Overpriced and below avg food. I woulda enjoyed my steak better at Outback.Cmon Old Warsaw! You're right smack in the middle of bourgie town! You gotta pick it up!"], ["Curt S.", "I called The Old Warsaw and scheduled a reservation.  As I was getting off the phone, I mentioned that I would be using a groupon- at which time I was told the reservation was not available for me.  Both the host and the manager I spoke to were incredible rude- telling me they only would accept a groupon when they wanted to, and they didn't want to that night.   I even explained that the timing of my already confirmed reservation was particularly key (tickets to a show after coming straight from the hospital where I was visiting a critically injured friend).  I can certainly understand the reasons a restaurant would not want to use groupon type programs, but when they make a decision to do so, to not honor the program after I paid for it while being very rude is really frustrating.  If groupons and the people who buy them to try out your restaurant aren't worth it, then don't offer them.  As it is, you have just ensured that not only will I never try your restaurant, but I suggest others not as well.There are many great top rated \"fine dining\" restaurants in Dallas, no reason to spend your money at a place that treats their guests so poorly."], ["Tara A.", "I was with a friend staying in Uptown for a weekend.  We wanted a nice meal and opted for the Old Warsaw.  The decor as well as the impeccable service takes you back to much classier times.  The food was prepared to perfection.  Even though our dinner was not a romantic one, this was obviously a go-to place for that objective.   And you cannot leave until you try one of their souffles: truly the best I have ever had!!  It will definitely be on my list when I go back to Dallas!!"], ["David L.", "Old is a fitting appellation. It's an old-world restaurant for an older school of Dallas. Decorated with dark fabrics, paintings, and elegant chandeliers, the space is intimate and graced with live violin and piano. The table service is subdued, attentive, but unobtrusive. They have two nightly, four-course prix fixe menus along with another a la carte page, mostly in a sophisticated French-Continental style. I was impressed with everything, aside from the creme brulee, which was surprisingly nontraditional, at least for my American palette. I can see how this is too stuffy, traditional, and subdued for the Yelp crowd, but it shouldn't be altogether dismissed."], ["Tam J.", "Until my mom mentioned it yesterday, I absolutely CANNOT believe I did not write a review for this place.  Actually, I believe I may have, but just not on Yelp.I don't know where to start, but let me give you the end of our evening after visiting this place, Dallas Police officers had to be called in, because the owners are the MOST racist, rude people to ever own a restaurant.  How do people visit this place still.  To this day, this is the worst service I have ever received in my life.ServiceMy husband, mom and father went for an evening dinner.  My mom wanted to treat us since she purchased a Groupon with them them.  From the moment we arrived, they hardly greeted us and put us at the side table.  We wondered if they had forgotten about us, because no one came to the table for 15-20 minutes to take our drink order, though they passed by numerous times.  Let me also mention that there were about about 4 couples in the restaurant with us.  FINALLY, the server came and did not apologize.  When we asked about it, he brushed it off.  From the moment we spoke to the server, my mom mentioned the Groupon and the server made it seem as if it were a problem.  She asked to speak to the manager just to confirm we will be able to use the Groupon (even though we were within the expiration and did not foresee future problems that would arise from using the Groupon THEY listed).  My mom asked about specials that the server never mentioned (we heard him mention it to another table) and he kept getting a worse attitude with every question we asked.  For example, we would ask for a suggestion between an item and he would walk away and not answer.  At that point, I mentioned to my family that I am ready to leave, but they wanted to stick it out and enjoy the evening.  We finally ordered our entire meal.  It took about 25 minutes to receive our soup appetizers in an empty restaurant.  When we received it, it was very luke warm, almost cold.  I was upset, because we had been in the restaurant for a long time, rude service and then luke warm soup AND the manager kept passing by and not speaking to my mom after she asked for him about 50 minutes before.   We sent the soup back and this pissed them off even more.After sending the soup back because it was luke warm, my mom decided to get up and ask the manager if the Groupon would be okay, since the server made it seem as if it were a problem.  She mentioned, \"Hello, I asked the server if I can speak with you for a moment regarding the Groupon\" and he YELLED (YES, YELLED), \"What do you want from me?\".  She asked him, \"Sir, why are you yelling at me, I just asked a question\" and he kept repeating the same thing.  So she came to the table and mentioned it, it was at that moment that I said, let us pack up our things, it is overdue that we are still at this establishment.  We asked for the bill, since we ordered a bottle of wine and drinks.   When the bills came, the manager put the ENTIRE bill together, which was over $215.  I told the server, we have not received our entree and no one ate the soup, the service is a huge disappointment and the manager yells at my mother, so why is the entire bill here.  We refused the pay the entire bill and they refused the Groupon.We went to speak with the manager and that is when everything got worse.  He YELLED at us in the restaurant and said we will pay and not leave and told the valet to keep our keys.  I was so confused as to why we were treated this way, because we were standing there trying to pay what we consumed and only mentioned their extreme lack of service, so why were we being charge for items we did not even receive?  I mentioned that I will call the police to solve this and he said he will do the same.  He told the police, these type of people are here and do not want to pay. \"These type of people\".  I know what he was insinuating, but from how we carried ourselves after being treated that way, I think we deserved better than that.Long story short (while still holding our keys), the police made him take what we had not consumed off the bill, made him accept the Groupon, because it was not expired and able for our use.  The police officer apologized to us and mentioned how he has had heard of many complaints with this restaurant AND he and his wife experienced the same level of service months before and decided to leave.  FoodWe only ordered the lobster bisque and though it being very luke warm made it not as tasty, it lacked salt and there were no lobster chunks in the soup.  Extremely mediocre.AtmosphereSeems like an old rustic building that once was beautiful, but in need of renovations.  Can be absolutely beautiful, but the owners need to invest in the building.If I could not give this place a star, I would.  But Yelp does not provide the option"], ["Marianna W.", "I knew of this place and their extremely negative reviews, mostly from the DMN and other local reviewrers.  Boy, were they spot on!  No Groupon, No RW, just a visit a local friend requested.  Ugh!  They need to get  a clue, so disappointing.  The decorating - outdated, the service - pompas and sucks, the food- over priced, over cooked, under seasoned, what a waste of money.  But my own fault, Yelp reviewers have nailed it, not worth the time or the money. Such a tragedy, the owners of Old Warsaw are that, old and out of touch. Pity, it used to have a solid reputation.  I am too beat down to even give specifics on my visit, but will soon. Just a beat down.   Back to the food: avocado stufeed with crab and green goddess dressing was good but salty, NY strip ordered MR bordered on well done, bummed but did not send it back,  by this point I just wanted out,  grilled asparagus had barely seen the grill,  sauteed spincah - I rock this side when I make it at home, theirs was over cooked and over salty, key lime pie we split was okay,  they need to get a clue"], ["Krystal S.", "Had a groupon and went with friends. When we arrived the place was so quiet!  Not a person in the place at 6:45. The bar area was dark, so dated, and they didn't even have the bar stocked.  When our friends arrived we sat down. Ordered off the pris fix menu. Cesar salad was disgusting. Lettuce was wilted and old. Steak Diane was raw and the sauce was like a bad brown gravy.  They even managed to mess up desert which was supposed to be chocolate mouse cake. That was not mouse it was terrible icing. The bread was good by the way, but they would only bring me one piece. The bill was $500.  So not worth it. Would have rather gone to any other top restaurant in the area without any coupon at all!!  I guess it shows something when a $$$$ restaurant has to use groupon. I think they should do themselves and the public a favor and close!  Sorry, it used to be one of my favorite places in the '80's."]], "Lavendou French Bistro": [["Alex S.", "This update feels like it should have been written much sooner than now. Considering I have been to Lavendou more than a dozen times since my original review and have had nothing less than five-star service, yeah, I'd say this update is a bit late from my keyboard to your eyes. There are other French restaurants in town, there are other bistros in town, and there are probably other restaurants in town that have nifty yellow awnings, but there is only one Lavendou. And it is absolutely an essential dining destination in the DFW area.Everything about Lavendou is warm and inviting. Here is a quaint French bistro in a strip mall not too far removed from the highway, yet it feels like you may have stumbled into someone's dining room off an alley in Nice. Put it this way: every time I have eaten here, I immediately forget there is a sports bar, a Christmas store, a sushi restaurant and a condom store that's bigger than every other business in this shopping center, all within the immediate vicinity. The yellow awnings stand out apart from everything else, and surround an enclosed patio that can get pretty packed during the summer nights.A couple doors separate you from the outside, but once you cross that threshold, you are in a place that just feels natural: it's not forced, it's not cold and it's not overwhelming. The hostesses, who are always welcoming and always on top of their fashion (where can I get red loafers?), greet you right away, and are quick to meet just about any requests you have: obviously, it's tough to request a table in the crowded secondary dining room, but the front desk staff, as well as the owner, will do everything they can to accommodate you before sitting down. The owner, especially, is a friendly guy, dressed to impress and quick to talk to every table in the dining rooms.The restaurant is a picture of comfort. Warm yellows, pleasant lighting and home decor like plates, lamps and other items you might see in Grandma's living room are all around. The front dining room can be chilly depending on how much the entrance door is open, and the back dining room can be dark and quiet, but the middle dining room would make Goldilocks proud because it is just right. TV can be found in the small bar immediately to the right when entering, but otherwise, this is an intimate, quiet and easy-going dining experience, all overlooked by a team of professionals.From the bussers to the waiters, everyone here is exceptional at their job. Your drinks will never need a refill, which is great since that lavender tea is incredible. And the waiters are all outstanding, from greeting you to recommending dishes, regaling tales of life in France to letting their senses of humor out if you allow them. It may be crass to recommend a server here, but far and away, Bernie and Pierre are the star servers. Both keep the dining experience paced, both know wines like the back of their hands and both have been gracious to field any requests we may have had: a special shout out must be given to Pierre, for one night waiting on our party that started out as a reservation of four, and almost doubled to an unannounced party of seven, as well as for another night when he re-ran our tab to take advantage of a discount we had neglected to claim initially. His ease and friendliness with his guests is, like everyone else here, completely natural and welcoming.But what about the food? Friends, you know the food is the best in town. Escargot is a staple appetizer, but frog's legs and bone marrow show up on occasion for specials. And all three are essential. Lobster bisque and French onion soup are a must, no matter how full you may be. And the entrees... The duck is an acclaimed house specialty, the lemon sole is melt-in-your-mouth delicious, the ribeye is my go-to choice because it's phenomenal, and the list goes on and on. Desserts are in a class of their own, with the soufflés being the show stoppers. But apricot tarts, profiteroles and a really savory vanilla-pear concoction (trust me, it's good) all ensure your taste buds will feel satisfied as you finish up your meal.I could go on and on about how amazing Lavendou is in every facet of their operations but writing about it just makes me want to go out and eat there (despite the fact they're not even open at the time of this review). The staff is outstanding, the food is even better and the atmosphere wraps it all up in an inviting experience, whether it is your first time or your fiftieth. Look for those yellow awnings: you cannot go wrong once you step under them."], ["Vanessa C.", "Serving the lighter fare of Southern France, Lavendou offers many items to tempt your taste buds. One of their star dish is the Canard Rôti au Cassis, roasted duck with cassis sauce served with wild rice. The duck is so tender and flavorful, the meat can just fall off the bone. The wild rice infused with an orange citrus zest was the best I've had yet to try.If duck, frog  and salmon are not your forte, I would recommend the Tournedos Félix Faure, tenderloin with cracked black pepper, mushrooms dressed in a cognac cream sauce served with pommes frites (french fries). My mouth is watering just thinking about it."], ["Jasmine T.", "I went to this place on Restaurant Week last Friday because I've always been partial to French cuisine/bistro.  What made me gave this place three stars is that as much as I really wanted to love this place, it could be because I'm not really into the provencale flavor.   For ambiance alone and the effort of good service I'd give it a 5.   Or maybe if I had what my boyfriend had, I'd probably give it a 4 star.  I got the arugula salad with the cherry tomato tartines as my appetizer while my boyfriend got the clam chowder.  The clam chowder beat my salad.  For entree, I got the chicken with the creamy sauce with wide noodles, while my boyfriend got the steak tenderloin with frites.  His choice entree beat my chicken, so strike 2.  The only thing that is tied in my book was the dessert.  I got chocolate mousse while he got the berries and cream.  The experience overrall wasn't that bad, but I\"ll probably come back in another many eons from now."], ["Stephanie S.", "I had to take away 2 stars for the dreadful service by our waitstaff, Robert. He was despicable! I had a birthday tea party for me and 18 other ladies. Everyone complained of his rude and dry demeanor. Several times we couldn't even find him! On a good note the high tea was delightful! The sandwiches were tasty, the pastries were warm, and the place settings were too cute! I would love to go back for high tea but need to make sure Robert is NOT working that day."], ["Chelsea G.", "WORST SERVICE EVER. My fiancé and I decided to treat ourselves to a special dinner after we had both had extremely difficult work weeks. We went with a restaurant.com gift card we had been given, and immediately upon showing the gift card, were treated as if we were low life peasants that had no right to be there. We did not order the wine, as we both were tired and opted out of dessert. From that point out, they carried on lovely conversations with everyone around us but refused to even send a smile our way. Apparently, two young people are not worth their time and our bill wasn't high enough to merit good customer service.On top of that, the lobster bisque tasted like lukewarm leftover tomato soup. I would venture to say almost any restaurant I have been to around the world has better lobster bisque. Then, my subpar, over cooked, heavily sauced salmon was presented. Mediocre at best. My compliments to the chef at making a meal that my mother could outdo in approximately 10 minutes. My fiance's New York strip steak lacked flavor and was drowned in a sauce to mask the fact that it had been overlooked and tasted like rubber. So. If you want a real double whammy of RUDE service and overpriced, distasteful food, then this is your place. If you like to enjoy your meal and feel as if you are welcome in the restaurant and would like to be treated with respect, then you should literally go ANYWHERE else in DFW. There are quite a few fabulous restaurants that I will gladly refer you to. Oh, there is a saving grace. The bread is great. But don't order too much of that either or they'll look at you like a pauper trying to fill up on the free bread."], ["Leila H.", "So disappointed by the food. I had really high hopes after reading all the reviews on yelp but really couldn't be more disappointed. We started with a soup, hubby had the lobster bisque and I had the French onion. The bisque was cold and didn't even taste like lobster, the onion soup was basic. Then we had the duck with cassis sauce... Dry dry dry, didn't taste good, the wild rice was awful. Finally we ended with the soufflé, again, it was wet and very eggy. I'm really confused by the reviews."], ["Christy P.", "We were hesitant to try this restaurant because of some of the other reviews, however I'm really glad we did! The food was tasty, the ambience was cozy, and we found the waitstaff attentive and professional.I had their soup of the day, asparagus, and escargot. Both were delicious. My husband had lobster bisque, and pork tenderloin, both of which he enjoyed."], ["NorthDallas G.", "We've been several times and it's always been great food and service.  Only once we had an issue, but otherwise very nice.   French food and a bit of the french attitude.  At least they make the effort to please, unlike so many other french places.  selection is excellent and quality is exceptional.  Great date night.  Not so great for kids.The one and only issue we ever had was while sitting at the bar, the bartender decided that there was just about a half a glass' worth of wine left in the bottle (and I believe it was the last of that one, since it was a one-time special wine), and he took the liberty and went ahead and poured it our glasses, without asking.   He even commented something like \"well, that's not enough to sell\" or something like that.   However, when the bill came, we were charged the full price.  On other nights, the same bartender has been friendly and good service, so we just paid it went on our way.   Had this been my first trip to the restaurant I would have been more annoyed.   Still, an excellent place for food and drink."], ["Jen W.", "Lavendou is really great!Love the French countryside atmosphere, and the food was delicious and quite authentic.My hubby and I split their Escargot, which was very well done.  I'd definitely order this again.  I also started with their Goat Cheese, Parma Ham and Pine Nuts salad, which was yummy as well.For dinner, I had their New York Strip with Pomme Frites, which was good, but nothing I haven't had before.  However, my hubby had their Veal Medallions, and we both agreed it's among the best we've had-next time I would definitely order this entree.No dessert for us, but the wine list was plentiful, with great options at all different price points.We're excited to return to Lavendou, and certainly will sometime soon."], ["A T.", "Love their French ambience! We ordered escargots for appetizer. Roasted duck with cranberry sauce is the bomb, rack of lamb is just above the average I think. I don't think they made good chocolate soufflé on that day."], ["Cindy D.", "So, I brought my mom here for dinner on Saturday for her birthday, since she has been wanting to try some local french food for a while, and although I was expecting the food to be amazing, according to reviews here and on google, I have to say that the food was a bit of a let down. We started off with the Napoléon de Champignons Sauvages, and the \"pastry\", which was really a croissant, was delicious; however, the mushrooms and sauce were extremely salty when eaten without the pastry and they were a bit overwhelming after a few bites. We then proceeded to our main course. My mom ordered the Filet de Saumon Grillé, the salmon and sauce were cooked perfectly, as well as the eggplant caviar. It was actually good, but nothing out of the ordinary, she then regretted not having ordered the duck, as she had originally planned. I ordered the Gambas et CoquillesSt. Jacques en Mille Feuilles, a recommendation by our waiter. Again, nothing out of this world and VERY salty. Apparently that is a pattern here. After our main course, we proceeded to have dessert. Again, I went ahead and ordered the waiter's recommendation, Soufflé au Grand Marnier. I was very disappointed with the strong egg flavor it had. I feel they should have cut it down with a bit more cooking or at least add some more liquor to hide the egg flavor a bit better. Although food was not all that bad, I gotta say, service is lacking. Every one is this restaurant was very rude! First, the hostess did not even say hello to us, she asked if we had a reservation, which we did not, and even though the restaurant was empty, she made a huge grin before sitting us down. We asked our server if he could take a picture of us, and his answer was this, exact words, \"uff, well, I am really busy, this is not a good time for you to ask me for this, but I guess I will do it.\" RUDE! Then, to top it all off, even the buss lady was rude, since we requested water with no ice. With that being said, I will most likely not return here or recommend this place to anyone in my circle."], ["Thomas C.", "This is my go to place for dates or just by myself when I wanna get away from women. I came here years ago randomly because I was hunkering for a nice damn steak. I ordered an appetizer, forgot what it was but it was good enough for me to finish the plate like a death row inmate. The steak came out good. Wasn't expecting a mushroom sauce on top tho but no complaints from me. The host is gracious as royalty."], ["John B.", "A delightful surprise in Far North Dallas with a consistently excellent French menu.  Beautifully appointed.  The sights and smells make you feel like you are in Paris.  Service is always friendly and impeccable.  Ask for Robert if he is available.  He is always friendly, helpful, charming and witty.  He makes the dining experience even better."], ["John D.", "Lavendou French Bistro, in North Dallas, offers delicious, classic French cuisine, and friendly, professional service.  Last night, my Family and I enjoyed:  Pate w/ Aspic, Escargot in Garlic, Shallot, & Butter, Mushrooms & Wine Sauce in Puff Pastry, as appetizers.  Our entrees included Crisp Duck with Cassis Sauce & Wild Rice w/ Toasted Almond & Orange (the 2 Moms, NancyT & Dolly), Fillet of Sole with Crabmeat & Lemoncream Sauce (me), and Braised Lamb Shank with Demi-Glacé & Root Vegetables (Nancy).  We finished with Raspberry & Chocolate Souflees.  Each dish was expertly prepared, offering a wide-spectrum of delectable, complex flavors.  The Duck is amazing with its tender, rich meat, crisp, fatty skin, that sweet & tart Cassis sauce, and the very complex Wild Rice with Orange & Toasted Almond.  My favorite entree is the delicious Fillet of Sole, simple, delicate, and well-complimented by sweet Crabmeat & the light Lemoncream sauce.  The Souflee is everything that you hope for, a puffy, white cloud of egg white with a little sugar, accompanied by sweet sauces & a side of buttercream.  A light, refreshing dessert.  Appetizers run around $10.  Entrees run about $30.  Wonderful wine list too.  Lavendou Bistro is a highly recommended dining experience!"], ["Terry F.", "This is really a four star review, but I gave it five because this place deserves it's current overall rating of 4.5.  The atomposhere is warm and inviting and the food is delicious.  I feel it's slightly more expensive than it deserves, but still worth the spend.  My wife and I will become repeat customers for sure."], ["Corey F.", "Truly magnificent.  A true french feel and experience.  The food was amazing and the the staff was attentive.  Patrick gave wonderful recommendations from the menu."], ["Nicole P.", "The soufflé is five stars, but the staff is three. I have been there multiple times and every single time they make us wait 10 minutes for our table \"to be ready\" The only reason I put up with this annoyance is for the good food and outstanding soufflés!"], ["D R.", "Beautiful ambiance for a romantic dinner. Everything was good - decor, food and service. We had  Lobster Bisque, Steak and dessert. Everything was good."], ["Dy J.", "Love, love this place. My son and I ate here twice in less than 2 weeks. Pricey and dark setting, but overall delicious. One note of advice is to come early around 6 on Saturdays. They were very busy when we went on Saturday. We had an 8:00 reservation and didnt get seated until 9:00. Worth the wait only if your stomach is not killing you with hunger pains. I nearly wilted."], ["Bb Y.", "We paid way too much for bad service and unimpressive food.  All 4 of us noticed that the haughty waiter (an older, follicly challenged man) suddenly brightened up his demeanor as he handed us our bill.  Nauseating.  The food itself isn't worth describing other than blah. From now on, we will go to La Madeline's down the street for our French bistro fix."], ["Therese L.", "A bit pricey for casual food. The ratatouille quiche was overdone and burnt. The lamb chops were excellent however. For the price I wish they offered a larger portion or added  a bit more sophistication to the dishes."], ["Maria G.", "I have been at this restaurant at least 4 times. I have enjoyed both the food and the wine offered here every time. The last time we were here, we left a cash tip as opposed to adding tip to our credit card. I assumed that a 20% tip was a good enough tip. Thought it was end of story until we got the bill. A 35% tip was added to our bill and only realized this when we got our credit card statement! So, check your statements to avoid the same situation! With that said, when we called the restaurant to explain the situation, it was promptly taken care of as our credit card was credited the unauthorized amount... and with apologies. We still love the place and will go back."], ["Rahul G.", "My wife and I had dinner here recently on a Friday night.  Patrick was our server.  As others have mentioned, their wine selection is good and well-priced.  Our server recommended a Red from France (Roussillion) and brought it over.  When he brought it over, I noticed it was from 2003 and was worried that it may be past its prime.  He said he'd be glad to take it back if we didn't like. it.  We tasted and we liked it a lot.  Great value at under fifty dollars.  Patrick's advice was right on, glad we trusted him.The bread that they serve is always crusty and delicious, and served with this great olive oil Tapenade type of dipping sauce on the side.  Try it!For dinner we shared a Mediterranean salad, had our own entrees and shared the Apple Tart for dessert.  My lamb entree was really well-cooked and delicious.  My wife's NY Strip was also cooked to our liking but a little bit gristly (that's why we deducted one star).  We didn't complain though as the meal was great overall.  Great french fries too!  We'd had the apple tart before and it was as delicious as we remembered.We found the atmosphere pleasant, the food to be very good and Patrick to be very engaging.  I will ask for him by person next time.  Definitely recommended!"], ["Vy L.", "Love their wine selections!Patrick was our server for one of the nights we came, you should request him if you can, he was exceptionally attentive with a pleasant presence.I had a good try of all their appetizers. The scallops were my favorite, there is a special taste there I can't describe. The escargots, mussels and terrines were okay, didn't stand out too much for me. The Lobster bisque had a strong fish taste to me, I did not find that pleasant both times I have had it. Their main courses, which include duck, New York steak and tenderloins; were also okay. I liked the duck (Canard Rôti au Cassis) because it was sweet in taste, but some may not enjoy that. The tenderloins (Tournedos Félix Faure) were truly tender with a hint of mushroom, recommended. I can't say the same for the New York Steak because the dish was quite ordinary.The desserts though, especially the Soufflés, were heaven in a dish. I tried both Chocolate and Lime flavors, they are equally delicious. If you come here and did not order a Soufflé, you need to go back.Ambiance is nice, staff is nice, definitely date material."], ["Leigh P.", "Lavandou is currently my favorite restaurant in dallas. The atmosphere is very country french... lots of yellows and blues, lots of homey sort of decorations. It's not super fancy, so you can go in a dress or not. I can say it's definitely not a \"scene\". The average age of people in there will probably be 15 years older than you are. But if you have good company, forget granny at the table next to you. Go on, have fun! Have a glass of champagne at the bar before you are seated. Order that second bottle of wine. Have that digestif! :)There's a great wine list, lots of french options (of course!)... btu the menu is where it's at. I really haven't had a dish I didn't like. The fois gras is amazing (it's a bit rich and a bit too much for two, really, but get it anyway). The Gambas et Coquilles St. Jacques en Mille Feuilles (Shrimp, Scallops, Spinach and Mushrooms with a Cream Sauce in a Pastry Shell) is to die for. The Médaillons de Veau Aux Champignons Sauvages (Veal Medallions Sautéed With Wild Mushrooms in Port Sauce served with Roasted Potatoes) will.... make you slap somebody. The grand marnier soufflé I had here was the best soufflé I've had... ever. It's an amazing little restaurant, hidden in a strip center way north in Plano. It's fantastic, and if you haven't been--you need to go!"], ["Cat A.", "I have been here twice. Both times, the food was delicious!  We used a restaurant.com voucher that we had no trouble redeeming. I have had the lobster bisque which was not the best I've ever had, but very good and creamy with actual identifiable pieces of lobster. I also had some sort of pasta dish that I can't remember and my fiance had a meat dish that he can't remember either. But trust, all 4 dishes that I have experienced were all very satisfying because if they were bad I'd remember. This is a place that can be a guaranteed good meal, and the prices aren't too bad. They use real cream and butter so you will leave full.  The only negative thing I can think of is it's a little small in there, but it gives a nice feel to the restaurant. And both waiters I had spoke French which made it even more fun!"], ["PJ C.", "It was just perfect. My husband daughter and I had aWonder meal. All of our meals were excellent. My daughter and I had chocolate soufflés. AwesomeWe can't wait for our next visit"], ["Maria M.", "Came here with my friends during Restaurant Week (Eunice C., being one of them---see her yelp review).  I just moved here from Los Angeles and was excited to try the new restaurants Dallas has to offer. I've looking for a French bistro since that was one of my favorite places to go to with my fiance in Los Angeles. So, I was assigned to find a restaurant on the list of Restaurant Week because two of our friends from Los Angeles were in town for a trade show. First impression was...what a cute place! I love how cozy it was. Even before getting our first dish, the hostess asked us to \"keep it down.\" And to be honest, we weren't even that loud (we've been louder...trust me). We were just laughing and having a good time, We weren't even being obnoxious (we didn't even have enough drinks to be so and after that incident, we definitely didn't want to spend more money on alcohol). That really dampened our mood for the rest of our meal and I was disappointed and embarrassed that I was the one who picked out the restaurant!! The food was pretty good. The service (aside from our friendly hostess) was good. I won't take that away from our friendly waiter. Tip for the restaurant: if you plan on participating in Restaurant Week, put a note that you don't want big parties there. And if a large party is really quiet, check on them....chances are they are not having a good experience. Be worried. Tip for customers: go with a small party. I liked the food but not enough to invite my other friends to come with me."], ["Laura C.", "The atmosphere at Lavendou is warm and romantic where you can feel comfortable wearing business casual or formal wear. The wait service is top-notch, very attentive with perfect timing, never interrupting a conversation and always ready to serve and sweep away dishes in a quiet and professional fashion.The French cuisine is the best outside of Paris! The cream sauces are smooth, light and flavorful without being too rich. The duck is moist with fragrant orange zest in the Cassis sauce and making the wild rice aromatic. Pastries are the lightest and flakiest I've ever tasted, perfection! The portions are generous and beautifully presented. The wine selection is fabulous.Be sure to leave room for Grand Marnier Souffle or Apple Tart, both so divine I was still reminiscing about  them the next day...ooo la la, a truly magnificent dinner experience that makes Lavendou my new favorite annual birthday meal restaurant! They just made getting older something to look forward to!"], ["Matt S.", "Daughter and I took mama here for her birthday (at her request). We have been here several times trying various items and this place never disappoints us. The service is always great, staff is knowledgeable about the menu, they don't over sell the wine which is a plus with me. The food is always very good and fresh. Dessert, we shared the chocolate tart, it was amazing, maybe the best dessert I have ever had."], ["BeefChop S.", "charcuterie: nothing special, and quite bland.bread was the only thing we really enjoyed.the lobster bisque: ok, salt, tomato lobster/shrimp flavorsalmon: overcookedrack o lamb: 4 pieces, cooked good but minimal lamb flavor, the ratatouille was good to mix with.creme brulee: ok but a tad bland for my taste.nothing special- felt full but not satisfied... and with these prices i wont be back anytime soon."], ["Kevin S.", "Everything was excellent. It's going to be on the top of my list for French cuisine. From the service to the several dishes everything was perfect. Even the price is great. It's not an inexpensive experience but it is well worth the price."], ["Laura B.", "MmmmmmmmmmWent here for my b-day dinner after my bf looked up Best of D on D Mag. And it was mmm mmm delicious.Our waiter was helpful and helped us select the perfect wine. We started with the escargot and it was great. Warm and buttery and delicious. Escargot can be gritty or chewy but not here- it was wonderful.For dinner I had the salmon and my bf has the duck. I have to first say I am not really a duck person- I guess it is because I have never had duck cooked this well before. The berry sauce was excellent too. Now for the salmon- OMG- cooked to perfection. Really- I have never ever ever ever had salmon cooked this well- I didn't know you could have it be this amazing. It had simple and clean flavors which is what I love anyway. The basil white wine sauce was drool worthy as well. Every side was perfect too. We had the chocolate dessert which was delish too. I would probably rate this 4.5 but would have to try again to see if I could repeat the delicious meal."], ["Thomas W.", "Lavendou French Bistro is pretty easy to find. Just drive down Preston until you see the giant arrow sign shaped billboard pointing you towards the Condom Sense shop across the street. Now drive around that shopping center and you'll see the French restaurant. I guess in a way it makes sense. Isn't Paris the city of romance or something like that?The exterior is unremarkable, but the inside was pretty well decorated. It definitely had a French theme going. White tablecloths, some fake flowers on the tables, a giant wall with all sorts of China on display. It has the whole moody dim lighting thing going on. The waiters are very polite. Most of the people eating here are kind of old.As far as the quantity of food goes, expect to pay double. The quality is somewhat better, although this is debatable. I think it's about on par with what you'd find at La Madeleine's. It only seems better because the nice interior is tricking your mind into thinking the food is exceptional, when it's merely somewhat above average. The baguettes at the beginning were tasty. Crispy on the outside and chewy on the inside. They really need to clean the plates better. You could see all sorts of grease smears all over them if you angled them just right in the light. It didn't stop me from downing two bowls of their baguettes on them though.Honestly I think you can just go get yourself some food from La Madeleine's, bring it home, dim the lights and it'll be the same quality at a lower cost."], ["Diane L.", "We had an amazing experience here; the food was excellent and the waiter very knowledgeable and friendly.  I've been told you can't go wrong with anything on the menu, and I have to say that this is most likely true.We started with the wild mushroom pastry and the escargots; the pastry was perfectly flaky and topped the most fantastic mushroom sauce I've had in a while.  The escargots were tender and served in a garlic butter that was perfectly mopped up by fresh warm baguettes.  The duck was amazing; I couldn't finish it and ended up taking it home for lunch the next day.  Even reheated in a microwave, the balance of flavors and texture remained.  The rack of lamb was delicious; make sure to order it rare.For a nice ending, the Grand Marnier souffle served with fresh whipped cream was a heavenly dessert to finish with, as well as being just the right size for two people."], ["Stan L.", "we came here for restaurant \"week\" recently... service was very spotty.. maybe because the place was completely packed.. we ordered our food before our water was filled.. and we had our appetizers before our bottle of wine arrived.. nevertheless.. the food we had was quite good.. my wife enjoyed her snails.. my salad was decent too.. as for our mains.. we both had the chateaubriand which was cooked to a perfect medium rare.. the pommes frites were perfect.. for dessert.. i had the apple tart which was excellent.. my wife's chocolate fondant was very rich but not overly sweet.. we would gladly come back here again. hopefuly the service improves.."], ["Frisco M.", "Wow!! This place is great!! The staff was very attentive and made great recommendations.  The food was delicious!! I ordered escargot for as an appetizer and sole as an entree.  My husband got the french onion soup and trout.  The atmosphere was relaxing and inviting.  This is our new favorite spot!  This was just lunch! I can't imagine dinner. We will definitely be returning."], ["Amee M.", "We were there for High Tea. Will not go back. Awful tea sandwiches. Dried bread, not seasoned at all. Weak tea selection. Definitely in the Lower tier of Afternoon tea places in the DFW Metroplex. The service was NOT attentive."], ["David L.", "I don't usually venture this far north. However, I was a little late in making our restaurant week reservations, and Lavendou still had seats. It's in a somewhat shady shopping center way up on north on Preston, but on entering, you're transported the south of France. It's one room with fairly high ceilings, decorated with bright, airy colors. We were there for the $35 prix fixe menu, but they gave us the regular menu to peruse. Their regular menu is quite impressive, and I found myself wanting to try not a few things. But entrées are generally around $30, and while I liked the aesthetic, the environment doesn't quite fit this price range. I can see why a few people are complaining about the price, even if it is somewhat sophisticated French food. I started with the mixed green salad with pine nuts and toasted goat cheese. I prefer more leafy lettuce in my salad, but the goat cheese made it remarkable. For my entrée I had the pork chop with vegetables.   The pork chop was cooked well, and it was topped with a wonderful sauce. I also appreciated the relatively small portion size, which kept me from over-eating and crossing that line into gluttony. For dessert, I had a crepe soufflé, which consists of a soufflé sandwiched by a  crepe - the synthesis of the two great French desserts. And it had hints of grand marnier and raspberries. Delicious."], ["Mouli B.", "Since I love French place,I was advised to try this one,,so I went there so excited but really I was deceived..the place is so dark and small..you can easily suffocate ..and the waiters were so depressed so you feel negative vibes..and if I wanna talk about the food..it really does nothing to have with French cuisine..OMG it was a shock..from the onion soup to the desert..it is really over priced for this quality..you would be better off at Bijou restaurant..I just hate it..and I will never come back again and I do not advise anyone to even give it a try..."]], "La Madeleine Country French Café": [], "St Martin's Wine Bistro": [], "Cadot Restaurant": [["Sam S.", "The food is pretty good. Prices are all over the place though. Reasonable $8 apps, and a few $18 ones as well. All in all it's like Mignon. But not quite as good. And a tad more expensive. In a much less hip/casual atmosphere. Most of the diners here seem to be of retirement age. That's awkward to say, but I think it'll probably help readers.If you want a little more casual, maybe a little cheaper, and better food, hit up Mignon. Nothing wrong with this place exactly, but I'd be lying if I didn't say we're leaving slightly disappointed."], ["Kitty Q.", "Fancy restaurant in the bottom of the Plains Capital Bank building. The bank sucks, but it makes the restaurant easy to spot.Short:Another not 5 star restaurant. Still worth going to if you like french food. Eat there if you have the opportunity.Long:Escargot is pretty good, and big, not the little snail you get at Morton's. The James Bond martini was an interesting concept, but they need to use better quality liquor in it. Skip the bar.The meals are delightful, the specials are great, and the staff is excellent. The environment is classy, far classier than the area, and parking is never a problem. Aside from the typically \"irritated at your existence\" 14 year old hostess stand, it's a win.P.s:Yelp asks if there's bike parking. If you bring a bike here, don't go. There's a bar next door and an indian place right next to it. They gotcha covered."], ["David L.", "For an expensive dining expensive, this is a 3.5-star rating (rounded up to 4).  Service was very attentive without being suffocating.  Food had some hits and some that was just average for a restaurant in this price-category.We started off the mussels as an appetizer and had halibut, paella and bone-in ribeye for our entrees.  And then rounded out the meal with some beignets.  The mussels were quite good and might have been what we enjoyed the most...we used bread to lap up the remaining sauce.  Halibut seemed good as the person who ordered it finished her entire plate and she does not do that very often.  Paella was just average, but I guess that's what we get for ordering Paella at a French restaurant.  The bone-in ribeye was tasty, but there are many other expensive restaurants where I've had much much better.For dessert we had the beignets (note: if you want the souffle for dessert, you'll need to order it early as it take 45 minutes to prep).  The beignets came out hot and fluffy/airy and came with 3 dipping sauces (chocolate, vanilla and raspberry).  8 beignets come out with one order...so it's easy to share."], ["Andrew H.", "Went there for lunch. Had the crispy duck and chocolate lava cake. Great quality food for a reasonable price!!! And our server was really nice."], ["Dimitri B.", "The food was fairly good but the service was horrible. We had a stuck up French waiter who scoffed every time we displeased him. We didn't order alcohol due to religions reasons and got a scoff, we didn't order a salad with our dinner and got a scoff, we didn't order dessert since I made my wife a birthday cake and got a scoff, and on top of that he asked, \"Are you even 21?\" The waiter also made no conversation with us due to age which was insulting. He did however have conversations and offered decent service to those over 40. Overall we will not return so that we can be treated terribly."], ["peter w.", "We went to Cadot  Restaurant at the recommendation of the Concierge at the Weston Galleria, Susan Ratliff.  We were greeted at the door by the Chef, Jean-Marie Cadot, who already knew where we were staying and who assisted us to our table after a short introduction.  It was a fine beginning to a wonderful evening.We first ordered the vichyssoise.  It was so good we hated to finish it.  It was garnished with fried onions.We proceeded to the house salad with orange vinaigrette which was wonderful. We shared the Dover Sole which was pan sautéed with a butter lemon sauce and served with Haricots Verts and asparagus.  The fish was cooked whole and then filleted and boned in the kitchen after we approved it.  The fish was really fresh, perfectly cooked, and was to die for.  We recommend this dish without reservation.Finally, dessert:  Grand Marnier Souffle.  It was perfect!!  Very airy, delicious, and the sauce was mouth-wateringly superb.In addition, the wait staff was attentive but not overbearing.  Our waiter, Eduardo, was knowledgeable, helpful, and pleasant.  We could not have asked for more.I do not remember giving a 5 star rating to a restaurant before tonight.  However, Jean-Marie's Cadot Restaurant is very deserving of the honor."], ["Robin R.", "Really great French food and amazing wine selection. The chef is great and I always order what he recommends. Great place to go for a special occasion or romantic dinner!"], ["Igby M.", "Second visit on restaurant week was not good.  45 dollars for a hanger steak and fries.  Very disappointing."], ["Pam M.", "It was our first time trying this restaurant last Saturday night and boy are we glad we did! The atmosphere was wonderful. It is  a beautifully decorated restaurant with a warm friendly feel to it. Dim lighting, romantic, really pretty restaurant. Our waiter was Billy and he was terrific. Very helpful with the wine suggestion. We had the escargot, the gazpacho, the tilapia and the flatiron steak with truffle fries..... It was all melt in your mouth fabulous. Every bite was delicious. For dessert we had the opera cake and profiteroles again just out of this world. I think we have a new favorite special place to go and I can't wait to return!!"], ["Joseph S.", "The restaurant is tastefully decorated with a European feel. Excellent, prompt service...my wife's sea bass was cooked perfectly, and I had,literally, the best braised short rib I've ever had.  We will definitely be back"], ["Tod C.", "Best restaurant experience in quite awhile. The food was great. I am a big fan of Southwest cooking and local chefs like Dean Ferring and Stephan Pyle's. The French cooking I tried here beats that hands down. Complex flavors. Great  bar staff. Amazing service. This is a must dining experience."], ["Valerie K.", "I absolutely love this restaurant because every time I dine there, which has been well over 20 times, the food is consistently delicious.  There has never been a \"miss\".  And the chef does not mind accommodating special dietary requests if needed.  I love the foie gras served with pears, I love their salads, their fish dishes are excellent.  It is French cooking at its finest.  I've probably had the duck terrine at least 10 times.  The calamari appetizer is also great.They have a nice patio which is heated in winter and has misters and fans for summer.  The bar offers an extensive range.  This is my favorite place to take special clients and friends for lunch.  It's pricey but worth it for the food and the great service."], ["Andre G.", "Went in this week on a whim since it's close to where I work. At the entrance I happened to talk to the Chef, Jean-Marie and I chose a Marguez Sandwich and asked if they had Crêpe Suzette. He said they did and assured that he would make it himself. I added a lentil soup to my order.I sat down at the bar and at he table next to me I had the chance to get to know the other owner, Gerard, a fact that I only found out during our very pleasant conversation. Both Jean-Marie and Gerard were very hospitable and pleasant to talk to and deal with.In regards to the food: The lentil soup was good. The Marguez Sandwich was very good, with just the right amount of heat in the lamb and beef sausage and excellent french fries. The star of it all, though, was the Crêpe Suzette that was made to perfection. Sweetness was just right, perfectly balanced. The flambé must have been just the right amount of time. Texture and flavour of the crêpe was the best I've ever had.Because of the crêpe and the very forthcoming and relaxed atmosphere I will definitely be back for a full dinner, this time with my wife. That means that this is a 4-star review, but which likely will turn into a 5-star soon enough."], ["Drew M.", "This is one of my top 3 restaurants of all time. When i have been there i always get the escargot for appetizer. For entrees i have gotten salmon, duck, and chicken. All great. And for my dessert i always get creme brûlée, it is to die for, lets just say there is a reason i rated it 5 stars"], ["Shannon S.", "Escargot was good, but not amazing. The veal scaloppine was delicious. The grand marnier soufflé was good but very rich. Over all I would give this place 8.2 out of 10 due to the price being right. We will definitely be back."], ["April A.", "So good! Perfect Anniversary dinner. The chef personally visits every table and the atmosphere is nice and quaint"], ["Abigail N.", "Wonderful . Just like France ! A true dining experience . Fois Grad , Escargot , veal as well as side dishes were well prepared and delicious . We were running late but really wanted to eat there . The Chef Owner and his son kept the kitchen open for us . Superb service , soufflés , and art work ."], ["Erin T.", "Great service, great wine, great desserts, mediocre vegetarian options. gnocchi was ok, I feel like more than 4 pieces of mushrooms would've been nice. Mussels were good...but gotta say there could be more flavor in there. Love the souffles!"], ["Jack E.", "I have been impressed each time I have visited this Restaurant. The Food is always Excellent. The sauces are a perfect match for the dish. This is the place for Great Food and a nice intimate atmosphere, or even if your just tired of the same old fare, and want to treat yourself to a wonderful dinner."], ["A W.", "Cadot is The French restaurant.  Beige draping  and ivory walls feel one with a sense of calm. A great attention to detail created a wonderful atmosphere inside Cadot. The subtle touches (pieces of art on walls, a cupboard, and soft lightning) showcase perfectly imperfect French interpretation of European elegance. The following was ordered:Apricot ice tea is sweetly tart and refreshing. Slight muskiness helps to bright deep flavour of the black tea.Bread was delectably chewy and hot, whereas butter was chilled. Duck Terrine was luscious. The serving was quite generous. It was not gamy. Pacific Snapper Nicoise is excellent. The sauce (reduction) of white wine, olives, tomatoes, and basil was proper melange of sweetness, saltiness and acidity that cut through rich buttery taste of snapper. Mashed potatoes were divine. Green beans added a little bit of crunch.Quiche with Mushrooms and Brie was, as expected, amazing. The crust  had a mille-feuille-like texture. The salad had light vinaigrette."]], "The French Room": [["Betsy M.", "Wow!!! My husband took me here on my birthday and besides having an impressive meal, the decor, the staff and the experience was impressive as well! Ask for Francesco to have the best experience there!"], ["Monique U.", "One of the most delicious and perfectly executed meals of my life. The crab cake appetizer is surreal, the Dover sole is stupendous and the chocolate soufflé - sublime. I can not say enough about this restaurant. Every single thing from the service to the silverware to the decor and food is absolutely incredible."], ["Debra T.", "This restaurant is absolutely phenomenal that there are no words to even describe the experience of The French Room. Such a truly memorable dining experience, one of the best in my entire life. If you have a chance, please go. I promise you will not regret it one bit."], ["M. H.", "The service was the best I have ever had, the staff was so attentive and thorough. The food on the other hand was mediocre. The crab cake was good, very different and light. The scallops just did not appeal to me, the steak was very good from the taste of my boyfriend's that I had. The souffle was not the best, and there was another dessert we got but it was not that good either. The atmosphere was very romantic and elaborate. Overall, the food was good but the service was outstanding. In the last two months we have been to SER steak and the Reunion Tower, and of these three, I would highly recommend going to SER steak for the food and the view."], ["Tony V.", "Exquisite, Impeccable, and Excellence in dining. The French Room lived up to their reputation as one of the finer restaurant experiences in DFW.My wife surprised me for my birthday and the French Room was a truly special culinary experience.  I enjoyed the old school vibe, and throw back to the day when dinning was an important event without being pretentious (jackets required for men and ties recommended).  The food is very good, the pace well timed, and service was excellent.  You are promptly greeted with attentiveness and attention to detail. The atmosphere was: picture perfect, old school candlelit, romantic setup. Our server was excellent and his recommendations where spot on. He gave my wife a small bouquet of roses, and even packed us a complimentary dessert for the night.  The sommelier also provided excellent wine recommendations to pair with our food.  We selected the three-course meal at $80.00.  Don't miss out on the jumbo lump crab cake - amazing!  It was the moist, tender, flavorful.  Unique in that it was made without a bread filler.   The Foie gras and the veal were excellent, best I have had to date. The beef tenderloin- was cooked to perfection, but being a good ol' TX boy, I like a little more \"char\". Its good don't get me wrong, but not 'the best I've ever had in a town with many outstanding Steak joints. If your budget makes fine dining a rare treat, you may find more satisfaction from the food and service at Double Eagle or Capital Grille, but the atmosphere at the French Room is truly special. With that said, The French Room restaurant ambience and experience are one of a kind. Such a truly memorable dining experience. If you have a chance, check it out."], ["Brando Y.", "Food- Unforgettable!Drinks- Perfectly paired and proportionedService- Undoubtedly on-par with the world's bestPrice- a Month's rent! (Not joking)Experience- You will one day tell your children!"], ["Jenny H.", "The Adolphus is like a step into the past in an elegant way.  We loved the ambiance and the decor though out the place.  You can't help but turn your heads to check out all the cool murals, chandeliers, clocks, vases, and paintings around the place.  We were greeted and seated promptly.  The atmosphere was quite enchanting.  Our servers were all very polite and gave us explanation of our three courses (not that we needed it) but it was nice to know they knew what they were talking about.Our starters!Crab Cake, the best we have had!  You can tell it was packed with big lumps of sweet crab meat and not fillers.  The tomato jam was a great compliment and very tasty.The Pork Belly with risotto was drool worthy.  Had the rich asian touch with a creamy risotto pairing.  Very similar to what we had at Morimoto Napa, but he paired his pork belly with congee vs. risotto.Then came our fish entrees.We ordered the Red Snapper wrapped with zucchini and Salmon with Shiitaki.  The Snapper had great caramelization on top and paired with silky mash potatoes.The Salmon was cooked to perfection.  Rare on the inside and crispy on the outside.  The Shiitaki's were seasoned extremely well, we wished we had a whole bowl of it!Our desserts were amazing! We ordered the Grand Mariner Souffle and Key Lime Creme Brulee.  Both were awesome!  The souffle was fluffy and velvety, extremely flavorful!  The key lime brulee was YUMMY!  The key lime flavor definitely stood out and help cut down the richness.  Sugar was crispy on top and lush on the bottom.  Overall a delicious experience!  We cannot wait to come back and try their regular menu.  For $45 per person vs what they normally charge, definitely worth the try, especially during restaurant week!"], ["Matthew S.", "Great food and the hotel and restaurant are beautiful. I would highly recommend it for any special occasion. A great dining experience"], ["Karen R.", "This is the most romantic restaurant I have ever been to and I experience some fancy restaurants in my travels.  I knew right away it would be good when they called me ahead of time to confirm my reservation and to tell that the dress code is strictly enforce (jackets on for the gentlemen). When we arrived the hostess took my coat and another host took us to our table, on the way there the host smoothly whisper to another man to please keep his coat on without breaking stride. We were seated on a table next to a balcony. Our server, Carlos, was extremely courteous and funny. For our table we had 4 people attend us, including a man that goes around the room in case anyone has questions about the wine list. The food was amazing even the palette cleanser sorbet made of carrots and sage was delicious (my husband loved it and that's saying a lot because he is extremely picky). The champagne was the best we tasted (we cannot find it anywhere). At the end of the meal, we were farewelled with roses and a pumpkin bread for the morning. All this comes with a high price but so worth it. If you want to impress a date or your spouse on a special occasion, this is the perfect place."], ["Patty S.", "If you want a dining experience with opulence and class, this is a great place. We will come here every few years on a special occasion. Men have to wear a jacket which is not something we do often. The service is meant to be attentive with multiple waiters, however,  for some reason last night our head waiter got a few of our orders wrong and had to ask a few times to clarify when we were ordering because he forgot.  It was as if he wasn't listening. The crabcakes and halibut were my favorite items of the night. Everything tasted good but nothing blew me away. I would say that many dishes almost seemed bland. All in all, this is a good special occasion place but not a place we would frequent often."], ["Jennifer H.", "We dine at fine restaurants relatively frequently, but went here for the first time on Valentine's Day.Atmosphere: wonderful, romantic, and picture perfect. When you imagine a romantic candlelit dinner, this is what you're thinking of. I appreciated the dress code (men must wear jackets). Many of the nice restaurants in DFW allow jeans which bothers me because there's generally not a distinction between \"nice\" jeans and \"running errands\" jeans. It really affects the feel of a place to see everyone dressed well. Food: I loved all of my three courses. I had:White asparagus with poached salmon and caviar- expertly prepared, complimentary flavors and textures. A passion fruit sorbet was served as a palette cleanser which was unexpected but very nice. It felt very old world and charming.Roasted pheasant breast with foie gras- as other reviewers have said, the foie gras knocks it out of the park. It was the highlight of the dish, since the pheasant was a little on the dry and tough side.Hazelnut chocolate Kit Kat torte- to die for. It was served with a bit of frangelico ice cream and was possibly the best dessert I've ever had. My fiancée had:Diver's scallop- \"nice but nothing overly special\"Beef tenderloin- \"the server way oversold it. It's good but not 'the best I'll ever have until I come again'. Probably not even in the top 20.\" I tasted it and thought it was very good, but I have to agree that I've had better. If it had been served without comment, I think it would have been better.Raspberry mousse- \"I actually really like this.\" He's not a dessert person and this is a big compliment to the pastry chef. He ate every bit of it.The wine list is decent. There are some exceptional vintages but of course are very pricey. There were several options in the $120-$200 range and a few under $100. We were a little disappointed at the Cabernet offerings, with vintages being either rather young (in the $120-$200 range) or very expensive. A little more middle ground would have been nice. We had a 2009 Jordan and felt that the price was fair.Okay, so, the service is where things are lacking.First of all, I had booked a room at the hotel months in advance. After booking the room, I decided to go ahead and book the dinner reservation since I figured they would go quickly for that night. I called the first time in November and was told to call back after Thanksgiving. I called the day after, and they said to call closer to Christmas. I called the week before, and they said to call after Christmas. I called on the 26th, and they said to call after the new year. I called on January 3 and asked for a reservation around 7:00 or 7:30 and was offered 5:15 or 8:30, everything in between was booked. 8:30 was fine, but it was aggravating that my reservation couldn't have been taken any of the previous times I called. We were taken care of by our waiter, a server, and the sommelier. Waiter- he was friendly and shared some information about the hotel and restaurant. The first time he said I was beautiful, it was sweet but I figured he said that to all the ladies. The second time, I figured he must really think I'm pretty. By the fourth time, my fiancée was understandably annoyed and I was a little uncomfortable.Server- seemed very nervous and jumpy, and a little robotic. We couldn't help but hear him say the same things to every table (like the beef tenderloin comment he made \"It's the best you'll ever have, until you come back!\", or when serving deserts \"...and of course there are zero calories!\"). I'm guessing he was new, but someone there really needs to help him relax and give him a hand. Sommelier- we ordered a Cabernet and he took the red wine glasses off the table and served it in the white wine glasses. We looked around and it seemed there was no rhyme or reason to who had white or red glasses. My husband's wine glass was empty twice. The first time, it took about 10 minutes for someone to notice and pour more. The second time, after 10 minutes, I filled it.I had sparkling water, he had still. When they brought him a second bottle of water, they brought him sparkling. After our first course was served, we thought it odd that they had bread plates and butter knives but didn't seem to be serving bread. Halfway into our course, the bread came. None of these things were travesties and maybe I sound picky, but when an establishment is touted as the only Five Diamond restaurant in Texas, the staff should be better trained in etiquette and attention to detail. We dine at Pappas Bros. often and the service there is always phenomenal (if you go, ask for Henry; he is a true professional who never misses a step).Overall, yes, we would go back. But it's mostly because of the foie gras and the pastry chef.If your budget makes fine dining a rare treat, you'll get more satisfaction from the food and service at III Forks or Pappas Bros, but the atmosphere at the French Room really is special."], ["Meriel A.", "Solid fancy french fare but nothing mind-blowing (for the price) except the service. Our server hooked it up with a complimentary glass of sweet wine to pair with the foie gras. Then, he sent us home with some house made chocolates and banana bread! It cushioned the blow to the wallet just a little."], ["J M.", "Lovely.  Flawless.  Perfection.We celebrated our 5th wedding anniversary here and they made it truly special, a night and a meal we will never forget.  I love how \"old school\" the vibe is, the formality (without it being stuffy or pretentious).  The food is amazing, the portions are perfectly sized so you won't over stuff yourself (I tend to do that) and the pace is definitely not rushed...we were there almost three hours but they make it about you, not about them.  The best places make you think about them long after you visit, and this is one of those places.We will definitely be back."], ["Andrew B.", "Had a lovely birthday dinner here for my wife and with our family. The service, atmosphere, and food were impeccably perfect. Portions are sized perfectly. As mentioned in other review, we were treated with a personal touch, greeting you by name (including the valet). We all selected the three course meal including appetizer, entree and desert. The wait staff provided excellent dish recommendations, and the sommelier provided an excellent suggestion of a 2003 Bordeaux. I ended with the soufflé for which words nor picture can describe. We will definitely be back.To clarify parking, you can use the hotel Valet, and the French Room will validate your Valet ticket, so you are not paying the standard hotel daily/hourly rate."], ["Nga N.", "This is one of the best restaurant I had so far in Dallas. We bought a travelzoo deal dinner for 2 for $120, and the regular price is $80/person for 3 course meal. It is located inside a beautiful hotel called the Adolphus. For appertizer, we order their famous crab cakes and ahi tuna with foie gras. The crab cakes is all crab meat and no breading. I guess that's why people love it so much, but for me the ahi tuna with foie gras trumps it all. For the main entree, we got a rack of lamp and duck breast with foie gras. Foie gras is one of the my favortie thing and this place does it right. It wasn't overly seasoned because they don't need to. It was so buttery and melted in my mouth so deliciously. The rack of lamb was also very delicious. We ended the night with a Grand Marnier souffle and peanuts bread pudding. I'm still searching the a good souffle. I don't know if I just don't like souffle or what because this is really average for desserts. The souffle is indeed better than the souffle from rise no1 though. The bread pudding is good but again I preferred another dessert over this. My boyfriend loves peanut and bread pudding so this was perfect combination for him. The desserts were my least favorite part of the meal. The reason why this place is one of the best meal I had in a while is because of their foie gras. I've eaten many foie gras and this place makes one of the best. Love this place, and I can't wait to re-visit."], ["Abcd E.", "In my opinion, The appetizers were plain.The main courses were ordinary.The soufflé was bad.The service was lack of proper training."], ["John P.", "Went on a date and had the best dining experience I have ever had. The restaurant itself was amazing and the staff was beyond friendly with extreme attention to detail and needs of my date and myself throughout our almost three and a half hours spent there. Each course was separated with a light refreshing snack of some sort and the extensive wine list was reviewed for us by an extremely knowledgable and friendly older gentlemen who recommended a wine bottle that was right at the price we said we wanted to spend and met both of our taste preferences. They even included free chocolates and some breakfast biscuits with our leftovers and a flower and handwritten note from our waiter for my date. Meal was very pricey but well worth the cost as it was definitely my most memorable restaurant outing yet."], ["Kathy D.", "How to make a special occasion really special when you've dined at so many places in Dallas? Go to the French Room!This place offers a new dining adventure which no other restaurant in Dallas can replace. The restaurant is located in an older Dallas hotel, and I admit, the decor of the restaurant is dated but it had its special charm. A dress code is enforced (i.e., men must wear jackets) and a set 3 course menu is required. Additionally, great, courteous service is supplied at no additional charge :) The food itself is spectacular! Everything was delicious but the one thing that stood out in my mind was the foie gras. I've had foie gras before but it never really grew on me, but the foie gras appetizer or even the foie gras that comes with the duck breast was absolutely, melt in your mouth, divine, I just died - type of good. Please, just get it and tell me if I'm wrong. Additionally, a sweet touch - - upon our departure, the ladies were provided with free housemade chocolates and an entire loaf of pumpkin bread!! The pumpkin bread was amazing. I wasn't expecting \"free\" stuff to be great, but hands down, probably one of the best pumpkin breads I've had (aka, beats the pumpkin loaf I normally get at Starbucks)"], ["Cody D.", "Everything you have read is true.  It is a unique experience. Service is more than you have come to expect even from the nicest of places.  It's as if you are the waiters only table. The food is delicious. Bursting with flavor although. Although the portions are small, you should be plenty full with the multiple courses and the bread.  A very romantic setting and quiet.  No need to yell over the noise at this establishment.  Coats are required! Very classy place and worth the money if only for a one time experience."], ["Matthew N.", "Took my wife back to the place that I proposed to her 7yrs ago. I was not disappointed. I love the ambience, service and food! We opted for the 3 course menu. For appetizer I ordered the foie gras, then the rack of lamb for entree and finished the dinner with a sorbet combo. The foie gras was cooked perfectly, a little seared on the outside and nice and creamy on the inside. I would have liked the toast that it was on to be toasted instead of mushy, but overall delicious. This was accompanied with a small glass of moscato wine. I ordered my rack of lamb medium, suggested by the waiter and it was perfect. I usually order medium rare, but tried it medium and enjoyed it. It was nice and pink in the inside and a good char on the outside. It was very tender. In between each course we were served 'palate cleansers', mini appetizers to clean our palates for the next course. Very nice touch! The Trio of Sorbets came with Olive Oil Cake, Meringue Crisp, Seasonal Fruit and Berries. I enjoyed the meringue and berries.   My wife ordered the seared ahi tuna tarter, halibut for the entree and spiced cake for dessert. The ahi was perfectly seared and tasty. The halibut was cooked just right with a delicious macadamia nut crust. She enjoyed her meal. I do recommend this place and I will definitely come back!"], ["Carmen C.", "Amazing food and service. The white chocolate souffle is the best dessert I have ever had. Simply divine. I have been to Michelin-starred restaurants that could not compete with The French Room. This place definitely deserves a Michelin star if not more!"], ["Jacqueline C.", "When you eat at Zagat's favorite restaurant in Dallas, expectations are high, but when you walk in and feel yourself transported to the dining room of Versailles, your expectations suddenly feel silly. The interior of the Adolphus Hotel, en route to the The French Room, is a fall back to the late 1800's and is tantamount to other luxury hotels of that era, most reminiscent to me of the French inspired, Windsor Court in New Orleans. But even the decadent decor of the hotel cant compare to the splendor of The French Room itself, with it's domed ceilings, exquisite murals, gold trappings, and luxurious tapestries.  The menu changes frequently, but should you be lucky enough to be offered the Squab, Striped Bass, or the Butter Cake, I can only envy you for it will be one of the best meals of your life. Meal options include a la cart, three-course pre fix for $80/person or a chef's tasting menu for $110/person.  Most meals average $90/person, making the cost of The French Room second only to Hotel St. Germaine and followed closely by The Mansion. By the time we left the restaurant, everyone from the valet, to the hostess and our large team of waiters and assistants knew our names.  Their interactions with customers flawlessly fills the gap between the necessity for upscale professionalism and the need by patrons to feel comfortable and somewhat cozy, even in this dream-like, opulent castle."], ["Udoka O.", "My boyfriend is a chef, so it is rare that I can take him out to eat and he really appreciates the food. I decided to take him here to excite is palate and OH BOY was he excited!Firstly, I am lactose-intolerant. When I told the waiter this, the chefs went through each ingredient to make sure there was no use of milk. They were very concerned for me. Which is rare considering I'm used to restaurants bringing a plate of chilly cheese fries after telling them two or three times I can't have cheese and a \"Oops, sorry!\"The appetizers were AMAZING. The BEST appetizers I have ever had in my life. My boyfriend took a bite and his eyes rolled to the back of his head. The complimentary dish was also to die for! SMOKED SALMON HERE IS UNBELIEVABLE! I could eat it for days!!The entrees were also amazing! I had the Wild King... I never eat mushrooms but I ate them this time. The duck meat is so juicy.I had a souffle... I've never had a souffle before, so I didn't know what to expect. I don't really like it... the texture is too mushy for me. So next time, I think I'll have fruit or get some lactase pills to try other desserts.OH! The wine was SO good. And I typically hate drinking wine. The waiter recommended a white sweet wine that was just wonderful!This is a fancy schmancy place. Men must wear a jacket and no jeans. No specific rules for women. I wore a business casual outfit (something I'd wear to work) but all the other women were in dresses, so I did not fit in, hah. Oh, also I'm black so I REALLY stuck out."], ["Nick A.", "Just left....Amazing food, service. I have eaten at places in Lyon, France and this is to par with those places. Salmon three ways delicious, Halibut w Lobster Risotto the best of the night, the souffle was a bit too bland but overall amazing.Only area of improvement offer a better selection of beers...some people like a nice Belgian ale with their French food!"], ["Brooke L.", "I am unsure how to review The French Room since I visited during Restaurant Week, and I realize most of these places are not on their A-game during that time. It would be impossible to purchase froo froo ingredients and prepare food in the high volumes Restaurant Week brings in; at $45 a plate - can't be done.So with that in mind, here ya go. I loved the formality of The Adolphus. Everyone we encountered including the valet was gracious and helpful.  The French Room décor is very decadent. I mean, it's blingin'. I felt like I was dining years and years ago when dining out was an art. I suggest choosing the wine pairings, the wines complimented our dishes perfectly. Anyway, the RESTAURANT WEEK food (that I tried):Great:The corn soup stuffThe little dark brown bread pieces in the bread basketThe Crab CakeManjari Chocolate Dome Good:Red SnapperRoasted Chicken BreastGoat Cheese PolentaGod awful:Soufflé - OMG. It tasted like eggs. YuckoThis trip left me wanting more. I can't wait to check them out during normal times..and it'll give me an excuse to buy a new dress.Dress fancy, y'all!"], ["Margie N.", "What a fantastic restaurant! Brought my friend for her 25th birthday and we all left floating on a cloud. It's fancy as can be, but more fun than I could have imagined. Our main waiter person and her helpers were loads of fun and made me and my friends feel comfortable from the second we got there until we left. The food looked amazing and tasted even better. And the room itself is breathtaking.We're already making plans to go back!"], ["Kathy M.", "Fourth time at the French Room - this time to celebrate our engagement!!  Food was amazing - especially the crab cake appetizer (90% crab with minimal fillers)!  Lovely ambiance and superior service as usual.Inside joke, every time we've come here it's always for a special occasion.  The first two times we mentioned the occasion when we made the reservation and they always got it mixed up (birthday instead of anniversary and vice versa).  This time we didn't say anything and they still gave us a dessert with a birthday greeting!"], ["Michael C.", "The French Room has won more medals than Charles DeGaulle, and their website lets you know that, but their pride is justifiable. My wife and I recently had dinner there as a part of our \"night at the Adolphus, dinner and theater\" celebration of her birthday.I'd be happy to rave about the ambiance, food and service, all of which was wonderful,but instead I'll just say go there, and you won't be disappointed. The room itself is awesome, and unlike every American under the age of 50, I never say \"awesome\" unless something really is.We informed our waiter that we had theater tickets and he orchestrated our meal to end exactly when we needed to leave. The Grand Marnier souffle is so good, it should be illegal. Yes, the French Room is expensive. If that's going to make your experience less enjoyable, then it is the only reason not to go. I confess, the wine-by-the-bottle prices are through the roof (and the French Room has a very high ceiling), so we stuck to wine by-the-seventeen-dollar-glass, and in the process discovered a Tuscan Cabernet that was so good, I photographed the label and might buy a case if I can find it -- just not at French Room prices.Lastly, we both thoroughly enjoyed the fact that the French Room is among a dwindling number of restaurants that enforces an upscale dress code. I can't tell you how many otherwise wonderful dinners at excellent restaurants have been tarnished because some hayseed decided it would be okay to show up in a t-shirt and his one pair of blue jeans that doesn't have holes in them, but the restaurant let him in anyway, because a buck is a buck. The French Room did not disappoint in this regard either.We will be back for the wine pairing dinner sometime when we don't have to bolt for Will Call. Our thanks and appreciation to all the staff at the French Room -- you do what you do so very well."], ["Mike I.", "One word... disaster.I booked our anniversary dinner at The French Room after hearing nothing but good things.  My girlfriend is a Pescetarian and has not eaten meat for 15yrs.  I reviewed the menu online and saw a dish that did not have any meat.  When we got there we told the captain that we were avoiding meat.  Though he was a very nice man, in hindsight is seemed that he did not quite understand our request.When our food came it was delicious, but when my GF asked me to taste something strange in her food I knew it was a type of sausage.  When the captain came back around we asked him what is was and he confirmed our worst fear, it was chorizo.Her body began to reject the meat and we quickly asked for the check, but it was slow to come. Eventually we got the check and headed for the door.  We left so quickly that our waiter chased us down to give us the rest of our meal that we ordered.  We barely made it out the door when her nausea became too much to keep in.The next day, I called to check the menu with the staff.  After being on hold for over 40 min (I called several times, but no one would answer once the Adolphus transferred me) the girl that answered the phone confirmed that the menu online was the same as what was in the restaurant.  I then asked to speak to the manager (Jim Donohue) so I could explain what had happened.After recapping the events, he offered no apologies.  In fact I felt that he was challenging me as I explained the events to him.  All I wanted to hear was an I'm sorry and an offer to come back so they could make it up to us.  I never once asked for anything.  After I realized that my concerns were falling deaf ears I informed him that he had lost me as a customer.In the end, we were left with a ruined evening and a memory of a tarnished anniversary.Customer Compassion - FAIL"], ["Brandon A.", "Consdier this review a 4.5 star review. We went here for our anniversary and overall the experience was amazing. Told them we had a food allergy 3 months in advance when we booked the table and the waiter comes and says so I understand you have a food allergy with out any prompting from us. Told us to order whatever we wanted and they would change the dish to accommodate our allergy. Food was ridiculously good to the point that we ate everything despite having largish (for fine dining) portions for all the courses. My two nitpicks:1.When we first were sat down, our waiter was no where to be found and we were not handed a menu (something only the waiter is allowed to do) for about 8 min. After that he was incredibly attentive. 2. The wine list had one wine under $100 on it and it was something like $85. I understand this is fine dining but IMO restaurants should have at least 1 wine in each section under $50. I didn't go top price hunting but they had wines over $800 on the menu. Probably a few special reserve that aren't on the menu, didn't inquire about that."], ["Stan L.", "swanky restaurant.. exceptional service.. and ridiculously delicious souffles.. prices will definitely set you back (we opted for the tasting menu)... and for my money.. i rather spend that at stephen pyles or spoon bar kitchen or fearing's.. nevertheless.. the food is solid.. just not spectacular... my wife did rave about her foie gras which i thought was too sweet.. it was paired with a muscato d'asti rather than a sauterne... too my surprise.. the combination was meshed really well... of note.. their crab cake is disgusting.. i understand it's one of their signature dishes.. but it tasted like a crab gluten ball.. i expected a crab cake like eddie v's"], ["Jon B.", "Terrible experience. The rude host made my pregnant wife feel uncomfortable and judged. Do not waste your time / money on this overpriced and underwhelming \"supper club\"."], ["David C.", "This is the most expensive restaurant I have been to in Dallas.  It comes close to 5 stars as the service was excellent and the food was very good indeed - beautifully served and presented.  We went on our anniversary and my wife had the 5 course tasting menu and wine whilst I went a la carte.  The crab cake starter was exceptional and the duck breast was good but could have had a little more accompaniment - I felt like the breast was 90% of the plate and was a little too meat heavy but the flavors were good. Loses half a star because I just didn't feel the tasting menu with wine ($165) was good enough for the price - it should have had a more interesting and larger selection - I am used to tasting menus being a collection of more smaller and more varied dishes.  Don't get me wrong the a la carte was great but I would have likes to have been tempted by the tasting menu.  One plus was the fact that I arrived per Jack Nicholson in As Good As it Gets sans jacket and the dress code insists on such apparel - the maître D soon had me suitably attired in a French Room jacket - great experience probably 4 1/2 stars and highly recommend if you have $300+ to spend on a meal for 2."], ["Jim B.", "Wow is my best description of my experience both tonight, as well as one month ago.  The French Room lives up to it's billing as a true 5 star restaurant.  I do see what some people say in way of opportunities - it is old, maybe the chairs could use updating.  Don't agree with others - I have eaten at fine restaurants in France - hard to compare, but I enjoy the genuine service here much better.  And no, Disney World does not have anything better (thought that was a laughable review).  To each his own I guess.For me, the entire experience, from ambience, to service, to timing, to quality of food, is simply amazing.  The duck I had tonight was the best duck I have ever had - and I've had so much duck my toes are webbed!Have to make one more comment on another review, as I think people use review sites to bad mouth establishments without having the decency to say something to the establishment - if the hostess is on the phone with a customer, I wouldn't expect her to stop that conversation just because someone walked up.  Get over yourself and enjoy one of the finest dining experiences you will ever have!"], ["Darlene L.", "Everything was fab! Had the crab cake app, lobster app, salmon entrée and beef tenderloin and two different soufflés for dessert. Service was spot on and food was delish. Wine selection is good and mixed drinks were very nice. Pricey but for special occasions, worth it."], ["Just K.", "Now this is fine dining.  The soufflé is always a must."], ["Jay X.", "Restaurant of luxury and sophistication with world class cuisines and service.  The French Room embodies the upscale feel from Hollywood movies and definitely the place for anniversaries or special occasions.  It doesn't try to be too fancy or gimmicky with it's menu offering, classic french cuisine with some Continentals.  The foie gras, lamb chop, and beef tenderloins were amazing.  The only reason for four stars was that their crab cake disappointed me, too much fillings and not enough crab.  The souffle was good but not great."], ["Seth R.", "This is an elegant restaurant, in an old and beautiful hotel. As such, you have to dress classy (coat required for the men). The good news is that the food matches.Everything we had was prepared perfectly and presented well. The wait staff was attentive and had useful suggestions for the menu. The variety offered on the menu was very good as well. Lost star because one of the drinks I ordered was bad, simply put, and when I sent it back for another, I was still charged for the first. At $12+ per drink and $100+ per person for the food, I expect more accommodation. Still would recommend to anyone looking for delicious food, and willing to spend a lot for it."], ["Raven B.", "I went here last night on a date.  Fancy date of course with an older man that is obviously trying to impress me and that he did.  I had the cream of pencil asparagus soup and the halibut.  I loved the roasted tomato risotto.  It was perfect.  Of course this is a special occasion restaurant.  The evening didn't exactly turn out like my date wanted but it had nothing to do with the perfect food and atmosphere of the restaurant he was just moving too fast.  I would totally come here again and will!"], ["Simon L.", "My favorite upscale restaurant in Dallas.  The service is exceptional, and the food is delicious.  The crab cake is the best I've ever had, and the duck breast is amazing as well."]], "Boulevardier": [], "Café de France": [["Matt W.", "I'm here fairly regularly as a favorite brunch spot with my wife and a group of friends. The food is excellent, and the owner is extremely friendly. Everything has been consistently wonderful on every visit.The escargot and french onion soup are especially not to be missed. Could not recommend more highly."], ["Irena T.", "Came here for brunch with friends a couple of weekends ago.I got the Works Omelette with home fried potatoes.  Both were okay.  Potatoes were a little bland, but salt and ketchup fixed that.Service was eh.  I think it was 1 waiter taking care of the whole back room, so he might've been stretched a little thin.  He forgot part of my order and I heard a table next to me saying he forgot part of their order also.  The owner/manager (?) who greeted us when we first walked in was really nice and cheery."], ["Andrea G.", "The ambience was quaint. Friendly staff. Many options during dinner, from sandwiches to higher end dinner specialties. This also means the pricing varied anywhere from around $10 up to $25. The bread was very fresh and warm. My French Onion Soup was served hot and had a nice classic flavor to it. The potato crusted chicken with lemon butter sauce was a little bland but was a generous portion. The carrots were fresh and cooked to perfection. They tasted great too, especially mixed with the rice pilaf. I think the carrots had an orange glaze on them, which was a delicious surprise. The main reason for the high rating was the service and overall feel of the cafe. It was very comfortable with a definite \"mom and pop\" feel to it, which I love. The food was good enough to get us back, as well. We also received a discount card for 20% off all future visits. It seemed like all guests were getting the incentive card, which is a nice way to get repeat business. Oh, I can't forget the chocolate truffles. There's a refrigerated counter display filled with many varieties of chocolate truffles for $3.95 each; priced kust right to justify one rich indulgence for dessert while helping maintain self-control that might be harder to do at a lower price. I'm a chocolate lover, so that is a huge plus for me."], ["Mindy W.", "It was ok, nothing to write home about. Nothing stood out to me, the service was decent and that was a plus. To be clear the food wasn't bland, I will say, my fiance loved the side of potatoes for breakfast."], ["Tony S.", "Ordered Delivery via Eat24... AMAZING! Sunday Brunch Buffet at home! Watching the preGames!!!! Pancakes are delish! Food still hot. Not soggy. Awesome!!!!!! 10/10"], ["Jonathan E.", "This review is just for the quality of desert I received from here.  I bought a slice of cheesecake and slice of tiramisu.  Both slices seemed pretty old and not fresh or close to fresh at all.  The tiramisu was very dry and the lady fingers they used for the crust where beyond old.  The cheesecake had a slightly noticeable old film on top of the slice and the dollops of whip cream where the consistency of gummy bears.  For the cost of the two slices I was very disappointed by the quality.  Even though the pictures of the food there look very good, the deserts where a huge fail to me.  Now I was impressed by the look of this place.  It was pretty fancy looking and the waiter and even manager where very friendly.  I stopped here on a whim about twenty minutes before they closed but I did not feel rushed to leave or anything.  It's hard to find a bakery that's open late like this down in my neck of the woods so I was happy to come across this place driving home that night.  I hope others have had or will have a better experience with there sweet treats then I did."], ["Sneha P.", "Came here on a Saturday morning. Very friendly service. Nice ambiance, casual bistro but a bit nicer. Had florentine crepes which were good. The freshly squeezed OJ was great!"], ["Michelle L.", "I tried out this café on Saturday afternoon before shopping and the food and service were great. I ordered my eggs over hard and they were prepared exactly the way I like them, my bacon was the thick, crisp bacon that I always want. The home fries weren't that impressive since they weren't seasoned at all. It was an Ore Ida experience. We went back today. My boyfriend had the seafood omelette with hashbrowns and wheat toast. He really liked the omelette and that his request for more mushrooms was accommodated. I had the buttermilk pancakes with fruit, 2 eggs over hard and a side of bacon. Yummy. Everything. And our server was very attentive. She kept our water glasses refilled and empty dishes were promptly removed. Another plus to this café is the case filled with handcrafted chocolates. We bought some for a take home treat. I definitely recommend that you try this place!"], ["Stephanie L.", "FYI: This review is about my dinner experience.The service here is very good! The employees are attentive and polite. However, the food (at least on the dinner menu) was just alright. Nothing to really complain about, but nothing to rave about either. Surprisingly, the glazed carrots that come with most of the dinner entrees are really good though. A citrusy-sweet glaze? Yum.I wouldn't recommend the shrimp cocktail from the appetizers section because it's literally 6 small pieces of cold shrimp for $10. You're better off going to Costco and buying a box with dozens of shrimp for the same price. And the side salad that comes with the dinner entrees is pitiful.. just an iceberg lettuce mix, no additional toppings like any other vegetables.I'm slightly disappointed, especially since their breakfast food gets a good rep. I'm still interested to come back and try their breakfast food though!"], ["Mary S.", "I went to this place for brunch and I must say I have always passed by this place and never went inside always was curious about it. Well I think it is very good. Our waiter Kevin was not only cute but very good. I ordered the Belgian Waffle Combo and was very pleased with it. I would love to make a trip back for lunch are dinner. And they do have specials. I had a mimosa with my breakfast and the special for those are $3.99 all day. The restaurant also have a bakery with all kinds of sweet treats. I plan to try that again next time too."], ["Lizzy W.", "It was our first time trying and we loved it! The food was great and service was excellent. Price is very reasonable too. If you are going to IHOP or other American breakfast place, it's better to go more cozy and healthy restaurant like Cafe de France! It's definitely worth what you are getting with the money you spend."], ["Elle G.", "I came with a friend and our four daughters. We were seated immediately and our drink orders were taken right away. Refills on my drink were prompt. The bread was delicious! I didn't feel like our children were considered a nuisance or anything, as a previous reviewer suggested. We were definitely the youngest patrons there, though.My friend's daughter didn't care for the fish. My friend liked the chicken. They were surprised by the ginger carrots, but not displeased. My kids went with breakfast for dinner, so no complaints at all. My quiche was pleasant. Perhaps my only complaint would be that we informed our server when we sat down that we had a 6:30 meeting. We sat at 5:50 and did not get our food until 6:20. If it is all fresh, it could have been cook time, but I might have liked to know that certain dishes may not have time to be prepared in time for our meeting deadline. We were late to the meeting, which was right down the block. I would come back, though."], ["Rose G.", "Came here on a whim, have wanted to try it for some time. Wonderful atmosphere, very relaxed and welcoming. I ordered the eggs Benedict and if you've ever tried to make hollandaise sauce you know that it is difficult. The meal was absolute perfection. I rarely am a repeat customer to a place but I will be back to try more of their menu for sure. Cappacinno was quite delicious as well."], ["Belinda J.", "I used my groupon today go breakfast. I couldn't find someone to join me so I doubled checked the fine print on the voucher and there was nothing about going by yourself or having to buy 2 meals. Nothing. So I went. It was a cute place, quiet, intimate. The owner seemed kind. Breakfast was fine. Not great but pretty good and I thought I  could bring my group of girlfriends here for one of our brunch outings. I spent about $20. Well over the groupon for $14. When it came time to pay. My server was like you have to come with another person to use this groupon. Loudly. In the small intimate restaurant. I said I didn't have anyone to come with me but I purchased plenty of food to accommodate the groupon. You have to buy another meal to go, he said. I said that's ridiculous. There's nothing in the fine print about that and I spent plenty. He loudly said, yes it does (it didn't) The groupon title says breakfast for two as most groupings do, but Again the fine print said nothing about a requirement to order 2 meals yada yada. So he calls over the owner and I have to reiterate that I don't have someone to come with me to breakfast. After they embarrass me in this very small restaurant where everyone in the room now knows I am single and didn't have anyone to eat with me, the owner much more business savvy then the server honors my groupon. When the server comes back over with my check he continues to badger me about having eaten alone and how I was so wrong and they would fix it this time but next time you need to come with someone. Don't worry there won't be a next time. Thanks for making me feel stupid and shaming me in front of the rest of your now full dining room. I will never ever be back."], ["Stephanie R.", "You are crazy if this isn't in your breakfast/brunch rotation.We love the food here.  Champagne sauce for days!  The mimosas and bloody mary's don't hurt either.We've always gotten great service here as well, and the owner is there and stops by to see how things are going. (delicious, they are going delicious).We have been sitting outside lately, so that is nice, but inside is good too.  There is plenty of parking in the mornings when we go.I almost always order a Belgian waffle because that is what gluttons do.Stop by for brunch, you won't be sorry."], ["Jon L.", "Everyone here is friendly and the menu is a refreshing change from the usual IHoP style - I went for the crepes, but they arrived lukewarm, and it's not a lot of food for ten bucks. I think they've just upped the prices to compensate for all of the coupons they put out. Full disclosure: I was using a Groupon, but the bill still seemed high even after taking that into account, as I had my two daughters along. Their food looked better: an egg sandwich on a large croissant and pasta with chicken. They also brought out a small bread basket to start, but it wasn't anything special. And the side of fruit (instead of potatoes) was lame: not a berry in sight - just cantaloupe and a couple banana slices and pineapple chunks. All in all, I'm sure you'll be OK here, but there are obvious reasons why the place was nearly empty, beyond just that they have a lot of tables. You get a lot more for your money at Original Pancake House or Benedict's."], ["Tonya S.", "Very good! 2pm on Sunday: I tried the Eggs Benedict Florentine on a croissant and my husband tried the Normandie Croissant Sandwich (sausage, egg, and cheese), both were delicious. Good coffee too! :)Waitstaff was attentive & friendly. I liked the atmosphere; much nicer than a typical diner. We received a couple Danish pastries to-go and they were very good as well. We will definitely go back again."], ["Lynda G.", "Went for breakfast - the food was fairly good. No waiting for a table and used a Groupon.   I had the crepes with eggs & sausage w/hash browns and BF had a croissant egg sandwich w/potatoes.  OJ was fresh squeezed & excellent.  Service was slow and inattentive despite the fact several employees (including the manager) were standing around chit-chatting.  My coffee cup went empty for quite a while twice before I even got a chance to request a refill.  Overall, I would have enjoyed the meal more had the service been better and friendlier.  Kind of pricey for breakfast imo."], ["JM T.", "The owner was very nice and accommodating. He welcomed us as soon as we walked in. We told him we were here just for dessert and he took the time to identify every item in the cooler. We opted for the cheesecake and carrot cake. Both were moist and delicious. Nice visit! Next time we'll come for breakfast. Thanks!"], ["Wai Y.", "Food (**** out of *****); Escargot sauce needs a bit more garlic, salt, and herbs. Be sure to ask for more garlic and seasoning when you order. It comes in a little porcelain plate with half a dozen indentations. I usually don't order this but just steal one from another diner at the table. It's good enough to steal, but not good enough to justify the calories of an entire order. LOL. Their walnut chicken is also the best walnut chicken. It's probably their signature dish because I don't know of any other restaurant that serves it. They fry a chicken breast with walnuts to make it crunchy with an interesting texture. Then, they top it off with a creamy mushroom sauce. Their french onion soup is also the best and probably their most popular dish. This is important because in restaurants where they sell very little french onion soup, it just sits and sits on the warmer and the water is boiled off, leaving a very salty brew. Their french onion soup is never too salty. It is perfect. The best dishes here are walnut chicken, the chocolate cake, and french onion soup. All the chicken dishes are excellent to good. The chicken artichoke is good, too. It has a lemon wine sauce. The sole muniere is just OK. I have a very picky seafood palette and prefer seafood that was still swimming 30 min before I ate it or extremely fresh sushi. However, this is not a seafood restaurant nor a sushi bar so considering that, the sole muniere is good. They lack a lot of French classics such as Fricassee and souffle, but they have created some original dishes such as walnut chicken that nobody else has.Atmosphere (**** out of *****); Casual dining. Classy, yet unpretentious. Sometimes, they have a pianist playing at night. I don't know their pianist's schedule, though, so you may want to call in advance. I went for Valentine's day and there was no pianist, but on other nights that I went there was a pianist, sometimes. Service (**** out of *****); If it is busy and the waiter has trouble keeping up, just flag down the owner. The jolly old French guy is more than willing to pick up the slack. Monsier Gilani will take care of you. Anything you need, just ask Monsier Gilani. He makes all the difference. I've been going to his restaurant regularly for decades, even before he moved to this new location when he was located along HWY 75. I went on one of my first dates as a teenager at his restaurant. LOL. Conclusion (***** out of *****);  The tally is four stars, but I give Cafe de France an extra star for value. He has not changed his prices in many years. I mean, where else are you going to find a 3 course meal in a nice French restaurant for $13 (early bird dinner special 2-6P), Sunday night entree and soup or salad is $11. They also have a very reasonably priced lunch special menu, too. They have an extensive wine list but if you're a teetotaler, they also have a nice hot coffee, too. For a romantic, quiet, date night on a budget, Cafe de France is it.P.S. Theresa T said that she disliked the rice and the pasta is a bit bland. I agree. That's why I always substitute the rice with pasta and order extra walnut chicken sauce on the side. I pour that tasty mushroom cream sauce on my pasta. Jonathan G said that he disliked the carrots. Yeah, I usually tell him to skip the carrots and just give me the pasta instead. Yes, the salad that comes with the set meals are kinda small, but the salads ordered as a meal by itself are big, though. Jonathan also said that he disliked the veal. Nope, I never order his beef nor veal dishes. His chicken dishes are superb, the fish dishes are OK, but I generally avoid his beef dishes. Andre G, I've actually been to Paris, so I know what traditional French cuisine is supposed to be like. That's why I said in my review, \"They lack a lot of French classics....\" Floy B and Brady H ate breakfast, no comment, I've never had breakfast here.P.P.S. You know, your dining experience is exactly how you order it, in a good restaurant. I will write a negative review if a restaurant serves me poor quality food or improperly cooked food. For example, if the food was raw, burnt, or not fresh, it would get a one star review from me. However, if the food is not seasoned to your liking, the next time you go back, tell them exactly how you want it seasoned. If they do it right, then it's a good restaurant in my book. You cannot fault a restaurant for seasoning food too little or too much because everyone has different tastes. Now, if the chef refuses to cook the dish to my seasoning specifications, then, yeah, they'd get a bad review from me. The chef here always cooks the dishes perfectly to my specifications. Ordering a dish, not specifying how you want it cooked, then complaining about it is like getting into a taxi, not telling the driver where you want to go, then complain about the destination. LOL. ;0"]]}