{"Sevan G & G Cafe": [], "Little Greek Fresh Grill": [], "Ziziki's": [], "Greek Cafe and Bakery": [["Lou A.", "When this place first opened the owner and service were attentive and food was great. I don't know if it is still under the same ownership. Early this spring on a Tuesday evening the place was closed without any notice. Today May 29 for lunch it was open.  There were several customers seated. I stood by the front door in a bright red shirt for several minutes totally ignored by the gray-haired man behind the counter. I noticed at least two tables did not have their food. One couple with menus who were also ignored by the staff got up and left. I took that as my cue to leave since I got couldn't even get eye contact from any of the staff. I could see a dark-haired woman working in the kitchen. The gray-haired man totally ignored me waiting at the door and the other customers  waiting to order at the tables.  I did notice he was on the phone filling a to go order. I guess that is more important than live customers waiting for their food or to be seated. It's a shame the only Greek restaurant in Oak Cliff fails to be appropriately staffed and fails to pay attention to walk-in customers.  Lucky for me I can just go to the grocery store and start making my own Greek food. I have a lot of friends that eat out and I certainly won't be recommending this place anymore.Update: Another Yelp reviewer filled me in that the family running this business was experiencing some medical issues that likely caused the inattentiveness back in the recent past. I will revisit the Greek Cafe since the food has always been good.Revisited for a late lunch August 2014...service very slow. It appears that the owner is handling all seatings, taking phone and carry out orders, and waiting tables. I could see another person is the cook. My side salad was very fresh and tasty. Gyro sandwich generous and also tasted good. No refill offered for my water. I had to get up from my table to ask for my check and pay. The owner (cashier) could not remember what I had ordered even though he took my order and served me. I believe the guy is just trying to make ends meet by wearing too many hats in keeping this restaurant afloat. I'm no doctor but he obviously is not fit to handle all the tasks attempted. I very much want this  cute neighborhood Greek Cafe to thrive but service is just bad here even at 2pm for a late lunch with most tables empty. Please get competent and attentive servers. I'll try take out next time to hopefully avoid the frustrating table service. Three hopeful stars."], ["Alex L.", "Really good place to satisfy your gyro craving. Great service, friendly staff, good price and the food comes out quick."], ["Betsy P.", "If there is better greek food in Dallas, I don't know of it."], ["Jeff H.", "They have the best hummus I've ever tasted and I love their stuffed cabbage. I crave their Gyros all the time. Keep an eye out for their specials. Don't miss this tiny Greek Cafe tucked away in the Bishop Arts District on Davis. While their decor is not much, their food is aweseomesauce!"], ["Sparkle S.", "Adore this neighborhood gem!  Fresh, delicious, inexpensive, and AUTHENTIC!  My daughter's had gyros from all over the world and this is one of her favs. Support neighborhood, local, small-business, family places such as this."], ["Haylee O.", "A \"can't miss\" spot in Bishop arts. Always personal and kind service. The grilled veggie pita is divine, baklava is juuuuust right, and the owners are simply lovely."], ["Bub K.", "Food is excellent and well priced."], ["Ed M.", "Being half Greek, finding this spot was a charm AND finding out I have known one of the owners for around 45 years was an added bonus. I had Gyros, it was divine to say the least. Sitting there in that setting and talking of my youth made me feel so at home. Stop by..Enjoy!"], ["Rudy K.", "Customer service and food at it's BEST! Daugher Joanna and father Mike make up half of the staff here and they are wonderful! Customer service is bar none the best you can experience. My parents owned a small business in the late 90s and early 2000s and this reminds me of the service they'd give at their own business. I met Joanna the first time when I moved into Kessler Park and ordered a couple Gyros. I told her I love hummas and would have to try it next time. She packed me a sample of her hummas to go. Before that I asked her I'm looking for a good local gym and she made 2 suggestions. When I returned the following week she had remembered me and even grabbed some of the gym fliers for me! She said, \"I grabbed these specifically for you!\" Amazing! Mike is a really amazing person too. Even if the food was mediocre I'd be a regular here. Now for the food. The food is NOT mediocre. It is absolutely amazing. I've only lived in the area for a month and I've been back half a dozen times already. I go for take-out, I go to dine-in, I take friends and family.. I do it all there! They Gyros are the best this side of Chicago. In fact, their meat is imported from a Chicago based distributor and that is a good thing considering how many awesome Gyros can be found in Chicago. They have a Greek lasagna that you have to try.. But be aware, it's so good that they'll sometimes run out if you go for a late dinner! So go early!!! Say hi to Joanna and Mike!"], ["James V.", "You know, I'm Greek. My parents are Greek. My grandparents came over from Greece. This place is like my grandmother's kitchen!! No, not everything on the menu is available. And yes, they are going to hover over you like Greek grandparents!Leo Z. and I walked into this place a little before noon, the only customers there. I greated the owner in Greek, which was followed by some bantering. I had to show him my ID to proove I was authentic Greek guy lol! After Leo looked at the menu, lost for a few minutes, he asked what he should get. So I ordered for both of us, just off the appetizer section: Dolmas, tiziki, humus, some wonderful salad the guy made on his own, spanakopita . . . . OMG all delicious! It was difficult for us to carry on a conversation because everyone there kept going on and on about whatever was coming to mind. JUST like home!!! It was like they were sad we weren't all sitting at the same table.WARNING; This is an alternative-style restaurant! It really is like sitting in their kitchen, but the food was amazing!!!"], ["annette n.", "I love this place, this little tiny place which is hidden in plain sight!   Their tiny storefront faces Davis between  the groovy local skateboard shop and the hair salon!  How great is that location?   You do have to find a parking place and walk up to them but it's soooo worth it.First of all, the owners are fabulous!  Friendly doesn't begin to describe them.  The are interested in how your day is going and by the way, what do you want to eat?  They will make recommendations and they are spot on!We have sampled most everything on the small but tight menu and everything was great.  Tonight we had the grilled talapia and the mousaka, both of which come with rice, grilled veggies and a small greek salad.   All were excellent!  AND pita bread which was crisp on the outside and soft on the inside...all very good.  When everyplace in Bishop Arts is packed, give this place a try.  They get overlooked because they are off the beaten track just a little bit but deserve so much more attention than they get.   Check them out!"], ["Jodi G.", "Yumm-O! I'd passed this place so many times on my way to Bolsa and was always curious.  I finally went & *gasp* will never stop going here!  The food is made by authentic Greeks and tastes authentic!  It is one of those small dives with limited seating that you will never forget.  The gyros are AMAZING, as is the baklava!  It is not dirt-cheap, like you would expect from a dive like this, but I don't mind when it tastes this amazing!  I will be a continuous patron. ;-)"], ["Karen K.", "We hit this place up on a Monday night, when virtually nothing else was open nearby. Lucky us, it was delicious.  We ordered babaganoush, which was delicious. The moussaka with perfectly cooked vegetables, also delicious. The baklava, which was very good, but not the best I have ever had - otherwise i might have given the place 5 stars. I prefer my baklava with a more buttery, and slightly lemony flavor, and no chocolate.Service was good and friendly, if just a little casual.  We will go back. I really want to try some of their other offerings.It would benefit with a few minor changes in decor, like softer lighting, maybe some candles..."], ["Jo R.", "Beyond good...especially the gyro platter and their numerous dessert options. Hummus is excellent too, as is their always warm pita bread. And as others have mentioned, it is a family-owned restaurant and the owners are always very welcoming and friendly (a rarity these days)."], ["Hoang N.", "The buffet consisted of a small buffet table of main entrees, another small table of salads, and a smaller side table of desserts. My lunch was $13.95 for today and then $1.79 for coffee. There was only one other customer in the restaurant. There was a table that looked to be done with some stuff lying on top of it. But the owner was sitting down at another table chilling. The food was good, especially their flaky crusted tilapia. The salad was okay..standard pre-mixed lettuce with tomatoes and cucumbers. There were only two dressings..some creamy one and a red vinaigrette dressing. It wasn't a great place but it wasn't bad. Too few of a selection for my hungry self."], ["dean d.", "Small, dumpy, not much to look at inside or out, and they run out of menu items between lunch and dinner time for some reason, but dang, is this food really good.On a recent visit for an early supper, they ran out of Spanakopita (why no one knew) so I settled for the huge and flavorful Dolmas: you get four large stuffed grape leaves, just squeeze lemon on each and enjoy with the yogurt dip.I have my favorite over here: Mousaka. Layered Eggplant/potato/ground beef that is very tasty and comes with a huge greek salad that is enough to share.Don't skip dessert: shredded wheat Baklava is what I normally get, although you must try the new Chocolate Baklava (dark chocolate that let's the Baklava shine)."], ["R. Mark M.", "I hate giving locally owned two stars as I support mom and pop business, but I have never gotten good service here even when it is just me in the restaurant. In addition for such a small operation, there prices are what I expect a nice restaurant. I have vowed I wont go back due to prices."], ["Christy O.", "You can tell a lot about a place by looking at the bathroom.  This bathroom has a toilet missing a tank lid and you have to pull a long string to flush.  I wonder how they sanitize the string......The menus are paper and re-used so they are greasy and crinkly.  The table linens are white and blue, to stick with the whole Greek theme- but they do not seem to replace, change, clean the table linens from one customer to the next. So when my glass appetizer plate landed on the table linen, I could see food, hair and guck under my plate.  That did it for me right there- but we had already ordered, so I had to press on despite this issue.  I went ahead and put a paper napkin under my plate so I couldn't see underneath, but it didn't keep me from focusing on what was under there.We ordered the hummus appetizer for $5.50 and out came a tiny ball of hummus and pita bread.  The lady came over and told us that her food processor broke and she had to make it by hand.  That conjured up too many bad images of her with her actual hands smooshing chick peas.  Which made me think of the hair on the table linen.  We ordered water and when I squeezed my lemon- the lemon guts swirled in the water.  Normally that is great, but not this time as I kept thinking of the guck on the table linen.  They do not have lunch specials.  The gyro was small and just one piece of pita bread, not a \"wrap\" like I am used to.  Plus the meat inside wasn't shaved- it was like little meat balls.  So while I am eating this meatball pita sandwich, I am freaking out about what is on the table linen.Bottom line- it is like an older couple (Greek/not Greek I have no clue) decided that they liked to cook at home so thought why not open a restaurant."], ["Justin P.", "Great service and gyros that are out of this world!  Nice family-owned business."], ["Steve W.", "I cannot say enough good things about this tiny \"hole in the wall\". From the handmade pastries to the authentic Greek food, this is the place you've been looking for all your life when you realized you wanted really good Greek food."]], "Ziziki's Restaurants": [["Myles B.", "Best Mediterranean meal I've had in a while! Why in the world are you still reading this?! You should have already set your navigation and be sitting down to order as you read this! BTW order the gyro, it'll be last cut of lamb you'll wonder if you like cause youll be picky of everyone else's moving forward. They do their hummus with artichokes instead of garbanzo beans which was surprisingly delicious. The ziziki sauce left a lasting impression on my taste buds as well. Wine choices are quite selective, soon they might be doing the game on Sunday nights.  I'll definitely have this place in mind for recommendations on date nights  or even business lunches/dinners."], ["Sherlyn S.", "After visiting here multiple times I think I have figured out why its not a 5 star place. The service here is definitely holding this place back. Everytime I come here, the waiters are constantly pushing me and my company to pay and leave!! I get it the place is small and they need business to flow, but its annoying when every ten minutes they stop by and see if we want anything else and if they can bring the bill...However, I will keep coming back for the delicious food! I would recommend getting the mousaka, rack of lamb,  grecian chicken or the lamb skewers. The roasted new potatoes and the hummus is really good here.Lastly, the cocktails here are so delicious and refreshing, my favorite is the greek godess? I think thats the name. The prices are a bit steep."], ["Jennifer V.", "My second visit here I really hate when the server chooses to bring me the bill before asking if I would like anything else or if I want dessert. Pet peeve of mine and I usually leave them a note regarding it when they choose to be so presumptuous.   Oh, and dirty silverware. Completely disgusting. My last visit was better and I enjoyed it otherwise my rating might have been lower."], ["Jon L.", "Friendly waiter and they have a nice new patio. I went with the salmon salad, which was ok. Kinda smallish portion of salmon and the lettuce was a tad on the old side  - some grayish brown spots. The price was very high at $17.50, which probably explains why they weren't very busy."], ["Najva F.", "We went there for my dad birthday it was our first time . The food was delicious. But I think the price is not worth for the tinny tiny food they offer also the servant was awesome he did really good job."], ["James H.", "Will not likely return. Here is why: Greek cuisine in St. Louis and Chicago is light years better. The food we are used to has more sauce, spices, much more olive oil and is very rich. I ordered the egg plant dish which was mostly a halfed baked potato - barely any ground beef and very little egg plant. The dish was very overpriced for what I got. I was very disappointed. The service was good, and the deccor was very attractive. I wish I could say that my food was really \"GREEK\". Thus far I agree with other restaurant experts who say that there is really not any good authentic Greek food in the DFW area - they are correct. Please hire some Greek chefs that specialize in authentic Greek cuisine."], ["Craig M.", "Every time I come here I order the Greek cheeseburger and each time I leave I'm just so happy with my usual old choice.  Just thinking about this lamb burger makes me want to order another one.  Surprisingly they are not very big but really filling.  Personally, I feel if they offered non-traditional sweet potato fries it would complement the burger most excellently.  Yummo!"], ["Mike M.", "I'm a big fan of Greek food especially when it's fresh and in a unique environment. Today I had the distinct pleasure of dining for lunch at Zizikis at Forest and Preston in Dallas. The service was prompt and polite and the waitress was able to accommodate my substitution request with ease. For an appetizer I went with the artichoke dip and pita bread. This was a Greek hummus with artichokes, garlic, lemon and warm pita bread. While the hummus was fantastic, it was the pita bread that was distinctly rememberable. So much so I asked what made it so tasty. The owner informed me this all came down to Greek oregano with some salt, pepper and garlic. For lunch I opted for Salmon Souvlaki (skewers) and a side Greek salad with Ziziki dressing. I preferred the light salad compared to the standard potatoes. The meal arrived promptly and the skewers were served atop a large round pita bread. The salmon was perfectly moist and fell apart with the touch of my fork. It was pretty easy to clean up my plate. I opted for a coffee to close out the meal and the addition of cinnamon was a welcome surprise. Overall, this place bleeds of authentic Greek food and I'd highly recommend it. Also learned they are building an outdoor patio which will open soon. Be sure to check this place out!"], ["Lori B.", "If you haven't been to Zizikis lately. The Salmon Salad alone is worth a trip! My tip is to mix the Zizikis Sauce w the Basil sauce. Ymmmm!"], ["Dan M.", "I tried Zizikis for the first time and I came in a little hesitant.  I haven't had a lot of Greek food so I was a little intimidated. Lucky for me I had Sara as my waitress. She walked me through the menu and recommend a few things I might like. I started with the Lamb Lolipops 2 generous chops nicely seasoned and grilled, served with a rich mushroom sauce which lifted the flavor of the lamb. Next was the Pastichio a Greek version of lasagna. Lamb, macaroni, tomatoes and bėchamel. This was baked stacked and rich with flavor. Of course I ate it all. They say to save the best for last and the Baklava Ice Cream Cake was my favorite. Layers of Baklava and homemade ice cream with a drizzle of honey on top. It was a great end to a great lunch. I was told next time in try the Lamb Burger and I can't wait to go back. Thank you Zizikis for a wonderful meal."], ["Don B.", "Today was my first experience at Ziziki's and I must say that the food exceeded my expectations. We decided to start with Ziziki's Bread which was warm and cheesy and served with a side of fresh Dill sauce which was amazing.I tried one of the 3 Chef's Selections that was available and chose the Bay of Fundy Salmon that was seasoned and grilled to absolute perfection and was accompanied with asparagus and Orzo. My friend had the Veggie Souvlakis and was extremely pleased and highly recommends the dish. The atmosphere was quiet and comfortable which was perfect for lunchtime conversation. We decided to split the BaklavaIce Ice Cream for desert which is a signature item created by Chef Costa. The layers of Baklava were a nice compliment to the cold creamy ice cream which was served with a light honey, Grand Marnier Orange sauce. It was an absolutely amazing experience."], ["Mia G.", "I don't enjoy much greek food, but this place has amazing pita and humus. The humus tastes very fresh, the seasoning is perfect. The lamb gyro was very delicious, and has an amazing cream sauce. It was all hot at the beginning, it tasted all very fresh. The dolmades was very favorable. The Ziziki plate's spanakopita and the pistachio was all very fresh. We would probably come here again."], ["Aquilina C.", "The dessert was amazing! Meal not so much. A mountain of ground meat under layers of pasta. The price was not worth the food. The only reason I gave them 3 stars was the baklava cake!"], ["Carolyn H.", "This place is sooooooo good and service is great! My boyfriend and I shared the calamari, and pita and hummus for our appetizers and it was delicious. I had the lamb salad for my entree and it was even more amazing!! Everything was well prepared and so good. We'll definitely be back"], ["Melissa H.", "Agree about the Baklava cake but it is big! I've eaten here many times and have always had good service.y favorite is to share pita bread, the traditional Greek salad with no lettuce, dessert and coffee. I love their coffee! I recommend this spot!"], ["Leigh D.", "Food was good. Environment was ok, could use a very good mopping. Our server Sarah seemed like she didn't like her job very much.... Maybe she was having a bad day, who knows.Also, she dropped the check without offering coffee or dessert"], ["Cyndie G.", "My favorite Greek food in Dallas.  I love lamb and it can be difficult to find.  It is fabulous here.  The lamb sandwich is incredibly good.  So much better than a gyro sandwiches I have gotten elsewhere.   The lamb is real small pieces, not shredded and the bread is incredible.As other people have referenced, the hummus with artichoke dip with pita bread is delicious.  I often stop by and just get it to go and have that as a meal.  For dining in with friends we often get the three dip appetizer that is excellent.The atmosphere is great, the service is great."], ["Jeff W.", "This place was amazing!  Had the Lamb Gyro that came with roasted potatoes. One of the best gyros I have ever had!  Looks like a lot of other great choices on the menu as well! I will be back to try more."], ["Bruno B.", "Once again we had a great time at Zizikis! It seems to just get better and better every time my wife and I return. We were excited to see Phillip there because we had not in a while. He is the type of waiter that \"tells\" us what we are having, and every time it is exactly what our tastebuds are wanting, but just didn't know. The new remodel in the front room looks amazing and the patio will definitely be where we sit once it cools off some. We were told that there are new owners that are eager to try some new things such as food of course, but the $40 and under 1/2 price bottles of wine on Monday and Tuesday's is a great start! We are lucky to have found this spot and will definitely continue to go again and again."], ["Hunter B.", "The food was good, and the restaurant itself was exceptionally nice. Very cold though, so probably bring a jacket. I will most likely be going there again."], ["Kent C.", "Really good food!"], ["Vy L.", "One of my favorite dining spot.I LOVE their calamari, you HAVE to try it. I have not had better calamari anywhere else. This place is on the fancy scale, can pass for a fancy date of dine and wine. The staff is attentive (again, fancy). You can see the kitchen from most of the table, if you like that kind of experience. One of my other favorite is Ziziki Bread, can't get enough of the dips. The prices aren't too bad though for sure. Dishes are around $25-$30 ?Came here for brunch too, very good quality. Highly recommended. A bit pricier though, i think it was around $30 per person?"], ["Meghan E.", "My first time ever eating greek food and I'm so glad I went here! The food was wonderful! I got take out for a Christmas Luncheon at work, and even being take out it tasted amazing. The people on the phone were so nice and helpful, I cannot wait to go back and sit down in the restaurant and eat."], ["Melanie S.", "This is one of my favorite restaurants in Dallas. I always get the Chicken Souvlaki and sub the potatoes for the Ziziki salad. The potatoes are great too but I just love the Ziziki sauce on the salad! I love the taste of their iced tea as well. It has a little fruit taste to it but it's not too sweet."], ["Paige D.", "Love this place!!! Lamb gyros with zizikis sauce is the bomb. Amazing service as well!"], ["Anthony G.", "Very tasty Greek food!!! Fresh and wonderful service. I will be back"], ["Tori W.", "Ziziki's is a lil more upscale, a lil more class, a lil higher prices, and lil smaller portions than some of its Dallas competitors.  So comparatively speaking, I still prefer Kostas Cafe or Stratos when I'm in the mood for Greek.  I guess it all depends on the occasion or which food you're in the mood for.  I'm probably wouldn't suggest taking a hot date to Stratos, well, probably not Ziziki's either.Anyways, I am bummed they don't have Avgolomono Soup (which is bad ass at Kostas).  They do however have very delicious artichoke hummus.  They don't have the standard Greek dishes I expect to find at any Greek restaurant.  For example, I don't think they have a gyro plate!  WTH?  That being said, the food that they offer is very tasty.  You must be willing to pay more for it.  That's why I rarely choose Ziziki's over my other faves!"], ["Ilene B.", "Zizikis is always a nice experience and last night was no exception. A group of us - there were 7 of us - were having dinner with our good friend who came back to Dallas for a visit. Zizikis is one of her favorite places. It was delicious. We all ordered different items and everyone enjoyed their meals. Especially their roasted potatoes with rosemary I think. For dessert we shared the tiramisu. It was very good and the presentation with swirled chocolate syrup was lovely. Our server Karly was excellent and she kindly took a few group photos with our phones. She did a great job with a large group. Highly recommend the restaurant and Karly."], ["Una B.", "I waiver on the 3 or 4 stars due to price. Yes, the food is good, but I'm just not sure if it warrants the price tag.Ordered the chicken souvlaki, which was basically gyro style, with a pita, yogurt sauce, and red onions on a plate. Chicken was tender and moist but for 18? Hmmm. The plate also came with roasted potatoes that were DELICIOUS. I loved these the most. My friend ordered the Greek Island Chicken, which was basically  the same chicken as my dish, but in a semi-creamy sauce, along with the potatoes. Again, good but also 19 dollars. Service was on point, the server was polite and efficient. Ambiance is cute, with white table cloths and dim lighting with candles. If the price point were just somewhat lower, this could be a regular rotation. It's not bad enough to be saved as a \"special occasion\" place, but somewhere in the middle."], ["Scot D.", "I don't give 5 star ratings very often, but this one is well deserving.Who said Third Time is the Charm?  This is my second visit to Ziziki's and I have never had food so well prepared before..I can't wait if the 3rd time it gets better.I had the Greek Paella..now way to eat it all..half of it went home with me..so I get to have that great dish again.  The wine...a Tuscana Red went great with the meal. BUT..the OMG Meter broke down in a diabetic coma with the Baklava Ice Cream Cake... Simply put...Nothing better.  Our out of town guest was blow away with the quality of the dinner, the presentation and the service.There is no question we will be back to Ziziki's.."], ["Nikki D.", "The food at Zizikis is pretty good. It's cooked nice and the quality good, but it isn't quite what I think of when I need a Greek fix. I see it more as a fancy Greek fusion restaurant with an interior your going to pay to sit in. The location is convenient, and the decorations are nice, but the food is a bit overpriced. Certainly not the place for  authentic home cooked meal tastes. Go if you want a semi-expensive \"Greek\" meal that's so dressed up it's lots its homey flavor. Go elsewhere if you're looking for authentic Greek taste.If you do go, pass on the bland pastichio and go with the Greek Paella."], ["Jaya F.", "I love this place to death. The food is extraordinary, the ambiance is awesome and the service is excellent. It a perfect date night place. Had a date with my husband just for a change.The bread is so tasty. I had the Grilled Chicken Souvlaki - Tender medallions of chicken breast served with bread, yogurt sauce and roasted potatoes with greek spices. The combination was good. The portions were also minimal and the price nominal."], ["Jennifer D.", "Great food! Terrible parking. I ordered take out today as a first-time diner - it took me longer to find a parking spot that wasn't designated for another business than it did to get there in the first place! Since I was getting a to-go order, I finally wound up \"risking it\" and parking in a \"banking customers only spot.\" (Half of the spots in the whole lot are marked for the bank). Because of this, the food was lukewarm by the time I got back to work. A quick zap in the micro took care of it, and it was delicious. But all-in-all the parking situation made the whole thing a very frustrating endeavor. If I go back, it will be on a bank holiday!"], ["Esther H.", "Without a doubt one of the top of line restaurants in Mediterranean cuisine! Its quite a fortune that the restaurant has extended its service to the city of Plano. Excellent service with an ambient atmosphere, Zizikis serves both the casual and formal customer. It leans more over as a date type place but don't feel shy to bring the kids! Reservations not required, but highly suggested during the weekends because this restaurant  fits a comfortable group of people. If you are waiting, they have a wonderful paper gift shop called Paper Affair that you can scope out awesome things to look at and see.If you have never been, the one appetizer I recommend is the Artichoke Dip which is has wonderful soft pita bread with an artichoke garlic hummus dip that will not only keep you eating but wont prevent you from eating the main course.To be frank, you cannot eat there without ordering something with Lamb. If you don't try it - you're missing out. Perfectly cooked to your specific preference, the rack of lamb is served with excellent mashed potatoes and yummy asparagus.Other dishes to try are the Lamb Salad and the Greek Burger ( pita bread with cheese, lettuce, tomatoes, their special sauce, and lamb )The pan roasted potatoes are great to eat with the Lamb Salad and the Greek burger. Enjoy!"], ["Chris B.", "Went back, tried the pastizio...dear God, I was in heaven...Give Ziziki's their due...they are 5 STARS all the way in Greek fare..."], ["John H.", "Delicious food and awesome atmosphere. The staff were extremely welcoming and courteous. The lamb was to die for and the spinach artichoke dip with the pita bread was delicious."], ["Turner B.", "Oh Zizikik's, how I used to love you so! Sadly, Ziziki's has a new menu and the portions are completely chintzy, and the food is good but nothing special. Tried to order the salmon kabob and substitute the potatoes for a salad, and was told it'd be another $7. That means the pita, salmon and appetizer size salad at dinner are now pushing close to $30. Ouch! Hubby ordered the lamb kabob - it came with TWO bite size pieces of lamb, 3 pieces of asparagus, some orzo, and 4 or 5 other pieces of veggie from the kabob..., with a price more than $20. We have now officially broken up. Will go to Penne Pomodoro or any of several other options in this area before I agree to go back to Ziziki's."], ["Ivy E.", "The theme here seems to be less is more.  Less room between tables, less menu options, less food on my plate.  But I LOVE their food and crave it and so will be returning!"], ["Glenn S.", "\"I'll take Pleasant Surprises for $100, please, Alex!\" Based on the reviews posted here I should have expected a great experience but I am not that familiar with Greek cuisine and have certainly never paid these prices for it, so I was thrilled at the meal we had last night. Sometimes you do get what you pay for in a very positive way. The quality was absolutely worth the elevated price.Ziziki's can thank a well-placed ad in the Observer for our attendance. The seed it planted gave way to the solution to the ever-challenging riddle of \"Where is some place different that we can eat?\" Despite being under-dressed for such nice environs, we were treated like valued customers. Our server was polite, friendly and did a great job keeping up with our needs. However, that was simply a bonus on top of the great food we had.We shared a large appetizer platter to start. Personally, I thought the combination of feta and Ziziki sauce on the grape leaves was a bit much but the others thought it was fantastic. I enjoyed the spanikopita despite not being a Spinach fan.We split three main courses. Believe it or not, I did not order the Greek cheeseburger but wish I had. It was juicy and flavorful, plus the pita actually provided a perfect complement to the patty. I had the Grecian chicken , which featured two Christina Hendricks' sized breasts, smothered in a delicious becamel sauce and ample amounts of mushrooms. This dish was indeed the hit of the night! Finally, we had the pastichio (Greek Lasagna?) which was nicely put together but slightly off-putting due to inclusion of an unknown spice (I think cinnamon)We left agreeing that we would certainly revisit Ziziki's again. The only downside is that it will undoubtedly become a regular part of our restaurant roulette rotation so it will stop being \"different\" relatively soon. Of course, that is a risk that I am willing to take."], ["Aliyah K.", "You know when you look at the clock in the car and think to yourself...\"2pm? No wonder I am so hungry, I forgot to eat lunch. Duh!\" Well, this occurred the other day while running errands in Dallas with Hubby. I quick Yelp search to remind me of the old stomping grounds and I found Zizikis, Greek Salad here we come! Hubby enjoyed a Crown on the rocks, awesome, they have a full bar! And Crown at lunch? Hey, it was around Thanksgiving... We started with the Artichoke Dip and Pita. I could have started, middled and ended with this too! It was fantastic! The lemon and garlic added a nice complimentary pairing of flavors and the pita was so flavorful and warm. This is an incredible starter, don't miss it! I had the Greek Salad and it was impressive! Plenty of feta, olives, tomato however I would have gone a bit lighter on the dressing or had it on the side had I known it would be so heavy. Hey, I am trying to eat a salad here, let's not totally ruin the healthy endeavor with creamy dressing... Hubby had the Veggie Sandwich, which was gorgeous! Piles of zucchini, tomato and mushrooms! Yum! It came with cheese, which was not listed on the menu but was no problem for my husband. The potatoes that accompanied the sandwich proved to be a bit heavy for him as a lunch side but man they were awesome! Service was a little slow, especially at the end while waiting for a check. Overall though I was super happy with the food, and not just because it was 2pm."]], "Cedars Mediterranean Mezza & Grill": [["Ginger H.", "I absolutely love this place especially to-go. You just walk in, grab a container, fill it up (or pack it) and check out. They weigh it by the pound if it'd togo. But the food is seriously fresh,  flavorful,  and so pleasing to the eye. AND they are very friendly and patient when new customers come in and are overwhelmed by the choices."], ["Cheyenne S.", "Went for lunch with a coworker and I was overwhelmed at the amount of food I got for such a low price. I ended up with lunch and dinner. Not to mention everything was delicious!! The veggie buffet is fresh and full of variety. I ordered the Persian beef which was seasoned to perfection. I'll definitely be back!"], ["Linh N.", "I love their vegetarian buffet! $11 will get you so full and you definitely will not miss meat. Arrays of various salads, dips, hot dishes, soup, and pita bread/chips!Salads are fresh but they can get soggy. Considering that I went about an hour before closing I knew they were not going to replenish anything. On this occasion they did offer a seafood paella on the buffet which wasn't great but a nice gesture of having some meat on the line. Drinks are not self serve so grab the \"waiter's\" attention when you sit down. They will clear your plates and refill drinks but that's pretty much it. It's awesome that it's right off the Walnut Hill station!"], ["Ben L.", "Very well done Mediterranean food, though the wholewheat pita were like rock and cold, and the signage is outdated and inaccurate(2 piece cheese pie = one pie in actuality) despite being on monitors and easily updatable."], ["Xochi R.", "Great for lunch! Food is always fresh and the quality and flavors are great. Good quality overall all but food is fresher during the week and during lunch time."], ["Emily M.", "Nice, clean, comfortable atmosphere. You order at a counter and they bring you the food. Everything is cooked well, the menu choices are pretty small, but it is tasty. There's a vegetarian buffet too, but I didn't taste that. All in all, I would go back, but I'm not dying to."], ["Dhruv K.", "The salad buffet was great! Loved the chicken shwarma as well. Tried both that, and the Turkish Chicken Kabob, and definitely preferred the former."], ["Emily C.", "Fresh Mediterranean food with the option for a vegetarian buffet. Order when you come in and you are given a number for your table for the meat entree (if you choose to have one).The buffet selections are plentiful, with typical Mediterranean selections - dolmas, hummus, etc. I did like the variety of hot vegetables. However, I was not impressed by the meat. The gyro meat was fine - less salty than many other places. Skip the chicken - it was dry but edible with the tzatziki sauce.While they have more variety with salads and vegetables than Fadi's, the food is not necessarily tastier. It's a good option for the salad buffet, though."], ["Hector E.", "The buffet looks pretty wonderful. Unfortunately, it's all vegetarian. You can add a protein from their list of available proteins for an additional $5.99. We got there early so there was plenty of seating available. Shortly after we sat down we found ourselves in a packed house. I was a little concerned that the empty restaurant was a sign that the food or service weren't good. I'm glad I was wrong. Service was attentive and friendly. I was short on time so i got a gyro and Greek salad. The gyro was great and the salad was fresh. I look forward to visiting this place often."], ["Jennifer J.", "Don't come here unless you are hungry. And if you are trying to practice portion control, forget it. The buffet is definitely the way to go. Everything was delicious and I tried just about everything. The nice thing was that I was able to get a to-go box for my entree since I filled up on all of the side dishes."], ["Karla S.", "I agree with Desirae. Cedar's is definitely Fadi's and Ali Baba's baby. Expect exactly the same food, which is good but nothing new. What about raw and baked kibbeh for a change? Sfihas? Rice pudding with rose water and Ataif  for dessert? It was Ramadan already, not having Ataif was a bummer. I had the buffet and ordered Lebanese Kabob with pine nuts, but the Kabob had no pine nuts. I asked the waiter and he said \"it does not come with it necessarily\". If you say it does in the menu then yes, it must have it. I would have had the Persian koobideh instead if I knew.Service is also the same as the other places. All in all, good but not excellent."], ["Andrea S.", "Food was delicious and portions were huge. Service was a little confused the entire time and kept asking us if we had ordered this or that, but overall they were friendly and the atmosphere was nice. Could do without the pay before you eat situation, but it made it easy to head out at the end of our meal."], ["Justin M.", "I had this twice in one day! Their meat portions are very generous and the taste is superb! I had the lamb pita sandwich for lunch and dinner and was pleasantly pleased. The Greek salad was fresh and the atmosphere comfortable."], ["Scott S.", "Cedars offers a mixture of all-you-can-eat vegetarian variety with some traditional meat dishes as well.  I have been here on a number of occasions with varying group sizes, and the service is usually pretty attentive with good food to boot.When you walk in, you order at the counter.  If you order the buffet, you can get right down to business and start piling up a plate with various roasted, marinated, etc. vegetables salad items, cheeses or otherwise.  If you order a meat platter or dish of some sort, you will be given a number and the dish will be brought to your table.  I am a big fan of the lamb shwarma platter, think gyro meat piled on top of pita with hummus and tabuli.  There is also usually fresh, warm pita available for the taking next to the register.Also, a great thing we discovered recently, Cedars is BYOB.  So, you can enjoy a fresh meal, and bring your favorite wine/beer along.  We did not have to pay any corkage fee, and they opened the wine and brought us glasses to drink it.Overall, nice selection, reasonably priced, cheerful service, and it's BYOB.  We will keep on coming back.P.S. I noticed that they may be testing adding in some meat to the buffet last night.  My fiancee said there was chicken breast available."], ["Kaia V.", "AhhhhhhhhHHhHhHHHHhHH!!!!Why did I not ever know about this place? How many years could I have been gorging my face with delicious vegetarian Mediterranean foods for $9.99 dine in at lunch time or $4.99/lb to go? I only wish they had Lavosh, but the stuff they did have was wonderful. Most of the salads have cheese on them already, so if you're not a dairy person, it might not be a great spot to get your salad on. There are a lot of digestion-inducing ingredients in the buffet: eggplant, fried cauliflower, mushrooms, olive oil. There are also some anti-digestion foods: cheese, spinach, nuts, pita. So whether you want to speed up, slow down, or maintain your digestive activities, Cedars probably has something for you. The dining room is really nicely styled with big wooden chairs and tables arranged in a manner that allows for communal dining as well as large groups. Once seated (after ordering/paying at the counter and then grabbing your grub), a waiter will come by to get your drink order. I overheard some lady say the peach tea is amazing. They also have some kind of super caffeinated tea. The plates are ginormous, making it easy to only need one trip to the buffet, but you can go back as much as you want. I have yet to get kicked out for eating too much, which is alarming."], ["Sarah Y.", "Finally found a delicious, healthy, affordable pay-by-the-pound restaurant that has won my heart! I've dined in (on the lamb gyro platter $8) and to-go, and the trick to affordability and variety is definitely to-go! The first thing on their menu is the $9.99 vegetarian feast all you can eat salad bar deal, which allows you to frequent their massive and delicious non-meat hot and cold dishes as many times as you want when you dine in. BUT, if you get to-go, it's $4.99/lb. If you do the math, you see that you'd have to eat 2 lbs of food in one sitting for the dine in option to get the same bang for your buck to-go. I certainly can't do that and would rather take out 2 lbs of food that i could eat over several days!And oh the variety and delicious tastes! Many of the items are minimally seasoned with salt, pepper, herbs, and olive oil in accordance to a mediterranean diet, but the flavors of the food is all super on point. There're several delicious cold salads, curried couscous, tabouli, grilled eggplants, carrots, zucchinis, hummus, babaganoush, pasta salads, flatbread pizzas. Then don't forget to turn your head to the hot foods section which is also part of the \"vegetarian feast\" deal. You won't see any meat except shrimp on any of these items, but who needs meat when you have delicious fried cauliflower, mediterranean stewed okra, seasoned mashed potatoes, wilted spinach, rice pilaf with caramelized onions, marinated mushrooms and zucchini, and so much more! As for the meat dishes that I've had here, everything has been fantastic, but I especially love the lamb from the spinning spit or as kebabs. It is truly delicious meat and food in general at a great price!"], ["Dara H.", "Best gyro and the atmosphere is wonderful. BYOB. Great space for groups. The staff was very kind."], ["S M.", "Delicious, refreshing food! The staff is helpful and ready to serve. The food bar is the way to go if you want to sample a variety of food. We ordered a kabob on the side but would have been fine without it. This is definitely a great place to get Mediterranean food!"], ["Melissa G.", "This is definitely one of my favorite places to eat in Dallas. The food is delicious. I always get the vegetarian feast because I get too full off the buffet to even think about a meat entree. I recommend eating here to everyone."], ["Michelle N.", "Move over Fadi's - you got some competition!Once again, thank goodness for Yelp otherwise I would have never found this place. I came here for dinner.  When I first walked in, I thought the concept was similar to Fadi's where you walk in, place your order, and they plate your choices for you.  Little did I know, this is a buffet!  Okay so its not a full buffet - they control the amount of meat you receive but the sides, veggies, and soup are limitless.  Eat your heart out!  I had the shawarma platter while the boyfriend had the kabobs platter - both with lamb.  Fortunately for me, our meat was served in a timely manner.  In any case, you munch on the sides while you wait.  You definitely get a lot more meat with the shawarma platter.  I didn't like the lamb kabobs too much because I thought the meat was too tough and chewy but the BF liked it.  I loved my choice!    I loved all the sides.  They were fresh and delicious.  They even have wheat pita bread!!  Oh yea...   Can't beat the price... I would just have to go out of my way to come here but it's definitely worth the trip."]], "Greek Isles Grill & Taverna": [["Brenda B.", "My mother and her friends love Greek Isles and Mom was looking forward to meeting there for a late lunch on Saturday, not realizing the restaurant closes between lunch and dinner service. The manager generously offered to serve us lunch despite being closed and saved the day. The food was delicious, the portions more than generous,  and the manager made us feel as welcome as if we were his first customers. I highly recommend a trip to Greek Isles for the food and the service."], ["Mo H.", "My little get away spot on lunch break. Very good lunch options with savory flavors. It's a great place to choose if you want something other than American food! My Gyro was delightful, the staff was warm and punctual."], ["Plata S.", "I am the neighbor up stair. I LOVE greek food in general. But this place they always make new menu all the time. Everything is delicious here even just the water :-) The decoration can make you feel like you are in Greek. Love it!"], ["Dena F.", "Incredible service, nice ambiance and quiet setting. Started with the delicious hummus, just enough garlic to remind me later in the evening where I ate dinner. I had the Avgolemono soup instead of the salad, it was a great choice, the soup was smooth with just enough lemon not too over powering. For my entree I had the Pastito; of course, you could tell it was made that day, very fresh. I am ready to go back and try the Veal with artichoke and Avgolemono Sauce. Finally, we tried their homemade ice cream with baklava mixed in, yum. Unfortunately no leftovers were taken home, except I did manage to order their homemade baklava to go."], ["Janet M.", "Gyros, chicken souvlaki, lemon soup, and pita bread all delicious. Pretty atmosphere with excellent service!"], ["Michelle S.", "The food was good 4+ star. Service was terrible does not even deserve 1 star. Waiter did not write down our order. I asked for no feta on my salad, can't do dairy - ended up with feta anyway & no service to be had, so I had to try & eat around it. Food was good, parking was easy. Will try other Greek restaurants before coming back. Would have loved to try the baklava but the waiter was ignoring our table so badly we thought we would be waiting forever. We literally spent 2 hours in the restaurant & did not order appetizers. Spent all of 20 minutes at most eating, the remaining time was waiting. Disappointed."], ["Kelli C.", "A++++. Last Saturday was our first visit, and it did not disappoint. Server was incredibly attentive and kind to our party of 5 (grandmother, and family)They accommodated food allergies and they food was so so delicious. I had the blackened tilapia and a greek salad. Don't neglect the dessert menu - the baklava was heavenly!"], ["Jason C.", "Stopped by for lunch and ordered the gyro. I have never been here before this but it was great! Place is super clean and very high end looking inside but the prices were not reflective at all. Will definitely be back soon!"], ["Laura B.", "Excellent food and service.   We went for Mother's Day and all the women were given beautiful single roses and either a free glass of champagne or a Mimosa. Very thoughtful!  All of us got different entrees which we loved (Tilapia, Beef tenderloin, Chicken with lemon sauce).  Dolmas are outstanding as is the custard and Baklava ice cream (yum!) dessert.  Love this restaurant!!  Reasonably priced food and alcohol (excellent house wines).  Comfortable seating, enjoyable evening.  Highly recommend."], ["Emily P.", "My husband and I went for the first time tonight. The service was great the prices were great and the food was amazing! Will be going back for sure!!!"], ["K H.", "Went there on a Sat night.  Service was personable and helpful.  Food was delicious and you got a lot for your money.  Not expensive for a meal.  Like the space because it is not the same old sterile minimalist style you see so much of today.  Will return."], ["Cassie N.", "Great food and GREAT service. Tav was such a great waiter! He made recommendations and brought us a taste of a few things if we couldn't decide. We highly recommend going! We will definitely be going back and taking friends!"]], "Andalous Mediterranean Grill": [["Shrenik S.", "Beat this place in Mediterranean food...bet cannot in irving....good food plenty of options...i go here every month"], ["Ashleigh B.", "Wish I could give 4.5 stars. Didn't have much of a protein choice.  But I was offered and ended up getting was a success. Did two sides and a meat during lunch for $7.99. Huge plates! Baklava with a yelp check in which was pretty great as well. Will definitely come back. :)"], ["Annette P.", "I love this place!  My boyfriend and I decided to eat here for date night and were more than  pleasantly surprised.  Staff was super friendly, came over to us as we looked at the menu, and explained a few things to us.  I guess they could tell by our expressions that we were first-timers here.  I ordered one meat + three sides, my honey had 4 sides.  Everything was YUMMY and portions are quite generous.  Even my lumberjack built boyfriend took leftovers home.  The lamb shank was tender and literally fell off the bone.  As far as hummus goes, the mushroom/onion was my favorite with the spinach a close second.  If you like falafel, the falafael salad will be a hit with you.  We ordered both chocolate and pistachio baklava and pistachio wins hands down.  We will definitely be back!"], ["Lazara R.", "There's many Mediterranean restaurants in Dallas that we have tried but definitely this is on the very top of the list! It's buffet style but they serve you so it's very clean and fresh food.  Absolutely recommend it.  Try the chicken! It's the best!!"], ["Bill K.", "This is great Mediterranean food. You pick from a buffet. I got the falafel platter. It was very good. The hummus is very tasty and they had six kinds of hummus.  The vegetables on the buffet are numbers and very good. Our family thoroughly enjoyed this visit."], ["Laith S.", "Nice place although we went there in a rush hour in a weekend. They use the cafeteria buffet style, in which you choose sides and salads and then main item (chicken or beef..etc).All the food was great in terms of taste and quantity. Defiantly will like to visit again when in the area."], ["Jocelyn W.", "I am from cleveland ohio and my friends took us here. I'm giving it 5 stars because of presentation, taste, breads, quality, convenience, and staff. The pita? Breads were so delicious and such a wonderful fresh unique texture! The guy was fresh cooking them! My friend got me the meat with 3 sides (comes with 2 breads). I was confused... But they explained everything was a side, the hummus and dips, the salads or the hot veg sides. So I got the regular hummus which was delicious, the Greek salad which was average/good, the lentils which were average/good. I got the leg of lamb. The sauce on it was a consistency I thought not good, like that oddly thick texture of canned soup. It was ok. I wouldn't get it again. But still! I will still give it a 5 star rTing because the value is still there and the portions and the idea of the place. It was great. Clean... Friendly staff. I'll miss you delicious bread. *sniff *sniffUpdate: a month later I am still missing these delicious breads. If you visit and Andalous please give my love to the breads."], ["Mark S.", "No longer BYOB - boooooooooooooo!Good variety of choices, something for everybody.  It was ok, but nothing special."], ["Lori S.", "Went here not really knowing what anything was that I was ordering, however I was not disappointed with ANY of it! Delicious! Look forward to going back soon."], ["Yaani-Mai G.", "We eat here regularly & it is consistently good. I love the grilled chicken the best. Freshly cooked dishes & pita bread. Great selection of salads, humus, entrees, vegetables that are arranged cafeteria style so you can choose what you want. Reasonably priced under $10 for 1 meat,  2 vegetables & Pita bread. Portions are very generous on a huge plate. Staff is always friendly."], ["Jessica H.", "I couldn't believe this place had SO MANY amazing reviews, but they are well deserved.Came in here with my entire family after a day at Kings Spa, which is not too far away. For six of us to STUFF ourselves, the bill was under $80. I couldn't believe it, really. I had the meatballs, which were amazing. For my sides, I had the classic hummus (some of the best hummus I've ever had) and the okra. The okra was a little overcooked, but the stew it was in was so fantastic I didn't really care.The food was delicious, and the staff was amazing. We came in at a bit of an off-hour, but I was impressed by how fresh everything still seemed. We clearly looked confused, so one of the staff members gave us a tour and introduced us to all of the food. Very, very friendly people. The chef came out of the kitchen to recommend things for us, and the staff was having fun serving us as we were the only people in the restaurant. I don't know when I'll be back in Irving, but if I ever am I'll be coming by."], ["michele h.", "I've reviewed this place before so I'm not sure why my review is gone, but as always it's a regular weekly standby for us. The service is 100 times better than the former Ali Baba now Terra grill and the food is just as good, with the exception of the bread which is sooooo much better at Andalous because it comes straight out of the brick oven while you wait and the other guys doesn't. My only beef with Andalous is recently I notice they aren't as generous with their delicious hummus when loading your plate, which makes me sad. But the selection is great and with 5 middle eastern places within 2 miles(and a middle eastern husband) this is always our first choice in Irving."], ["Rinny K.", "Saw reviews on this place and thought I would give it a try.  I know this sounds crazy but I have never had Mediterranean food.  So as you walk in there's food already made and fresh bread.  You grab a tray to the left.  The meal has an option of three sides and one meat.  The portions were very large.  The staff were happy and friendly.  You always recognize a  great establishment when people are happy.  My three sides were a lot as you can see in my photos.  I have had pretty much all kinds of food out there except for this.  I was pretty excited.  They had a great selections of meat  and they all were cooked fresh and hot.  As we get to the line to pay which was my sisters treat .. We told the manager it was our first time there.  His name was Omar.  He seemed very delighted that we were there.  I asked him what the freebee was in the yelp add and he was shocked that I have never heard of this dessert nor that I have tried it.  So we sat down and tasted pretty much everything they had.  I ordered the lamb and OMG it was tender and amazing.  They cooked it perfectly.  Omar stopped by and suggested I eat the marrow in the bone lol since I will try anything once, I gave it a shot.  Too my surprise it was amazing. Lol I also tried the beef and the chicken.  Both were cooked nicely.  Then I saw a lady with soup, so I asked what the soup was.  Once again Omar stated that it was tasty.  I took one sip and was sold.  I never had lintel soup before and I was amazed.  I like the flavor of the soup.  It was rich and creamy.  The staff was great and I would defiantly recommend everyone to come here and give this place a try.  Thank you Omar for allowing us to enjoy the food and educate us on the culture of the food.  It's always nice to try new things."], ["Linda B.", "I love Yelp!  Just landed in Dallas and didn't want to eat hotel food so I pulled up my favorite ap and found this funky but delicious place!  I had the Gyro sandwich which was amazingly good. Kind of a cafeteria style place. Food was extremely fresh and so many things to choose from. Will definitely be back!"], ["Warren R.", "HUGE portion sizes. An order for 1 will easily feed a family with two small children. Very friendly staff. A definite return."], ["Sherri G.", "It's cafeteria-styled; you walk down an assembly line and fill your plate.The meal was very filling, the portions were quite generous; I was not able to finish.They have a really wide variety of sides. I liked:- The pita is really fluffy and the hummus is great (easy to fill up on, so be careful)- The fattoush (a salad of chopped veggies) is very fresh and well seasoned- The chicken. Generally, at Middle Eastern restaurants I go for red meat, but their chicken is really incredibleTIP: check in on yelp for baklava"], ["Dirk N.", "Tried these guys out yesterday and was pretty impressed. Their cafeteria-style ordering system is really confusing at first, but you'll forget about that once you start sampling the fresh, delicious food. I tried the baba ganoush, okra, green beans, Greek salad and chicken. All were pretty tasty. The pita was also fresh and has a great pocket for stuffing foods to make a sandwich. I don't get super-excited about baklava, but theirs was good.As for the restaurant itself, the ambiance is inviting and everything is really clean. The staff was mostly nice, except for the cashier; she was rushing us and not very polite. So overall, a great experience, but not quite five stars due to ordering and the cashier."], ["Laura M.", "Food is awesome. I was a little confused how to begin as it was cafeteria style, but the staff was extremely helpful. We got the lamb and falafel, it was delicious."], ["S S.", "Not only the best Mediterranean food but the people here are always so happy and so inviting. Up until I moved, I would frequent this place about once a week. I miss it! The Anadalous chicken on top of greek salad is a must have!"], ["Jay H.", "I only work over in the Las Colinas area about once or twice a week, so whenever I do come over here, I fully take advantage of the many great places that you can grab a bite for lunch! Andalous is one of those options that I never get tired of. If I can't make a decision...this Mediterranean gem is one of my default choices.The set up is different from most places...I guess you can describe it as kind of a cafeteria style with the breads and sides, but when you order some of the main entree items, you grab a number and those are brought out to you. I know...it sounds confusing, and my writing isn't helping that fact, but trust me...the temporary confusion is totally worth it!Like Trinh T. says in his review, you have to get the bread when it's hot. There are times during the less busy hours that you may come across some bread that's been sitting out for a while, but trust me and wait until some more comes out! I always get some hummus for one of my sides! They have multiple options in the hummus department...regular, spicy, there's some kind of spinach, and some kind of mushroom hummus as well. I always stick to the spicy, and it has a pretty decent kick to it too! The falafel is done extremely well too! It's some of the best falafel in the area that I've tried (if someone knows of some better, please let me know!). They bring it out to you after you order it so it's always hot and crispy on the outside, and soft and flavorful in the center. The falafel platter or the falafel sandwich are both excellent choices..you can't go wrong with either. Sometimes going through the line I get overwhelmed! There are so many options, with so little time to make a choice! One more thing...skip the soda and try the tropical unsweetened tea! It's a perfect match with most of my meals here...delicious!"]], "Taza Grill": [], "Atheneos Greek Village Cafe": [["Merl V.", "When I want Greek food, this is where I go! Not only do I love their food, but the atmosphere is always so comforting and pleasant. I have brought my friends and family here for different events and they loved it as well. I usually get a gyro or pork Souvlaki with french fries for my meal. Their Galaktoboureko is heavenly!! It is a custard dessert made from magic. Its THAT good! Try this place out, you won't be sorry!"], ["Jasmine T.", "Very nice service, the owner is very amiable and talks with customers sincerely Food is filling and nutritional with a nice price.Wait time was pretty lengthy... Maybe hire more service?"], ["Yu H.", "Good but not great. I've only had their gyro plate. They give a generous portion of meat for the price. The meat is well-seasoned but a little oily for me. I wish they gave more pita bread because the amount provided definitely is not enough for the amount of meat they give (which is not a bad thing). Their sauces aren't the best I've had, I definitely wished I had a good cucumber sauce to go with my gyro."], ["Stephanie K.", "This review is solely on food as I had it to go. However, when I stepped in there, it look nice, clean and very well put!Food was awesome as I had some hummus and Greek burger.I think the food is delicious and will be back but I do wish they had told us about he lunch menu located at the very back so that we could save on some money.Either way, I think I'll get the gyro pita instead of the burger cause the burger is pretty much like the gyro pita wrap."], ["Intel A.", "Well done, as always. Avgolemeno soup,  Athenian salad, galaktoboureno and Greek coffee was not to heavy and just right. Our server was Gaby and she held to that balance good service without being too hovering over us."], ["Bonnie R.", "Ok, so I drove 8 miles beyond my house to order take out.  When I got back home only half of the item was in the bag.  What I got to sample was good but i was rather put off by their offer of a free lunch in the future when I only had half of my $19 order today.  They say they'll make it right next time I come.  We'll see.  Being so far away I'm not that likely to rush over.  Anyway, the moral of this story is if you are ordering takeout here, check your order because they won't bring you what they left out. I've had this happen at two other places in my lifetime and guess what, both rushed the forgotten items to my door without my even asking.  I guess those places cared more whether their customers actually got what they ordered and paid for and whether they would go hungry the rest of the day.  I'll revisit this review in the future to update what happens if I decide to go back."], ["Nate P.", "This place is fantastic.  Found it by accident on one of our little Friday \"out of the office\" lunch hours and it's become a mainstay in our rotation.  The service is very friendly and it's obvious the owner cares about his customers and his business.  As for the menu...the food is delicious.  I've been to the restaurant with 6 different people who never order the same thing twice in a row and they've yet to be disappointed.  Myself, I stick to the pasticio because it's my all-time favorite greek food and it's been very good every time.We will continue coming back for sure.  Well done, Atheneos!"], ["A T.", "Great food, quick service and friendly staff.  The Gyro is delicious!  We got there at lunch time got sat quickly and got served quickly.  Also the Greek coffee was wonderful and strong!"], ["Brian W.", "Found this place last night and had a gyro plate for dinner with the hummus appetizer. Excellent food with an excellent staff. Thanks.Gryo sandwich is delicious. Stopping for lunch or dinner every time I am in town.Update 5/15/15: I eat here every month and today was just ok. The Gryo sandwich was just ok, fries were ok and really the hummus was not that great. Not sure what happened but today was not great."], ["Steve C.", "Coffee is strong and sweet.! Very delicious. Delicious will prepared food as good as I've had anywhere! The owner is a super guy and  comes around to check on you! This place would be worth the drive across town anytime."], ["L J.", "Went to this location twice and I am a fan! The service is friendly and attentive. The food is delicious. I got the mousaka both times I've been and it's great. Pita bread is warm and buttery. We ordered a second order of pita bread in the middle of our meal but it took a really long time to get to us. It was actually a good thing because we ended up with too much food. So we told them we didn't need it anymore. They gave it to us for free since we had to wait. The food does take a little while for it to come out, but it always tastes fresh when it does come out. This is a nice find in Mesquite!"], ["Jodi C.", "I really like this place. We were one of Ruth and Manny's first customers when they opened at Town East and 635. The \"new\" location is larger and of course decorated in the Blue and White Greek color theme. I miss the murals from the first place, and the restaurant vs diner feel that it is now.The Gyro Sandwich is still yummy. The staff is very nice and helpful. The calamari was tough, but flavorful, and smallish for the price, I thought.This was the first time I did not enjoy a food item here. We were told that the usual cook was out on a catering gig, so maybe this was why, but whatever it was, it was not what I am used to from this family owned and family run restaurant. All in all, it was a nice night with my hubby after a long hard day of house hunting. They do not serve alcohol, but you are permitted to bring your own. You may want to call and check on the details for this."], ["James J.", "Great service and the food was super!  We started with humus for an appetizer, then  had the Delphi Combination (which is definitely enough for two people) and finished with the custard.  Everything was delicious!  Thank you Roxanne for making our 34th anniversary wonderful!  We will definitely come again!"], ["Arlene M.", "I've failed to checkin several times. I've eaten here at least a dozen times.  Chicken souvakli with lemon rice is my favorite.  Hummus and tsatsiki yogurt with warm pita are favorite apps here.  The Greek is usually there to greet you!"], ["Lara G.", "Amazing!!!!  Best gyro I have ever had!  Love yelp-great to be able travel across the country and get great recommendations that are spot on!"], ["Nora F.", "My boyfriend and I get our food to-go here pretty frequently! The food is great - we always get the gyro dinner plates. The staff is friendly and one of the owners walks around and talks to the guests which is a great personal touch!"], ["Wes L.", "Food was good, service was lacking some. We may go back again, but not sure."], ["Jolly M.", "My son and I were next door at the game store getting him a game. He wanted a gyro and we were to eat later so we just stopped in for that. We bought one to split. The gyro was a bit small in size but the quality was subperb and one of the best I have ever had. My son said we need to come back and eat there an I totally agree. We will be back."], ["Bethany B.", "The food was delicious and authentic! The service could have been a little more attentive, but we would definitely go back!!"], ["Ronnie B.", "Best gyro I've EVER had in Dallas. The seasoning on the fries wasn't needed, but besides that it was just like back home in b the Midwest."], ["Sofia P.", "Excellent food and super friendly staff. I shared the Parthenon plate with my boyfriend and we loved everything on it. Owner came over at the end of the meal to ask us how our food was. I will definitely be returning when I'm back in Dallas."], ["Ben H.", "Great food and service.  Spanikopita was excellent and the Parthenon platter has a perfect variety of foods.  The owner (from Greece of course) was very friendly and made a point to chat with us and ask about the food.  Desserts were great as well."], ["Eric M.", "Great food and fast carryout. I was in and out even without calling ahead. I ordered the PARTHENON platter and was pleased with the amount of food for the price.  Everything tasted exceptional. My \"friend\" ordered the MOUSAKA and was also pleased. We were not able to eat it all and ended up putting some in the fridge for later. It stored well and was just as good the second time around especially the hummus."], ["Chris T.", "Really happy that they moved to the new location in mesquite. Easy to get to and always good food. This time I had the Chicken and it was very tasty.  The owner is super nice and always comes to our table to say hi. Makes you feel like part of the family."], ["Angela S.", "Stopped here on drive from Austin to Nashville. We were looking for a quick, independently owned cafe. Food and service was excellent. Among us we had a veggie pita, both salads on the menu and spanakopita. All of which we highly recommend. A man who we believed to be the owner stopped by our table to ask about the food. Not eating fast food or chains can make road trips difficult. Today we scored!"], ["Billy M.", "This was my 1st visit and I will be back! I had the Parthenon special (variety) plate and it was as fresh and flavorful as any Greek food I have eaten. The service was prompt and polite. The owner \"Manny\" sat with me and visited for awhile and suggested one of their several home made desserts. I had not had this custard and filo dessert before - Galaktoboureko - which was VERY good!"], ["Kristen M.", "I have really mixed feelings about this place. The food was great but the service I received when ordering take out for the 2nd time in 1 week was a nightmare. My mother raved about how good it was and she could not wait for the new location to open. After it opened I picked up a to go order from there friday before last. it consisted of an order of tzaziki, 2 of the chicken Souvlaki, and I ordered 2 kids chicken nuggets and fries (totalling about $35 for a to go order for a family of 4 with 2 small children.) That night I went to pick up the order. Dealt with the owner and he was extremely nice. Offered me water while I waited on my order. He went out of his way to make sure our first experience was a good one. Other than the lid to the tzakiki sauce not being closed all the way and spilling all over everything else in the bag the experience was great. The food was amazing. In fact so good I couldn't wait to eat it again. I insisted on getting it to go again last friday. I have a 15 month old and a 4 year old which makes it very hard to go out and \"sit down\" and eat dinner as a family. This experience was no wear near as pleasant as the first and that's why I'm giving them one star. The star is for the food... not the service. I called to place the order and mistakenly ordered 2 chicken gyro's (I'm new to greek  food and thought that's what we ate the previous week), the lady on the other end of the line said \"we don't have chicken gyros we have chicken soulvaki. I said, yes, that's it let me get 2 orders of that with fries and 2 of the chicken nugget kids meals. The lady said sorry, kids meals are dine in only. I explained to her that I picked them up last week and spoke with the owner and there was not a problem. She said well he is the one that wrote the menu. I told her forget the kids orders and just make the chicken gyros/soulvaki. I hung up and told my husband & he said, the kids need to eat too. I called back and cancelled the order immediately. The lady on the other end of the line was so rude. I said I would like to cancel the order I just placed and she said okay, then hung up. She did not even ask my name. I called back to make sure she knew to cancel my order and again she was extremely rude. I told her about my pleasant experience the previous week with the owner and asked for her name so I could speak with him regarding her attitude. She said, I'm Ruby, the owner's wife. She would not put him on the phone. Then stated he is the one that wrote the menu like that. Really? What do you expect me to feed my one year old?"], ["Zippy M.", "I prefer the atmosphere & live music they had in the old location, but they're actually closer to me now which is good considering I love the food.  Still, I think they should make it a little more \"homey\" and bring the music back.  It would be more festive and add to the fun of eating there."], ["Cheryl H.", "They've just reopened in the last few days in the old Quizno's Sub location on Peachtree Ln and Gross Rd. So happy they did! I had the Pork Souvlaki and meat dolmas today for lunch, and it's so good! Tender pork, grilled fresh, with half a slice of pita bread, warmed also. Seasoned rice that is nice and fluffy and tasty, and a small Greek salad on the side. The meat dolmas are bigger, I think. If you tried it before in the old Town East Blvd location, try it again. It's even better! I love the lemony sauce that they serve with the meat dolmas, and the tzatziki sauce was so good, I dolloped a little on the rice with my fork, although the rice doesn't need it. I just wanted to have some more sauce without drinking it from the container. LOL. Really great Greek food!"]], "Cafe Izmir": [], "Zoës Kitchen": [], "Stratos Greek Taverna": [["Anthony B.", "It floats between a 3.5 and 4. Pretty solid place. Food is good, service is usually pretty good and quick.  I've tried the gyros and the burger and neither one has made me run to the bathroom in a panic. That's a plus.The decor is so weird, its very amusing. Walking in, I feel like I'm walking into a club. I guess it adds to its eccentricity."], ["Alisha J.", "I love Greek food, and this place has delicious Greek food. It is not the best that I have ever tasted. (The best I had was in NYC). I found the staff to be very friendly and they provided very good customer service. The only thing I am not a fan of is the décor. It looks old and dark."], ["Ike O.", "The gyro combo was absolutely delicious. Probably the best gyro I've ever had. And I've had gyros in Europe and in the east coast. Will definitely come back for more!"], ["Bisesh S.", "Me no likey paying for hookah that don't work. Waste of money and the experience has left me bitter. Never coming back to this location again. Food was decent but pricey."], ["Clark C.", "Stratos is a solid 3 stars.  If they had the option of giving 3.3 or 3.4 stars, I would.  But I had to round down to play within the Yelp rules.  The food was solid, not great, but pretty good.  The atmosphere was... seedy.  I felt like I was in an 80's strip club that would have served as the backdrop for a scene in one of Steven Segal's early movies.  I don't feel like it would pass most health code requirements, but I assume that the owner is in the Greek mafia and pays off Steven Segal's cop partner to \"look the other way\"... and that's what ends up getting him killed and then the next scene is when Steven Segal comes to Stratos to take revenge (see above for context).  At one point in the night, a belly dancer climbed up on a table (with her bare feet) and began to gyrate her cesarean scar while some small Greek man made it rain with napkins (that is not a joke).  I wanted to call AARP and make sure there weren't any retired belly dancers missing from the local retirement home.  Overall, it was one of the weirdest experiences I've ever had at a \"restaurant.\"  Did I enjoy myself? -- Yes.  Was the food good? -- kinda."], ["Ian M.", "I love this place! It has never been busy (although I have yet to come during the belly dancing nights), 2.50 domestic beers, and $2 wells/house margaritas. And I must say that their margaritas are not weak! The food is pretty solid in comparison to other greek food I've had. I don't think I have ever been \"wowed\" by gyros, but I also have rarely been disappointed. I had the double meat gyros, with a side of pita so that I could actually eat the mountains of meat that they add to the plate. I really should have saved the extra gyro for lunch tomorrow, but it went inside my belly... what can I say? And I really did enjoy the house margaritas!Lots of space, TV's show the latest CNN news on the debate as to whether Santa was really white (the best news comes from Fox news). The service was friendly, no complaints.Can't wait to come back for the belly dancers. I've never seen any before. One day..."], ["Liz S.", "Wow! Stratos is quite the adventure.  After driving by for YEARS, I finally stopped in for dinner and it was a hilarious, delicious, out of body experience.Upon walking in, we were promptly seated by friendly staff and then saw that none other than Elvis was taking the stage to provide some entertainment to the crowd.  It was a Wednesday so not only did we have Elvis there but wine by the glass and bottle is half off.The food came out quickly and our waiter was happy to offer suggestions since we had never been there and they all have crazy long Greek names that I couldnt pronounce even if I was drunk.We had the Greek pizza which was fantastic!!!  Definitely a must order.  We also had the flaming cheese which was good but very thick, a great appetizer for a larger group.The best part of the meal was the Baklava Ice Cream.  A few scoops of vanilla ice cream topped with chunks of baklava -  yummmm.I definitely will come back here and it is the best place to go for out of town guests who just want to have fun and do something out of the ordinary."], ["Michael S.", "The owner has done a great job running this place. I've been eating there for six years now and the quality and service is always consistently good. I usually go for the gyro plate with fries but their other options are just as good. Do not forget Aphrodite's Chocolate Passion!! Perfect for dates!"], ["Greg D.", "In town on business.  Gyro sounded good so I checked it out.  I ordered a Gyro with fries and extra meat.  The Gyro alone was all I should have ordered.  The extra meat came on its own plate and was a very generous portion.  The service was great (I think her name was Brenda), food came out fast and tasted great!  Large dining area, dimly lit, music playing. Tables and booths.  Looked like some type of stage or dance floor.  The inside reminded me of something you would see in a movie that was a gentlemans club or something.  I will definitely dine there again if work brings me back to Dallas."], ["D N.", "I was Very disappointed in service, and treatment that received by the manager. Arrived at 11:05pm and was told that the kitchen closed at 11:00 ,so we ask if possible can we get a shrimp cocktail you dnt have to cook that. The manger continually badgered us about the restaurant closing at 12:00 and the kitchen is close and that he wasn't honoring the 1/2 off because its seafood. Manager stated he run the place and he wasn't giving that as a discount. Well thats a first considering the fact that visit are frequent. Told manager that  he is unprofessional, customer service stills are not in check,and he is argumentative. But i guess since we were not of Mexican decent he really didn't want our business.  I travel all over the world and i Have Never been treated so rudely!!!!!! Will not recommend and i will never go back."], ["Lily M.", "This is a different, in a fun kind of way, place to go to.  My bf and I came here on a Sunday evening and there were belly dancers partying the night away.  We saw about 5 different dancers and we got there at 7:30pm.  There were young and older dancers, all which were good at their jobs.We started out with Nick's Greek Sampler.  The sampler was way too much for only two people, unless the plan is not to order entrees to following the appetizer.  The spanakopita was ok...the texture of the phyllo dough was right on.  The hummus and pita bread was the best part.I ordered the Stratos Gyro combo.  The gyro was so delicious, but I couldn't even get through eating half of it since I was already full from the appetizer.  The combo came with a Greek salad, which I didn't get to taste, so I am not sure if it was good or not.My bf ordered the Stratos Meat Lover Combo.  That gyro had so much meat in it that it seemed to be a joke.  The kitchen also didn't dress the gyro with the lettuce, tomatoes, and tzatziki sauce.  I definitely wouldn't recommend the Meat Lover Combo since you have to try to dress it yourself, with absolutely no room inside of the gyro to do so.I would probably come back again."], ["Dawn H.", "This was a great place to meet up with our family for our nephew's birthday. Great atmosphere!  Perfect for all ages. We had 3 generations in our party. Food was really good but a bit pricey.  Some of us partook of the Hookah Bar upstairs which was something new. We very much enjoyed this place & learned to yell Opa!"], ["Albert B.", "Definitely one of our favorite lunch spots! Not too expensive and the interior of the restaurant is not what you'd expect."], ["Cristina O.", "Do you ever just want a gyro and fries? A good ol classic? I do and Stratos has it. And it blew my expectations away. The gyro was as big as a chipotle burrito. The fries were amazing, well seasoned and crispy. The tzaziki is def made from scratch, it's thick and full of finely diced onion cucumber dill and garlic and more like a dip. The service was excellent. Everything was just excellent. And now I want a gyro, dang it."], ["Kristen D.", "When you first walk in, you will probably notice a fairly big crowd and friendly staff.  The tables and chairs are nothing fancy...a lot like something you would see at a banquet.  They have a decent little patio area with fans.  We ordered some drinks to start, a mojito and a passion fruit margarita. The drinks were strong, but tasty.  They are $9 a pop, so keep that in mind.  We also ordered the Flaming Saganaki and Tirokafteri for appetizers.  The flaming Saganaki was enough for two people however, the Tirokafteri could easily go for 6 people. I was a huge fan of the Tirokafter which was a spicy greek feta spread.  It was robust and plenty spicy :) My friends and I ordered the grilled octopus and the steak kabobs to split.  They were both great and I was highly impressed with the octopus.   I think even if you do not generally eat it, you may like it here.  (at least that was the case for me) It was full of flavor and not the least bit chewy.  The side of potatoes and veggies were also jam packed with flavor sending your taste buds soaring.  I also ordered a peach margarita which was my favorite of the two I tried.  It has a very nice, refreshing taste.  The belly dancing was cool as well as the plate breaking tradition.  I think this is a great little find for the area...even though it's not super little :P If you like Greek food at all, you must try this place.  Excellent service and excellent food."], ["Jamison E.", "Interesting place worth a visit. Came on a Tuesday evening and if you ordered a drink you got 1/2 off the meal. Place was pretty active for a Tuesday night. Ordered spanakopita plate. Lots of vegetarian options it was hard to decide what to order.  Meal was good, not amazing but good. Wait staff are friendly. Apparently Thursday-Saturday they have belly dancing show."], ["April S.", "This place is very eye catching and I'd been wanting to try it ever since I noticed it, but didn't until last week. My coworkers and I were craving Mediterranean food, and Stratos gave us our fix.We all ordered the gyro sandwich with fries, and shared a plate of hummus. The sandwich was stuffed full of lamb and tzatziki - a great portion for the price. The fries seemed like they were just frozen out of the pack, that type, but they hit the spot! The hummus wasn't really anything to write home about, but good enough.So the food was average, but the atmosphere was nice. We sat outside on the patio and it was very pleasant. I like the way they have it decorated. Our waitress was friendly and asked us if it was our first time. It was so she told us all about the fun stuff they have going on there at night - belly dancers on Friday and Saturday, salsa lessons on Wednesday, I think. I'm sure it'd be a lot of fun and I really would like to go back!"], ["Celeste A.", "So I freaked out on the way home bc I dropped my cell phone n thought I left it at school. I pull over on some random road and find the phone in the foot well. I am starving so I decided...how about that creepy greek restaurant with the crowded parking lot and bars all over the windows? So I sit in a booth and I am like why does this booth only open out towards huge tv screens? And why is it round with a stage? So I google and it used to be a strip club.  And this menu is super overpriced except for the gyros. I got a gyro and it was ok but did not knock my socks off. My \"side of kalamata olives and feta cheese\" was two olives and a small cube of cheese. Would I return to think what creepy things happened in this booth before it was hopefully disinfected? No. To recap: Great service, ok food, good orange custardy dessert. Is it good enough to return and deal with weird atmosphere? No."], ["Hena K.", "If you haven't been here, I don't know what you are waiting for. This place has a variety of Greek food. My favorite dish has to be the gyro sandwich. The meat is so tender and juicy. You must try the rice it is so flavorful and the taziki sauce is amazing.  They have plenty of seating which is open and an area which is more intimate with booths. They have a happy hour daily from 4-7pm and if you come at night they have a DJ, dancing and belly dance shows that never disappoint.  The servers could be a little better. A lot of them don't seem to smile and be friendly."], ["Lee K.", "I'm not really too sure where I stand on Stratos.  I think that I would have to give it barely 3 stars on food, and a solid 5 stars for its Friday and Saturday night belly dancing.  Seriously, I would recommend going there only on a Friday or Saturday night and for appetizers and drinks only.  The food is fairly mediocre to low end with the exception of about 3/4 of the appetizer menu.  Just grab whatever the grape leaf rolls are called, several beers, and watch the immense awkwardness as drunk 30something and older birthday parties try to dance on the tables alongside the belly dancers while the owner makes it rain with napkins.  It's truly amazing to witness."]], "Fadi's Mediterranean Grill": [["Charlene L.", "Seriously, why does this place not exist in Seattle?! The fact that I come here weekly should speak for itself. For the times I want something healthy, but still tasty, I come here. It's great because I always do the Fadi's Sampler to go.. let me tell you about this sampler.First of all, it's WHATEVER YOU WANT, with no limit of how many dishes you can sample! As long you can fit it in the take out box, it's yours! Can we just pause right there and think about that? Ya... exactly! And of course, no meal is complete without some protein, bro! The Fadi's sampler comes with one meat of choice; I always opt for the chicken kabob... clean, lean, and tasty! If you've never been to Fadi's the experience can be overwhelming at first. It's just a buffet line with servers behind the counter waiting to pile up your plate, and trust me, they do not skimp on the portions here. For all you Yelpers who've have the opportunity (or misfortune) to witness how much I can eat, Fadi's always supplies me with enough fuel to get me through 2-3 meals! Fast food that's not harsh on your diet, and that won't break your bank? Fadi's is your place to be!"], ["Deana H.", "Came for dinner with the family tonight as this used to be a favorite when we miss\"home-cooked\" Middle Eastern food. We loved the regular guys/ladies on the line and the cashier always recognized us and knew our order and was always cordial. But today everything was different. They must be under new management since we didn't recognize anyone there. The guy manning the hummus station was leaning over the counter, face inches from the food, playing with his phone. The lady at the warm vegetables gave one extra piece of cauliflower when we asked for more. The man at the cashier couldn't understand why we wanted two sandwiches and vegetarian platter and instead charged us for the more expensive option which we did not get. There were several tables left dirty with dishes spilling over. The women's bathroom was in disarray with the mop and mop bucket in there, no paper towels in the machine and a very sopping roll on the counter. The men's bathroom was equally horrendous per my husband. Overall, the food was good but it wasn't the same experience/service/cleanliness as before and I'm afraid has turned us off from this place altogether."], ["Mandy L.", "Came here on a friday night and it reminds me of a cafeteria line where you grab whatever looks good. My boyfriend and I each got our own plate, but we could have easily shared and still had leftovers.I wish the signs would have been a little more specific on some of the dishes as it was hard to tell what certain things were.The hummus was great, quinoa salad was sweet (which I thought was a little odd but it was still good) and the veggies were perfectly cooked. Chicken was kind of dry thought. Overall, tons of options, fast, easy and a great deal. The turkish coffee was also fantastic."], ["Jo P.", "The huge portions are turning me into a Fadi Fatty! But not really since it's all healthy, fresh foods and I end up sharing the Fadi's Sampler ($13.99) anyway. Initially I was disappointed this wasn't your typical all-you-can-eat buffet but after 3 visits, I see the logic: they will pile as much as you want onto one heaping dish since you'll probably only eat that much, or less. This keeps food from being wasted as often as regular buffets! So stinking savvy. As for my friend's \"missing\" pitas, he was supposed to pick them up for himself on the corner before the meats. So don't forget them if you're having a platter!"], ["Matthew M.", "I have been here several times and never let down. this place has fresh, wonderful food and its a great value. I have brought many friends here and will continue to visit as often as I can. The hummus and salad selection is terrific. The bread is soooo good!!!"], ["Peter H.", "My fellow summer shredders, Fadi's will help you achieve your aesthetic goals.It was my first time trying out Fadi's, the Whale had been before and said that she really like Fadi's.  I ended up getting the sample, loading up on an assortment of vegetables and selecting the beef shawarma as my protein choice.  Each vegetable wasn't overcooked and the beef shawarma complimented the vegetables quite well.  My bros, Fadi's definitely fits your macros so don't be scared to enjoy a meal outside of your grilled chicken and broccoli :-)"], ["Heli M.", "I love the variety that Fadi's has to offer. Everything here is always fresh and the colorful buffet is heavenly smelling from the minute you walk in! However, my meal yesterday was sadly flavorless and bland. I got the #1 platter with my choice of generously portioned sides and a meat. I chose a lamb shank that was probably the best part of my meal: fall off the bone tender. The sides looked better than they tasted: fruit couscous, a cold pasta & spinach dish, green beans. I was full at the end of the meal but for $14 per plate, I was pretty disappointed with the lack of seasoning and taste. The service was excellent, fast and friendly though. Enough to have me give it a try once more and try something different."], ["Peter S.", "Lately I've been carb cycling, but wanting to \"treat\" myself on a Saturday, my partner and I agreed to come to fadis. Fadis is a great place to dine if you're on a diet/eat healthy in general or just love great tasting food. Since I was really watching my carb intake I decided to just get the special, which you get one dip, salad choice, rice or veggie, and one protein. I went with spicy hummus, a Greek salad, steamed broccoli and the baked chicken breast. For the price, I think it was $11.95? I got a TON of food! They loaded up my plate with plenty of hummus and sides. The chicken was a decent size and had this great flavor. The white meat was nice and juicy and not so dry. The spicy hummus was delicious, and Greek salad with the balsamic was great. I will for sure be back here for a nice treat meal without over doing it!"], ["Amanda J.", "I ordered Fadi's through Favor for lunch today. I got the falafel wrap and a side of plain hummus with pita bread. Pretty basic! I've had better hummus, but it was still very tasty, and was more than enough for 2 people. Our office will be eating it for the rest of the week! The falafel was good too, but the other contents of the wrap (veggies and sauce) were just okay. This is simply a review of the food from a delivery stand point. I would 100% go into the restaurant itself and eat in-restaurant - and when I do, I will update my review! :)"], ["Jill G.", "Ample authentic vegan options and our servings on the (12\") vegetarian plates were quite generous."], ["Natasha R.", "So many vegan and vegetarian options :) most things are labeled. The location was easy to get to. I found it when I was leaving the spa. Everybody that worked there was super friendly and accommodating. The platter is awesome. You get a lot of bang for your buck. I really enjoyed all the different types of hummus. They seemed to have a lot of good items for meat eaters also."], ["Wendy T.", "First, top rating for their service :)  The Cookie Monster and I wandered in around 8:20pm on a Sunday, not knowing they closed at 8:30pm (oh dear)...  And we were still welcomed with a smile and explanation on how things worked :).In Houston, Fadi's gives you the choice of three sides (or you can do 6 half-side portions), but here in Dallas, choose the Sultan's Sampler for $14, and you can have a little of everything!  And I mean everything. Spinach hummus and spicy hummus won't do it for you? Well you can add a scoop of regular hummus and red pepper hummus as well!  They have a bunch of salads and pasta salads, and my favorite is the veggies section. Try the roasted cauliflower :D  The plate comes with one meat though, so choose wisely-- they had chicken, fish, and lamb shank laid out, but you can ask for schwarma that they'll go and carve for you.  Lamb shank was very tender, but schwarma always makes my heartstrings sing~ ^^  The pita bread is tender and warm, and the wheat one is slightly sweet, yummy!  To-go boxes are available right beside the soda fountain for you to bring home your inevitable leftovers. Whether you're looking to fit some greens into your diet, sample different things without breaking the bank, or just crave fresh chewy pita bread, step on into Fadi's! ^^"], ["Saga W.", "We'd never been here before and I'm so glad we gave it a chance! My husband and I both had the sampler, and it was well worth the money. The lamb and fresh pita bread were perfect! Love the Mediterranean/Middle-Eastern vibe."], ["Moe G.", "I love Fadis! I've tried different Mediterranean restaurants,but Fadis is the best! Them food is so fresh and healthy. I've got sampler platter which is a simple portion of many different dips,salad,veggies,rice and meat. It was a beautiful plate!! My wife got special which is smaller. it is three choices of whatever you like and one meat choice. After we done eating we ordered hot tea with mint and Turkish coffee and of course the yummy baklawa. The service always excellent! People there are so friendly! Everything was excellent!!"], ["John L.", "Fadis is consistently good.  For a quick and healthy meal, drop in for some salad, hummus, fish, or lamb.  Just grab a tray and make your way down the cafeteria style line.  The hot pita bread and hummus are hard to resist.  Save room for some fresh fruit juice or baklava with your meal.  Make your selections quickly though, or you will get evil stares from staff and other customers."], ["Stephanie K.", "Delicious at a good price!Most of what you get is amazing!My recommendation: Shawarma (Beef/ Chicken) sandwiches at $6.99 , Hummus  with unlimited pita bread, TABOULI!!!!! ( I'm always a fan) and kabob!!!I would say those are priced well. The buffet is pricey for me only because I can't eat alot but if you can, Go for it!The atmosphere here is great- clean, helpful staff and beautiful decor.Veggies were fresh, crisp, and delicious. I would say this place is a 4 star."], ["Cat N.", "Fadis is okay in my opinion. I had their gyros a few years ago and thought they were okay. I recently came back to give them and I still think they're just okay. I love Andalous in Las Colinas so sorry. This place's spicy hummus is nothing compare to Andalous. I got a gyro sandwich with spicy hummus to go. It was expensive. They gave me a full side to go when its obvious that I cannot possibly eat the whole thing. I grabbed a few chips to go with my hummus. The tzatziki sauce at Andalous is also better. I'm biased."], ["Peter C.", "My first time trying mediterranean food! Let me start off by saying my diet is basically protein and carbs and more protein. I didn't know what to get so I got the sample where you get three choices of any salads, rice, and sautéed veggies and one choice of meat (wish it was the other way around). Everything tasted good but I'm looking for a high protein meal. Greek salad 3/5Rice 4/5Sauteed zucchini 3/5Lamb 4/5I saw that they had sandwiches that fit to my appetite and macros so I'll come back to try that."], ["Connie P.", "Review is for takeout food, only. My friend visited me in the office during lunch last week and I ordered from Fadi's for us through Postmates (shameless plug [I work for them], but y'all should try it, it's a God send). Less than an hour later, my Postmate delivered us this amazing spread. I got the vegetarian sampler (comes with a Greek salad, 3 types of hummus, cous cous, pickled veggies, and other deliciousness I can't really describe) & a side of falafels. My friend is a huge meat & potatoes guy so he chose a 1lb of gyro meat & roasted potatoes. We both loved our food, it was huge portions and just super affordable, I think this whole meal was about $23. The potatoes are some of the best roasted potatoes I've had in a long time. I also loved the gyro meat and veggie sampler. I'm a salt fiend, as in there was a time in my life where I carried salt on me to put on things - but I do think the gyro here is pretty salty...I liked it but others might not take to it as easily. Also, I think we could have done without the falafels, I've had better elsewhere, but I don't fault Fadi's for it. You can't shoot 100%, 100% of the time, can ya? ;)Order from Postmates and you won't have to wait in the long lines, apparently it gets pretty busy during lunch time. I'll have to stop by for dinner one of these days and check out the atmosphere."], ["Margaret B.", "There are also a few Mediterranean Restaurants located in DFW, usually in a strip mall, close to a church or a Home Goods store, they are pretty common.  Fadi's however is not common.  You can get all your favorite things like hummus, falafel, kebabs, pita bread and stuff ala carte like in a cafeteria but my favorite item is their schwarmas.    They fill you up just like an Avenger (from the movie....did you see the part at the very end?) and you'll be moaning because it's just too delicious to put down."], ["Nina D.", "This is really a 4.5 star place.Fadi's is very good food that is authentic too! Good service.First of all, it is kind of buffet style. So you go down the line and request what you want. This makes for a quick and casual lunch.Seating/atmosphere are casual too. It's a bunch of people scattered. I saw a lot of people eating alone or in pairs. It would also be easy to pull together a few tables for a larger group. In general, this place is easy going.I prefer the beef shawarma sandwich ($6.29). I've also gotten the dolmas (4 for $2.99) which was very good and the tabbouli which was perfect. The baklava was good too, but a little on the pricey side ($3.98 for two pieces). It was an ok amount of food."], ["Beth K.", "Didn't like the hummus, except for spinach hummus, which was disappointing. But otherwise meal was good. Had veggie and falafel platters. Great falafel. Even 7 yr old loved it. Great rice. Salads good, especially cucumber salad. Steamed broccoli and fried potatoes were a hit with the kids. Great atmosphere for family with little kids."], ["Dave G.", "My first experience with Fadi's was disappointing. The food was too loaded with olive oil. It was not long after they opened a few years and I wrote them off. My loss. Fadi's produces an excellent Mediterranean buffet. Platters of hummus, baba ganoush, tomatoes and cucumber salad with feta. Warm pitas fresh from a traditional domed oven. Delicious roasted meats. A good shawarma. A great deal for terrific food. You will have enough to take home."], ["Alex Q.", "Not going to lie: I come here for the fried cauliflower and the always warm pita bread. Oh and the basmati rice. As a vegetarian, I like coming here knowing that there'll always be tons of options to choose from. And no matter how much I try I ALWAYS get full before half my plate is gone. You know what that means: LEFTOVERS.Summary: Come for tons of food at a decent price. Try the cauliflower."], ["Brett R.", "Good Spot!  Great Food!"], ["Nicole N.", "I love Fadi's SO much!!! I wish they had one closer to Midcities! I've tried other Mediterranean places around the area and they just don't compare to Fadi's! They're portions are huge, and everything is soo delicious! It's also super cheap! Roasted cauliflower is so flavorful, you'll forget you're eating vegetables! Garlic sauce is to die for! Everyone is super nice, but be warned it can get a little crazy during lunch rush. Come here and your stomach and wallet will be happy!"], ["Ida C.", "Terrible experience! The worse hummus I ever tasted. All salads were very sour, exaggerated!! I'd tasted great Mediterranean food (greek, arabesque etc) and this one were horrible to my taste. I give One star because  the dessert were excellent!"], ["Michael H.", "I went by this place and was worth every dollar. The food was fresh for the time of day. I went around 3:30 p.m. and usually at any restaurant they start to slack up until the dinner crowd but this place did not. The meal I had was very healthy. I would say the cumber and cabbage was tasty. I will be back. The sampler had me stuffed."], ["Hell O.", "My friend took me here for the first time.  It was delicious!  Everything was so flavorful! The chicken was yummy, so tender and flavorful! Portions are huge.  I can my leftover home and save it for another meal. Definitely coming back!"], ["Jen M.", "Not sure if this location is under new management but the service is HORRIBLE. We came at a time when there was hardly anyone and it took almost 50 minutes to get our sandwiches. When our first two came out the lady reached to take our number and we had to inform her that we still has two more to go. Only then did the kitchen staff get started after standing idle for the last 40 minutes. To top it off, the restaurant was probably around 95 degrees inside. We've been loyal Fadi's customers for over 10 years but after this, will never return to this location again."], ["Harry P.", "I am a Vegan.  So I get Hummus, Tabouli, Greek Salad, Cabbage Salad, Spinach and Mushroom Salad, and several kinds of Beans.  I love their cooked Eggplant and Cauliflower.  It is a healthy feast for me.  Others can get  the Meat, Fish, Chicken, Falafel.  Soup, 3 kinds of Pita, 4 kinds of Hummus, 5 cooked veggies, many drinks.  Beautiful room and tables with a north view.  Friendly service although mostly self service."], ["Katherine M.", "Welcome to Mediterranean cafeteria-style heaven!  Large selection of dips, vegetables, sandwiches, and meats.  Excellent option when you need a quick meal.On your first visit, it's a little overwhelming; it's one of those where you walk in and think \"wait, what do I do?!\".  The menu is on the wall immediately when you walk inside.  Don't worry about it this time - just grab a tray and tell the staff member serving hummus that you want a sampler plate.  Follow the line (cafeteria style) and point to the things you'd like to try.  After checking out, sit somewhere where you can view the menu and process it as you eat so that you can order accordingly next time."], ["Mandy K.", "I crave Fadi's on a weekly basis, and I have not been disappointed yet.  The flavor of their food is delicious, well developed, and different from everyday food.  My taste buds awaken from the first to the last bite."], ["JT H.", "Mediterranean cafeterias seem to be popular in Dallas. This one was busy and the food was displayed beautifully. I tried a Greek salad and it was delicious. The balsamic dressing they put on it was very tasty, tangy and mellow (without the overpowering vinegar taste). We both had Shawarma sandwiches. I opted against the pickles on mine. I have yet to find a decent gyro in Dallas, but this place comes close.Pleasant music, friendly staff, good food, but a bit pricy. No regrets - we'll be back."], ["Jared K.", "My wife and I have been to Fadi's over a dozen times, and I always get the same thing: the beef shawarma sandwich. This time, however, the cashier said it was actually a beef/lamb combo and always has been. I was fine with the meaty duo if he was correct, I was just a bit taken aback. Despite the cashier's insistence, I have my doubts about the accuracy of his assertion. Confused, but undaunted, we also ordered our usual side dish of hummus and pita.Fadi's fresh homemade pita bread is amazingly fluffy. It's always warm too. The hummus is incredibly creamy, and is definitely the best I've ever had. It's packed with flavor too, more than you'd expect from chickpeas.My shawarma was crisp on the outside with tender slices of meat(s) beneath. The accompanying side of yogurt-based sauce adds a great flavor. All of the pickles give this sandwich a nice crunch, but the tomatoes don't add much of anything. I guess I need the vitamins though, so I won't complain too much. Pro tip: forgo the yogurt sauce and spread hummus on your shawarma instead. The added creaminess and combination of flavors is spectacular!We got a free slice of baklava for checking in on Yelp. My wife usually gets embarrassed by my use of Yelp offers, but she was more than happy to sample the baklava this time. At her behest, we got the walnut variety rather than pistachio. The baklava was very sweet, but sort of dry. I liked the walnut flavor though. Oh well, it was free.This wasn't the best I've had at Fadi's, but it was still a very tasty meal nonetheless."], ["Jayci G.", "Cafeteria style Mediterranean food - huge variety of salad choices and meat to order. Desserts are all the typical variations of baklava to expect. A great spot to go out to eat and not go crazy off of your diet - there's something for everyone here."], ["Mad I.", "Been coming you for years.  And always consistent. Good food service"], ["Nina V.", "Food is delicious and large quantities. Fadi's sampler is more than enough for two. Good is super fresh and healthy."], ["Gina Q.", "The service is awful.  They don't even have half of the items that they advertise in their website menu at the restaurant. They don't tell you the real price for their food on their website either. The people that serve you the food either hate their job or are just mean. Whenever you ask them you want more of an item on your plate they get mad and will put only a little bit. They want you to fill your plate only with the cheapest things like rice and couscous. The meat is very bad quality and with not even half of the options that they claim they have on their website. There are much better mediterranean places than this Fadi's here in Dallas. They charge you almost double of what they posted on their website. You can see the dishonesty of these people from just that (price differences) and how much they hate serving customers."], ["Angela S.", "First time at a Mediterranean place and I enjoyed it. I got the special during lunch which came with three sides, a meat and pita bread. Everything I selected was good and the stuff I didn't select looked good as well. I would definitely go back to try out the other items."]], "Flaming Cheese Saganaki": [["Jeanette A.", "Went here today with my eating buddy my daughter we are from Michigan where the style of the Gyro is different the pieces are thicker cut not thin and crunchy like bacon strips I had never seen Gyro done like this at all. I ordered the Original Gyro Platter my daughter ordered the roasted pepper feta cheese appetizer and a Gyro Sandwich. The appetizer was pretty good but when we got our food my daughter looking at me I'm looking at her because we wonder why is it that our meat looks like crispy bacon strips and it taste crunchy I guess if you never know any different you will think this is good it wasn't! Its just like I never knew authentic Mexican food until I ate at some of the places here and the other places I ate at I thought it was good now I know better. We should have had just the flaming cheese its hard for that to not be good but we both agreed we wont go back.but the place is very clean nice inside and really nice waitresses."], ["Susie H.", "This place has been imported straight from Greece!  Authentic in every way.  Started off with the flaming cheese (which is a must) and had a gyro salad.  My cousin got the Olympic platter and it was fantastic and enough for dinner tonight!"], ["Drew H.", "So impressed with this place. Took a chance (because it's in a sketchy strip center) and visited with my wife and 6-month old. Food is fantastic. As is the ambiance. I had chicken and pork skewers; wife had grilled chicken salad. We started with hummus. Everything was fresh and incredibly flavorful. Plus...they had a Turkish beer, and I love places that have beer native to the food. Owner greets everyone as they walk through the door and checks on each table. I also noticed him dancing happily behind the bar to the music playing. I hope this place makes it, because we want it to become a routine for us!"], ["Phebe S.", "Very nice inside, great food and excellent service. I got the gyro platter and it was so good! All of our food was delicious. The baklava cheesecake is to die for! The staff were so, so nice. Can't speak highly enough of this place."], ["David W.", "This is one of my favorite Greek spots in the Dallas. I've been to Stratos and others, but this is definitely my go to spot. Their prices are extremely reasonable and my kiddo loves their chicken gyro kid's meal. The fact my kid will eat here only makes it easier to come back as she's somewhat a picky eater.I always get the Olympic Platter and I'm always full and stuck with leftovers when I'm done. The gyro is fantastic, the pork tastes great, and their potatoes are delicious. On top of that, it comes with a fantastic sausage as well!The rest of my family usually sticks to souvlaki pita's (kebob sandwiches). I've had 'em here too and they're great.We'll continue to come back."], ["Timothy N.", "All in all it was just okay.  I ordered the gyro plate and they had cut the up into little pieces, granted they were warm.  No Greek green beans or orzo.  If they had them I missed them both times."], ["Danielle W.", "Great place for Greek food!  The chicken kebob was delicious.  Grilled and very moist.  The Greek potatoes was a good side item and the tzatziki sauce with pita bread was a fav.  The decor is kitschy but clean.  Service was nice and I will return."], ["Kevin P.", "Gyro meat was very good, which is hit or miss most place, and the portion was large.  The lentil soup was excellent.  I only tried a couple of things, but everything I did try was excellent.  I will definitely be back!"], ["K M.", "I'm late posting this but this little treasure was a nice find. Being from NY we can get good Greek food almost anywhere. I've been in the DFW 8 years & this this the best I've found. We got ours to go so a couple of airholes in the to go container would have made the food keep better.  My bread got chewy from all the steam but the food was good. I will try again. Next time I want the flaming cheese. That looked interesting. I've never seen that done before."], ["Nan M.", "This place is unassuming yet so tasty! We shared the flaming cheese which was fun to watch as our server lit it and the flames shot up! We also shared a Greek salad which had fresh ingredients, then we each had a gyro with homemade pita. We will be back!"], ["Kellie K.", "Y'all, this place is so good. I mean I only had two things here but I can tell how authentic this place is. I had the classic gyro sandwich and it was easily the best one I've ever had. I also had the traditional potatoes which were so flavorful and delicious! The tzatziki sauce was perfect. Not to mention, the staff there is so friendly. There was a man there, I'm assuming he's the manager, who spent his time checking on people and just making sure everyone was happy with their food and their experience. Don't let the location of this restaurant dissuade you from visiting. I will definitely be returning!"], ["Pamela B.", "Great food! Excellent customer service. In the words of The Terminater \"I'll be back\" in all seriousness we really enjoyed everything we ordered."], ["Ann S.", "It's great to find such a unique welcoming cafe. Unique decor, friendly attentive staff. The moussaka was delicious along with a Greek salad.  Chain restaurants are never as good. Thank goodness us travel warriors have Yelp so we can locate a gem like this!"], ["Caroline S.", "What a little gem on Forest Lane. Absolutely the best Greek restaurant I have found in Dallas thus far. The interior is so pretty and well decorated. Giving it such a quaint and authentic feel. The food was phenomenal. First off, you must order the flaming cheese, name of the restaurant, and it's absolutely delicious! Such a surprise! My fiancé had the chicken pita which was so thinly sliced, it was super yummy. I had the gyro Greek salad the the gyro meat was excellent along with their homemade Taziki sauce. To top it off we had their baklava and it was to die for. Well done Flaming Cheese, bravo! I will return with many a more hungry tummys. Thanks for sharing your love of food with me."], ["C. C.", "Drove by this place all the time and wanted to give it a try.Services:- the servers were super nice and friendly attentive Ambiance:- layback and family orientedFood:- the flaming cheese appetizer was super cool- the pepper chicken dish that my finance order was amazing- the traditional dishes that I ordered was kind of blend Probably will revisit this restaurant and order something different"], ["Tessa M.", "This place is excellent!! I drive by on my way to work everyday and decided to have lunch here finally. The vegetarian dolmas were delicious as well as the classic gyro sandwich. There was plenty of meat inside the sandwich and the tzatziki sauce was some of the best I've tried. I highly recommend this place not only because the food was perfect, but the service was great as well!"], ["Tila O.", "Delicious!! I got the classic gyro plate with rice and my Mom got the Greek salad with gyro meat. Both were so fresh and tasty! Their tzatziki sauce is creamy, which I like. And both plates came with warm pita bread on the side. They give generous portions and at a reasonable price. Not only was the food good, the servers were courteous and attentive. We also enjoyed the soft guitar music they were playing. We will be back for sure."], ["Linh P.", "Their food is so tasty and their service as well. I can say that Baklava of them is the best around Dallas. Better than all Turkish or Greek restaurant that I ate before. Before I often ate at Afrah restaurant but now I have my new station. I will be back to try all their food."], ["Gary S.", "Great food and service.The best in town.The flaming cheese was fantastic.Before or after you go to Statos come here and you'll be a fan!!!"], ["Kirsten O.", "I am so glad I stumbled across this place.  This is by far my favorite hidden gem for Mediterranean food."]], "Baboush": [], "Zoes Kitchen": [], "Kostas Cafe": [["Tc H.", "I haven't been here in years and wow I've missed all of it. Jody gave great service and was very perceptive. The food was possibly the best multi course meal I've had in 10 years or more. Crab claws were out of this world! Veal was tender and pan fried, cut thin in an awesome lemon sauce. Can't say enough as I very rarely give 5 stars to anyone. This place is a must must must visit. Quaint, personable service and amazing food. Thank you all Kostas for a great time. We will be back real soon. - Clif Hunter"], ["Diana P.", "very very good Greek food for DallasCame here with another couple and was pleasantly surprised.I got the gyro and it was very yummy and HUGEThe baklava was too sweet for me so i only had about halfGlad I tried it!"], ["Liz S.", "Just wow!  Never in a million years would I have stopped here to eat unless a friend told me it was the best Greek food in town. Although it doesn't look like much from the street, Kosta's offers a cozy dining environment with friendly staff and fabulous food.Whether its during lunch or dinner, week or weekend this place gets PACKED! The food never disappoints no matter how many people are there or even if you are taking it to go.Although everything is good, a personal favorite is the avgolemono soup and the gyro sandwich. The soup is a staple and they do it well and the sandwich has the best gyro meat I've found in town."], ["Janet S.", "Went here may 9 2015.i thought it was excellent. I hsd the combo plate.Everthing was really tasty. Salad to die for. Love Greek food.Waiter was pleasant.Will go again next time I visit  dallas."], ["Julia H.", "Great gyro plate! Moussaka was okay-have had better. No lunch menu available which was disappointing because it's a little pricey for a quick lunch date but the food was quite good! And their tzatziki sauce might be the best I've ever had!"], ["Rich C.", "This is like home for us! Authentic Greek food in a cozy restaurant. I've been going here for over 20 years and have never been disappointed. I spent lots of evenings in Greektown in Chicago and this is a good! If you're not sure what to order, get the combo plate and try a few things.  My favorite menu item is gyros on pita bread at lunch, and moussaka at dinner.  We often call in and get it for take out at lunch, since it is often busy noontime."], ["Douglas M.", "Staff was great.  The Gyro plate was fair.  The meet was cut thin and was very crispy.  The pita bread was placed under the meat and would have been soggy if the meat wasn't so crispy."], ["Kim N.", "Cozy, low key, quality Greek food. Go here to settle in with a bottle of wine and some hummus while you ease into dinner. The greek style sole I had was perfectly seasoned and slightly crispy. The lamb was cooked to a rare at request and an incredible deal for the price and quality. The owner and waiter were gracious and efficient despite a packed house on a Friday night."], ["Rosie F.", "Been looking for a while for a good Greek place.  Gyros are my favorite. I used to go to grip near northwest highway but they didn't do too well in that area and the hours cut down along with service. The ambience is bland but who cares, the food is great. The Gyros at kostas are fantastic. The potatoes they come with have this lemon seasoning that's great too. I'll need to try the other items on the menu if i can refrain from ordering the Gyros...which I can't..."], ["Mel B.", "Love love love this place. So romantic. Great service. Great food.  Love the flaming cheese."], ["Una B.", "Great Greek food in an unassuming building! Honestly, a few of the times I've driven by, I thought this building was abandoned but the positive yelp reviews and my curiosity got the better of me and I tried it out for lunch one day. So glad I did!!We started with hummus that was smooth and balanced. Paired with their pita, it was so, so good. I stayed simple and ordered a gyro lunch. The meat was so tender and flavorful, the pita was soft and pillowy, the sauce a nice balancing condiment. Ugh, it was so good I couldn't stop eating it until it was gone. My plate came with greek potatoes that were tender and pretty tasty as well. To make this great lunch meal even more memorable, the table near us got the cheese appetizer they light on fire and it bursts in flames - right behind my lunch companion. The sheer terror in his eyes was all too much for me and I couldn't stop laughing for quite some time. He yelped like a wounded puppy and nearly fell out of his seat. (He still swears all the hair on his neck was singed off)Awesomely hysterical. Awesome, tasty food. Fantastic break from my work day!"], ["Jared K.", "My wife and I have talked about trying Kostas Cafe for years now, but this was our first time inside. Overall, I wasn't very impressed. The blue and white decor was very Greek, though extremely dated. They are in dire need of a Restaurant: Impossible makeover. There wasn't much of a lunch rush at 12:30 on Saturday, so we had no trouble finding a table. The first thing that caught our attention were the dirty tablecloths on our table. Kostas had only been open for 30 minutes thus far, suggesting that the soiled linens had been there for quite some time. Not exactly appetizing.We started with an appetizer order of hummus and pita. The pita was warm and tasted homemade, as did the creamy hummus. There was a good amount of garlic to the hummus. It was all really tasty, but there wasn't near enough pita bread to go around.My entree was a gyro plate, which apparently comes with green beans and potatoes, as well as a Greek salad.The salad was really good. It was loaded with fresh, green lettuce and plenty of feta. The dressing was really light, the perfect combination of oil and vinegar. I'm not really much of a salad person, but this one was very enjoyable.I usually like green beans, but the ones that came with my gyro plate weren't very good. They were big, flat beans and tasted canned. The potatoes had a decent flavor, but were a little too al dente. I discarded both of my side dishes after the initial tasting.As for the meat, it was tasty but oddly crisp. I'm guessing all of my slices came from the outer layer of the spit. I much prefer thicker, tender cuts of meat. The pita bread that comes with the gyro plate is somewhat thicker and fluffier than the appetizer version, which worked better for the gyro. The tzatziki sauce had the consistency of tartar sauce and had far too much dill. Rather than continue on with the unsatisfying tzatziki, I loaded my gyro meat up with the leftover hummus from our appetizer course.Our server was very friendly. That being said, he refilled my glass of iced tea after every 2-3 sips. I appreciated the attentiveness, but it really jacked up my sugar ratio.I really wanted to like Kostas Cafe. There were certainly some positive aspects about our meal, but the devil is in the details."], ["Lindsay F.", "Gyros were really good, salads were huge. The inside could use a little update but I think they are going for the \"Grandma's house in Greece\" feel."], ["Emily C.", "After living within walking distance of Kostas for a few years, I finally decided to give this little Greek restaurant on Greenville a try.We were greeted by a very personable server who took care of us throughout the meal. There seemed to be just maybe three waiters working, but with such a small restaurant, it was fine. Our waters were kept filled and food came out fairly quickly. Great service overall.We were started with warm bread and butter, crusty on the outside and soft on the inside (just how I like it), followed by the salad that came with our entree plates. The salad was a good size, fresh crispy lettuce with plentiful feta cheese, and I enjoyed the garlicky dressing it came with. I tried the chicken souvlaki, which was perfectly tender without falling into the common pitfall of being too dry. It came with a side of okra and rice. My fiance got the gyro plate, which ended up being served with the potatoes instead of the vegetables stated on the menu - no problem though, since he ended up liking the potatoes a lot more. The plate came with a lot of tasty meat, but the highlight was definitely the pita. It was so soft!I'm no Greek food expert, but I do know what I do and don't enjoy, and Kostas is definitely one Greek place i DO enjoy."], ["Jessica D.", "Had my first date here...this place has the best food in town! The chicken lemonato is to die for!"], ["Edward F.", "3.5/5 good food, ok service, ok location. I recommend it, it's like home cooked food.Small place"], ["Victoria S.", "My six-year-old is an emerging foodie, and when he tells us he's craving something, we cave. Last Friday it was spanakopita and gyro. Our usual place closed over a year ago when the owner decided to retire, and we've been searching for a replacement ever since.We tried Kostas Cafe based on solid Yelp reviews, and we weren't disappointed. The basics:1) Logistics. The place is tiny. Our family is a party of five with three kids in the mix. We know better to hit places during peak dinner rush for seating accommodations and for the comfort of other diners. (We're not stupid!) We were running late last Friday, but we didn't have a problem getting seated at 6PM on a Friday night, which was shocking since the place is tiny. By 7PM the place was humming, and there is absolutely no waiting area. You walk in, and if you can't get seated, you might as well walk out.2) Service. This was our second visit with about six months in between visits. We had the same server both times, and she is absolutely outstanding. She is a broad and comes off like one. At first you might think she's rude, and yes, she's brusque, but she is kind, funny, efficient, and helpful. And she didn't bat an eyelash at our traipsing in on the front end of the dinner rush with my three tired, bedraggled kids. That always scores points with me.Both times we were at Kostas Cafe, the owner was on the premises making sure guests were comfortable and happy with their food. He really seems to stay on top of his business.3) Food. Vampires beware. The amount of garlic in the food at Kostas Cafe would ward off vampires in all of Texas, its border states, and possibly across the Gulf of Mexico. But to our family, that's a good, good thing. We opened with a trio of spreads and pita bread. The trio included tzatziki sauce (duh!), hummus (duh!), and an eggplant spread. I don't know what to call the eggplant spread because it's not like any babaganoush I've ever had, but it was delicious. Their tzatziki sauce is thick and creamy. (I hate runny tzatziki.) Their hummus is not as smooth or thick as some that I've had, but I loved it because of the garlic factor. We had to get seconds on pita to devour all that spread. There wasn't a drop of any of those three spreads left.On to the gyros. Warm pita piled high with lamb, and the onions, tomato and tzatziki are on the side so you can dress your gyro as you see fit. Yum. The gyro platter comes with two sides, and I don't know if they change from day to day. Last Friday the sides were Greek style green beans and potatoes. Yum. And even before you get to your gyro platter, you're given a choice between a salad or cup of avgo lemono soup. My husband had the salad, and it was huge for a pre-dinner salad, and they don't skimp on the feta like some places do. I got the avgo lemono. And it was good.I can't speak to the other menu items, because my family won't ever be able to get past that trio of spreads and gyro. But we have found our gyro home for sure! We'll definitely go back! Definitely recommended!"], ["Ian F.", "Fantastic food. We had the chicken plate I would highly recommend! !!! Also the pita bread is wonderful"], ["James O.", "Atmosphere is scary when you first enter, but the food is alright.  A nice little gem to eat at."], ["Mario C.", "Hidden gem! Highly recommend the veal lemonata and the freshly baked pita +tahini appetizer."]]}