{"India Palace Restaurant & Bar": [], "Astoria Biryani House - Dallas": [], "Mughlai Restaurant": [["Kevin P.", "I'm pretty familiar with north Indian food and this is pretty good.  The service was attentive and courteous.   The only reason this isn't a four star review is because there's no rice served with the entreee, and there's nothing in the menu to tell you that.Overall, good and rich food."], ["Eric G.", "Went to Mughlai for the first time this afternoon and had the buffet. It's already topped my list of Indian food in the DFW area. My girlfriend and I are both vegetarians and there were lots choices for us on the buffet. Everything is clearly labeled as vegetarian or non-vegetarian. The flavors were great and everything was hot and fresh-tasting. My only complaint is that it' snot closer to the downtown area. Can't wait to go back!"], ["Amar P.", "If you don't mind long Disney like lines this is this place for you. BE WARNED - they don't have a FastPass option. Food is so so. Staff is good.  Mgmt is unhelpful."], ["Natasha M.", "I'm not sure how this place has good reviews. The food was mediocre and very overpriced, and the service was very slow."], ["Suzie M.", "Some of the food is good but I question the quality and the service and management ruin the experience.  Will never dine in again. Also, most of these 5 star reviews are posted this way :You're seated,  place your order, then you're handed an iPad with Yelp review of the restaurant pulled up. They hand it to the customer and ask you to post a review while standing and waiting for you to complete and hand back.  Now....if you're like most of us,  and you know they're responsible for what you're about to eat,  you post something great.  Only problem is,  that it's not GREAT, but all these reviews say they are.  The saag paneeer is good. Any meat dish is 50/50. Meaning,  I've had my last wonky chicken from Mughlai. I don't know how old that meat is, but grisly fatty wonky chicken that's been covered in Indian spice is not what I want to eat! After a dozen times eating in and takeout, I'll have to find another place,  have given Mughlai my business for the last time."], ["Annie N.", "Thought:  If you don't know how to make a cocktail, don't put it on your signature list...   This dining event was a few old friends catching up, with good food..                      Didn't quite turn out that way..The food was decent.  Honestly, I would have preferred Indian food from one of those mom and pop places.  This place lacked the comforting feel and taste that mom and pop places offer.  The only amazing things was their naan that had soft cheese in it.  And now the topic at hand.. MANHATTAN.. the cocktail..When it was first sipped, it tasted light.. kool-aid light.. and anyone who's had a real Manhattan, knows its shouldn't taste like that  EVER!!Timidly I mentioned to the server that the cocktail tasted off, as if there wasn't any bitters added.  She said that if the drink wasn't right, to send it back.  And timidly, I did.  Unfortunately, it tasted the same.  By in which the server goes on about liking strong drinks and she likes to get tipsy.  I mentioned, its a martini.  It doesn't taste right, it was missing something.  By and which I simply ordered a glass of wine in place.  She later comes up to me to say that i was on point.  Moments later the manager comes up to me to offer to make the Manhattan -again- ..(awkwardly)..I agreed to it.  Once its made, he asked me if I was from New York, I say Connecticut (to me this shouldn't really matter).  And this is where this gets interesting.. He says that he must've add \"too much cranberry juice to the Manhattan.\" I said you add cranberry juice to the Manhattan?!  Then he follows there are different recipes.  After that, I'm in shock and decide that theres really not much more else to say after that.  No point.      The tab arrives, I am charged for the cocktail.  ALSO there is a gratuity charge for my group of five (most restaurants charge a grat for 6 or more).          Needless to say, I will not be dining at this watered-down Indian restaurant nor partake in their false advertisement of a Manhattan, and false sense of customer service."], ["Aaron D.", "EXPENSIVE.. BUT GOOD.We only had takeout, so we cannot comment on the in-dining experience. Overall opinion, good food, but very expensive compared to most Indian restaurants.Pros:- Best Indian we have had in our 2 months in Dallas.- Rich sauces, full flavored- Nice location if you are dining in- Decent amount of chicken in dishes- Good real pakoras. Too many places frying onion strips and calling it pakoras. These were actual pieces of vegetables.- Free gulab jamunCons:- Most expensive Indian I have ever seen. I have probably eaten at 30-40 Indian restaurants across the US and in Europe and this place is at least 25% more expensive than any of them.- Rice not included with dishes... dishes that are $3-4 more expensive than most Indian places that include rice.- $5 for a side of rice? This one blows my mind.Overall, I have to give this place the benefit of the doubt because of how good the food was, however, I am not rushing to order there again because I am not convinced the food is good enough to justify spending $20-30 more than the just-OK Indian restaurants closer to us.If you are looking for a nice restaurant with good Indian and go into knowing the prices, you will enjoy this place. If you like cheap, good, no-frills Indian food, this probably isn't going to be on your short list."], ["Tufail Z.", "Went to Muglai yesterday with my wife and other two friends. Last time my experience was really bad when I ordered tandoori items. Yesterday We changed our menu towards curries and the server helped us what to order. The food was ok but loved chicken biryani which was spot on. Will come back"], ["Deepa S.", "Love their food and great buffet..I gave them rating of 4 instead of 5 for two reasons:1) the nan served during buffet is cold and extremely soggy, bad quality but the rice is really good..2) bit pricey for Indian restaurant and they donot serve nan bread or rice with entrees during dinners.. Most of the Indian places even expensive ones do .."], ["Yathrik N.", "I Just had been to this place for a lunch buffet,  the ambience is great, service is prompt and good, price is affordable but the most important thing FOOD is not up to the mark. The number of options is way too less compared to other indian restaurants. The desert menu is overly priced and the deserts available with buffet does not look fresh and tasty. Overall,  if the concentration is diverted on to food rather than ambience this could be a lot better place to eat for the price. Given the option I might not return as there are many other restaurants which serve great food, if you are not particular about the ambience."], ["Sonia S.", "Have the Saturday lunch buffet. The buffet selection is limited but the short menu does not imply low food quality or taste. The food was full of flavor and they had some really good choices. The kachori was one of the dishes I liked most amongst the other appetizing dishes, reminded me of the food in India. The servers were very amicable and provided great service unlike some of the other Indian restaurants I have visited in the past."], ["Kristina Z.", "We finally tried Mughlai tonight. The skinny- roll up to the scene. Nice place. A little too bright. Wish it had the ambiance and romantic mood lighting like India West (without the crazy $$$). Ordered kebab apps and they come out in record time andwere delish. Service slowed down after that.Orders finally taken but food slow to come out and no attention from waitstaff for long periods of time. Drinks came out slowly. I do have to give props to the Indian Uncle behind the bar. Awesome mixologist! I'm Indian myself and can say that when you find an Indian restaurant with a full bar with decently made drinks that's rare. Three stars for good food (small portions though) lamb kebabs, chicken tikka and paneer."], ["Sabeeta M.", "The ambience and service at this place is good, however the food is just mediocre. We ordered vegetable samosas, murgh makhni, and murgh tikka masala. The food was not flavorful, and their spicy was mild at best. I did like their mango lassi, zeera rice and roti, which was sadly the best part of our meal. The location is pretty convenient and there are plenty of parking spaces available in the complex."], ["Adesh R.", "Finest Indian restaurant in Dallas ... Excellent food and great service . We were with a 8 month hold and the server offered to help with our kid while we ate dinner . Just the thought was a very kind gesture ... A must go if u r in Dallas"], ["Dhananjay M.", "Went there for lunch buffet today. Their a la carte is good but lunch buffet is bad. The starters but the main dishes are not good. The price is also on the higher side.I would jot recommend going there for lunch buffet."], ["Richard B.", "I had the lunch buffet...I am by no means a professional of indian cuisine. This is the best tasting I have eaten. very nice location, gourmet quality food. a little bit more expensive ($16.00 for buffet and a drink) but its really good***Several items are very spicy...Be careful if your not into that. some of the spicier items I have had on a buffet (I liked it...Bring on the heat)"], ["Lou K.", "So glad we found this place.We have been seeking a really good desi curry since we moved to Dallas and not one dish from this place has disappointed us.Every Friday for the last 2months we've ordered take out from here and each week tried something new. I cannot recommend any single dish as each one has been as good as the other.We dined in once recently when we had some friends in town. Service was good dining room is pleasantly decorated.They are pricier than some competitors however that is reflected in the quality."], ["Xochi R.", "Excellent restaurant, my husband and I have tried most Indian restaurants in the DFW area and this is by far the one with best quality and cleanliness. Location is not the most pleasant (located in a plaza) however it doesn't feel that way once you go inside. Saturday and Sunday buffet is the priciest we've found $14.50 per person but yet hey do offer great variety and well prepared dishes so it's worth it. Other locations may offer more to choose from but standards will be lower. We've been dining here for about 3 years and is our go-to spot for Indian food. If you're having buffet during the weekend go over around 12:30 pm to make sure you get the freshly prepared dishes. My fav dishes are, chicken Biryani, Dal Makhni, chicken Murgh, all paneer dishes, Kashmiri pulao, kheer and pretty much everything! Catherine is an excellent server, best we've had here so far."], ["Bradley B.", "Delish food and great service every time I go. I've had the chicken tikka masala and chicken vindaloo--both were great. My one complaint is that the red wine was served too warm. Should be 5-10 degrees below room temp. I will not be ordering wine there again."], ["Hea S.", "Good clean food! I personally loce indian food. And there are some places that are not so clean. This place.. is clean.. amd the food is good. Food.. you can tell that its made with good quality. Spices are just right. Not too strong with fresh ingredients.  Presentations are good and restaurant atmosphere is great too. I would totally recommend!"]], "Meerut Kabob House": [["Sean R.", "WOW WOW WOW WOW WOW! This place is truly as good as it gets when it comes to Indian or Pakistani food. My brother and I tried this place on a whim, and it went to my #1 Indian/Pakistani food joint in the greater Dallas area. I believe my brother was equally impressed.This place, without a doubt is a hole-in-the-wall. But like most food lovers, we know that's usually a sign of good food. The owners are extremely friendly, it's all family run. The go to there is Karahi Chicken for myself and Korma Chicken for my brother. You can tell that mom is the one whipping it all up in the back and it tastes as much! Tasty, very spicy, but overall AMAZING. I now eat here once a week!"], ["Heather M.", "I really enjoyed this hole in the wall. The food was delicious, but some of it was very spicy. However, if you can take the heat, try it out!Other than stares from other customers like you're an alien, this place is quite quaint. The staff was polite and got our food out quickly. Mostly bottled beverages, but most small places are like that. I'm definitely coming back!"], ["Kevin P.", "The paneer masala was very good and my girlfriend enjoyed the chicken tikka masala.  The whole wheat chapati were very good, but they were out of the paratha and samosas, so no appetizers or sides this trip.Rice is priced separately from the entrée, and the small is enough to make a meal for one person, with some to take home as well.There are no fountain drinks, just canned pop and a few bottled drinks.  That means no free refills, which would have been nice.The paneer masala just as it comes, was a good bit hotter than I expected.  It was tasty, but very spicy, a little more than I was looking for at lunch today.There are several vegetarian options on the menu.  For the carnivores, there's chicken, goat, lamb, and beef.  There are halal options as well, if your religious practice requires that."], ["Adam G.", "This Indian/Pakistani restaurant is hidden Gem if you're not from this part of the city.  I found this place by pure luck, and I'm so glad that I did!!!  :)  The restaurant seems to be family run type...but, don't let this deter you from checking this place out.  The place isn't fancy...but, their food is outstanding!  Since I'm a Vegetarian,  I decided to try their Aloo Chana, (Potatoes & Chickpeas dish), the dish was DELICIOUS!!!  I would definitely would recommend this dish to ALL of my Vegetarian Brothers, and Sisters.  In addition, I accompanied this dish with an awesome Mango Lassi, (it's made with Mango, and Yogurt), very tasty, and it compliments this dish very well.  Note:  It will help the people that love spicy foods...but have sensitive stomachs.So, if you're close to the North Dallas/Love Field area..., please do yourself a favor and try this hidden Gem!!!"], ["Manuel T.", "WOW! This place is great! I had the butter chicken and the chicken biryani rice and they were so good I didn't even have time to snap a picture. With that said, the place could use a freshening up. Maybe just some professionally printed menus on the wall and a brightening up of the interior. Also, if you're considering dining here keep in mind that they apparently make everything fresh so you'll be in for a small wait and should order beforehand if you are taking it to go. This place is really too good to pass up based on looks."], ["Sip B.", "Great little place that serves some fresh and tasty indian dishes. Fresh because they don't make it till you order. The kebab rolls here are awesome! And the rotis (flat breads) are also amazing; they're romali style -- thin and large. Highly recommended! NOTE: Avoid the Meerut in Carrolton. For some reason, it's not quite the same. The quality at the Carrolton Merrut is suspect and the menu items seem to be prepared differently (e.g., the kebab rolls are made with naans and not that great tasting). Why is this Carrolton location worse? I have no idea."], ["U S.", "Come for good taste, if you are in to looks then go somewhere else or take it to go. They do large orders for take out catering."], ["Kaia V.", "If you're looking for some hallal grilled chicken/kebab meat in the Love Field area, Meerut is a fantastic option. I got a chicken kebab combo that came with 6 succulent grilled pieces of white meat chicken (boneless), about 3 cups of buttered/flavored rice, a huge piece of bread that was kind of like a tortilla (not naan), and a small salad of raw carrot and white onion pieces. It also came with two small containers of a yogurty sauce. I was disappointed only by the sauce - it was too watery to even get to stick to anything. The chicken was amazing. Super moist and well seasoned to be a tiny bit spicy but not overbearing. Given the prior review of the biryani, I wasn't expecting much from the rice, but it was also great if you like salty buttery things (hard not to). My total for the combo was $10, which I think is a steal. The location is in a little strip mall with an army navy store. It's not a fancy place. They have some tables and chairs, and offer canned soda and water to drink. I got mine to go, and will definitely be back for a repeat performance."], ["Laura K.", "Had dinner here tonight. Chicken tikka masala, chicken biriayna, goat curry and roti.   All were delicious, freshly made, full of rich flavor and staff was very friendly.   Far better than average Indian/Pakistani  cuisine.Decor was basic, and even slightly run down, but definitely give it a try if your in the mood for great Indian food... not if your looking for enchanting ambiance."], ["Simal A.", "Hands down, the best Pakistani/Indian restaurant my family has ever had in America. We're from California and we have tried a lot of Pakistani/Indian restaurants and this one blew them all out of the water. We got the beef kabobs, chicken biryani and boneless chicken tikka. Amazing. Will be back the next time I'm in Texas."], ["D'man D.", "It is a small Indian/Pakistani restaurant just minutes away from the intersection of Royal Ln. & Harry Hines.It doesn't have a extensive menu but covers all the essential ones to make it a good lunch selection. It has a decent size seating area, nothing special, with about 6 rectangular picnic-style plastic tables and decent chairs, and a TV with Pakistani channel playing.Tried their Chicken Biryani, had to say I was kinda disappointed for not that it didn't taste good but it was not Biryani. Anyway, whatever it was, it tasted good. Seems like they mixed chicken curry with separately FULLY cooked rice...just didn't feel Biryani-like. Also, the chicken pieces were very white and it was boneless which is very uncommon in Biryani and the presence of ripe tomatoes in the mix giving the mushy consistency was a big-no for Biryani.The amount of food was really a lot, good enough for two people and it was accompanied with great tasting raita-like sauce and the desi-salad: carrots, lots of onions and a slice of lime.There was a decent-size lunch crowed, seems like they have pretty good kababs and other items but Biryani not-so-much. With small size and modest lunch crowd, it felt like food items are made fresh here unlike most of the Indian restaurant where they keep days old curry-base and use it as long as possible. It also felt like it is a family run with helpful staffs and is definitely a nice option to have when in mood for Indian/Pakistani food."], ["Shahbaaz A.", "Really good authentic Pakistani food. Their grilled items are amazing. More of a order and carry out kind of place"], ["Paige W.", "Absolutelyyy DELICIOUS! Stumbled across this HOLE IN THE WALL while shopping for furniture on Harry Hines... Soooo glad we got to eat here. Its not at all fancy or great looking on the inside, if we lived in the area, we would probably take out from this place all the time. Literally the BEST paki food i've ever had. The meat was so clean and so damn well cooked. We ordered chicken palak, chicken tikka masala and chicken boti. The chicken boti was fantastic- perfectly cooked and well seasoned- great grilled chicken. The chicken tikka masala was the same chicken boti chicken cooked into the creamy sauce. Yum. And the chicken palak was spicy chicken cooked in spicy spinach. Also great taste.The rotis were fresh and so large. Definitely only recommend ordering 1-1.5 per person. Can't wait to go again if we're on that side of town!"], ["Hetal P.", "I took out from this place. It smelled very yummy when I walked inside. Nothing to mention about the place itself. My alu palak  was tasty and came with small salad and raita which were very good,  however it was dunked in a cup of oil. So unless they can make food in less oil I am not planning to voluntarily sign up for a heart attack."], ["Babar K.", "This place is the best kept secret in town, It is my go place for lunch. I love their Fried Keema and Nihari. You must try their Bun Kabob. They do not have naan but their ulta tawa chapati is the best. Staff is very nice and friendly. Prices are a little high on side for this type of food but still manageable.This is because they do not cut corners when it come to food, fresh ingredients makes all the difference. Also portions are big. It is small cafe in the heart of Harry Hines and gets busy during lunch time it is best to preorder."], ["Casanova K.", "Best authentic Pakistani/Indian kabob house in all of Dallas.  Try their specialty Dagha kabob (beef) and you will be addicted after the first bite!"]], "Southern Spice": [], "Spice In The City Dallas": [["Nevets B.", "Again, for those looking for something a little different...  Think Indian Fusion.  Think Food Truck inside a building (they also do catering and have a regular meal plan).  Spice in the City offers a small, casual environment for lunch.  The owner is a nutritionist so the portion sizes are very reasonable.  Their menu isn't cluttered and they offer a good variety.  They quality has been excellent.  Spice in the City has become one of my regular go-to places for lunch."], ["Tiera H.", "Using their catering for corporate meals and we had a tasting today. Everything was AMAZING!!!! The curry chicken salad is the most delicious salad I've ever had and they make it in a wrap as well with sweet potato fries. Everything I tried was so tasty and impressive. Very happy with their service and in love with the food! Definitely going to sit down at the restaurant for my next date night."], ["Dai T.", "I always get Tikka Masala with Shrimp and sometimes I'll add Garlic Ginger Turkey Dumplings.  LOVE THEM!  THe naan is slamming!  The Grass-Fed Beef Steak and Saag Gosht is pretty good too.  I had family visiting and ordered Tandoori wings and they were a hit.  We are from ATL...so I think our wing judgement is pretty damn legit!  Trying mango lassi next.  The Saag Paneer is pretty good, but it definitely has a slightly different flavor than I expected.  Oh and did I mention they deliver!!!  Enjoy!"], ["E K.", "Food was tasty... As others have said the portions are tiny for sides... The chicken tikka was big enough for one person... I enjoyed everything I ordered except for the mini samosas, which were kind of bland... Saag paneer was great but tiny... pulao was also very good and small... Delivery time was reasonable and food arrived hot! I appreciate what they are trying to do here... Having organic and gluten free options... Prices are fair for the quality... I'm sold"], ["Eden B.", "The food is healthy, organic, and as local as the owner can get his hands on! Delicious India dishes with a modern twist, as well as a relaxing atmosphere make for a fabulous dinning experience. The downtown employee discounts, and delivery are perks too!"], ["D M.", "Not only is the name catchy, the food is delicious.  Be prepared to be fed healthy,  well rounded, high quality food, not stuffed with a large amount of inferior quality food.  I had the chicken tikka masala with raita & garlic naan.  I have had to drive out to Richardson/Plano to find this kind of flavor.  The customer service was beyond fantastic.  I could'nt find the place & was unable to get through on phone to get directions.  They then called me & made arrangements to deliver my dinner.  Delivered by a friendly person, I'm guessing maybe the owner or manager.  Well he asked me to let him know how everything was?  Everything was great & I can't wait to eat here again*)"], ["Lillian W.", "I feel compelled to warn people away from this place.The food is not good. It has no grace or subtlety. FILLED with salt and A HEAVY-handed use of heat, this food  is not a representation of Indian food. Worst Tiki Marsala in the world. Terrible recipe. We can only compliment the plain naan.  Even the desserts tasted stale, were too small for the prices and just were not good. We felt ripped off after we picked up food from here. AVOID."], ["Walter B.", "Shrimp tikka masala was excellent.  Palau rice and the regular naan as well.  This restaurant is primarily designed for delivery or takeout, but there are a few small tables to eat-in.  Prices are very reasonable.  Only criticism is that the food is served in \"to go\" containers even if you eat-in and it creates an unfortunate and unnecessary source of waste."], ["Joy L.", "I got the organic chicken tikka masala and was disappointed. It didn't have any of the creamy and slightly sweet spice I've come to expect from chicken tikka masala. The naan was hard in a chewy way, difficult to tear and dip to the maan and equally difficult to chew. I would hesitate to go back again."], ["Jasmine L.", "We ordered Spice in the City Catering for a Bachleorette Party.  Navin was great over the phone, explaining each appetizer and how it would be presented, even offering suggestions for optimal serving.  The flavors and freshness were amazing!  We ordered every appetizer on the menu, plus some naan and raita.  Navin was very gracious, even though we were running late on Friday afternoon.  Will order from them again and again!"], ["Alisha Y.", "LOVE LOVE LOVE this place! I live in the DP&L building and have the honor of knowing the owner/chef personally and he's the full package when it comes to business owner, dietitian and chef. The food options and proportions are perfect. I highly recommend eating here for all of your Indian cravings. They also have an amazing Sunday brunch delivery menu! :-D"], ["Kathryn N.", "The food was great but the experience was uncomfortable.  We went right after it opened a few months ago.  The dining tables and chairs were cheap and rickety.  The thing I really object to is all the plastic! Plastic segmented plates with plastic cover. Plastic cutlery in plastic.  I felt guilty."], ["Mr B.", "At the Magnolia hotel across the street and ordered for pick up. Organic spin on Indian traditionals. Saag paneer was nice - not as creamy as the usual version so the spinach came through. Wings were great  - grilled with a yogurt sauce, lime and a dip that was just hot enough. Naan was good as well. Owner was cooking and justly excited about his restaurant concept. Nice meal for $10!"], ["Umang P.", "This is not a typical Indian restaurant setting. It's a take out place. Food to go kind of lunch and dinner box system. They should somehow let customers know. I just ended up parking car and wasting 1|2 hr."], ["Hunter R.", "Yall I don't normally eat spicy food and I don't really use yelp, but the food I just had, chicken tikka masala with garlic naan and pulao, was so freaking good. Honestly I cannot wait to come back and have more. Oh and my friend got the cottage cheese pakoras...to die for."], ["Shane L.", "My office had them cater our Friday All Staff lunch. It was the first time we used them. It will not be the last. Everyone loved the food. Everything was fresh and delicious. I can't wait to go eat in the restaurant."], ["Sendai B.", "OMGAH YUM!  Soooooooo glad Navin opened this to-go Indian restaurant.  Ever since Taj Express closed down I have had to drive 5 hundred billion miles to Meadow & 75, or to Preston Road for my Indian cuizine.  Spice In The City is in the most perfect & convenient location if you live or work downtown.  They use such fresh, small cuts of chicken in their chicken tikka masala and it is cooked to perfection.  The spiciness of the dishes are just right.  The mini potato samosas are the best I've ever had & almost too cute to eat.  Tried the raita today & was not disappointed.  The chocolates are so pretty I want to wear one around my neck on a chain.  LOLThank you Navin & Andrew, for bringing Spice In The City to our location!"], ["Jayneil D.", "Simply amazing healthy Indian food!I took my date there on a weekend and it was great. Navin the chef was so courteous and nice. We ordered paneer tikka masala, garlic naan and samosas. We loved the food and ordered it again. The best part is that its Indian food but its prepared completely in a healthy and a diet conscious way. I want to eat delicious food but at the same time make sure that I maintain my physique. Most of these recipes navin uses have been passed down from his family. So home cooked food! I would definitely recommend checking spice in the city out!!"], ["Maylin M.", "I am a new downtown resident and was so excited to hear there was a new Indian food restaurant place open.  I had the Organic Chicken Tikka Masala, Garlic Naan, Raita and the featured Pulao. Everything was delicious, the portion size was perfect, and I could really taste the freshness of the ingredients. I appreciate a restaurant that his health conscious and Spice in the City Dallas is just that. I can't wait to go again and try new menu items."], ["John P.", "I was in town and stopped by for a healthy lunch. All organic meats. Everything was made from scratch and the taste was amazing. The Organic Chicken Tikka Masala was excellent. There was a rich tomato flavor and just enough kick. The Pulao's carrots, peas, nuts and raisins were all very fresh. By the time I got to the Raita I was getting stuffed. I did save room for dessert though and enjoyed the refreshing Mango Lassi Drinkable Dessert. Will definitely have to come back again."]], "Cosmic Café": [], "Masala Wok": [], "Vindu Indian Cuisine": [["Sandra K.", "Great place for a lunch buffet.  I go there often with a friend because there's a wide variety of delicious Indian food to choose from at a reasonable price."], ["Arun V.", "THIS IS A PUBLIC SERVICE ANNOUNCEMENT:This restaurant probably deserves two stars for the food. If they pass this off as Indian food, I feel bad for the folks paying their hard earned money to eat here. Indian food deserves way better representation that what is being offered here.I would never review a crappy place like this. However, I just want to let all you food lovers know that the owner is a jerk. A couple of waiters told me that the owner is extremely cheap. When the customers leave tips by way of a credit card, they (the waiters) NEVER see a dime. If you were to leave a few dollars on the table, the waiters better get to it.....or the owner snatches it. I read a couple of reviews where the service level was being commented on. This explains it. Why would anybody work at a place where they make ZERO TIPS? If you don't believe me, please talk to the waiters here, they are nice people.If you absolutely must eat in this crappy restaurant, please do so! But PLEASE PLEASE give money to the wait staff when you leave, do not leave money on the table and do NOT use your credit card for tips.THANKS!!!!!P.S: I don't work there.....!"], ["Arhez D.", "Sooooooo disappointed.. I ordered the ras malai for a group of people and we couldn't even take more than one or two bites. It was GROSS. Tasted like armpit with a whole bunch of Indian spices (don't ask how I know what armpits are)Never again"], ["Amee M.", "The food is really good but also very very expensive for what you get.  Buffet is probably your best bet.  We will not be returning.  The worst part of your experience will probably be terrible service.  The hosts have NEVER been friendly and are borderline rude.  I cannot stand a restaurant with terrible customer service and unresponsive management.  The food is not good enough to get stars because your service needs to back your food and represent the business.  I would rather drive further to mayuri in las colinas to get really good food and excellent service, than to go to Vindu which is down the street.   The staff seems to have high turnover, so that says a lot about management.  Indian restaurants are notorious for not paying their staff enough and now showing appreciation for their staff.  I smell that here.I would be willing to check things out again in 6 months to see any improvement.  But for the last year and a half, eh."], ["Stephen E.", "I've had great delivery food from here before. But the 2 biryani's I had yesterday were awful. No flavour, the most disappointing i've ever had. If you want a serving of boiled rice with boiled chicken thrown on the top then this is the place for you."], ["Katina D.", "I honestly didn't expect this place to have good Indian food but the restaurant surely proved me wrong. The portions were pretty generous as well! I haven't eaten the lunch buffet yet but am hoping to pretty soon.The service and atmosphere is very friendly. I will be back very soon!"], ["Abenator I.", "Good food , generous portions and service ... The biryani and the Andhra curry are very good"], ["Sneha P.", "Great service friendly and fast on a busy night. The prices for the quantity of good were also great. Food was average in original flavor, good though just not great or   memorable. I may return again for try another South Indian dish, not northern."], ["Chaitanya K.", "One of the decent restaurants when it comes to options in the buffet. The chilly chicken is splendid. The have a wide spread of south indian tiffins. The biryani was good but not great. Coming to the desserts, nothing is exceptional. Might go back if had a chance"], ["D M.", "Ok, it's been awhile since I've been here, I moved to downtown Dallas.  Well I realized what I have been missing.  The buffet was phenomenal, cooking was perfection.  Spiced just right & full of flavor, every dish I tried was mouthwatering.  Fresh, abundant  & so clean.  Nothing comes close to this quality in Dallas, was well worth the drive.  Nice service, though I wish they had better tasting iced tea, however the food was sO delicious, I can forgive this completely."], ["Txaguas W.", "Living in Ft. worth I've been trying to find decent Indian food for a while now...not much on the west side of town. I ate lunch here as it was close to a business meeting.  Lunch is buffet style and there wasn't a huge assortment of meats but what they did have was very good. You can't go wrong with a buffet lunch for $10.00"], ["Janice C.", "I went there for the lunch buffet. Let's start with the food, the taste was pretty good. It was def more spicy than what I've had before, but Vindu's was recommended to me by people who know more about authentic Indian food.The goat curry was very nice and tender and yummy! I would def recommend this!But the rest of the food was really cold.. It was lukewarm or just plain cold... So I don't know that was up with that...The service was pretty good up until we paid... The cashier asked me \"where you are from?\" I didn't realize what he was asking, so I answered with \"Richardson\" but he was asking about my ethnicity... I'm not someone that calls people racists, but honestly, there are way better ways to ask that.... Especially if you are of a different ethnicity as well... 3 Stars on the food and everything about this restaurant."], ["Jason S.", "Indian Buffet with a very good selection.It it not a very large place, but they have they have a good buffet.  When I walked in, the aromas of the food permeating throughout the place made me quite eager to dig in.The quality of the dishes were what I have come to expect from Indian buffets, but Indian dishes hold up reasonably well to buffet style heating/holding.  Mildly spicy, but at least there was still a hint of spiciness that some places might lack.The buffet came with some fresh dosa.  They had an abundance of chutneys, including ginger chutney, coconut chutney, tomato chutney & others with names I didn't recognize.Gulab jamun were pretty dense and didn't soak up syrup that well, but the carrot halwa had a lovely flavoring of cardamom & the mango custard was tasty as well.They have wines, beers & lassis available to order.The service was friendly enough, and made sure I had plenty of water & dishes kept getting picked up, which is all that a buffet really needs._________________Conclusion:This is the place that I like to frequent when I am craving an Indian Buffet because it is both near my home, and the buffet always seems to have goat curry!"], ["Aja B.", "A co worker and I stopped in for the lunch buffet and I typically don't care that much for a buffet but this one was pretty darn good. I have not had many Indian dishes so the buffet really helped in me exploring new items without feeling wasteful. All the food was fresh and well stocked. The buffet and restaurant was super clean which was a huge plus. I loved that everything was well seasoned and had a bit of a kick! The potato samosas were out of this world good! I loved the variety of sauces and chutney. Staff were pretty friendly and attentive ... I will be back! Yummy food at a GREAT price..."], ["Ashley C.", "This is one of my favorite Indian restaurants. The chicken tikka masala is aromatic and complex, and the naan is always perfectly blistered and piping hot. I've had very different experiences over the years here--a few months ago I came and the waiters almost never came to our table. But, last time I came, the server (Josh I think?) was super attentive and friendly. Another improvement I've really appreciated is that they serve the food less spicy, but they provide a relish on the side for if you want to add more of a kick. Nice alternative.Definitely will be back and hope they continue on this upward trend!"], ["E T.", "We went for the lunch buffet.  Lunch was good.  They had a nice selection.  The tikki masala was good and also the butter chicken (typically what I normally eat in an indian restuarant).  I did try some of the other selections and they were good as well.  We had our 2 kids with us and all the food was too spicy for them to eat. Even the tandoori chicken.  It was a little on the dry side anyhow.  One of the servers brought us out this crepe dish with curry pototes inside.  My one son was able to eat the potatoes and the  server was nice enough to get us some more the potatoes for him.Good service.  Decent food and selection."], ["Blair W.", "This was a pleasant experience. The service was great, the waiter recommended a lot of vegetarian options to us, and they were consistent with their drink refills. We got the vegetable masala and the vegetable biriyani with the garlic naan. Their portions were more than enough for us (two people) and we even took some to-go. The food was flavorful and we enjoyed our orders very much."], ["Jennifer P.", "This restaurant is my favorite for an Indian lunch buffet! Unlike other places I've been to, they have a lot of variety. The food is also pretty flavorful and some dishes are spicy as well. Lunch buffet items range from favorites like chicken biryani, chicken tikka, dal, chili chicken and others. They also have a delicious fish curry on certain days. And don't forget the freshly made naan!! Price is $10, can't beat that! Save some room for dessert - they have yummy gulab jamun and rice pudding! Staff is very friendly and attentive. The owner is super nice too. I can't wait to return!"], ["Sonia S.", "Got a groupon for dinner at this place. Food was really good. We had the goat curry and mutter paneer (peas and cottage cheese). We were starving after a long, hectic, adventurous day, I am glad the food came out fast. Relished every bite and has quite some leftover for the next day. The spice level was just right."], ["Aaron S.", "Went last night with a Living Social coupon.  This was our second visit in two years.Food was excellent.  Tried the \"Bread Basket\" which had a Naan, Garlic Naan, and Roti.  Also had the Masala Dosa which was a giant ( and I mean like a foot wide) crepe stuffed with potato and veg curry.  Very tasty.Entrees were shared with my wife and sister in law.  We split a spinach and cheese curry, lamb masala and chicken koorma with some rice and more naan (they love naan here...)Everything was very tasty.  It's really helpful if you know what spice level to get for yourself and others.  My wife is not a spice fan, so a quick google search showed that she would like the Koorma.  Personally I normally get Vindaloo or Masala and pray I can enjoy it before I start feeling the burn.  The Masala is excellent if you're starting out and you can handle your spicy food.Spinach and cheese was very mild and had the consistency of creamed spinach.  Wait staff was very friendly and attentive.  I really need to come back and visit the lunch buffet."]], "Kalachandji's": [["Nav S.", "I love this place! Great ambiance and great food!It's a buffet with all you can eat salad bar, 2 to 3 vegetable specials, curries, rice and special items like pasta, lasagna, dhokla, ildi, vada, etc.Desserts are good as well.But the most awesome part is that they make everything in house. Even the bread! And everything is VEGETARIAN! NO MEAT, NO EGG, NO ONION or GARLIC! WOW!"], ["Kinjal S.", "Not authentic indian food Basic indian breads are not served . And They have turned a worship place into total business . Disappointing"], ["Andrew K.", "I found myself here with a friend on a whim, and I couldn't be happier about it.The buffet is chalked full of delicious vegetarian, Indian delicacies. You can check out the menu online, but it's absolutely worth the trip even if you don't know what will be there on a given day. It's hard to go wrong here!The atmosphere is also really enjoyable overall. There's a quaint little courtyard where you can eat, but be wise about when you plan on eating out there, especially in the summer. It's all very inviting. You can dress casually, and you'll still feel right at home.It can be a bit confusing about how to get into the restaurant if it's you're first time. If you park in the back lot, just walk around to the front door to the West part of the building. It's absolutely worth the trip! Check it out!"], ["Jo P.", "This place is truly a diamond in the rough. Nestled in what looks like a residential neighborhood is a Hindu Temple that also houses this other-worldly restaurant. I thought I knew Indian food, but not quite like this. The buffet featured entirely vegetarian dishes that simply utilize whatever fruits and vegetables are in season. I enjoyed the experience of being completely transported outside of Dallas, TX inside the luminous walls of this gorgeous building. Fifteen dollars per person seemed a little steep for a buffet with no meat though, but that was the \"suggested donation\" that came on a green bill, so that's what we each \"donated.\" Knowing that it's going towards the upkeep of such a gem makes it all worthwhile."], ["Adam G.", "Luckily for me since I live in the White Rock Lake neighborhood, I come to this wonderful, and peaceful place to eat whenever I work from home.  The food is very good, and freshly made...but, this food isn't very spicy as you would expect it from traditional Indian food.  Don't get me wrong, the food is good...just don't come here expecting the strong, and bold flavors of India that's all I'm saying.  Whenever the weather is nice, I love eating out in their patio.  The ambiance is just very soothing, and serene...giving me a peaceful joy as I eat their food.  In addition, the staff at this establishment are very friendly, and serviceable giving your experience a sense of perfect harmony."], ["Abi G.", "An absolute Dallas must. Sometimes I have no idea what I'm eating, but it's always delicious. There's quite the vegetarian-friendly variety and always a fresh salad bar.Pro tips: They bake bread in-house. You MUST grab a slice or two. The cinnamon bread is so soft and sweet-- it's more dessert than bread.Second pro tip: Go for the tamarind tea. Sweet, exotic, perfectly refreshing on a hot day.My only nit-pick: Wear pants if you're going to sit outside because there is a small fountain that mosquitos LOVE."], ["Jim S.", "Very interesting place. It is located inside a temple, so the environment is definitely very unique. Food is served cafeteria style, where you go up to the food line and just pick and choose whatever you want for your meal. All of the dishes here are vegetarian, which is perfect for some but may be lacking for the meat lovers. Regardless, they offer enough to satiate those with the deepest stomachs.Since it's a buffet style, I would recommend grabbing/trying everything a little bit. I liked the curry style/tofu, and the meatball substitute looking things, which contained really nice smelling/tasting condiments/herbs. But again, I would just say try everything out.The place where you eat is really cool. It's like an open, outdoor ish area, with a huge tree in the middle of the courtyard. You sit around that big tree in booths or small tables. I would say it is very peaceful and serene. Good conversation place!"], ["Valerie Y.", "This place is fantastic!  I've been going here for years, now--and it's always a great place to bring new people.  Kalachandji's is a vegetarian buffet located inside of a hare Krishna temple, so not only do you get delicious, healthy food, you get awesome service with a smile in a super cool setting.  Definitely check out the temple while inside, and when it's nice enough sitting outside in the center of the temple is the way to go.  The gift shop is also a guilty little pleasure that you can pick up some incense or scarves or any other kind of curios they sell there."], ["angad s.", "I love coming to this place for a quick meditation session and a nice vegetarian meal. This place carries a lot of authentic indian dishes that are healthier than most of the indian restaurants carry. The staff is also very friendly and helpful. I would take my family and friends here any day."], ["Mary D.", "Delicious food! It's in the same building as the temple and it looks so awesome! The outside patio is so pretty and relaxing. Can't wait to come back again. Highly recommend and great place to take people out for laid back but interesting place."], ["Anye F.", "If you're nervous about eating inside a Hare Krishna temple, don't be.  The restaurant areas are very clearly restaurant and there's nothing uncomfortable about it.  You walk in the door and there's a sign pointing to where you enter the restaurant.  You enter right at the buffet line, where there's a white board listing the dishes of the day in the order they appear on the buffet line with \"spicy\", \"dairy\", \"vegan\" clearly marked.A lot of the veg-only Indian food places I've eaten are the southern style - lots of dosas and very ultra spicy curries, but the curries here were more similar to what I get at other places, sauce wise.  The okra + potato w/ coconut curry was my favorite, followed by the tofu curry.  There was a nut loaf that was the token non-Indian dish of the day, it was really tasty as well.  I should add I normally actively dislike buffets, but this was great.Trying a little bit of everything in the hot line pretty much filled up my plate so I skipped the salad bar (I can eat salad anywhere).  I also skipped the really great looking fresh bread, though next time I need to be pickier and leave some room for it.  It was all great.  I didn't miss the meat at all.  Most of it was not particularly spicy, the dal and the tofu curry had little bits of hot pepper in it but they were avoidable.  The tamarind tea is really nice but you can also drink ice water or hot teas.  They will come by and refill the tamarind tea and water several times throughout your meal.I was completely stuffed after my one plate but really wanted to try the desserts.  These aren't on the buffet but they will bring them to you.  When I went there was kheer and a blueberry halva which had a texture more similar to bread pudding than the carrot halva I've had in the past.  They were both great.Definitely eat in the courtyard.  The weather was nice when I was there but they also have heat lamps above the table so they'd be comfortable in slightly colder weather as well.  It's a lovely courtyard.  There are also plenty of indoor tables.The bathrooms were clean but a little tight.  You pay at your table, they will split your check if you want.  Tip generously because they feed the poor for free. (You should always tip generously anyway, but their generosity should be extra incentive).The menu changes daily so I'm looking forward to trying them again and seeing what other delightful dishes they can make.  Too bad it's such a trek from where I live."], ["Brittany S.", "Mesmerized. Transported. Heavenly. Just a few of the words that come to mind when I think of my experience at Kalachandji's. What started out as a Yelp search for vegetarian eats turned into an evening ooo's and ahhh's thanks to the beautiful temple and gardens that make this eatery unique. Kalachandji's is not only a restaurant but a sari store and temple (that appears to serve as a venue). Food is served buffet style during both the lunch and dinner hours. Dinner was only $13.95 for unlimited eats (including drink and dessert). Note that dessert is separate from the buffet and served at your table. My recommendations from the bar include the chaan soup and sesame rice. Not that everything else wasn't wonderfully delicious. Oh! And don't pass up on the blueberry rice-ish dessert - it was quite sweet and the texture reminded me of grits. Finally, whether you're a fan of Indian eats or not, this place is worth the visit for the beautiful courtyard that is open to nature and filled with lush green plans and shaded booth tables. To top it all, service was both friendly and attentive. Wear your stretchy pants."], ["Susan L.", "Friend took me there for the vegetarian buffet dinner. Just fabulous!  I met the chef who was so kind and proud of his dishes.  The salads were fresh,  curries and sauces, beans, lentils all creatively prepared.  Excellent service too!  Sat near a huge beautiful tree which added to the zen atmosphere of the place."], ["Hillary G.", "Best place ever. Vegetarian, vegan, and gluten free options. Not to mention delicious."], ["Sharde A.", "I'm not so familiar with the desolate lands of East Dallas, so driving around here was both eye opening and confusing.  In the depths of a sea of decrepit houses there is a remarkable Hare Krishna temple both warm and inviting to those that do practice and the many that are eager to learn.The actual vegetarian restaurant within Kalachandji's isn't that intuitive to get to.  The entrance immediately leads to the beginning of the buffet that is pretty small and cramped.  I was expecting a grand buffet because I'm a genuine fat arse, but this was limited and humble.  I got myself a nice bowl of dal and steamed mixed veggies (the typical broccoli and carrots).  There was a huge tray of baby bok choy right next to the basmati and brown rice.  In a corner sits papadum and soft homemade cinnamon bread that tastes incredible!  The other part of the buffet is a bunch of salad and olives that I decided to pass on.  The only entree like dish was some kind of enchilada hybrid that had rice and corn in it.  Suspicious but good.  Apparently they always offer an International dish on the menu besides Indian food.There is indoor seating but you need to sit outside in their courtyard because Dallas completely disappears when you are there.  Soothing music plays while water ripples at the center fountain.  Don't wear a dress because your legs will surely be eaten alive.  Incredibly pleasant waitresses come around to refill drinks and offer dessert that is part of the buffet price.  This was my first time having fluffy, sweet halvah and I am in love.  I had it combined with vanilla sweet rice which turned out to be amazing!I thought I was going to leave hungry given the size of the buffet, but it was a really good lunch.  Check the website for the current menu and happenings!  This place is so refreshing from the busy and materialistic life plenty of us live."], ["Sip B.", "Quality healthy vegetarian. Best vegetarian I've ever had."], ["Joe C.", "Very nice, warm and inviting. Great food, Thank you!!"], ["Kathy H.", "Delicious fresh vegetarian food and salad bar in a beautiful setting.  Setting in the temple for a bit is relaxing. Very friendly staff is helpful in answering questions about dishes."], ["Devin Q.", "Came here after having a nice walk on the trail with some friends.  One of them recommended this place, so we decided to give a try.  We arrived about 2pm on a Saturday, and there was a bit of a line, but it moved quickly.  This place is a vegetarian buffet inside a temple.The options were limited, but there was still plenty of food out to make a great meal.  Lentil soup, steamed veggies, an amazing potato and okra dish, chickpea curry, white & brown rice, bread or papdum (I think that's what it was), and a decent salad bar.  Included in the price is also tea and dessert.The seating area was pretty full, but started clearing out and we were able to grab a booth.  There is also a beautiful courtyard, but it was a little too warm to sit out there.  I was to rave on the potato & okra dish, it was just so flavorful and the okra was surprisingly not slimy.  They were nice enough to announce last service if we wanted anymore food, the close at 3 on the weekends.  Service is sort of spotty, one server refilled our drinks once during the meal, and towards the end we asked another server for dessert/checks.  I was a little disappointed in the salad bar; the lettuce was brown (the spinach was fine) and many of the toppings were empty.All in all, I will definitely be back and bring friends.  For the price, its one of the better vegetarian options in Dallas."], ["Sherri G.", "A really cool experience. It's inside a gorgeous temple tucked away in a residential neighborhood. The room across the hall has some sort of music and perhaps dancing, I would go back just to check that out (take your shoes off and leave them in the shoe room if you choose to explore). There is both inside and outside seating. If the weather is nice, take advantage of the courtyard, it's so peaceful.The food is all vegetarian. It's not as spicy as other Indian places I've tried, though if it's still a little much for you, the tamarind tea helps cut the spice. It's cafeteria/buffet style with a flat price, so you might as well try everything. However there is no price posted. I did not think the food was anything special, but I would go again for the experience and to check out the rest of the building."], ["Donna F.", "Who knew BBQ tofu could have been so yummy?    This was a recommendation for lunch from a friend with tattoos and a motorcycle just give you perspective on how it can appeal to those presumed to be carnivorous.    What a treat!!"], ["Chris S.", "I hit the temple for lunch at least 3-4 times a month to get my veggies on. The atmosphere, with the center outdoor patio, the smells of incense and the hare krishna people you might encounter chanting and serving is all part of the experience for most, but honestly I just like to go enjoy the food. You can check their web site for the daily menu, but it's usually the same type of stuff. Indian-inspired vegetarian made with local produce and served in a buffet style. The \"Suggested Donation\" of $10.95 covers dal soup, salad bar, the hot items, bread, papadam, tea and even dessert (they usually offer rice pudding or a fruit/  nut halva, but you can also request a fresh, warm, home-made ginger cookie). You can also get in and out pretty quickly (if you want), so it's not a time commitment.If you're seeking something different, try it out!"], ["Shella C.", "Always wanted to check out this place so I decided to go for a saturday lunch. Man, I definitely made the right decision. First of all, it was hidden in some east Dallas neighborhood inside of a temple. Talk about hidden gems, this would be one of them.Walked through a door directly into the buffet line and they had plenty to choose from. I had lintel soup, two kinds of rice, spinach stuff, curried chickpeas, some tofu thing, and a side salad. The salad bar had all the veggies and then some, as well as 4 unique dressings to choose from. Given that I'm a carnivore a majority of the time, I was pleasantly surprised by how flavorful the food was. My favorite part was the atmosphere. After we got our food we decided to go to the courtyard area. This place is adorable with beautiful decor, good seating, central tree of life, and a water feature. I could sit out there all day."], ["Jon F.", "The food here was great, even if there is no onion or garlic. The kitchen and wait staff were super friendly.  They had some very tasty tamarind juice. All the entrees were tasty and they had a generous salad bar.  Both desserts were tasty.  I'm not even going to ding them a star for this but I never saw a posted price.  We were charged a reasonable amount but I have no idea how it got calculated.  The temple right across the hall is very neat and you should check it out if you go.  Just take your shoes off and leave them in the shoe room."], ["D'man D.", "Kalachandji 's, located inside the Hare Krishna mandir provides an apt environment for indulging in Vegetarian food prepared with ancient Ayurvedic traditions.They serve pure Vegetarian food with most items deemed kosher even for Vegans. The varieties offered is rather humble than what you'd normally expect in other Indian buffet.The location is somewhat difficult to get to but all is forgotten once you set foot inside this unique place. I even saw a small backyard vegetable garden across the street that Kalachandji's probably owns to grow some of their own food supply.The line for the weekend buffet started to form around the door before it was opened as I was entering the temple, which by the way is just across the hallway.The thing to remember is, their food is prepared using Vaishnavi tradition and thus lack onion and garlic; two very important ingredients of Indian cooking, not sure, if they use ginger as I didn't get any hint of it.Thus, it is no surprise the food lacks the depth and flavor of regular Indian vegetarian food.The buffet included a salad bar, brown/white rice, daal, steamed veggies, mustard greens, two main dishes: ocra-potata fry and tofu, papad and raisin bread made in-house. The buffet items gets rotated, so check their website, which can be somewhat useless as I found. The paneer/peas was on the menu that day and they served rather awkward tasting tofu, a really bad substitution.The tamarind water that comes with buffet is very refreshing. The food was just OK, nothing special. The okra/potato fry had unusually big potatoes and felt like something prepared with utter indifference. The sauce that came with tofu was somewhat sweet thus rendering useless for my taste. The best part was the dessert items. At the end of meal request for dessert, if they forget to ask you. When given the choice, ask for both the items. The pudding and halwa were both really awesome. The buffet area being small and always crowded is not really ideal if you want to go for additional food. The place is small, even the beautiful courtyard where you should really dine is small. There are two inside dining areas one, on the same enclosure as the buffet display and another a little inside to the right. The courtyard, albeit small, is beautiful to sit on a nice weather day. A green tree in the center provides a nice shade and has different sized booths on its periphery and one unique, raised seating section.The lunch buffet is 10.95, not bad as it includes a cool drink and awesome desserts.The service was attentive and friendly. While the food is not the stellar Indian vegetarian, in all honesty is just 3 stars, but because of the environment, unique setting, and service is worth the try, especially if you like Vegetarian food."], ["Manuel Z.", "This place is the best if you're vegetarian or want to eat healthier food. Their dishes are prepared with home-grown vegetables. Something to consider: the place is cafeteria style, so there's a self service line. That line can be long and slow, but it's worth it.Try the tamarind water :) if only once :) I hope you enjoy it as much as I do.Parking can be tricky, because they share parking lot with the temple, so sometimes you may have to park on the street."], ["Amanda T.", "Where do I start.....the food is just amazing. Even a meat lover couldn't resist this place. I love that they change up the menu too. But they always have the soup and the soup is always good. The desert is also delicious, and it's in such an appropriate portion because chances are, you've already filled up on the wonderful buffet! The staff is so sweet, so friendly, and always in a good mood. That's important to me. And the store is always filled with the coolest stuff that they actually bring in from India. And if there isn't something already going on, make sure you take a peak in the temple because it is absolutely beautiful!!!!! And the weather has finally cooled off enough to sit outside again, which I'm very happy about because their outside seating is very lovely and relaxing. It's a bit of a drive for me, but I'd go any distance to be here."], ["Naveed S.", "great food, best vegetarian restaurant around, very nice service, you cant go wrong with anything on the menu, their buffet is always delicious, must try"], ["Jason B.", "MANY caveats have to be given before i write my review-im a meat fan but i gave this 4 stars setting aside personal preference-when you go in there is both a temple and a dining area - if you are just eating you do NOT need to take your shoes off-there are some cats that roam around so if you're super allergic then be careful. i only saw one but heard there are a couple of others. very peacefulso this is part of the hare krishna temple but you can go in and eat and never realize it. i went here for a very important celebration and had no clue what thi splace was. being the fact that my food guidelines are, \"if its edible, ill eat it\" i went for the buffet. its all they have. one side is all cooked food and the other is salad bar which i did not touchthe buffet is good and nothing too crazy or too spicy. i could've had 2 more plates but didn't want to start a circle of people praying for me wondering what was wrong with by eating so much. tofu thingy was good and so was the home made cinnamon bread. really good bread actually. the nut loaf which looked like lasagna was great as well. it was all safe to eat and i think i tried every single thing on the cooked side. i wont lie i had the \"peace\" knowing church's chicken was just on the next block which i would've gone to if i was starving but i lived. dessert they ask and bring to you so that you dont put and eat all of it off of one plate. not that i'd ever do it. i promise i did not go to church's chicken after.JEANS; OK by farORDER: you just go to the buffet and they find and bill youif you dont want anything to do with the temple you prob wont even notice it."], ["Carissa N.", "This is my favorite Indian food in all of Dallas! It's inside of a beautiful temple and the people all around are very kind and peaceful. It's a buffet style, and everything is vegetarian. One of my favorites is the homemade salad dressings! They are absolutely divine! Sit in the courtyard and relax as you listen to great music and enjoy your food. The desert is great too!"], ["Grace V.", "This place was a really nice surprise. It is located in a wing of a Hindu temple so you wouldn't expect to find an amazing restaurant here but trust me, if you like Indian food, it's worth the visit! The food tastes home made and the dining space is really peaceful. Don't miss it. For about 15 bucks, you can eat your heart out on an amazing spread of food."], ["Martin H.", "An unbelievably Indian vegetarian buffet nested inside a Hindu Krishna temple. They use the most fresh, locally sourced food and the outside garden/seating area is simply perfection. Very peaceful, beautiful place with amazing food. Oh mine, I am in heaven!"], ["Michelle H.", "This little gem serves up a delicious vegetarian buffet in a beautiful Indian Temple. The ambiance is so peaceful and the veggies are spicy!! I love it"], ["Wendy S.", "Interesting little place to eat! I have never tried this place before and was a little confused about the set up. There was really no one to explain it when you walk in. You grab a tray it's buffet style. All you can eat. Food, soup and bread. They have waitresses to refill your drinks and at the end they bring dessert that is included in the price to your table. 12.90 for the whole shabang! Its cheap but a little off the grid to find. It is located inside a temple!!"], ["Kelly G.", "I have loved this place for years. Tasty, all vegetarian food! In earlier years I never had any complaint, but...I have noticed an odd trend over the last 2 years where after I eat a moderately-sized plate I am unbelievably full and bloated. My boyfriend has noticed this as well. While we like the taste of the food and the atmosphere, we are tired of feeling so incredibly full and painfully bloated after eating one plate at a buffet. What gives? At nearly $14-15/per person, we will not likely be back."], ["Madeline A.", "I am absolutely IN LOVE with this gem! The atmosphere is unbeatable--indoor/outdoor seating, lush plants everwhere, a beautiful fountain, and lovely decor/tiling/roofing that makes me feel like I'm miles away on sn exotic retreat. The staff is wonderful, just perfectly hospitable and I love everyone's peaceful, gentle disposition. The food my bf and I tried today was pretty good, not great, BUT we will still be regulars here because everything else is THAT amazing."], ["Josh B.", "The food is excellent and I eat here every chance I get. If I were strictly vegetarian, I might eat here every day and every night. If I did that, would I be healthier? Would I be more enlightened? Would I make friends with the staff and maybe see a concert with one of them some day? Perhaps."], ["Hanan Q.", "I have been wanting to try this place forever! Yes, this place is a buffet. Please do not go here expecting to have a million options like a chinese buffet. I made that mistake. I went for lunch and they had a humble amount of options. They also had a salad bar. Although there weren't many options, everything was so good. You could taste the freshness in the food. The best part was the dessert they offer you at the end before you pay your bill. Me and my friend tried the vanilla chai rice pudding, and the star of the show was the blueberry farina. If you are curious you can tell them to mix  the two and you can try both."], ["Riham A.", "This place is amazing! Location, not so much but you'll forget where you are once your seated out in the beautifully, landscaped courtyard. I am overall impressed with the service and food. I wouldn't recommend this place for large  groups only because I didn't see much seating area. Although courtyard is beautiful, it's also very small, which I love because it makes the experience more intimate. This place is a hidden Dallas treasure . I will definitely be returning."], ["Eric S.", "I haven't been here in years....  Not much has changed. Now that there is parking, it's a little easier to get in and out. The buffet was packed with the usual suspects. The sumbahr is always a favorite. The potato and okra was tasty too! I do wish they would hit all the dishes with a little more red pepper and warm things up a bit, but it was still yummy. If you have never been here, it has some interesting smells. But then again, downtown Dallas during a hot day has some pretty special aromas too. Just bear in mind that the dining area is second to none for being tranquil and the food is basic vegetarian. For kids you may want to think twice. My 10 ten year old really tried.... but he only ventured out for a salad and some rice. He tried at bit of everything we had and gave me the knitted brow \"you told me this was as good bacon\" look. Okay, I may have bent the truth a little. He did suck down the rice pudding though. The one we were ALL supposed to share....."], ["Renee C.", "If you need to get away from Dallas without really getting out of the city I recommend Kalachandji's. The environment alone is a great place to get away from the stress of city life. This vegetarian buffet offers a great selection of options. If you visit their website you can see the daily menu. ( I recommend looking out for their spinach casserole dish.. it will blow your mind). If the weather is nice I highly recommend sitting outside. When I came here with my friend the design of the outside area impressed me. The combination of the beautiful building, the tree, and mini fountain just took me to another place. When I came here to have lunch I felt the serene environment was perfect for our deep and semi philosophical conversation. The service here is amazing. The temple followers are really nice and super attentive. p.s. If you do visit please check out the prayer room to the left is so ornate and breathtaking. It absolutely needs to be part of anyone's kalachandji experience."], ["Scott L.", "The ominous mosque turrets of the mystical aged Hare Krishna temple somehow makes sense in this equally mystic low income area of east Dallas. One of the monks, who saw me trying to find a place to lock my bike, took me to the courtyard where it would be safer. Kalachandjis has cleaned up its act since my last pilgrimage.  They've revamped the buffet counters and drink station put in a new door, even the staff was more \"normal\" - accessible and friendly, just with dots and sometimes painted lines on their heads.This Hare Krishna temple slash vegetarian restaurant's new look makes it less weird so it won't scare the average Joe away, but the meals are still fresh, tasty and vegetarian. The food line up is the same - a flavorful soup, brown or white rice, vegetables and a vegan and vegetarian entree.  The vegetarian entree is always eggplant parmigiana when I come and it's good.For $9.95 you get daily fresh made bread, salad bar, hot buffet, dessert and tea.  The candy section is gone in the coolgift shop, with Indian art, jewelry and clothes, but I was informed I could getsome fresh baked vegan cookies to go.  My waiter didn't charge me.The courtyard and restaurant decor are very cute like being in an Indian animated movie set.Food - basic but vegetarian, clean, flavorful and cheap.Environs - spooky turns spectacularThere is a certain quit careful attention to detail here that radiates a spiritual ideal.They turned the knob up on a more 20th century palette which is probably good for business."], ["Sarah J.", "I absolutely loathe onions! So I love that their food (by religious custom) is onion free. The salad bar is always fresh, never wilted and suspicious looking. The main dishes are of high quality as well. They grow a lot of their own produce and much of what you eat is handmade, including the breads and salad dressings. So much love and care goes into this food. I'm so thankful this place exists."], ["Linda B.", "I eat here at least three times a week, the food is great and the atmosphere is excellent!"], ["Sudipto D.", "Fresh food, really healthy. The staff is very cordial and let us enter even at 3 pm for the buffet. Kale+spinach was really good. Ambience is nice and casual. Chariot festival at Isckon temple was a huge bonus today!"], ["Karen K.", "I love this place and come here as often as I can. The tamarind drink is awesome.  It's calm,  laid back and delicious.  All vegetarian!"], ["Cole H.", "What a beautiful place! Very romantic setting.. Amazing food!! Bring your date here for a heart felt time together. I give 4.5 stars for the food and an extra half point for just the unique beauty and vibe it has... Don't miss this place, especially if you visiting from out of town!! Once and a lifetime experience .."], ["Velvet J.", "Ms. Jones finally got around to trying this little gem after many months of wanting to.  With my ever handsome, sexy husband in tow, we arrived early to explore the grounds and grab an intimate little booth.  The food--in the mind and palate of Ms. Jones--was delightful, just-right spicy and delicious.  Everything was freshly prepared and I believe a majority of the ingredients came from Kalachandji's garden across the street.  The breads are made from scratch and the dessert was out of sight.  Service was quick and friendly and we never incurred an empty glass of their their refreshing tamarind tea.  For less than $11.00 per person (it's buffet only), Kalachandji's is an eclectic, delicious vegetarian delight.  If you like quirky, unique eateries, this place is for you."], ["Jenni M.", "I really enjoyed the lunch buffet at Kalachandji's. The vegetarian hot dishes were very good and highly memorable. Even my fiance who is not one to skip meat at a meal loved it and is anxious to go back.I do want to explain a few things.1. Do not expect to eat Indian food. The food here may be inspired by the tastes and spices of India, but I would never classify it as traditional Indian cuisine.2. When you first walk in, it might look a little disappointing. There are only a few hot dishes in the buffet and then a salad bar. However, the hot dishes we ate were very delicious and memorable and made up for not having 10 different dishes to choose from. Also, I probably wouldn't even take anything from the salad bar next time as I was stuffed from the hot food items.3. The Cinnamon raisin bread is amazing. We even purchased a loaf to take home and gobbled it up in a matter of days.4. The outside courtyard is lovely to eat in.I will absolutely be back!"], ["Margo C.", "Very peaceful authentic place.  Food is great, you can even pick something up in the gift shop.  Their hours are odd so be sure to check first. Also, you have to eat on the garden!"], ["Laura S.", "This place is great! The food was delicious and the service was excellent. The food is all vegetarian (and most, but not all dishes, are vegan). It's buffet style and comes with a salad bar, tamarind tea and a small dessert. I'm not a fan of buffets, since they tend to have lower quality, less-than-fresh food, but this was far from the case here. Everything I tried was great - and I basically had a bit of everything. I'm a garlic lover, and didn't even miss it in these dishes! The menu changes daily, although they do have some dishes that are routine. I thought the $13.95 price was reasonable seeing as it's all you can eat and the food is high quality. We ate inside since its sweltering outside right now, but the outdoor courtyard would be nice on cooler days. Will definitely be back!"], ["Apurva Y.", "To begin with, and most importantly: This is not at all your typical Indian restaurant! I'm Indian and not vegetarian, and I have to say, the first two times I went there, I wasn't too impressed by the food. I went back because the ambiance of the restaurant situated inside the Hare Krishna temple more than made up for it. I've been there at least 5 times now, and I love it more and more each time I go.1. Food - buffet-style, completely vegetarian, I think it's cooked without onion and garlic (but don't quote me on this!). A wide variety of dishes - steamed vegetables, traditional Indian curries, daal, papad, a full salad bar, and even a lasagna-type dish which I'm not sure is Indian, but it's delicious. They have this amazingly wholesome, unique cinnamon-raisin bread. They also have cottage cheese (for protein fanatics like my boyfriend). Indian food is typically oily and heavy, but not so at Kalachandji's. The food has that simple, uncomplicated, fresh-ingredients feel to it.2. Ambiance - simply magical. It's small, quaint, and beautiful. You will leave in a calmer, happier mood, guaranteed. I love the temple atmosphere with the incense and devotees everywhere, but really, you can easily avoid this part if you're not into it. Just enter the restaurant immediately to the left when you enter, instead of going all the way down the hallway. Bonus: there's a friendly chubby cat who chills near the entrance of the temple :)Don't forget the dessert - I always choose the sweet rice."], ["Rosy H.", "12 dollars for a vegetarian buffet and an experience at this Hare Krishna temple.My friends and I came here at the advice of another friend/whim. It wasn't the Indian food that I was expecting, but I loved the delicious soups, the fresh salad, and even the slightly-chewy paneer.The courtyard was wide and open, with tiny nooks and crannies to fit a group of friends in. I liked that it promoted conversation, but allowed you to people watch at the same time."], ["Neha M.", "Being Indian and having a mom at home who makes traditional home made Indian food, I don't love eating Indian food out.  However, at times, I like to change it up a bit.  I keep seeing so many great reviews at this place, and i have been to the Hare Krishna temple multiple times but have never came to this restaurant, but I am glad I adventured out to this place.  When you walk in it already smells wonderful- I love Indian spices so that was a plus and made my stomach growl.The decorations are gorgeous, making me want to go visit India again, truly.  I wish they would have some Indian items for sale, but WAIT...they do!  Stop by the gift shop after enjoying your meal here.The restaurant is buffet style, but just to go over a few items I had when I was there which I cannot say anything negative about.  (which not sure if you know but it's all vegetarian!)  I think it would satisfy any meat eater:Biryani (white rice mixed with masala and vegetables), chinese nugget (soy nuggets), daal (lentil soup)- to die for, tomato cheese quiche, chickpea, pappads (fried crispy thin chips), and they also have a salad bar to choose from.  Their dressings were great, a lot of different flavors that I haven't seen before.  Seemed all fresh made for sure.They have a slightly outside seating area, basically the roof is open.  I loved that.  Especially with the weather being so awesome in Dallas.The waitresses were attentive, walking around asking if we need anything even though it was self service.  I can't tell my mom that I enjoyed this meal very much but next time I am wanting some food that's not homemade by my mommy, I will definitely come here again!"], ["Bruce B.", "I like Kalachandji's for their indian food, but sadly, that's usually not what's offered, even when their online menu claims to have it. Rather than offering whatever curry or indian dish was on the menu, they'll have some BBQ tofu, lasagna, quiche, or some imitation Chinese food that I have zero interest in eating.Their website has a disclaimer \"Menu subject to change - we project as closely as we can based on available materials,\" which makes me wonder why they have a menu in the first place. I've tried calling to verify what's actually being served, because of that disclaimer, but received a lot of attitude from the staff for asking. It would be fine if it was a rare occurrence for them to deviate from what they're advertising, but I haven't been once this year when their menu actually reflected what was in the buffet."], ["Hilary J.", "Love it here - peaceful, beautiful, refreshing, and generous. A bit pricy, but it all goes to cover costs of the restaurant and then to the temple. They are always open to any questions you might have. Food is vegetarian/vegan/gluten free - and tasty.   Gift shop is fun too!"], ["Lee K.", "A vegetarian's paradise. That's what Kalachandji's is for me.  Though it can be a tad out of the way and not in the best neighborhood in the world, this temple is a peaceful oasis where you and your best hippie friend can enjoy some of the best exotic veggie foods in Dallas.Speaking of food, though I can say that it is all amazing, I cannot tell you what I'm eating or what it's called. Seriously, all I know is that it tastes great and that's all that matters.And it is very affordable here. Including dessert, we pay maybe a total of $25 including tip for a date night. Fantastic. 10/10."], ["Taneicesaya S.", "Let me start with this was my first visit at this restaurant and I went for lunch and ate alone.   The flow of entering the building to get to restaurant doesn't flow really well.  (That's not a bad thing) The food was okay BECAUSE I am not accustomed to Indian food.   I assumed the all you eat bar was going to larger than it was. ( I got full)Don't know if I will return but it was worth the try.  I went because of the ratings from #yelpersEveryone was real nice and the atmosphere was relaxing.Ohh yea I did visit the bathroom (my stickler) it is all black but one of the toilets handle was broken. (found this out after I used it)"], ["Chanel S.", "This is my all time favorite restaurant in DFW! The people are so warm and welcoming and even accommodated us for a to go order yesterday when we showed up a little after closing time. There is a true sense of community here which I love. The food is amazing and truly delicious every time and all of it is vegetarian! I love the green papaya curd and the daal soup is divine!"], ["Drew C.", "Excellent lunch buffet.  All vegan, but there are plenty of options and lots of variety.  Great salad bar.  I love their lasagna.  Beautiful building, pleasant ambiance.  If the weather is nice, I highly recommend dining in the courtyard.  Nice, respectful staff.  This is a true gem."]], "Underground Indian Cuisine": [], "Shivas Bar & Grill": [], "The Saffron House": [], "India Garden": [["Fanny J.", "Great food and good flavor. We ordered the chicken biryani and chicken tikka masala. The tikka masala was creamy and very rich in taste. However we ordered our food spicy and it wasn't as quite as spicy as we expected. Great food for great price."], ["Mina A.", "Never notice this place so closed to my home.  Today is my first time trying out their lunch buffet.  The food is ok, their Lamb curry the meat is a bit tough, a lot of bones too, was a bit disappointed.  The chicken tikka masala was good but the chicken is little over cooked.    The tandori chicken is a bit different than what I usually see, it is with a watery sauce, besides that, the tandori chicken is very flavorful.  The Nun is excellent, very chewy.  Will come back here again if I want a quick Indian fix."], ["Tyler W.", "Happily surprised! I haven't had the best experience with indian food in the Plano/Allen area. Some friends and I went a little out of the way to Indian Garden. From the second we entered the restaurant I was really impressed by the decor. The service was very helpful! Extremely helpful :). I got the Chicken Tikka Masala (sooooo good! I got it 3/5 spicy). Came with a good amount but had to keep asking for rice. I also ordered the garlic naan and keema naan (naan stuff with ground lamb). They gave us big portions, enough for three hungry guys to get full on. I was surprised how good the keema naan was paired with my chicken masala. Might seem a little pricy but with the service and how great the food it I definitely think it was worth it! Cannot wait to go back!"], ["Karen K.", "I had to Aloo Mancuran for the first time, and I wasn't disappointed! Great Indian food!"], ["Babbs W.", "This place has the best Indian food and service. The portion was great enough to share and even had leftovers for me and my love. I had the chicken Tikka Masala spicy. A creamy red sauce- yummy.My sweet had the chicken curry in blended spices. Which was also good, the favorite was mine.The owner gave me an education on spice and gave us some to go home to try. A welcomed experience."], ["Paul H.", "Nice gem of a restaurant behind a Denny's buried in a declining strip mall off the highway. Easy to overlook from the front but spacious and well-decorated inside. A thin crowd on a Saturday night but one adjacent table of older folks seemed to be regulars.Rather extensive menu, a lot of dishes I was wholly unfamiliar with, names I'd not seen before -- possibly more northern/Kashmir items? Had the murgh makhani (no photos but full descriptions on the menu), a delicious tandoori chicken in a spicy tomato-cream sauce served in covered metal pots with a shared bowl of rice. Also ordered some samosas as an appetizer and some naan bread, both of which were just about perfect. Overall, some of the best Indian food I've had around here.Service was a bit curt but polite, and it looks like a rather extensive setup for a lunch buffet. Prices are good, and the only neg I can offer is a lot of items are a la carte. Worth a return trip."], ["Tim S.", "I went for the weekend buffet. Salads were very pretty and tasty. The rest of the food was bad to awful. The sauces were watery and I didn't see any cheese in the palaak paneer. The chicken tikka sauce tasted like it came from a can. It was expensive on top of being bad. My empty tea glass is probably still sitting there empty."], ["Nicole B.", "We stopped in for a late dinner on Thursday night. We love Indian food and found India Garden on Yelp .... We were just passing through. It's a very nice place. We were so pleasantly surprised!!! We had chai masala tea, ground lamb  samosas, palak paneer & chicken tikka masala. Yum!!! It was SO GOOD!!! it was nearly empty at 9pm. Our servers ... I think the owners .... Were very nice & told us all about the buffet. Wish we could try the lunch buffet."], ["Amy F.", "This resturant may look like a hole in the wall, but don't let the exterior scare you away! The food was very good, I had the chicken tikka masala (hot) and was very happy with it. The service wasn't super speedy but my friend and I were not concerned. Overall, tasty food, I will go back again!"], ["glo m.", "Went there last night - the food was so delicious and fresh. My new favorite Indian restaurant."], ["Shannon H.", "Love this place. The chicken tikka Marsala is great. They have a great buffet for 8.95$ durring weekday lunchtime (12.95 sundays). Highly recommended"], ["North Girl M.", "so so good.  don't let the cheesy exterior deter you.  We didn't waste time with apps but went directly to the main course.  my sister had the lamb bhuna and holy cow was it good.  hot, sizzling and spicy, this is delicious with its tiny carrots, sweet onions and the occasional pepper.  i had the bengan curry - could have used a soak in salt water to ease the toughness of the skin but still.  the spice was outstanding.  DONT MISS THE BREAD BASKET.  $10 buys you some of the best naan I've had in years.  great service, fair prices."], ["Ro M.", "This is for dinner. I haven't tried the lunch.We were staying in a hotel close by and was looking for vegetarian food for me for dinner. Indian food is usually a no brainer and my wife can have meat if she feels like it.  The interior was average and appeared clean and neat. We stood at the door a bit until a lady showed up and seated us. She brought us paper brochure menus. There was one other party in the establishment. Lots of empty tables. I attributed it to it being Thursday.After the lady seater left a male came to take the order. My wife asked for a clarification about a lamb dish. He was not very helpful. She thought it was clear and ordered. I ordered a mushroom curry.While my wife had gone to the car an appetizer came. A triangular dish, maybe a samosa? I cut it open an wasn't sure if it was vegetarian. When the server passed by, I asked and he stated no and!!  just took the dish!! No replacement was offered, it was not left for my wife either.A little while later we asked if there was no substitute? He brought a 6 inch diameter chip thin baked flat. I don't know the name, but I have had it at Indian restaurants. It was a very poor substitute.The main dish came, mine was ok. My wife's lamb tasted awkward. We found out it was sausage like prepared and stuffed into an intestine. She ate approx. 20% of the dish and tired just left the rest.The lady seater at least had a smile. The male should learn that. The place made one feel unwelcome and the servers are of little to no help to explain the dishes properly. Water was refilled once.The bill seemed a bit high compared to west coast prices, the service was bad. Unless you know Indian dishes well and don't mind sub-standard service, don't go there."], ["carly a.", "Uhm... Ok.  JeeZ.  Where do I start. Ok. FOod: tasty. That's it.  Just tasty. Not great. Not the best or worst I've had. It wasn't up even hot (temperature). Ambience: crappy. No music. Awkward. Darkish. Weird. Not very... I don't know, \"come back soon\" was not the feeling in here. Service: CRAPPPPPY. And I think our server was the OWNER. Personality of a paper PLATE. Sorry. We were looking for something on the menu to order for our children. He couldn't figure out a recommendation. At all.  What we did end up ordering was SUPER HOT and we ended up paying for it and ordering the, another $14 meal of which they ate two bites because we had to stuff their faces w naan while we rotted waiting.   You have to pay for your papad. Really? I mean. Come ON! What's it cost, twenty five cents?!?!? Nope. $3! We asked for a kingfisher when we sat down... We got it when the food came out.  Hi guy. Hum..... You could have had added 2 $7 beers to that bill if you had moved on it! And the one server thing is for the birds. I mean, he had no personality. We were so uncomfortable. The helpings were ok. Food was ok. But no. We don't recommend because the ambience and service both left us wishing we had cooked at home. Steer clear.  Sorry!"], ["Jessica T.", "The staff is always welcoming and kind. The food is simply authentic and mouth watering good! I always ask for extra spices and I'm never disappointed!"], ["Liz D.", "The freshest and most delicious Indian food you will find outside of India! Better than mom's home cooked Indian meals."], ["Shannon H.", "Not going to even remotely pretend that we are Indian food connoisseurs.  We are not.  So its true, we don't have past experiences in Indian culinary adventures to compare India Garden to.  But what we also have is a clear and objective palate and this was an excellent dining experience.  Delicious food beautifully served and friendly, efficient service.  We plan to return to try the Sunday buffet to experience more of the flavors and choices they have to offer.Quiet, cozy and an all around pleasant first trip to culinary India.  We'll be back."], ["Maureen O.", "We are very regular customers due to their great service and friendly, casual and intimate experience. The food is always delicious whether buffet or made to order. Always a pleasant dining experience. It is my favorite restaurant in  Garland."], ["Jim L.", "The location was easy to find, right off the exit ramp.Very good buffet, delicious. The selection was decent, but all items were fresh and hot. Staff was friendly and helpful.My family and I intend to return soon."], ["Angie W.", "The hubs and I eat Indian food often so we are pretty familiar with the cuisine. Our experience mostly has been in Cali since we just moved to TX (LOVE LIVING HERE!) so it was nice to find a place nearby. India Garden was ok, nothing spectacular. We went on a Wednesday night and had the place to ourselves so that was rather nice. The gal who showed us a table was pleasant and took our order. We ordered the garlic naan, this was great and I loved the chunks of garlic on it yum! We shared the Tandoori mixed plate it came out sizzling like fajitas, the meat was on the dry side but the flavors were decent. we also tried the lamb curry with medium spice, to us it was not spicy at all, but we like heat, maybe the next step up - hot would have been a better choice. The lamb was also a bit on the dry side even though it was cooked in a brown curry sauce which was not bad tasting, it was just ok. I thought the price point was a bit on the high side, and honestly I would go back but only if I am really in the mood for some Indian curry that is close by home, otherwise I'd like to try some other places."], ["Stephanie M.", "Really enjoyed! I've been meaning to try this place for a while and I will be coming back."], ["Shonnie M.", "Absolutely wonderful! Wine and food... No complaints! I would definitely go again."], ["Jon L.", "Food is always great.  Comfortable atmosphere.  Service is never good, but I attribute that to providing a truly authentic Indian experience, including waiters who only speak Indian dialects.  I just hope the authenticity doesn't extend to the kitchen cleanliness.  :)"], ["Elaine C.", "The lunch buffet includes a wide selection of vegetarian and non-vegetarian dishes. The price is less than $10 per person, and the food is delicious. They change most of the items daily, so make sure you dine-in more than once a week to try a variety of Indian dishes.  I invited a group of my college students who never tried Indian food for a cultural outing, and they all loved the food.  The tandoori chicken, naan, and aloo gobi were their favorites.   They did not like the carrot dessert, but loved it.  For first timers, they sure went back for more food.  Thank God, it was a buffet because I paid for the bill.   I was happy to see my students enjoying their cultural experience.   The decor is beautiful.  The ceiling is decorated with South Indian textiles, and the wall hangings represent the Eastern and Western cultures.   I have ordered food for catering multiple times, and the food was amazing.    Only drawback was the communication barrier."], ["J C.", "I'm a pretty big fan of this place.  My family and I have been coming to this restaurant since they opened.  The people are fantastic and the food is always fresh and delicious.  Order anything,  my wife will usually get the Chicken Tika  I try to mix it up a little from time to time.  Can't say enough about how nice and polite the staff are."], ["Joey K.", "This was my first experience with Indian food and I must say its very delicious and shares alot of similarities to Greek food, which is on my tops for best cuisine ever.      This restaurant does a 2001 space odyssey mind bender on you with the whole, \"We're next to a Habitat for Humanity and Goodwill in a strip mall located in Garland, but when you walk in prepare for white linens and marble/ Persian rugs.\" Really, was not expecting this! The 8 or 9 dollar lunch buffet was very reasonable for the quality of food and the unique setting.     I pretty much tried everything because I'm a glutton and there were lots of standouts. First of the cold chicken tandoori salad was very good along with some jasmine basmati rice, multitude of wonderful different chutneys and some delicious flat-bread called naan.    Couldn't help but notice the similarities to Greek pita, basmati and tzaziki during my food inhalation.    Next it was on to the curries and tandoori chicken! Having heard that chicken tikki masala is like the soft cheese taco of Indian food ( i.e. comfort food with a flavor safety net) I decided to go for this first and compare and contrast the other ones against this.    On my lineup was Goat, mushroom, pea and potato, and chicken tikki. I rank them in this order 1: mushroom 2: Chicken tikki 3: Pea and Potato 4: Goat.    Goat is lambs harsher whiskey drinking drug abusing cousin and must be burned with fire. The only good goat I have ever had has been jerk goat in Jamaica and spit roasted cabrito, both had lots of seasoning and flame grilled flavor. This Indian goat curry tasted like creamy old billy goat.    I soon forgot about all of this though when I tried the tandoori chicken, man this is some good chicken! Super moist, tender, and a mild grilled charcoal flavor,great with some more chutneys and naan!    Dessert offering was were pretty weird, one tasted just like a soggy cake bread donut hole with karo corn syrup. Pass on these, oh and if you order tea be forewarned its def not good ole southern tea, its some sort of Indian fruit tea...which was not unpleasant just unexpected."], ["Ryo J.", "It doesn't seem like a great place to eat from the outside but I would vote this is the best Indian lunch buffet in Dallas area. Selection varies day to day but I've never been disappointed"], ["Jay S.", "I've had the buffet and I've had dinner as well and both are great. Cool atmosphere too. Carnivores and veggie people should appreciate India Garden."], ["Brandy B.", "Fantastic! I could not believe how delicious the food was! Extremely impressed! I will be eaten here more often!"], ["David P.", "So i've always wondered how this place tucked into a strip mall behind a Denny's was and i'm bummed I didn't go here earlier. Being kinda picky about my Indian food and always being disappointed in comparison to India Palace I usually just suck it up and make the long drive to 635/preston. On the good reviews I saw i decided to take the plunge and I am happy I did. We got an order of the Chicken Tikka Masala and 2 orders of Naan and I must say it is some of the best i've ever had. I kept eating until I was almost sick and had the leftovers for breakfast. Can't wait to try other things on the menu. While we were waiting for our food we chatted with the owner who was very nice and enjoyed the atmoshpere. Somebody was dead on when they said the ceiling reminded them of a magic carpet!"], ["ash m.", "had the buffet here last weekend.. not bad at all..Ive been trying to find a good place for months..everything I like closes down or gets sold and changed.. this place was good, flavor, fresh and nice staff.. location sucks but overall its worth the visit..chicken tilka masala is good,  better than most places ive tried"], ["F. A.", "My boyfriend and I used to frequent India Garden on an almost weekly basis; but they changed chefs and it all went downhill. They told us they got a new chef because the new one was cheaper, but this \"cheaper\" trend started to reflect in other areas as well. They started reusing the dips served with the poppadoms, you would find poppadom pieces in your dip from someone else and dried dip on the sides where others have eaten and lowered down the dip level! Gross!!  They use reheated chicken in all their chicken dishes and almost never use fresh food. They also are super, super inconsistent. Every time we go its like eating in a different restaurant. I always get the chicken kashmiri, they almost never put the same ingredients in it, some nights its super thick and creamy and others its water downed. I always order it hoping it will return to its past deliciousness, but alas, its not. Their service is terrible, which is, i guess, on par with most indian restaurants. Unfortunately, our last visit will be just that, our last. :( Beware."], ["Lori S.", "Service 0 sTarS, food and atmosphere 2.5.Because of the YELP reviews, I decided to try out India Garden for my first time to try Indian food.  I am a Garland Native and haven't experienced much outside of Southern, Italian and Tex Mex cooking.  I went their for lunch because of the buffet.  I figure I could try out a variety of items.  As first-timers, my mom and I showed up early to beat the lunch crowd.  It was around 11:15 and there was only one other table with diners.  The waiter seated us and walked off.  When he went back to the buffet to put labels on the food, we told him we wanted to order our drinks.  He seemed bothered, but then arrived back with pen and paper.  I asked for iced tea, and my mom, Dr. Pepper.  He brought back hot tea for me and iced tea for her.  So, obviously, I took her iced tea and tried again to order the Dr. Pepper.  He said little to us which raised my concerns that he didn't speak English.  So, on to the buffet.  I liked some of it a lot, something that looked like chicken ka-bobs, but I don't know what it was because they had not put the labels out, yet.   When I asked the waiter, he was short with me and I could not understand him.  We told him this was our first time and would like to know what the dishes were-but this did not make him any less patient.  The desserts were two choices, and minced sweet carrot dish and a sweet rice with ginger or cinnamon on it.  I loved the rice dish.  When we went back on Sunday, the buffet changed, and wasn't as good as it was on the weekday."], ["Sameer M.", "Full disclosure, I know the owner, Sunny, and he's a good friend of mine.  That said, I love India Garden.  To me, its one of the only tolerable Indian restaurants in the Metroplex.  The food is always great, and the service is attentive.  It's one of the very few restaurants that service southern Indian food.  Other places that serve south Indian food only serve Dosa's and idli's.  What people have to realize is that we eat the most amount of beef in the south.  This place will serve real southern beef dishes.  Pork and chicken as well.  I'm not a buffet guy, but it's pretty good.  Honestly, I don't like the location, it's too far away for me to go often, but if I'm in the mood or I'm in the area, I'll always stop by.  Check it out, he'll appreciate it."], ["Naima S.", "This place is the hidden secret of Indian restaurants in the east Dallas area.  The food is absolutely amazing, the portions are large.  Will go back and back again.  The wait staff was very friendly too, even the owner stopped by our table to check on us."], ["Ida F.", "I had to go to the Dallas area (Mesquite) for a week. Being from the San Francisco Bay Area, and originally from NYC, I'm a bit of a food snob. My favorite food category is  Indian, and I spent 6 months in India some years ago. The first thing I did after booking my flight and hotel, was to look for Indian restaurants in the area. I saw a review for India Garden, and this is how I found it. WOW, am I glad I went! First of all, they have Dosa, a paper thin, crispy crepe, served with coconut chutney and rasam. This alone could bring me here. This is a South Indian specialty, and not something you find in any old Indian restaurant.  Then the Goan Shrimp dish, took me right back to Goa, a place I have happy memories of. The chicken curry was so tender and flavorful I'm salivating as I sit here remembering it. And the Palak Paneer, full of beautiful green spinach was so fresh I felt like my friend's mother was in the kitchen in her sari cooking for me. (when I traveled in India it was with an Indian friend from college, so we ate in her relatives homes and were so spoiled with great food) This was such a great meal... I didn't even mention the rice, the naan, everything else... We ate the leftovers for lunch the next day. Well, I knew that before I left I had to come back for one more meal, so the night before I left I came back with more friends and we tried other foods, each one a delight. Oh, and the owner, Mr. Sunny, lived in NYC for many years and both times we came he gave us individual attention, making sure everything was perfect, which it was, and giving us little complementary treats to add to our feast. If I lived here I would eat here once a week. God knows if I'll ever have a reason to return to Texas again, but if I do, I'll be back. Thank you Mr. Sunny, for creating such a gem as India Garden, it really was a highlight of my trip."]], "Bombay Sizzlers": [], "Roti Grill": [], "India Chaat Cafe": [], "Ambala Grill": [], "Al Kabob Grill & Cafe": [], "Taj Mahal Indian Restaurant & Bar": [["Jim W.", "I'm not sure if they were training in a new cook tonight, but there were more than one dish brought from the kitchen which wasn't ordered by folks. (The waitress caught most of these errors.) And, the place was busy.  So, accordingly, it took a while for my food to come out.I ordered the tabbouleh salad and Chicken Tikka Masala. The salad was good. However I guess they don't use chicken tikka, because it was simply cooked chicken breast: Chicken Masala. It was good, but I missed the extra flavor in the chicken. To their credit, they acknowledged the slow service, took off the salad from the bill, and gave me a free rice pudding. I would have to say they are very honest and fair.So they may be much better when things are clicking in the kitchen; a good cook/chef makes all the difference in the world. You may want to try it yourself, knowing that they will treat you fairly if something is amiss."], ["Hannah R.", "I love the Taj Mahal buffet on Saturdays and Sundays! a $10 buffet includes a wide variety of flavorful Indian foods and a small variety of desserts. My favorite is the spinach dish and the fried potato patties. I wouldn't go anywhere else for my Indian buffet!"], ["Heather L.", "For $15 per person at the dinner buffet, I expected something better than just barely edible, room temp, bland Indian food and cold chewy naan.  I gave it an extra star only because the wait staff seemed friendly."], ["Anna S.", "So yummy!  I had the chicken masala and it was delicious!  Not too greasy and it wasn't too spicy, even though I ordered 'medium'. The naan was also very good.  I got the food to-go and it was ready in 5mins and was very hot and fresh. Would definitely go back!"], ["Debbie C.", "I was traveling on business in February and  found this place.  BEST yellow lentil soup!  The green chicken  Marsala and it was great too.  Very nice wait staff I think they were the owners.  Service a tiny bit slow but they were very nice and the food was delicious."], ["Athena H.", "Very good. I ordered off the menu and loved it all.  Not a buffet person but, folks seemed to enjoy!"], ["Madai M.", "This was my first time trying Indian food and this place was AMAZING! If you are vegetarian I highly recommend it, plenty of options!"], ["Meredith R.", "After a week of eating rich food on a business trip, I had a hankering for simple, grilled meat. Chicken tikka -- one of my favorite Indian dishes -- fit the bill.Sometimes this dish can be over-cooked and dry, but not at Taj Mahal. It was perfect: succulent marinated chunks of white meat chicken, served over sauteed onions and peppers. My husband ordered the lamb version of my meal -- barra kebab -- which he enjoyed. (Not being a fan of lamb, I can't comment.)The basmati rice was good and the papadum and accompanying condiments were fine. There were women -- novices to Indian food -- sitting at a nearby table who were oohing and ahing over their selections.I think Taj Mahal is a good, servicable restaurant. Based upon our first-time visit, I wouldn't hesitate to return!"], ["Ann S.", "Dinner here is great.  Had the Paneer Tikka, which is not typically on menus here in Dallas.  Service was EXCELLENT.  Will definitely go back."], ["Richard B.", "Great place...I live very close and this was my first visit. nice quaint restaurant with good food, Much Better than the popular chinese Buffet almost next door....I do not like that place at allthis will be a regular lunch spot from here on outGREAT FIND"], ["Dave C.", "I've been going to this restaurant for years now and it has always been better than average quality and a good place to go. The last two times I've been there the quality has gone way downhill. The SOG Panter is incredibly salty. So salty I could not eat it. And the other sauces were runny and not flavourful . I'm not sure I will go back after all these years."], ["Anna B.", "My favorite--hands down. I just love it. You won't see me in there b/c we almost always pick up but they have food that reminds me of the food I used to get in NYC, when I lived there. Everything we have ever tried, we loved. Our favorites include: Korma, Tikka Masala, Vindaloo, Chana Saag, Samosas,  Kheer Badami and Rasmalai. Can't go wrong with anything. It's all good."], ["Sidney H.", "The food is good. But the lunch buffet selection is small. Someone else's review said that the dishes change daily. So maybe I'll stop back by soon. Would love to see a gosht dish. :)"], ["Toni W.", "The buffet is great. All of your regular favourites are there. Saag Paneer, which was not on the buffet, is my favourite dish. I would not recommend their Saag Paneer.  I would, however, recommend the Chicken Makhani."], ["Jennifer W.", "One of my favorite place to eat Indian food.  Tikki Marsala is my favorite with just the right type of spices.  I usually get the buffet which is $11.95 for there after lunch.  I feel it's pretty pricey with not a lot of selection.  As much, as I enjoy the food I took a star off for there price of there to go buffet they charged me $13.95, which I feel like there nickel and diming me.  I went and ate there yesterday and charged me .99 for a can of coke no free refills they charged me .99 for a 2nd can.  So disappointing!!!!"], ["May M.", "I love, love, love, Indian food. Taj Majal has decent food but they're definitely over priced. I have never ate anything here I didn't like. But it's nothing to brag about. I eat here when I am craving Indian food but don't want to drive to far. The service is usually good too."], ["Jenn H.", "My husband and I recently went during lunch during the weekday (we used to go after church for lunch all the time) and it was subpar. The food selection was limited and seemed like the taste was not quite there. Don't know if it was a fluky day or not but I would usually rank them at 3.5-4 stars.The price was expense for the lunch buffet."], ["Ilene J.", "The food is average, nothing special, especially since there are plenty of fantastic Indian restaurants in DFW. However, this review is about the fact that the servers are not allowed to keep their tips. When you eat here, just know that the tip you leave is going straight into the owner's pocket, not the staff's. The servers are paid a slightly higher wage than most servers in restaurants, around $6.00 an hour, but it is still not the real minimum wage. The bill should state that service is included like it does in restaurants where servers do not work on tips, but it does not."], ["Megan M.", "Over a decade ago, there was an Indian restaurant named Taj Mahal that lived at Park and 75.  At the time, it was one of the best Indian restaurants in town.  I have no idea if the two are related, but I'm pretty much in love with this Taj Mahal just the same.My biggest complaint with Indian food in Dallas is that it's trending toward being bland.  If you've ever eaten authentic Indian (which I have...I think), bland is not a word you would ever use in describing the food.  Indian flavors are savory and potent, spicy and complex.  Taj Mahal bucks the bland trend and serves up the flavorful cuisine that I constantly seek.I've only ever eaten at the lunch buffet, but I truly believe that if a restaurant can pull off a really good buffet, their regular menu is probably outstanding.  For $8.95 (Mon-Fri) you have an all-access pass to a rotating menu of those Indian dishes that we all know and love.  This is code for \"I've eaten Indian almost my entire life and still can only name a few dishes by sight.\"  There are name cards on the buffet but I haven't gotten up the courage to take a picture of the buffet so I can remember them.My favorite dish is the beef curry (vindaloo maybe?) that is a permanent staple next to the tandoori chicken.  It's spicy enough to make your nose run a bit, but isn't that the point?  The nan is always fresh and puffy with just the right amount of oil.  The basmati rice is mild and almost doesn't have enough cardamom, but it works well with the curry sauce.  In addition to my favorites, there are a couple of chicken dishes, a couple of vegetarian dishes and a small array of salad options.My absolute favorite thing about Indian food is gulab jamun, which I lovingly refer to as honey balls.  Because they are prepared en masse and set over a warmer, they aren't always as fresh as I would prefer.  But this doesn't stop me from eating them.  On my last visit, the tapioca was replaced with a bread puddingish dish that I didn't like as much as the tapioca.Taj Mahal fills up fast during the lunch hour, but the waitstaff is ever present and you'll never have an empty drink glass.  One of these days I'll order from the menu and I'll betcha a wooden nickel they'll earn that fifth star from me."], ["Joseph F.", "Great Indian Food Found Here!! Seriously though it's really good. First of all, they are located behind the Grandy's and Denny's so don't think they aren't there anymore because I promise you they are and worth the visit. Taj is a buffet style Indian restaurant, I made sure to try everything just so I could give a fair review. The food was great none of the dishes were over powered by the spices. They have a absolutely delicious tandoori chicken, and by that you are now safe to assume it is not strictly vegetarian. Taj does a great job of offering an equal mix of vegetarian dishes and meat dishes. In fact they even had a beef dish, which is something I have yet to really see at an Indian food restaurant. The palak paneer was perfect, and lentil and red beans tasted just like red beans and rice, and the Naan was light, fluffy, and fresh from the oven. It was the perfect side staple to the meal. As a side note, they do have music playing that we found very interesting. When we first arrived it would be what I considered traditional Indian music, by the time we left they were playing American music with a Bollywood theme. Imagine \"Desperado's in the Sky\" with a sitar being played instead of a guitar or bass, and yes they really did play that song. Very interesting and a touch comical."]]}