{"Bocce": [], "Scalini's Pizza and Pasta": [["Spicy M.", "Well, it's Pumpkin Ravioli Time at Scalini's, and it's callin' my name.   It's one of their Fall dishes & won't be around for long.Hubby & I stopped in for lunch and shared a yummy Greek Salad & we ordered his favorite,  a Medium Sausage & Mushroom Pizza.   It always hits the spot!  I ordered the Pumpkin Ravioli with White Wine Cream Sauce to take home for dinner tonight!  I can't wait to dig into that bunch of deliciousness!   Quaint intimate 'lil Scalini's never disappoints.  The food is consistently great  & we always have great service by the wait staff.   It's what keeps us coming back.'Till next time.(I like the new bi-fold windows they just put in, btw!)"], ["Molly K.", "Cozy and warm little restaurant.  Came on a Monday night after a friend's bridal portraits.  We were craving something \"covered in Alfredo sauce\" as Kristina put it.Well they made sure of that.  She ordered the Chicken Fettuccini Alfredo.  I had the Pesto Linguini.  Kristina's mom ordered the Chicken Picata.  All three we extremely delicious! Not too over sauced, perfect garnished, and just the right amount of lemon flavor on the Chicken Picata.  The portions were almost family style.  They came with a small salad each and the house dressing was perfectly flavored with Italian spice and oil blend.  I have to say this is one of the first times I couldn't wait to eat my leftovers the next day.  Usually the to go boxes go to the fridge to die but not this time oh no!!!  This would be a great date night place.  Glass of wine, plate of pasta and some warm conversation. Perfecto!"], ["Adam N.", "Chicken Parmesan sandwich is good enough for a Haiku review. Fresh sauce piping hot Bread soft like eating cloud Makes me want to swear"], ["Lou Y.", "Great neighborhood eatery but let's not get carried away with the quality as some other reviewers are gushing about. A little heavy on the sauces and the Caesar salad was drenched in dressing. Nice wine list but they tend to run out of many bottles. Definitely worth a visit"], ["Paul T.", "My wife and I stopped here for dinner.  The food, the service and the ambiance were amazing.  I had the Italian Meatloaf.  It is by far the best comfort food dish I have ever had!  My wife had the spaghetti, and it was excellent as well. For dessert we split a cappuccino cake, again it was simply amazing!  I can't recommend this place enough, the food is great, the service was great, and they have a great wine list."], ["D. R.", "SCALINI'S PESTO PIZZA: pesto sauce, grilled chicken, tomato, red onion is MY FAVORITE here when I do not order SMOKED CHICKEN RAVIOLI. These are the only 2 items I've had here. Soooo good :)"], ["Dave G.", "I have lived in Lakewood for a long time now, and Scalini's has been one of those weeknight standbys, though more in the past than recently. There is a \"Cheers\" like atmosphere, a very neighborhood joint. You'll find American-Italian fare here. Spaghetti with red sauce and meatballs. A delicious thin crust pizza. The portions are ample. The food is consistently good. Scalini's is very unpretentious, not a foodie spot, but a reliable place. One gripe: the prices have gone up since I was there last, and the new rates stretch the value to the edge. Quite good."], ["Kaia V.", "I am officially a fan of Scalini's.  Their delivery is relatively quick on a weekend evening. The folks who answer the phone are polite friendly and easy to understand. The lasagne is fantastic. The white cream sauce on the chicken lasagne might have clogged my arteries more than a little, but it was delicious and didn't get too greasy before it arrived (though it wasn't entirely greaseless either). The garlic bread and salad that come with the pasta dishes ($12) were small, but the lettuce was at least fresh and the italian viniagrette in the correct (not too much) quantity for the size of the salad. Portions are standard italian pasta delivery sizes."], ["Connie H.", "Scallini's has the best cannelloni, veal and chicken parmesan dishes in Dallas County.  Highly recommend their restaurant!!  We eat here often."], ["Karen B.", "Tonight was my first time trying Scalini's and I was very impressed! I looked over the menu online for a few minutes and quickly decided to order a pizza and a salad, just to test the waters of the place. I ordered a half pepperoni and pineapple, half shrimp, with the entire pizza topped with feta cheese, a coke, as well as a Greek salad- all for $28.34. Not a bad price considering my \"deluxe\" toppings. I was told delivery time was going to be 30-45 minutes, but it arrived here much quicker than that! The delivery person and the person I spoke to on the phone were very polite as well. To top the entire experience off the pizza was fantastic! It looked and tasted delicious. Salad was fresh and crisp. Only reason I give 4 stars instead of 5 is because I wish the pizza was a little bit more crispy. That's my only complaint."], ["Francesca L.", "My brother wanted lasagne for his birthday and after a long day at work, my mom wasn't up to making one and took a suggestion from her coworker to order one from Scalini's. It was about $45 for a whole lasagne and it was nice and hot when we arrived.When we got home and cut into the lasagne it did not hold together well. The pasta was pretty mushy and it just ruined the whole dish for me. The beef was flavorless and the sauce tasted canned. Overall a disappointing lasagne, I wouldn't recommend it."], ["Jason M.", "A little run down but an okay place. Good food though."], ["Mitchy M.", "I'm not sure why I've never wrote a review before now.  Scalini's is one of my dip spots in Lakewood.  Yes I said dip.  I can dip in for a bite to eat with a date and not be bothered by a huge crowd of people.  Scalini's is quite the cozy place.  It's not the kind of place that you feel rushed to order, eat and give up your table because someone is waiting.  And there are 2 sidewalk tables if you want eat outside.I've only eaten one thing here.  It's the shrimp scampi, with creamy white sauce and a side salad.  I'm not going to say it's the best Italian dish, but it's tasty.  Even my dates love this place. I don't have to write much about this place for you to know that you must eat here if you're in Lakewood.  The cost is very affordable.  Lunch for 2 will set you back around $20 with drinks included.  Take my advice.. stop by for lunch.  You won't regret it."], ["Aimee F.", "We eat out almost every dinner, and in my entire lifetime, this was the worst dining experience I can recall.  Just shy of two hours to get dinner was bad. But then it was delivered without apologies.  And was sub-par (very tough, dry chicken).  Just a \"we have lots of to go orders\" (tip: ordering from home is way faster?).  Then, shockingly, we get the bill (again no apology) and not even a free dessert?  Wow.  Asked to talk to the manager, that was a waste too.  It is clear whomever runs it is not the owner and doesn't care. Did I mention we had kids with us?  I would like to believe their cook staff quit or something, and if they had bothered to tell us that or something, I could forgive this.  But I honestly would pay to not have to go back."], ["Maximilliann S.", "Arrive at 6:50pm upon the restaurant telling us there are open tables on the pre phone call. Arrive to find there is a wait and no tables available. 1 hour and 20 mins later no main course so we had to leave. The manager has absolutely no idea how to run the restaurant!! Will not be back!! Thank you scalini's for ruining our night and making the kids wait that long for their meal!!"], ["Julie L.", "Ordered lunch at 3:15 picked up and totally cold & nasty! Called up there to complain & \"I'm sorry\" though at this time they weren't busy & undivided attention, apparently not! On the other hand, gives Heights more customer service. Never again!!! Got me a Stouffers...lol"], ["leslie b.", "Love this place! Very cozy and casual neighborhood restaurant. I don't care for chain restaurants so this place is right up my alley. Food is great, service is wonderful and the environment is nice. Great for couples or families."], ["Lauren N.", "Unless you are ordering delivery, be prepared to wait.  No waitress, no food after 1 hour of waiting.  We went on a Saturday night after calling to make sure there wasn't a wait since we had my 2 month old with us.  We arrived and were seated in the front, by the bar.  We watched carry out customers come and go.  None of the customers around us were eating, should have been out warning.  We saw the waitress twice.  Once to take our drink, app, and dinner order and the second time was to deliver the drinks, app and salad.  Never saw her again.  My dad, who rarely complains at an establishment, talked to the owner after an hour of waiting.  We were promised food within 5 minutes and told that they were short staffed in back, which I find hard to believe since they were churning out delivery orders.  Needless to say after 5 minutes we walked out.  The owner never acknowledging our leaving or saying anything along the lines of an apology.  We will never be eating there again, which is unfortunate since their food legit!"], ["Jane D.", "Spoiler: This is a scathing report on Scalini's, one of our former VERY favorite restaurants for  the past 17 years, to whom we have given countless \"one more chances\" in recent years.    We loved and went here regularly since 1998 (maybe 3 times a month), and we WANT to love and support this place.  Have had horrible experiences in service over the past several years and keep on forgiving them after a few months and returning to try again. We are a family that LOVES to frequent and support all of our local restaurants and other businesses. That said......Tonight we (family of 4) were thrilled and charmed to see the brand-new storefront where they have opened up huge, breezy windows with bar seats  and candles. So quaint! We went to one of our \"usual\" tables (remember it's been 17 years) with a renewed optimism.   Restaurant was busy but not full to capacity.  OK....Took over an hour to get our main course after we ordered it. The tables on both sides of us arrived, ate, left, and probably went to sleep while we were still waiting.  We did not order anything unusual. In fact, our family of 4 was so enjoying just visiting that we didn't realize until a while had gone by, that our main course had not come and they had not cleared our table of the salads and appetizers.  And our table was right there near the counter, not hidden in a corner. I finally asked (politely) several times, and was told there was only one chef there tonight (no excuse, because the other tables got their meals).  Apologies and food promised \"within 5 minutes.\"   We finally said to our waitress, we will leave if our food does not arrive within 5 minutes.  It came about 2 minutes later, and one of the orders was wrong although we had made the order very clear.  This was over an hour after we ordered.  Our Waitress never came back to ask how it was.  No one ever came to clear plates or offer dessert or offer a check.  I finally went to the bar and asked for the manager.   Jose, the manager tonight, listened as I explained exactly how our evening had gone, and then said that he would comp our whole meal.  I thanked him and sat down with my family, waiting for the waitress to come back and confirm this and perhaps say something. No one ever came. Our  waitress never returned to our table although I saw her.  We finally got up to walk out.  I waited at the bar, and when the manager Jose walked from the kitchen to the bar, I made eye contact and he walked over to me. I asked him if we were just supposed to walk out with nothing else said to us, and he mumbled something about \"I guess so.\"  He would not even make eye contact with my husband and kids and mumbled something that my husband could not understand.  We walked on out and came home.    We are a nice and respectful family and did nothing snobby or rude to elicit this sort of service.  Shocked and baffled by our former favorite neighborhood Italian restaurant."], ["Alan L.", "Tried first time for dinner. Atmosphere was pleasant, but service was slow. Our server was very nice, but inexperienced and a little overwhelmed. Minestrone soup was ok. The small, thin-crust pizza seems larger than listed, and is a good value (we ordered sausage). Thin crust is tasty and works well as appetizer or meal.  Combo plate (lead menu item) is large (enough for 2), but ours was served lukewarm and slightly under-cooked, so we brought most of it home.  Wine prices are reasonable, Lasagna, spaghetti, ravioli seemed a little flat taste-wise, but that could tie to the food temp. Overall, we were slightly disappointed in comparison to other Dallas Italian eateries in the $$ range, (especially in light of recent Yelp reviews!) so maybe it was just our turn to have an off night. In any case, we will not likely return - except perhaps to enjoy an appetizer and glass of wine in a pleasant Italian bistro setting."]], "Mimi's Pizzeria": [["Ashley Y.", "The staff was super friendly and you can order by the slice, which is super convenient if you can't finish their ginormous sized pizzas! The pizza was thin and not as crispy as I would've liked.You can definitely tell they used fresh ingredients, but I still felt there was flavor lacking for some reason. Overall, it was decent - just not \"I must come back again and eat all the pizza in their restaurant\" good. (And yes, there are pizza stores out there that I would totally jump like the fatty I am on the chance to eat out the whole store)"], ["Stefanie L.", "While the staff is extremely friendly and helpful, I was not in love with the pizza here at Mimi's. I think the pizza's are okay, I'll even go as far as to say good, but they're just not amazing finger licking good. This is definitely a family with lots of kids kind of place, not exactly date material. Also, I was a little disappointed with the sweet tea, perhaps I got a bad batch but it almost tasted like it had been sitting out all day which was a shame because I love my sweet tea. Don't think we'll be back but we're not opposed if we were in the neighborhood and wanted to bring pizza home. Service is excellent however, y'all were great!"], ["Eugene L.", "My wife and I visited Mimi's during a weekday, late in the afternoon about 3:00.  We ordered a medium \"Works\" pizza as the pizza out for sale by the slice looked left over from lunch.The pizza we received was much worse than expected and nothing like the reviews we had read.  The meats were low quality and tasteless.  The vegies were not pre cooked so all the water from them was on the pizza making it soggy and ruining the crust.   A puddle quickly formed on the pizza pan.The crust not soaked in water was very good.  Maybe a pizza without vegies would be better."], ["Bryan T.", "Are you a Northeastern transplant to Dallas? More to the point, are you a TriState Area transplant? If you are, then you'd fully appreciate the quick service, the traditional pizzaria-style dine-in section, the thick New York accents and polite-yet-refreshingly-no-B.S. service, and the best thin crust slice of pepperoni in the metroplex. I'd raved about Coal Vines before, but if you want a quick, greasy, crisp-crusted slice to-go, with a 10-spot of perfect buffalo wings, then this is your spot. Jersey represent!"], ["Efrain R.", "This is best pizza I've had seen I moved to Texas! This place actually ruined pizza for me. Now I can't have pizza anywhere else."], ["David M.", "Great pizza and the rolls are fantastic. BYOB. Quick service too. This is real Italian pizza!"], ["James F.", "Amazing place! Authentic pizza! Got their philly cheese steak and really enjoyed it. The guys behind the counter were nice and friendly. Will come back to this place when I'm back in Dallas"], ["Gene X.", "The food and pizzas are delicious compared to the price.Unfortunately, like most pizza joints, the setting isn't very clean or modern."], ["John P.", "By far the best pizza I've ever had. This is Authentic Italian/New York pizza. They've got the New York accents and I think I've heard them speak a little Italian too. Mama mia! Mimi's is amazing! P.S. Don't go for the atmosphere. The love is put into the food."], ["Katie S.", "I married a pizza snob, and after moving to Dallas a few months ago....the search for our go-to pizza joint was on. Mimi's nailed it. The staff is friendly every time I go in. They didn't even judge the hubs for asking if he could fold some pizza boxes. I, on the other hand, judged hard. Pizza is fresh with great ingredients. Calzones are on point. Even the veal piccata is delish. It is also BYOB which is always a plus for a quick data night. Don't get me wrong, this place is crazy casual inside. Order at the counter. Watch the game while chowing down. If you eat there, they bring this bread made from heaven and even brought us ranch and sauce. The guys there honestly couldn't be any nicer. This place is exactly what we were looking for!"], ["Jacobie D.", "Anyone else think this place reminds them of Sabrro's? I ordered the Works. It could have been cooked longer. If someone else paid for it I'd think about ordering from here again but I'd probably just try to convince them to order from someplace else. But I wish them well it's a good location."], ["Heather L.", "Called ahead to make sure there was not a wait after a lousy experience waiting at Princi.  All clear, so we go.I ordered at the counter.  The guy told me that it is the best pizza in Dallas that I will eat.  You know what, he is right!  I think it is hard to compare different types of pizza with each other (Euro thin, deep dish Chicago, NYC, etc.).  This pizza is the New York type, and yes, it was fantastic!  Best NY pizza in Dallas.  Toppings are fresh and tasty sauce and cheese.The people that work there are genuine and friendly.  I would skip the calamari, but the pizza is great.  Will be back again and again!"], ["John F.", "Came here since it had such good reviews. Not sure what all the hype is about and was very disappointed. Pizza was a bit bland and service was annoying. Not saying it's terrible but with all Dallas has to offer we'll probably not be back although maybe it was just an off day them. Better luck to everyone!"], ["Randy S.", "Mimi's Pizzeria is a pizza joint located inside a strip mall shopping center.  While it seems the main focus is pizza, I did notice that they offer quite a variety of other Italian dishes.  The staff here was very friendly and the it did not take particularly long for our pizza to come out.  It pretty much looks like a family type restaurant so there wasn't all that much décor or atmosphere to speak of, but I don't think that really matters for a pizza place.This place serves solid, quality New York style pizza.  I thought that the thickness of the crust, amount of sauce, and topping distribution was perfectly done and I have absolutely no complaints about the quality.    I had the meat lover's pizza and appreciated how the pie wasn't overloaded with meat at the expense of the rest of the pizza.  That being said, it is a bit pricey for pizza but at least the quality is there.I'm curious about the rest of the menu and I'll have to explore the other dishes they offer the next time I'm around the area."], ["Sonja B.", "By far the best pizza in Dallas ! Great and friendly staff.  Variety on the menu. Fast service .  a+!"], ["Leon K.", "Mimi's has excellent quality food. The atmosphere is great as well as the staff. The pizza was amazing !! This is the only place that I'll be ordering pizza from. 100 percent authentic New York Pizza."], ["Amanda G.", "I was originally on my way to Mooyah's, when my BF acame across this place on yelp and boy I must say it was a great decision!! Everyone is very friendly and their food is delicious!! Best homemade Italian food and pizza I've had. Will def be coming back!!!"], ["Jeffrey L.", "Outstanding pizza.  The $20 large size plenty for our party of 5, and they were kind enough to prepare half of our pizza with different toppings!  Highly recommended!"], ["David G.", "Authentic NY style pizza.My new favorite place"], ["Cynthia C.", "If you're from New York, you KNOW what good pizza is. This place, my friends, is the closest I've found to New York Style pizza in Dallas.  Yes, it's extremely thin. Yes, the cheese is ooey-stringy-gooey. No, it's not crispy thin crust... it's NY style thin crust. And it is delicious! Parking in the lot = spacious & easy! Check!Atmosphere = casual, nothing fancy. Simple and clean with 2 TVs. Order & pay at the counter & they bring the pizza to you. 5 of us came here on a Saturday night & found ample seating for us. GOOD FOR GROUPS!!! AWESOME. (Much more than I can say about Serious Pizza, where the wait was 1.5 hours on a Sunday night) We ordered a Mimi's Salad $6.50 that was enough for all 5 of us to share a small plate. It's not a typical salad that consists of 99% iceberg lettuce. Instead it was FULL of ham, salami, and provolone. Also ordered a Spinach Cheese Roll to try - TIP: it's NOT ON THE MENU but it is SUPER DUPER GOOD! Would be a great appetizer choice while waiting for your pizza. Extra cheesy & rich. MM-MMMMM! Thinking about it makes me want another one. ONTO THE PIZZA:Love the simple pricing system.. everything made fresh to order. Probably only waited about 15-20 minutes for our pizza. Ordered the XL The Works Pie -- $17.95 they were generous with the toppings - pepperoni, sausage, hamburger, green peppers, olives, onionsAlso got an XL half Margarita & half  Mimi's  $17.95 (they were very accommodating & no upcharge for doing 1/2 and 1/2...which was AWESOME because I wanted to try both!) Margarita-- had the basil & mozzarella & fresh tomatoes. Very good!but the ULTIMATE BEST THING WE HAD was the Mimi's Pizza!!! Next time, I'm gonna get a whole Mimi's for myself! The most amazing pizza I've ever had without meat! Spinach, Garlic, EVOO, and Ricotta. Doesn't sound that mind-blowing doesn't? I know. but IT IS! GET IT! You won't regret it! For $50, you get 2 guys and 3 girls completely stuffed + 1/3 a pizza leftover. What a deal!"]], "Italia Express": [["LaLa K.", "This place is the Shiiiiiiziiiiit! Idk about their pastas but their pizzas are Bomb! They taste delicious, they're HUGE, and they're really really cheap! Can't beat this place"], ["Juan G.", "Loved it!!! Couldn't decide on what to eat for dinner while walking up and down Cedar Springs when this place appeared. Initially I was going in for pizza but realized they had pasta too so what the heck, can't go wrong with Fettuccine Alfredo The guy who helped us was very nice and friendly. Checked up on us regularly while sitting there and made sure to make us feel like a valued customer. Aside from the excellent customer service the pasta, cheese bread and garlic bread were perfect. I added chicken to my pasta and I was so pleased it was diced chicken!! Not those huge cuts of chicken breast they place on top of your meal."], ["Justin L.", "Been here a few times. This place definitely knows how to make great NY style, thin slice pizzas (source: grew up in NYC) . Their calzones and marinara sauce are fantastic as well. Employees are very friendly and welcoming. They've been super accommodating on every visit when I had to box leftovers to go."], ["HN J.", "Awesome pizza by the slice! It's borderline addictive. The staff is always so welcoming and attentive. Great in/out for carryout! I live off of Cedar Springs so it's a great joint to walk too and grab really good pizza! The bread is pretty awesome too! And the prices aren't going to break you not one bit."], ["Kaitlin G.", "This pizza place has some of the most grade A- for authentic people I have encountered in this city.  Whenever I need to feed my inner pizza demon, and I have visited Italia Express I've been treated warmly AND more importantly been immensely satisfied with the quality of pizza. I've have eaten pizza in what I roughly estimate to be about 20+ countries and their pizza is a front runner. Maybe it's just the quality customer service that makes it tastier, but I think being nice goes a long way. Call me old fashioned."], ["Roland M.", "Best bolognese in Dallas.  Rich thick and meaty.  The noodles are always al dente' and they do not scrimp on the portions.  The service is always warm and accurate.  We have been regulars since November of last year and we hardly ever miss a week.  The added bonus is the spot it has in the middle of the Dallas Gayborhood.  Right on Throckmorton and Cedar Springs.  The best people watching patio in the weekends.  Their marinara is fresh.  The pizza is New York style and oh sooooo good.  The dough is just the right chewiness and just enough toppings to satisfy.Sadly they are changing the the style of the place.  Beer and Wine is now served and soon the place will have mood lighting and supposedly better menu.  I welcome the change but I am somewhat skeptical of new things.   I will report if the service and quality of the eats changes along with the ambiance."], ["Ryan H.", "In the world of restaurants with \"express\" in the title, I can't imagine it getting much better than this.  It's a nice clean space with friendly, attentive staff who are ready to serve you up with some quick nothing-wrong-with-it pizza.  I'm not going to just sit and rave about the pizza, but it gives you a nice option if you aren't feeling one of those chain restaurants or a sit down neopolitan restaurant.  Also, it won't ever beat my first cannoli I had back in my Godfather-watching youth, but it's one of the better I've had.  I just got a huge slice of pretty tasty bacon chicken alfredo pizza and 4 cannolis for like $8; I'm happy."], ["Tiffany T.", "Oh my goodness! The HUGE slices!The best bang for your buck is to just order a whole pie! It comes in 8 pieces. They were happy to do particular toppings on half or a quarter of the pizza. We were really happy with their service! The crust is softttttt and not hard to chew at all."], ["Tim B.", "You would do yourself a disservice to discount this as \"fast food,\" or \"that place we get pizza after the bars, drunk.\" This place is fantastic. Their pizza and Stromboli are well executed, but the real story is their pasta and salad menus: they are well prepared, well presented and taste like somebody cares. Probably because somebody does. There is always an owner here, smiling and working. Don't miss out on a chance to eat here or take-away their food. You won't be disappointed."], ["Marie H.", "Cam here for something different to eat on our trip to Dallas. It was great, the food came up quickly and the staff was extremely friendly. I got cheese and chicken fettuccine bacon pizza and my friend got a spinach and cheese calzone. Both were delicious. The patio was also nice!"], ["Annie N.", "Italia Express is similar to Sbarro's, but slightly better. The restaurant offers a variety of standard pizza toppings (e.g. pepperoni, sausage, veggies and pineapple). I wish there were more choices though, but no complaints here since the slices are huge and cheap. However, I recommend their stuffed pizzas as it offers more flavor and are pretty darn delicious. Italia Express is a solid choice for a cheap, quick and pretty good meal. They also offer a variety of salads, strombolis, pasta and calzones."], ["Justin A.", "The Only Thing That's Better Than The Food Is The Amazing Attitude From The People That Work There! This Place Is A Must Go!"], ["Dar P.", "Pretty average pizza in my opinion. No complaints there. The guy working the register and taking orders was extremely nice. He even told me how great it was to see me and he was happy I was a customer. The restaurant is in a great location and very clean. What more can I say. Stop in!"], ["Heli M.", "This is a great spot for late night eats. They are open until midnight on the weekdays and even later on the weekends. The pizza slices are as big as your head, and they have a great variety of pastas and other Italian dishes. It's casual dining, but the staff is first class. I've been here a handful of times over the years (most recently last night) and always seem to have a pleasant experience. Yesterday they didn't have the pizza I wanted, so they made it for me-- a single slice with all of the toppings I requested. The only thing is- the food isn't the best. I hate to say it because I want to like this place so much, but mine was doughey and undercooked and my fiance didn't like his pasta either. I am open to trying them out again because of the service and convenience though- we shall see!"], ["Mary r.", "Italia express is a quick, yummy, and cheap pizza restaurant that i love. I go there all the time to grab a quick bite and the workers are very nice. Especially Charlie, Bubba, and Allie. They are always there and greeting everyone when they come in. I love watching Bubba hand spin the pizzas and throwing them in the air. Definitely a five star pizza restaurant in Dallas."], ["Sherry L.", "Loveee this place. My go to pizza place when it's 1am and I can no longer get delivery from the major pizza chains. The employees are always friendly and smiley. It gets pretty loud on friday/saturday nights but doesn't matter cause I'm usually drunk too when I go. The pizza is super yummy and satisfying and I've gotten the vegeterian one my last 4 trips. Huge slices for only $4.Parking was a pain last night, the parking lot near the restaurant was full... We ended up parking in a resident only area and taking our pizza to go."], ["Kyle G.", "The food is hit or miss, but it goes from decent to excellent, so you can't complain too much. The staff is always friendly, especially one 20-something male, who is the nicest kid in town.I'm always surprised that the staff is full of straight/frat guys, on the gay strip. If they're cool with working there, good for them.I've also seen Italia Express deliver to the bar across the street. I'm not sure if there is a charge for this, but it's a great perk.Don't expect to park here late at night, but there are usually a few spots free in the late afternoon."], ["Nick K.", "Not only is this the best pizza in the oak lawn/uptown area, but the staff is probably the coolest I've met. I've almost always seen Bubba or Charlie in there working hard and they're the nicest guys you've run in to. The price of a full pie is quite cheap, especially considering the size of the pizza you get for the cost. The pizza itself is amazing. Not overly greasy and cooked to perfection. I've had the baked ziti a few times, that was always good, and of course you can never go wrong with the garlic bread. They have an all meat stromboli that's pretty darn good too if you're looking for a change of pace. In the past year I've tried a lot of the menu items, and have yet to have something that didn't make me happy. Long story short, if you're hungry for good quality pizza that's not going to break the bank, this is the spot to check out. If you're at zinis across the street, you're wrong. We're moving out of the area in a few weeks, but will definitely be back down at Italia Express when we have a dire need for some pizza."], ["Michael S.", "This place is awesome! The speed of the service is comparable to sbarro in the malls, but the quality is far from average. The food tastes wonderfully authentic and flavorful, even down to the cheese bread that comes with it. Staff is nice and informative. Real nice place if your in the area or work near downtown Dallas."], ["Buddy H.", "Delicious, affordable, and great people watching. A decent variety of choices for a quick meal. Friendly, helpful staff who do their best to get you your meal warm and ready, as quickly as possible. Minus one star from perfect, because the self-serve sodas are a little too sweet, the chicken is a little too salty, and the mozzarella is a little oily. Large portions, big salads, and correct spice level. Fun, upbeat, and clean. Try the Stromboli."]], "Lucia": [["Jessica D.", "Thiis. Favorite. restaurant. in Dallas.Menu changes - but if it sounds remotely interesting, it will be delicious. Their veal chops have serenaded me on multiple occasions, I've never had a dessert here that hasn't had my salilvaries in overdrive, and their Valentines dinner prix-fixe chef's menu was delicious through n through. Hard to get a reservation, as you well know."], ["Traci S.", "Amazing true Italian cuisine.  Seasonal specials, that don't disappoint!  They only take reservations one day of the month, and believe me, you NEED a reservation.  Try several courses and bring friends to share, you will want to try the entire menu."], ["Louise S.", "I rarely eat at the same place multiple times so I had to add an update here as last night we had our fourth visit.As I previously stated do not be put off by the LONG wait for reservations. We have eaten there 4 times just by making phone reservations. True we have to wait 3 months sometimes but if you live in Dallas don't let it put you off. Make the call state your desired date/time/party number and wait.My tips are to be open \"I'll take any Tuesday in January at 9pm\"Yes, you'll still have a couple months wait but it will come round quick and it really is worth waiting for.(also follow them on Facebook for watching out for last minute cancellations and being reminded they they do always have a couple seats held for walk in)This visit was just as perfect as our previous times.Our waiter has been different every time and each time they have been friendly, knowledgeable and super helpful.This time we got Michael and he was fabulous.  He Knew exactly where to point us and had info on any foods we asked about.  You could tell he was enjoying his job and had a real passion for Lucia. This super hard to find and super special when you do. Lucia...don't let this boy get away!!!Of course you are here for the food so im telling you its all amazing. From prior visits we have learned to focus on the pasta and salumi plates. All the food is fantastic but the pasta and salumi plates will blow your mind. As our table mate declared after eating \"that pasta is ridiculous\"Our waiter told us they had recently aquired red wattle pig so some of the menu items (changes daily) focused on this.We ordered the salumi misti (this is the only constant on the menu and I highly recommend ordering it as all the meats are house cured)Also we got the 18 month red wattle prosciutto. Oh my..such delicate and tasty prosciuttoPasta we picked the rye budaletti and the parsley root with red wattle pork ragu.The good news it was freaking amazing.The bad news is the menu changes so often you may not get to try it!!But wait....not to end on bad news..the good news is I've never had a bad pasta there so order anything and I'm sure you'll love it.Our table mates did go for a non pasta entree and chose the steelhead (fish) This was cooked to perfection but a crispy top skin sear. So this last meal was just last night and you know what I'll be doing tomorrow....? Calling to reserve my next meal. Who cares if I have to wait a couple of months for it!!!!"], ["A L.", "The soup deserves five stars on its own. Love the foie gras on prune. The duck was tender and tasty. Service was great as well."], ["Michael U.", "Items Selected:Warm OlivesCrusty Bread with Salted ButterSalumi Misti - Speck, Fennel-Orange Salame, Coppa, Boar Ventricina, Duck Salame Cotto, Chicken Liver Crostini, Lardo Crostini, 3 Foie Gras Stuffed PrunesSmoked Sweetbread Mezzalune with Hedgehog Mushroom and Green GarlicPasta al Sangue with Spicy Red Wattle Pork Ragu, Broccoli Raab, Pecorino RomanoCocoa Tagliatelle with Braised Duck and Foie GrasHazelnut Cake with Chocolate, Prunes, Quince, Hazelnut GelatoCandy Cap Bombolini with Walnuts and PearsFrench Press CoffeeLikely Dallas' toughest ticket, the sort of place where a phone call at a designated date and time over a month in advance still cannot guarantee a seat, dinner at Lucia came with lofty expectations; the promise of perfect pastas and stellar house charcuterie in an intimate setting delivered upon from the moment I walked in the door until I hit the road bound for Austin two hours later.  Located in Bishop Arts and seating perhaps 40 Lucia is the pride and joy of Chef/Owner David Uygur and focused on cooking what is \"fresh and exciting\" his enthusiasm is clearly contagious - servers smiling and diners glowing amidst the long room with each plate, pour, and interaction...all the more so as the night progressed.  Beginning first with warm olives and hot, crusty bread it was with much debate that I perused a menu with perhaps two dozen options that all sounded divine but thankful to find half portions of pastas available the decision became less daunting, my request for four savory courses and two sweets marched out in procession.  Beginning first with a mountain of salumi plus three $1 prunes stuffed with creamy duck liver mousse each of the meats proved Chef Uygur's passion for the art and moving next to a trio of pastas it was here that 'good' transitioned to 'great' - the mezzalune nearly transparent pockets of creamy offal softened by garlic, the gamey blood tinged noodles perfectly al dente finding balance in spice plus acid, and the light chocolate notes of the tagliatelle proving a deft base note to the richness of duck and foie - the later an early contender for best thing I've eaten this year and a perfect transition into a pair of innovative desserts, both lighter than one would expect and impressive in their restrained sweetness allowing fruits, nuts, and mushrooms to shine - a remarkable end to a memorable meal served by people that seem to want little more than to make guests happy while doing what they love."], ["Debra T.", "Lucia was amazing and I highly recommend this place for anyone even thinking, \"Is it worth harassing Lucia for a reservation?\" The ambiance of this restaurant is very cozy and romantic, really a great place for dining with great company. My boyfriend and I had such a lovely time here. So yes, it's worth waiting until the first of the month and calling a million times to get through for a reservation. We ordered a few foie gras stuffed prunes, rabbit loin roulade with pancetta tesa and rabbit liver mousse, endive salad, roasted chestnut mezzalune with caramelized onions, pancetta, and baby kale, red wine and porcini risotto with wild mushrooms, crispy rabbit leg with root vegetables, cauliflower mushroom and Calabrian chile honey, and dry aged Texas wild boar chop with cavolo nero, black apples, and polenta taragna. It all was truly delicious and I really enjoyed the dining experience here. The staff was extremely attentive, friendly and helpful with making choices on the menu. Plus, the menu changes often, which I like. Highly recommend and don't forget to call the first of the month for reservations!"], ["David S.", "My wife and I finally got over to Lucia's . We have tried several higher end Italian style eateries and this is by far the best. Our server was knowledgable and took the time to explain the entire Menu. We had the cheese plate, soft shell crab, and salami plate. All were very good. All the pasta was made fresh so we both ordered the fettuccine. Tremendous!!!!' I had the sorbet for desert and what might have been the best coffee ever served in a restaurant.If you are consider Lucia's go there soon!!!"], ["Drew C.", "Best restaurant in Dallas.  Creative menu that changes from day to day.  Everything's prepared perfectly.  If you can dine at only one restaurant in Dallas, this should be it."], ["Jacqueline C.", "Lucia is a name I must have heard a dozen times before building up the resolve (and patience) to call on just the right day to make my \"one month wait\" reservation. Given the high praise from friends and the wait list time, expectations were (probably un-fairly) high, and not all aspects of my experience lived up to the hype. The high points are the boho chic decor, exotic ingredients transported from Italy for authenticity, and quality of their wine selection. The dining room, the staff, and even the dinnerware were enchantingly similar to meals on the Cinque Terre. But, while the cheese board and meaty entrees were fantastic, the pasta dishes were disappointingly bland. We also sampled most of the desserts, which together averaged a four star rating from our group."], ["Pat Q.", "First, I would like to address a review below from another Yelper that gave the restaurant one star.  Even though I do not agree with her, everyone has a right to their opinion and I respect her  thoughts and review.  She was disappointed because there was not a lot of pasta dishes on the menu and the food was pricey.  On that note I would like to  warn possible restaurant goers that Lucia's is not the same as Olive Garden where you can build your own pasta dish, which yes gives you more options, but the quality of the food cannot be compared to Lucia's.  I'm not bashing Olive Garden!  Love OG and it is great for a commercial type of restaurant that is more economically priced but packaged pasta just doesn't compare to homemade pasta fare.  Each restaurant stands on it's own for what it offers!  However, I do completely agree that I wish Lucia's would offer more pasta selections because it is so awesome!!  Now my thoughts on Lucia's.  I would have given 4.5 out of 5 stars if Yelp would provide a 4.5 star rating option.  There are pro's and con's.  The service was incredible.  Our waiter's name was Gadi and he was spot on.  Very friendly, helpful, professional and knowledgeable.  Also there was another lady, I don't remember her name, but she was so bubbly, funny and helped us with our wine order.  The menu is a little complicated but Gadi assisted and advised us right through it.  What I loved about the specialized menu was that most everything was something that I had not seen on any other restaurant menu.  Very Italian yet no red sauces, Alfredo sauces or lasagne like most Italian restaurants offer.  I saw Black Cod, Rabbit, Chicken Pate, Scallops, etc.  There were four of us and we ordered 1 large appetizer, 3 pasta dishes which were smaller in size, perfect for second course, 2 entrees and 2 desserts for the table to share.  My favorites were the risotto, another dish with some type of pasta sprinkled with shaved white truffles and a beef sliced tenderloin dish that was outrageously good.  Any and all pasta that is served at the restaurant is handmade daily.  You can really tell the difference in handmade verses packaged pasta.   That in itself is so appreciated!!!  The restaurant is small and quaint which is a plus once you get in and start to enjoy your meal.  You feel special that you have a seat that few get to enjoy.  However, the downside is that I could go more often if they had more seats because reservations are hard to get.  The only other negative in addition to the hard to get reservations is about the parking and the neighborhood.  Parking is terrible!  We had to park down the street which is in a residential area and we felt a little uncomfortable walking so far away, in the dark, late at night by ourselves.  I would prefer to pay extra for a valet where we could get in and out in front of the restaurant.  I will be back for another Lucia's experience to try something new that the Chef has created special for those patrons that are lucky enough to get a reservation."], ["Brian H.", "Service + food = ?When you receive great service snd average food, how do you describe the experience? When you receive indifferent service and above average food, is it any better? I would describe my recent visit as the latter and honestly still a bit confused if I would ever return or even recommend. I was lucky enough to get seated after a last minute decision to dine. The hostess was very outgoing and welcoming. However once service started I was less than excited. We were immediately offered a drink menu and ordered a great bottle of red. The waitress didn't ask if we had been there before or of any off the menu items - maybe that's not the in thing to do anymore? She then returned and asked \"what do you want to order\", again not really selling me on what makes them any different than a fast casual place. After ordering, she gave us a puzzled look as only I ordered a primi, secondari and main course, the person with me ordered only 2 courses. Before I get into the food review, I will state that the wine was great, the bread is amazing, the decor and vibe of the place also above par. The foie gras prunes were quite tasty and a nice starting point. The smoked salmon was ok at best and didn't really match the rest of the menu. It had rubbard slices which really added nothing to the dish, actually it was a distraction and had no flavor. The pork ragu, sweet corn pasta and Berkshire pork chop were amazing, along with a spectacular peach semifrddo. Overall very happy with the food, minus the salmon plate. As for the service...maybe she was having an off night, maybe she was new, maybe she was tired. Either way I cannot believe that a place as busy as they are would allow such indifferent and uneven service. Not once did she check and see if we were enjoying our meal. When dishes were brought to the table, they were dropped on the table and the server walked away. What ever happened to the art of describing what was on the plate, and before anyone ask, the place was not full and has more than enough time to describe their great dishes. She never once smiled and didn't really act like the caliber you would expect from what appears to be a very successful place. Maybe she didn't like my blue shirt or hates people that wear khakis? I'm not sure but overall I was completely underwhelmed and it actually left a bad taste in my mouth. My dining partner even made a comment about the poor service and they never complain about service. Overall would I go back? Probably not, food was really good - not great and too many other Dallas restaurants offer much better, much more appreciative service along with tasty food. Service really does make a difference."], ["Janeen G.", "Was looking forward to this occasion but feel let down.  From start, i was disappointed in the experience.  We arrived a few minutes early and were ushered to Dude Sweet Chocolate to wait.  Huh?  Very strange.  At any rate, most everything was too salty.  Course one was Crostini with zucchini and cheese.  Best course.  Course two was scallops and gnocchi...a couple of chunks of scallop, gnocchi too salty.  Course 3 was monkfish...too salty.  Desserts not appealing enough to try.  Dinner for 4 plus one bottle of wine was over $315 plus tip.  Definitely not worth it.  Give me Del Friscos any time!"], ["Ash S.", "AMAZING. Must go and try everything! Wonderful for special occasions but must be a small party. The place is lovely and intimate so it's perfect for romantic occasions as well. Truly some of the best food in town, if you can get a seat!"], ["Luca G.", "Words can't describe how great was our experience here.My wife and I went for our anniversary to this little cozy restaurant and if you've ever been to Italy, you know what I'm talking about.I'm italian and for just a moment, sitting at the table, savoring an extraordinary Risotto, I thought that my mom was there, cooking in the kitchen...Thank you for bringing me a piece of Italia.I can't wait to go back.L&E"], ["Reena D.", "Everyone raved about Lucia and we finally were able to make it on the reservation list.  This location is really small. We were greeted by our waitress.  I started off with the cheese board which was good.  My husband and I started with the Risotto.  The Risotto was really rich and good but after a few bites it was just getting too salty.  I ended up ordering the Tonarelli as my meal and it was really good.  It reminded me of when we were vacationing in Europe.  My husband ordered the Wagyu and said it was decent but felt like everything he had here was on the salty side.  The food here is rich and some of the items do tend to be on the salty side.  Our experience here was decent but maybe I expected more. Our waitress appeared annoyed with us.  Maybe we were just asking way too many questions for her but we wanted to make sure we ordered the right items."], ["Angel N.", "Quaint, cozy, and and super friendly service.  As we all know getting a reservation at Lucia is always a month + out.  I guess with the small quarters here it makes it hard to accommodate a large amount of clientele at the same time. I guess this is what makes Lucia exclusive and hard to get in?  The food has superb quality made with fresh ingredients or housemade pastas, but it's not jaw dropping OMG to me.  I would defiantly frequent this place, but I don't follow the hype.  We started the night off with Prosecco that our server was proudly asking every table.They give you house green and black olives that is dressed in olive oil and rosemary.  I am not really an olive fan b/c they are normally too salty but these are not overly salty!  And the bread and salted butter... man that was so delectable as well.  I was smearing my bread slice with thick smears of the butter!Antipasti: -Salumni Misti-  a variety of cured meats that paired well with the pickled veggies and fennel. -Potato cake with green garlic:  pieces of crisp potato cakes incorporated with bits of cheese and adorned with green garlic.  This was my fave!Primi:   -Ricotta cavatelli:  gnocchi like pasta that is made with ricotta in a cream sauce that had pieces of crumbled sausage and a generous amount of shaved black truffle.  The cream sauce wasn't overly thick or creamy, which is perfect for all of the other dense dishes that I was eating. -Casoncelli with hedgehog mushrooms:  this were moonshaped filled pasta that was served with some hedgehog mushrooms that were a bit too salty for my taste.  The filling had a smoky flavor that I wasn't expecting either.  Secondi:-Veal chop: a large chop that was enough to feed 2 that was cooked medium and had a caramelized crust on the outer edges of the chop.  There was a little bit of butternut squash puree on the bottom of the dish that wasn't enough to eat as a side but was only enough to dip the veal in here and there for every other bite I had.  The chop also had delightful Brussels sprouts atopped of the chop that was good to eat with all of the protein I was having."], ["Matt C.", "I am not a foodie. I really don't know much about fine dining. Fine dining to me is Pecan Lodge or Franklin's in Austin. My girlfriend is a huge foodie and really enjoys trying out new, popular, fancy restaurants. We were celebrating a special occasion and I knew this was one of the restaurants she has really wanted to try. My experience at Lucia was amazing. Everyone was incredibly helpful and patient with my obvious lack of experience in this setting. We started with a meat and cheese plate, there's a fancy word for this but I honestly can't remember it, I then I had a pasta dish with truffles, and finished with short ribs. Absolutely an incredible experience and the food was some of the best I've had ever had. Thank you to the entire staff for making the evening an experience I will not soon forget!"], ["Katy Q.", "I had heard so many good things about this place, and a friend was finally able to get a reservation 6 weeks ago. He called 8 minutes after it opened for reservations on the first of the month, and got one of the last few seats on a Friday night. Its small but personal, as the staff is extremely friendly and the waiters will give you the rundown of all the menu items. This is especially helpful for people who don't know anything about Italian (guilty). The service is surprisingly fast too. The menu changes daily, but these were some of things we ordered -For our antipasta course, we tried the Salami Misti (good mix of meat variety), the Frisco del fattore (creamy potato cheese pancake), the Cauliflower soup (savoury with a hint of fall), and the Sea urchin crudo (cucumber provided freshness with every bite). For our secondi/main entrees, we tried the Tagliatelle with veal ragu (meaty bits complimented the thick noodle but had a slightly overwhelming smokey taste), Texas waygu coulotte (the local version of Kobe beef, which was pretty good but I've had better), and Semolina gnocchi with smoked duck (WOWZERS never had duck prepared this way before... the flavor of duck with the juiciness of ham and the texture of amazing steak. Impressive). For finishing up our meal, we shared desert items Citrus semifreddo (zest was too bitter and the gelato left a lingering aftertaste) and the Ricotta can noli (which is pretty good if you like banana). Overall the dinner experiences were all made with quality ingredients and I definitely regret not having tried more of their homemade pasta. But minus the duck and the squishiness of sea urchin, it was not extremely memorable."], ["SUSAN T.", "Hostess  needs to stop! The gig is up. We know what your doing with the  reservation game. Stop  acting like we are lucky and doing you a favor by sitting at a \"canceled reservation table\"  that magically appears  10 mins after opening while 4 table were open for 2 hrs around us.  Be a little more gracious and inviting. Food was good but not worth  that hassle  of a 4 month in advance reservation  just to have someone  tell you to try again in 4 month. Wrong. You need to call the guest your guest back."], ["Geremy F.", "We could go on and on about how much we love Lucia. Every meal...every dish we've had here has been exquisite. The location is great in Bishop Arts. The restaurant interior is comfortable and inviting. The staff is always very kind and helpful. Bring people who like to share so everyone can try a bite of each dish that is served. Plan on Prosecco, each and every course, and dessert. You won't regret any of the menu options. We truly love this place. It is without a doubt our favorite restaurant in Dallas and our go to place for celebrations. We love Lucia and highly recommend it."], ["Robert Z.", "If you want to treat your taste buds, look no further. Simply best authentic italian meal you'll have.  Hands down.  The menu changes every day I believe.  You have have to make reservations way in advance at this place as its a small but cozy place. Tables are right next to each other so it can be a little loud.  The food is amaze balls though and I would highly highly recommend this place to any one and everyone.   I would recommend getting smaller portions of every dish to maximize the different types of food.  Be prepared to spend some money here for an italian joint."], ["Molly M.", "Finally got a chance to go here last week, and I loved it. First off, the service was exceptional. We had the small salumi misti and some foie gras stuffed prunes to start. The foie gras was perfect, and had a wonderful nutty flavor that worked very well with the prune. The texture of the foie was lighter than I'm accustomed to, but I thought it worked well. The salumi misti was good. They make a lot of their pork products in house for their service, and I appreciate that--you could definitely tell it was prepared with love. However, a tad more variety in terms of flavor profiles would have sent this over the top for me. We ordered the farro with chicken offal, and the beef cheeks with gnocchi as primi. The chicken hearts were delicious--perfectly prepared. But the farro was so salty I couldn't eat it. However, when our server asked how it was and I reported my complaint, it was replaced and it was perfect (and it was removed from our bill). We shared the rabbit with cauliflower puree, which was wonderfully rich but not overpowering. I've eaten a lot of rabbit, and this was perfectly cooked. I assumed it was prepared sous-vide but the chef informed me that it was seared and basted on the burner (which I still find hard to believe, given the remarkable consistent texture). Dessert was delightful--we shared the olive oil cake with figs, whipped cream and toasted pistachios. It had a wonderful combination of earthy and citrus flavors that I would hope for in a traditional Italian olive oil cake. Overall, the service was the shining part of this meal--they were exceptionally attentive, one of the owners came to speak with us and brought us wine, and when we had a complaint it was immediately taken care of. The food was generally quite good with a few exceptions. I will definitely go back to try their new menus."], ["Martha R.", "Here's the dealio on Lucia. It falls somewhere in between good and great. I'm slightly perplexed why it is so difficult to get in as I've had comparable dining experiences in Dallas without all the fuss, but on some level I respect the genius scheme as it likely keeps them full each night.They lose a star because the mildly pretentious reservation system is over the phone. It is 2013. How about we do this online?Any-chia, since it was our first time, we went for the full 4 course experience. EVERYTHING (including the service) was a fantasm. My favorite dish of the night was the truffle risotto - just ahead of the rice pudding. Back to the service. It was relaxed and attentive without being stuffy. Difficult to articulate, but trust me when I say all fine dining restaurants should take a cue.So, yeah. Go. Do the entire experience on your first visit and cut it down to 2 or 3 courses on subsequent endeavors."], ["Yu H.", "First things first, which is that you need to make reservations at least 1-2 months in advance to get a seat at this restaurant because it's very tiny (seats around 30) and is quite popular. It's a very cozy restaurant with all of the tables right next to each other so you can hear the conversation next to you. This could potentially be awkward but our neighbors were fine. The service was really good and they are really good at explaining their dishes, which is to be expected.The first and second courses are best shared in my opinion. We had the salumi misti for our first course which is their house special. It came on a platter with all sorts of different cured meats which were delicious for the most part with the exception of the chicken liver which was rather unappetizing. For our second course, we shared the gnocchi with wild boar meat which was very flavorful. The boar meat was gamey but fell apart easily which was very nice.For my entree, I had the duck breast which I ordered medium-rare but unfortunately it came unevenly cooked with about 1/3 of the slices of duck being rare and nearly inedible. That was a shame because the rest of the dish was fantastic with the chanterelles being especially tasty. My date had the Wagyu coulotte which was perfectly cooked at medium rare. The mushrooms and sunchokes were really flavorful as well. The rest of the salad that came with it didn't seem like it fit the dish well and we left a good portion of it on the plate.Overall, it was a good but not great dining experience mainly because some of my duck breast was very undercooked. For the cost and difficulty in getting a reservation, I will probably not be returning for a second visit."], ["Amanda S.", "What can I say about Lucia that hasn't been said before?  This place is AMAZING!Yes, you have to book reservations a month in advance, but I had no problems getting a reservation for our wedding anniversary on the night and at the time I wanted.  Just make sure you call the day they open the reservations for the month and call early!The decor was lovely.  It's a small place, but very quaint.  You almost feel like you're in someone's Italian home.  And the service was excellent!  Very friendly and knowledgable.Food...where to begin with the food?  You order all courses at once and I would recommend an appetizer, at least two small pastas and maybe splitting the main course.  That's what we did and we had plenty of food!  You have to try the foie gras stuffed prunes, they're small and at $1 each, you can join the adventure club and splurge on one.  You'll wish you had ordered six!  We also tried the burrata, which was good, I mean how can you mess us burrata?  My only complaint was the pairing...it came with green beans, which I found odd.  The bread is fantastic though!  For pasta, you can order in two different sizes...go for the smaller size and order a few different ones!  They're wonderful!  We tried the gnocchi with morels and the taglierini cacio e pepe (cheese and pepper).  The sauces were very similar, and so rich and yummy!  Next time I'm skipping the burrata appetizer and trying the Bucatini all' Amatriciana with Stracciatella (tomato based sauce with burrata).  The table next to us ordered this and it looked fantastic!  For our main course, we split the veal chop, which was sous vide to perfection!  Keep in mind, the menu changes, and these were our options for the night.  I'm sure it's all good and I'd be willing to test that theory with future visits!My only real complaint, and it's small (hence the five stars), was the wine list.  Most of the reds are Italian reds.  Makes sense right?  Well, as a couple who loves red, but hasn't found their niche in the Italian red market, a few other options like a solid pinot or cab would have been nice.  We tried the pinot they did have and it fell flat, especially against such amazing food.Go to Lucia.  Call now, go.  Whether it's a Tuesday or a Saturday...it'll be worth it!"], ["Dirk W.", "After hearing about this place for several years and generally resisting the 30+ mile drive to Bishop Arts, we gave in...and  wow was I surprised.  This place is awesome.   Our waiter, Michael, was attentive and friendly and helped us pick a great bottle of wine and walked us through the menu.  We started with cured meat tray, enjoyed a perfect green tomato salad and finished off with a lamb chop entree.    Highly recommended."], ["Shondip C.", "This was my 3rd, and likely last, time to Lucia.  I don't say last because something went terribly wrong, but rather because we're moving out of Dallas in the next month.  My wife called near the end of May and got us added to the wait list.  For those who haven't experienced it, Lucia only takes reservations starting at 9am on the first day of the month, for the following month, and generally fills their entire months availability by 9:30am.  In fact, you have to either have connections (I imagine) or be incredibly lucky to get a weekend reservation.  If you don't get a busy signal, or keep calling back until you get through, you get to leave a voice message with your preferred dates, and times, and the number in your party.  They call you back to confirm your reservation, if you got it.  Given this ritual for the privilege to dine at arguably Dallas' finest restaurant (I would argue for it), we were happily surprised that after calling and getting put on the wait list for the following Tuesday, we were offered 1 of 2 cancellation slots.  So we happily took 2 of our close friends and made the trek to Bishop Arts for a 9pm dinner on a Tuesday at the sacred Italian establishment.  Here's a my little editorial.  When we moved to Dallas from Chicago, we knew we'd only be here about 3 years.  I made a casual goal to patronize as many of the top 100 Dallas restaurants that we could in this time (D Magazine publishes a list).  Now that we're near the end, I can say that we only made it to about 1/3 of them.  Oak, the restaurant rated #1, did not make my top 5.  I felt it too pretentious, overpriced, and the food, though good, either too salty or not well balanced.  Lucia is my #1, and it seems based on their popularity, that I may not be alone in the Metroplex with that assessment.This speaks both to the quality of the experience at Lucia, but also, I believe, to the demand for high quality eateries in the Dallas area that is still underserved.  In the last few years, several top chefs have opened locations (think FT33, Nona, Tei An), but demand is outpacing supply.  More and more professionals are moving to the area every month, (the latest news being Toyota Motor Company announcing that it will move it's NA Headquarters to Plano from California), however, the East and West Coasts still seem to get the majority of the attention from world-class restauranteurs.  This may be fast changing, all I know is that if I was going to try and open a cutting edge new restaurant concept in America, Dallas would have to be at the top of my list."], ["Melanie T.", "A-MAZ-BALLS in the most un-foodie verbiage possible. Can't wait to go back, great atmosphere, deliciously light Italian fare, wonderful service (Michael will talk food porn in your ear the whole time), and delicious wines - what more could a girl ask for?"], ["Linda E.", "I was so excited to have gotten into Lucia for my birthday via a last minute cancellation! We were told the waiting list was 2 months out. Like many others have speculated, this seems like a false creation to give the illusion this place is in more demand than it actually is. The restaurant is small so I can see how availability would fill up quickly, but we found the restaurant to be half empty the majority of our time there.One of the hostess greeters (who we later found out was the wife/owner) was extremely kind. She opened the door and greeted me, wishing me Happy Birthday! Unfortunately we were seated and got the polar opposite treatment from our waitress. You could see it from the get go. You know, the kind of person that has a permanent scowl on their face. There were several mentions of her in other negative reviews and I don't doubt that it is the same waitress (all the other wait staff were male). Sadly the whole experience was ruined by this one waitress. Every interaction with her was pretentious and painful. She seemed so annoyed and inattentive, like we weren't worthy enough to be in her presence. We started with some drinks. I requested a Grey Goose and tonic, in which she replied with \"We don't have alcohol, I wish we did. We only have wine.\" I decided on a white and my husband got a red, which she proceeded to spill on his phone. She didn't apologize at all and looked annoyed that she had to go get a towel to wipe it off. It was the very bottom of the bottle and he mentioned it tasted like it had turned, that it tasted very sour and vinegary. He had already mentioned he wanted a more bold wine and he reiterated he was looking for something more robust wine with some peppery notes. She immediately cut him off and said \"we don't have anything like that,\" grabbing his glass and walking off annoyed. She came back with a blend that was a little better. At this point we just ready to move on.We asked her to explain some items on the menu. Despite her saying \"All of it's good\" over and over her actual explanation made none of it sounded appealing. \"Oh that's basically a fettuccini noodle...that's like a chicken noodle soup...oh that meal is just pasta, no meat.\" We could not get any sort of fan favorite or recommendation out of her to save our lives. Disheartened we decided on two different boards for our antipasti, the Salumi Misti and the Cheese Board. She said we had to order all our food at once so we hastily ordered a Primi and Secondi dish, letting her know we planned to save room for dessert. She sighed and we said \"Is that not enough food?\" Her sarcastic response was \"If you don't eat a lot.\" The fact of the matter is we had never dined here before. We didn't know how large or rich the dishes would be. This is Italian food! If we're still hungry we can always order more. It was a moot point, she had already written us off. She attended her other tables who ordered bottles of wine and plates of food. It took us three attempts to try and get some bread, which she deliver 30 min later after we had already completed our salumi and cheese boards. We sat most of our meal with dirty dishes that were piling up. After another waiter picked them up for her she came came to wipe off our table haphazardly dumped most of the crumbs in my lap as she looked off to her other \"more important patrons\" that were obviously spending more money. All in all it was such a disappointing experience. Despite us ready to spend several  hundred on a special birthday dinner we were treated like second class citizens. She even tried to charge us for the glass of wine that was sent back. We got a pen to sign our check that was out of ink. The night was just a series of missteps, one after another. The food was okay, nothing earth shattering like the other reviews have stated and definitely nothing that could offset the steep price tag for such horrible service. We sadly opted to skip dessert and just get out of there altogether. Despite most restaurants offering a complementary Birthday dessert we never got so much as a \"Happy Birthday\" uttered from our waitress. The last blow was the table next to us getting a candle in THEIR Birthday dessert as we were leaving. Nice. On our way out my husband mentioned our horrible experience to the wife/owner. She was appalled and very apologetic, asking us to please come back and give them another chance to make it right. We politely declined. At this point it we wanted to be nowhere near the presence of that waitress. The owner insisted on buying us an item at Dude, Sweet Chocolate next door, which was a kind gesture. Unfortunately the damage was already done. An exceptional waiter once said to us \"We live in Dallas. There is great food all over town! What keeps people coming back is the great service.\" He couldn't have been more right. Unfortunately there's only one chance to make a great first impression, and boy was this a bad one."], ["Britton Y.", "I'll start by saying I am not a picky eater.  I have traveled and lived all over the world and feel as though I've got a good head on my shoulders when it comes to trying new things and knowing what's what in the culinary world.  So that brings me to Lucia.  My wife and I were in the mood for some seriously good Italian food so we got online and looked up the best spot in Dallas and Lucia was number one. So we made a reservation for our anniversary and we were excited to eat some authentic Italian.   What we got can only be described as tex-italian.  The menu is full of foreign words whose translation does not indicate what you actually get.   What is the point of a menu, if you cannot determine what you are getting?  We ordered a cheese plate and meat plate for an appetizer and $32 later, the food volume of two eggs showed up.   We expected a typical plate of cooked Italian meats and instead got fatty slices of over salted chew toys and mini slices of bread with liver spread.   The cheese plate (remember total volume equivalent to an egg) had four pieces of cheese.  Two were completely inedible.   I do have to say the bread was good.   For the main course we ordered two $23 spaghetti and sausage entrees.   From what I could tell on the menu  we both expected spaghetti, red sauce, and slices of sausage.   What showed up was an ice cream scoop sized ball of spaghetti with ground up jimmy dean sausage and white cream poured on top.   I do not like the over spiced smell or taste of cheap American sausage and that is exactly what we got.   If you can imagine biscuits and gravy but with spaghetti instead that is a perfect description.   The sausage smell was completely overwhelming and not in a good way like the European sausages I grew up eating.  My wife tried to eat it so she didn't offend, but only managed a few bites.  I took one bite and refused to take another.   I got mine packed up because my wife didn't want to offend the owner.   $120 later and after eating the equivalent of two eggs we walked out and looked for a trash can to ditch the sausage so it didn't stink up our car.   This experience ruined our anniversary.   We felt so sick about wasting the time, opportunity,  and money we couldn't even bring ourselves to eat McDonald's on the way home and ended up going 24 hours between meals due to our disgust.  The bench that I sat on was horribly uncomfortable and I couldn't hear my wife over all of the noise.Some restaurants try to be so unique that their food just becomes weird.  This is that kind of place.  Small portions, lack of fresh ingredients, over priced, tex-Italian.   SKIP IT!"], ["Melissa W.", "Yum! Perfectly seasoned- the seafood pasta will make you cry. Worth the wait for a reservation. We will be back!"], ["Chris C.", "Really the best restaurant I have ever been too, on plant earth.  (ok maybe the restaurant at BlackBerry Farm is better) but Lucia is the best place you can go to with out having to travel to Tennessee.  Atmosphere, service, and my god the food.  We have been there three times since it opened a few years ago. and every time you forget just how great the place is..Believe it when people tell you it is the best.. for once that statement is true.."], ["Michelle B.", "WOW! Phenomenal! Sure wish I could remember everything we have had here, just know it was all amazing! Wagyu beef, veal raviolis, lamp chops.  I feel stupid for not writing this sooner, but better late than never. If you are looking for a romantic evening out- this is a GREAT start. It was so fun to nosh and then have some fun perusing the Art's district! The owners really work hard to make your experience personal and fantastic!My only complaint is the reservation process is a bit ridiculous.... it seems it might be more for the hype. Each time we have been in, tables have been available..... The hype is already there so this seems a little unnecessary."], ["Jen W.", "If you're wondering if Lucia will be worth the hassle/wait for a reservation, the answer is YES!Offering a very cozy interior, the size of Lucia quickly explained why there's such a wait list...I think I counted 12 tables.  And, then we tried the food, and the reason become even more clear.We started with Foie Gras Stuffed Prunes, which were creamy and very tasty.Like any good Italian joint, they offer Primi and Secondi options, so that you can start by splitting a pasta and complete the meal after with an entree.  However, their Primi options are all 2 sizes, so that you can make the larger your entree, if you prefer.  That night I was really in the mood for pasta, so that's exactly what I ordered...Rye Tagliatelle with Red Wattle Pork Ragu, Rapini, Caraway, and Mint.  It was very, very flavorful and a nice portion size.We capped off the night with the Buttermilk Panna Cotta with Figs and Almonds.  Being an Italian gal, I know my panna cotta, and this was great.  Such light, delicious flavors with a nice crunch from the almonds.  Really simple and perfect.And, the price for this homemade/high quality meal was very reasonable...my portion (including tip) was $78...for an appetizer, very good pasta, 3 glasses of vino and 1/2 dessert, that's a deal in my book.Tip--you have to call on the 1st of the month to make your reservation for the following month.  They may take walk-ins, but I'm not 100%Street parking was easy for us on a Wednesday night, but not sure how it would pan out on the weekends."], ["Aaron B.", "I called this place (Lou-See-Ya) for a long time before i was corrected, because well, I have no class. I went with 5 friends after an event, and we did a family style type dinner. While most dishes were wonderful, the cured meat was not to my liking. HOWEVER, it was well received by my friends. I would come more often if I didn't have to wait an eternity to get a table. That's the only real gripe I have. Which, to be honest, is not bad at all."], ["Ashley F.", "Somehow we walked in without a reservation and were able to get a table 20 minutes later! Apparently this is extremely rare.. But wow was it delicious. The pork shank was amazing, the squash ravioli was so flavorful and the dessert was YUM. Honestly though, it was the service that really blew me away, the waitress explained everything on the menu to us, the chef came out multiple times to ask us how the food was, and from start to finish we just had a wonderful experience! We will definitely be recommending this place."], ["Katy B.", "Best Italian restaurant in Dallas.  You must make reservations a month in advance, but it's worth the wait!   Ambiance:  Very small, intimate.  Food:  Amazing.  The charcuterie plate is the best in Dallas, well worth the price to get a tasting pasta and main course.  Can't go wrong with anything on the menu!"], ["Liz S.", "Simply put: the best food in town!Lucia provides an intimate and unforgettable dining experience each time I go.  Located in the heart of Bishop Arts district, Lucia is nothing more than a small room with no more than 10 tables.  This isnt the type of restaurant you can just pop into expecting to be seated. They take reservations on the 1st of the month for the FOLLOWING month and yet are still always full.The menu is always changing but if you catch a day where the olive oil cake is on there, it is a must order. The service is always great, the food even better but it is a special occasion only with the prices.  Lucia is worth every single penny plus more."], ["Francisco A.", "The food was decent and reasonably priced but the overall experience felt like a kick in the balls. Getting a reservation is an egregiously annoying process fueled by the artificial demand their tiny space generates that feels akin to begging. I have been to plenty of nice restaurants that have long waits; except that they actually understand customer service and will do things like pick up the phone when you call instead of awkwardly funneling you through an impersonal voicemail system, and then calling back at odd hours and offering a random time and date in a \"take it or leave it\" fashion. The fact that a restaurant with such a bad initial customer experience is still in business was enough to pique my interest. The awkwardness continued the night before our reservation when I got two frantic calls from somebody at the restaurant. The first was to demand a credit card number; I suppose as some sort of ransom for the privilege of keeping the reservation. The other, sometime after 10 PM, was to let us know that they took the liberty to change our reservation time. So the next morning I had to scramble to let everybody know that the time had changed. Most of us got the message but a couple of people in my party didn't and thus not everybody showed up at the newly allotted time. We were kindly informed of the restaurant's strictly enforced policy of not allowing people to be seated until the entire party is present. Instead, we were forced to stand in the tiny entryway as punishment. Even my very pregnant wife was forced to stand for half an hour while cold faced waiters pushed by. No exceptions. In hindsight, we should have left at this point but the rest of my party informed me that they were on the way and all of us (sans the pregnant wife, duh) had a couple of glasses of mediocre wine in our empty stomachs. This shit better be amazing, right?It was good. Not amazing. Definitely not worth the trouble. The thing about Italian food is that it's super easy to make at home, and nothing is better than a plate of homemade pasta. Even \"fancy\" stuff like foie gras is not hard to make at home, and often better than what you will get at even a nice restaurant. The best dishes were the simplest: foie gras stuffed prunes, fried squid, fresh pasta with a veal ragu. The freshness and quality of the ingredients made the plates stand out. I was particularly underwhelmed by the salumi and cheese plates. My ears perk up whenever I get wind of a place that makes their own charcuterie. I was hoping for something at least on the level of Armandino Batali's Salumi (a place I used to have lunch at once a week) but I was mostly unimpressed with Lucia's creations. The only cut that had flavor and depth was their take on fuet; otherwise, I think they would have done better with whatever Central Market's deli has to offer. Better yet, Meat Parlour's delicious coppa would have been a nice addition. Speaking of Central Market, the cheese board was equally unimpressive. Nothing against CM, but a large store like that is only going to have access to whatever commodity cheeses are available to the mass market. I would have expected a restaurant with this much hype to have exclusive relationships with artisan cheese producers. Instead, we were presented with a pretty standard selection of the kind of Italian cheeses you can buy at your neighborhood grocery store. Granted, I'm a big cheese snob, but all of the best Italian restaurants I have been to either make their own cheese or have a relationship with somebody who does. The ingredients ultimately shape the meal, and thus the uniqueness of a great restaurant lies in their ability to source the freshest and the best.Thus navigating Lucia's menu is akin to having a conversation with a person with a giant vocabulary but little substance. Lots of unfamiliar Italian words for simple pastas and cheeses, the typical mention of an exotic sounding ingredient, and yet despite the pretension there was nothing particularly valuable about the noise. The plates are rather simple, and admittedly well made. Nothing about the menu, however, seemed to justify the mental tax generated by the unfamiliar jargon that only seems there to confuse and intimidate rather than assist and inspire. I think my impression of the menu is a great analogy to the overall experience offered by Lucia. I think back to the menu at a place like El Bulli, which was often just a few well-selected words to describe a dish that had a great story behind it and played out like a drama on your plate. Everything about Lucia, from the reservation process to the act of eating, is overly complicated and painful. I wanted so badly to love this restaurant but if this is what \"fine dining\" is like in Dallas, I think I'll just stay home next time."], ["1289.4 Y.", "This place is only OK. I had 6 different items on the menu and none of them were particularly amazing, despite the $150 check. I wouldn't go again personally. There are many restaurants in Dallas where the $150 goes much further, IMO of course."]], "Olivella's Neo Pizza Napoletana": [["Lara C.", "So good! Awesome pizza and quick service - it's a great spot for lunch! I ordered the single size pizza - we got the Regina margherita and pancetta. I'll definitely come back - prices are fair too."], ["Milree V.", "Really stunned at the reviews for this place.(1) Arancini was doughy, soft, and cold. Manager stated they don't have a fryer to make them crispy... So why is this on the menu then?? Also served with a mayo-like sauce instead of the traditional tomato-based sauce(2) They kindly switched out the arancini for focaccia (and somehow brought it out after the pizza). Again, cold and soft. Focaccia is supposed to be crispy!(3) Pizza was brought out completely wrong. Not only was the substitution done wrong on the first half of the Metro (apparently no mushrooms means extra mushrooms), but the second half was a completely different type of pizza than the spinach and bufalina we ordered.Was completely disappointed and will not be back. Still in disbelief they would add the \"new\" arancini to the menu KNOWING they didn't have a fryer in the kitchen. Blows my mind."], ["Heath D.", "Second time to Neo's this past week - once for business  and once for appetizers with my bff. First trip we had \"The Dream\" regular size. Very good. Had to leave the jalapeños off for my guest, but I imagine that it would have been even better with them.Second trip we had \"Mommas Homemade Meatballs\" and the the \"Caprese\". Both had house made mozzarella cheese. Both were very good.Best part of Neo's is the location and atmosphere of the restaurant. Restaurant is right by a an outdoor park with a half moon water fountain feature. A nice surprise between the restaurants and the EY building. Also, the restaurant itself is very comfortable and makes you feel at ease.Will definitely be here again."], ["Thadd J.", "Neo has instantly become one of my favorite pizza places in town.  I truly love the open-air atmosphere of the establishment.I stopped on a rainy Saturday and even though we had to sit inside, we still had that open-air vibe which was great. There were quite few people, but we were seated straightaway.  The wait staff was friendly though they appeared to be a little under staffed with only two waitresses holding down the fort.  Drink orders were taken and served pretty quick considering.We ordered the Pancetta (sauce, mozzarella, pancetta, and sundried tomatoes) & San Daniele (lightly sauced, mozzarella, prosciutto, and arugula), both Metro style, which is a very thin crust.Both were outstanding.  The freshness of the ingredients was extremely noticeable.  This is the way thin crust should be done, very crispy and as thin as possible.  Loved it!  The prosciutto was shaved paper thin, perfect!  My only complaint was there could have been a little less arugula, but overall, it was still fantastic.I saw several items on the menu that I'm looking forward to trying and hopefully on a sunny day."], ["Lorri G.", "Tasty pizzas! Vegetarian options as well as crust choices. Location is ideal especially if attending event at the AAC or visiting the Perot or jfk 5th floor museums or grassy knoll! Good selection of beers and wine as well! If you like thin and /or a hand tossed style then this place is sure to please! Salads are delish as well!"], ["Jess M.", "The wireless password is: 8989225412 (It's their phone number backwards).I wish the beer selection was a little better. I had to settle on a Shiner Bock, which is okay, but not as good as a Revolver Blood & Honey. Also this is no sports bar (unfortunately). They do have a couple of TVs in the back, but that's pretty much it.The food is delicious. I love Neo's pizza! The \"Metro\" style is better than the regular. Its basically the same size but with thin crust. I love the outdoor seating on warm days. It's the only restaurant in Victory Park with outside tables. They have the on both sides of the restaurant (one faces Victory Ave and one faces Houston St.). They also have indoor seating that has an open window so you face outside. The staff is very friendly and helpful. You just can't beat this place if you want good pizza!"], ["April B.", "The service was amazing.  The pizza was sooooo goooood.  My daughter and I ordered the thin crust. Best thin crust ever. Prices were reasonable,  considering it is downtown."], ["Chris T.", "Never have I been disappointed with Neo's. I come here almost every maverick game with friends and love it. The service is unbeatable. Every time I tell them I'm going to the game after, they make it there life goal to get my food there fast and bring the check immediately. I also love this place because they have well positioned televisions that are always on basketball. I can sit down and eat and have fun with company and not be rushed because I can watch the first quarter or half of the game there then walk over to the stadium and watch the rest. The reason for 4/5 is because it's quite pricey for pizza. I love the metro black truffle because it has mushrooms and ham and it's dark and delicious, but it's $23 and if everybody is ordering a pizza and drinks it can add up to well over $100. Seriously though the people here are great and the food is awesome. One time I ran out of cash so I tipped with what I had, an extra floor ticket that I was going to give away anyway. The waiter seemed pretty happy albeit it wasn't cash and I even saw him later that night in the fourth quarter. Definitely drop by this place and check it out. It's perfect for game night or date night."], ["Charlotte J.", "First of all, the service here is STELLAR. We ordered take-out over the phone on the way home from the airport after a week away from Dallas. We were ready to swing by Olivella's and take some pizza home to relax with after a long day of travel. It was our first time ordering from Olivella's, so we didn't understand that when you order a large size, you get a VERY thin crust (cracker thin, similar to the pizza they serve at Eno's in the Bishop Arts District). This wasn't the kind of pizza we were in the mood for, so when we arrived and saw what was there for us we asked if we could order the regular size instead (which it turns out is the most traditional Neapolitan pizza). Not only did the hostess have no problem with this, she said she would not charge us for the original pizza we ordered, AND she just let us take it for free since apparently they would just have thrown it out anyway! That was SO kind, we were overwhelmed. We will return here based on service alone. The pizza we had was the Big Veggie, which was pretty darn good. Not the best pizza I've ever had, but delicious nonetheless. The Olivella salad we ordered was quite excellent, topped with pears, walnuts, Gorgonzola and balsamic vinaigrette. Come try Olivella's, for some yummy pizza and truly fantastic customer service."], ["Ron K.", "Went last night with a work colleague.  Pizza was ok..  Came out in 3 minutes..  Led me to believe it was pre-made and toppings thrown on top.,  was under cooked. Ordered a salad that never arrived.  Service was fast and attentive. We were feeling like they were trying to rush us yet the place was mainly empty.   Things weren't terrible but I expected much more from other reviews."], ["Brian F.", "I love the Neapolitan pizza here - the crust is chewy with just the right levels of saltiness and moisture.  Result is a fantastic base for a great pizza.  I've had Neapolitan pizza all over.  This is a much better than average example of it, I rank it right next to Pizza Rock in Las Vegas, which won the 2007 World Pizza Cup in Naples Italy.  I'm a traditionalist, so I prefer the plain ordinary Regina Margherita is fabulous.  I'm not such a fan of their Roma pizza.  I would describe it as a a large crunchy flatbread, just not my thing.  If they did not have the Roma pizza, I would probably give them 5 stars."], ["Tuvy P.", "**Updated Review**After my first visit, Charlie from Olivella's reached out to me so I gave it another shot and I'm glad I did! Charlie was very pleasant, easy to communicate with, and he made sure we were taken care of. He offered an extensive pizza tasting (on the house) completed with dessert.I can't remember all of the pizzas that we tried but I do remember my favorite one that was just TO-DIE-FOR....the black truffle pizza!! oh my gosh it was AMAZING. from the smell of the truffle, until it hits your lips... it was just perfect!!! I definitely recommend this pizza. The pizza tasting was complete with the nutella pizza dessert. Delicious, and I'm not even a dessert person!We also shared a bottle of Chardonnay, (can't remember the name) but it paired very well with all of the pizzas we tried. The service was impeccable, I definitely have no complaints. Everything was taken care of and the hospitality was appreciated :)"], ["Adam B.", "I've been back to Neo's countless times over the years.  The thin crust metro margarita pizza is still the best pizza I've ever had in Texas.  I noticed a buy 1 get 1 free on the menu but it applies to take out only.  I have always visited the Victory Park location but the owner has advised me that I can get the second pizza free while dining in at his other locations, which arent far from Victory Park.  That little tid bit is huge for me and I will definitely be taking advantage of that.  Thanks Charlie!!"], ["Daniel M.", "Atmosphere: love the vibe! The many textures of the space was so balanced. You had wood, metal, tile, brick, wallpaper and other finishes all used perfectly together. It made me feel like I was in a pizzeria in NY or Italy. Food: So yummy! We got a pizza with half \"Dream\" and the other half \"Della Carne\" the perfect match to experience what this pizza spot is made of. The ingredients tasted so fresh! My wife asked for a couple slices of freshly cut prosciutto on the side and it was also fantastic.  Service: We felt like a regular. The server was helpful in making the right selection and you can tell he had pride in what he does. Great job!If you want a great tasting pizza feeling like you are in another state or country then this is the spot."], ["Kyle L.", "I'm in Dallas for a couple days this weekend I had a little bit of time to go explore downtown.  I was really hungry so I checked this place out via Yelp.  The reviews were mostly good and it looked like a solid place to get some pizza.I ended up going here at the most crowded time possible; right before a Dallas Stars game!  The wait wasn't that bad and I was seated after waiting about 15-20 mins.  No complaints there.  They were pretty busy so it was all good.In terms of the food I ended up getting the Pepperoni Pizza regular style.  I was shocked how fast they had this thing out of the oven.  Seriously they had it at my table no longer than 15 mins after I ordered it.  I was expecting a wait and the food arrived way faster than I was expecting. Kudos.Now there is writing all over this place saying it was voted the \"Best Pizza in Texas\" by USA Today.  I don't know about you, but this is not the best pizza in Texas.  However it is not bad at all.  Definitely hit the spot and I was craving some pizza."], ["Courtney E.", "Survived eating there but I would never go again. It may have been voted best pizza in TX, but I wasn't voting. Pizza wasn't bad, but it wasn't anything to write home about either. It was hard to enjoy our meal when we were surrounded by flies (on the ledge behind us, landing on me and my kids, on the table, and on our food). It is not a family friendly restaurant: no kids menu, no place to change a child's diaper, and I had to move tables to accommodate my family of 5 even though we told the server we needed 4 seats & a high chair. Rarely saw the server. My son never got a refill on his drink. Staff appeared to be catering more to groups of young people (taking photos for them, chatting with them, etc) whereas my young family of 5 seemed to annoy them."], ["Lisa H.", "Best pizza I've had in a loooong time!!! I didn't have much expectation before coming here for dinner but it was definitely a pleasant surprise! I ordered the regular crust Della Carne, which has sauce, house-made mozzarella, sausage, ground beef,ham, pepperoni, onion. It was absolutely delicious! Our waitress knew that we were going to the game so she made sure that we got all of our food and bill on time, it was great! I also ordered the tiramisu and thought it was one of the best tiramisu I've had in Dallas. It's definitely worth checking out!"], ["John D.", "Had a good experience here. The meatballs are delicious. Chicken parm sandwich was good - panini style but I would have preferred breaded chicken. Sangria was good. Caesar salad was delicious. Italian sandwich was good. Sangria was good. We had a nice time sitting out on the patio in the evening. They were out of pepperoni rolls, which was disappointing. Our whole party enjoyed the meal and I would return. Overall - all the food was good or great."], ["Gaurav H.", "We went to the location at Victory Park on a Wed night. We had a plain Focaccia bread and a regular pizza. The Focaccia bread was very average. Try the one at Cane Russo's, it is much better. The Pizza was very average. After our dinner, both me and my wife thought that we should have ordered Papa John's at home instead of driving all the way to uptown."], ["Bettina D.", "What a great place! Everything from the Sangria, to the meatballs and Mezzaluna was delicious. I was in town for a game and so glad we found Olivella's."], ["Evan H.", "This place is great. Good music, savvy waiters and not to mention the awesome happy hour. Best pizza in Dallas."], ["Lily M.", "I absolutely love pizza, so I can quite picky when it comes to this fantastic food.  I care about every single component of it, from the bread, to the sauce, to the toppings.  I have my top pizzas in Dallas; however, I decided to see if Olivella's could lead up with any of them.I was in the mood for takeout, so I ordered a Metro sized Pepperoni pizza.  After eating half of this pizza which is great for sharing with one other person, I concluded two theories.  The first was that this pizza should only be eaten inside of the restaurant, immediately after coming out of the oven for better taste.  The second was that I'm just not that into this pizza because there is no wow factor.The pizza was lukewarm at the time of consumption.  The bread was slightly crunchy, just how I like it; however, there was no depth to the sauce or the cheese.  The pizza had thick clumps of cheese on top of a boring spread of tomato sauce.  I would also like to add that this pizza is definitely not the thinnest.  I won't name any other pizza restaurants; however, there are definitely others out there with much thinner crusts.All in all, the pizza was edible and good at most. But, it's definitely not great tasting pizza to have me coming back for more."], ["Jeremiah R.", "Once you have figured out the parking situation, it is a quick walk to the best pizza I have had in Dallas  (hint, there are a series of one ways leading into a parking complex which is free for the first 2 hours). Now, I know; the preppy uptown vibe of the American Airlines center scares you Cane Rosso fans. Fear not. While the location may scream \"simply trying to get casual diners on their way to events\" the pizza is really... bloody... good. Even the famed margherita; a pizza so simple that most places ruin it with poorly placed ingredients, shines. The pizza is thin; yet holds up and does not \"flip flop\" as if half cooked. It is the closest thing to Napa Style (Yes I know, I am bring NorCal into this) that I have found outside of CA. Also, the salads are not ridiculously over-priced; and are of a high quality. Hence, I shall continue to schlep through the event parking to visit this fine establishment."], ["Alessio L.", "They  bake my \"pasta al forno\" in the microway.Pizza have no taste. I just waste 40$"], ["Jeff B.", "Fantastic thin (Metro style) pizza.  Crust is so thin and crisp!  Cheese was light and not overpowering.  Toppings were fresh and with good flavor.  We came on a Sunday afternoon and it was not crowded at all but we were early.  We wanted a great Italian authentic pizza and this was it right down to the olive oil on top.  Really good place!"], ["Ashley S.", "Seriously though!!! I love this place! Not only is the food amazing, the service is top notch! If you come in, ask for Lesmond, Salomon, or Alex. These three gentlemen will take care of you at the bar or a table. I have been coming here with my hubby every Wednesday and Thursday, and they never disappoint. If you have not stopped in, stop in for half off wine on Wednesday and Thursday now!"], ["Katherine M.", "What a great option around the AAC and House of Blues!  We love Olivella's and had been meaning to try Neo.  We enjoyed the focaccia with fontina cheese and the San Daniele pizza.  Both were excellent.  If you like Neapolitan-style pizza, you'll love Neo.  Service was prompt and very friendly.  No complaints at all!  Very smooth experience.  Will definitely be back!"], ["Casey M.", "Always fast always friendly. The pizza is very tasty with a great crust, outstanding cheese, and flavorful sauce. The Italian sandwich is one of a kind good, fresh baked bread and the cheddar make it one of the best sandwiches I've ever had. Highly recommend this place!"], ["Leslie K.", "This place is surprisingly good!! I never really think to go to a restaurant in Victory Park on a Friday night, but this place totally wowed me. There's some patio space outside, but if you choose to sit inside, there's a really cool tavern/modern atmosphere going on.I went with three friends, and it's a great place to go and split a round of pizzas. We ordered the metro, but split it half and half between the Della Carne and The Dream. We also got a regular size Black Truffle and Margherita pizza. All were really tasty, but the Black Truffle really stole the show. There was a great aromatic waft of truffle that came off the pizza, and it was perfectly completed by the pieces of Italian ham. I only wish that they had spread the ham more evenly across the whole pizza - it was a bit sparse and seemed like it was only on one side. Service was good and the waiter was attentive without being intrusive. I'm surprised that there weren't more people there. Though different styles of pizza, I would put this on par with places such as Cane Rosso or Eno's in Bishop Arts in terms of deliciousness. Would definitely come back - this is a winner!"], ["Jess Q.", "It's my go to spot when visiting Dallas. We always order half white, half black truffle pizza. It's the best. Along with the sushi Parma as appetizer. Great and fast customer service along with clean environment."], ["PJ L.", "Best thin crust pizza in Dallas!  Period.  The lemontinis are also unbelievable.  Order them by the pitcher."], ["Shams B.", "After a VERY lackluster meal at Medina Oven & Bar which was overpriced and underwhelming, I was still hungry and stopped into Olivella's so I wouldn't go home hungry or grab fast food.Wow... The metro pizza really hit the spot, and they didn't skimp on the cheese or anchovies for a thin crust pizza. The service was prompt, and the pizza was fantastic. Generally I like deep dish pizzas over thin crust, but they won me over and I definitely want to go back."], ["Jhubin M.", "After a really poor experience here the first time, I paid another visit to this pizza joint.  Especially in a place like Dallas, which is not known for pizza, this place stands out and makes a name for itself. There will be more added to this later but I wanted to at least update the rating."], ["Mark N.", "Tasty sauce but pizza wouldn't stay together. The sauce was delicious but the pizza just wouldn't stay together. Nothing ruins the experience of eating a pizza like when the cheese and toppings come falling off the pizza and you have to struggle to keep it together. We also ordered additional toppings, but they were very stingy with them. The service was fantastic and I think it's in a good location, but that's about it. This is not a pizzeria that I would consider as one of the best in Dallas or a must visit location. If you're in the area then great, give it a shot. Definitely not the most delicious pizza I've tried.Just wanted to update my review and state that the management got in touch with me and offered us to come back at their expense. I declined because I'm very busy and it's a little out of our way since we live in Frisco. That definitely says a lot about the management. Great culture!"], ["Anne J.", "This place has phenomenal pizza. I could probably eat one by myself because the crust is so thin. This is my favorite go to place before a concert at the House of Blues, visiting the Perot museum or screaming my face off at the American Airlines Center during a Mavs game. The house salad is good and does not consist of that iceberg lettuce crap and like I said, the pizza is phenomenal. The atmosphere is alluring and magnetic. You can have a seat at the bar or a high table and let the ambience soak in. The patio offers intimacy in the middle of a big and beautiful city. I highly recommend the five cheese pizza!"], ["Tabi H.", "Great hangout spot. Pizza will not be the same from anywhere else. Met the owner before going in, great and friendly guy. Just the smell alone will make you wanna come in, you get what you pay for. Awesome pizzas with a comfortable atmosphere. Couldn't take a pic of the dessert pizza with Nutella and peanut butter...it disappeared too fast!"], ["Leah B.", "I like the atmosphere--my friends and I sat on the patio which was nice. As far as pizza goes, we got the large \"metro-size\" thin (cracker) crust style and it was good! Half margarita and half the \"dream\" because everyone seems to rave about. However, weren't really impressed by that one but the margarita pizza was delicious! Nice and fresh. Note: It says it feeds 2-3...definitely would have been better for just two, especially if you're hungry. The momma's style looked really good and would be better if you wanted your own pizza/were more hungry. We also got their olivella salad, which was nothing special and simple balsamic dressing, and appetizer of mozzarella wrapped in prosciutto. Again, nothing special.Overall good pizza! But not super filling"], ["Miranda M.", "I'm pretty much a regular here. If you love mushrooms, get the black truffle pizza. I order it every time.  The \"grease\" on top is actually truffle oil that they drizzle on (a waiter told me as I dabbed it off with a napkin).  I always get great service."], ["Don V.", "I'll keep it short. I'm sure the pizza here is great based on the pics and the glowing reviews. I don't have a lot of expectations when I go out. I'm not fussy and I never send stuff back. Got it? Pretty easy to please.But the guy behind the bar asked me to sit anywhere when I walked in. The restaurant side looked kind of busy, but the area across from the bar was dead (except for me). The bartender then seats two couples and brings one couple their drink orders and walks past me (at least) three times. I was in everyone's line of sight at a tall table across from the bar, not in some obscured corner.I got up and left. Terrible service. I'd give no stars so I'll just say the place rates a single star because the manager, whom I called to voice my complaint, was empathetic."], ["Tiffany S.", "The service is terrible.. Very pretentious and unwelcoming. Their policy is to only seat once the entire party is there. However they set a group that was incomplete before seating our group that was also incomplete."]], "Taverna": [], "Roman Cucina": [], "Terilli's Restaurant and Bar": [["Julie C.", "David is the premium server -- attentive & capable, quickly & expertly recommending the most exquisite menu options. Brunch cocktails, followed with salads & entrees that were as delicious as they are eye appealing.  Simply delightful experience.  Eat what David recos & you will be happy."], ["Kelsey M.", "Yummy foods, nice décor and great service.  Wines are pretty expensive here.  I paid $35.00 for a burger and 2 glasses of wine."], ["Andy M.", "Just had one of the best meals ever. The bacon wrapped  fillet Mignon was amazing!  My fiancé loved the chicken Alfredo. I will be coming back again soon."], ["Mary F.", "I went to Terilli's on a whim.  I was craving some Tex-Mex, but was really looking for more of an upscale atmosphere.  So, I found myself at Terilli's.  When I walked in,  I had planned on a couple glasses of wine, an app or salad and an entree.  Sadly, that didn't quite come to fruition.  I was beyond disappointed with my experience.I sat down at the bar (by myself...just moved to Dallas) which was not in the least bit crowded.  The bartender (a woman with red hair) came over and asked what I wanted.  I requested a wine list and then asked for a Pinot which wasn't spicy.  The bartender was less than happy to help me.  She made it seem as if I was bothering her.  I proceeded to order an appetizer but was informed 5 minutes later that they were out of said appetizer and I agreed to a similar option.  Literally one minute later, I changed my mind and requested the mussels (the bartender had JUST finished plugging my order into the computer).  She was very clearly annoyed with my change and could barely utter a response.My mussels, in stark contrast to the service, were amazing!!!  I wanted to savor every bite!  My plan was to order an entree but kept thinking about how rude the bartender was...the food may have been good, bit not worth the horrible service.  So, I requested my tab, was dropped off without a word and I paid...as I was leaving, I said thanks to the bartender who responded with \"sure\".  No thank you, no nothing.  Waste of time.  I understand people get busy, etc., but the bartender was slow!  A smile or a thank you would have gone a long way and I don't appreciate feeling like a burden when taking up one bar stool with the intent of ordering an entire meal plus wine!"], ["Beatriz O.", "I had come here once before for lunch and really enjoyed it. I was in town for work and couldn't wait to go back! We arrived around 730 and asked for a table for 2. The waitress said to a fellow coworker \"ugh seat them over there\" but never addressed us (to us). The gentleman she was with directed us to our table. We had an excellent table right by the musician. We were serenaded to soft melodic jazz music. Danielle was our waitress and she immediately greeted us in a warm manner. She talked about the wine selection and told us a little about the history of the restaurant and shared information on some of the dishes. We ordered the prosciutto wrapped asparagus and the bruschetta for appetizers. The asparagus was finger licking good! It was served with a lemon chive cream sauce that really tied all the flavors in really well. The bruschetta was alright but nothing to write home about. We ordered the terillis picatta and another dish (some seafood mix with angel hair pasta). The meals came with house salads that were alright. The seafood plate was very good. It was full of flavor and the fresh peas added a unique flavor to the dish. The cream sauce have it a good balance. However they could have left the tails off the shrimp! The picatta was also really good. I personally don't like capers and forgot to request they not be included but nonetheless the dish impressive.I definitely recommend this place and ask for Danielle!!!"], ["Erica M.", "Great date night restaurant, Try the italian nachos!"], ["Tiffany R.", "Checked this place out for our anniversary.  I made reservations on a weekday.  The person who took my information was very pleasant and professional.  Once we arrived, I realized that a reservation had really not been necessary.  It is a super cute, cozy little place.  We sat at a booth on the first floor.  Unfortunately the weather was super cold, so we didn't get a chance to check out the rooftop (which is what convinced me to come here in the first place). Stupid Dallas weather.  On to the food....Meh.  The complimentary bread was average.  We tried the vegetable lasagna and chicken masala and both dishes were pretty mediocre.  I was unimpressed with the flavor.  Same goes for the cocktails- nothing special.  They had decent drink specials that night.  And our server was very attentive.  She noted that it was our anniversary and brought out a piece of cheesecake- nice touch!I would go back during happy hour to check out the rooftop and get a glass of wine.  I would not return for dinner."], ["Taylor B.", "Best best crab claws around, don't even get me started on the italchos mmm... Everything always on point, best service! Love the family vibe there, great bartenders!!! If you haven't been, get there quick see for yourself.... Sooooo ahhmazing"], ["Brittany S.", "Best Lobster Bisque ever."], ["BellyUp D.", "Dont get me wrong, I think the food here is most usually fantastic...however BEWARE LADIES...PICK POCKET-ER ON SITE (OR WALLET OUT OF PURSE THIEF, you choose)This happened at around 8.30pm on Saturday July 19th in the middle level bar and apparently Terrilli's does not have video surveillance, so pick pocketers, can go and steal with zero consequence.We tried to get the management involved and all they cared about was nothing really, except to say sorry...I wonder had I not been with someone else that not could pay, if they would have taken on a different approach.In a strange twist of fate, a few weeks ago when we went and had a drink and some dessert at the lower level bar, we noticed we were not charge for one of the drinks and told the bar tender...guess I care more about Terilli's being ripped off than they do of their customers"], ["Real Fine F.", "Here is what the two star are for : * Killer Patio* Survival - been around awhile and rebuilt after a fireThis place's menu caters to those who like Chili's, chain steakhouses and the like.I went recently as a party of four. The service seemed as if they had just upgraded the hostesses and busboys to the floor - trying but inexperienced.I asked for the driest glass of white on the menu and after conferring with the bartender was brought a sweet, sugary glass I had to send back.The calamari had little to no flavor - think plain breading fried in vegetable oil with a jarred tomato dipping sauce spiked with corn syrup.All the dishes were mediocre but priced as if the ingredients were well-sourced, the recipes inventive and presentation on point. But...nope.I wouldn't hesitate to attend an event on that gorgeous rooftop or enjoy a simple, say, vodka and tonic up there. But I won't ever eat the food again."], ["Todd L.", "Good restaurant with light jazz music background.   Food was an A-   Service was a B+.  Cost was a bit pricey. C-"], ["Adrian F.", "You can read our review on Terilli's brunch here:dallasbrunchclub.com/1/p…"], ["J. B.", "I've tried multiple dishes here. Lobster bisque has zero lobster in it. Not one piece. Every dish I've tried with grilled chicken in it has a terrible, overpowering wood smoked flavor. The salmon also has this flavor. It taints the entire dish and it is not good. Chicken Parmesan tastes like veggies and lacks any richness, garlic bread tastes like the pre-made kind from the grocery store (like they used spray butter and garlic powder) and goat cheese in the goat cheese appetizer is super bland.  Giving two stars for atmosphere which was nice."], ["Michael M.", "My wife and I ate there for the first time in a few years and it was awesome.  We disappointedly couldn't make an online reservation there so we walked in and was put on the waitlist.  The wait turned out to be over 45 minutes so we ended up eating at the bar.  However, the bartender was so good it made the experience incredible.  She not only was interesting and informative but her timing of service was perfect.I had the Chicken Parmesan while my wife had a salad.  Both were delicious.  The ambiance in the restaurant is one of the best in DFW.  I'm a fan."], ["Susan C.", "Preface -- my coworkers always told me Terilli's had a wonderful happy hour, and I should definitely visit them for some cheap but great cocktails.  We are walking distance from here, and we have been on a quest for great Italian food for some time in Dallas.We got there in time for happy hour, but we were only given their all day Tuesday night happy hour menu with only wine.  I had looked at their menu earlier online, so I was excited to have a mixed cocktail or two before HH ended.  While our server was mostly great, he told us that they did not have a HH menu listed.  He told me there were some drinks like an apple martini and some other martinis on there.  I waited to order to decide.  I remember the Grapefruit Ginger Mule on their HH menu online as being half off, so I asked the server if I could get that as part of HH.  He told me it wasn't included, then he said it might be only a dollar off.  Then he pointed to the Dragonberry Mojito as being part of it, so I just got that.  This drink is disgusting by the way -- way too sweet!  I don't know why I didn't just open up their menu on my phone when I was there, but now I am looking at it online.  The Grapefruit Ginger Mule WAS part of HH, unless their website is not up to date.  That to me is annoying; our server provided good service, but we specifically got there for HH only for me to not really enjoy it.  My boyfriend did have some wine from their other HH menu, but I just was not feeling wine.ANYWAYS -- off to the rest of dinner.  For appetizers, I had half a pound of crab claws and my boyfriend had the escargot.  He was not impressed with his escargot.  My crab claws were also overcooked!  They were incredibly dry, even with all the garlic butter on it.  I am never one to complain about my food at restaurants unless they have it all wrong (I think that's only happened once?) -- I just can't.  I was hungry, and I don't have it in me to return one of a restaurant's more expensive dishes back to the kitchen and have the manager likely comp it.  I'd rather suck it up and warn you on Yelp not to order it.  :)  $25 could have been spent better on something else.The best part of dinner was the main course.  I had Terilli's Marsalas with veal.  The veal was cooked perfectly.  The menu said \"lightly breaded,\" and breading just scared me a bit, but it was light enough to where you barely noticed it was there.  It was tender and I ate every bit of this dish.  My boyfriend got the Spinach Ricotta Ravioli, and this too was delicious.Would we come back?  I'm not sure.  Everything was a hit or miss.  HIT:- our entrees- ambiance- nice serverMISS:- we missed the point of coming for happy hour martinis- overpriced and dry crab claws- mediocre escargot"], ["Wendy L.", "The boyfriend and I were in town for a wedding. The rehearsal dinner was held at this restaurant and I must say it was a great pick. We were given a majority of the upstairs area so that was pretty nice for the privacy. I thought the restaurant had a pretty extensive martini list and it was definitely hard to choose. I ended up ordering the Bellini martini (Belvedere Vodka * Peach Schnapps * Peach Puree Topped with Sparkling Wine) and the White Chocolate martini (Godiva White Chocolate Liqueur * Stoli Vanilla Vodka). The white chocolate was definitely my favorite of the two. I definitely wanted to try more as I heard the Espresso Martini was a favorite as well!As for food...Italian nachos aka italchos are genius! I definitely wish more restaurants would do this. Nachos with a variety of ingredients to choose from? Of course I'm down! We ended up ordering the italchos with italian sausage, roasted red peper and goat cheese...Explosion of flavors in your mouth! Other people ordered different combinations as well so it was great to taste all the different flavors.As for an entree, I ordered the sausage and peppers tortellini. It was good, but I was definitely more a fan of the italchos. Might be because also I was getting full by the time the entrees came as we order a good variety of appetizers to start. Overall great place and if I lived in Dallas, I would definitely come back for the martinis and italchos!"], ["Jenny M.", "Terilli's is one of my favorite restaurants in Dallas. I always offer it as a suggestion for dinners with friends, date nights or even just for drinks.I always start with the Italchos. I've tried several combinations, but my favorite way to order them is with basil, sun-dried tomatoes and goat cheese. They're delicious and a perfect dish for sharing.My favorite entree on the menu is the Chicken Scampi. It's really hard for me to order anything else on the menu because this dish is so good! Pasta with a cream sauce, tomatoes, capers and chicken breast. Portions are generous, so you can probably share this dish. Terilli's also has the best espresso martini I've ever had. They make it the way it should be done - one part espresso, one part Kahlua and one part vanilla vodka. Skip dessert and try one of these instead!Service has never been bad the many, many times I've been here, and they have an awesome rooftop patio."], ["Crissy C.", "I got the spinach fetachini Alfredo which was $11. It was delishhh!!! Monday nights are happy hour all night so I had a $5 glass of red wine. Husband said he didn't like his chicken panacatta. .. but it was a large portion and chicken tasted good to me. Our meal was $40 which was pricey, but our waitress was very attentive and made sure that our drinks were full & our bread basket never went empty for too long. To me this is a special date night place. A lil too pricey for me."], ["Ember L.", "This has to be the best restaurant in town. We were greeted and seat immediately upon arrival. The ambiance was very relaxed. The waitress that served us last night (Valerie) was phenomenal. She has a great taste in drinks and food. We didn't even use the menus, because we were confident enough in her word. Everything that she brought to the table amazed us. The experience was amazing! I cannot wait to come back and show more people."]], "Bugatti Ristorante": [["Robert C.", "This was a place that I had never tried, but always saw the bright signage from the highway.  It seemed like it could be promising.  The atmosphere is romantic and cozy, they have a large dining area and a vast bar area.We had Gamberoni and also Capelli De Angelo.  Both dishes were similar, however they both lacked a little flavor.  I am no Mario Batali, but I felt there was no depth to the dishes (wow, put me on food network!)  It was not bad dishes, don't get me wrong, but I felt for the price, it was a little lacking.I would probably come back, but maybe during lunch where I could sit out on the patio and enjoy the weather."], ["Seema P.", "I've only had one experience here so far and since I had a limited menu to order off from, I'm holding off on the 5th star until I get to go back.Valentine's Day, my husband surprises me to dinner at this beautiful restaurant.  When making the reservation, he had asked if we could order off the full menu since we're vegetarian and the Valentine's day menu was only with meat; he was told yes, but this was not so when we arrived.  The waiter was apologetic on having to be the bearer of bad news for us but he did go and find out if we could custom order off the preset menu, which we really appreciated.We loved the food here.  The garlic bread is the best we've ever had at any restaurant.  We decided to pair our meal with some Moscato d'Asti and it was a good idea.  The Bugatti house salad was so good!  Very fresh, citrusy, and kind of an adventure on a plate.  Cream of mushroom soup was decadent- yes, decadent, and it wasn't even dessert.  Thank goodness it only came in a little bowl or else we would've really has a calorie fest going on.  For our entrees, we had the ravioli without the crabmeat and linguini without the shrimp scampi but with a whole lot of veggies instead.  Both were okay, not something I want to try again.  Linguini was just lacking in a lot of flavor- there was no way for us to revive it despite the salt, pepper, and hot sauce attempts we made.  And the ravioli, I dissected it before taking a bite to check if there was crab meat and I really couldn't tell bc I've only seen crab meat on TV.  Kind of looked like pureed veggies inside until I found something white.... so I've just turning the other cheek bc it wasn't bad and I am only vegetarian by choice, not for religious reason, so I did eat some crab meat afterall, I'm not offended.  We ended the meal with the creme brulee and the bugatti snowball.  For the first time ever, I took a bite of dessert and said \"wow\"  The creme brulee was amazing.  Zee, the owner, was the one to seat us and he also came around a couple times to see how we were doing.  An experience like this is hard to come by.  The service was absolutely excellent- someone always was at the table every 5-10 mins to refill water, or bring the next course or just to say hi.  I really enjoyed the experience here and look forward to coming back again."], ["Krys H.", "Great meal and service! Lasagne and gnocchi were dynamite. Side dish of seasonal veggies was whelming and why it's not a five star. Highly recommend enjoying a fine Italian meal here!"], ["Al C.", "Just started as a Yelper, but had to put in my two cents for Bugatti. FAB! Service is wonderful, as is the food. Can't rave enough about the soup...everyone already has. Crab claws...yum ! Everything I have had has been DElish.Go once and the second time, you are family.  Can't say enough..just go. You will NOT be disappointed.  Thanks Zee for setting such a high, yet cozy standard."], ["Timothy N.", "We attended a 50th B'Day party.  Food was quite tasty and will return for a regular dinner."], ["Manuel G.", "Nice place. This has been my first restaurant in Dallas. Minestrone Soup and Penne Mediterraneo. Great food an service. I would come back!"], ["David W.", "Our first visit to this establishment was the occasion of a wedding reception.  We were sufficiently impressed that we decided to return for dinner at our earliest opportunity!The restaurant is situated in a business park off Northwest Highway, and the outdoor patio overlooks Bachman Lake; very picturesque.  What we had to eat there consisted of a series of appetizers, all most elegantly prepared and thoroughly delicious.  The waitstaff was well-seasoned and very professional.Other than being dimly-lit, as so many restaurants are these days, the interior appeared to be elegant and presentable.  We can't wait to return!"], ["Knuckles G.", "I went on a weekday right as they opened and me and my boyfriend were the only ones in the restaurant. The staff was very attentive to us and willing to make knowledgeable suggestions. I had the manicotti and cannoli which were very tasty! My guy had the Old World Nochi for the first time and nearly cleaned his plate. Not a bad place for genuine Italian food. The staff was superb!"], ["Greg S.", "Ate here for lunch today as a part of a company event. The service, as everyone has stated in previous reviews in great. The food was brought out to our large group in a timely fashion. I had ravioli and it was excellent. The cheesecake for dessert was fantastic as well. Very nice ambiance and I could see myself coming back here with a date for a nice romantic dinner. Check it out."], ["Josh W.", "I grew up going here almost weekly. Over the years NOTHING has changed. The service is great and personal and the food outstanding. Zee runs the place and takes extra care of everyone. My wife and I try to make it there when we are in Dallas."], ["Danny L.", "I picked this restaurant based on prior Yelp reviews, and was a little skeptical.  But after having dinner there, it turned out to be one of the finest dining experiences we have ever had.The lasagna is as good as it gets, sea bass was incredible, and the veal perfectly cooked.  I honestly starting looking for things that were not perfect.  From the appetizers to the home baked cookies for dessert with chocolate dipped strawberries and creme brulee, there wasn't one thing wrong with any of it.  First rate."], ["Deon C.", "Excellent service and the food was great!  Martini was amazing too!  I'd return often if I lived in Dallas.  Was a wonderful New Year's Day treat!"], ["Teresa N.", "We had our Son's wedding rehearsal dinner at Bugatti's on short notice and with 56 people.  We couldn't have been more pleased with the service or food.  We arrived early and Zee made us feel so welcome, and the room looked great.  We had guests that arrived early, and they were greeted promptly and offered drinks and appetizers; others arrived late, and we never felt rushed or uncomfortable that the meal service was not as scheduled.  The service was impeccable and the food was perfect.  I would recommend this venue for any special occasion.  Great job....we will definitely be back!"], ["Beverly F.", "I live not far from the restaurant and have seen the lit up sign driving home in the evening off Lemmon/marsh.  I've been twice now and have fallen in love with this place! The service, the food and the overall experience of the place has been top notch. Zee and his staff are wonderful, and everything I have tried has been delicious.  The prices may be a little high but I think it's worth it for how happy I am when I walk out of there!"], ["Ashley F.", "What a gem.For a friend's birthday surprise dinner, Bugatti's was the choice location.  Reservations and arrangements were made in advance, and were executed flawlessly.  As many have mentioned, the service offered here is better than many a 'fancier' Dallas restaurant.  Our table for 9 sat perfectly prepared for our arrival; not thrown together in a rush at the last minute, but rather meticulously adorned and even including a personalized menu with our friend's name and a tasteful acknowledgment of his landmark birthday.  I believe it was a slightly abbreviated menu, but it showcased several of the highlights that I was hoping to try and included several protein or no-protein options.The inside is delightfully unassuming.  No kitsch and no keeping up with the Joneses modern makeover here.  Just a nice, clean atmosphere with simple tables and simple decor.Wine kept flowing throughout the entire evening - not once was a glass allowed to near empty.  Sometimes I didn't even know where it was coming from or if we had ordered it or what - it was like stealth wine service giving the illusion of a bottomless glass!  Even with dessert, port wasn't just offered, it was brought out with glasses on a tray such that anyone who wanted some was immediately served - no wait or time for the order to get lost or forgotten.  It was lovely to feel so well-taken care of.The mushroom soup needs no further accolades - it's every bit as good as the other reviews claim.  Very creamy, very flavorful, and packed with mushrooms.My filet with madeira sauce was wonderful.  Perfectly cooked, and very flavorful.  My husband's veal piccata was also delicious.For dessert, the creme brulee was quite good, albeit a tiny bit soft inside, but with a special surprise inside - strawberries!  Very small, bite sized chunks of strawberry within the custard gave a burst of fruit with every bite that was perfect refreshing.After our meal, we assembled outside where our kind waiter guided us in formation for a group photo.  He congratulated the birthday boy and thanked his girlfriend for choosing Bugatti's as the celebration location.  Over the top service."], ["Susan C.", "I had the minestrone soup followed by  grilled chicken and my husband had mushroom soup then  the manicotti and cannelloni combo. We shared a bite of each  and both agreed it was all wonderful. Service was impeccable. My husband LOVED the mushroom soup and thought the chocolate mousse was one of the best he's had. If we were locals we'd be regulars"], ["David P.", "Had the Gamberoni very well done Zee the owner came to the table   to make sure everything was ok,  The snow ball for desert   was wonderful   A very nice meal with great service    Old money type place"], ["Candy W.", "Omg I can't believe this restaurant has ever gotten over one star. Worst meal and service ever had. The linguine pescatore had seafood that smelled so bad when brought to the table it was unbearable. The garlic bread is garlic salt on a hot dog bun. When the waiter finally came back to take meals away never even questioned why our meal was not touched. When we left the maître de asked how our meal was and we said it wasn't fresh he said your mistaken we serve over 1,000 of those a week and never had a complaint. I think we were the 1,000 meal. They charge a 6.00 split entree charge. Escargot was straight from a can with no garlic, just say no and go somewhere else."], ["Matthew G.", "Incredible food, and even better service. The kind of experience where everything seems perfectly coordinated and timed. Excellent for a date night on their patio. Literally, as I was writing this review, the owner (Z?) came over to ask how the experience was.The kicker? They don't charge nealy as much as they deserve to for the quality of the food and the service. I cannot count how many times I have spent twice as much for half the experience in uptown."], ["Daphne T.", "Food is divine and service is 5-star.  It doesn't get any better than this.  The owner, Zee, knows almost every customer by first-name basis.  They go above and beyond to deliver exceptional food and service."]], "Parigi Restaurant": [], "Cane Rosso": [], "Princi Italia": [["Kandace W.", "The food was mediocre and overpriced and we had poor service. This was my first and last time. I know I'd get better food and service at Carraba's or Maggiano's, probably event Olive Garden. No water refills, no offers for wine refills or dessert. Waiter checked on our table once after food was delivered. All food was luke-warm and probably heat lamped. Chicken lasagna was bland and dry, Boar gnocchi was bland and unevenly cooked. Carbonara was dry and undersauced. This was a stunning experience for me. I am still confused why the place was so crowded. It appears to be quite popular. We complained. The waiter did remove the gnocchi from bill. Manager offered to further discount but we declined. Manager suggested we come back to give them another chance. Not at that price point. No thanks. He was gracious though."], ["Monica A.", "First time there and there were too many pork dishes so I didn't have many other  options...my pasta was just ok... It's not a place I will crave and return to."], ["Liz G.", "Wonderful Sunday Brunch!  Lots to choose from.Service was incredibly attentive without being overbearing.  The poached egg on my crab cake dish was possibly the more perfectly poached egg I've ever received.The Goat Cheese Beignets were a lovely appetizer/shared plate, too."], ["Gail S.", "Terrible service!  Good food but totally ignored on this visit and they were not that busy! The waiter was out of it!"], ["Blake B.", "Looking for the best Italian in Dallas? Princi Italia is your ravioli. This neighborhood spot is a true find in one of Dallas's sparsest categories. The service is great, the atmosphere is lively (but not loud), and the people care about giving you a great meal. As for the food, many of the noodles are housemade and the sauces are well-crafted, highlighting the noodles rather than overpowering them. You can't go wrong with most of the dishes here (though, feel free to skip the pizza as there's better elsewhere), but here's my recommendation from start-to-finish:Starter:- Garlic flatbreadSalads:- Burrata- Beet CrabMains: - Quattro Formaggi (highly recommended)- Spaghetti with Chicken Meatballs Desserts:- Short Cake Sundae - CappuccinoThat should put you in a good place. You'll dream about it later, so be prepared.+1* for warm service+1* for lively ambiance+1* for great wine and cocktail choices+2* for incredible food"], ["Travis R.", "The Texas Wild Boar Gnocchi is definitely a favorite of mine.  Reminded me of a dish I had in Northern Italy once.  The portion the dinner well so dessert shouldn't be a problem."], ["S D.", "I placed a carryout order on a Friday and they were a little busy, but the people at the hostess stand weren't all that friendly and said very few words when I picked up my food.As for the food, I ordered the calamari, the fig and gorgonzola bruschette and the italian sausage pizza.The bruschette was really good and came with plenty of yummy figs.The calamari was just ok, nothing special, although the aioli that came with it was really good.The italian sausage pizza was just so-so.  I think the cheese was provel cheese, which is not my favorite but I will eat, but that wasn't listed as an ingredient, so i'm not sure what kind of cheese it was.  I personally would have liked more tomato sauce on the pizza as well.  There are other things on the menu that I would like to try, so I'm sure I will give this place another shot."], ["Molly T.", "Princi Italia, I think, is a bit confused on what exactly it wants to be. It wants to be an upscale dining experience in a trendy neighborhood, but it is a casual dining experience in a regular shopping center in a regular neighborhood. There were some standouts, but for the price and wait, I was expecting to be blown away. Instead, I could see highlights of the Mavs game from my table on two flatscreens at the bar, as could everyone else in the restaurant. I arrived with my grandmother late on a Saturday evening. The host station was completely overwhelmed. There wasn't anybody there for several minutes, and when there was, I had to make myself known when I was standing inches from the host stand, facing it. Confusing. We were told 45 minutes (which turned out to be only 20) and made our way to the bar.  I like the finer things in life so I opted for a $14 glass of wine, but I wasn't super impressed. There is nearly no place to wait, especially if you have kids. The bar area was so cramped so we joined another set of tables to spend our time  drinking our wine--but the table was filled with glasses and used napkins that weren't their own. Strike 1--nobody wants to sit in somebody else's mess while waiting for a table. As for our eats:Fig and Gorgonzola bruschetta: yes definitely. Served on a little pizza-type bread that was also not crispy like a thick breaded pizza crust. I liked the flavors very much, but the bread could stand a crimping up. Caesar salad: skip. Approximately $1 for each leaf of lettuce slathered in mayo very lightly veiled with lemon and anchovy. Saturday special - Veal Milanese: excellently prepared, if overpriced. All it is is the piece of meat with a little side salad. I enjoyed it but not worth its sticker price. Short rib with polenta: this was great. The short rib was well cooked and the polenta had a ton of flavor. I would order this again. Pistachio almond gelato: highlight of my evening. On par with that I ate in Italy. It comes served with a little biscotti that I scooped up the gelato with.Tiramisu: chocolate cake instead of ladyfingers. It was interesting and definitely had the elements of a good tiramisu, but the chocolate made it too rich after stuffing my face for the previous two hours. There were some hiccups, other than the TVs, hostesses, and dirty bar area throughout the meal as well. Entrees arrived several minutes apart, my gelato was totally forgotten about. I think I wish I had gotten pasta instead of the slightly underwhelming veal. If I get to Dallas again, I would check it out on a weeknight for maybe a more attentive meal and skip the salad and veal. All in all a 4-star experience."], ["Karla S.", "I wanted to try Princi for a long time and finally had the opportunity. Brunch on Sunday with friends!First, the restaurant itself is very nice. Rustic chic atmosphere, very interesting choices as decoration. It is a great place to go. Love the chandeliers! Food wise- so yummy! We were in a group so we shared many appetizers. The gorgonzola with figs bruschetta is excellent, tortellini fonduta is delicious although the portion is tiny (about 4 or 5 tortellinis). Then we shared some desserts and I loved all of them- the presentation are really nice. They have a pastry chef, it makes all the difference in the world! My favorite was the short cake Sundae but the Lemon curd tart was great too.Really want to go back and try other dishes. Seems to me Princi has the most diverse Italian menu in Dallas. I would only suggest to add polenta and gnocchi to the menu, for some strange reason these dishes are not offered here. Definitely an excellent option to go."], ["Nathan H.", "Pizza ain't pricey...everything else is! Very good though. I absolutely love the SCALLOPS!!! Best crust on a pizza in town by the way!! This place can get extremely packed but there is a nice bar to drink in. Great PATIO! I heard there is a reasonable brunch here too."], ["B H.", "Princi Italia is the perfect spot for fresh northern italian cuisine.  The dynamic menu brings favorites from ossobuco to the \"to die for\" wild boar gnocchi.  Don't forget about the wood fired pizzas with prosciutto or fresh mozzarella. The tortellini fonduta app with black truffles is one of the greatest dishes to grace this earth (pro tip...ask for the mussel bread with the tortelloni).  Certainly created in the heavens and a gift to this earth.  I couldn't write a negative comment about Princi Italia from the warm greeting as you walk in, to the friendly and attentive staff that swarms and delivers with speed and grace. Drop in the bar for a phenomenal hand crafted cocktail or glass of Super Tuscan.  Wonderful atmosphere, none of the elitist snobbery that exists right outside the doors. Last, dessert is simple as the house made Italian cookie plate is the perfect close with an espresso or Vin Santo. Dallas' finest italian is Princi Italia."], ["Alex I.", "Loved the Fig and Gorgonzola bruschetta to start. Entrees were tasty but not etched into my long term memory. Only recommendation would be to dim the lights. On a Saturday night I and many others would prefer dimmer lights to dine by. Ciao!"], ["Kristyn R.", "Felt like I ordered the wrong thing....I liked the atmosphere and liked the look of all the food being served around us...but I ordered the cobb salad and it was sub par. The way the menu described it, I thought it was going to be something other than a regular cobb salad...a bit more artistic. But it was not...and the lettuce was a touch browned. I would try it again as I truly believe in \"user error\" and giving places a second chance. Maybe I will choose better next time!"], ["Courtney H.", "One of my favorite neighborhood restaurants. The food is consistently great and the atmosphere is delightful - I feel comfortable in casual or dressy attire. The staff is always so kind and accommodating when we bring our 1 year old - can't say the same for other places."], ["Debbie J.", "Three of us dined for lunch today and I left feeling a little disappointed.  I ordered the Cobb salad with grilled chicken and small baby shrimp.  The salad was mostly iceberg with 4 bites of avocado and 4 baby shrimp.  That's it.  The venue seemed lovely but the waiter seemed rushed and no attention to detail was given.  I will give it another try but no time soon."], ["Kristen D.", "Fantastic food!!!I don't think you would ever expect to pull into a shopping center and find such a gem.  Princi is very casual inside and sort of rustic.  It's such a strange mixture of people and surroundings.  I am not quiet sure the vibe it is going for but the food....is incredible.  I ordered the ceaser salad and it came out lightening fast! It came out in huge pieces to chop up.  The dressing was very bold and thick, the lettuce was crisp and fresh just as a salad should be.  I was alittle bummed to not have pepper for my salad.  The staff was sort of hard to flag down.  Prinici is packed on a Friday and probably Saturdays too.  We both ordered drinks to go with our meal.  I ordered the sicilian margarita which was fresh, sweet and just enough tang.  I ordered the cracked pepper fetticini with shrimp and crab.  AMAZING!!! The pasta was unlike anything I had ever expierenced.  Plenty of crab and the shrimp were super peppery :) LOVED!!!"], ["Meghan E.", "Went there for a company Christmas lunch. Food was decent, nothing that really blew me away.  Wish they would've given bread or something to go along with the meal. The food was brought out and looked great. I just wasn't blown away. I thought the desserts were great however. I will give it another try probably for a dinner one night."], ["Alicia S.", "Great place. A girlfriend and I went for brunch. The manager and staff was attentive. Our waiter was \"ok\", didn't seem like he was happy with us but we enjoyed our time. The food was amazing and the drinks were deff great for Sunday brunch. The patio is too cute not to enjoy!!! Great for kids overall also. Nice little place."], ["Aaron E.", "First, I'd like to thank another Italian place for introducing me to Princi Italia. Thanks [insert upscale, snooty, borderline racists, uptown Italian place]. It's all because you didn't seem to want to take my money on multiple occasions that lead me here. This has become my go to spot. I've never had a bad experience. The food is always exceptional. The service sets the standard. I've rolled in here dressed like Jim the hobo reeking of stale piss and ass. I still get the same great service and the same great food. Although most of the folks who come here are dressed in sport jackets and polo shirts and sweaters tied around their necks, they still never turn their nose up to anyone. That's hard to say with any truth about most places. I've become the type of person that almost requires an italian place to make their own pasta.Not that I'd be able to tell the difference between the cheap box stuff you can buy at the Walmarts for $0.99 and the homemade by a person in the kitchen of the restaurant kind.It's like the wine snob who claims to be able to tell the difference between wine from a box and some vintage expensive crap.The difference doesn't matter.It's what's perceived in my brain as quality.And a restaurant that makes the pasta themselves is a restaurant that cares about freshness and quality and me.And everyone should care about pleasing me :).Princi Italia delivers on the homemade pasta.It's light.It's fresh.It's fucking delicious.The sauce is somewhere between perfect and un-fucking-believable.That may be a slight exaggeration, but seriously, it's good.I've had several dishes here, and none of them has disappointed.I suggest starting with the basics, Capellini Marinara with chicken meatballs.Then graduating to more adventurous things, like the Romano Crusted Chicken or Pan Seared Scallops.And don't skip desert.I haven't had it myself, but I force all of my dates to get the Short Cake Sundae.They all \"thank me\" afterwards.Get it?"], ["Alexis N.", "My family and I showed up to this spot for our first time on the Friday before Christmas. PACKED! Our wait was said to be about 45 minutes, but we were soon able to make our way to a few seats at the bar. The bartender was very welcoming and personable. He ended up talking to my dad for a while about rye whiskey (which they only offered one brand of... Bullit. My dad gave him a couple other good brands to look into). It was a comfortable place to chill while waiting for our table. We were then seated in the dining room, which is open but cozy at the same time. The entire menu sounded yummy, with a few options for the two of us vegetarians at the table. Our waiter was knowledgable and helpful, and apparently from Philadelphia, where my brother and sister-in-law lived for about 7 years, so that was cool. The food was YUM! House-made truffle tortellini appetizer! Bruschetta options! For my entree I got an off-menu, super tasty, veggie gnocchi. SO GOOD!!! Dessert?!? Pistachio almond gelato with homemade biscotti?!  Ugghh. To die for!!Great food, good service, good wine list... I loved it. I'll be back!!"]], "Nonna Restaurant": [["Holly E.", "You need a reservation. You need to dress well. It's always a hard decision on what to drink. A Negroni or Black Manhatten?? possibly a bottle of Taurasi. Maybe all three. You can't be disappointed. Order the anchovie antipasti. Fried fish goodness that takes you straight back to Italy. It was so good that we needed an encore. Follow that with a house made pasta dish. Desserts are divine. Cherries are in season so I had a tart open pie that I shouldn't have shared. Service is friendly and professional. The ambiance is warm and relaxed. Highland Park crowd. Definitely one of the top Dallas restaurants."], ["Dominic C.", "Nonna has to closest think to real Northern Italian food in DFW.  Make reservations because they fill up fast.Lysa S. needs to grow up because popular places all need reservations.  Keiichi in Denton has at least a 2 weeks wait.  Lucia has a 6-8 weeks wait.To give a restaurant 1 star because they can't seat you fast without reservation is just childish.Back to the food.The pork ribs was tender and packed with flavor. I like the fired brussel sprouts.The lobster ravioli is amazing. There's real lobster inside. The skin on the ravioli is thin. The broth is light yet flavorful. All that is important because it doesn't overpower the lobster. In fact, it help bring out the lobster.The chittara with shrimp is a little spicy but not too robust. Again, the balance was there so the shrimp stood out.The stuff quail was delightful but I didn't like the rice stuffing. The meat was well seasoned.As far as panna cotta goes, Nonna has the best I've had in DFW. Still far from the best I've had though. I still dream of that magical panna cotta. So light that it floats like a feather.The food here is well balanced.  Again, it's not for the Olive Garden and Macaroni Grill connoisseur.The menu is seasonal and they try to source locally.Will RTE."], ["Glen S.", "Took a friend for her birthday.  We were both surprised as our app, pasta and especially the main course were delisioso!  We have a lot of Italian Restaurants in the Dallas Metroplex but few the quality of say Mario Batali's Del Posto in NYC.  Nonna (grandma in Italian) certainly makes the grade!  While service does lack a certain caress and friendliness (I waited and bussed tables many many yrs ago so I speak from my experiences) the food more than makes up for it.  So I typically don't go out for a steak as I feel I can create the flavor as good or better than many restaurants and purchase a quality beef at CM or WF or a few smaller butcher shops in the area, I believe I found my match at Nonna...  The Wagyo Ribeye was the best piece of beef I remember in Dallas.  The flavored was rich and the meat cooked perfectly.   (Ah, the benefits of al forno)For our ensalada, we had the squash sfformatino.  Wow!  If love to learn how to make this.  Chef, you need to have a weekly class!For our prima piatto we had the lobster ravioli.  We were surprise to see it in a broth but again, delicious and so complimentary as the broth was very basic and the lobster a bit salty.  They certainly complimented each other. I'd go back in a heartbeat.  We had a great time and the atmosphere was very comfortable."], ["Natali W.", "Absolutely amazing. Hands down one of the best dining experiences my husband and I have had in Dallas. Nonna is in a very random location but inside it is charming and romantic (but small so get a reservation).  We got everything the waiter recommended and he did not lead us astray (his name is George but my husband has taken to calling him sensei ).  We started with the shrimp brioche crostini. Great presentation, not huge portions but just right for us and a very nice flavor.  We also got  a little gems salad appetizer with blue cheese, blood oranges, almonds and a champagne vinaigrette. It was wonderful. The blue cheese was some of the best I have had: flavorful and creamy but not too strong to overpower the other flavor. I highly recommend both those dishes as starters. Then I got the breathtaking, life-changing lobster ravioli, which I recommend whole-heartedly.  Not only have I never had better ravioli, but I may never have had better tasting lobster. Somehow they preserve the delicious taste of buttery lobster (and good texture) in that heavenly little ravioli pillow.  Really, I will be dreaming about this for a long time to come. My husband ordered the sole with artichoke mashed potatoes, which was also delicious. Though I only tasted a little of it cause I wanted to save all the room for my ravioli (but I begrudgingly shared a few with him  so I had a little room to try his). We finished the meal with some type of pistachio ice cream, which was delightful and a perfect ending to a perfect meal."], ["Eric H.", "Skeptical of most Italian food outside of NYC but was very impressed with this whole place. Very friendly host and waiter who worked very hard to accommodate us, even without a reservation. Pasta was perfectly al dente and sauce was very flavorful. Highly recommend it!"], ["Reed C.", "Second visitIncredible fresh food.  Unique combinations.   Cauliflower soup with dark mysterious capers that just blow you away.  Veal cooked to perfection with the same faint pink shadow in every bite.  Plates so good it makes you sad to see them go.  The staff is so personable the food so consistant i cannot wait to return in November.  Best food in Dallas."], ["Justin W.", "Excellent food and service. We made last minute reservations and were able to be seated at the bar where we experienced great service. Based on the bartender's recommendations, we ordered a variety of dishes and enjoyed every one. Great for a date night or special occasion."], ["Sandra H.", "Restaurant is small, but cozy. Didn't have reservations, so sat at the bar for dinner (even on a Monday!), but it was with it! Fantastic service, wonderful food, good ambiance. What more can you ask for?"], ["Mary S.", "Lucia's sister Nonna,  in house pasta, sauces and more.....I ordered the ghnocci and it could of been cooked a little more ;(  I expect perfezione out of your world class Italian scullery.  I would have to say the appetizer was fantastic the fresh mozz cheese with something or another....I seriously need to quit taking roadies with me before dinner time!  I can't remember much for my reviews!  This is a perfect place for the art of dating...It's sort of sexy dining Good thing I went with a friend or I could of ended up pregnant.....Again! It does hold the title for Best Italian 2012."], ["LG N.", "Great atmosphere, great service, and great food!!!  The menu changes daily though, so be sure to check out online before going.  Definitely would go back!!  Great place for a special dinner/celebration!!!  Located in a very small shopping area across from whole foods, so you will miss it, if you aren't looking for it. Make sure that you try the Red Snapper if on the menu, you won't be disappointed!!!"], ["Bea H.", "I love this restaurant!!To me, I would eat there every night!I love to eat at the bar, or at a two top in the bar area the best.The chef, is so talented and his food presentation and combinations are amazing.The white pizza is my personal favorite pizza, along with the branzino fish. cooked in the pizza oven..Five stars for sure!-b e a"], ["Marc M.", "Well, normally I don't rewrite a review within two weeks, but I decided to make the trek here again based on the 5-star experience I had the first time. I drug along another Yelp Elite, Mary S, and I was determined to order what Lorri G had enjoyed in our previous meal.  It was perhaps coincidence, but I was seated at the same table, in the same seat as before, and David was the same great server I had two weeks before.Unfortunately, I am revising my star rating down to a four.  I think if Mary S wrote a review, she would give it 3.  The bread wasn't as good, the lobster ravioli wasn't as yummy and her gnocchi was under-cooked and yechy.  On the positive side, the panzanella was excellent (I must learn how to make this - it is actually super easy) and the sticky toffee cake/pudding were wonderful.I MAY try this place again if I find myself in the area.  It still has a great vibe and there are a few other things on the menu I would try."], ["Sanjiv S.", "Went here to celebrate the wife's birthday. The service and ambience was good. The food was disappointing. We are all vegetarian and maybe that is why the food wasn't great but Italian food is generally vegetarian friendly and a good chef should be able to create flavorful veggie dishes. The pizza was good, the bread excellent, the Gnocchi was over-salted and lacked flavor as did the pasta dish - I think it was the Casoncelli. Out of the two desserts - one was excellent (the toffee pudding). The restaurant was buzzing and had a great vibe but it just wasn't worth the trip for us because of the food."], ["Chris S.", "Dallas doesn't have a lot of really good Italian options, but this is certainly a great one- my favorite by far. Freshly-made pastas that you can get smaller size as prime course or larger as entrée. Seasonal salads and pizzas. Very good wine list that even includes and reasonably-priced Italian options."], ["Philip C.", "Excellent restaurant.  The Pork Chop is probably the best I have ever had.  If you come by definitely try the Pork Chop dish.  The outside of the pork was nice and crispy while the inside was tender and juicy.  It was also served on a bed of cabbage in a tasty sauce. I also had the Lobster Ravioli which was excellent.  The puffed bread was delicious and always brought out fresh.  The Burrata was so light and fluffy and delicious that our table had 3 orders.This place is freakin awesome. The portions are a bit small except for the Pork Chop which was huge."], ["Jayashri D.", "My husband and I recently moved from the northeast and wanted to try something that reminded us of Italian food back home --homemade pasta with a cozy, but happening ambiance.I give this restaurant 2 stars:Ambiance:  2/5.  I expected to have dimmed lighting and an ambiance that would be hipper (we saw a guy walk in w/a cowboy hat and boots).  Might be typical for Dallas, but trying to be agnostic of location here.  Worse, though, was the manager talking to a table next to ours and having his behind in our face due to the close seating.  It took him 10 mins to realize what he was doing and didn't even apologize.Food:  2.5/5.  The food was not what we expected.  Best part of the dinner was the complimentary flat bread.  The mozarella di bufala pizza was soggy and the cheese was falling off.  My husband ordered the ravioli and it was NOT al dente -- mushy, overcooked, and drowning in the buttery sauce.  I ordered the gemelli pasta and that too was overcooked and mushy.     Service: 2.5/5  We didn't get a chance to order desert as the waiter just handed us the check for the evening.  He didn't care to ask, unfortunately.   I would expect a whole lot more coming from a restaurant who makes their own pasta, has pricey entrees, and is labeled as having a classy ambiance."], ["Langley M.", "Authentic light Italian food in a cozy environment. I like reserving the farm table for a larger group.Must get: beet salad, white clam pizza, and a seasonal pasta they're doing now with tortellini butternut squash/brown butter/sage (I think). Awesome! Also they do a good cocktail with basil (but its more summery)."], ["Chee S.", "Although we made a reservation, still waited more than 20 minutes, certainly didn't off to a good start. Service was extremely slow. Appetizer was too salty, and empty water glasses were never filled. The dinner tasted pretty good but not spectacular for that price. By the time we finished dinner, we decided not to even look at the dessert menu because we afraid that the server was so inattentive we would start counting bricks on the wall."], ["Mark L.", "Nonna's Italian is one of my favorite restaurants in the metroplex as it tasty, consistent and intimate.  The food, service and wine selection are all top-notch and highly recommended.  After eating there over 20 times, we have never had a bad meal there. So, If you want fantastic Italian with great service then Nonnas is your best bet.Be sure and try the Puffed Bread, the Grilled Heart Of Romaine Salad and the Pappardelle Al Ragu Bolognese.  Another must try is the Lobster Ravioli.This is a must go to restaurant!"], ["Dom D.", "Burrata pizza wasn't very good.  Salty and dough is like a cracker.    Linguini with clams was sooooo dry.  The pasta with the veal shank was decent.   Needed more sauce.    We ll try it again since the pics online look great. Maybe we didn't order the right things."]], "Urbano Cafe": [["Krysta W.", "I have intended to try Urbano for such a long time - but I still consider myself a poor college kid so we just don't find ourselves wanting to go out to pricey dinners too often. But now that I think about it, since Urbano is BYOB, the price of dinner is not all that bad. I finally had the chance to go last night for our good friend's graduation dinner. After a stressful one hour episode of me stupidly locking my boyfriend's keys in his running car at Target, we made it there 10 minutes after the group had ordered. Since it was rather late and I didn't want a heavy meal before going out for the night, I went with the Warm Farro Crab Salad. I was nervous it wouldn't be enough, but there was still some left on my plate when I was finished. I was very happy with my choice, although I wish there was more crab and less farro (isn't that always the case?). Boyfriend got the salmon cooked medium rare and it was awesome. The meals are a bit heavier then I usually go for but they are more than willing to make substitutions. Expectations were definitely met and I'm a fan of anything BYOB. Next nice dinner excuse will bring me back here happily."], ["Dena F.", "I'd say back with a vengeance but there was no hit of malice in my steak sandwich! It was great. I love the new menu items! But if you know me I love almost anything with the word steak in it. And Urbano is definitely back! Yes, I agree with all previous reviews that the space, location and table service are improvements. I like anything that brings food closer to me. Katie and I did splitsies on a sandwich and salad and we were both pleased. Our waiters seemed a bit wet behind the ears...or he might have fallen prey to Katie's beauty. That happens all the time when we go out to lunch. Either way he was attentive. We should do a lunch UYE here slightly before or after the lunch rush. If we do, pay attention to the address. They are not as easy to find, but totally worth the effort."], ["Anne S.", "Love it.  The atmosphere reminds me of a neighborhood restaurant in Italy.  The waiters did their best not to let on that they were pissed when we showed up 20 minutes late for our reservation.  The BYOB policy is fantastic.  We were drinking a fairly nice Rombauer, and when the maitre'd noticed that, he switched out our wine glasses and brought out two very fancy big ones, saying that a Rombauer deserves a better glass.  Too cute.I had the scallops, which were delicious.  We also split a side of pears carmelized with some sort of cheese (this was a while ago, so bear with me), and those were also divine.  My boyfriend got some sort of steak man-dish that he loved.  We split the tiramisu for dessert.Overall, I think it's a teensy bit overpriced (especially when it comes to the side dishes), but totally worth it for the quality of food if you're celebrating a special occasion.  I'd also second Shanna's opinion: bring your out-of-town foodie friends here instead of one of the snooty big-name places.  They'll think Dallas is just FULL of little gems like Urbano.  heh heh, little do they know...."], ["Jen L.", "I only had their lunch menu and I honestly thought that everything was just okay.  The place is really tiny, but since I went an hr before they close for lunch it didn't feel crowded.  Waiter was nice and just fine.  I wish they had more pasta options for lunch though.  I don't think I will want to come back here at least for lunch, but I wouldn't stop anybody from wanting to try this place."], ["Gwendolyn W.", "Oh my goodness I love this place. I 100% agree with one of the previous reviews - Cafe Urbano is a hidden gem in Dallas. The restaurant is located just north of Deep Ellum on Fitzhugh in a somewhat sketchy area, but don't let that throw you off...I promise, the food is worth it! There should be parking right out front, and if not, you'll have to street park.You definitely need to make reservations, as the restaurant itself is tiny! There are maybe 10 tables total in the main restaurant, and then a tiny kitchen in the back. There a second restaurant a few doors down that I believe is around the same size, but I haven't seen it. We called for Saturday reservations on a Thursday and the first available was 830pm...but again, it's totally worth it. We arrived a few minutes before 830pm and we asked to wait outside until our table was ready - there literally isn't anywhere to wait inside! It was a nice night though so we sat on their bench out front and opened our bottle of wine. Oh did I not mention that yet!? Yes, Urbano is BYOB! And wait, it gets better: the owner himself was the one who greeted us and sat us outside. He was there all night, helping serve dishes and talking to people...it was awesome!Okay, now for the food. Mmmm the food! We started with the Crispy Oysters (with tempura brussel sprouts) and they were delicious! For our main meals, I had a Beef Tenderloin special that came with Gorgonzola mac & cheese. Life does not get much better than that, seriously! The beef tenderloin was perfectly cooked and was amazing. The mac & cheese was made with penne pasta (a bit out of the ordinary) but was soo good. My husband has the Seared Duck Breast (with hearts of palm salad) and it was phenomenal as well.I'm 100% confident that everything on the menu is delicious. We're already planning out next visit back!!"], ["Reggie W.", "Great spot, been meaning to review for while.. Celebrating this NYE for the 3rd straight year!!"], ["Julio G.", "I cannot say enough about  Urbano Cafe. I've had this place on my list of restaurants to try for a while now. I regret that it took me this long to find this little (definitely little, only 9 tables) gem in East Dallas. My girlfriend got a deal through Scoutmob (around $15 off). In hindsight, this place is worth paying full price and maybe even more. We called ahead of time to ensure that they would accommodate to a vegetarian customer. The chef created a beautiful vegetarian platter of lobster mushroom risotto with roasted asparagus. Compliments to the chef for creating a vegetarian alternative!We brought a bottle of cabernet sauvignon as this restaurant is BYOB (small $2 fee per person). Our appetizer of the Caprese S'mores in a balsamic syrup was a great start to this meal.  I love cheese and toasty/crunchy food so this hit the spot.The highlight of this dining experience was my entree. I must say this is THE BEST ENTREE I HAVE EVER EATEN. My mouth is now watering as I write this review. I had the tenderloin on mushroom risotto. The only way I can describe this is \"ERMAGERD\" (Proper English cannot describe this dish) delicious. The steak was cooked to perfection with a lovely pinkish reddish center and a crisp seared outside. It was seasoned so damn well and kept perfectly juicy. The saltiness of the seasoning worked just right with the creamy texture of the risotto. Every bite was a mouthgasm and I did not want it to end.  This dish was a gift from the Gods and would be my final meal request if I ever have that option.It was that good. Just get up and try this place. Now."], ["Solomon W.", "Urbano Cafe is a little shop tucked off on the Eastern side of Dallas, and it fits right into the neighborhood. With its tinge of grunge and BYO policy, it is doing a good job at feed people in a minimal setting, with consistency. The dinner menu is fairly expansive, and the lunch is fairly refined.Unfortunately, my lunch experience felt a little off. They were closing down for the afternoon, though I walked in 45 minutes beforehand. Anyway, the brought my food out in a swift manner, so much so that my soup was unpalatably hot.The pureed cauliflower was near the bland end of the salt spectrum, and the texture tasted a little off--neither rustic/chunky or smooth.The mozzarella sammie boasted a pretty neat cross-hatch grilling, but the sandwich itself was pretty lukewarm. Flavorwise, the pesto was pretty good, but the tomato and mozzarella just didn't do it this time around.Urbano Cafe is undoubtedly a \"foodie spot\", what with its local flare and emphasis on fresh, clean grub. Nothing was particularly outstanding during my lunch experience, unfortunately. Perhaps they would offer a little more in terms of refined character during the dinner hours."], ["Roxanne K.", "What a cute little BYOB in the heart of the hood. When we hopped over to Jimmys (the italian store nearby) to get our wine I thought \"where the hell am I?\" The dinner scallops were OK, tortellini with crab was good, the pulled pork poppers could have been left behind... and my friend wasn't impressed with the mussels (which were pushed by the waiter)... It's a cute place and service was good, but the price was steep for return on investment. $6.5 for a \"homemade\" rum raisin ice cream in a champagne glass?... it wasn't that good. I'd probably make my way there once more to see if it was a one off.Oh, and I forgot about the bathroom in the kitchen... little much for me."], ["Meghan Z.", "We went here for my belated birthday dinner last weekend, and sat in the overflow location.  The food was very good - my side of the table sampled the prosciutto-wrapped figs for an appetizer, I had the scallops as my entree and split their mac and cheese side with the bf.  The scallops were well cooked, the risotto was smooth, and the figs were very tasty! The mac and cheese was a little too rich for me, and it was made with penne noodles, which I thought was strange.  The huge downfall of this restaurant was our server.  As people have noted, Urbano is BYOB, so they don't have to come over and take your drink order.  However, it took about 25 minutes before our waitress brought waters, and even then we had to request that she take our order.  We did not have a huge group (9), but she seemed very inattentive and hard to find.  She forgot my friend's salad, and another couple's side dish, and each time this was mentioned to her she simply said \"Oh, yeah, I forgot to put that in.\" No apology, no effort to quickly bring the food - nothing.  When we first came in and I looked at the menu, I told the bf we would definitely be back (everything looked so good!), but after the extremely poor service, I'm not so sure!"], ["Kat V.", "I love that Urbano Cafe is BYOB.  I'm surprised someone remarked that their bill was so high, when every occasion that we've dined here, we've thought the opposite!  Good food, cozy ambiance....but if you've never been here before, just know that you MUST make reservations in advance!  They have a second dining room a couple of doors down now that will allow for private parties now.  I am not positive but I feel like the head chef may have changed bc I noticed the risotto was prepared differently and was much drier than I prefer.  I always bring out of town guests here, and we always have a great experience.  And sometimes, bc of the small space and cozy atmosphere, we interact with other diners and share wine and stories.  Good times.   This place is one of my fav's.  I highly recommend it to everyone."], ["Christopher B.", "We had an interesting evening here on Wednesday. I have started doing \"tastings\" at restaurants - so we simply said to the excellent staff at Urbano - bring it on. And they did.By the time the 6th course (dessert) came we were stuffed.Some quite interesting dishes on the way through.An outstanding piece (small - about 3 oz) of rib-eye cooked beautifully served over grits was probably the highlight.The lowlights (and they weren't that low!) were the desserts and the risotto. The risotto was a little off. The rice was a little gummy and chalky at the same time. tasted like it had not been cooked long enough and stirred over zealously.The desserts were simply too big and served in a kind of plop it down on the plate way. They could have been more elegant and certainly a whole lot smaller.Nice time, love the prices, BYOB is the way to go and we certainly made use of that!"], ["Steve V.", "Came with co-worker for lunch. Reviews and menu brought us there to check it out. It's a smallish place located in a slightly sketchy part of Fitzhugh... right by Jimmy's. Not complaining, I think it's good that more local restaurants are making good food in non-trendy locations. The interor is clean and comfortable. I could see it being kinda loud when crowded.I started with tomato soup. It looked thin at first, but the flavor was there. It was creamy (almost pink in color) though not too heavy. We both went for paninis. I had the pull pork with veggies. It was very generous and the pork was tender and but NOT mushy. The flavor was spicy but not overwhelming. Co-worker had the chicken parmesan panini with matchstick fries. He liked the freshness of the ingredients and the flavor of the chicken. Only complaint was that the sandwich was a little too dry and needed more sauce of some sort.  Bread was good... though it might be too thick to be called a panini.Fries were well seasoned,  thin and crispy like he likes them. I thought they  were a perfect example of matchstick fries. Service was friendly. I'd give it 3.5 stars if I could,  Another restaurant to return to, try other items and see if we can add another star."], ["Julie L.", "First visit and pleasantly surprised by the good food. We are vegetarian and the menu did not include vegetarian entrees, but our server was quick to provide options. We started with bruschetta s'mores appetizer and it was good. The pesto had a fresh light taste. Then a watermelon feta arugula salad which was different and again very fresh. The stars of our visit were lemon risotto and shredded stir fried Brussels sprouts (without the meat) which were both amazing. We also had mushroom risotto and grilled asparagus. Both tasty but this risotto was a bit runny compared to the perfection of the lemon risotto. Desserts were good if a bit bland - creme brûlée and a key lime pie ramekin. I would have like a freshly made slice of summer cake or a fruit based tart - something rustic and special like the other dishes. You might drive by and wonder if you should stop and the answer is yes. Make a reservation though if you want a table. We did not have one and were offered seats at a bar."], ["Darren D.", "Small (9 tables) bistro with some tasty dishes. We joined them for lunch, and enjoyed a salad special (a bit of kitchen-sink salad), a risotto special with pulled-pork and sun-dried tomatoes, and a some soup.My one quibble: Our soup & risotto dishes were a little on the salty side, but otherwise delicious. Depending on your choices, lunch can be a bit expensive, but plenty of reasonable options are available (paninis, etc).Manager/owner was friendly and seems to be well-connected in restaurant community.We will definitely return for dinner with a bottle of wine in-hand."], ["Scott L.", "On my second visit to Urbano everything ran smoother with the wisdom from my previous experience.  Got wine at Jimmys next door right before closing and we didn't sit next to the kitchen which was more comfortable.  The food is very good here and the ambiance is European bistro, a small space with 9 tables.  Families, couples,  double dates and well dressed groups all had their bottles, some had 2!  And the intimate laid back conversations completed these well prepared meals in a way that reminded me of hanging with my Czech relatives.  The two down-to-earth gorgeous waitresses, one with no make up and a constant smile, the other an efficient bulgarian chic could have been a dancer, treated us professionally and like friends or family. I had scallops again, they may have been better, although I only got 3 scallops this time I didn't complain.  Lisa had the cod.  We shared the crabcakes and for dessert, fig sorbet and chocolate mousse.  Everything is made by hand here.  I pointed out the chef who could triple as a Serbian model or boxer and Lisa's jaw dropped.  Is he tasting the food as it goes out ?  She nodded.  Is he drinking wine?  She said I see a glass. It doesn't get much better than urbano if you're lookin for a European experience, a special place, a simple menu and BYOB with free corkage.Highlights:Chocolate mouse - 4/5Sitting away from hot open kitchen - 4Polite & laid back European ambiance-5Scallops - 5Byob- 4/5Waitstaff - 4Hunky chef working in open kitchen - 5Scenically rough around the edges urban neighborhood - 4"], ["Jim J.", "Had lunch there today and was not overly impressed. The service was friendly albeit somewhat slow. Prices were average for the serving sizes, and the food, itself, quite good  - but not over the top.The only negatives were obvious lack of parking, and the small interior size caused loud, reverberating noise with just several tables filled. It was somewhat hard to converse inside.One last note, something should be done about the panhandlers working the sidewalk immediately outside the front door."], ["Kevin D.", "Would love to come here more often.  Had a great date night at Urbano.  Where else in Dallas can you have a 5 Star meal for $100 after tip for two people (eating well I might add).  You can when it's BYOB!!!!  Brought in a couple of expensive bottles of wine on a date night and had one of the most satisfying experiences one can have at dinner.  I had an '02 Cab whose cork fell apart in the bottle when our waitress tried to open it.  Needless to say, she drained, filtered and decanted the bottle while we went through our champagne and appetizers.  It took her awhile to get it done....now that's 5 star service.The menu isn't cheap but the food is high quality.  We sat in the 'overflow' location next door but it's (in my opinion) similar to the main restaurant.  I can't even imagine what my meal (with wine) would have cost elsewhere..."], ["Patricia F.", "OMG yummmmmmm!!!I couldn't believe how great this place was.  I hadn't looked at any reviews before my hubby and I went there, and I have to see my expectations weren't that high.  I had the duck breast which was one of the best preparations of duck breast I have ever had.  There wasn't any gross fat, tendons, cartilage, etc that sometimes makes duck unappealing, and the meat was cooked PERFECTLY.   My husband had the trout which was also perfectly cooked and seasoned.  We also ordered the okra on the sides which was absolutely amazing.  My husband had to keep telling me to slow down because I was literally shoveling it in my mouth.  Since going to dinner there I have bought and prepared okra inspired by this dish. For dessert we had the chocolate mote which was rich and smooth, yet light at the same time.   Best of all, this place is BYOB which really helps cut down on the bill.  The whole meal really was SO SO SO good. I would go back here in a heartbeat."], ["R C.", "So..... after three different occasions and three different duck plates, I can say I'm pretty disappointed with their duck. The duck was rubbery and without a nice seared outside, not once, but three times. I don't think their grill is hot enough. Don't get me wrong, if you like your duck without a seared outside... uh... you will like it. I'm sticking with the AMAZING filet.Also, the risotto balls? And the risotto in general? I agree with other comments about it being a little chalky, it isn't cooked enough. Good... but not quite there.Still love this place though. Super friendly service, and really amazing food for the price. It can get loud though (we've been coming here for a while now, and I'm happy to see it doing so well, but I do miss the weeknight evenings being a little quieter)."]], "Avanti Ristorante": [["Mari R.", "Went here with my date for a late Friday night dinner. Staff was friendly; server was an outgoing Italian gentlemen expounding on how good the food is here (the best in Dallas). We started off with carpaccio appetizer. It really took some time for this to arrive to our table and when it did, we were really disappointed. We received a large soup-size bowl of spring mix greens with a dollop of a mustard-like sauce on side and some large shavings of Parmesan. Where were the capers that were supposed to be included.... And where was the MEAT? After digging under the greens we found two quarter-size pieces of meat. We could not believe how skimpy they were on this and my date and I each got one small bite, seriously, it was like the meat was an after-thought and were serving like croutons to a bowl of greens. For the price of the dish, we were disappointed and felt robbed. My date got the chicken parm dinner which he said was good. The chicken was really thin and dry, but the noodles that came with it were really good, so my date was 'satisfied'. Setting was nice, with a guitarist. Service was slow for a fairly empty restaurant. Was hoping for better."], ["Brandi N.", "The service just doesn't get better than this.  These servers were obviously VERY well trained.  She served according to the serving textbook.  She knew the wine list well.  She was friendly and she was personable.  If there is one thing that stood out from this night it was the service!!!The food was good, too.  I ordered spinach lasagna and the pear and Gorgonzola salad.  It looked like it was going to be dry.  It wasn't.  The invisible dressing was jam packed with flavor that made me want to lick the plate but I swear I didn't!  Avanti also has live music.  I was totally enjoying the music and expected to look up and see a tall, handsome, cool, swaying man behind the mic.  I didn't.  It was an old, unassuming man belting out sounds that surely have landed him a good wife or two.   The atmosphere is romantic!  It's small and intimate.  It's dark, but not too dark.  This is a very impressive 1st date spot.Note: The crab cake is small and extremely delicious.  This means it is NOT shareable."], ["Rick C.", "We tried Avanti on a whim.  We had just flown into Dallas, had checked into our hotel, and wanted to find a good, close restaurant.  It was almost 11pm.  The hotel referred us to Avanti.  When we arrived, they were just about to close.  They were nice enough to seat us.The service was excellent.  They quickly took our order, brought us two nice glasses of pinot, and brought our entrees in about 10 minutes.  My wife had a Caesar salad and Salmon. I had the Capellini Pescatore. When they brought our entrees so quickly, I didn't expect the food to be very good.  I was pleasantly surprised.  Everything was great."], ["Veronica M.", "the crab crusted bass is t he best thing on the menu. One of my favorite restaurants!!"], ["Jeremiah R.", "I won't lie... I am slightly prejudiced against this section of uptown. I work off of the assumption that I am paying for the location, and that the food quality will be about that of hotel food. When I walked into this restaurant, i wasn't expecting much. The decor and building are rather unassuming. Upon looking at the menu, I assumed that this would be nothing particularly memorable. Turns out, I was highly mistaken; the kitchen is extremely professional and accomplished. Before I begin with the meal, a tip of my hat to the chef; Nothing is oversalted or over-creamed; two phenomena that are all too common. You won't feel that it is missing, but it is not hiding the flavor of the food. Here is the play by play: AntiPasti: CalamariThis IS NOT a rubbery fried mess (it almost always is; which is part of the reason why i don't always order it). This is a non-greasy, lightly crusted, flash fried, tender dish that left me wondering where they purchase such fresh calamari in a land-locked city. I didn't taste the herbs that they touted, but it's not necessary with calamari this well prepared. It was served with a marinara that was light and citrusy; in no way bland. Insalata e zuppa:  I ordered the beet salad. it is a rather generous serving of fresh watercress tossed with a balsamic, enveloped by roasted beets (red and golden variety), topped with walnuts, and then accentuated with a lightly breaded, flash fried, cake of herbed goat cheese. Perfectly executedMy wife's clam chowder was not too salty; and had a distinctive clam flavor. Primo:I ordered the salmon. It is perched on top of a risotto mixed with fresh julienned squash, zuchini, and brocolli. The vegetables were slightly cooked and retained their natural aromas with a  perfect texture. The salmon was well prepared, but could have spent slightly less time in the oven so that it was more moist. It wasn't dry, as it was grilled and then baked to present two different textures, it just could have been taken out a few minutes earlier. The risotto was well prepared, but seemed to be missing a certain someting (a nice rosemary, thyme, and lemon zest concoction perhaps)? It was topped with a surprisingly flavorful bruschetta style tomato and basil mixture. I mixed this with the meat and risotto.My wife ordered the Fettucini with Tenderloin MedallionsI just tasted some of her left-overs; and must state that this dish's description is under-described by the menu. The meat was cooked well done, as she asked, yet not dry. Instead of the small medallions I expected, she was given easily 6-8 oz of meat; enough that it arguably could have been listed on the meat section rather than the pasta. The fettuccini was perfectly al-dente. It was thicker than you would expect from dry pasta so I don't know if they make their own, or go to a specialty shop. Either way, it was not an afterthought or a filler ingredient. The mushrooms were not soggy, but flavorful and had great texture. The meat sauce was a lightly creamed meat sauce / gravy with a refreshingly subtle flavor that took the dish to the next level. The citrusy flavors appear to have come from the diced tomatoes tossed in the dish, that were added early enough to contribute to the flavor while not becoming soggy. Dolce e Cafe: My espresso was extremely thick and flavorful. I suck down coffee like it's going out of style , and I had to sip this small cup and savor the quality. My wife's creme brulee was topped with brown sugar, and filled with fresh strawberry. This added an additional flavor that took it over the top. This is the first creme brulee that I have tried that didn't feel like a custard; but rather a light and creamy dessert.Drinks: My  wife's dirty martini, along with my old-fashioned, seemed to be watered down. The flavor is there, the liquor is not. If you are an old school drinker; you may miss the intensity of the drinks. If you are a light drinker, you can feel safe ordering from their bar.Staff: They are attentive but not intrusive.Another note: it was our anniversary dinner and I was not disappointed. I didn't let them know because we don't like the fanfare; but they did handle a birthday with a sparkler cake but no singing.. Which was celebratory but not tacky."], ["Gianna K.", "Food was good. Hubby's was better than mine. He had lobster difriaba. I had ravioli. Prices were reasonable and wine is 50% of bottles Sunday's and Mondays!"], ["John S.", "I had my first experience at Avanti this evening and it was a wonderful experience.  The food was great, the atmosphere was great, and the service was great.  In particular, be sure to ask for Albert when you visit Avanti, he made excellent recommendations and was beyond helpful and accommodating every step of the way.  In addition, the management of this restaurant made sure that every detail of our dining experience was to the utmost perfection.  I will highly recommend this establishment to everyone I know."], ["Requill B.", "Scrumptious food and fast service!"], ["David O.", "Friendly staff, nice atmosphere, food was excellent.  Chicken parmesan had enough for two people, but I still ate it all myself."], ["Patrick M.", "authentic family making authentic for for authentic hungry people. love this place. will come back when in Dallas again."], ["Maureen B.", "I've been here once for dinner and recently came here for lunch. There's a cute outside area, which I have sat at both times. Most of it is covered and a portion in the front is open. The waitstaff is very nice and courteous and the atmosphere is intimate.They have a great calamari appetizer and I liked the angel hair seafood dish. I left out, I think mussels and ordered it with only shrimp and scallops. I think the shrimp were a tiny bit over cooked and wish it was served with a tad more sauce."], ["Dana C.", "I came here on Valentines's Day so they had a special menu which gave us very few choices.The ambient was delightful though, the live music made it romantic and intimate. The food was good but the server was not nice at all and very inattentive. I thought we were going to have a great time but it was more stressful that anything else."], ["Jacqueline C.", "Avanti is one of the most relaxing restaurant experiences one can have in up-town. It's classy without being pretentious, romantic but not over the top, and cozy but no so casual as to lose the formality of good service. Although most of the tables were occupied by groups of friends, the red roses, candle-light and live acoustic guitarist makes it difficult not to mentally categorize Avanti as a date night kind of place. As for the food; on a scale from most to least enjoyable, the mussels were perfect, the gnocchi was good, the capellini pescatore could use more seafood, and the delicious bread would have been that much more enjoyable with spreadable butter."], ["Gayland L.", "Super loud in there. My wife and I could barely hear each other. Food was good but didn't wow. I had the fettuccine and filet medallions. Meat was very tasty but wasn't served with enough pasta. I think the sauce could have have more flavor and the dish would have been outstanding. I was expecting a little more. Desert was a bust. Wife ordered cream brûlée and it was awful. It had the worst texture. Not creamy like it's supposed to be."], ["Doug P.", "My wife and I were on a date following our daughter's wedding and came here almost by accident. Very pleasantly surprised. The food was excellent, the service prompt but unobtrusive , the live music provided a great atmosphere.  Also wine is half price on Monday."], ["Mahereen M.", "Extensive wine list, good service.  Smaller restaurant so can get a little loud but overall a very nice experience."], ["Rinny K.", "If your looking for late night intimate dinner this is the place to be.  At the dinner table there are candle light setting and live bands.  Valet parking is wonderful.  The food here is great and the cocktails are very strong well worth the money.  The severs are wonderful except the lady waitress.  I had her one time and she never came back to the table.  However I love it here so I continue to come back.  This place is also wonderful because they close at 3 AM. After 12 they serve breakfast."], ["Katy Q.", "Italian place close to home. Ordered:- Appetizer Tuna Tartare which was pretty tasty, the flavors really bring it all out together. The toast tips were crunchy, but too small to actually eat with the fish though.- Entree Lobster Crab Ravioli which was OK, big chunky pasta pieces where they didn't overpower with the sauce. - Desert Chocolate PB Cake was good, but its hard to mess these flavors up. The others in my party thought the overall food was decent, but the desert ruined it for them. Crem brulee was mealy and the mango flan was extremely tough. The other entrees weren't special either, didn't feel authentic Italian.Service was fine. Overall setting was dark, romantic like, and the live music was a bit loud. Had plenty of wines and valet parking. May be irrelevant, but I did get a bad tummy ache afterwards. Didn't feel like food though."], ["Beverly R.", "My husband,  son, my son's fiancee  and I wanted to have a nice dinner to celebrate their engagement without taking out a loan to pay for it. Avanti was the perfect choice.  The restaurant is small enough to be intimate and large enough to not be cramped or claustrophobia-inducing. Our waiter was attentive and guided our ordering by answering our questions. The four of us all ordered different dishes, and we were all happy with our entrees. The food was delicious, and the portions generous.  The wine he suggested to accompany my entree was very good. The icing on the cake: we had our dog in the car and it was hot outside.  The parking valet offered to keep the car running so the air conditioning could run, and parked it right outside the front door!! We can't wait to go back."], ["Ashley V.", "Loved the atmosphere. Music was great.we went here for our anniversary. They made it very special.food was outstanding. Can't wait to go back!"]], "Bellini's Café and Pizza": [], "Ravenna Urban Italian Restaurant": [["Travis J.", "Went in on a slow night, the bartender made my extra dirty martini perfect.  He gave to recommendations for food, I went with the Pork Chop Calabrese...awesome choice!!  Great flavor, tender meat, nice sized portion, but not too much.Finished with the Tiramisu, once again, perfect size, not dry at all.Prices for the food accounting for quality, taste, and portion size is good.  I'll definitely be back while in town."], ["Vonda R.", "I ended up at Ravenna because of the friendly greeter speaking to everyone who passed by after leaving another restaurant because apparently I was invisible.It's a nice, quaint place for meetings, lunch date, etc but the food is ok. Ravenna is going towards being upscale instead of casual like its neighbors. Service was good except for the one person I waited on to take my order. I ordered the chicken piccata to go. It was OK."], ["amy b.", "Loved the service and the food. It's not everyday you get to enjoy legit cooking. We had the pizza and it was amazing. And they were open late which was super helpful after getting off a plane and just wanting a good meal to start the vacation off right!The owner totally sold us with his little speech at the door.  smart man."], ["Scott L.", "A late night pizza slice is difficult to obtain in downtown Dallas, and forget about it being decent.  As a matter of fact, Serious Pizza in Deep Ellum is the only central Dallas institution catering to that specific need for late night Munchies, which in north Texas usually appears in the form of tacos or hamburgers. I had seen the hidden back pizza selection at Ravenna before, which serves til late at night, up until they close.Perhaps the only saving grace of tourist trap Ravenna, where even an effort at dim lighting can't manifest charm in what feels like a faux Italian bistro dump, and yet still the proprietor insults locals with $20 pasta dishes where the dull reputation alone doesn't even warrant an experimental order.I got a slice of pepperoni, with the only other option being cheese.  I went to the bar to pay where a bartender preoccupied with closing out tabs did not greet me.After at least a minute of waiting to give her a chance to respond, \"how much is the slice?\"\"$4.01\" she uttered without glancing at me.I pulled out a five and a penny and continued to wait.  I enjoyed the existentialist absurdity of a Coehn brothers scene.   After another full minute -\"I'm ready to pay now.\"  I said.\"Do you need change.\" She spoke effortlessly unfriendly. \"Yeah.\" I said with an upbeat lilt that was a little ironic and mocking.  It was my dollar.  It was my slice.  It was my exit. The crust tasted of flour and garlic, the sauce was thin and the cheese not over portioned, it was arguably not worth $4.  It wasn't gourmet, but rather like a hot pocket product.  The slice filled a need, but I'd maybe next time bike over to Serious Pizza  for better slices at about the same price."], ["Monique K.", "Over a weekend visit to Dallas with my Mom we stopped into Ravenna after a recommendation from our hotel. We split a caprese salad, Mom got a special dish seafood manicotti dish and I got lobster ravioli while splitting a bottle of Malbec. The food was tasty, our entrees were solid but the caprese salad wast super fresh, its also early in the season for flavorful tomatoes so I guess I can't blame 'em.The staff was very helpful, we discussed our wine options with them and found that their normal Malbec wasn't available but rather what is normally sold at a higher price point was offered at the same $40/bottle rate as what was listed on the menu. Throughout the evening, the staff didn't hover and when they did check in with us we they were quick witted and thoughtful in their recommendations."], ["Phillip B.", "Service:  Slow and annoying.  It was a slow afternoon with only six other customers.  I hate having to repeat myself, and, I hate when my server takes too long to check in after the food has been served.  I was not offered any cracked pepper or fresh Parmesan.  I had to ask for it.Ambiance:  None really.  I mean it's small with a bar, view-able kitchen, and, smells like rotten meat back by the kitchen/bathroom area.Food:  Huh!  Some plates were ala carte.  Pork chop was tough and dry, and, was on top of some nasty ass french fries (potato wedges?) that were all soggy and nasty.  $15 pork chop should never be anything less than perfect.  What?  No salad or veggies?  I gotta order them separate?  It's a fucking pork chop for crying out loud!  Now it's being treated like wild rare game.  Rigatoni Bolognese was a $9 option.  What came out was Linguine Bolognese.  Very bland boring sauce.  What did we think of the food?  Dried out pork chop sux donkey assnut.  Bland bolognese can't be awakened with anything.  Seriously, Ragu and Prego (which are gross) would have suited me better. EEww!  Did I just say that?Complaint:  Yes, we sure did complain.  We were offered something different.  My companion was at limits for the day and needed to just get back home, so, he didn't have the stamina to wait for another dish to be cooked.  Strawberry Cheesecake it was for him (to go). He liked his cheesecake.Website:  So annoying that I have to constantly turn off that annoying fucking music!Would I go back?  Maybe.  A very weak maybe.  More than likely not, but, I won't put them on the Nasty List.  A very over priced place that failed to bring the quality/quantity for the price!"], ["Chelsea R.", "Not bad for a late night tip kind of place. The pepperoni pizza just tastes like any other pie you would eat after a long night out. I mean because let's face it...even when pizza is bad...it's still pretty dang good. It does come out hot and fresh. I agree with other reviewers that the atmosphere is so dark and not really inviting at all. I did not have a problem with the service, it was average. I'm not sure I would ever come over here for dinner as it's kind of out of the way...but it's in the heart of downtown if you live near there and have a craving. I have yet to try other dishes...not sure I'm convinced enough that I need to."], ["Chris B.", "Great Company and food! Great Late night pizza yum. Bartender's are awesome and offer great information on the town and places to go."], ["Amber P.", "Excellent service and delicious food!  We felt so special when we were here and I have never had such delicious Cheese Ravioli and their house wines are very pleasing.  Great job and next time we are in Dallas we will be back."], ["Dehvon Y.", "Wonderful service and delicious food made with heart. I've never had a bad experience and I really appreciate the late hours. It's always nice to be able to get quality food late at night. I always recommend this spot. Go!"], ["Vince N.", "I was hoping that the reviews held true. Everyone gave this a 4 or 5 star, but I think i've had better Italian elsewhere.Kudos for being open late and for the bartender being a nice cool guy. I ordered the fish and it's in the high 20's in price. I thought that was a bit absurd, but someone told me fish is just plain ole expensive in Dallas.The salad here is very tasty and the bread was perfect with the meal. I filled up on that stuff .The restaurant is a bit dark so bring a flashlight when you eat here."], ["Leland B.", "Ravenna is my go to restraunt when I'm serious need of pizza. I've eaten here before for dinner a few times, but I really enjoy the pizza the most. It's what keeps me coming back. What I enjoy most about the pizza is that it's hand-tossed, house made and not overly salty or greasy. I hate the feeling of having to down a gallon of water after eating a pie as is the case with most chain pizza places. The waitstaff is always very friendly and attentive. I've never had poor service here. The vibe is cool and quiet. Relaxed, with dark wood and dark lighting. You'll likely find people traveling on business sitting at the bar and families at the tables. This is a nice place to bring a date if you're in downtown and don't want to destroy your wallet, but still have a nice experience. The dinner selection is more Classic Italiano and it's surprisingly good."], ["Amanda G.", "We are touring Texas on our honeymoon and decided to stop here tonight. After touring Dealey Plaza, we went on Yelp to find a restaurant for dinner. We were overwhelmed by options and decided to go to another restaurant near Ravenna. We passed Ravenna on the way, and I quickly looked up the menu. We decided to go there instead.We are so glad we did. Service was impeccable and our waiter knew all about the items on the menu. We received our food very quickly, and everything was hot and delicious. We ordered calamari and spaghetti and meatballs. Both were absolutely great. We highly recommend!"], ["MrsBrazil N.", "The atmosphere is exquisite. Perfect for a date; HangingOut with friends in the Downtown Dallas area; or just wanting to treat yourself to a nice meal.My husband & I had Calamari & Pasta... Doesn't look like much food- but your eyes are deceiving you!.. We are about to walk out with our buttons undone. Lol.Two dinners & an appetizer cost us $64... Well worth it."], ["Steve Z.", "How is The Godfather sandwich not in ANY reviews? I was in Dallas for the weekend and ate at some known places and this place has the only food I found to be memorable. Came here because I was in a rush and needed a quick lunch before heading back home. Saw the that the Godfather sandwich came with giardinera which caught my eye. Here's the description from the menu:Milan's Famous Breaded Fried Meatballs, House-Made Basil Pesto Sauce, Tomatoes, Buffalo Mozzarella, Balsamic Glaze, Olive OilThe pizza looked just okay (didn't eat any) but I will definitely be back here for my first stop next time I'm in Dallas to get that sandwich again. I'll be sure to take pictures of The Godfather because that sandwich deserves recognition."], ["K V.", "Excellent Italian on a busy night.  Sauce and pasta were done to perfection.  Quiet ambiance so you can carry on a conversation.  Will return soon.  Nice go to spot."], ["Chris F.", "My girlfriend and I came here while enjoying a Labor Day weekend staycation. Everyone in the restaurant were very welcoming and provided top notch service. We started our meal with calamari. My girlfriend had the lobster ravioli and I had the chicken pesto linguini. Both entrees were great but I preferred mine the most. We enjoyed our experience and will definitely come back"], ["Kiona S.", "Great meal, fast service, flavorful food and strong drinks. This place is romantic and quaint. If you want authentic Italian where the kitchen is open late then this is your place."], ["Elizabeth M.", "My husband and I were passing by and stopped to look at the menu, a man came out and offered to answer questions and informed us of the specials. Those alone caught our attention and we decided to give this place a try. We were immediately given water and ordered wine. We ordered the Bruschetta appetizer, Chicken Saltimboca and the Mancotti special for dinner. We also had a Cannoli and strawberry cheesecake for dessert. The food was delicious! The appetizer was great,they had their own twist to the bruschetta which made it even better. Dinner was great. Food portions were large and the dessert was worth the extra calories:) highly recommend. It was a little pricey but we will return."], ["Kim S.", "Restaurant was highly recommended by my hotel concierge (hint, hint), but the food was pretty good. Pasta appeared to be made in-house. Although, the atmosphere is really that of a hole in the wall restaurant. I was expecting a nicer ambiance."], ["Ron A.", "What appeared to be confusion when i walked in, quickly brought me back to a frenzy only found at big family gatherings.  If I had known, I would have worn my vest and tie to blend in with the wait staff.Food selection was solid, typical Italian menu. Went with the linguini w/ clams. As hoping for more clams. Overall a good meal."], ["Brian Q.", "Normally any pizza tastes great at 2am after you've had a few too many drinks at the club, but Ravenna's pizza was still mediocre.  Not wanting to pass judgement on old reheated pizza, I came back for dinner another day for some fresh out of the oven stuff.  While it was definitely better than the late night offering, it was still painfully average and otherwise unmemorable.  Add that to the dark, uninviting atmosphere & slow service and you've got a place I won't come back to again."], ["Philip P.", "The food and service were just meh.  I'd like to give this place another shot but the prices aren't great and the service is worse.  There are around 20-25 tables in the place and the night we went (Saturday) there were only 2 waiters...which one of them was the bartender.  I ordered the Zuppa di Mare which is seafood with linguine...It cost $30 and was really not worth it.  I'd rather go to the Original Italian Cafe (across the street) or Porta Di Roma (few blocks down.)"], ["Jesselyn T.", "So apparently I came on the wrong night or something.The husband and I stayed downtown as a staycation this year and went to Ravenna's as our Dallas Fish Market staple was already closed on a Sunday night. It's a cosy little place. Very cute. The bartender didn't know what a Kir Royale was. Or what a Toasted Almond was. So kids, stick to your vodka sprites here.Our server was sweet even if it was not stellar service. I had to ask for my water glass to be refilled a couple of times. I ordered their Diavalo. Which is a spicy red with 4 large shrimp in it with linguini pasta. The sauce was tasty. The shrimp was larget but there were only four. I expected more from a $14 dish. Though I guess they did mention they were only serving four shrimps with the dish.The husband had the Veal Francese (?). The breading was soggy. The lemon flavor was unfortunately very over-powering (and we didn't even squeeze the extra lemon half we were given). The tab was $40. So rather pricey still as a whole.Still meh. Have had better italian."], ["Spiro T.", "Wow. Lasagna that would satisfy Caesar. Great  service food and cocktails. Macedon Pinot noir was spectacular."], ["Paul L.", "Came in pretty late for a drink and a slice. Service was quick and friendly, price was fair. I was pretty impressed by the pizza. Crisp, thin crust, just the right amount of crunch. Sauce and toppings were all good. No complaints here."], ["Emily D.", "I ate while in Dallas on a business trip. The concierge at the hotel recommended it me. Based on her description I was hoping for more. The service was average maybe a little on the slow side and the food was pretty average as well. Next time I'm in Dallas and wanting Italian I will go elsewhere."], ["Jeff P.", "Quite possibly the best pizzas I've ever had!  I go considerably out of my way for this pizza."], ["Louise G.", "Very good, very reasonably-priced Italian food served in a relaxed, comfortable atmosphere. Perfect for Wednesday night dinner with a work colleague. We had eggplant rollatini for an app (delicious) and followed up with penne and tortellini. The pasta was served al dente in flavorful sauce.   Service was friendly and attentive. I recommend Ravenna and will go back on my next trip to the Big D."], ["Lauren H.", "Our concierge at the Magnolia recommended this place-- and turned out we had been before and forgot. The first time we had pizza and I thought it was pretty tasty, and an interesting collision of bar, restaurant and patio so we gave it another shot.I got tortellini carbonara...eh. Take it or leave it really. Sauce wasn't quite creamy and the prosciutto wannabe left much to be desired. Man was unimpressed with his bolognese, and with an $8 glass of wine, tab was way too high for mediocre food.Stick to pizza here I guess."], ["Quinton M.", "Lame. Not great. Service was awful."], ["Sherry K.", "This place has an undeservedly low rating. We live in west Fort Worth and happened upon it while visiting Dallas. Since, we have returned, driving 35 miles out of the way just to come here. The owner is a boisterous, very friendly Macedonian who cares about having a great product with great service. I would definitely recommend it to anyone. The pizza is AMAZING!"], ["Ashliey W.", "Grade A customer service and melt in your mouth food. I loved the owner who personally greeted us, served us with personality and professionalism. I eat out a lot during my stay in Texas and I only remember this place to be honest."], ["Nina B.", "Extremely disappointed. I was craving Alfredo, so decided to order since they are so close. Beware if their online pricing, it is  wrong. I'm giving them one star since they were kind enough to honor their online pricing. However, I'm sitting here writing this review with my food in my lap.... Done. The Alfredo has no flavor, it's like eating noodles with a no flavor sauce."], ["Chloe G.", "I live downtown and this used to be my go to pizza place... But the other night I had a really bad experience with one of the employees and I will never go there again.  My friends and I arrived 1:30 a.m. one late night after  beers at City Tavern. The pizza selection was pretty weak/not fresh but we got slices anyway. As the guy was putting my slice in the oven some cheese and ONE pepperoni fell off. He asked if I still wanted it and at the time it was no big deal. Since it was such a SMALL piece that fell off my friend joking said \"discount\". He agreed. So after waiting for the pizza to cook in the oven, we paid... With the \"discount\" my old, one slice of pizza was 3.25. Still being 1:30am I shrugged and paid. It wasn't until we were out the door and I opened the to go bag. Literally it was HALF a pizza.... The slice wasn't even a triangle anymore. I went inside to talk to the guy and he was very rude to me. I explained that I agreed to pizza that was missing a piece of cheese NOT a half a slice. The employee angrily banged around in the oven saying nothing else fell off and it was like that to begin with. Two guys were in line waiting for pizza behind me and showed them my pizza and asked if they would pay 3.25 for it and their response was \"did someone eat half?\" The same guys saw how I was treated and decided to go else where for munchies. After refusing to give me another piece, the employee slammed my pizza in the garbage and gave me my money back. Also he added that he \"didn't care that he lost my business\". I am disappointed in this place because the food is decent but I will not be returning."], ["Katrina S.", "My fellow Yelpers, I took your advice and went here for dinner and all I have to say is shame on you!!Our waiter was more interested in us paying our bill before we were done eating so he could continue with his Saturday night plans than actually providing any form of service to us.The food was sub-par (at best) and the one appetizer we did order, they couldn't even make because the kitchen was out of the main ingredient! Oh and let's not forget that the appetizer we ended up settling on was $11!!Finally, to put the icing on the cake of our horrible dining experience, when the bill did come, our waiter over charged us for the two soggy tiramisues we ordered.Unless you enjoy over priced sub-par food and horrible service, DO NOT come here!! I almost wish I could give this place a negative rating... just awful!"], ["Shelley E.", "Our favorite local bar (especially when Michelle is working).$1 pizza from 4PM to 6PM, Mon-Thur and great happy hour drink specials! Love bringing the dogs and sitting outside when the weather is nice. This was also a great place for people watching like when OU came to town and during the holidays as Santa bar crawls made their way through downtown Dallas.I've always hated \"shots\" because practically every shot I've ever had tasted terrible. Not Michelle's shots! She's always experimenting on us with different recipes and they are always great tasting shots."], ["Adam D.", "I stop in here pretty regularly when I'm downtown on my bike after midnight, as Dallas is lacking in the late-night downtown food department, this is kinda the only place to go that isn't 7-11, unless I'm missing something...  The servers have always been really nice. I have always gotten pretty immediate attention every time.  I always get 2 slices and a beer.  I go right to the pizza ovens and there is usually someone around to take the order, then I go sit at the bar and they bring my slices. Pretty awesome."], ["Easycure P.", "Ravenna is a great little place to eat dinner, grab a slice of pizza, or sit at the bar and watch a game. Milan, the owner greets everyone at the door and is fun to listen to while he talks about the different food creations he serves. They have a stuffed veal chop that looked awesome, but I can't say because I didn't order it. Being on a budget, I have only tried the manicotti (five stars), a house salad (four stars), and a slice of pizza (five stars). The bartenders are really friendly, especially Michelle and Justin. And to top it off, the have Deschutes Brewery's Black Butte Porter on draft. The prices here could be described as medium, as most specialties are in the $22 range, and the chicken, veal and pastas are $15 to $17. I highly recommend."], ["Zachary K.", "This place is great, it stays open til 3am sometimes later, serves a fairly priced dinner menu with a wide assortment of items, and has live music on a near nightly basis. Its very lively on Friday and Saturday nights, they have a DJ and it usually gets pretty crowded. The sidewalk/patio is great for people watching as this is like the busiest intersection for Dallas Nightlife. U can drink/smoke and enjoy the downtown air.  Great!"]], "Olivella's Neo Pizza Napoletana Lakewood": []}