{"Mesero - Henderson": [], "Mr Mesero": [], "Maracas Cocina Mexicana": [["Frankie Q.", "White queso is like a drug! I love it & want it on All the things!!!Went here with my sisters and a couple of friends. Our server was a sweety and took great care of us even when it got busy. I had the Pork ribeye Ranchero, all I can say is yes yes yes. Not too much fat, cooked as requested & soooo flavorful. Add a mango margarita & I was in heaven.Then the live band came, awesome! Unfortunately I left before the Conga line but that's OK I'll be back."], ["Tim K.", "The food is always good and the staff is awesome. Wednesday $1 margaritas.They also have live music on Friday and Saturday nights. Come check them out. They have a great patio as well."], ["Scott L.", "Hanging out with a pretty girl on a mission to day drink on a Saturday, horrible words came out of her mouth \"I want to go to Maracas.\" I cringed.  She's vegetarian so I knew her choice was influenced by their history of always having a few vegetarian offerings besides salads and cheese centric entrees.I frantically blurted out other options since my last experience was über mediocre.Like a cab ride to average.I conceded, and the next thing I know I'm scarfing down chips on a pleasant covered patio with enough eye candy to somewhat assuage the insult. Then three words came into play. One dollar mimosas. After ordering a mimosa, six words from my waitresses mouth were thrown against my head like a swiftly volleyed dodgeball.\"You have to buy an entree.\"Pretty girl was happy with black bean soup and tilapia.   I inquired about mole enchiladas, which were available off the menu.   The mole was the non sweet kind and felt a bit dull but the chicken meat was decent.  The paint interior has been updated to a cheery cream color from the former sundried tomato red and overall the recent change in ownership has seemed to have improved things from my last failed visit. \"They always seem to have drink specials.\" She pointed out.  This always makes things better. Chips were still not highly rated, they were cold and though not stale, had a certain lifelessness from being bagged. Maracas isn't a place Id suggest for tex mex in Dallas, but the environment is pleasant and the daily drink specials make things liveable. Food - just ok but not super horribleAtmosphere - liveable $1 mimosas - Bomb"], ["Jenna H.", "One of my new Mexican favorites! When I was visiting Dallas, my best friends said this place that they recently discovered in Deep Ellum was better than any other Mexican restaurant in Dallas, so of course I was willing to go! The 5 of us went at 8pm on a Saturday night and half the place was empty. I was shocked considering the great Yelp reviews and weekend timing, but we were happy because the patio was immediately available. The patio is decent size and fun!!They have valet, so that's a plus, but we used Uber since it's easier. Must Try Items- Avocado margarita: It has fresh avocados and pineapple mixed in it. I was skeptical at first, but love avocados and had to try it...on the rocks and SO good!! I had two of them and was feeling very good. I asked for Patron instead of the brand on the menu, and they were made strong!- White queso: AMAZING! A large bowl can be shared by 5 people easily. It's huge and super yummy!Pros- Chicken flautas: I love flautas, but do not like the standard green sauce that Mexican restaurants serve. My flautas were half-covered in a green sauce, so I was bummed at first, but then I tried it, and it was incredible!! I don't know how they make it, but it's not the typical green sauce you get elsewhere. It was sooooo good! They came with yummy rice and beans as well. Everything had wonderful flavor!- Our waitress was attentive and awesome. I was chugging water like crazy, and she consistently refilled my glass!I typically like places like Blue Goose, and this is a new favorite. Everything was amazing, and my meal was only $12. My total was around $40 for a meal and two Patron margaritas.Warning: Their house salsa is very hot, so if you don't like spicy, the chips and salsa won't work for you. Loved it!"], ["Gricelda P.", "Went to Maracas for the first time on a Sunday at dinner time.I thought the place was a little too dark and dingy, I wasn't very sure what to think.After looking at the menu, I saw that they had several things that sounded very good. I ordered the potato enchiladas with chipotle sauce. First, I have to say THANK YOU for not making vegetarians eat just cheese enchiladas. Is nice to see a couple of choices! The food was very good, the service was great and they have daily drink specials, which is hard to find on weekends.I had a mango margarita and I liked it a lot. The special was $4.50 for margaritas of any flavor. I loved the fact that the mango one was not a gross pre-made mix like most places, you could taste little pieces of mango pulp in the drink, very refreshing. My friend had the raspberry one and he loved it too. The people who ordered the regular margarita were not happy though, they said it was flavor-less.I think I would go back, but maybe during the day because I did find the place strangely lid which made me feel like maybe it was secretly dirty."], ["Gabriela C.", "This place is amazing!!!! $1 mimosas Sunday brunch speciala. Not to mention the best Mexican lasagna ever had! Great staff and the music brightens up the atmosphere too. Enjoy!"], ["Han N.", "Just unforgettable Authentic Mexican food. Amazing queso I have ever tasted. Chips came out hot and fresh, salsa had bountiful flavor of fresh and savoring taste. We ordered the combo fajitas that came with beef and chicken. The beef was amazingly tender and juicy, cooked to perfection. The juicy chicken was so flaky right when you place your fork in it. We had a wonderful waiter that sold us on desert, cuatro leches. The slice was huge! Delicious, moist, and perfect, not overly sweet. Overall, great experience and a delightful atmosphere to capture the authenticity of the restaurant."], ["Jackie C.", "Went here on Wednesday...read an ad in the Observer about $1 Margaritas when purchasing an entrée. Well the menu also had as a Wednesday special $8 Fajitas (that's an entrée). Wait staff was very rude about this stating they have no specials on Wednesday.... So okay, I ordered a full price entrée. We had to literally hunt down the waiter for another Margarita. Ordered food they brought the adult food out first before the children's meals!?!?? The food is very bland, no taste and it is very over priced! Will not be recommending this restaurant to any one!!!!"], ["Amy B.", "My family went to Maracas to celebrate my brother's 27th birthday. We were TOTALLY DISAPPOINTED! My dad found this place in the Dallas observer and decided to yelp it- we were all intrigued with how great the reviews were. KNOW THIS PEOPLE- IT'S A DUD. DO NOT GO THERE. The service is TERRIBLE! The black beans had no flavor. I was constantly asking the waiter to refill our chips/salsa. If you're in Dallas and want some REAL Mexican food, go to the El Corazon in Oak Cliff.  They has the best margaritas and service staff. Don't go here, it's a waste of money. . ."], ["Thu N.", "Sunday brunch. $1.00 mimosas. Best mimosa ever. I'm not big on mimosas because I think there's too much of an orange to champagne composition. It should be 1 part orange juice (or your choice of fruit juice) and 1 part champagne. At Maracas, it's more like 2 parts champagne and 1 part orange juice.  And for $1.00? My Eggs Florentine was not so great because it was served with a tomato sauce that ended up making my English muffin super soggy. I basically ate the eggs only with my side of potatoes.  Would I come back? Yes, for the $1.00 mimosas,  light and crispy tortilla chips,  and fresh tasting salsa dip."], ["David F.", "Decent Tex-Mex place what I like the most about the place is the location and the margaritas. On the weekends they have their house band which is pretty entertaining. I would describe the music they play as something you would hear in a Robert Rodriguez movie. The service is pretty good and its rarely over crowded. I would say this is the best place in Deep Ellum for Mexican food."], ["Minh C.", "We came in on a Wednesday evening and got the Wed special, which was the fajitas at half price. The portion sizes are good, but we had big appetites so we each had two of the fajitas. The white queso was delicious - I mixed it with the salsa, which made it even better! Try it!The staff was very friendly and always refilling our waters, salsa, and chips without us asking."], ["Michelle D.", "Good food and great service. The salad was great! Nice and spicy with good flavor and the Mexican lasagna was good it was a nice portion. The waiters were really friendly and prompt; you didn't have to wave anyone down for service."], ["Isaac G.", "Food is always great. Service is EXCELLENT,and you can't beat the $1 mimosa brunch special. Robert is the best server there so ask for him if you get a chance. Management is also great with Angel always walking around making sure everything is in order. I highly recommend the tex-mex platter!"], ["Erica A.", "LOVED THIS PLACE! Went for a family dinner Saturday night, my wife and I just got married and they put a table right in front of the band, who were awesome!!! They had us dance and that was all amazing. The food made the place a 5 star! I and the main street special and it was to die for! Not too pricey and honestly for all the great staff and band of Saturday night I wouldve paid twice as much! Little hidden Mexican gem I would recommend to everyone!!!"], ["Milree V.", "Truly blown away at the current average rating for this place. The blandest texmex I have ever had in my 25 years in Texas. Poor service (understaffed, but staff was busting tail) and terrible food. Everything from the queso to the enchiladas were underseasoned and weirdly cold.The happy hour deals are nice - today was half price appetizers... Will never go back."], ["Shannon C.", "I really cannot say enough good things about Maracas - it is definitely my go to place for Mexican food, for the good food, yes, but also for the fun atmosphere and the great service.  They have specials almost every night, but my go to night is Thursday, because they have $4.50 flavored margaritas (try the watermelon - it's amazing!) and half off appetizers. The white queso is one of my favorite things on the menu! Fridays and Saturdays you get live music aka MANNY!!!! You'll have to go to understand my love for Manny, but he's very interactive with the guests, and there is a Conga Line! Also, if it's your birthday, you won't escape the tambourine and the little dance floor they'll create in front of the stage for you. Doesn't this place already sound amazing? And I haven't even touched on the food yet! I do have to admit that I always get the same thing. Queso (try it with beef - YUM!) and Beef or Cheese Enchiladas with, yes, MORE QUESO, on top! Oh, the flautas are also really good. Try those too! Maybe on your second visit, because you'll definitely be back once you try it once. Food comes out fast and hot! You'll know when people order fajitas, just look for the smoke!! Jose is the manager, possibly the owner, but either way he is really great and makes me feel special every time I go in! He is very accommodating. We came in with no reservation for a group of 20 and Jose explained to us that the restaurant was booked up with reservations, however, he made an effort to open up the back party room and was able to stuff us in there. Great! Wait staff is very friendly and attentive!  To say the least, GO EAT AT MARACAS!!!! Great specials, Great Prices, Great Food, Great Drinks, Great Service. You will love it."], ["Mikhael G.", "Awesome prices, awesome food, awesome service. I ALWAYS get the nachos...so I don't really know how anything else tastes. My husband gets the Mexican lasagna...I will get that next time. Portions are huge!!Robert is our waiter most if the time...tall guy with the glasses...He will definitely take care of you I had my rehearsal dinner at the place. They are always so accommodating.  The margs are good too...not very strong though.  THEY ARE OPEN FOR LUNCH ONLY ON MONDAYS...I HAVE MADE THE MISTAKE OF TRYING TO GO FOR DINNER TWICE!!"], ["Ashley H.", "Literally hands down the best brunch place is Dallas. Best brunch place in the DFW metroplex. Located in cozy quirky Deep Ellum, Maracas is right on Main St. They have $1 mimosas, the service is always speedy and the servers are always kind. We have never had to wait for anything! The salsa is absolutely delicious! Their food is incredible as well. This place is cheap in price but is not lacking anything. I've had their nachos, breakfast omelet, and tacos. Everything is always so yummy. This is my favorite place for brunch. You can't go wrong with $1 mimosas! They have patio seating too. I favorite this place over Gloria's and any other Mexican restaurant for brunch."], ["Jalyn S.", "Sometimes you wanna go where everybody knows your name...This. Is. My. Spot. I love coming to Maracas. The food is good, there's never a wait, and the staff treats us like family. AND, the whole menu is half off on Tuesdays. The Mr. and I can eat a full meal for under $10 so it doesn't get much better than that.My faves are: sour cream chicken enchiladas, tortilla soup, mexican lasagna and the white queso. I could literally drink the white queso. :)Great place for a weeknight dinner or brunch. There's also live music on Friday nights. Definitely going back. Probably on Tuesday."], ["Ben B.", "One of the best Mexican Restaurants I've experienced in Dallas.  Better for groups than couples but fun for all.  They squeezed us in before the rush.  Within 20 minutes, the place was packed!Never were our chips/salsa less than full.  It's like we had 3 servers.  Our main waiter was also calling on a group of 16 but still made us feel like we were his only table.  The band has been their \"house band\" for 20 years and they were fun!I'm not gunna lie...  Forgot what I ordered but the service & ambiance was what was king and will get me back for another visit."], ["Veronica V.", "Maraca's  in the former Monica's space in Deep Ellum.  The menu is the same with a few new menu items.There's a new make over with the interior.  It's bright and modern.  I LOVE the fact the patio was opened up and now has an area that flows.  You do get a view of downtown's evening lights.  The service at Maraca'a is exceptional.  They don't leave your glass empty, the chips and salsa keep coming.  My usual server I love is Javier.  He's worked there for years and knows what I want to eat.  He asks about my family to see how they are doing.  The staff at Maraca's will remember you and make you feel comfortable.  Maraca's has several specials during the week you can't beat if you are on a budget.  Half price Tex-Mex platters on Tuesdays, Half prize appetizers Thursdays and $3.50 margaritas.  The best thing about the menu is the queso.  Hands down the best queso in anywhere!  I order it every time I visit Maraca's.  Give it a try, you will come back for more.  Fridays and Saturdays, the band, Chilo plays.  They will get you up to dance if it's your birthday or not.  Sometimes you will have a conga line flowing through the restaurant.  Seriously.  There is always a fun party vibe Friday and Saturday nights with Chilo in the house.By the way, they serve $1 mimosas on Sundays for Brunch.  Give Maraca's a visit.  Your tummy will thank you for it."], ["Tamara C.", "Love the drinks here, usually we go on Sundays for $4.50 mojitos/margaritas.  The mango margarita is my fav!  Service is also good too!  Check out their weekly specials!"], ["Amy T.", "Came here this past weekend. This place is on the edge of Deep Ellum. I was glad I was able to find the one latin place in all of Deep Ellum (felt like it anyway) and it called to me from the opposite side of the street. We walked in and found the mexican martinis were good and strong and worth the $9. .. vs the watered down drinks we got at our hotel bar (at the Downtown Dallas Sheraton called Draft) We were given chips and salsa. The salsa was dissappointing b/c it was more sweet than heat. which is good b/c that means less calories!FOOD: We decided we needed to get some kind of dinner. . and decided nothing too heavy to ruin my buzz, we split the fish tacos. OMG that was freaking delicious.The fish was moist and had great flavor, grilled not fried fish! and the taco itself had the right amout of sauce/toppings, etc. So good. blk beans and rice were great, I'd order it again in a heart beat.  I had my heart set on Canne Rosso b/c we had it bk in April but I'm glad I stopped here. LIVE BAND: they had some band here (their picture is listed on their fotos page. the band was ok, more of a musical only kinda band, not too many words and the song had words they were on repeat . . nothing too intricate. . THE GOOD PART ABOUT THE MUSIC... was that while the band was on a break, 50% of the songs were MANA! THE best band in the world. ive seen mana there in Dallas at the AA center and Houston at the Toyota Center and again in Dallas at the H20 Mio water tour. . So Dallas and mana just go hand in hand and the fact this place was pouring heavy drinks and great music was just perfect for me."], ["Chris E.", "I call this place \"New Monica's\". I live across the street from it and am there either Tuesday or Wednesday (sometimes a Thursday) of each week due to the awesome specials and fantastic customer service. And the food still rocks!I always just sit at the bar. The manager opens the door for me when I walk up, shakes my hand, asks how things are going and escorts me over to the bar and half the time pulls out a bar stool for me. So awesome. What's nice is that the vibe is genuine--not like some fake act.Now, the real gold. The bartender. You can just tell he is very smart, a humble man. And really, really good at what he does and at anticipating what you need when you need it. The margaritas are among the best I've had, especially the \"skinny\" one without the fake sweet-n-sour/margarita mix that tastes like bathroom sanitizer. Its just lime juice, tequila and triple-sec for all I can tell. Really, really fresh and excellent, and half-price on Tuesdays!The \"spicy\" hot sauce on the menu is superb. I can't get enough of it. It is served piping hot and is a good contrast from the normal sauce you get for free (which is excellent in its own right). Wednesdays are $8 fajitas and Thursdays are half-price appetizers. The queso blanco + spicy hot sauce is meal enough, though. All really good and I highly recommend it.They also have a good mole, one of my favorites."], ["Arturo E.", "This place was a let down. Tortillas were microwave quality tortillas. The rice was bland as can be. Mole sauce was thin and runny. Chicken inside mole enchiladas wasn't seasoned or flavored at all- just boiled chicken. By far the worst tex mex I've had in years."], ["David G.", "Went in for a luncheon last week and had a delicious, unique version of lasagna.  It was terrific and well worth the visit to this Deep Ellum Tex Mex-Authentic Mex restaurant.  It's time tested with over 20 years in business.  It's a great spot for locals interested in good food at a moderate price.  Here's the lasagna in video format.  Enjoy!firstclassdallas.com/fcd…"], ["Kaia V.", "I thought I was walking to Monica's when I set out the other night to get some mexican food, but I found this instead. I think Maracas has replaced Monica's - not sure why - but the air conditioning was blasting, the drinks strong, and the food delicious, so who really cares what the place is called? We had 6 mixed drinks, guac/salsa/chips, a chicken salad, and a 3 chicken taco plate. The total charge was $44: AMAZING! The chicken breast on the salad was fresh and there was a good amount of it, but the dressing wasn't as salty as I hoped. I realize this is a weird desire, but I'm used to the fast food chain Pollo Loco's creamy cilantro dressing, and anytime creamy cilantro dressing is less flavorful than that, it makes me wish I were in the Pollo Loco drive thru instead. The chicken tacos were good, nothing super special (but chicken tacos are frequently nothing special). The fresh salsa and guacamole were the real meal makers, and they were so perfect. The salsa was perfectly spicy, and super fresh. The chips were warm. The drinks were also strong, so perhaps that is why my memory of the food eaten after the chips is hazy. It was a good base for the ridiculous amount of drinks I had after we left Maracas around Deep Ellum, the food assuredly being the only thing that prevented my death from alcohol poisoning. Thank you Maracas for saving my life!Also, the servers were extremely attentive and sweet, and the interior was clean. I will definitely be back, and I'll try to drink less this time so I can report back on their entrees with more authority."], ["Chaka C.", "If you're looking for a cheap brunch that'll get your Sunday Funday started off on the right foot, look no further than Maracas. The mimosas are only going to set you back a DOLLAR on Sundays - and not only that, they're freshly made and keep coming until you say stop. That's IF you say stop. With that much orange juice flavored champagne coursing through your veins, it's easy to overlook the actual food, but it actually isn't bad. Standard tex-mex fare and they're very open to substitutions, if that's your thing. I've spent hours here  with large groups of friends on Sunday mornings, and my tab has never gone over $20. Every time I try to pick a new brunch place, my boyfriend whines about missing Maracas. I suggested he marry the place if he loved it so much, and part of me thinks he may actually do it. Go!"], ["Todd W.", "from 8/9 and again on 8/16--¡Plato de Edgar! (and the one with chicken is great, too!) And don't forget the white queso it is OMG good!The band is a blast and everyone's having a great time.We've had outstanding service every time we've been there. And who can beat $3.50 frozen margaritas?"], ["Lauren N.", "The wait staff was great! They joked around but were efficient. Water glass was never empty which to me is huge, I mean come on, don't make me ask for something as simple as water! The avocado appetizer, again great. Three of us shared it and it was a nice pre taste bud starter! I ordered the chicken tacos with corn tortillas, black beans and rice. They were good. Nothing too special about them though. No amazing flavor to right home about. But with the presentation, sides, and quality, I'd say this place is def worth trying again! Oh yea, skinny girl margaritas on their hh special for $3.50, you just can't beat that!"], ["Edgar L.", "Went to have dinner with several friend's for one of their birthdays. This place had great food. I had the pulled pork burrito and it was huge! I only ate half. The waiter was super friendly and on top of everything. Honestly,  I was a little hesitant of this place because of the loud music. I usually like to converse while having dinner but this place had great ambiance. They had random people join a line of dancing people and picked up the birthday girl and took off dancing all around. Great place for goof Mexican food and fun ambience!"], ["Leigh P.", "So hey, you liked Monicas? I betcha you're gonna like Maracas. Heh. Menu nearly the same? Check. Decor the same? Check. Food the same? Check. Why mess with what works?Had brunch here with a friend and got $1 mimosas, kick ass guacamole, excellente biscuits with eggs inside covered in chorizo gravy (with a side of bacon and potatoes), great prompt service, and some damn fine company. All was great. So, you feeling nostalgic for Monicas? Want some naner pancakes? Hanker for Mexican Lasagna? Never fear, they've gone nowhere..."], ["Michelle M.", "I discovered this place by purchasing a groupon for it, which I have found to be a great way to test run a new restaurant to see if it can make the cut into my regular rotation. Maracas indeed made the cut. The food was good, the service was friendly, and they have great specials. I had the Mexican lasagna which wonderful and my boyfriend had the Greene pasta which was possibly even better. Accompanied by a queso blanco made for a great meal.We normally visit now on Tuesday nights when they have a selection of about 8 entrees for half price. I have tried several of them and all have been good. I believe on Wednesdays they have a fajita special for $8 and Thursdays is half price apps"], ["Amanda A.", "Came here for brunch & $1 mimosas. Great fresh chips, had the El Chicano, biscuits & gravy... The gravy was amazing, rich & spicy with chipotle. Attentive waitstaff, easy & affordable."], ["Damien J.", "Love the place service was amazing. Very lively atmosphere.  Great food..I had the Mexican lasagna and it hit the spot...drink specials make this place even better...will definitely add it to the rotation."], ["T N.", "Fantastic margaritas for $3.50.  Would go back for that reason alone, but we loved all the food. Spinach quesadillas, cheese enchiladas, pulled pork burrito were all delicious. They use the creamiest white cheese, not the typical cheap cheddar all others use. Music was a bit loud for conversation with the high ceilings and hard floors. Cool bar lit with blue lights. Professional server - attentive, not obtrusive service.  Outdoor patio not for our summers, but can't wait for cooler weather to try it out."], ["Cesar D.", "This place is what Monica's used to be and thank goodness they haven't changed a bit. Angel and Jose are the best hosts , waiters are bomb and the bartender is deadly! Def must is the \"cochino\" Rita, Diaz pasta and their brisket or street tacos! A killler miga option by angel is not on the menu but should be! Patio is cute too when it's not cold. Avoid the house Rita Rita ! Go for the gold!"], ["Cat N.", "I was here for the Deep Crawl UYE with other yelpers. Chris ordered the extra hot salsa, queso and margaritas for us. I really do love the extra hot salsa. Had a little kick to it! you could wash it down with a frozen margarita! heheh I was told that their margartias are just straight tequila and lime juice, no mixer. That's why it tasted so fresh!!!! I will definitely come back and try their food!"], ["Jenna M.", "Really fun ambience and great drink specials. They started doing a conga line complete with tequila shots poured down our mouths randomly one night! Very fun... So maybe 4 stars for a fun bar, but 3 stars for the food. Nothing close to authentic Mexican, though not terrible either. Enchiladas were standard but good. They offer some veggie options. Stay away from the ceviche tostadas - yuck."]], "Tacos la Banqueta": [], "Bandito's Tex-Mex Cantina": [], "Tacolicious": [], "El Come Taco": [], "E Bar Tex Mex": [], "El Rey Del Grill": [], "Gabriela & Sofia's Tex-Mex": [["Jan S.", "This restaurant is amazing!  The food is fabulous, table side guacamole is AMAZING, and margaritas are delicious. The owners are precious people. Danny, the wife of Gabriel, used to wait on us at Taco Diner in Southlake and we drove all the way to Dallas to try their restaurant and we will definitely be back!"], ["Tara B.", "Brisket enchiladas were amazing! The cheese enchiladas and refried beans were also very good."], ["Russell M.", "Best Tex Mex I can remember. My family has tried most items on the menu and haven't found anything we disliked. Definitely our \"go to\" for Tex Mex in Dallas."], ["Sarah S.", "Finally some good Mexican food in my neighborhood!!! Good food, good service! Table side guac and margaritas. I'm in heaven!!"], ["John D.", "What a wonderful experience! The salsa was super fresh with the right amount of spice and Margarita's were delicious! GET THE BRISKET TACOS!!"], ["David N.", "My wife and I have dined here several times. Service has always been excellent. Fresh salsa is very good. Guacamole prepared tableside is a real treat and a great value! Food is consistently high quality. Prices seem a bit high for the basic Tex-Mex dishes in comparison with other places, but the food and atmosphere make up for it."], ["Camille G.", "Dropped in to this new little neighborhood place for a little brunch and was nicely surprised.  Fresh food perfect size place with small bar.  Looking forward to returning for dinner and cocktails."], ["Rick W.", "Great homemade taste; friendly service. We may have a new favorite. From fresh chips through flan --you're going to love this place."], ["Nick P.", "Food was great. I had the Chefs dinner. the Beef Brisket Taco was one of the bast taco's I have had. Service was great. Only thing I could ding them on was the chips. Not bad, but not the best."], ["Mike C.", "Love this place. Not wild about the location or ambiance but worth the drive. Instantly went to my top 3 Tex-Mex favorites. Friendly staff. great food and cocktails. Not crazy about the name. With what is sure to be a success I am hoping they can find a better area."], ["Carey M.", "Brisket queso was fantastic starter. I had cheese enchiladas with grilled veggies on top which was delicious and husband had the combo with spinach and chicken enchiladas which he enjoyed as well. Definitely will return!"], ["Liz O.", "My beef fajitas where chewy, my refried beans lacking flavor, and the queso tasted like Nacho Cheese. My boyfriend's chicken fajitas where dry beyond all belief. We hardly ate any of our food. We got it take out so I don't know if they figured they could give us the worst cuts of meat or if this is just the quality this place serves. The best part of our order was the Tres Leches Cake, which I'm sure this place gets from somewhere else rather than makes their own. This place is seriously subpar, and you can get better value for your money else where. This is like an upscale Taco Bell. I can't understand why this restaurant has such high reviews."], ["Ashley R.", "I found this restaurant on accident during a trip visiting family. It was right across the street from our hotel. This place was a fantastic find. The food was great and is very reasonable. The staff is very nice and friendly. I would definately recommend this place."], ["Pamela B.", "Brisket tacos, guacamole, chicken/spinach enchiladas.  I recommend this place for friends and family!  Definitely 5 stars!"], ["Maricar P.", "My kids & I had late lunch here yesterday.  We all love their table side GUACAMOLE! Super yummy & tasty. Excellent service from our waiter. He was very helpful in suggesting what's great to try. I had their Camarones el Diablo! . Will come back to try their breakfast."], ["Peter G.", "Great food. Super kind staff. Will go back! Loved the pork tacos and my kids loved their food also. Thanks!"], ["Steven B.", "Customer service is great!! The food was awsome. My husband got the chimichanga and I got the chefs dinner. Both were super tasty!! First time eating tex mex. Yummy!!!!"], ["Vanessa J.", "This restaurant is wonderful! We went there today for the first time based on Yelp reviews. It's tucked away in a strip mall off of HWY 75. Talk about a hidden jem! The atmosphere is cozy we received prompt service and food was delicious! Also reasonably price.  All in all a wonderful experience! We will definitely dine in again!"], ["Chase S.", "What a hidden gem! I went here because it's close to Presbyterian, and so glad I did. I was greeted with warm smiles and prompt service. The salsa was very delicious and had a unique spicy note to it. The chicken enchiladas with green tomatillo sauce were amazing, they had a homemade taste to them that reminds me true Mexican cuisine. They look like they may have some great margaritas as well. I will be here again soon!"], ["Peter B.", "Ok, like the other reviews, looks like a hole in the wall. Once you get inside and start tasting the amazing food that is served, I think you would give a 5 star review as well. My wife and I wished we lived closer to this restaurant as we would be here all the time. Whenever we are in the area now we always are sure we stop in for something to eat. The carne asada was absolutely amazing and quite flavorful. Highly recommend this restaurant and this dish!"]], "Tacos La Banqueta": [["Angelica N.", "Damn...I have always been an El Si Hay girl, but I think they have met their match, and then some. My bf and I stopped in here earlier tonight for dinner, and I had some high expectations, given how popular this place was before it disappeared. I was a little apprehensive, as I am usually a poultry girl when it comes to tacos. I saw none on the menu. What they DO have is a roll call for authentic D.F. tacos. (That's Mexico City's Federal District, for those of you who were not aware) Bistec, pastor, tripas, cabeza, lengua, chorizo, and suadero. I ordered three al pastor tacos, and then my bf and I got curious as to what the suadero tacos were all about. The taquero explained it to me (it is beef that comes from an area above the udders), and even offered to let us have a taste. We happily agreed, and downed that sucker FAST. It was absolutely delicious. My al pastor tacos looked as appetizing as they were tasty. I loved how juicy the meat was, and the fact that the tortillas didn't rip in two in my hand. Everything about those tacos, from start to finish, was amazing. The tacos are inexpensive...about $1.35 per taco. What will get you are the Mexican sodas. Those are $2.50 a pop. But nonetheless, you CAN'T have D.F. tacos without Mexican soda, so just buy one and you will be glad you did. I can't wait to go back. This place totally lives up to the hype."], ["Ivy J.", "Didn't think anyone could give fuel city a run for their money but my oh my is this place delish! Very good authentic street tacos. They're tiny indeed but the flavor is robust! :) hate that I'm just discovering this today but I WILL be back! I had steak & pork"], ["Dominic B.", "This place is much more authentic than the last place I reviewed. 5 stars because the Tacos were excellent however the menu is a little confusing if you don't speak Spanish. If you don't speak Spanish or you're looking for Taco Bell style tacos, skip this place."], ["Biko T.", "This place is amazing. Period. I'd like to go on and on but you won't find a better taco anywhere. The Lengua and Cabeza are the best I've ever had. Please stop by and give them a try."], ["Lola A.", "After reading so many awesome comments on this tacos we decided to give it a try, since they claim their tacos are \"DF style\" we were so ready for some good tacos....we order a chicken quesadilla, tongue, tripe, and carne asada, the tortillas are not the typical authentic yellow corn tortillas, they were cold and just like the meat lacked on flavor :( the red salsa is good so we had to put a lot of it plus salt, I don't know if we'll go anytime soon."], ["Tim V.", "Yesssssss, it's back. Just like the old location, these are the best Al Pastor tacos in Dallas. The Suadero was damn tasty as well. Bistec was good but a little tough. And let's face it, their salsas (both red and green) are some of the best in the city too.Let me boast for a second... I've been to all the Tacos La Banqueta locations around the metroplex (Arlington, Fort Worth, and 2 in Dallas). The other locations generally rock, and the two in Tarrant county have delicious gorditas too. The other Dallas location has often missed the mark. It's still good, but not great like the others. Glad to have the superior, gritty East Dallas one back :)"], ["Rosita L.", "THE BEST TACOS I'VE HAD SINCE MOVING TO TEXAS IN NOVEMBER 2014. I'm from the MidWest and we have TONS of authentic Mexican food and street tacos; weather it be a taco truck or small dingy place we have it in the midwest. However ever since moving her to DFW I've had nothing but crappy Tex-MeX.  I finally found LA Banqueta on Yelp and Have gone 3 times so far. I'd go a lot more if it wasn't so far of a drive for me. I heard there is one in FW but have yet to check. The service is quick and the staff very friendly. I always get at least 5 tacos de asado and a quesadilla de pollo. My husband loves the tacos and says this is the closet thing to real DF street style tacos. He usually gets bistec and suadero. The best tacos in DFW so far. ! 5 stars!!!"], ["P W.", "This place has really good, flavorful street tacos. I went around 4pm during the week. I always try the meat before I add any salsa or lime. The meat here is definitely prepared well! Also both the green and red salas taste great. I do wish they had a hotter salsa for people that really like the heat. This place is a solid 4. I am not giving 5 stars because some of my meat although flavorful was slightly dry, most likely due to being pre-cut prior to my arrival."], ["Angelica P.", "If you're buying your tacos from a truck or inside a taqueria within a gas station, then you're probably doing it right. Prices are decent and selection is what you'd expect, maybe a little less than average. They are very quick and usually accurate at preparing the food for you. Grab a mexican coke and try the salsa verde with your street tacos. It's a bit spicy so go easy at first."], ["Rob M.", "Amazing tacos for the price, and a fascinating selection of meats. I had tongue, pork, beef and sausage (lengua, saudero, bistec y chorizo) with a giant glass of yummy horchata. The salsas were great as well, though beware...the green salsa is pretty spicy and it keeps getting spicier even after you're done. Keep the cilantro and onions, and squeeze the fresh lime on top and you can never go wrong."], ["Shell N.", "I love having this taco shop by my house. They have a lot of taco meat choices and always pile it on. They have tripa while many places don't!"], ["Twinwillow T.", "Unquestionably, the very best Mexico City D.F. style street tacos in Dallas!My personal favorite is their Campechano (suadero brisket & chorizo) tacos grilled a bit crispy and loaded with onions and cilantro and topped with their incomparable green sauce.Also fabulous are their crispy grilled Campechano quesadillas. Beautifully made with toasted flour tortillas.This Gringo refuses to eat tacos anywhere else in Dallas!"], ["RM S.", "Better than Fuel City, in my opinion. Had the Al Pastor, Carne Asada and Lengua. All were excellent. You have to have it with Mexican Coke. Also, very cheap - but tiny  - had two servings. Your cab (or Uber) ride will be more expensive than your meal."], ["Jennifer N.", "Best tacos that I have had in a while. Before leaving Dallas I wanted to try some tacos. Went here because it was getting so many good reviews. It definitely did not disappoint. We ordered 7 tacos and being only $1.50 each it was amazing. We had 4 steak taco, 1 Chorizo taco, and 1 tongue taco. They were all really good, will come back once more before we leave."], ["May O.", "Never disappoints! Best breakfast tacos in town. The amount of meat, or eggs they place in their tacos is insane. Pretty much can't wrong. My favorite is the torta de suadero. Also, their chicken quesadillas are to die for. Love this place and eat here at least twice a week."], ["Matt W.", "Finally!  Been waiting a long time for this. Came here previously on 2 trips to Dallas and it wasn't open. The journey for pastor has come full circle."], ["Bessy G.", "Mmm..they taste soo good! I been there about 3 times and service is good, if your gonna eat there you order at the register, get you your drink yourself or tell the cashier you want a \"agua fresca\" go sit down, then the waitress takes your order to your table and you pay at the end. Taste delicious, and im picky about my pastor tacos, this place is my favorite from now on, oh yeah try their choriquesos... You'll want more of it!"], ["Chris L.", "Cheap and authentic as they come. Probably the best taqueria I've been to in the USA. Pastor and steak!"], ["John H.", "I was a bit sketptical of this place having such high rankings on yelp. 5 stars across the board on everyone, i mean come on that never happens. Everyone was spot on though this place is very good and inexpensive. I tried the pastor, suaredo, lengua, and cabeza, all were extremely flavorful and mmmmm mmm delicious.I asked about the suaredo (however you spell it) and she gave me a free taco of it since it was my first time! I had to try the torta too and the bread was just amazing. Definitely coming back here!"], ["Andy G.", "The BEST tacos ever!!! There is nothing on this menu that you can go wrong with whatsoever. The salsas are delicious with enough heat to make you want more. I've been coming here for 5+ years and have brought lots of coworkers over and they absolutely love this place. This place puts fuel city to shame. I've even seen the owner eat here before. I highly recommend anyone to eat here and any chance I get to come here I take full advantage of."]], "El Ranchito": [["Kurt V.", "I have lived in Dallas most of my life, but sadly I am just starting to really begin \"discovering\" the Oak Cliff/Bishop Arts area.  One such recent find is a true gem, El Ranchito.A family friend recommended that we try them and so we did.  Between 8 of us, all but one being a first-timer there, they were able to please all 8 of us!  The food was delicious, the service was quick and friendly, and the prices on most dishes were pretty affordable.  From traditional Mexican dishes to Tex-Mex favorites, and even hamburgers, they are sure to have something that will please everyone."], ["Lydia J.", "I would give El Ranchito another star, but it seems like there's consistently something missing from my to-go orders. To be fair, I will say that im including El Ranchito and their sister restaurant La Calle Doce.  My order tonight was missing a side so I called and was quickly told that I wasn't charged for it.  It just seemed like a quick response on a very busy night. i was also told that one of the plates I ordered had quacamole.  That's cool if it would've been my plate!!  They also said that they didn't hear me say I wanted the quac.  In the end, I just had to take their word for it bc they didn't give me a receipt.  My bad for not asking for it. I guess I'm just frustrated. I advise that you always get your receipt and make sure everything is in your order."], ["Troy N.", "Great, classic Dallas place for Mexican food. Came in under the guise of getting our typical fajitas or burrito, etc., but thanks to Francisco, we took him on his word, and tried the cabrito. So glad that we did. Extremely tender and flavorful! And even after we stated that we only wanted flour tortillas, he brought a few corn tortillas, imploring us to try them. Again, so glad we did. So refreshing to have service from someone as passionate as Francisco. He really translated his emotions for this dish, and the memories he had from growing up in Monterey, Mexico. Great to have such a good story to accompany our meal.Thank you"], ["Heather M.", "This is how great love affairs start. Anticipation. Anxiety. Excitement. These are the emotions I felt upon entering El Ranchito. It looks good from the exterior: handsome, established, lots of character. It's just my type. El Ranchito continued to impress me throughout the night. Delicious, fresh and spicy salsa - why, yes. Thank you very much. The margaritas are massive, or as I like to say, \"drunk in a glass\". It's a $9 'rita, and worth every tequila soaked penny. My fella had the mole enchiladas, and they were spectacular. The mole has a very rich, deep, flavor. He is a Santa Fe food snob, and he was extremely impressed with the mole. I had the combination fajitas, and they were tasty. Our server was attentive and checked on us often. As we were walking out after dinner, a bus-boy ran after us with the to-go box we forgot on the table.That kind of chivalry is rare now-a-days. As if El Ranchito hadn't already sealed the deal, the TV in the corner was playing the CONCACAF Gold Cup game. As we left, I turned to my guy and told him I'd found another love. He said he was OK with it."], ["Grace S.", "Authentic in every possible way. We ended up here on the suggestion of a friend who lives in Oak Cliff. He had previously brought friends from Mexico to this place, and thought we non-Mexicans would enjoy it as well. ;)First observation upon walking in: lots of Mexican patrons. Definitely a positive sign when looking for authenticity. ;) Second, good Mexican beverages. It was busy when we arrived that Saturday night, so we first sat at the bar and had drinks. I tried the Pacifco (one of several Mexican beers available) and enjoyed it. My friends opted for margaritas and a spicy concoction that I can't recall the name of. All good.Third, yummy food in generous portions. I had the fried catfish filet, which came with enough fish for two people. The fish was flaky and yummy (I kinda believe anything's good once you deep fry it). ;) We also helped my friend with the Parridilla, which was beef, chicken, shrimp, and sausage on a grill. We ate the Parridilla with awesome corn tortillas and guacamole (which had to be ordered separately). So good.Finally, the entertainment: mariachi! There was a mariachi group playing music for patrons who paid (which seemed kinda silly because even non-paying patrons could listen to the music). Really set a fun, festive tone. The only downside was that it felt too loud at times, making dinner conversation a struggle.What a fun place to eat Mexican food. I highly highly recommend."], ["Jerrell C.", "Worst experience ever tonight, came to celebrate an uncles wedding everything was great at 1st. and then we got kicked out of a room we weren't even done eating. They rushed us out and wouldn't let us eat in peace. I was a server for many ears and would never had been so rude to kick someone out, because another party was scheduled. They never told us in the beginning that we were given a certain amount of time, never once did they apologize..."], ["K H.", "Atmosphere was really nice , plenty of seating , pay @ the register. In house made corn tortillas that were great ! Wow ......I tried the Menudo and was very impressed ....I will definitely return cause, I wanna try the awesome looking fajitas for 2 that I seen on another table."], ["Eddie C.", "I have FINALLY discovered the secret to eating authentic Tex-Mex in the DFW!Craving some authentic Tex-Mex, and not wanting to drive down all the way to Houston to eat at my grandmother's table, I did the next best thing. I Yelped best Mexican restaurants in Oak Cliff. I don't know why I haven't thought of this before. Many options were available, but I finally settled on trying out El Ranchito. As soon as I walked in, I knew I made an excellent choice. The colors on the wall, the people dining there, the mariachis... everything was what I was used to dining with my parents as a child. We were promptly brought out salsa, which was delicious. It had chunks of onion and cilantro in it, which I more than appreciated. I wish more places did this. I settled on getting combination fajitas, and my girlfriend got the Pedro Infante. When our food was brought out, I was jumping with excitement in my chair when I smelled the tortillas. I know, I know, I have a sizzling platter of chicken and beef in front of me, but all I could think about was how good those tortillas were going to be. I was not disappointed. They were fresh, delicious, and the absolute perfect medium for the meat. The beans are cooked in lard and the guacomole was spot on. I sampled a bit of my girlfriend's plate, and the tomatillo sauce on the chicken enchilada was up there with the best I've had. I walked away satisfied and can't wait to try out more places in the area. If you are craving real Tex-Mex, and appreciate a good tortilla when you taste one, you must come here. I knocked this place one star, only because I thought it was a tad expensive compared to other restaurants, especially given the area it's in. The food is 5 stars though."], ["Marydith L.", "The food is wonderful. An excellent dining experience. The wait staff is very attentive."], ["Cat J.", "Winner!   I am forever searching for a great Mexican restaurant, always disappointed but not this time!  I loved everything about this place, from the old school decor and mariachi band , to the excellent service and food. The menu offers authentic Mexican dishes as well as Tex Mex favorites  and a large variety of seafood options. Our waitress was very knowledgable of the menu items and was very helpful in assisting with our orders."], ["Jenna H.", "After reading about this restaurant in American Airlines magazine, I had to try it and compare with the dozens of other Tex Mex places in DFW. Everything tasted freshly made with bold flavors and nothing bland! One of the best! The frozen mango margaritas are a must! After seeing repetitive photos of them on Yelp, it was clear they must be a favorite and wow, were those reviewers right! They are huge and yummy, not syrup tasting. Their salsa is spicy, but house made and delicious!!! I cannot say FRESH enough! Cheese enchiladas, out-of-the-oven warm tortillas, rich beans and rice, thick sugar crystal sopapillas, it was all amazing!It's a casual restaurant, and we saw everything from casual to business people eating there. The margarita was $10, lunch enchiladas $8, and sopapillas $5 for two of them. It has a small parking lot next to it, not a valet type of place.The waitress we had spoke little English, but was very kind and attentive, so be patient with them!Love it!!"], ["John P.", "The food here is so damn good. Everything is fresh. They make the salsa in house. The enchiladas are amazing. The chicken tastes like they cook it right when you order it. Everything here is good. Enjoy!!"], ["Johnny R.", "This place was very good and the food has awesome flavor. I always judge a Mexican restaurant by the taste of their salsa that's served with the chips and right off the bat I knew I was into something good. I ordered the asado de puerco plate and it was awesome. My fiancé ordered the combo plate and by the name of the order you would think it to be a simple plate but when she got her plate it looked damn good.  Smothered in enough cheese that you were glad they served chips. My son ordered a burrito plate that was covered with chili con carne and was a beast of a burrito. They had mariachi playing music and the ambiance was amazing. Parking is limited but it is worth the fight once you get in the door."], ["Yvette S.", "Came here with a pretty big party and we were seated almost immediately. The food was actually pretty authentic, I'm very picky when it comes to Mexican food and this was good. Portion sizes were large. The Agua de horchata tasted good as well, some places don't make it quite as good. I had Camarones enchipotlados I believe was the name and my husband had a parrillada. Service was good and they even brought us arroz con leche for dessert. I would recommend it if you're looking for some legit Mexican food."], ["Grace V.", "Authentic. Mexican. Food. and ambience. I had the steak entree and everything tasted to perfection. The chips were freshly made and the salsa was excellent. The restaurant has a mariachi band that plays on request ( for tips ofcourse) which just adds to the experience. Go try Ranchito!"], ["Heather S.", "Outstanding food, amazing service, fun atmosphere!  Love the steak tacos carbon and brisket tacos!"], ["Ashley E.", "I was let down, the food didn't taste like authentic Mexican food . It was over priced , and I was also looking forward to hearing the mariachi band play , but they didn't have them tonight because of this \" Elvis \" show . I got the parillada, and payed $3 more dollars for them to add shrimp ... Which was only two pieces .... Some of the meat was cold , but the display looked nice . The mango margarita was good , and is recommended . The staff was very friendly but a little unorganized . But I did enjoy the ambiance, the setting felt like San Antonio , the decorative was nice . But as for the food , I was let down ."], ["Kim K.", "Very awesome food and service. Was in town and found this place based on the reviews on Yelp. Very glad we went. I had chicken tacos al carbon and my husband an enchilada combo plate. Both were amazing. Beans were perfect and the rice was great. Chips and salsa were delicious. Would definitely come here again."], ["A K.", "Pros Baby goat as an option for tacos Free sopa pilla with two entrees Orchata was spectacular Cons Fatty goat which was over sauced"], ["Jacob L.", "Paid WAAAAY too much for simply okay tex-mex.  2 dinner plates and a few margaritas ended up costing $100!!!  I don't care what the Observer or D Magazine says.  There are much better places for Tex-Mex in the area.If you're in for a much different dining experience AND you feel like dropping a bill on it, then this is the place for you."]], "Meso Maya": [["Stephen W.", "I would give this restaurant a solid 4.5 stars. Our experience was exemplary and I can't wait to return.The salsa is thick with deep, complex flavors. It is spicy but not too much. Easily one of the best I have had in Dallas. The chips were 2 inch wide strips instead of triangles, which are perfect for dipping. The chips were not in least bit greasy and tasted very fresh.The wife got the avocado margarita and contrary to Yelp reviews did not think much of it. I got the top shelf and liked it so much I had to have another (!)We started with ceviche and it was excellent ($11). The wife thought it was a bit too acidic but she was comparing it to what we had in Costa Rica. I did not think it was too acidic at all. I did wish for chips bigger than the strips, however. The portion is quite generous and more than enough for two people to share. We could not finish ours. Based on Yelp reviews I ordered to Carne Asada and it was superb ($21). I ordered it medium and the meat was juicy and tender. The best part is the wonderful flavor from the marinade. The sweet corn tamale was excellent also. I would order this dish again in a heartbeat. The manager stopped by and congratulated me for ordering the best thing on the menu. The wife got the duck (Pato al Pasilla, $22) and thought it was excellent. The duck was cooked perfectly and had great flavor. The only thing she did not like was the tiacoyo which is sort of like a fried black bean pancake with napolitos and red chile sauce. The black bean thing was just plain weird and she did not eat it.The service was very helpful, although a tad slow. But it was a busy Friday night so it was understandable. The ambience is upscale and modern. I basically loved everything about this restaurant and look forward to returning so I can try something new."], ["Brooke L.", "OMG! We broke our Mi Cocina tradition and ventured south (slighty).  Can you say, \"best Mexican Martini ever?\" I'll go ahead and say it.  Meso Maya Mexican Martini is greater than Trudy's in Austin - BAM! I said it. So I go full fat girl on Friday night. This works well for you, because I try a ton of stuff and YOU get to read my opinion.The chips and salsa was baller. Like, I typically don't like warm salsa, but Meso Maya created something magical.The guacamole was good, I can't remember if it was THE BEST EVER, but I don't remember hating it. So let's say it was average.I had them bring me some tortillas; bc if I am going to blow my carb allotment, might as well be worth it, right? They were meh.So about that Carne Asada...yeah.....I basically can't describe the mouth orgasm it gave me.  Trust me, and GET IT.Ummmm...our server was way sweet and attentive, the wait wasn't bad and I was pleasantly surprised. WHAT WHAT!"], ["Frank S.", "Stopped in around 6 on a Saturday afternoon to get a margarita at the bar. It took the bartender 10 minutes to approach us...then was annoyed we asked for a drink menu...got our drinks and ordered guacamole, it arrived, but had to wait on chips and never received napkins and utensils. Do not put seats at your Bar top if you don't want to serve patrons there."], ["Esme G.", "I had their lunch and perhaps it was too authentic for me, it was not what I was expecting. I did have their ceviche which I think was a bit spicy for me. Salsa and chips were good. It take a lot to screw this up.Wait staff was attentive, this is probably not my place. It might be yours."], ["Hanna C.", "I normally LOVE Meso Maya, but tonight's food was unfortunately subpar.  My boyfriend got his usual dish, Pollo Con Mole, and he noticed that the chicken was very dry compared to our past Meso visits.  I had the Pollo Budin Azteca which is my normally my favorite, but the chicken was also very dry and the tomatillo sauce was extremely watered down instead of creamy. Maybe it was an off night, but I'm not sure if I'll return after being extremely disappointed with one of my favorite restaurants :("], ["C A.", "The chicharrones appetizer was the best dish of my 3 day eating and shopping pilgrimage to Dallas. I don't typically go back to a restaurant, preferring to try new places, but I will definitely go back for these. Very good service in spite of a crowd."], ["Andres B.", "Great food, very very close to authentic Mexican and Mayan food. Nice atmosphere not to fancy, I came in shorts and a Tshirt but great overall experience. Will definitely be coming back to try other items on the menu."], ["Samantha R.", "great food"], ["Anne S.", "This location is better than the others in terms of noise and table wait time.  I don't remember what I've ordered at any of the locations, which automatically earns it a three-star review.  I remember being satisfied, but not wowed.  Also, the service is pretty spotty...we had to flag our waiter down to get the bill and then again to get it paid.  I do love their patio at this location -- it feels very European.  (Is that a silly thing to say about a TexMex restaurant?  Maybe.)"], ["Leslie O.", "The arugula salad, Carne Asada, and grilled pork chop w/veggies and elotes were all winners on a busy, busy Saturday night - and the strawberry and Serrano pepper margarita was delicious, too.  Our waiter, the kitchen, and the bar were all on point, though the hostesses were a bit overwhelmed and had trouble guesstimating the wait time accurately."], ["Jason V.", "Some really interesting options for food.  Homemade tortillas that are very tasty. I will def come back!"], ["Rita K.", "Good food.  But some issues with the assignment of waiter for our table"], ["Yurika S.", "Serrano Berry drink! You have to try it not for the beginners I must warn! I really like coming here the ceviche salad is my favorite and I never order salads! The elote is great at first I thought who wants just corn on a plate?? Umm I do!! My co workers rave about the Red posole appetizer but haven't tried it. My new lunch place!"], ["Jeff L.", "Just had dinner and lunch there in the last 3 days.  The carne asada and shrimps tacos are fantastic.  The new tequila is also very tasty."], ["Katy Q.", "Dallas restaurant week 2013The homey Spanish decor made this place really stand out from the other stores, especially the stone floor tile details. Good service and opened for flexible hours, even late on a Sunday. Lots of Hispanic patrons so you know the place is legit.For $35/pp:-chips and salsa was OK. -ceviche appetizer was good with a generous helping. -guac was salty but queso was tasty.-salmon was amazing... perfectly grilled combined with green sauce and cheesy lemon rice. Not much for looks though.-carne asada cooked in savory sauce, a little on the salty side. Came with fresh salad and interesting tamale.-chocolate cake was perfect bite size but seemed like was microwaved beforehand.Meso Maya features great entrees but very limited selection on everything else. Not worth the $35 deal."], ["Devan E.", "I had the Pozole Rojo and the seafood enchilada.  Both dishes were flavorful and delicately cooked.The homini was perfectly cooked - not too hard nor too soft. The crab and shrimp in the enchilada were well seared and cooked simply.For 12 dollars I think it's a good value."], ["Reba G.", "I think I fell in love.  This place had a really nice patio, and the windows were open because it was really nice out.  I LOVED the ambiance of this place, it was very chic.I stumbled upon this place when I passed another restaurant I wanted to try.  This restaurant was on my list to try, but I completely forgot about until I drove by it.  I am sooooooooooooo glad I decided to go in and try it out.  We went during lunch hour but was able to get a table in under 15 minutes.  The servers were REALLY nice, and they were all dressed nicely in ethnic shirts.  We were first served with salsa and chips, and the salsa was fresh and had a kick to it. The chips came out warm, so I had to try it.  It was definitely one of the best salsas I have had.They offered a lunch option where it comes with one taco, one enchilada and a choice soup, salad or black beans.  I ordered the serranno chicken enchilada(shredded chicken in corn tortilla), and I ordered a shrimp taco with corn tortilla.  The sopa de lima WAS GOOD, it was one of the best soups I have had as well.  A friend ordered the carnitas, and he said it was one of the best tacos he had eaten.I will definitely have to come back and try something else."], ["Lauren S.", "Azteca Camaron!!! Don't order something else- get the Azteca Camaron. It's divine. Wash it down with a pineapple avocado margarita and a few of the chips with salsa. I promise you'll leave full, maybe a bit buzzed and definitely satisfied. The parking lot can be full so be prepared to walk a bit! The service was slow and we had to ask for refills, but the quality of the food and drinks was worth it."], ["Scott L.", "The dumpy old El Fenix off 75 downtown reeks of Dallas old school.  Up the access road, a more cute Mexican barrio facade of some 1960's tex mex past, has been newly revamped into a modern Mex place, gringoized - but not too much.  The $18 mole plate was fresh, tasty and came with plantains.Happy hour consisted of $5 margaritas and didn't include beer or wine.  That's no fun.The rent must be expensive. Meso Maya prices, double what you would pay on Maple Avenue, are full of pride, but they seem to offer a nice product: good food in a nice setting, perhaps geared toward uptown concert goers, science museum visitors or families from Klyde Warren Park willing to pay a little extra.Atmosphere - 4 stars Mole - 3-4 stars $6 Negro Modelo at happy hour - boo.Dear owners - Get a happy hour, seriously."], ["Maria-Elena T.", "I came in for lunch on a Wednesday. I did not have a reservation but got seated immediately. The place was nearly full.  I started with the queso which was very good. I liked that the waited made sure i was ordering the queso I wanted by asking a couple of questions. They quickly brought out chips and salsa. The salsa was good. The chips were amazing. Warm, crispy, and perfectly salted.  I could have made a meal of the chips.  For my lunch, I ordered ala carte.  I got the Shrimp taco and chicken enchilada and a side of black beans. The side was huge and can easily be split. Both the taco and enchilada were good. I was in a hurry and got in and out quickly (in time for my next meeting). I will be back!"]], "Fuel City Tacos": [], "Taqueria El Si Hay": [], "Mesa": [["Melissa L.", "My husband and I tried it for the first time last Friday and we were pleased with the food. We didn't have reservations but the hostess was able to find us a cozy little table for 2. I really like the ambiance and intimate setting. It's great for a date. We got ceviche as an appetizer and it was delicious! My husband ordered the tenderloin enchiladas and those were very good as well. The meat was tender and the tomatillo sauce was delicious. I had the lobster enchiladas, which were fantastic. My only complaint is that the wait for the food was a bit long and so was the wait on my drinks. Granted, they only had 1 bar tender. I had a Jamaica Paloma and my husband had the Mesa Martini. Both were very good! I especially liked the Mesa Martini. For desert we had the stuffed plantains. They were good but for the price, I expected like an order of 4 and there were just 2! I probably will not waste my money on desert if we go back. I might make the ceviche a meal next time though."], ["Reagan J.", "Wow! Ordered the guiso del chef (seafood) and the black bean enchiladas, they were excellent! The portions are just right bad not overbearing like other Mexican joints. The drinks are excellent too. The food reminds me of the Mexican Caribbean. Perfect romantic dinner location."], ["Real Fine F.", "I wanted to like this place because everyone else does and it's family owned, a real neighborhood spot. The decor is adorable and it's convenient to super cool hangout Texas Theater.Unfortunately, nothing about my experience would make me rush back. They source factory farm meats and mass-produced veggies, so the base isn't starting solid. But the price point might lead you to believe such ($18 average plate price). My friend and I had a reservation but were sat in a reject walkway area with no light \"Sorry! Electricity is being worked on!\" We were told the patio was closed then folks were ushered by us over the next hour to sit out there. (These types of uncomfortable resto goofs can be easily remedied with a comped cocktail or app, by the way...) Hurumph, but okay, It's about the food, right?Sigh.The ceviche was teeny bits of something swimming in a sugary tomato sauce bowl (was there corn syrup in there?). The chips weren't good enough to be finished, neither was the ceviche. I don't eat factory farm meat, so ordered black bean tamales of some sort with plantains. The plantains tasted like fried bread? sugar? Not sure what was happening, but everything on my plate was fried-ish with too much oil happening. A plus was the flavorful sauces that accompanied. I'd have liked something better to eat them with.My buddy got shrimp and rice, basically. It was *fine*.The best part of the meal was the spicy margarita I ordered. Not worth the $10 pr $11 it cost but delicious, nonetheless.I like fresh, light, clean, not-overpriced food so this isn't the place for me.1 star for space1 star for the cocktail"], ["Gerson M.", "Had an awesome time here superb food and the drinks are also great. Lobster enchiladas how can you go wrong. This should be one of the top spots in Dallas."], ["Carlos F.", "I loved this place.  I went there for Valentines Day and the service was great.  The atmosphere was great too very relaxing and good for a date.  The Mole is authentic and it gets my \"Mex\" approval.  I loved the lobster enchiladas.  The Ceviche was more like a shrimp cocktail but it was good.  The price is worth it.   Es un lugar muy bueno."], ["Alex N.", "Now this is Mexican food!  Located in what seemed to be a predominantly Mexican neighborhood, it may have overshot it's locale.  Although it was a Thursday night, I would expect a small crowd.  However, we were only the second table.  A little depressing at first, but the food makes up for it.I sampled the guacamole, empanadas rellenas, mole mama cata, and the flan de naranja.  All were good, except for the mole.  The mole was amazing.  The thigh and leg were swimming in the mole goodness.  It had the perfect combination of sweet and savory, without overwhelming each other.  Unfortunately there wasn't enough rice or tortilla to pick up the remaining sauce.  If you don't want that much mole, they have several apps that feature at least a little mole.  Give it a try, you won't be disappointed.  Tequila selection here isn't extensive and they do their own version of sangrita chaser, but it's not homemade.4.5 stars for the best mole I have ever tasted.  The food here is truly fantastic, but the location is just terrible for attracting anybody but brave foodies."], ["Madeleine T.", "My boyfriend and I were on a road trip and wanted a good meal and absolutely not road food. We totally lucked out. Not only was it the antidote to the road, it was a place I'd go all the time if I lived in Oak Cliff. The food was amazing. I had the mole enchiladas. My boyfriend had the seafood stew...Both were outstanding. Fresh, flavorful and not heavy. The only regret is that we had to get back on the road so we could only enjoy one of their yummy margaritas and no dessert (which looked good). Margaritas were made with fresh ingredients, no mix. Our server was super knowledgable and friendly. He brought us a complimentary shot of sweet something with a little rum and cream in it at the end.I can't remember the name of it, but it was a  surprise at the end! I highly recommend this place."], ["Jessica D.", "Best Brunch I've had in Dallas since I can remember!! By far the best value, most unique brunch experience I've had, and others that have mentioned how kind and gracious the waitstaff are don't play around - the service is wonderful and personal. I brought my family, who was visiting from out of town, because I had it on my \"out-of-towners\" list ever since I had their amazing mole and flan dessert for dinner. They all left loving it and looking forward to coming back the next time they're in town. I got a good taste of at least half the brunch dishes amongst all the members of our table, and for me the standouts were the:-The first item on the brunch menu.. delicious, heavenly mole and eggs!- Chilaquiles: best version I've ever had and i normally don't jones for the dish much- the Huevos/pancake egg dish: a great classic, more familiar dish for those shy of this whole authentic vera cruz thing ... the egg scramble was perfectly fluffy, the pancakes well-sized, fluffy as well, and not leaving a brick in one's stomach after, and the Mexican style tomato salsa I had was a great addition to the eggs.- The Ceviche: as with the dinner app. version, this stuff is crack. Amazing amazing amazing. I just want to eat it all day. You HAVE to get if it's your first time to Mesa!-All their cocktails have been standouts, and this time the Caipirinha and Horchata at our table were spot on, again.I also had a bite of the tres leches cake, which was delicious and perfectly moist without being drenched at all. I still favor the chocolate/flan dessert cake slice that I had the first time I was here though, that was the best flan i've had!...Sadly, I read over at Side dish that the early hype has come crashing to a halt and that Mesa is at a /risk of closing if attendance doesn't pick up again. :-(. This has been one of if not my all time favorite dining experience in Dallas since i moved here a year ago, for the heart with which the delicious and unique food is served, and it makes me disappointed in Dallas if a place like this cannot make it but some of the flashy yet culinarily-vacuous scenes in west village continually thrive.I couldn't agree more with Sidedish that \"this is a gem of a restaurant. They serve some of the best food I've eaten in a long time. If you haven't tried it, skip the urge to eat nachos one time and give their cochinita pibil a try. If you love Mesa, love it more.\""], ["Belinda W.", "Our party of 7 had a great time at Mesa last night.  The guacamole was the best I've had in a long time.   The  enmoladas and enfrijoladas were also excellent appetizers.   We ordered a variety of entrees including paella, mole enchiladas and camarones enchipotlados.   Everything was fresh, well-prepared, perfectly spiced, and nicely presented.  Friendly service.    Highly recommend.    Can't wait to go back and try a few other dishes and dessert."], ["Thy T.", "I love how this restaurant stands out in the neighborhood. Their staff is really friendly and helpful. The lady at the bar told us about their specials of the night which were ox tails and lobster enchilada. Once we got seated at our table, we ordered the shrimp empanadas. The mole sauce complimented the empanadas so well that I continued eating the sauce after the empanadas were gone. For the main entree, I ordered the lobster while my boyfriend had the mole duck dish. My plate consisted of jasmine rice, avocado stuffed with tuna and mango salsa (absolutely amazing), and two lobster enchiladas. I normally don't like lobsters but this dish was super delicious. I managed to sample some of the mole duck which was also amazing! We had two drinks which were the old fashioned and Mesa horchata. Both drinks were good and will make you happy for the rest of the night. Overall, I love the atmosphere of this restaurant and the executive chef came out and asked how the food was. I would suggest people to mesa who love to drink or try something different!"], ["Margo S.", "Had an amazing experience here! I love the atmosphere, especially the cacti-studded wall and modern yet comfortable wood interior. My boyfriend and I started with the sampler appetizer plate, Surtido Veracruzano, which included 2 cheese empanadas, 2 enmoladas (soft tortillas in black bean and mole sauce, folded into quarters) and 2 picadas (masa tarts with 2 different sauces on top). The latter two were unfamiliar to us both, but super delicious. Although Mesa doesn't seem to be a chips and salsa type restaurant, we asked our waiter he happily brought some out. Maybe that's because their chips seem to be homemade and only served with the guacamole? Their salsa that day was super spicy, but really great. A few other tables (including a large group) had the great-looking guac and pretty drinks. We then shared the chicken mole enchiladas, because MOLE. One of the best sauces in the universe when made well. And wow, Mesa's mole is probably one of the best I've ever had. Like I could probably eat it as a soup. Anyway, it was amazing, and the perfect amount of food for a couple that just shared the sampler appetizer plate! I can't wait to go back for happy hour and brunch! And more mole, of course."], ["Jennie Z.", "I was SOO excited to try out this restaurant.  It was OK...not as great as the 4.5 stars make it seem.  We came on a Tuesday night around 8pm.  There were about 3-4 tables finishing up.  Not knowing exactly where it was, I was expecting Bishop Arts-ish..but the area was a little scarier....wouldn't come here just girls late at night. Atmosphere was sorta trendy, but how trendy can you get with 4 couples..so maybe it gets more poppin on weekends.We had the Ceviche app, Lamb Mole, and some chicken dish. - The ceviche was good, but not as special as the waiter made it sound.  - The Lamb Mole - one lamb leg (skinny lamb leg with not much meat) drenched/covered/swimming in mole with some rice.  The mole sauce was good at first bite, but after was just too sweet and rich... very overpowering.  Although much more chocolately and interesting than any other mole sauce I've had.  - The Chicken was tasty- flavor wise, came with asparagus and lots of veggies, but waaaay too dry.  Each dish is $20+ and small portions.  Definitely not worth the price tag,"], ["Cat N.", "\"mole mole mole\" -dr evil from austin powersI had dinner here with a friend and we had such a good time drinking and eating at the bar. I didn't know it was THAT busy so I didn't bother to make a reservation so we had to sit at the bar. It didnt bother me! if anything the experience was more friendly because we got to interact with the bartender. We tried pretty much all the drinks they offer! The place is small and pretty intimate. Great for date nights! Between the two of us we shared the mix appetizer, comes with two of everything except an empanada. It was delicious! My favorite was the plantains. Slightly battered  and fried...mmMMm!!! I love plantains! I had for the signature mole with duck for my entree. Friend had the chicken. They were both good but the best part was the mole!!!!! OMG I just wanted to ask for a bath tub full of mole and drown myself in it. They weren't kidding when they said \"signature sauce\" omg drools! It was so rich and flavorful!!! for dessert we had the chocoflan. I thought the regular flan was too original so why not make it chocolate? it's even better!!! :) a layer of chocolate cake, which was amazing. A layer of flan, which was so good! and then to top it off, dulce de leche spread at the bottom of the flan. Drooling yet? if not, there's something seriously wrong with you. I love places that keeps their roots! I mean a lot of restaurants claim something and then their menus got all kinds of ethnic foods. Not here! They keep it simple and true! Even their drinks are a touch of Spanish. I would love to come back!"], ["Jesse S.", "Given my recent run of outstanding experiences at Oak Cliff Restaurants I was a bit underwhelmed by this place.  We had no problem parking and the place seemed pretty busy.  The server asked if we had reservations and we didn't so then he stuck us in a hole..pretty much.  It was a table in a cubbyhole by itself in the hallway to the patio.  Really weird spot for a table, and you couldn't even push your chairs back the whole way.  I knocked one star off simply for this experience as IMO a big part of dining out is experiencing the restaurant and the people.  If they are going to have a little cubby hole table like that they should really do something to spice it up (Ala the booths at Fuddruckers)...make it a table that people will request to go not a table that will make patrons regret that they ate there.  My friend was so \"like wtf\" that he asked me if we should just get drinks and then go to La Hechizera across the street since I had said such good things about it.  However, I wanted to stick it out.I would say the general level of service was poor.  I drink water with lemon and the water glasses aren't that big and I constantly had an empty glass (a big no-no IMO).  Also, I didn't find the server all that friendly.  That being said, they did bring out the lemon/limes promptly.   I had seen plantains on the online menu and noticed them as part of a larger sampler and inquired about them.  The server initially told me they didn't sell them separate but later came back and told me he could sell 2 for $6 (actually charged me only $5).  This was by far the best food item.  Cheese stuffed plantains covered in something (cheese and something sweet maybe?).  Really outstanding.  Good plantains make me think I'm in Heaven.  A Mexican restaurant in Texas is nothing without good chips/salsa before the meal.  I don't care how upscale you are trying to be or how veracruz or old-mex you are, but you gotta serve free chips and salsa or some free alternative in this state.  Mesa serves nothing.In regards to the main course, I had the Carne Asada and my friend had one of the sea food dishes.  Both had very nice presentation, and I enjoyed the carne asada's flavors (think wine flavor rather than spice).  The meat was chewy though and seemed overcooked.  Not my cup of tea.  My friend enjoyed the seafood dish.The dessert menu looked good but I totally forgot to get desert (and now I'm still hungry).  Shame on you server and shame on me!  In summation the food wasn't bad but I don't think I'll be coming back here much.  There are just so many better restaurants in Oak Cliff nowadays, and as always so many great Mex, Tex-Mex, and El Salvadoran restaurants near me that this place will often be overlooked."], ["Jonathan B.", "Mesa is a great restaurant. I've heard about it for a while and was not disappointed when I finally went last week.  The food and drinks are both very good and relatively inexpensive.  The neighborhood is funky, which adds to the ambiance of the place.  The spicy margarita was fantastic and the squash salad was really innovative. The ceviche was also good, though more like a guacamole with fish in it than the ceviche I'm used to...still good, but a little unexpected.  The lobster enchiladas and shrimp plate as mains are also highly recommended. It was surprising how quiet the restaurant was at 8:30 on a Thursday night and we closed down the restaurant before 10 pm. I know this isn't NYC, but Dallas you are killing me with the early closings.  Does everyone here go to dinner at 5:30??? Anyways, I will definitely try again and maybe upgrade to 5 stars. Really the only knock was that the restaurant was less than half full and it closed early.  I guess this is a macro DFW issue, not restaurant specific.  Dallas - you get minus one star for slight lameness."], ["Clint L.", "Love this place. The most addictive Mole sauce I have ever had. The lobster enchiladas are definitely worth the money with a large amount of crab and seafood. Ask for easy on the sauce for any of the enchiladas. The family atmosphere is an extremely charming element to the success of this restaurant.  Almost an entire restaurant built with re purposed wood and metal along with the eye for talent that owner/chef Raul Reyes has for finding unique pieces is unmatched in the neighborhood. Don't be fooled by the small reception area as you enter. The real treat is in the patio in back. It is an air conditioned covered patio that is definitely one of the most romantic patio designs in Dallas. Carlos is the bartender that I'm pretty sure never gets a day off as I have never been there when he wasn't working.  He always greets with a smile and has great suggestions for the delicious cocktails they offer. The MESA HORCHATA, which is rice milk mixed with cinnamon and vanilla rum, unique and refreshing.  Don't pass on this Jefferson Gem. It's within walking distance to The Texas Theater that I have to say should be supported more by the locals."], ["Lara S.", "Mesa Veracruz, I love you! I can taste the tender loving care layered into every dish you serve.  The Vampiro cocktail made with your pepper infused tequila and something called \"sangre de tigre\" was spicy and delicious! It beats any Bloody Mary I've ever had anywhere. Also good was your margarita, served in a short glass, but packing a punch.We tried 2 of your appetizers: Picadas de Veracruz and Enmoladas. The Emmoladas, pre-fried tortillas in olive oil, dipped in a Mole sauce and served with cheese, won. Oh my gosh, I don't even like mole sauce, but yours is divine.I had the Huachinango ala Veracruzana for my entree - filet of gulf snapper sauteed and topped with stewed onion, capers, olives, tomato,jalapeño and carrots. Again, spicy and delicious! My hubby had the Estofado de pollo - chicken stewed with olives, capers, fresh herbs, cinnamon and clove. A bit on the sweeter side, the chicken was literally falling off the bone. Your service is knowledgeable and down-to-earth; your space is warm and inviting. Everything about you feels AUTHENTIC.  We had 2 appetizers, 4 cocktails and 2 entrees for $80. For us, it was an absolute bargain for a restaurant of your caliber. We'll be back again soon, but it won't be soon enough!!!  xo"], ["Merlinda I.", "While I've been wanting to try Mesa for a while, I keep forgetting about it. It was one of those Friday nights where we knew the extent of our activities were going to be dinner after running errands, but just nothing sounded particularly good. Then I remembered Mesa - Coastal Veracruz Cuisine. When does that ever not sound good? We arrived around 9pm not sure whether to expect a Friday night crowd and to hope for seats at the bar or to hope it was an off/slow night for them without jinxing the livelihood of their business. This is located down the street from the Texas Theatre, but surrounded by a few slightly rougher looking laundromats, thrift stores, etc.It happened to be the latter - the smaller inside was fairly full, but they have maybe the best heated patio ever (warmth wise) and we were immediately seated at a lovely table for two out there. They also have a second bar set up on the patio which is nice for those busier times when you don't want to have to wonder if your drink is ever coming. I had the spicy margarita and the boyf just had a modelo especial. This is one of the best margaritas I've had in some time and had just the right amount of kick, while proving to be quite strong without tasting that way.The Ceviccheee. Ceviche is one of my favorite foods in the world - the idea of using the acidity in lime juice to cook something just fascinates me and it fascinates my taste buds even more. The menu states either shrimp or red fish (on this night), and we asked for a combination of both. This was enough to be a meal for one person - we did run out of chips but it didn't really even need chips and instead of asking for more I ate it by the spoonful because it was that good.I had the Guiso Del Rey for my entrée since I basically always defer to the seafood category and I didn't see duck offered this particular evening. My bf had the Chicken Mole Enchiladas. Neither of us is usually a fan of mole at all, but I'd heard so much about this 20 ingredient mole that I was more than thrilled when he decided to bite the bullet and give it a shot (so I'd still get to try it without risking ruining my own entrée - I'm unselfish like that). Both were served with simple, plain sides of rice but itMy dish was chock full of seafood: good sized shrimp, mussels, octopus, clams etc. in what was described as a Dos XX broth with jalapenos. It was accompanied by a side of garlic bread for sopping. I could have used more flavor in the broth, as served over rice it was still lacking something - with the bread on the side I started to think this broth would be like the super rich, winey, flavorful broths served with some of the best mussel dishes). The Chicken Mole Enchiladas were also really good and definitely changed my mind a little about mole, but just a few bites would have been enough for me. We did take the tiny amount of enchiladas leftover to go, which they packaged for us in the cutest little teeny tupperware. This leftover portion was the perfect amount of mole for me before I it became too much and I did wake up the next morning excited to eat it for breakfast :)Service from Carmen was great and the prices were actually really reasonable. Will definitely be back in the future although not close enough to us to rush back this week or month."], ["Lainey H.", "We heard that Mesa was having some financial difficulty, so we decided to lend a hand. I think we were the ones given the favor! The food was fresh, the menu interesting, and the margaritas were like fresh (large) shots of tequila.I was told the mole would change my life. Though I left the same girl, I left with a full belly and a healthy appreciation for the hundreds of flavors that create the perfect mole.Going with a group of friends? I would suggest the dessert sampler - try a little bit of everything. The rice pudding is covered in cinnamon and probably the best choice - but everything else, especially the chocolate flan, deserves a chance to dance on your tastebuds.I can't wait to go back and try more of the Veracruz menu - I doubt they can do any wrong."], ["Allison L.", "Whoa. Mesa. Whoa!  What do you think you're doing in my hood?  No really...what?  Sitting on Jefferson in the mix of all the run down shops, looking like a scary place...making me park on the street for free and then opening up the door for me when I enter the restaurant only to find that its quiet possibly the cutest place ever?  Who do you think you are?! Just because you have about 15 tables in the whole restaurant and that you are always working diligently to get everyone seated, doesn't give you the right to treat me with such respect and make me feel special.  Stop taking reservations and make people wait why don't you? You should talk to your waiters, because I did not need him to be as nice and helpful as he was.  I mean would it kill you to hire some a*holes?  Oh and another thing, stop refilling my water!  I mean...geez.  Let me sit parched for a few minutes.  Ugh. You think you're so cool cause you have the best mole I've ever eaten in my life?  Ever! That I could eat the ceviche all day long?  The trio of empandadas I could order everyday for the rest of my life?  How dare you make an Oxtail for MP to order.  It was so messy and yet so delicious, I had to stop him from using his fingers to wipe the plate clean.  You think you're king of the world cause your head chef delivers the food himself and then comes back to the table later to check on me?  I can take care of myself! I mean, ok fine.  The cocktails are pretty delicious...could use a little more booze in them but if that's the only flaw...screw you.  I'm coming back whether you like it or not.   I'm gonna sit and order food and I'm gonna enjoy it!  So you know what?  Keep throwing your orgasmic food and fine service my way.  I guess it'll just have to do."]], "El Corazon de Tejas": [["Matt A.", "Horribly slow service completely ruined the dining experience for us. Ten minutes is far too long waiting for a house margarita, even on live music night. That was the excuse given to us, that the bar was backed up because of that. Sorry dude, it wasn't that busy, you forgot, end of story. The food came out even slower, which is unfortunate given that the chicken fajita meat was dry and the steak fajita meat was void of any flavor. The only redeeming qualities of this place were the house made tortillas (delicious) and the atmosphere. Happy Hour - 4-7pm every day, $3 house margaritasI suggest going during that time, getting the margaritas and snacking on house made tortillas and salsa. That's it."], ["John V.", "The last time I was here it was named Tejano restaurant.  It was so bad I swore I would never set foot in this place again. Now some years later it changed ownership and is now dramatically better. The service was excellent, fast attentive, waiter was top notch knew every item on the menu by heart the sign of a very good waiter. The menu is large with lots of different options including vegetarian which is unusual at a Tex Mex restaurant. I was pleasantly surprised having had previous horrible experiences under the old owner and vowed never to come back again. This place has had a full turnaround! I'm very picky when it comes to Mexican food being a Oak Cliff native, kinda of puts me in the realm of aficionado. This restaurant is very good I would recommend it to anyone who's looking for a new place to try."], ["Kevin O.", "Corazon is not my first choice, but certainly not my last for tex-mex food. The enchiladas are pretty darn good and the chips and salsa are great. Now the reason I gave them 3* is because the drink specials are awesome!! I dig the margaritas made with fresh fruit. Now here's an issue...the Asian bartender is a complete jackass and Ive had more than one issue with him. He's always rude throwing shit around and acting like he hates his job...I'm really suprised they haven't gotten rid of him yet -.-"], ["Tracy L.", "Tex-Mex is what's on the menu... The building is historic to Oak Cliff; which is pretty cool. The prices are appropriate for the food and service. And on occasion a mariachi serenade strolling between tables creating an ambiance that makes my margarita tastier is a bonus. Parking is plentiful and a hop skip and a jump from the Bishop Arts fun."], ["Barkle T.", "I can't think of a better TEX-MEX restaurant in Dallas. Everything we ate was A+. One of my T-M barometers is stuffed poblano. They brought me one as big as my head and deep-fried to perfection. Hot sauce with a touch of chipotle is made fresh daily. Boffo refried beans and charro beans with a hint of smokiness. Tortillas made on premise.Our waitress was well-versed on both the menu and all the specials and gave us excellent service. Plenty of EZ parking. $2 bottled beer all the time. Also, be sure to ask for the dish of pickled jalapenos/onions/carrots.Note that in this glowing review, I did not use, \"Amazing\" a single time."], ["Dana C.", "I love El Corazon. I moved to the neighborhood because of this restaurant. Where do I begin? The food is amazing, the prices are low and the portions are gigantic! They have specials every day of the week and I've never had a bad meal here. My 2 favorite things to order are the chorizo + potato quesadilla or the tacos norteños. The staff is so friendly and makes the place feel like home away from home."], ["Coco G.", "Service is fantastic!  The salsa is always delicious and they have specials for everyday of the week.  Some of the best tortillas in dallas!"], ["Jon W.", "Damn, the tacos nortenos are something to write home about! Best tex mex I've had thus far in Dallas. Affordable, quick, cute decor and delicious. What more could you ask for?Cheap decent beer? YESSanto on draft for 2.95, that's nearly as cheap as an ice tea!!Corazon is going the be my go to joint For my tex mex fix now. Forget desperadoes, uncle Julio's, mi Cocina and the other crap they try to pass off around here.ALSO PORTIONS ARE HUGE....NEED I SAY MORE? DON'T THINK JUST GO!"], ["S J.", "El Corazon de Tejas is a fantastic restaurant with great food and amazing value.  The food is high quality and the service is superb! Went there on Saturday night and had a great meal.  The Fajita's for 2 special and the all day happy hour made it extremely affordable. The salsa is fresh and and the chips are made in house.  The meal was giant and just because they have a deal doesn't mean they skimp.  House made corn and flour  tortillas, choice between churro or refried beans, separate set-ups and the meat is as good as fajita meat gets! The cilantro rice is fantastic as well.The margarita's are great and don't shy away from trying the watermelon variety!I can't stress enough, that if you like straight forward tex-mex with high quality ingredients, this is a place to go.  You won't regret it and will have a new staple on the other side of the river!"], ["Liz S.", "Wow! What an awesome surprise. After driving by this spot on W Davis for years now I never had actually stopped in until a few weeks back.I was shocked to see just how crowded the parking lot was during lunchtime and now I know better for my next visit. The inside is exactly what you would expect from a traditional Tex-Mex restaurant, with brightly colored walls music playing over the radio and plates of sizzling fajitas going by.I learned that the tortillas are made by hand here at El Corazon.  How cool is that? I'm sure it's hard to find a TexMex  restaurant that doesn't rely on machines to pump out the hundreds of tortillas that are served each day.  Sisters have a special place in the back of the restaurant where they make each one literally with love.I decided on the chicken chipotle quesadillas as my meal and I was so happy with that decision. Plump pieces of chicken and deliciously fresh spinach line the inside of this quesadilla but there was also a surprise that laid within. I thought to myself that these quesadillas seem to be a little richer in taste and perhaps more messy than the ones that I normally eat-Come to find out that's because there is a thin layer of sour cream within each one. Not exactly diet friendly but they sure are delicious!Be sure to order a seasonal margarita while you are here since the restaurant utilizes fresh fruit from urban acres!"], ["Madeline D.", "We have been searching for a Mexican food place and we have FINALLY found it!! We came to Bishop arts to go to another Mexican place, and saw El Corazon and had to try it instead!! The salsa was great, food was great, and service was excellent. Only complaint was that my marg wasn't very strong. We will definitely be back!!!"], ["Joel G.", "Upon entering, the aroma of sizzling fajitas filled the room so I didnt need to pour over the menu as I usually do. The chicken/beef combo was a good portion with all the usual fixings and I wish the meats had a little more flavor. The whole fried jalapeno did add a little kick. Cilantro rice and boracho beans were very tasty as was the salsa.  Our server was also okay (had to ask for things he forgot) but observed other servers who were much more engaging with their guests.I'll go back but just order something different."], ["Chris D.", "It was okay, the steak was however above average and the drink will put you on your ass!"], ["Jackie C.", "My husband and I come to El Corazon at least once a week. I absolutely love the bartenders Jackie and Amy, they have the best attitudes and super great service! I love the cilantro rice and the Layered Bean Dip is awesome not to leave out the fajitas excellent.  This is the best place for a House Frozen Margarita and inviting environment!!  Love the El Corazon :)Jackie & Abe Back"], ["Shondip C.", "Great food, casual ambiance, but on the loud side. Guacamole not worth it, mostly lettuce."], ["Dave G.", "El Corazon de Tejas is a new/old place for terrific Mexican food and enormous margaritas. Some will have visited the spot when it was Tejano, a much beloved joint  in the OC. While the place has had a makeover, the ownership has only changed slightly. The Cuellars of El Chico fame still own and run the place but just a different branch of the family. Happy hour is a great way to begin exploring the El Corazon. Domestic and import beers are (if memory serves) $3-ish and soup-bowl sized margaritas are $3. They will bring you the standard chips-and-salsa to accompany your drink. Your first taste of the good things to come will be a wonderful red salsa that is bright and full of smokey chipotle flavor. For dinner, the overall impression is that everything is freshly made and subtly flavored. It is easy for lazy Tex-Mex cooks around town to clobber their food with the spices of the Mexican flavor profile and call it a day. Not so at El Corazon. I chose the mole enchiladas, and though I am not a huge mole fan, these were great. The sauce was delicate, mildly chocolatey, and delicious. A friend chose the Guiso de Res and pronounced it phenomenal. Corn and flour tortillas are made to order. I verified that there is a person in the kitchen who scoops dough into one of those cast iron tortilla clappers and then slaps them onto a grill for each diner. It may seem like a small thing, but fresh tortillas really do add a dimension to the meal. El Corazon's atmosphere is open and congenial. The service was good. The prices are reasonable. The food is much better than most Mexican places in town and reasonably priced."], ["Joe S.", "Ate there Friday, October 31.  Service was great and the meat fried pie I ordered was great also.  Free Parking was a plus.  Near the Bishop Arts district"], ["Rob K.", "This food was not only delicious, it is worth writing home about. Here is a place worthy of Tex-Mex in Dallas."], ["David L.", "We dined here last night. The last time that we dined here is when they transitioned from Tejano's and they had a limited menu. We were not impressed then but chalked it up as new restaurant kinks. Last evening we decided to give it a try.  First off, the food was really good.  I wish I could rate food and service separately. Food would have a 4 for sure.  Service lacked something to be desired and the restaurant was not all that busy. When it came time to pay the check, the waitress brought the check. We laid down the credit card and waited for her to pick it up to process. We waited and waited and waited.  I finally walked to the hostess and asked if i could pay the bill at the bar.  She said I had to pay the server I explained we had been waiting almost 15 minutes.  She begrudgingly took the check to run the credit card.  She brought it back to me a few minutes later for me to sign.  I asked for a pen and she did not have one.  Once again she walked off to get one.  I signed, asked for the manager and told him our experiences.  He had no words for us. We advised that we would not be returning and would not recommend the restaurant to any one."], ["Michael V.", "Best Tex-Mex we have found in Oak Cliff so far!The food is always delicious and the service is prompt and friendly.Their happy-hour deals are great, and the food itself is reasonably-priced.Do yourself a favor and get an order of the churros with caramel for desert. They are amazing!"]], "Desperados Mexican Restaurant": [["Nicole H.", "Food couldn't have been better. Hands down best Mexican food I've had in a long time. They blew the roof off with their Margaritas... Especially their award winning \"La Margarita\". Wowza.Since it was our first time here, the owner (it was his fathers restaurant) came by to welcome us.If you're anywhere near Dallas... You need to eat here! It's another #dontmissgoodeats"], ["Ashlee B.", "(+) Pros: Amazing top shelf margarita (it's like a Mexican Martini if you've ever had them from Trudy's in Austin) and so delicious & healthier option! Service was great & quesadillas were yummy. (-) Cons: Sangria frozen swirl margarita was SO sugary it gave me an instant headache. Queso was not very good. Best Queso (coming from an avid fan-addict) is Gloria's. Great little patio area - would definitely come back but doesn't top my list as somewhere I'm craving or would take visitors from out of town to because there are so many great mexican food places in dallas with great atmosphere, drinks & food."], ["C. C.", "Food is always fresh, authentic, and delicious! Been visiting this place for over a year and will keep coming back.Service is prompt and friendly. Lunch specials are great."], ["Monika F.", "Loved this place! Delicious food and great service. The desperado tacos and brisket tacos were sooo good. As were the \"la margarita\". I wish lived in Texas so I could come back here!"], ["Jason B.", "Best cheese enchiladas in Big D? They are certainly in the running. Perfect texture and just the right amount of cheese and chili sauce. Beans and rice are a solid version, as well. Also, service is great and I love the old school atmosphere. JB"], ["Eddie C.", "3.5 stars, but I'm feeling nice, so I rounded up.Desperados is a good, no nonsense Tex-Mex restaurant. When I lived in The Village, I came here more, but when I'm in the area, I'll still drop by. My favorite time to come is on Thursdays, when their famous tacos are reduced in price. These tacos are not the street tacos you are accustomed to. They are real tortillas that are deep fried, then filled with either chicken, beef, or both, pico de gallo, and a slice of avocado. I know it's just a taco, but they really are that good. Aside from the tacos, I really enjoy the build your own plate option. Here, you can chosse from any 1,2, or 3 of your standard Tex-Mex favorites. Options include different types of enchiladas, tamales, tostadas, and more. To me, the enchiladas are 3 stars, but having the freedom to build your own dish is a nice touch.If you're feeling more carnivorous, the fajitas are some of the better ones around. Very well seasoned and always served sizzling. Definitely worth trying at least once."], ["Edwin S.", "Food is decent,  but nothing to write home about.   Portions are pretty small,  especially for a state that prides itself on big portions.    Prices are on the high side as well.   I can't understand the high ratings for this place when there are so many other options around."], ["Lauren D.", "Good but not great.  We were looking for a tex mex place for lunch to replace our current lunch options so we decided to give this place a shot.  Unfortunately everyone agreed that this place falls short of our other two options.  The fajitas are \"fine\".  They're not great but they're not bad.  The lunch size portion is plentiful but I found them to be lacking in seasoning.  Mine did not come out sizzling.  They also don't come with sour cream so you must ask for that.  El Fenix does better fajitas.  My friend says that Banditos does better fajitas.  Both of us agreed to disagree about which one did it better, but both of us agreed that these are not the best...they're just ok. Better than what you could get at say...Chilis but not as good as what you'd get at the average chain tex mex place.The chips and salsa were solid.  The chips came out hot, but I think they were sitting under a heat lamp, not actually freshly made.  They tasted fine.  The salsa had a great flavor to it so I wavered between 3 and 4 stars for this alone.My friend got a bad order of rice that had to be sent back.  We couldn't tell what was wrong but it just tasted...off.  Everyone else had rice that tasted fine but his was bad.  They fixed the issue quickly.  The prices are in line with everyone else.  It's not super cheap but not expensive.Ambiance was decent...the place is dark but has a certain charm to it.   Parking can be pretty tight if you go during a popular time.We probably won't be back since it wasn't really amazing.  If someone else chose to go here and invited me, I wouldn't have a problem going back and giving it another try though."], ["Ruth C.", "We went with a group of 12 last night. If you are not a \"foodie,\" then you'll love this place. Worst fish tacos I ever had--tasted like very old frozen fried fish that was microwaved. Most of us at the table did not care for our food. Restaurant looks like it did in 1980s. Needs a facelift and maybe the floors cleaned. It's basic Tex-Mex \"slop\"--but it's popular. We prefer Mi Cocina hands-down."], ["Stefanie L.", "I'm only giving this place 1 star because I absolutely LOVE the food that this place has and it's the only thing that keeps me coming back, the service however...From the moment we walked in we were greeted by an uninterested hostess that looked like she wanted nothing more than to be away from the restaurant. (FYI, you're supposed to set the vibe of the restaurant, at least fake a smile for us!) We were then taken to a table and when asked how we were doing, we attempted to reply to her only to be interrupted by an \"Enjoy\" and her walking away. Oh, okay, thanks for asking I guess. Service wasn't any better, our server took his sweet time getting to us, (we were seconds away from just returning the menus and leaving) unfriendly and uninterested. Really disappointed with this place which is a shame because they have really good food."], ["Lori G.", "I have been coming here since 1994. I have tried most of the menu but always end up ordering the Desperadoes tacos. These are the best tacos!  We usually try to go on the weekends to get the roasted salsa.  Sometimes you have to know to ask for it. So don't  forget!   The regular is pretty darn good too!On Wednesday they have $1.99 margaritas. Jake and his family have done a great job over the years. Parking can be a little tight but they usually have a guy directing the lot.  So it isn't too bad. Think I will head there for lunch today!"], ["Fred B.", "Uhm... it was... OK.  But... 'er... just ok.  Not that great. Could be better.  Should have been better, but it wasn't. Food was pretty good.  I'd give the food 4 stars.The chile rellano was actually very good - stuffed with meat and almonds and raisins.  Really good.The beef fajitas were tasty.The drinks were downright lousy.  We tried 2 different margaritas, but didn't like either.  We tried the red sangria - it was ok at best.  No more than 2 stars for the drinks.Service was friendly and attentive.All in all 3 stars.  You can do a lot better for Mexican food and/or Tex Mex in Dallas.We'll try other Mexican restaurants instead of going back..."], ["Vivian R.", "Hearty, delicious Mexican fare. Not too many vegetarian options but I gobbled up my cheese enchiladas in all of 5 minutes and my husband described his Desperados Tacos as epic. Service was not terribly attentive, but the decor is lovely and I will definitely be back. Food 4, Service 3, Ambiance 4"], ["Johnny L.", "Was ok, don't get the hype. Chips/salsa were good, food was nothing special and service was forgetful. Wife and I had Huraches, their version of eggs Benedict, eggs were way over cooked and were more of a boiled egg than a poached although they were poached.  My sister had the migas and she had no complaints. Glad to finally try and will give them another shot as we've never had the signature Desperado's tacos. Hopefully things are better the 2nd time around."], ["Trisha H.", "By far the best Tortilla soup in town!  Guacamole is also the best I've had you don't even need to season it more like other places. Everything I've eaten there is always good. The staff and management are always so very nice. I've been coming here for 20 plus years and still love it every time."], ["H L.", "Dark and Dingy.... almost Dungeony!!  But the food?  Out of this world!!!The Guizo De Carnitas De Puerco Con Chile Cascabel was so tasty it was just plain unbelievable.  The Tortilla Soup was just out of bounds!!  This Mexican Tex-Mex place was super awesome.  There have been many many celebs there and they have a full wall of signed autographs and photos from them.  Awesome awesome food!  Portions were HUGE like everything in Texas.  They just don't disappoint!"], ["Leila M.", "Friendly server, Ruben made our first time an enjoyable one.Chips were crunchy, salsa wasn't too spicy.  Tex-mex choices was good.  Definatly coming back."], ["Harmony G.", "My boyfriend & I FREQUENT this place quite a bit, and by frequent, I mean at least once a week (if not more), when I'm visiting... They have thee best salsa in town.  And we always get the spinach enchiladas (they're not on the menu), do yourself a favor and order them with green sauce. Sooooo good!We always go for the booth in the back corner, its nice & dark, not too noisy. Such a great restaurant, we'll definitely be back soon! :D"], ["Adam C.", "I finally tried this place out today when I was driving by and noticed there was an easy parking spot.  Parking here is terrible.Chips and salsa grew on me.  At first I didn't like them much, but then I did.  Can't explain.  I'm weird I guess.  I got the Wednesday lunch special that was \"Guizo.........\" (don't remember full name and it's not on their website).  It was chicken pieces served in a cilantro-tomatillo sauce with rice, beans and tortillas.  Flour tortillas seemed homemade and the green sauce was amazing.  I have never had a dish like this before, and it was great.  Will go back some Wednesday to get this again."], ["Meena N.", "Always, always, ALWAYS come here with one specific coworker for lunch. It's quick. And it's good. I've only ordered from the Tex-Mex lunch, but everything I've ever gotten has been good and looks good on other's plates. Your drink is always replenished, and your order is usually out pretty quickly. Parking can be tricky if going during the lunch rush, so try carpooling with coworkers to make space for everyone else."]], "Pepe's & Mito's Mexican Café": []}