{"Dragonfly": [], "Lark On the Park": [["Matt G.", "Let me start off by saying this place is one for those who know high quality service and high quality taste. All the servers and the manager Santiago was very friendly and knowledgeable of the product the bar and restaurant has in stock. Angel the bar tender was very nice and professional.Cons. Not too impressed with the flavor of the charcuterie plate and I don't like the fact I can't order a CUP of soup"], ["Michelle N.", "When the weather is beautiful, you'll want to enjoy it outdoors over a weekend brunch.  Where better to have it than at Lark in the Park!It was a beautiful Sunday afternoon.  I was in a party of 4 and to my surprise, we were quickly seated without reservations!  They certainly had ample outdoor seating for small groups (two tops & four tops) but I can see more a challenge for larger groups.Expect service to be slow... but this will force you to actually sit back and relax.  Take a break from the hustle and bustle and enjoy yourself!The table shared a carafe of the seasonal mimosa.  We got lucky with mixed berries which was soooo refreshing and perfect for the day.  A friend had a bloody mary and enjoyed it so much, he had two.Among the group, we shared 4 entrees and had a bite of each:Vital Farms Eggs & Quinoa Bowl - the egg is perfectly poached to add the yolky creaminess to the quinoa and kale.  Sounds healthy but I assure it was comforting.  My guy friend who has a hefty appetite ordered this and he could barely finish his dish.Smoke Salmon & Pumpernickel - I love the twist they put on this traditional brunch dish.  The pumpernickel bread goes even better than your typical bagel.  Everything tasted sooo fresh.Lark Benedict with Duroc Ham - YUMMY!  The hollandaise sauce was perfect!Shishito Omelet - delicious!  We ordered a side of house-made sausage patties which went perfectly with this entree.You can't go wrong with anything on the menu!  I can't wait to go back to try more.Also, don't forget to appreciate the chalkboard art which is commissioned by different artists on a quarterly basis.  All your senses will certainly be enticed here! Once you're done, take a quick hop skip away to Klyde Warren Park to enjoy the rest of your day.  Now THAT is one beautiful afternoon!"], ["Steven N.", "Lark on the Park is a very nice looking restaurant. It's a classy place that's good for a date or with a large group of friends. Unfortunately, the great looks don't translate to the food, as I didn't really enjoy the two dishes that I tried. I ordered the lamb shank, which sits on top of cous cous with pine nuts, olives, and some pieces of feta. A majority of the lamb shank is covered in muhammara, which is some type of Turkish hot pepper dip. The meat was good, but nothing special or mind blowing. I didn't like the muhammara at all, and had to scrape all of it off as I couldn't stand the taste. I didn't enjoy the cous cous either as the pine nuts sprinkled throughout added a sweet taste when it should've been savory. I'm not really a fan of mixing flavors. My girlfriend had the moo krob, which was a Thai pork belly. I didn't really like the flavor on this one either. The service here is good though and if it's your birthday, you can pick out any dessert from the menu at no charge. Come for the atmosphere and view, but not so much the food."], ["Andi W.", "Good ambiance, cocktails and the brunch is pretty great. Proabalby the best and crispiest bacon I have had at a restaurant. On my last visit we sat outside and I'm not sure that was the best option for that day. Our server was a little inattentive and didn't seem super thrilled to be there. Don't really blame him, I'd probably be resentful if I was working on a Saturday morning serving brunch instead of eating it. I'm sure that was a fluke and I won't hold it against the place as a whole. This is a great location and after you are done eating you can always go across the street to hang at Kylde Warren."], ["Ivy W.", "Came here to celebrate Father's Day so we had reservations but it wasn't packed at all. I want to give this place 5 stars but our waiter forgot our bread, barely came by to check on us, and the food took more than 30 minutes to come out. Other than the service, I love the environment! It's so modern chic. There's these chalk like art canvases all around the restaurant. Also, the place is decked out with glass walls so it gives off such a refreshing feel. Music isn't too loud and the decor isn't over bearing. The food was amazing! The menu seems to have a strong Asian influence with items like bok choy, toke poke, and braised ox tail. The drinks were strong and flavorful! Try the Peruvian fields. I recommend the curry pillows appetizer and the seared scallops."], ["Emmy F.", "Took my family here one night and enjoyed everything about it. Complimentary valet parking (but tip is expected), and right next to Klyde Warren Park where we walked around right after dinner. Great atmosphere, great service, and great food. It's a pricier establishment but it's in an awesome location of Dallas and you definitely get your money's worth. I had relatives come from out of country and wanted to show them Dallas. I had made a reservation a week prior for 6, I would recommend reservations for weekend peak hrs bc this place does get packed! Especially around the bar where it gets crowded and happens to be right between the entrance and dining area.  For food I would recommend Seared Scallops, Braised Lamb Shank and Moo Krob. Very good dishes! I had a special which was a fish wrapped in bacon and it was amazing! So keep on eye for cool specials too. Good place for special occasions, highly recommend."], ["Beth D.", "An absolutely perfect business lunch destination, Lark on the Park has quickly soared to the top of my Dallas list. They have the kind of attentive service you expect at this level of dining - upscale, business casual, high-end gastropub feel, Standard American fare with a hint of elevation. Every time I've been, a suit-clad manager has opened the door for me, a smiling hostess has seated me immediately. Sitting at the bar, I'm brought a water without being asked - the manager breezes through afterwards and supplies the straw I'm sorely missing... also without having to ask. They just know what a patron wants. The atmosphere is bright and breezy with lots of light, and lots of clean, metal surfaces, urban wood and wrought iron furniture. There is both indoor and outdoor seating, facing Savor Gastropub (which could take a cue or two from its neighbor) and Klyde Warren Park. A favorite of mine here is their fruit & herb Spritzes - a menu of very bright and refreshing non-alcoholic drinks such as the Blackberry Sage Spritz or the Strawberry Basil Cooler, which will be mixed, crushed, shaken and served with all the care of a true cocktail, served with a pretty garnish and fully enjoyable. For a slight upcharge, you can make it \"stout\" with Gin. But for those who abstain at lunch, or, say, for the expectant mommy, it's nice to have an NA option that's not soda or tea. I've enjoyed their menu basics and a few entree salads (which appear to be seasonal and always fresh). But what I'll be back for is the 44 Farms Burger. This gem easily ranks near the top of my Best Burger in Dallas list and I'd recommend it to anyone who claims to be a burger aficionado. The beauty is in its simplicity: An extremely thick all beef patty seasoned with nothing but salt and boasting a height of at least a full inch, I recommend ordering it medium. It's completely juicy and tender, slightly salty and all things savory. Topped with beautifully caramelized onions, thin-sliced cucumbers which have been soaked perfectly in vinegar and salt, a thick steak cut tomato slice, a wedge of bleu cheese and a single leaf of green lettuce. And *muah* that's it. I've actually been complimented before on the fact that, as a lady, I manhandle my burgers and rarely ever cut them in half. But this sweet thing is so tall, you'll have to cut it down to make it manageable. French fries are the perfect side dish - this is just an American fact. And I know that truffle fries are all the rage. But Lark on the Park has come up with the perfect answer to the oft overwhelming truffle fry trend: Frying Rosemary and Sage leaves in with the fries, and serving them all tossed together. You'll grab a cluster of fries, dip them in ketchup, take a bite, and realize you're also enjoying a crisp, tiny element of Rosemary which adds the perfect flavor pop. It's all just so good. They also deserve praise for featuring (not just on the walls, but on their menu) local artists who come in and, during service, will create their chalkboard art for the season right there in front of the patrons if they're so lucky as to dine in on the right day. The work featured is beautifully impressive for being simply white chalk art. Local businesses supporting local art serving an amazing burger while supporting a local farm - these are some of my favorite things. Pro-Tips: If you're not coming for lunch, from walking distance, you'll want to valet instead of search for parking, you'll do this across the street at Savor. If you're at Klyde Warren park for the afternoon and have already situated your parking, I highly recommend hopping over to give this place a try :) I reservation is a must during peak hours if you're coming anything but solo and sitting at the bar. Price Point: You'll drop $14 on a burger, $20 on an entree and somewhere between $7-$17 on a salad."], ["Angel B.", "LARK On The Park is another restaurant that's located at Klyde Warren Park. My good friend was heading off to Thailand and we decided to do dinner. Upon arrival, the hostess checked us in immediately. I made reservations to avoid any issues. Complimentary valet parking is available right next door. Just make sure you have the waiter or hostess to validate. Luckily, we were seated by the windows and could people watch. At first, it took us some time to warm up to our waiter. Initially, he was moving so fast we could barely ask questions. Come to find out he was working the inside and the patio area. He suggested the scallops and stated we couldn't go wrong.Both of us ordered the scallops and they were okay. It wasn't anything to write home about. Then a birdie whispered to us that brunch is much better. Not to be defeated we ordered dessert. I had the Lemon Coupe and my friend had the Sorbet. Our dessert were very refreshing and a pleasant surprise. We both decided we would come back for brunch. I want to give it another chance. Honestly, the hostesses are nice, the ambiance is great but the food is just ok. Hopefully, brunch will redeem this restaurant for me."], ["Hollie B.", "I had really high hopes for this place! This review could change after my next visit though...First off, the decor and cleanliness of this establishment is beautiful. Simply amazing. The service was great and very attentive.We started with the charcuterie board, about 7-8 different meats. The spicy pepperoni looking ones were the best! Served with warm bread and butter. My mother got the steak and it was pretty good! She raved about the spinach that came with it-I decided to brand out and get the braised oxtail, it was a mistake. The waitress said of all the places you should try it here... It was a lot of effort for little meat. It comes with two portions, they were very fatty and very challenging to maneuver off the bone! It was served with barley (which I cook often) and it was NOWHERE near done. It was as crunchy as dried rice. I couldn't eat more than one bite! I should have gone with my gut and chosen the lamb shank. Lark on the park is raved about, so I will definitely give it another try-"], ["Colleen M.", "Loved this spot. Cocktails were great. Service was friendly and enthusiastic. Not quite \"on\" the park but near enough to stroll over after a bit of people watching. I will definitely return before my visit  to Dallas is over - the Botanical Mule is not to be missed. An herb-y refreshing cocktail, perfect for the summer! This place is SO worth checking out."], ["John N.", "This review is solely for their drinks and service. Hopefully I'll have the time to try out their food.I had their peaches and cream drink to start off the night because I had a bit of a sweet tooth. Think of the orange dreamsickle ice cream, but not quite. I'm not sure what to think of it but something wasn't on point. Overall an okay drink or maybe your date might like it if she wants a drink with minimal to no alcoholic taste.The bartender was nice in accommodating and taking care of my party of 7. Professional and knowledgeable enough to recommend a beer when I told him what beers I like. I forgot the name of the beer I got, but it was a nice beer and I enjoyed it.As a bonus if you don't know already from the name, this place is across the street from the park. Weather permitting it would probably be nice to sit outside and catch up with friends over some good drinks."], ["Scott L.", "I woke up around 9am.Got a coffee around noon.Gym at 1pmLunch at 3pm.Happy hour at 5pm.Coffee around 7pm.Suddenly it was dinner time. (9pm)Alit on bmx bike on way downtown from uptown,Lark in the Park seemed the special euro bistro choice.  Luckily I was wearing a smart sweater.  Lark in the Park has a casual tony feel, with rotating chalk board art panels, and a menu ranging from $10 light snacks, $13 charcuteries, to salads like scallop carpaccio with blood orange $14, to hearty $20 + range entrees.  You can relax here.  I ordered my vino d jour - rosé $10 and a bowl of mussels, quilted in fresh mellow green onions and swimming in a luscious garlic broth.   The world could end.   For $15, the plate could be larger, but I was stuffed, and the bartender forgot to offer bread with my shellfish.   Eyes widen.But I forgave him.   It's almost springtime in Dallas - love resonates - and it's an easy echo here.  He also forgot to mention that bottles were half off on Mondays, which was less forgivable.   (The guy who complemented me on my bike paint job mentioned it.)Lark on the Park manages to escape the touristy vibe of nearby Savour and its popular Klyde Warren Park locale, while being both cool and amenable.  Spot on ya'll.(Even tho the bartender kinda screwed me over, but the manager intervened.)"], ["Zulema D.", "I hate the waitresses here and the manager has no real experience in the business of simply apologizing for hiring stupid waitresses. I enjoy the bar, the food is perfect, & the guys at the bar are very respectful & interesting so the drinks come out great. Try the grilled cheese;) my personal favorite."], ["Jina C.", "We opted to sit outside, because the weather was nice and we could have a great view of Klyde Warren. My friends got the Braised Lamb Shank and Braised Oxtail, and I ordered the Seared Diver Scallops. They were all delicious, but I enjoyed my dish the most. The scallops were seared to perfection and blended very well with the greens and mashed potatoes. I also loved the addition of pine nuts and pomegranate seeds on top. My only complaint was the portion size. I finished that plate clean, and I usually always go home with leftovers. Since it was my friend's birthday, they let her choose a complimentary dessert. After much contemplating, she chose the Butterscotch Panna Cotta. It was superb! The ingredients seemed a little odd, but they worked so well together. A must! Service was on point... our server came back multiple times for our order because we were indecisive, but he was still a good sport and offered great menu recommendations."], ["Mary S.", "I believe a refined diner is one who parks at the bar so that's is usually where I partake my meal.  The cocktail menu here is one of the best lineups in Dallas.  I know if Matt is behind the bar slinging my drinks I am in for a treat to sip on.  Featuring notable modern American cooking, a range of influences and flavors, Lark on the Park hits the Mark! Great for date night, I suggest hit up the late night at the DMA last friday of the month and end up over here!"], ["Fred C.", "The restaurant features a modern décor with a handsome bar area as well an outdoor dining area.  The service was friendly and any questions we asked about preparation were handled with great detail.  My wife and I shared a Charcuterie Plate for an appetizer which was perfect, crusty toast, prosciutto, assorted olives and a delicious mozzarella sauce.  Main courses were Skirt Steak with Pomme Frittes and an Asian influenced dish of Short Ribs and Bok Choy topped with a poached egg over rice in a tangy sauce.  Both were delicious!  A shared dessert of Vanilla, Chocolate and Coffee ice cream over toasted pecans completed the meal in grand fashion.  One slight comment though.......  The wine list, although extensive, was rather pricey.  Wines by the glass were $12 to $18.  Overall an excellent meal."], ["Michelle D.", "Real star rating 3.5 stars.We did this family style on Black Friday.  Since it was the day after Thanksgiving, they were only offering the brunch menu at the time.  This was kind of disappointing because I read several yelp reviews and pics and had a few dishes from the regular menu in mind that I wanted to try.Rare Roast Beef - I hate to say it this way but this was similar to as if I had made the sandwich at home.  Which is not terrible, but I had hoped for a little more oomph on this sandwich since it was at a restaurant.  One thing that might have helped would be if they toasted the bread.  The sandwich itself was also a little bland and plain.Hamburger - this was an ok burger.  Between the two dishes I definitely liked this one better.Sweet Potato chips - I'm not a big sweet potato fan at all.  I don't do sweet potato fries or baked sweet potato or any sort of sweet potato at all.  With that firm statement - I have to say I actually liked these chips.  They were perfectly thin and crisp and not too greasy.  The odd thing though was my mom's batch was great and my aunt's batch was over salted to almost inedible.The rating is more for the place itself.  It's really nice and it's location is great.  They had some pretty interesting beers that I'd never tried on the menu as well."], ["mccauley m.", "Amazing brunch, great cocktails, nice day to eat outside on the patio, definitely recommend."], ["LaKeshia S.", "I met a girlfriend here for an early dinner around 6:30.  It was crowded but the hostess was very nice. We were seated. I asked for the happy hour specials and the waiter wasn't sure what they were....not good. I showed him on the website that cocktails were $6 at the time...he told me it wasn't correct. I became upset. The manager came over, 10 minutes later, and explained the happy hour and the website. She offered us a great cocktail for  $6 and the first round is on her. Great leadership and customer service she showed us!! Now we can stay here!My food was amazing! I ordered the hanger steak. It was cooked perfectly. The spinach souffle was AMAZING! It made me forget about the lack luster customer service from the waiter.I will definitely go back to Lark but would request not to be served by the waiter who clearly doesn't know the specials."], ["Jeannine B.", "Went for brunch and fell in love with the place! Great location. Great ambiance. Great people watching. Great food. The fried egg sandwich is amazing and the breakfast potatoes are to die for. I ordered the special cocktail, which I did not like, but they have French press coffee, which makes everything better. Being across from klyde warren on a perfect day also doesn't hurt. Can't wait to go back."]], "Suze": [["Cory H.", "We have found a new favorite in Dallas. The atmosphere is very quaint, the customers seem to all be regulars and I love that it has a neighborhood feel. Great wine list and my pasta was amazing. My husband had the filet and love it... we are both pretty picky because we have a certain expectation but this place exceeded ours. Will be visiting again very soon, especially since it is right down the street."], ["Lady G.", "AMAZING & fresh food, but weird crowd LOL. I guess maybe cause of the area, or maybe it was an off nite, I dunno but anyway it was a senior citizen crowd, for some reason I wasnt expecting that (me & my date are late 20's early 30's) regardless its still great food & I suggest trying it out for a fancy/special meal. Kinda $$$"], ["Nickie G.", "Went to Suze with the BF Saturday night.  This restaurant really wasn't even on my radar so I was definitely surprised when he pulled up.  It is flanked by an Albertson's...literally between the front and side door of the grocery store.We walked in and I was surprised to see how small it was.  And that many of the diners were my parents' age and older.  AND no bar!  We had reservations but had to wait for about 10 minutes so the lady that was seating people brought us some wine.  Wine prices were a little steep by the glass...from $8 to $15 for glasses.  We got a glass of some malbec for $10 (and later bought an entire bottle for $42 which seemed more reasonable).  Seating is most definitely tight and close beside your other diners so don't go there for a breakup talk!  They bring out bread with some pesto to dip it in which we polished off in no time.  For a starter we ordered the sesame lavosh pizza - thin crispy sesame cracker almost with spinach pesto, tomatoes, mozzarella, and parmesan.  Crunch-a-licious good!  They also have other choices like a Medeterranean platter with hummus, olives, etc and fried green tomatoes.  Another table got those and I was jealous immediately.  Next time I'm getting those.For my entree I got one of the specials of the evening: the center cut pork chop.  Honestly one of the biggest freakin pork chops I have ever seen - it was almost as big as the plate.  It came with mashed potatoes, carrots, and the sauce on it was a cherry sauce.  It was sweet and savory all together and tasted amazing!  The BF got the baby rack of lamb.  The lamb was pepper crusted and came with a zucchini feta cake.  I thought the lamb was great but that zucchini thing was eeeeh not my favorite so I am glad I stuck with the pork chop.The dessert selection didn't really wow me.  We chose the creme brulee of the day which was cinnamon.  It was perfect on the top...super crunchy and had that almost burned sugar taste that I loooove and good hint of cinnamon.Must mention that our waiter was awesome!  He was always on top of our requests and he joked around with us when we did with him.  Good service, good sense of humor, loved him!  Overall I'd say the food was really good and the evening was nice.  I don't know when I'll ever make it back but if someone wanted to go I definitely wouldn't complain!"], ["Daisy C.", "Suze is cozy and intimate, yet they have no problem accommodating large parties.  My favorite dish is the porcini pappardelle.  I can't wait to eat the leftovers today.The service is unpretentious and flawless...way better than a lot of so-called 5-star restaurants."], ["Jennifer S.", "What a wonderful neighborhood restaurant.  Last night was my second visit to Suze and it did not disappoint!  All 4 of our meals were fantastic - short ribs, porcini pasta, almond crusted trout, and duck breast.  The chocolate gob dessert is to die for too!  Cozy restaurant with good service."], ["Shane O.", "As a long time visitor to Suze, I returned after a break. As some others here have remarked, the menu seems to be pretty static. Imagine my surprise to see some new additions to menu. As usual we brought our wine (love the BYOB). One of the nice additions to the menu was the Dover sole, w/ shrimp and it was exceptional. I had the usual Trout Almondine, which is always exceptional. The option to add a portion of Foie Gras to any entree for $6 also hits the mark. The fried green tomatoes were the only mediocre flavor of the evening. Service was efficient and unobtrusive. Always a good value, two people $85.00Edit- Fried Green Tomatoes, the issue I had was a slight undercooked, for my taste, while the other 3 diners did not share that opinion."], ["Neena W.", "Don't be fooled by the look from the outside, it's one of the few place in DFW area (at least what i could found) that serves capaccio, and it was a fresh and tasty one. I also like the fact that you could bring your own wine to go with their fine cuisine and just pay a cork fee. Especially if you want to go fancy with the wine,  bring a good bottle yourself will save you lots of $$$. Call in advance for reservation. We called, and still waited for about 20 minutes."], ["J B.", "Outstanding. Perfect Foie Gras, excellent rack of lamb and sumptuous sticky toffee pudding. Be careful on the wine as the cost can rack up but apparently you can bring your own so will may do that next time. Highly recommend this restaurant for high quality food at a cost would be twice as much in many similar quality establishments in Dallas."], ["Rosie K.", "I visited for the first time after hearing rave reviews from friends.  Not many vegetarian choices (since my friend is vegetarian) but the chef-owner came out and offered to make us anything if we wanted to.  I decided to get the ravioli stuffed with mushrooms and shrimp.  The shrimp was the best I've had in years, cooked just right and huge!  My friend is a regular, so our service experience was great.  The owner does walk around and talk to people making them feel welcome and making sure all is okay.  I would return, I loved my dish and drinks!"], ["Jessica D.", "I was taken here on a date a few weeks ago. This place has such an adorable, cozy romantic interior and feel as you walk in. Once you shuffle past the traffic jam of cavorting patrons-in-waiting clustered toe-to-heel along the entrance hallway leading up to the hostess stand. The hostess was sweet and seemed new, and had a chance to seat us about 20 minutes after our reservation time. The food was delicious. Not the best I've had, but pretty great. We had the lavash pizza appetizer, which I eagerly awaited to compare the lavash pizzas I make at home. No shame in white flagging it, this was definitely the best crisply-roasted thin crust lavash pizza I've eaten. For entrees, my date had the steak, and I had their much-acclaimed almond-crusted trout dish. This is where the experience began to shift from meal-centered to lousy service-centered. My date's steak, which he ordered medium rare, came out very obviously medium well-done. I urged him to politely mention it at the first chance, since I knew he'd be tempted to swallow his complaints out of politeness or whatever. However, our waitress didn't seem to be around for a bit, and our chance to mention it only came when a different unfamiliar male server (or kitchen hand? not sure?) came to ask us how we were doing. My date showed him and he agreed that it was not medium rare at all, and rushed it back to the kitchen for a do-over. We figure they either handed us another table's steak, or our female server wrote it down wrong, or just a simple kitchen error. Anyway, he was back in less than two minutes, with a delicious medium-rare (more rare than medium) cut of steak. Our female server missed the whole episode, because the first time we heard from her after getting our plates was a few minutes after my date had already started upon his new steak. When she asked us how everything was, we just replied, \"great.\" I'm sure somebody told her, but she made no mention of it, and nor did we, no big. Nobody's died of inattentiveness. Both the steak and the trout were delicious, though I would have enjoyed some kind of sauce or moist component to my trout dish. The trout itself was moist, but it was served on just a bed of quinoa, and I found myself dipping in my date's mashed potatoes and sauce once or twice to take away the dryness of my bites. That's just a small detail and personal preference, though.The rest of the night, our server seemed to get more unpleasantly inattentive, and we got a general impression that regulars were much more highly-prized here than new patrons. Her tables on both sides of us seemed to be regulars, and she would chat with them at length. After she cleared our plates, we sat there for a good long while wondering whether we would be offered a dessert menu, or if that would just be forgotten and we'd have the check slapped on our table. At one point when my date went to the restroom, I had the perfect view of the server's nook (behind hostess stand), where our server was drinking a glass of wine. My date suggested that that indicated she was probably off for the night, and our table was just in the middle of the awkward handoff to another server. 5-7 minutes later though, we saw her seat a new table of regulars right next to us, as she opened a bottle for them and chatted amicably. Anyway, eventually someone other than her brought us the dessert menu (might have been the same guy who replaced our steak), and we split the creme brulee. It was a bit deep, with less caramelized surface area than I prefer in the ideal creme brulee, but a good standard version nonetheless.Our female server took our finished dessert plate silently, and gave us the check a minute later with the ever-eloquent, \"and heere's this when you're ready.\"Service sucked, food was generally delicious with a few minor kinks, and overall I would definitely recommend becoming a regular here to enjoy the full potential of the greatness Suze has to offer. Had it not been for the service, which I'm sure we just got unlucky with, I would rate this place a 4 stars."], ["Tucker M.", "Suze is among my favorite restaurants in Dallas. The menu really stands out, and every dish is perfectly executed. Suze has given me some of my favorite salads and the best steak I had in Texas, and overall I think they have some of the area's most interesting dishes. At the price, I can't go often, but when I do, it keeps me happy all week."], ["annette n.", "I have been holding out for some time for my ONE HUNDRETH review...what to do?  A local favorite or something new and exciting?  Well, I finally made my choice, Suze.  Some time ago I went on a little tour of my neighborhood restaurants and had not included Suze, a huge oversight on my part.  So to do my 100th and finish my neighborhood tour, here we go......The hubster and I  were celebrating a milestone anniversary and he surprised me with reservations (old joke:  what do you want for dinner, honey?  Reservations!) to Suze.  We had 6:30 reservations but this little spot was already filling up and we were seated immediately.    I noticed right away that many of the patrons were regulars and one older and very distinguished gentleman held court from his table, greeting friends as they walked in.   Very neighborhood-y!  Suze is in a small but cozy (read shoulder to shoulder with the diner next to you) spot with a nice woody decor which makes the most of the tight space.   After sitting down at our little table for two, we were immediately served a crusty bread with a pesto dipping sauce.  A delicious way to tease the appetite.   For wine, we decided to try a server-recommended pinot noir which was the perfect wine for the meals we chose....The menu is not huge and there are specials every night.   My husband decided on the Spaghetti special but added garlic spinich and baby carrots for his sides.  I chose the Curry Pork Chops with cous-cous and both our choices were excellent!The Pork Chops were center cut and about and inch thick, seriously.  They were crusted slightly from their pan-searing with a lightly flavored curry and a sweet sauce that was the perfect mix of sweet and savory.   The cous-cous was a wonderful base for the chops, fully flavored and not overcooked.   I was going to share the hubb's sides but had no need to do so and I confess, I was so impressed with my chops that I never tasted the spagetti!  He said it was good, though!  We were pondering the desert list (they had an interesting looking huckleberry confection that we were considering...) when our server brought out a little gooey death-by-chocolate thingy with a candle surprising us for our special occasion.   Despite being full, we polished off this perfect topper to a great evening.    The food was a full five stars, interesting combos, perfectly cooked and served.  The atmosphere is another 5 stars.  Cozy, friendly and not over the top trying to impress.  I took a star for \"general\" service.  We had empty plates of food left on our table for longer than necessary and we had to move them around ourselves to make room for other things.  Servers were spending time chatting with \"regulars\" when any one of them could have slipped by and removed our dirty plates or filled our water glasses.  Just a small quibble for an otherwise stellar meal and a happy anniversary!"], ["Kimberly B.", "We ate there for valentines day. Great food! Had the veal chop that was pretty awesome!! Their ahi tuna was fabulous!! They kept bringing out food as part of the special for valentines night. All of the food was really yummy! You can bring wine, but there is a $25 corking fee. Their wine is good and seem to have a pretty good selection. I have been recommending this place to everyone. I can't wait to go back again. Hurry up birthday I'm hungry :) ... Ohhh I wouldn't take small children, but older kids would be fine."], ["Kim P.", "Me and the bf went here last November for our anniversary and I have been wanting to go back ever since. I read the great reviews on Yelp and it definitely lived up to its reputation. The restaurant is tucked in between an Albertson's which gave us a little bit of a \"Are we in the right place?\" feeling. And the restaurant itself is very small. Some might say intimate, but I would have liked to be a little farther away from the table we were seated next to. We made our reservations online and didn't have to wait at all for our table. The olive oil they have to dip the bread in at the beginning of the meal was soooo yummy! It was hard not to fill up on that. We ordered the Kobe beef carpaccio for our appetizer. I enjoyed the salty, oniony taste. The bf ordered lamb chops which he seemed to really enjoy, except for the side dish that came with it (I can't remember what it was), but we both didn't like it. I ordered the almond crusted fish which I had read was good, but I found it rather bleh. It was pretty tasteless. And I didn't like that the skin had been left on the fish. I spent some time peeling it off. So I wouldn't recommend that. For dessert, we shared a creme brulee, which was as good as any other creme brulee I've eaten. Service was great. We seemed to probably be the youngest people in the place, but the place took on a nice quaint feeling as our meal went on. Although I didn't like my entree, I would still want to go back and try their other offerings."], ["Lisa R.", "I've been dying to try this restaurant for years, so decided to take my boyfriend here on Saturday for his birthday dinner. Pulling up, it definitely doesn't look like much sitting in a shopping center with a florist, nail salon, Albertson's, etc... But no worries, the inside is warm and lovely and intimate -- albeit a little small. We had a reservation, so were seated within just a couple minutes in a perfect little corner table. The wines were priced a little high - and I forgot that we could bring our own - but we settled on a lovely Argentinean Malbec and perused the menu. After getting a glimpse at the appetizers at the table next to ours, we decided to start with the Fois Gras. (yeah... we're fancy) Wow. It was deliciously seared and covered with a cherry balsamic sauce that was just heavenly... perhaps a little overpowering for the fois gras' delicate flavor though. We also split a yummy caesar salad and decided on our entrees...I had the almond crusted rainbow trout with artichoke and caper red quinoa -- it was very tasty! The fish was flaky and the quinoa was hearty and delicious. But I have to say that I was suffering from some serious plate envy -- boyfriend ordered the seared filet with garlic whipped potatoes. Oh. My. Goodness. This was the most perfectly cooked melt-in-your-mouth piece of steak I've had in years. It was perfection.  We also had a little birthday espresso creme brulee that was heavenly -- as creme brulee should be. The service was good, but not quite as attentive as I'd hope in a nicer restaurant -- empty plates were left on the table a little long, etc. Otherwise, we really really loved everything about this place. It was cozy and bustling, but not too noisy or crowded. All around a lovely experience, we'll definitely be back."], ["Warren S.", "Great dinner.When my wife and I are driving around doing our \"where should we eat\" back-and-forth, we always remember Suze... too late.  You need to have reservations and we never plan that far ahead.  But when we do, we are always justly rewarded.As for what to eat, take your server's recommendations and go for it.  We've never had a bad meal or dish.  The recommendations to bring your own wine are wisely heeded.  They only charge a corkage fee and that's much better, especially if you're drinking a nice wine."], ["Kathryn E.", "Really quite good food... and you would never expect it given its strip mall locale.  It is at the corner of Midway and NW Highway back in the corner by Albertson's... would never have seen it or known about it if not for Yelp (thanks guys).The food was delicious (some of the juiciest roasted chicken I've ever had at a restaurant), good variety on menu, and very reasonable wine list... it is like THE perfect neighborhood go to dinner place.  Check it out if you haven't.The only negative about the evening is that it was hard to hear at times... must be something about the acoustics of the building or maybe where we were sitting, but between the tables next to us and the background music I was asking \"what?\" a little too often."], ["david h.", "I've been wanting to go here for years and for some reason I always have missed the opportunity. I am glad I got to go and my experience was generally positive. Some of the food was \"best ever\" and some was cause for a good head scratching. Case in point - my entree was a 45 day dry aged ribeye. It was a very small $48 steak (the diner at the next table over got one that was about twice the size of mine). Half the steak was tough and overcooked. Boo! The other half was as good and flavorful a steak as I have ever had. Yay! I had fried green tomatoes as an appetizer. The thing about fried green tomatoes is you have to be careful because if they are served too soon, they can be hard. My first one was perfect texture. Yay! The second and third ones - hard as a rock. Boo! The place is very small and looks like a Turkish hookah parlor. You walk through (literally) curtains covering the glass doors at this strip center location. You walk right through the middle of the dining area to get to the hostess stand. You are packed in pretty tight. The service was fine but nothing special. Our waiter seemed unaffected. We had our two 13 year old daughters with us and he seemed put off that we brought kids. One of the girls asked for ranch dressing on her salad and it came with blue cheese (which is some of the best blue cheese dressing I've ever had btw). Our server actually seemed much more accommodating to the couple sitting next to us. He kept asking them how things were and he never asked us. Maybe he hates kids? They were out of cobbler but only after we ordered it (memo to kitchen staff - when you run out of something, tell your waitstaff). We joked as we were walking up to the restaurant that since they were located next to a large supermarket, we didn't have to worry about them running out of food. Ruh Roh - no such ruck on that front! I substituted the cheese tray for dessert instead and would highly suggest they take it off the menu. The cheeses are mundane at best, the tray is overloaded and the accompanying tortilla chips (tortilla chips on a cheese tray???) were senseless. I would give this place a smiley face and half a star but I would go back with a more discerning attitude."], ["Jaime A.", "The food here is absolutely outstanding! We started with the Kobe Beef Carpaccio and as quickly as it was finished it didn't prepare me enough for the delight that was to come as an entrée. The Cerven Venison blew me away!! For those of you who are find it cruel and intolerable to eat Bambi, you should relax and realize that there isn't exactly a shortage of deer in the world. From the first bite to the last the gala held in the ballroom that is my mouth had ever taste bud doing the Rumba. My dinner companion was equally impressed with her Sayklay Salad. I'll admit it is very hard to see Suze for anything else but its great food. The neighborhood setting makes it feel less like trendy spot and more like a diner on the corner. Once inside though you definitely don't feel like you're in corner diner. The seating is a bit cramped, but if you are that big chances are you're eating at a buffet style cafeteria and not at Suze. Go with a friend, go with a group, but if you go make sure you go with an open mind and open stomach.Happy dining!"], ["Mark W.", "This is my favorite restaurant in Dallas. If I am leaving Dallas tomorrow and never coming back I am eating here tonight!"]], "Asador": [["Peekay K.", "This place is horrible, should have know from the lack of reviews.  Went there for my birthday celebration with 18 ppl.  Had the worse service ever, we spend over $2K in food and drinks.  First off when we got there the waiter didn't even show up to ask us what drinks we wanted till 20 minutes after sitting down.  Then upon receiving our bill the waiter charge us for 14 shots but we only had 13 so we told him about it and he argue with us over one dam shot.  He could have just comp that one shot after we did spend over $2K. We just told him to forget about it.  On top of that they too over 45 minutes to get the taps out to all our guest because they were having issues with thei system.  The Manage name MAX stood there and saw what was going on and never once came over yo apologize.  NEVER AGAIN WILL WE BACK!!!"], ["Leslie K.", "I've stayed at the Renaissance several times for work, and the food here is top notch. I normally wouldn't rec a hotel restaurant, but I'd totally go here on a date.Breakfast: 2 fried eggs over grilled asparagus with house made salsa, bacon bits and parm.  Fresh green juice.  Do it.Dinner: PORK CHOP. the juiciest, most flavorful pork chop to ever cross mah lips. Black rice grits, Swiss chard, wax beans, and bacon lardons that resembled a pair of dice on the craps table in Vegas.  Daaaaaang, son. Bonus: charcuterie bar. Yes."], ["Jules B.", "We had NYE dinner here. Came in expecting an oyster bar and tapas NYE special dinner, but to our disappointment, they decided not to offer this fare. However, the manager immediately came over and talked to us and explained why. He apologized and comped our drinks! Service was great!We ended up ordering the sea bass, flat iron steak, and scallops. The food is very fresh and delicious, nice sized portions, not too small and not too big. 85% of their menu is Farm to Fire concept. Very flavorful with nice presentation. Prices are reasonable, and they offer a wide range of fresh foods, including what looked like a great lunch menu.The hotel/restaurant offers complimentary valet with validation. This is a nice gem of a restaurant located in the Renaissance Hotel in Dallas. Will definitely be back!"], ["Greg P.", "Standard hotel fare... absolutely nothing specialLocated in the Renaissance Dallas Hotel, Asador touts itself as a \"Modern Farm to Fire\" restaurant.  Based on this, I was expecting better than the usual hotel lobby restaurant.  While the physical space is attractive, the food is rather average.To start, I ordered the Granja chopped salad.  It was a little on the skimpy side but did have decent lettuce, overly spicy bacon, olives, cucumber, radish, and egg.  The real problem was the ranch dressing; it was profoundly lemony and runny.  Not the kind of creamy ranch that you would expect down in Texas.For my entree, I had the wood roast flat iron steak.  The meat was good quality, cooked right, and well flavored.  It came with au gratin potatoes stuffed into a hollowed out onion.  The onion was kind of small and there was not much potato inside.  I felt kind of hungry after eating two rolls, the smallish salad, and the steak with a skimpy side of potatoes.I did not try my luck with dessert because nothing about my meal so far suggested it was going to be a special experience.Overall, Asador is just a standard fare hotel restaurant with a fancy name.  If you are stuck with no where else to go, Asador is ok.  If you can go elsewhere, you should be able to get a better meal."], ["Nina D.", "Let's start with the obvious: this is a hotel restaurant.Now that it's out of the way, things can be a little less biased. I totally expected my food to be bland chicken with weird grill marks, but the Asador surprised me.Their thing is local (other than seafood apparently) so their menu changes quite a bit. I'm not sure how true to the concept they stay, but it was there. I wasn't super hungry when I went the first time so I ordered the pork sliders which came with a slightly spicy (think sriracha) slaw, the grilled asparagus, and the macaroni and cheese. I was worried the mac & cheese was going to be soupy (pet peeve), but it wasn't. The cheese was pretty mild, and the pasta was maybe slightly under al dente. It is topped with breadcrumbs and a almost too much very salty ham. The asparagus was just slightly under cooked, which beats over cooked in my book. My partner in crime ordered the steak and loved it. The second time we went, I ordered the chicken fried steak. It might have been the mood I was in, but I personally did not enjoy it. The breading had a weird flour feel. I wanted a salad and the waitered suggested a half order of the pear walnut salad. It was really good. A little heavy on the dressing so maybe consider getting the dressing on the side. But a very good salad. Reordered the mac and cheese because apparently New Year''s resolutions don't stick with me. Also went for the banana not pudding in a jar. It was a pretty small serving if you were thinking of splitting it. It was good, not great. Overall, this is really good for a restaurant in a hotel. The real question is would I want to come back if I was not staying in the Renaissance. I'm not sure."], ["Mary Ann J.", "What a gem of a restaurant.  Four of us who live in Oak Cliff wanted to get away from the crowd in Bishop Arts on a Friday night, and I've had Asador in the back of my mind for awhile.  Wonderful food, wonderful waiter, and for those at the table who are cocktail-adventurous, some interesting and tasty drinks.  PARKING, they have parking!  And best of all, for four friends who don't get together as often as we should, the opportunity to sit and visit without being hovered over because the table needed to be flipped.  All four of this now have Asador on our regular dining list."], ["Beverly K.", "The bar staff was basically nonexistent.  We had to ask to be served and looked around for 10 minutes to settle up. We visit here at least once a qrt. And this was the worst experience we have had. Completely inattentive staff behind the bar. Food was good."], ["Thomas F.", "I would give this place 5 stars (it's 5 stars for most restaurants within a hotel) but the menu is just a tad too limited. All of the food here is very good and the service for dinner at the bar has always been top notch. If you can, eat at the bar; the bartenders are outstanding. Breakfast and lunch are both very good as well. No complaints."], ["Jessica A.", "This place is fantastic.  It really is a 'farm to fire' concept, as they say...everything they serve is locally grown or homemade.  We got the mussels and brussel sprouts with bacon for appetizers, and I ordered the catfish as an entree - something I wouldn't normally go for, but it was delicious with Asian inspired bold flavors.  We went on a Tuesday and the place was pretty empty, but still a great atmosphere.  I took a coworker and some clients.  We were extremely impressed with our server, Allison.  She was very knowledgeable and passionate about the food and menu.  We kept asking her questions just to hear her describe each dish.  We wanted to ask her to sit with us.  Would definitely recommend this place if you're in the area!"], ["N W.", "Thank you again yelp for an amazing find! In town for business staying in the market center area and needed a place for dinner.Wonderfully relaxed atmosphere, amazing service! Allison, our waitress was wonderful. The food was incredible! We had the tenderloin, a flat iron and a pork chop.  All were delicious. The side of Brussels sprouts...yummy! The bread rolls were to die for! Hot, crusty...like biting into air!All around 5 star meal...and yes, in a hotel!"], ["John M.", "Great food and service. Changes all the time and always fresh. Definitely need to go as a local or traveler."], ["Stryceelyn J.", "The service was good here.  However, the food was not impressive.  We attended for a friend's birthday and were underwhelmed.  We tried several entrees and shared to get a broad experience.  The Pork Sliders were the best for me...after several bites they grew on me.  But, generally the dishes were dry.  Sadly, not for me."], ["J F.", "Wow, and I stay at Marriott properties 70 nights a year and never eat hotel.... Till now!!Beer great selection. Cook vibe. Awesome appetizers grilled cheese is phenomenal. Steak was killer and potatoes to die for. Great wine. Awesome service. A real nice place. Not too pricey. We will eat there every time we go. Nice could use a little better selection of Australian wines and California cabs and Zinfandels. Awesome. Keep this chef!!!!"], ["Liz S.", "I tend to stay away from eating in hotels but Asador has changed my mind!With a farm to table approach, Asador serves up a seasonal menu that is always better than expected.  I have been several times for both lunch and dinner and each meal just gets better than the last.The chefs are extremely creative and are not afraid to play with different flavors that may be out of the norm.They always have surprisingly wonderful soups and the desserts are must.The only thing I would change is the service, it is so slow and overall a total bummer.  However, where the service lacks the food makes up for it.Also - do not miss the craft cocktails.  Tyler creates some outrageously delicious drinks that you will not get anywhere else GUARANTEED."], ["Justin R.", "Great burger with excellent flavor.  The fries came with a Spicey ketchup that is house made.  Mine seemed very runny but I could taste the peppery potential.  Just wanted more to stick to the fries. My server was very friendly and arrived with a smile each time.  A manager came by once to check on me and the food.  Gotta give props for the attentiveness.Yeah, it's in a hotel like the other reviewers have said, but way better than your typical Marriott burger."], ["Scott M.", "Because it's tucked away in the lobby of the Renaissance hotel, which is one of my favorite combinations in Dallas of comfort and value, Agador is one of the better kept secrets in town. Stay here at the hotel and there's no need to stray for dinner. Enjoy their excellent wine list, extensive and seasonally changing menu, outstanding farm fresh quality, inventive dishes, and friendly service. You'll be glad you didn't drive elsewhere to spend more for a lesser meal."], ["Bruce T.", "I recently stayed at the Renaissance hotel and this is the restaurant located in the hotel.  It is very nicely done - great decor.   In addition to the dining area there is a bar in the back of the restaurant.    They had a nice IPA on tap and I had that ,some mussels and a jar of home-made pickles.  It was all excellent.  The pickles were in a habanero vinegar which made them sweet and spicy.  It was a great start and was presented in a mason jar.  I will upload a photo.  I ordered the mussels because the night before I sat at the bar and a guy was raving about them.   They were excellent and full of flavor.  They came with bread which I soaked in the juices.   I cant comment on the main entrees, but if the apps are an indication then this place is good. I overhead the bartender talking about their new chef from New Zealand  or maybe it was South Africa (I think).  My take-away was that they were proud of him and that he has a passion for food."], ["Joe D.", "OK Dallas, why aren't you packing this restaurant on a daily basis? Because it is in a hotel? Get over it, quickly!!This restaurant is top notch farm to table (fire in their words)  approach to cooking that is so needed. Starting off with cold martinis was a good start to a fabulous meal. If you go, you have to get the mussels cooked in a fiery broth. Be sure to request extra crostini to savor that wonderful sambal broth. I split the roasted chicken with my colleague and was surprised that it was more than enough to fill the both of us. Half a chicken cooked on their mesquite grill was juicy and crisp on the outside. Accompanying the chicken was the most delicious chorizo sausage in what tasted like a grits based concoction. Mmmm, it went down smooth and quickly. We asked for grilled veggies that were fire cooked and couldn't finish the vast amount they gave us. I was stuffed and so glad I did not let the hotel fear of restaurants keep me away. Kudos to you Asador!!"], ["Jennifer C.", "Texas toast grilled cheese was to die for.  I know it sounds boring---grilled cheese--but this was the best grilled cheese ever."], ["Kelly M.", "Gave this a try after noted as top 10 places to try this season ... Don't!! #1 Rude waiter! He rolled his eyes several times when waiting in us, \"do you have a sommelier\" eye roll ... Had to send back a entree .. Eye roll - asked how the \"corn on the cob\" was prepared he gave a sassy answer and said \"on the cob\" ... No kidding but is it boiled, roasted, street corn?  #2 Not sure they realized they were working in an open kitchen, used hands on most food then touched their face hair etc.. So gross #3 Atmosphere is less than desirable, you felt like you we're eating in a hotel lobby restaurant .. Oh, that's because you are Overall save your time and dine elsewhere"]], "Salum Restaurant": [["Charlynn J.", "This hidden gem is worth visiting. When we turned onto Cole, the strip shopping center threw us off. There's no lighting on the sign and the outside is nondescript. But just like the dark entrance of a diamond mine treasures await inside! We loved there was no wait on a Saturday night. I'd checked out the menu and knew the Texas Goat Cheese with elephant garlic would be orders as soon as we sat down. We also had the Caprese Salad. Of the two the goat cheese was the star. The Caprese is standard, nothing new or unusual. I chose the pepper crusted tenderloin with pâté my companion the lamb.  Having had steak at some of the best known restaurants in town I feel confident to say THIS is a contender!! The lamb was a good choice but was second to the tenderloin. We weren't in the mood for Apple Crisp (suffering through an El Niño October ) so we chose the gelato. They make a good decision to serve Pacciugo! Our waiter was knowledgable, friendly and patient. It was a great experience and I'll defiantly be back!!"], ["Tony V.", "Went last night with friends. Given I had never heard of the place I was a little apprehensive. The dining room is inviting refined and the open kitchen was a good conversation piece for the guys. We had the Texas goat cheese and elephant garlic which was very good. Tuna carpaccio was nice however didn't appreciate the sorbet in the phillo birds nest. The men ordered the tenderloin with Gruyere gratin which was incredible. It amazes me how high end restaurants have a difficult time making a perfect medium rare thick steak but they delivered here. The rack of lamb with mushroom bread pudding was extremely satisfying. Overall a gem of a place. Certainly others thought the same as the valet lot was full of respectable cars."], ["Lisa J.", "Lovely spot tucked away in a semi-strip mall. It's a really nice restaurant with great ambiance and delicious desserts! We called ahead on our way home from the symphony and they agreed to stay open late for us! We had great wine and treats! Perfect for a date night!!!"], ["Arthur D.", "Good creative cuisine that is fresh, light, balanced and satisfying. The service is good and the business model makes having a dinner at Salum more of a commitment that one is happy to make. I give Salum my highest recommendations."], ["Heather B.", "The bartenders here are absolutely awesome and knowledgeable. Get away from the hustle and bustle of West Village. I had a foie Gras appetizer with a strawberry/ balsamic glaze. Enjoyed the pairing immensely. I also ordered the lamb chops because I was hungry for lamb chops. It was crusted and maybe cooked a little too well but flavorful. It was over a mushroom type of starchy side that was very flavorful. Overall I enjoyed the place. They were so friendly."], ["James O.", "I try and update a review of a restaurant once a year, but I've found very little to change!Salum still remains the number 1 restaurant in Dallas (in my opinion).  Wonderful cooking by Abraham, with expertly trained staff, leave this as the ultimate experience in Dallas.  I would really encourage a visit, as this is the only restaurant that I know that operates as a top notch establishment. With new menu's month, Salum really takes its food and dining experience seriously."], ["Paul D.", "I went to Salum for an event.  I really like the open kitchen feel of the restaurant.  I like to be able to look in and see my food being prepared.  It is also comforting to see how clean and organized the kitchen is.  The horderves we very good, especially the fried green tomatoes.  There was a nice, crunchy, light crust on the outside with a very strong flavorful center.  They were topped with this sort of red pepper soup sauce that really added to the dish.The entree was a bit of a miss.  I ordered the barramundi.  It was undercooked.  When the chef saw me looking around, he came over.  He immediately saw that it was undercooked and took the fish away.  It was good service from him.  I requested the tenderloin (medium rare) as a replacement.  Very soon after, I received the tenderloin.  Unfortunately, it had not had enough time to be cooked to medium rare.  It was really very rare.  However, it was an excellent cut of meat and I did not want to send back a second dish.  So, I went ahead and ate it.  It was still good, even for being too rare.The highlight of the meal was actually the mashed potatoes, topped with toasted macadamia nuts.  I had never had this combination before or even thought of putting these things together.  These two ingredients work perfectly with each other.  I would definitely order this side dish again.Dessert was a trio of fruit and berry crisp, bread pudding, and a chocolate thing.  All three were very good, although I preferred the bread pudding over the other two.I struggle giving Salum 3 stars because I suspect that my experience with the entree was a result of the kitchen struggling to get a large number of entrees out at the same time.  I think that this sort of issue is probably uncommon at a regular dinner service.  And the rest of the meal was very very good.  Still, I think three stars is generous for having received two undercooked entrees.PS.  I love the bar.  I'm a beer drinker.  Often times, higher class restaurants like this favor mixed drinks and neglect to have a decent beer selection.  Salum features a number of local craft beers, which is really very important for pairing with a number of the items on their menu.  Specifically, I appreciate the inclusion of the Lakewood Temptress."], ["Carolyn H.", "So....my third-- and probably last-- visit to Salum left my companion and I utterly underwhelmed.  His barramundi lay atop the most overcooked and flavorless potatoes I think I can remember having.  He ate them only because our wait for the table bread had been so long that he was still starving.  The fish itself was good, with an interesting pesto-like spread atop, but the flavor didn't extend beyond the skin so the fish itself was somewhat bland. My chicken was good. Not great.  The sauce was tasty, but completely overpowered the corn pudding and dominated the entire meal.  The bread came with a nice variety, but only the black olive bread lent some interest and flavor to the assortment.  Even the butter seemed flavorless.I like Salum's open-spaced, yet fine-dining feel.  And I like the concept of a limited but changing menu.  But is it too much to expect the food to be good, too?"], ["Yelp U.", "Been there before and was planning to take my tennis group there regularly/weekly. However, last Friday the experience wasn't all that great when I took a friend there for birthday. +: mussels, serrano salad, lamb chop-: lamb patties are terrible, too much flour, neither my friend nor I could finish it, it tasted terrible. Wish we told them lamb chops only.-: the sauce for the lamb dish tastes awful. my friend and i had to ask them to change plate to get it off our plates... it tasted like the worst kind of soy sauce, yet they told me it has wine, etc. really? you must be kidding! yuk!-: raining that night, when we got out waiting for valet, the valet guy took forever for the party before us, took great care of them. However, when my friend asked for his car key, the valet guy just handed the key, that was it! terrible customer service, is this some kind of discrimination on service because we are not your typical good-looking white caucasians? I don't know what it was. we were not treated the same at valet. the valet guy did NOTHING, absolutely NOTHING, did not walk us to our car, did not cover us with umbrella. earlier, he did all of that and more for the other party. Finally, I asked the valet guy if he would provide service. This is just plain outrageous! Don't expect me to take my group there, not the tennis group, not my foodie group, either!"], ["Miles M.", "I kind of feel mixed up with this restaurant.  While in many ways i felt that it was 5 stars, there were so many other things that just held it back.  Let's explore those reasons down below and also highlight the areas they excelled at.We should just go ahead and get the food out of they way, that's really why we came here isn't it?  I found the salmon excellent and even the muscles.  I order the venison cooked rare.  I found it to be tough/chewy and the sauce to overpower the flavor.  Not really impressed by the main course.So i thought the layout was pretty good, not overcrowded and absolutely loved the open kitchen look.  The bar area was really a disappointment.  You had a small area to catch a few drinks, but behind it was a mix of liquor and coffee machines.  Clean that up and have a real bar.  Also on both sides it was about the same, liquor bottles and glasses on the shelves, one or the other!The staff was excellent and nothing but good things about them.  Oh, i didn't really look in the wine room, but they have one.  Not to mention i was told they had a great selection of wines."], ["Wendy L.", "This restaurant came highly recommended so maybe my expectations were too high but I left very disappointed. We ordered off of the restaurant week menu, and it wasn't a very good showing of what they offered. The appetizer was great, no complaints there. Both my husbands entree and mine were not good at all. I ordered the cod and it had a strong fishy taste, not fresh. My husband got the pork. The meat was not tender and a strange cut of meat. Dessert was tiny, all of the plates were actually. The bread pudding was awesome but the mousse was the worst I've had. This is our 6th year of sampling restaurant week restaurants and this for us was the worst food. The service and ambiance was great but not worth the price."], ["Sandor K.", "Probably one of my favorite places to go for a special occasion!  Salum offers one of the finest dining experiences you can possibly imagine.    The food is delicate and tasty and the service is always outstanding.    The stuffed flounder is one of  my favorites but I also love the scallops.  Everything is always perfectly cooked and presented beautifully.  The new addition of a pastry chef is fantastic!!  The mango soufflé and coco ice-cream was just incredible!"], ["Amanda B.", "DONT ORDER THE SCALLOPS! They sound amazing on the menu, but you're only getting three medium sized scallops for 30 dollars. THREE scallops for 30 dollars!! That's ten dollars a scallop. And these are not giant scallops, friends. They're probably wholefoods scallops. This dish should be listed as an appetizer not an entree.I left hungry and deceived!"], ["Leopard L.", "This place was just wonderful.The atmosphere is great and the service was warm and allowing.I had an amazing Buffalo steak with sweet mash potato and it was to die for!Hubby had a roasted chicken...not sure what it was called.... but he says it's worth going back just for that!A+ and double thumbs up!"], ["Joseph B.", "the largest pro and con of salum is the ever changing monthly menu.  We went with some good friends of ours, who go very often, for one's birthday recently.  everything we ate was great (lamb and cassoulet).  Full disclosure, i've been before and not been overwhelmed by what i've had.  there are many places in dallas that i've been to enough times to know what i'm going to order when i go there and they are consistent enough so that i know how good it will be when i do get it.  What i love about salum is that i never know what i'm gonna get and if i don't love the options, the lamb will be there, as always.  The gambler in me loves the fact that i may hate it, but i will probably love it.  I wholeheartedly believe that anyone eating there needs to understand that there is risk involved.  if i go to a restaurant with a static menu, i expect them to have perfected every item.  I still expect a high level of quality from Abraham (owner/chef), but when i'm disappointed, it's within a reasonable margin.  Abraham was more than generous, sending two appetizers (goat cheese and garlic plus mushroom terrine) and two desserts (chocolate terrine and apple crumble) to our table, all of which were awesome.  I've been a regular at many places, some who do things like this and some who don't.  it doesn't make or break my decisions, but i prefer being generous to people who are generous."], ["Holly E.", "I'm mad at myself for waiting so long to try this restaurant. It's wonderful. Kristen was my server and she was amazing. Don't be deceived by the strip mall where it is located. Once you enter, you're transformed into a soothing, elegant environment. Even the music was at a proper level and not annoying. The wine list is well thought out with something for every budget. I started with the seared foie gras with corn fritter. Yum! Then followed with the lobster with tomatoes and basil. Absolutely fantastic. My handsome date had Mahi Mahi that had a Mexican flair. Very delicious and fresh. Everyone raves about the bread pudding so we had to try. I'm sorry to report it was not the best. But, it was good. (I'm just spoiled because I spend too much time in Nola.)Overall, excellent experience. I feel this is one of the top restaurants in Dallas."], ["Claire G.", "I love this restaurant - where else can you go in Dallas and find a peaceful , calm atmosphere, great food AND tablecloths, all reasonably priced! The best kept lunch place in town, as well as great for dinner."], ["Arash M.", "We did Salum for Restuarant Week. The RW menu had an awesome mixture of dishes that were actually on the standard menu. The quality of the food was excellent. Great flavors, simple presentations. I got the Sea Bass with Red Cabbage and it was fantastic. no complaints from our entire table. The focus really is on ingredients and clean flavors.The staff was great, they accommodated my newly formed egg allergy by bringing me a second berry tart in place of ice cream."], ["EL S.", "This is not dining, it is an experience.  I frequent this one and typically have the same dish because it's that good.  I enjoy restaurants with quite spots that allow for a little entertaining here and there as well.  This is that place."], ["Ron M.", "Better places than this are available.We tried Salum because friends raved about it and the rack of Lamb.The lighting is good but the restaurant is a big open room with tables too close together. Private conversations are not private or romantic.Service was slow and the rack of lamb that is a specialty was over cooked to the point of no flavor.Overall not a memorable experience and other restaurants such as Capital Grill or Al Biernats give larger lamb portions and are prepared better."], ["Merlinda I.", "A guest review starring...drumroll please... my very best friend in the world, Michelle! (She is too cool to yelp herself but has taken a keen interest in my yelping and wants to do all she can to help. In her words \"these were my notes...yes, I was looking around note taking at the end of dinner... just for you. I'm such a loser. I'm hanging my head in shame realizing how big of a loser I am.\" Hahaha. Hopefully she will one day join me and for now.. enjoy her 4.5 star review and pictures I added. 4.5 stars because \"the food was so, so good (beef tenderloin that she split) - but I just love bread pudding and that display of baked bread delight was not good.\")Unique light fixtures, romantic lighting, white tablecloth, candlelight, big portions, enough for girls to split, drinks strong, not a lot of seating make reservation, kitchen is open for public viewing, intimate setting, booths on one side, Art Deco brown wood chairs, 20 tables, don't let location on shopping strip fool you, decent wine list, very small bar, bread pudding dessert was ok/meh, J. got the scallops and said they were amazing, C. got the lamb and it was such a large portion/he devoured it/from what I could see it was cooked perfectly medium rare."], ["Sarah C.", "Very nice appearance and atmosphere. If we ever go back, it would be to get two caprese salads at the bar and that would be it. The caprese was amazing! Hit the spot! Everything else we had was mediocre and the service (grant it we were there towards the end of the evening) was not impressive. The kitchen is in the open so it's nice to see that your food isn't sitting under heat lamps."], ["Margo H.", "Love this place. I remember when Abraham was at Parigis . Food great. Atmosphere great Service great."], ["Jennifer S.", "Oh how I love this place!  It truly is a hidden gem...tucked away in an unassuming corner of Fitzhugh and Cole.  I have been twice for lunch and have not been disappointed either time.  The decor is classy, the service is impeccable, and the food is beautifully presented and wonderfully flavorful.  I tried the grilled shrimp with lettuce, strawberries and beet vinaigrette and then our party shared three desserts which were totally sinful (creme brulee with Godiva, bread pudding and chocolate/caramel tart).  Can't wait to come back for dinner next time!"], ["Lawrence J.", "Wonderful food (beef tenderloin and lamb chops), great wine/wine recommendations made for a terrific 45th anniversary celebration."], ["lisa s.", "I love this place so much.  Always fantastic service and delicious food.  I almost always get the fish special, but do enjoy the lamb chops as well.  Seasonal salads are always so good too!  Definitely one of all-time Dallas favorites.  The price point is very reasonable too and love that Abraham Salum personally answered the phone and took my reservation for my last visit."], ["Ted W.", "Bullet-point review here folks:- Food = yummy, hot, fresh, tasty -  4/5 stars.  -Ambiance/atmosphere = crowded, noisy, cramped, hot.   Busy place with people packed in.  Not much to look at except for the open-concept kitchen which is quite neat if you get a seat nearby.  There were some hot trophy-wifes/dates at other tables so not all bad.  3/5 stars-Service = professional, attentive, prompt and courteous.  Our waiter did a great job explaining the menu, suggesting dishes/sides/wines and being helpful.  4/5 stars-Price-to-Performance:  3/5 stars.   The decor/noise really was a turn-off.  For my entree, I had a filet which was very good but I've had similar quality (and better) from local markets.   Paying 40+ should taste like it.I'll go back however - I'm just not making any reservations as of yet"], ["Kelly T.", "Returned here for dinner after having been to it more than a year ago.  We started with pate, white asparagus with burrata salad and feta with roasted garlic.  The salad was surprising very bland- it lacked salt and acid.  The other two dishes were very nice though especially the feta.  For mains, my friend had the perch which was also kind of bland to me, but he enjoyed it.  I had the lobster with white beans and hubby had the filet.  The steak was perfectly done and the potato gratin was very yummy.  My lobster dish was very flavorful, but it came with a ton of beans and not much else.  It could have used something crunchy in texture or at least some veggies.  For dessert, we had bread pudding and berry cobbler.  Both were very yummy and was big enough for 2 to share.  A few dishes didn't quite hit the mark but it was a great meal overall and service was good.  Tip:  There's no cocktail menu there which is a little odd."], ["Andrew Y.", "Client lunch today - one of the best Cubano sandwiches I've ever had.  Superb house salad.  Coming back soon!"], ["tana h.", "The food was delicious with an entertaining atmosphere."], ["J L.", "Excellent meal from beginning to end. Chef recommended the oxtail and it was literally falling off the bone. Foie gras and escargot were superb."], ["Coco L.", "Oh, so disappointing.  It's not that it was bad -- it just wasn't spectacular.  At this price point, I'd expect nothing less than spectacular.The only 'spectacular' dish was the mussels with pommes frites.  This was  a five-star dish. I love mussels in general, and think it's a hard dish to mess up (conversely, it's also a hard dish to really make a stand-out dish).  However - this was an exceptional rendition.  Lots of depth of flavor; frites are perfectly fried and garlic aioli was just mmm mmm good.Everything else was...good enough, but not spectacular.Appetizers (aside from the mussels):  country pate, foie gras with apple tart, and the Texas goat cheese.  Country pate was respectable. Foie gras itself was good but oddly paired with the apple tart.  The sweetness of the tart overwhelmed the foie.  Texas goat cheese tasted like goat cheese.  Again, not bad, but nothing out of the ordinary.Rack of lamb with dijon truffle crust, mushroom bread pudding:  the lamb was perfectly cooked but flavors were just A-OK. Nothing spectacular. I didn't get much truffle flavor.  The mushroom bread pudding was...odd.  Sort of like an overly soggy, overly salted stuffing.Grilled swordfish with green lentil and chorizo stew and watercress and blood orange salad:  Meh.  Swordfish was okay but lacked a nice crust.  The combination of all the components didn't make sense to me -- green lentil stew was very earthy while watercress/blood orange were aiming to be light and ethereal.  Felt like a schizophrenic dish.Others got the seared scallops and grilled beef tenderloin - again, respectable but nothing special.I'd come back for the mussels.  Otherwise I'd save my pennies to go elsewhere."], ["Aman S.", "This is pretty cool place with a good vibe and ambience.  I had a steak which we cooked to perfection."], ["Erika D.", "This is one of our favorite restaurants in Dallas.  The food, service, and ambiance is always perfect!  The menu changes but they usually always have the Texas goat cheese appetizer.  The goat cheese and garlic cloves are baked then drizzled with warm olive oil and served with bread.  It might sound simple but it's very yummy.  The soup of the day is ALWAYS delicious!  For the entree you really can't go wrong.  The kitchen is open to the dining area so it's fun to see the chefs at work.  You can really feel the love they have for what they do which makes the experience that much more enjoyable."], ["Jessica D.", "Came here for dinner finally after hearing great things....all in all had a nice dinner out, but lord, if I never have to taste a lick of butter, let alone the coagulated mass of butter and yolk known as bearnaise, ever again, it'll be far too soon. AMBIANCE: Pretty much everyone else in the room had at least 3 decades on us. Well-lit, classy dining room, with an open chef's kitchen, which is very neat since I don't see that often. FOOD: Watermelon starter salad is deliciously fresh, and soup of the day was tasty. - My date had the steak tenderloin (with mushroom risotto and bearnaise), and I had the scallops. I had 3-4 bites of the steak, and from first to last could not overcome the awful metallic, yolky, buttery bearnaise sauce...its suffocating richness infected every bite. Got on the mushroom risotto too, but a small salvaged bite of that was nice. My date was pretty unenthusiastic about it as well, and left quite a bit. - My scallops were cooked deliciously though, and the portion was very large - 3 scallops so sizeable I couldn't even finish. I probably couuuuld have finished, but it was paired with some sort of sweet almond sauce that got too rich and cloying about 2/3 of the way through, and the rich buttery flavor of the scallops became too much as well.We concluded that, were we individuals with a taste for butter and a scorn for subtlety or longevity, we could definitely see the allure of this fine dining experience. Except that awful bearnaise sauce, I have to hope and pray that ours was a fluke. 'Twas a great night out though, and all of the food was masterfully served."], ["Sarah T.", "One of my favorite restaurants in Dallas.  Fantastic mussels and short ribs.  Great wine selection and server knowledge.  Service is always fast as well."], ["Mark C.", "Salum's is always the best food ever!  I've never had a better steak than here. The menu changes monthly so it's always fresh and new. Love Abraham!"], ["Myia B.", "Intimate dinner date with the hubs.  The atmosphere and vibe is just that - romantic.  Fellow yelper Jessica D was spot on - the crowd is mostly older, but no worries.  Pork Entree was good.  Creme Brulee was good.  Go for it during KRLDRW."], ["Adam W.", "Had a great time at Salum with friends last weekend - ended up being the last table to leave, so hopefully the staff wasn't too upset with all the fun we had... Started the night off with a fantastic dirty martini - the bartender is very good, as most of our 10 person party had cocktails and all very much enjoyed them...Once we sat down, a number of appetizers were ordered: Pate, Goat Cheese & Garlic, Scallop Carpaccio and the Mussels - I can only attest to the final three, and each was excellent... The broth used from the Mussels was spectacular as everyone was dipping their bread in it before we would let our server take the plate away, ha...I had watercress, strawberry and haloumi cheese salad which was quite good - the cheese was grilled and salty, and offered a nice contrast to the strawberries.For dinner, I had pecorino pierogies and cajun shrimp which was the clear highlight of the dish - the pierogies looked more like large raviolis but the taste was excellent highlighted by a spicy sauce over the shrimp as well.Everyone seemed to enjoy their dishes and I sampled the pork & beef tenderloins which were both quite good.  Overall, it was an excellent meal - the only complaint was that valet was required for a parking lot that was immediately outside of the restaurant (they didn't even have to pull the vehicles up when we left they were that close), but I've heard this is a recently new requirement with the addition of the new restaurant next door."], ["Temple S.", "delicious mussels"], ["James S.", "Visit Salum once a year (should be more) and always love the food decor and service. One of Dallas' hidden jewels."], ["Ashley F.", "*RW 2010 Review*Great overall dining experience.To start off on the right foot, I decided to show up 2 hours early for our reservation - not on purpose, just because I'm a moron.  But no worries!  Abraham (Salum) greeted us like we had arrived on time, and showed us to our table.  Our waitress informed us that as part of RW Preview weekend, the 3 course meal was $42/person and \"included\" a specialty cocktail.  No matter - sign us up!  The cocktail was marginally good, but too sweet and pineapply for my taste.  The food was excellent.  Surprisingly, I wasn't a huge fan of the mussel broth.  I prefer a wine base rather than a beer base that tends to be almost bitter.  The seafood pasta was super delicious, and the dessert trio was to-die-for, but I'm ashamed to say I couldn't finish it all.  It couldn't it have been due the bottle of wine I split with my girlfriend.... pffft.The ambiance is super fresh and sleek and exudes a sort of casual, understated posh vibe.  It's a fairly young crowd (a nice change from dinner at Bijoux the night before).  It walks that fine line between fancy and comfortable quite well.We blew the whole $42/person out of the water with all the wine, but I'm pretty sure that's the whole game, so Salum, congrats on your W.  No hard feelings, though... we'd do it again in a heartbeat.  This place has a great combination of relaxed yet upscale feel and darn good food."], ["Margie A.", "As far as I'm concerned, it's just another average over priced restaurant.  I gave it a 3 because our adult children liked their entrees.  The lobster tail and cobia were prepared well according to them, but the Drum should be taken off the menu.  My first whiff of the seafood left me guessing about the quality and after tasting it confirmed my thoughts.  To be blunt, it was awful.  Perhaps the chef could learn how to blend the fish with a sauce.  The garbanzo bean vegetable fritter and watermelon vinaigrette(dried piece of something) did not get the job done.  Only made it worse.  I really think there are better restaurants in the area in this price range.  However, the service is friendly although we waited close to a half hour for entrees and the 2 salads we ordered were fine.  I still think it is pricy for what you get. Our mistake was not to bring this to the owners attention.  My hunch is they would have tried to make it right.  But my husband and I will not be returning.  Too many other better choices."], ["Allison L.", "RW WEEK 2011 HOMESKILLETS! Yep. I'm going all 5 stars on this bizzle. From the time I walked in from the time I left....I had absolutely nothing to complain about and neither did my dining companion. I was early for my reservs so I plopped down at the bar and had myself a drink and schmoozed with the bartender, who was so friendly and commented on my bag (thanks sweets!). When my friend arrived she joined me in a beverage. A few minutes later we were escorted to our lovely lil two person table. Our waitress approached and told us how happy she was we were there for RW. We perused the menu and ordered a nice bottle of wine and relaxed. When we finally ordered, I started with the baked goat cheese with roasted elephant garlic. I'm not kidding, I could have stuck my face in that crack. The cheese was warm and soft and it was served with little crostini's for a lovely schmear. For my next course I chose the escarole, brie and walnut stuffed quail with a red bean and rice croquette. I don't know what they did to ANYTHING on that plate, but I dare anyone else in the city to make it as good as that. The little croquette was a little crunchy and went perfectly with the stuffed quail. Flavors were out of this world, I literally had to force myself to stop eating. My friend had the swordfish to which she just kept going \"mmm, oooh, delicious\". Good report! For dessert it was a two-fer. Bourbon bread pudding & and apple berry crisp with ice cream. Stop. This restaurant is a lot bigger on the inside than it looks from that little strip center on the outside. Big fabulous open kitchen and the tables are spaced perfectly. Service was spot on and the food....well I already went over that. Salum has definitely recruited a repeat customer. Must get that goat cheese recipe."], ["Cordey L.", "One of the most consistent dining experiences available. Trademarks: quality, service, variety, excellent food. It's truly the cheers of society dallas that prefers to dine sans ego. Love everything about this establishment!"], ["Dahvie J.", "I'm finally beginning to discover the restaurant/food scene here in Dallas that the texans are so proud of! Just when I was beginning to think that highly esteemed Dallas restaurants were just one big consortium of steak houses, I find salum. The food was creative, flavorful, and fun to eat! Mussels with towering pomme frites. Wow, Delicious! And who needs olive oil for their bread, when the bread baked with olives, and served warm, at salum just melts on the palate.Plus...the meal was very affordable!BIG croutons to Salum!And in case you are wondering why a 4, and not a 5....I would probably reduce this decision down to location. Salum actually has a very romantic ambiance that is great for dining. A very smart use of the space. However, it is located in what looks like a sort of mini strip mall that is a little uninviting. Not insurmountable, but may cause some aspect of a pause to newcomers. I would suggest outside tables with lamps, etc in order to visually declare the exterior of the place as more of a place that is suited for dining. Who knows they may already do this in summer."], ["Melvin S.", "Restaurant week: braised pork shin with garlic mashed potatoes. The best ever!"], ["Lindsay S.", "Salum is a gem.The location is a bit bizarre next to mixed martial arts studio but inside it was a small restaurant bustling with energy.  I almost forgot I was in a strip mall.  Appetizers: Fried Crawfish Stuffed Piquillo Pepper was great.  It was tasty and quite a large portion. Beautifully presented.Baked Goat Cheese with Roasted Elephant Garlic was also fantastic.  The two flavors merged perfectly and was plenty to share.Main course:Fettuccine with Sautéed Shrimp - My husband loved it.  It was incredibly simple, but he thought the flavor was great.Brie stuffed Quail - Tasty but unwieldy.  The presentation was good, but it was just a bit much to take on.  There was no easy way to cut it and it was just oozing stuffing.  I probably wouldn't order it again.Dessert:The bread pudding was amazing. The server was great too.  She was knowledgeable about the menu and was available without being overbearing.  I will definitely be back.  Such a fun place."], ["Kathleen B.", "Our friends had been her before and suggested it for a Friday night out. We made reservations for 6:30 on a Friday and we were the 2nd ones there.  It has white table cloths and was a really welcoming atmosphere. Everyone was very friendly. They had a nice wine selection. We started out by splitting the house salad that was wonderful and plenty for 2. The menu changes every month except for the signature dish, the Rack of Lamb. Since it's on the menu every month, I had to order it.  It was delicious! Beautifully presented and just fabulous. The mushroom bread pudding was also wonderful and it came with a medley of vegetables. The lamb, medium rare was perfect and plenty of food. My husband had the Sea Bass. He said it was good, but not outstanding. Another person ordered the steak and that was really good also. If you like lamb, hands down order the lamb, you won't be disappointed. We then ordered 2 desserts, the chocolate and the berry cobbler. I'm a chocoholic and love everything chocolate, but tonight I actually favored the berry cobbler over the chocolate. It was served warm and was really yummy and I will order that next time. The acoustics were really good, carpet on the floor and a ceiling. We were able to easily hear each other and have a nice conversation during the dinner. The is something that I really value, as so many places are so loud you can't even carry on a conversation during dinner.  The owner came by after our meal to get our feedback. They did not rush us and it was not over crowded. We will definitely be back and I would recommend that you try it and get the lamb!"], ["Javier O.", "Our food was good, but out service was fantastic (and I'm a harsh critic on service). My opinion is that good service is service that doesn't detract from your enjoyment of your meal; great service adds to it. You waiter makes you feel welcome and seems happy to serve you, even if you are the last table dining. He or she treats his or her job like a craft and excels at it. This is what we got at Salum, and from reading other reviews, it does not sound like an anomaly.The food is very good, but I don't believe it is worthy of its price tag. For the price, I would expect every bite to blow me away, and frankly, it came up short. I think if the prices were a little lower, or the food were a little better, I'd give this place 5 stars. Some notes:1. The entree menu changes every month, so whatever anybody recommends in their reviews probably won't help you decide what to try (save the lamb, which is apparently their one constant). 2. Complimentary valet parking.3. It might be a little loud for a romantic/intimate dinner, but that makes it a great place to go with several people. 4. Their espresso was very good."], ["Helen W.", "Went to Salum with a girlfriend to catch up on life and enjoy a nice evening out.   We started with drinks at the very small bar - but the service was wonderful and attentive.  We followed drinks with a light dinner and were quite impressed.  The food and service were both excellent.   Great evening.Recommend the Texas Goat Cheese with Roasted Garlic and the Stuffed Okra - both were delicious and well-proportioned.  As noted on yelp, \"Yay, I'm a fan!\"."], ["Kathryn E.", "Wow!  How have I missed this place in Dallas?  Somehow it just didn't end up on my radar until recently but it immediately joined the few places that make it into the permanent rotation schedule.The decor is sleek yet warm, and the atmosphere is conducive to great conversation without having to yell over blaring music and other patrons... my fave kind of place for a date or a girl's night out with the intention of actually talking!We started by sharing the empanadas which were nicely spicy with a great sauce.  Followed by the ceasar salad which has white anchovies on it - a favorite of mine!  My date had the serrano caprese... awesomeness on a plate!  Perfectly fresh end of summer tomatoes, serrano ham, mozzarella - delish!  I had the scallops with chanterelles  for the entree and the wonderful mushrooms alone would be worth ordering it again.  My companion got the lamb which was also perfectly cooked and quite good, but more of a winter dish in my mind as it is a little heavy (but you know, men...red meat... whatever).The service was unobtrusive but attentive, and the entire evening was enjoyable and unrushed.  This place is truly a Dallas must-do with none of the pretentiousness of others in its class."], ["Jessica N.", "I want to give this place more than 3 stars, but I was expecting a bit more \"bang\" for my buck. My boyfriend and I decided to try this place out for our 2 year anniversary. We made it in a littler earlier than our 9:00 reservations so we decided to sit at the bar and have a drink while we waited for our table. First impression was how \"open\" the restaurant is - you can even see into the kitchen. What I didn't like was how noisy it was. I was expecting it to be noisy based on the other reviews, but I suppose I was hoping it would be LESS noisy - definitely not intimate dining. We were brought from the bar to our table by the owner, which I thought was totally cool. I noticed he made his rounds, checking on tables - he even brought a lit birthday cake to our neighboring table. It's not often you see head chef/owners who are so involved with their clientele - kudos to Mr. Salum. Here's the rundown of the meal: Appetizer: Goat Cheese and Garlic w/Bread - This was a nice dish...flavors went well very together Salad: We both had Cesar salad which I was not to impressed with. The Parmesan cheese was fried into a flat block and laid over the romaine, which I didn't care for. Also, not like I am finicky when it comes to anchovies, but I really do prefer them chopped onto my salad...the single dude hanging out amongst the greens just didn't do it for me. Entrees: He had the duck - can't comment on it, but he liked it. I went with the scallops which were the best part of my meal. Dessert: We split the creme brulee - nothing special As much as I wanted to like Salum, I probably won't be back. For what we paid I would rather dine somewhere that I found more enjoyable or try a new dining experience in Dallas since there are so many other options. P.S. I totally did not know the correct pronunciation of the restaurant so I sheepishly asked our waitress (who was very nice by the way) and for those of you wondering it's pronounced just like \"Saloon\" only with an \"m\" ^.^"], ["Maud S.", "My husband and I read the glowing review in Dallas Morning News and decided to try it out.  It's a very interesting dining room with spectacular lights that Chef Abrams told us changes colors with the season. Great idea.  We had a very nice visit with the chef  who told us he also owns the Mexican restaurant next door and told us they have wonderful brunches there, something we will try for sure.Our meal was very nice except for way to much food.  My husband had the mussels and I had their special Beignets Foie Gras.  I had expected regular Foie Gras, but after a few bites decided this was a nice change.  I ordered the beef cheeks and they were nice to let me change from the beans to the mashed potatoes to go with it.Again, for me to much food, I absolutely hate to leave food on my plate but could not eat more than half of it.  My husband had the lamb, cooked just the way he likes it, so rear to get it medium, I know most chefs like to serve it slightly on the rare side.  It was very good.  We would have loved to have some dessert but we were so full. Maybe next time we order lighter starters so we can try the desserts.  Are looking forward to going back there.Our server was wonderful, we told her we like time between the courses and she did perfect.  We also had a great bottle of Zinfandel."], ["James V.", "I almost took a star off this place because of the shocking 2 star reviews!! Could those be true!!??  Truely shocking for this fine establishment, but then again, I've gotten bad service at the French Room (JUST KIDDING!!!).Perhaps it's because we have to eat so early we always get great service . . not our choice really, but when you have a 4-year-old, dinner at 8:00 really isn't a good idea! \"Get a babysitter\" you may say. NEVER!  Our kid comes with us everywhere, and as soon as he can type, he'll be Yelping! He has quite a bit to say!Tonight he started with the mussles.  It's on the starters list, but I promise you, it's an entree. The waiter was very sensitive about the very hot plate and brought a nice cool one for me to plate my kid's appetizer. I was able to taste one, maybe two, and they were terrific!! They're steamed in some kind of beer and just really really good!  HE DRANK THE JUICE FROM THE BOWL!!  That's extremely good!I had the cesar, and it's better than any around . . .Sorry Parigi my love! I didn't have to ask for the anchovy! Hubby had . . not sure . . . some salad . . he ate it all.For my main course, I had the filet, chimichurry-style. I like my steak medium-rare, but whenever I order it that way, it comes out rare. So I ordered this one medium . . . it came out medium. Oh well! Didn't really matter, it was delicious. The chimichurry sauce was a little heavy for me, but that's just me. Lots of garlic, which I love.  For the kid, I ordered the same dish without the chimichurry sauce. In addition, the pomme frites which come with the mussles, I had them bring those with his steak. Perfect combo!! They should have it listed on the menu!!  We both had a five-star dinner!  Unlike some other's experience, these pomme frites were crispy and done just perfectly! Wonderful flavor! Hubby ordered the pork tenderloin. I had considred that for a brief moment, but I never order something I make at home all the time. It looked great and I noticed his plate was empty as well.If you want to come here with your kid, come early. NO HIGH CHAIRS!  Our kid isn't in a high chair anymore, and we almost never came here because of that when he need one, but we did come once in a while because it's so good! After about 7:00, the crowd will look down their nose at you if you have a kid. That's just the way this place is. The staff and owner welcome you with your kid anyway, but there is some late-night attitude with the patrons. I get it, really I do!Another 5 star dinner Abraham!"], ["Xiadix G.", "I struggled with rating this a 4 or a 5.  I decided to bump them up because of how they handled my wife's gluten allergy (See the end).Website:  The website was nice.  There was a bit of unneeded flash and music that restaurants are suckered into, but not overly intrusive.  I was quickly able to click to their \"Main site\" and everything was easily accessible.  Their menu was on the site, not some PDF I had to download.  Reservations/seating:  We showed up on time and we were seated right away.  However, we did have an early reservation so this wasn't a great accomplishment because the place wasn't full yet.The Menu:  The menu was a nice selection of mostly seasonal items.  They had both an entree and a desert special.  I choose to go with the duck special they had over buckwheat.  My wife ended up going with pan seared over risotto.  Following their suggestion we had the mussels as an appetizer.  Service:  The service was very nice.  They reached the level of service that was friendly when you actually caught them serving you.  Most of the time they disappeared into the zone of doing so well that they weren't noticed.  I think it is hard for staff to get into that area and they did it well.Food: The mussels are great.  I hadn't had them before so I was anxious to try them.  They are served in wonderful sauce with crispy Pommes Frites and a good garlic sauce of it.  This was a LARGE portion.  WHEN, I go back I may get this as a main with a salad.   My wife's lobster was very nice.  A great lobster taste with just enough flavor of butter and garlic.  Her risotto was nice pair with it.  My duck was well prepared with a tasty glaze and the buckwheat had a nice flavor.  There wasn't a strong duck flavor.  That is the reason I order duck.  I am not sure if it was the breed, the season, or they way they cooked it  I had it in a few bites, but other than that it was move of a nicely cooked fowl breast.Desert:  We choose to skip dessert because I had made my wife a special Valentines dessert from scratch.  The Gluten:  I had mentioned on my reservation that my wife had an allergy so their were aware of our situation and handled it well.  Our waitress mentioned it at the beginning of our service just to let us know that she was aware.  After we placed our order, I happened to catch her talking to the chef.  The then came back to our table and apologized because the original appetizer we ordered and my wife's entree both had flour in them.  The Foie Gras was dredged in flour before cooking and the sauce in her entree was thickened with flour.  She handled it well and then helped us select some alternatives.  In the end, we were happy with our service, our menu items and we both feel that we will be adding Salum to our list of restaurants to visit again."], ["Jennie Z.", "Atmosphere was a \"meet the parents\" or \"nice date (with an older man)\" type of place. Quiet, classy decor.  9:30pm Saturday dinner- restaurant was still packed.  No cocktail list, but the bartender made one of the best dirty martinis I've had in a looong time. Started with the Caprese Salad - came as a beautifully round structure in the middle of the plate, very fresh ingredients, pesto and olive oil without being overly dressed, finishing touches- topped with slices of prosciutto.  Hard to mess this up, but it was perfect!Entree- I had the lemon sole ($26)- sole filet on top of a bed of cold cucumber salad..  I ordered it only because it was the lightest thing on the menu, and was dreading it because I just knew it would be boring.  But glad to say I was SOO wrong.  The fish was perfectly pan-seared with crispy outside and warm soft center.  Juxtaposed with the crunchy cold cucumber salad- Genius!! well seasoned, great dish!Friends had scallops- 3 large scallops atop kale risotto. Tasty from what I tried.Service was great and not overdone."], ["Richard F.", "Highly recommend.  Got reservations late on Saturday night, still only a brief wait at the bar.  Perfect martini.  Mussels are a must, the broth is excellent, and the string potatoes on top a nice touch.  Service is fantastic."], ["Chris M.", "Bad: Sole was dry, lobster was overcooked, and the risotto was lacking the jalapeno flavor as indicated. Texas goat cheese appetizer was ok.No complaints: pumpkin ravioliGood: lamb was great, muscles appetizer was excellent, service and decor was very nice."], ["Rodrigo S.", "I had lunch here with my wife this week and got to say that I was a little disappointed mainly because I had heard so many good things about the place that I had set my expectations too high.The place is really nice and the service was great but the food was mere okay. I had the capresse salad with serrano and the ribeye and my wife had the fried green tomatoes and the ravioli.Both salads were the best of our lunch. The green tomatoes were perfectly cooked and went pretty well with the chipotle mayo that they serve them with. My capresse salad was small but had really good quality mozzarella. The serrano wasn't my favorite (too mild for me) and had only one slice, but still was good.Now, the entrees weren't nearly as good as the salads. My wife's ravioli came with three grilled shrimp that, at first sight looked great, but once you tried them, you could tell they were previously frozen and had that \"fridge\" flavor. The ravioli were okay, but after a while my wife got bored of their creaminess due to the mascarpone and the heavy cream that they used for the sauce. My ribeye was perfectly cooked, however you could tell that it was lower grade meat (probably select or choice) as it didn't have as much marbling as a prime and, thus, lacked some flavor. The lunch wine list has a good selection however they are a little pricey. I'll give it one more try, this time for dinner to make a final assessment. For now, I won't go back for lunch."], ["Jenny S.", "Very classy, beautiful, dining room with food being the star!!! Top of my list!!"], ["Claire T.", "Boyfriend and I went to Salum last Friday night.  We made an 8:30 reservation (earliest available that wasn't grandma early) on Open Table.  We decided to head over a bit early to get a glass of wine.  Parking was a breeze, as we were able to park in a lot right in front of the place.  Every other car in the lot was a Lexus, BMW, Cadillac, Mercedes.  This place draws a high dollar crowd, apparently.They had a table available for us as soon as we got there, which was nice.  Our table was right next to the open kitchen.  Although some might think this would be uncomfortable, we couldn't feel any of the heat from the kitchen.  It was super fun to watch them prepare all of the dishes, although a bit alarming to see all that butter!  You know a kitchen has to be in tip-top shape if they allow their patrons to watch.We ordered some Tempranillo to start, but due to a miscommunication, we were brought glasses instead of a bottle.  The owner, Abraham,happened to be walking by noticed the confusion on our faces and came right over to fix it.  Wow, we didn't even have to say anything!  Even though we were responsible for the miscommunication, Abraham and our server, Kristin, were very sweet about it and wanted to make us happy.On to the food...  The menu changes often, as they try to incorporate seasonal items.  We weren't super hungry so didn't sample any of the appetizers.  It looked like the mussels were the restaurant favorite from our view of the kitchen.  Boyfriend ordered the rack of lamb and I had the ricotta and pumpkin ravioli with Shrimp.  We both loved our dishes.  My dish had three giant ravioli filled with cheesy pumpkin goodness.  The shrimp were huge and tender (my guess is they were brined before cooking).  The nutmeg cream sauce added an extra rich layer to the dish.  The rack of lamb was beautifully cooked medium rare and decorated with a demiglace.  I enjoyed my taste of the accompanying fresh veggies (long tiny carrots and broccoli rabe) and the savory bread pudding, which tasted like stuffing.Since we skipped the appetizer, we splurged on dessert.  We split the chocolate caramel tart with espresso gelato.  It was sinfully rich and a fabulous end to our meal.We loved our server Kristen.  She was very friendly, but not intrusive.  She happily gave her recommendations upon our request.  She also had a \"good person\" vibe that's rare in people (hard to explain).The feel of the restaurant is simple, elegant, and clean.  It's a bit loud but that and the kitchen view add a nice energy to the dining room.  We were probably the youngest patrons in the place, but it's a stylish choice for any age.  The experience is pricey, but well worth it.  We will definitely be back on a future special occasion."], ["Gerald W.", "Great Food, Good Service, A Fantastic Night OutThis is a highlight and gem within the Dallas food scene.  This was our second trip to the restaurant and we went with a group of 10 (something not so easy for a kitchen to deal with).  From the start we were seated and brought a fantastic bowl of baked breads and then we were served some oil and vinegar to dip the bread in.  The bread is fresh.  The drinks at the bar are delicious, and the wine list is very fair.  You can choose many bottles for under $40 (some were $33 like the Wine Gorilla Zinfandel - highly recommend)  We started with the feta and elephant garlic, others had the caprese, one had a chilled carrot soup, and some had the tartar.  Everyone loved the starters, especially the soup.  Every day they have a different soup of the day so I am not sure how to get the carrot soup again!  Anyhow the starters were fantastic, and you can tell that everything is fresh... the kitchen is open and basically is part of the dining room so part of the show is watching the dishes come out of the kitchen.  The owner is Abraham, and he runs the restaurant like the captain of a cruise ship, checking on every table stopping to chat and making sure everything is coming out of the kitchen perfectly!  It is a great restaurant.  He changes he menu every month, so if you like something you may not find it on the menu next time, but that said it also keep everything fresh so that when you come back you will find something new...  he does keep his signature Rack of Lamb on the Menu... I had that last time and it was to die for.  Presented beautifully.  This time I had a bone in Rib-eye with the most fantastic Risotto Cake that was deep fried, it tasted fantastic.  One of the misses of the night however was the muscle dinner with fettuccine in ink sauce, the person who ate that said it lacked flavor and was bland, but another dining companion had the filet which I tasted and the flavors just exploded in my mouth.  It was delicious.  The Rib-eye came with a horseradish cream sauce that was light and delightful.  My wife ordered the Lobster, and though it was not the largest tail in the world, she said that the taste of the dish was fantastic.  Salum plates each dish as if it were a work of art, they go to great lengths to prepare and make everything from scratch and it shows.  This may be my favorite restaurant in Dallas.  Don't hesitate make a reservation and know that you can enjoy a romantic night for 2 for around $150us.  FANTASTIC."], ["Kristi B.", "I had lunch at Salum with a friend the other day and left wondering, \"why have I never been here before?\"  The meal was fantastic.  I had the house salad, basic but very tasty, and the shrimp wrap.  When I ordered the sandwich, the server asked if I wanted pommes frites or vegetable fries.  I asked him what the vegetables were and he said carrots, mushrooms, and asparagus.  OK, sounds interesting.  They were fantastic!  Vegetables breaded with something akin to panko and fried, very crispy and delicious!  The wrap was great as well.  I also tried my friend's fried green tomato appetizer which was delicious.The decor is very simple but beautiful, and service was good.  I will definitely be back to try dinner.  I see from other reviews that Salum participates in Restaurant Week as well...wonder if I can make my reservation now?"], ["Matt M.", "I was pleasantly surprised and was more than pleased with my dinner. This was more like 3.5 stars for me and would be 4 if the price point was just a tad bit lower. The only thing that i am disappointed about is that i have passed up eating here for so long.I would compare it to Hattie's in some sense considering the elegance and simplicity of the decor to the american food, but salum is a bit more contemporary. Salum is kinda like technology company Oracle for me, not to innovative but consistently delivers earnings growth every quarter with just fantastic execution without over thinking the room..... Yeah so what you are paying a premium over something dull like Microsoft but every time you pay up you are never thoroughly disappointed. Every part of dinner was executed perfectly, from the bread selection, to the below room temperature wine, to the salad perfectly tossed with the dressing, to my beef tenderloin being cooked to perfection on a nice little portion of potatoes."], ["alka n.", "We went for restaurant week and had a great experience. The food was overall great but my Mahi Mahi was wonderful! The green sauce was deeliciious. It was just sad that I had some left over and had asked my waitress to pack it to go but she forgot about it and I felt embarrassed in asking her so did not get to enjoy it the next day. Husband took the chicken which was good but not great. My crab cake appetizer was yum! Husbands goat cheese and elephant garlic was also fabulous! And to top it all the chocolate mousse was finger lickin'  yumilicous! The owner Salum stopped by and chatted for several minutes and that added to the super gastronomical experience!"], ["John G.", "I have dined at Salum's many times and am very impressed with the food, menu & overall experience. Its never failed to impress my clients also."], ["Kyle C.", "This place is amazing!  That should be enough but just in case.... The food is great, the chef is friendly and inviting, the staff is professional and curtious.  This is a great place for a business or casual lunch as well as a great date or dinner with the family.  Abraham Salume is a fixture in Dallas food."], ["Stan L.", "i came here during restaurant week.. service was ok.. it could have been a bit more attentive.. i like the ambiance of the open kitchen.. it's kinda cool watching the line work.. and free parking is always niceas for the food.. salum made a solid impression with their restaurant week menu.. their mussels were delicious albeit heavy with the butter.. my fiancee had started with their serrano ham, tomato, mozzarella with pesto which was a perfect starter.. my texas goat cheese with roasted garlic app was nothing really special thoughfor entrees.. the capellini with seafood needed acid (it tasted too sweet).. it also needed more pasta to seafood..my braised pork was cabbage apple was pretty solid.. nice salty crust.. the desserts were really good.. a trio of chocolate tort with caramel, vanilla creme brulee and a piece of bread pudding finished off the meal.. overall.. i'd definitely check this place out again"], ["Bill M.", "What a pleasant surprise.  Any location in a strip mall tends to temper expectations but this was really good.  Once through the front door you are transformed to an elegant setting that definitely gets your attention.  The food, service, along with the setting were all first rate. Started with the Salum Salad and then had the Lemon Sole as my entree. Both were very very good. Because you can engage in audible conversations, its a great place for a date or a more business-oriented outing.  Not to be missed"], ["Blake R.", "Salum is a very cozy and intimate restaurant featuring excellent food and an small open kitchen, which is very cool.  The menu isn't greatly extensive, but everything they feature is always wonderful.  Watching them cook, you really see how one-on-one it is.  Everything is cooked in small pans on average sized restaurant stove or in a high heat oven.Like another person said, naming favorite dishes doesn't really stand the test of time, as the menu is ever-changing.  They always offer a delicious variety of foie gras, a steak option, chicken option, pork option, and a couple fish options.  They are all masterfully prepared in whatever way the chef is doing them that week.  There are also a number of really tasty salads that also change on a regular basis.The bar offers a wide selection of spirits and an exceptional wine list.  Like most restaurants of this caliber, the pour is usually pretty strong.  Waiters are always prompt with refills.  Service is all around impeccable for that matter.Salum is fit for foodies, but ambiance is more of a romantic and intimate atmosphere.  Salum can get busy on the weekends, so reservations in advance are recommended."], ["Chris H.", "For a couple of years I have heard nothing but wonderful things about what Chef Abraham Salum does at his namesake restaurant. Finally, to celebrate a special occasion we went and Salum restaurant lived up to all the praises. The restaurant is food focused and not trend focused, and the menu rotates regularly, celebrating what the seasons bring us...not what South American can ship us. The restaurant is rather small, but sophisticated in design. The dinning room was half empty when we arrived at 7pm, but by 8pm the room had a loud roar over it, because by now all seats were filled. The open kitchen is just that...it truly is apart of the dinning room. Salum is a certified Park Cities neighborhood spot...regulars dot the dinning room. Chef Salum was occasionally in the kitchen by mostly he would float from table to table (regulars only) shaking hands and kissing babies. He has a short must see list. Just doing business right? I digress. Our waitress was outstanding right from the start. Friendly, professional and knowledgeable about the menu and wines. As the night went on and the restaurant got busier she disappeared in the weeds, which we can't really blame her for. On to the food. The goat cheese and roasted elephant garlic was wonderful. The milder elephant garlic (compared to regular) spread like butter on the crostinis. Paired with the ice cold acidic goat cheese was a delicious combination. Even though it was a blast furnace outside I could not pass on the soup of the day; a puree of local peas. A full flavored soup with just a hint of mint. The texture was a bit grainy though. For the entrees, my grilled pork T-bone was okay. A cut like this should not be cooked any more than medium and this one was done. Nonetheless it had good flavor but it could have been better. The Gruyere stuffed chayote squash was excellent with its deep rich flavor. The rack of lamb was the highlight on the table. A staple of the restaurant, it never leaves the menu. It was one of the best lamb dishes I have had. Every component was spot on. The dijon truffle crust to the mushroom bread pudding were all delicious. Heavy flavors for the summer but once you have the first bite, then you will know why it's always on the menu. Both the lemon sole and the ahi tuna were reviewed as excellent as well. We could not have such a wonderful dinner and pass on dessert so we ordered the creme brulee of the day (Meyer lemon) and bread pudding. Dessert wasn't the grand finale of the meal. The creme brulee was grainy and flavor was lacking depth. The bread pudding was very good but I personally enjoy a traditional bread pudding with hot bourbon sauce. Overall a wonderful meal. Salum has been around for several years and it still feels like the neighborhood secret. We will definitely be back and next time I'm getting that rack of lamb."], ["Michael G.", "Salum is a great somewhat hidden gem. My wife and I go there often. We usually sit at the bar and have a light meal while we chat with the bartender. The owner, Abraham (sp?) always comes over to say hi and thank people for coming in.The inside decor is a little lacking but the food is great. We always start with the baked Texas goat cheese and the salum house salad. The goat cheese melts in your mouth and the salad is very good. After that, we usually split an entree.  The two dishes I would recommend are the seared scallops and the pork loin. If you haven't been to salum, it is worth checking out."], ["Jeff M.", "Just a great place to dine and/or entertain.  Great food, great service, great atmosphere...just \"great\" overall."], ["David G.", "Yummy, Yummy, Yummy, I got Salum food in my tummy -That your lovely food can satisfy meSalum, you're such a sweet thing Good enough to eat thing And sweet thing, that ain't no lie  Wow Great Food Friendly Staff and Top Notch Drinks Yummy :)"], ["Monica P.", "The service was very good, the wine was fine, and the food was GOOD but NOT GREAT -- especially when considering the portions:prices ratio (hint: it's low). I had the perch cooked in red curry. Ordinarily, I like red coconut curry, and this one tasted fine, but it was not a good combo with the fish. My dinner companion was not full before we left; an hour and a half later, and I'm starving. The raspberry creme brulee, however, was very good. I've heard the menu changes here, and that intrigues me, but keep in mind that you'll have to spend a lot of money to get a decent amount of food or, alternatively, eat before you go. Wah."], ["Brandon C.", "This four star restaurant gets a bonus star for being a bright spot in the monotone seen of Dallas fine dining. The excellent lighting, refined decor and fantastic view into the kitchen all contribute to this restaurant's allure, but it is the delicious food that secures a solid four star review.  The grilled lobster is decadent, the prawn crackers and ceviche were superb and the caprese salad was farm fresh. I am typically wary of restaurant prepared risottos but the one that accompanied the grilled lobster was expertly crafted."], ["Philip R.", "Salum has been amazing both times I have been for dinner. The staff has been overly helpful. The everchanging menu has been amazing, and food has surpassed the mouthwatering descriptions. I will definitely use Salum as a spot for entertaining and special dinners!"], ["david h.", "After coming here by myself in December, I was very excited to be able to take my wife with me this time. I had a very positive experience and was looking forward to impressing my wife with the quality and ambience of Salum.Or so I thought!We got there at 12:20 on a Monday afternoon. There was one other table occupied. Ruh Roh. That's not a good sign to be one of two tables in a 25 table restaurant in the heart of the lunch hour. Whistling past the graveyard, we took our seat. Our waiter was very nice. For an appetizer my wife had the garlic and goat cheese (which I had on my previous visit) and it was, again, out of this world good. I had the fried green tomatoes and they were a little flavorless. The tomatoes were fresh and the breading was nice and tight but the sauce on top was non-descript and I guess I missed the part about the crab cake infusion. If it was on the menu and I missed it, my bad, because I hate crab cakes.We then sat and waited for our entree. And waited. And waited. I was impressed the first time here because they got me in and out quickly. That was not going to be the case this time. Our waiter passed by us several times but not once did he say \"your entrees are almost ready\", \"They're putting the finishing touches on your meal\" or even \"sorry for the delay\". We just waited. During our wait I did overhear a waitress comment to another waiter \"Look how much the anorexic ate\" (speaking about another customer who had just left). Wonder what they said about us after we left? Memo to staff, this is a small place, your voice carries.We finally got our entrees (without apology) and my ribeye was great. The sauce was wonderful and it was well cooked. The french fries (sorry, you can't call these pomme frites) were very soggy. You could swing a cat, hit any burger joint in Dallas and come up with better fries than this. My wife's Nicoise salad with tuna was not good. She felt that the tuna was fishy. It was also bland and flavorless. She was suprised that it came with a cold wedge potato but maybe that is how Nicoise salads are supposed to come. Needless to say, she did not eat much of it. The waiter came and asked if everything was okay. My wife said \"the garlic and goat cheese was great\". She does not like to cause a fuss and this was the nicest way she could address her meal. The waiter said \"was the tuna not good\" and she said \"well, it might have been a little fishy but I'm very particular about my fish\". The waiter said \"Then by all means, we will take it off your bill\". My wife said \"you don't have to do that\". He then went and conversed with the owner (I heard the majority of their conversation..remember, this is a small place) and then the owner came over. He asked \"was there something wrong with your tuna?\" and my wife again said \"I thought it was fishy but maybe it's just me\". The owner said \" we get our fish in daily but if you didn't like it, I would be happy to give you a complimentary dessert\". I am in the customer service business and I was always taught when someone says you gave them a bad product or service, you should apologize profusely and take steps to make things right. If I say the fish is fishy and you say \"Our fish is brought in daily\" you might as well say \"You, Mr. Customer, are wrong!\" You can do it however you want. It's your place. We said no thanks to the free dessert but thanks for offering. When we had finished I put my credit card on the corner of the table (I know this may not be how it's done in high society but dammit, I was ready to go). The waiter made two passes before he brought the bill. He brought the bill, stood it on the table and said \"I'll take care of that when you are ready\" and walked off. Okay, I'll put the credit card that was sitting out on the table for the last five minutes in the little pocket book. After another few minutes he came and got my card. He brought the bill back and guess what - there was the nicoise salad with tuna in all its glory right there on the ticket. Long story short - the ambience, decor and setting is nice, Some of the food is out of this world good. Some of the food is bad but don't tell them that. The service was world class the first time (I should have asked for Kristen) and downright shitty the next. Nice shitty but shitty nonetheless. I now know why there were only two tables occupied at 12:20 on a weekday. Won't be back!"], ["Brian C.", "I recently went to Salum with my wife for Restaurant Week and had one of the best meals I've ever had in Dallas. The appetizers (mussels with pomme frites, goat cheese with elephant garlic) were incredibly rich and flavorful without being overwhelming. My beef tenderloin was an incredibly tender and flavorful cut, and the mild peppercorn sauce was perfect. My wife's entree was just as good, pork and cabbage slow-roasted in apple cider. We will definitely be going back in the winter months when the warmth and richness of Salum's food would best hit the spot!"]], "Gloria's Restaurant": [["Michael B.", "Great Latin fusion restaurant with some of the best salsa in the area and a delicious black bean dip.  Everything here is good and prices are quite reasonable.  The meats are well prepared and service is always good. I'm a big fan of their happy hour which features some of the strongest margaritas around. They also have salsa dancing on the weekends. Definitely a great spot to hit up if in the area."], ["Emily M.", "I have been eating at Gloria's since it was in a hotel off of 635. The family moved up to north Dallas in the early 2000s and have been going to this location since.To be fair, this review is not about the food. It has been and still is 4+ stars. Love the chips, black bean dip, salsa, Salvadoran food, etc.I HATE what they have done to the inside of this restaurant. It was set apart from the franchise Gloria's that have been popping up in Austin, Houston and elsewhere and now it is terribly generic. I am not just a traditionalist. I love modern architecture. In fact, I am an architect. This place is loud, bland (aside from a tacky bar), sterile and it kind of just looks like a slightly edgier high school cafeteria. They clearly just wanted to squeeze in as many plastic crap tables as they could. The ambiance of old hodgepodge Mexican charm that the place used to have is totally gone.Will be eating exclusively on the patio at this location from now on. I just can't. Thanks for ruining my favorite Gloria's."], ["tim b.", "So the food itself probably rounds up to a four star taste.But DANG is it loud in there during dinnertime on a Weds.  I sat at the packed bar and the bartender was pretty helpful at first but he just didn't have the cycles to pay attention like a waiter at a table.I will also detract for the fact that they ran out of the ribeye - which is a regular menu item.  I might understand if this was a Monday or Tuesday.On to the good.  I ended up going for the tipico churasco (spelling?) which is a fairly tough steak.  It comes with a generously sized offering of chimichurri sauce.  I thought the sauce was lacking a bit of salt and garlic.  But what was interesting is the the combination of the two items really ended up in a 4-star taste!plus the sauteed spinach and mushrooms on the side was out-of-this-world good.  I would like to return when they are not quite so busy."], ["Amanda L.", "I love Gloria's! Great quality Latin cuisine (and yes it is not tex-mex) I tend to gravitate towards the same items all the time: their Queso is great, but I suggest a cup unless it's a larger party. The Chimichanga is delicious but splitting is recommended unless you have a VERY large appetite. The fajitas are also good...not the best I've ever had, but good, as well the chicken soup, Plantains, and the Happy Hour Margaritas!! Let's face it, those things are why most people go and in fact, I think the house Margarita is better than their top shelf. They are pretty strong so drink at your own risk! This location is new and is beautiful inside! Becomes a salsa club at night so that explains the decor. Have never danced there but heard it's fun."], ["Brad S.", "Revisiting Gloria's after so many years away, is kinda like striking up a romance with an old flame, who you never really had that much chemistry with from the start. Back in 2005, when I worked on lower Greenville, that original location was where I lunched with co-workers, good friends and even alone many times. It was always about the black bean dip and strong drinks, more so than the entrees. Flash forward to 2015, on a stormy Thursday in Addison, where I gave my former love another go. It's not so busy that I can't get a table for one quickly, but it's busy enough that the waitstaff is running around with their collective heads cut off. I keep it simple with spinach and cheese enchiladas and a swirl margarita, and in less than 10 minutes my food has arrived - and that's not a good thing. I've been here before (see Meso Maya), but not when a restaurant is this busy. I'm pretty sure that even before I take a bite, something will be off. Of course, the entire dish is barely lukewarm and the spinach is so overcooked you can barely chew it. And then it seems like an eternity before a manager walks by and asks how my meal is: \"Oh, it's fine. I've just pushed my plate to the edge of the table to admire it from afar.\" I could go on forever about the endless parade of servers/managers that attended to me after I pointed out the inadequacy of the food presented, but you've got a life to lead, so I shall spare you. They offered me another dish, I accepted, I washed it down with another stout margarita and made the walk of shame home (I actually drove, but I'm painting a picture here for you, so just go with it! ). I'm not sure what I saw in Gloria's from the start, and I'm not 100% sure why I gave them another chance. Still, we all have that one romance we go back to, no matter how foolish we feel when it's all said and done. Have a little self respect, my friends, and just move on. She/he's just not worth it..."], ["Jolly J.", "Luv Gloria's! Awesome food and even better drinks! Enjoyed my chicken fajita chimichanga smothered in queso! Great service with no problems and made sure we had everything we needed... Definitely will be going back!"], ["Chelsea R.", "The makeover is fabulous!! The dance floor is massive and I love the new party lights for salsa and live music on Friday and Saturday nights. Park at Whole Foods...the food at Gloria's has even gotten better. Is that even possible!? They will give you chocolate flan on your birthday and it melts in your mouth! The brisket tacos with corn tortillas have a special place in my heart. You do not even need cheese! The meat is marinated to perfection. And who could forget the chips, fiery salsa and black bean dip! Oh Lordy I'm in heaven!"], ["Alexis S.", "I went here today for Happy Hour because the website advertised all day Happy Hour on Thursdays with margaritas etc. for $5. When I got my bill, mine were $7 each. When I asked why, they told me that they had just changed their prices and menus today. But I looked up their online menu and Happy Hour pricing as I sat there, and it had not been changed. This is deceptive business practices and unacceptable. The food was okay, servers nice and attentive, but I will not return because they are somewhat dishonest and do not rectify these errors when pointed out to them. I screen shotted the website too and it has a date and time stamp. I'm disappointed in their handling of this."], ["Giordan C.", "Gloria's is like Old Faithful to me, they always come through in the clutch. This is always my spot for happy hour Mon-Thursday(still waiting on them to add Fridays!!!)Their margaritas are second to none! I always get the house margarita frozen, after 2 of those you will be in the zone, so I usually get 3! They also give you as much chips and salsa and black bean dip as you want! You can get full off of that! But if you want real food I would say go for their steak quesadillas idk how they make them but there is somebody back in the kitchen working magic! Also try the spicy pineapple margarita you won't be disappointed."], ["Randall R.", "Most items are great.  They take the beef enchilada's to another level with lots of meaty chili con carne.  Salsa is tasty.  Complimentary black bean dip is a huge hit.The only item I've had that I did not care for was the pupusa - just seemed plain, a little greasy.  Others love 'em, so maybe it's just me."], ["Rebecca B.", "Food was very good. Ambiance had a cool hip vibe.  Nice outside patio but it was really cold outside.  We had nachos and grilled chicken.  Very tasty"], ["Stephanie Y.", "For a Friday night, there was no crowd at all. We were seated and served immediately. Drinks at Gloria's are strong! No Friday happy hour (but whatchya gonna do). I got the ceviche trio mostly because I love those plantain chips served with them. Their black beans are also killer. The shrimp ceviche was dynamite. The others were just good. Overall, decent service but good food and drinks. I'd come back just for the plantain chips and black bean dip :)"], ["Dena R.", "Had a craving for Salvadorian food, so stopped by Gloria's for a late weekday lunch.  I have not been here since they remodeled, the restaurant entrance is now on the corner.  It is gorgeous inside, I love how they've redecorated.  I was seated quickly and the restaurant was pretty empty around 2 on a Thursday afternoon.  Several of the service staff was eating their lunch in the main dining area, which was fine.  I wanted 2 cheese pupusas, but the server informed me they are $4 each, but if I order 3, it's $9.99.  This doesn't make sense to me, and I don't think a small cheese pupusa should be $4.  I'm pretty sure they've raised their prices on that.  I ordered 3 and planned to take the extra one home for later.  I also ordered two sides of fried plantains (each comes with 4 small pieces, or one plantain) and a side of queso fresco.  They brought my food out promptly but on four separate plates, so I felt a little ridiculous.  They knew it was for one person and it was not that much food, they could have combined plates so I didn't feel like I'd ordered the entire menu!  My server, Rogelio, promptly refilled my black bean dip once empty, it is still amazing.  He was nowhere to be found when I needed more water, but I must have looked like I needed something because a manager walking by refilled it for me.  Service was otherwise prompt and fine.  Got me in and out within an hour easily and food was delicious as always."], ["Michael G.", "It is good food but not the traditional tex mex a lot of people in Texas are used to. Also very pricy."], ["Steffanie B.", "I love Gloria's and this location is as good as they come.We entered on a Thursday night and immediately we were greeted with the complimentary chips and black bean dip/salsa duo. Awesome! At least two people. Within the first five minutes, at least two people came by to make sure someone had helped us.  Did I say awesome! The first guy was so patient with my questions regarding happy hour drink specials. We settled in with the original frozen margaritas as the other varieties are not a part of the specials. Salt please.For dinner our spread included my usual, Pescado Acajutla. I love their tilapia with those sauteed veggies and black rice. And we also tried the chicken and spinach que sad ill as which did not disappoint.  Additionally,  we had a pair or pork pupusas and a side of platanos.  Did I mention when we break, we break!Yeah I was a happy camper. Clean plates and empty glasses.Service was excellent. Food was excellent. Ambiance was excellent. You heard me say awesome, right?Looks like they are leaving soon though. But no worries.  Their new locay will only be steps away. Looks like an upgrade!  The new patio looks awesome already!Keep up the good work GLORAI'S!Awesome!!!!!! Ness!!!!!!!"], ["Robert M.", "I had the steak a la Mexicana.  It was pretty good. They remodeled it very nicely and it has a nice ambience.  Average menu."], ["Barbara M.", "The food is ok really I'm mot impressed or disappointed by it. The drinks during dinner were good. My friend offered me a drink since I was celebrating my birthday there, I agreed and the tequila drink was so disgusting and it even burned my lips. I stopped drinking it at the first sip three friends tried it and agreed with me that that wasn't tequila. I'm not so sure why they will charge extra for drinks after 11 and then serve low quality drinks. On that point if you are charging $10.00 cover why would you charge more for drinks. I don't think I will recommend this place for a night out anytime soon."], ["Andria N.", "Margaritas were good and the complimentary black bean dip was amazing. The ceviche was alright, but a bit too much lime for me. I got the chicken tacos and they were pretty standard. Only real downside was that the restaurant was very loud and they dimmed the lights too far."], ["Kirk B.", "Excellent food. Excellent service. Can not get better. Management also above board. Cannot find better food, service and management. Best of best."], ["Kiara C.", "Towards the end of December 2013, I came here for a holiday party. Unlimited drinks and your meal. Since I'm a vegetarian, of course the menu that was provider specifically for the holiday party only had meat options. I decided to go with the classic enchilada plate, but obviously I had cheese only. They were good, but I've definitely had better. The margaritas are strong, but I'm no alcoholic so my strong is quite different from others...basically the margaritas I can tolerate are the On the Border classic strawberry...pathetic, but true. Hard liquors are not appetizing to me, but I can sure guzzle a bottle of wine... Okay off topic, back to Gloria's...The vibe was a classy Mexico, but a little too Texas for me. Back home in San Diego, our Mexican food is AUTHENTIC. The tortillas, beans, \"sigh\"...the food period is great! There's no Americanized Mexican food, wait, other than the Taco Bells. Nonetheless, we have a place called El Torito which is to freakin' die for. I literally can eat there every single day. Okay now this is becoming two reviews in one... Sorry Gloria. Overall- Gloria's is decent. Would I go back? Sure, but it's nothing serious."]], "Pera Wine & Tapas": [], "Neighborhood Services": [], "La Duni Latin Cafe": [["Jackie G.", "The coffee here is amazing... 5 starsYucca fries.... 5 starsSteak sandwich.... 5 starsGuacamole... 1 starThe coffee and deserts here are exceptional. Great atmosphere for going out with friends or date night. The service has been good here. The last time we visited our waiter Xavier was fantastic, very attentive and made sure we had a great experience.Would highly recommend La Duni."], ["Nicholas C.", "Oh myy lordd... absolutely amazing. Try the rice salad w pork and a negra modelo beer as a drink. A side of fried yuca. Wwhooooooo.... its a nice environment and good attentive quick service.  I dont really 5 start. But this one takes the cake"], ["Athena H.", "I crave their shrimp in garlic sauce appetizer and their pulled turkey salad. After delivering my first child, I sent my husband there after I had sushi and wine. This is how good it is. Going several months without sushi wine and shellfish was very difficult. No one can meet my shrimp fix like this. Yummy!"], ["Naser A.", "Amazing atmosphere! Walk in smell fresh coffee to die for. Fresh cookies will make u always come back."], ["Thaly A.", "4 lechesssss omg!!!!!Food is great but I feel like it is too pricey for what it is  Coming from a Latin background I'm not used to pay a lot for a plate with rice, chicken and broccoli lolI have to say that the service is impeccable, the atmosphere is beautiful and classy, definitely the kind of place where you want to bring your date or best friend...I have wanted to try the \"paella\" many times but it's never available when I go  so that annoys me too...Drinks are amazing and they have a huge selections of wines and desserts and I love desserts, from everything that I have tried the best one is the \"4 leches\" :)I'm feeling like going there right now just thinking in that dessert lol"], ["Brian B.", "This is one of my favorite weekend breakfast and brunch spots.  The food and baked goods are really spectacular - plus, they have an incredibly expansive coffee menu.  The items all have a Latin twist, but still feel conventional enough that they still feel like breakfast. The breakfast potatoes they cook are excellent, they are twice cooked and get this really nice, lightly crunchy crust that is just so yummy!  I also like the Huevos Finos which are like Eggs Benedict, except with a popover instead of an English Muffin. Yowza!If you're not going for weekend brunch, the main thing to get here is the coffee and baked goods though. There is a full espresso bar and they make real European style coffee. I ordered a cafe con leche and what I got back reminded me exactly of the coffee I used to get in Spain. They also have traditional French and Italian coffees and espressos. Very tasty. I prefer this McKinney ave location over the others. It is nice and relaxed, very rarely as crowded or hectic as things can get in northpark or Oak Lawn. A great place to spend a relaxing morning with a coffee and a newspaper!"], ["StefieLou N.", "Sigh . . . I really, really, wanted to LOVE this place.  But today was such a disappointment.We went for lunch this Friday afternoon.  There was a particular dish that I really wanted to try on the lunch menu, but since it was the 4th of July, they were only doing a brunch menu.It was near 2pm when we went, and the place was pretty empty, but still, service was soooooooooooooo slow.  We had to wait a long time for someone to come just to ask for a glass of water.  We wanted to order cocktails, and had to wait another 10 mins for the cocktail menu to be brought to us.  Then another long wait for them to be made.  We had taken one sip, and then book our meal was brought out.Also disappointing was that we were not brought a basket of chips and salsa.  My husband and I were both starving, and that would have been wonderful!We both ordered sandwiches . . . they were good.  My husband ordered the sweet potato fries, and was given such a small, stingy portion. Not sure if we will be back , . . . . I have to say, the Northpark location is certainly better than this one."], ["Kendra M.", "One of my favorite places to eat.  Pollo Aljibe was alwasy perfect.  Miss it!"], ["J B.", "This place should be called la poopy.  We were so excited to come here based on the reviews... What an overrated shit hole with a bunch of wanna be elitist morons!  Literally every person working there has the same judgmental vacant stare when you talk to them. Not one smile or warm greeting from any of them!  We walk in, and some chubby host who looks like they had to butter his hips to get him into work gear,  doesn't ask us if we want a table or even say hi.  Every person in there from bartenders to servers acted the same way. It's like they were under a nazi spell.  Food was ok but totally overrated. Mojitos were good but margaritas were just awful. Dessert was garbage! You can order better cakes at eatzis and grimaldis for half the price.   I would never recommend this place to anyone."], ["Liz W.", "I don't remember what part of Latin America my dish originated from. I don't need to. It was amazing, and that is all that matters.I had a quatro leches CUPCAKE. My party had some excellent caipharinhas. We found out what the fourth leche was, and we were treated quite well and had a great time. If you are near Crate and Barrel/The Apple Store/Weir's/whatever, skip the hot dog place. You've had enough hot dogs. No, Chuy's is not adventurous enough. Go get you some La Duni."], ["Holly O.", "We love going to La Duni. I always get the salad with grilled chicken and pickled onions (can't think of the name of this dish), and it is perfect for my low carb diet. There is an orange margarita that is deeelicious! Great service and food. My only complaint - they close very early and will not serve you if you come in around 8:30 pm or so, about the time I'm ready to go out on the town. Otherwise - great food and very romantic atmosphere."], ["Tiffany H.", "**Dessert only reviewLa Duni was recommended by Nicole L's friend so we came here after Sonny Bryan's for dessert!. Unfortunately, La Duni is at best 3 stars compared to Extraordinary Desserts in San Diego, CA. My first impression was great, I was captivated by the interior design and the friendly hostess but it was all downhill from there...Nicole L & I ordered to share:*Cuatro Leches Cake (Mantecado vanilla sponge cake, soaked in cuatro leches sauce, topped with caramelized Swiss meringue and dotted with Arequipe reduction. Served with 3 leches sauce and Arequipe caramel): Beautiful plating like found at Extraordinary but this baby was way way too sweet. Divine, soft texture of the soaked sponge cake but I couldn't get past the sweetness. *Venezuelan Triple Chocolate Truffle Cake: (Layered milk, semisweet and dark chocolate truffle between dark espresso-chocolate cake, studded with caramelized roasted hazelnuts dipped in milk chocolate. Served with raspberry coulis) - Mmm you can't go wrong with a really rich chocolate cake. It was good but wasn't the best I've had. And I don't know if I was just too tired from the night before, but I had no desire to eat this entire cake (per my usual habits). Service is worse than a Chinese restaurant's! Granted, we sat next to a large table & in the inner most corner of the restaurant but still... when the server came by for the large table she NEVER looked my way. I was raising my hand, waving, etc. I expected a lot more. Note, they don't have their cupcakes anymore."], ["Pedro S.", "If you like sweets, especially cake, then do yourself a favor and come worship at the Church of Duni, where the leches are plenty (their cuatro leches cake is delicious) and your sweet tooth's constant cries for a blood sacrifice will finally be quelled."], ["Chelsea V.", "I went to La Duni for brunch on Saturday, and it was surprisingly not too crowded!  Annoyingly, you do have to valet, though - there is no option to park your own car.  Our dining companions brought their baby and the hostess was very accommodating, however there is no baby changing station in the restroom??  I wouldn't have noticed this, but the mother was quite annoyed at this exclusion.  As noted in most of the other reviews, the service was very slow, but we weren't in a hurry and didn't mind too much.  I ordered the Huevos Finos for a chance to try their popovers, and the dish was quite delicious and the portion size was perfect.  Two others ordered the French Toast and strangely one had a HUGE portion and the other one had a small portion, so there is some lack of consistency in that department.  Normally I like to have a cocktail with brunch, but opted for a Limonada with Berries and it was amazing!  It was so flavorful and refreshing - it was honestly the best thing I had."], ["mark k.", "No wait for Sunday brunch!  Attractive menu with some unique choices.  I had the rice with Shrimp.  It was tasty, but much more like shrimp fried rice than the fancy menu description would indicate.  Next time, I will start with the bakery goods, which look amazing.  Although there was no one waiting for tables, the waiter rushed us, wanting to take our plates before we were done and then took everyone's plates except for one diner who sat alone with her plate.  Very awkward.  Keep all plates on the table until you are sure everyone is done dining."], ["BluJean C.", "I'm in love with this place. After living in Miami, you can never find Cuban dishes to compare- this place nails it. The have amazing food, a wonderful atmosphere, and the best fresh margarita I've ever had."], ["Katherine M.", "We really enjoyed our first La Duni experience for Latin American cuisine.  It's a classy yet relaxed atmosphere, and the service is top notch!  We were very impressed by our waitress...I really wish I would have caught her name to give her props.  Hubs had the frozen margarita to start, and I had the Dona Margarita.  Mine was a bit too sweet and wasn't very strong; Hubs loved his marg though!  The Queso Verde was a solid app to start with; don't expect the super salty Tex-Mex queso you're used to though...this had a nice twist.  For our entree, we split the carne asada.  Our waitress asked if we wanted them to split it in the back for $3 more, and we agreed.  The pros are:  1) You don't have to do the messy food shifting from plate to plate, and it was presented beautifully and 2) They give you more sides so each person can have a good amount.  Definitely worth $3.  Now for the actual food...YUM!  Possibly the best carne asada we've had.  The meat was tender and cooked perfectly, and I loved the plantains as a sweet little something at the end.  Now...if we only could have saved room for dessert...after reading all of the wonderful dessert reviews, we MUST save room next time.Note there is a small valet fee...not sure of the exact price, but it wasn't more than $5."], ["Shawna F.", "The food presentation, quality, and the quiet atmosphere will bring me back. However, when you sit down, you are confronted with a giant sign sitting on your table, explaining that you may only be served water upon request, with water conservation in mind. I appreciate the environmentally conscious, but I don't need to rearrange my table setting around the idea. I've definitely had better breakfast tacos, but I did not regret ordering dessert. They have a warm chocolate pudding cake that is served over vanilla ice cream, homemade chocolate syrup sauce, raspberry glaze, and caramel. It's"], ["Brian Z.", "I've eaten here many times and taken many colleagues here.  Great place for drinks, dinner and desert.  I've actually never had a dish I didn't like and they are very consistent in quality.  I highly recommend their empanadas, super flaky and always great.Their cocktails are fabulous and a wide selection.  Don't forget to get dessert, which is there specialty.  Great food and a low price.  More of a casual atmosphere perfect for dinner with friends before a night out."], ["Morgan S.", "I love all the food here. Everything is amazing. You can come here for dessert, coffee, dinner, brunch. You just can't go wrong with la duni! I highly recommend the queso verde, the french cappuccino, and the peach and berry cobbler (maybe not all together)."]], "The Woolworth": [["Amanda F.", "Few things:1. Not one bartender said their name2. Shouldn't bartenders know the beer list when you only have about 15ish....Not here, they know they have bud light and Miller...then you get the menu to fend for yourself....3. Employee smoking in corner of patio. Was told patio was closed and could smoke, then told we couldn't. THEN SAW SAID SMOKING SERVER RUNNING FOOD......smh4. Bartenders didn't even ring in our drinks we had to remind THEM....bc that's the guest's job of course...5. Closed out and finally does the other bartender look up from his phone(the one with glasses, short) and ask if we want another round and \"hang out\".....reallyFood was fine, nothing to instagram about......that's the 2 stars. Take note of Houston restaurants, they do have longevity unlike this place......"], ["Helen H.", "Ambiance- cute for downtown- not too froo froo and good casual vibeService- great. And the pacing of food was good tooDrinks- whatever the spice one is... Very dramatic with dry ice at the bottom I think to make to smoke! French 75- great and light. The New York sour flip was good but not my favorite Food was delicious! I like these places that do a little bit of a twist or something special to it. Crab nachos- really good! Lots of crab meat and the taro chips are very good. Somehow it didn't even get soggy at the end. Trufflee fries with the homemade ketchup. A very nice touch with the homemade ketchup and much appreciated! Delicious Nan's toast- delicious. The pot roast is a little odd bc it's cold and not as tender as I'd like it, but nevertheless it Pairs great with the horseradish cream and sweet potato purée. And how can I turn down the pea tendrils on top. Sooo good. B tacos- good. But too spicy for me to eat as much of. Note- I'm a lightweight for spicy but my husband really liked them! He loves spicy. Price- not too bad honestly for downtown. So pretty good. Overall- I'll come back! Although- please get valet. It's a madhouse down there trying to find our own parking. And a little stressful with so much going on!"], ["Jacqueline C.", "The (still) fantastic food is just not worth the pain! There is no other word to accurately describe the interaction with the wait staff than \"painful.\" One incredibly rude waitress, plus 3 charges for items we didnt order, plus two attempts to get the bill right = not going back."], ["Kitty Q.", "Short:I mean 4.5 stars. It's really good. It's not 5 stars, but it's only the counter lunch service that kills it for me.Long:What can I say about The Woolworth that Rick James hasn't said about cocaine. It's greatness. It's posh. The warm is room, and inviting, and the waitstaff are pleasant and professional. The food comes in 2 sizes; small and ginormous. The quality of the food is high. The taste is worth the price.It's the kind of place you can go for drinks with friends and stay all night. If I went more often, it might be the kind of place where everyone knows my name. I've never felt rushed once when I go there, I enjoy it a lot. You will too. Unless you're Rick James.P.s.Given my tendency to never leave there less than 2 sheets to the wind, I'm a little disappointed that I don't qualify as handicapped enough to take the elevator, but I won't hold that against them."], ["Carolyn S.", "I've been here multiple times for happy hour and dinner, but we tried it on Easter Sunday for brunch. They served complimentary hot crossed buns, which are typically dried out a flavorless, but these were fantastic. I had the eggs benedict which were fine, but the real showcase brunch item is the Hangover. For those in my party who might have missed having a typical Easter buffet, this was the option for them! It had a little bit of everything in between an oversized biscuit. Just to name a few items in this mountain of breakfast heaven, fried chicken, ham, sausage and eggs. It was pretty impressive.For dinner, I've tried many of their dishes and haven't been disappointed. They have signature cocktails and make all of their mixes on site. The restaurant is intimate, on the second floor of an older building. I'm always surprised it's not busier, and I like to think its my little downtown secret. It's the type of place that I feel comfortable going to wearing jeans and a t-shirt or dressing up to go to before a night out. I'm looking forward to spending more time there this summer when they open the patio!"], ["Allen R.", "Pretty cool place especially now that they have a roof top patio.  Was a perfect evening outside the night four of us visited for drinks and appetizers.  The drinks were an artwork to say the least.  My first was a something that had smoke in the name and sure enough, when it was served it smoke boiling out of the glass!  Small piece of dry ice did the trick.  The outside rim of the glass was decorated with a sugary heat filled delicious crystal.  Most all of the drinks were passed around as everyone wanted to taste everything they could.  When the appetizers were brought out they were each displayed again as art work.  I ordered crab nachos which were new to me but awesome and again everyone wanted to try everything that was placed in front of us.  It was a fun way to start off a good evening.Realize that this is not a place that you would go to hammer down a few drinks and more of a place to be amazed with a couple drinks as the prices are definitely not cheap but worth every penny in my opinion."], ["Bryan W.", "Nice spot for drinking on main street if you're also wanting a bit of food as well. The service is top notch and the drinks are very well crafted but a little pricey at around $15 a piece. Happy hour has five cocktails drop down to $8 which is decent considering what part of town you're in. Food is great at very good prices with average small plates being $5 to large plates around $15.Would go back more hungry than thirsty."], ["Lauren B.", "Just moved downtown and can walk here which is awesome. Tried it out a couple nights ago for dinner and was surprisingly impressed. Most plates are tapas style but pretty decent portions. We tried the meatballs (por-something...don't remember the name), calamari fries, crab nachos and Caprese lollipops. I loved the Lollipops--super refreshing and light. The meatballs were probably the best thing. Very very tasty. The crab nachos I expected to be hot but were cold? They were on plantain chips and had a slew of sauces. Being the priciest thing I expected more. They were just ok. And finally the calamari--free! If you post their hashtag (#thewoolworthdallas) you get a free order of either truffle fries, chips or calamari. The calamari was super good and tender. Drinks were great but pricey. Tried the smoke and water? Smoke and somethin. Really spicy and delicious! The boy had the mule kick which was also good. No copper mug though. At 12 bucks a pop we only had one each then opted for whiskey sours, which were good!We'll definitely be back. We want to try brunch now!"], ["Wil H.", "I will keep this review quick.  We come to The Woolworth all the time, for parties, rehearsal dinners, brunch, and random cocktail nights, and I will say that The Woolworth can be described in two words - Consistently Perfect!  There menu is fresh, interesting, and full of flavor.  There are tons of options for vegetarians, catholics (for Fridays during lent), or even picky eaters who want a burger and fries!I live downtown, and walking to The Woolworth makes it even better, but i would still frequent even if it was not convenient!Go for the atmosphere, the food, and the service - it's all amazing!"], ["Megha P.", "I had quite an annoying experience at the Woolworth last night.I'd like to begin by stating that A) my family owns a small business so I know how much these reviews can help and hurt, and I take that very seriously, and B) I am rarely picky about the server/atmosphere of a restaurant--if the food is good and the service is decent, I'll call the evening a success. I realize how much servers have to juggle and how stressful that can be, so I don't see any point in being overly hard on them if the meal was good overall.This was NOT the case at The Woolworth, and I will not be coming back here! My friend and I came on a Wednesday night and entered the restaurant only to be greeted by a server with a snobby, arrogant attitude. She made it seem like we were idiots for not making a reservation, though there were many available tables in the restaurant AND it was a weeknight! The night was already off to a rough start.To make matters worse, she was extremely rude when we ordered our food. The menu lists several shared plates as well as main entrees, so my friend and I decided to order two small plates each for our meal since those dishes sounded more appetizing. Not weird, right? Our server (the same one from the front of the restaurant) came back to our table to take our order, though when I ordered my two plates, she told me that my combination was WEIRD. She didn't suggest something else or tell me that I might enjoy a different combination instead, but she laughed and told me that the food I wanted to order was WEIRD.First of all, I am a paying customer and can order anything that I want off the menu. And second of all, it is incredibly rude to make such a comment about someone's food choice. What if I was restricted to those options due to an allergy or illness? I was really offended, and it was hard to enjoy my WEIRD meal after that.The food itself was terribly ordinary, plus that whole exchange left a bad taste in my mouth so perhaps I was influenced by that. I simply cannot bring my business to a place where the staff does not care about the experience of their customers. I will not be coming back, nor will I be recommending this place to others."], ["Sabrina B.", "This place is awesome. Small and quaint. I sat at the bar and I don't know who the bartender was but he is awesome and made my day and didn't even know it. I was by myself pissed since my travel companions decided to ditch me but he made my day so much better"], ["Scott D.", "This is truly a unique place. I highly recommend it. I had dinner there last night and it was a pleasure from start to finish. If you are going on Friday or Saturday. MAKE A RESERVATION although even waiting for our table was enjoyable do to the cocktail menu and appetizer choices. My only regret is I did not have room for the grilled pound cake at the end. If you are in downtown Dallas this is a must visit place."], ["Lindsey H.", "The best part about this restaurant is location/atmosphere. It is located upstairs in downtown Dallas. The restaurant has a very fun, upbeat, modern and classy vibe. This would be a great place to meet for cocktails as they have a great bar menu. The food is good, but not great."], ["Lisa H.", "I ate here for lunch for the first time and thought it was a very cool place to hang out. Once you enter the restaurant, you have to stand in line and order the food, then you find your own table to sit and they will call for you when your food is ready. I thought the food was average. I had a lobster sandwich with fries. It wasn't bad but I thought they could've done a better job with the seasonings. Other than that, I would come back again to try their tacos, I heard they were pretty good."], ["Beth M.", "My group of friends goes out pretty much every Sunday for brunch, we spend a lot of money and try new places all the time. That being said, we always looks at menus on line before we go, we like a good variety. I understand a brunch menu, but it is also lunch time. Not everyone eats eggs and French toast at 1:00 pm. We were un aware that they didn't have any lunch or savory options and the brunch menu was just blah.When we came in they seemed kind of un interested in us. After a 20 minute wait and expensive drinks we left in search of something other than eggs!"], ["Jeff R.", "Best damn cocktails in town. Best damn baristas in town. Best damn everything in town. This is become a regular stop for me.Incredible drink menu always exciting. Try the spicy margarita, you will be hooked! Make sure you venture far enough to check out the library! This place has incredible views. Austin is making a name for himself as one of only two certified bartenders in Texas. His bar creations are groundbreaking."], ["Audra K.", "We were in town for a conference and turned to Yelp to help us find a local place to eat. They were gracious and helpful. We had several shared plates and individual meals. The drinks seemed a bit overpriced but the food was delicious. Wait staff was attentive. Restaurant a bit loud. It is for sure a fun place, and not a place to go for a quiet meal."], ["Samantha S.", "Mikey made my cocktail, and it was delicious. The food was awesome, but the service from the waitress was very poor. She began with great recommendations but then took a turn for the worst. Waited for waters, silverware, and our bills. Then, our bills were incorrect. I was exhausted and just wanted a nice meal after a long day of work. The restaurant was empty besides the bar, and there was no excuse for the wait."], ["Ryan S.", "This place is Restoration Hardware charming meets delicious food and absolutely amazing cocktails. And yes, I've tried them all. Never had one bad thing here. Been for brunch (twice) & dinner (6 times) and super consistent. Just go. Thank me later."], ["Allison C.", "Such a great place! We were on a tight schedule and our waitress made sure we would make our next stop. She recommended great drinks and dishes. The atmosphere is welcoming. We will definitely  be back!"]], "Cafe Izmir": [["Christopher R.", "1st time here. Didn't know what to expect, but everything we tried was of incredible quality. Very nice atmosphere, staff, but most importantly delicious food. If you need a place to try, then give this a shot. My wife is from Europe so we are very familiar with what to expect from Mediterranean food and we both strongly approve."], ["Kate E.", "I love Cafe Izmir food.  I saw that they have an order online option for pickup and the service had some technical problems but the owners contacted me directly and fixed it. Great family run restaurant with the best hummus in town!"], ["Jordan A.", "Can definitely be considered one of those hole in the wall places. Though a very small restaurant, the god and service makes up for its size. They have some of the most amazing wine. Their hummus is truly the best that I have ever had, and I've had some damn good hummus. One of the first things the waiter told us was that \"if you get anything you do not like, you won't be charged for it\". After receiving our food, I understand exactly why they say that. I have not one single complaint about this place what so ever. I will definitely be coming back and telling everyone I know to check this place out."], ["Blessy P.", "Great food and great customer service. The only issue is it's a little crowded though. We ordered few of tapas and shared it with the table and all of it was delicious and filling. The hummus and pita bread is also probably the best I've tasted."], ["Nilesh C.", "Cafe Izmir is one of the best Mediterranean restaurant in Dallas. The place is, I would say, little small compared to how much people love them. Valet parking is your best option. One tip: Always make reservations even if it's a weekday. and be warned, you may still have to wait even after making reservations. We once had to wait 30 mins even after making reservation because the folks at our table didn't want to end their chitchat even after paying the bill. I guess people just love the ambiance.Coming to food, their food portions are just enough to justify the price. I am vegetarian so cannot comment on non vegetarian n dishes but all of their vegetarian dishes are great. Surprisingly, their default plain hummus is not as great as their red pepper hummus. I will put the blame on my spice seeking tongue :PService is by default slow and crawls during busy hours. You have to wait to get check even when you can see hordes of people waiting outside to be seated. I believe this has all to do with their limited kitchen capability. I haven't seen it so cant comment on it.Cheese platter was a huge disappointment as there was only one cheese type on the plate with olives, almonds, grapes and pita bread. Not sure if they ran out of cheeses!With all of time and service issues, their food really takes over. Great place. Recommend it when you have lots of time at hand and you are not hungry as a lion :D"], ["Nga N.", "I really wanted to like this place, but I didn't. I gotta say, the waiter we had that night was pretty cool. He was super enthusiast and seemed like he loved his job. Even though our waiter was great, the service ended up kindna slow as they got busier. Anyways to the food, I really like how this place offers tapas style so I can try more stuff. We pretty much got what the waiter recommended.  The hummus was the best and only thing that was good that night. It was garlic-y, smooth and fine in texture. Most hummus elsewhere is too gritty for me. The chicken, lamb, and falafel were alright at most. The meat was too dry. Even though the lamb wasn't gamey, it lacked the true essence of lamb, and wasn't good. I ended up only eating the hummus with pita bread to get full while neglecting the rest of the food...that's always a bad sign.We had a Groupon, but the $10 for $20 deal via Yelp with a free hummus for a check-in is a much better deal. With a Groupon, it didn't allow the waiter to enter more than one code for the free hummus. I highly recommend getting the Yelp deal, and might return for a second chance because of it."], ["Naser A.", "I love this place beautiful atmosphere, great music & delicious food. Service is amazing and the owner helps out just like any other employee. We were there on a Tuesday night they had the 15$ bottles of sangria and specials on the appetizers."], ["Tyra R.", "First thing...it was a massive downpour the night we were looking for a dinner spot. We chose Cafe Izmir and too our delight, their valet had a covered parking spot right by the door for you to pull into! Major plus so we didn't get drenched on our way in.When you walk in the place is very tiny but cozy. The night we went they had live music which was very nice and completely set the mood for the night. Great ambiance! Not a super fancy place but such a nice change to the typical Dallas atmosphere.While we waited for our table we sat at the cozy bar where the man was singing and playing guitar. They have a nice wine selection that isn't overpriced as well has house made sangria. The conversation and entertainment from the man serving us was worth the entire trip there (and we hadn't even eaten yet - If you are a David Bowie fan and like to talk to interesting people ask for Nick)! You will not be disappointed! He is fabulous and has a handle bar mustache, which I love! Our table is ready, so off to the patio we go. You can still hear the music, so it's perfect. There is seating inside but the patio is the way to go. It's covered and was enclosed for weather like we had that night. On to the food. One word...HUMMUS! Oh my! It may be the best I've ever had! Amazing! The owner said it was his mothers recipe (she was there too by the way-so cute) and that she doesn't even like hummus...and didn't even want to put it on the menu. She only agreed if she could modify the recipe. I don't know what she did to it, but she made the most delicious modification ever! Now dinner...how could things get any better! Rewind to us sitting at the bar...I see a plate of lamb chops pass by! I'm a huge fan so I immediately know I want to try some without having seen the menu. My friend and I shared a safron chicken kabob plate and the lamb chops. They did not disappoint! Definitely a must try! I will be back just for those. The chicken came with some veggies, grilled tomato and some fantastic rice!  We were too full for desert but I can't wait to try some Turkish coffee (almost every table had some) and baklava next time! There is not one negative thing I can say. The people, the ambiance, the food...all outstanding! Go there as fast as you can!!!!!"], ["Faye C.", "I'd give it 10 STARS if I could!!!!Absolutely the best food!! We have never had a bad meal there. We LOVE the hummus!!! It's the only one we'll eat!!! We have friends come from other U.S. states & other countries, this is the 1ST place they want to go to and always want to go again!!!! Staff is beyond awesome!! Love the live music on the weekends!! The owner & family members are great, they are always there & ready to make your experience a fantastic one!!!!!"], ["Staci S.", "This place is my jam. They have a special every night of the week. Tonight, Tuesday, they had $15 bottles of wine and discounted tapas. The staff makes an effort to make you feel at home-- just like you're in Greece."], ["Antoinette D.", "Small place, super busy, won't seat you unless all of those in the party are physically present(understandable given how busy they are, wish we would have known that before hand).Best hummus I've ever tasted! The other food that we tried was delicious as well! Love it!"], ["Dan A.", "Taking a tip from the other yelpers, I tried the lamb roll and just wasn't that impressed with it. Didn't get the flavor that others had described. It was decent with tzatziki sauce though. Positives were the hummus, customer service, and random paintings on the wall."], ["Pollyana V.", "Wow! Way better than I expected. Came here with a party of five. We were immediately seated and the place was pretty packed. The waiter was fantastic, Ivan, I believe his name was. We all ordered various tapas and The waiter choose a couple. Food was fantastic.All in all, would recommend. Definitely going back."], ["Annabelle H.", "I can't say enough good things about this lovely restaurant! I have been here a couple times before but on a recent visit with my boyfriend, my love for it really grew! Nick is the best server ever. He treated us so well and was so generous with port and desserts; it really made our experience memorable. If you are able to, sit in nick's section (hopefully on the patio), and enjoy some amazing appetizers and tapas while you listen to live music. This is the perfect date spot or just a night out with girlfriends."], ["Amanda M.", "Love this place!! Try the pomegranate shrimp, hummus is a must, and the chicken-potato salad was to die for. Great service and fun atmosphere!"], ["Andi W.", "OMG! Best humus ever! I don't say that lightly, this was the smoothest, most delicious melt in your mouth....I'm getting hungry just typing about it! Must go back again this week! We also ordered the Ziziki dip and the Russian Chicken salad, both also amazing. The staff was also very welcoming and kind, made you feel like a member of the family. I really love this place. If you plan on going and don't want to wait, make sure you get there by 6 or make reservations, the space is a little bit small and fills up fast."], ["Marjorie H.", "This review is long overdue in fact I don't know why it's taken me this long, selfishness perhaps. I can't say enough great things about this perfect slice of heaven, but I'll certainly try. Not only is the food perfection, but the staff and the owners are the best in the business. They're all so attentive, genuine, kind, worldly & lovely people who treat all of their customers like family. Bottom line is that they are all such great people & it's a breath of fresh air to see people like them exist. The food is impeccable every single time you visit, Consistency is definitely their strength! When dining here, you almost feel like you've traveled to your own beautiful & exotic secret getaway so needless to say the atmosphere is also perfection. As soon as you leave, you're left wanting more & planning the days of your next visit. We love, no better yet we're PASSIONATE about Cafe Izmir & everything about it!!"], ["Stephanie A.", "When they say best tapas and hummus in Dallas, they aren't kidding.  We are repeat customers and have never had a bad plate or unhappy experience."], ["Patrick L.", "This is an example of a restaurant where even if the food was bad...you'd go back due to the outstanding service. Everyone makes you feel like family and are extremely friendly. Having said that...the food is outstanding as well. They brag a bit about their hummus and with good reason. It is simply divine. We attended for our second visit on NYE and our out of town guest were still talking about it the next day!If you are looking for good Mediterranean food, stop looking now and go to Cafe Izmir."], ["Andrew A.", "Cafe Izmir's is definitely somewhere I will be returning."]], "Casa Rubia": [["Helen M.", "The food was amazing.  We started with some cheeses and meat, followed by the squash and goat cheese, octopus, scallop dish and finished with the paella.  There was not a single dish we did not like."], ["Jennifer S.", "Such an elegant and refined dining experience!  We stopped in for champagne, wine, charcuterie and cheese and were not disappointed.  The cheese and charcuterie platters are amazing and everyone around us kept asking what we ordered.  It was a great date night spot!The service was professional and attentive too."], ["Sheri C.", "Perfection from start to finish!  Booking a reservation for six was no problem at all and we had an excellent table.  First off, Jamón Ibérico de Bellota! That's right, acorn fed Ibérico ham...Sooooooo goooood! The paella of the day was stunning to behold and perfect for the six of us to share ample portions.  The scallops were to die for!  Although there were only two, they were huge and heavily seared giving it a wonderful flavor and texture.  The fideo was literally scraped off the plate to get every last bite.  We had more, mussels, artichokes, anchovies, so much I can't remember.  Everyone around the table was raving about every single morsel placed into their mouths!The service was stellar!  I was feeling sick and the server even made me mint tea to help settle my stomach.  So thoughtful!  I'm not sure why this place doesn't have higher reviews. This tapas spot is perfect for groups so that you can split and share the goodness.  My husband and I will definitely be back with more friends."], ["James S.", "Excellent service. Authentic dishes. If you want to know what authentic Spanish food is like, this is the place to visit. The Paella was exactly like Paella's found in Madrid. The cauliflower confit was outstanding. Our Manchego cheese platter was provided on a tree platter was outstanding. Even the Berola wine, which was recommended by our server, was top of the line. Atmosphere was unfortunately a bit loud (like most restaurants nowadays) but beautifully designed."], ["Melissa G.", "See my check in!!! Bananas good! Loved everything here!!! Now enjoying three desserts that are orgasmic. Get here...now."], ["Angela L.", "The prices at this restaurant are nothing short of outrageous. One pays here for a tapa plate what one would expect to pay for an entree plate at any similar restaurant in town. Example: A chicken breast tapa, described by our server as \"half of a chicken breast, about 3 bites.\" Price? $14.00. Yes, you read that right: Fourteen dollars. Wow. Just wow. That is some very fancy chicken breast. And that is all I have to say about Casa Rubia. I predict an early death for this place, judging from the other reviews it has garnered here on Yelp."], ["Jason S.", "This is labeled as 'Tapas/Small Plates' for a reason:  They are small plates.If you acknowledge that fact, then 'Casa Rubia' can be a wonderful experience.The servers were friendly and attentive, the atmosphere was fun & hoppin'.They have cocktails & sangrias.  The wine list is all Spanish, and they have an impressive variety of Sherrys & Ports.All of the dishes were presented very well.  Photogenic food.  I love admiring my food, even with all the groans that it incites from my dining buddies who are forced to wait whilst I soak in the captivating sights.By the kitchen, they prominently display a 'PolyScience' 'Anti-Griddle'.  I am a big fan of modern technology & techniques for cooking, both at restaurants  & at home.  Displaying such a fascinating piece of tech so openly, it felt like they were mocking my inability to rationalize such an expensive cooking related purchase. (Curse you fiscal responsibility!)  It was fun to actually see one in person; 'twas a shame I didn't get to see them actually use it on my visit.Food:-Bunuelos de Pollo:  These little fried balls were good, but not for the reason I was expecting.  They are listed as having a chicken, jamon & a cream, yet I couldn't taste any of those.  It was all cheese to me.  Therefore, they were fried cheesy goodness instead of fried meaty goodness.  In the end, goodness is still goodness, but the menu is still misleading.-Boquerones: Anchovies & a potato salad.  'Twas okay, anchovies were less briny that lesser anchovies, and the potato salad was slightly better than a store bought salad.  Ultimately, it ended up just feeling like I paid a lot for stuff I could easily buy in any grocery store for much cheaper. -Alcachofas: Crunchy artichoke hearts with aioli and Mojama (cured Tuna).  I enjoyed the crispiness of the hearts with some Majoma.-Monkfish:  The fish was very flaky.  I would almost say cooked too much for my tastes.  However, it came with a broth and kale to moisten it and make it more palatable.  A rather fishy dish.-Seats: Awesome dish! Mushrooms & a (I assume) sous-vide egg!  The mushrooms were great, but that egg was stellar.  At first, I thought it was a raw egg, but then I took a bite and instantly recognized that texture that I've experience elsewhere.  Even if it was not made sous-vide, it was the same texture, and therefore still outstanding.  -Costillos de Cordero: I had just had lamb ribs at 'Hibiscus' a few weeks prior, so inevitably these have to be compared.  I thought that 'Casa Rubia's rendition was inferior.  They were still good, and had I prolly would have loved them had they not had such competition on my taste buds.  These just weren't as flavorful, tender or crunchy as those at 'Hibiscus'.-Pork Spare Ribs: Cured & Tender.  These were like tender 'Rib Bacon'.  More tender & flavorful than the lamb ribs.  The figs on the side were nice and made the dish more presentable, but I can't really say they added much to the flavor profile of the dish.-Pan Calatrava: Genius! I love custard, and this is custard heaven.  Custard on Custard on Custard! It's just like meetin' a whole Custard Family, and then proceeding to eat 'em all (politely obviously, I must be cordial with the custard family).  Did you know custard was the first dessert to cross the Atlantic on its own?  It was also the dessert of choice for the great Roman Emperors.  Maybe those little factoid aren't true (maybe, I didn't do rigorous fact checking for this review, but it could be true) , however these tidbits display the greatness that custard has achieved.  My thought process whilst eating went as such:  \"Mmm, this custard is delicious -   and this custard is delicious - and this custard is delicious.  Mmmm, these custards together are delicious, and these custards together are delicious, and...\"  Hopefully you get the idea.  --  I like custard; these were good custards.  I was especially happy with the bread puddin' which was very moist, which is what most bread puddins lack.   I understand it is such a simple concept, just combining 3 different desserts, but each element was a good rendition of its respective dish, then combining them just enhanced my enjoyment of 'em.  I am in love._______________Conclusion:As long as I could ignore the price & portions, 'Casa Rubia' was a delightful experience.  'Trinity Groves' is pleasant, the atmosphere was fun, the food was presented well & it usually had flavor to match.  They make use of modern techniques and technologies that really make fancier restaurants stand out to me, and thus makes me more willing to part with my money to witness how professionals utilize 'em.And of course, that Flan+Bread Pudding+Ice Cream Combo just blew my mind."], ["Janet T.", "The food and cocktails were wonderful.  We think you should certainly try this pace of you have interest in food was a Spanish flair."], ["Kathy L.", "I had an overall good experience at Casa Rubia. We decided to go to this restaurant after seeing it was one of the top 10 restaurants by Texas monthly. We went with another couple so we could try out more items on the menu. We started with the croqueas de maiz and bunuelos de pollo which were probably 2 of my favorite things on the menu. It had some spice, which I'm always looking for. We also had the octopus and the black cod. The items were small for 4 people but each was presented well and I appreciated the balance in many of the seafood dishes. A cute spot with many options."], ["J F.", "Amazing. Ordered three main plates, the short rib, the beef, and the one with shrimp, calamari, etc. also got some manchego and lardo appetizer and the bread pudding w/flan dessert. Amazing. For all that the bill came to $90 but was enough to leave 3 people pretty stuffed. The main plates are supposed to be tapas style but to be honest the portions for each are about the size of a normal entree at an upscale restaurant. Nice atmosphere and excellent service. A pricey meal but definitely worth it. Have to be back to try the happy hour menu."], ["Whittaker P.", "Ate dinner here on Friday night and really enjoyed it. Came with a group of four and had a great time.  Sat outside and enjoyed the majority of the menu. I would have to say that almost every plate was cooked perfectly and we even ordered a few items twice because we wanted more. The short rib was the highlight of the night in my opinion. The only reason for the 4 stars rather than 5 was because one person out of the group ended up sick later in the night but I think it's because he ate shellfish and he might be allergic.  Other than that setback the service was great and I would highly recommend coming here for a casual night with friends and a big appetite."], ["Lee R.", "Each of the Trinity Groves restaurants is great in its own way, but Casa Rubia is heads and shoulders above them all in the level of skill from the chef and in terms of service, ambiance, and mixology from the bar. Especially for a *special* evening out.We entertained guests at Casa Rubia last evening. These discriminating epicures from Seattle were very impressed.Casa Rubia is now my favorite special occasion restaurant in all of Dallas.After dinner, we walked around to the north side of Trinity Groves for dessert at the more casual Cake Bar *and* to assemble a box of take-back-to-Seattle jewels from Kate Weiser Chocolates.Following that, we walked up the walkway to the Continental Pedestrian Bridge for incredible views of the Margaret Hunt Hill Bridge and Dallas skyline.  Dozens of visitors and families of all demographics were out having great fun and seeing the view.NOTE: I do wish Trinity Groves would make it easier to *get* to the walkway.  Between sudden stops of sidewalks and massive parking signs blocking sidewalks (hello, ADA?) you have to tromp through grass on step into traffic to get from the restaurants to the east side of Gulden. What a shame, given how much public money is going to pay for improvements in Trinity Groves."], ["GO O.", "Over-priced and under-tasty. Restaurant has a good menu, but the execution is terrible. Prices are for \"entree-level\" dishes but sizes are tapas-style (too small). Repeat. Sample sizes too small (for the price). Dishes are unnecessarily intricate and cocky, focused too much on \"cool combinations\" and flashy presentations, rather than on authentic Spanish taste. Service was sub-standard and the waiter's \"nice-ness\" seemed forced, not authentic.I would stick to ordering the small plates ($8.00 range) and shy away from the complex dishes."], ["Jesse G.", "portion size on small side...great service at the bar...I'll go back with friends and try other items"], ["Tiffany D.", "Very disappointed this place. Love tapas and was looking forward to trying this out. We tried the cheese and meat combo for an appetizer, octopus, mushrooms and short rib. 5 plates, plus a few cocktails and we spent over $120. And we left hungry! I get that tapas are typically small portions but these were ridiculously small considering the price per plate ($15-$18). Overall one of the worst restaurants I've tried in Trinity Groves (love Chino and Amberjax)If you're wanting good tapas that are actually filling and the appropriate size/price, try out Victor Tango's. Never going back to Casa Rubia again"], ["Angelica S.", "The Paella is delicious and generously serves 4- maybe more! I met a friend here for a girls night but I plan to take my husband as I enjoyed the ambiance as well as the food. I spent some time in Spain some years ago so  I'm thrilled to have a tapas experience to share here in Dallas that impressed my palate this much."], ["Erica T.", "The bf and I were so excited to try the much talked-about tapas restaurant. We went on a weeknight right before closing, and it was not crowded. Our waitress was quite friendly and helpful and informed us about the tapas style servings. We knew that going in, and having been at other tapas restaurants, we thought we knew what to expect. We saw the prices and we figured we were in for an unforgettable, gourmet treat.Not quite. We ordered the mussles with roe. About a dozen were presented cold, in a row out of their shells. The citrus flavors were not exactly my favorite. I guess I prefer my mussles served in the shell and warm.The corn meal and chorizo balls were not bad, but they seemed like glorified hush puppies. The scallops served were cooked perfectly, but the bf and I were not sold on the herby flavor used. The saving graces of the meal were my bf's Estrella, my red wine, and the octopus - pulpo a la plancha. The pulpo was delicious. It had a nice grilled flavor, and the accompanying sauce was flavorful and complimented the octopus well.Be aware, the serving size really are small, (no s**t, Sherlock, I know), but I wasn't expecting tiny.Overall, the food was underwhelming. I don't mind paying for amazing food, even if it is a small portion. But the fact that one out of four of our tapas was mind-blowing delicious makes me not want to go back.  I'll stick to tapas happy hours with pretty good food that won't break the bank.  Props to our waitress for being friendly and helpful, though."], ["Jackie K.", "A good evening...The rabbit pate was delicious, as were the pork cheek and shrimp entrees.  The jamon iberico and chocolate dessert were the standouts, though--delightful!  And I found it really fun and different that they also included a sherry menu instead of only a normal wine/cocktail menu.  Food was definitely good but nothing that makes me want to go back immediately.And...it's always a big no-no in my book for a restaurant to take reservations and yet require guests to wait, even when they arrive on time.  We arrived on time for our reservations and had to wait 20 minutes...not a great start to the evening.  It would have been nice for the restaurant to at least provide free drinks to enjoy while it made us wait."], ["Matt R.", "Casa Rubia  might be the best new restaurant in Dallas. Yes it's hard to get a reservation and the plates are priced like entrees and the size of tapas. However the food is some of the best I have had in a long time and this place blows away the rest of Trinity Groves - with the exception of their neighbor Souk.  We ordered half the menu including some chicken small plate, a tomato salad, a small ham and cheese plate, lamb rib, short rib - which fell off the bone, shrimp, scallops, the artichoke which was amazing, and mushrooms. Excellent wine, sherry, port, and cocktail selection as well. 2 hours later and I'm stuffed!Seriously this an incredible meal, great service, and who can't complain about sitting on a porch in July for 75 degree weather.  PS. The one star reviewers should be ignored and sent to a McD's for some  fine cost effective dining.  Actually the hot dog place across the street isn't bad either:)"], ["Christopher D.", "I went to Casa Rubia for a birthday dinner with a group of 9 (one was a high schooler, so 8 technically). $600 + tip later I'm wondering where we went wrong. Who ordered the grated Unicorn horn and Loch Ness Monster ribs? Who requested that Jesus come down and go back in the kitchen to make the wine and come out for autographs and selfies? There was not a single dish that I tasted that WOW'ed me. There was absolutely no remarkable plate that I will rave to all my friends about or come back and ask for. To boot, not a wine or cocktail in the house could be paired with the dishes to pull them out of the weird culinary purgatory they rested in and unlock their potential for excellence. Nothing was gross or bad in the least; everything was cooked appropriately so that tenderness or texture was superb... but overall it was just a MEH. There was no \"... MMMMM. Oh my god that was amazing...\" arising from anyone at our table... just a bunch of head nodding and the occasional \"it's good.\"Complex experiences were minimal (despite choosing a bunch of items listed on the \"Complex\" end of the menu) and quite frankly I think it's a bit pathetic that places like this exist in a city where I can pay less than $50 for a pretty spectacular and satisfying plate of outstanding cuisine that sings and dances on your palette (I told our host that we should have gone to Gemma on Henderson instead). Mind you, there was a lot (of options, not food in general) brought to our table... Octopus, Lamb, Duck, Squid Ink, Clams, Mussels, Pork Cheeks, the daily Paella (which was good, but takes 40 minutes to come out, yet packs less of a punch to your tastebuds than a side of rice from a random Taqueria... YIKES), a couple charcuterie boards, and all three desserts that CR offers, among other items. While each choice was naturally covered in various sauces, glazes, or complementing carbs, they may as well have been cooked and served as is. There was barely a flavor distinction between the lamb, the duck, and the pork cheeks from a dish composition standpoint. Every dish was like a model that is amazing and otherworldly when she's alone or in a room of average people, but once she's in a lineup of other models she blends right in and becomes a regular ol' wallflower. The lesson here is that pretty food that lacks individual personality is awfully depressing, but especially at these prices.  The waiter was good and the service seemed worthy of the ambience... but the taste of the food was so gah-damn uninspiring that I have to wonder if I have to have some specially trained tongue that can taste something unique, something wonderful, something flavorful, some sort of X-factor to justify the expense under the pretension and window dressing.Needless to say, I won't return. As the legendary Patti Labelle once sang: \"Somebody loves you, baby, and you know who it is.\" Buuuuut it most definitely isn't me Casa Rubia... it ain't me."]], "Sangria Tapas Y Bar": [["Ashley T.", "A girlfriend and I were looking for a fun place for drinks and something light to eat. We split a pitcher of the sparkling sangria which was refreshing. The goat cheese croquettes were delicious, the pan con tomate was great and the meatballs were good. Not a fan of the tuna. I found it overly peppery. I couldn't taste anything but pepper and it really ruined it for me. Over all though the experience was great. They had 1/2 priced bottles of wine and we may go again just to take advantage of that special."], ["Khloe S.", "Went here with a group of girlfriends (about 8 of us) on a Saturday brunch. I arrived before everyone to make sure our reservation was there, which it was. I went to the bar for a pre-brunch drink, and sat there for about 10 minutes with no one acknowledging my presence-which was kinda awkward considering the place was so small, and there were so many waiters, and NO patrons. The place was not busy at ALL. Like maybe 4 parties there, so there was really no excuse for poor service. This proved to be the theme of the day, with me chasing down our waiter so that we could order food/get more drinks. I actually had to go to the bar and order more drinks that way because we had been ignored for so long.Brunch was pretty good; I got the tacos, but I could tell my friends didn't like the sweeter options (pancakes and french toast). We got pitchers for the table, which after review, weren't worth it. Don't get me wrong, they were cheap and the sparking was definitely better tasting and stronger. But for the price, we should have been getting at least 5 glasses per pitcher for it to be cheaper than the individual glasses. We got about 3.5/4 glasses per pitcher.Probably won't returnTLDR; service sucks; sparkling mimosa is better; just get individual $2 glasses for brunch instead of pitcher"], ["Omar R.", "I went with a group for a Birthday. Overall experience was good, it can be better.Service was average, they locate us in the same exact entrance. We were 1 feet from the door, I did not like that. We made a reservation, that did not help as you can see.The Sangria, mehh, it was like Juice.We ordered some Tapas, for what I remember, the Cheese table was very good, the Patatas Bravas were good also, the Tortilla was amazing. My wife way that the Potato of the Tortilla cannot be boiled, it need to be fried. She likes it but she say it can be better, I don't mind. We bought some meat on a stick ( i think it was lamb) it was Ok, nothing special. Overall, the tab was less than I expected for the quantity of food of what they serve, I would really like that they placed us in other place other than the entrance and less juice in the sangria."], ["Mark M.", "Wow what a letdown.As a chef I came here with a group of chefs from around the country 10 years ago and it was great.  I happened to move to Dallas and it's a block away from my new place.Tried it tonight and absolutely terrible.Service was poor and the food was worse.Flavorless and non inspiring.It's a dying concept unless someone with some passion takes over. Avoid at all costs."], ["Mario G.", "I was hoping a lot better from this place. Every menu item we ordered was a buyout product and tasted terrible. Even the meatballs were bad. Somebody please rescue this place."], ["Stefanie C.", "This is by far one of my favorite tapas restaurants. It's a tiny place so make sure to make a reservation. Otherwise I suggest being patient and waiting. It's totally worth it. Their red and white sangria is awesome! I typically drink their red in winter and white in summer. They sell it by the pitcher if you choose to share! For food their bacon wrapped dates are absolutely amazing! Sweet with a nice meaty flavor. The garlic shrimp is awesome! If you're on a date beware! They are heavy in garlic flavoring and coated with olive oil but oh so good! The clams and muscles are amazing. They are served in a garlic sauce with chorizo and potato chunks! So much flavor and spice. Honestly I haven't had anything new here I didn't like. Prices are reasonable and portions fitting to the price. I'm one who doesn't like picking just one dish and sticking to it so the idea of tapas is ideal for someone like me who wants lots of options to pick at. The service here is wonderful. The staff is so friendly and quick. They're great with recommendations. This is a great place for a date night or just to hangout with friends. If you can't find parking they have a valet on the side."], ["Mimi B.", "I've been here a couple of times and it's what I remembered of it. Perhaps it's better during happy hour, but the normal prices for this food and drink aren't quite worth my while. I'd rather spend money across the street...at any of those places. The pomegranate sangria is funny. It has nothing to do with pomegranates and tastes like apple juice. $6.50 is not worth that glass. The caprihini is strong. Better. We got clams and mussels dish, shrimp and crab croquettes and some toasted mushroom feta ravioli. All solid, but nothing wow-ing. The ravioli is fried basically and had a lot of feta inside. The shrimp and crab croquette reminded me of an asian shrimp ball. And the clams and mussels were flavorless (but not fishy which is good). It's a bit of a joke though bc you get about 10 of a combined amount of clams and mussels...for $10. Whereas I could go to the porch and get a pound of awesome mussels for $13.  In reality, mussels cost $2 a pound, so perhaps that is expensive...It's not about the money, it's about the value! I'll pay a ton for something that's worth that much, but I'm not out to waste money on something that's not that good. Sangria is a Spanish tapas place with a good concept, but I don't think I'll be that willing to come back.."], ["Yuni E.", "Ok let me start by saying that the place is very cozy not for kids at all I did go with My children and friends from out of town, so here it goes for starters we have a crab stuffed avocado, the lobster soup, figs with nuts and cheese wrap with bacon and some flat bread, the food was tasty and the portions for sharing where good, also there is live music and I like that they also have valet parking (so bring cash for tip) only if you plan to use it, the sangria was good but not as tasty as other places overall a good hangout place with friends for Friday with a layback ambience and not really that expensive. Note: please ask for specials because they may have some good options that are not in the menu.Also expect the food to take a little long to be served but worth it."], ["Lara M.", "Amazing food and sangria!  Loved the ceviche and fries avocado. They have a great patio and nice indoor dining as well. There is something for everyone on their tapas menu. We tried the red and sparkling sangria. Both very refreshing. Yum!"], ["LaKeshia S.", "Great Sunday brunch option! Live music as well! The $10 pitchers of mimosas or sangrias is a good deal! Food was pretty tasty as well!"], ["Tim W.", "We had the portobello mushrooms, bacon wrapped dates, tenderloin and Creme Brûlée for desert. Everything was very good."], ["Don T.", "I stumbled across this place on shear luck, and man Oh man was I surprised. Great atmosphere, excellent service, and great food... We had the calamari, fried ravioli, seafood paella, Spanish meatballs, sparkling sangria and coconut mojitos... All fantastic... We'll definitely be back!"], ["Theresa C.", "This was my first Spanish Tapas restaurant/bar experience. Being a Latin American foodie I must say that I was more than satisfied! The location is kind of hidden and does have a patio with a view (sadly it was construction filled for now) that will be nice soon. They have 3 different types of Sangrias (yes we tried all and yes they were all amazing), several types of Mojitos and many other mixed drinks. Matter of fact, their 2 page menu consists of 50% alcohol. We tried the salad with peaches, pan con tomate with manchego and prosciutto, meatballs, and fried ravioli filled with portobello mushrooms and truffle sauce. Each bite left us wanting for more. I could go on and on but that would bore you. Just go try and it. Best place I have ever eaten, hands down!!"], ["Radu C.", "Here's a place that has Uptown living written all over it! Friendly staff as well as crowd and customers, always lively and famous for their weekend brunches that leave you mouth watering over their tapas food & amazing deserts ( best Tres Leches since ....Tres Leches!! )... Add that up with the live music duo Sunday mornings and you've got more variety than a trunk show! Enjoy this wonderful experience!!"], ["Giselle B.", "I love sparkling sangria, best in town, and the shishito peppers and manchego croquetas, are my sunday brunch treats. Service and food quality are consistent, but I prefer more simple and healthy food (too much sauces, grease and processed ingredients in most of the plates) . Another minus are the waitresses rushing with the check... Happy hours/brunch prices are fantastic, as well as the front terrace. One of my favorite sangria spots for this summer weekends."], ["JJ P.", "Love this place!  This was the first Tapas restaurant my wife and I fell in love with in Dallas.  We love to shop at the Knox street area stores and come here for lunch.  Last time we sat outside, where they have a really nice covered patio.  Got a pitcher of Sangria and ordered up some tapas.  Last time, I got the paella, which was awesome.  This place is weird because in addition to the Spanish flavors and the tapas, they also have Greek items, including traditional Greek moussaka and baklava!  They also have homemade pasta and Italian items, such as ravioli and tagliolini.  I have not had these items.  We stick to the tapas, but people around us have gotten this stuff and it looked great!  Maybe someday...."], ["Lauren B.", "Came for brunch and it was delightful! So yummy. I actually had a special of the day which was a crab stuffed avocado. While super tasty and filling, it was a small portion, so if you're going to split it consider more than one. I added two eggs to make it more brunchy.The Greek breakfast is also great. Everything our table got looked awesome. The best part may be the $10 pitchers of Sangria, though! Normally $22, it's a steal. Sparkling was my favorite but the red and pomegranate ones weren't bad. Live music was also played but they only stayed for about 30 minutes and then never came back? Wasn't sure what happened. All their stuff was there but it seemed like a long break that just never ended. Eh. Oh well.All in all, great brunch!"], ["Naser A.", "Best tapas I've had in a while! It was an amazing experience from drinks appetizers to main dishes to dessert! We had the mushrooms, clams, duck, meatballs and the tres leche cake! The pitcher of the pomegranate sangria was beyond tasty!!!"], ["Mindy C.", "Food- 2 stars (decent)Staff- 1 star (read below, 1 exception)Price- 0 stars (very expensive, but not worth it)Place has potential though and the above is really all you need to know, but if you want more details (I will make it as brief as possible) read further.A friend was hosting a birthday dinner here (9 attendees) & had reservations. 2 of us arrive before the others & we're told we cannot be seated until everyone else arrives. This situation makes things awkward because there is no waiting area, literally, & the bar area is SO SMALL (which is where we ended up waiting). Then 2 other people arrive after us saying they have a party reservation as well BUT THEY GET SEATED! I was obviously outraged about this because they had our exact same situation but were given an exception. From the bar I see all of this, so I return to the hostess station to inquiry about it. I am told that they are part of our party & that we can join them. I did not think they were part of our party (they were pretty old) but I didn't know all the attendees, so I go over there & nope; they were not part of our party. In fact, I find out that they didn't even have a reservation and were just given our table. Back to the hostess station, and the host tries to scramble for words. She tells me she will take care of it. After waiting some time they put together a table right next to the walk way & makes for a terrible location as people keep rushing behind us and we're VERY CRAMPED through dinner. Back to the bar, the bartenders were very nice. They make 2 special drinks every weekend and have them pre-made. I wanted to sample one before ordering a glass of it and they allowed me to, so I was very pleased. The drink had a good flavor, but could have used more alcohol. The lamb chops we ordered (3 very small pieces) ended up being $28, which is completely ridiculous for a tapas place. It wasn't that it was bad, but it just wasn't that good either; pretty bland without sauce. We also ordered the cured meats platter, but they charged extra for bread/pitas (unusual). There was a surprising amount of seafood dishes on the menu too. Some of the guests we went with only ordered 1 plate and even shared because of the expensive price (I presume), so it wasn't a normal tapas experience. I believe the small salads were around $12 too, which would've been acceptable except that it was tapas sized. The restaurant was cute though, great decor, easy parking, and had a lot of potential. I, however, will NOT be returning."], ["Damian C.", "When in Dallas, you cowboy boot up, eat tacos, and blast some country music.While two of the three are musts at all times, sometimes you need a break from the tacos.  Our break from tacos came in the form of tapas from Sangria.  To start, make sure you score a patio seat.  There is never any reason to eat inside.  Ok, yeah, I know I am from Chicago and I mark days off on the calendar until it's nice enough outside to dine al fresco, and I know places like Texas hit the 90s and 100s regularly and it is a bit uncomfortable to be outside.  But just try to score patio seating anyway, with the cool breeze as your companion blowing all around you.Second, load up on sparkling sangria pitchers.  Girly?  Sure.  Delicious?  Yes.  I am a  red drinker to the bone (and a whiskey and bourbon drinker as well, sir) and was leery of my co-workers decision towards the sparkling.  She had it right, though.  The perfect beverage to chill out.  Literally.  Just be sure you ask for more berries... a total of 12 raspberries and blackberries is never enough.Third, the ham & chicken croquettes.  If you pass these up YOU ARE CRAZY.  Single-handedly the best thing on the menu.  Creamy, crunchy, served with a side of sauce you will want to drown them in.  One could easily eat all four of them but sharing is caring, right?  Do you care about your dining companions?  I don't sometimes, so it's ok.Fourth, the ham and cheese pan con tomate.  This is literally a must eat at all the tapas places I dine at in Chicago, and Sangria's version did not disappoint either.  It's a simple dish in that it is bread, tomato, ham, and cheese, but simple is yum and this was no exception.  I was glad the bread was super crusty, like, bruschetta-style, and was not overly soggy from the tomato.Honorable mentions go to the meatballs, dates, and toasted ravioli.  Clearly we were not ordering healthy options.The food is great, but the portions are pretty small overall.  I know it's \"small plates\" but every bite left me longing for more and I felt like I just had barely enough of anything.The damage for 2 pitchers and 5 small plates came to around $100.  Not bad, especially since liquor was close to have of the cost.  If only tap water were as delicious as sangria you may save yourself some dough.No reservations unless your party is for 6 or more.  So make sure you have 5+ besties to dine with, or don't mind just walking up."]], "SĒR Steak & Spirits": [["Chabeli L.", "My husband and I recently had our 80 guest wedding reception at SER. Magdi, the general manager, was always available to answer questions over the phone and in person. We met with him in June and several other times before our August event to discuss seating arrangements, service, and food. From the first meeting I asked him for impeccable service and it was truly delivered. All of my guests were impressed with the beautiful downtown view and the delicious food. The Millionaire Pie was a hit!"], ["Jerome B.", "The view from this place is great.  Drinks were good.  However, the food wasn't... we didn't even finish what we ordered (Work meeting)... even worse, the prices. For that, i was expecting good food... not something that was barely palatable."], ["Tom L.", "Here I sit, still in this place. If it weren't for WT singing in the bar, this place would be a complete waste of real estate. Great view of Dallas while you wonder where your waiter went. Don't bother. Enjoy Nick and Sam's for dinner, then come back to listen to WT over an after dinner drink - if you can get someone to actually wait on you."], ["Carol A.", "This place is amazing! Very low key environment and the steak is amazing. If you're a meat lover you must try the Waygu Big Rib! It's to die for!!! The creamed corn is also a keeper!"], ["Mark H.", "Great place, food was fantastic, service was even better. I'm from California and the wine was fantastic. Highly highly recommend this place. Group of 8 of us and we all loved it."], ["Mary Jo Lisa C.", "Why did I just pay $60 for dinner for one and my tummy hurt????!!!!! In Dallas (not by choice...trust) and people told me not to walk outside after dark so I thought, hell I'm in one of my least favorite states in the Union, why not treat myself to a fancy smancy dinner? The view is nice, but its Dallas...meh. The atmosphere of the restaurant is really nice and open kitchen so you the chefs doing their thing. The servers and waitstaff are very pleasant and attentive! The menu seems very promising with foie gras, steaks (of course), and all sorts of other yummy words and phrases. Getting excited!!!! You ever been on a date with a really hot guy that all the ladies stare at and want to be holding their hand as you stroll through the park? And then you sit on a bench, everything is perfect...a slight Fall wind sweeps your hair across your face as you lean in closer to him for warmth and he reaches out to move your hair from your face and then his hand lingers near your cheek and you think to yourself omg this kiss is gonna knock my uggz off all the way across the park and gonna hit that crack head homeless guy across his head so hard it's gonna bring him to his senses and make him go to rehab tomorrow...but I digress... You anticipate the kiss is gonna be the awesome, and then his lips meet yours  and...Dude!!! WTF???? What is this crap I'm eating??? That's how I felt eating at Ser. Hoping and yearning for so much but complete let down. I ordered the heirloom tomato salad with burata and omg it looked amazeballs!!! Beautiful tomato the ooey gooey burata so beckoning. But then there was this white and black substance on the side that I assumed was seasoning. I haphazardly sprinkled it all over the dish cause the tomato needed salt. The menu called  it the gin fizz. It left a horrible taste in my mouth. It was assaulting and weird and served no purpose on the dish. Completely ruined. Please, Mr. Ser Chef, stop putting that crap on the plate. It leaves a lingering unwelcoming taste in your mouFor entree, I ordered the salmon. Small portion with a sprig of brocollino which I assumed was garnish. This dish was confused...it was trying to be Asian, but it seems like the Mediterranean side was fighting to make its way out. I love dishes that are small in portion cause god knows this country needs to stop thinking bigger is better. It's not the size, it's what you do with it. It just left me confused :( I do have to say the salmon was perfectly cooked. But then again, so is the miso salmon at the Cheesecake Factory.On top of all that, my stomach is doing strange things. I should never trust anything that says \"fizz\". Lesson learned once again, it ain't all about the looks ;)"], ["Leslie J.", "We thoroughly loved our meal at Ser!  The steak was cooked to perfection and the Molten chocolate cake was to die for. We lreally enjoyed our waiter, Robbie, and you can't beat the view!"], ["Lisette C.", "While staying at the Anatole I heard a lot of buzz about Ser.  I was fortunate enough to be taken there as a guest and I was truly blown away.  The service here is IMPECCABLE.  The views are stunning.  The food, INSANE.Our server (whom I wish I could name) was so incredibly professional and discreet.  It was as if he was there at the exact moment that we needed him, but he never interrupted our dinner/convo - how is that possible, right?  We took each of his recommendations including he Spinalis, which others have raved about too, and it was fantastic.  The drink menu was delivered on an ipad, which was a bit confusing, but cool.Our berries and cream Dessert was fresh and delicious, and true to Texas, it was enormous and rich despite being the lightest option the menu - LOLBottom line, this place is cool.  Really cool.  Check it out if you are in town."], ["Sarah V.", "As with the rest of the Hilton Anatole, SER welcomed our company with great service and attentive staff. It was also the highlight of my stay in the Anatole because, thankfully, the food is good! Unlike everything else coming out of the hotel. We dined on crab cakes and the lobster bisque during a special lunch opening and both were wonderful. Not too filling, and not overpriced, IMO. The crab cakes were more like lumps of crab with seasoning and very little breading. Sister girl over here approved. And the remoulade on the side had just enough kick to balance out the lemon and crab. The bisque was really flavorful but not overpowering, and was a great start to our meal.The service was quick and proper (plates were served to the left and collected from the right, etc.) And SER has a great view of downtown Dallas, which looks great at night during receptions and events. SER wasn't my favorite meal in Dallas, but it was definitely my favorite from the hotel!"], ["Ashley S.", "View gets five stars. Everything else gets one star. Ordered a \"signature cocktail\" that was awful. I know I was trying something a little different (bacon-infused liquor and maple and something), but it tasted like sink water. I am very thankful that the waiter removed it from our tab. I apologized for not taking his recommendation, but I wasn't in the mood for sweet or vodka and thought I couldn't go wrong with any of the signature cocktails from this \"steaks and spirits\" top-notch restaurant. Wrong. Beer was good. Mushroom soup was wonderful, but - as with almost all their dishes it seems - they rely on extreme amounts of cream and butter and salt to make anything taste so wonderful. The creamed spinach is another example. Creamed spinach is, well, creamed, but this was more like spinached cream rather than creamed spinach. Couldn't handle more than a few bites. At least the cream and butter in the mushroom soup made that dish irresistible, but the creamed spinach was just obnoxious. Service was a little awkward. We had two waiters who didn't seems to really know the menu. And they forgot our order of the vegetable sides. The petit filet was very petit and the carrots that accompanied the filet were even more meager. Chicken was suspiciously buttery as well. I'm not sure what they did to that meat, but I'll probably have clogged arteries for the next month. Chocolate cake dessert was wonderful and so was the lemon meringue pie, but brace yourself for that first very tart bite. Compared to other top-dollar restaurants, this menu was uninspiring. Nothing left me excited or intrigued. Plain menu selections and ingredients. This was by far my least favorite restaurant week dinner (and most expensive) compared to Boulevardier (absolutely mind-blowing), Central 214 (also wonderful), and The Grape (go get their 41-year-old mushroom soup recipe instead!). Overall, dinner fail. After my awful cocktail and review of the menu, I wanted to leave. Mushroom soup and view and a local Ft Worth lager held me through... Do not go."], ["Debra T.", "I've only been to SER twice. The first time I was here was for a very special Valentine's Day Dinner. I was blown away by SER and could not stop raving about it to my friends. My boyfriend and I ordered the Steak Tar Tar, Half Maine Lobster which was fried in tempura w/ ginger aioli, Mac & Cheese, 45-Day Aged Prime Ribeye and the Berkshire Pork Chop. For dessert we had the Pistachio Layer Cake w/ morello cherry compote, and milk crumb. All in all, everything was spectacular. The Steak Tar Tar was bland, but the Half Maine Lobster made up for it. We devoured it within seconds. The waiters were extremely accommodating and friendly. It was such an amazing experience.The second time around at SER, some friends and I came to celebrate my boyfriend's birthday. It was that delicious that we agreed to come back for such a special occasion. My boyfriend ordered the 45-Day Aged Prime Ribeye again and I ordered the Day Boat Sea Scallops. Some new things my friends and I ordered were the Hudson Valley Foie Gras Sliders, Brussels Sprouts and House-Made Tator Tots. The second experience at SER unfortunately wasn't as great as the first. The waiters forgot one of my friend's order of House-Made Tator Tots (But damn those tator tots were the best tator tots I have ever had!). My boyfriend also mentioned that his 45-Day Aged Prime Ribeye did not taste extraordinary like it did originally.The view of Dallas however, was beautiful. The restaurant is very spacious and clean and has a posh ambiance. Not sure what is going on behind the scenes at SER, but I hope they figure out a way to be consistent. There is so much potential here (Hence the 4 stars) and if I do come back to SER, I expect to be amazed like I was the first time."], ["M K.", "Went to SER last night and enjoyed the 27th floor view of Dallas but was unimpressed with the food. I got the lobster bisque which was good but a bit toosalty and the pork chop. The chop was not tender and lacked flavor. The molten chocolate cake was quite good however. For the high price, I think you can do better."], ["Bobby L.", "When someone says, \"meet at the 27th floor of the Hilton,\" you know it's turning out to be a good night.  That's pretty much how last Saturday went.  Ended up at Ser with a few friends and let me tell you, I was more than pleased.  The night started off with a nice glass of Macallan 18.  Should have asked for it straight because the bartender loaded the glass up with about 78 cubes of ice.  We were promptly seated and my awe of the city scape that was visible from the restaurant quickly turned to excitement when I perused the menu.  I knew I had to start with the foie gras sliders.  Foie gras with a burger bun? Madness?  No my friends.  Genius.  It was perfectly cooked bun and piece of liver.  The symphony of warm and cool, crunchy and creamy, filled my mouth.  I took the smallest bites I could of these already small sliders JUST so I could make the experience last.  The oysters were ordered by another person in the party and one was stolen by your's truly.  Yum.  Between appetizer and our entree the good times kept coming.  Wine and some more scotch.  I ordered the filet medium rare topped with some lobster.  This was the only disappointing thing about the night.  The lobster was a bit rubbery and I really didn't care for it.  The filet however was well cooked and quality piece of meat.  I had the opportunity to try some of the wagyu spinalis, wagyu rib, and the lamb chops.  The wagyu rib was wild.  1 rib, large and in charge.  Seeing that one rib made me realize how large cows actually are.  The other two dishes were just as good but I can't think of enough synonyms and for the sake of making this review sound a little less repetitive, I'll leave it at that.So my only critiques are, if you're thinking about adding on the half lobster, I wouldn't.  Add on the foie gras instead.  If you like your scotch watered down, don't specify how you want it, you'll get more than enough melted ice to suit your wants.  The End.By the way, the espresso was nice a nice way to end the meal."], ["Chris L.", "Great views, service and food! Large wine list and good specials. Would definitely recommend if you are staying at the hotel and need a place for a business dinner."], ["Charaka D.", "Great view, but the food is not even close to the amount they charge.   I will come back for the view.  Again, the food is not worth it, avoid.Update: I went back last night because obvious go hate myself.   Nothing has changed.  As bad as ever."], ["M B.", "We made an impromptu stop here for a drink on Saturday early evening, and we enjoyed ourselves so much it turned into three drinks, appetizer and dessert!  The Anatole is a gorgeous property, and SER is no exception.  Their lounge, bar and dining area are all beautifully appointed with lots of rich wood and leather.  Being a car fanatic, I also really enjoyed looking at their collection of vintage hood ornaments in the showcase by the elevator.The view of Dallas is spectacular, especially to the southeast, and we were there as the sun set and the lights came up.  Later in the evening, a young woman performed in the lounge, singing and playing the piano, and she was very good.Our cocktail waitress was Kim, and she was one of the best things about the evening.  She was very pleasant and friendly, made great recommendations to us on drinks and food, and was there every time we needed her and no more, leaving us to enjoy our romantic evening.We enjoyed a couple of their specialty cocktails, a Mojito and Le Baisur, \"The Kiss\" and both were good.  We ended our night with a simple glass of Prosecco and that was probably our favorite.At Kim's recommendation we tried the crab cakes, which came two to an order and since we had a late lunch was just the right amount.  The crab cakes were delicious, the lump crab was sweet and succulent and there wasn't a lot of extra (like bread crumbs or heavy spices) mixed in to mask or distract you from the crab.  Since we weren't very hungry to begin with, we went straight to dessert, and ordered the carrot cake.  It is not your traditional carrot cake - not a layer cake but a very dense block of cake with lots of raisins.  There was cream cheese frosting on top (love that!) but it was also served with a carrot ginger sorbet that was WOW so fresh and delicious, I would have enjoyed just having a bowl of that by itself.During our visit we found the food and drinks to be inventive and delicious and our service was fantastic.  We are looking forward to going back soon to enjoy a full meal and have great expectations."], ["An N.", "Very bad experience.  There is no point of making a reservation here.  Because they will still have you wait 45 minutes for your table. That is what happened to me. I mean what's the point of making a reservation at 8:30 and you ended up getting your table at 9:40 ! Never coming back here.  Never going to recommend this place to no one !"], ["Micah L.", "Allen Brothers prime beef, unbelievable wine list, very talented chef and kitchen staff. Service was the best though! Was biz, but very unobtrusive, yet warm, friendly, and professional. Hamachi was perfect, amazing charcuterie platter, and bone-in filet w bacon were my favorites. Mac and cheese was ridiculous too. Best view in big D."], ["Diana D.", "I'll give them this...it is beautiful inside.  The dark wood and the floor to ceiling windows overlooking our sparkling downtown...it is stunning.  SER has managed to make this incredible space even more fabulous.  Back when it was Nana, I used to take people to the bar for drinks when they came to visit Dallas.  I would still do that at SER, but I can't say that we would stay for dinner.We started the meal with a dozen perfect oysters.  They had a vinagrette sprinkled over them and they were outstanding!  That is kind of where the wow factor stopped.It was a little difficult for me to find something that spoke to me on the menu.  Many of the steaks seemed to come with some sort of fruit or balsamic glaze...the combinations didn't sound good to me.  I ordered the filet, and when it came out the smoke flavor was so heavy that it overpowered the taste of the meat.  The brussels sprouts had a similar smokey flavor.  The mushroom side was good.  My companion ordered the Wagyu Spinalis and was equally underwhelmed.  It just wasn't super and and prices like that, everything should be super.Service was good, no issues there.  There is no shortage of great steak houses in Dallas.  I just wish SER was one of them because this space atop the Anatole deserves an iconic restaurant."], ["Wendy C.", "I've eaten here twice while staying at the hotel on business and found it to be fantastic both times. The steak just melts in your mouth and the salmon was perfectly cooked. The creamed spinach, French fries, onion peels, and wedge salad were all amazing. My only dislike was for the condiments. They make the ketchup and ranch there and both had some strange elements to them that just weirded my taste buds out. Don't try to fancify ketchup or ranch, people! That's American staples you're tampering with! ;)"]], "Si Tapas": [["Margaret B.", "So the thing is, there is no way you can taste the majority of their extensive menu in one night.  Not even with unlimited funds and unlimited time.  It's not going to happen.  I want, no, I NEED to go back to try some more.Between my mom, dad and sister we made a pretty impressive dent.  There is no way I'll use the Spanish names since most of you won't care but we had the Orange Salad with Carrot and Fresh Mint, Salted Chicken in Beer Sauce, Sauteed Artichokes in Lemon Cream Sauce, House Mussels, Baby Eels in Garlic Sauce, Mixed Croquettes, and the Pork Tenderloin on Caramelized Onions.My biggest revelation?  Baby Eels taste like noodles.  Who knew?  Safe yet delicious orders are always going to be your mussels and croquettes.  The artichokes and pork tenderloin was also lightly spiced and tasty.  The salted chicken got assistance from some capers but was otherwise a little on the bland side.  The Orange and Carrot salad is a nice refreshing side.I gotta go back.  Parking is pretty sucky, since it's non existent but I think I can brave it to go back and try more."], ["Kevin M.", "After trying a few drinking establishments in Dallas, it was time to move onto the meal portion of this exploration. With this in mind, I stumbled upon Si Tapas when scrolling through Yelp.Located in a residential neighborhood, Si Taps blends in with the surrounding homes. The inside actually looks like a large house that was converted into a restaurant. Very unique in that sense. The food though? Not so unique.To start, the happy hour prices here are phenomenal. You can do some serious damage here without breaking the bank if you arrive before 7pm. With that said, we ordered a bunch of tapas plates and dug in.The Patas Bravas were pretty good, but not amazing. We also got an order their \"bread with toppings\" plate, which was just ok. The toppings were a mix of different meats, which was interesting, but not necessarily great in taste. The chicken wings with garlic was pretty good, but again, nothing special... Noticing a theme?The peak of the meal was the garlic shrimp. Truly a delicious dish and that was done perfectly. Then came the low pint of the meal which consisted of two dishes: Chicken in wine sauce and chicken in beer sauce. Both dishes were really bland and overall not enjoyable.I'd say this overall experience was average from a food standpoint. Service was ok and the venue itself was really cool and unique. However, I'll definitely dine elsewhere in the future."], ["Maria C.", "Food is still good but please do not expect good service (they USED to have really good service...).We ordered jamón serrano instead we got some type of chorizo. Iasked the server where the jamón serrano was... and he just said there was nothing he could do. Not even apology received..."], ["Cat N.", "I had a pleasant early dinner here, just wish service was up to par. I waited 15 minutes before the waiter came back to take my order. They never came back to check on me and I had to go get them to give me a check. The waiter was actually no where to be found. I still tipped, silly me. What was I thinking? Food was good and unique but not the service. I had the pick three bruschetta with toppings: smoked salmon, some type of sausage that tasted like pepperoni, and some type of cheese. I also got the marinated baby shark and the clams in garlic white wine sauce. I liked everything I got. The best was the clams in garlic white wine sauce. The marinated baby shark was deep fried. It was a good thing it was fried because if it was raw or in some other type of ways, I think I might have a hard time trying it."], ["Janice C.", "I highly recommend this place! The restaurant is set in a nice little neighborhood, in what I believe is a renovated house. We arrived at 6:45 and was sad to find that last call for happy hour was 5 mins ago. While I thought it was weird, every restaurant has their own policy. We ordered the mixed croquettes, peppered tuna and fried pork belly. I can easily say that the croquettes were my favorite! While a cod croquette can easily be off putting bc of the name, it was quite tasty! The corn inside the croquettes added a certain sweetness and lightness to such a typically heavy food. The ham one was very tasty as well. I would really recommend getting the mixed, bc I didn't not like one over the other. The ham has a stronger taste and is more savory while the cod is lighter and sweet. The fried pork belly was deep friend and served with a chocolate sauce. The pork belly was cooked well, and tasted okay. The fried pork belly was my bf's favorite but I'm not a fan of fatty meats so I didn't think much of it.... The peppered tuna was tasty and cooked well, and I would have no problems ordering it again, but I would rather try something else on my next visit! The food was excellent, the service was a little cold but I was fine with it. And I would definitely be coming again despite the horrible parking situation! (Don't get towed my friends!!)"], ["Emily S.", "Okay so if you are looking for an awesome Spanish experience, you MUST try Si Tapas! It is so cute and would be perfect for cozy date night or dinner with some girlfriends.The outside looks like a cute little house and the inside is just as adorable and is in the St. Thomas neighborhood. If you've never been over to this neck of the woods, it is so cute and different and has a very nice neighborhood vibe.As for the food - for three girls we ordered five tapas and cocktails and it was just enough food for the three of us to be full but not too full. If you've never had tapas before, they are spanish small plates meant to be shared. All of them were very delicious. We ordered the Tortilla Espanola which is one of my favorite dishes and reminds me of a meal my grandma used to make. It is the size of a quiche and is sort of like a potato and egg omelette. We also ordered the cauliflower, scallops, and the starter toast with spread. Everything was delicious.I will definitely be coming back here! Great spot!"], ["Tiffany S.", "Spanish cuisine is my absolute favorite. I studied abroad in Madrid, Spain for 5 weeks and developed a deep appreciation for the food and culture in my short time there. Dallas has a shortage of Spanish restaurants and of the few that it has, Si Tapas is the clear winner. I stumbled upon Si Tapas about 5 years ago after a brief internet search and was surprised by their happy hour prices. A friend and I ventured out to Dallas to try it out and were amazed at the high quality of food. Since that initial visit, I have been back at least 3 or 4 additional times. It's that good.Fast forward to last week and I am still a fan. I was in the neighborhood so I decided to stop by for an impromptu tapas meal. When I walked in I was greeted and given an option of seats. I opted to sit downstairs at a small table. I made up my mind relatively quickly and ordered a sangria to start off with and a few tapas plates (chicken with garlic, Spanish omelette, and calimari). The winner of my dinner was the sangria and the tortilla española (Spanish omelette made of potatoes). I ordered the tinto de verano, a summer drink, but I swear it was a calimocho because it was darker than normal and didn't taste right. My server was very kind and switched my drink for another tinto de verano. Is this the best Spanish food I've ever tasted? No, not by a long shot. But it is an authentic Spanish dining experience and the best Spanish food I've had in Dallas. For me, it's all about the nostalgia of eating Spanish food. Tip: Go during happy hour. The small plates (tapas) are $3 each, drinks are cheap, and you can sample different things to discover what you like. Also, order a pitcher of Agua de Valencia and thank me later."], ["Jennie J.", "Si Tapas was such a lovely place!  I was immediately impressed with the charm of this little restaurant in an old house.  The layout of the restaurant is great.  I absolutely loved the atmosphere here!Their food was also very good.  I tried the lamb chops, seared tuna and fried okra.  The lamb chops and okra were excellent!!! Definitely try those.  I can't wait to go back here again sometime!  Only negative is that is is rather loud indoors due to the small space and the valet was full when I got there so I had to go elsewhere to valet and had to pay extra for that.  This was on a Saturday night, by the way."], ["Danielle S.", "We found this place by looking for paella in Dallas. First it was confusing because there is nowhere to park. You have to valet and apparently there was not valet offered on a Wednesday night so we had to valet down the street. Valet in the area ranges from $7-$15. There was not a hostess inside but a waitress greeted us and I'm not sure what she said after we let her know there were three in our party. Another guy walked up and sat us though. We sat for about ten minutes before anyone greeted us. Then a server took our order for drinks. Took about ten minutes to get a martini and a mojito. It appeared the servers were having to make all their own drinks. We then ordered one of the mix and match 4 meat and cheese plates. We went with zamorano and manchego cheeses, with cured chorizo and salami. It was served with a fruit pate, grapes, walnuts and died fig. Could have used mustard and something pickled rather than everything so sweet, but the meats and cheese were mouth watering. For dinner we shared the seafood paella. It was everything I had hoped and more. I've had equally tasty paella but none this loaded with seafood. There was meat in every bite; calamari, clams, mussels, scallops, shrimp! So so so GOOD. Everything tasted fresh and the saffron rice was cooked perfectly, not fishy or mushy. I think the prices were really good considering the quality and amount of food. I can't wait to go back and try more tapas. I would absolutely give it five starts but the service was very slow to start, they didn't start music until we were halfway done with dinner so instead of calming music for our first half of dinner, it just felt like really loud conversations all around us and it was too dark at the beginning of dinner service. Not until around 8:30 did they start lighting the candles on the tables so it just felt like we were sitting in the dark for half the meal. Maybe they were down a server and/or bartender. I will definitely go back, maybe in the fall since they had a great patio."], ["Meena N.", "Ohh. Emmm. Geeee. Where do I start? As a goodbye happy hour for my student assistant, we decided to hit this place upon recommendation of another colleague. Parking looked spotty, so we opted for valet. Open arriving, I was hesitant. How are they fitting a kitchen and tables in this small space... And then we walked outside. An oasis in uptown! I haven't seen that much grass in uptown.... Ever?! Our table ordered the following: fried calamari, the Spanish potato omelette, garlic shrimp, olives, chicken in garlic (nom nom), and fried okra (we ARE in the South). And that was just the first round :) after sampling the above, we recorded okra, chicken and shrimp. Why not? They were $3/plate!We also ordered three pitchers of Echegaray ($12/each). Having never known about this drink, I found it very refreshing/light on a humid Dallas afternoon, and quite strong! Quick comment about service: super fast! As soon as we ordered, plates of food started emerging from the kitchen. Our waiter (a manager.. Don't remember his name) was also super friendly. He came around 15 minutes before HH was to end to ask if we wanted to order anything before prices went up. Check this place out for HH!"], ["Alyssa A.", "I went here to celebrate my birthday with some friends on a Thursday night. We dashed in fifteen minutes before the stopped happy hour pricing. The waiter was really nice about taking our order quickly to make sure that we got the happy hour pricing. The order two pitchers of drinks, sangria and Echegaray, which were both delicious. We order a bunch of different tapas and literally everything was delicious. I can't even pick a favorite. Great place!"], ["Neha M.", "I want to almost give them 2 stars, but I will just stick with the 3 like last time.  Again nothing special!   This time I have to say the sangria was not good.  We had a 45 minute wait so we got a white wine sangria while waiting.  This tasted like sparkling water no joke.  We shared a pitcher among 3 of us, and we did not feel like it had any alcohol in it.  well we got seated and started ordering.  We got the house sangria, again nothing special!for food we tried the orange marmalade toast, goat cheese toast, and smoked salmon toast -all were just okay.  The potato with this red pepper sauce was pretty good.  The mussels in this tomato sauce were also really good.  The rest of what we ordered was again okay - artichokes in cream sauce, fried cod balls, and roasted red pepper.  This will probably be my last trip here sadly."], ["M M.", "I enjoyed the experience of this place though I hope they make a few changes when it comes to the way their dishes are executed. First off, it's something different in Uptown, so I'm up for returning partially for the variety they offer amidst the bars and bar food of Uptown.The artichokes were a hit, as was the sauce for the saffron chicken; however the chicken was overcooked a bit to the point of chewiness. We also had the manchego cheese (can't go wrong with cheese) and the tomato marmalade with goat cheese. The latter we were unimpressed with since the tomato marmalade was spread on thick, and there was very very little cheese. The result was that the sweet marmalade was too much for the little toasts, and there wasn't any saltiness from the cheese to balance it out. Finally, we got the carafe of sangria which I'd recommend. It's on the sweet side but very tasty. Our neighbors also had great things to say about the croquettes, and cauliflower au gratin so those are on my list for next time."], ["Ashley A.", "The patio is so beautiful and romantic. You can enjoy your food in a lush green alcove in the middle of a lovely section of uptown. This secret garden is surrounded by very nice buildings on all sides and in view of the skyline to the left. We had a lovely evening, and a fantastic meal. The food is delicious. Tapas are romantic by nature, because they are meant to be shared. To start we ordered the Tuna with cracked black pepper in olive oil, and brussel sprouts in garlic. Next we had octopus with potatoes, the quail, pork and blue cheese on toasted bread, the sole, and dijon sirloin. Service was fast and friendly. My favorite dishes were the sole and the dijon sirloin. The sole had an incredible flavor combination. It was topped with ham and almonds and a perfect crunchy layer. The Dijon Sirlon was beautifully robust and rare. Sinewy and delicious. My least  favorite dish of the evening was the quail, which was very over cooked. I wouldn't recommend it. Stop re-killing the bird. It's already dead. The olive oil in a lot of the dishes was so delicious. We were scraping our plates with the crunchy bread to absorb the flavors. Ask for the dessert menu, we adored the creme brulee with white chocolate shavings. I had the red wine cake, but the creme brulee was better by far. You'll have a very romantic evening on the prettiest patio in Dallas!Definitely drink Txomin Etxaniz txakoli with your meal. It's scrumptious Spanish white that pairs beautifully with tapas. One of my new favorite whites! Fruity aroma and carbonates lightly in the mouth.We love this place. We will definitely be back soon! Tapas are a way of life."], ["Frank A.", "Tremendous.  Authentic Spanish Tapas.  I swear, I was back in Spain.  We got lots to try!- orange and carrot salad w mint. (Wow) - beet salad w pine nuts and goat cheese - green beans w mustard sauce and serano ham- shrimp w garlic - clams w garlic- fried okra- mild sausage and Manchego cheeseDeserts - oranges w black pepper ice cream and grand marnier- Catalan Creme brûlée - cava poached pearThis will be on my must go to list when I come back to Dallas. A truly memorable dining experience."], ["Tracy R.", "My friend and I went here for Happy Hour on a Monday evening.  This probably tops one of my favorite Happy Hour places in Dallas!  Select tapas are $3 each and certain alcoholic beverages are discounted (my friend got a sangria for $4!).  For the tapas, we got the fried calamari, spanish potatoes with chorizo, spanish omelette, fried smelt, and shrimp in garlic sauce.  They were all delicious, especially the shrimp in garlic sauce!  I loved the subtle flavors of the alcohol in the sauce - I even used their bread to dip it in.  We also got the spanish red wine chocolate cake at the end of our meal.  It was soaked in alcohol and topped with a sweet, red sauce.  Pretty good but I wasn't crazy about it.  Other than that, I plan on going back!"], ["Samuel O.", "One of my favorite places in DFW period. Whenever I can't decide what to eat, I don't hesitate to come here. You can order all the traditional tapas and wash it down with their sangria. You can choose from never ending list of tapas (oxtail to sweetbreads). Some are small and some are share with your table size. But that's why you come here. You can order 5-8 items and don't feel guilty. All dishes are well done and preserve the traditional flavors. I'm sure some will argue that they're not buy hey we all agree that they're delicious. Don't forget to order a pitcher of sangria when you're here. My wife who can't drink will ask for a glass when we are here. So refreshing and simple. No fruits floating around just plane good flavors. Tip: try their happy hours!"], ["Kim F.", "So I'm pretty hard to please at restaurants and I must say, si tapas was incredible. After visiting Spain I've been searching for a restaurant that has authentic spanish cuisine. So tapas hit the nail on the head. We got an assortment of tapas which wereGreat and the seafood pallea. The pallea was delicious. It is enough to share for 2-3 people and definitely worth the price. They pack on the seafood so you get almost more than what you pay for. It's great quality and full of flavor. Finally, the sangria. I've been trying to find good sangria in dallas and most are sugary Americanized versions of the Spanish drink. Si tapas makes the best sangria I've had in dallas. It's not too sweet and has a great flavor. Definitely recommend si tapas and they have great happy hour prices."], ["Jina C.", "We almost missed this place because it looks like a private residence from outside. Parking was a nightmare, since they only have street parking. We went on a Sunday afternoon and the place was pretty empty. We opted to sit inside due to the heat, but the outdoor patio looked really cute. We ordered a bunch of small plates, and they were all pretty good... but nothing stood out as amazing. The dish that did stand out, however, was the seafood paella. It was a good size and we shared it between three adults. I loved that it came with plenty of mussels, clams, and shrimp. It was savory, but not overly salty. Service needs improvement, as our waiter was not very attentive... we had to request for drink refills multiple times."], ["Hannah H.", "I love tapas and am always looking for new tapas restaurants to try... Si Tapas has never let me down. It is by far my favorite tapas restaurant in town. Everything I order is always fantastic! I recommend the seared tuna, Spanish omelet, cauliflower, lamb chops, manchego salad... I could keep going on and on. Bottom line, everything is great and I would recommend it to anyone."]], "Cafe Madrid": [], "Abacus": [], "The Grape Restaurant": [["Sarah S.", "My Sunday morning binge eating started out with the complimentary banana nut bread muffins (?) which I found very dry and too nutty.  This sort of scared me for the meals to come.  We also ordered a Cinnamon Pull-Apart for the table (warm from the oven with pecans and caramel), which I also found disappointing and too nutty.  It was also very sticky, but not in a delicious cinnamon roll way, but in a stuck in your teeth like peanut butter on the roof of a dogs mouth way.  Now I was really dreading what was to come.For my meal, I got The Haystack (roesti potatoes, grilled tomatoes, half-scrambled eggs, Muenster, avocado, and sriracha chili sauce).  When the meal came out, my hindsight kicked in, as I do not like spicy sauces and forgot to ask for them to leave it off.  Besides the few bites of my mouth burning, I mostly successfully avoided the heat and thoroughly enjoyed the meal.  Avocados make everything better.  Although the picture is not exceptionally mouth-watering, the combination of eggs, potatoes, and avocado is a breakfast delight.We also ordered a Classic Cheeseburger to share between the four of us (grilled 10 oz fresh ground patty, homemade peppered bacon, Vermont white cheddar, with homemade frites on the side).  It is literally one of the best hamburgers I have ever had in my life.  100% it beats Fred's in FW, Maple and Motor, and any hamburger joint outside of Dallas or Texas.  The patty was huge, yet so fluffy.  I generally do not enjoy cheese, but the whole package of patty, bacon, and cheese just worked.  I really wish I got it as my meal and will be going back shortly to devour the whole thing myself.  Additionally, the fries were so addicting, which created the perfect compliment to the delicious hamburger.Overall, I left The Grape very pleased and feeling like 50 bucks (not quite 100 bucks due to my excessive drinking the day before, but halfway there).  It is definitely worth a stop in, just make sure they are serving the hamburger the day you go!"], ["Greg L.", "Have been to the grape for dinner years ago but took the family for Sun brunch. We all had burgers. Needless to say they were all inhaled within minutes. Will be back."], ["Tanya A.", "The Grape was far below expectations. Had the triple cream mezzalune for apps, including salmon tartare and cheese plate. I was looking forward to the mezzalune since morels are in season; it sounded good but the watercress and spinach pasta just didn't seem to pair well, especially with the morels. The salads seems to come out of a package; nothing special. While the entrees were good, I don't think anyone said they were amazing, and definitely not worth coming back for. The dessert (rhubarb and chocolate terrine) were also subpar. I was looking forward to those, and they didn't excite me.Service was slow towards the end, but the restaurant itself was cute (nice patio). I've heard good things about brunch and mushroom soup, so maybe I have to come back for that? We'll see though!"], ["D. F.", "The Grape is an amazing restaurant.  The ambiance and most importantly food is not anything short of outstanding. I have been here 3 times for brunch, and not once have I been disappointed. Their hushpuppies are mouthwatering. Their waffle is scrumptious, and the famous burger lives up to all the rave. Every time I have shown up on Sunday, there is a line out the door. So reservations are your best bet.You will not be disappointed."], ["T.J. B.", "Just go. It's small and gives off a great date night vibe. Valet is right by the door. Exceptional service and food."], ["Lissa B.", "My family has lived in the Dallas area for over 35 years, so all of us were willing to try my mom's recommendation. (Granted, apparently The Grape was just a wine tasting bar last time my mom had been there for a meal). We made reservations for Sunday brunch and dove right in!Parking in complimentary valet for The Grape, thankfully, but it was awkward figuring out the parking when I first pulled up. Literally drove by three times, trying to pull in. We were there before the restaurant doors even opened. For brunch, I tried the fried polenta with sriracha (appetizer) and the pull apart cinnamon rounds (appetizer), which were both what you would expect and nothing exceptional. The frittata featured a queso fresco on top that ended up sticking to my stomach and keeping me from even eating half of my plate, but damn it was good. Note on service: I've taken Spanish for over seven years, so I was pretty surprised to hear a couple waiters saying loudly to \"give the witch some coffee,\" while talking about the table next to us. In Dallas, even white people speak Spanish, so this kept bothering me, given how loudly it was said. Multiple times. Good (not great) food. Much money. Drink menu looked good (didn't try any). Weird experience with servers."], ["Megan M.", "I love The Grape.  Until my most recent visit, I'd only been for a couple of happy hours but those hours were spent truly happy.  The cozy atmosphere of the bar, the friendly staff and the fantastic happy hour menu (all at very affordable prices) make me feel like a little girl playing dress-up in her mother's closet.Imagine how excited I was to finally be able to try the best burger in town at Sunday brunch.  Father's Day couldn't have been spent on a better reservation.Except the burger didn't live up to the hype.  Everything else about the Grape is still outstanding.  We had a wonderful lunch on the patio thanks to a rare June cold front and I enjoyed the hell out of our $22 splurge on a carafe of mimosas.  But that burger...oh, that burger.  While I can see where they were going, I just don't enjoy having a burger pee all over my plate.  I hadn't even taken more than a couple of bites and the bottom of my bun was completely soggy.  Ew.On the flip-side, the hand-cut fries were amazing and the burger toppings were about as high class as high class gets.I love The Grape.  5 stars for happy hour and 3 stars for brunch.  I'm sure my next brunch visit will bring The Grape to a solid 5 stars overall."], ["Steve C.", "I've had the mushroom soup and it is to die for. The classic cheeseburger is equally awesome. Steak on a bum without the cutting. Cooked medium with melted cheese and crisp bacon, this is a savory delight with sauce and crunch! The bum is soft and crisp and the meaty tomato paired with crisp sweet pickles and butter lettuce tops off the burger. The fries are good. The price point is higher than Maple and Motor but you won't be disappointed. Sit at the bar and get a drink from Kara."], ["Cat A.", "I am a huge burger fan, and I came here specifically to get this burger that everyone raves about. I do agree, it is a damn good burger! it's huge and i took half home, which is great considering it was a $15 plate. The fries are something I hadn't really heard about, but my husband I I both just LOVED them!! Perfect balance of crispy and soft.  I also ordered their coffee which was surprisingly good too.  Came out piping hot with a very good flavor, not too bitter or anything. We sat at the bar countertop to avoid waiting for a table and had a great time chatting it up with the very friendly female bartender while watching the Steelers game.  I never had a problem getting coffee refills even though on one of the waiters had to handle it.  We also got an order of the sausage and sweet cornmeal hush puppies, and they were delicious and addicting. I was trying to save room for my burger, but couldn't eat just one.  One star gone because my husband also ordered the wounded yellow bird and was not at all impressed with the cocktail. They have complimentary valet, so as long as you aren't in a huge rush, parking is easy as well.  And remember that Sundays they close at 2pm and re-open at 5pm I believe."], ["Lauren T.", "I have been meaning to try this cute little spot out for YEARS. I finally got around to it after a random morning at church; the weather was crappy, but we braved the arctic blast for a shot at landing brunch. First of all, this restaurant is very small, so it is usually pretty packed and they are big on reservations (yes, for brunch too). We didn't have any reservations, but we got seated quickly (I'm pretty sure it was solely due to the awful weather). The food was delicious! I ordered the Country Style Frittata with a side of grits. The grits were pretty mind-blowing! Both were tasty items, and my guest thoroughly enjoyed their meal as well. Apparently, the \"Hay Stack\" is one of the most popular choices on the brunch menu, because I ooo'ed and ahh'ed over it when I saw a waitress set one on the table next to us (I was sad I didn't order it... I'll know next time!), and literally every table around us ordered one as well. It looks like an ahi tuna tower of breakfast items... I cannot wait to taste it for myself.The waitress was super friendly, and the service was great. Something about this restaurant reminds me of Toulouse on Knox Street (maybe it is the quaint, European cafe vibe). I've heard The Grape has an amazing burger as well as a deliciously upscale dinner menu, so this is a solid choice for just about any time of day. I will definitely be back!"], ["Reena D.", "I've had The Grape bookmarked for so long and finally came here for Sunday Brunch.   You definitely need to make a reservation or you'll be waiting for a long time.  I started with a cappacino which was really good.For the table:We ordered the fried polenta cheese fritters and the sausage &sweet cornmeal hushpuppies.  The polenta cheese was so good. The sriracha complimented it.  The fritters were not too rich either.  My favorite was the hushpuppies.  There were big pieces of sausage in each hushpuppies.  This has to be one of the best hushpuppies I've had especially when there is sausage in them! YummyEntrees:My friend and I decided to split the fried chicken biscuit.    Who doesn't like crispy fried chicken, cheddar cheese & honey butter on a jalapeno cheddar biscuit???  I thought the biscuit was good but felt like the fried chicken was a little on the dry side.  Next time I may ask for more honey butter or a sauce to go with the chicken.  I thought it was decent though.We ended our meal with the pull apart cinnamon roll.  It had way too much honey on it and it was so sweet.  I could barely finish my bite.  Talk about sugar overload! Ha!  We did enjoy our time here and can't wait to go back and try other items off the menu including dinner items too!"], ["J G.", "Came today specifically to get their burger. First their bloody is solid. Lots of horseradish which I love. The Courtney salad is also solid. Just the right amount and priced right at $5. As far as the burger goes, it lives up to the hype. I love that it's a big bastard at 10ozs unlike these new places and their BS 6oz patty. F that! I'm a man. I'm 45. I want a big burger.I'd happily give 5 stars but their fries are soggy. Not even approaching crispy."], ["Jennifer S.", "I can't believe I haven't reviewed the Grape before, but here goes!  I met a friend here for dinner tonight and had a wonderful experience.  The Grape has been voted the Most Romantic restaurant in Dallas many times over and you can see why once you step inside...it is oozing with charm.  The happy hour is killer - 1/2 price glasses of wine, $2 beer and reduced price appetizers.I enjoyed the poached pear salad with blue cheese to start and then enjoyed a half portion of the mustard crusted salmon with potatoes and cabbage.  It was absolutely delicious!To sum it up...great atmosphere, great service and great food - a winning combination!"], ["Steve V.", "This is the blue chip recruit of restaurants in the Dallas area. You know you are going to get something solid every time. We were here in early January and they were still serving their December menu. This was fine with me since the menu had some appetizing options.I had a reservation and we were seated on the left side of the quaint restaurant at a small table for 2 against a wall. We started off with the gnocchi and lamb tartine. The lamb tartine had way more meat than I thought it would have, but the sauce was a bit overwhelming and runny. Still a great dish though. The gnocchi was soft and melted in your mouth.For my entree, I had the shortrib. Again, this dish was a good amount of food and the meat was so soft. There was a large amount of pure fat though, which I was not a fan of. The flavors were bold and enticing. The chard that it came with was great, and the farro a bit al dente, just the way it should be.The service was a perfect blend of attentiveness, but not overbearing. There is complimentary valet as well."], ["Lana H.", "This was the place my ex first took my parents when he was meeting them. It seems like you have to valet park! It is a tiny place but the food is spectacular. Id recommend dressing up! The portions are smaller and so are the tables, but it very delicious and worth it! Great staff and worth going to for sure!"], ["Marangelis S.", "The Texas redfish was one incredible dish... Great place!  ... They are super relax which I really appreciate it...  ;)"], ["Bill T.", "Very small place therefore, I suppose, the reason for two confirmations of my reservation by phone instead of the usual one.  However we went, on time and as agreed.  If you're looking for wine under $50 the list is VERY short - one or two bottles only.  Our waiter Bryon told us the specials - he got past the first one without mentioning the price and after discussing the entree, our guest asked how much it was.  \"You interrupted me!\" he replied impatiently, then finished his spiel.Two beef tournedos arrived lukewarm at best.  I wondered whose meal we had waited for, and it was one of the ladies.  My wife had fish, which was OK, and the other lady had the pork chop, which she said was piping hot and excellent.  So the beef was plated up and sat while the pork chop was finished.When Bryon asked how things were I explained about the meat and he said, \"All right.\"  I responded, \"do you think 'I'm sorry' might be a good answer too?\"  To which he replied huffily, \"All right\" and left.  He was civil from then on but NOT friendly.The owner came over at the end and was very gracious.  She comped our two steaks, no small thing, and asked us not to hold the poor service against trying The Grape again.  Frankly, as loud as it is, with tables so close you could share food off the next table, and with that kind of service in a very nice restaurant, we'll go elsewhere.  Maybe Terrill's across the street - we had a drink there first because the bar at The Grape is so crowded.  It would have been a good dinner, I'll bet."], ["Dustin K.", "To start, the short hispanic hostess was incredibly rude.  I had made reservations for noon, when we arrived, she told me that I had missed my reservation for 11:30.  When I offered to show her the confirmation for noon, she reluctantly sat us.  After waiting forever for service, we finally ordered.  I was never offered a second drink from the first one I ordered.  Our appetizer came out AFTER the meal came out.  To top it all off, the \"Best Burger in Texas\" was way over-cooked.  I ordered medium and it came out mostly well-done with a tiny bit of pink in the middle."], ["Lily M.", "In the last 3 weeks, I've been to The Grape once for dinner and twice for brunch because it is just that good! *Dinner Menu:When I went for dinner, we started with the Cheese & Charcuterie plate to accompany the bottle of Pinot Noir we ordered.  The cheese plate was great, and this is coming from someone who could do without cold cheese completely.  For dinner, I ordered the Mustard Crusted Salmon.  The meal was delightful, but it would have been wonderful without the mustard.  The salmon was seasoned and cooked so nicely that the mustard was more of a distraction to the taste rather than being a relevant additive.  The redskin potatoes were happily dipped in the creamy sauce on the dish, making me wish I had just a little more to indulge in.*Brunch Menu:Since they only do Sunday Brunch, it is recommended to get a reservation, as this place seems to always be busy.  Even with our reservation, we are always still asked to wait at the bar until our table is called.  I've had a few things on their menu, all of which have been excellent.MimosasIt's hard to mess up a mimosa, as long as there isn't too much orange juice in the glass.  \"I'll have another\" is what I frequently told my waiter.Sausage & Sweet Cornmeal HushpuppiesThese hushpuppies are magnificent!  The warm maple syrup poured over this hot and savory appetizer is definitely a pleaser.Country Style FrittataI ordered this the first time I came here and was first afraid to get it due to the goat cheese being listed on the menu.  But, the goat cheese wasn't bad at all.  It was actually very light and combined well with the frittata mixture.  I think the frittata was still missing a bit of flavor, but it wasn't off much.Breakfast on a BunThe second time I came here, I ordered this and it was even better than the frittata.  I ordered the eggs without the yolk, and it was the most buttery, but delicious egg white sandwich I've had in a long time.Fried Chicken BiscuitI had some of this and it was good.  If I were more of a fried chicken kind of girl, I would definitely order this.I love The Grape and I am sure it will be seeing a lot more of me.  Due to the exceptional customer service and food, this restaurant is now a favorite of mine."], ["Brittany C.", "Tonight, we returned to The Grape for our 3rd wedding anniversary dinner. Having been before, for our 1st wedding anniversary, we decided to spend the night at a familiar and quality restaurant instead of trying one of the many new options in the area. Unfortunately, we should have let the first meal here be the only meal here. Tonight was beyond disappointing. We waited 30 minutes after finishing each coarse before the following was delivered to the table. The mushroom soup came out as expected, which is a relief because that is one of their signature dishes. Although we are still wondering why it took 30 minutes for something that should be prepared ahead of time. My husband had the cheeseburger and was fairly pleased. I had the very sad looking/burned on the bottom/ very small for 28 dollars lasagna, which I sent back to the kitchen without a replacement. We were not asked if we wanted dessert or coffee, never received a visit from the manager, and had to flag down our waitress for the check. As we walked by about 10 staff on the way to the exit, not one asked us how our meal was, including the manager. Sadly, we will probably not be returning despite the exemplary service we received on our first visit."]], "Nazca Kitchen": [], "Stephan Pyles": []}