{"Sushi House": [], "Sushi Star": [["Leonardo S.", "Try the hippo roll it's not on the menu but it's great A deep fry roll that I regret we didn't take a picture Next weekThanks"], ["Caitlin K.", "The sushi here is fast and delicious! I am exceptionally picky about sushi restaurants, but this one was a delightful surprise. The waiter was very nice and attentive, and despite the restaurant being fairly busy, our sushi came out lightning fast! I recommend the dynamite rolls and towers. We ordered way too much (as we normally do with sushi) but it was all so good we ate way more than we should have. Prices are a little high, but expected. I highly recommend!"], ["Chris G.", "Quality all around. We've been looking for a more local sushi place, and this place is going to fill that void.  Everything we ordered was simply incredible. Great ambiance as well. Enjoy the experience, we will be back"], ["Wei Z.", "I'm in town for new year. I found this place in yelp. The food is excellent.  Very fresh sashimi and very nice staff!!!  Strongly recommend !!!"], ["Bob B.", "Ate as Sushi Star last night and had Sashimi and a Sunny Roll.  I eat here almost twice a week and that is no exaggeration.  At least once a week. They have the freshest fish around, great service and delicious fish.    Of course I know them all by name and enjoy the sushi bar."], ["Cindy B.", "This place is so good and the staff are excellent. We love to come here for both lunch and dinner. The only problem we have ever experienced is slow to bring the food but I  guess it does take time to create these wonderful rolls."], ["Sonny K.", "Love the service and the food! Nothing else to say."], ["LeeAnne L.", "If you live in Preston Hollow the wait is over for FABULOUS SUSHI!!! I was so happy when they opened!! You can even call ahead and take your order home! FRESH INCREDIBLE SUSHI!! My personal favorite is the Ahi-Tuna Tower!! ROCKS!!"], ["Amanda G.", "Best Sushi in North Dallas (Maybe all of Dallas) The staff is friendly and quick on their feet - especially Craig and Justin. Sushi Star just hosted my Bachelorette Party. The Manager, Song, was incredibly helpful. They allowed Bottle & Botega to come in and paint with us while we enjoyed our Sushi. If you haven't tried Sushi Star you are missing out."], ["Alex T.", "I'm totally biased when it comes to this place because I know the owners....Who are a brother and sister duo, whose kids run around serving patrons.  And that's partially why I love it.They love to make special rolls for you, so ask them to throw something delicious and fun together!Tip: Ask for the white tuna - melts in your mouth like butter.  I actually prefer it over the fatty tuna.  And if you aren't a fan of sake, maybe Nigori will do the trick?  It's unfiltered and looks like milk with a sweet taste.Ask for Ed and tell him BMW MINI of Dallas sent you!"], ["Jim S.", "Great neighborhood sushi restaurant with friendly and attentive staff.  Everything I've had there was very good with the exception of spicy tuna roll....aside from that 5 solid stars"], ["Anna C.", "I brought my parents here for dinner last night and the sushi was very fresh. We ordered the small sushi/sashimi boat as well as a few rolls and the special hamachi dish.Service was good. I'll be coming back here again!"], ["Christine H.", "This place has great sushi. Service was fast and friendly. I had the Philadelphia roll, California roll and shrimp tempura. It was so good and satisfied my craving for good sushi. We also for dessert. It was the tempura ice cream and it was simply amazing. I highly recommend it. Restaurant was clean. Prices were reasonable as well as far as sushi restaurants go. We will be returning."], ["Tuan P.", "Service was nice and attentive.  Food was above average and I really appreciate the care that the chefs out in to controls the quality.  Not every bite was a fresh bite but not very many restaurants gets it right like Shinjuku Station in Fort Worth. :)  I would defiantly come back every time I pass through.  My top 3 favorite along with Tei-An and Yutaka"], ["Stephanie P.", "I pass by this place quite often when I'm in the area, it looks like a little house and always has a full parking lot. \"Must make the drive back here one day\", I think to myself. Came back last night for a dinner date, we were greeted and sat immediately, awesome! Two glasses of water came for us, awesome! Then 15 minutes of nothing. Nobody looked in our direction or even walked by us. I tried the \"stare-down-a-waiter\" method to get their attention, nothing. A couple of tables came in after us and got their wines/beers and were having great conversations with the waiters. Us? Nothing. After getting no service, we just walked out of the place. I told told a lady at the front of the restaurant what happened and her only response was this exact face =[ --- uh no apology? Sayonara bitches! While we were waiting we were able to peruse through the menu, their prices are double the place we ended up going to, just FYI..."], ["Chris R.", "Horrible, horrible service. They told me it would take 15 minutes for a take-out order to be ready. It took over 45 minutes. They did not even offer me a drink, some sort of discount, or anything else for my trouble. And the food was cold and tasted terrible when we got it home."], ["Warren C.", "Best sushi I've found in Dallas so far.Good all around quality and service. I don't think there were any items that stood out as bad to me, and I liked many of the rolls they brought out. If you've got a lot of people and want to try a bit of everything, I recommend getting a boat. The menu is a fair list. Average list of beers and sake to complement, although I think there is some room for adventurous folks here.I can't say it's a budget sushi place here though, so come ready!"], ["Sasinan S.", "4 stars for food. Salmon sashimi was fresh. Shrimp tempura roll and Avocado roll were good.i like the way they do the rolls. Rice were not too thick or too thin , just perfect  and test just right!! I like it!!!                                The service was ok ,not too bad and also not good. Nothing special about the place and the service if you looking only for food and not care much about how the restaurant feel and service . I recommend this place!!!!"], ["Andrew R.", "Went there for a random sushi craving - 4-7pm is happy hour Monday-Thursday, we arrived at 655pm and didn't get our order in till a little after 7 and still got happy hour drink prices - BEST KIRIN DRAFT JAPANESE BEER IVE HAD IN NORTH TEXAS !!!! sushi rolls and sashimi are fresh and great prices !!!! The decor of the place is meh which is the ONLY reason it's not 5 stars - I will go back for sure !!!!"], ["S K.", "Probably one of the worst dining out experiences I had. It took nearly 15 minutes for the hostess to come by and even say hello, I wanted to leave but couldn't because I am with company and part of me thought they might be busy lets just be patient. Nope! I am wrong, once we enter we see two empty tables but they didn't bother to seat us or alternatively let us know how long we need to wait. We sit and no one shows up again for about 5-7minutes, not even to ask for water ( by this time my appetite is long gone). Food is ok, not worth the money. Wine was warm, sloppily served. I will not go back. I use yelp a lot to check recommendations but never really wrote any reviews until last week, when I had great things to say about Grape. I felt it is my responsibility to write and let yelpers know when I had a terrible experience to."]], "Blue Sushi Sake Grill": [], "The Blue Fish": [["Mandy L.", "First time to try this place. My boyfriend and I split the ahi tuna tower which was REALLY amazing. Then we got a crabmeat dynamite roll, which was actually delicious. The cooked crabmeat in the sauce is served over a california roll and I thought it was super filling.Kind of pricey though so I would definitely try to go during HH where they have drink and food specials! Don't forget you have to sit at the bar for HH."], ["Stefanie L.", "Last night was out first time at Blue Fish and while we came with high hopes of finally finding our sushi spot here in Dallas, this place left a lot to be desired. The only thing this place has going for itself is the amazing location with the really nice patio, 2 stars earned for that.From the moment we came in Friday night the place was busy, not crowded yet which was nice and we were able to get a table outside. Our server started being very friendly and even a little talkative but after deciding we would not be drinking his service instantly went downhill. We saw the busser more than our server, give that guy a raise there wasn't a single water glass unfilled. Anyways, the fiance ended up ordering a Dr.Pepper since we would end up getting a bottle somewhere else and the drink never arrived, perhaps he forgot about it? Well, after ordering our rolls each and every single one of them were given to us by different servers and while that's okay, he didn't seem to bother asking how everything was. (He was too busy chatting with the table next to ours) He was nice enough to bring us the check. Despite the bad service, the rolls weren't anything to come back for. Blue Fish, we were not fans of you. Very unimpressed."], ["Tania P.", "What happened to you, Blue Fish?? Did Teppo kill your inventory of fresh fish? I can't even.I have always gone to the North Dallas location, and leave pleasantly satisfied. The food is always consistent and hits every sushi craving.This place - OMG. First off, I think they tried to pull one over on my husband by bringing Sapporo instead of Kirin. She came back making a show saying that they ran out of Kirin bottles and if draft is okay, and bust out with Sapporo. Additionally, they made my drink weak as shit. I love lychees and always get the lychee martini. It always comes so strong that I have to sip it slowly. It also comes with a skewered lychee that I like to steep in the vodka to get the maximum amount of alcohol soaked. Well, they gave me juice without a real fruit. I inhaled that thing without feeling or tasting anything. We also got 3 different rolls and they were all mush. The kind of mush that you get from eating old sushi. This is upsetting as Blue Fish was always our go-to sushi spot - even more upsetting that our house is being built a few blocks down. I mean, even the tempura fried ice cream was doughy. Just no. I'm sorry to say that Blue Fish and I are going to see other people."], ["Shelby S.", "I wrote a review a while back about an experience I had at Blue Fish, and I would like to re-write because I have been back 15+ times since then and I love it. I usually go for happy hour and sit at the bar, but I've taken a few people from out of town so we sit at a table. The service is always great and the bartenders are really nice and quick. The volcano roll is the only baked kind of sushi I have ever liked.. It literally melts in your mouth. It is so good and it isn't drenched in sweet sauces like most places. The pieces of scallop are thick and I think the price is fair. The chopped scallop sushi is fresh and delicious and the taste of the fish isn't taken away from sauce. Sometimes I find it hard to choose between the volcano roll and the tuna tower because they're both so good. The wasabi sauce on the tuna tower is wonderful and the fish is always super fresh. The reason I gave 5 stars is because of the happy hour prices. I always get the mini sushi tower and although it's awesome, I think the price should be $4. This place is in a hot spot though, so that probably plays a factor. My one suggestion is to PLEASE put a salmon tower on the menu! They offer a mini salmon tower, but would love to see it on the regular menu. The happy hour drink prices are also really expensive.. Especially for beer, but I will say they have great Sake happy hour on Thursday."], ["Stephen M.", "My experience here was quite pleasant. The staff was attentive and valet was very nice. Sushi was excellent."], ["Shay B.", "Sis and I were in town last week for a show at The Granada, and I, like any good Yelper, scoped out food options. And since I lurve me some sushi, as does Sis, The Blue Fish was a no brainer.We sat out on the patio, which was covered and has misting spray, which was much needed in that Texas heat. Our waiter was very attentive to our needs. Sis also thought he was \"like, soooo cute\" but that's what happens when you dine with 18 year-olds. The food and beverage was pretty good! We went all out -- I enjoyed some $2 Sapporo since it was still technically Happy Hour, Sis ordered a plate of calamari (which came with this sauce that was soooo good), and we feasted on 3 rolls: the tempura roll, the California roll, and the Hawaiian roll. The tempura roll was definitely my fave.Speaking of tempura, if you check-in on Yelp, you get a free tempura ice cream! I figured it would be a scoop or 2 in a cup, but no, it was a legit dessert for no money. Huge bowl of tempura ice cream, fruit, whipped cream, the works. Sis and I killed that thing. I'd definitely come again next time I'm in town!"], ["Heather M.", "After a hiatus, I returned to Blue Fish. Twice. I am happy to say that both experiences were great. The service was brilliant, and so was the food. We went on a Wednesday, so we enjoyed $2 beers. Amongst the sushi we ate, the Piñata Roll was the stand-out. It was fantastic: nice and spicy. The Spicy Tuna Roll was a bit lacking, but the Samurai and Calamari Rolls were tasty. I am happy to be putting my favorite old lunch spot back into my sushi rotation. Although I don't plan on going here on weekend nights as it's too crowded for my liking. When I am hungry for sushi, I just can't wait for long."], ["Stephanie B.", "By far my favorite sushi restaurant since I was 13. I find myself comparing ALL other Ahi Towers to theirs. Not lots of mayo, crab and avocado In mushy mess... But instead a trio of smelt egg colors, tons of tuna (you can ask for \"non spicy\" that comes without siracha) and just enough rice so that every bite has everything! Tip: if they offer to mix it up for you... Let them! They always return the plate in a cute shape too!"], ["Arrielle J.", "Ahi Tower, great cocktails, cute waiter. I was sold."], ["Trinh T.", "The Blue Fish is a trendy sushi restaurant in Dallas's lower Greenville area.  It offers quality sushi, a nice patio, and a great young, trendy atmosphere.  It's been around for many years now and is an anchor for the new lower Greenville area.My Overall Rating - 3 Stars (Atmosphere, Service, Food, Return)Atmosphere - The Blue Fish has always had a hip, trendy atmosphere.  It's a great place for people watching or if you want to be scene.  Valet at the front along with outdoor patio dining.  Overall it is great, unless you get stuck in the back area of the patio near the parking lot/drink station.  Unfortunately my last visit placed us in this area next to a puddle of still water.  To make matters worse, the mosquitoes were out and taking full advantage.  I know it's seasonal, but next time I'm asking for a different or indoor seat.   1/2 Star.Service - Our server was very nice and friendly, and as a bonus our orders came out FAST.  We were amazed as it was 6:45 on a Friday night.  When we told our server about the mosquitoes, she just laughed it off.  Honestly we just wanted to warn them to not sit anyone else @ the table.  And while the food came out fast, The Blue Fish got busy and it took a long time to pay our bill.  Or it may have felt longer because we were itching.   1/2 Star.Food - We're fans of The Blue Fish Las Colinas, and the original location off Greenville is just as good if not better.  In fact, the presentation in my opinion is better here.  I always stick to the non carb friendly South Beach roll, which uses cucumber as a wrapping for the roll.  The Summer roll, on the other hand, is one of my favorite (and unhealthier) rolls courtesy of its cream cheese.  But the best item I had was their tuna belly sashimi. It was smooth like butter, and I think it's a limited item as I had never seen it on the menu.  Bottom line, their sashimi & rolls here are quality.  It's a little pricier than other sushi restaurants, but given location & quality I understand why.  1  1/2 Stars.Will I Return? - Probably.  It's not an automatic return only because The Blue Fish has other locations that are more convenient (Las Colinas).  But if you like quality sushi & want to take advantage of Lower Greenville's awesome new digs, grab a date and head to The Blue Fish.  You won't be disappointed.   1/2 Star.My Yelp Rating Scale (Sum of all parts):1 Star - Atmosphere - Is it a cool dive?  Perhaps an upscale place?  No matter the type, atmosphere plays a big part and I'll give a star if I like it or thinks it has great charm.1 Star - Service - You can have a great meal with bad service.  But that's also what can make a five star joint drop to four.  It's important to the dining experience that service is great and on point.2 Stars - Food - I'll award up to two stars for the food, since this is the main reason we dine out.  Sometimes the extra star is given for value, but it's really all about the food.1 Star - Will I come back? - If I know for a fact I'll return, I'll give this a star. A place has to make an impression for me to return. Each Category can be given up to 1 star except food (2 stars) because I consider all these categories important to the overall dining experience.  I will sum them up to provide my final Yelp score."], ["Shannon F.", "Steak sushi? Only in Texas. Excellent food, excellent atmosphere, excellent to show up on a Sunday when they're serving bottles of wine half-off. I recommend you come hungry enough to end your meal with tempura ice cream. It's served with orange slices so I'm almost certain that means it's good for you. It also tastes like a mouthful of joy."], ["Madeline B.", "This sushi was so filling and delicious I would suggest it to anyone in Dallas. The  service was wonderful and they treated us so well even though we came in close to closing. The piñata roll is amazing you truly can't go wrong with anything."], ["Mario R.", "My experience at Blue Fish was excellent. I went in on a Saturday night around 8:30 expecting to be sat at the bar. However they were able to accommodate immediately. I ordered the Samurai, Rainforest, and the Piñata rolls. The rainforest roll was by far the best of the three. The rolls were hearty and didn't fall apart. The size of the rolls were great as well. 3 was actually more than enough. I can't wait to go back and try some more of their sushi rolls."], ["Natalie F.", "The food is amazing! Some of the best raw sushi I've ever had. The atmosphere is great. The bartender that served us was social, friendly, and took pride in the drinks he made us. The spicy mango martini is the perfect combination of sweet and spicy, the ahi tuna tower was delectable, and it was just an over all great experience. I've been multiple times and have never once been disappointed."], ["Kevin W.", "Has been consistent every visit. The freshness of the fish to the great service that I experience every time my wife and I eat this restaurant. There aren't many sushi restaurants that even compare to this one."], ["Reno D.", "It's The Blue Fish. It's fine. Lot's of turnover so the fish is fresh. Remember this is a chain, so don't some here like Steve S (one star review below) looking for an A List big city dining experience. Really? There are many 5 star Japanese restaurants in Dallas if you want that. Happy hour has a nice list of 5$ items from 5-7 every day at the bar.Good patio if the weather is nice. It's A-OK for sure."], ["Michael M.", "One of the best places to do take out. Everything was fantastic as always tonight! Ordered: ahi tuna bowl, rain forest roll, summer rolls. Best service and always so fresh!!!"], ["Jeff H.", "Start to finish one of the best dining experiences of my life! Friendly and courteous staff, made us feel at home right from the beginning! We will likely frequent this place on a weekly basis. The quality of the food was second to none - just icing on the cake! If I could rate this higher than five stars, I would!"], ["Kari C.", "One word... Superb! This place is so delicious and the entrees come out as a piece of art! We showed up at around 7:45 and sat at the sushi bar, everyone was very friendly and there were empty tables so no wait! The mega lobster is a must try! They have a really cool loyalty program too, you sign up and for every dollar spent you earn a point. For every 300 points earned you get a $25 gift card there. That's awesome! If you are like my fiancé and I, we spend $100 easily every time! The only thing is in order to sign up you pay $25, but then you get a $25 credit to use on your next visit. So it's really not a bad deal!"], ["Rob K.", "I liked this place quite a bit.The valet was efficient and fast, as was the seating. The server was courteous, helpful and non-intrusive. Gal Pal had the Rock Shrimp Popcorn and the Spider Roll (tempura soft shell crab, avocado & cucumber), while I had the Miso soup and the Seared Ahi Salad. We washed it down with some saki suggested by our server. Gal Pal was not a fan of the Rock Shrimp but raved about the Spider Roll; my meal was fresh and flavorful.I'll be the first to say I'm not a sushi connoisseur but I really enjoyed The Blue Fish and will return."]], "Teppo Yakitori and Sushi Bar": [["Maribel C.", "Outstanding, Teppo has become one of my all time favorite. It's a small place but intimate and cozy for a date night or perhaps a small party of 6. Parking is meh, but it is Lower Greenville and totally worth it. Service is a hit and miss but the chefs make up for it! Food was amazing, from the fish to the Yakitori- It was fresh and presented beautifully! Fresh wasabi is a must and if you feel adventurous you must try the sea urchin!My favorites:*Oysters (grilled or raw) *Sashimi platter and any sushi, but my all time favorite (Uni & Toro)*Chicken gizzards, chicken hearts, scallop & bacon and enoki & baconHappy eatings :)"], ["Neil M.", "Normally I list every dish but in this case I will just analyze the restaurant overall. Everything I ate was very tasty but the prices are still absurd. The prices seem reasonable until you see the actual portion size. The sake prices are insane and they don't taste any better than others i have had. Keep in mind that I have eaten at many of the nicest restaurants in Texas and I think Teppo is the most expensive place i've ever been. I have to consider that it's really designed to exclude people who are not wealthy.  I can find food just as good at places where i can pay 50% of that price. I came for the yakitori but the sushi was as good as any i've ever had."], ["Tiffany L.", "I love yakitori. I mean, I only found out about yakitori a few years ago, but I love the idea of grilling meats/innards on a stick. So simple, yet so tasty. The first time I had it was in Shanghai and since then I've been looking for yakitori places wherever I go. I've also had it in Taiwan and lemme say, it's good in Asia. Teppo can compare. Although missing a few of the key tasties that I miss from Asia like chicken skin or soft bone or even the chicken heart. The yakitori there is grilled pretty tastefully. The duck is especially juicy and tender. Bravo bravo.I'd definitely go back again and try out some of their other items like sushi or dessert. Be warned, not a very cheap date place."], ["Meredith M.", "Wow. This is a place to impress a date/ friend/ family member. I took my best friend here for her birthday and it was incredible. We sat at the sushi bar and loved being able to watch the chefs work. Everything was so fresh and delicious. Yes it's pricey, but who wants discount sushi? Not me! The atmosphere was classy and relaxing. It's a much smaller space than most people are used to for a Dallas restaurant. You definitely feel like you have been transported to New York or Boston with a more cozy atmosphere, but I loved it. I can't wait to go back!"], ["Tony Y.", "This place is ridiculous WE WILL NEVER COME BACK HERE AGAIN. 40 minutes for sushi rolls?!What are they thinking??! Prices are expensive way over priced Couple of Edamame for 10dollars"], ["Nikki K.", "This is a hidden gem near steel city pop that I've been a regular for years at. The sushi is always very fresh and you rarely have to wait for a table. Their sushi is no frills- no sauces or anything added- which I love. The price is also not bad for the quality they use. Only negative is sometimes service can be a little slow. Overall, this is my fave sushi place in Dallas."], ["Yoon C.", "Favorite sushi/sashimi place in Dallas.  The fish has always been fresh. It is a little pricey but definitely worth it.  There's usually a wait, but the staff is efficient and accommodating."], ["Kev L.", "This is one of my favorite sushi places in Dallas.  They have the best of both yakitori (grill) & sushi selection. Try it and you wouldn't be disappointed!"], ["Megan A.", "Teppo is my new favorite sushi spot. Not only was the food fresh and flavorful, but the restaurant was very clean and cozy. Great service and overall wonderful experience. Soft shell crab and rainbow rolls are awesome!"], ["Eric A.", "Great food and interesting atmosphere. Definitely a good date spot."], ["Jhun D.", "Best place in town.  If you eat somewhere else, then you are just pretending to like Japanese food.  This place is authentic and traditional Japanese food.  Love this place!"], ["Celin G.", "This is my favorite sushi restaurant in Dallas. The service is great, the servers are so calm they always have it together.  Food is always delicious and consistent!"], ["Deedee T.", "If I have a chance to put half star, I would have do it.  I've known teppo for a long while.   Teppo is one of my fav restaurant until lately -continuously 3 times the sitting host arrangement is awful! First time, came in a group, not only they do not sit us even we said it will be max 30 -40 mins dining time before their next table ready.  They rather us go away.  Second time, I figured I should give them another chance, once again when I go with my friend, I was there earlier than my friend so I told them I would like to sit when the restaurant is only half full; yet the host said I have to wait until full party, I wasn't feeling well and need some hot foods and hot tea, so I want to order right away and my friend is only few mins away; but the host reject me! I ask her so is she pushing me away??? I was so mad since I have been a loyal customers for many many years!!!! Is that how they run business? I told her to ask manager so she pretend she has asked, walk back wait for awhile snd then come back up and said nope! What the hell is that? I even said it will just be me one person and she still reluctant to seat me! Fine!!!!!!!!! I finally left without wait for any mins and end up try Tei Tei spent over 270$ that night! From that on, TeiTei which is so much fresher!!  From that day Tei Tei is going to be our routine Japanese dinner table instead of teppo! Bad bad bad and stupid stupid service!!!They really thinks there is only Teppo we can dine??? TEi TEi and sushi sake are sooooo much better!!"], ["Kat E.", "I went here with a small group of friends last fall and really enjoyed myself. The most memorable items we tried were the beef tataki, agadashi tofu, salmon sashimi, and beef tongue yakitori. The only problem was the rude server that obviously wanted to end her shift and was pretty annoying about splitting checks. I would like to go again (and will probably sit at the bar)."], ["Jennifer H.", "Great sushi! It is a little bit on the pricey side, but worth every penny! Not sure why I didn't go here sooner!"], ["Bryan K.", "The service here is good, although the food took a while to come out. If you're looking for great tasting sushi this is a great location to try out. There's a wide variety of specialty rolls. I ordered a couple and totally stuffed myself. It was completely worth it! The interior of the restaurant is very clean and the staff looked very put together during my lunch there. Overall a great experience."], ["My H.", "Who cares that every time I eat here, I leave smelling as though Ive been roasting on a spit over an open flame for 2 hours. This sushi place is one of a kind in Dallas because it's not just your average sushi joint; it is yakitori. Who doesnt like every type of animal meat and/or organ served on a stick??? From chicken to beef to duck and quail, even meat balls, seafood and veggies; if you haven't already tried, I would advise you to stop reading this right now and just go eat there to see for yourself. Everything is grilled to order and is absolutely divine. I haven't had a dish here that wasn't amazeballs. However, the star of the show has to be the brown sugar panna cotta served with black honey. Oh goodness the rich and creaminess of the dessert will send you back the following night. Be prepared to wait on weekends though-its an itty bitty place."], ["Ako D.", "Overtime, restaurants get complacent. They don't care as much about pleasing the costumer. Service gets sloppy, the food becomes somewhat average...unfortunately teppo just crossed over into this territory. I'd rather go a bit further to Tei- Tei or Tei-An. Lower Greenville has seen a lot of change in recent times, a welcome one would be for Teppo to move on, and get replaced by a restaurant that cares about great tasting fresh food with the best ingredients, with a side of good service!!!!"], ["Kristie A.", "Dear chicken meatball - you have failed me.  It was one of my favorite things on the menu, but not so much anymore. I miss the hot towels and the cucumber salad that used to be brought out first, but those small details will not keep me away, because I still super duper love this place. I feel like a dork ordering the California roll, but damn it, it's just so good.  They make it with snow crab so it tastes better than anyone else's California roll.  Trust that!Sit at the sushi bar, order some sake and watch the sushi chef show.  It's quite entertaining."], ["Julia B.", "My favorite sushi place in Dallas! The only downside is that it's a tiny restaurant, so make sure you get there at an early hour so you don't want to wait to be seated."], ["Zee J.", "One. Of. The. Best.Once in a while you come across a place where you feel JUST fine being totally gouged. I guess it's like taking your kid to Disney World. You know you overpay but you totally still want to do it again soon.Teppo is a Disney World where fresh raw seafood awakens the inner sushi child in your mouth. Try the sashimi daily specials. You'll know what I mean then. See the problem is that we are all over-sushi-ed today in America. Every strip mall and its neighbor has a joint serving up sushi-like clumps of overlooked rice and barely sanitary limp pieces of fish. And don't get me wrong I still go for them all the time especially when the price is right.But then you tried teppo's sashimi special, and the matrix is unplugged. What is this texture? Melting yet firm. Taste clean and sweet. You wait for the familiar hint of fishiness at this point that you know you can accept, but no there just isn't any. It's a new experience! Like you never had before.Sure it's expensive, but you are already sold. Thanks teppo. For taking it all so seriously and demanding this level of greatness. Have been there four times now. Consistently blown away. Rivals any great sushi place anywhere in the world. It's filling a role of the special occasion go-to place for me and wife. Just felt compelled to share! Love their skewers too. Especially the homemade grilled tofu!"], ["Mad I.", "Been coming here for more than 11 years.got to say best sushi place around Fish is always fresh and exotic"], ["Damien A.", "My favorite place in the world to eat. Everything on the menu is delicious. The best way to experience how fresh the fish is is to get the sushimi special. I miss when they used to do the octopus carpaccio, so hopefully they'll bring that back next time i stop by. Great costumer service as well. Try to come early, because it's not a big place and does fill up fast."], ["Alex S.", "I loved teppo big time the first time I went- but then I went back to brag to all of my friends, and we didn't have such a good time. The food is very fresh, definitely within the top 5 around Dallas. Rolls are carefully crafted, everything I have tried has had great balance of spices.. Very delicious!!! But, the problem I had was with the staff. My friends and I bought 90$ worth of food. We only had 10$ worth of cash left after the bill, so we left a 10$ tip. We knew it was a little low, but it was all we had in cash and rather than waiting another 20 minutes to send our card we decided to choose that route. When we were leaving a lady we haven't seen before who I later learned was a manager said \"did you have bad service?\" Aside from the 2 hour wait for a few rolls which was to be expected, we decided not to mention it and said \"no!\" She said \"then why did you tip so low?\" We explained that we only had 10$ cash. She then flat out said \"you need to pay 18.\" Umm... 18?!?! Do you realize I can feed 4 families at McDonalds with that kind of money?!? That isn't even 20%? I knew we were being treated wrong, but because I was wrong in the first place by tipping low, I borrowed 5 dollars and payed 15 total then walked out. Although I payed 15 she still insisted on the 18. Lady, it's illegal to force tips. Don't be screwing people over like that cuz it's a great way to lose customers."], ["Hung H.", "Not a bad sushi place at all.  Place is pretty small.  Sushi is so so. Nothing too special.  Their oysters on the half shell were delicious.  Service is a average.  We went on a Friday night around 8 ish and had no wait so that's a plus.  Love the skewer menu but man they need another vent or a stronger one. Place gets pretty smokey if the skewer grill is constantly cooking.  I love the smell but I dislike it sticking to your close.  Would recommend for quick sushi fix."], ["RM S.", "In most places, this would be called a \"neighborhood gem,\" but if your neighborhood happens to be in Lower Greenville, Dallas, then best of luck to you. You'll definitely need a reservation to eat here - especially on weekends. Even if you're dining solo.  Food is (surprisingly) very good. Robata items are excellent. I steered away from rolls and such, and ordered \"specials\" and grilled items. Excellent, if a tad pricey, but worth it - in Dallas, at least."], ["JD D.", "My absolute favorite restaurant in Dallas. It doesn't get better than this, folks! Their fish can't be beat and the pricing for such GREAT quality is very reasonable. Atmosphere is quaint... great date spot! Staff is one of the most professional I've ever encountered. If you haven't tried this place, do yourself a favor and carve out a night for it! You're sure to be impressed!"], ["Diana D.", "It's quite nice inside and so popular my mediocre review won't do anything to change Teppo, but I ain't gonna lie--this place is just aight. My friends and I wanted some yakitori, and being three little Asian girls we wanted the good stuff. Off to Teppo we go. While the food was a solid 4 Yelp stars, service was crappy from the rude hostess and apathetic and nearly invisible waitress. The little Asian girl hostess was so rude and pretentious! Just because I the patron am also a little Asian girl doesn't mean I'm not also deserving of good customer service. The eye rolling, hater glances, and attitude was so typical of twats like her. And our waitress was near absent the whole night. While service is sorely lacking here, food is excellent here. It's just a damn shame it's gotta be this way."], ["Alden C.", "Order the Teppo roll every time you go.  It's different and they might even cater it to your tastes.  This place is perfect. I only wish they did reservations for 2."], ["Heidi K.", "An average of three stars-- 4 for the tastiness, but 2 for the service/price!The restaurant is very cute and small with the chefs grilling and making sushi in the center of the restaurant.  Everything smells amazing, and anytime they started grilling something new, I was so tempted to keep ordering.  My friends and I were lucky to grab a nice table at the front without reservations, although I suppose we were waiting in front of the restaurant for it to open at 5:30PM.As my friend put it, however, this was \"one of the most confusing meals of [her] life.\"  The menu itself was already confusing, and when we asked the waitress to clarify, she could not really understand us.  We ended up going with whatever she said was the \"sushi combo,\" and we had no idea how many pieces came in that or what actually came with that.  We didn't even know the price.  She kept answering our questions with answers that didn't make sense, and we ended up just.. going with it.  The sushi was great, and the enoki and bacon yakitori was particularly tasty as well as the grilled rice balls.  The black sesame ice cream was also delicious.  The bill came out to be quite pricey, and I just wish we could have had a better understanding of what things cost/how much food we were going to get."], ["Kali H.", "So, let me start off by saying, the best part of the meal, was the cold water. And now I will begin...We walked up to what looked like a closed restaurant, but it was open. Very small place. It was too hot for a 98 degree day.We were seated in the back corner, given one menu and sushi ordering papers. Pretty quickly they brought the delicious water I mentioned above. So 7-8 minutes go by and a girl asks if we are ready, takes our sushi papers and that was it. I had to flag her down ten minutes later to ask for an iced tea, which then took and extra 5 minutes to actually get any sweetener to the table.The sushi came out in a not so timely manner, but we did ask for custom things (like no cucumbers) so I guess that's ok... The main problem was the actual sushi. Honestly, I've had better from Kroger in the deli section. It was mediocre at best. The service severely lacked. We left without trying the raved about black sesame ice cream and went to Yummilicious instead.Very underwhelmed. Not good. Service was mostly nonexistent. I'd rather go to Tei Tei."], ["Craig R.", "Teppo has definitely become my favorite sushi restaurant in Dallas. The service is great and the food is spectacular. What really makes the experience is the chefs attention the the freshness of the food. Not until I dined here did I realize how the temperature of the food makes a difference. If you want to have a nice night out with a date and are willing to spend a little more for a great experience, Teppo is the place to be."], ["Denisse C.", "A bit pricy but excellent service and food was delicious! It's a small place but enjoyed the atmosphere. Will definitely return."], ["Karissa S.", "This is our favorite sushi restaurant in Dallas.  The fish is always really fresh and we love the yakitori.  We challenge ourselves each time we eat here to try something new.  It is small, so best for singles at the sushi bar, couples or small groups.  They have one large table that I think seats eight.  The staff is very friendly and accommodating."], ["Diana P.", "food wise it's delicious and i love everything. their yakitori and sushi is right on point. but still, i think Sushi Sake is a bit better. lol ooh and their sesame ice cream was good too. what I can't stand with this place is they need to relax with the whole \"your party isn't here therefore we can't seat you\" rule. it was a TUES night and 6pm and NO ONE WAS IN THE RESTAURANT. seriously, what is the big deal if you seat my cousin on a table and let her have a drink. i can understand like Friday, weekend night of course but on a Tuesday night and NO ONE in the restaurant, come on relax. I'll return again, but chill out!"], ["Henrik A.", "Called ahead regarding reservations, was advised they dont take reservations.  Seated by the waitress, party of 7. Was promptly kicked out because they don't seat 7 and the owners friend had made reservations. Smelled good though."], ["Shine T.", "Japanese owned.Best sushi and Kushiyaki in DFW. Always consistent and great atmosphere.Friendly and attentive wait staff, they have great service.Inside is clean and decorated traditionally with modern influences.Nice sake and kushiyaki selections.Fresh ingredience, I highly recommend this place."], ["S M.", "Good service and great food!I went here with a friend around 6 PM for dinner on a Saturday.  The place was only around 1/4 full.  With the place seating a max of 48 people, it was pretty quiet. The food however was phenomenal.  Once my friend arrived, we were seated right away.   Since he'd been there before, I let him choose the menu.  Everything we got was awesome.  My favorites:Asparagus wrapped in baconToro sushiRed snapper sushiCold, unfiltered sake (forgot the name)Chefs surprise roll (this changes every time, but the one we had was amazing with a spicy kick)The service was good too.  Our waitress was good at suggesting things to try and our glasses were never empty.  I'll be back!"], ["Scott A.", "This place never fails!  From the great service to the freshest Spicy Tuna Hand Roll I've ever had... I'm never disappointed with Teppo.  If you want to impress someone with a Dallas gem of a restaurant then take them here.  Other recommendations here would be:-Traditional Rainbow roll... they focus on crazy fresh and perfectly sliced fish here -Cajun roll, they do it right... Not fried, perfectly textured crawfish and just a tad spicy-Shishito peppers - just get them-Chicken meatballs with quail egg for dipping - how can you go wrong -Chicken livers are tasty but not for the 'on the fence liver lover'... just wash the decadent fat taste down with some ice cold, unfiltered sake... Done :-)Lastly, just pay the extra money for more fresh wasabi.  You'll thank yourself after."], ["Roxanne K.", "Finally... A sushi place I can eat at in this town. I love this place... cute Asian guys behind the counter using superior knife skills (cool to watch). I enjoyed watching the grill guy make skewers! Everything smelled so good. Even the glass of water with the thin slice of lemon was perfection. Sushi here is super fresh (you get what you pay for) and they know how to put it together. Wasabi is real and fresh! I enjoyed the pickled veggies, sushi in rolls and singles, chicken meatball miso (yummy), sunimono salad with crab... oh my. Just the freshness of that salad and sweetness of that crab alone!I finished with the black sesame ice cream... how the hell could I not after reading reviews! Let me tell you the reviews are all correct... it's unbelievably good. You will pay more here, but you will NOT be disappointed! I did not experience any issues mentioned in other posts, I sat at the sushi bar."]], "Yama Sushi": [["Stephanie K.", "The dinner time is way better compared to the lunch. I would say the dinner time would deserve 4 stars but lunch.... Probably cause the taste, ingredients and portions are better.The lunch is definitely cheaper (not by much) . They do have half off select sushi but I feel like they cut out most of the ingredients to make it delicious. The service was also faster at dinner time . That doesn't really matter but the food does. Why is it small?!!! And why is it less ingredients?!?!Ramen was mediocre, the ajitama egg was just hard boiled. sushi was delicious at dinner time. Disappointed"], ["Bobo N.", "It's ok sometimes it's off the food but the prices are nice and the happy hours are a bonus!"], ["J C.", "Whenever I'm in Dallas this is one of my favorite late night meal!  They have great yakitori and traditional Japanese dish~"], ["Nicole E.", "This place always makes me happy. They have a great variety of food to try and their servers are helpful. It is small so I would recommend going with a small group. Their ramen is tasty and the sushi is always fresh."], ["Emily P.", "I'm Japanese, so I am super picky. But I must say, they did well. The place took me back to a ramen shop in Japan. Price was super reasonable, great happy hour selection. Hard to find for a good Japanese place. Food was authentic, some were little off. But loved seeing food from home on the menu, usually that doesn't happen, so I was a happy camper. I'll definitely will be back :)"], ["Ally N.", "Oh my gosh this place is so good. Small places like this makes me love Dallas even more. My previous experiences with Japanese restaurants have been less than stellar, but I think this restaurant may have changed everything!!Came here on a Thursday and their special was $3 sushi rolls (only for about four choices of them though and they're six pieces) and $3 appetizers. I ordered Tonkotsu ramen (half sized), shrimp tempura and the California roll. Basic.... I know. Regardless, no complaints anywhere. The broth was very flavorful! I was very satisfied with the food. My friends ordered the octopus balls, Shoyu ramen and buta no kakuni (braised pork belly). Oh!!! You have to order rice separately and it costs a tad bit extra. All in all, I actually think that we all fell in love. The service was great and they fluently speak Japanese which is so cool!!! Haha. They take orders on iPads which I guess is also cool. Also love how this place closes late. I would definitely bring my friends here next time."], ["Hang P.", "First time back since the place was named Sushiyama.  For the most part, things are still the same but they seem to have made a few additions to the menu -particularly to their ramen selection.  Tried their tonkotsu ramen, takoyaki balls, and gizzard yakitori.  I really enjoyed the tonkotsu ramen - it had a great, rich flavor, and they don't hold back on serving sizes either.  The pork  was melt-in-your-mouth goodness.  I would definitely come back for the ramen.  The takoyaki balls and gizzard yakitori were good, but I wouldn't say there's anything particularly special about them.   Our server was really friendly and attentive as well.  He did great in answering our questions and seemed knowledgable about the menu items.Unfortunately, my friends didn't enjoy their orders as much, which makes me iffy on whether I should give the place three stars instead of four.  They got the chicken katsu curry and onigirl balls.  According to the,m, the  chicken katsu became overly soggy in the curry and the onigiri was too salty."], ["Quynh N.", "We came here twice - the first time to try the entrees and the second time to try the $1 and $1.50 happy hour sushi. I wanted to like Yama, I really did! But there were so many things about the place that just didn't do it for me.The first time we came here, it was almost empty (we came at around 1:00AM). I ordered the spam musubi and the katsu curry rice. The spam musubi was pretty good, although I feel like there might have been a bit too much rice. I really liked the katsu curry rice, I would definitely order it again. It was a pretty decently sized portion. I'm not sure what my friends ordered, but some of their orders came in pretty small portions. So my first experience was pretty decent. I was willing to come again for another spin.The second time, the place was so packed, we had to wait 30 minutes for a table! People really wanted their $1 sushi! So first off, it was $1 or $1.50 (depending on what you get) for a single piece of sushi. Okay, that's not so bad. When our orders came out, though, I was very disappointed. The sushi was small, didn't look fresh in the least, and the seaweed was so rough! I ordered $12 worth of sushi and I was not filled up at all. Not to mention their service was really slow. I honestly would have rather paid $15 for a roll at Densetsu because at least that would have filled me up. Their non-happy hour sushi might be better, but this experience makes me not want to eat anymore of their sushi.So bottom line: I probably won't be coming back. I might be willing to give this place another try because I liked their katsu curry rice and spam musubi so much, but I definitely won't be coming back for their happy hour sushi."], ["Han A.", "I love this place! I love their Japanese street style food! I love the great service we get every time we come! On Tuesdays, they have $1 sushi if you're desperate for some sushi... Their uni and ama ebi are good quality. Other fish are eh. I like their beef tongue and hamachi kama. I like that dessert that comes with red bean breaded in the shape of a fish and ice cream on the side... I don't like the Tuesday night crowd though. Definitely worth the try!"], ["Heather M.", "This certainly is not the same Yama Sushi where I cried bucket loads of tears with my friends after eating Tear Drop Rolls. The sushi here used to be fantastic, but since the change in ownership happened, the sushi has become average at best. Last week The Brewer and I went in and ordered four different rolls, and not one of them stood out. We had the Cajun, Shrimp Tempura, a cooked chicken roll, and a tuna roll. In all four rolls, the rice wasn't done properly. The tuna in the tuna roll didn't look fresh. Everything seemed near the same quality as grocery store sushi. The Shrimp Tempura Roll was OK, but there was nothing significant about it.  *On a side note - we had to order rolls where the fish is cooked due to the pregnancy factor, so I had different items this visit from the last time I was here. I would also like to point out that while service has never been a strong point at Yama, our waiter last week was one of the worst I've ever had. 1. He took our drink order then never brought my date the beer he ordered. 2. I asked what kind of fish was in a particular roll, and he replied \"fish\". 3. He purposely avoided our table - and all the other tables he had, for the rest of the night.This took some skill: it's pretty difficult to avoid three tables in a restaurant the size of van. This experience just makes me really sad. The tears I shed at Yama now stem from something other than the Tear Drop Roll."], ["Joseph L.", "Here in Dallas for work and was craving Ramen. This place is great!  The ramen was awesome and the dishes I ordered tasted great!  If you like squid, be sure to get the grilled squid. Will definitely come back!"], ["Woody W.", "Came here for late night meal last Sat, 26Sep. The small dining area is nice and clean. The staff are very friendly. There's a TV playing CNN (muted). They have a small sushi bar you can sit at. I had the stir fry chicken livers with garlic and they were delicious, I'll definitely be back for these, but their menu has lots of items I want to try. Namely, their kimchi and their ramen noodles, which is one of their specialties. I also had the Sundae roll, absolutely delicious as well. Highly recommended."], ["Paul H.", "Decor: 3/5-Parties of 4 can be seated easily-Small sushi bar-Check out the blackboard for fresh sushi and specialsService: 4/5 -Orders are placed on the iPad-Food is brought out fairly quickly-Friendly serverFood: 2.5/5-Hot tea isn't free here! -Tonkotsu ramen was okay. Noodles were too soft, broth wasn't creamy or rich. Fatty cuts of pork. Those saying the ramen is good here haven't had good ramen in NYC-Spider roll was mediocre. Small pieces compared to other places and the price is average. Would not get it again-Unagi was deliciously toasted-Uni from SF was creamy but not much flavor. Had a fishy taste.-Egg Omelette had a mild sweet flavor. Not bad."], ["Randy S.", "I have to say that I really like this place given how they're open so late and have great specials during the week.  I have yet to try any of their real sushi, but that's probably because it's hard to not order their tonkotsu ramen.  Ever since Mr. Max closed, I haven't really found a place in Dallas that serves a decent bowl and I think I've found something to tide me over for now.  It's not Mr. Max, but it is pretty solid and I would recommend trying it out (plus it's very decently priced).  The broth is very rich / tasty and the pork is usually cooked to be quite tender.Other things I've had here are the spam musubi (pretty solid and a meal unto itself), the takoyaki (tasted ok but wasn't particularly special in any sense), soft-shell crab (delicious and nicely fried but somewhat of a small portion), and the whole fried small shrimp (good though a bit harder than the crab). They also have some great drink specials throughout the week (such as $2 draft beers / $2 sake) and they're open very late.  I'm quite a bit of a night owl, so I definitely appreciate any places that cater to people such as me.I highly recommend trying this place out as there is a wide variety of things to try out, everything is decently priced, and they're open late."], ["Judy T.", "It's a diamond in the rough. It's definitely casual and for all you, real foodies. Reminds me of the little mom and pop shops in the streets of Chinatown NY. We were the only family in there at the time, but the sticker hours on the door said Closed (Sundays) but ironically the flashing Open sign was blinking. Anywho, hope that's fixed. The staff was corky and fun! I appreciate a staff that's honest about a dish. Food was on key!"], ["Rachel Z.", "nice small Japanese restaurant，food is good，service is good，beer is Wednesday special，only 2 for local beer~"], ["Janice C.", "Sooo we came for $1 sushi and it wasn't good....The fish was warm and poorly out together, and they all tasted the same... even if I got yellow tail or snapper or salmon it all tasted the same... And we also ordered a spider roll, it was bad...m just really bad...The fried gizzards were good though!  The reason I m giving it 3 stars is bc you get what you paid for... so for $1, it was expected"], ["Judy H.", "If I was rating the ramen itself, it would have been 4.5 stars maybe. The noodles were great and taste-wise, I was happy. Service brought down the rating. My family came in on a Friday afternoon for lunch. The waitress forgot an order and didn't think it was weird that three people were eating and one person was just sitting there twiddling his thumbs. Then she tried to say that his order didn't come with miso soup when the menu said it did. Also, the wait was excruciatingly long. I had to be back at work and the meal should have taken an hour but overall, it took almost two where half of it was just waiting. Maybe it was an off day."], ["Katie H.", "Yama sushi, I love you, and I keep coming back to you, but we have a problem. Your food is tasty and reasonably priced, albeit a bit inconsistent. And your atmosphere is cute and cozy. But your service SUCKS. For the love of god please get better servers. Some of them are decent (the older woman is always nice, but I've only had her twice) but some of the other servers are possibly the worst I have ever encountered. The young pretty asian girl always gives me and my boyfriend the stink eye and barely ever communicates with us. She stops in, doesn't even smile, takes your order then disappears until it's time for a check. One time, my boyfriend's food came out fifteen minutes before mine and she didn't even stop in to say that my food would be on it's way. She completely avoided us for the rest of the night and we had to flag down another server just to get our waters refilled and to get the check. We are regulars but we are not so regular anymore due to the horrible service. I hope that next time we come in, the servers will have their act together and actually smile for once and not avoid our table like the plague."], ["Ryan G.", "Authentic, affordable, and friendly. The Sushi is great but the Tan Tan Ramen is also excellent.I'm not super adventurous but they have all the weird Japanese favorites as well.  Not your standard glittery, uptown sushi joint."], ["Raymond W.", "Good food, authentic atmosphere, great service (thank you, Anna). I have always enjoyed my visit to Yama Sushihighly recommending their Uni, fried chicken gizzard, oden soup, and yakisoba"], ["Anthony P.", "The Miso Ramen was pretty good and I also tried one of the Ramune soda pops (peach flavor) which was alot alot less than I thought it would be for 2 bucks (6.6 fl oz.) But delicious nonetheless. My gf and I tried the philidephia and Cajun roll and both were really good. I'm coming back again for sure."], ["Greg H.", "I was right around the corner and craving some sushi for the evening. I found sushi yams and decided to give it a try. I'm very glad I did. On Tuesdays they have $1 sushi. You only get one piece but I was able to try the spicy tuna, salmon, and crawfish. They were all very good but the spicy tuna was the real treat. I ordered another round. In addition, I tried the tuna heaven roll which was also the perfect balance of spicy and crunch. The staff was very friendly and attentive. I would recommend sushi Yama hands down!"], ["Alice G.", "Located in a plaza and well hidden from sight if you're not careful. I really enjoyed the ramen here. I got the spicy miso and I thought the broth was very creamy and could rival some of the places I have frequented back in LA. The spicy miso did not overpower the natural flavor of the broth underlying it and it really helped add a kick. The cha-siu was melt in your mouth just how I like it. Can I mention again how crazy creamy and good the broth was? It's rare. Because some places screw up and you're left with oily soup instead of creamy yummy goodness. Service was good, but considering we were 1 of 3 parties in here it better be. I thought the price was reasonable for the amount of food you're getting. Given the chance I would definitely come back."], ["Mark S.", "Seems like they don't do much for daily sushi specials any more, and now for me the sushi is mediocre.  Most people come here for cheap sushi anyway (like $1/$1.50 night), there are good options for quality sushi in Dallas if you have the cash, and there is a large menu of cooked foods to order.  So we usually come for a late night dinner hanging out chatting over cooked food and drinks.  Until their newly opened Yama Izakaya & Sushi in Plano this was the only worthy Japanese food establishment open past 11:00 PM.  The new place is much larger, also will be open until 2:00 AM (dinner only to start I think), and will likely cater to more of a quality sushi crowd if that's your preference.  Not sure that it will be up to Tei-Tei or Yutaka Sushi standards, but likely not cost as much either.yelp.com/biz/yama-izakay…."], ["Kirby B.", "Ever since the new owner took over the old Sushi Yama, business has been booming!  Now they have opened a second restaurant in Plano.  We were going to stick with the one on Forest Lane but lately we noticed the food quality has drastically declined.  The chefs and staff in the original place are new and not as good as the original team.  The food isn't good anymore except the noodles.  May be the owner needs to work there half a week to make sure they don't ruin it for him?  I ordered a spicy tuna roll one time and got some bad tuna.  When I raised my hand to signal the waiter, he instantly asked me if the tuna was bad, like he knew it might be.  He brought me a new one shortly but I wondered... why did he give me something that could possibly be bad?  Doesn't he worry that I might get food poisoning?We came back there another time with a friend and we only ordered bento box.  The sushi rolls are loose.  After my last experience I am afraid to order raw fish again.  You can never forget that taste...  So, may be we'll start going to the one in Plano but it's really far from us.Do you feel like the end of the world when your favorite restaurant is not good anymore?"], ["Troy C.", "Second time visiting real authentic Japanese restaurant in DFW area. Ordered  plate of Gyoza and Donkotzu Ramen and it's super good. Place is packed all the time and food is delicious. I live almost an hour away from this place and I'm definitely coming again"], ["Hazuki C.", "I'm japanese living in Dallas and I've been looking for authentic and reasonable japanese restaurant forever. This place is the one. It's a Izakaya style restaurant which means this place has lots of variety of appetizer kind of food. Like tapas. It's not like Americanized Japanese food so if you want to enjoy real and not pretentious Japanese food, this place is perfect. They have daily happy hour special and my recommendation is Tonkotsu Ramen, fried tofu( agedashi tofu), and rolls. They all are delicious and not expensive. They open at 6 everyday but if you want to secure your seat go there as soon as possible."], ["Louisa L.", "My friends and I come here fairly regularly. Food is cheap and delicious, but can take a bit to hit the table since they are often busy with just 2-3 servers. On one occasion it took over an hour for us to receive a sushi roll.Their desserts are delicious though and I really enjoy the tan tan ramen and salmon onigiri."], ["Seung L.", "Tuesday night here is pretty packed...I had ordered a couple of sushi, 2 rolls, and a bento box. I came here with my girlfriend and the food did come out a little bit longer than expected, but it was okay. The food tasted great.My girlfriend had ordered the bento box and it took them 40 minutes to bring them out, which was pretty ridiculous. Other people who had arrived at least 20 minutes after us and put their orders had received their kitchen food before us...Overall the food is good, but the service could be better..."], ["Aqua H.", "Very good ramen AND open late?! This seems too good to be true but isn't. Very happy with the rolls we had, sake, and ramen!"], ["Angel P.", "Came here to try their ramen since I've been hearing very good things about it and WOW... it issss goooood!!!! We got the tonkotsu ramen and the tan tan ramen. The tonkotsu ramen was rich and creamy with just enough flavor. The meat was nice and tender, the noodles were cooked perfectly but the egg wasn't halfway cooked or marinated like I've had in other places but overall this has got to be the best tonkotsu ramen I've had in Dallas so far (comparing with Tei-An, Jinbeh, and Tanoshii). The tan tan ramen had a miso broth with stir fry ground pork and baby bok choy. The broth was slighly spicy, very flavorful and it wasn't as thick as the tonkotsu. The noodles were cooked perfectlly as well and the bok choy was a good addition to it. Both bowls were less than $9 and they had a good size, will definitely fill you up. I wish this place wasn't so far from me because this is where I would want to go if I'm ever craving ramen! For all those people who've had and liked Tatsuya in Austin, this place can for sure compete with that!We didn't get to try any of their other items because we were very full from the ramen and I'll definitely be back for that."], ["Catherine Q.", "I love this place and here's why:- tasty Japanese snacks- open late- decent price- casual atmosphereI can't believe places like this existed in dallas. Always a good choice for those late night hours. Yum!"], ["Saul C.", "This place is a little hole in the wall. The ingredients are way better than zennas. The salmon is great. The sushi is pretty big as well. This is a great place to eat on a dime. The atmosphere is great and they have a bar area"], ["Tida P.", "Awesome!!! This reminds me of the restaurants I could find in Las Vegas. You can't see the restaurant from the street, so at night it was a little hard to find. Food was awesome! We had the Tuna Poke Chips, Agedashi Tofu, Shishito Peppers, Hamachi Sashimi, Yakitori Sampler, Beef Tounge, Octopus Balls, Soft Shell Crab, and more. The only item we weren't too keen on was from the Yakitori Sampler - Chicken Gizzards and Chicken Heart, both were really chewy. It was also really hard to get the gizzards off of the skewer, but other than that this place is awesome!"], ["Caitlin K.", "This review is for take out sushi because honestly, I couldn't dine in here. The restaurant is TINY with many tables crammed in and was about 85 degrees inside on a day that was only 65 degrees OUTSIDE.That being said, the take out is delicious, and I'm exceptionally picky about sushi. Everything tasted super fresh, there were no gross fishy smells, and every roll was tasty. I highly recommend the crawfish roll. It's deep fried and has sriracha on it. So good, and I am so happy I found great sushi take out just down the road from my house!"], ["H B.", "A good selections of Japanese dood with reasonable price.  Haven't tried their ramen but it's on the to-do-list now!"], ["Kei H.", "i've seen they have new people in the front all the time, but the actual problem is the kitchen. wth it always takes sooooo long to get our food on the table. oh jeez"], ["Peter H.", "Formerly SushiyamaThis place is pretty much the same as sushiyama was.  This night i ordered the philly roll with 2 uni nigiris.  The philly roll is standard.... very mundane.  The uni was very creamy with a nice saltiness that i enjoyed.  I don't really wanna go in-depth on this review since i already wrote one.... but when it was called Sushiyama and not Yama Sushi lol"], ["Aiko K.", "I was craving for sushi after a night out with friends so I was happy that this place was open until 2AM (or 3?) It's hidden in an unlikely neighborhood. There is a barber shop next door and bars/lounges few doors down.The inside of the restaurant was quite tiny. Nothing eye catching, a bit crammed. Since there weren't too many people there, I was still able to enjoy my conversation with my friends.The menu had a lot to offer. From sushi to onigiri to yakitori and ramen. I love Japanese restaurants that have a lot of varieties to chose from. Only problem was the price. It was a bit pricey for the amount that they give you. The gyutan was $8.50 and at another place I could get a really good one for $5.50.The food was pretty good but it wouldn't be on my top 5. I did enjoy the broth from my boyfriend's Yama ramen. And I loved how soft the rice for the onigiri was even tho it was falling apart. Lastly, our server was quite nice and helped me with any questions I had about the menu and made recommendations too. Overall, I wouldn't come here if it wasn't on my way. Or maybe if I have a late night sushi craving."]], "Deep Sushi": [["Jenny B.", "Atmosphere was perfect to relax to before a concert at Dada.  Sushi rolls were delicious and we ordered the Cherry Blossom and Snow White.  Great taste combinations.  Service was friendly and attentive."], ["Ryan L.", "We generally have an enjoyable time at Deep Sushi. I will list the pros and cons we have experienced over multiple visits. Pros: Some of the rolls are fantastic and very well priced! At the end of the day, personal preference plays a large roll your view of price and quality. We haven't had any horrible service but haven't had any outstanding service either. The Sake is pretty good as well.Cons: This is why i have to give them 3 stars. 1) The service has been average at best. For example, on each occasion we have visited, I've had to wait an extended period of time to obtain a refill on my drink (water and my adult beverage both being empty for over 7 minutes), the server was informed we were ready for the bill, and I waited for over 5 minutes, and tables have been sticky. While not all these occur at the same time, I do experience something in terms of my server having me wait an extended period of time for one thing or another. 2) In my opinion, some of the rolls are very over priced for the quality. I'd be just as happy with Wal-Mart sushi and spend less money. Every time we come here for a date or to pick up sushi to-go our bill is always over $50.00. I'd like to try several other rolls, but with so many disappointments, I generally stick to what is good."], ["Jason S.", "I was here while on a business trip to Dallas. What a find. the food was great and the service was excellent."], ["B D.", "Sushi was very fresh and delicious. Although it was very busy for a Friday night, our food came out in a timely manner. Our waitress Mimi was great! I would definitely return."], ["Alexis B.", "Good sushi in Deep Ellum.  They have a server with a vegan girlfriend or something so they'll make some really great vegetarian and vegan rolls if you ask!  They also have a full bar and some great cocktails!  Love going with my family and getting a sushi boat!"], ["Brandon K.", "Great sushi spot for downtown Dallas. The rolls aren't made very tight and have a tendency to come open when picking them up. The rolls aren't very original but they taste fresh. Service has been hit it miss. I often have to ask for my check to come with my app or meal to make sure I get it back in time to leave. The crazy roll is my new favorite. Spot is a little pricy for the quality but when you have to have sushi, you could do much worse!"], ["Chibuzo E.", "EXTREMELY EXPENSIVE! $6 for two pieces of sushi. Outside of the price point, the actual restaurant was quaint. Real intimate feel. Open floor plan, but enough room for you not to be on top of other patrons. Servers were friendly and helpful.Food was decent. After the confusion with the menu pricing my appetite changed a bit. So the food might have tasted better if my mind wasn't in a state of confusion."], ["Madison C.", "I just ordered food to go, so I can't really comment on the service, but the food wasn't anything special. I ordered one Pork Fried Rice and Teriyaki Salmon Bento, which was all fairly inexpensive. The fried rice was bland and there was hardly any pork in it. It was mostly string beans, corn and undercooked rice. The teriyaki salmon was great, but something I could have gotten anywhere. The California rolls included with the salmon were decent, but the orange was surprisingly bitter. Overall, not really interested in coming back."], ["Charlene L.", "As I was getting off the plane from a work, I was hungry, sluggish, and too exhausted to go home and make myself dinner.  Instead, I remembered from a Yelp talk thread that Deep Sushi was discussed and offered 2 for 1 nigiri.  With this in mind, after getting dropped off at my home, I hopped in my car and headed for this place in Deep Ellum to get my fishie fishie fix on! I ordered some fresh salmon, yellowtail, and even a tempura roll to mix it up for some variety.  Even though the nigiri was 2 for 1, the prices seemed high, especially for the quality of the fish.  The fish itself lacked the brightness of what fresh sushi should look like, and the thin slices themselves were anything but filling.  $30 later, feeling full, but had to work hard to get there, I left feeling unaccomplished, as I feel like they took advantage of me rather than me feeding off the idea of the 2 for 1 special. I don't plan on coming back here, unless they lowered the price, AND kept the 2 for 1 special.. service on the other hand was awesome and attentive!  If only the food lived up to their service ... *le sigh*"], ["Josh H.", "Let me start with the atmosphere, wow. They are under construction. Patio looks like hell but you can still get seated there.  No fans on patio. In Texas,  in summer. So its like a sauna with no air flow.  You only get a slight breeze if a car drives by.....Get it together people.  Buy a fan for your patio.  How can you expect people to enjoy themselves and eat dinner when they are pouring with sweat."], ["Derek G.", "2 for 1 sushi; does not mean sushi rolls!!!! FYII looked around online to see if there were any weekly sushi specials, usually not hard to find. I came across their 2 for 1 sushi special/happy hour and wanted to give it a try. Let me remind you, even at the restaurant it just says \"2 for 1 sushi\"... We ordered 4 rolls, and were charged for all of them. At the end the waitress, almost sarcastically says \"oh, thats sushi nigiri.\" Just to make sure my anger is justified, i've asked people with non leading questions \"describe what 2 for 1 sushi means\" just trying to hear what they would picture being presented to them if in this situation... 100% of them described sushi rolls... not nigiri.. OH! and it tasted stale, if that makes sense.."], ["Rayna C.", "I have eaten here twice. Both times I was blown away by the choices and freshness of the food. It's a fun little hole in the wall in Deep Ellum. It's crowded when it comes to table so don't expect privacy.But do expect some amazing food. The Ahi Tower is my favorite and a very good portion size."], ["Sharde A.", "First and foremost, this place is walking distance from all things I love in Deep Ellum: Trees, The Doors, Glazed Donut Works...etc.  Before a concert this is one of the places I like to eat at beforehand.  It's sushi so definitely pricier than regular joints around the area.I'm not going to say this is the best I ever had of course.  I had the sashimi dinner which was better than the usual blue roofed franchise, but I took one look at the color of the tuna and knew it was not primo raw meat.  The other decorative rolls were good, not much more I can ask there except to be rolled tightly which they were!  The crab stick nigiri was not your grocery store imitation crab, it was real crab legs which was a plus!  Sadly, no tamago/egg omelette nigiri.  I guess it's not that popular.The wasabi and ginger was the same as any regular mid priced sushi joint.  Drinks however, woah.  I love simple, no frills vodka drinks, and the citrus smash was bomb!  It came in a tall thin glass, clear liquid which could be mistaken for water.  Once you took that first sip though it was party time, oh yes this was for me!I'd say if you're looking for that sushi place to suppress your sushi snobbery this is not the place to go to.  If you love sushi of all sorts and are attending an event around the area afterwards, give this place a shot and take one while you're there!"], ["whitney m.", "Beware, it's pricey! That being said its delicious, the black sea roll keeps me coming back! And the service is always spot on!"], ["Iris S.", "Service took forever as the hosts TRIPLE sat a waitress and I was lucky enough to be table #1 out of the 3 but was treated as table #3. It was a terrible service experience and gave the waitress a dollar less tip for every 5 minutes it took her to wait on us. I ended up tipping $2 on a $60 bill.Also; the restaurant is more into seating people that placing tables and all of my food / drinks had to be passed to me by another table since there was no way for the waitress or food runners to reach my corner outside table. Finally, it's a sushi restaurant with soy sauce and they decided upon grate tables outside! Do not sit outside unless you ask for extra napkins to stop the dripping of soy sauce from the bowl to your mouth or if you're wearing white pants.The food? It was not bad at all but the service and setup of the restaurant is causing me to find a new sushi restaurant to call home."], ["Andrea C.", "Always fresh, always flavorful and great specials almost daily. Try the Cajun roll and Tempura roll."], ["Kenji M.", "One of my favorite sushi place in Dallas. Sashimis are well prepared, not to mention the friendly servers and rad neighborhood."], ["Jennifer P.", "This place was awesome. Service fabulous and fast. Had 3 orders of dumplings, spicy edamame, 5 rolls. All so delicious and different than the next. Probably the best sushi I've had."], ["Hannah S.", "As others have said, Deep Sushi is not first class super elite sushi. That being said, they have good solid rolls and good appetizers, and a four day a week happy hour (Monday - Thursday, 5-7), making it a good go-to place here in Deep Ellum. On my server's recommendation I got the Cherry Blossom roll. It was rich and tasty with a fairly big portion for the price. I can't handle most spicy foods but it had a good level of heat to it. I always get gyoza at new places because I find it easy to compare and contrast. Theirs came out steaming and fresh, soft instead of the crunch that many here have. Overall, a good value in a good location. Check out the happy hour and enjoy some filling sushi!"], ["Amy S.", "I'd give this place a solid 3.5 stars if it would let me. It wasn't as good as Nobu, but then again our bill was about half as much. It is always super crowded so keep that in mind and maybe make a reservation. It's also very dark inside and loud but it's fun if you aren't trying to have a serious deep conversation. Avoid the spicy tuna roll. It isn't a solid piece of tuna inside and reminded me of the spicy tuna roll at central market. The teriyaki chicken was not good either so I'd skip that too. We sat at the bar and the service was not great...id wait for a table. I can't remember the name of the roll we loved but get it if you can find it...it had cream cheese in it and was fried. What's not to love about that?!"]], "Ai Sushi Sake Grill": [], "Ku Sushi & Japanese Cuisine": [["Megan S.", "Absolute favorite sushi restaurant in town.  While modest looking from the outside,  tucked in at the end of a typical strip mall in the busy Preston-Forest shopping center -- the restaurant is perfectly nice on the inside.  The 5 stars are for the delicious selection of riceless rolls -- sure, many sushi spots offer one or two token rolls sans rice ... but Ku always has a handful on their standard menu plus (often) a specialty roll, such as the Love Love, Cherry, and Kristy Rolls.  Delish!"], ["Stephanie D.", "I like Ku because it's convenient for me and they have decent sushi. My two complaints for the place is that their crab mixture for their rolls is a bit too mayo-y and the chicken fried rice leaves much to be desired. It's very greasy and doesn't have much flavor. As for the establishment itself, it's dark, clean, and sophisticated. The waitstaff is very attentive and nice, and the takeout service is always great. I also find it reasonably priced sushi given the location and experience."], ["Brad S.", "This place is really cool.First, the fish is really fresh, and tasty.  Good sushi and sashimi, Salmon was AWESOME!Seaweed salad is one of the best I have had.The rolls weren't all hits but that is because they use that mayo stuff on it... I'm not a fan, but it was OK.I loved the atmosphere, it is a really stylish place.  The wait staff is AMAZING!  My glass never hit half empty before it was filled back up.  They maintained a consistent service level from empty (when I went in), to almost having every table taken (including the outside seating) when I left.The \"hot\" sake should have been called \"luke warm\" sake, order it \"extra hot\" and it will be what I could call hot.I like that the TV was not a centerpiece.  It was there, but it didn't attract attention to itself, and the volume was off.  Which made dinning here a pleasant experience, instead of a pseudo sports bar.The bathroom was clean, but someone had just dropped a deuce before I went in ... I don't know how long the smell lingered, but I am amazed that the paint held up, and I didn't pass out - I could smell it even though I was holding my breath.  I'm not sure I can fault the place for it, but wow!"], ["Jack L.", "Tasty.  Fresh.  Tempura supreme with shrimp was nice with a couple of rolls."], ["Colin B.", "Normally, strip mall sushi scares me. But given that this place was at the intersection of Preston & Forest, you figure it has to be pretty gringo safe. So, we went for lunch.For an appetizer we had the appetizer plate ($14.95) and it was okay. The fried calamari was more like cheese stick breading over a chewy piece of calamari. Not great. However, the beef goyza was amazing. They brought out a full plate of it for us on accident and we dug it, something like $6.95 for 8 of 'em. Tender, flavorful steamed dumplings. Awesome.Being unadventurous, we went for the Cherry Blossom and Snow White rolls, both pictured. I think they were around $10.95 and both packed with crazy flavors (and riceless).Service was adequate, the atmosphere was great, and the food was on point for what I want out of sushi. I'd go back."], ["Devon G.", "Great atmosphere! Nice place to take your special someone to. I love there California rolls! (Not a big fish eater so it's nice to have at least one kind of sushi to eat). Try there creamy shrimp rolls! Amazing!"], ["Ya Lun W.", "fresh sushi rolls and many creations (reminds me of Blue Fish) .... they also have daily special menu with more exotic stuff serving in sashimi / sushi style =) a lot of servers they seems to be all Koreans sometimes can be a bit unorganize when busy and a tiny bit slow on service/refilling water and I had to ask for a ice bucket for my cold sake (that usually was automatic when ordering a big cold bottle of sake and they're supposed to pour the 1st class which didn't happen) but over all the sushi chef (Thomas) made our night he was friendly and fast and the sashimi/sushi/rolls we ordered kept coming one after another just as we finish, and he made great recommendations on the live surf clam sushi it was yum! first time we've ever tried.....be aware if you're afraid of fishy-ness then you prob. will still like the cooked version ... but it was fresh and different taste/texture from the regular surf clam served on sushi.a great night just a bit pricey and servers/hostess seems a bit unorganized but food is good and the small issues should be easily fixed and up the stars in my book."], ["Ariza S.", "Yelp, you've done it again and showed me another fabulous place to spend my hard earned money. After reading most of the reviews of Ku I decided I just had to go for dinner that same night. The place is a little small but was not packed for a Thursday evening. A sweet hostess lead us to a table where wet napkins and chopsticks were laid out for us and yes a small plate of celery and carrot sticks were brought out right after. Bizarre. We started out with an order of the stuffed jalapenos ($5.50) which were \"oh my god I want to slap someone\" type of good. Ku takes two fresh jalapenos, hallows them out and stuffs them with crab, cream cheese and other amazing things and fries the little suckers. I think I'm going to order about 5 of these and just make it my meal next time. Next we ordered the spider roll ($8.50), Caribbean roll ($14.95), volcano roll ($14.95), spicy tuna roll ($7.25) and the panic roll ($12.95). My favorite was the Caribbean roll and I love the sauce that Ku pours over this roll, I could just lick the whole dang plate. All the others except the panic roll were just as delicious and fresh. The staff and owner constantly checked in on us and refilled our waters before they were even half empty. A dinner for two costs us about $75 which is a little bit pricey for me but considering the great service, nice atmosphere and fresh food I would say Ku is a winner."], ["Carlos S.", "The inside is a little dark but nice. I ordered what I usually order when I go to Sushi restaurants so that's how I gauge them. I ordered the fresh salmon sushi and got smoked. It was ok a little \"fishy\" also ordered the spider roll. It was over cooked.  They have a variety of rolls and signature dished. I will give this place another try but for not C-."], ["Shae W.", "Went here for lunch today with a couple of my girlfriends because they had a Now deal on Groupon and this is what I found:Seaweed salad was average, edamame was slightly overcooked and over-salted, squid salad was good. I tried the Geisha roll and was pleased with it. Service was about average. I had a problem with my Groupon, but the waiter demonstrated good customer service by accommodating my coupon without the code. He hovered around our table, which is both good and bad, and forgot the salmon sushi I ordered. He offered to correct his mistake by bringing it to me then, but our table was already finished. All in all, the experience was okay. I doubt I will ever go back-- I'm a huge fan of sushi, but I'd rather head down a few doors and hit up Mi Cocina."], ["Anne S.", "Wellllll...it's good.  However, it's borderline overpriced.  I'm sure you're paying for all the swanky decorations.  I'd rather have low-budget decor and cheaper (and even more delicious) sushi.  (That would be Mr. Sushi in Addison; if you haven't been, go tonight.)The veggies + ranch before the meal?  Very weird.  Did not touch it.  Tried to order edamame instead, but despite being one of only three tables seated in the entire place, they somehow forgot my order.The sushi?  Definitely a great selection of rolls; possibly even a bit too much.  There are several that only differ ever so slightly from each other...making it even more confusing.  It'd be a more manageable menu with fewer selections.  I mean, the sushi chefs can always tweak things, right?  Ku Sushi needs to pick some rolls that are their absolute standouts and offer those ONLY.  This could be about 10-15 rolls, but 25-40 (I lost count) is a bit much.The quality of the fish seemed pretty good.  Execution was a bit sloppy on a couple rolls (one of them fell apart on the plate before we could eat it), but generally decent.  Charging something like $4 for real wasabi is ridiculous, though.Overall, a decent meal, but for the price, you can get the same (no, better) quality of sushi for much less at Mr. Sushi.  I guess if you were trying to impress a sushi-unsavy date, take them here.  For people who want to pay for good sushi rather than just a nice atmosphere, go to Mr. Sushi.  Bottom line, I'll still be going to Mr. Sushi every time.  This girl don't need no fancy swag...just good fish."], ["Colleen Z.", "Visited Ku for lunch today.  The restaurant caught my eye because I am a graduate of the University of Kansas aka KU so I had to yelp and see if Ku was worthy of my lunchtime dollars; indeed it was.The atmosphere was nice especially for a hectic work day.  Low lighting and Nora Jones playing above, I sat at the sush bar.I ordered miso soup, even on a 100 degree day, and the Samurai roll which was a shrimp tempora, cucumber, avocado and tuna roll with four different sauces.  The soup was light and not too salty.  It was also not a commercial soup which many places serve.  The roll was small in width, a welcome change from many sushi places that skimp on the goodies and pack on the rice.   The sauces were perfectly applied so no need for wasabi or ginger.   Roll had about eight quarter size pieces so be prepared to order more than one roll if you are hungry.  I will be back to this restaurant.  As I was leaving I saw bottles of Kirin Ichiban so next time I will have a beer with my meal; well, dinner......"], ["Holly C.", "I've been to A LOT of sushi places around town over the years. I love sushi, but usually only crave it about once every 4-6 weeks. I tried KU after purchasing a Groupon, and both me and my husband were more than blown away. We ordered two of the special rolls - Kristi and Sexxy, and could not eat them fast enough. I think one reason is the freshness is amazing, and also most of their special rolls are rice less. I'm so used to getting rolls with rice that I dip into the soy/wasabi mix, but at KU I don't use any soy sauce on anything - EVER. They don't need it - most of the rolls come with a light sauce that's just perfect. My husband craves sushi even less often than I do, but both of us were ready to go back THE NEXT DAY. That says a lot to me! In the 4 weeks since I first visited KU, I have been back 4 times, and am going again this weekend. Try all of the special rice less rolls - you'll be so glad you did!!!"], ["Angie H.", "Some friends and I went here on a Groupon Now because of the nearness to where we were shopping and the fact that we all love sushi. It was empty so we were seated immediately. The waiter was on top of us the whole time, but not overtly friendly, just kind of there. The chefs were talking loudly in their own language... I'm sure about the three girls that were too busy chatting to order, but heck.So service was ok. Restaurant itself was clean, small, and appeared to be furnished with relatively new items. The selection of sushi was quite large and I had a delicious squid salad! My roll was good, but no better or worse than most average sushi restaurants. The pricing was average to high... I've seen comparable things on other menus at restaurants I much prefer for a few dollars less. All in all, I am unlikely to go back, but the restaurant was certainly an okay place to grab some sushi."], ["Blake R.", "This place is the most unknown awesome sushi place in Dallas.  That might be a bit of an exaggeration, but in a sushi restaurant-rich Dallas, it's in an odd place at Preston and Forest.  We've all seen small, neighborhood sushi restaurants around Dallas that are average quality, and the passerby might think the same about Ku, but Ku is great!  It's very popular among the residents of the neighborhoods over here, but a lot of people outside of the area don't know about it.  But you should...It's a small restaurant with nice, modern decor.  The staff is very attentive and I don't think your water glass ever gets below a quarter glass.  They love their foodies there, too.  I've been going regularly here for almost a year now and they're always offering me new and different things to try.  They often have a lot of hard to find wild fishes that are almost impossible to find at most of the more popular Dallas sushi places.  The live scallop is wonderful when they have it!  Make sure to ask for some fresh wasabi to add to your soy sauce.As far as rolls are concerned, they have it all.  Their 'special rolls' are all very creative and taste great.  I especially like the rose and love love rolls.  They're both riceless and very good.  Panic roll and the yellowtail heaven (yellowtail sashimi with ponzu, jalapenos, and a dab of Siracha) will both satisfy the spice lover.  Also try the new 'sexie' roll.  It's wrapped with iceberg lettuce and pretty tasty.I tend to order a lot of nigiri sushi and the fresh fish nigiri sushi combination is great for people that like to try new and different fishes.  Of course you still have your standard tunas, salmons, etc.  The quality of all fish is always good and fresh.  I prefer to sit at the sushi bar here because they will cook you virtually anything Japanese if you ask.  Not on the menu, but they do a good baby octopus tempura.  This is one of my favorite dishes at Yutaka and Ku does it for half the price.Menu stuff from the kitchen is generally good.  They have a really good hamachi kama.  Skip the udon.  The broth doesn't have any flavor.  A friend that refuses to eat sushi has had the steak there.  He thought it was good.  Served with vegetables.  There's also a selection of tempura and other traditional Japanese cooked foods for those non-sushi eaters.They do serve beer, wine, and sake.  Selection of beer is pretty limited, but they have all the important Japanese beers.  Selection of wine is pretty limited, too, but wine is far from my department.You need to put Ku on your list of places to try if you haven't eaten there yet.  I promise you won't be disappointed!"], ["Kristi W.", "Excellent sushi! We had nigiri, sashimi and several rolls. The fish was very fresh and the had a great selection of interesting rolls. We would highly recommend."], ["Lindsey R.", "Great prices for the quality of fresh sashimi. Don't be fooled by the looks of the Ahi Tower - it's fantastic! Large hot Sake bottles for $8 - you really can't go wrong! Service was a bit rushed, but then again it was Friday night.  Will definitely hit this spot again!"], ["Melissa A.", "My husband and I visited Ku last night for the first time after finding it on Yelp. The food, atmosphere, and service are amazing. Try the \"Sexie Roll\". No rice, wrapped in lettuce, it is to die for and not incredibly filling.  The ambiance inside Ku is cozy and modern. We will definitely be back."], ["Stacey G.", "Great service! And they have the option for brown rice with the rolls which is MUCH HEALTHIER and yummy :) the atmosphere is also nice and relaxing :)"], ["Ryan M.", "I'm not very familiar with Dallas (just some occasional travel) but this location seems like an odd place for a sushi bar. Tucked at the end of a strip mall, it was a bit hard to find based on Google Maps navigation.But once I found it, I was so glad I did! Some of the best sushi and rolls I've had in some time. Their strongest offering is the range of rice-less rolls they offer. Just how I like sushi... lots of it and without the bloat-me-later rice fillers. The rolls do tend to be a bit smaller, but the lack of rice really helps the flavor combinations pop!I'm planning another trip to Dallas soon, and this place is top of my list!"]], "Tei Tei Robata": [], "Oishii": [["James V.", "This place is a solid sushi place when it comes to the plethora of sushi restaurants in Dallas. I have had several of their rolls and they all come out fresh and really tasty.It does get packed around lunch, so I suggest getting there earlier than the typical noon time. The parking is abysmal. Please listen to me and CARPOOL if you are going with co-workers. You will not regret it.The service, even though they are constantly running around at full speed, are pretty good about making sure the food is good, your drinks are refilled and are overall quite nice.I am a big fan of their yellow fin tuna and their rainbow roll."], ["Claudia R.", "The service is hit or miss. I went and had the bartender/waiter spill food all over me and never got an apology, let alone something to clean myself off with. When I reported this to the manager he apologized but offered NOTHING for my trouble. We haven't been back since. We used to go once a week. Now it's on a day when we are desperate and not get the idiot waiter as a server. I also need to mention how he never took my order and I was the first to arrive at the sushi bar during a busy lunch hour. Again NO ACCOUNTABILITY from the lame manager for his staff."], ["Alexander C.", "I've written a review on here before, and still think very highly of Oishii. However, I visited last night during dinner hours when the restaurant was packed. This was new to me, as I usually eat here during off hours. I was seated at 7:00pm sharp, and considering the tables were rapidly filling up, submitted my order as soon as I sat down so I wouldn't end up behind many of the tables and get stuck waiting for my food. I'm not sure this mattered. It appeared as if everyone who was already there had been there for a long time. I saw many faces with waning patience. More than once when food showed up at a table, I overheard a, \"Thank God,\" or another exasperated gasp. As it relates to my order, the edamame appetizer took nearly 45 minutes to arrive. It was another twenty minutes before my first two sushi rolls arrived. Then another. Then another. For four rolls and a bowl of edamame, I sat in a very cold restaurant for nearly two hours.It's a good thing that the sushi is amazing, but even still, I don't know that it's worth the wait. I can say that I will definitely be back......for take out."], ["Mandy L.", "Came here for lunch on Friday. I was actually surprised by how busy it was! I would definitely suggest coming before noon if you don't want to wait. The interior was nicer than I would have originally thought.The crab rangoons were delicious and my coworker and I each got the sushi lunch, which is a california roll and one piece of 4 different types of sushi. It was a little steep for $14, but the quality was good.Service was awesome and we never had to wait on refills or additional ginger."], ["Sarah W.", "I love Oishii. I know that sounds weird, seeing as this is a 2-star review, but I really do like them. Their sushi is awesome, their Chinese food is great, and their Vietnamese soups aren't half bad, either. Their crab rangoons are seriously my favorite ever. My boyfriend and I eat at Oishii pretty often, considering I live right down the street. And the food (and sushi) is consistently really good. Why the low rating, then? Because the service has gotten consistently worse over the last six months to the point where I actually hate going to the restaurant! In the last two months or so I haven't been able to get seated in less than 45 minutes, the bar gets crowded and there's a ton of wasted space (so it's awkward to wait the 45 minutes for your table), it takes FOREVER to get food, the food you get comes out in waves, and service is slow (although the staff is for the most part very nice and responsive).While the service is hit-or-miss, the host is consistently terrible! It's gotten to the point that he won't pick up the phone ever and will refuse to submit to-go orders, whether over the phone or in person. On a Thursday night at 8:30 PM they refused to take my order as to-go, insisting that if I was going to order food I needed to wait until a table came open, sit down, and then order! I've never heard of such a thing!!!! I am ordering to-go because I don't want to stay. Just take my order and say it will be 30-45 minutes for food, but don't insist I crowd up your weirdly set-up bar and wait for a table before I can place my order and give you my money.Overall, I think they just under-staff the restaurant and don't have enough cooks (or speedy enough cooks!) in the kitchen. They're a little pricey, but not bad, and the food is great, but don't go when you're famished, because you'll be waiting for FOREVER, and set your service expectations low when you come in."], ["Lindsay F.", "this is the best sushi I have ever eaten. Staff was so friendly and the restaurant was packed on a Saturday night. They have an array of unique rolls and everything about our meal was divine."], ["Justin T.", "Terrible service :(Hate to rag on any place. Everyone deserves benefit of the doubt, especially on a busy Friday night. But hostess hasn't a clue what she's doing, and GM very  apathetic about it. Hear the food is deserving of rave reviews, but never had the privilege to taste. Had called in a reservation and assured no wait should be expected. Waited 45 min for a six top. Walk-in groups with 6+ sat within 20 mins but not us. Not sure why. Brought this to hostess and GM's attn more than once (and in the least confrontational way possible...worked in service industry prior and know what terrors people can be) but eschewed aside. Finally told by hostess that nearly ready, but must crowd at a table for four with two chairs pulled up at the sides. A bit insulted by this gesture we decided to leave. Will try again to dine here (with no more than two persons in tow) and report back."], ["Amy I.", "Love this place!!!  Good vibe, great sushi!!  Highly recommend. Everything I've had here is delicious."], ["Tara B.", "This is the most consistent sushi restaurant in Dallas! So fresh and innovative!! Cheers to Thanh and his team!! And Tom always makes you feel welcome!!"], ["mintymoo o.", "The sushi here was delicious!!!! I absolutely loved the Golden Roll.... It's a California roll wrapped in fresh salmon...... It literally melted in my mouth. It was sooooooooo damn good. I also indulged In the summer roll..... Although it's not filling (because it has zero rice and instead wrapped in cucumber) it was still amazing!! ...it had fresh salmon and crab inside. Now I didn't care too much for the G roll..... It was \"awe-ight\" and just a bit bland. I need a pop of flavors happening In this mouth! I also tried the TriBeCa... It's fresh salmon with avocado sandwiched in two pieces of a crispy rice chip..... It was very filling and was very good but I think the chip kinda' overwhelmed the filling, but I still enjoyed it and would order it again. But hands down..... I'm in love with the golden roll. Yum! Two thumbs up to this place."], ["ClaireMia B.", "Not the best sushi in Dallas, but great customer service! I'd recommend the Oishi roll."], ["Staci S.", "I'm a chicken pad Thai connoisseur and this place has the most delectable pad Thai I've ever had the pleasure of tasting. Oishii means delicious in Japanese and this place is oishii. Added bonus: high probability of running into a Mavs or Cowboys player here."], ["Laura C.", "They probably don't need another review for this wonderful restaurant;  but we hadn't been back in years. The decor is lovely and the sushi bar large. Lunch service was excellent. My old favorite, the Vietnamese fried egg roll was better than ever. Stuffed with finely ground pork and shrimp with onion and herbs encased in a wafer thin egg wrapper; it was perfect. You get a chicken and vegetables one with your entree; but the appetizer pork and shrimp is heavenly. Impeccable food."], ["Lindsey S.", "I'm taking to the internet to make sure everyone knows about the 5 star experience I had at Oishii tonight. To start off, the food and the service was excellent. I highly recommend the Uptown Roll- it was fantastic! We also had two servings each of the mochi ice cream. Omg, the red bean was the best flavor.... SO good. But the real review actually starts AFTER we paid and started to leave.... Earlier that night, we had used the complimentary valet, and I, being dumb, didn't even check to see if I had cash in my pocket to tip the valet (duh....) Well, it turns out, I didn't. So, as we started to leave, I walked up to the valet to ask if I could write him a check because I didn't have cash. Obviously, he said yes because valets work on tips and he wasn't about to leave without getting his tip... (Not that I blame him because it was POURING down rain at this moment). Anyway, I went back inside the restaurant to write my check, and at this point I was struggling to find a pen in my purse. I asked the manager if he had a pen I could borrow so I could write a check to the valet for a tip. Well, one of the waiters walked by and overheard our conversation. He then proceeded to pull $5 from his own pocket (I know how hard waiters work for their money), and handed it to me. I was shocked (in a good way). I think I kept mumbling \"I can't accept this, I REALLY can't accept this.\" Lol. But he said that this would save me the trouble of writing a check for a $5 tip, and to pay it forward. So, I'm paying it forward by letting the internet world know of my fantastic experience at Oishii with a kind waiter who helped out a girl with no tip money for the valet.Also, the food was amazing. The service was great. GO THERE. You won't regret it. :)"], ["Sarah S.", "Love this place! Mainly because I love the tribeca roll ( fresh salmon and avocado stacked between two crisp shrimp crackers with a hint of truffle oil). It's maybe more of a small sandwich-like meal than sushi but it's soo delicious! I have ventured out to try the payesteh roll (secret menu), rainbow roll and the alaskan roll, which are all fresh and well made, but the tribeca roll is where it's at!  Also, they have now added complimentary valet parking, which makes parking in this small lot less irritating."], ["Chelsea R.", "Talk about some sushi lovin'! This place is serving it up fresh with some inventive, tasty rolls. Great bar/lounge area...order a whole bunch of items to share over vino. Love anything with fresh salmon involved. Lots of fun spots in the area too...have dinner and then hit up the town afterwards!"], ["Jennifer M.", "Meh. It wasn't my favorite. Don't get me wrong, it wasn't bad. It just wasn't amazing. Then again, I'm from the west coast so my opinion on seafood might be a little bias. Would I come here again? Probably not. But it wasn't the worst culinary experience I've ever had."], ["Hannah H.", "Phenomenal sushi, one of the best sushi restaurants in town! I recommend the #42 roll and the Royce roll. Orange chicken is delicious too! The service is OK... Always pretty average. But I still come here all the time because of the food."], ["Lily F.", "The service was great and the wait wasn't bad at all for a Friday night (around 7:30).  The food for me, however, was just okay.  My dinner partners are more into the special rolls (G Roll, Shrimp Tempura, bunch-of-fried-stuff-and-cream-sauce-stuffed-in-rice kind of sushi) and everything we tried was good. I generally like cleaner/pure sushi but we we ate was really good and addicting.  I wasn't really expecting the menu to be so diverse and for me that was a bit of a turn off.  This seems more like a social place to meet up with people at work and eat decent food but not really for hardcore sushi lovers."], ["Kev L.", "Oishii is a great place to go to get both either sushi and/or Vietnamese Asian fusion selection. Everything we ordered was delicious!  They have friendly staff and the restaurant has a great ambience!  Sushi is by far one of our favorites when we dine there.  Try it out, you will be surprised how good they are!!!"], ["Nadja S.", "I always have a good time and good food there. Service is fast and friendly even when it's busy. I usually have sushi rolls or the sashimi plate."], ["Jeff L.", "When I first visited, the name \"Oishii\" had already been tainted by a janky little sushi spot in Austin. With absurdly cheap rolls, the place didn't have the best food, but it was a college staple for people who needed sushi-like food. So it was a pleasant when I found that the sushi restaurant near me was a classier place with a fully stocked bar. That said, their sushi rolls are \"exotic\" in a way to attract people to how interesting they are rather than being high quality sushi.On the way in, Oishii definitely had a more upscale feel. Nothing too fancy, but it doesn't hurt to dress up a bit (something I hadn't been used to in a while when getting sushi). There's a bar to the left and a dining area to the right, separated by the sushi chefs who get to display their craft for everyone.The level of service seems to vary quite a bit. From the two times I've been, I've had a great waiter who we had a great conversation with and even offered him a drink (which he declined), and also a waiter who can seemingly never be found. Definitely seems to be a bit of a wild card.I can't attest to the non-sushi food as much, but the sushi itself was decent. The staples are always a safe bed (salmon/tuna based rolls with little else), but their specialty rolls were very hit or miss. There was one roll in particular, I believe it was the cowboy roll that sported blue cheese: something that should NEVER be found in sushi (the taste is just so overwhelming and overpowering). Not sure who came up with that idea, but I was definitely not a fan.Oishii isn't a bad sushi place, and it'll definitely suit your needs. They have decent portion sizes for the price, but some of their specialty items can be hit or miss and the service level can wary. But flip a coin, and maybe you'll get lucky."], ["Amanda H.", "Came here before the fire and loved it. Came back soon after they remodeled after the fire and equally enjoyed it. Came tonight and do not think I will ever be back. Out of 4 rolls only one was actually great. Beef tasted freezer burnt. And to make the matters worse the waiter was absolutely horrible. He was a complete snob. Pretty sad because I loved this place."], ["Alexa R.", "This restaurant is absolutely delicious. I may even go as far to say it's the best sushi I have ever had. After hearing everyone rant and rave a friend of mine took me to try it and I was not disappointed. I have now tried a handful of rolls from here and they have all been wonderful. I highly recommend trying this place. Wednesday's they have half priced bottles of wine as well! Definitely a very yummy sushi spot!"], ["Lauren F.", "I am HORRIFIED by our experience with Oishii tonight. First and foremost, they FORGOT our spicy tuna rolls. When we opened our takeout at home, we saw 2 MISO SOUPS and 2 SALADS but NO SUSHI. We called to complain and they refused to refund us and insisted that they had told us that they were \"not delivering sushi\" anymore that night (that conversation NEVER happened). Excuse me, WHAT????? After 30 MINUTES OF ARGUING ON THE PHONE AND BLATANT RUDENESS FROM THE MANAGER, we returned to get our rolls. We ordered spicy crunchy tuna rolls with nothing added, and opened the rolls and discovered they had added avocado when we told them not too. WRONG ORDER FOR A SECOND TIME. We were so fed up and defeated. They refused to acknowledge their mistakes or refund us for our HASSLE AND INCONVENIENCE. Horrible to think they would treat any customer like that, nonetheless two extremely loyal young women."], ["Ali A.", "Oishii was a fantastic sushi experience- safe to say the best sushi place in Dallas for me. Everything was superb- the food, the atmosphere, the drinks, the prices (relatively speaking), and the service.I was lucky enough to go with a friend who comes here every week so he knew what to order and made sure the sake kept flowing! This man even has a sushi roll named specifically after him! He had come here so many times that he one day asked the chef to combine all of his favorites into one roll- I tried this special roll that was only exclusive to him and it was the best thing I had here. Exclusive until now....The secret is now out- it is called the PAYESTEH ROLL. Crawfish in the middle, eel and avocado on top, garnished with eel sauce, spicy mayo, and seven chili powder. Get it and then tell me what you think- let's get this roll on the map!I met the owner too- he was an extremely kind and personable dude. His passion and charisma are reflected in how great his restaurant is. Oishii is a pretty long drive from where I am, but a drive I'm willing to make after the amazing experience I had here. Great work guys. Keep it up."], ["Rosy H.", "Parking here can be ridiculous. My roommate and I were having a hard time finding a parking spot, and when we asked for a to-go order, it took at least 40 minutes to get our two orders of sushi. Together.The rolls were delicious, albeit a little expensive to me ($14 for a specialty roll). Still, it ended up being quite a bit of food for me."], ["Chris W.", "The place and the greeting staff has gotten a bit proud of themselves since the remodel. Not very friendly and kept several tables and sushi bar seats (for a total of about 30-40 seats) open and empty while having people wait an hour for a table.  If folks don't show for a reservation, then give away the table.  Not rocket science. Also, the host could not give me ANY idea of how fast or slow the kitchen was running.  We left after such poor front of the house treatment."], ["david p.", "My first review on yelp, but I'm an experienced foodie to the Dallas scene.  Going out to eat is about more than just the food.  Oishii is the epitome of a true dining experience with fresh, savory sushi, a lively environment, an attentive wait staff, and most importantly, a passionate group of sushi chefs lead by their charismatic owner, Thanh.  I go there frequently and recommend sitting at the sushi bar and getting to know the other patrons where it is common practice to share sushi and/or sake and fist bump Thanh.If you go, you have to try the Payesteh Roll, an inventive roll with crawfish in the middle topped with fresh eel, avocado, and spicy mayo and eel sauce.  THE BEST ROLL IVE EVER HAD!You should also try the summer roll - so fresh and so light as it is crab meat wrapped with cucumber.  The tuna watermelon salad and the spicy salmon salad are also must haves.One of the hidden gems of oishii is that the Chinese food is ridiculously good.  I always get an order of beef and broccoli and an order of beef flat noodles, but be careful!  Once you have these two items, you will crave them about once a week!  Thanh also makes the best damn fried rice you will have in Dallas.No meal at Oishii is complete without a bottle of sake and I always get a bottle of Black and Gold, a smooth sake best served lightly chilled.  Oishii is so good I'm writing a review on Christmas!  That's how much love I have for this place!"], ["Michael H.", "Great place. The Golden Roll was delicious and very fresh. The sashimi salad was excellent. The house dressing is very interesting and highlights the greens nicely while not overpowering the delicate sashimi. Very busy place for a Monday so come early."], ["Valorie R.", "This is by far now my favorite place to go eat sushi. The food here is amazing. The atmosphere is fun and inviting. You have to try the Salmon Tacos! They are to die for. The GM Tom was so helpful in guiding us through the menu and picking out some amazing dishes. I definitely will be back!!!"], ["Craig C.", "My daughters really enjoy the edamame, fresh spring rolls & an assortment of California type rolls & I enjoy the negri sushi. Ingredients are always fresh, tasty & visually pleasing. Oh, & my youngest  daughter like the off the menu sizzling chicken. We've been coming here enough it's like our family dinner place once or twice a month. The only problem is getting a table at peak dining hours."], ["Devin Q.", "Stopped by here Sunday night for a final vacation meal with my family.  It was my mom's birthday, and she loves sushi; but living in Missouri leaves her with few fresh options.  I had been here once before and had really enjoyed it, so I decided this would be a nice spot for a quiet birthday dinner.  My dad is not a big sushi fan, but they have plenty of non-sushi options and even some god Vietnamese dishes.  We all started with miso soup, their portions are much larger than most other sushi places.My mom and i split the spicy tuna roll, volcano roll, spider roll, and the shrimp tempura roll.  I think we left one piece on the plate.  My dad had the pork chop in black bean sauce.  It was very flavorful, and another huge portion.  He only ate about half, and our waiter boxed it up with some fresh rice to take home (I ate it for lunch the next day and it was still tasty).I really like the casual service, the calm atmosphere, and the clean decor.  I also like that it is spacious enough you don't get those kitchen smells that are prevalent in many other sushi restaurants.  Wasn't my first visit and wont be my last!"], ["Froy G.", "After waiting 2 hours,  our food finally came out.  The manager seemed bothered when this delay was brought to his attention and offered nothing to improve our experience.  The #42 roll is damn good though."], ["Annie N.", "-I've heard it's been packed since the re-open.. And this is very true. Food still wonderful. Service.. still wonderful. (here's the 'but)' our lunch entress too a while to come out. Not sure what was the hold up, but everything was still tasty.  Of course I'll be back.  They are one of the better pan-Asian spots in the area. Finally they are back in business!!"], ["C. C.", "WOW!I can honestly say I experienced flavors here tonight that I have never experienced before.  Perhaps the best sushi dinner I have ever had.G Roll: Epic!  Favorite roll EVER!Oishii Roll: Perfection has been attained.Royse Roll: Cold, then warm.  Soft, then crunchy.  Tart, then calm.  All that in each bite.  A tad bit lemony for me; but still awesome.Red Snapper Sushi: Hell yea!Uni Sushi: Fresh and salty, just like it should be.The staff was very professional and well trained.  They all seemed to not only take pride in their work, but enjoy engaging their patrons as well. Well done, Oishii.  Job well done."], ["Kim A.", "If you don't want imitation crab in your sushi, don't go here. I didn't and told the waiter this, which he didn't seem to understand because he brought me a roll with imitation crab in it, and I had to send it back. Whole Foods has a better spicy tuna roll, and that is so basic it's hard to mess up. They ended up not charging me for my sushi because I kept having to send it back, whatever they brought tasted so bad.We were a large party and service was horrible. One waiter for 20 people, come on..."], ["Nicole H.", "I wanted to like this restaurant, although I read some alarming reviews in the \"not recommended\" portion of Yelp. For our first (and only, despite the fish being delicious) trip, we went for a friend's birthday. He called the restaurant at least 2 days in advance to make a reservation for our party (actually 5 days and then increased the number 2 days out). While the food was delicious, the service was so terrible that I rank this meal second to last in my life; second only to the 5 bucks-a-meal milkshake place down the shore who left our table without a check or drink refills for over 1.5 hours.  At Oishii, we were seated on time for our reservation,  with about 3/4 our reservation present and ready to be seated. We had 3 more people still to arrive. The odd service, that ultimately became terrible service, started right away. Our waiter took about 4 drink orders (between 11 people) and then disappeared. For those of us who did not get in during the mini-drink order, well, we would not even get a chance to place our drink order for the next 60+ minutes!!!  To be clear, I sat in a restaurant with a table of 11 other people for an HOUR and not one staff member even asked me if I would like a beverage, let alone to order food. We made two seaparate trips to the bar to secure drinks for our table since our table was not going to get service. Once we FINALLY got to order a beverage, we asked if we could split the check - we were told yes, as long as we split the check 6 ways or less. We said ok that would work, seemingly consenting to being billed with 6 separate checks and we even explained how to work each check (nothing complex, just these 3 next to each other, these 2 next to each other, etc). HAHAHA!Once we finally got to order food, 1 hour and 45 minutes after we were seated, we were told that because the waiter had to make too many trips and put in too many orders to the bar, we could only put in 2 separate tickets for sushi. OK whatever, the waiter failed to once circle the table and ask about drinks and/or appetizers (surprise, we would have spent at least another $250 had you of provided adequate service), that is not our fault. But whatever, we did two large sushi orders and everyone decided not to order any hot meals as half of us had work at 8 in the morning and the other half had arranged to meet another group at a bar after (or so we thought...3 hours after the event started, still stuck without checks at Oishii). But we put in the sushi and waited about 45 for it to show up (completely acceptable for the sushi to take that long to prepare, but not after an hour+ long wait to even order, let alone recieve, a drink).Sushi finally arrived about 2 hours and 15 minutes after we sat down and we were starving so we dug in. One roll of my friends' wouldn't turn up for another 30 minutes, but hey, at least the majority of us got to eat a lil something. Since we had collectively given up on entrees, we asked for our checks as soon as our sushi mostly all came out (except that roll that showed up a full 3 hours after we arrived, we had already asked for checks about 20 minutes before that). We tried to pay, as everyone wanted to either go home and sleep for 5 hours before work or go party more, and were told that we had to put it all on one card, no split checks. Notice above that we were specifically told that we could have up to 6 split checks? Yea, suddenly no, because the waiter didn't handle the table correctly at all. So we, the customers promised separate checks, were penalized. My friends tried to discuss splitting the checks and the waiter got so concerned about us running out on a portion of the bill that I told him to preauthorize whatever he needed on my card, divide the bill as we requested from the get go, and my card would act as collateral for payment. He finally agreed (we are a group of married and nearly married young professionals including one married couple with a baby, we are SO not walking our tab thanks).  The bill came out about 20 minutes after we started insisting upon it and after the \"you are going to walk the check\" discussion was resolved, we proceeded to divy up the bill as much as possible (a lot of items were on the wrong check), pay, and flee this ridiculous place. Yes, the fish was good hence the 2 stars, but the service was the second worst I've ever had in my life. I have never been so disappointed in a place as I was with Oishii. I wish I had stayed home, I could have scrounged up more food from my kitchen floor in that amount of time."], ["Mallory S.", "This is by far my husband's and my favorite sushi spot in Dallas. The sushi is delicious and fresh. The sushi chefs (Thanh, the owner, and Tri) are always coming up with new and inventive combinations for rolls. We have not been disappointed when we have asked them to come up with something on the fly. The customer service is fantastic - these guys know their regulars and are always smiling and greeting us with a \"fist bump\". The general manager Tom is a great addition to their team. We will miss them all very much as we have moved across the country, but you can bet that we will be back any time we visit Dallas!"], ["Shawna B.", "Dare I say, the BEST sushi spot in Dallas!! Not too expensive, yet top quality sushi with salmon sashimi that will melt in your mouth. My sister and I decided to give it a try after a bit of reluctance from reading the reviews, but honestly it's the type of judgemental stuckup annoying people that walk into this place that is giving it an underrated rep. I have absolutely no complaints. Restaurant decor is simple yet elegant, waiter was extremely polite and respectful along with the rest of the staff who never lets your water get past a quarter empty, and the sushi chefs...a joy to watch. The sushi rolls all have beautiful presentation and taste SO GOOD. I cant wait to come back here."]], "Zen Sushi": [], "Kenichi": [["Alene Y.", "I stopped in for late night drinks with my girl friends. Danielle, one of the bartenders was really kind and funny. The venue is gorgeous and the location is nice as well. Will definitely visit again my next time in town."], ["Jenny G.", "Two words: Terrible service.We went here hungry, got our appetizers fairly quickly, and then we were forgotten completely! The food is average, one star for the food and one for the ambience.We had to remind the waiter to bring our food out multiple times and the waiter time between appetizer and entree was an hour - no exaggeration!The fried rice was really good, the meats had no flavor whatsoever."], ["Mai-Anh H.", "Went here last night for the start of Dallas Restaurant Week. Not bad for Asian fusion, a tried and true cuisine.Ordered dynamite shrimp, the sushi sampler, and the only dessert choice. Sushi rarely fills me up (I know it's the opposite for some people) so I ordered some tamago nigiri and shiitake tempura on the side.I highly recommend the dynamite shrimp, hot mess roll, tamago nigiri, and pineapple mint dessert. Some of the nigiri ended up being fresher than others. The shiitake tempura was a tad on the boring side. Or maybe I was finally full at that point.Could be worth another visit, but we'll see."], ["Cat N.", "The food here was alright but expensive for what we got. Rolls are usually six to eight pieces. Most of our rolls only had five pieces. Since the restaurant is in this area, I didn't expect any less! Between the four of us we shared spicy salmon, spider roll, hawaiian, unagi, and a dynamite lobster roll I believe and some other rolls that I forgot the names of. Check pictures uploadedThe spider roll was the best one in my opinion. My guests said it had a lot of ginger flavor but I didn't seem to mind. The Hawaiian was good. Everything else was just okay. It was convenient because we were going to the Mavs game but I wouldn't go out of my way to come here."], ["Noreen T.", "I came here for dinner on a Friday night.  Parking was free for up to 2 hours in the parking garage across the street. This restaurant is huuuuge. There are 2 levels, but we were seated on the first level. We were given a complimentary sweet pepper appetizer, and we also ordered the lamb lollipops. For the main entree, I got the King Scallops. It was served with a type of squash mash which was so yummy and plated so pretty. For dessert we had the molten chocolate cake. I didn't like how it was served with chocolate ice cream, I feel like it would have been better with vanilla. I also didn't like how they included a random chocolate pocky stick in the dessert, it just seemed like an unnecessary and cheap accessory. Overall, it was a good experience and I would go back for the food. The servers were also very helpful."], ["Morgan W.", "AMAZING..I've been coming here for over 7 years and it is always spot on. There's definitely a reason why this place has been in Victory Park for so long. The food and drinks are always consistent and delicious. Staff is very knowledgable and friendly. I always go for their reverse happy hour they have in their lounge. Perfect place to go to before or after a Mavs or Stars game. I can't wait to go back and check out the new lounge they have upstairs. Definitely recommend!"], ["Kristina Z.", "Went to Kenichi for a friend's birthday dinner. We basically had the whole upstairs to ourselves for a private party of forty people. The bartenders made some great drinks before dinner and then we were sat. We ordered a variety of sushi dishes, Ahi Tuna, shrimp, fried rice with chicken (omg delish) and everything was good. The rice portion was decently sized but the other entrees were pretty small in portion size which sucks since It's a pricey joint but I enjoyed my first visit there because of my meal, drinks and company. Would come back again to try some different things.Side note- the place was super empty for a Friday night until our group of forty rolled in."], ["Jeremy S.", "Well place looks great! Really cool. However food.... Fail. I had the Sea Bass should of had the Sea Pass!! I love sea bass and this is the worst I've ever had!! Overwith!!!Sushi was just so so!! Hate to say it but don't bother."], ["Kellie M.", "I went for an event last night, which was completely over capacity but I realize that's the fault of the event hosts. However, the bartenders were very inattentive and as a bartender myself having worked in high volume bars, this says a lot. I also had tabs at both the downstairs and upstairs bars...when I closed my tab upstairs, they failed to give me an itemized receipt copy. I thought nothing of it until I closed my downstairs tab and learned that gratuity was included, so I essentially tipped the upstairs bartender twice. Annoying."], ["Ben D.", "A colleague and I got in late and we're staying at the W down the street. We decided to grab something light and decided to go here. We sat in the bar area and were greeted in 5 min. We were given menus and ordered something simple. I was about to receive a wrong  order when I stopped the server and he seemed confused. He then remembered what I had and came back with that 10 min later. The experience was \"ok\" but I'm sure it would be better during prime hours. It took us longer to eat and leave since our server was pre occupied with many other things. All in all, I would go back to make sure my experience wasn't bad but would also look for other options next time."], ["Mo A.", "We really enjoyed a variety of items but my bone in Ribeye was very good. Spicy edamame and dynamite shrimp was very good. Try the Morgan for a very nice and different take on sushi. In my opinion, a bit on the pricy side for what they offer but they had good drink choices and good service."], ["Michelle F.", "Never again. Over priced for what you get. Nice staff but when you have to ask to order dinner, drinks take plus 30 minutes and ask several times for the same item, that's a problem."], ["Hanan Q.", "This place is meh. The ambiance is awesome, it's pretty chill and hip. The sushi is alright, I would explain it as bland and unmemorable. The best thing here is the thai coconut soup, it's a must try."], ["Bodhi D.", "Amazing food, super fresh sushi & their cocktails are always great.  Use the valet for concerts or sporting events at the ACC for easy, cheap parking."], ["H H.", "Hands down one of the best Japanese restaurents I've ever been. The food is great. Desert is phenomenal and the environment is unbelievably good. Recommend it for sure."], ["Alicia W.", "Amazing Food,  Fresh Sushi and tasty deserts!   Great service  every time we go ! We ALWAYS  ask for Morgan's section  she the best !! You won't be disappointed!"], ["HaleyBeth O.", "The service here was not very attentive for a week night. I ordered a steak and was served it with chopsticks. The steak wasn't cut all the way through, nor was it in bite-sized pieces. I struggled very much to eat it without a fork and knife. Also, my dish came with about 1/2 to 1 inch layer of liquid on the bottom. My dish had a side of french fries, which, due to this aforementioned liquid, became completely soggy and inedible. Not worth the price, in my opinion."], ["Gina I.", "One of my favorite sushi spots in DallasFood is amazing and well worth the priceWe always ask for Travis as our server because he is simply awesome!!!"], ["Moe A.", "Oddly enough, the only reason why I go here is not for their sushi, but for their soup. Yes, their coconut thai curry soup! It's literally the best version of Tom Kha that I've had in Dallas. It's a little pricey, but it's filling. In my opinion, the sushi is just average, not worth the value that they put on it. If you come here try the soup, you will be surprised. It's really good!"], ["Chiyoko Y.", "Sushi was very fresh and the presentation was awesome.   The restaurant location and décor are fabulous.  I was also impressed by the quality of chopsticks they use and home brewed low sodium soy source.  They also understand the importance of using \"real\" graded wasabi.  I would recommend for business dinner - as it can be quite pricy but certainly impress your clients."], ["Dale B.", "Look it, I love sushi. I love good service. I love an awesome dining experience. I got all that and more at Kenichi. As you know, your dining experience can be good or great depending on the server. So when you go to Kenichi, make sure you ask for Travis. This dude, helped organize a super fantastic dinner and saki experience. He explained as much as we wanted to know and he suggested some killer dishes. The whole staff was awesome really.But the sushi was super fresh and yummy and then Travis turned us on to other amazing dishes like the noodles etc.I could go on. I had found Kenichi on the rewards network website. I think they offer 3 miles per dollar spent.Needless to say, I went back there the next night with another friend who was equally blown away. And get this, Travis was not working but happened to be  there and hung out with us for a beer and helped us order again. Thats what kind of guy he is and thats what kind of place Kenichi is.Do it."], ["Nikol M.", "Great atmosphere, food is way overpriced and not worth what you pay. Rolls do not taste fresh, nothing special."], ["C. C.", "I don't know why it's taken me so long to write a review of this spot.  I guess you could call me a regular since I drop by the bar 1-2 times a week.  But it's the food and the friendly service that I wish to report about today.  My date and I went for Valentine's Day, were seated in a timely fashion (despite a very busy, busling restaurant), and got attentive and KNOWLEDGEABLE service.  She loved the rolls and the tuna.  I got my usual yakisoba (sp?) with beef and sampled the pork belly skewers--awesome.  Another great turf item is the Hong Kong flatiron steak.Finally, the staff is great and the proprietor, who checks on every table, is sincere and really obviously enjoys his job."], ["Maryanne F.", "We came here for my bachelorette party while staying at The W and were not impressed with any aspect of our experience. 1. Not busy and very, very slow service on a Saturday night. 2. Waitress was unfamiliar with menu and awkwardly took back a plate when she recommended it with incorrect information. 3. The rice was good! The rolls were unique and tasty! But the overall experience was so terrible it doesn't even matter. 4. Still waiting on our ticket..... oh here it is. 20% gratuity already added after terrible service. 5. Ticket was not reflective of menu price- now to wait on a new check. Will not return."], ["Kate G.", "I was underwhelmed by the selection and flavor of the sushi here. At these prices, I should have just walked around the corner to Nobu but it was pouring rain so I didn't. I ordered 5 pieces of thin, tiny (quarter sized) sashimi slices for $16 and a spider roll for $14. Their other rolls were all $18-20+ and all featured snow crab or cooked fish - those are not my favorite. The spider roll did not taste fresh and it was tiny at that. I really enjoyed the miso soup and had a friendly server at the bar, until it came time to pay my bill and I waited 20 minutes in spite of others being served on either side of me. It's a pretty place but when empty, the ambiance was just off and the food didn't taste good enough for me to return."], ["Ali N.", "The manager here is such a jerk!   Came here for a party and I was about ten minutes early for the party.  I asked the manager if I could sit at the table and wait for everyone to arrive when he rudely shouted \"No!\"   At first I thought he was kidding but I soon realized he wasn't joking. Minutes later he said they don't do that until the whole party arrive, he was still super rude so I just rolled my eyes and ignored him.  Later when 16/20 peoples showed up,the party's planner asked the manager the same question and he gave her the same attitude.  The service here is SUPER SLOW, not sure if it was because we were a big party but we were there for a good three hours, and the last 45 minutes was waiting for our checks!  We were not happy about that since we had after dinner plan.Food was ok, the sushi was decent but not anything special and I had better sushi for half of the price.Overall we will not be coming back."], ["Ashley S.", "So I really liked the sushi here. It was fresh and tasty. The ambience here is amazing! My husband and I had a private booth with a curtain that the staff kept closed. Very intimate and private! The only downside is this place is a little pricey, but you get what you pay for!"], ["Jess M.", "The sushi is delicious. The location is awesome. It's right next to the W on Victory Park Lane. It's really easy to get in and out over there. They also give a discount to locals, but you have to ask for it. I like that they stay open fairly late too. The bartender said they usually serve until about midnight unless it's really slow. I was going to give this place three stars (due to the price of the food and the lack of WiFi). I added a star since they participate in the HHonors Dining Rewards."], ["Megan C.", "I ate at Kenichi during a private event at the restaurant, so I cannot comment on the overall quality of the restaurant and its service during normal business hours, however I did experience a pretty complete tasting of the menu over a lunch engagement.The atmosphere at Kenichi is very sexy and swanky, more so than one might expect in Dallas, but this is the up-and-coming Victory area, and situation near the equally-swanky W Hotel et al, so it definitely fits in with its surroundings. Even the restrooms (upstairs by the big gong) are dripping with style and substance. Given the impression provided by the ambiance, decor, and furnishings, I was expecting food of similar style and sizzle, with great taste and presentation to match. I wasn't very impressed, as the food itself was on the bland side, and the maki rolls seemed to be messily and hastily put together, with rice and nori not playing well together. The seared salmon was a bit boring, and left we wanting for more. Avocado, cucumber, crab, and tuna all tasted tired and lackluster to me. Even the wasabi couldn't make it dance.It would seem as though Kenichi is resting its laurels on the fact that it has sisters in Aspen and Hawaii, and a very sweet spot in a hip spot in Dallas, but that can only fuel it for so long if its sushi and Japanese-inspired cuisine can't keep up."], ["Jerry M.", "OMG! Worst dinning experience ever! Just spent $200 on dinner for my wife's birthday dinner only to be told by the manager \"Don't come back.\" You know that's not a problem.  Run Forest run!!!!!"], ["Robyn W.", "Food:  I had the spicy edemame:  it was covered in a weird sauce. Ok taste, awkward to eat, nothing special.  Mean green roll was 18 bucks and possibly the nastiest roll I've ever eaten. Tuna topper looked/tasted like it came out if a freezer. Mixed fried rice was excellent. Atmosphere: warehouse modern, seemed a little run down upstairsService.  We had a table of 20 with two waiters. I guess they just counted on the 20 percent mandatory large table tip because the service sucked.  Was very slow. Took 20 minutes for them to get the drink order and another 10 to bring a glass for beer. Staff was never visible when not directly serving the table. I'd say my experience was poor and definitely expected better for the cost. Poor food and weak, overpriced drinks. There are much better Asian places in the area with just as nice atmosphere and half the cost.  (Axiom sushi for example). I will not be returning."], ["Melody T.", "DJ is mad crazy tonight!! WOW! This place pops! I mean on the weekends its like where did all these people come from! Drinks are a little pricey but kind of worth it cause you are paying for the over all experience. There are 4 parts to this place. A little outside area where you can eat from there amazing menu. Right when you walk in there's a nice sized bar area with sexy lighting! And then you move further back into the place and there's more seating a dance floor area. Upstairs is very nice too! Love this little lounge. A great place to mingle, eat, and drink!"], ["Tim L.", "I go to Kenichi regularly because of the sushi, and Richard.  He is a great waiter, remembers me, has good suggestions, and is friendly and an efficient waiter.We started with the fried calamari.   Really good, and a large portion. For me, not quite enough heat, but good.   Richard suggested the Morgan and Mean Green rolls.  Both were good, but the green sauce on the Mean Green was really tasty, and had some heat.    Salmon and tuna sushi was good sized, draped over the rice, not just a piece on top.  Rombauer Chardonnay with dinner was perfect - one of my favorite whites.I'll be back!"], ["Hugh O.", "Had a reservation that was confirmed two days prior but was canceled because I didn't confirm on the day of the reservation. If the host had told me that I had to reconfirm, I would have. The host was rude and talked down to us, he needs to be replaced or retrained on proper customer service. Besides that we did get in and the service/food was very good."], ["Jaime C.", "We had so much amazing sushi our first night in Dallas we went back again the very next day for lunch. The Chef was amazing. The fried chillis were really good. Not to spicey and tons of flavor."], ["Bill S.", "Enjoyed a really nice dinner. The staff was pleasant and engaging making me feel like a regular. The pan seared scallops in the truffle sauce was excellent. The tuna sashimi was fresh, ruby red and melted in your mouth. It was served on salon radish threads over an Obe leaf. Oates the leaf. It was like a peppery mint just like the Sushi chef described it. The Sake selection is excellent, and I splurged on a great Saki the commented the meal nicely. The Sushi chef gave me a small sample of some squid salad that I loved. Nice customer service touch! I also tried the Maple Brussels Sprouts because I love Brussels Sprouts, but I didn't enjoy them as much as the rest of the meal. They were unexpectedly spicy, and not knowing the Japanese term in the description I was caught off guard with the Maple title. It was good, the Sprouts were cooked al dente the way I like them, but I found them a tad bitter. I withheld one star, because my water glass ran dry and I waited a long time for a refill. I like to have water with my meal so sip between flavor changes. It bothered me. I also waited too long for the check when finished. Still, I'd go back for the excellent food."], ["Dorothy M.", "Tasty food (we had the fries and avocado roll). Chill atmosphere. Fun and delicious cocktails. Really appreciated the vegan menu and the cook even whipping something a little special off menu! The servers were a little too cool for school, but were kind. Will be back."], ["Matthew A.", "If you are thinking of dining at Kenichi..think again.  While the service and sushi have always been mediocre at best.Last night was the last straw.  I have reservations for a valentine dinner date.During the day I recieve 4 calls in the span of 30 min. to confirm the reservation.I was working with clients and unable to answer my cell.  A few hours later I called the restaurant and got a busy signal. I waited a few min. and called again..it was busy AGAIN.I picked up my date and went to the restaurant only to find that they CANCELED it.The desk jockey told me I should have answered my phone.  Then proceeded to act as if he was doing us a favor by \"finding\" a table.  There were only 5 other tables full at the time 7 pm on a Saturday.  After  15 min and 20 servers passed by us, we finally were asked if we wanted a drink.  I should have left but didn't want to embarrass my date.We ordered wayyy over priced sushi. But still left hungry and a little angry.  There are so many good restaurants in Dallas, why be so rude?"], ["Nicole C.", "The sushi is average and very expensive for what you get.  Major complaint was the noise, we were screaming at each other (4 of us at square table!) to even figure out what to order.  The fried green beans were good and priced accordingly, berry ciroc drink was pretty good.  $300/4 people for 3 rolls, 3 drinks and a reasonable bottle of wine is ridiculous...will never return and will warn others."], ["Xtina L.", "2 Stars for service. 3 for the food.  Sushi was good but not justified by the price. This would not have been my pick, but I went with a group. I feel that a roll that cost more than $12-15 bucks should taste amazing and these were personally average at best. I have had MUCH better sushi and impeccable service elsewhere. If the server is unfamiliar with the menu because it is her first night, she should ask someone who is knowledgeable and return to the table. Have a list of apps ready to suggest when you are serving a party of 6+"], ["Philip C.", "Solid upscale Asian fusion restaurant. As some others have said a lot of the dishes have very Japanese ingredients in them. Sometimes there are other things that are more Chinese like black bean. Overall it's a great restaurant. We had a sashimi dish which was a delicious. Salmon over Uzu dressing which is typically a very Japanese citrus salad dressing that I love.  Had a delicious sushi roll that was slightly over done but had lots of tuna in it, so was good to me.  To be honest, I don't think much of their sushi and sashimi is \"authentic\" Japanese.We also had a soft shell crab appetizer which was excellent but kind of small for 2 people to share. For the entree we had some cod it was good but not memorable. It did have some crab in the dish which blew my mind. Ended the meal with an epic lava cake which we had to wait about 15 minutes for since its made to order. Completely worth it so waiting ain't no thang. Friendly wait staff. Oddly located bathroom on the second floor. This place gets CRAZY packed on game/event days when there are people at the AAC.Lots of \"escorts\" here lol if you get my drift.  Either that or lots of older gentlemen with MAD GAME, I tip my hat to you sir."], ["Stephanie E.", "Our experience at Kenichi was HORRIBLE.  We selected Kenichi as we had never been here before, had heard good things about it and thought the posted restaurant week menu on the website sounded delicious.  Upon arrival we immediately noticed the restaurant week menu posted online was not the restaurant  week menu in the restaurant.  They had extremely downgraded the food with poor substitutes.  Needless to say, the quality of the menu was average at best.  The presentations was surprisingly sloppy, the service was sub-par, and the atmosphere was rather bland.  Definitely a huge disappointment as a I am a huge sushi fan.It is obvious that Kenichi posted a much superior restaurant week menu online to draw a crowd in which they seemingly needed. Honestly, I feel that even for a $35 restaurant week menu it was not worth it. We are glad we tried it at this time and weren't paying full price as we definitely will not be going back there."], ["Christopher D.", "Had a private party on the upper floor last night for 60 of our closest friends. The space was perfect and we had our own bar. A little warm at first. But they cooled it off for us. Wait staff was very focused on our needs and very pleasant."], ["Thao L.", "Came here on a Friday night, and it was pretty quiet. I love the atmosphere here, and it's a great location in Dallas. Being that it's in the middle of downtown, the price tag is also pretty high, so consider yourself warned.Their ribs (I know, ribs at a Japanese place?) is so good! The meat nearly just falls off the bone. I used my chopsticks and pulled at the meat, and the whole thing just came off. Their fried tofu is also very good, but it was sitting in a really salty sauce, so I kind of wish they would put the sauce on the side for dipping instead. Their sushi is pretty normal, but they also serve fresh wasabi here for an additional $3. If you're like me and love that burn-your-nostril-clear-your-sinus sensation... GET the fresh wasabi! it's worth it and you can tell a big difference!!! It only takes a little bit with the soy sauce, and they blend so well together. Nearly brought tears to my eyes.I think this is more of a special occasion type place rather than a weekly satiate-your-sushi-craving based on the price tag. Either way, I would recommend this place."], ["Ashley S.", "Don't go here. Seaweed salad is identical to every other sushi restaurant out there. Nothing special, yet double price. Same with the rolls. Charge twenty two for rolls? Give me a break. Was hoping the roll would at least be worth it. Much better rolls for half the price at Sushi Zushi. Husband's miso cod came with two match-stick-size carrots. Otherwise, plain jane. Go to Mercury Grill instead for their miso cod. Amazing. Slow service and they messed up our order twice. Tiny pieces of unagi sushi. Only two pieces of salmon sashimi, and meager as well. I went to Kenichi in Austin once, remember not being very happy with my meal, finally tried this one in Dallas, and still a fail. Never to return. Don't bother."], ["Alex K.", "Calamari appetizer is great! Good Saki, good service, and good rolls. The riceless rolls with cucumber are light and tasty."], ["Tiffany D.", "Fresh Wasabi. Do it. It's $3 for a small dollop but it will blow your mind and nostrils.The food was good but not OH MY GOD I'm going to drop my pants and make love to it right there on the spot. Crispy tofu  was good. Black cod was not as decadent as I had hoped. It was good but not the best I've had. I think that's the thing with this place. Everything was good.. just not FREAKING AMAZING. In a nutshell, should you come here? Sure. It's a nice place with good service and good food. Just don't set those expectations of yours too high ;)"], ["Martha R.", "I went to Dallas for a little professional networking, and checked out Groupon to see what was up. Well, Kenichi was up, and I love sushi...So I made some reservations online (okay, I'm pretty sure I've said it before, but I'll say it again - that is so f-ing cool), and we showed up about 15 minutes before our reservation. I believe that we ended up waiting about an hour to an hour and a half before we were seated. Such is the beauty of the Groupon. :(However, I will say that the staff handled the fact that we had to wait quite well. We were greeted by one of the local Kenichi babes, and she chatted us up here and there. Then we also got a free drink courtesy of one of the liquor companies doing their little pro-mo thing there. As soon as we were finally seated in one of those really cool \"private\" booths (there's a sheer curtain you can pull across the area), we received a free Blake roll. It was actually probably my favorite. We ordered a few other things, nothing that really sticks out because it was just all quite delicious. Half way through out meal, we received another free item (the Salmon and goat cheese dish)... and while it wasn't as good as the Blake, free is very nice. Very, very nice... and quite unexpected - which made it all the more pleasing.The ambiance is fun, club-like, and loud. But it's a fun place to spend an evening (provided you're not looking for something romantic - even with the semi-private booth). Upstairs they have a DJ and he plays the young club music... which is not really my thing, but totally matches the crowd and ambiance. The staff was attentive w/o being annoying (again, could just be because it was so busy - but I liked it regardless). Overall, it was a little on the rough side, but they handled it well, called me a few days after dining there to make sure that everything was okay (kinda cute), and it made me feel a young (certainly nothing wrong with that every now and again). Is it going to rock your world? Most certainly not. Is it a fun place to get some pretty good sushi and maybe even get your club dance on (or just make you feel young if, like me, you don't dance)? Most definitely."], ["Cynthia T.", "When you walk in the door of Kenichi, it looks like it'll be your swankiest sushi experience.  I went there for dinner and my eyes were greeted by a lit up bar, lounge like decor and furniture, and my ears were bombarded with crowd noise and la musica.  I walked into the dining area and my nose was enticed by the fresh food being served to seated patrons.  I sat down, touched the menu and was ready to order!Thanks to a Groupon deal, I got to splurge a bit with my friends so we tried a LOT of food!  My favorites from our meal were the following:1.  Miami roll (Scottish salmon, shrimp, crab & avocado wrapped in cucumber with a sweet red onion sauce)2.  Escolar Aburri Sashimi (5 pieces, torched escolar with white truffle white soy)3.  Yellowtail Serrano (Serrano pepper, basil vinaigrette)4.  Kenichi Aspen(snow crab, tuna, avocado rolled inside out, topped with smelt eggs)I have never eating anything like the Miami Roll before, so inventive, fresh, and delicious!  I don't recommend their Calamari.  I LOVE calamari but was disappointed to bite into what seemed like a fish stick - basically squid paste, shaped into a bite-sized stick, breaded and fried.Our service was good, considering it was a Saturday evening and our waiter was very friendly and helpful.  They also have an upstairs lounge area with full bar and a DJ spinning the tunes.  Oh and their restroom was totally clean and matched the restaurant in its decor - hey if I feel hip and comfortable even in your restroom, that says something!Yes, it is a bit pricey but you're praying for the ambiance and some creative food.  I recommend making reservations because it gets busy!"], ["Mika S.", "Eating here made me feel like a judge on Iron Chef. Compliments to the sushi chef, Yuki.  I've never had better rolls than theirs, including the exquisite bonsai roll.  It's fun to cook your food on the \"1,000 degree hot rock.\" Everything we ordered arrived beyond expectation.  The sous chef, Tyler, makes  a delicious bread pudding.This would be a posh place to take a date."], ["Michael C.", "Dinner at Kenichi last night with friends (party of four). It was our first time there, our friends' second. They were so impressed on their first visit that they bought us a gift certificate and then held a gun to our heads to force us to invite them to come along.We are sushi aficionados and not easily impressed, but Kenichi earned our respect and our return business too. In these days when so many sushi joints have non-Japanese sushi-makers who got their training off the inside of a matchbook cover, it was wonderful to visit a restaurant where the choices and freshness of the fish, the inventiveness of the menu -- indeed, the professional supervision of the entire process from fishing boat to table -- make it clear that someone(s) really knows what he's doing.We ordered a lot of food -- close to the full range of a la carte sushi and sashimi, from salmon to sea urchin, plus four different specialty rolls and a couple appetizers  -- and found no disappointments anywhere on our table. My wife is a big chirashi fan (assorted sashimi on a bed of rice, all served in a large bowl) but it wasn't on the menu. Just for the heck of it we asked if they would do a chirashi bowl for her. Not only did Kenichi produce one of the best chirashis she has ever had, but the master sushi chef himself proudly brought the bowl to the table, along with something we had never seen: a small container of sauce that he recommended for drizzling over the sashimi. Throughout our meal the wait staff was attentive, courteous, and always willing to explain in layman's terms this, that and the other dish.Some of the reviews of this restaurant have complained that the sushi is overpriced. We say it is pricey, but at Kenichi you pay for the ambience, the decor, the location, and the professionalism of the staff, as well as the quality of the food. These people are pros and their establishment is spitting distance from the American Airlines Center, so they are accustomed to spiriting famous people into out-of-the-way booths and satisfying their Japanese-fusion needs. This is UPTOWN DALLAS, people ... of course it is expensive. Complaining about the price here is like going to Morton's and bitching that their ribeye costs more than the one you get at Chili's.So the moral of the story is, wonderful dining experience, and worth the extra bucks. If the price is that bothersome to you, stick with Chili's. Or bring the title to your car. It will be worth it."], ["Deborah L.", "I came here tonight with pretty low expectations - we live in New York and felt like we needed some light, non-greasy food and picked this place because the seafood was reputed to be fairly fresh (for somewhere inland).  And being from New York, I wasn't really expecting sushi that was better than what we could get, nor was I necessarily surprised by the small portion sizes and menu prices. But let's not get ahead of ourselves and break it down:THE AMBIENCE is trendy lounge and we were dressed very casually for walking around the city so we were initially a bit worried that we would be too under-dressed to be seated.  The place was empty except for a few tables and the staff were very nice, so we needn't have worried.THE SERVICE is friendly, but shockingly slow given how empty the place was.  I counted about 6 people in the kitchen, 2 of them being the sushi/sashimi chefs, 3 servers and 1 hostess for about 3 patrons at the bar and 4 tables (1 large party of about 6 or so, 1 medium party of about 4, and 2 parties of 2 including us).  We walked in and were seated immediately and ordered 4 dishes, 3 of which were sushi/sashimi type dishes and 1 side order.  The first 2 dishes came relatively quickly, but the last 2 took a very long time to come.THE FOOD is actually pretty good and lives up to the reputation of being fresh.  We ordered the Godzilla roll, diver scallop hot stone, yellowtail tataki with a side of roasted fingerling potatoes (yes, out of place I know but we needed the carbs to fill us up given the small servings we expected).  Serving are small \"tasting plate\" sizes, but you expect that at a place like this.  The Godzilla roll was excellent, the diver scallops also quite good and the yellowtail tataki also good, if a little over-seasoned in the yuzu sauce.THE RESTAURANT'S ABILITY TO DEAL WITH DISTURBANCES is terrible.  That 1 large party of 6?  It was an extremely rowdy group which included 2 very young screaming children running amok and 2 very loud-mouthed profanity uttering boozed up adult males.  If I wanted to have my ears assaulted with bad renditions of \"Who Let The Dogs Out\" with liberal cussing and non-stop whooping and yelling of \"SHOTS!!!\" I would have chosen to go to a dive bar instead.  If I wanted to eat in the same place as undisciplined children, I would have chosen to go to McDonalds or some other chain restaurant.  To my utter embarrassment for them - because they had none for themselves - they had been placed in a \"private booth\" in the very back of the restaurant, yet somehow they were loud enough to disturb the patrons both downstairs with them and in the upstairs lounge area as well.  One very well dressed couple (the lady was dressed in a floor length evening gown) trying to enjoy a romantic date night needed to request a change of table so they could get a little further away from the chaos - not that it did them much good, since they were loud enough to drown out the background music and all other dialogue in the restaurant.I get that it was a horribly slow night, it was a large party and they were spending big, but that's no excuse to let badly behaved patrons get away with such blatant disrespect and discourtesy.  There was zero effort made by the staff to ask that group to behave in a more seemly manner.  Combine that with the slow service, and you end up with a ruined night and a huge headache at the end of it all.Just ask that poor guy who probably spent a lot of time planning a wonderful evening for his beautiful lady friend who probably spent a very long time getting dressed and getting ready for what they probably anticipated to be a very romantic date...and got the most unromantic experience, ever.Giving 2 stars out of pity because the staff honestly looked completely harrassed and jumped every time the kids screamed or the boorish men yelled and probably had their hands tied and weren't allowed to do anything to jeopardize a nice big cheque and tip.  If I were to be brutally honest, the overall experience is a definite 1 star.  I will not be back.  I will not be recommending this place to anyone.  Yes, it was 1 isolated group that ruined my evening.  But when I'm spending this kind of money at this kind of restaurant which positions itself as upscale, I expect an experience to match.  Yes, it's the fault of that badly behaved group, but when some people just don't know any better, I would expect the manager to step in so that one group doesn't ruin the night for the entire restaurant."], ["Linda T.", "I had an exceptional time hosting a large event at Kenichi. The entire 2nd floor of the restaurant can be sectioned off for private dining and styled as a lounge, reception are or full on dining space. Pull away curtains add privacy and can be modified however you wish (you are in the heart of the design district, after all).The food? Fresh. Which is surprising since this is Dallas we're talking about here. The service? Beyond excellent. Communication with the event coordinator was flawless and while she was not able to personally staff the event, the evenings' general manager and wait staff were already briefed and ready to go by the time I got there. The staff were highly responsive to our requests (read: demands) and also made suggestions of their own throughout the night based on their observations of our guests and how the event was flowing overall. When the GM decided that we needed to add more \"oomph\" to impress a potential client, he brought out an entire plateful of a rare cut of Rockeye Salmon -- available only for a few days when the salmon swim upstream to reproduce, the salmon is leaner, more vibrantly red in color and more robust in flavor. Thanks Kenichi!"], ["Rika H.", "We've been here before, it was deserted on a Thursday night.  We came here again on a Sunday before a concert, the place was packed! The food was good here, we mainly go for the sushi, I love their softshell crab roll! They actually have some authentic Japanese ingredients in some of their rolls.  Fresh wasabi for $3 is totally worth it.  Price is on the more expensive side for Dallas, two glasses of wine, 6 rolls and couple of grilled scallops later, the bill came to just under $120 including a 20% tip. The diners here are really a mix of everyone, so it's quite interesting.  Service is ok but at the end, the waitress did present us a bill including 4 dishes we didn't order or consume, but quickly corrected it as soon as we pointed it out."], ["Kristine N.", "A really nice trendy sushi place in Victory Park. I came on a Friday night and ordered the Morgan, Friday Night Roll, and Thai Basil Fried Rice to share. The Morgan was pretty good, but it came with a vinegar sauce that was not for me so I stuck with the soy sauce. I really enjoyed the Friday Night Roll which had cooked salmon, snow-crab meat, and tempura flakes. The basil fried rice was pretty good,but it was really heavy in the sweet basil so eat slow or you'll get full fast.They also serve \"fresh\" wasabi for $3 extra (I didn't know at the time until the bill arrived). The fresh Wasabi looks like a green salsa and has that spice that clears your sinuses. There's also some interesting appetizers that are not Japanese like garlic french fries, mash potatoes, etc....so there's a variety of options if you don't want sushi. Pricing is kind of high. Sushi roll prices range from $16-$19 with regular rolls between $9-$12."], ["Eric C.", "I listen to sports radio all day, and Kenichi is always promoting the 'Yu Darvish Special'. Anytime Darvish gets 8 strikeouts or more, sushi the next day is half off. Ben and Skin are always talking about it, and hosts name drop Kenichi all the time in the Rangers pregame show.My wife and I came on a weeknight around 8 to finally try this place out. It's in a cool part of town, but the place was empty. There is a bar near the entrance that had several employees around it watching the Rangers game on TV. The hostess came over and asked how we found out about them, we mentioned the Darvish special, and she said we would need a reservation to take advantage of the special.At NO TIME do they ever mention in their marketing that a reservation is required; I've heard radio show hosts talk for two months about Kenichi and they never mention a reservation. She would have sat us down right then if we didn't want to take advantage of the special, but we left and decided to make a reservation the next time Darvish did his thing.We come back the next week after I make a reservation, and the place is empty again. Pretty strange considering it's two stories and fairly big. Staff was watching the game, but the hostess came by to seat us in an area all by ourselves. Our drinks took pretty long considering we were the only couple there, and the food took an extremely long time. I asked about twice what the delay was. We ordered regular sushi rolls (tuna, salmon, nothing special) and it just took forever.The food was good. After it arrived though, our waitress vanished for long periods of time and I actually had to get up and go to the bar to ask for another drink and a water refill. When I get back, the waitress asks my wife if she wants another drink, and she clearly said no. I ask for a check, and then 5 minutes later she comes back with another drink and a check that already has that new drink listed on it. I told her we didn't ask for it and that I wanted it removed from the check, and she tried guilting me into just keeping the expensive drink and paying for it. We sent the drink back and she comes out with a new check and says 'We mandate a 20% gratuity on all orders with the Darvish special'. I don't have a problem paying that gratuity and probably would have done it anyways as the food was half off, but shouldn't this be something they tell customers before they sit down?tl;dr  good food, poor/slow service, they don't tell you key details on the special they're having until you show up/after you eat."], ["Rich L.", "It Restaurant Week so, hide yo kids, hide yo wife, hide yo kids, hide yo wife, and hide yo husband, and go book a table.Broke in RW with a stop at Kenichi.  I purposely got there early to sit a the bar and make love my tonic and gin.  Margaret at the bar was great.  She kept my glass full and shared her favorite things on the regular menu and made some suggestions on the Restaurant week menu.Once the whole party was there, we were seated promptly.  Not  crowded but filled up as the sun set on this sultry Sunday.  Our waiter eagerly shared that it was his second day, so the bar had been set.  No big deal.  He did an ok job but if we had a question, ie. what wine is comparable to the we just had at the bar but you're now out of, and he didn't know the answer, he would simply walk away without even an \"Let me check\".  Then on the flip side, the waiter would occasionally linger around and join the conversation as if he were dining with us.  Awkward.But the food was scrumptious.  The spicy edmame was something new to me and why doesn't everyone do this.  Good drop kick to your tongue.  My sushi platter and a good variety including a roll with fruit wrapped around it.  They also offered a steak entrée with some creamy goat cheese mash potatoes and a salmon entrée.  For me, it was bookended by some spicy Dynamite Prawn app and a fruit and coffee ice cream.  All in all a really good experience.Kenichi wah bitches."], ["Jen S.", "This place rocks. Easy parking, fun staff, top-notch food. I usually go the traditional route with Sushi but this time let them talk me into the flat iron steak and my friend went for the noodles with pork belly. Both delicious. The bar scene on game nights is great people watching!"], ["Lo' G.", "3.5This  review is wayyyyyyyyyyyyyyyyyyyy overdue!Kenichi is a my go-to spot when I'm downtown, and I typically start my nights here. I've been here more times than I can count. From dates, to NYE (it always pops), and even random Mondays (spotted Cuba Gooding Jr. here that night with his hockey friends) !  Steve is the awesome and heavy-handed! The petite blond is really awesome too, I just can't remember her name. If you're a  first timer, hit up happy hour for sure. Details:5-7PM (Normal)9-11PM (Reverse)Rolls: $6Cocktail of the day: $5 (The mint mojito is my fave)The sushi is decent. I've honestly had better from my college campus, but hey, you're in Victory. You're definitely paying for the atmosphere if you choose to explore the regular menu.  Favorite Rolls: CaliPhilly Mavs StarsOn the *weekend* they have guest DJs who mix Top 40's and hip hop, you'll be groovin' after your Long Island. Be prepared to show some ID (after 9PM) and pay cover if there's a big event,  or if it's just a poppin' night. The W is on the same street so peruse on down to Ghost Bar or the Living RoomBeen a regular here since I was 17 sneaking past the bouncer and batting my eyelashes!! SOLID. Placing this one in my \"Staples\" folder!!"], ["Mo M.", "We came here before a rock show at the HOB and I felt like I walked through a time warp. I've never seen so many over-dressed 40 something's... I had my good friend from out of town and my younger brother who was experiencing his first rock show in the big city. We are all under 30 and felt a little out of place. We were kind of given the once over by a server in his twenties that looked stoned and half asleep. I'm sure he was hoping for his normal crowd. The rolls looked great on the menu and I really love that they use real snow crab and will easily pay extra for it. The appetizers that toted local and farm-to-table aspects looked nice and the wild boar pot stickers were pretty good. The rolls just ended up with little flavor which was disappointing but they were fresh neat and clean. just lacked flavor. Dessert was a miss. It was a lava cake but the lava to cake ratio was way off and it was just a huge blob of chocolate sauce on a plate."]], "Yutaka Sushi Bistro": [], "Edohana Sushi": [["Jenna D.", "I get the Ahi Tuna Tower from Edohana at least once a week. It's CHEAP ($11) and FAST. I can pull up outside, run in and grab my favorite quick, work-night dinner. Edohana is a staple in my house!"], ["Taylor B.", "This place is quick and good!! I've never had a bad experience here, it's priced very well too!! They don't have any high chairs which kinda sucks because I have a one year old, but hey I can't complain still really good!"], ["Travis C.", "I love this place! Super fresh, you can watch them make it and they're quick too. We always get ours to-go, but the inside itself is relatively nice. I recommend the Roll Out Party Tray!"], ["Sarah A.", "Take this place for what it is and do not compare it to other places like Hypnotic Sushi, Deep Sushi, or Sushi Zushi.... (Do all sushi places have to have \"sushi\" in their name?)This is cheap, fast, and mostly delicious. The sushi and roll combos are pretty good. I can't name one off the top of my head, but they're almost all under/around $12 and contain a good amount of fish. It's pretty clean inside, but the seats and tables are a little beat up. I only have 2 complaints. 1) The chicken in the bento boxes is not good. It kinda tasted like it was from a can. Do yourself a favor and just stick with the sushi. 2) The soy sauce containers are broken. If you go to pour soy sauce all of it dumps over the table. As long as you remember to take this place for what it is, you'll enjoy it."], ["Yelp U.", "I love going to this place.  Sushi is great and the price is too!! It is a great place to get quick and quality sushi. One tip for the owners: the store would look much better if you change the lettering on the outside windows to something different than Comic Sans ;)"], ["Jacqueline C.", "Yes! It's fast, it's friendly and it's convenient. No, the sushi isnt spectacular- actually I've had better from Alberston's. But it's cheaper than any grocery store or restuarant sushi around and its very fresh.  The rolls are large for the price, and the price is small for any sized roll. The restaurant itself is only a few tables, it's more for to-go or a quick meal. But it's clean and relatively less chaotic than some of the other places in up-town. Parking can be difficult, since there's no private lot or valet, but there is a garage next door which looked to be for the apartment complex but advertized parking for all."], ["Adel C.", "What a find! This small little restaurant marks an impactful impression in the Oak Lawn area.  The sushi is great and most everything on the menu is under $10. Perfect place to curb your sushi craving. I recommend  the Geisha roll or one of the Bentos."], ["Cricket C.", "I've been a loyal Edohana fan for nearly 2 years now, and I've never ever been disappointed and I visit religiously. We're talking once every two weeks or so, sometimes even more often. Their sushi always tastes super fresh and the combinations are simple enough that every ingredient is prominent, but not so simple that it's boring and plain. My personal favorites are the Line of Fire, Geisha Roll, French Kiss, and of course my go-to Spicy Tuna."], ["Pritesh B.", "This place is just a decent sushi place with decent prices.  It is definitely better than grocery store sushi, but no where close to being as good as Nobu or Tei Tei.  You get what you pay for.   Also, don't expect great personal service; this place is a quick sushi solution and operates like a fast food place in the sense that you order and pay upfront, have to get your own utensils, drinks, etc. and pick up your food."], ["kristy k.", "Edohana is the best value for great sushi in Irving/Las Colinas!  Always fresh and top quality, a great experience!"], ["Krystal G.", "I've been a repeat customer for years here and now when I walk in they know my order which always makes me feel special. For a fast sushi restaurant this is your go to! It has the same prices as Kroger but has better options and tastes fresher. I try not to eat rice so I typically get the riceless French Kiss. It's made with all fish and \"crab\" and I promise it taste so good. It's packed with many flavors and you don't even realize you're missing rice. Their Miso soup is yummy as well but be careful bc it's always extremely hot. I recently tried the Uptown roll and I'm a fan! The crunchy shrimp roll is cheap and taste good if you want something less healthy but more filling. They have to-go parking spots which are convenient since I call my order in ahead of time and just scoop in to pick it up. I will definitely be returning! I love this place :)"], ["Stefanie C.", "Average sushi for a decent price. Don't expect to get Nobu quality but its definitely not plastic rubber pieces. The portions aren't huge but they are filling enough. Lets be honest, everyone is hungry 30 minutes later after eating sushi so it doesn't really matter how much you eat. Its in a convenient location in west village and great if you're in a hurry to grab lunch or dinner. The bento box and the tuna tower are definitely my go-to's here."], ["Kiran M.", "So the food isn't 5 star or anything. But the sushi is great, the bowls aren't bad and the service is friendly. Very relaxed chill spot to grab a nice quiet dinner with friends or to quickly grab take out. I just wish they had more veggie's to add to their rice bowls to make it a more healthy meal! Very clean and good location with parking right around back."], ["Christina M.", "Great food at a great price. I recommend the Geisha Roll and the TCU Kiss! Fast service, and a great place to order to-go from."], ["Mike L.", "Looking for some place quick and easy, we stopped in just before the place opened for dinner. The staff was nice enough to let us come in before they had offically opened, which gave us plenty of time to look over the menu. Ordered a sushi sampler and a chicken teriyaki bowl. Both were made fresh, however the chicken was rather plain and slightly dry. Nothing to complain about, but not as savory as I hoped. Meals are served on stylish styrofoam plates, making you feel more guilty about throwing them away. Drinks are bottled water, soda or tea. Overall a decent experience and a quick and easy way to get a meal."], ["Veronica J.", "This is a good fast food sushi spot. The prices are great, the food is tasty and they are fast. It's a great place to grab a bite and it won't break the bank.  The portions aren't that big so you pretty much have to get more than one roll"], ["Brian T.", "Wow, super good fresh fish and great prices. I had a roll (don't remember the name) with white tuna, shrimp and ponzu. I also had a spicy shrimp role that was pretty good. All in all good prices, fresh fish and friendly service couldn't ask for much more"], ["Renee C.", "Yay! I have found another cheap, affordable counter-service Japanese restaurant to eat at! The place was very clean and chill. Perfect place to hang around for casual eating in uptown.Sushi is one of my most favorite things to eat, therefore I'll be a tough critic on this one. Edohana did not satisfy my taste buds, nor my eyes. I ordered the shrimp tempra roll, which had tempura crumbs on top. The consistency was stale and chewy, not crunchy. It probably was like that because I arrived there an hour before they closed that they didn't want to make a new batch. It seemed like the tempura crumbs were left sitting for hours. The appearance of the food was done sloppily, and I wish I had a photo to show. I also ordered the vegetable tempura, which was just like any other vegetable tempura anywhere else. Not sure if I want to come here again. My experience at Tampopo was better."], ["Kevin T.", "I expected a no-frills inexpensive sushi experience, but I have to say the quality of the food is still just marginal - not the most comforting thought when one decides to indulge in raw fish. The flavor of the fish and seaweed salad was flat and unremarkable and the texture of both suggested better \"grocery store\" sushi. It is inexpensive, but the environment of \"cheap diner\" bland with self-service just makes it feel cheaper and less-appealing than it should even at this price point."], ["Emily A.", "I've came here a few times because I work over here. Every time its under 10 for a lot and always enjoyable."]], "Sushi Bayashi at Trinity Groves": [["Andrew A.", "Atmosphere: very nice.  Great place to take a date quiet and can be romantic. Food : no complaints,  tried the sushi rolls, ramen, and tuna dumplings with a Japanese beer and wineCustomer service: staff was very friendlyGreat experience"], ["Lindy C.", "The tonkotsu Ramen here is disgusting. I hate to say it but I took a sip of the broth as customary before you take a bite and it didn't have any trace or flavor. I caveat this with I came with a group of 14 people about 4 hours before closing time so maybe they didn't have enough Ramen and added a lot of water. The interior of the restaurant is cute though. Wooden tables and backless seats in a very open concept. Don't miss the large chalkboard across the back wall with various menu items that you won't find in the printed menu. The service was okay here. Initially our waitress came by swiftly with water before taking our drink and appetizer order as more members of our party arrived. However she was not to be found when we finished our appetizers and drinks became empty. I had to wave a different staff member over who I asked to have our main entrees ordered. His respond was \"oh I'll get another person to take it, I really just walk around.\" Well what a helpful person that guy was. I don't intend to be mean but I'm a person in a restaurant trying to get the attention of a staff member, what could I possibly need? I mean it's not rocket science that I may need assistance with a food item of sorts. Also, a woman who I believed to be a manager came by, she poured my friends beer into his glass and then poured the remaining beer into another person's glass. Uh I know we are all friends but I don't think her just doing that is appropriate. My friend probably wanted to drink his entire beer by himself. My recommendation, skip this."], ["Ignacio L.", "Terrible taste. I should start by saying I'm a sushi fanatic/snob and went in expecting great food. What we got was \"interesting\". My date and I walked in around 10:00 pm for a snack. We ordered the $19 Dynamite Crawfish roll on the waitresses recommendation. It's a large roll and we really tried to like it. It LOOKS nice but in the end it tasted terrible. The fried popcorn crawfish was over-fried to the point of being chewy. The temperature of the crab layer that lays on top of the sushi pieces was both hot and cold in spots that speaks to a lack of attention to detail. The mixture of flavors were \"interesting\" pairings and the fish in the underlying roll was \"on the edge\".Neither my date nor I could eat the roll it was so bad. We left more than 80% of it on the plate. I told the waitress we really didn't like it. She walked back and rang up the bill anyway. As she walked back she turned around and consulted with another lady who looked to be the manager, they conferred a bit and then she gestured to still deliver the bill.If you are the kind of person who can be excited just because you are \"eating sushi\" then this is your spot. If you expect your sushi to actually taste OMG good and have great service then I would never recommend this place. Lastly, if a customer orders one item that the waitress recommended, informs the management that they really can't enjoy/eat it and the customer is charged anyway? That's pretty damned sketchy service and management. I will never return. Shame on you Sushi Bayashi."], ["Chris E.", "Lots of good things are happening here--we had very friendly service on a mostly uncrowded Monday evening on the patio. Great time to go!Sake was $6 on Happy Hour and our server allowed us to sample a couple before choosing and they were really good!Here's why the 5 stars--About 15 years ago I had an extended stay in Japan and learned to really like this chain of diners they have there called Coco Ichibanya where they served an awesome katsu curry--a breaded, fried pork cutlet half smothered in their brown curry sauce (w/a side of rice) and you can dial it up to however hot/spicy you'd like it according to their 1-10 scale. I could barely get past a 6 and I love spicy food!Upon returning to the States, I've had a 15-year Dallas-based odyssey of trying to find katsu curry. For the first several years there was nothing, and then \"Foodies\" exploded and finally in recent years the dish has made some appearances in the Metroplex. None of them were exactly like the Japanese Coco version--until now!!I'm tellin' ya, this was exactly what I've searched for all these years. The pork tasted and crunched correctly and was half-covered in the exact brown curry sauce I needed, and even included the red pickled radishes or whatever that Coco's had in the middle of the white rice.The only thing it lacked was an option to make it spicy. When I return and have the dish again, I'll be bringing my secret container of HOT to sprinkle on. Then the circle will be complete..."], ["Jay H.", "Trinity Groves continues to bloom. Trendy restaurants continue to pop up...some hit, and some miss. The location seems to give you that advantage to succeed though. As long as you have good food, the crowds are there. Sushi Bayashi is in the right location, and based on my experience, they will definitely succeed.My sister was in town, so I wanted to take her someplace nice on her last night here. The great part about the strip of restaurants in Trinity Groves is the variety of cuisines in one spot. Just walk up, and take your pick of the type of food that you'd like. The thought of sushi and ramen enticed us, so Sushi Bayashi was the decision.It was a Sunday night, so the TG area wasn't as packed as it would have been the previous night. We just left the Cowboys game, so the absence of a crowd was something I was looking forward to. We were starving, so once seated all of our heads immediately went to the menu. Here's a tip, right above the sushi bar, there's a HUGE board loaded with specials for the day that aren't in the menu...be sure to take a look up there as well. I really wanted noodles, but I noticed a interesting roll on the menu as well. Why not get both? Don't mind if I do! (Typing to myself while doing this review is weird) I forgot the name of the roll that I ordered, but it consisted of asparagus inside the roll, and it was topped with slices of eggplant. It was legit. Most of the time when you get a veggie roll, it is either cucumber or avocado. I love to see the creativity and great flavor in rolls like this. The eggplant had almost a eel-like look to it. Very well done! I also ordered the Miso Ramen. I asked them to leave out the ground chicken and the egg which was not a problem for them to do. The broth was very flavorful and the ingredients were fresh. The combination of the miso and the sweet corn was great. The noodles were decent. There was nothing wrong with them, but they didn't live up to the level that the broth was on. Very good dish. My sister and my fiance ordered a few rolls too which they thoroughly enjoyed. Everyone was satisfied.The next time you wander down the long aisle of restaurants in Trinity Groves, stop by Sushi Bayashi and give it a try if you haven't already. I'm definitely going back!"], ["Amy T.", "The Trinity Groves area is a perfect place to go if you aren't sure what you're in the mood for.  Sushi Bayashi is a great option.  I really like the long wooden tables and the large chalkboard with menu options on it.  The service overall was exceptional and they made sure that we were satisfied several times.  I had the tonkotsu ramen and I thought it was alright.  It certainly wasn't memorable to me.  The portions are huge so you definitely get your moneys worth."], ["Tuvy P.", "Trinity groves is a growing area with a LOT of potential. Sushi bayashi lucked out in the location because i honestly think that's what's keeping the business alive. I feel horrible for saying that but as many chances as I wanted to give it, it failed me each time! Octopus croquettes, eh. Comes with a dipping sauce that was pretty good but the croquette in itself I didn't care for. The tonkotsu ramen we ordered tasted horribly... Not that it was disgusting and inedible type of horrible but when you dive deep into the DFW for legit ramen and then you come here for ramen, you'll be disappointed by mainly their broth which tastes like powdered ramen broth mixed with water. The noodles didn't impress me either. I feel bad for comparing their ramen to growing ramen restaurants in the DFW since their restaurant does not focus mainly on serving ramen but for a sushi restaurant in trinity groves I kind of expected a little more than powdered ramen broth =\\ also, the chili oil that comes separately from the ramen bowl had absolutely no taste to it. It was literally red flavorless oil.Service was okay. It was completely dead when we were there. It was us plus one other couple with a baby. It was so dead it felt a little awkward in that the chefs and hostess were kind of just staring around... Doooooo doooo dooooo.... La la La... LolI forgot to mention their overly extensive chalkboard menu (in addition to a smaller hand out menu). It's huge... Seemed like they had a lot to offer when it came to appetizers, sushi, sashimi...we didn't get to try either of them but given my experience, I don't have future plans to come back. Sounds unfair but after reading other yelpers' opinions.. I'm not really convinced!"], ["Walt M.", "I love this place partly because Yuki will make my old favorites from Sushi on McKinney. (That's where two of my buddies each took their second wives for their first dates.) (I took several potential wives there but landed with just one. And she loves the place too.)The \"cup\" sake  - little cans are really cool servings. Only six bucks each at happy hour. Incidentally 16 ounce Asahi  extra dry beers are only four dollars at happy hour. One of the best things here also comes free when you order sashimi. It's the fresh wasabi relish called kizami. Yes the real wasabi folks.This is going to be a great place to sponsor my daughter's 18th birthday party."], ["Grace S.", "I've eaten here for both lunch and dinner. Lunch was a bento-box type meal with some tempura, agedashi tofu, soup, and other items.  The soup was way too salty and the rest were decent. Average meal, all in all.Dinner was a better experience, with a hiccup or two. My friends and I wanted to enjoy the weather and sat outside, but the regular menu is somewhat limited and the specials menu (which seems to be the menu to order from) was written on a giant chalkboard inside.  Thanks to modern technology, I was able to take photos of the menu on my phone and use the photos to order from while enjoying the patio.  Now on to the food . . . .Among the items we shared were some sashimi pieces, natto with tuna sashimi, chicken gizzards, the hamachi kama (yellowtail collar), and chanpon ramen noodles.  None of the items blew my mind, but they were all enjoyable.  One note though -- the natto, which is fermented soybeans with sashimi, isn't for everyone.  I grew up in a Korean household and am used to stinky fermented soybeans, but I didn't love this dish.  I found it a little bland, in fact.  Other in my party, however, claimed this was their favorite dish of the night.  Go figure.    I can't say I love Sushi Bayashi, but I'm glad for the sushi option in Trinity Groves.  And I would come back here if I were in the mood for some Japanese food in a fun patio setting."], ["Sharde A.", "If you are expecting specialty sushi rolls covered in sauce and triple fried in tempura batter, this is NOT the place for you.  Let me reiterate: if you love sushi because of the taste of seafood and not the sauces that drown popular westernized rolls, this is the place to go.  You even get Japanese classics like inari and futomaki.I was a bit wary with the communal seating they have setup because I ignorantly believe the people of Dallas really like their personal space.  I like the seating arrangement though and it does make it easier to eavesdrop on the drama that inflicts other first world people.  You can sit at the bar if you wish to not be judged.The kabocha (stewed Japanese pumpkin) is extremely good and comforting.  I love things that are sweet and savory and their kabocha was perfect!  I could have just ordered that with a side of rice if I really wanted to throw down.  It does need something a bit bland to pair with because it has a lot of flavor. I tried their Chanpon, this huge bowl of noodles and seafood, and it really reminded me of saimin.  Another comfort food item for me here at Sushi Bayashi!  It had slices of fishcake in it too and was loaded with noodles.  It could have fed at least three people in total.The tuna sashimi was fair as well and I'm so glad they had futomaki.  Unfortunately it had a piece of avocado in it, but it wasn't enough to make me gag.  I love how they have house made soy sauce too and fresh wasabi as an option.  The sushi in general though is just average, which may be the reason why the prices are so affordable.If I haven't convinced you yet with their cheap sushi and delicious Japanese pumpkin, come here and get a bottle of $15 wine for your cheap date.  Seriously, just don't let her look at the check.  She will think you took her to a fancy place in Trinity Groves when it's actually the most reasonably priced restaurant there ;)"], ["Trinh T.", "Sushi Bayashi at Trinity Groves is the latest addition to Trinity Groves.  A true Japanese restaurant, Bayashi serves up quality \"Tokyo style\" eats, including quality sushi & ramen.  Another bonus is the prices are pretty good, as most TG restaurants are a little higher in price.My Overall Rating - 4 Stars (Atmosphere, Service, Food, Return)Atmosphere - Sushi Bayashi has a really cool feel.  Inside you'll find long, communal tables & a large chalk board in the back with the menu.   Additional cool touches include Japanese banners hanging from above and large containers on the side.  It has a really unique, open feel and when combined with good weather, it is extended into the patio.  1 Star.Service - Our server was nice & attentive.  We went opening week and while general service was good, I would have liked to have known more about the menu & concept.  But like I said, general service is fine, I just think there was a lost opportunity to differentiate.   1/2 Star.Food - The one thing that drew us to Sushi Bayashi was the fact they served ramen.  The good news is the Tonkatsu Ramen had a nice, flavorful broth.  The ramen was soft and pork & egg were great additions.  I wish I could have ordered extra items to add a la cart like at Tei-An, but it was a quality bowl.  The hamachi kama was also a favorite, with lemon pepper brushed on top and grilled Hamachi.  You can also order freshly grated wasabi.  For dessert we went with the fried udon, which was like eating a chewy funnel cake (this is a good thing).  We finished with ice cream wafers which ended our unique meal.  1  1/2 Stars.Will I Return? - Yes.  Not only is Sushi Bayashi a nice addition to Trinity Groves, it's a great Japanese restaurant for Dallas.  I will come back for the atmosphere, fried udon, and quality ramen.  Another great option for TG!My Yelp Rating Scale (Sum of all parts):1 Star - Atmosphere - Is it a cool dive?  Perhaps an upscale place?  No matter the type, atmosphere plays a big part and I'll give a star if I like it or thinks it has great charm.1 Star - Service - You can have a great meal with bad service.  But that's also what can make a five star joint drop to four.  It's important to the dining experience that service is great and on point.2 Stars - Food - I'll award up to two stars for the food, since this is the main reason we dine out.  Sometimes the extra star is given for value, but it's really all about the food.1 Star - Will I come back? - If I know for a fact I'll return, I'll give this a star. A place has to make an impression for me to return. Each Category can be given up to 1 star except food (2 stars) because I consider all these categories important to the overall dining experience.  I will sum them up to provide my final Yelp score."], ["Grace S.", "Delicious ramen! Ate here with the boyfriend one night and was pleasantly surprised. So good we came back a few nights later. The broth is milky and flavorful, the noodles cooked al dente, the meat cooked to perfection, and the sprouts are a delightful new twist. Apps are good too. Wish they had more skewer dishes. Agedashi tofu, baby octupus, uni nigiri, and gizzards are some of our favorites from what we've sampled.  Sushi not as fresh as Teppo or tei an but, eh, I come for the ramen! We'll be back more to stuff our faces. It's good stuff. Also, communal sitting is a bit awkward for some people but here they have a red divider. That privatizes your space some. And with the noise level. You still have plenty of elbow room too. They carry a good selection of Asian beers."], ["Leah S.", "Dinner here was okay but I probably wouldn't go back. We ordered 2 appetizers and the waitress came back around 20 minutes later and said they didn't have pork for the pork gyoza so they could substitute. We said that was fine, but what She didn't tell us was that our food was already on the way out, so we got our appetizer half way through our meal. The food all came out at different times, my father got some of his sushi probably 30 minutes before I got mine. If the food was worth the wait it would be fine, but it was just okay. Not good, not bad, but definitely not worth being so expensive. I won't be back."], ["Emily H.", "Another place in Dallas that serves legit tonkotsu ramen! (The other place is at Tei-An.)  We found out about Sushi Bayashi from the Urban Daddy website; turns out they just opened this past Tuesday. There's a good balance of items on the menu between appetizers to share, curry bowls, and noodle dishes. There's also a separate sushi sheet with your standard nigiri pieces and usual Japanese rolls. The ambiance is very Trinity Grove-esque with modern decor, shared tables, and an outdoor patio. Although there weren't any people standing, it looks like there's even a raised table area next to the wall where you could potentially stand and eat (sort of like the standing ramen places in Japan's subways). Our favorite dishes: Tonkotsu Ramen: The broth is very authentic, full of flavor, and hearty. The noodles are silky, thin, and with the right amount of bite. The pork belly melts in your mouth. The only comments I would have are less bean sprouts and the broth served hotter. Otherwise, this was my favorite dish of the night.Octopus Croquettes: This is an American adaptation of the takoyaki. Instead of round puffs, these are flat like...croquettes. There's a good amount of octopus chunks and a nice punch of ginger taste (which I love). Definitely made in house with very fresh ingredients.Sweet Age Udon: This was a dessert that tasted like funnel cake, except that it is fried udon noodles, topped with powdered sugar and served with a thick honey syrup. YUM! A little too much fried stuff for two people to split -- probably better split between 3-4 people.We also ordered the hamachi kama (well seasoned, but could use a bit more crispiness) and the chanpon noodle (also good, but preferred the tonkotsu ramen more). Being in Trinity Groves, you'd expect your meal to cost a fortune, but everything is very affordable. Most appetizers are $5-8, the noodle dishes were $10-12, and dessert was $4. Service was also extremely friendly and helpful. We'll be back!!"], ["Judy T.", "Hands down, the best sushi I've had in awhile. For those who don't know what it takes to have impeccable sushi, this is the place to go. (Meaning you'll get a tightly wrapped seaweed roll with flavorful fish!) A tip, whenever eating sushi, don't overpower the roll with soy sauce. However, they do have a good house soy sauce that they make! I suggest the Gizzard as starters. Meal wise, get the Negi Hama \"hamachi\" roll and the Negi Toro Taku roll! You can't go wrong with those two. The simplicity of the menu give this restaurant the opportunity to really display their quality of food. As for sake, I loved the Kurosawa! perfect if you're wanting something smooth and delightful. I will be back, definitely.Oh and service was also great!"], ["Jeff Z.", "1st time here. Food is very good!... To my surprise. Ramen broth is excellent! Very authentic! Sushi selection is a bit narrow but fresh. Uni was sold out & they didn't have Aji(Spanish mackerel). But the Japanese mackerel sashimi was perfect. Tried monkfish liver, also very flavorful! Definitely will be back. Our waitress is nice but seem to be forgetful."], ["Shariq H.", "I had pretty high hopes for this this place and some of them were met, some of them weren't. 50/50 we'll say.I'm a big admirer of sushi, but I think my mistake was in assuming that this was a primarily sushi restaurant. It's a Japanese restaurant that has sushi. But I made my mistake and ordered only sushi. The sushi was good and priced regularly but there was nothing ecstatic about it. The portions were fair and the quality was high but the options were limited. Looking at the food menu, there wasn't really that much to go off of either. I should have probably ordered from the huge chalkboard that had a bunch of specials on it but it went largely ignored cause no one brought our attention to it and by the time we noticed, we had already ordered. The service was quick though and the seating arrangement was awesome! It felt like a good mix between modern and traditional so it made the meal pleasurable. I'll come back here to try some of the other options out soon I'm sure. Maybe the blackboard holds all the answers?"], ["Justine G.", "hands down! delicious ramen in town one bowl is good for sharing already! i love their fried chicken gizzard too. the atmosphere is very authentic and relaxing. service is ok not too bad!"], ["Chris C.", "Let me say that I could give this place 2 more stars if only there weren't a literal fly in my wife's miso broth.  Still reeling from the experience & we'll see how they're going to handle it.  Just got the bill.  They didn't charge us for the uni sushi.  Expected the manager (Asian dude, faux Japanese) to apologize profusely, as is the Asian way, but he left it instead to his server.  He even asked a weird question, 'did it only happen now?'  As if our modus operandi was ala Renfield going around w/ flypaper all the time.  Not going back.  There are more authentic Japanese restaurants out there.  They don't deserve my yen."], ["Southern H.", "The ramen was surprisingly incredible! We were pleasantly surprised with the amount of flavor and portion size compared to other ramen places we have visited in the area. And they have chairs! :) The shishito peppers and tonkotsu ramen were absolutely delicious. After having ramen in L.A., it's been a challenge trying to find local ramen nearly as good, but we have certainly found it here. Our server was very attentive, personable and informative. Loved everything! We will definitely return. Most likely this weekend."], ["Chelsea R.", "Their spicy ahi tuna tower is just a wonderful party that will dance in your mouth. If you get one take away from this review it should be to order that! Huge chunks of delicious tuna & all kinds of amazing sauces with lovely avocado. Mmmhm! Love their ponzu & the homemade soy sauce as well. Everything was so fresh & satisfying. Service could be better but the food is a check plus. Very basic sushi options & a few specialty rolls but for the most part they keep it simple which is just how I like it."], ["stella c.", "There's a fly on my soup, sushi bayashi and the manager didn't say anything about it Maybe I'll just post the grossiest bowl of soup ever online"], ["Kathy D.", "Was here last Saturday night for dinner and not sure what was going on but service was horrible. Let me clarify, our waiter was awesome, but aside from that, this place needs to work out their kinks.We ordered ramen and a wazen and it took 50 minutes to come out. 50 minutes for broth that should already be pre-made and some fish that requires NO cooking (sashimi). While observing other diners, I saw that the other waiters delivered food to the wrong table at least half a dozen times and somewhere around the 40 minute mark, I noticed that the tables next to us (2 tables) left before receiving their food. Ironically a new couple got seated next to us and about 15 minutes into their food wait the manager came out and apologized to them for the wait (hello, what about the people who waited 50 minutes)?Despite all of this, the food was a notch above decent. The spicy ramen was to date, the best ramen we have had in Dallas (that's not saying much). It is fairly priced at about $12. The sashimi wazen on the other hand is absolutely a steal. You get a variety and a TON of sashimi for $20 (also, a mini appetizer and soup)! The sashimi is fresh, but the sushi chef must be inconsistent as some slices were beautifully presented while others looked like a 5th grader carved them out in chunks. Either way, fresh is fresh, especially if fresh doesn't cost an arm and a leg :)  will hopefully give this place another chance, hopefully this time I won't have to starve to death before getting my food."], ["Tiffany Grace E.", "Love the ambiance and location & the styling and decor was wonderfully put together.  The music playlist was great, but was definitely NOT fitting for an Asian restaurant (jazz/20s music? I'm confused about what the vibe is supposed to be here...).  As far as the food, 1/3 of the menu was crossed off.  The crawfish on our crawfish dynamite roll was extremely fishy and ramen was full of big sheets of nori, which we didn't really care for.  The only thing I really enjoyed was the tofu.  It was perfectly crispy on the outside and seasoned very well. Overall, average food & service.  Would not recommend unless you're in the area and extremely hungry and can't get a seat at the other restaurants in Trinity Groves."], ["Randy S.", "Like most of the other restaurants in Trinity Groves, this place has a nice ambience and is of course quite new.  A quick glance at the menu when I dined there showed that they tried to keep things to the basics more or less, with a few dishes thrown in there that are fairly unique.  You won't find a list of 20 robata items or things like that here (unless the menu has changed since I last went).I went with a large group of people and we were seated quickly and without issue.  Almost everyone ordered either the ramen or the katsu curry.  I figured I migiht as well try the fish so I ordered the wazen with a sweet potato dish as a side.  The sweet potato dish was tender and well seasoned while the slices of sashimi tasted fresh and wonderful.  Surveying my tablemates, a common complaint about the ramen was that it was too salty.  However, I can't vouch for that fact myself.Overall, another nice addition to the Trinity Groves area.  Not on my list of places to go to, but it offers some staple Japanese cuisine and gives you and your friends more options when frequenting the area."], ["Hubert D.", "I really wanted to like this place. The prices are reasonable. It has a cool and modern decor with a very open feel. It's community style seating with long tables. I don't mind that. It makes it feel more fun.Unfortunately, the food was really lacking. It reaaaallly misses the mark. For an appetizer, I got the braised pork belly. It looked truly juicy and tender, but once I got passed the outer layer of the large chunk of meat, I found out that it's pretty tough and dry on the inside. Sadness. :( I also had the tonkatsu ramen. It looked like bean sprout soup when it came out. So many bean sprouts! There was one piece of chashu pork, which wasn't too flavorful, and one soft boiled egg (non-marinated) that didn't add anything special to the dish. The noodles were plentiful and silky, but a little too much in terms of amount. The broth was good, but not good enough to elevate the rest of the dish. Sorry, but the two dishes I had just really missed the mark. I get that it's new and hopefully they'll work out the kinks. Maybe I should just try the sushi next time.On the plus side, the Asahi Black (my favorite beer) was only about $5!  Score! [  ] --- mark             x ---- sushi bayashi"], ["Lulu H.", "Well...let's see...the water was so salty that it ruined my palette for the food.What's that? Salty water? I'm gonna guess that someone either played a practical joke on co-workers or a disgruntled ex-employee got his just desserts on his way out the door. Our waters were like the kind of salted water your mom made you gargle with when you were a kid and had a sore throat. Like the water you accidentally swallowed when a wave knocked you over on the beach when you were 8.And the worst part was the waiter didn't believe us! So then we watched as he and the bar staff tried our water, all 6 of them, spat the salted water out and then looked into the water glasses with looks of horror. And then brought us normal water AND NEVER APOLOGIZED!!!! What is wrong with the service industry these days?  When we finally got to the food it was okay, but my taste was really thrown off from the water. The octopus croquettes and the Japanese eggplant rolls were my favorite, like quite good. The spicy tuna suffered from mushy rice and not enough tuna or spice, and the spicy salmon was made with lox. Which was not what I expected or how the roll was described.All in all...the sushi was not good enough to combat the jaded service or the ocean blast water."], ["Mary B.", "I love sushi, but I have a hard time finding sushi restaurants that I really like. Usually, I look for great quality fish at a reasonable price. There are sushi places in Dallas - and they are ok. There are some in Carrollton that are pretty good, but that's far away. I'm thrilled about Sushi Bayashi! I can't believe that there is a sushi restaurant so awesome that is so close to my home!I had the Wazen, the Uni, and the peach sparkling sake. I haven't had sparkling sake in a long time (I had it all the time in San Francisco same with sushi). So having a little bottle of that made my night. As did the Uni - super fresh! Same with the seaweed wrap, wasabi and ginger. Great fresh flavors! The Wazen was absolutely incredible! The fish tasted amazing and melted like butter in my mouth. The squash appetizer was addictive - I want to come back for more! I loved the sweetness. The tempura was light and fresh and the batter/fry didn't overpower the veggies or shrimp - just complemented them nicely. And the soup was light and flavorful.They had this monkfish pate special that I wish I had room to try - I was too full. I regret not getting some to go! Same with some of the other items on the chalkboard. It makes me want to go back and check out what else they have!That was an awesome, memorable dinner. I'm already looking at my schedule to figure out when I can go back!!"], ["Raymond O.", "This may favorite watering hole for sake. You seriously can't beat their selection and price. If you're not sure what type of sake you like, definitely ask Ricky the GM for some advise. The staff is friendly the head chef is always looking around and he sometimes checks up on familiar faces if he isn't busy. The food is like your usually neighborhood cafe, but with the japanese flare. The rolls are lightly dressed and seasoned. The fish is fresh and the specials sell out quick.  The menu is best looked at from a far point of view... meaning that the large chalk board you see is majority where you should order from. Always try a few of the special items. Again my favorite thing about Sushi Bayashi is the sake. Well priced and many options. Hats to Yuki, the head chef, because if you get to met him share a glass of sake cause he is an awesome guy. I got to mention Ricky and Felix, they know customer service and carefully chime in at the right time.Favorites: big bottle of Chobei, the futomaki roll, ramen and any special fish on the board."], ["Chris G.", "I'm sorry i don't want to put a bad review but the ramen soup was awful I know a paid in the end but the noodles looked like the ones you buy at the grocery store. The broth itself wasn't all that good either. Won't be going back."], ["Nhi H.", "The Hubs came back from a work trip tonight and suggested we go to Sushi Bayashi because he was craving ramen. I had warned him this may be a bad idea since he just got back from NYC and had some bomb ass ramen from Totto Ramen, Dallas ramen probably won't live up to that. He wanted to give it a try anyway so off we went.I love the area. It's connected to other restaurant patios. Cool, minimalistic atmosphere. Long, communal tables, which look great, but not sure how I'd really feel had I had to sit by random strangers that could listen into my conversations. Tonight, we got the Hamachi Kama as an appetizer. Soft, flaky fish and dipped in a light sauce. Two thumbs up. Kinda wish it had a little side of grated daikon like other sushi restaurants. We also ordered the Fresh Salmon Sashimi and Uni Sashimi. Everything was really fresh and oh so satisfying. So up to this point, I was loving this place. This is where it went wrong. Hubs ordered the Tonkatsu ramen, and I got the Tan Tan Ramen. Presentation was great, but damn!! That shit was salllltyyyyy. We barely ate half of it and couldn't go on. I was drinking water after every spoonful to dilute the saltiness. My ramen had this weird taste to it, as well. This has to have been the saltiness ramen I've had to date. It could have been an off day, but I won't chance it. I would come back for the sashimi but definitely not the ramen."], ["Louise S.", "Four and a half stars for this new sushi place in Trinity groves.  Dallas has an average sushi restaurant on almost every corner so it is hard for me to venture into new sushi places as the majority are just so so.  Therefore I stick to my favorites (tei-an or sushi sake) and easily miss new gems like this one. A friend,  whose opinions I totally trust,  recommended it so this weekend we were down trinity groves area so decided to give it a try. To begin with all the restaurants were buzzing with Sunday brunch and this one looked very left out. .. almost empty. The interior is lovely. Big wooden communal tables and decorated in a more authentic Japanese style than some of the trendier places. The food is not the typical Dallas attempt at Sushi either.  No aggie rolls or longhorn rolls. . Or whatever other name they decide will attract eaters. This place has some legit Japanese fare.  We did order some rolls (very fresh and very good )We also ordered the ramen (chanpon) and the pork katsu curry both of which are very traditional Japanese foods and both were wonderful. The katsu curry was a wonderful meaty curry (very mild if you don't think you like curry) and had a soft boiled egg in the broth. Perfect. If you want real Japanese staples this is an awesome spot!"], ["Lorenzo D.", "SolidJust updated to 5 stars.(from 4, below in original review).. last 2 visits the service has been much better. Also had a chance to sample more from the menu.  This place is good.  Very happy to have this place nearby!Been here a few times.  Quality of the fish in Sashimi and Sushi is top notch.  Also, importantly, is the cut of the fish, which has also impressed me.The gyoza are hand rolled here and pan fried/steamed perfectly to crispy on one side, soft on the other, as a good dumpling should be. The flavor is subtle, and the dipping sauce is subdued.The tofu app is quite good.  Nice coating of panko, not too thick or greasy.  Subtle flavor and good texture. Nice treatment of shitaake in the accompanying broth.Update:  This is my favorite dish here.  And I'm not like a tofu freak, but this is so elegant, simple and delicious, I'm hooked!Tataki (tuna) was seared nicely; the selection of vegetables and quantity/quality are fine but uninspiring.I enjoyed the presentation of sashimi, rolled up and placed atop leaves in large bowls of crushed ice.  Very fresh and well handled halibut on last visit.Have only sat outside so far, as it has been really cold inside, and outside offers some decent people watching.Why not 5 stars?Service is spotty at best, and has been confused each visit.  Wine selection is an after thought.  I understand they are going for authenticity... However, I much prefer wine to sake.  Additionally, nothing here so far has said \"Wow!\" that is Goooood!!!I'll be back for sure.  I'm hoping this will eventually be a really good spot.Kanpai!"], ["Ann L.", "Came in on a rainy day with my sister and daughter. We were super excited the moment we went in!The place itself looks amazing. Long tables that can be seated for a small party or a big party! They have a red divider to separate the parties, which is awesome and a good idea. Sushi bar is at the back of the restaurant, with a chalkboard above that shows the menu, plus the special menu behind. I can see their patio being used for sunny days. The food, however, was lacking in some ways. The spicy tuna was amazing, something my sister and I would expect. When the spicy salmon came out, we were slightly disappointed to see the spicy mayo was just squirted inside, not mixed like the spicy tuna. My daughter had the chicken katsu curry, which is a HUGE portion for $10! It was delicious, chicken was tender. Baby octopus skewers were delicious as well, lovely presentation. Tempura appetizer had that amazing crisp and was loaded with a variety of vegetables with two pieces of shrimp. The main event was the tonkotsu ramen, something we were most excited to try. However, it wasn't anything we expected. The broth was dark, not the white or lighter broth we were used to. Noodles were good, but it was leaning a bit more to the mushy side. I love the pork belly and the eggs, however. Bean sprouts were a nice touch. Service was great. Servers kept refilling our waters and making sure we were doing alright. However, some were not as knowledgable with the menu. One was confused as to where I got the baby octopus skewers when ordering (it was on the specials board behind the sushi bar)."], ["Ruina W.", "Went there for the first time last night, staff was friendly, food was awesome, decors are cute, I loved it. Tried the chicken gizzard, it was surprisingly tasty! Baby octopus, awesome! Ramen and sushi are decent, curry was really good.BTW, if you enter the address on your Apple Map it will take you to downtown, which is what I did, the restaurant is located in Trinity Grove, use your Google Maps instead!"], ["Leon T.", "Quality sushi at affordable price.  Rare for this area."], ["Michael M.", "Great sushi and good service.  They have a very nice outdoor seating area when the weather is nice. I will definitely be back for more to try everything in their extensive menu."], ["Carmela F.", "Was in Texas for a week for work.  Googled top restaurants in Dallas. . . Drove 30 minutes and it was totally worth it! A must if you are in or near Dallas. I was alone so I sat at the bar. The sushi was delicious, melts in your mouth good and the uni was sweet with the perfect briny flavor. Also had the chicken gizzards, deep fried nice crispy outside served with a lemon wedge and a side of what I think was paprika and other spices. Servers were friendly and food came out  fast but it was Thursday night so I was lucky. Can't wait till my next visit! Will be back for sure. Keep up the good work!!! They only reason I'm giving it 4 and not 5 is because the bar seats are low and you can't really see the sushi chefs."], ["Tina L.", "It was my first time in the Trinity Groves area. The area is really cute, it's a strip with restaurants around. When I walked inside Sushi Bayashi, I was amazed at how cute it looked, the decor and wooden chairs and tables were unique. I love it!! My boyfriend and I tried the chicken gizzard appetizer, which tasted like calamari, it was really good. For our entree, we got spicy Tonkatsu ramen, it was really flavorful and the portions were huge. Normally at other ramen places I can kinda finish it, but here I couldn't, even my boyfriend couldn't and that says a lot! So you definitely get your money's worth here. I really enjoyed the atmosphere and food here, I will definitely come back to try the sushi and other foods."], ["Andy Y.", "Well shoot I was hoping for better. We came through on a Saturday at lunchtime. Lots of people out on the patio at Trinity Groves. Beautiful interior and outdoor seating. We ordered some sushi and ramen. Sadly, it was not that tasty. The broth is so important to me for tasty ramen and it was not fatty and flavorful but just kinda halfway seasoned. Also, not served hot. The noodles were okay and for sure it was edible (unlike tanoshii) but just a mediocre product. To me, this was another example of trinity groves restaurants being kind of promising and interesting in theory, but lacking in the execution of the actual food (exception is casa rubia). At least it looked pretty!"]], "Uchi": [["Emily S.", "We have been to Uchiko in Austin and were thrilled when we found out that Uchi would be coming to Dallas. We got a reservation for opening night and were not disappointed! Everything from the service, to the decor, all the way to the food quality and presentation was perfection. The food was INCREDIBLE! We went with a big group and just tried a bit of everything. If you are not an experienced sushi eater - definitely get the Shag Roll, you wont be disappointed! The brussel sprouts are a must and a nice thing to share. Tuna with watermelon was interesting but really refreshing and tasty. The sushi was fresh, great cuts, and the rice was cooked to perfection. If you have never tried scallop sushi before, I would definitely recommend the dayboat scallop daily special. It just melts in your mouth and is delicious (and is worth the pricey $8/piece price tag). Definitely save room for dessert. We got the fried milk (a must) and the peanut butter semifreddo (personal fave but you must like peanut butter). If you are not looking to drop a lot of money on dinner their \"Sake Social\" or HH is awesome! It is from 5-6:30 pm daily and includes many things off their menu for great prices (around $6-$8 per selection). They have a nice variety of makimono (rolls), tastings, and sometimes have a dessert. They also have $3 Kirin Drafts and Sake.If you are looking for an interesting and different sushi restaurant - this is definitely your place! They have something for literally everyone:)"], ["Mindi A.", "Ok, so we did it right this time. Went early, and stuck to the happy hour menu (just ordered everything that sounded good) plus that fried chicken thing and some fois nigiri off the regular menu. It was plenty of food (didn't have room for dessert), 1/2 the price of the chef tasting menu, and everything was delicious. Definitely the way to go."], ["David L.", "Food - 4Service - 5Value - 4We came here with some friends tonight (we had no reservations but arrived shortly after 5 PM and were able to be seated without any wait).  There were a few real winners with the dishes, but most were just \"good but not great\".  Since we got there early they still had their happy hour specials and we ordered from there the following:zero sen roll (yellowtail, shallot, cilantro, avocado)machi cure (smoked baby yellowtail, yucca crisp, marcona, almond)bacon otoshi (pork belly, kimchi, onion, jalapeño)hotate cure (cured scallop, ramp herbs)walu walu (oak-grilled escolar,candied citrus, yuzu, ponmyoga)The above were all quite good and I'd rate all of the above a \"5\" with the exception of the walu walu which I'd rate at a 4.We then got the \"age gyo (whole fishcoconut, sticky rice, shishito, chimichurri) from the daily specials and it was quite good and I'd rate at a 5 as well.We were actually mildly disappointed at the last two dishes though which we ordered from the regular menu:duck nabe - their take on a bibimbap of sorts, but I wasn't a huge fan of the sauce and overall it didn't seem like anything special -- I'd rate this as a 3 and would not order it again the next time we come here.brussels sprouts - we felt the sauce was too heavy and the brussel sprouts didn't have as much crispness as I would have liked -- I'd also rate this as a 3 and would not order it again the next time we come here.  The service here was great though."], ["Puneet G.", "Excellent service, great location, very lively on a Friday night. As everywhere else in Dallas, there is Valet service. We had to wait for 15 mins for the table, so started off with sake at the wine bar. There is an outdoors patio as well.We went with our servers recommendations, which were on the point. The portions are conservative and meant to be shared. Every preparation was amazing - few things which I loved: Pork belly roll, Zero sen sushi, kamo ta nashi, brussel sprouts, Fried milk (desert).  The damage was 160$ for two of us with drinks.Tips: Make reservations in advance.          So far the best sushi joint in the Big DOverall: A++"], ["Amy D.", "3.5 stars but rounding up since the service was good. Super fresh sashimi and quality ingredients, but this wasn't the most amazing Japanese restaurant I've been to. However, I am spoiled by the places we have in the Bay Area. Ambiance wise, Uchi was great especially if you want to dine at a swanky place for a business meal and/or date night. I made reservations a week ahead of time for an early dinner (6:15pm for a party of three on a Thursday)- make sure you arrive on time since they will only hold your reservation for 15 minutes if you are running late. Reservations are a must since the restaurant is quite busy. Complimentary valet is available so you don't have to waste time looking for parking. We were sat once we arrived, and we ordered:Highly Recommended:-Hama Chili Baby Yellowtail (Ponzu, Thai Chili, Orange Supreme, $18.50, yelp.com/user_local_phot…): Yum- this was one of our favorite dishes. The hamachi was super fresh, and went well with the other ingredients. Highly recommended!-Social Hour Zero Sen (Yellowtail, Avocado, Shallot, Cilantro, Tobiko, Yuzu, $6, yelp.com/user_local_phot…): Our favorite roll out of the ones we tried, and the happy hour price is also a really good one.-Brussels Sprouts (Lemon Chili, $7, yelp.com/user_local_phot…): Delicious, and one of the best versions of brussels sprouts chips I've had in the while. These were super crispy and flavorful.-Karaage (Fried Marinated Chicken, Sansho Pepper, Seasonal Pickle, $10, yelp.com/user_local_phot…): So good, and this is a surprisingly filling dish since it's fried chicken pieces. I loved the flavor of the chicken, and how crispy the pieces were.-Shiki Tempura (Seasonal Selection, $8, yelp.com/user_local_phot…): Our selection consisted of turnips, eggplant, and onions, and all were really good. I loved how light but crispy the tempura was.Ok:-Gyutoro (72 Hour Short Rib, Asian Pear, Farm Greens, $26, yelp.com/user_local_phot…):-Hot Rock (Wagyu Beef, Ponzu, $16, yelp.com/user_local_phot…): The wagyu beef was good quality, and this dish was good, but they only give you a few small pieces. I'm not a huge fan of the hot rock thing so I wouldn't get this again. -Social Hour Spicy Crunchy Tuna (Bigeye Tuna, Avocado, Jalapeno, Cucumber, $6, yelp.com/user_local_phot…): Pretty good but nothing special. However, the happy hour price is really good. -Santa Barbara Uni/Sea Urchin ($9/1 Nigiri): Fresh and delicious, but nothing special. I wouldn't order this again here.Skip:-Bacon Otoshi Tasting (Pork Belly, Kimchi, Onion, Jalapeño, $6, yelp.com/user_local_phot…): The flavor wasn't bad, and I liked that this portion wasn't too big. However, the pork was overcooked and chewy, and there are better dishes to order over this.-California Roll (Krab, Avocado, Cucumber, $6): Eh, super disappointing- they didn't even mix mayo with the krab! This was really bland. -Fried Milk (Chocolate Milk, Toasted Milk, Iced Milk Sherbet, $9, yelp.com/user_local_phot…): I'm the outlier but I didn't like this for some reason. I didn't think the different components worked that well together, and I wouldn't get this again. Service was good and we didn't have to wonder when our server would come by to check in on us. It did take him a bit longer to stop by as it got later on in the night since the restaurant got busier and busier- it was still packed by the time we left around 8pm. Overall, there were some really good dishes and some not so great ones- they have an extensive menu so I would come back to try additional items. Parking isn't an issue since there is the complimentary valet- it took them less than 5 minutes to get our car when we left."], ["Elizabeth L.", "Went here on a rainy day. It was amazing! So many innovative ideas and bursts of flavor. The staff is what won it for me. I was hesitant of going just because of it's snazzy upscale location. The staff was very welcoming,friendly, sharp, and accommodating! They run a tight ship. Everyone was on their A game. Thanks so much for the magical sushi experience!"], ["Linda D.", "An absolute unique and creative menu of Japanese infused dishes.  Our group of 5 arrived at 5:05 ready to enjoy the happy hour.   I must admit I was highly disappointed to find only wine and sake to be served; not a full service bar.  We began to order bites from the menu and they promptly trickled in one by one. The lady that left the dish provided a detail of the ingredients which was nice since I would never be able to distinguish a dish just by its appearance. I surprisingly enjoyed every dish (except the plain-Jane spicy crunchy tuna). Each dish of HH bite was plenty for four ppl. My absolute favorite were the Brussels sprouts. I don't care much for this veggie, but the preparation of this dish was AMAZING that it trumped chips/queso, chips/salsa, fries or anything else addicting.  It's so good i could make this my meal and be happy. We had their bottle of house white wine, which was smooth-tasting. The servers, Mark and Jacob were very charismatic, prompt, informative and made the best recommendations on what to order. Not if, but when I go back, I will make sure I have them as my server."], ["Taylor D.", "One of a kind. The fish melts in your mouth! Uchi's Walu Walu was by far my favorite. The combination of texture, spice, and the presentation was to die for! I encourage everyone to sit at the bar if it's available. You get to speak with the sushi chefs and it makes for an even more enjoyable experience."], ["Robert H.", "Wow, just wow. It took me a while to go here despite the fact that I can basically walk there.There are some spectacular choices on the menu. I have never had a scallop I particularly enjoyed, but the dayboat scallop (name hatate I believe) on the specials menu is easily my favorite dish here. The flavors are so clean and crisp, I'm amazed at every bite.Another fan favorite is the hama chili, the tuna paired with orange provides an explosion of flavor and deserves an obvious second favorite place. Since the dayboat scallop is not alway available (it's a special after all) this is a good fall-back.I'm a big fan of brussel sprouts, if they are on the menu I will order them at ANY restaurant. So it's fair to say I've tasted quite a few wherever I've been. The brussel sprouts at Uchi are second to none, the flavor is just amazing and they are perfectly crispy. I will not go without ordering this as a side.Last but not least the fried chicken, fried chicken you say? Yes! The karaage here is absolutely fantastic. Crispy, flavorful and best of all no bones! Can't go wrong with that.The service from valet to hostess to wait staff was impeccable. Already excited for my next visit!"], ["Virginia K.", "Excited to try this restaurant since I've been to the sister restaurant in Austin. Came on a Saturday around 5:45 pm with a group of 4 and there was no wait! On top of that they had happy hour until 6:30 pm even though it was technically the weekend. We got to try so many different dishes, split two bottles of warm sake and had dessert! Minus one star for still being quite pricey ($200 for the table with tip). Highlights were the Brussels sprouts and the fois gras nigiri!!  Not sure if I would want to come back if it wasn't happy hour but all in all an excellent meal."], ["Lee L.", "DALLAS, TX: This place is UNBELIEVABLE!  Came here for a business dinner.  We got the double-tasting menu for me and three colleagues.  Cost about the same as two car payments and it would have been worth triple that!We tried about 15 sequential dishes.  If I were to come back tomorrow night with half the budget, here is what I'd order: the five-star offerings, in my opinion, so you can have the highlights:Foie Gras Sashimi: This was out of this world.Steak Dish: Don't know the official name, but it was marinated in nirvana for 72 hours before serving.  Ask your server for it; it was cut into little squares and fell apart in your mouth.  Definitely a highlight.Thai Chili Brussel Sprouts: These were so good we couldn't stop commenting on them.A \"Fire and Ice\" Fish of some kind; had orange and Thai spice.  Ask your server.Fried Sushi Roll with Squid ink miso.  Ask your server; it was amazing.Green Leaf \"chips and dip\"-like a fresh greens take on tortilla chips and salsaThat's what I would order and could die afterwards.  One of the best meals of my life!"], ["Brittany C.", "Wow! It is very rare to impress me from start to finish when it comes to finer dining. I tend to be quite the critic knowing I'm about to shell out plenty of $$$s to enjoy a good meal. The staff is incredibly knowledgeable, graceful, and kind. The atmosphere is chic, Dallas' finest have found a go to, it's clear... Everything we tried was so full of unique flavor which was very exciting and satisfying. Shag roll was bomb. Superb A5 steak on hot rock. I wish I could recall all of the names of the things we loved but the unfiltered saki has my mind a little clouded. Sero zen I think was the name of the phenomenal yellow tail roll. A yoki berry salmon sashimi type plate blew my mind.Happy hour here is incredible! $6 for 3-4 bite portions which is perfect when you want to try a little bit of everything. $3 cold saki served in a little box or hot saki served in the typical cylinder and small cup. We went here in celebration of our 3 year anniversary and it did not not disappoint a single bit. Reservations are tough to get so make them well ahead of time. What a lovely experience all around. I'd prefer this over nobu but perhaps that's because you can get out spending less and enjoying more 5 star Japanese. Will definitely be back very soon."], ["Noemi M.", "I loved our 1st experience!My boyfriend and I went for a late dinner date and I must say that it was by far the most creative sushi meal I have ever experienced. Our server seemed a little frazzled and nervous at 1st, but once we ordered wine and a starter, she started to offer up some great entree suggestions. I would say that it was a little loud too loud for a late dinner. It felt a little \"happy hour-ish\"."], ["Sally C.", "Another review where one struggles not to just repeat all the gushing praise for an exciting new place. We sat at the bar, service was excellent. Amazing sake list, good happy hour specials (this surprised me, they certainly didn't have to discount anything to pack people in). It's a nice space with a very contemporary vibe, including clubby music which I hated but he liked (pointing out it matches the overall youthful atmosphere). Sushi was exactly as expected-- hyper fresh, simple preparations, beautifully presented & amazing. Only last thought would be kids:  they don't belong near, around, on or at THE BAR. Please, pretty expensive sushi place-- make the damned kids sit in the dining room & leave some space in this world for adults only!!"], ["Carlton B.", "Stopped by after hearing many people speaking highly about this spot and have to admit, Uchi did not disappoint. There isn't much parking in the area but they do offer complimentary valet parking, which is nice, but drive only holds about 3 cars. Once inside the wait area is nice but kind of small. Staff makes up for it with small bites that seemed to come out every 10 mins and they were yummy!! I had the Nigori sake and it was great  cold sake with coconut flavors. Once seated the atmosphere was very nice. I ordered the Hot stock Wagyu beef and it was perfect!  Best friend had the crab sushi roll from the daily special menu, both were absolutely amazing! I ordered a side of the Brussels sprouts with the lemon chile sauce and they were the best ever. Lindsay was our server and very attentive and informative. This spot tends to get packed quickly so   U have been warned. For dessert I couldn't pass up the fried milk. Once again, it was on point!  Uchi reminded me of Nobu without the Nobu price!  Definitely will return soon."], ["Carolyn W.", "We just had a wonderful meal. Uchi is a beautiful restaurant with great service and delicious, inventive food. Mark was our wonderful waiter and recommended the perfect mix of dishes. We loved the salmon/ berry/ pear dish, the hot rock  beef and short ribs, several sushimi specials, tempura pumpkin ( sounds weird but so good) and fried milk for dessert. Thanks Mark- a great night out with my visiting son."], ["Edmund F.", "A solid 4 starsService: 5We came 10 minutes before it opened with a party of 8 for a friend's going away dinner.  We were seated almost immediately, service was polite, knowledgeable about the menu, and attentive without being overbearing.  Not sure how you can get better than thatAtmosphere/locale: 4Nice, open, and well lit with modern touches.  The sushi bar wraps around to provide guests a nice view of the sushi prep station. There only looked like there was one large table for 8 outside the party room (which requires an $800 table minimum for a reservation).  It may be difficult to  seat multiple groups of 8 or above without the party room.  If you do have a large group, I'd recommend coming early.  The place was nearly completely packed within the first 15 minutes.Food (Presentation): 5I had the 6 course signature tasting plus a number of other items both hot and cold.  Presentation for each dish was spectacular and there was great attention that went into plating.Food (taste/menu choice):4The menu is fresh with an upscale, contemporary take on Japanese cuisine. Though personally there were times I wish some of the offerings were more traditional.  Overall the food was pretty solid, but felt like there were a few misses.  As previously mentioned I had the 6 course tasting but one of the dishes didn't feel like it quite belonged.1st Course: Hama chilli: 4.5 starsThe sweetness and acidity of the mandarin oranges was a nice complement to the yellowtail sashimi which was the star of the dish, the jalepeno added a touch of heat on the back end2nd Course: Zero Sen roll: 3 starsWhile tasting light and refreshing, the cilantro in this roll was a touch overpowering which almost covered up everything else.  I love cilantro but a more delicate touch here would have been greatly appreciated3rd Course: Walu Walu: 4.5 starsThe grilled escolar had fantastic mouth feel without being overwhelming fatty.  Nice touches of citrus brought a nice balance of sweetness and acid4th Course: Sea bream and salmon belly nigiri: 4 starsThere are 2 pieces of each fish that are served after the 3rd and 5th courses.  Cuts were pretty generous, good flavor5th Course: Bacon steake: 3 starsI personally felt this dish felt out of place on the tasting menu.  While there was nothing wrong with the grilled pork belly, I didn't think it was as good as some of the first dishes.  Also since it was so rich and fatty, my palate was slightly overwhelmed when the second order of nigiri came in.  I would have greatly preferred either another roll or sashimi offering here.Extras before dessertGyutoro: 4.5 starsThe 72 hr short rib was nice and pink the center and was paired with a refreshing cilantro puree which made for well balanced bites Avocado nigiri: 3.5 starsI had this one from a recommendation from a friend.  Right, wrong, or indifferent, I honestly don't remember too much about this one.Spicy tuna roll: 4 starsComparable to other high end sushi establishments.  Good ratio of tuna to rice, not overwhelmingly spicy so you could still taste the fish.  Came with Uchi's own spicy sauce blend for a touch of uniqueness.Pitchfork (waygu beef roll topped with fried leeks): 3 starsPeople may disagree with me on this one, but I felt like there was too much stuff going on with this roll.  The fried leeks were tasty but I felt like they were a distraction from the beef, which should be the star.  A bit disappointed by this oneFoie nigiri: 5 starsWhile this may be my first review, 5 stars for food are going to be pretty coveted in my mind.  This one bite took me to my happy place in a hurry.  Rich, decadent, melt in your mouth with a sweet and savory sauce.  Liver may not be for everyone, but if you get it, save it for last. It's so rich, eating it up front may overwhelm your palette when tasting the more delicate items6th Course (Dessert): Fried milk: 5 starsAll the flavors and textures work really well here.  Hot, cold, crispy, creamy, chocolately, milky.  Its worth coming here for the desert itselfFood (value): 3This is probably the sticking point for me.  While everything (minus a few things) were pretty solid, and the experience was unique, I did feel that Uchi was a bit overpriced for what I got.  While I certainly expected to pay a premium, some of the pricing for the items seemed to be a bit much.  Other prominent sushi restaurants have similar quality (though arguably less innovative and unique) offerings for a more competitive price.  However if money is no option and you prefer a more contemporary spin on Japanese cuisine, this is the place for you."], ["Thu N.", "Tasting menu:Zero senmadal (sea bream)sake toroBacon steakienabefried milkOrdered separately:mâché cureI'm upset at myself for not getting all the names and pictures of the food, and yet even if I did, I'd fail miserably at describing the food.  All of their dishes had 4-5 components that just surprises you with every bite and chew that you do.  I prefer the cold dishes over the savory because it was so delicate, thoughtful, balanced and mouth watering at the same time.  My favorite was the zero sen and mâché cure.  The fried milk was out of the world. It was like a cereal/dessert dish that seemed like it was meant for the richest kid in the world.  I'm happy to have found this place as we left our hearts with all the wonderful sushi/Japanese locations in So cal. Receipt attached"], ["Jojuane P.", "It's no wonder this place is a hot table to get.  The food and attention to detail to the dishes creates a pretty dynamic experience.For the quality coming out of the kitchen, they don't break your wallet.  Refreshing to eat and feel good about paying the bill.Reservations are a ways out, so proceed with caution if you just show up.  Be prepared for a long wait.  With no reservation, arrive when doors opens or come after 10 pm.  I'll be back."], ["Atreyu O.", "Not worth the money. Period. I am happy paying $250 for a meal for two if the food and experience is excellent but this was certainly not. Service- Below average. While our server was very nice he disappeared for long stretches of time when we needed him. Other waiters brought our food out and more than once the wrong food was given to us. After dropping the bill we never saw him again, I was tired of waiting so handed it to another server. He never even came to say goodbye/thank you.Food- Mixed. The main reason for coming here is the food. But it too was a disappointment. They did have some good items (which is why it gets 2 stars) such as the basic sushi items, like the salmon belly. But I found their plates to be a let down on the whole, they were generally okay, but for $20 for a plate with a just a few thin slices of fish with some sauce and garnish.. you expect better than 'okay'. Some of the sashimi did not taste very fresh, the eel was overcooked, the tempura was greasy. I could go on! They just did not live up to the standards expected.In summary, spend your money elsewhere.AVOID"]], "Shinsei": [], "Little Katana": [["Tuvy P.", "Such a cute little restaurant off the strip! Came here for a quick lunch at the sushi bar. We ordered about 3 rolls, some sashimi (salmon and mackerel), an ahi tuna tower, a glass of wine and left extremely satisfied! The sashimi was perfectly sliced and extremely fresh. (I have to especially compliment the mackerel... It was perfect!! Succulent and fresh!) Sushi rolls were not overpowering or overwhelming and the ahi tuna tower was the smallest I've seen at restaurants but still very good. They offered a pretty generous pour with my Chardonnay and kept up with the refilling of our waters. It was pretty busy with the lunch rush so I think we got there at the perfect time (12pm). There wasn't a line or anything but you could tell they were getting busy! This is a good sign for first timers like us! First timer but not our last timer. Ha!!"], ["Kenny O.", "I came here for the bento box, but it is only a lunch item.2-3-minutes to get some great calamari.  10-more minutes for the entrees ie: tuna sashimi, Shrimp/Vegi Tempura starter, Udon,and California roll.  All items were perfect, is presentation, taste and texture.  I understand they will be moving across the street and opening another in the OMNI very soon.If i'm in Dallas, this is where I will go."], ["Alexander C.", "Yum! This place is great! The quality and freshness of the sushi is fantastic, as well as the wait staff, location, and ease of getting a table. Never once have I not been able to walk in and get a table quickly even when the place is packed (which it always is). Little Katana is a prime place for a date, a family dinner, or just a quick in and out place to satisfy a sushi fix."], ["Michele B.", "I had a dinner date at Little Katana and was extremely impressed.  Although we waited for almost 15 minutes for a waiter to come by to take our drink order, that was the only complaint and reason for not giving this place 5 stars.It's a quaint, intimate location off of Travis Street in Uptown (across from Villa O).  The atmosphere is both inviting and romantic.  It's a smaller restaurant but they can accommodate parties of 2 or large parties.  We ordered a bottle of wine (picture attached) to go with our meal and the wine was very good.  We started off with some miso soup (excellent in flavor), some salmon shashimi and some yellowtail shashimi.  Both were excellent but the yellowtail was incredible!  Like butter!  We also split the Snow Mountain roll which was extremely good.  It's a scrumptious yellowtail roll topped with mounds of delectable crab meat and some spicy mayo.  A table next to us ordered the Kobe Hot Rock that was appealing to the eyes and ears.  We very much enjoyed our experience and I look forward to sampling more sushi options (and the Kobe Hot Rock) when I return!"], ["Kiran S.", "Little Katana has outstanding fresh sushi. The customer service was outstanding and everyone was so friendly. This overall is also a kid friendly place which as a parent I can appreciate. We had various sushi rolls I love them all and had the appetizer sampler with the beef short, ahi tuna and calamari which the whole table loved. We will definitely be back!"], ["Kurt V.", "I have three sushi restaurants across town that are my go-to places, and Little Katana is one of those.  This is a cozy little place (as the name might suggest) and is delightful for either lunch or dinner. For lunch, I typically choose one of the great selection of Bento boxes that they offer.  They are a little more expensive than many at other restaurants, but I never leave hungry when I get one.  Their Hot Stone Bowls are another favorite of mine. While they do have a lot that they share with a couple nearby businesses, parking can be an issue at times, so be prepared for that during peak hours."], ["Brechen Z.", "We Ordered take out. It was fast and the fish was fresh.. I ordered the charming roll and the mama roll. mama is riceless and the charming roll is made with soy paper - which I prefer. I did not get the side of ponzu sauce with the Ma Ma roll, but it did not lack any flavor without it. My boyfriend ordered the chirashi -ju, which is an assortment of raw fish over a bed of white rice. He ate all of it! We will definitely be ordering from here again."], ["Stefanie L.", "If you're looking for tasty sushi, amazing service and a cute place for a date, look no further than Little Katana. Make sure you come in before 7pm or after 8pm, otherwise plan to wait a couple of minutes for a table."], ["Ivy W.", "This hidden little gem is definitely a must go in Dallas! The restaurant is a little small and the space is right but gives off such a casual home feel. The place is never too loud and the staff is quick and extremely friendly. Also, they have an incredible wine list! I have yet to try their cooked food because I've only tried their sushi. The quality of the fish never disappoints and their rolls do not make you feel bloated and heavy. The papa and mama rolls are my favorite! Just a side note: I've seen Troy Aikman and Jesse Metcalfe here too!"], ["David L.", "One of my favorite little places in Dallas. Very fresh rolls and a nice low key environment. If it's very busy it can be a touch on the noisy side but that doesn't detract from the sushi! Try the Mama or Papa roll if you're looking for something fresh! Also the Ahi Tower is great! -have your sever mix it for you."], ["Dominick F.", "Very happy to report that my previous review was just an off night after all. We back again this past Monday night, March 16th, and it was incredible! One the best meals I've ever had. The tuna tower was unbelievably delicious and I want another one today. The service was wonderful and everyone went out their way to make our visit special. The sushi was super fresh and the drinks were spot on. We had table with a close up view of the sushi chefs this time - who are high speed artists. It was entertaining to watch them work and ever more fun to taste the amazing results. This place has returned to my top favorites list. CANT WAIT TO GO BACK."], ["Matt A.", "Not so great.  They did not have a good selection of Sushi and the service was poor.  I ordered an appetizer and sushi which all came out at the same time...I hate when servers do that!  I wouldn't repeat."], ["Ivy J.", "Sushi & food here are solid. I had the dumplings, Ahi Tower,  dragon roll, Cajun roll & a few other roll selections. They were all good, not mind blowing. I'd put everything I had at a 7-8 minus the Cajun roll which was a 4. Service was okay. Took waiter awhile to get to us and take it orders & refill the water but he was nice. Prices are high but lunch time was half off of several selections. We had a good deal of food plus 2 hot teas for around $47 lunch. It would've been double that off lunch hours, which wouldn't have been worth it to me."], ["Charlene L.", "Sushi in Texas.. who would have thought?! Definitely not me!! First off, where does the fish come from?!! Being from Seattle, the thought of not being surrounded by water is super foreign to me.  I was extremely skeptical of getting sushi in Dallas, but let's face it, while traveling often for work, I need something light and refreshing, and sushi seemed to fit the bill.Sure, this place has all the fu fu, pretty, specialty rolls.  Did I try them? No, I'm just not a fan of mayo or eel sauce on everything.  I opted for the simpler rolls and sushi to really test the quality of the food.. hard to mask ingredients when they're in their natural state.  I had the yellowtail roll (simple yellowtail, and green onions), tempura shrimp roll (as special as it got for me- crab, tempura shrimp, avocado, cucumber, and a splash of eel sauce), tobiko topped with a quail egg, salmon, and a spicy tuna roll. I loved the fact that they don't overdo the simple stuff! The spicy tuna roll was PERFECT.. not masked with tons of spicy mayo, but instead no mayo at all, and a lot of clean spicy to it! For ordering the tempura shrimp roll, I was a bit hesitate as I normally don't love all that sauce on anything, but there was barely any there! it was just the right amount of balance to not soak the roll, and keep it clean and fresh.  The best part is, for all this, it was under $40! It's true! Great quality fish flown in from mainly Hawaii and Japan, with chefs keeping it original and not covering it up with \"fusoion\" ideas! I know I will be back for a fact!"], ["Lily M.", "Once again, my bf and I wanted some sushi takeout, and we decided to try out Little Katana.  Our first and only time going were a few months ago, and the reason we haven't gone back is because of the hair that I saw on top of one of the rolls.The rolls that we did order were wonderful.  But, we couldn't eat one of the rolls due to the hair, and I know it doesn't sound like it's that big of a deal to some, but it's gross to me.For the reason of me having to speculate Little Katana's sanitation, I just can't get myself to go back there."], ["Jimmy N.", "This is a unique gem to find in Dallas.  Beautiful restaurant and decor, very friendly staff.  I was very skeptic walking in, but the sushi and sashimi is legit here.  I recommend Spanish Aji (sashimi / ask the chef to deep fry the fish skeleton for after diner chips snack), yellow tail (very fresh), salmon (melts in my mouth), and papa rolls (very interesting).I'll never steer you wrong, this is a very good sushi place.Cheers."], ["Sara H.", "I came with two friends for lunch on a Monday. As soon as I ordered the bento box, an employee told me that I couldn't order it because the restaurant wasn't busy and she didn't feel like making the items..... My friends and I were really confused and I ended up ordering the Korean seafood hot stone rice bowl instead ($16).I waited for about 45 minutes for the rice bowl and ended up taking it to-go (since my other friends were done eating their entrees already). The Korean seafood hot stone bowl was some white rice with some stir fried shrimp, a couple pieces of squid, a few baby scallops, peppers, onion, and zucchini. There was no \"spicy sauce\" like it said on the menu. When I asked for some, I was offered some Sriracha (what?!?).Not a great experience overall. And it didn't help that one of the guys making sushi started coughing and then touched the sushi mats without washing his hands first."], ["Tammy D.", "The sushi IS good, however the customer service is AWFUL. Pam was our server and we waited 10 minutes with not a single person asking us if we wanted to start with any appetizers or if we were ready UNTIL we had to ask ourselves. No one introduced themselves or throughout the entire meal ask if we were doing fine. She didn't say two words to us but GOODBYE when we were finished. This was our first time dining there and our LAST. Not worth the $$ either, better options in the area."], ["Al C.", "More bar food than japanese cuisine.  Don't expect too much out of this place.  There are better and more authentic place (like sushi robata in Plano).  But, if you just want japanese food in park cities and nothing else. It's edible with beer or sake."], ["Joanna T.", "Honestly one of my favorite intimate sushi restaurants in Highland Park! They always have the freshest fish and an even better customer service. :) Try their flavorful sizzling dumplings, uni, salmon, and vegetable tempura udon- you won't be disappointed!"], ["Jen H.", "Awesome service, excellent sushi!!  Very beautiful on the inside."], ["Matt S.", "This is the whole package, amazing fish, wonderful service great location.  Default for fantastic sushi experience."], ["David M.", "Had dinner here last night with a group of friends. Service was attentive, food very good and luckily a perfect night to sit outside on the patio. Probably the best Japanese restaurant in Uptown/Highland Park. Will definitely go back."], ["Greg S.", "After going to Little Katana four times in about two weeks, I suppose it's time to write my review. Little Katana is one of the better sushi restaurants in Dallas, in my opinion. Unlike some of the other restaurants in the area, LK is pretty casual from the most part. If you go during the non busy hours it is quiet, with a nice patio as well. It is small so they get very busy during peak hours, so plan accordingly. I have tried the miso soup (excellent) beef pot stickers (excellent), spicy tuna, sunny, and charming rolls. They are all really good! I will definitely be back."], ["David W.", "The owner of this restaurant has the genuineness and passion that all restaurant owners should have.  They truly care about the quality of their food as well as the presentation.The sushi is some of the freshest I've ever tasted and for that, be prepared to pay a little more for it. Not a sushi fan? No problem. They have other hot dishes for the non-conformist. :)"], ["Emily S.", "I got this recommendation from a friend and was honestly not impressed. If you go here - do not get the nigiri! It was very fishy and tough and the rice was cold and hard.  I usually like to keep it simple when it comes to sushi and typically don't go for cooked rolls with lots of sauce. If I were to come back, I would only get rolls. The only thing that kept me from giving this place 1 star was the roll we had, which was decent. Prices are high for the quality and there are a lot of better choices when it comes to sushi in Dallas. The service was okay but the waitress was nice. She was not very knowledgeable about the menu and could not give good recommendations. The atmosphere is great and has a fun ambiance."], ["European Wax Center C.", "I will tell you, the reason I will be giving this place 2 stars and not 4 or 5 is because the manager of the restaurant came up to my 3-party table at the end of our 1.5 hour meal to ask us to please leave so they could fill other tables. That is the most rude thing I can imagine of a restaurant. I just dropped over $100, and you want me to leave after only being there to less than 2 hours? I ordered a bottle of wine and everything, and that to me, is someOf the worst and unappreciable customer service I have experienced. I will NOT be returning."], ["Nick M.", "We ate dinner here on a Friday night and our experience was excellent. The fish was the freshest we have tasted in Dallas. I recommend it all but the Japanese snapper tasted particularly good. The service was very attentive and the whole experience was comparable to what I would expect from a much more expensive restaurant."], ["Gordon N.", "What a neighborhood gem!Come twice a week and love it.The Sunny roll is to die for as well as the stone pots. Great atmosphere, courteous and knowledgeable staff"], ["Ivory W.", "I'm very pleased with the service and quality of food at Little Katana. We originally planned to order standard rolls and sushi but at the last minute asked for recommendations based on their top sellers. Our waitress looked at our order form and based on our original selections she was able to quickly recommend the Mama Roll.  Her familiarity with the menu and confidence made it easy for us to switch up our selections in favor of her recommendations. We dined on the Mama Roll, yellow tail and flounder sushi and I sipped the Ruby Red Martini. The fish was very fresh and the drink was full of flavor. Our server was bubbly, attentive and helpful."], ["Jordan T.", "We were greeted by all the staff and cooks and ordered the hot rock bowl. It was amazing!!! Stayed hot the whole time and was super tasty! Loved the service and ambience!"], ["Jacqueline C.", "Service, sushi, overall food quality and preparation, menu selection and even the restaurant location were all fantastic. Even with all those pros, It's been over a year since my first and only visit for 2 main reasons- fist, the dining area is a really tight squeeze, with poor acoustics and no privacy for conversation; and second, the rolls were way over-priced, even for the Knox/Highland Park Area, but especially for a casual bistro setting."], ["Sarah T.", "Little Katana is hands down my favorite sushi restaurant. I try something new every time I go and I am never disappointed. The sushi is always fresh and flavorful. I tried the dumplings or the first time my last visit, and they were amazing!"], ["Chelsea R.", "Melt in your mouth salmon and yellowtail sashimi! That's all you really need to know. Service was great at the bar. Love the small and intimate atmosphere. Can be a little pricey but I'll pay the extra moolah for the good stuff. Also great wine."], ["Frances L.", "Really great sushi and great service! The hot stone bowls are the best! They have great deals on Monday and Wednesday nights for sushi and wine! Love this place!"], ["Steve V.", "Great rolls. Very fresh. The Sunny Roll was perfect. It has spicy mayo on it but it's not heavy. The big winner is the Spicy Chicken Soup!!  It's the closest I had yet to a homemade Shin Cup. I got mine extra spicy because that's how I roll -- HA!Half price on selected rolls during the lunch we went to. So not a bad price for some great food.This place is on the permanent list now."], ["Angela J.", "The papa roll is, hands down, the best sushi roll in Dallas. Hot stone bowl is great for dinner and even better leftover for breakfast!!"], ["Christopher T.", "I think place is good or bad depending on your perspective. If you want sushi covered in mayo sauces or Asian syrups, stuffed with fried food and Philadelphia cream cheese, then have at little katana. Nothing wrong with liking that kind of sushi but I hate it personally it if I'm paying high prices. So I couldn't enjoy our roll. I can't even remember the name because it was one of those rolls with 80 ingredients like a sandwich.  I also had the dumpling soup. Good miso broth but it was no better or worse than a packaged kind. The dumplings floating around were good but there were only three. The beef inside was nicely seasoned, slightly sweet, but really they weren't any sort of fantastic. Just good. Good vibe. Really impressive cuts of fish when you walk in. But sushi is weak and only a notch above what your neighbor Tom can make after watching sushi YouTube videos, and if he has plenty of mayo."], ["Kendall N.", "I am a frequent customer of little katana and after my last experience I think it will be awhile before I return. I was out to dinner with my sisters and we ordered a bottle of wine on Wednesday which is half priced \"so the sign says.\" Once we got our check the bottle we ordered was not half priced. On the sign it said \"Mondays half priced sushi on select rolls and Wednesday half priced bottle of wine\" (not select) and when we asked our waitress she said it was on a special menu. However, we did not get the half priced wine list menu. After we asked our waitress to speak to the manager they still refused to give us even the slightest discount. Not to mention, the manager didn't even come to apologize or acknowledge the mistake. I am extremely disappointed and will be looking for a new sushi restaurant in the future. If it was possible to add the picture I took tonight of the sign I would so that others would not be mislead."], ["Nga N.", "With how packed it was on Sat night, we were surprised to be seated immediately. This place is very small, and it didn't have the cozy feeling for me like most small restaurants. I can pretty much hear the table next to me loud and clear, even if they were whispering. The food though, was hit and miss depending on what you get. The sashimi was very disappointing. I got the chirashi bowl, which is one of my favorite Japanese meals. The chirashi bowl is a good way to test out the restaurant raw fish. This way I can taste an array of assorted raw fish like salmon, tuna, mackerel, yellowtail, snapper, cooked shrimps, and imitation crab on top of white rice. FYI, the chirasha bowl was not on the menu, but they were able to accommodate us. Most fishes except the salmon and yellowtail were chewy, stringy, and tasteless. The mackerel was the worst, because it was fishy. The salmon and yellowtail were better, but still average in general. Good thing the hot stone bowl, aka bibimbap was awesome. The bibimbap was very moist from tons of butter they added. The fresh veggies and beef also contributed to the great taste of the dish. The star of the night has to be the ahi tower. It had 3 different caviar, and the avocado really stands out because of how fresh it was. It sure was one of the better ahi tower I had in Dallas. Highly recommend the bibimbap and ahi tower. But for $17 a bibimbap, I'm not sure if I'd go back for that since I never crave bibimbap. Actually, for the price of their food, I'd be much happier at Sushi Sake. I heard they have good rolls, and it's half off on Monday. I might check that out."], ["Jody G.", "My husband and I have been searching for a new go-to sushi place to replace Sushi on McKinney (long story), and we finally found it! Since we were on a bit of a time crunch, we opted to sit at the sushi bar. Both our waitress and the sushi chefs were incredibly friendly and inviting. The ambiance was wonderful as well. I loved the exposed brick, generous sushi bar, and intimate yet casual setting. Now for the sushi! We got mostly sashimi and nigiri and everything was incredible fresh and beautifully presented. The sizzling dumplings were also delicious. Highly recommended!"], ["Robert W.", "My girlfriend and I have eaten here a number of times and we were disappointed in their lack of customer service in their management policies. We ordered a role that was too salty and wanted to replace it and by policy we had to pay for both roles. Then we asked to replace shrimp with jalapeño on another role and were told that by policy we had to pay for the jalapeño. By the way, the replacement role took 20 min!  Very disappointing. I guess we'll keep looking for good sushi in Dallas."], ["Robert Z.", "Fun sushi place that has some great lunch specials.  Nice little outdoor area for your dogs if you have em.    Everything was pretty great."], ["Tsahai D.", "Excellent sushi but the five stars is for the combination of great food and great service.  I'm particular about my sushi and I have no complaints here. The calamari appetizer, awesome. Louisiana and Cajun rolls - both with crawfish - awesome. The mango cheesecake for dessert,  awesome. I don't even like cheesecake!  The staff was super friendly on the phone and in person. It's a small place so at times my bf and I couldn't hear each other over the other diners, but honestly we were too busy stuffing our faces to care."], ["Tiffany W.", "Excellent sushi place. I went during the lunch hours on a weekday. The presentation of both the food and restaurant were very classic. Our waiter was polite and wasn't pushy with getting us to order even though we took a while deciding. The sashimi was fresh, as well as the sweet chili black cod that I ordered. I was impressed by the Ahi tower as well. Will definitely be back!"], ["Jackie N.", "Very disappointed in their customer service. We have been here before and liked it but we waited over 20 min for one of our roles and they charged us considerably for a small modification to our order. By the way real crab will cost you an extra $8. Too bad we we will have to find a new sushi restaurant in Dallas."], ["Heather F.", "This place is ga-reat!The reason why I love this place is that it is located in a small yet cozy location within walking distance to all the cool places of Knox-Henderson yet still manages to make you feel at home and offer fantastic specials different nights of the week.  My friend and I went on a Monday night which is 1/2 price sushi rolls for certain rolls on the menu.  What a deal!  Before we dug into 1/2 price rolls we ordered the tuna tower which is very popular here.  Our waiter was so nice--he mixed up the tuna tower ingredients to look like a dolphin, haha!  The sushi is so fresh!!  We ended up ordering extra rolls because it was so great.For great tasting sushi, good prices and great service you need to come to Little Katana."], ["Ginny V.", "Amazing service! Came here for a bachelorette party of 14 and they were so accommodating! Lots of variety on the menu!"], ["Karen L.", "I went with my friends during the weekday. They weren't crazy busy and everyone was extremely friendly. We had a great time. The sushi was fresh and everything was tasty. Taking into consideration that it is a Japanese restaurant, we knew it would be expensive, but it's a little more than what I was expecting."], ["Erin M.", "Positives:Sushi meat was fresh and tasty, the melt in your mouth kind. I loved all of the rolls I ordered. Absolutely incredible. They don't overload the rolls with excess rice. Miso seemed fresh tasting. The tartare tower was great.Negatives: their spicy mayo is terrible.Also it was $90 for MYSELF."], ["Abcd E.", "the service was slow.although the fish was fresh, the rice was undercooked."], ["Lacey P.", "Meh, nothing special. Overpriced for what you get. Their Sushi isn't anything spectacular. Drinks aren't anything special either. Small, but cute spot."], ["Arturo R.", "Salmon is better than any other sushi restaurant. Recommend the Papa roll (yellow tail)."], ["Linsea H.", "This is the first sushi place we've tried in Dallas, and it had us instantly hooked. For sushi, it is pretty affordable and has some of the most delicious rolls I've ever had! We went at about 5:30 on a Friday night, before the dinner rush. Our waiter recommended we order three rolls to split between my boyfriend and I, which was the perfect amount. We decided on the Shrimp Tempura Roll (pretty good, but paled in comparison to our other choices. Good for those who like rolls with few ingredients), the Katana Roll (crawfish, avocado and cream cheese topped with spicy crab and spicy sauce- AMAZING. My favorite of the night), and the Katana 101 (salmon, jalapenos, avocado, cream cheese, topped with spicy crab and spicy tuna with chili sauce. Incredible as well). The katana 101 was my first salmon roll and I was a little weary, but it wasn't too fishy at all! I will definitely be returning to little katana to try some new selections. The service was incredibly and the food was delicious!"], ["Amish D.", "The place is great. The food is awesome as well. The only reasons why I have it as 4 star is because of the noise level and I felt the servers are not well informed with the wine in the stock. But overall it was a wonderful experience. My personal recommendation is hot stone."], ["Binky M.", "Place is geared for roll-eater, chocolate \"martini\" crowd.  True aficionados of recently thawed, flash frozen, raw seafood are probably as scarce as people over 40.  Crowded, loud, youthful scene.  Service okay, but other three diners at table received funky rolls and rest of their meals and my sushi/sashimi order was lost. I dined alone while rest of table watched.  No apology, no offer to comp all or part of my order.  Just \"be glad you got your food, we're REALLY busy\" attitude.More a social adventure than high end sushi, although bill reflects the latter.Note:  Few if any Asian diners."], ["Aju T.", "This place has amazing sushi rolls. Their Monday happy hour for half price rolls is a great deal, considering their prices are a bit on the higher end. Quality is great for the price you pay. Ahi tower is actually the best I've ever had, blue fish has the 2nd best. Great customer service. Don't underestimate their drinks, heavy in alcohol content!"], ["Sheeba B.", "This was hands down some of the nastiest fish I have ever eaten, and I lived in Ecuador in the mountains and ate better fish.  Horrible service, AWFUL seafood, cheap overpriced wine. Ick."], ["Hanan Q.", "Very good fresh sushi. The atmosphere is very elegant and nice. The service is great as well. Monday nights are happy hour nights. I tried their sunny roll, Philly roll, and California roll...they were all great."], ["Chase C.", "We got there about 5 PM just after they opened up on the weekend. That left the atmosphere very quiet and cozy, not like the typical evening in Uptown. This made it enjoyable, although during a busier hour this place looks like it could fill up pretty easily. They have a pretty large alcohol menu. Premium cocktails were in good taste and I had a Pama-Saketini. Delightful. They were sensitive to my food allergies. I was able to make sure nothing I couldn't handle would be brought out. Like most high end sushi bars, they carry a gluten free soy sauce and got it to me on the spot. Bravo Uptown. Bravo.We ordered a Charming Roll and Katana Roll. This was the best Sushi I have had downtown. Wow this was good. But I paid for it. I've come to expect what comes with a 2 $$ on a Yelp Review. I also realize I ordered expensive stuff, but you can get more for less elsewhere. Like all other places in Uptown they likely factor in the location and atmosphere into their pricing. Their rent must be pretty high!I'm usually able to get out of there without too much damage done. I guess that if you throw in an Uptown-like atmosphere later in the night (if you're into that kind of thing) this place gets a 5 from me. A strong performance from Little Katana but not quite it for this intolerant food reporter."]], "Sushiya": [["AmiBeth O.", "Coming into a Sushi Restaurant I always say a little prayer that they have stuff my husband can eat. He has an allergy to both shell fish anything peanut based. This place was definitely a winner. Their rolls don't really describe in detail what is in them, so we stuff with friend rice and a Phillie Roll for my hubs, and I got I think...a Tornado Roll???? It had jalepenos, and it was deep fried....and SO delicious. We also has the spicy edamame! They were sautéed with garlic, chili, soy sauce...and they tasted fantastic!!!!! Great little spot!!!"], ["Young S.", "Stopped by for lunch.  Had nigiri sushi off the sushi bar - yellow tail, salmon, and red snapper.  Also ordered tempura udon. The sushi was good, tasted fresh, but nothing to write home about.  The udon dashi was delicious, but the ingredients in the udon were very Spartan. A strip of fake crab meat, and two thin slices of kamaboko.  Tempura was served separately - one shrimp, one sliced zucchini, one sliced sweet potato, and one onion ring.   Udon noodles were properly tempered to give a slight al dente feel.Service was OK, although the waitress tried to charge me for a Dragon Roll and a pot of green tea that I never ordered.  That was quickly fixed after I complained about my $50 lunch.  My lunch still cost me well over $30.  Not sure if I will return here again for lunch, but if I do, I am ordering bento box."], ["Elisa A.", "Absolute buttah!I love this place.Ran by a family (and not a chain). Fresh food, great service. KUDOS!!"], ["Vinh N.", "Cute restaurant within a high rise. Prices are reasonable. Looks to be family run.Ordered the Yaki Soba Vegetable. Somehow the waitress misunderstood, and I received a shrimp yaki soba instead. It took another fifteen minute before I got the correct order. The soba tasted like a standard lo mein. My tamago pieces were prepared well."], ["Tuvy P.", "Not impressed at all.. The service here needs a lot of work. I would like to think I came on a bad day but I wouldn't know because I don't plan on coming backMy girlfriend and I came here for lunch and what should've taken only an hour, took us much longer because my food took about 40 minutes to arrive. (I only ordered two rolls, the tender roll and a salmon roll). She ordered bento box and it came about 10 minutes before my rolls did. Our waters were empty before they were refilled and overall the experience was nothing that I expected after reading all of the other yelp reviews! We ordered; Gyoza, egg rolls, b1 bento box (chicken teriyaki) tender roll, and a salmon roll. The Gyoza was ok but the egg rolls were noooottttttt good. It tasted like it had been previously frozen and they thawed it then re deep fried it. Bento box with chicken teriyaki looked dry... Friend said it was \"okay.\" My tender roll was small and although it was good, I wouldn't ever pay $14.95 for it again"], ["Willow R.", "Middle of the road sushi. Roll selection is small, underwhelming. Had a sumo roll which was tasty but so big it was almost impossible to eat. Also had a sunshine roll which was not bad, but was not listed as spicy and it ended up be being quite hot. Waitress sat me down, took my order than completely ignored me until she dropped off the check without so much asking if there was anything else I wanted or if she could help in any way. Went at lunch on a weekday. Was super crowded.There is way better in downtown Dallas. probably won't go  here again."], ["Jesse F.", "The older couple that served us were so kind to us and our son. They helped our son with the chopsticks and were very friendly. The food was quickly delivered to our table and it was hot and delicious. The dessert was amazing. I had the fried cheesecake, my wife and son had the green tea ice cream, it was super.Give this place a try!"], ["Cecil W.", "Soft shell crab...if you find somewhere better, let me know. I told my wife at one point it actually no longer felt like we were in downtown Dallas. She loves the ambiance here and we often drive from East Plano to Downtown just for this place."], ["freddy t.", "Everything we had was good. Wife had the Shrimp fried rice, which  was awesome. The volcano rolls were the absolute best, hands down. We will be returning customers ."], ["Karina S.", "Good sushi, staff was friendly & helpful. My friends & I enjoyed it. I will have to come back soon :)"], ["Alissa D.", "Slow service at lunch and I've definitely had better sushi."], ["Chris M.", "Stoked to have found this place. Great quality,  wonderful family operators.  Felt like I was back in Tokyo. Thank you sushiya"], ["Sherill M.", "Sushiya is ok, nothing special. The fried rice is good and the portion is huge. The sushi is overpriced."], ["Greg D.", "Well the name scared me as there is one of these in College Station Texas where I spend some time but it's inside of a grocery store and ins't Japanese.  This appears to be Japanese owned and operated.  The quality is excellent and the cuts of the fish are done with a high quality very sharp knife.   The chef must also be Japanese.  Cute decor and comfortable atmosphere.   And, there's the chef...  Scary face!   Yep!   Japanese for sure!   :)"], ["Janna J.", "This place is unique in that they price your food by its WEIGHT! Much like at a frozen yogurt shop, you are charged by the amount of food you choose to get (priced by the half pound), so you (kind of) control the price. In your little to go box, you can put a variety of sushi, tempura, potstickers, stir-fry, and fried rice (and free soup). As a whole, while it is a unique idea, the food was mediocre. Sushi? Definitely bland, nothing compared to a bit pricier restaurants. Tempura? Surprisingly good, with a nice variety of veggies and shrimp. Fried rice/stir fry? Your typical trying-to-be-authentic-but-really-not food. I was able to fill my belly somewhat happily, but the price came out to be a not-outrageous but certainly not cheap $16.50. If you're really craving some to-go japanese food, feel free to come, but if not, you'd be better off at a larger restaurant."], ["Taylor M.", "Very typical Korean-owned Japanese place. Not the best, not the worst. I ordered the tonkatsu bento because that seemed like a hard thing to mess up, but theirs was pretty burnt and dry and their sauce was cloyingly sweet. The rice was kinda mushy. Their nigiri looked ok, but I didn't order any. Probably would never come back again. The only reason I came in was because some old reviews said they charged by the pound but that system seems to be long gone."], ["Lily M.", "There is nothing better than being able to find a great Sushi restaurant that offers terrific takeout.  I can't get enough of ordering food from here.  Even though I have yet to actually dine-in the restaurant, I can still appreciate the freshness of the food by the time I make it home.  Here are some of the rolls I've tried and enjoyed:Dragon Roll - It's probably my least favorite of them all, but that doesn't mean I'm not a fan of it.  I'm just not a big eel lover.Sunrise Roll - I love this roll due to the many flavors combined; however, I don't like that there's imitation crab on the top of the rolls.  I think this should be noted on the website, because it's not true crab meat.Spider Roll - This is my absolute favorite roll here!  There's so much crunch and flavor.Louisiana Roll - It's not really a roll.  It's more like an entrée with way too many mushrooms for me to enjoy.Tiger Roll - This is another one of my favorite rolls.  The sauce is the best part of this one, hands down.I feel that this will always be one of my takeout sushi options.  I recommend everyone to try it!"], ["Roddy D.", "We arrived ready for a sushi showdown on a Thursday evening and promptly waited about 10 minutes before the a nice elderly man working the floor acknowledged us. We ended up sitting at the bar where we promptly waited another 15 minutes for drinks and then had to approach another server (an older woman) to turn in our sushi order. She then let us know that it'd be an hour or so before they could actually serve sushi as the wait was so long.  (In actuality the place didn't look that busy but the workers seemed exasperated and overwhelmed). Thanks for wasting our time when a courteous heads up on the wait upon our arrival would have been appropriate and saved us 30 minutes of our lives.  We won't be back."], ["Alex E.", "Prices are reasonable and food was excellent!  Will definitely be coming back!  Friendly staff just added to the overall experience."], ["Krosscam C.", "Great place. Sushi is fresh. Great... Super service. Nice folks. Love this place for all their food. Can't go wrong."], ["Renee W.", "We think it's a cool downtown Dallas place.  Fresh food & great service.  Tuna is awesome.  Very reasonably priced.  I will return soon."], ["Heather F.", "Sushiya is A-OK.Being in downtown Dallas I took off one star because to have to pay to park downtown this food should be better.  I don't have a problem with the prices.  At lunch they have a sushi combo that is decently priced and they have the bento box options.  The fish itself is fresh and the restaurant is clean and attractive.The problem lies in the sushi rice.  It is somewhat cold and hard.  This really takes away from the taste of the roll.  Luckily the fish is really good and that matters more than the rice.  Step up the sushi rice and you have a great sushi place!!"], ["Kim N.", "Wait...sushi by the pound???? Oh my god! Typical decent quality sushi and Japanese cooked dishes. Make your own soup w fixins (seaweed, scallions, tofu). Very nice to get a variety of tastes of things. Loved it for lunch!"], ["Melody W.", "Had Salmon Teriyaki, it was better than I expected. Nice and clean environment. Would definitely go again."], ["Mike A.", "We ate here on a Friday night, which I expected would be packed.  There were only a few other diners in the restaurant and the sashimi and rolls were simply amazing.  We would go back there at anytime.  The owners are very friendly and accommodating and the restaurant is very clean.  We really enjoyed our meal and had over $100 in sashimi alone."], ["Michelle I.", "alllright.....I haven't been back to this place in a while so i figured I should update.  i don't know exactly what happened, but the last few times I went, it was meh.  haven't really cared to go back.  the husband and wife that are always working (i guess they are the owners) are SO very nice that honestly, they were the only reason that I would think to continue to go there.   however, if you are stuck downtown and are looking for sushi for dinner, I think you would still be happy with it."], ["Mark S.", "In town for work and was craving sushi.  Nice and clean restaurant with attentive and kind staff.  I had a rainbow roll, spider roll, and yellowtail roll.  Everything tasted good to me and my craving was satisfied.  Job well done in my book."], ["Sara R.", "Most authentic sushi in Dallas! Also, the sushi chef was the person who invented the Tuna Tower! Loved the yellowtail belly sashimi, rainbow roll, dragonfly roll and of course the California roll (classic)! The place was very clean and a good atmosphere!"], ["Angela N.", "a decent hole in the wall place in downtown dallas to grab a quick bite to eat. Its actually really good and fresh considering its in the middle of downtown Dallas, you have to try the Scallop sushi its sooo good, my favorite"], ["Joe K.", "Sushiya has become one of our favorite little establishments.  (So much so that if we walk in, they know what we're going to order.)  My fiancee and I live very close to Sushiya, so it is very convenient for us.  For dinner, very rarely is anyone in there.  They do primarily a lunch business for the businesses in the downtown area.  However--at dinner, we have seen some local celebrities eating here (mostly people from the local news.  My fiancee recognizes them, though I don't watch that much TV.)However, I wanted to write an update review for a reason--I brought my finacee here for her birthday, and were speaking with them and I mentioned that it was her birthday.  Turns out, they have a dessert for that...  They presented her with a tempura fried ice cream.  It was EXCELLENT.  It was so good that since we received that, we have a hard time coming back here and not getting the dessert.  I highly recommend you check that out."], ["Chris Z.", "From outside, this place looks a little skeptical.  But head inside into a space much larger than expected.  There is a long bar, a sushi counter and a few booths.  It's set up very nicely.  Service was awesome, and the rolls were great.  I did not encounter the hard rice that others complain about... but maybe that's because I was there early at lunch, when the rice was just done cooking.  Rolls are 7-15 bucks each."], ["Steven N.", "I was really craving for sushi and I didn't have a car, so that was the only reason I stopped by this place as it was near my hotel. If I would know in advance the quality of their sushi, I probably would have ventured further out via taxi (or order delivery) from somewhere else. I ordered carry-out from this place. The sushi isn't horrible, but it's just not good...actually, it's a tad bit below so-so. I ordered the Dragon Roll (shrimp tempura with tuna), 2 pieces of super white tuna, and 2 pieces of salmon. The fish didn't seem fresh, but it wasn't too horrible. It just tasted blah. But the rice...the rice is where this place fails. The rice didn't stick together, and it tasted like over-night rice (i.e. hard). I do give them props for their wasabi (and they gave me extra at no charge). That stuff has a real kick to it...just the way I like it. The damage came out to about $25...for this price, I certainly had better...much better. I would suggest you skip this place if you have a high standard for sushi. I know I do. =)"], ["Chris S.", "First time here, had the Katsu don at lunch, with a friend.  Second time, Tempura Udon for dinner.  Both were fantastic.  Service has been super friendly both times."], ["Oreoficionad O.", "Was looking for good, quick sushi near my hotel and found it in Sushiya. I eat a lot of sushi. I eat sushi often. I love sushi. And as a visitor to Dallas, I'd say Sushiya was just fine. The fish was fresh and the portions generous--I stuck to the basics (salmon and tuna sashimi, some nigiri....). If I lived in Dallas, I'd probably try to find better, but I'd be happy to sit down at Sushiya again."], ["Robert G.", "Surprising find in downtown. Not busy on a Monday night but super attentive staff. Sashimi platter was great -- both for value and taste. Green tea is genmaicha, one of my favs and an extra treat."], ["Travis D.", "Great little find. Fish was so fresh it melted in our mouths. Service was outstanding and prices we very affordable! Was able to substitute one of their special rolls in the deluxe bento box, so was the perfect size to share. Will go for lunch next time since right down the road from my office. Oh, parking garage exits right next to the restaurant, so very convenient."], ["Dee S.", "Saw a 10% off coupon on their website and decided to try them out. I ordered the Sunrise roll and it was a good size for the price, but it wasn't anything special. The place was completely dead on a Friday night, I'd recommend it if you were in the area, but nothing to drive a ways for."], ["Chris K.", "This place is amazing. For the price in downtown Dallas, it can't be beat. Great staff and I mean great. Great chef and everything. Big fan of this place. Come at dinner. It is very peaceful. Would highly recommend if looking for sushi in downtown Dallas."], ["Susan T.", "Fast service and good sushi for downtown. Recommended temura udon and all the brnto boxes."], ["Eric M.", "At first the idea of a sushi bar buffet seemed a little scary to me, but once I visited this place I realized they had it figured out. It was quick, easy, fresh, delicious, and affordable."]]}