{"Crushcraft Thai Street Eats": [], "Asian Mint": [], "Ginger Thai Cuisine": [["Devin Q.", "One of my co-workers and I go here every few weeks for lunch and we really like it.  She eats gluten free, so there are plenty of items for her to choose from.  Since I don't have any food adversions, I try something different almost everytime.  Some items have been great, and some have just been good, but I've never had anything bad.  Its a quick and quiet spot for a weekday lunch.  Lunch (which is severed with a little soup or salad) and a drink runs about $10.  I think the day we split and appetizer the total was $25 for 2.  The food come out quick, hot, and fresh.  I'm easy to please, but I'm quite happy with this little spot."], ["Leza M.", "Great neighborhood place for Thai food."], ["Jeffrey S.", "Always a good go to when I'm to lazy to go out to pick something up or cook. I've never been to the restaurant itself but have ordered delivery on a regular basis. Most cases they have delivered in less than 30 minutes. We normally order the pad Thai and the red curry and both are excellent."], ["Donovan A.", "Pad woon sen is great here! Soups are a bit watery. All of the other main dishes I have had are good."], ["Sarah Y.", "I went with 5 others and ate family style. We ordered the following-Green tofu curry which didn't have a super flavorful rich density-Chicken pad thai which was a solid pad thai, tangy, chewy, tender chicken and fried tofu with the right amount of sauce-Chicken fried rice...I was pretty impressed with how well fried and seasoned this was and all the little crunchy veggies in there was a nice touch.  A good fried rice has a lot of flavor and this fried rice hit the spot. -Peanut chicken...tasted like soy sauce and peanut butter on top of chicken breast...it was kind of hard to get into-Sauteed beef and peppers: the beef was pretty good but i didn't find the entire dish to be a particular stand out in any way. -Sticky rice and mango: the mangos were really ripe and sweet and the sticky rice came out smelling fragrant and hot. The condensed milk on top of the two was lovely. Overall, some dishes were good and others were okay. The price also seemed a bit steep for the moderate portions you get. We all ended up being happily satiated after the meal, but I think the bill came out to be about $15/person."], ["Rachel S.", "I've been here at least 3 times. I've never had exceptional experiences, but choosing this place guarantees a pleasant experience in a clean space, with spicy-delicious Thai. 2 notes for your consideration:    (1) Serving sizes are not large. The portions are reasonable, but they're still smaller than you might want or expect when paying 7-11 bucks a pop.    (2) They were gracious and helpful to me when I asked for no animal products in my meal. They very well could have slipped in fish sauce without my knowledge -- but when I asked for no animal products last week, they accommodated my request without batting an eye!"], ["Sean B.", "It is so satisfying to find a quality restaurant in your own neighborhood you would be happy to visit again and again.After driving past Ginger Thai hundreds of times, I finally decided to try it at lunch. First of all, I expected a sparse hole in the wall considering it is nestled in a drab little strip shopping center next to a Boston Market. But I was wrong - this place is really very nice! A great place to take a date or a friend for a nice dinner. Nice colors, and contemporary decor make this place very comfortable. Although, it was the coldest day in Dallas in years, and I don't think the heater was working. OUCH!The lunch menu was well stocked - - with your typical Thai dishes, and some more authentic fare.  All were very affordable (even the more exotic dishes) - cheap even! 6.95 for lunch?  Yes, please! Dinner prices were also on the cheap side.I had the grilled beef with vermicelli.  The beef was tasty and tender - plenty of it - with rice and delicious noodles.  The soup to start was delicious and hot (thank god since the heater was out!).  Terrific lunch portions - not too much food, not too little.Service was friendly and attentive.  The place is tiny - so not terribly difficult to keep up with us.I couldn't be happier to discover this place in my hood, which plays host to more fast food joints than anything. I'm looking forward to returning to try some of the more authentic dishes."], ["Bill K.", "Pad Thai was very good. They use a 1 - 5 scale for heat. We thought 1 would be no heat for my wife. Her dish was spicy to her. As I hadn't been here before I asked for 2. It was probably more than what I would consider a 2. There were two servers, male and female. The male server was very good and attentive. The female who took our  order was the poster child for bored to be there. Good golly Miss Molly, go find a job you like."], ["W W Y.", "We had spicy peanut chicken and roast duck curry. I loved the roast duck curry, it was like a homemade meal my mom would make. There weren't peanuts in the peanut chicken, but something like peanut powder. Their TV was showing an infomercial for a weight loss shapewear product so the atmosphere was strange."], ["Jonathan C.", "This place is close to my house and I call them frequently for delivery.  With so many average Asian places to eat, its nice to find a place that uses quality ingredients and does NOT make overcooked slop.I like to get appetizers and they all come with fresh sauces for dipping which are excellent.  Its nothing that will blow your mind, but its way better than some of the other Asian strip center restaurants you see everywhere."], ["Greg A.", "Dallas has good Thai food, but this is not one. Pad Thai was incredibly bland and and the curry was über-watery.  I'm done with this place."], ["Lily M.", "I've eaten at Ginger Thai many times and I have never been impressed.  The food is good, but not great.  Their noodles are sometimes sticky (slimy) which I hate.  Also, you don't get near as much food at this place as some of the other thai restaurants.  The spicy basil fried rice is good and really lives up to its name...spicy!  The spicy noodles are not consistent.  Sometimes its flavored so good and aren't that sticky, whereas other times it has barely any flavor and is sticky.  Overall, this place is not one of the best; however, if you are in the area, it is good enough to eat."], ["Anita S.", "This is now my second time ordering delivery from these folks.  Their noodle dishes are solid.  Nothing mind-blowing, but if you're finding yourself craving Thai basil or red curry, this food will leave you content.  The portions are just the right size, too.  Thai tea tastes very much like tea, not too sweet.  And the delivery guy is adorable!"], ["Nicole F.", "I order from here to have it delivered to my office or dine in at least once a week. I order the Pad Kee Mao with beef - my favorite. Sometimes they can be skimpy on the beef so I order extra for only $1 more. The price is still great even after the extra add. Their Hot and Sour soup is amazing! The delivery guy knows me by name and even when I go in to dine he always smiles and waves hello. I love ginger thai. It is my absolute favorite!"], ["Donovan L.", "Delicious food. I had the spicy noodles and they were delicious. My husband had fried rice which tasted weird....the rice specifically. Then he found a long black hair in his food (he has light brown hair). We brought it to the waitress' attention and she apologized and offered to replace the food with fresh food but he declined. When we got our bill they had taken his off completely so at least they made up for it.  Ill give them another try because my food was great and I enjoy the atmosphere as well as the fact it's in my neighborhood and we need more sit down restaurants here. It would have been 4 stars without the hair."], ["Monica L.", "I was craving Thai food so ordered delivery again and the food was terrible.  Ate a couple bites to calm my hunger and threw the rest away.  Don't think I'll be ordering from here again..."], ["Wendell D.", "I love their pad thai noddle who doesn't lol,,,, it's a hit and miss place area. The staff are nice and friendly and very accomodating to everybody. make sure you get the desert like sweet rice with vanilla ice cream,,, dont miss it because its so good. I ordered their fresh eggrole with peanut sauce and it was delicious too. Prices for their entries are resonable."], ["Donald B.", "Good portions, quick service, but food was kinda bland."], ["Rebecca C.", "I was pretty impressed by Ginger Thai!I almost didn't notice it from the humble exterior, in the same shopping center as Tom Thumb, which made for plenty of parking space.The atmosphere inside is very clean, well decorated, and the wait staff were friendly. The menu had a wide selection of red, green, and other curries, as well as noodle &  vegetable dishes, thai soups, desserts, teas, etc. My friend who is a huge Thai food fan was extremely pleased with the Green Curry with chicken that he ordered. My other friend who loves the sour Thai soups really liked the Tom Yum soup, and I thoroughly enjoyed Pad Kee Mow, a spicy herby flat noodle dish. I enjoyed it - I would go back anytime to get a Thai food fix in the inner Dallas area!"], ["Joe F.", "My stepdad kept telling me about Ginger Thai and how I'm an idiot for not making it down there to eat yet (his words not mine, I think I'm super). He finally brought the point home (literally) when he picked up a bottle of their ginger dressing to use on our monster Easter Sunday salad. I immediately got the girlfriend on the horn (heh heh) to let her know to clear her schedule so we could trek on over. . .I was not disappointed.You have to look hard to find Ginger Thai. Heck, we drove right past it and didn't even see it. It's hidden between a Boston Market and a laundry place so use them as your beacons to taste town.  The menu's got all your standard fare like pad thai, curries, pad kee mow, crispy whole fish, etc. Like most other Thai places in Dallas, there weren't any real surprises on the menu. We opted to start with the steamed chicken and shrimp dumplings and I ordered the sizzling mixed seafood and the girlfriend got lemongrass chicken. I'm completely serious when I say these are some of the best dumplings I've ever had. The perfect balance of shrimp to chicken with great flavor from the ginger and other seasonings, all wrapped and steamed with some roasted garlic on the top. The sauce was a sweet soy that had been reduced a little bit to get a thicker texture and it was so good I found myself scraping the plate with my fork to make sure I got it all. I felt bad until I looked across the table to find the girlfriend doing the same thing. I feared that I would be let down with my meal after such an awesome appetizer, but it's hard to be let down by a gigantic platter of huge mussels, shrimp, squid and scallops in a spicy sweet sauce with mixed vegetables. I hate when you order the seafood and you get one or two wimpy bits of squid. Lucky for me it looks like Ginger Thai slaughtered the giant squid from Calico Clones (look it up) and gave me the whole thing. . .it was squid madness in the best kind of way.The lemongrass wasn't as good as I've had at other places, but it was still a home run in my book. It was a much more subtle flavor than the seafood so maybe I'm not giving it a fair shake by trying to compare the two.  The service was great. Our servers made sure our drinks were as full as our stomachs at all times and were honest with their opinions of the menu (they say avoid the herbal chicken). Two drinks, two entrees and an appetizer cost us under $35 and we were in and out in under an hour without ever feeling like we were being rushed. I'll definitely be heading back. You can be sure that next time I'll be sure to get my own order of dumplings, thank you very much."]], "Tippy's Thai Cafe": [["Go B.", "This is my new favorite Thai restaurant in Dallas.  It's BYOB, which makes a great spot for Mom's Night Out.  A group of us went there a couple weeks ago and the food and service was excellent.  We ordered A LOT of food:  Thai Basil Fried Rice, Pad See Ew, Papaya Salad, Summer rolls, Red Panang Curry, Chicken Satay and more...At the end of the meal, we were stuffed and the bill came out to $14 per person!  Wow, what a steal!  The manager came out to check on us at least twice.  The food can be spicy, most of us ordered #1 or #2 level of spiciness and the food still had a kick but was tolerable.  We never felt rushed to leave even at 9:30 pm.I brought a different friend this week and it was a repeat of my last experience.  Food and service were excellent.  Also, Tippy (the owner and chef) came out to greet us.  I felt like I was meeting a rock star.  Ha!  She was very sweet and appreciated our business. I'll be back with more friends soon."], ["Amanda H.", "My only suggestion to get this place to five stars is adding more staff as the news gets out and it gets busier. Food was amazing and beautiful. Lunch was really delicious, kudos Tippy's! We'll be back for sure."], ["Paul H.", "Hole-in-the-wall Thai place that is easily overlooked amid the vast shopping center on the south side of LBJ/Preston across from Valley View. Look for it behind the Spring Creek BBQ. Plenty of parking available for everything here.So far, this is the best Thai food I've found anywhere in the Dallas area. The interior is traditionally decorated, long and narrow leading to a private back room for groups where we sat. Had the pad kee mao (drunken noodles, delicious with pork) and a cup of the tom kha gai soup that was absolutely perfect. We shared several appetizers and not a single complaint was heard from anyone.Portions are large, prices are reasonable to downright affordable, especially with the BYOB option. Heat levels can be easily adjusted (just tell them on a 1-5 scale). Menu is not extremely extensive but large enough to cover all the bases from curries to seafood, and accompanying photos of the dishes is a plus. Service was exceedingly gracious, even with handling our own beer/wine, and order customizations were handled without complaint. Tippy herself is a personable dynamo worthy of her own television show. The only complaint I can even faintly entertain is that they are closed on Sundays, but that may change as they grow. Consider me a faithful fan."], ["Samantha R.", "My favorite Thai, Tippy always comes out to say hello to her customers, the staff are wonderful and the food is top notch,  I have eaten Thai food around the world and this is my favorite by far.  It's affordable and BYOB, a five star from me !"], ["R M.", "I ordered the drunken noodles. It was the shizzznit. Fresh and very good. I will definitely return. The people there are very nice. MUST GO TRY!!!! Its averaged price maybe $1-2 more than other places. But its worth it to me. The quality is much better in my opinion."], ["S S.", "The food is extremely fresh. Tippy prepares each item with quality ingredients. She also caters well to vegans and vegetarians. We ordered the corn fritters...I had it with Sriracha and it was great. My husband had these dumplings that were awesome and we had the lemongrass friend rice which was light and flavorful. We will definitely go back to try more dishes!"], ["David l.", "This is literally my favorite Thai place. I've come to Dallas for work and every time I head home to Houston, I crave this restaurant in particular.Its a small family owned restaurant. The mother is charming, very talkative and enjoys the company of just chatting it up with guests when she feels its appropriate.Definitely give this place a try!"], ["Samantha F.", "In town just for a conference, searched out Tippy's based on the reviews, and she did not disappoint! The most genuinely friendly staff, and really good green curry. If you're used to Thai food, you can go for a 3 on the spice, it's perfect. Tippy came out to ask us about our experience with a bit of homemade pecan bar at the end...this place is delicious in every way! Wish I came to Dallas more often!"], ["Diana S.", "Discovered this little gem three years ago.  Tippy only serves authentic Thai that never disappoints!  BYOB is an added bonus."], ["C. C.", "If you are looking for an amazing Thai restaurant in the Dallas area , then I totally recommend Tippy's Thai Cafe. The food is amazing and the staff is super friendly and attentive. My boyfriend and I ordered the Crying Tiger that was cooked medium and it was served with a spicy, citrus sauce on the side. Super yummy and cooked to perfection.  We also ordered the Red Curry with Chicken that was served with a side of rice and the flavor from the sauce was creamy, with the blend of coconut and spices, it totally hit the spot for home cooking delight. We also ordered the Pad See Eew, which is a flat noodle stir fried dish with chicken and vegetables. Omg. Yummy.Now, they do have other dishes on the menu that I have not tried, however, I cannot wait to try it on our next visit. Please share any dishes that you have tried at Tippy's Thai Cafe for me to try out.Thank you everyone at Tippy's Thai Cafe for a wonderful experience and I found my go-to Thai restaurant."], ["Lamont G.", "I really wish people would stop putting broccoli and carrots in the pad kee mow.. thats really :/ in my book. Just feels like an excuse to put in less noodles, but I see alot of thai places doing this... real thai joints shouldn't though =pEHhh.. The folks who run this joint are very patient and nice though."], ["Spencer S.", "For those seeking a quick review: Tippy produces nothing short of the best Thai food I've had in the metroplex. Eat here as soon and as often as you can manage. Scroll to the bottom for my dish recommendations. I first stopped by Tippy's in December of 2012. I'd been having a Thai food craving for a while, and I had been pretty dissatisfied with most of the Thai food I could find in the area. It was a Saturday at 2, so most of the lunch rush had cleared out. When Tippy herself came out to greet me, I was so impressed by her personal warmth that I closed the menu and asked her to \"Surprise me.\" She sure did, making me a Thai country style Tom Yum soup with rice noodles, fish cake, and ground pork that absolutely blew me away. I immediately called my foodie friends (luckily they like a late lunch as much as I do) and waited until they arrived. They ordered some food, and we stayed for over three hours, tasting and enjoying every item we could cram in our stomachs. Since the end of that holiday season, I have been back to Tippy's on a weekly basis. I've brought friends, dates, and family to Tippy's. I've brought people who didn't think they liked Thai food to Tippy's. Every single one of them has walked away pleased, and most of them come back to the restaurant on a regular basis. Recommended dishes:Best things on the menu? Tippy's Shrimp Boat is amazing, you'll want to drink the sauce. The duck curry is amazing, when she has it (ask ahead). If you like Tom Yum soup, don't miss her Tom Yum fried rice. As for the soup she first served me, it's not on the menu. But she will make it for you if you ask. And my favorite thing she makes was something she whipped up for me. If you're a fan of noodle dishes, as for Spencer's Whatever Special. Tippy's Thai Cafe serves food that will make you wish you had an extra stomach so you could have seconds. Don't miss out!"], ["Robin P.", "Small lunch menu but everything tasted was delicious!  Very clean and polite staff. Would highly suggest for a quick delicious lunch!"], ["S M.", "First off, I LOVE Thai food and I love trying new Thai places. So while at a conference in Dallas, we had to hit up Thai, thus we found tippy's on yelp. We were skeptical upon stepping in at 7pm and the restaurant was empty. But don't fret - this place is legit!  We got the tofu summer rolls - AMAZING!!!!  The best I've ever had!  And the peanut sauce was really yummy!!   My colleague and I split the yellow curry and pad Thai. Both were good. But the yellow curry was exceptional!  Would definitely recommend this place if you are looking for authentic Thai!!"], ["Paul M.", "If you are looking for great Thai food, a family atmosphere and the most personal chef, then you will be hard-pressed to beat Tippy's Thai Cafe.  Located amidst a shopping center just off of I-635, Tippy's is small, but thanks to thoughtful seating, feels intimate instead. The staff was friendly, but unassuming and the food is delicious!  I had Pad Thai with chicken; my wife had Red Curry.  Both traditional dishes had a very subtle unique spin that made them remarkable.  The Pad Thai sauce was almost tart, a delectable surprise that complimented the rest.   My wife said her Red Curry was the best she'd ever had.As we prepared to leave, chef and owner Tippy greeted us wanting to ensure we had a good experience.  It was genuine and warm.  We will definitely return, which says a lot as it is a 30 minute drive.  But so worth it. So much so, that it inspired a haiku:Transcending othersin quality and service -Tippy's Thai Cafe.."], ["Robert H.", "Love this place! You are often greeted by Tippy herself. She will accommodate your requests happily. The Pad Thai is my favorite. Also enjoy the Tung Tong appetizer. Another great thing is that it is BYOB."], ["Nicole F.", "Just have to add that Tippy's always makes us the most amazing food and our own personal dish the whatever chicken and whatever noodles!  Might be one of the best things I've ever had!  Side bar Tippy's does a rockin weekday lunch, make sure to pop in and get a table, you won't be disappointed!"], ["Anthony L.", "This place is great! Instead of going to the Indian restaurant across the lot I decided to come here. I order the shrimp summer rolls, lan naa?, and the cocounut ice cream with sticky rice. Everyone who worked there was so nice and kept asking how i liked my food. I will definitely be coming back and trying other specialties on the menu"], ["Dan G.", "Best Thai place i have been to in DFW. Fresh home made and it shows.Tippy will even make a special request given enough time. If you are not eating your Thai food here you are not doing it right. Period."], ["Saran K.", "Tippys Thai Cafe is hands down one of the most remarkable restaurants I've been to in Dallas. Growing up in a Thai household, it was difficult to find a restaurant that offered authentic Thai recipes and flavor that reminded me of home, but that search was short-lived once I discovered this hidden gem. From the moment of entering the restaurant I was warmly greeted and sat down at my table. You'll find Tippy is incredibly accommodating in being attentive in ensuring you enjoy your meal. The kitchen brought out a delectable array of food that hooked me from the first bite. I can't say I left anything on my plate! It was a dream come true. I concluded my meal with a Thai Coconut Ice Cream - and WOW! It sent me right back to when I was a kid. Incredible!! I can truly say I will never go to another Thai Restaurant in Dallas. It would be a tragedy not to give Tippy's Thai Cafe a try if you're feeling Thai food - one reason, and one reason only. If it isn't Tippy's, it isn't Thai!! Enjoy!!"]], "The Mint": [["Steven F.", "I recently brought my girlfriend here on a dinner date, and I have to say that I certainly left pleased with this choice!I had made a reservation beforehand, but there weren't many people at 6:30p anyhow. I remember walking in and being glad with the environment. It was a comfy place, more on the dark side which I'm fine about, and the noise level was fairly quiet even when the place filled up later on (lovely conversation time). The food was great. I ordered the Pad Thai, and I don't think I've had that much flavor from that dish in a while! My date ordered the Pad See Lew, which was equally as tasty. Tried the mango dessert with sweet rice, which was a good call from the waitress since mangos certainly were in season at the time. Overall, this place was fantastic! The service was frequent yet not invasive, the place was exactly what I wanted, and I was happy with the price I paid too. Plus the fact that my date is gluten sensitive wasn't a problem at all here; most of the menu is both marked and able to be adjusted! I definitely recommend this place, and would surely stop by again the next time I'm in town."], ["Tammy T.", "I have been here several times. The best pad kee mow I have ever tasted out of the several Thai restaurants I have been to. I love how you can ask for a higher spice level. Customer service is spot on as well."], ["David B.", "Nice restrooms! The green tea cake is overrated IMO. They charged $2.50 for club soda."], ["Brandy L.", "Not impressed. Poor service. The food was average nothing special and kinda high priced for what you get. But all the way around really bad service. Oh, and the kitchen took over 35 min to prepare my food \"Togo\" the second time I tried it. I'm not trying it for a third time"], ["Alicia F.", "Super disappointing experience. Unfriendly host and marginal service. The food wasn't anything special either-- the shrimp that I got in my pineapple shrimp fried rice (which was super salty) was not fresh and tasted like it just came out of the freezer. The steamed shu mai dumplings had obviously been microwaved as they also didn't taste fresh and looked shriveled. They resembled the frozen ones you can get at a store to microwave at home (waste of $8). The only positive thing about this restaurant was their hole-in-the-wall feel, but that wasn't worth the incredibly underwhelming dining experience. I recommend going somewhere/anywhere else for Thai or Asian fusion."], ["Brooks H.", "The seating could be better, the prices a bit lower but the food is killer. Seaweed salad is a must. Fried rice here is above and beyond. Here's a pic, come n' get it!"], ["Thanh Trúc P.", "I love the mint. So far, this restaurant makes the best \" sticky rice with mango and ice cream green tea cake\". And i like the decoration of this restaurant. Nice staffs, and service. The only thing, i dont like, the distance between of 2 tables is very close, you can heard all the conversation of 2 tables next to you. They can heard me either. No so privacy"], ["Cat N.", "WHAT??? I cant believe I dont have a review for this place!!! I've been coming here for years!!! What kind of an awesome customer am I? I was a big fan of Asian Mint till Nikki opened up the mint. I was one of their regulars at Asian Mint and I pretty much introduced all my friends to this place! yeah, you're welcome! jk :D I guess it was wayyy before I got into yelp so I forgot to review it. Same menu and pretty much same atmosphere as Asian Mint but in a hippier part of town. I love their green tea cake!!! You cannot find it anywhere!!!! it's one of those desserts you just don't want to share with anybody!!! I've had pretty much everything on the menu...so...let me just name everything I tried from their menu. and they're all good!!! trust me, if you want to impress your date and look \"exotic\" take them here! they have happy hour here, too. So maybe you both can be happy at the mint hahahah.  chicken basil pad thai crispy pad thai thai salad with grill beef tom yumthe other coconut soupthe crab lovers fried rice. Comes with softshell crab!!! AMAZEBALLS!!!calamarispringrollssoftshell crab appetizerthe appetizer sampler. comes with four different kinds I believe. kua kai. soft noodles with chicken and egg!!their red curry is superb!!! green tea cake (their orange cake is just okay...) MUST TRY!!!! ALL THE ABOVE IS DELICIOUS!!! go eat and thank me later! I think that's everything I had over the years. They need to hire me as a spokeperson! You can pay me with food! I'm not a poor college student anymore but I still live like one. I'll take food as currency! lol jk jk"], ["Jane K.", "I sat at the bar here with my friend and we had excellent service! The bartenders Amara and Best (I hope I spelled their names right) were the sweetest and took such great care of us. My friend and I are both girls so we wanted drinks that tasted like juice and oh my goodness... they made the best drinks ever! The server Jacob came and talked to us as well and he was very sweet and personable. Overall a very great experience and would definitely recommend to our other friends!"], ["Abenator I.", "Cool decor for an Asian place.  Great service  from Riley.Had the dumplings which were just ok but the pad kee now and the basil fried rice were both very good"], ["David C.", "Solid place!Their pad kee mow (sp?) is pretty great.Great deconstruction on the classic kungpao chicken. Would recommend to anyone! Highland park, but the price isn't bad at all."], ["Stephanie C.", "I always forget about The Mint! It really is like a pretty, cozy, slightly hidden gem. I mean not slightly hidden... more like right under your nose. Anyway, I was here again this past weekend and i forgot how much I like this place. The service was very attentive from the minute we walked in. The place is very small, but they did an excellent job utilizing the room. Prices here are in line with Highland Park. Maybe a little high for Thai food (I'm talking like $2-$3 too high), so nothing outrageous. But all that aside, the food is delicious. This past visit I got the Green Basil fried rice. It was full of fresh vegetables and chicken. It also packed plenty of spice. I ordered it hot and it did not disappoint.Portions are very large, which is nice. I made two meals out of my dish. This would make a good date night spot if your looking for somewhere cozy."], ["Robert C.", "What is behind the curtain???  AHHAAA...the dining room!!  Very sneaky!  I must say this place is small but packs a great punch!!  The food is vibrant and fresh, lots of authentic choices on the menu.  I enjoyed the pad thai (yes, I know).  However, it was really tasty and fresh!They are closed on Sunday, so keep that in mind.  This place is generally pretty busy, so prepare for a small wait.The parking lot is small, so you may want to valet or park far and walk."], ["Jacqueline C.", "Great place for a quick and casual mid-week meal. The food lacks the depth and complexity of an authentic Thai dish, but it's tasty enough for a convenient meal in a trendy area. The service was good but the tables are uncomfortably close together."], ["Brett C.", "This is a Thai fusion place that is a consistent performer and has a neighborhood feel and some actual Thai people working there most of the time! Lots of the entrees and specials are good and never had a bad meal there though value for money varies dramatically depending on what you order and it is fusion so you'll either love that or try elsewhere for some more traditional dishes."], ["Jamie I.", "The Mint is absolutely one of my favorite thai places to eat at in the city. Though I've been several times for both dining in and pick up, I can honestly say that the consistency of their dishes is one of the main things that keep me coming back. Also, their meals are incredibly tasteful and well seasoned beyond the typical \"salt and pepper\". The first time I dined here, I had the pad thai which was seriously yummy but every time after that, I have always gotten the red thai curry with tofu. I am vegetarian and it's very rare to find a restaurant that makes really good tofu which is another reason why I enjoy eating from this establishment. Now let's talk about the location, it's a tad bit small and one can feel crammed but it provides for a very intimate setting to dine at. I wouldn't recommend it for a large group, not only because of the size but it gets so loud that you'll sometimes be straining to hear what others next to you are saying. Overall, the food is amazing, so I'll definitely keep coming back."], ["Denise A.", "The interior is very modern, but small.  I advise you call in advance for a larger party.  We had of 8, but since we had reservations, our table was ready when we arrived.  The food is tasty and the Thai tea is strong.  The service was slow at first, but once we got our drink orders started it seemed to improve as she gave us more attention.  It is on the pricier side for Thai, but you're paying for ambiance.  It is a great little restaurant.  Try the green tea cake for dessert! It is amazing!  Heads up parking here can be limited.  The day we went the lot was surprisingly full."], ["John C.", "Great food, great environment. easy parking and thoughtful food presentation. Service is very good and they are all over you, but not intrusive."], ["Christine A.", "This restaurant is asian fusion with a twist. My Mexi Tini seemed like it belonged down the street but it packed a whallop and tasted perfect.  Lots of beer and wine options plus a creative cocktail menu.  My friend had a honey vodka drink. I wanted to distract her and switch drinks.Try the fresh, tasty lettuce wraps.  Everything is prepared fresh.  Something about the interior made me think of Scope breath freshener."], ["James W.", "Loved it. Service, taste,  atmosphere, fair price....ding, ding, ding, ding. Thanks!"]], "Thai Thai Restaurant": [], "Sakhuu Thai Cuisine": [], "Bangkok Dee Thai Cuisine": [["Darlene O.", "From the outside, the restaurant's exterior may take you off guard but inside it is clean with a cozy feel to it. The wait staff was very attentive and nice. Came here after purchasing the $15 for $30 yelp deal. I didn't realize my order hadn't reached $30 and they didn't ask me to purchase something else to reach that total. I was taken aback at first after I realized it (especially after deducting tax which is not included in the yelp deal) since I was stuffed and nothing else on the menu caught my eye. I could have grabbed another appetizer or so but oh well, I don't plan on returning.The food was underwhelming. I ordered two appetizers (curry puffs and fried shrimp rolls) and pad thai for my entree. The curry puffs were surprisingly good but a different curry taste not like a spicy curry. It was actually sweet, almost like a pastry and the interior of the curry puff was mushy (think chunky mashed potatoes) with a sweet cucumber sauce on the side that I didn't care for.  The fried shrimp rolls were a little better but they didn't have that bursting flavor of cilantro like the comparable fried shrimp rolls I love (known as the shrimp blanket) from Banana Leaf Thai. Their spicy cream cheese dipping sauce actually complemented their fried shrimp rolls but I prefer the sweet and sour chili sauce instead.The pad thai was mediocre. I have had better. My heated leftovers with a dash of salt tasted better than when I ate it in the restaurant. I noticed they offer delivery. All in all it is a decent restaurant especially for locals who live nearby but to make a trip out here, I'd say nah!"], ["Tiffany D.", "This restaurant is well secluded. I don't think Paul H. and I would have ever found this place if it weren't for Yelp. This is a cute little Thai restaurant that has a nice homey feel to it. The owner was really nice and charismatic. Like a lot of Thai restaurants, their food is prepared sweet with an adjustable level of spice. I prefer my food to be more savory than sweet so this particular place didn't match well with what I like. The cup of tom yum was very generous but sweet. The same sweetness was present in the beef pad kee mao and chicken red curry.  The spice tray contains this potent chili powder. Be careful with it, it may look like benign chili flakes but that stuff burns. I added it to my curry and it definitely brought up the spice level. The curry reheats well the next day. The mango sticky rice was ok. It might have gotten hard the next day so I recommend you eating it immediately and not save it for later. Overall, I'm glad I came here- I now have a Thai recommendation for those who enjoy their food Thai sweet."], ["Jazmin R.", "I ordered delivery from here a couple of times, they always get my food order right, it's affordable and the food is quite tasty!       I'm a big fan of beef pho and their Boat noodles remind me of this classic favorite just a little more tangy and spicy! Also their chicken curry puffs are very delicious the pastry is soft n flavorful, inside it has chunks of chicken,potato and carrots. Overall affordable and delicious!"], ["Adam R.", "We love love love Bangkok Dee!  The food is off the charts fantastic, consistently better than the last time, and it keeps us coming back for more.  The staff is always great and helpful, even if their idea of spicy...isn't this Cleburne kid's.  We've been multiple times but once we used their $15 for $30 deal and did a delivery, even though that wasn't part of the deal, they hooked it up.  The food was so spicy we could not even manage it.  No way, no how.  BUT we gave them a shout,  I drove over to the location, they were beyond gracious enough to replace the order for us, gave us some ordering tips for later on...and they brought me a soda while I waited."], ["Melanie P.", "The food here is really good Thai food ! Get the spicy noodle with beef and Pai Thai with chicken, so delicious !!!!!!"], ["Kevin M.", "Good price, good food.  Very generous portion."], ["Joy M.", "My go to Thai place for boat noodle soup that you can order from their \"Thai Menu.\"  You know it's got to be some what authentic if they have a separate Thai menu you can order from. I've also tried their stir fried suki yaki instead of the normal suki yaki soup, it's very delicious. I haven't tried much else since I usually order their boat noodle soup. Their fried rice is also very tasty, they make it so simple but yet it's very yummy!The owner was there when we went today and she was a very sweet lady, always checking up on us and the other tables."], ["Ed. J.", "First time, takeout. Flavors excellent. Patient attentive staff. Prompt service."], ["Sara C.", "The food and the environment were good. The restaurant is not very visible from the highway, so I never would have been here if not for the groupon. But I am definitely glad I got a chance to try it.! Pad Thai was delicious. For the lunch special the portions were a really big. I'm sure you don't hear that too often! But I guess I don't mind leftovers!"], ["Dolly P.", "It's located in small strip and doesn't seem all that from outside but the inside looks great. I got food to go and it was ready in less than 15 minutes!This place is yum! We got the Pad Kee Mao and the Thai garlic both with tofu. The Pad Kee Mao was good but the Thai garlic was the best! It was a little on the sweeter side even with the spice level at 3 but it reminded me of a restaurant I went to in Austin that's now shut down. Will definitely return!!!"], ["Ro L.", "My husband and I recently dined here because of a Groupon I purchased. I ordered the Basil Fried Rice with chicken, it was delicious. My husband ordered the Yellow Curry with chicken, he enjoyed it as well. One down fall was the temperature of our food, we shared a house salad which I must say was lacking in \"ingredients\" for a $7 salad. Food was good, but with so many Thai places in Dallas, we may not return to this location."], ["Jay V.", "This has become a usual spot for me, they have a comfortable dining area with a colorful fusion vibe. My favorites are the papaya salad, rad nar, grilled pork w/ rice and the pad Thai is solid, probably my go to. They get busy sometimes and it takes a while, but boy is the food authentic or what"], ["Leslie D.", "I have been three times and the food is good. However the wait times are long at lunch every time. I enjoyed the pineapple fried rice and my companions have liked the curry dishes. If you have plenty of time at lunch, it is good. If not, try somewhere else."], ["Minh N.", "Stumbled upon this delightful place because the boyfriend was craving Thai food and they were offering a groupon! It's a cute and dimly lit diner that was pretty empty when we got there on a Saturday afternoon around 2 (we were the only ones there) so naturally, service was very quick. The prices were normal but the portions were surprisingly huge! My boyfriend, who eats like there's no tomorrow, wasn't able to finish two small bowls of tom kha and his pad Thai even though he loved it! I ordered some larb gai and it came out in a pretty healthy portion that I also didn't finish but it was seasoned really well and juuuust citrusy enough, though I do regret only ordering a 3 on the spicy scale when I think I would have liked the 5 level more. The tom kha soup was out of this world! The best one I've had so far EVER. I love mine a little bit sweeter than most so I think this one was just right! I will definitely be back for more larb gai and tom kha soup!"], ["Ac A.", "The owner is a jewel EXCELLENT CUSTOMER SERVICE and the Food is awesome!! U can't go wrong with any of the dishes here.  The glass noodles are very tasty.  One of the best Thai spots I've been too!! This is a hidden gem if you haven't been here!"], ["Jon L.", "Cheap, good food. Fast service. Not the nicest restroom, but not the worst. And if you ask, they have a separate Thai menu with some very spicy, authentic dishes. And there's never a wait. Maybe the seedy massage joint next door is scaring off potential customers?"], ["Jennifer H.", "The food took a long time to come out. My sister and I got the Pad See Yew and Red Curry, both with chicken. The food was good and the service was nice. I did notice that when I went inside the restroom, the toilet paper was a little wet... I'm guessing someone dropped it on the floor. It was a little unpleasant to see lol. Overall, the food took way too long to come out, around 30 minutes. I wouldn't come here again."], ["Audrey P.", "This place has become one of my favorite Thai restaurants in the area. Ordered off the Thai Street Eats menu that included Boat Noodles - delicious, Lard Nah - amazing, and something fried pork - fantastic. Staff is super friendly!"], ["Noah D.", "I got the salmon curry grilled. The salmon was dry which the red curry kind of helped make up for it. But I wouldn't order it again. Definitely enjoyed the other dish thai basil seafood xtra spicy the shrimp was big and fresh, flavoring quite tasty.This place was a lot better than I expected with a cute lil decor. Oh, did I mention it's BYOB? ;)"], ["Michael C.", "Food was great. They had a coupon that got  2 meals and an appetizer, for the price of one entree.  I think  they assumed it was for two+ people with all the utensils. Had wings, pad Thai and curry. All very very good and the price was right"], ["Noah B.", "5 Stars!! Just in case you are star blind.  Pad kee mao?!?! Oh yes, who doesn't love a sir-fried drunkard. Bangkok Dee's did not disappoint. It may just have been the best pad kee mao I've had in Dallas. The chicken basil wraps were ok, the texture was a bit off, to much chewy rice paper not enough non-chewy (not ground chicken) inside. Carrots gave a little crunch but not much. Maybe add something with color since you can see through the rice paper. Jasmine fried rice is basic, but it was done right.  fifth star is for impeccable service and not running me off. A drawn out explanation: I arrived for some meal between lunch and dinner about 3:05pm. I learned on exiting that they close at 3pm, oops. I did not feel rushed, but I did think it was peculiar that four different people came over at different points in the meal. I am fairly sure if the cook came out that would have been everyone working, I was facing the wall so I couldn't tell that the restaurant emptied. They seem to really want us to watch the  Korea vs Algeria (world cup) game was on in the corner.  Two people ask if we waned to move to another table so we could see it better. Hopefully they were not offended by my lack of interest."], ["Lisa M.", "I've been here twice. The first time with a group of friends and it was delicious. Second time I ordered to go. Both times I order Pad Kee Mao. My to go order was completely without flavor and I live far enough away that going back to adddress the lack of flavor just wasn't worth it. I was so disappointed. I'll give them one more try eventually but probably not any time soon."], ["Robin T.", "If you want delivery don't order from here unless you want it 2 hours later!!!! Along with it being wrong and cold then I say go for it! I've given them multiple chances and am finally saying I'm done!!!!!!! Awful services provided by them! Never again will I order from them! I'd rather drive to another place and pick it up!! Do yourself a favor and order somewhere else!"], ["Lauren B.", "It is 12 hours after I had my food delivered last night and I am still fuming with anger. All I've got is a computer and yelp so that's where it's gonna go.Tried this place 3 times. The first time was because of the yelp deal. They wouldn't honor it for delivery (even though it doesn't say so). Fine. I'm hungry and already placed my order. Delivery was supposed to be about 30 minutes. It took an hour and 10. Not ideal. But the food was ok (I got the Pad Woon Sen).Second time: remembered how long it took but this is one of the only places close enough to me that delivers. Called in another order. Said it would take 30 minutes. Shows up an hour and a half later. After calling them twice wondering where it was. To top it off, I open up the order and it's WRONG. I call in furious and the owner promises me a free entree next time. I didn't think I would use it, but apparently, fool me twice, shame on me, I still want my free food.Third and final time: last night. Call in at 7:46 PM. Ask to use my free entree. The guy tells me that they're \"Really busy\" and if I can use it next time I order. UM, no. The only reason I'm ordering again is to pay less. He has to call me back and says it's fine. Tells me it'll be an hour. FINE. Just make sure the order is right. At 9:10PM they call me and ask me IF I STILL WANT MY FOOD. \"The driver just got back and we have your order ready. Do you still want it?\" It's been over an hour. Yes. I'm starving. Why on earth would I not want it? I already paid. Yes. Please. Hurry the f up. Don't talk to me again unless it's in person.10:02 PM I call and ask where my food is. it's been over two hours. \"It's coming. We just remade it. He's on the way.\"WHAT THE ACTUAL EFF. YOU JUST MADE IT AGAIN!? AND WHY DIDN'T HE LEAVE WHEN YOU TOLD ME HE WAS GOING TO AN HOUR AGO. The food got here at 10:27. Cold. That's almost THREE HOURS. The receipt also shows that I ordered at 9:56. NOPE. I will never, ever order from here again. And I suggest you don't either. Not sure how yelp has a 4 star rating on this place. The food isn't great and not worth the hassle, frustration and time I spent on the phone and in starvation."], ["Jay V.", "I have dined in and ordered delivery from Dee and you cant go wrong either way. The chefs are all from Thailand so you know it's going to be authentic. The Tom kha gai is a must for curry lovers. The pad Thai and rad na are my genuine favs. Delivery is fast and free as well"], ["Adamson S.", "Eh - it's OK.  I don't know how they survive because of the five times I've been there, the place has been nearly abandoned every time.  They've been advertising on Groupon like crazy, so maybe they're trying to drum up business.  They're in a crap location on the Central frontage just south of Meadow, and unless you know it's there, you'll fly right by and miss it.  Looks like most people are.  It's average serviceable Thai food and the waitstaff are pleasant and prompt - it's perfectly OK for lunch but not for a date or a special occasion.  Go there, but check out Groupon first - they're on it every other week."], ["Ruby R.", "Visiting from out of town and found this place on Yelp. Great experience. Ms. Annie, the owner, is absolutely phenomenal. She takes orders, brings out food, greets all her guests, is very sociable with everyone.  Lovely experience. Not to mention the food was delicious!!!  Best Thai food ever."], ["A M.", "I really enjoy the food and service here. The staff, and the owner, are always very hospitable. You may even see the owner and hear about the interesting path that brought her to ownership of the restaurant. I have been here with the yelp deal which makes the experience a great deal. Nonetheless, I will be back because prices are very reasonable. You can tell that the staff takes their time preparing food. The yellow and red curry are both delicious, and if you ask for \"Thai\" spicy, BE READY! I enjoy it though. They will cater to your palette though. The BKK dumplings and cram cream cheese apps are tasty as well. I had pad thai which was good. The thai basil steak dish I ordered was very tasty, however the steak was not as tender as one would like. Judging by the rest of the dishes, I am guessing this was a fluke. The chicken dishes were all on point. The place is never too full, but there is always a smiling face to greet you. They even let you use the yelp deal with take-out, which I thought was really cool."], ["Simone A.", "After waiting 2 hours the food finally arrived.COLD AND SALTY"], ["Stephen W.", "I think we found our new go-to Thai place. The service was kind and warm. The pace of the meal was perfect. The food was outstanding. The wife got red curry duck and loved it. I got the Pad Kee Mao and it was excellent, I would get it again if not for the fact that there is so much else I want to try. We started with the steamed dumplings and thought that they were excellent. I have no criticisms or negative things to say about this experience, so we definitely will return."], ["Zach B.", "Pretty sure the Dee stands for Deeeeelicious! I ate here with a buddy and the food was fantastic. Somewhat of a hidden gem, I would go back again. Oh and they had an awesome coupon where we got $30 worth of food for $15 dollars. This is quality thai food!"], ["Jessica H.", "My girlfriend and I are regulars here and love it so much!  The food is amazing and everyone that works there is so nice.  I would say the one thing you have to try is the WONTON SOUP!! I know this isn't the first thing you would order at a Thai place, but the broth they use is beyond amazing! We order it every time we are there.  The fried spring rolls are great too.I have two regular dishes. Chicken Pad Kee Mao: This is flat noodle heaven :)  Chicken basil fried rice: Amazing flavors! I love the basil in there.My girlfriend has one regular dish.  Chicken Thai Spicy Basil: This one is very tastyI've tried a few other dishes like Bangkok Smile Pork, Peanut Chicken, Yellow curry, Shrimp and Chicken Basil.  All are very tasty.  The pad thai isn't the best, but it's still good.From the outside, it doesn't look that great, but it's very decorative and cute inside.  We've also had take out from here twice and I have to say it's not as good.  The wonton soup does not taste the same.  But, that is my only negative comment.  Overall, this place is amazing and I would definitely recommend it."], ["NP D.", "Not consistent. Drunken noodle was bland. Crab Fried rice was bland. Catfish salad was good. The owner, P' Wannee is so sweet and friendly."], ["Daniel E.", "The food here is always outstanding. Last night I got the shrimp and chicken Basil. Michael got the grill chicken delight which he loves. We also got the basil chicken wraps for an appetizer as always. We're both very busy with our work. And we decided we love this place so much why not have it for Christmas dinner . Part of the experience at Dee's isn't just the food which is phenomenal. It's also about the service that you get. I'm very accustomed to going to all newest, trendiest, restaurants in town. I keep going back to Dee's because the food is always great and the service I get is always superb. I'm super excited to share this out wonderful food on Christmas with some of my closest friends and family are coming over ."], ["Angela H.", "Best Thai food I've had in Dallas! The Pad See Eew is AMAZING! So is the mango sticky rice! My roommate and I order delivery about once a week; they make it so easy with the online ordering, so they've never gotten an order wrong! Reasonably priced. Even eating in the restaurant is pleasant, clean, and an overall good atmosphere. I recommend this place to anyone!"], ["Sandor K.", "After reading a mixed bag of reviews on Yelp about Bangkok Dee Thai, I thought I would give the Yelp deal a try and try out the restaurant.  I am pleased to say it did not let me down.  I had my usual curry dish, which I try at most Thai places so I can get a good feel for how it is done, and I was very pleased.  The vegies were cut and cooked perfectly, the beef was tender, the sauce was as I had requested a bit on the spcicy side.  What blew my mind was the corn patties, curry puffs and the wonton soup.  They were  excellent.  I really enjoyed them.    One of my dining companions had the Pad Thai, which unfortunately to say, everyone at the table was under impressed with and another had the Thai Peanut, which I thought was definitely one of the better ones I have had here in the MetroPlex.   Service was pleasant, and fast, I agree with most of my Yelpers, its hard to find and of off the beaten path, but all of that said, I will be going back to try more!"], ["Daniel G.", "Absolutely delicious food, not the best I've tried but the service was freaking amazing.The owner was there, or so she claimed to be, and she is absolutely wonderful, the best! She was friendly all around and accommodated us even when were a 15 person group. The food came in quick.Lamb lover was what I got and it lived up to expectation with the exception that the meat was a bit hard Other than that this is def a 5 star restaurant because their service matches their food."], ["Susan D.", "I literally cannot rave about the food or the service enough.  The owner is so friendly and cares so much about her guests...and everything I've ordered here is fabulous.  The vegetables are fresh, the curries are delicious - even my 8 year old loves it.  It's a random location, definitely a hole in the wall, but with a friendly, cozy, atmosphere (great for families or dates) - and who doesn't love those?  Such a gem and I'm so glad I discovered them!  I LOVE, LOVE, LOVE this place! P.S.  I use them for delivery all the time, and it always comes in before or right at an hour."], ["Syd A.", "So good! The cream cheese rolls were crispy and delicious with the perfect amount of cream cheese. The spring rolls were fresh and the pad thai was amazing. I am very picky about the meat I eat from restaurants and there was nothing sketchy about it. Will be ordering again!"], ["S D.", "I found this place through Yelp and decided to give it a try.I decided to order the cream cheese rolls, fresh spring rolls, pad Thai with chicken and a Thai iced tea.Over the phone, they had said 15-20 mins, so I waited a bit and then drove over.  when I got there, there was only a small group sitting and I think they were either regulars or friends of the owners.My food was still not ready, so I had to wait another 10 mins, but it didn't bother me.  while i was waiting, one woman offered me a drink and another had asked what I had ordered.  It was really funny b/c when I told him, he was like, \"Oh! You got some of my favorites and you will really like it!\"  He was just really nice.  when I finally got my food, he was very nice and told me to enjoy!The cream cheese rolls are so good!  Probably b/c they are fried and bad for you, but they are yummy!Also, the spring rolls are great and come with a good peanut sauce.The pad Thai with chicken entree was huge!!  they give you a ton and I barely made a dent.  I still have a lot left over and it was good.  i did ask for no peanuts and they still gave them to me, but it wasn't a big deal and the amount was very little.Also, the Thai iced tea was good but maybe had a little too much iced tea in it.  Overall, the food was good and I definitely want to try other things."]], "Bangkok City": [["Marjorie O.", "Love everything about Bangkok City. I've been ordering delivery from them for years.Bangkok City shrimp appetizer is my favorite!Main dish favorites include pad pak, pad gra pow and pepper fried rice. Super fresh and love the owners and staff."], ["Bonnie B.", "Bangkok city is soooo yummy! The hubby and I are Thai lovers and found this little gem when we moved downtown. I love the pineapple curry with chicken at a heat level of 3 stars. Creamy, spicy finish makes my tummy happy! Hubs gets the pad see ew with beef and hoovers the whole thing down everytime. The staff is super friendly, and genuine. We haven never eaten in the restaurant but order takeout regularly and we are huge fans of this place. I have had other curries off the menu and all have been amazing!!"], ["Eileen D.", "My favorite Thai restaurant in Dallas.  I have been coming here for over 27 years and it has maintained the highest standards in Thai Food.   I had the Basil Noodle with Chicken. You can't complain on the quantity.  This is one of my favorite noodle dishes. Service is great.  Jan is one of the nicest people."], ["Carly C.", "Some of the best Thai food I've had! Customer service could use a revamp but overall the food makes up for it. Try the BASIL CHICKEN W/ NOODLES"], ["Dolly V.", "The food here is consistent, as well as the service. I love coming here and have always had great experiences ! I've been coming to this location for my favourite thai dishes for about two years now and the quality has never changed! You guys have a forever customer!"], ["Trisha W.", "Pretty terrible.  Ordered the Pad Thai with Chicken as a test run on this place and it smelled like an elderly person's bad breath.  This made it difficult to eat. There were literally two pieces of chicken in it both smaller than a baby carrot.  Thai iced tea had way too much tea and not enough cream, was crazy strong.  Very nice people but good God.  No."], ["Pamela T.", "I got the crispy spring rolls and #33 with tofu and vegetables to-go. Both were delicious. The spring rolls were lightly crisp, and the entree was perfectly spicy. Take out time was quick for a weekend evening, and there was ample parking to get in and out quickly. The indoor dining was sweet and reminded me of a thai restaurant in my home town. I will definitely be back!"], ["Tammy T.", "We ate here on a weekday and surprising it was pretty pack. We ordered their dumplings, which was good, their papaya salad I thought was decent, and their hot pot that was too creamy in my opinion."], ["Trinh T.", "Bangkok City is a Thai Restaurant in East Dallas that has been around for years.  It's known for having traditional (spicy) Thai dishes in a modest setting.My Overall Rating - 3 Stars (Atmosphere, Food, Return)Atmosphere - Bangkok City has seen better days.  It's a cozy, quaint restaurant that has limited space for tables and can get pretty busy.  The decorations are sparse compared to the newer and trendier places.  Also, parking is street only and can get pretty busy.  It can be a challenge to find a spot and get a table when busy.   1/2 Star.Service - Average at best, and out most recent visit it felt like our server didn't even care.  We had to make multiple requests for silverware, chopsticks, plates, etc.  We even resorted to just getting our own items.  Our table seemed to be getting ignored in favor of other tables.  It was overall a really bad experience.  No Stars.Food - Thank goodness the food is good.  As stated, we've been coming here for years, so if we have to fight through average service for quality Thai we'll make the sacrifice.  Our favorites include their whole fried fish, which can vary with size, but comes out with a crispy outside and tender, flaky inside.  Coupled with the sauce and veggies and you have a hit.  The Tom Yum soup is also great, but be warned: Bangkok City is true Thai in that if they say it's spicy, it's hella spicy.  Other good dishes are basil noodles, crab fried rice, and the sticky rice is a good treat for dessert.  1  1/2 Stars.Will I Return? - Yes.  Like Brokeback, I just can't quit you.  Sometimes you find a place that just feels right.  The food is always quality (though I have to tone down the spice).  Service has been good in the past, so I'm willing to give a pass.  1 Star.My Yelp Rating Scale (Sum of all parts):1 Star - Atmosphere - Is it a cool dive?  Perhaps an upscale place?  No matter the type, atmosphere plays a big part and I'll give a star if I like it or thinks it has great charm.1 Star - Service - You can have a great meal with bad service.  But that's also what can make a five star joint drop to four.  It's important to the dining experience that service is great and on point.2 Stars - Food - I'll award up to two stars for the food, since this is the main reason we dine out.  Sometimes the extra star is given for value, but it's really all about the food.1 Star - Will I come back? - If I know for a fact I'll return, I'll give this a star. A place has to make an impression for me to return. Each Category can be given up to 1 star except food (2 stars) because I consider all these categories important to the overall dining experience.  I will sum them up to provide my final Yelp score"], ["Aya P.", "That is my favorite place in Dallas, the food is amazing and prices are great, you don't need to wait so long for the food it takes few minutes even if the place is full, the stuff is very polite and I will recommend everyone to check out this place, try the spring rolls they have, it's absolutely delicious."], ["Nicholas B.", "The food is great here. You do have to be careful what you order. The entrees have all been fantastic. Some of the appetisers have  been pretty bad. Namely the calamari and spring/egg rolls. The calamari was really rubbery and egg rolls had nothing in them. I I sill go here every week though. The Tom yum and tom Kha soup are very good. My favourite is the basil fried rice with chicken and beef. Four star spicy go for it!"], ["Kristina M.", "This place is awesome. It took me 3 tries dragging my husband here for him to fall in love but now he's hooked! Best authentic thai curry ever!! Sometimes when I work from home I cheat and come here for lunch. There are tables near plug ins and it's a wonderful place for a working lunch!"], ["Peter T.", "One of our go to places for Thai food. The only Thai place we like better is Si Lom, but that place can get pricey. This place is close to Baylor medical center where I work and they deliver to my place so we've had this a few times. Love love love the Basil noodles and my wife loves the yellow curry. Pad Thai is also solid. Lunch specials also include a soup or salad and is generally a better deal. Recommended!"], ["Megan B.", "This is my favorite delivery/takeout in Dallas. Seriously. They're on my speed dial. Crispy and delicious spring rolls, magical coconut chicken soup (talk about a flavor explosion!) and tons of fantastic entrees. Some of my favorites include: Hello Ginger with chicken, Clear Noodles - any protein here is fabulous, Cashew Nut with chicken, and pretty much all of the fried rice options are fantastic. Overall favorites are Pad-See-Ew with beef and Avocado Thai Curry - be still, my heart. The Pad-Thai is a bit disappointing if you're a true Thai lover, but if you steer clear of that you'll likely be very happy! PS. The dishes are huge - enough for two servings."], ["Derek V.", "Food is very good for dine in. NEVER NEVER NEVER NEVER ORDER FOR TAKEOUT!!!  EVERY time I get to go, I have had to wait a minimum of 45 minutes longer than what I was told the wait time would be because \"they were busy.\" More often than not, dine-in table customers come in, eat and leave in the time it takes for them to have the food ready for my order which was made 30 minutes before those people walk through the door. It's good food, but not always worth this much trouble."], ["Johanna B.", "Best pineapple fried rice!!  Looks a little sketch on the outside but the food is amazing!"], ["StefieLou N.", "I had dinner from Bangkok City last night, via delivery; I've never seen the place in person. I was torn between 3 or 4 stars. The food was good . . . .but not amazing. The next time I order Thai, I will likely give another place a try to see how that compares, since I am new to the area still. I had the papaya salad, which was very tasty, but didn't have that spicy kick that I have come to love in the dish.I also had the panang curry with chicken. I LOVED the way the chicken was cooked. Some places give you these big chewy/over cooked pieces, but this was perfect. The curry flavor however just was missing something. It seemed a little too sweet, and again, didn't have that kick . . ."], ["Adam C.", "One of the worst delivery experiences I've ever had. I called to place an order for delivery. An hour and a half later I call the restaurant because it hasn't arrived. They tell me it's going to be another 10-15 minutes so I question why it's taking so long. They said it's already out on the car. I ask again why it has taken so long - it is literally 10 blocks away. I didn't get take out because I just moved and am unpacking so I figured it'd be easy. Then she asks my address again, I tell her the same address and she said they had it wrong. I even spelled it with the person on the phone so I don't know how that is possible. She said it came back because there wasn't the address (whichever one they had). So clearly they hadn't planned on ever calling me to let me know they had the wrong address. She said I can get it to you in twenty minutes. So in other words two hours for mediocre thai food that is probably going to be cold. Then she said, well how about you pick it up? I said no. She said do you want it or not? I said not at this point and she just hung up on me."], ["Karen B.", "Delicious as always. My favorite is the Spicy Asparagus, my daughter had the Pineapple Chicken Curry."], ["Lainey H.", "I don't know how to say \"excellent\" in Thai, so English will have to suffice. I've been coming to Bangkok City for longer than I'd care to admit--most because I only ever get three things. I've heard the rest of the menu is great, but when your red curry, hello ginger, and pad Thai is this good--why bother straying? Also, Thai tea--a must for dessert. You can probably drink it with dinner, but there's no reason to obscure that flavor!Oh, and  take out. After you've called once, they'll remember your name and your order. (I mean, I'm sure they use a computer for it, but still....)"]], "Thai Opal": [], "Naga Thai Kitchen & Bar": [], "Saucy's Thai & Pho": [], "Chan Thai": [], "Pakpao Thai Food": [], "Thairrific": [], "Si Lom": [["Heli M.", "I eat here entirely too much... like minimum once a week. So much so they finally gave me a frequent customer card. Shameful. But I love Thai and this place is so good. Si Lom is the best when it comes quality AND service in the Dallas area. To break my habit , I revisited a few other spots for Thai and they were just bad to mediocre: greyish looking beef, soggy noddles, weird tasting curry. Disappointing compared to Si Lom.I have tried their pad ki mao, pad thai, curries, etc. but there's something about their shrimp pananag curry that really hits the spot. They don't skimp on portion sizes, their meat is real and fresh, the delivery is relatively fast, and they rarely mess up orders. Aside from their free delivery (minimum $20), their dine-in option is just as inviting. Well-lit, upscale and modern, it's a great date/ lunch spot night out as well. Just make sure you keep your eyes peeled for the parking garage below ground level."], ["Heman R.", "When we Walked in 30 min after driving 25 min they could not accommodate us How pathetic is that. Rude and bad food Will never recommend this place"], ["Mike Z.", "This place is great, especially because it's my go-to place when I want delivery.  Their food has seemed to always hit the spot.  From their basil chicken fried rice, the the pineapple fried rice, the pad thai, the red curry, or any of the curries - I haven't really been displeased.  Their flavors are not complex but they are comforting so you know what you're getting and enjoy the meal.  It's also fun to mess around with the heat factors with the dishes as I've felt they range differently depending on the dish and how it interacts with the chili oil.Also, I'm a huge fan of their tom kha soup.  There's just enough tanginess to make you salivate and sweetness to calm it as it goes down.  Not to mention, it's just good soup.  I'm a fan over if versus the tom yum soup but I wouldn't turn down either.Ambiance of the place is intimate.  It's a little confusing where you're supposed to park and how to get to it when you pass by it from the street - there's a parking garage around the back of the building and a back door to the restaurant from the parking lot.  They have a sunken patio as well, if you want to sit outside.  I'll be back."], ["Maura W.", "This place delivers!!! If you're hungover in Uptown and want quality Thai to come to your doorstep-this is the place. Pad Thai is pretty solid. Thai Beef Jerky seems questionable, but for someone who doesn't like jerky it was pretty good. Coconut Noodle Soup was great, as well as the traditional Tom Yum.FYI do NOT order chicken. It has the weirdest texture I've come across at a thai place. Great service, and really nice decor if you decide to eat there."], ["Stephanie L.", "This restaurant has a romantic/upscale ambiance with the dim lighting and pretty decor. Our food didn't take long to arrive, and I was surprised by how large their serving size is! I usually finish entrees because I have a large appetite, and I actually had some leftover Pad Thai to go. IF you like spicy food, they can definitely amp up the spice level. I only asked for \"a little spicy\" and I thought it was actually spicy, hahaha, but it was still really good. (Next time I'll probably ask for very mild.)It's a relatively quiet and nice restaurant so ideal for a date, but probably not for large/chatty groups. The only thing that tipped the atmosphere a little off was the music (Karaoke-version of top 40 pop music? Doesn't really fit the restaurant's vibe if you ask me, haha.) Overall, an enjoyable experience!"], ["Diane W.", "I recently got back from a trip and I didn't feel like cooking dinner so I ordered to go from this thai restaurant that looked promising. I got the chicken larb, tom yum soup, and massuman curry. The larb was good, but they should have seperated the lettuce so it didn't get soggy, and the curry was a little too sweet for me, but what threw me over the edge was THAT THERE WAS A LARGE BUG IN MY SOUP. It was the size of half a grape tomatoe. This place is not that great and its dirty! I would not recommend it whatsoever!!"], ["Anitha K.", "It's about time I reviewed one of the best Thai restaurants in Dallas. I order take out so many times and they have my usual saved. Their Basil fried rice has a ton of flavor! I usually get this with extra veggies or shrimp. I also really like their yellow curry noddles and Tom Kha. One huge con about Si lom would be their chicken. I'm not sure if it's just not good quality chicken? But something is up with that and I've noticed other yelpers mentioning the same. Other than that it's a great restaurant!!Plenty of parking in the garage behind the restaurant and quiet atmosphere."], ["Erika O.", "I'm always hesitant to order food from a place even 45 minutes before it closes, and this time I wish I would have gone with my instinct. Placed a phone order for spicy beef noodle soup, to go, for my sister and I. Arrived 20 minutes later and it still was not ready, though they told me it would be. However, that's not the upsetting part. After I get back home to to eat it, I couldn't even make it a fourth of the way. Not only did I find a black hair in my soup but a small dead insect floating in my broth!!! Completely disgusted and angry I spent $30 on this food. I would never recommend this place to anyone."], ["Tatiana N.", "This is my go-to take out for Thai food. The chicken pad thai and the spicy basil chicken are delicious. They give you a good portion for the price and don't slack on the chicken. Sometimes they deliver within 15 minutes and other times I'm waiting for an hour. Either way, I am always happy with what I order."], ["Rachel M.", "Love this place :) we have it for lunch at least once a week, and the staff is so sweet."], ["Doug F.", "Amazing Thai food.  One of the best I have ever tasted!  Super high quality ingredients. Comfortable place. Superb service!"], ["Rose I.", "Wow I really liked this spot! So it's very difficult to notice this restaurant since its one floor down and even harder to figure out parking. But basically parking is in the downstairs garage and there's an entrance to the restaurant from there. It's a very cute and dimly-lit restaurant. I really liked the cozy feeling. Also has a full bar it seems.We shared the red curry with chicken dish which was plenty for two people and also the spring rolls appetizer. The spring rolls were perfectly fried and so yummy. One order has 5 rolls so plenty for two people. The curry was very tasty and I had no complaints! Just kinda wish I ate more lol. I will definitely be back if I am in the area and am in the mood for some yummy Thai food. Our waitress was very nice as well and the customers were such a diverse group which I always think is a good sign. Enjoy!! :)"], ["dean d.", "Appetizers are two dollars off from 5pm-7pm: come and enjoy.I ordered the Si Lom Crying Pork: the waitress ask me what spice level and I asked for \"traditional spice level\": she warned me that was higher than a five. I said go for it.Yes: I'm crying LOL. Pork and veggies were amazing, so was the flavor. The heat slowly crept up, at first only mild and by the time I have half way through my plate my spice tolerance was nicely pushed to its limit. Dang that was a great dish."], ["Jennie J.", "I don't eat a ton of Thai food but this was decent.  I ate from a buffet and tried a few different things which, I unfortunately do not know the names of everything.  Their spring rolls were good and so were the potstickers!They have a wonderful patio area that is actually below street level but is very spacious and would be a great place to eat on a nice evening."], ["Richard H.", "Although Si Lom is only Thai cuisine, Si Lom has some of the best Asian food in the Oak Lawn area. I've been highly disappointed by the Chinese and Vietnamese establishments nearby. Also, every time my roommate and I try to be adventurous and try a different Thai restaurant.. we always have the same feeling...\"We are being punished by bad food for cheating on Si Lom aren't we. We are so sorry Si Lom.\" We've tried a bit on the menu because we always take friends here if they are feeling Thai. Here are some of our favorites at this little gem:1. Appetizers: Thai Beef Jerky - Its unique to this restaurant and its very tasty with   the spicy sriracha sauce2. Salad: Green Papaya Salad - Love the green papaya. Its a little tangier than other places but the texture of the fresh papayas are very good.3. Fried Rice: Basil Fried Rice or the Crab Fried Rice (Real crab meat... mMmm for a good price too)4. Any of the noodles5. Big Bowl Noodle Soups: Really enjoyed the Coconut Noodle Soup and Kao Soi (If you are a big fan of spice though, get 2-3 levels spicier than you normally would with the noodle soups. It seems like its harder to make these dishes spicy.)The decor makes the ambiance feel a little more romantic but its a great atmosphere to bring a group as well, and the staff is always friendly and nice."], ["Alison B.", "We are so glad that we discovered this little gem of a thai restaurant!  It is a little tricky to find.  It is tucked behind a Goody Goody store and parking is underground.  I highly recommend going for their happy hour that is weekdays 5-7 where most appetizers are half off and drinks are cheap!  I get their house pinnacle vodka martini for $6 and it is the best martini in uptown!    If you opt for dinner there are many great options to choose from and everything that we have tried has been excellent.  The owner Chai welcomes all customers with a smile and a warm greeting.  I recommend sitting at their quaint bar and weekdays request Nung to serve you or P.A. on Fridays and Saturday nights.  Both are so friendly and give great service!  I can't recommend this place enough!"], ["Emily M.", "At first I was a bit overwhelmed because we couldn't find parking, but then when we realized there was a garage behind, it was a breeze. You can walk straight in the back door from the garage. Immediately I found the atmosphere quaint and relaxing. You walk down a long hall of curtains into a dimly lit, comfortable dining room. The decorations are a bit modern with some traditional Thai influences. Something about the atmosphere made me feel very relaxed. The staff is very friendly and helpful as well. Now, here's the best part - THE FOOD! When we got there it was still happy hour, so it was $2 off appetizers, as well as drink specials. We had thai beef jerky and the chicken satay. Both were way above average, with well cooked meats, and tasty sauces. My mom got the Tom Kha soup and I'm still craving it right now as I write. For entrees we got Si Lom Crying Pork, Pad See Ew, Pad Kee Mow, and Pad Bahmee. I honestly couldn't pick a favorite. Each one had an aromatic sauce, with perfectly crisped veggies, just the right amount of meet, and delicious noodles or rice. Really, I mean it, this place is a cut above when it comes to Thai cuisine. I strongly recommend you dine here! It was a 5/5 in every single aspect."], ["Tony R.", "Service was great and people are extremely friendly... Food came out perfect and correctly spiced... I received the green curry with chicken and level 2 spice... I wouldn't go any hotter (for me). I will come back again and tell others..."], ["Juliana P.", "For some reason, I always find it difficult to find a lot of delivery places when I travel and don't feel like venturing out to sit alone somewhere. The thai food was really good, but my gripe was the $20 minimum. I hate literally having to order more food than I want to just get it dropped off so I ended up tacking on 3 water bottles to my order. I might pick up next time or try to find a cheaper delivery option."], ["Kev L.", "Si Lom is another great restaurant that I frequent whenever I am craving for good Thai food. This place delivers consistent quality of food and neighborhood service.  Everyone who works there is always accommodating and friendly.  Since I am there often, they immediately greet me by my first name when I enter the room.  Really awesome service in my opinion:-) Now in terms of food, my must have orders are Mango Seaweed salad and Basil Chicken fried rice with extra crabmeat.  I am craving for it while I am composing this review.  Trust me, it's that good!"]], "Somphou Market": [], "Malai Kitchen": [["Monie H.", "1 word -YUMMY :-). My hubby & I had brunch. I couldn't post a pic of my husband's food because he devoured his bowl of Pho too fast. Lol!  My Thai eggs Benedict were equally delicious, and they did not skimp on the shrimp. The Thai iced coffee is great and made with quality iced coffee that easily stands up to condensed milk. Service staff was friendly, patient, & fast. We will be back!"], ["Elizabeth H.", "Malai isn't a bad place but just not my cup of tea. They are a mix between thai and vietnamese food, which I think is quite creative and interesting. I am more traditional asian food though so this is probably why the fusion here is not my taste. 3 stars for effort though!"], ["Jeenee Y.", "Must try the Green Curry.(that's all I gotta say!)"], ["Jo Ann R.", "I went to dinner at Malai Kitchen with a party of 10 on September 4, 2015.The service was good. The drunken noodles and yellow curry were tasting delish...Until a roach appeared and hastily crawled all around the booth...I shrieked and got up and run off the booth in a reflex...along with three of my companions.The manager came and killed it, and gave us a discount...but let's just say I won't be returning."], ["Andy T.", "This is our third visit to Malai Kitchen and every single time we had a perfect meal. First time I had green curry with chicken and it has changed my perception of curries. This time I took Avocado and Shrimp salad and I was pleasantly surprised again. Our friend ordered Drunken Noodles with beef and it was heavenly. In each case quantity was great.Our server was equally pleasant and attentive, not pushy. There was a guy with a smirk on his face who served us sticky rice when we were seated and later was going around the bar touching chairs, to arrange them I guess. He looked like a very serious supervisor but he should definitely learn more about customer service from his staff.Overall, this was a feast for my tastebuds as always and simply my favorite Thai restaurant in Dallas."], ["Sabrina T.", "Malai Kitchen is delicious! I have been a patron of this place on several occasions, especially now that I live in Uptown. I love the ambience of the restaurant and its location near several of my favorite stores. Prior to being Vegan I loved to order the Shrimp Pad Thai, the Jungle curry pot, and the samosas. My fiancé loves the wings and the samosas as well and he is very picky about wings and food in general. Now that I am Vegan, their menu is still accommodating. Last night I had the hot pot with extra veggies and tofu instead of meat, and it was amazing! I also had the vegetarian samosas, which were still awesome! Even my fiancé loves them. Malai is my favorite Thai place in Dallas :)"], ["Kali H.", "The positive was there were a TON of things that could be made vegetarian and/or vegan. Super nice. But. That's the only good thing I experienced.We went for a late lunch, around 2pm. So, it wasn't busy. Our waiter was super slow and unattentive. The peopl near us had their lunch come out really quick. Meanwhile, we are sitting there waiting for Mr. Pokey to show up. He took our order, staring at us all crazy the whole time, and proceeded to clean up two other tables before putting our order in. I order the Pad Kee Mow vegetarian. There were basically no vegetables, which was dissaapointing. Since it's vegetarian... My mom ordered the Bahn Mi with tofu. That was just gross. All of it was cold. I took some of her side of veggies to add to my noodles.Then we waited and waited for the check. Just not impressed."], ["Charis S.", "Where do I start?! My expectations were SO high for this restaurant and my party as a whole was let down. Things started OFF on a bad note. I made reservations for my brother's birthday on a Thursday for 20 people for a Sunday brunch at 1pm. I arrived to Malai Kitchen right at 1pm that Sunday, my name was on the list and the hostess, she said we'll get your table together. Twenty minutes passed and my party started to show up one by one. Table still wasn't ready. As the last of my party showed up, 30-35 minutes had passed and I asked the hostess what was going on?! She said, \"we're waiting on the people at the table to finish up and then your table will be ready.\" *blank stare* wait, WHAT?!?! What's the point of making a reservation if my table is not ready at the time it's supposed to be?! Secondly, WHY sit anyone at the table(s) for a party of 20 anytime CLOSE to the reservation time?! The people that were seated at our table didn't leave until 1:45pm...totally UNACCEPTABLE. So upset. Handled horribly.So we finally sat down, thankfully we got a great waitress, Daisy. The whole time, she was calm and cool and even when mistakes were made, she was very apologetic and solved the problem. She explained any drinks that we had questions about and made suggestions, which was really sweet. She was pretty much the only positive thing about our experience. Her, the Imperial Rolls, the Vietnamese Meatballs and the Pad Kee Mow. When it came to ordering, the Thai Eggs Benedict was a hit. I heard it was delicious. I ordered the Shrimp Pad Kee Mow, which was delicious, but I feel like I didn't get my money's worth because more than half of the bowl was filled with lettuce. I DID appreciate the five pieces of juicy shrimp though. The French Toast was pretty much moist, sliced pieces of baguette. Dry. The bread was barely soaked in egg mixture. Two people at my table had it sent back. THEN, one of my girls ordered the omelette. It was like they threw a salad/veggie mix inside, grilled up three pieces of shrimp and literally threw it inside. So sloppy, terrible presentation. On top of that, the potatoes on the side were burned to a crisp and I believe there were about thirteen on the plate. So here's where things went HORRIBLE. My friend that ordered the shrimp omelette, she returned it and asked for the Shrimp Avocado Salad. It took so long to come that she asked one of the passing waitresses to tell the kitchen to cancel it. It was brought out anyways and my friend said, \"oh I don't want it anymore.\" The woman, in the rudest and most blunt way possible says, \"oh we already made it.\" Places it on the table with attitude and walks away. We found out later, from our waitress Daisy, that the woman with attitude was the OWNER of all people, Mrs. Yasmin Wages. No personality, straight up rude and to work in the hospitality industry, she failed MISERABLY and treated us like crap. Daisy apologized on behalf of the restaurant and we definitely let her know that it wasn't her, but her owner made our experience, just bad. I wanted to try the Mango Sticky Rice so bad for dessert, I really wanted a happy ending, but we couldn't have gotten out of there any faster."], ["Stacy Y.", "Came here for brunch on a Sunday, and I loved that it wasn't super crowded! They also have a dog-friendly patio, so I'll be sure to bring the pup next time.We ordered a couple of $3 mimosas, the fried imperial rolls and thai chicken wings (appetizers were 2 for $9), and the bahn mi french toast and thai eggs benedict for our entrees. The imperial rolls were not too good--the fried crispy rice paper wrapping were more just hard than crispy. The chicken wings and the entrees were all super tasty though. And the coconut biscuits that were the base for the eggs benedict? SO good. The two entrees that we ordered definitely seemed the most interesting on the menu; nothing else sounded particularly good. I'd be willing to come back to try though!"], ["Slowsteady S.", "I call it an Asian Fusion Restaurant with a strong Thai/Vietnamese twist to it! The food here is generally good. My server Daisy was awesome, very friendly, attention to details. The Thai egg Benedict served on Sunday could use a little more flavor, might be bland for those of us who are used to the American version of it. It's made with a coconut biscuit instead of English muffin. And shrimp instead of ham. So I added their homemade sriracha sauce to it & it was oomph ! I love their sriracha sauce with anything. No, it is not the same like the store bought one. You have to try it! Imperial rolls were good. Chicken wings too. Peach ginger green tea & iced Vietnamese coffee was all good. Had a good experience overall. Highly recommend & will have to return to try more stuff! Surprisingly their prices are not too high despite their location."], ["Hemali P.", "Great brunch food! Absolutely enjoy the coconut biscuits.  Very clean restaurant and friendly staff."], ["Kim J.", "Oh, Malai Kitchen. Why must thou reside so far, far away?! Now having a constant craving for Red Curry Hot Pot with Shrimp and wondering WHERE in Toronto I can find it. Visited MK during a recent trip to Dallas. Was on a great date with a wonderful gentleman caller (good people). We were ushered to a corner booth (good atmosphere) and promptly greeted by a friendly server (good service). Check, check, check!We started with the tuna spring rolls. Fresh, delicate textures served with a spicy sauce and a peanut sauce. We had fun tying the fine carrot garnish strips into knots (no seriously, try it). My date enjoyed a spicy green curry chicken and pasta dish. The flavor was amazing (yes, I sampled his dish. Hey, he offered...)I read about the red curry hot pot and decided to give it a whirl. Oh yes. OH. YES. The chef is generous with the jumbo shrimp. The bowl has a hearty serving of vegetables (which I appreciate) along with rice noodles. I chose extra spicy because I'm gangster like that (also West Indian - so the hotter the better for me!) It was a delicious red curry broth complete with a crispy noodle garnish. I didn't want the date or the meal to end. Alas, it did. MK is definitely a go-to spot in Dallas. If you like good Thai food, you'll enjoy it."], ["Jessica V.", "Went here for brunch with a few friends. They have happy hour all day on Sundays have some great Thai inspired items. I really enjoyed the Thai tea cocktail. I never would have thought to add alcohol to that! Their Thai chicken and Vietnamese meatballs were on happy hour and were really good! I actually preferred the appetizers to the entrees we orders. I ordered pad Thai and I wasn't impressed. It was a good portion size but wasn't the best I had. I would recommend it for a great place to have drinks and happy hour."], ["Grace J.", "Ughhhh this place is so good! From the free sticky rice appetizer to the main course to dessert, everything is amazing! Great service, too."], ["Leland B.", "Tucked in an unnamed side street off McKinney, you'll find this gem. I went for brunch with friends. Great idea and they have Sunday brunch happy hour. I'm not crazy about asian food. This is definitely an exception. The french toast and the eggs Benedict were very good. Flavor was all kinds of goodness. No just all sweet, maybe a little spice too. Sometimes I prefer authentic food that represents the culture, but in this case I don't mind the American twist and I think it works for the area. Definitely worth going back. For drinks, get the mule. Best one for sure.If it's nice outside definitely ask to be seated at the patio and enjoy the fresh air."], ["Sanna R.", "Me and a friend were looking for a good brunch spot, and all the \"top brunch spot lists\" pointed to Malai Kitchen, so we checked it out. So glad we did!I'd been before - a few times for dinner, but today was the first time for brunch. Amazing! We shared the Banh Mi French Toast and Thai Eggs Benedict. Perfect combination of sweet and savory. Shout out to our server, Jeremy, for the suggestions!The layout (bar, booths, and patio) makes it great for a date, time with your friends, framily or family. It's kid-friendly too. It's surrounded by shops if you feel like taking a stroll before or afterwards as well.If you go for dinner, you must try the Pad Kee Mow!"], ["Nathan A.", "Service was poor, uncoordinated and unpredictable.  We had a total of five different employees come to our table to take drink, appetizer and food orders and to close the check.  When the food arrived it was not as ordered, neither the special requests or prompted parameters like heat level were executed at all.  Overall the food lacked any remarkable flavor beyond the obvious; as in the vegetables tasted like vegetables, the curry like curry, and the cod was expectedly stinky.  Indeed the only things that were decent were the sticky rice appetizer, with the curry-tamarind sauce that was almost identical to S&B curry mix you can pick up at any grocer, and their version of a Moscow mule.I would not recommend this place to anyone unless they are in a life-or-death need for Vietnamese-Thaiesque food on a Sunday and every other place nearby is closed."], ["Madeline A.", "The past few times we've dined at Malai, we've run into some problems. Our dishes tend to be lacking flavor and spice, but come with an overwhelming amount of salt. The rice with the 3 curry dishes tasted like pure salt. The Drunken Noodles (medium spice) were extremely mild, so I added the House Sriracha (which turned out to be sweet and mild). On the plus side, the service was good."], ["Joanna T.", "Best Mango + Sticky Rice dessert I ever had! Puts all the others to shame.. Unlike the other typical sour mango slices and bland sticky rice I've had at other Thai places, this one is a combination of ripe mango, sticky rice, sweet coconut custard, and rice crispy. RICE CRISPY. It was heaven in a coconut. Also.. $3 mimosas in Uptown? I'm a fan!"], ["Jenny C.", "LOVE THIS PLACE! Came twice within 4 days and probably gonna make it a weekly occasion.Food (4.5/5)I've tried a LOT of Thai places, but the dishes here are SO FLAVORFUL. Definitely think it is very authentic with a kick of American fusion in terms of presentation and addition in ingredients. -Chang Mai Noodles: Delicious! Strong curry smell if that is something you are weary of. You can save the broth and serve it for another meal with rice.-Shrimp Pad Thai: So surprised that they gave you so much large sized shrimps in the pad thai.Service (5/5)Funny story: My friend ordered the drunken noodles extra/super-spicy thinking that the spiciness level would be comparable to barely spicy compared to traditional Asian dishes. Boy did he regret it. (5/5) on staff's attentiveness. Always got his water glass filled. It was pretty funny. Well deserved, great show for us and the waiter.I love this place. Favorite Thai restaurant. Have to try it!!! Also, don't get super super spicy on anything."]], "Royal Thai": [["Stacy R.", "I go to Royal Thai for lunch with coworkers quite a bit. The service has always been very good even when they are really busy.Let me talk about the food. The peanut dressing on the starter salad is so delicious.  The salad itself is very simple, but that dressing...I've tried quite a few things. I usually stick with chicken or beef. Everything I've tried so far has been excellent. My favorite thing by far is the massaman curry. Just so so so good. I can never eat the whole dish at lunch. This is fine by me because it might be even better as an afternoon snack."], ["Farheen I.", "My last visit should serve as a warning to anyone with nut allergies, this place simply cannot accommodate you (but they won't tell you). I have an anaphylactic reaction to cashews. I told the waitress this and specifically asked if my curry has cashews. She said no. When my curry came out, i took a few bites and felt a little something. I fished around to see what was in there, and there was a whole huge cashew floating around. When I called the waitress over, she apologized and said the kitchen must have accidentally dropped one in there. Excuse me?!?! This is completely unacceptable, especially since I told her I was very allergic. I didn't end up in the ER, but I spent the rest of the night sick to my stomach and drowsy from my cocktail of medicine I have to take whenever I've been exposed to cashews. I will never come back. Thanks for almost killing me, Royal Thai."], ["Ann P.", "Be prepared to look around for a parking spot during lunch hours. I know I did!I was thoroughly impressed with the service because even while it's busy they brought out the food quickly. The waitress brought everything correctly. She did not ask me how spicy I wanted it but at least my food came out mild because I would rate 0 on the spicy scale anyways. :)I ordered the yellow curry with tofu and rice. It was delicious. It's definitely not the best Thai food I've tried but it was good for what it was. It's all affordable and the menu is extensive."], ["Jacqueline C.", "This is gonna sound weird, but I have a \"favorite\" thai place that I've been loyal to for years, and going to Royal Thai kinda felt like I was both cheating on my local restaurant and setting myself up for disappointment. I'm so glad I cheated! I refuse to say it's the better than my long time favorite, but I will admit that it's equally good. Plus, in all honesty, it's more upscale than most Thai places (if you're looking for \"date night appropriate\"), and the portions to price ratio is above average."], ["Robert G.", "A lovely gem of Thai cuisine in north Dallas.  There menu is made up of all of the Thai classics you would expect.  Service is usually spot on and even with consistent crowds it is usually easy to get a table.   If you are in the mood for Thai, this is a solid option."], ["Ivy W.", "One of the better Thai restaurants I've tried in the DFW metroplex. The menu is more diverse compared to other Thai restaurants. Instead of just the typical Pad Thai and curry, they offer sea bass in chile sauce and other dishes I haven't tried at other Thai places. I highly recommend the minced beef lettuce wraps and the pad Thai. The Thai iced tea was a little too sweet for my likingMy favorite thing about this restaurant isn't the food - it's the decor and the atmosphere. The waitresses are dressed in what I believe is traditional Thai dresses and they have Thai inspired trinkets and pictures everywhere. Nothing basic about their set up and accessories."], ["Adam M.", "I love Thai food and had a really nice first experience here. I went for lunch solo, was pleased to see a packed house and accordingly sat at the bar. The lunch menu has a lot to choose from and all of them come with either a salad or the soup of the day, plus a spring roll. Pretty sweet sides if you ask me, all for a reasonable price.I ordered the panang curry with tofu and enjoyed it immensely. The star was the SOTD though, some sort of spicy cabbage in a light broth. It had a ton of flavor and was very clean, pairing well with the tasty iced coffee I got.It was a quick experience, but successful. The price for lunch is excellent, the food tasty, and the service snappy; they got me in and out. I will be back for dinner one day to spend more time and enjoy the inviting atmosphere of the space."], ["Britney Thuy T.", "I should have known it was not catered towards the quality of the food but towards trying to be a fake \"fine dining\" experience by the strict dress code and a guy in a suit that greets you as you walk in. Strike 1.Then we began to order our food, when I noticed the waitress did not even ask how spicy we would like our food......at a Thai restaurant.....a THAI restaurant.  Strike 2.The food came out and sure enough, was not spicy nor flavorful, unless you count \"1 bag of sugar sweet tea\" level of sweetness in your pad Thai as good Asian flavor. Strike 3. I would discuss the slow service but honestly what's the point."], ["Stephanie M.", "It's 4:40 pm on a Sunday afternoon and we decide to go get some Thai food. It's 100° outside and my brother is wearing a tank top. There's three of us in our group and the restaurant is empty besides one other couple. 5 people. The one other woman in here is wearing a tank top as is our waitress. However, my brother is being refused service due to dress code. This is NOT a 5 star restaurant, there is nothing posted about dress code, and it's Sunday afternoon. I am super unimpressed with this experience and will not be returning. A lame ass hole in the wall Thai food place trying to pose as fine dining. I'm sorry, you are located in a shopping strip, next to a Subway and a Massage Envy. Keep it classy, Royal Thai. You are a joke.Update: the waitress is also wearing flip flops."], ["Camille K.", "Delicious! We had pad Thai, cashew chicken and chicken fried rice. Everything was very flavorful. Can't wait to go back and try something else. My only complaint was it was way too hot in the restaurant. Too many people to have the heat so high."], ["Thomas P.", "The food was fantastic. The spicy catfish bursted with flavor, and the calamari was really good. The soup also had a lot of flavor. The pork Preaw Wan had a very sweet and tasty sauce. The problem I had was that the food wasn't incredibly spicy. They assume because that we're Americans, we don't appreciate spicy food,(we do.) Tell them that you'd like your food (x) spicy, or they probably won't add any spice."], ["Paige G.", "Great food, but staff was weird at the bar while we were waiting for our table. Ordered a glass of wine and had to ask 3 people to actually get it after ordering."], ["Marianne C.", "Cozy, warm and intimate yet casual place for a really good Thai food. Found this place because of other Yelpers. I wished I lived near the area to get my hands on their lunch specials. :-)This place is tucked inside Old Town shopping center. Parking is hard to come by especially during lunch/dinner rush hour. Their waiting area is small and I didn't think they have any benches right out front. Service is fast, food is great. We ordered the Panang Curry(11.99) and Pad Thai with Beef (10.50) both of which is very good. The curry is creamy, sweet and very exotic to the taste, I can't stop eating it while the Pad Thai, compared to other Pad Thai's around have a much better quality ingredients (talking about the meat quality). Would definitely come back and try other food items. I highly recommend this place."], ["YaGritza J.", "I called here to place a to go order. The individual that answered sounded very rushed. Almost as if he didn't want me to place my order. It was more than an hour before closing. When I was trying to finish my order, he said \"ok got it\" and hung up. When I went to pick it up, the order was completely wrong and there were no utensils or condiments with my meal. When I returned with my food, he didn't seem apologetic or anything. Then said I had to ask for utensils for dinner. Very horrible service."], ["Jennifer W.", "The best Thai Restaurant in town. i highly recommend pad thai and orange beef."], ["Valerie W.", "Good food, good atmosphere.Tucked away next to a chicken joint but once you get inside your transported!Really good soups. I always get fried rice which is hard to mess up.Worth a trip if you have more refined taste you will definitely like it and go back!"], ["Stephanie L.", "I keep coming back to Royal Thai time after time. Maybe because it's conveniently located near SMU, maybe because the service is always prompt, maybe because the food is always on par. Probably all the above.My go-to is the chicken Pad Thai, which is very cliche (I know), but I can't help it! It's so good and you just can't go wrong with it. They always ask you how spicy you'd like your entree so that's great -- especially since I can't handle spicy, haha. Their portions are great and I'm always very satisfied every time I come here to eat.I have also tried the Panang Curry which is also delicious! My only complaint is that for the giant bowl-size of curry that they give you, they definitely don't give you enough rice. (Just a small bowl of rice. If you want more, you have to pay an extra $1.) The consistency of the curry is kind of thin so you can pretty much drink it like soup though. Not overly salty but still very tasty.I always feel like I should branch out and try other items on the menu, but I keep coming back to that Pad Thai. But I'll keep coming back as a happy customer. :-)"], ["Emily C.", "One of the best Thai food places in the area. The food quality and taste is consistent and service is pretty decent.Like all Thai food, food can tend to be a little on the oily side; however, flavors are always good at Royal Thai. They have a special duck curry that is delicious, and you can't go wrong with one of their noodle dishes. They are located in the Old Town shopping center on Greenville, so parking is easy"], ["Lindy C.", "This wouldn't be on the top of my list for thai food but it's okay. I came with a group of 8 friends and not unusual they did not seat us until everyone arrived. It wouldn't have been an awkward situation but the inside of this place has no room. There is no room inside for guests to wait so 5 of us awkwardly stood inside the bar seating/hostess stand/front door so we had people walking through us and we had the hardest time trying to move out of peoples way. Luckily after 20 minutes the hostess decided to seat us even though 3 of our friends had not arrived yet.The food took slightly longer to arrive at our table than what I normally see with a party this size but they were very quick to get our drinks. I had the thai tea and it is a must order. I feel like they make it a bit stronger to account for the watering down effect from the ice. I had the pad see ew with pork and my bf had the spicy noodles. My noodles were good, good size portion but I had to season it with many of the sauces on the table to make it flavorful. The spicy noodles looked delicious and being a wimp when it comes to spicy foods (I like them I just can't tolerate them well) but it was good and VERY spicy. My bf who orders everything spicy found it to be quite spicy too.Overall, I like this place but I don't love it. I suggest avoiding this if you plan to have a party size over 4 people and if you do come you must order the thai tea."], ["Derek S.", "If this is what royals eat, bring me peasant food!The establishment had a nice vibe inside and the menus looked good as well- plenty of options to choose from- and the service was decent.  But that's about as many nice things as I can say about this place.I ordered the garlic shrimp and it came out faster than s toasted pop tart- which was a little suspicious.  We were there just before close so it's possible we were getting pre-cooked leftovers.  It ended up being mostly a plate of chewy broccoli with 10 pretty small shrimp for $14- not really enough to fill me up or make me feel like I received a good value at all.My roommate and his fiancé got the pad Thai and weren't impressed either.  The conspiracy theorist in me wonders if our bad experience may be partially due to his fiancé wearing a sleeveless tank (which was strictly forbidden by a printed notice upon entering the restaurant).  We did not expect this or mean to disrespect their dress code.  However, in turn, it was our taste buds that felt disrespected.I wouldn't doubt the positive reviews here, maybe we just came at a bad time, but it will be hard giving this place another look when there are so many good restaurants in the area.  I don't mean to go on a Thai-rade but I was overall very disappointed in Royal."]]}