{"Café Stella": [], "Perch": [], "Little Next Door": [["Kira L.", "Great place to meet friends for lunch or a cute date when the weather is good. They have an outside seating area that is quite nice on a good-weather kind of day.Parking - ValetService - very helpful and friendlyFood - very good and FrenchWe ordered the Escargots, which was very good and the sauce that they come in is awesome with their bread. Definitely recommend ordering these. Their soup of the day was Cauliflower, which was good, but I think next time we'll try their French Onion Soup. We also got the Mussels, which were also pretty good, and the broth (again) very good with bread. If I had to choose between the 2 though, I'd definitely go with the Escargots - they were perfect. We also ordered the Penne Pasta, which was surprisingly very good. It's hard to impress me with pasta, but they cooked their pasta perfectly al dente, and the flavors of their seemingly simple sauce were perfectly seasoned. Neither salty nor bland, I was impressed with how good the pasta was. Definitely one of the better pasta dishes I've had in awhile. Cute little French restaurant that I definitely recommend and would not mind returning to."], ["Jeff S.", "The whole experience with this restaurant was bad. There were at least 5 flies flying around us, the waiter has moved us to the other table which does not help at all. When we told them about the flies they just blame to the weather (it was a hot day), no apology, really? I just want people to know how this restaurant treat their customers. The food is good  here but I will not come back."], ["Jenny P.", "Cute little French place. Came here for lunch with a few friends. Though I was eyeing that croque madame I am a sucker for risotto and ordered the salmon risotto. The fish was cooked perfectly and the skin was oh so crispy. The risotto is different than what you find at an Italian restaurant. It was not as thick and cheesey with the sauce more runny. Delicious flavors. My 10month old was scarfing it down with me. Prices are a little steep but food was good."], ["Vanessa D.", "Good lord I love French food and Parisian ambiance. This is a wonderful, charming spot for breakfast or lunch in a quieter area of Beverley. Their food is absolutely stellar (I mean, it's French after all) and whether or not you sit outside or in, it's a great environment.  I've been here several times and it always delivers. For Breakfast try..... the waffles and berries with mascarpone cream... I mean, c'mon. Just say yes! For Lunch try.... the herbed goat cheese and avocado sandwich...you'll have died. and. gone. to. heaven.For anytime... I consider myself a croissant snob and trust me, the ones here are just as good as the ones in Paris. Flakiness perfection! Why not pick up one... or a dozen... for the ride home? :)Tips:- Beware of parking on side streets in the area... tickets abound!- The food is top quality, but not one of the cheaper options in the area. Breakfast and lunch will run you between $12 and $23, respectively. - Call ahead to check the wait, as it's popular on the weekends. They take reservations, always a good idea! - Brunch is served until 4pm, so take your time rolling out of bed and grabbing that mimosa. Hair of the dog!"], ["Haley C.", "The waitress was friendly. Me and my friends ordered two smocked salmon Benedict and a wild mushroom Benedict to share. They were perfectly cooked! I think the beard under the eggs really helps this cafe to stands out on top of other cafes. It's little more sweet thus it is good for customers who have sweet tooth. The environment itself was perfect.. Hollywood style!"], ["Vadim d.", "I can only rate the bakery as I have never dined here.  I wanted to, but for some reason or other, never quite made it in.  Still I think they have great atmosphere and the food looks authentic and delicious.  If it's anything like Little Door, then I am sure it's good.However, their bakery is great.  Their palmiers and madeleines are outstanding and worth the visit alone.  I can't say that I am a big fan of the macaroons and believe L'ette is much better.  But everything else here looks good and tastes great."], ["Pammy P.", "My friend and I went to Little Next Door for the first time 3 weeks ago for DineLA. Great opportunity to try out new restaurants and everyone should take advantage of. We both had a really good time, super cute spot, and we sat on the patio and people watched. We tried the fried bun and country crouton for apps, half chicken and steak cauliflower for entree, and coconut cheesecake and creme brûlée. Also, since we went on Bastille Day, they served us free rose wines which was awesome. Everything was delicious and I already recommended this place to a few friends and coworkers. However, I probably wouldn't order steak cauliflower again even though the sauce was really good. I love meat and I didn't know it was a pure cauliflower dish lol my mistake."], ["Hang N.", "I was more impressed by the service and ambiance of this restaurant than the actual food. all in all, nothing i tried was terrible, but nothing was great either. Some of the items I tried: french onion soup: very salty!escargot: needed more salt!Pomme frites: liked this dish the most. love the thin cut of the fries. they were cooked well Grilled Marinated Daurade Fillet: this was nice and came with a medley of roasted veggies (tomatoes, fingerling potatoes, artichoke). i liked the flavor here but some parts of the fillet was overcooked coffee eclair: so so. nothing to write home aboutwhat i did like about the restaurant is that there is a prix fixe menu. i'm not sure if the items on the menu changes from time to time but I think for $35, it's a good deal to order off of there. keep up the great service!"], ["Muy S.", "Cute place! I like that the staff IS French! And so were some of the customers.I would definitely recommend the mussels. The sauce is amazing, flavorful and buttery.  I couldn't stop dipping the complimentary bread in it.  You can't go wrong with the mussels and fries.Dessert: I loved the chocolate soufflé. The chocolate hazelnut cake was very rich.I was pretty full but you know I can't deny free food, so I got a free cookie with the yelp check-in. It was still very good the next day :pService was alright... I did not like our table.  It was in an awkward spot by the door and the pastry display, so perhaps we could have gotten better service if we had been seated among other diners.Valet parking!"], ["Angelica E.", "I stumbled on this place through Instagram somehow and bookmarked it. My boyfriend and I were finally able to go here a couple month back, and I am so glad I found this place! It's honestly on the small side, but it is so cute and personable (kind of on the hipster side, but still love it). We came on a Saturday for brunch and let me start off by saying it was kind of hard to find parking.  I mean, when is it not, it is LA. But since this place is located close to a neighborhood they have parking signs that limit you or require a permit. My best suggestion would be to just pay the extra couple of dollars and just valet it.I was expecting it to be a packed, but it wasn't. There were larger parties there, but we were seated right away because there was only two of us. We sat outside because it was a nice day and the their outdoor patio area is just beautiful. Our waiter promptly greeted us and asked for our drink order.I don't think people know that they offer brunch because the website doesn't provide the menu for brunch, but their brunch menu has a lot of variety, I chose to get their french toast with fresh squeezed orange juice and he picked their salmon eggs benedict with apple juice. While we were waiting for our food to arrive they give you bread and butter like most places do. Our food came out shortly after, and it was actually a minimal amount of time that we waited. The food looked AND tasted excellent. The french toast was made with baguettes and came with three pieces paired with a small bowl of greek yogurt as well as some fresh fruit. It was very fluffy and the bread was not overly soaked with egg which is how I prefer it. My boyfriend's salmon eggs Benedict were cooked perfectly and tasted great (according to him. I like that they ask how you would like it the poached egg cooked AND actually cooking it how the customer asked for it (some places do hard when you ask for medium).Overall, the service, food and atmosphere were wonderful! I definitely want to come back to try their other menu items!"], ["Christy K.", "Amazingly cute brunch spot. If you plan to come on the weekends, try and get there before 11:30 to beat the crowd and long waits. The restaurant itself isn't very big,but it's cute and thoughtfully decorated. Valet parking is offered at a fee, but there's also street parking everywhere. The orange juice is freshly squeezed and amazing. Although, I wouldn't consider the large size very large.For some odd reason, I got the hamburger during brunch hours. It was very large in size and I had an extremely difficult time finishing it. It tasted good, but was nothing special. It filled my stomach and sent me home with some leftovers.My boyfriend did brunch correctly and ordered the salmon eggs benedict. The dish was amazing, and I'll probably order something similar next time. The serving of salmon was pretty good, and the sauce complimented the dish extremely well. And of course, it was beautifully presented.We will definitely be back. Love the atmosphere, service, and food!"], ["Cindy ..", "Went to dineLA at the little door and the little next door, and honestly prefer the little next door much more. The portions are generous for $30 compared to the little doors $50 course. But of course the little doors vibe and ambiance is more romantic and classy. I ordered the friend lamb bun, although very good but my bun basically had no lamb in it...don't know if that was a mistake or they were just trying to cut cost. Had the salmon and risotto for my main course, it was okay, nothing special the risotto was pretty plain. To top it off got the coconut cheesecake, it was good but way too soft for me, was more like a cheese flavored mouse, the graham crust was not hard enough either, too soft and soggy a little. But for the price, portions and ambiance I would say my experience was pretty good."], ["Charlie A.", "I was running errands in LA and we were in the mood for brunch. We turned to Yelp in order to find a restaurant that offered brunch and we were led to Little Next Door.  So happy we went here!  My friend and I shared a few dishes in order to try a bit of everything and lo and behold, everything was delicious. We started with the truffle fries; the truffle oil was actually noticeable and flavorful which was nice! We also had the country crouton and croque madame. I loved the country crouton since I'm huge fan of burrata. But overall, everything was just fresh and delicious. The champagne mimosas were great. The only thing that kind of rubbed me the wrong way was when we asked for mimosas, she inquired \"Champagne?\"  That's it -- very abrupt and short. If there were other options, she should have listed it (i.e. \"Yes, so we have champagne, sparkling wine, etc.\" instead of us assuming what they have in stock.We closed the meal with creme brulee which was fantastic.  If I'm in LA, I will definitely have to come back as the place did not disappoint."], ["Lolita T.", "The Vegan wrap is a filling, texture-ous (in a good way), light, and a delicious big healthy thing to share."], ["Helena H.", "Fun, romantic, adorable French cafe. Came in for DineLA.The patio seems to be the area to be sitting at. While you're enjoying a glass of wine ( which they have a large amount to select from), you can people watching; or waiting for Pres. Obama to drive through.Called to make resi, but apparently they don't take reservations for parties smaller than 6 people. When I called, they made the reservation, but when I called to inform them I was running behind, the gentleman said they don't take the reservations, but it should be fine.Slow start as we got seated. Maybe after 5-7 mins of getting seated, the server finally came to greet us and offered water.DineLA menu wasn't bad at all.Capri's salad :light and refreshing for a summers day.Melon and Prosciutto: also very refreshing.Had to order the Escargot:  butter and garlic; can't go wrong with that!Seafood Fettichini: Loved it. And it wasn't too salty or fishy.Steak kabob: so much flavor in the kabob and I loved the couscous.The desserts weren't a hit in my book. just ok.Service was much better after Obama drove by. Workers realized it was time to work. Haha. Hey, it's the Pres. I get it.bon apetit!"], ["Jiwon Y.", "Loved this place!!! I came here for just desserts and the coffee, lemon tart and the creme brûlée were so good!!!! Recommend to park your car on the street! The valet is 8 dollars."], ["Vivian W.", "I looooove the atmosphere here. The interior is Colbalt-themed, very Paris, and even the waiters are French (if not some sort of European). They also have an outdoor seating area and nice music. I'd say my favorite part about this place is the atmosphere. In terms of the food,  ehhh it wasn't anything that special. The food was good, but I don't think it was worth the price tag. I'd come here again for a date, or a girls brunch gathering. It's the perfect place for that lazy Sunday afternoon."], ["Christina S.", "The adorable vine covered patio is the undeniable draw of this top notch French eatery.  The ambience is relaxing with european elegance and a small countryside feel on what is, ultimately, a pretty busy street.This is the perfect place to take a date for dinner: stunningly romantic, classy service, and superb wine to go with a superb dinner."], ["Thomas Ticha P.", "This is absolutely a wonderful French restaurant. I would almost dare to say that it is the most authentic casual French restaurant that you'll find on this side of the states. You can order in French (if you speak it, obviously) and the food is done right. I came here with a friend and after living in Paris for a while, we missed the feeling of dining in France.This just made us nostalgic. The Terrine du Jour was wonderfully prepared and tasted exceptionally balanced. The French Onion Soup is very good and filling. I have not yet tried the rest of the menu; however, I'm sure I will come back to try every single item I can think of.I would recommend this for a casual meet-up with friends or even a date. You really cannot go wrong at all."], ["Tarah V.", "This is one of most difficult reviews to write, because I don't know how to accurately convey how incredible our brunch experience was earlier today. (If you stop reading now, know that food is beyond spectacular, a foodie's dream, a must go-to that will surely impress.) I called at 2pm on Sunday to make sure they were still open and serving brunch (all items located on their lunch menu online).  They answered promptly, I was not put on hold, and yes they were serving the lunch menu. There wasn't a traditional host stand, but not a minute after glancing around, a woman greeted and sat us at a table. They were out of the Croque Madame, not sure why, but if that's your food of choice definitely arrive earlier! Our second choices, ham and gruyere croissant, an omelet, and (mine) poached eggs Provençal, simply put, were out of this world. The eggs were poached to perfection, runny and soft, and the ratatouille was hearty, fresh, and flavorful without overpowering the eggs. Great portion without gorging myself. The highlight was the ham and gruyere croissant (and $5? Crazy). I don't care for ham, yet I loved this and ordered one to go. The cheese was delicious, the croissant flaky and buttery, and it was enough that my husband graciously shared some with each of us and it still filled him up. It was decadent and rich without the stomachache. I could go on, but it still won't be enough to describe how insanely good the food was. And I haven't even started on the gorgeous decor, charming French accents, or excellent coffee (They have soy milk as a dairy free alternative, although I didn't see it on the menu).  It's a little pricey for my usual brunch ($20ish pp without alcohol), but worth every single bite."]], "A Food Affair": [], "Petit Trois": [["Cesar R.", "I had this review on the back burner since I checked it out back in August for a birthday lunch...Truth be told, I recently saw my review draft and all it said was....\"honey. ham. slather butter on Ludo.\"I don't know exactly what that means but I'm pretty sure I'll be describing it in detail to a psychiatrist sometime in the distant future.JAMBON BUERREyelp.com/biz_photos/peti…Boiled ham, honey, baratte butter and cornichon.  Sounds worse than it tastes...because it tastes ridiculously good.CLOSE UPyelp.com/biz_photos/peti…The combo of ham and honey butter in a sandwich is deceptively genius...But I don't fantasize about drenching the head chef in butter cuz that's just weird.  I'm gonna go on the record and say someone hacked into my yelp account to make me look like a crazy person.I would only slather butter on Ludo if it was consensual...you bastards."], ["Yelena H.", "Stumbled onto this restaurant while driving around Universal City. Wanted something different and had a couple of hours to kill before doors opened for Universal Halloween Horror Night.  Located in a dingy strip center behind a gas station and wedged between a donut shop and an empty store front, it has little curb appeal but does advertise French food in the window, which caught my eye.  Inside is tiny and very crammed, all seating is counter only, no tables.  Kitchen is right there in the open, next to the bar and dish washer, which gets emptied and loaded right there in front of you, and their tiny back room only has enough space for a pantry and a single family sized restroom.  The menu is small but serves the purpose. Sadly, unless you want one of two bottled beers, on that end you are out of luck. Drinks are pretty limited to either bottled fancy lemonade at $5 or Mexican coke.  It's by no means kid friendly and I had a tough time helping them make a selection. My daughter settled on a French onion soup, which was too tricked out for her, my son settled on today's special- sausage sandwich on a baguette with fries and I had candied chicken that was served with a lightly dressed salad. It was definitely a delicious and unique flavor, but $24 for a chicken leg, even candied, does make $33 ribeye seem like a good value.  All in all delicious, but casual atmosphere and setting make you yearn for a lower price tag.  18% service charge is added automatically regardless the size of your party, and they only accept credit cards.  I appreciate it for what it is, but wouldn't send my friends here."], ["Flavia A.", "I wanted to like this place. I lived in France for a year so I'm a certified francophile. The menu sounded fabulous. I had high expectations, especially seeing the wait and reviews.Unfortunately, I won't be going back.To start, the cocktails were inconsistent. Mine was fabulous (a gin concoction). However, my counter-mates' drinks were weak (tequila based).Our apps included the escargot and a salad. Good.The food:Steak frites, ordered by the guys. Gross. The steak was horrible: chewy, and lacking any flavor. I can't believe the chef would have condoned this poor level of quality. I ordered the chicken leg. It was good. Crispy chicken and I was satisfied.The fish looked so good at prep - so we ordered it. It was \"market price.\" Came out to be $62. For sole. Wow. It was good, but dang, $62 for a single slab of cheap fish is disheartening. Ambiance:Unfortunately they only have counter seating so it's unrealistic to go with more than 2 people. It made for awkward conversation.The kitchen is a mere ten feet away from the counter, so you smell fish and butter the whole time you're dining. So if you're into that sort of thing...And, finally, the waiters are almost too helpful. They tried to take my unfinished cocktail away not once, but twice!!!!!!The bread was delicious though. Skippable."], ["Joseph S.", "Ludo, being the other customer who was yelled at and called \"rude\" at your restaurant for lunch today by the Asian line chef was uncalled for. When simply asking to have a burger cut in half and told \"no, can't do that\" and asked why not was not the response I was expecting. Working in medicine and with the public myself, customer satisfaction is of the utmost importance. I don't consider your establishment as lower end, nor do I expect service to be as such. Ihad eaten at trois mec 2 weeks prior and was very satisfied. My point is that I'm willing to pay good money for good food and expect the service to be outstanding. To be humiliated by one of your staff members ruined my whole lunch experience and  I will not be returning. It's very unfortunate as the food was fantastic but experience and food go hand in hand."], ["Kevin R.", "Chef Ludo does it again with this new pocket-size restaurant opened next door to the amazing Trois Mec! While this new, more casual eatery doesn't have the exclusivity of it's relative next door, it still serves up divine French eats with a more casual, yet cramped, setting.Petit Trois does not accept reservations and is always first come, first served for lunch or dinner. There's only about ten or so seats at the counter on either side and no tables, no dividers, and no elbow room. If you're with a party of three or more, conversation can be a bit difficult so you'll resort to looking at each other in the mirror that is less than two feet from your own face instead of leaning back/forward. The servers are always up and down the aisle carrying food or wine so you should expect an elbow or two to get shoved in your side throughout the meal. It really reminds me of the tiny restaurants in New York or San Francisco while in reality it's located in a small strip mall in the center of Hollywood.The menu at Petit Trois is pretty small with only a handful of perfected dishes that don't change from lunch to dinner. Regardless, each dish is hand crafted at the counter while you watch (if you're sitting on that side) and sent out immediately. The dishes are on the smaller side and are great for sharing amongst the group.To get things going we ordered the salmon rillettes, green bean salad (with horseradish and plums), and side of fries. The fries were great with the perfect outside crunch along with the nice creamy dipping sauce. The green bean salad was nice too with fresh slices of plum to add a sweet twist. The salmon rillettes were delicious and easily one of the standouts of the meal! It was tasty I couldn't even get a photo until after it was half-devoured! The salmon was the perfect shade of pink and the baguettes were buttery and amazing all by themselves but when topped with the fresh fish each bite was better than the last!For our main dishes we decided on the croquet monsieur, steak tartare, and omelette (with boursin cheese) to share. The cheesy croquet monsieur was smothered in rich cheese and the sliced ham (which is not my favorite deli meat by any means) was great! The steak tartare was huge with the cold meat mixed in with fried onion strings and little flavor bomb capers. It even came with more buttery baguettes! Probably my favorite dish was the omelette (yes, omelette!). This amazingly creamy and rich breakfast dish was surprisingly perfect for dinner! Not surprisingly, my favorite dish next door was the scrambled eggs and caviar. Ludo sure does know how to make some great eggs!After this huge meal we still had to order dessert for research purposes. We got the chocolate cake that came smothered in caramel sauce and topped with fresh whipped cream. The cake was super rich and when mixed with the caramel it added up to one of the best desserts I've had!When we showed up to Petit Trois it was around 5:30pm on a weeknight and we snagged the last open seats available. The whole time we were eating there was a large crowd waiting outside with the hopes that something will open up. If you don't want to wait, be sure to arrive early! Part of the allure of Trois Mec next door is the exclusivity (you can only get tickets online, no walk-ins allowed), Petit thrives solely on walk-ins but still serves up perfected French food from one of LA's top celebrity chefs. Also like the big sister next door, the sign above the entrance was left from the last tenants (Tasty Thai for Petit and Raffallo's Pizza for Trois). If you're lucky enough to grab a seat for dinner at this tiny eatery, be prepared for one of the best meals available anywhere in the city!"], ["David L.", "SO I FINALLY CAME HERE!!!!!! I am a complete French food fanatic. Ludo is the man and I was very happy with what I ordered. I had the foie gras terrine and the steak frites with bernaise. I must say I grew up eating bernaise on a constant basis and this is the best I have had. It was so good it just made my mouth water. My wife had the fish and was extremely pleased as well. I would eat here more often but there are no reservations and you have to get there early or wait outside like a chump. The seating is cramped but it's fpr sure worth it."], ["Mary K.", "Overpriced IMO. Valet $7, $26 fried chicken leg, $13-18 apps, wines $13 and up by the glass, 18% gratuity added automatically. Food good, ambiance not so great. You basically sit on a barstool with a narrow aisle  and take turns bumping into each other and trying to hear the person next to you. Acoustics not so great. Not a relaxing dinner out. Service was fine-- waitress was nice and attentive.Meh, I think I've been there twice now. First...and last time."], ["Jazz M.", "This place is absolutely amazing. At first I was a little bummed because it's just counter seating (vs pricing) but we gave it a go and the food was incredible and quickly prepared.Try the Escargot and the Paris Brest  to die for!"], ["Shelley Z.", "I just paid $24 for a fried chicken leg. And $18 for a ham and cheese sandwich. ...WOW(LO)ZERZOkay, that may sound a little unfair since I'm all for paying premium price for amazing food. However, that fried chicken leg was as forgettable as one from KFC. Actually, no, I would at least remember KFC's fried chicken leg for an hour or two after consumption because I'd suffer through some acid reflux or a mini heart attack. And don't even get me started on the ham and cheese sandwich. Luckily the two appetizers saved me from completely regretting my meal here. The ESCARGOTS were FANTASTIC! And I generously dipped my starter bread in the leftover sauce. The Pork Terrine was pretty good, too. Our server lied. She promised that everything would be super delicious, but that was not the case. Why do girls betray me so :("], ["Candace L.", "Best lunch I've had in as long as I can rememberWe shared the Croque Monsieur and Omelet with a side of frites and the Napoleon for dessert.It was great to sit at the counter facing the cooks so we were able to see everything being prepared, Napoleon included.I'd opt for a different dessert on a return visit but the Croque Monsieur and Omelet were easily the best I've had. I don't normally order omelets or enjoy that much egg but this was so creamy and delish.Valet $4 in front lot, short wait around lunch time 1230P."], ["Brittany F.", "Had a good lunch here today. We showed up at 12:10pm, and there was no wait. The bread and butter came out within moments and it was insane. Some of the best bread and butter I've had in recent memory, including the bread I had in France last month. This set our expectations high for the rest of the meal. We ordered the salmon rillettes and green bean salad to start. The beans were raw and came in a light mayo/horseradish dressing with slices of apples and plums. I liked the lightness and freshness of this salad. The salmon rillettes were so good. Raw salmon with toasts, definitely one of the better versions of this dish I've had. Then we shared the omelet. It was good, but not the best omelet I've ever had. It was filled with creamy boursin cheese and pepper. As I mentioned, I was just in France, and I feel this was similar to all the omelets I had for breakfast daily. It came with heavily dressed greens. The napoleon was a beauty to look at but I found the custard a tad too thick and too cold. It was decent, just not my favorite. I would come back to try some of the other things on the menu. The escargot smelled marvelous and the gougere looked too good to resist. I love that they were playing old rap music. The vibe is super relaxed. Overall worth checking out. Prices are a bit high but great quality ingredients are definitely the reason behind the pricing."], ["Leah M.", "Aaahh - anniversary dinner date, check! Lucky for us, we arrived early and got their lobster toast (super delish). We both ordered the steak frites for our mains - rich, full of flavor, and reminiscent of the SF at Bouchon, and topped it off with the chocolate mousse. This dessert was OOTW. Actually, everything about our meal was a party for the tastebuds. Will absolutely return - brunch next!"], ["Sondra B.", "I recently went with a friend to check out the new little sister restaurant to Trios Mec, Petit Trios. Now if you don't already know Trios Mec is the very elusive restaurant by Chef Ludo which you have to call in advance for tickets to even have the opportunity to eat there. The establishment is secretly hidden next to a Yum Yum Donuts and still has never changed its sign which reads Raphaels Pizza. Theres also a little note on the door that says \"we don't sell pizza\". What they do sell however is delicious authentic french cuisine. If trying to snag tickets that sell out in 20 minutes its not your cup of tea, you can now head next door to Petit Trios to quench your French pallet.When you first walk in you\"ll notice the space is very small and set up pub style with bar stool at the seat and along a narrow mirrored wall. Comfort is not going to happen here. Its set up so you will eat and leave. If you have lower back issues your back will be sore like mine was throughout most of your stay. I guess thats the price you pay to watch Chef Ludo walk around with his tattooed sleeves listening to french hip hop. I decided to be daring and try something that always made me squeamish, escargot! Oddly enough I actually like snails and think they're cute. I don't want to eat them, but if I'm ever going to try them, this is it. We also ordered the Halbut Special appetizer, Fried Chicken Leg, Steak and Frites and for dessert the Floating Island. For cocktails they didnt have my signature Bellini so I let them get creative. They ended up making me a champagne and elderflower drink that wasn't as bubbly and yummy as my Bellini's. I was there for the food so i guess I'll give them a pass on that one. Below are my reviews of each dish.Halibut Appetizer:  This dish was a generous portion of smoked Halibut served with a variety of thinly sliced colored carrots. I am normally not a carrot lover, but I have to say the simplicity of this dish was perfect. The crunch and sweetness of the carrots was the perfect accompaniment to the smoked flavor and soft texture of the Halibut. This was one of the favorite dishes of the night.Escargot: ok so its basically snails drowning in a sea of butter, garlic, and fresh parsley. It would be extremely difficult for anything prepared like this to not taste good. The Escargot was actually not too bad. It was surprisingly very tender, not chewy at all, and not slimy. It was very similar to having a steamed oyster or fresh clam. But with that being said I could only eat two. I don't understand why I like snails as apposed to a chicken or a cow. Maybe it was the mystery snails I used to keep in my fish tank. In any event I just couldn't continue, but I'm glad I can say I've finally tried them. Mission accomplished!Steak and Frites: while this dish was tasty, it reminded me of the chicken fried steak I can get at Norms. It was tender, but it just had that taste of the tender flattened out steak smothered in gravy. When a friend orders this for breakfast I can usually handle having a bite or two and then I'm over it. Thats pretty much how I felt about this dish. The biggest disappointment however were the fries. They were equally as bad as the fries at In and out burger. For a $33 dollar dish that consists of steak and frites, I expect those frites to be amazing. Wowing me with homemade, delicious, perfectly crispy fries could have saved this dish for me, but I was just wowed.Fried Chicken Leg: Now what did wow me was this dish! OMG this is the best chicken leg I've ever had the pleasure of enjoying. It was fried and seasoned to perfection. We both could not stop eating every little sliver of chicken and crispy skin on that plate. I always found ordering the chicken to be the boring option, but this dish put that theory of mine to rest. It was served floating in a Brioche Butter, atop of Frisee Salad and regardless of the simplicity it all worked remarkably well.The Bread: Not to be unmentioned is the absolutely delicious french bread and butter they serve you before your meal. This and a glass of red wine could be a meal alone. I read others complimenting the bread here and they were absolutely right. It is the perfect soft moist bread on the inside with that crunchy crispy crust on the outside. I wanted to sneak some in my purse it was that good.The Floating Island: Finally time for Dessert, my favorite part of the meal. My friend is obsessed with this dessert, but I just dont get it. Give me a chocolate souffle any day. A floating island is basically a meringue floating on a very liquidy vanilla custard and usually topped with something crunchy like slivered almonds or in this case praline. I am constantly telling my friend I can make this dessert ghetto style for him by melting some vanilla ice cream, microwaving some marshmallows into a gooey ball, and throwing some almonds on top."], ["Kevin S.", "So you want to eat at Petit Trois? Get there *at least* 30 minutes before the doors open at noon, because:1) There will be a line.2) The dining room will hit max capacity in less than 10 minutes.3) The parking lot is small, very small.4) The closer you are to the front door, the better chance you have at bar seating facing the open kitchen.5) LA loves Ludo.Petit Trois is as French as it gets, and Chef Ludo has created a casual bistro that will leave even the most un-adventurous, apprehensive eaters happy and stuffed. Okay, maybe 99% French, since they do have what LA Weekly considers \"The Ultimate LA Burger\" - the Big Mec. (Which is now on my burger to-do list, and will guarantee a return trip as long as it exists on the menu). The dining room is quaint, and squeezing by patrons to get to the restroom and back isn't without some courteous moves - but Petit Trois is exactly what you would expect from a hot spot with a cult-like foodie following; energetic, in-demand and just downright tasty. It sets a standard in casual French fare for the LA area, and if you want some of the classics, you'll get them, right here.Now that we understand the price of admission...PANACHÉHalf Kronenberg 1664, Half Rieme Sparkling Lemonade. If you're looking for a refreshing drink without going down wine lane, this might be for you. Light and mildly sweet. ($7)BAGUETTE & BUTTERThe first thing that hits your table; a warm baguette with room-temp butter. Some might say, \"Bread and butter, that's not special.\" Yes it is. Eat it. Be happy that you did, because a \"low carb\" diet is a poor excuse for deciding to skip on it - and you should feel bad if you do.HEIRLOOM TOMATO SALADWhat summer should taste like on a plate. A classic pairing of tomato and buffalo mozzarella, kicked up with crispy bits and mint garnish. Textural perfection. ($15)MELON & HAMThick slices of sweet Cantaloupe met with generous slices of Prosciutto; an absolute yin & yang. Strange, wonderful things happen when this combination hits your mouth - some call it umami, but the Burrata and Buckwheat Honey keeps everything in check. Delicious! ($15)CONFIT-FRIED CHICKEN LEGBuried deep underneath a mountain of Frisée Salad, is a beautifully moist chicken leg with a near-indescribable crust. It's somewhere between cornmeal and pork cracklin, although I'm certain there's a few more magic tricks in that batter they're not telling us about. My only knock on the dish, is that I wish there was more chicken to go around. ($24)BRITTANY WILD SOLE \"MEUNIÉRE\" + RIZ PILAFMasterpiece. With a capital M. I need to spend a few minutes sucking up to this dish, because it was worth every penny. If this catch wasn't already considered a jewel of the English Channel, I'd say it's size and texture puts it up there as one of the best pieces of fish I've ever stuffed into my face. It was like eating a stick of butter, and pairing it with uber fluffy pilaf was a fantastic call. The Meunière sauce was light, yet highly acidic, producing mouthwatering qualities. I've had a preview of Sole in tasting menus before, but this was something else. It took an already solid meal and elevated it to greater heights. At the end of the day, never mind the market price - you get far more than you could possibly anticipate with this dish. Not only does the preparation stand out, but the quality and respect for the ingredient does as well. (Market Price / $79)SAUTÉED GREEN BEANSDon't forget the green beans! The snail butter pushes this simple side into indulgent territory, and don't feel guilty if you feel like pouring the rest of it over [insert dish here], or sop it up with whatever baguette you've got left. ($6)Service was great here. Thumbs up. Very attentive at first, then a bit slower as the dining room filled to capacity. Don't worry about all the bread crumbs, they'll sweep those up in between courses. We also ordered dishes that had longer cook times than compared to those around us, so there's that. Give yourself about 1 1/2 to 2 hours to eat here, and keep in mind that waiting parties usually crowd by the door, so don't be a jerk and sit around forever after you've picked up your check. Friendly staff, skilled chefs - they mean business. Oh and you might run into Ludo himself, he was moving in and out between restaurants during our service.If small, French-inspired joints aren't your thing, and you just can't bear the idea of someone pressuring you to try Escargot, you're gonna have a bad time here. However, this is without question a must-do in LA. Petit Trois for lunch, Trois Mec for dinner - you really can't do any better.I'll be back for that Big Mec. It ain't gonna eat itself."], ["Cynthia B.", "Ok, so it has taken me a while to write my review because it is hard to put into words what might be my favorite restaurant of 2015.  I have been here for lunch a few times and the service and the food is always impeccable.  From the greeting when you walk in, to the fresh French bread and butter, it's such a delight having a place like this in the middle of this polluted city.  A true gem.  The moules frites are delicate, aromatic and romantic.  The drinks are exotic thirst quenchers. Oh and did I mention the burger?  The Big Mec is essentially Ludo's love child with a Big Mac.  Just thinking about it is making my mouth water."], ["Sam W.", "Tasty escargot, heirloom tomatoes / buffalo mozzarella tastes like candy, big mec tad on the rare side. If I have rare I will get the tartar instead. Napoleon is absolutely wonderful and tummy. Thanks chef ludo and team."], ["Andrew M.", "Definitely worth it.Service was outstanding - great vibe - I was seriously hungover and our waiter looked after me well.It's a foodie joint, everything's open - if you don't get excited about food - don't come here.French Onion Soup - out-fucking-standingHeirloom Tomato Salad - see aboveLe big Mec - see aboveSo - why only 4 stars?- My steak Frites - meat was waaaay over seasoned - I get the whole salt thing but there's a fine line and my steak was on the other side of it.  No biggie - the waiter asked - I told him - I think I saw him speaking to the chef and no doubt the dude who made the amazing Onion Soup a few minutes earlier will get some feedback and they'll move forward.- What's with the 18% service charge?  This is LA - hell - this America - please don't do that.  I'd probably have tipped at 20% - the service was good enough to justify 25% but the steak pulled it back a bit - so - when I'm presented with a default at 18% and then I have to do the fucking math on 2% or is it...  - at that point I just signed the check and bailed.If you like good food - you're not in a group - it's just you and your special other - this is a great place.  Maybe tell them in advance that you're salt sensitive and keep an extra 5 / 10 bucks in your pocket for the wait staff - 'cos they're awesome."], ["Jane L.", "Really enjoyed this place!  Every dish we ordered was sooo comforting. Try and sit at the bar if you can - it was so much more enjoyable interacting with our chef.  Our chef Chuck explained how to make that crispy crust on the chicken leg. He also recommended the green bean salad for us, which was a refreshing break from cheese-heavy dishes.  Gougère, salmon rillettes, and steak with caramelized onion were all delicious. Just a note - Yes, they do re-use the shell on the escargot.  You don't have to wait till after 10 PM for croque monsieur.. This was one dish I was looking forward to, but it was my least favorite (too heavy).  Napoleon looked better than it tasted... Pastry part was perfect, but the cream was too bland for me. Service was amazing, from the chefs to the waitstaff... It felt more like visiting a really good friend's house for dinner, rather than a restaurant.  Everybody was so accommodating, and they spaced out the dishes perfectly.  18% automatic gratuity was so well worth it, we rounded up to 20%. So much fun, we had an amazing time."], ["Marissa V.", "Cute French bistro inside a strip mall. Yes, there's a Yum Yum doughnuts shop next door but don't let that fool you. This place is solid, once you enter you feel you're at a bistro in Paris. Tried escargot for the first time and thoroughly enjoyed-it was great! Also had the chicken leg with the frisée salad and that was good."], ["Ru C.", "such a cute little causal french restaurant! the service was excellent! food came out really fast and very good as well!we had escargot, foie gras toast, Croque Monsieur, and chicken leg.as for dessert, we had the floating island and chocolate mousse. everything was fantastic! and we got our dessert for free cause the one we originally wanted was out and they apologized and told us that. it went from an awww to a yayyyy! lol. the bread they served before meal was very good too, it was hard to say no when they asked if we wanted more."]], "Figaro Bistrot": [["Linda H.", "this restaurant is the reason french food is my new favorite. best coffee i've ever had and i've only had macaroons twice in my life but my best experience was here. the crepes were really good too."], ["Cyrano B.", "This place is great to grab a drink or some food and have a nice little chat with a good friend on a sunny morning or afternoon. Sit outside, it'll remind you of the terraces of Paris Cafés, it's that simple!"], ["Ale R.", "I had steak salad. It was good. The place feels like you are in Paris. Is cute. All the furniture came from France. The sitting outside is relaxing. The mussels were delicious as well. Ratatouille was spectacular. The strawberry with chocolate was amazing."], ["Shannel F.", "Lovely place and ambience, but that's about it. The service is okay they don't really check up on you so if you need anything don't wait for the server to come around...ask all at once! Food wise, is okay as well I tried their eggs Benedict and that's my favorite breakfast dish but, here it just was bland. I guess this is really just a good place to sit in and have a coffee if you're not picky on your coffee."], ["Miss L G.", "Had the Sandwich  Au Poulet and it was very tasty. Very good service...I ordered to dine in then changed my mind and asked for it to go and it was no biggie. The server indulged my very chatty 5 year old in small talk, which for me always scores points. The only negative thing I have to say is that the salad greens were a little less than fresh but it could have been because I took it to go. Very nice Monday crowd...not to crowded but enough for some good people watching."], ["Emir L.", "I loved this place until their service started to suck.The food is still amazing and hands on to the chef,he's probably saving the restaurant.Management and staff are terrible.called for reservation and then got there and they didn't save my name and made me sit with my date in a tiny corner next to a very loud family,asked to be moved 3 times,for the the bill I payed which was 240 dollars for 2 people,I would've deserved to be treated better .The waiter might've had hearing problems or he didn't speak English.If you love good food yes it's a place to try good French dishes and that's why I'm giving it 2 stars if you looking for a whole service experience then no,this isn't the spot for it and stay away from taking a date there."], ["Lisa W.", "Figaro Bistrot is a place I've been meaning to try for years.  It's one of those places that catches my attention every time I drive by because it looks so adorably French: the sidewalk cafe, the charming signs with the French words and the promise of pastries and wine.  Figaro's boulangerie did not disappoint!  I can't say that I was thoroughly wowed but I will admit that for the couple hours I was there, I felt like I was taken away, somewhere romantic, European and wonderful.  Our experience was complete with our French-accented waiter.  Bonus!The interior is nostalgic and cozy, with whimsical chandeliers and paintings, and snug arm chairs at the tables.  The chairs would be a great touch, if only they were reupholstered.  They were worn and whittling, and my happy hour date couldn't tell if it was the cracked chair lining poking her bare thighs or if she was sitting on crumbs.  I had similar issues.  I still thought the ambiance was pleasant and dreamy.  The service was great.  Our waiter, with the French accent, could do no wrong anyway.  But our waters were refilled graciously and often by the greeter, who did not have a French accent.  Our food came out at a reasonable time and was all pretty tasty and well priced.  Wine, beer and champagne is all around $4-$6 on the HH menu.My happy hour favorites were the artichoke and truffle ravioli and the burrata crostini.  Ooohhh that burrata: soft, creamy, sweet, luscious, definitely craveable.  The other items I tried were just OK, I could do with or without.  The fries were good, nothing out of the ordinary, but a must-order at $3.  The mini burger had too much bread.  We requested that it be cooked medium but it came out well-done and dry.  The calamari had good flavor but was slightly rubbery and overcooked.  The crabcakes were well seasoned and tasty but not the best I've had.  They serve yummy complimentary bread and butter as well. Parfait!"], ["Chriselle A.", "I've enjoyed happy hour here on many occasions with girl friends. The escargot- delicious and the deal on the carafe of wine is pretty good too! Beautiful decor."], ["Pacey K.", "Figarot Bistro is my new favorite destination restaurant.  I had the most amazing bartender, James.  He was so glamorous and well mannered.  Another server, Karim, was also assisting us.  He was an absolute delight.  The happy hour here is outstanding. The oysters and the mini burger were the BEST.  I will make the trek from the valley every week!"], ["Donna G.", "Great Happy Hour. I had the Veggie Ravioli, Crab Cakes and Rose wine on a hot day in LA.   The Waitress, Hostess and bus boys were very attentive and kept filling my water glass.Happy Hour was very busy. People were coming and going very often. And it is a small restaurant - but the atmosphere makes you feel like you are in France. The décor is vintage, old walls with  very pretty lighting.I took off one star because of the seating. The seats are so very old. When I first sat down, I sunk into the chair. I thought it was just me - but then I saw two other people have the same thing happen to them. It gave me a giggle, to see their faces as the first sat in their chairs and sank in. It was kind of funny.  But I guess those chairs add to the ambiance of being in France decades ago.One of the best Happy hour in Los Angeles. Happy Hour seven days a week, even on Sunday. Definitely a \"Must Try\" if you are in the Los Feliz area."], ["Shannon M.", "Staff is really rude. Gives dirty looks the second you get there. The food is ok. The drinks sucked."], ["Roxann H.", "A casual authentic Parisian café. The food is outstanding as is the prices. The service has European dynamic , they will never rush or place the check on your table unless when asked. I go with my French friend we enjoy the champagne which is fabulous and extremely reasonable."], ["Madeline L.", "Pretty great place! Super cute and amazing  food and desserts! They're coffee is great and huge! Great customer service and background music!"], ["Hideo T.", "Cute French waiter is always a bonus at this cute French cafe. Beautiful tarts, authentic french bread, & quality food. The atmosphere is as authentic as you can get for being in LA. A perfect go to spot in Los Feliz."], ["Lindsey B.", "Tried to go here for a glass of champagne for our anniversary. Put our name in with the red head hostess. She said it would take 20 minutes. We went to the shop next door and returned within 10 minutes to wait for a table. We watched them sit people who arrived after us. I asked the hostess if they already called our name and the girl with purple hair said yes we called your name 5 minutes ago. If only the red headed hostess could have given us an accurate wait time we could have gotten a table. Very unhappy with this poor customer service."], ["Jamie H.", "Walking in here was like walking into a different dimension. It seemed like some kind of safe haven for the French to make fun of Americans, which usually I would find funny and I suppose in a way it's a brilliant idea. When I walked in I saw a woman who looked like Effie Trinket from the Hunger Games and I'm not exaggerating. They sat us down at a table with leather seats that were very low and you sank even lower into the cushions. The table was practically at my neck level and I joked to my boyfriend that they probably picked this out on purpose just to stare and laugh at how silly everyone looks trying to eat their food. I ordered a caesar salad which was not very impressive, but is any caesar salad ever impressive? No. The escargot was really yummy and I suggest getting it so you can dip your bread in the leftover garlic butter.The waiters all seemed rude, especially the tall thin French guy in a previously mentioned review. I anticipated this anyhow.When I got up to leave the whole arm of the chair came off in my hand. It was something out of a Charlie Chaplin film. The arm of the chair had those ridiculous Ikea wooden dowels that barely attach. Again, more evidence this place was built just to make fun of its patrons."], ["Heleen R.", "Would have 3+ stars if they would clean up their act! I went here with my boyfriend for brunch. We had always wanted to eat here, passing by it often, it looks so charming on the outside. You come inside and there's a lot of potential. Looks like a great spot until you look really closely. The floors were SO dirty, the booths and tables had crumbs. We were seated inside at a small table next to the window and were greeted by about 8 flies. I understand a place that has outdoor and indoor seating can get flies coming in - but i've been to plenty of outdoor/indoor spots (literally next door and down the block) that do NOT have the gross problem that they do. It was so bad, we had to request a different table. We were seated on the loungier side and it was very nice but the floors were disgusting. I wonder how often they mop and sweep here. I had an extreme urge to get up and clean. Our waiter was sub-par. He was the only waiter on the left side of the restaurant and he really didn't seem to care to be there at all. He never checked up on us after he took our order and the only thing he did quickly was bring us our check when he saw we had finished eating. The food was good until I cut into my eggs benedict and found my eggs to be incredibly overcooked. Nothing worse than getting crummy food when you're hungry!I would only return if they were to do a major revamp and clean, get better service, and actually care about the food! So disappointed that this charming little place left so much to be desired."], ["jim b.", "Salade Nicoise14.00Nicoise salad with seared Ahi tuna, mixed green salad, anchovies filet, olive, red bell pepper, green beans, potato, hard egg and tomato, tossed in vinaigrette dressingThe best I've ever had!!!  Perfect!"], ["David B.", "Ordered through Door Dash, food was very good! i ordered the french ham sandwich & soup de jour, food got here in less than 45 minutes and was outstanding! best sanwich ever! loved it! little bit pricey but once in a while so what! Didnt go inside, so i cant comment on that. For dilivery great food!"], ["Kelly B.", "This is a dimly lit, sexy, romantic French restaurant.We went here for my friend's birthday, but I could see going here with a date you really want to impress (because if I was the date I would definitely be impressed!)The seats are low to the ground, fluffy and comfortable and with the dim lighting you just sink into the atmosphere. Pair that with a great Malbec and damn you sexy.The wines vary in price, all of which are really high quality wines. I was able to get a yummy Malbec for about $10, and I thought it was a generous pour as well.It is on the pricey end, but  a lot of the items are close in price. For example, the chicken pasta and the seafood pasta only had a few dollars difference in price, so I didn't feel like I was being put out for upgrading to the seafood pasta.The seafood pasta was delicious and tasted pretty fresh- had calamari, shrimp, and clams and it was to die for.I would definitely go here again!"]], "Papilles Bistro": [["Meline A.", "So, I brought my mother here last night for her birthday, and it was the first time we had been there. She is a VERY picky eater. It's hard to please her. And for her to say the food made her birthday more special was so wonderful to hear. And we all agreed with her. The food was amazing! My family all got the flat iron steak, and I had the Tasmanian Trout, with was DELICIOUS! I mean, come on! This place is SO underrated! It's a small hole in the wall in Hollywood, and I'm so happy we found this place. Will definitely be coming back again!"], ["Professor S.", "Very impressed with this strip mall eatery. Service was very good.  The waiter was a bit unsure of a few things in regards to the wine and cheeses.  The lamb was gristly.  The almond gazpacho, octopus, and halibut were excellent.I didn't like how smoky it got inside--the kitchen is open to the dining room.It's very quaint and intimate. It was quiet at 7 PM but started filling up by 8:30 PM.Decor reminds me of a French bistro.  The menus printed on notebook paper were cute.The menu selection is very small but well-rounded.Parking is tough. The lot is small. We parked on the street after trying for 10 minutes."], ["Sandra C.", "Came here for Valentine's Day, so it's a bit of a belated review.I wanted foie gras since it's legal in Los Angeles again, so we came here in hopes that we'd get some! We did...but since it was a set menu, we ended up with the foie gras pate. I can't complain about pate, but I wanted the real thing!This spot is pretty intimate, with most of the tables pretty much touching each other. Your neighbors might as well be in your party because they can hear everything you're saying. I don't mind that personally, but this might be a bad thing for some people.Parking around the area was a toughie. We actually waited on the corner--like shady people--until a car left  the very small, shared parking lot. This place is very affordable though, and definitely worth it for the quality you're getting.I would come here again, for sure."], ["Fern Y.", "We had dinner last Wednesday. This restaurant is located at the end of a small strip next to a Thai restaurant. Very simply decoration and open kitchen. We had eggplant appetizer, chicken liver on toast, beef, and grouper. The grouper was the best. For dessert we had cheese plate and olive oil cake. Service was very good not overbearing. Corkage $20.00. Owner was very friendly and gave us quick intro of restaurant. It took us an hour drive from Pasadena so probably won't come as often we'd like. Food is good and price reasonable. Wish it's closer."], ["Akiko H.", "My husband and I found this hidden gem few years ago and fell in love with their cute and cozy ambiance, charming and friendly servers, and best of all, with wonderful dishes that Chef Tim Carey creates.  We used to come here at least once in a couple month if not every month. But for the last year, we haven't been here at all ( Shame on us : / ).  It is just little too far from where we live especially with traffic getting there.  But finally we came back and we were soooo glad that we did even though it took us one hour to get there!!!  The restaurant looks prettier, I think they painted the wall with different color.  We had prix fixe as usual which is very reasonable.  We also ordered torchon de Foie gras.  Tim prepares this very delicately.  We missed this dish so much we ended up ordering two.  My husband had duck breast.  He usually doesn't care for poultry dishes so much especially duck because of its smell when you don't cook right.  But he enjoyed this dish since it was seasoned and cooked perfectly.  We definitely have to come back here often this year.  Their prix fixe is a steal for the quality and the portion of food. And I think Tim got even better at what he does within the past years.   My husband and I have to somehow find a way to get here easily.  Maybe trying to come here on Sunday or moving closer to here... :P"], ["Tara F.", "One of my top fav restaurants in LA. Every dish I've ever had has been ridiculously good, SO flavorful. I loved it when it was a 3 course prix fixe, but now they do ala carte, so you can order sides that are divine and seasonal, which makes it even better.  A great unique spot to bring guests, you always know you'll get an exceptional meal (order the foie gras!), and the owner, chef -  everyone who works here - makes you feel like you're at their home having a meal. Not to mention, affordable, in a sea of over priced, and generally lower quality cuisine."], ["Brittany F.", "We found this restaurant on Yelp and decided to check it out for dinner on Sunday night. The place is hidden in the corner of an unassuming strip mall just off Franklin and the 101.It was pretty quiet around 6:30pm on a Sunday. We started with the almond gazpacho. So light and refreshing and a nice change from your typical tomato gazpacho. Then we had the stone fruit and burrata salad and charcuterie board. The chicken liver was really smooth and wonderful. For mains we shared the halibut, carrots and quinoa with pistachios and raisins. The halibut was so beautifully prepared. The quinoa was addictive! A must order. For dessert we had the stone fruit cobbler. It was warm and had a scoop of ice cream. We devoured it. They have a wonderful wine selection. The kitchen is open so you can watch the chefs hard at work. The space is very small and rather simple, but the food speaks for itself. Worth checking out!"], ["Soo H.", "Friend and I were headed to the Magic Castle for my birthday and he brought me here beforehand to this hidden gem.It's tucked away in an unassuming strip mall and looks like nothing out of the ordinary, but the $35 prix fixe is an excellent deal and the servers here are all very passionate about the food and the wine, which is always nice to find.  You can also order items a la carte but we both had the prix fixe.  Everything was delicious and I like the fact that you feel like you've stepped into a little European bistro while remaining in the heart of Hollywood."], ["Lindsey K.", "I came here last night for dinner. Service was great and prompt, but sadly I left disappointed. My friend and I ordered the steak and the salmon, and both dishes were just OK. I felt like the steak with frites was very salty, and the salmon dish was hard to understand. There was something off about the sauce on the salmon that was really off-putting. I don't know if it was the mushrooms in the dish that made the flavor a little unusual, but I didn't even finish the dish... and I always finish my meal. I would say the highlight of dinner was dessert. The chocolate hazelnut was very good, and the banana pudding was pretty good as well. I can't say I would come back to be honest."], ["redlands r.", "Great prix fixe menu!I was underwhelmed as we pulled up to this strip mall and we started to doubt the yelp reviews. As soon as we walked in and smelled the food and felt the energy of the open kitchen, we knew that yelp had come through again and we found a great spot. Menu consists of a few fresh dishes and we went the prix fixe route. Server gAve great recommendations on our dishes and we had an excellent meal. Favorite first course was the tomato soup (they had a fancier name for it, but they could have just called it delicious tomato soup and it would have been spot on)Favorite second course was the duck mole ( although my wife would argue that her flat iron was better)Favorite third course was the butterscotch pudding (or something like that). Great bread, excellent service and a well selected variety of wine. We look forward to returning again!"], ["Lynn L.", "My boyfriend was in town so I surprised him with an early birthday dinner here. Pretended we were walking to grab a small bite before Wicked started at the Pantages Theater, but crossed some freeway entrances under a bridge and came here instead. I made reservations and asked for a candle to blow out to make it special and they totally accommodated. Much appreciated!Boyfriend went all out of course since he loves food, and it's my wallet. The Prix Fixe menu was yummy. In house foie gras was buttery and beautiful - much better than I expected. It had some sweetness to it which was unexpected. I really enjoyed my Trout - crispy yummy skin - and its accompanying daikon and watermelon radish ( makes a pretty plate). Boyfie ordered lamb - most of it was yummy, but some parts were too rare. He didn't want to send it back in case it overcooked. He liked the dessert option - cheese plate hahahah- anything you can smear on bread he loves - and he got it with the complimentary bread and butter, foie gras, and then dessert, lol. Really liked our dessert (: Great menu for the day, Papilles!! We left stuffed with extra food to bring back too.The menu is also pretty cute: printed on college ruled paper for the ever-changing prix-fixe menu.I like how its location is so unexpected. It's so different from the inside and outside. Surprise! So, if you're looking for a fancy casual place for a date or a meet up, look no further: Papilles - if you're in the area (: !"], ["Jen K.", "Environment:It's sort of feels like you are sitting in someone's home. It's very intimate. Dress is sophisticated and classic. Service:Great. Attentive and knowledgeable. Food:Chilled almond velouté w figs, fried marcona almond (very good)Market Salad with Stone fruit and Burrata (super fresh, very good)Cod (AMAZING)Lamb shoulder (was pretty tough, and rubber. I wouldn't recommended it)Dessert:Chocolate cake with a side of cream (So good!)"], ["Liz O.", "**My favorite place to have a casual, moderately priced bistro meal according to the seasons in the Hollywood Hills**MODERN BISTRO CUISINEI started coming to Papilles in June 2013 to try their Roasted Duck, where the meat was roasted perfectly and served as medium rare. yelp.com/biz_photos/papi…In subsequent visits, I've had other meals, which I enjoyed as much as the first. I just went back today to the recently renovated restaurant and had melt-in-your-mouth Roasted Lamb and a scrumptious Strawberry Tart for an Easter Sunday supper.The farmers market and local purveyors-based menu rotates every 1-2 weeks or so, but there are some culinary hallmarks of Papilles which are constant as befits Chef Tim Carey's classic training and past history at Patina:-Beautiful and precise plating-Haute French cuisine technique combined with premium American ingredients and an up-to-date style-Farmer's Market fresh ingredients treated very thoughtfully; artisan vegetables are used in an accessible manner-Proteins maintain their integrity in preparation and are a star rather than accompaniment (this makes me very happy when eating low-carb/Zone-friendly/protein-centric)-In the new A La Carte format you can add/subtract courses according to your appetite (the prix-fixe menu is no longer offered because most regular diners like me kept adding several supplements, the dishes are all so tempting)Tim Carey is also the only non-sushi and non-Japanese chef I will ever fully trust to serve me sashimi-style raw fish as an appetizer. If you ever see kampachi or a similar fish offered as a raw appetizer, run don't walk. yelp.com/biz_photos/papi…ORGANIC EUROPEAN WINES AND ARTISAN BEERSAs I mentioned in my original review, the wine selection is curated by Santos Uy, the owner/wine director of Papilles restaurant and Mignon, a wine and cheese bar in DTLA.  I'm petite and can't drink much more than 8 oz, but they will offer 1/2 glasses of wine instead when I ask, making it easier to pair wines separately for each course if I want.RELAXED, INITMATE AMBIENCE AND PERSONABLE SERVICEAnother thing I should add is that Santos Uy and Chef Tim Carey run a very tight ship and all of the staff are quite pleasant.  Chef Carey sets the tone in the dining room with his personable style: he is open to engaging diners and finding out about their tastes and will customize accordingly (with advance notice, he will make a vegetarian tasting menu).  He already had me figured out in terms of dining sensibilities at the end of my first visit - I feel like I have a personal chef when I have a meal here - it's a French Bistro version of Cheers for me when I walk through that door. Undoubtedly, he will extend the same courtesy to other diners who visit Papilles.CLOSE TO PANTAGES THEATRE:Located several blocks up the hill from Pantages theatre.  Papilles is in a strip mall shared with several other businesses with parking. It's a great place to have a low-key meal in 90 minutes before driving back down the hill to catch a show at Pantages.  Make reservations beforehand.  Papilles is open at 5:30pm on Saturday and Sunday so you can still catch the 8pm Pantages show if you go over 90 minutes for your meal.[NOTE: The parking lot is shared with other businesses so DON'T leave your car here during the Pantages show unless you want to chance having it towed.]As if my first review, update and fellow Yelpers' reviews aren't enough to read on Papilles, you can also check out LA Times food critic, Irene Virabla's review at articles.latimes.com/201…PS: Get on their email list to find out the latest on their frequently rotating menu papillesla.com/menus"], ["Jackie T.", "Wow. Thanks to their billboard (and only their billboard!) otherwise, I would never have realized such a gem was hidden just 7 minutes from home (and that's a walk, so car issues need not apply).Dined here for the first time Tuesday night. Starved myself all day after reading the fabulous Yelp reviews and so was more than ready for dinner. Megan, the lovely (French?) waitress served me their crunchy, sliced baguette which they fly in daily from NYC (of course), and this nearly did me in. I could have eaten it all night - never tasted a baguette like this in L.A. I opted for the very reasonable prixe fix $36 and as a gesture on this my first time to the restaurant, Chef sorted my dilemma of whether to go for the foie gras or almond gazpacho, and served me a complimentary gazpacho to kick things off. My God, what a dream of flavors. This will be my appetizer when I return. Heavenly on the tastebuds with a richness of texture that makes you want to keep sipping, and sipping, and .... And the foie gras was as it should be. Creamy, slick and flavorful.I had the steak frites for an entree and while I thought it was odd the steak came sliced - it was delicious nonetheless, in both flavor and tenderness. The fries were delicious - crisp and flavorful. For desert I couldn't pass the chocolate desert - rich, moist and crunchy bottom. Paired with a glass of Rose champagne and one of their red's for the steak. My only grumble here is that I didn't groove to either of their red wines - would love to see an Oregon Pinot Noir make it on the list (or better yet, a fabulous New Zealand Pinot Noir).All in all - for a cost of $90 (including tip), it was a short trip to France that I look forward to taking again, and again, and again. Congratulations on your restaurant Tim, you deserve any and all success."], ["Clee O.", "Meal was alright... It wasn't bad but I wasn't blown away and I was looking forward to coming here since my husband is french and we were trying to find a good french restaurant to make him feel at home for his birthday. Left feeling a bit ripped off and wished we would have just made dinner at home.The best part was the dessert but not worth the price of the entire meal. Salad was boring. Also I feel like the staff could be a tad friendlier? No one was rude and I definitely don't like overly friendly but the vibe here is just lacking something. No one said goodbye or thank you or anything when we left... Felt strange being here. Wont return."], ["Chanel C.", "I honestly looked up this restaurant in shock that it has such a high rating! I ate here last night, and I was so let down by the food. Their price fix menu is definitely not one for the books. I ordered the light salad, snapper as my main and the banana pudding for dessert while my colleague ordered the foie gras to start, chicken and the banana pudding as well. We ordered a bottle of Pino which was lovely. My salad was just bits of arugula, now saying this I love small portions, but with good yumminess to it of course. This salad was just accompanied with an anchovy and some cherry tomatoes cut in half. It felt like I was eating a bowl of salt. No flavor, other than the over powering variables. The foie gras was a giant heap on a plate with some bread next to it. So I got literally about 12 pieces of arugula but the foie gras was abnormally questionably huge for the order. It was bland, no flavor other than the mango dressing they dot your plate with on the side. Ok round two,  the chicken looked like something out of a scary movie, just covered in huge chunks peppers and onions lathered in pepper. My snapper was burnt, severely dry and full of salt! Literally the thing tasted like one of those Himalayan pink salt rocks you get at the super market. I had two bites and didn't finish it because it was so hard to even chew. My colleague did the same. Ok finally dessert, banana pudding. The banana pudding was good. Lots of whip cream and store bought wafers to top it off. You know those ones you use to eat as a kid from Ralph's? Yeah those. But the dessert was yummy because it was just slices of banana, whip cream and some \"pudding\" on the bottom of the cup that just honestly tasted like vanilla ice cream mixed with some chopped bananas. But hey, I ate it, best thing I had all night. The service was ok. The bus boy that helped our table was rude and short with us. Our waiter was nice, not great at checking our table but still was there once in awhile to say hi.I honestly don't understand why this place is highly rated. The food is awful, and the restaurant looks dirty. I love finding little hole in the walls with great food, this was definitely not one of them. Don't waste your money. If you want a small place to eat that's hidden and savory, try Petit Trois and don't go here. It's just not good."], ["Joe F.", "I am kind of bias because I am friends with the chef, but honestly, it's fantastic. The menu changes regularly which some people don't like, but I thought it was cool. If you go with one other person, you can share and basically try the entire menu. That night we got the salad, foie gras, duck, and steak. Dessert was key lime pie and chocolate cake. The salad had bacon and an egg on top. It was delicious. The foie gras had an orange sauce and was great. I'm not that big on foie gras but I was digging it. The steak and duck were both cooked flawlessly and the seasoning was spot on. It was like every single speckle of your place is cooked perfectly right down to an onion bulb. The dessert was really good but the least exciting part of the meal I guess. I liked the key lime pie better than the cake, but I'm not really a big chocolate guy, so I'm not the best judge for that.Overall I was really impressed and for fine dining, it wasn't terribly expensive.  If I could afford it, I'd go here all the time.  I'm really proud of my old friend Tim Carrey."], ["Corian T.", "How does one come from somewhere south, say Del Mar. Then stumble upon this place by recommendation. Top notch, first cabin, I am out of superlatives. Purely awesome, and you can't go wrong with anything here. Keep up the good work boys."], ["Kyle K.", "I don't know where all these amazing reviews come from.  The atmosphere is nonexistent, the place is so loud you have to YELL to speak to others, the food was mediocre.  The whole staff look like gangsters... Just doesn't seem like a place that would be over $100 with two glasses of wine added to the flat fee menu.   Skip this place and spend your $ elsewhere.   Oh, and good luck finding parking, the last thing you want to think about when getting dinner."], ["Elvin C.", "I really wanted to like Papilles after having it bookmarked for over a year, but after having a Valentine's Day dinner here I was left mildly unimpressed. The menu was somewhat enticing and I was pretty late on reservations (typical fuckboy behavior) so I settled for Papilles out of curiosity and desperation. I did think $75 was a bit high for what the menu showed, but hey... it was Valentine's Day. There looks to be a lot better value going for their regular prix fixe menu offerings, and I might go back eventually to give that a shot when the opportunity presents itself.INTERIORThe bistro is the size of a hole in the wall establishment, but is decorated with a modern and sophisticated vibe. It almost felt like a small and exclusive, but kinda crowded dinner party. I'm not claustrophobic at all, but the seating arrangements didn't sit well with me *badum tssst*. Everyone was packed closely and as someone who's been blessed with a wider set of shoulders, I felt way too intimate with my neighbors to my left and right. I came to have a nice conversation with my girlfriend over some cutely presented food, but ended up incidentally overhearing my neighbors' conversations and actually not having enough room to ourselves. Personal space is hard to come by here I guess. SERVICEThe host did his job well and got us seated not too long at all after we arrived. Our server however was hard to flag down as he seemingly always had his back turned from us. Every time we needed him he was either busy, or not busy but just had his back turned from across the room. I'm not the type of douche to whistle his ass over or anything so this was kind of annoying seeing his back turned again while chatting with the kitchen staff when I just wanted the check by the end of the night. Dinner service isn't over, stop mentally clocking out dude. When he was around he did seem like a competent server well capable of not being a slight pain in the ass, though. I'd chalk it up to it being an off night on a national holiday if I'm being optimistic.FOODNow I was looking forward to trying a John Dory for the first time as advertised on the menu, but it was altered to Arctic Toothfish. It was perfectly cooked, and moist throughout. It tasted just like Sea Bass to me but I didn't mind that at all because Sea Bass is one of my favorite fish. The accompaniments on that dish were a little underwhelming as they were just lightly stir-fried and lightly seasoned baby carrots with some half slices of purple potatoes and peas. If it was anything more than that, please educate me. My girlfriend's Rib Eye Cap was cute, but nothing to write home about. The soubise was maybe the only interesting thing I found on her dish. We've had some pretty mind-blowing steak in Japan for cheaper than this so we were mostly unimpressed. Our appetizers were alright. My girlfriend loves Foie Gras and was excited to try the Torchon they offered, but she was disappointed. I thought the combination of flavors presented worked well, but we would have much rather had some grilled foie. The Scallop Crudo + Panna Cotta was good though. The scallop was fresh, flavors of the dish came together well and was a very delicate start to my meal. Every time we saw the desserts being served to the other tables, we would just look at each other in awe and get excited for it. When both our Tres Leches arrived we thought it was nicely presented, but it was fitting in the sense that it was a decent end to a decent meal.Would I come back? Yes, for their regular prix fixe menu since it sounds like such a great deal. On top of that, I believe in this chef. What we had that night was somewhat flat, but showed a lot of promise and I really wanna see that through!"]], "Napoleon and Josephine": [["NLP F.", "This place could not be more perfect!  The ambiance, the food, the music, all of it is straight out of old world France.  And I thought the food prices were fantastic for the fresh, home-made everything that you get.  I kept telling my husband they should raise their prices!I read some of the reviews saying the food was too little, etc.  As I said, it's out of old world France.  It is certainly not the massive, disgusting portions that we get served at the Cheesecake Factory.  If that's what you're looking for, this is NOT the place for you. If you're looking for normal sized portions, that are fresh, home made, nicely presented and tasting amazing, then this place is fabulous.  The service is on the slower side but again, it's a French place.  You kind of have to go in knowing what you're going to get.  It took us 2.5 hours to eat here and we enjoyed every second of it. If they served us in 1 hour and packed us off, the food wouldn't be fresh made, it wouldn't be as good as it is and it certainly wouldn't feel French!  Fresh, made to order food takes time to make.  Have a drink and relax. This is my favorite new restaurant in the entire city.  We will be back for sure, even though it's quite a drive for us!!!!"], ["James H. L.", "Before they become an OpenTable 3-week advance reservations required restaurant, N&J reigns supreme as the only Corsican restaurant in LA (in SoCalif, in all of California, pretty much the entire West Coast.)  A French province whose proximity to Italy heavily influences its naturally fusion cuisine. You'll experience something like an Italian classic prepared with French technique (or perhaps French cuisine using Italian ingredients?)  Anyway, it's an outstanding pairing of flavors, techniques and preparation that definitely hits the \"you can't stop once you start\" sort of emotional draw to the cuisine.  The antipasti course (which is ultra-Corsican selections) grows with the number of people sharing the Prix Fixe style ordering (you can still order ala carte if you really wish to, but the value alone of the assembled meal gives you plenty of choice of entrees and desserts and avails you of the bounty of completely unique Corsican delights (think of it like European banchan).  1-person gets you a mixed charcuterie platter; 2 the addition of various spreads and tapenades, 3 adds the salad creations, and 4 includes the really great cheese selections. (bring 4 at least if at all possible, and everything is family style shared.)   Your entrees are individual, but you can always go Basque and share everything to really gain the greatest variety and sense of balance to all the entrees.  We shared a medium rare duck breast with roasted peaches, a veal stew with tagliatelle that you just never want to end, and a veal moussaka that reminds you of a top-shelf shepards pie.  The entire wine list is filled with unique regional Italian and French small producer bottles, all available by the glass or bottle, all at really affordable prices.  The dessert selections sound perfectly normal (tiramisu, panna cotta, flan, and even a chocolate cake) but none of them are anywhere close to middle-road at all. Each one has really unique home prepared qualities, and unique tweaks to let you know these are really special finishing treats to a sumptuous meal.  The decor and atmosphere is quite romantically inspired and reminds you of being in the parlour of a family home.  It's cozy and a respite from the boisterous wildly populated establishments lining the Melrose neighborhood.  Valet parking in front (it's Melrose...so have at it and make your offerings to the parking gods before arriving). Brunch - excellent, Lunch - excellent, Dinner - excellent.  A few more months from now and you'll be waiting weeks for the chance to discover this one."], ["Alex D.", "A very charming restaurant with lots of nuances and old-world flare, Napoleon & Josephine, tries to transport you into someone's Corsican home for an honest meal. The little chachkies on tables and lining the walls comprised of old coffee cans and figurines, make it seem like you are at your grandma's house - homey and warm. As you start to drift away to this far away place, you are quickly snapped back to reality by the glow of the bright yellow Sprint store sign across the street. The menu is simple, yet has something to delight everyone. Starting with the wines, the choices are limited, but pair very well with the meal. For our visit, we opted for several appetizers; Beef Carpaccio, Zucchini Beignets, and a Goat Cheese Tart. Our server was very quick to deliver our wine order and a complimentary Crudités platter. The Comte Abbatucci, Faustine, Sartene we ordered was perfect for our choices of food and came complete with an ice bucket. The crudites platter, although a nice idea, was a little awkward. Complete with crisps and what seem to be Mr. Peanut roasted nuts, it had a few heirloom carrots in three different dips, neither of which stood out. The first of the appetizers to arrive were the Zucchini Beignets. Light on texture, but sadly, very oily and just a tad bland. Perhaps the oil just did not get up to temp enough before frying? Hitting them with a little salt right after cooking would have gone a long way, but the overall flavor was nice and sweet with all the prominent Zucchini flavors front and center. Next on the pass was the Beef Carpaccio, which unfortunately, was also the worst dish of the night. Simply no flare or seasoning. A very mineral tasting cut of beef with no salt whatsoever. A bit of arugula and few shavings of Parmesan dressed with lemon juice did not help. Luckily there was some salt (and pepper) already on the table which did save the dish if only by a hair. The best and the most beautiful dish of the night was the tart. Artistically plated and masterfully prepared, it redeemed the overall ability of the kitchen to produce a great dish and ultimately led to a decision to return to NJ; hopefully soon. The tart ended up sitting on the plate for quite a long time as we almost could not bare to cut into it, but when the initial slice was delivered, it was clear that this creation was meant to be enjoyed not only with one's eyes, but pallet as well. The light flavor of goat cheese danced on our taste buds and married beautifully with an array of well prepared and seasoned vegetables. From artichokes and tomatoes, to asparagus and mushrooms, everything worked together wonderfully well. Our time at Napoleon and Josephine's went by quick and we ended up closing down the restaurant. So for this and everything else, I am grateful to the staff and recommend you give them a try as well."], ["E T.", "Purchased groupons for both brunch and dinner.  Hubby and I were so very pleased that we will return gladly -- no groupon needed.  We have lived in Paris and this restaurant takes us back.  Small, romantic, and more importantly -- delicious, well-prepared food.  You won't leave hungry either as the servings are ample.  Prices are reasonable, and the service is impeccable.  A++"], ["Olivia N.", "Great Dinner!! Wonderful owners, and the whole staff is very helpful and most are from Corsica. Food is French/Corsican. Everything is made fresh!  Wonderful cozy ambiance.  Please get the many small plates Antipasto with both vegetables and European antipasto meats to start, everything is very interesting. Only $35 for Antipasto, Dinner and Dessert.  Less if you forgo the Antipasto. Don't get too filled up as there is lots more to eat. The veal and salmon are both wonderful and also don't miss the Panacotta for dessert it is like nothing you have ever tasted!"], ["Gail G.", "this place is so fucking cute. Every, single detail: the decoration on the walls, the small gold teaspoon, the pepper mill dice cube, the top hat lamp shade. Ahhhhhhh!The staff is friendly and welcoming. Their som suggested a great corsican wine to pair along with our meals.We ordered the beignets, charcuterie, beef stew, lamb, and the osso bucco. Everything on point. Tender, flavorful, well seasoned. Portions weren't portentous. The staff even came to the table to sing happy birthday to bran. For dessert, we got the melba, tiramisu, and their corsican cheesecake. I suggest their melba. Everything is made in house so get that strawberry ice cream.Their to-go containers are actual plastic containers!Tip: if you don't want to valet, you gotta do a ballet around the residential neighborhood to find parking. Not difficult. What to expect: great service and a blend between Italian and French food with Mediterranean influences.I will be returning on another occasion."], ["Maggie H.", "The host & server, Sedrick, was so nice and welcoming. We both got the 3 course meal for $35. There was like 13 things to taste in the antipasti mix, the beef Tagliata was cooked to perfection (med rare) and it was so tender and flavorful, my sister got the Canneloni au Brocciu and it was cheesy and warm. The dessert was amazing we got the cheese cake which was so light and sweet, and the best of the best was the mascarpone with honey. It was like ice cream but there's no cream in it! Afterwards, we didn't feel so over stuffed or bloated even though we ate a lot, but that's how we felt in France as well."], ["Mac B.", "Napoleon and Josephine is a charming new spot on the strip of Melrose between La Brea and Fairfax that seems to be poppin' off as of late. My date and i actually found the spot because we tried to walk-in to Smoke.Oil.Salt but there was a wait. To kill time we wandered down Melrose and happened on this place. Lucky us!The decor was cute and homey. Tufted red leather booths and cute shabby-chic 2-tops make up most of the small dining floor. It's a very intimate yet relaxed setting, like you're having a fancy dinner party at a friend's place, using their kitschy mis-matched plates and what not. To start off, the service was great. Our waitress was French, which makes a French restaurant seem much more authentic. She recommended wines to us (all we saw was a wine list -- not sure if they sell beer or hard liquor).  We went with a $12/glass red that was delicious and a healthy pour. After ordering, a plate of crostini and creamy-type dips were delivered. Not sure if this was supposed to show up... or if we were accidentally given somebody else's appetizer. I'm fairly convinced it's complimentary, but I don't want to make any promises since we were also given a basket of bread! That's a lot of free food!The crostini plate was delicious and the anchovy cream dip was really tasty (very fishy though if that freaks you out).For our appetizer we split the zucchini beignets. Get these please. They were perfectly fried and melted in your mouth. We couldn't get enough. That plate was gone in about 5 minutes. (We were also ravenous, but still. Hit the spot.)For my entree I ordered the cod. It was presented beautifully and cooked perfectly. It melted like butter on my fork, and was complimented by booked vegetables and beautiful red sauce. Highly recommended. My date got the lamb, which was also delicious, very rich and hearty. We skipped out on dessert because we were stuffed and wanted to continue our evening, but i'm sure that would have been delicious too.4 stars because the prices seemed just a tad high. It didn't seem like a fancy enough place atmosphere-wise to be charging $26 for cod."], ["Jim S.", "This place is the biggest joke! How to make you pay a lot of money for almost no food at all !The good comments are staged, it is so obvious when you read them. The food was very blend and the waitress insolent. We left frustrated and hungry. If you want to have a good time and to eat good food, this is not the place for sure."], ["Heather S.", "Initially when I entered Napoleon and Josephine, I was in awe about their intricate and detailed table setting and honestly, I was kind of annoyed that the service was slow - us Americans like things quick and easy. But once our lovely server came over greeting us in her adorably thick accent, I knew I was about to have a love affair with Corsican food for the very first time.Naturally, as the French do, we started with a bottle of red wine. Our server warned us that it needed to breathe, so we waited for it to do so while enjoying our impressively plated crudité. We agreed that she was right as we sipped our delightful wine 10 minutes later and asked what she recommended for our pescatarian paletes. We went with her suggested zucchini beignet and the eggplant topped with honey-garlic aïoli as our appetizers, shared a broccoli cannelloni as an entrée and finished with a homemade strawberry ice cream dessert. And they were all to die for!The beignet was served with a fresh dill-goat cheese, the eggplant had the perfect flavors and textures and the cannelloni was so delicious there was no doubt it was made from scratch. As was the dessert, but I won't even try to begin to describe that. It can be summed up with: sacré dieu! I've never been to France and to be honest, I never knew Corsica existed, but I sure as hell didn't eat like a dainty French person here: everything was WAY too delicious. Come here for what I would assume is a true, French experience. You'll scarf everything down and devour every last bit of it like a true American. (If you feel kind of embarrassed about it, don't worry... so did I.)"], ["La C.", "TERRIBLE FOOD + HORRIBLE ATTITUDE OF THE WAITRESS + $$$$$$ = NEVER AGAIN !!!If I could give this place a minus 10 , I would ! I wanted to go there for a long time when I saw the pictures on yelp and it looked really cute inside.Well, what a HUGE disappointment this was. The waitress was incredibly rude from the beginning, maybe she was having a bad day but I almost did not dare to ask her anything as she clearly did not want to be bothered. Now the food :(((  I still can not believe it. It was the biggest rip-off , what you see in the pictures of other comments is NOT what we got at all: tiny piece of bread, tiny piece of sausage, one tablespoon of granola in a tiny cup, a glass of orange juice (FULL of ice cubes, almost no juice). Trust me I am all about quality rather than quantity but they really are thieves.Not to mention the wait....come on guys 25 minutes to bring a coffee??! We had to ask for forks, spoons, sugar, milk...but the waitress rolled her eyes 'Can't you eat that granola with your hands?'And the grand finale: The Bill.......I am used to brunching with friends all over LA and I NEVER had to pay that much money for so little food. We were actually not the only ones in the restaurant to not be happy about the food and wait.We were so hungry after leaving the restaurant that we went home and cooked something."], ["Lauren G.", "Very authentic! The Owners did a fantastic job with the decor. The little vignettes are adorable and make the vibe extremely cozy and inviting . You could spend hours in here and not even know it. I stopped in late night for a little Corsican wine which was divine and  some charcuterie that hit the spot and can't wait to come back for more. Definitely the best restaurant on Melrose. Stay tuned for more to come from Chef Olympe and her Husband Cedric they are just getting started!"], ["Rodrigo C.", "Went in for Sunday brunch and got more than was expected, 15 dollar brunch was a fair amount of food but everything was so detailed and nice that you felt it was worth more. Great place, quiet and nice ambiance. Would recommend to anybody."], ["Marina L.", "Been there couple times. Nothing short of excellent. It is not all about food or customer service, or ambiance- it is all blend together in most appreciated way. Nice,relaxing, \"you are our guests\" atmosphere, very familiar and pleasant French music, enough for you to already enjoy your experience. Then your food come- simple, fresh, so tasteful. People, working there, nice and open hearted. See for your self and enjoy!"], ["Elizabeth M.", "Adorable place. Loved the food. But, be prepared to spend a very long time dining there. It took a solid two hours for our dinner experience."], ["Paige K.", "I REALLY REALLY was excited to try out this restaurant. When I made the reservations, the reviews on yelp looked great. As the date was approaching, the there were some bad reviews. Not terrible, just mad. I just thought there were possible haters. mehhhhhhhh. the zucchini beignets just tasted like dough in oil. The charcuterie board was so plain. It was something I could have put together at home. For the main dishes, I tried the 7 hour lamb-flavorless. And the veal stew-good. not great).For dessert, I tried some strawberry jam yogurt parfait-ish thing. Also nothing special.I think there are better rustic French restaurants in the area. I would say for the price A Food Affair is much better"], ["Chris M.", "Delicious and great service!  We snuck out for a weeknight date and were pleasantly surprised by the amazing antipasti spread (as well as the main courses and dessert) at this restaurant!  Additionally, they offer generous wine pours and the chef sent out a complimentary cauliflower soup (velouté) because we were cold."], ["Ryan C.", "Went here for my wife and my anniversary and was not disappointed. The atmosphere was romantic and quaint. The people who work here were vary nice and really added to the experience. Amazing food as well with an appetizer of so many little bites of food and a very good dinner and dessert. Would definitely come back!"], ["Craig K.", "We loved this place! Antipasto, main, dish, and dessert for $35. The antipasto was outstanding -- don't skip that course.  We also had the branzino, duck, and beef main dishes and they were all excellent.  For dessert both the panna cotta and chocolate cake were great.  We also had the True Myth cab for wine and liked it enough to get a second bottle."], ["Mat M.", "One word! Excellent!! I'm so glad we decided to come here tonight. The food was good, the service was good this place is a must visit. Only bad thing was that we had a hard time finding the place. Maybe the owners should get better signage to let people know they are here. Cheers!"]], "Madame Monsieur": [["Phil S.", "Great spot to grab food on a weekday in DTLA. I had the turkey baguette sandwich and it was delicious. Run by real French people and they were very nice."], ["QuelRac C.", "Stopped by this morning to grab a French breakfast and it's perfect for me. The croissant and toast with butter and strawberry jam plus coffee all for 5 bucks. I bought lunch from them too yesterday. Had their tuna sub and the taste was really good. However, I would suggest to add a little bit more tuna please. But the flavor was really good. I remember talking to the lady owner way before they were serving soup to make leek soup and I'm so glad that she did. Their potato and leek soup is just how I make mine at home (similar) :)  It's really good! They only have one size for the soup. Maybe add another size bigger? A must try for all of you soup lovers. Place is small but in it are really very nice French people who serve you everyday with a big smile."], ["Arielle M.", "Working in downtown, I always like to try new places. This gem is a little Parisian cafe in the heart of downtown!! The owners are extremely friendly and helpful. They have ready made petite sandwiches and salads along with a variety of fresh pastries. The ingredients are fresh and the pastries are so fluffy!!  I have been there for both breakfast and lunch- everything has been delicious!! This is my new go to spot and I couldn't be happier."], ["Karen A.", "This place completely exceeded my expectations and actually forced me into a yelp account. I walk in and it's such a cute little place. Super clean and only the essentials making the coffee and pastries stand out even more. All I had was a croissant and it was deserving of a five star review. The French guy that rang me up added to the whole atmosphere and as soon as I took a bite of that croissant I was in love. I will post pictures upon my next visit which will likely be tomorrow. I'm hooked!"], ["Lina W.", "I live the concept of this place: tiny sandwiches, pastries and snacks - I often crave a small savoury snack but find that difficult to find and there I got a delicious croque-Monsieur just big enough to fill the gap - and it left space for a couple mini-madeleines (I think they call them \"Downtown mix\" - bag of 6). The owner and staff are French (you can hear) and the place (also tiny: a couple of perch chairs inside and a few chairs outside) very tastefully decorated in a Boheme-meets-zen way. I wish I was Downtown more often so I could try more of the menu and also the coffee. 4 stars because I haven't tried enough items to judge!"], ["Navil M.", "Yummy food! French inspired! Great service. I recommend it for a quick lunch time. Love the bread it super fresh!"], ["Elly P.", "Customer service is amazing! Food is super good and fresh! The owner is super friendly"], ["Barry Z.", "The jambon beurre on a french baguette is amazing.  Just like the ones I've had in Paris.  I tried a similar sandwich at Petit Trois, which was horrible (too sweet and too much butter).  The jambon beurre at Madame Monsieur is perfect.  Crisp on the outside, chewy on the inside, and just the right amount of butter.  For the best baguette in LA, this is the place."], ["Eric S.", "Very, very good. I've never been to France but I feel like I got a true taste of it here."], ["Linda D.", "A little of Paris in downtown, love the food and portion!  Petite size is the way to eat..they were very pleasant and nice.  My salad and sandwich was oh la la..Thank you for coming to Downtown.  We don't have anything like this in the area..@_@"]], "L'Assiette": [["Kevin T.", "THIS DISHUpon leaving, my friend said something to the effect of 'I wish they had more options...' slightly missing the concept.  L'Assiette, you see, means 'the dish.'  The dish in this case is the French classic of steak frites and because this is on Melrose (I imagine...) also offers fish and vegetarian versions (because God forbid).  Still simplicity is the name of the game here.  $25 gets you steak and fries and an option of soup or salad to start.   On the end there are desserts and cheese available.   This was good! It is a decent amount of food served strangely in two parts where they will literally bring you steak and fries and then a bit later, bring you more steak and fries... Much like the questionable decision to split the recent Mockingjay picture into two, I'm not sure what the motivation here is.  I suppose I haven't picked up the source material in this case.   Maybe so you skip the second half? I felt if you weren't trying to eat like a monster, it's enough to split for a small dinner for two and what a value! But where's the fun in that--a split meal incurs a $10 penalty.  And I remember when $10 got you a movie ticket...Either way I think it is a good meal and a fair price.  I was happy to get the 'secret sauce' on the side as I learned I liked it more on the fries than the default of something for the steak to swim in, but you wouldn't be in the wrong either way.  Off all things the ambiance let me down.  It felt a little generic steakhouse to me whereas most the French-ish places I frequent in this town pour on the charm.  A bar in the middle WITH tv struck me as odd."], ["Michael C.", "Fantastic all around.We came on a Thursday night around 7:30pm and the place was surprisingly empty (surely didn't need the reservation that I made a week in advance). We brought our own wine, I had read on here that it was a $15 corkage but it ended up being $20. They do have pretty affordable bottles, so unless you are bringing a really nice bottle of your own choosing you might want to have a look at their options.I don't need to spend much time talking about the food. Every bite I took was just incredible. The steak frites for $25 is the best deal in town. Mouth watering. Good luck saying no to the 2nd serving.Do not leave without getting the ice cream puff pastries."], ["Emily B.", "DON'T MISS THIS PLACE!!  I'm absolutely in love.  Some of the best steak I've ever had.Starting at the beginning: we went on the Thursday evening before July 4th and were pleasantly surprised to find the place very quiet.  We were warmly welcomed and seated, though we did have to ask to move tables out of the direct blow of the air conditioner.  Silly us, we asked for menus because we thought they had only mistakenly given us a wine menu.  It looks like they have a few more options now since we last went, so maybe they hand out menus now, but really, there's no need for them.So, it starts like this: order a glass of wine or a beer, because you're prepping and relaxing for a great meal.  Order the sorrel soup to start (seriously, do not pass go, do not collect $200), not the salad.  It's hard to describe what makes it so good-- it's creamy and has an earthy green flavor almost like broccoli soup, but a little more lemony and so much better.They'll write how you want your steak done right on your butcher paper table covering and in no time at all they're ushering over two plates of steak with their special sauce and a huge heap of french fries fresh from the tallow.  Some people have written that the steak has a soggy feel to it but I honestly have no idea what they're talking about.  The steak is the most tender piece of meat I have ever had at a restaurant and I was instantly in love.  I almost fainted at the table right onto my plate of food because it was so good.  The one tiny thing I think I might change is getting my french fries fried in the optional peanut oil instead of the beef tallow.  The normal beef tallow fries are certainly a more authentic French tasting meal, however, they're just SO much richer. So here you are, having just finished your plate of delicious food and you are stuffed.  Then a smiling waitress comes to your table with a platter full of fries and another portion of steak for each of the diners at your table.  My boyfriend and I looked at each other in amusement/horror, because we were just saying to each other how full we were.  Terrified that they were going to take my portions back to the kitchen never to be seen again, I said I could handle a little more on my plate.  My boyfriend straight up asked if he could box this second serving and they graciously packaged his and what was left of my portion on the platter as well.  I couldn't believe it!We had a livingsocial or blackboard eats deal, and since dessert was the \"deal\" part that was included with the meal, we went ahead and stuffed ourselves even more.  The Amaretto cake was divine (although most of it came home with me, too).  The BF had profiteroles, which were the low-point of the night, in my opinion-- they weren't totally as cooked as they could have been inside and I think they were just a bit messy and an un-elegant finish to an otherwise perfect meal.Really, $25 for both the meal and a starter (the soup or salad) is unbeatable considering the romantic ambiance, the simplicity of ordering (no need to impress anyone here with fancy choices-- there's only one real option and it's just plain good) and the quality of service and food.  The BF and I are a bit strapped for cash but it doesn't mean we don't love a classy night out ourselves and this restaurant gives us the perfect price-conscious option without feeling like we cut corners or had to slum it for date night.Final point: they're open until midnight every night and have what looks to be a fantastic late-night menu ($14 for a steak sandwich or $12 for a steak salad, etc).  We live in Santa Monica, or else we'd be out there all. the. time."], ["H. M.", "I didn't really believe in sous-vide until I came here. OMG. What a difference. The meat was melt-in-your-mouth tender. It was amazing. The shoe-string fries were nice and crisp, and the sorel soup was delicious. They also had a cheese plate which I had not seen elsewhere in LA restaurants. You pick what you want, they cut the amount you want, and they charge you accordingly. Being the fromage-crazed, I of course got a little bit of everything. Desserts were fine, not great, but the coffee deserves praise. Full-bodied, and piping hot. (I really hate fancy coffee service where the coffee is luke warm!)My only complaint was the slow service. Not sure if the server was new, but it could have been better. And since this is Melrose, parking is like the lottery.The place is cute, and definitely date-worthy."], ["David L.", "I love it here. It was a great night and we enjoyed ourselves. There is only one thing on the menu, steak frites and you have a choice between soup or salad. I chose the salad and my wife chose the warm soup. I liked both but the soup won it for me. The steak is amazing and the fries are awesome as well. If you aren't carb friendly they offer mushrooms in lieu of fries. You receive two portions with your meal and it's just the right amount of food. The wine menu is very extensive and amazing. We ordered a pinot noir from California and it was great. We ordered all of their desserts and they were all exceptional. I plan on coming back in the near future. The decor of the restaurant is top notch as well. You can tell they put a lot of time and effort into the project. The HUGE wine fridge in the back is equally impressive. There is street parking or valet in front."], ["Diana W.", "It's a great concept. The only thing on the menu is steak frites. But let me tell you: if the only thing you serve is steak frites, it better be the best steak frites in town. They have vegetarian options and a fish option for non meat eaters.  The steak was good, not amazing. Too much sauce. The frites? Basic boring french fries. Truly nothing special. The place has a cool vibe, the staff was friendly and the wine was very good. If we went back, I'd ask them to put the sauce on the side."], ["Ken C.", "AMAZING EXPERIENCEA wonderful customer of mine recommended this place for great steak & fries. The name was hard to remember but while walking to Baskin Robins I saw the red entry and read the name and instantly recalled this was it.Walk in and you are instantly transported into elegance. Our waiter Josh made the experience from great to amazing. He guided us through selections of cheese and wine insuring that each of the four of us would get something special to suit our taste.Our warm bread cheese and wine prepared our palate for what was to come next. The main course is limited to steak, mushrooms, fish, soup or salad and fries. We all went with the signature steak and trust me that is what you want. It was the most tender steak I have ever had covered in a sauce that was heavenly in flavor. Far better than any filet bone in or otherwise. The fries are crispy and delicious showing that their 8 step 24 hour process in preparation makes them special.The meal is served with one portion first and then a second portion when you are ready to insure that each bite was as warm or crispy as the first serving. What a great idea!I was hoping to try the beignet desert with ice cream in the middle but just didn't leave enough room. I'll be sure to leave room for it next time. I have a feeling I'll be seeing this restaurant often.Thanks Josh for topping off a great meal with your service and expertise!"], ["Phil A.", "Jump on the steak fites train!  The only reason that they don't receive five stars from me is because of a few tiny glitches in the service.  Other than that, delicious salad, and perfect steak.  The sauce and fries were right out of Paris.  We skipped dessert, and headed to a local gelateria instead.  Wine list needs more French options!  Other than that, we have no complaints."], ["Niousha K.", "The meat was very good. It had a great texture and taste. The portion was very good compared to the price. They gave me 2 really well portioned steak servings. The fries were fried to perfection and had the perfect golden crispiness. The only thing I wasn't crazy about was the sauce. It was good, but le relais de l'entrecôte sauce is so much better. The waiters and waitresses were very kind, the service was very good. And I loved the french bread. :)"], ["Angela R.", "Was DELISH! My boyfriend took me here for our month anniversary! Had a full lunch! Steak Frites comes with either soup/salad! Comes in 2 portions, got me really full so I had to take my 2 portion to go! Lovely ambiance and lovely staff! Music was great and outdoor seating was pretty cute! Worth the price and would definitely come back! Bring your date lads!"], ["maria f.", "my new neighborhood favorite is L'Assiette. immediately i had a great feeling as the waitstaff is authentic french and clearly love what they do. service is impeccable and super friendly. the vibe is completely wonderful and frenchy. sit in the outside area - such a lovely ambiance. whoever is picking the music has marvelous taste - our table loved everything we heard. now for the steak frites .. simply delicious in every way. steak was perfectly cooked, tender flavorful. frites were crispy, seasoned slightly and hot and delicious. perhaps the very best thing about L'Assiette is how they serve in 2 rounds. just when you are feeling stuffed they come around and serve more steak and more frites and somehow you WILL find the room to eat more! as well, prices are very reasonable!"], ["Sil V.", "The place was cute with a nice ambiance. The service was great and our waitress was very polite and attentive. At one point, either the owner or the manager came to check up on us as we were leaving...nice touch. We obviously had the steak frites since they were so popular. Great portion, good meat, and a whole lot of fries! The steak, as we concluded with my guest were not to our liking because we prefer it made differently, but not to say it was bad or there wouldn't be a big audience for it. I especially liked their soup."], ["Mark R.", "Came here for DineLA, prefix menu is a deal for the price they set which is $35, pls see my pic of the menu. I chose both the salmon and steak as my main entree, both medium rare. Steak is OK, i had better. Salmon is juicy and tasty. Steak fries is good. The wine is good too. Valet is $7 too risky to find parking in the area coz of parking violations we might incur. The place has a nice ambiance and not crowded. Reservations is a must, we didn't even wait."], ["Kai H.", "This place is classy and very nice.  The steak frite is amazing.  That gravy is rich and yummy.  The steak is cooked perfectly.  Service is wonderful.  Prices are reasonable.  This is the ideal place to bring a date.  I mean, just match the meal with a good wine and you are set!!!"], ["Lawrence R.", "What an elegant and yet casual experience. An intimate and chic room more reminiscent of Paris or New York. The service was excellent. Wine well priced and curated.  The steak frites were quite  well prepared. We will be back!"], ["Darling G.", "Delicious!I was craving steal frites one night and when I saw that it's pretty much all they serve here I realized I just had to try it. We had some foie gras for appetizer and then each of us ordered the steak frites. The portions were great and the meat was cooked just right.We'll definitely be back again!"], ["Bob D.", "Steak and frites is their game, and they know it well.  Excellent service, excellent food.  Why only 4 stars?Well, it was empty on a Saturday night and I don't much like the feel of empty restaurants.  Not necessarily a bad thing, but I live lively atmospheres.As to the real reason, the steak was not as good as I had hoped.  I like sous-vide meats, but not as much as nicely grilled/charred steaks.  The meat was tender, but I noticed that the tenderness was not as uniform as you would think.  So there was like one or two tough pieces, and the rest were like delicious marshmallows.  I also got a little overwhelmed by the sauce, and hard a hard time finding the meat on occasion.  Don't get me wrong, it's still very good.I have not had the urge to go back, but I can see myself returning."], ["Ginger J.", "Get the steak!  DELICIOUS!  We loved that they served the main dish at two different times, so your meal stays warm.  The cheese is amazing!  Our waiter was really great!"], ["Peter I.", "In the history of great restaurants, there is always a face behind them. Daniel at Dainel's in NYC, Wolfgang at Spago, Emeril at NOLA, Mario and Nancy at Pizzeria Mozza. The passion and attention of their place, their food....they had the inspiration and vision and open it up. Against all odds in the restaurant business. Well, last night I ate at another courageous spot called L'Asssiete. One dish and one dish only (OK and a fish or a mushroom) and that dish is perfect. Steak Frites! Oh my. It was my wife's birthday, so I called up some of her friends and went outside of our bubble in Manhattan Beach and made the drive to Melrose to see Jacques. He is the man behind this really great simple concept and the passion of his idea is all through the dining experience. He is always right there, in a non clingy get- out of-here way. \"How can I help, How was the steak cooked? More wine?\" A real restauranteur. Loved him right away.You can start with a salad or soup (I had the soup and it was divine!) and then the main dish arrives. Wonderful sliced steak with those fries and that sauce. OMG was it good. And if that's not enough, they come back with more if you can eat it. Wait, all this for $25.00? Yes!!! All perfectly cooked. The staff was exceptional with Bridgette taking control and treating us as friends.I would go back tonight and the next night if I could. This is one of those places you find on a rainy night in Paris off the main streets and remember it as the best meal of the trip All because one man decided that one dish was enough. And put his money where my mouth was. Bravo!"], ["J.D. F.", "I've eaten at L'Assiette's on 4 or 5 occasions, and every time I've had the steak frites with black truffle sauce, and every time it's been delicious. I appreciate a place like this that does one thing (basically) and does it well. The ambience is moody and inviting, equally good for a date or a night out with friends. The waitstaff is always fun and attentive. And even better the prices are very reasonable. Highly recommended."]], "Taix French Country Cuisine": [], "The Little Door": [], "The Briks": [["Anne W.", "In the most unexpected last minute dinner reservations on my bday weekend... We found this spot near the lounge I wanted to head near.Three and a half stars.First off.. Not a typical place I would go to.  It's a mix of cuisines I am not a big fan of.  The dining area isn't really trendy but casual... It was playing a team the entire time we were there and the tables are fun with garbage pail kids and other retro pics...Pleasantly surprised.  We ordered a wide number of things.. Some recommended by the waitress.  Funniest thing we saw that night.. Somebody walked into the glass thinking it was a door.  Oops... That window must have looked too squeaky clean!The chicken was the best surprise of all... The cous cous was so good (probably not good for you) and the chicken wasn't dry.Brussels sprouts were okay... Seemed healthier than the really tasting ones which are deep friedRoasted vegetables were yum!  If you like vegetablesWild mushroom ragu...  Delicious if you like mushrooms which I do!Tree hugger.. Ehhhh... I guess if you're vegetarian that's the closest you'll getThe bougie... Delicious.  Fatty.  We got two... Must like duck.Pork belly.. Meh.  Not really a fan... Tasted more like pulled pork.I don't think the bill was too bad considering we also got a bottle of wine."], ["Oliver V.", "Awesome place with a unique vibe. Food will stick to your ribs and they pop with flavor. Chef came out to say 'hi'. You can tell that he really puts his passion into his food and making this an original joint."], ["Adam P.", "It's a great experience. The food is exquisite. I love my sea bass. The seasoning is perfect for me. Service is also great. Our waiter is willing to give our group individual checks. Parking is expensive though; I think it's still worth for dining at this place. I will definitely come again."], ["Eisa A.", "Food was really delicious and it felt like a fresh homemade food, great new ideas and it all tasted as good as they looked or even better. I had the steak and potatoes, I'm not a fan of coffees and this meal was somehow marinated with coffee, didn't like the idea but I went for it since I never had such thing, it tasted soooo good and I highly recommend it. Good experience and I must say great staff. Friendly and into serving you the best of what they could offer. Thank you guys."], ["Celine L.", "First time trying African cuisine and was I surprised at how delicious it was. Upon walking in on a late Monday night, the server immediately greeted and sat us down. He then gave us a detailed breakdown of the menu since it was our first time, and explained all the dishes to us. He was so good at speaking- we wanted to order everything on the menu! The restaurant has a spanish and african influence such as their North African savory pastries (briks), Spanish style pizzas (cocas), and the restaurant decor overall.The briks, which is what they're known for, are basically pastries with meat and a poached egg inside. These were... amazing. We ordered the Guru which had curry chicken, potatoes, peas, and tamarind sauce, and the Bougie, which had duck confit, cauliflower puree, duck egg, and balsamic truffle glaze. Each brik came with a side of salad, and this was seriously such a delicious appetizer! The puff pastry was light, fluffy, and crispy on the outside, and when you cut the pastry, the runny egg seeps out.... some serious egg porn! Our favorite was the guru due to the nice blend of flavors and the texture. The briks are a definite must order! We ordered two entrees to share- lamb shank with seasonal veggies, figs, roasted baby potatoes, lavender, and red wine reduction ($24), and the pork belly pibil with onion wrapped in banana leaf, black bean and chorizo puree, street corn ($24). The lamb literally fell off the bone- it was so tender we didn't even need a knife to cut it! The sauce was nice and rich, but not too viscous. The veggies such as at the potatoes and carrots that came with it were so good! After finishing the lamb, we could even eat the bone marrow inside the bone! So good.. I don't typically like lamb and I could not stop eating this dish! The pork belly pibil was super interesting; the pork belly as shredded and had a sweet and savory taste to it. It also had other toppings mixed in and it as very unique, but yummy! I ate mine with the beans for more flavor and texture. The street corn was yummy as well, too bad we had to share one!We also had a chili mango drink which had the mexican candy tamarind on the rim and shaken with jalapeño- tasted like delicious orange fuzz with a hint of jalapeño and a nice tamarind flavor. Definitely a drink that I would recommend as it is different from the norm. I was overall very happy with the food that I tried- definitely an awesome first impression! I was thinking about the briks all day today.... The service was so good; they constantly check up on you and explain all of the dishes. 4 stars for food, +1 for great service."], ["Brandy E.", "I love this place! The decor is to die for! The drinks are amazing! The staff and service is excellent!  While working downtown the Briks has become my #1 Happy Hour spot! The Descada fries are a must try! The Hibiscus Mule is also a must try! I think I might even swing by again tonight!"], ["Andy O.", "To really enjoy your experience at Briks, do as you would do at Baco Mercat: stick to what the restaurant is named for. For the money, you can have one boring chicken or lamb dish, or you could four or five pretty-good-but-probably-really-fatty briks. Frankly, I don't know why places like this even put \"entrée\" items on their menus. They're generally overpriced, underwhelming, and pale in comparison to their claim to fame specialties. We had entrees, briks, and cocas. Of those, only the briks were at all good.Overall, a chill experience, and a bit \"different\" from what you'd get elsewhere. But I think they tried to replicate Baco Mercat's formula, and they haven't quite nailed it."], ["Ben S.", "Mario is outstandingConcept is great Execution is divineMusic is excellent - Cymande \"Bra,\" Air \"Moon Safari,\" Zapp \"More Bounce to the Ounce?\"...the soundtrack didn't quit over two enjoyable, leisurely visits. Decor is mega. \"The Answer Is Love,\" in the chef's own graf penmanship?  Tables each painstakingly detailed with long-collected pop imagery?  An homage to Marilyn in the bar, and to LA itself in the adjoining private dining area?Friendly vibe from each and every professional, helpful member of staff?  Capable and enthusiastic service you rejoin with your own \"hell yes\" attitude?Food at lunch that refreshes, fills, and invigorates?  Beverages of the day that raise an eyebrow (like spinach-pineapple agua fresca) and whet a whistle?  Dinners that showcase cooking talent, world cuisine, and local sensibility at once?  Desserts you have to strive to try because you were greedy for creative and tempting appetizers?An owner with a from-there-to-here story of personal triumph, and infectious ebullience you can't help but catch?All of the yes - and all of the stars. Like a boss, Mario!  Keep shining."], ["Anika C.", "A friend and I tried this place for the first time together and were pleased to do so! We sat outside on the covered patio for a nice mixed view of the restaurant interior, sturdy plants on the patio, and part of the downtown LA skyline.I can't remember our server's name - she is shorter with short dark hair, luscious lashes, and way cool/friendly personality. She was helpful in deciding what to eat and drink and I was very happy when she said I could order my brik without egg - I'm not an egg fan. I still don't know what \"shwarma\" is but I enjoyed The Dictator. My friend enjoyed her Guru brik, though she said the egg was a little runnier than she prefers.My favorite dish there was the roasted artichoke coca - all veggies, beautifully blended flavors, nice consistency of the flatbread!I like how the menus are housed in peechee folders - it took me back to childhood!I will definitely visit again."], ["Anh N.", "Amazing service, great food, solid 5 stars!!Came here on a Saturday night with reservations and got seated right away. They have HH from 5-7pm even on Saturdays - get $2 off all alcohol!Peanut Butter Stout TimeTry the Peanut Butter Stout even if you're not a peanut butter fan! It's super fragrant and the peanut butter flavor is not too strong.  Great beer.Spectacular Service Our waitress was super thorough with the menu, going through every type of food and describing what it was as well as the options she'd recommend.  Usually they just go over the specials but she took extra care in helping us understand the menu and what to get.The owner/head chef (I think) came out and chatted with us throughout the night.  He walked around to every table and did that several times, just checking on our food, describing what everything was, making small talk - it was so pleasant!I Love LambLamb Shank - best entree of the night. Huge portion of 8 hour braised lamb shank that was perfectly seasoned and tender. 3 Briks - can't remember which ones but they were ALL good.  A Brik is an African savory pastry that has a flaky outer crust similar to an egg roll wrapper.  There's sauteed meats on the inside with a poached egg in the middle, so you have to cut it right in the center to get the delicious yolk evenly distributed.Truffle Mushrooms - good sauteed mushrooms. Not special, but a good side dish.Batata Harra Tots - fried wedge potatoes with a dipping sauce. Delish.Thyme for Takeoff - very juicy on-the-bone chicken served with potato croquettes. Usually don't order chicken at restaurant because the preparation varies too much, but this one was perfectly juicy and seasoned well.Chorizo con Papas Coca - this is like a flatbread pizza without the sauce and cheese.  It wasn't bad, but not a favorite at the table.  Wouldn't recommend this specific one.There was a group of 8 of us and we paid about 30 each with tax and tip for dinner and drinks.  Not bad - highly recommend this spot! Get in before the hype catches on and they fill up!"], ["Dean N.", "Score one for The Briks.My friends wanted to hang a get together in DTLA and someone suggested the Briks.  I have never heard of it, so I was excited to go there upon reading the other Yelp reviews.The Briks is a small restaurant at the corner of Hope Street.  The ambiance is cozy. There is both outside and inside seating.  The outside seating is good for people watching since it is close to Staples Center, and you know there are characters coming out from that direction.  Inside seating is nice, however, the music when we went there was a little loud.  This is just my own opinion. The staff is very attentive.  Upon entering, the hostess asked if I wanted to be seated since I was the first to arrive from my party.  I decided to wait until my party arrived.  Initially we were seated across from a LOUD party that spoke extremely loud.   The staff was very accommodating to my party and switched us to another table so we could speak and hear ourselves and not the other party.  I ordered the lamb shank.  It was a large shank which is meant to be shared with another person or your table.  I shared with my friend but ate most of it.  There is nothing like having a soft, braised lamb shank with a large bone to suck out the marrow.  Prior to having this beautiful morsel, I ordered one of the briks.  The briks are a traditional pastry served with meat and other filling with a raw egg in the center.  I found it to be most pleasing.  The texture of the flaky pastry shell and moist egg someone works.The only drawback from this dining experience was the parking situation.  Being it is DTLA, finding \"free\" street parking is challenging.  However, there is a valet lot in the back and a pay parking down the street."], ["Aileen K.", "Maybe I should have dropped by for dinner instead of brunch. I was definitely not impressed.My party of 9 or so girls came Sunday morning for brunch with rezzies and got seated relatively quickly even though not everyone was there, which was appreciated. Our server got us started with drinks while we were waiting for the people who were coming late. Because everyone was coming and leaving at different times, we intentionally began ordering in the order we came. Others ordered as they arrived. Our first food item did not arrive until 50 minutes later. I think it would've taken longer had we not asked our server to check on the food. If the food was amazingly good, it would've been excusable. Nobody was happy with their dishes and what had originally been happy pondering of what to order off the amazing brunch menu, ended up being the need for hot sauce and salt. At least their hot sauce was habanero-amazing!~ My personal dish, the croque monsieur, madame style with the egg, had to be eaten with my hand like a piece of crostini because the bread could not be cut with a knife. Yes, it was that hard. At least the fruits were seemingly fresh and varied.Regardless, will never come back."], ["Elbert V.", "Chef Mario and his team are really great!  Great food!  The lamb shank and African Chicken are to die for.  Oh, not to mention, the couscous is a must eat.  A must try and I promise, you'll love it!  Two times I've already been there, but I'll be back there again sooner than later."], ["James T.", "I don't give many 5 star reviews but when I do....First, let's start with parking - if you see the valet on the street (The Briks establishment is separated by a Japanese business on its right side), take it! $9 for 3 hours parking, as you dine at the Briks. Sweet!Next, let's talk service. Big smiles from the staff all around the floor. Grins and observations from those in the kitchen, making sure no one frowned after their initial bites. And of course, great customer service. Anything you wanted or needed - they were there for you. Awesome!Now onto the food. I've never had African food, but to have a delicious fusion of African/Spanish/French food, as the establishment claims - is a wonderful experience for your taste buds. As our party came in, I immediately analyzed the menu, scanning for items that could be labeled, 'exotic,' 'exciting,' or 'e-mazing' (needed another 'e' word but wanted to use 'amazing'.) I found it.First, \"The Bougie.\" A BRIK, essentially a North African pastry, that is made with duck confit, cauliflower puree, duck egg, and balsamic truffle glaze. Essentially, you break the surface in the middle, and everything mixes together in a fantastic dance of flavors. Delicious!Next up is an entree named \"The Shank.\" A braised lamb shank, surrounded by seasonal veggies, figs, roasted baby potatoes, lavender and a red wine reduction. Please note that as a manly man who loves to eat and get his money's worth (portion size) - this is the biggest The Briks has to offer! It's very heavy, so be fancy and pair well. How? See below!And of course, the dinner beverage pairing (fancy or bust) - \"Colores del Sol Malbec.\" A deep red Argentina wine (2012 year) with a bold and smooth finish, the chef and I readily agreed that this would be the best wine pairing to match \"The Shank.\" It ensured the flavor of the entree and the wine did not clash, but rather, kept the flavor of  the meal alive from start to finish.All in all, the experience was a little pricey but you know what they say (and it's cliche) - \"you get what you pay for.\" The Briks - thanks for the experience! I'll drop by again when I return!"], ["Jiwon S.", "Discovered this really interesting restaurant on RushOrder app. Very unique and delicious restaurant in downtown. Ordered delivery through the app because I absolutely HATE downtown traffic and parking. Plus I got $3 off using HUNGRY3 code that I found. The savoury pastries were so delicious! I tried the cholo brik and the bougie brik. YUM! And they amazing spanish style pizza \"Coca\" and we ordered the seafood one. Definitely worth ordering again!"], ["Zach G.", "Came here on a Sunday for a 2-person dinner. Our order: the lamb shank, the seafood flat-bread (vodka sauce), the tony montana briks, and a side of seasonal vegetables. Everything had good flavor, and with the exception of the overcooked/somewhat rubbery seafood on our flat-bread, everything was prepared nicely. Combined with decent prices on the whole and nice decor, I give this place 4 stars.But for me, the only stand-out dish was the Tony Montana Briks: thin pastry filled with pork, black beans, onion, egg, mojo sauce and then deep fried. Struck me as a kind of cuban-inspired, rectangular egg roll. Really, really good. Again, everything else was tasty, but most of this 4-star review is probably owed to that dish alone. If I make it back, I'll stick with just the briks."], ["Carmen S.", "This was our first meal in Los Angeles and I am SO thankful we found it, thanks to Yelp. I mostly don't eat meat, but we were on vacation and everyone was raving about the Shank. I've never even had lamb before, so I went out on a limb and I was not disappointed. So tender and delicious, the meat was falling right off the bone. I saved a fig for my last bite as the combination of fig and meat was probably one of the best things I've had together on a fork. My friend had the Halibut, which I believe was a different fish that night. She really liked the cauliflower puree. We also got drinks. Hers was some kind of strawberry champagne that I think was called the Marilyn? I got some sort of lavender margarita. We were flying that day and I hadn't really eaten much. It was strong, so I got drunk within 2 sips. We had fun picking out the pictures of old punks on the tables. The vibe was definitely very eclectic, but cozy and warm. Our waiter was top notch. He was super outgoing and did a great job answering questions and explaining dishes for us first-timers. Normally I don't care when a waiter gives suggestions, but he was really genuine and you could tell he was well-versed in the menu and liked his job."], ["Kerri H.", "Okay... This place is no joke!!! Delicious doesn't even begin to describe it.  Mario, the owner, said it best when he came to visit our table \"this food is made with love\". The bread pudding is his moms recipe and its life changing.Even the Kale salad was delicious.I didn't try the peanut butter beer but the colleagues enjoyed it.  Tots were spicy!!! Fries were yummy.Artichoke flatbread pizza was fantastic!!! Will be back...Darrell was our server and he took great care of us.  He really loves this place and wants to make sure everyone else gets the best experience!"], ["Tyson N.", "It's my first time dining here and I have to say it's amazing. I had dinner with a friend: who is a friend of the owner, Mario.  All I have to say is this guy makes food to comfort your heart and comes here everyday for the love. I seen this picture on the wall and learned it was his grandparents. When he was younger he always told his grandma he would have a restaurant downtown LA. Lone be hold here it is, she comes and visits on Sunday's. The food is simply incredible. Give it a try."], ["Ruth K.", "Not very impressed. The Briks has been bookmarked for a long time for me so I was super excited to finally try it out! The restaurant isn't very big but it is spacious. They have a nice patio outside, too. The decor is unique; very \"hip\" and casual, but the whole restaurant still gives a higher-scale vibe. The service throughout our whole meal was amazing. Our server was friendly, attentive and knowledgable. I love when the employees have a lot of pride in the restaurant and its food! She helped us a lot with our choices. The food though, was easily forgettable. We ordered the kale salad and two of their briks as appetizers.I liked the salad but it wasn't anything special.I enjoyed the briks! Very unique and flavorful. I love runny yolk so kudos to that. A little oily but I tolerated it. For entrees, we ordered the lamb shank, the pork pibil and a side of fries. Honestly, we liked the fries the best. Actually, no. The pork came with a spicy corn on the cob (mexican elote style) which was bomb. None of us enjoyed the pork or lamb very much. Nothing was inedible but it wasn't great. Sorry to say, but I probably won't be coming back!"]], "République": [], "Le Comptoir": [], "Patina Restaurant": [["Jennifer B.", "Although Tony Esnault hasn't been the chef at Patina for over a year, his influence is still everywhere on the menu. From the selfsame breads to the zucchini-filled pasta to the cucumber vinegar found in small dots around the rims of vegetable dishes, not much has changed in Esnault went to Church and State. Unfortunately Patina's current chef, Charles Olalia, doesn't do Esnault's dishes quite as well as the original versions. And it's a shame that he hangs onto the coattails of his mentor so much because the best dishes now are the ones in which he branches out and employs his own style and unique flavors.I ordered the tasting menu (which seems to have the most variability of all the menu options but in reality is just a recycling of a la carte dishes) and added on a risotto. From top to bottom, here's what the evening looked like: Amuse bouche: Miso panna cotta, pickled shiitake, puffed rice, micro greens yelp.com/user_local_phot… Wow, they chef doesn't waste any time easing his diners into savory flavors. This was bold and umami-packed! 5/5Three kinds of breads were offered, including a nine grain and an olive loaf. I wasn't overly impressed by the breads or the butter. 2/5Zuckerman's Green Asparagus, American caviar, vin jaune sabayon yelp.com/user_local_phot… The plating was beautiful but unfortunately it tasted quite boring. The salty caviar was the best part of this bland dish. 2/5Morel mushroom risotto with acquerello rice, Parmesan, and vin jaune yelp.com/user_local_phot… Soupy is the word of the night. Grains of rice were swimming in the wine and cheese reduction. It was more like lumpy fondue than a typical risotto. And I wish the morels had been cooked into the risotto instead of just being added to the end so that their earthen flavor could be more pervasive. 2/5Santa Barbara spot prawn, coconut milk, steamed taro, Fresno chili yelp.com/user_local_phot… This was one of the few times when the chef (Charles Olalia) departed from the standard that the previous chef (Tony Esnault) had set with the menu, and it was the best bite of the meal. The prawn worked surprisingly well with the coconut and taro, which added some serious flavor without overwhelming the natural ocean sweetness. The chili was sparse but added an extra punch to the dish. 5/5Halibut à la plancha, fennel, potato, tomato confit, clam yelp.com/user_local_phot… While I enjoyed the vegetables (and clam) an the bouillabaisse reduction, the halibut itself was severely overcooked - much more than I've ever experienced at a Michelin-rated restaurant. 1.5/5Short rib, bordelaise, potato lasagna, morel yelp.com/user_local_phot… The meat was fork-tender and incredibly savory even without the deep wine sauce. The \"potato lasagna\" was 20+ very thin layers of blanched potato were buttered and laid on top of each other before being braised. Very creative and a very delicious course! 5/5The cheese cart featured two bleus, two goats, several semi-softs, etc. yelp.com/user_local_phot… I got a plate of 5 cheese with 2 breads, lavender honey, orange marmalade, golden raisins, and toasted hazelnuts. 3/5Key lime pie, cilantro sorbet yelp.com/user_local_phot… The sorbet was very strangely strong and wasn't a typical dessert flavor. The pie was good but overall it was more of an interesting than tasty dish. 2.5/5Passionfruit pave, ginger puree yelp.com/user_local_phot… Not good. The flavors didn't work at all together and I hardly touched the dish. 1/5While the food at Patina is middle-of-the-road French (I had a comparable meal at Papilles the next evening for 1/4 of the price), the service is spectacular and is what rounds this review up to 3 stars in my book. But make no mistake: the atmosphere is stuffy. I would be more likely to dress down at Providence than I would here."], ["Yiqing K.", "Wonderful experience! My friend and I tried their Dinein LA menu, all of them are amazing. Pork belly and the lamb just melt in my mouth, and they even offered me a birthday dessert and a box of three chocolate balls, they are also so delicious, not too sweet like unhealthy candies. My friend said something I totally agree with, that \"good restaurants just cook even the simplest things taste like heaven\"."], ["Marie W.", "I had been so excited to try this place. It has been on my to do list for quite some time and my expectations were pretty high. Sadly, I feel that the experience was a big let down. My boyfriend and I came during DineLA for an early dinner right after work. We were seated right away and placed at a table that felt like it was right under a spotlight.  We were given drink menus and  left to look them over.. for a while... we kept trying to get someones attention because we wanted a wine list, but no one seemed to want to come over. Finally got the wine list... made a selection... then waited for someone to actually take the order. There must have been some confusion on our table because it felt like we were ignored for quite some time. I know they want to give you plenty of time to look over the menu, but it felt excessive. We ordered the Dine LA menu and shared essentially everything on it. The food was fine but really nothing was all that landmark. I honestly think my favorite item was the amuse that they brought out for us to have. Everything else felt pretty lackluster- odd flavor pairing, textures that I didn't find compatible, etc. The fish they served smelled terrible. The decor was much less exciting that I expected. The service was courteous but I felt there was something off. I have eaten at quite a number of very nice restaurants and service and ambiance here did not come close to those standards. Sadly I was really disappointed in this experience. For the price point, I could have found a much better meal with the right service and ambiance elsewhere. I won't be jumping at any chances to return."], ["Michael J.", "So we rolled into Patina downtown at 5 p.m. one Tuesday night in late January.I know...This IS an ungodly hour for fine dining, but we had a 7:30 curtain at The Ahmanson, it was Abbe's BD, and so here we were.After a very brief wait, the lovely dining room was ready and we were seated...at an awkwardly placed table, providing an awkward view of not very much at all.The sub sub maitre d had a bit too much stuffing in his shirt, and he ever so politely refused to grant us another table.So I requested a more senior staffer, while Abbe cringed. \"Relax,\" I reassured her, \"Once we get this table thing straightened out, I'll be sweet as sugar.\"And so it was, because in no time at all, an extremely suave individual (wearing very stylish glasses) courteously said that since the room was far from filled, it would be his pleasure to grant us a table with a banquette and a grand view of the action.True to my promise, and feeling the salubrious effects of quite a generous Manhattan, Abbe and I relaxed into one of the most delightful dining experiences of this century.First came a luscious (and complimentary) bouche amusé, a small but serene concoction in a white eggcup that somehow combined panna cotta, a slice of mandarin orange, and something salty into something sublime.We both ordered off the Dine LA menu ($50 a person), and both chose the smoked Salmon Terrine as our starter. Patina's rendition was a rich and delicate Napoleon constructed of mille-feuille, creamy cheese, and salmon.Abbe ordered the Atlantic Cod, and it was prepared perfectly, tender, moist. and un-fishy in a wonderful way.I had the Beef Cheeks, and they too were wonderful. Rich, tender, like your grandmother would have made if she were a gourmet chef.And as good as food was, it was equaled by the service.Throughout our dinner, we were attended by polished, interesting fellows who (from the servers to the bus boys) were themselves interested in giving us a great dining experience.With 2 drinks ($28), French press El Salvador coffee ($8) and Estate Assam tea ($9),Patina can get a bit pricey for a Tuesday night.Our bill (with tip) came to $198.So was it worth it? You betcha.  We WILL be back."], ["Victoria L.", "Had dinner in Patina with my boyfriend. The food was extraordinary especially the Foie gras and Wagyu beef. The service was excellent as well. One gentleman opened door for us as we were leaving and chatted with us and thanked us for bringing style to the restaurant haha. I would definitely go back there!"], ["James Q.", "Food was well presented. The flavor combinations were amazing. The staff was really friendly. Great experience"], ["Brian G.", "Patina is a jewel in Walt Disney Concert Hall's crown.  The location is more coincidental and you should definitely make your way to Patina whether you're attending a concert or not.The ambiance is calm and serene, but I wouldn't necessarily give the highest marks for decor.  You will find better decorated spaces, but Patina is perfectly fine.  If anything, the concrete, steel, and glass structure will create a nice blank canvas to appreciate your meal.  There are plenty of tables with enough space in between so as not to feel claustrophobic.  There is some real talent in the kitchen.  We opted for a four course meal and started with a delightful amuse bouche with a selection of four different types of fresh baked bread.  Of the appetizers (and we had all of them), the spot prawns ($10-$15 supplement) and the duck egg with duck breast that had steeped in earl grey tea were our clear favorites.  The spot prawns were incredibly fresh while the duck breast was incredibly flavorful.  Among the entrees, we opted to pay the ($20/pp supplement) to order the turbot, one of the premier flatfish varieties out there.  The turbot was presented, deboned, and plated table side.  The turbot was tender and delicate with plenty of fillets for two people.  For the sweets, the lime dessert was our favorite and a wonderful option if you prefer tart, refreshing desserts to heavy, sweet desserts.  We don't walk away from fine dining meals stuffed - far from it - but we were so full from our meal.  If you have a more balanced appetite, then a three course meal would be more than sufficient.  The service at Patina is top notch and is what makes the overall experience.  I was impressed that they provided black napkins for my parents and a white napkin for me since I was wearing white pants.  The manager offered a box of chocolates to my mother on our way out the door to wish her a happy birthday.These are the little touches that distinguish just expensive restaurants from fine dining restaurants that are worth frequenting on special occasions.  You can expect to drop some coin if you dine at Patina, but the experience is well worth the investment."], ["Chrisa C.", "I came here with my best friend as a belated bday gift and had the best dining experience of my life so far.  Patina has been on my bucket list of restaurants and Patina did not disappoint.  We did the 5 course menu and I hope to go back and do the 8 course menu someday.  Thank you to everyone at Patina for the wonderful evening and my little box of chocolates!"], ["Andy S.", "We had dinner tonight at Patina after a wonderful concert with the LA Phil at Walt Disney Hall.This dinner was amazing.  My wife and I had the five course tasting menu and each selected the complementary selection for each course.  Between us we had each item offered.  This was suggested by our server (please forgive me for forgetting his name, he was great).The food was amazing.  Combinations of taste that I would not have imagined.  Each course was an adventure in flavor.  Our server offered (and I accepted) to pair wines with the course.  The wines fit perfectly!It wasn't inexpensive, but it was a great value.  We will be back!"], ["Daniel L.", "Food was delicious, but it took 3 hours for the 5 course tasting menu... Restaurant was not even half-full and there was enough staff to wait on each individual table. They were all running around looking busy, but not accomplishing much. Don't know if they were having problems in the kitchen, but I didn't have the patience for it. After 2 hours and not even getting our third course I asked for the rest of the meal to-go. That took another 30 minutes to prepare. If you're ok with spending 3 hours and $350 for two people (including 2 rounds of drinks) on dinner then check it out."], ["Roland R.", "Patina is a perfect spot for a nice dinner if you're going to one of the theaters in DTLA (ie. Ahmanson).  You're already dressed up so why not spoil yourself with fine dining.    We went with the 5 course tasting menu ($45 per person) and we added an order of their PEACH SALAD ($15) which the waiter RAVED about.  It was VERY GOOD and they will happily split it for two if you ask them.Since there were two of us we each got a different dish per course and below are the winners.FIRST - \"Chips and Dip\" - the salmon chicharronnes (fried skin) went really well dipped in the avocado mousse.SECOND - White Corn Agnolotti - only dish in the second course WITH BACON, you gotta go for it!THIRD - Black Sea Bass - good quality fishFOURTH - Braised Pork Belly - MUST ORDERFIFTH - We passed on the dessert and just got cheese.  They have a GREAT SELECTION of CHEESE!  House sparkling wine was $12 a glass, which was pretty good and their creative cocktails were $15 each.Ambiance was fancy but not stuffy and the SERVICE was TOP NOTCH!"], ["Chris O.", "I have dined here four times in the last six months.  It is a great experience, and much better if you go when not attending a Disney Hall/Music Center event, because you can take your time to savor the food.  The tasting menus are consistently outstanding.  Add the cheese course if you are a fan.  Good selections of European and American cheese.  The service is the best and most knowledgable in LA.  From the warm greeting when you enter the door, to the bartender, the servers, and the rest of the staff; they seem happy that you are there.  Patina could offer a class to other restaurants on how to treat a patron."], ["Stanley C.", "I haven't had a dining experience like this in awhile and let me say that everything here was perfect. It all started off by me wanting to take my girlfriend to a nice and special dinner where she's never been to and also been wanting to try. She's a difficult person to please, let alone surprise, but I made reservations for a belated anniversary (she was in Europe for the anniversary) and had told them of the occasion. Upon arriving, it's located at the Disney Concert Hall. Valet parking is the main option for parking if you're to dine at this establishment. I believe they provide validation for valet parking since they asked after dinner if we parked with valet, but I'm not 100% sure.We brought a bottle of wine to celebrate the special occasion (Tues no corkage fee) and we were sat at a booth near the center of everything which was very nice. Girlfriend like the decor and attentive service and the little air plant at our table. It's the attention to details that makes the experience even better.Our server brought over and asked if we prefer white or black napkins for the evening and proceeded to bring us our menu and Dine LA menu. Their main menu was very simple and had a good variety, which included a vegetarian selection. They also had a tasting menu for $120 which doesn't seem bad at all. In the end, since this was our first dining experience, we opted for Dine LA to get a little taste of everything. You choose 1 item out of the ones provided on the menu:First\"Chips and Dip\" Avocado mousse, salmon chichoaronnesHawaiian Big Eye Tuna Avocado, scallion, yuzu granite Tomato Salad Burrata, shaved bonito, sweet onion vinaigretteWe opted for the Tuna and salad and we enjoyed the tuna the most. The yuzu granite had a different texture of frozen slush but once melted it tasted fantastic. Also the tomato in the salad, the tomato's were very flavorful...not sure how it was prepared, maybe soaked, or blanched, or something (I'm not a cook and I don't know the terminology) I just knew it was good. It's been one of their signature dishes since our server/host, Jeremy, informed us when they were first in Santa Monica/Beverly Hills, they brought that dish over to this location.SecondShellfish Linguini garlic, parsley, white wineWhite Corn Agnolotti Nueske bacon, arugula, parmesanCaladonian Blue Prawns taro leaves, serrano chile, coconut milkWe opted for the Corn Agnolotti and Blue Prawns. Both dishes were great but I personally liked the blue prawns since the preparation was interested. It was lightly poached where it seemed like it was almost raw but you could tell that it was cooked.ThirdBlack Sea Bass cranberry beans, almond pistou, English celeryCalamari Farci Roma tomato, wild foraged greens, salsa verdeCalamari was fantastic (not the breaded kind), cooked very tender and the ingredients mixed well together with a slight hint of spice. Sea bass was moist and crispy on the outside and the sauce that accompanied it was flavorful and the almond pistou added a nice crunch texture.FourthVeal Tongue a la Probre mushroom gratin, okinawa spinach, garlic jusRoasted Jidori Chicken Potato and truffle mousseline, roasted asparagusBraised Pork Belly Polenta cake, zucchini tagliatelle, five spice jusWe opted for the veal tongue and pork belly. Yes I know I'm not that adventurous with the veal tongue and I've had tongue before but they were sliced thinly at a bbq house. When I asked how the veal tongue is plated, he said like a whole tongue which got me worried but hey here's to being adventurous (cheers!) Pork belly was shaped like a circular disk, but my gf was getting pretty full by that time. I have to say the veal tongue was the winner between the two dishes.Fifth\"Strawberries and Cream\" shortcake crumble, strawberry sorbet, tahitian vanillaDevil's Food Tart valrhona dark chocolate, condensed milk ice creamCan't go wrong with dessert but I'm a chocolate person and that chocolate dish you just can't go wrong if you're a chocolate lover.Toward the end of the meal the general manager came by to say congrats to a belated anniversary and gave us a few pieces of candy treats on a dish that said \"happy anniversary\". The fact that he remembered and came over to say \"happy anniversary\" and a \"belated\" one at that was great. Also the staff that night were all very attentive, friendly, which even includes the person refilling the water and providing bread. After every meal, they remove all your dishes and utensils and provide new ones. Talk about service.***Note - dinner will last you at least 2 hours and to give you a reference, we arrived at 7:15pm on a Tues and didn't leave until almost 9:30pm***This was a great dining experience and even if it wasn't for the great deal for Dine LA, we would be back just for the food and service itself.Thank you Patina for allowing us to taste what you have to offer and I highly recommend dining here!!!"], ["Irene C.", "I had high expectations for Patina since I've been hearing about it nonstop from my mother-in-law-to-be-maybe and the partner.  Overall, the food was good.  The dishes were definitely creative and the prawns were really good.  I hate olives but the olive bread is delectable when it's warm.  The other baguette bread was hard so prepare for some gum ripping if you dare.  Unfortunately, they were out of the tuna appetizer that everyone wanted so if they have it--try it for me and let me know if it's worth another trip!  On another note, I don't know what I was thinking when I ordered the veal tongue.  It was kind of mashy.  Is that how it's supposed to be?  I couldn't finish it and I'm a huge fan of beef tongue.The service was spotty.  There were people coming to check on us who were really friendly and our waiter had spurts of friendliness but it almost felt forced.  I can't explain it but it was just odd.  Maybe it's because we were a bigger group?  Or that it was 8 PM and everyone was tired?  Dinner took over 2 hours--which some people enjoy but I was getting impatient with how slow the food was coming out.  I would not be opposed to come back for dinner but would make earlier reservations so I can get out at a reasonable time and see if I can experience this world class service that everyone else is talking about."], ["Sennett L.", "Came here on my birthday about 2 weeks ago and 3/4 of the my time here was amazing.  Easily 5 star worthy.  The final 1/4 of my experience knocks it down big time...My gf had made a dineLA reservation on Thursday for my birthday dinner and we arrived about 20 minutes early and they sat us early.  Awesome!  So we sit down, get greeted, get waters, get drinks... so far everything is spectacular.  Service is amazing!  We then decide on our dineLA entrees and order.  Drinks come out, and we start receiving the appetizers, entrees one by one.  Picture perfect.  Food tasted pretty good but really, what happened at the end put a damper on the entire experience.  I do remember one of the pasta dishes being very very very salty... About half way through the meal, I noticed a little fly/knat flying around and it got pretty annoying having to shoo it away so it doesn't sit on our food.  Towards the end of the meal, I take a sip of water and notice the damn fly in my water.  When one of the servers comes by, I ask for a new water because of the fly and although he was nice about it, all he has to say is, \"yea, it's hot today\".   No apology...Ok whatever, he brings an empty glass and walks away.. I assume he will return shortly with the water pitcher to fill my glass.  Nope.. I guess I'm supposed to drink the air in the cup.  So I ask another server as he clears our current plates for water, and again, a few minutes go by and no water.  Finally, I ask our actual server for water and he finally brings me water, after asking 3 times.  Next up; my gf asks for a small box for the rest of her dessert and one of the servers nicely takes the plate to box it up.  Then, as the reservation was made for my birthday, they bring out a special little dessert with a few jelly/chocolate round things.  No idea what they're called but I didn't really like them.  My gf did like the chocolate one and wanted to throw it in the box but since they were keeping it up at the host stand, she asks the server to put it in the box for us.  He scoffs, attends to another table, and then comes back and says he will have it boxed up.  We were amazed... amazed at how a server at such a high class/sophisticated establishment would openly scoff at us.  We were pretty confused and upset so on the way out my gf decides to tell the nice gentleman at the front door about this and he apologizes and says he will follow up with her after some investigating.  It's now been 2 weeks and nothing.  Honestly, I wasn't expecting anything but this experience went from really really great to really bad.  It's too bad that happened because the majority of my experience here was fantastic.  oh well... plenty of other restaurants to try in LA."], ["Christina B.", "Still spectacular.  I see the Asian chef is still there:). He was talking to another Asian lady who looked and sounded like a skinny Margaret Cho (no clue if that was her or not).I was seeing Sound of Music and needed a quick nice meal.  Called and asked if they could seat me at the bar and be out in thirty minutes and they graciously accommodated.  I had two first courses (uni with egg and escargot) and a glass of premium wine.  Delish!  Kudos to the chef.  The uni was perfect and large and the egg just blended perfectly together in taste and texture.  The escargot was quite unusual because it was served in a bowl with congee and other flavors--not the typical French butter garlic but absolutely divine.  It was like comfort food for the soul.  I keep telling my foodie friends how much I enjoy the food here and they are so surprised so I think maybe they were here before the Asian guy took over?  That's just a guess because we have very similar tastebuds so I gotta bring them here to show them how yummy it is.  My only complaint, and it's more of a pet peeve really, is that the bartender didn't tell me about the dishes or wine when he served me.  I had to ask him for confirmations on what I was tasting and I was right but it was kinda annoying.  I know it's a quick meal but it's not hard to do.  Then again, he's probably not used to it so it's forgiven.  Overall, I was extremely satisfied and happy with my meal and drink and ambiance of this place.  I highly recommend and will be back.Side note--as I was dashing out the door, the guy in the front host stand rushed to assist me.  A true gentlemen and great customer service.  It's hard to find that nowadays but especially in LA.  He also thanked me for coming in.  Excellent service."], ["Vickie T.", "While the DINE LA menu tastes insanely average, please venture off to their regular menu and try the scallop ($26), lobster ($48) and the steak. They are delicious! I was not impressed by the sea bass at all though. The texture was very chewy (in a rubber kind of way).I love the valet service, easy to spot, and your car will be pulled up before you exit the restaurant. Their service is very good. However, I felt that I was served bread after bread through my meal so my sense of fullness came not from my actual meal but really from the carbs."], ["Margaret L.", "Came in to Patina for DineLA with my husband and a couple of friends.The service is exactly what you would expect for a restaurant of that caliber.Food:American Caviar - excellent dish, the cauliflower panna cotta on the bottom was a fantastic additionWild Striped Bass - cooked beautifullySlow Braised Kobe Shortrib - a little tougher than I had expected but great flavorsJidori Chicken - cooked nicely, it was very juicy but could have used a little bit more saltValrhona Chocolate Terrine - excellent dessert, very rich dark chocolate flavorGreen Apple Battera - very nice dessert, it was slightly tart and very refreshingThey also presented us with boxed truffles as a surprise for my birthday and served us a few candies as well (the pear jelly was absolutely amazing).Parking: Valet (it will save you the trouble of having to drive around and around)"], ["J I.", "Food is good, especially before a concert at Disney. Wine list is pretty impressive.  What stood out for me was dessert - lime kaffir was unique and tasty.  Other deserts were also unique.  appetizer and main felt a bit like yesteryear of California cuisine - small portion with some unique ingredients but not daring. But the service is impeccable and felt like we were back in Manhattan (except waiters with smile).  Good place to bring parents from out of town but not necessary a place for local foodies."], ["Paris L.", "This was my 2nd time to visit there again.The price point got cheaper compared to the 1st time I went there.Dine la menu was $503 course was $75Truffle tasting menu $135 ( If i didn't forget, and I think it is VERY good price!)Service: excellent. I wish they hung my jacket ( come one, its a Michelin star restaurant, is it still?) Food: Appetizer- Layering Salmon- perfectly delicate                 - Duck ravioli- not very rich, which is goodEntree- Beef cheek - pretty good, quite rich            - Cod- excellent, very soft Dessert- Popcorn sorbet and coconut custart.       I love it! I love it! I love it!It is worth 5 stars! *****"]], "Cafe Beaujolais": [["Zhi Y.", "This is my first time trying out the French cuisine. The place is easy to find and park your car. The waiter is good-looking and very polite. Surprisingly the food is great and it comes with reasonable price. Highly recommend the lamb!"], ["Jonathan H.", "This place is fantastic, an awesome choice by yours truly for an anniversary dinner. As broke ass college students, we wanted a place that wasn't too pricy, but still had some fancy foods. The small restaurant provided close quarters, awesome service, and delicious food -- all at a not too expensive of a price.Atmosphere: 4/5--Only street parking was available, and we got lucky enough to get a spot out front. Don't let the nearby Taco Bell discourage you, this little cottage packs a punch.-- I decided on this place partly because of mentions of its romantic decor. It is darker and candlelit, but awfully loud. Eventually you get used to it, but it can be pretty tough to hear in this smaller place. --The place is small, and a little cramped. Service: 5/5-- Man, the service was great. The host was super accommodating to where we wanted to sit, which is an overlooked privilege in my opinion. --Everyone was French, which was either selective hiring or these guys all probably came from there haha. --They checked on us sporadically, which was nice. --The food did take awhile. I've read on here that it's not rushed so you savor your food AND company. So make sure you come with someone you like!--We mentioned to the owner(?) that it was our anniversary. Dude comped TWO desserts for us. He was incredibly nice. He's the French Gerrard Butler looking dude.Food 5/5--Damn... The food was incredibly good. We were both very impressed!--We ordered the shrimp, scallop, and mushroom appetizer ($9). It was great, especially on bread. The size of the seafood was very small though. --I got the duck breast in the sweet and sour sauce ($23). Not only was it cooked perfectly, but the sauce was not overpowering at all. One of the best. --My lady got the rack of lamb with whole grain mustard sauce ($25). They overcooked it a tad (supposed to be medium), but it was so juicy. And that sauce was amazing. --Both came with scalloped potatoes (delicious), green beans (very good), and half an oven cooked tomato (refreshing). --Since he comped TWO desserts, we got the crème brulee and the tart tatin (upside down apple tart). Both were incredible. The former was creamy with a perfect crunchy top, while the latter was rich and sweet (and honestly tasted like dates a little). Price: 4.5/5 --Considering the price this food usually warrants, it was very affordable. -- For an appetizer and two entrees, it came out to just over $60. Not bad, and the damage would've been worse if we didn't get our desserts on the house!This little place gave us a really positive experience, and it's a place we'll definitely visit again. The staff couldn't be nicer, food was mouth-watering, and the date went great :)"], ["Alan L.", "this is a great little neighborhood gem. My wife and I came here on a Saturday night in the early evening and there wasn't a wait, however when we left at around 7:30 there was a line of people waiting outside. We ordered the escargot and French onion soup for starter, both was perfect. We really like the butter sauce for the escargot with the herb and garlic. For the main course we ordered pork chop and rack of lamb. Personally I think the pork chop was a little salty. The rack of lamb is done just however."], ["Geri S.", "Absolute yum! This place is sweet! So glad we tried this place. Had the halibut. It was humongous, flaky, crusty top and flavorful. I did not need any bit of lemon wedge as I usually need for any of my seafood dishes. Rack of lamb, I wouldn't know. Apparently, it was great too. I only saw it, never got to taste it. My partner devoured it. They refill your complimentary sliced  french rolls as it dwindles down in the basket. The staff are so kind, and courteous with neat accents. I loved the vibe and the cool fresh ambiance of the place. Will definitely make this place a habit. No full bar, but that was ok. The food made up for it. No problem!"], ["Bertie B.", "Authentic French attitude (rude and humorless) Lousy service and food. ..Never again"], ["Lawrence L.", "This place has been a steady pinnacle of the neighborhood for over a decade serving many French bistro classics from the limited but select menu.  The ambiance is a little provincial, but charming and endearing.  I only noticed a couple of bad tables in a small isolated room in the back, but this can also be perfect for a small group gathering seeking a little bit more privacy.  The service is friendly and grounded, most of the staff speak with French accents without any patronizing or  impatience.  When asked, our waiter made some sound recommendations that we took...We came to celebrate a bday and double-dated so we had a chance to try many items. The selection may seem terse but every major food group is represented and you needn't worry, they do a good job with most everything.  Not the best you've ever had kind of quality, no OMG factor, but still very solid.   For starters, the French Onion soup and Escargot are almost a given whenever we come to a French restaurant, but we also ordered a shrimp and scallop with mushrooms in a bechamel sauce that was awesome.  The least popular among the appetizers we tried was a pate that was different in comparison to our other choices but went well with the French bread and came with cornichons, a traditional accompaniment along with some nice frisee...Known for their Halibut dish, it's covered and baked with parmesan and it's a showstopper -- in a great way.  How often do you hear of having baked cheese on fish, it seems like such a discord but it's actually genius.  The mustard sauce surrounding the Rack of Lamb as with all of the sauces that evening reminds me of why the French spend so much time perfecting sauces.  The rack of lamb which is frenched for presentation and sliced for plating revealing a nice medium-rare pink temperature within its light shallot/thyme crust...I would have chosen the lamb for myself but the bday guy beat me to it, so I selected the Filet Mignon with port jus and covered with a creamy, crumbly, pungent roquefort.  I like stinky cheeses, but rarely do I like to embellish my steak with it since I am more of a purist when it comes to such things.  The filet was caramelized on the outside, sealing in the tender juicy interior that gently yielded with each stroke of my serrated blade...Wifey went off menu and had a Chicken Breast baked within a flaky puff pastry shell, a bit reminiscent of Chicken Cordon Bleu, but only because it's encased in a shell.  The breast meat was expectantly dry but mitigated nicely by the spinach that was also enclosed.  We all had a vegetable medley for the evening consisting of baby carrots, broccolini, and scalloped potatoes...We had planned to have coffee and dessert elsewhere, but we couldn't pass up on the creme brulee or the flourless chocolate cake -- hmmm, yummy!...Comfortable enough that you could come here for a casual date or just to have dinner and catch up with some friends,  it won't wreck your wallet either.  Not perfect, but close...  A 4.5 star..."], ["Bee T.", "I went here on a date night two days ago. OMFG this place is amazing. My date and I shared the entrees. The halibut and the filet mignon are to die for... I need to go back soon...The ambience is cute as well :)"], ["Melissa K.", "The creme brûlée is a must have along with the filet mignon. The creme brûlée is light and has the perfect amount of sweetness. The sugar crust is caramelized to perfection  as displays just a hint of perfect bitterness. No words can describe the filet mignon it just simply melts in your mouth.  This place is beyond amazing, you will not be disappointed if you go. Can't say enough great things. Been there once a week for the past couple of weeks and I intend to continue my weekly visits hahah seriously this place is THAT awesome."], ["Randi E.", "There is a reason this place has 4.5 out of 5 stars with almost a thousand reviews. It is wonderful! Before I came here, I went through a lot of the reviews to see what foods were given the most praise. I honestly don't think it would have mattered because everything we ordered and were recommended by the waiters was delicious.First off, the atmosphere is very cozy. I came here with my husband and it was right up our alley. Once it got dark out, the room was very romantic. My husband and I always try to find places where we can hang out, relax and not feel the pressure of hurrying up our meal. This is one of those places. We came early at around 6:30 pm on a Friday. Hardly any people. But by the time we left at 8:30 pm, the place was full. It gets a little loud but I don't see that at the restaurants fault. I was confused by the few one or two star reviews who mention this as an issue. I don't understand how the restaurant is responsible for that?We started off with the Escargot de Bougogne and Salad de Mozzarella et Tomates. Amazing. Escargot was delicious. It was served in a wonderful buttery, garlic sauce. Bread is served at the table so we used every drop of that butter sauce. Yum. The mozzarella and tomatoes, in our salad, were so fresh. Definitely a perfect start to our meal. For the main courses, we order the Le Fletan Au Champagne, which is the baked halibut in champagne sauce and Parmesan crust, and the Poulet Aux Morilles, which is the oven baked chicken breast in cognac and morels sauce. OMG! These were so amazing. I am just a tiny person and I ATE MY ENTIRE PLATE. I was pretty embarrassed when the waiter came back over to take my plate but I couldn't help myself. The fish came with mashed potatoes and a little mix of green beans/carrots and the chicken came with scalloped potatoes and a little mix of green beans/carrots. Also amazing. We also shared a couple... a few... a lot of their french beer, 3 Monts. DELICIOUS! As the waiter was pouring our glasses, he said \"Here is your new favorite beer.\" He was so right. I lost count at how many we ordered. Speaking of the waiters, they were all so nice and attentive. Constantly refilling our water glasses, bread and taking plates away to give us room. As I mentioned before, my husband and I like to take our time while on date night, we order a lot of food and spend a lot of money so we don't like to feel rushed or on some sort of time table. We had a couple different waiters and they were all French, very cool and very relaxed. That was nice touch. I ate waaayyyy too much to get to their desserts, but I will definitely be coming back here for another date night. And I highly suggest you make it your next one. Cheers!"], ["Stephanie S.", "Came here for my birthday with the SO, since I love French food. We came around 6:30 pm on a Saturday and didn't have to wait to be seated. The restaurant filled up later in the evening though. The service was pretty on point. The French server was charming, and our table's water and bread basket was never empty. My only complaint is that everything took a long time to arrive. We got our entree 40 min after we ordered.Here's our meal breakdown:French Onion Soup - far too sweet for my tasteEscargot - buttery and delicious, especially with the complimentary breadParmesan Crusted Halibut - deliciously salty and flaky Filet Mignon - cooked to perfection, very tenderOverall, it was a wonderful place for a date. I wouldn't say it was my all-time favorite French restaurant when it comes to my palette, but it was worth a visit."], ["Garrick L.", "Excellent escargots de bourgogne and french onion soup. The snails were already out of their shells, so I didn't have the joy of plucking those suckers out. The garlic on the escargot wasn't overwhelming, and the soup wasn't too salty. Tip: dip the bread into the escargot garlic/oil. Entrees: filet mignon and lamb chop (medium rare). Both entrees were nice and tender. A glass of pinot noir complements the filet mignon nicelyQuick, friendly service... will definitely come again!"], ["Sylvia H.", "This little rock hole in the wall.  I swear, I've lived in Southern California for all my life and 1.  I've never even entered the gates of Little Rock and 2.  Never have I had such great French Food in LA and Cafe Beaujolais was zee best!!  The servers are speak perfect French and all speak english with a little French accent and I love it!  Service is great, wine select was great, food selection was great, daily special is great.  You MUST try this place!! I love it!!  I came on a Friday evening at around 6:30PM and it was right before the rush!  We stayed the whole entire night ( till the closed) and not one bit did they make us feel rush to leave!  meilleur en ville! ( Best in Town)"], ["Christian J.", "Splendid restaurant with a relaxed atmosphere, although slightly loud. The food is what you expect from a french restaurant - delicious, good quality, and each bite worth going again.I wouldn't suggest to come here in big groups, since the restaurant doesn't take reservations, but if you want to take your partner to a tasty dinner that's a great spot to check out. I loved all of the food we ordered, from the escargots to the lamb, the scallops to the duck, everything was seriously delicious. I can only suggest for you to try out their lamb, it is absolutely tender, and although I was skeptical about the mustard sauce at first, I have to say it was extremely yummy. I was also very happy that their deserts seem to be legit, at least I can approve that for the crème brûlée - it's like being back in France. I will definitely come back to this place whenever I should feel like good french food, without spending hundreds of dollars for it, like in some other places in this city. Conclusion: Not a must go, but truly worth a go!"], ["Izzy P.", "Really good French food in LA! Recommend the halibut, duck, as well as the French onion soup. Halibut is truly one of the tastiest seafood dishes I've ever had, although heavy. Onion soup is one of my favorite appetizers here, although the shrimps and scallops are also good! For dessert, stick with creme brûlée, as that is easily their best choice."], ["Mac S.", "Fine french food with great ambiance. Recommended by my wife who had visited the place a few times in the past. Friendly staff and we thought the food was delicious (we even went with our toddler). Would visit again along the Eaglerock Colorado blvd stretch."], ["Peter P.", "Reasonably priced French fair without the snobbery!  Cafe Beaujolais (grapes in French) is quickly becoming one of my favorite dinner spots in LA.The menu isn't huge, but they do have daily specials which I have yet to try.  From the standard menu though, the rack of lamb is excellent and easily my favorite thing here!  Tender, moist and flavorful!  Also tried the new york steak in peppercorn sauce which was good but not as tender as I would have hoped.  I was less of a fan of the halibut in champagne sauce.  Probably the red meat lover in me.For starters, you must go with the escargot in garlic butter because, well... it's garlic butter!  I could eat this everyday until my heart stopped.  And yes it is completely acceptable to dip your bread in that sauce!  The Noix De Saint-Jacques (shrimp and scallops in béchamel) is also a delicious option.  I don't care for the French onion soup.The service is outstanding, but almost to a fault.  The staff is super friendly and their accents are awesome, but I mean seriously, stop refilling my water after just two sips!  If you've eaten there, you'll know what I mean.  They also love to change out your bread basket even when it's not empty.  I hope they make croutons with it!"], ["Christophe C.", "I was back home (yes I'm French). Very traditional French cuisine, as you would find it in a little restaurant anywhere in a village or little town."], ["Angela H.", "Great service and amazing food! Went here for dinner after hearing a friend rave about it. The restaurant is nice and dark, if you don't want the whole romantic vibe I suggest you request window seating. We ordered the escargot for appetizer and rainbow trout  and salmon for entrees. The food was impeccable. The escargot was so luscious and the garlic sauce complemented it perfectly. Both fish were cooked to perfection and the bed of mashed potatoes were very fulfilling. The waiters were very attentive and refilled our drinks often. This place is a must if you're fond of French cuisine."], ["Hovik N.", "Très Bien! Wow amazing. The most authentic French restaurant in all of LA. The only reason I can say that other then the fact I've been to France a few times is that's what the Frenchie I was dinning with stated. It also helps the owner and the staff are French. The food is top-notch! Been here a few times and every time is better then the last. The space is dimly lit and set up makes you fell you are miles away overseas.  The only thing about this place that is not like France is the service. Meaning it is actually really good. Definitely a five star experience."], ["Brenda L.", "Nothing to get too excited about though have been trying to check the lamb here for a while.. It was good and so was the onion soup. So if you come here, you'll be good with this two.I felt that the sole/salmon specialFor the day literally tasted nuked from the microwave, a big NO. So food if not that great... Only wine here, no signature cocktails if that's what you're in the mood for.Staff was attentive but had to wait a bit for our food. Jazz music was great, ambiance was so so.."]], "Chez Antoine": [], "Le Petit Paris": [["Mark David Y.", "Le Petit Paris opened its doors somewhere in DTLA last month just few days before I first time dined for lunch with my girlfriend. It's new and expansive French Restaurant and soon to be marketplace hopes to establish itself as one of your favorite spots. What may appeal to you more than even the food is the building's architecture and restaurants layout. Le Petit Paris inhabits what used to be the El Dorado Hotel which originally opened back in 1913 on Spring Street. From custom made iron door to the 19th century grand staircase with original hand painted tiles that ascend to the upper mezzanine level where one will have the opportunity to admire all the detailed craftmanship.During my first visit, I had the opportunity to partake Le Petit's incredible menu and I must say that they are serving up some of the great authentic French cuisine in most romantic and elegant atmosphere. Some of their items in the menu are vegan friendly (which is good to bring one of my vegan friend), which is major plus for those where meat no treat for those who eat (No offence to the carnivores). For those of you eat meat, expect to be served a plethora of enticing treats (You've been warned)..The menu is solidly authentic in terms of its flavors and ingredients, you will find pizza, cheeseburger and even vegan ceviche on the menu. Look past those items, and you will spy seared duck Foie Gras, Croque Monseiur, garlicky escargots, fine charchuterie and cheeses as well as hearty entrees such as fillet mignon with creamy mashed potatoes, roasted lamb cooked perfectly medium rare, and braised chicken stew that mildly hardens at Coq Au Vin. The houses signature salad is its version of very traditional Salade Lyonnaise with crispy roasted potatoes, healthy helping of bacon, Smoked duck breast and a poached egg, making it one of the best not quite a salad you'll ever eat. The dessert menu is also a Euro-Cali Brasserie blend of American and French Sweets - Cheesecake, Crepe, Suzettes, Creme Brulee, Macarons and the tarts of the day to name a few. In the end, it's important to remember and not to forget that the French likes to enjoy the finer things in life and you should too. Life is too short to not treat yourself or date to someone special. So, if you are looking for beautiful escape, where you can indulge your senses and loses yourself in the most breathtaking of views, then no look futhur than Le Petit Paris. It's DTLA'S newest and most chic French Brasserie. You won't be disappointed, and if you are, take look around yourself and get lost. I am sure you'll find yourself somewhere along savior-faire avenue, or cest la vie street, because life goes on, and so should you. Now go out and seize the world, one bite and a drink at a time.SERVICE: Friendly. The host and multiple managers do speak French, so if you are planning a winter trip to Paris and would like to brush up on your French, this is the place to do that. Your waitress or waiter who doesn't happen to speak French, is attentive and willing to make suggestions."], ["Clark W.", "I've lived in the neighborhood for 10 years and get very excited about anything new opening.  I've also lived in the neighborhood for 10 years and learned to never go someplace in the first month.  So, I waited and finally made an attempt.  Stopped by on a Sunday afternoon around 3:30-4:00 thinking a seat at the bar, a glass of winel and some food would be nice.  WRONG!Perhaps it was the time of day, but with no less than 10 different people working, including the manager sitting at the bar a few seats down from us counting money, we couldn't get service.  There was one table dining at the time and the 2 of us at the bar.  A waiter finally took our drink order because the bartender was so \"busy.\"  Wanted to order shared plates, but the menu is not really conducive to that type of dining.  I believe we were there for 45 minutes and after we got our cocktail, never had anybody come by again, though they were all around us.  Finally had to flag somebody down to get our check so we could get the heck out of there.How can so many people be working, manager on duty and present, and two people can sit at the bar completely ignored for that amount of time.Good luck Le Petit, my funds will be spent elsewhere.  I cannot give that service level and lack of care a 2nd chance."], ["Christine H.", "Upon arrival, I was wowed by the beautiful decor. The grand staircase was absolutely stunning. The hostess seated us promptly and we were greeted right away by our server. He was helpful and very attentive. The owner came by to see how we were doing as well. I was impressed by the service at Le Petit Paris. Unfortunately the food didn't impress as much as the service. We ordered the duck salad, sea bass and lamb shank. The duck salad was HUGE and not that special. The lamb shank was under seasoned, but it was cooked well and tender. The best dish was probably the sea bass but the portion was surprisingly flimsy... However, I did enjoy the grilled tomato side it came with. We were also given complimentary wine and bread with olive tapenade before our meal.Although there were aspects about Le Petit Paris that I did appreciate, the $$$ for the OKAY food are factors that will not have me coming back. It's one of those places where one time is good enough."], ["Derek D.", "I absolutely LOVE the feel, the food, the attitude of this place.  It's definitely a place to eat in DTLA .  Happy hour is M-F 5-7, with $9 drinks and food.  Wifi passcode is 418418418 don't tell them I told you"], ["Mariana M.", "Le petit Paris...only opened few weeks ago and already people spreading the word. I have been waiting to go there as soon as i saw the pictures online. I also checked their yelp and discovered some beautiful items that i had the opportunity to try for my first time.David the owner, the manager, and also our server were so professional and welcoming. They even accommodated us by serving us breakfast when it wasn't the time anymore. Campagnarde omelet and croque madame were a success. Merci beaucoup pour cet accueil, c'etait vraiment delicieux."], ["Christine L.", "Such a beautiful restaurant! You wouldn't think it from the outside neighborhood. I don't know why this place isn't at least 4 stars right now, but I hope it does get a better rap. FOOD: Truffles. They got lots of it. I ordered the Truffle Pappardelle and it was very rich and creamy and delicious. Friends ordered the Filet Mignon and Truffle Pizza and both were good as well. I love to end the meal with my favorite dessert: Creme Brûlée, and it met my expectations.SERVICE: Friendly but slower than expected, especially not on a busy night, but thought it might just be because they opened a week ago from when I went. Room to improve here.PARKING: We didn't make too much an effort to find parking alternatives so we used valet for $8. Seems like the best choice aside from lucking finding street parking close by.AMBIENCE: My favorite aspect of this place! I really felt like I was in Paris, with the whole restaurant being narrow but deep, the gorgeous chandelier right when you step in, the inside decor, the grand staircase, all of it.I look forward to coming back for brunch or bringing my family and girlfriends here. I long to yet visit Paris, but this place has gotten me feeling pretty close to it."], ["Samantha A.", "I love downtown LA and now I love this new restaurant! I think the only thing that could make it better would be more vegetarian options (*hint hint*). Let me start by saying how beautiful the restaurant is. They have incorporated vintage elements of downtown with French/burlesque-y decor. The decor is very loud but also very romantic. I think of a cross between Perch and Bottega Louie. The food was good. Not the best, but definitely not bad. I would go there again and again. I had the one obligatory vegetarian option, the vegetable papardelles. The noodles were light and they had nice large chunks of artichoke that were seasoned perfectly. But whenever I see pasta (or pizza) as my only option I immediately think the chefs were like \"hey we need something for the veg heads... I got this pasta... ok there we go!\" So it was good, but I can tell there was little thought put into it. On the other hand, my boyfriend got the lamb shank and he was in heaven. Apparently they slow roast it for 48 hrs... that means nothing to me but it makes it even better. We got the heirloom tomatoes with burrat for an app, they were delicious and the pesto totally made the dish. We also got the soufflé (order ahead of time as it takes 25 mins to make) and the crepes suzzette for dessert. The soufflé was good but I loved the crepes. I'm not much of a sweet person, so I really appreciated that it was very tart with a full orange flavor. Ok, the best part for last. Our server, Lucas. I would return here just for him. He was so personable, attentive, and helpful. He truly made the whole experience here wondefful. He made a few recommendations on the wine, entrees, and desserts and we loved everything he recommended. He seemed like a genuine guy and when things were starting to get busy, he would still stay and chat for a minute at our table. Honestly, he was probably the best server I've ever had and I hope he reads this glowing review of him. I'll definitely be asking for his section every time I return. Overall the experience was great. It's a new restaurant and you can tell they're still figuring things out, but I'm excited that it's in my neighborhood because I will be returning."], ["R. A.", "I went here the day after in opened.They probably were trying to figure things out still.SAD - the service people forgot about me.I ordered some lobster dish that was sadly, unmemorable."], ["Meghan G.", "First impression once we sat down, there was a cheesy flier on the table regarding the specials and this cheapened the experience and crammed the already small table. I would have much rather heard the specials from our waiter himself and had more room on our table. Other then that, the ambiance is beautiful and the food was delicious! We had foie gras appetizer which was amazing, delicious truffle burger cooked to perfection and excellent lobster linguine made special to cater to my onion allergy which made me very happy. The cocktails and French wine were also fabulous. Bonus, the real French chef came out to greet us. He was very gracious in answering our questions and in sharing his fresh ingredients list with us. We will definitely be back very soon!! Merci, fin."], ["Marie P.", "Been following and reading about this place anticipating for it to open. Came here this morning, still at a soft open, and I was so excited! Drove in to Dtla hitting the morning traffic which took about 50 min. Luckily when I got there there was one parking space right in front of this place. Right of the bat, I love the exterior of the place. Black and chic! You walk in and at first it's very intimidating but then you are greeted by the friendly host. I have to say that the interior is gorgeous!! Its obviously very European but omg is the space huge and elegant! It had beautiful furniture. It had this beautiful staircase leading to the lounge part of the restaurant. The chandeliers were gorgeous! I love the decor! The restrooms had a very chic and black interior. The only thing I didn't like about the restroom near the from door is that the men and women's bathroom share the same sink faucet! I ordered the omelet with bacon and potatoes called compagnarde. It was delicious. It comes with fresh Arugala salad. I also ordered the fresh squeezed oj, but I really don't think it was fresh squeezed. The waiters were all French speaking! It was so nice to hear their accent! What can I say, I'm a sucker for French speaking people! Such a beautiful language! I really can't wait to comeback and try the lunch and dinner menu and just enjoy the ambiance!!! Thank you Le Petit Paris for opening here in Dtla!"], ["Heather J.", "My fiance and I recently went to Paris and came back sad and depressed because we weren't finding our favorite Parisian food. We were so happy to have found Le Petit Paris because it is exactly what we were missing!We first had the mushroom soup, and it was super creamy and rich. They put mashed potato at the bottom which made it really interesting. Never had it like that before and it was well worth it.They brought by a sample entree for us to try (on the house) - salmon pate with baked bread. It was also very good. I wouldn't have thought to order it because it's not something I crave, per se, but I am glad to have tried it.Finally, our meal came out - we both ordered croque monsieurs.Let me tell you something about croque monsieurs...think back to the best grilled cheese sandwich you have ever had. Remember how amazing it was? Well it was crap compared to the cheesy goodness that is the croque monsieur. First, the bread is topped with ham and assorted cheeses. Then, they put unicorn tears and the laughter of children on it. Finally, they bake it to perfection - the cheese lightly toasted a golden brown on top yet oozing out from the sides.In Paris, this was my favorite food. I craved it the most coming back home. Everything else I had tried was was a cheap imitation......until Le Petit Paris. The cheese was gooey. The toast was crunchy. Everything melted together into heavenly bite-sized pieces. It was pure bliss.The macarons and espresso were the perfect way to top off the meal. Fantastic!Just keep in mind about the service here - it's a French restaurant. The service will be slower than American restaurants. That does not make it worse - just slower. The point is to enjoy the meal, not eat and leave.The decor is like this beautiful marriage of LA Noire and French Eatery feel. Really enjoyed the ambiance and the overall decor of the place.Love it here! Will definitely be back soon!"], ["Sklar T.", "Gorgeous space and elegant decorated to replicate the feel of dining at a European cafe.  We dined here during the last of the 3 days for their soft-opening.  Service here is very attentive and cordial, and they are still working out some kinks as one our runners misidentified foie gras and calling it escargots.  BTW, owners and management are French, so they speak with a French accent that one review found amazing.  Um, it IS a French restaurant.  However, not all spoke French, definitely not our American born server, nor the Hispanic runners.One of my friends thoroughly enjoyed their signature salad and indicated that he would love to order it again, especially since the portion was quite substantial.  My other friend was not that enthusiastic with his tuna tartare, as he would like the tuna to be cut up into much smaller pieces.  He also found the plating a bit non-conducive as he needed to remove the salad layers on top in order to be able to get to the tartare.  I enjoyed my foie, as each component was tasty: foie, chutney, macaron and raisin bread.  I would prefer to have the bread toasted, maybe next time.I ordered the Vegetarian Paparadelle ($16) and later asked to switch it to a Truffles Paparadelle ($27).  However, I let my server slyly talk me into having the Vegetarian Paparadelle with truffles shaved on top, which he said was the same as Truffles Paparadelle.  I should have clarified things with him, as (after he left to fire our order), I believed he may have misrepresented as Vegetarian Paparadelle with truffle shaving is $16 plus $18 supplement (total $34).  And when the check came, it showed the $16 and $18 charges.  I should have spoken up.  My dish had a very generous helping of paparadelle (actually too much, probably had twice the size of an appropriate serving, so some bites became all pasta and nothing else), and a decent amount of Australian black truffles shaved over it (another kink to work out as the server had a difficult time shaving the truffle over the pasta).  Flavors were good, and the truffles was quite aromatic.  My friends had the Lamb Shank and the Spiced Cod.  Thumbs up for the Lamb Shank, which was cooked beautifully, fall off the bone.  My other friend thought the cod was good, just good.  I didn't ask to taste their dishes.Since it was a birthday celebration, I inquired over the phone, when confirming my reservation, if I would be able to bring a cake to our dinner.  The hostess put me on hold to ask the manager, and came back on the line a few minutes later to say it was fine.  My mistake, I forgot to ask if there was a service charge for bringing the cake and having them serve it to us (though I believe the hostess should have advised me over the phone that there would be a $21 cake-age fee).  Doh!Tips:  Valet parking is $8.  Cocktails served at the upstairs lounge bar are about 1/2 smaller in size than those served from the downstairs bar (during meal service), at least, that was the case with the Caiparinha.  4 stars, not docking them for the snafus with the paparadelle and cake service.  Like I said, I should have spoken up, inquired.  If you have any questions, or hesitations, ask!"], ["Mandy F.", "Venue/StaffThe venue is classy. Friendly staff welcomed us from the moment we walked in. We were seated right away. The server handed us the menus and came back to offer recommendations. Food Complimentary crostini and dip along with warm bread for the olive and balsamic vinegar.We ordered the Goat Cheese and Caramelized Apple Millefeuille.The sweet apples paired deliciously with the tangy goat cheese and sweet vinegar dressing.I got the smoked salmon club sandwich.Tasted great and was well presented. Came out in a timely manner. The sandwiches came with LOTS of fries and a side salad. Salad was delicious, but a tad salty. The roasted chicken club sandwich was delicious, too. (According to my friend)"], ["John-David F.", "I work in downtown and I love being able to walk to lovely restaurants such as this one after work to relax and tantalize my taste buds.Brand new to the Downtown Los Angeles,  I am certain that the french based cuisine will not only capture the hearts and taste buds of Angelenos, but keep us coming back for more! To elaborate on my experience....I was greeted immediately by the lovely host, who verified my reservation and offered me an adorable table set for two. The design and ambiance created by these master minds is unmatched to any restaurant I have been in Los Angeles, or around the world for that matter. I felt like I was dining outside under the stars, next to the eiffel tower.  The second floor bar has an elegant lounge area perfect for large groups, business meetings, birthday parties, or a hip cocktail hour with your closest friends. The appetizer (tuna tartar) is an elegant blend of savory and citrus flavors with a little spice of wasabi cream sauce, I dare you not to try it. You will most certainly be missing out. I order the filet which was so tender I didn't realize I was using my butter knife instead of the steak knife they provided. Giving new meaning to smooth like butter! My server was so attentive and knowledgable about the menu. She made an amazing recommendation for the Tuna Tartar and set me up with the perfect red wine for my filet. I felt comfortable and elegant! Cheers to the many successes that lie ahead of you!"], ["Becky L.", "Came here for my husband's (milestone) birthday and had a fabulous experience! The ambience was really cool: it's a converted old hotel with gorgeous moldings and chandeliers. We were seated upstairs so we could see the whole restaurant, but the other tables near us left quickly so we felt like we had the place to ourselves. My husband went gaga over the frisee salad with duck, bacon and a poached egg. My cognac flambeed lobster was TO DIE FOR!!  Also, I had this mescal cocktail that was magical, very complex with a lingering smokiness perfect for a cold night. We would LOVE to go back soon!"], ["Joseph L.", "Want a beautiful dining experience?  Come here.  Awesome place to take someone out!  This place is beautiful and full of history.  If you've lived in Los Angeles you'll know that this is the old Hotel Stowell and it's been transformed into a beautiful French restaurant.  Very classic French feel and the grand staircase that leads to the mezzanine is beautiful.  Head upstairs and grab a drink before eating if you want.It's a mix of old and new, there is DJ spinning music and the ambiance is just perfect.  Very classy restaurant!The food is pretty good.  In my experience French food isn't one to hit your taste buds with 500 flavors but subtle.  I think a lot of people rate this place low because of that.  The arrangement of food is beautiful and perfectly plated.  Desserts are top notch here and you can't go wrong.  If you get the lamb or pasta dishes they'll cut it in front of you.Great service, if you speak French try to interact with them in French, awesome experience."], ["Kayvan S.", "Meh! I was really excited about this place. Food was just ok, the space is beautiful. Ordered steak frite at lunch for $38  the beef was very fatty and the fries were overcooked and cold. I asked for Dijon mustard and got grey poupon REALLY? I can't understand why it's so difficult to get decent French food in LA?"], ["eduin l.", "This is my second time here but before that I want to provide the first time experience which was for a celebratory dinner with good friends Jesse and Andy, and patronising Pastry Chef @DanielaViktoria from Instagram. My drink was the 2010 Château Lacombe Noaillac, Bordeaux -  smooth was the overall verdict, which it was.  It comes a close second to the Bordeaux I had on top of the Eiffel Tower.  Jesse ordered a vodka/soda water; and a bottle of Badoit water for Andy. We started with the following appetizers:  Heirloom Tomatoes - creamy buratta cheese, pistou and fresh basil; Gravlax Salmon - with chive cream and house made blinis; and the pièce de résistance - House Made Duck Foie Gras -  with exotic fruit chutney, toasted fig bread (Da Bomb!)  The first two appetizers are quite fresh and good.  However, I have to say that the highlight truly was the house made foie gras which was \"quite a heavenly experience\" --as agreed by both me and Andy, who is a gourmandise. Our entré consisted of:  Meunière Sole - with mixed seasonal vegetables for Jesse, and the 34oz Dry-aged Côte de Beouf - served with Himalayan Ice Salt, 3 sauces (Gorgonzola, Bernaise, pepper), gratin dauphinois, sautéed mushrooms for myself and Andy.  If you are a meat lover you have got to try this, to share of course.  The presentation of both dishes was done table-side and quite a procession and a show in itself.We finished our meal with the Chocolate Mousse with Berries.  If you are a chocoholic, this is good for sharing; and the Vanilla Creme Brûlée was mouth watering good. Kudos to Pastry Chef Dani who made me quite proud.Overall, my first experience, and shared by my group was a resounding - \"a must repeat experience\".  Compliments to the establishment for bringing a refreshingly new French restaurant that adds to the diverse palate of Los Angeles, and to Chefs Cazes and Baptiste for the good food.  Oh, and our server, Lucas, who had us as his first table serve, did superb!*** Today, Sunday, 18-October, 2015, Early Dinner ***So, now for the second experience.  I started with the Bordeaux, Château Lacombe Noaillac which is now my favorite red in L.A. I ended ordering two glasses of that should tell you something. I started with appetizer, Burgundy Escargots - dressed in garlic and parsley.  The flavors were just perfect as either flavors of the garlic nor parsley overpowered the other.  I followed it with the Bouquet of Shrimp - mixed greens with house made mayonnaise. Very fresh.  Entré was Lobster Papardelles - with artichokes and sun-dried tomatoes, in lobster cream.  I was not overly crazy with this one probably because by the time I ate it the pasta was overly cooked and the cream was all melted -- it came out the same time as the shrimp/salad and the host having noticed it going untouched offered to place it in the warmer. It was all just timing. Dessert was Le Verrine - two alternating layers of lime pannacotta and mango-passion fruit gelèe, topped with white chocolate balls and petit cubed pineapples and decorated on top with edible gold foil and pineapple leaves.  This was quite very refreshing with good complimentary flavors specially after the shrimp and lobster in cream.Overall not a bad experience once again, just a matter of timing recommendation as to when the entré should have been placed and brought out.  This place is a must try and highly recommended!!!"], ["John H.", "Loving this restaurant!!! Been for Brunch and lunch so far and have loved the food. I feel over the next few months things will get even better. I recommend Lunch on Mondays. Nicholas and Jennifer took care of me and made my afternoon fantastic after a hectic morning. I left refreshed, full and so happy, I can't wait to go again as soon as possible!"], ["Anne O.", "Fantastic experience, from the faultless service, gorgeous setting to the delicious food.  We enjoyed oysters and cocktails at the bar prior to out meal. (Bar staff very good).  Our dinner consisted of a very tasty endive and duck bacon salad followed by the whole fish sea bass, which was unearthed from its shroud at the table.  This dish was by far the most tender and flavorful seafood dishes I have ever tasted, and it was fun to share it with my husband. We also had the pleasure of meeting the owners, as well as several of the other employees. (I do want to mention our waiter, who was welcoming, knowledgeable and available throughout the meal).We are looking forward to our next visit!"]], "Industriel": [["Abril P.", "Never been here before, today was my first experience at the industriel :D I thought the lunch menu would have been opened by 2 but surprisingly they were serving brunch, so I just tagged along since I was starving and ended up ordering the brioche French toast: whipped crime fraiche, fried plantains, and caramel sauce. The presentation was amazing !  my mom ordered the Benedict English muffin with hollandaise sauce and a poached egg. It was super yummy and the little green tea bag they gave me was unique d: service wasn't amazing, just ok. Atmosphere is nice and trendy. Music is suiting. A little bit on the pricy side, but will be coming back  for the dinner/ lunch side since it looks bomb c:"], ["Taka S.", "La la love this place, ask me anytime and I'm there.....A French bistro in downtown LA......not sure whether it's the \"industriel\" feel downstairs, steel meets amazing food, or the OLD Hollywood ambiance upstairs complete with the most comfortable chairs you will ever dine in...or the fact that you're sure everyone around you is a producer, director or Hollywood music mogul. So fun....Food....dinner took awhile so we were offered a Quinoa salad to start...very good.  The Salmon with pea tendrils was good, the Red Snapper with Brussels sprouts exceptional. Wine choices were great.  A very memorable experience every time you want to go back..."], ["Anna Y.", "Headline:pleasant downtown group dinnerWhat: short rib croquettes-popular and deservedly soQuinoa and beet salad-tasted fresh and a great balance for some of the heavier dishesCheese board-a few delicious cheesesChèvre gnocchi- bit of a kick that I didn't expect.  Was ok but not a personal favDuck confit-crowd favorite, actually wish I got this for my main after tasting itAmbiance was dark, somewhat romantic, and they handled our small group wellParking: There's a garage around the block, otherwise look for street parking"], ["Christie C.", "I had mentioned to my date that some of my coworkers would be at Perch tonight. Being extremely thoughtful, he found Industrial which also happens to be walking distance to Perch! We parked at One Wilshire and it was $7 one flat rate. Industrial was near by and when we arrived it was busy but there wasn't a wait at all. The hostess immediately seated us and we looked through the menu. I decided on the lamb sausage which was superb and my date decided on the gnocchi  with the kale salad as our appetizer. The good was amazing. Places like this is why I love living in this beautiful city! Overall, it's definitely worth going. I don't know how the wait time is on a weekday but having arrived around 9 on Saturday, we had no problems."], ["Reni P.", "I love this place! The food is fresh, healthy and original. The atmosphere is unusual and fun. They also have comfy armchairs upstairs. It's classy and every dish is beautifully arranged. The service has also been good for the most part, depending on how busy it is. Great place to go for a work lunch!"], ["Donna S.", "The kale salad was amazing! Amazing.  The anchovies just added that punch.  Good stuff.  Nothing else wowed us.  One of us really wanted a burger.  But that was on the lunch menu and they wouldn't let just one of us order from the lunch menu.  It had to be all of us or none of us.   ??  Weird, so he ended up with a dinner entree, he didn't really want.   I love, love Greet Street Tavern and don't mind paying the price point there because of the YUM factor, but no one here was impressed with the dishes at the given price range.   But the kale salad was bomb."], ["Danny L.", "Came here on a double date with some friends Saturday night. As usual parking in downtown always sucks. We parked at Pershing Square and walked to the restaurant.Once we walked in we were seated immediately. The decor and atmosphere is very modern, you can definitely see they were trying to give it a farm-like feel. They have this cool display of honey bear bottles hanging over a tub. Our group ordered the meat platter, French onion soup, the steak, and the salmon. I really liked the collard greens that came with our meal. It looked like it was pulled out of the side of a farm, but it was so good. Definitely a nice twist to a traditional side salad. The only criticism I have of the entire meal was that the outside of my steak was too charred.It's a bit pricey, but what restaurant in downtown LA isn't pricey?! Great place to have a date."], ["Layne M.", "Off to a rocky start.  The focaccia was of the spongy commercial sort and the hard cider was served with ice.   We were the only diners at around 6 on a weeknight and expectations continued to diminish.  Then BOOM!  The wild mushroom goat cheese gnocchi were absolutely delicious and the salmon was prepared 100% perfectly, crisp on the outside and medium rare inside.  Genial servers were ultra considerate as we were late for an event and needed to rush our dinner a bit.  Looking forward to returning for a more leisurely meal to further explore the nice beer and cider list (hold the ice!) and sample some desserts.  Turned out to be a very pleasant surprise indeed and a bit less expensive than similar local restaurants."], ["Joadi O.", "Great atmosphere! Had the brunch and it was very good. Kale salad was delic"], ["Maggie C.", "The plan was to try its Dine LA menu but it didn't include dessert.  Ordered duck confit with fries and industriel burger.  Both meals come with choice of kennebec fries or house salad.Complimentary bread and oil.Duck confit with fries ($14.00): roast garlic aioli, pickled red cabbage, watercrest, toasted baugette.  The baguette duck was tasty but it was chewy :(  I liked the pickled cabbage but didn't really care for its baguette.Industriel burger ($14.00): roquefort fondue, bacon, balsamic onion, arugula, brioche.  The burger was pretty good.Fries:  I didn't really like the fries because they were not crispy.Friendly service.3.5 stars!!Industriel is kinda yummylicious!!"], ["Brendon C.", "This place was close to getting 5 stars but the dropped balls in service knocked it down 1. While our drink orders disappeared and we weren't told what we ordered didn't exist anymore and water was hard to come by, the food and drinks more than made up for it. Everything  here tastes handmade (including the picked led veggies for the bloody Mary's). The cocktails are made with fresh fruit and herbs and freshly muddled. A new favorite in DTLA."], ["Abbi F.", "Dropped in for a Dine LA restaurant week lunch.  For $20 per person, this place was a steal!  The quinoa salad was delicious and simple...I normally am not a fan of beets, but the chef sure pulled this off in a manner to satisfy my tastebuds.  The kale salad was so decadent...I would happily eat this several days in a row!  The crisp pulled pork sandwich was perfectly seasoned and dripping with goodness, sweet but not too sweet and nicely paired with the peppers and relish. There was also a carrot salad with delightful yogurt pairing, a mushroom risotto dish that was a bit mealy for my taste, and a lamb sandwich with roast okra (a rather snotty plant that added some unappetizing notes to the dish) that do not appear on the regular menu.Service was wonderful, and I'd happily return!"], ["Lisa Y.", "This was a very cute restaurant!Parking: valet Parkin is available on grand on the LEFT hand lane right after 5th street. Industriel validates there but it's still $8 for parking. Metered parking around that area is $5 per hour. I found parking in a garage for $6 after 7th street on the right. Hate parking in DT.Food: the food was very! Delicious! We ordered many appetizers, my favorite was probably the salmon croquette. The falafel was a but weird, it was more of a black bean based falafel than a garbanzo bean based falafel. I ordered the hangar steak, medium rare, they did a good job at keeping it medium rare! The potatoes were cubed  and soft. The veges were a bit difficult to eat. Other people praises how good the duck was. The gnocchi was really delicious an soft. Happy hour on Wednesday: it starts from 5pm till closingCon: They were having a difficult time accommodating a 20 people, we had a reservation for 6pm but they told us that we had to arrive at 5:30pm or else they would give us a limited menu. We all ended up arriving early just so we can get the full menu. This was the only part I was irked about."], ["placecard ..", "We were seated immediately, upstairs. Two times now and always upstairs - so I don't know if this review is for the upstairs or overall, I hope the former, because of the latter - and this was said by everyone multiple times over the evenings in question, \"I don't know how they are still in business...?!?\"We were seated and a nice, if not over eager server asked about drinks, we ordered those and waited to order food. Before the drinks came out, server was back to take our order. Order taken, drinks came out. Then first course.(Disclaimer - this was during DineLA and I get that kitchens are overwhelmed, but after the first course, yuck! Spoiler alert - no one was happy, plates went back to the kitchen full and we never saw our talkative server again. The only person who asked if we, perhaps wanted a \"to go\" bag was the busboy who picked up our barely eaten dessert plates at the end of the meal...)First course: carrots by 2 of us, quinoa by the other 2. Both were good, not anything to write home about, but ok. Like a good online recipe you try at home and give 3 or 4 spoons instead of 5.Second course: This is where it went wrong for 3/4 people. The happy diner ordered the risotto. 2 of us had duck confit (but the beans were disgusting and went back to the kitchen untouched), one had the char - ate the fish, left all sides untouched. At this point our drinks were empty and the ice was melted into water, no one ever asked us about refills -- PS: Don't you get more $$$ selling drinks? Dessert: ice cream cookie sandwiches and cheese \"cake\" in a jar. One of us actually got zero ice cream, none of us liked the brick hard, dense and vaguely protein bar tasting \"cookies\". The cheese \"cake\" was soooooo sweet and super rich in a not good way. No balance. After a while the aforementioned busboy came over, asked if we wanted any drinks or if we wanted a \"to go\" bag for the 6 (!!!!) cookies that we tasted a bite or two of and then abandoned. No thank you. Just the check. Please can leave now? We were in and out within 1.25 hours easily. Looking back, we never should have gone back for a second time. We apologized to our friends who said (and I quote) \"You always take us to all the best places, no offense, but this was a waste of money and calories.\" And now, I remind you that this was during DineLA when dinner is $40 for 3 courses. We all agreed that it wasn't even worth that. No one ever asked us if everything was \"ok\" from drinks, through first, second and dessert courses.The first time, we had no solid afterthought or opinion, just \"meh\", but this was just downright inedible and also really not a good experience. Stay away. You have been warned."], ["Helena H.", "Dine LA Week.Decided to bring my friend here for a belated dinner. We came in with reservations and was seated soon after we arrived. They walked us upstairs to a nice corner table for two.Decor 1940's industrial. Black and white photos of women in flapper style attire. Dimmed lighting. Awesome tables that look like frames and chairs that are made to be set in a den. Heavy but sat comfortably. Didn't get to see the downstairs decor but I'm sure everyone has seen the tub and the jar chandelier.Quinoa salad: quinoa, beets, cucumbers: perfect! My favorite dish,Roasted Broc: Broc and Cauliflower; tasted more like pickled broc and cauli rather roasted.Hanger's Steak w/ mash: Nothing special; still good.Pork belly: Tasty, creamy sauce over it was a bit heavy for me. Glad I didn't order that.Toasted Brick: The toast was a little to hard. There was a bit of a spicy kick to it. I think it was from the ice cream. Interesting.Mango Pudding: Didn't taste like mango to me.I'd definitely come for drinks. But as far as a dining experience, maybe I'll come for for small bites. My friend said, \"Good thing I had a bite to eat before dinner, because I think after this meal, I'd want to eat again.\" Basically, it wasn't enough to satisfy a man that can eat."], ["Michelle W.", "Came here during DineLA- they have excellent service and large portions.  Our salads were fresh, crisp and filling (friend had the Kale dressed in a fancier Caesar-style dressing, I had the tangy and slightly spicy Quinoa with beets).  The starters were amazing, but sadly the entrees weren't as great.  I had the Bulgar Congee which was a salty soggy mess- there was no texture or umami and I have no idea how this oatmeal dish was approved for the menu.  My friend had the Trout Ruben, it was supposed to be pan-fried but it came out battered and fried like a fish finger served on toast and tangy thousand island- she wasn't a fan.  However the french fries were amazing, our water kept getting refilled and the staff was very attentive.  I would come back for the salads, but not to try out the trendy entree items."], ["Ellen S.", "Met up a friend for a Saturday brunch at Industriel recently. I'm not sure how their lunch and dinner are, but brunch was pretty disappointing. I was kind of surprised that the restaurant was entirely empty when I walked in at 11am. A couple others strolled in throughout our meal, but for the most part it was pretty empty. We ordered the Brioche French Toast and Crisp Pulled Pork Sandwich. The french toast was not good. It was extremely greasy and just tasted like bread covered in oil. I did not enjoy the sandwich either. It was pretty greasy as well, and I didn't like the \"crisp\" pork in it. Look for street parking or lots nearby! I was able to find a $5 lot about a block away."], ["Denny C.", "Industriel reminds me of a new American restaurant from DC.  When I was in DC a few years ago, new American restaurants were everywhere.  LA's food scene (thankfully) is much more varied, but I liked my recent trip to Industriel.  I came this past weekend with a party of two for a relatively early dinner.  Although I'd made a reservation online, it didn't show up in the system, but we were seated no problem upstairs.  The venue is kind of eclectic but fun.  I like the bar space with high ceilings on the first floor.  The table we were seated at overlooked the bar, and the chairs were huge - at least they encourage good posture.Everyone gets a free starter of focaccia bread.  It came with honey and cream to dip, but I thought the bread was great by itself. We split an order of the kale salad, and I opted for the lamb while my companion ordered the red snapper.  Kale salad:  Yum!  My dining companion said he could eat this all day and everyday.  Very refreshing, and the bacon definitely added some texture and saltiness.  Could've used more white anchovies though.Lamb:  I really liked this dish.  It was hearty and had lots of rich flavors.  The African spices were cooked into rice, and you could almost smell it.  The purple grain rice was mixed with black eyed peas, pistachio, and eggplant relish, so there was flavor, texture, and even lamb juice.  I think I almost liked the rice more than the lamb itself, which was a good mix of fatty and lean, but the lean cuts tended to be a bit dry.We also split the grapefruit creme brulee as dessert.  There are chunks of grapefruit on top of the creme, which made for an interesting contrast of sweet and tart.  I liked the fact that there were bits of pistachio here, too, but I did not like the licorice-tasting herbs that were sprinkled on top - the combination of the creme brulee, the grapefruit pieces, pistachio, and licorice herbs was a bit too much.Service:  Very good.  Great about refilling our water, and the food came out pretty quickly too. Note too that there's a weekday evening all night HH at the first floor bar!Bottom line:  Great new American restaurant in DineLA.  I'd be excited to go back and try some other dishes."], ["Drew B.", "Embarrassingly Good Service.Came for DineLA lunch. 1 Butter lettuce, 1 Kale Salad. Hardcore anchovy dressing and much pancetta turns the healthy into the tasty.1 Chicken sandwich, 1 Burger. I mentioned that the bun was ever so Slightly burnt, didn't need anything replaced, but the server understood things can get bitter so he said he would mention to the kitchen. I hate to complain, especially over a somewhat small, wasn't completely torched rather a few dark edges kind of burnt, but it did leave a bad burnt 1st impression on an otherwise solid burger.They offered to replace it, no.Free dessert; not today (full from Kale salad with healthy portion of bacon bits!)It's okay really.Then they Comped the whole lunch for one person. Oh no not necessary. Please!Thank you. Thank you. Thank you. Your customers are king, and I feel like Royalty.So rare these days, out of the park."], ["Catherine K.", "This review is for DineLA!  My bf had surprisingly researched the restaurants participating in DineLA, and this was the chosen one.  The ambiance upstairs is definitely romantic and perfect for a date night.  The downstairs area seemed more group appropriate.  First, the bread with herb butter and oil was just so-so, but this is just house bread.We ordered one plate not on the DineLA menu, which was the FARM VEGETABLES with olive oil and sea salt.  I think they were mainly green beans charred black with seasoning, but something about it was fantastic.  I highly recommend this dish.For starters:KALE salad -bacon, panko, parmesan, white anchovies, roasted garlic bacon dressingSPINACH salad - radish, grated pecorino, shaved onion, walnuts, lemon dressing These were probably (and most surprisingly) the favorites of the night.  Really refreshing, yet extremely flavorful.  They're presented in tasteful wooden round bowls.  Makes it seem like they were foraged but still has an urban feel to it haha. Meal:Roast Lamb Stew (Poached egg, potato, sweet onion, annatto, yogurt, coriander, grilled baguette)Risotto (roast garlic, parmesan, amond, crisp shallots)The lamb stew was pretty good.  The risotto was rather heavy, so I wouldn't order this one again.Dessert:Biscuit (strawberry, whipped creme fraiche, vanilla ice cream)Peanut Butter Chocolate CakeBoth desserts were just ok.  The biscuit one was better.  The cake was on the dry side, so I wouldn't order this one.I will definitely be back to this place.  It's a trendy, delicious place.  Only complaint it the bathroom is only downstairs and there's only one stall per gender."]]}