{"Gill's Indian Restaurant": [["Brittany B.", "Gill's is one of my favorite restaurants downtown. They have THE BEST naan (I love garlic, boyfriend loves Peshaari with raisins and nuts) and Saag Paneer I've ever had. We always order the Chicken Tikka Masala as well, because, c'mon, it's seriously one of the universe's sacred gifts to mankind. It's pretty tasty here (I like it medium, if my boyfriend could handle his spicy better, I'd get it hot). I have never ordered something from Gill's I didn't like, with the exception of the Onion Bhaji, which is just a little too greasy for me.Just a heads up, the restaurant itself is more of a dive than a fine dining experience, but I love coming for dinner because the service is always attentive and it's a very quiet lowkey environment.  The lunch buffet, with a pretty extensive selection and less than $10, is a draw for me as well. I even had my 30th birthday (\"Curry 30\") dinner here.Long live Chicken Tikka Masala! Long live Gill's!"], ["Andre S.", "Another of my favorite foods in the world is Indian cuisine....guess I'll keep looking.Was sitting at work with a overwhelming pang for Tandoori...looked through Yelp and found Gill's. I have to say I'm somewhat of a foodie, as for me the more exotic the cuisine the better. Boy was I disappointed, my first clue should have been when I called after placing my order to inquire about the pick up time. I called about 5 minutes after placing said order, the person stated that it was ready!?? I got back to work and first tried the veggie pajoras...tasted old and over cooked..or maybe they keep them prepped...either way, off to the bin they went. Onto the Tandoori Chicken....burnt / dry / bland...:( The most flavorful items I received were the fresh sliced onions. Where is my great Indian cuisine in L.A.??"], ["Ashley H.", "My agency ordered Gill's Indian food for my group and overall I would have to say it was okay. I live in Tustin where there's a lot of Indian restaurants and we're not too far from Little India in Artesia so if I want amazing Indian food I can get it in a snap.However, I noticed in DTLA there's not many places where one can get Indian food so Gill's it was! Here are some things I noticed about Gill's:1. The restaurant is inside the Stillwell Hotel. I wasn't aware of this so when I called the man he told me to just park outside the hotel and that the food will be brought out to my car. 2. The prices are great. We fed about 25 people for about $230.3. The saag paneer is AMAZING! So freaking good!The other items we had like the dal of the day and the tandoori chicken was okay. I've had it better at other restaurants. Would I come back? Probably not, but if you're around DTLA and you're craving Indian food I would recommend you to try this place out."], ["Katy M.", "Gill's is our standard takeout joint in dtla. Good food, nothing too fancy. The coconut chicken and saag paneer are the best!"], ["Marye S.", "The buffet is great for the price. I really enjoy their Chicken Tikka Masala and the fresh nann is to die for!! Super divey atmosphere but I love it!"], ["Vanessa L.", "I work just outside downtown LA and Gill's is the go-to option for Indian food because, well, it's pretty much the only option if you want a traditional take on Indian since you get a modern/fusion style at Badmaash.Gill's is okay; located inside a hotel, it's a sit down place with but not much going for it in the way of ambiance or decor. Usually we just go for the lunch buffet because it is fast and easy. It's $10 bucks a person and features typical dishes such as chicken tikka masala, tandoori chicken, curry (the curries vary from meat to vegetarian but usually only one is offered), dal, rice, salad, and dessert. There is always also some other type of vegetable dish, like aloo gobi (potato and cauliflower). The dishes themselves are average and, probably because they are buffet dishes, lack any type of spiciness. The flavors are very mild, especially for someone (like me) who loves spicy food. The tandoori chicken can get dry. Once I came with my fiance and we ordered off the menu but food was still pretty average. The naan bread that is brought warm and fresh to your table is one of the best parts of the meal, but it's hard to mess up naan. If I crave good Indian, I'll drive myself over to 3rd Street for some better, cheaper options, but Gill's is a place for an easy office lunch outing."], ["N B.", "Go eat here!  Indian food that hits the spot period. Order naan as you go.  The usual fare is great but try the lamb with some spice and basmati rice."], ["Anna P.", "I ordered delivery from here and was really pleased. I ordered butter chicken (mild), saag chicken, a bunch of naan, and samosas. Everything was excellent. I used to live in Delhi and the butter chicken really brought me back there, the samosas were nice and crispy and (really) big, and the saag chicken was great. I cannot speak for those who like spicier foods as I ordered everything in mild, but I would definitely order from here again."], ["Heidi H.", "I've never eaten at the restaurant so this review is solely based on their food.   I am never disappointed with Gill's deliveries (free).  I've only had their Chicken TIkka Masala, Shrimp Saag, and Chicken Tandoori which are all delicious.  Their cheese nan is really good too.  Garlic is meh.  The only thing about this place is that the food seems very oily or buttery compared to other places.  But then again it makes it taste extra yummy..  And if you love spice, ask for your dish to be really really really spicy and you will sweat bullets.  Love spicy food.  Love Gill's."], ["Cathy T.", "We love love love Gills. We've been ordering from them for over 2 years. They're our go to Indian place. Of all the other handful of Indian places in LA, they have the best hands down tasting dishes. We ALWAYS get the chicken tikka masala, sag paneer, garlic nan, basmati rice, and samosas. They're relatively quick; we wait about 45 min for delivery on week nights. Their restaurant is located inside what some could say is a sketchy looking hotel, but dont let that discourage you! Their space is intimate with an interesting Indian flare. But with all that aside, its the the food that is just bomb.com."], ["Allison H.", "Hidden in the heart of the Stillwell Hotel in DTLA, this little place is a gem. The lunch buffet (all you can eat) was a very pleasant surprise. And at a little under $10 per person, you really can't beat the price. Our warm naan bread was continually refilled by a smiling young man who was clearly focused on his job. The ambiance was very colorful and relaxing. Indian music played softly in the background - not too loud, not too soft. Just enough to enjoy your lunch companion's conversation clearly. I really appreciated this. The food was very good, not too spicy, very tasty. I will definitely come back. This place has all the components correct. Thank you!"], ["Cindy B.", "Oh man. Since coming back from London, I haven't had good Indian food and I was definitely craving it. I didn't want to go far so I thought I would give this place a try. I ordered the Chicken Tikka Masala for pick up and brought it up. It was really good but for the price, I would have expected that they would have thrown rice in there. I ended up cooking rice to go with it. After that, it was really good. Next time, I think I'm going to make my own food at home though. This wasn't worth it."], ["Nikitha R.", "Was craving for good Indian food (not tomato gravy!!!) and ended up in this nice restaurant in downtown. Its quite difficult to locate this place as it didn't have any board put up outside the building, but anyhow we managed to find it. We were bummed out that the buffet was only for lunch and hence ended up buying vegetarian pakora, shahi paneer, Malai kofta and garlic naan. Oh!the pakora was amazing and tasted just like how it tastes back in india :) amongst the two gravies , I personally liked the malai kofta better since it had proper seasoning which lacked in the shahi paneer. Garlic naan was incredibly soft and delicious. In beverages we ordered mango lassi, Chaas and masala chai, which were pretty good too. Oh ! And not to forget the complimentary papad that is served in the beginning ! We were one bunch of happy tummies walking out of the restaurant"], ["Jerry L.", "F$12 ayce Indian lunch including tips is a steal for DTLA. Tandoori chicken is on point here."], ["Stephen C.", "Gil's is one of those places that totally unaffected by the recent dtla transformation, and that makes the place so amazing. I go there by myself all the time. It's basically the exact opposite of Badmaash (which I also love), and it's a welcome respite from the expensive organic foodie stuff that's become way easier to find than just a good, old fashioned Indian restaurant. They're lodged in the back of a terrible old hotel that everyone hates but I love for the same reason I love Gil's: it's not trying to be anything other than what it is, and it doesn't care who you are. The waiters will serve you damn good food. They won't talk to you or be polite or do anything else. It's pretty sweet. They're totally jaded, but that's proof that Gil's has been around long enough for them to get that way. If you go there at an odd hour, they'll sit and watch soccer while you eat. This place is the restaurant equivalent of my favorite hole in the wall bar. They're awesome. The prices are even good. I wouldn't change a damn thing."], ["Esther G.", "Great selection for buffet . Extremely delicious food. The restaurant is nice inside. A little tricky if you're trying to look for it. It's inside a building. I don't like the service what so ever. Very rude all the time. Since I live close to here I wanted to try this place so I didn't have to drive all the way to Artesia to my friend's restaurant Ashoka the great. The parking is a pain, since being in DTLA you have to pay for parking. Not sure if I will be coming any time soon. Much rather go to Artesia."], ["Jen W.", "I love this place!Never seen it in person, as I always get delivery - it's amazing. Chicken tikka masala... so delicious. Samosas... hot and fresh. Just do it. You won't be disappointed!!!"], ["Maggie C.", "My friends like going to this restaurant for lunch.  I went with them a long time ago and hated it.  I couldn't eat anything at this place.I went back recently because 2 of my girlfriends wanted to go here :($8.95 lunch buffet is a steal.It wasn't as bad as the first visit but I stil didn't like it.  The only thing I could eat was the tikka masala sauce with naan bread.You can watch Bollywood while enjoying your lunch.QUICK TIP: IT IS LOCATED INSIDE STILLWELL HOTEL.2 stars!!Gill's Indian Restaurant is not yummylicious!!"], ["Ed S.", "I GOT SICK.They have a buffet for lunch, but they add new food over the old food and they mix it.They shouldn't have an A rating..."], ["Reesha P.", "Ridiculous.  Ordered the Chicken Biryani and it was the worst thing I have eaten till date. Where is the raisin and cashew topping?  It felt like they took some rice and took some curry and just mixed and gave it away.  Never going back here.  The worse places in India serve better food than this."], ["Alan G.", "The food here is absolutely delightful and super flavorful. I have never been a huge fan of Indian food but this restaurant has completely changed my entire views. I've tried various dishes but my absolute favorite is the mango chicken. It is super delicious and rich and goes perfect with the garlic nan. The restaurant is located in a 2 star hotel so don't be scared of the location because the food is great. The decor is old but the food is fresh and delicious."], ["Julie S.", "I was surprised to find a pretty decent Indian restaurant in DTLA, and the added bonus is that they deliver. Great for lazy nights in... which are becoming way more frequent these days but who's counting.We got the saag paneer & chicken vindaloo with rice and garlic naan. Everything was delicious and satisfying! I'll definitely order delivery again."], ["Guli S.", "I absolutely love the food, perfect for dinner. The fact that they have delivery is great. However, it's horrifying to have to deal with the rude man who answers the telephone and delivers the food. When trying to tip him because of miscommunication resulting in him waiting on us to come down to pick up the food, he yells \"I don't need no tip, call my manager, get me fired, I don't care.\" We know we inconvenienced you and we were at least trying to do our part and tip. Rude man, rude service. Sucks that we have to deal with angry people in order to get some good food."], ["Eric P.", "First: \"Estimate delivery time is 45 to 60 minutes.\". More like 90 minutes.Second: Worst Chicken Tikka Masala and Samosa I've ever had. CTM was super salty. I think you could get better frozen samosas.Third: What's up with two Yelp businesses for same location, yet different websites and same physical address & phone number? I did not notice this until I came back to Yelp to write this review. One is gillsrestaurant.com, the other gillsindian.com, different sites, same number, same location... sketchy"], ["mike l.", "Terrible. I ordered through Eat 24 and patiently waited an hour for my soggy naan, overcooked white rice (not basmati, just Uncle Ben style), and samosa dripping with fry oil (also soggy). Called the restaurant and they assured it wouldn't happen again. I explained that I wouldn't be eating it and they said sorry. I would've taken a refund or walked over to bring them their food back. They weren't helpful."], ["Anshuman D.", "Loved the food. Had a genuine Indian touch to it which I miss in Boston. Reasonable prices too. Recommend you try Gills in LA"], ["S D.", "PROS: the garlic nan was the best I've had yet (thinner than most other places but so fresh and delicious), the chicken tikka masala was pretty good, sag aloo was good, waitstaff is polite and very attentive, great random location of the restaurant almost felt like walking into a movie scene when you enter the hotel and The restaurant is at the very end of the hall, basmati was cooked wellSamosas were okay."], ["Rose P.", "Sorry. I know how this food is supposed to taste, how it's supposed to be presented, & I know how much it's supposed to cost. They just didn't cut it for me. The cost is OK but the bread was unbutterrd  and dry, all the food was barely done not well easoned with no appetizers. Maybe just a bad day."], ["Nicholas G.", "The delivery took two hours to get here for no reason. It was a 5 minute drive and they don't answer their phones. The worst delivery service in LA."], ["Sharon G.", "A great find tucked away in a very old hotel. A very tasty and reasonably priced buffet. Worth a visit, or several, for workers downtown."], ["Marina K.", "The worst Indian food I ever tried! Chicken tika is very dry and there is more onions than anything else, garlic ban is bad too. Disgusting. Service is not that good either..so.."], ["John B.", "In July, I dropped by Gill's since I was craving Indian and was staying just around the corner.  The restaurant is located in a deserted city block, at the back end of a long foyer than resembles a hallway.  Once you enter you realize there are other people in the building other than the sole hotel reception clerk.  After getting past the 'entrance' experience I ordered some garlic naan and dal makhani - it was quite good.  What makes a good Dal Makhani?Clearly all that added butter and cream could easily make this dish, but I always order without it (on top; since there is always some in the spice portfolio).  In my view, good DM is slow cooked, stewed over time (yes, like those pintos I enjoy in breakfast burritos).  The right mixture of ginger, garlic, onion, tomato + spices (cumin seeds, green chili, cinnamon, cloves cardamom, chili powder, tumeric).  I am biased towards the dhaba style, since that is what I was first introduced to, but good DM works in any style IF IT IS SLOW COOKED/STEWED.  So I am offering a very generous 3 star rating, which is high in my book.  4 starts are offered to those exceptional restaurants, and 5 stars are almost never given (unless...).  I will no doubt return and enjoy when back in LA.  Hats off to the chef."], ["Miriam T.", "A little over $10 for lunch buffet in downtown.  Place has business for a small place but not packed.  3 chicken dishes and some other none meat stuff.  They bring the naan to your table and refill as you run low.  No pressure in ordering a drink."], ["Julie L.", "I can eat naan every freaking day. My hips will not be thanking me though. So good!!! =PGill's is probably the only Indian buffet in the DTLA area. And it is such a steal. Only $8.99! The restaurant is located inside a hotel, so it isn't very visible on the street. We came during a Friday lunch and it was packed. The interior is relatively dark. I had to adjust my eyes a bit to actually see what I was scooping on to my plate. Limited seating inside, but they have a good amount of tables outside near the entrance.Tried pretty much everything they had to offer. About 8 different options and dessert! Not sure about all the names but I really liked the saag, fish curry, curry chickpeas and potato, tandoori chicken (juicy) and the chicken tikka masala. Delicious rice pudding for dessert topped it off for me. There was also fruit. Oh and the garlic naan. So buttery warm and fresh! I wanted a second plate but refrained because I would have gobbled it up. Nom nom nom!Service was great at lunch. Pretty efficient and they definitely hustled to keep refilling the buffet. The lines could get kind of long. Will definitely be back for more naan!  =)"], ["Daniel F.", "I am a short white disabled American Military Veteran, on a tight budget, and GILLS is the place to go for a GREAT Indian buffet lunch or dinner.  I went there the other day for the first time, and I walked through the narrow lobby of the hotel to the restaurant, and was immediately greeted by a well dressed thin Indian man who seated me in a nice comfortable black leather booth of my own, brought me a napkin and silverware and a tall clean glass of ice water.  I went to the buffet and picked up a plate and proceeded to uncover some really great preparations under silver hot pots.  THE SMELL WAS FANTASTIC!A nice simple varied mixed green salad with veggies, and a nice creamy lite dressing, then the next one was basmati rice with a nice sauce with chickpeas, another one had a lovely cooked curry chicken, then one with spicy lentils, and then a nicely done roasted spiced chicken, then still more tasty Indian dishes, about 10 altogether!  Then at the end there is a nice fruit display with watermelon and cantalope with a sweet cream to put on top.  When I returned to my table, I found already there waiting for me a plate of freshly cooked lite garlic naan bread, that went so nicely with my meal.  I LICKED MY PLATE CLEAN!The décor is very simple with beautiful bronze Hindu statues, giving the restaurant a very welcoming and spiritual feel, but also with the interesting wall mirrors and burgundy colors all around and the very clean glass over the red table cloths was very nice and inviting.  There are also televisions playing very beautiful Indian movies that actually stimulated my senses and increased my appetite quite a bit and I went back for seconds and thirds!  The staff is quite focused on the guests and brought me fresh ice water and more naan bread whenever they found my glass or plate to be empty. They continuously checked on the guests without interrupting our meal.  I felt like an important VIP rather than a sneaker and t-shirt with baseball cap wearing American looking for a good deal, which is what I was. :)  They refilled the buffet and made sure everything was taken care of and going well.  They did everything I could expect in a high class expensive restaurant, while offering a delicious, tasty and appetizing ALL YOU CAN EAT meal for under $10.00.  I couldn't have been happier and I thoroughly enjoyed this place and will eat there as often as I can.  My budget is tight but I can afford to eat there every day.  (This is a blessing and American restaurants could learn a lesson here.)I am not affiliated with this company, nor am I prone to giving good reviews to restaurants if they are not worth it; I am very picky about my food, and even though I try to be vegetarian, I could not resist the chicken dishes because they smelled and tasted too good to pass up!  I am usually the first person to give a one star review if I think a place deserves it, but when I come across a good place, I definitely will go all out to make sure people know about it.If anyone gives this place a review under 5 stars, they obviously do not appreciate good Indian food, or are used to food with tons of preservatives or are just plain racist.  I love this place and give it a hearty TWO THUMBS UP and a humble bowed head in thanks and gratitude to these fine people who truly deserve applause for the great feeling I left with in my STOMACH and in my SOUL.  (My wallet thanks you also.) NAMASTE! ;)THANK YOU!!"], ["Deepika J.", "Been here 3 times already, comes close to good mughlai food. The ambiance is not great but the service is good. Their paranthas are to die for and the quality of food is also very good. They are consistent. I loved the shrimp pakoras and the paneer makhani. Definitely go!"], ["Nina H.", "The ambience is pretty bad which is why I always do pickup or delivery only. The food is so good. Best indian I've found in LA. They're quick and no frills. Never ate a dish from here I didn't like."], ["Amy L.", "went here for dinner assuming it was all you can eat buffet. it said so on the sign they had outside their store but when we went inside the buffet was closed. they obviously need to update their sign. I got the samosas from a check in I had before and the lady said I could use my free samosas from yelp. but when the bill came out the guy said no. we didn't want to argue since the language barrier was already there. we also got the mango chicken which was pretty darn good. of course we got the garlic nan which tasted so good with the mango chicken sauce. they we're very attentive to our needs and always filling our water as soon as it was half full. the food was not bad but just that we we're told 2 different things with using the free samosas and that their sign said it was all you can eat for dinner.I would definitely come back here if I was craving some Indian food!"], ["Shantel G.", "been here countless times and there is never disappointment. sketchy entrance, and maybe a tad confusing if you're not familiar with the location but the food speaks for itself. butter chicken, biryani, garlic naan, tikka masala...amazing...i think a sure sign of an authentic restaurant is seeing the natives of that culture actually eating there too!"], ["Anna N.", "My new favorite Indian cuisine restaurant!I love, love, LOVE curry so any great dish (Thai or Indian) will get rave reviews from me. DISHES:Tikka Masala Chicken: rich, tasty, creamy & the chicken pieces are from the breast.Curry Chicken: the basic curry dish that is made w/ tomatoes; again, very tasty. Chicken seems like the dark meat.Aloo Gobi: flavoreful, great veggie dishGarlic naan: yum! they give you 4 pieces in one orderI love that this place is a family owned restaurant & not a chain. Service is great. Parking is on the street (free after 8pm)."], ["Keila N.", "It was Saturday night on New Year's eve.  My date and I walked into Gill's excited about having Indian food.We had free samosas for checking in.  This time, we were both disappointed with our dinner.  The chicken tandoori was dry.  We asked for spicy lamb vindaloo, which came out mild-even for my date who's not a fire eater like myself.  The lamb was also tough.The service here is faultless, however.  Our water glasses were always full and the food was very prompt."], ["Kyle O.", "Good food. Kind of rough ambiance. Smoke filled hallways in an old hotel with a rough parking situation and old school decor. I hear the buffet is the best value. Tikka masala is great and beers are good and fresh so that works."], ["Cara C.", "I was really looking for an Indian place DTLA that was decent and this place is far more than that.  Free delivery too!!!  We went there for dinner due to the Yelp reviews and were met with the fairly tale colors that you expect from all the kitschy Indian joints.  Techno place, Bollywood on the TV.  Great start to the dinner.  They have a liquor license too (that seems to be a theme with me) and they sport a passable red for $6.  Sold. The food--we had their dinner combo thing (don't know what it is called) but you can pick for a couple different main dishes.  I got the lamb curry super spicy.  They handled this like a pro.  It's hard to get places to believe that a white girl lover her some spice.  Perfectly blazing hot.   The man had the Chicken Tikka Masala and it was screaming good.  Way rich and tons of personality.  I mean really, isn't that why we eat Indian food--for the personality.  There was too much food to finish, but we tried. I liked it so much 2 days later I ordered delivery from them.  More Tikka Masala and saag paneer.  Yum again!!  The food was really fast getting here and still hot when it arrived.I am a fan!"], ["Narciso A.", "I've only been here for their $7.99 lunch buffet special. For the price, it's a great value. Lots of different dishes to try including Chicken Tikka Masala and Dal! The Tandoori chicken was excellent, juicy and had a great flavor. The Chicken Tikka Masala is a little on the dry side (boneless, skinless chicken breast is the culprit), but the sauce is marvelous. Stop by for a quick bite, you won't be sorry."], ["Jesstine G.", "I like having a little bit of everything, so I love buffets.  Gill's has relatively authentic Indian cuisine and it is pretty tasty!  The selection includes a wide array of dishes, however they vary daily so your favorites may not be there when you want.  Of course, the staples like tandoori chicken and chicken tikka masala are always on hand.  The buffet usually has a great assortment of vegetarian curries, and the pork curry is savory.  Plus, it includes unlimited garlic naan.  All for $8.95, Monday to Friday 11:00 am - 2:30 pm.  It is oddly located in the floor level of the Stillwell Hotel, which is rather dinky.  And the chai is not good and service is slow.  But it's a short walk from the financial district and is a good lunch option.  Granted, you'll probably overeat and suffer through food coma afterwards, but that's what buffets are for. Lol.  Plus, there is plenty of nearby parking.  There is a $3 lot immediately behind the building off Olive, or meters all around (FYI -- the meters on 9th are cheaper than the meters on Grand).One last thing, there is a little dive bar near the entrance of the Stillwell that is always cracking in the middle of the day.  When I head out, I hear loud music and laughs coming from Hank's bar ...in case you want a post-lunch libation."], ["Martha M.", "Delicious.  Competent, attentive service, very reasonable prices.   We attended a large meetup and the staff took care of everyone, from appetizers to separate billing all with a friendly smile"], ["Michael B.", "Well I just finished the last of my takeout from last light. Honestly, this food was better than I expected, based off reviews. Flavors were on point for the Chicken Tikka Masala, the Lamb Vindaloo and even their mint Chutney. I've dabbled quite a bit with Indian cuisine and this was one of my favorite experiences in recent memory. I saw they have an all you can eat lunch buffet for $8.95, I'll be back to give it a try!"], ["Stephen P.", "I think I kept this place out of my Yelp list because I was selfish :)I haven't been here for years, but when I ate here I enjoyed it. I forgave the slightly shady hotel setting and enjoyed the dated 90s decor that, oddly, reminded me of England.Sorry I can't give more deets on the food. Come eat here."], ["Monica N.", "Hot damn, there's good Indian food downtown that doesn't cost a fortune!AYCE lunch buffet is $8.95. It's hidden inside a cheapy looking hotel and you may miss it even thought there's a sandwich board on the sidewalk advertising that they're there."], ["Sean B.", "I'm a huge Indian food fan and was craving the basics so I ordered delivery for Veggie Samosas, Chicken Tikki Masala, Saag Paneer, Garlic Naan & 2 orders of Bismati Rice. All for $34 (Very reasonable for the amount) The lady who answered my call was very friendly and easy to deal with. Good took 45 minutes to arrive, by a very friendly man on a scooter. Everything came correctly AND delicious. Particularly impressed with the Chicken Tikki Masala and Garlic Naan. One of the best I've found in LA!! Only reason this didn't get the 5 star is because I'm a fan of freebies and I have experienced some Indian restaurants that throw in a dessert** :)"], ["James K.", "I love the chicken tikka masala. I've ordered it a half dozen times in the last two months. The naan breads are always delicious and the gulab jamun is a nice dessert for someone, like me, who isn't too big on sweets at the end of a meal. My only complaint is that the $20.00 minimum on delivery isn't exactly bachelor friendly."], ["Jose R.", "Ordered food for delivery. Good service, good packaging (they added plastic wrap to all containers which is great), and good portions. The garlic naan was very good. However, the Chicken Tikka Masala was not great. I've had much better. The same could be said for the rest of the food. Even the rice was disappointing."], ["Doug M.", "Alright, here we go again. This place is awesome, considering this was my first time eating Indian, I started with an appetizer called a Samosa, Think Indian Hot Pocket except the filling is a veggie mixture of lovliness, no joke, these little jewels are the shit!!!! next I ordered the Chicken Vindaloo cause I like spicy, my friend ordered the Chicken tikka, we also got a side of rice and some garlic naan.The Chicken Tikka arrived on a sizzling skillet with huge chunks of chicken meat on a bed of grilled onions with a few limes, the seasoning on the chocken was bomb, it also came with some kind of green spicy sauce which was killer too!!Next came my Chicken Vindaloo, which did not dissapoint, Spicy goodness. Chunks of chicken mixed with chunks of potato in a red spicy curry sause, I grabbed some naan and chowed down on some table made Indian taco's if u know what I mean, Everything was so good and plenty here! The actual resaraunt is a little shady lookin, you have to enter the main doors of a shady L.A. Hotel to get to the spot, but once ur seated all is well, Oh yeah, the prices are super low and the grub is quality and I heard they have a sick lunch buffet, I'm definitely coming back! I highly suggest this spot 5 stars all the way!!!"], ["Johann B.", "For drinks, the sweet lussie was tasty and reasonably priced at $2.  The garlic naan was good also, though we've had many better.  Except for the chicken tikka masala, we both found the buffet items to be poor, generally bland or didn't have a very pleasant flavor anyway.For dessert, the kheer was mediocre; didn't taste very good.  Also wish they had badam kheer -- with almond slices -- and had used a bit more cinnamon, such as actual cinnamon sticks.Service was not particularly friendly.Can't expect too much for $8.99, but still not worth our return trip or going out of your way for."], ["Liz L.", "YUM. Stopped in this joint for my first dinner of the New Year, and so glad that I did! I feel that this restaurant is exactly as it should be. A little strange, casual, but classic. Everything on the menu was delicious. The staff was attentive and friendly. I feel like I am already craving more. I even had my leftovers for breakfast! This is a great hidden spot in DTLA."], ["Celia C.", "FOOD DELIVERY REVIEW. Gill's has the best Indian in downtown (although, that's not saying much with our slim pickings to choose from) but their deliveries move at a glacial pace taking on average of over an hour. This has been pretty consistent and works the same with take out as well. From the looks of it, if you can handle the average customer service and long delivery waits, I'd recommend eating here."], ["Lin G.", "Back when I was in law school, I used to eat at this Indian buffet down the street all the time.  We would go in and put away like 3 to 6 full plates each.  Total monsters.  Surprised they let us come back so many times...So a friend suggested coming here for lunch and I was more than down.  Indian buffet?  Bring it on!  Boy did I not regret it.  They had a great selection of curries, veggies, meat, all the staples.  I always eat a ton of this orangey chicken curry thing.  It's not even about the chicken (always so damn dry), I just like the sauce, with naan.  And here, you get unlimited, fresh, yummy naan!  My favorite.  They also had nice dessert for those of you who are truly pigs and can polish off buffet dishes like no other.  The service was friendly.  They were prompt with water refills and did not make me feel guilty for eating a ton.  The space is sort of in a hotel and very red, like wallpaper, tablecloth, etc, sort of like a misplaced Gothic vampire den.  Spacious and surprisingly not crowded considering how it's so damn good.  Around $10 for a lunch that will satisfy all your Indian craving is money well spent in my book."], ["Michelle W.", "I've been liking this place until today, because even though their food is not that good but at least the staff is always nice.  Today I ordered delivery and when it came, the food was wrong, so I called them to tell them it was wrong, not to ask for another delivery, just asking them if I had ordered wrongly. The guy that picked up actually told me,: \"Sorry, we don't have the food that you ordered, it's not on the menu.\" It's not on the menu??? I've ordered at least 10 times from them and every single time I order the same thing and it disappeared from the menu? So I asked him if he can check with the chef to see if he can make it, and he just remained silent on the phone for a good 20 seconds, so I said:\"Hello? Did you ask?\" And then he said:\" Nono we don't have we don't have! Chef can't make it because it's not on the menu!\" This conversation went on for about 5 minutes, and I was a little irritated so I asked him how can something that I ate so many times not be on the menu? In the end he told me:\" Okok next time I make for you.\"Throughout the whole conversation he didn't say anything about being sorry, only scolding me for \"ordering something that's not even on the menu\" and telling me\"I don't know what you've been ordering because it's not on our menu\" I'm pretty disappointed with them, I used to order from them because the food comes faster than a lot of restaurants, and it's good for when I don't want to cook or go out. But after this incident I probably won't be calling them again anytime soon."], ["S K.", "**Review for DELIVERY ONLY**I've never actually eaten here but have had delivery a few times and each time has been consistently good.  I tend to order the same things.  The Aloo Gobhi, Chicken Tandoori, Basmati rice, and some Naan.  The portions are large and they always package the food up very well.  Delivery is always on time and they've never messed up my order.Now, I'm not sayin' this place is the best in LA but it certainly beats driving out to Lil India when you're having that craving.  The guy taking your order can be a lil dicky but no worse than my mom."], ["Sing Sing T.", "Walked down this aisle and found this spot that my co workers told me about, it like a secret gem, but it not really a gem, like a secret shiny rock. Food is A-OK!!!! I would go here again, but I wouldn't get in my car and drive to this place. $12 bucks or something and you get all you can eat. Can't go wrong with that."]], "India's Oven": [], "Cardamom Indian Cuisine": [["Richard R.", "A little gem on Beverly blvd.  The most wonderful and delicious Indian food and elegant ambience!  Elegant restaurant and kind host. Our favorite!"], ["Danna F.", "Absolutely delicious ! My brother & his bf convinced me to finally try Indian food for the first time and I do not regret it one bit ! The first impression was the already fancy door, once we entered the manager greeted us. He is super friendly already a great experience . Then when we sat we were immediately given a starter , I'm not sure of the name but it was rly good like pita chips ! The manager then offered maybe having a glass of wine , then let us sample a couple according to our preferences ! Wow ! They're definitely earning their five star with service already ! We ordered the food and everything came accordingly. Appetizers first , entrees after ! Food was just soooooo good. I didn't order any , I let my brother choose haha but the manager and servers were extremely helpful in choosing food that we weren't sure about ordering. Overall it was an amazing experience. And I  will definitely be coming back ! Probably the only Indian cuisine restaurant I will be eating at to be honest haha ! Thanks for the Amazing experience and service !"], ["Antoinette P.", "Hands down the best Indian food you will find in LA. Ambience is great, and service is top notch. They have an amazing wine selection as well. Definitely worth a visit."], ["Craig S.", "Fantastic!  This place has the look of a very elegant night out with the casual prices!  The service was great.  The food - AH-mazing. We got coconut naan - slightly sweet.  I got the most spicy thing on the menu, Sylheti Murgh.  I can handle my spice and usually feel places under spice their food when it claims to be hot.  This did not disappoint.  It required a lot of naan to cut the heat.  The taste was great, very bold and creamy.  The chicken was very moist.  The rice (Zafron Pilau) was extremely fresh and cooked to perfection - mild yet great flavors! At the end, we were served mango/yogurt juice.  It was so refreshing.  Sweet, but not too sweet!  perfect desert after a great meal.  I will be back many times over!!"], ["Natalay G.", "I went back and this time ate in. The decor is pretty. It is trying to be upscale but seems like the furnishings are on the cheap side. Have you ever seen Restaurant Impossible? This reminds me of a restaurant on that show where they redecorate on a budget and just make it look really modern. It is all white, white chairs and tables and walls, with colorful modern paintings as the only pop of color. Ordered the paneer chutneywala again and really enjoyed it again. We also had the Cardamom Special Salad which was nothing special. It had avocado and olives which made it better. Finally the Dal Makhni which was much creamier than at other places. Service was fine. They checked on us an awful lot. I won't rush back but I'll keep it in mind."], ["Paul G.", "I made a Yelp account for the purpose of reviewing this place. I ate there last Saturday, and it's the best Indian food I've ever had. I want to go back for more to try the other stuff on the menu I didn't even know existed. Going back as soon as possible. My lamb with ginger and coriander dish was flavorful and spiced perfectly (as far as I know, I'm not an expert). Milady ordered a spicier chicken dish, which although spicy and made my nose run and eyes water even though I eat a lot of spicy food, was also amazing. The complimentary pampadan was perfectly crispy yet soft and came with 4 kinds of dips (only one was actually chutney, mango) and I couldn't even decide which one I liked best.The waitstaff were all pleasantly helpful, polite, and friendly as well. Great place to take a date.If I had to say a negative thing, I guess it would be that I thought the naan would be fluffier, but I don't know. Check this place out!!! On top of the quality of food, the prices are VERY reasonable. And, it wasn't crowded on a Saturday night, so a lot of you hipsters can say you went there before it was cool. Just don't order maximum spiciness unless you have no taste buds and sip on Mace like it's gin 'n juice."], ["Daniel H.", "Ordered on grub hub for delivery... shortly after a man shows up with my food and is in the courtyard screaming my name. \"DANIEL!!! DANEIL!!!\" i come outside and he begins to verbally attack me. \"your address is too far! do you know how far i had to come to deliver?! I only deliver in my area!!!\" i was humiliated my neighbors even came outside to ask if everything was ok. If you don't deliver to my area let grub hub know because that is not my problem. I have never been treated this way by a business. Beyond mortified."], ["Emily F.", "Los Angeles doesn't have the best Indian restaurant scene (samosa house and badmassh excluded). Imagine my excitement when I found out about Cardamom. Recently opened in mid October, Cardamom has a charming interior, with tons of color and paintings on the walls. The decor is very classy, yet not snobby. My husband and I went with another Indian couple, and were promptly seated at 730 on a Friday, without reservations. Only 2 or 3 tables were full when we arrived, but the place was totally full within the hour. Immediately upon sitting, we were brought pappadam with a variety of chutneys. I love these little crunchy wafers, so right away I was pleased. We needed some time to look over the menu - boy, is it long! The menu is nicely organized by vegetarian/meat/poultry/fish selections, but at first glance is a bit overwhelming because of the many options to look over. After some discussion, we decided to order...well...a ton of food:Appetizers: -Tuk Tuk platter for 2: brought on 2 plates, which was  a little weird. This was probably my least favorite dish. It came with paneer, a samosa, and a little fried onion 'piaza'. While tasty, we noted that the paneer was a little chewy and the fried onion a little greasy.-Momo - my husband devoured these little meat dumplings-Chutneywala Panner (sensing a paneer obsession): again, really tasty, but just a bit too chewy.Entrees:-Murgh Madhurai/Sylheti Murgh: 2 different chicken dishes, delicious flavors. I absolutely loved that when the menu said spicy, they meant spicy! The former had delicious red bell peppers in a tomato sauce, the latter a chili sauce. Highly recommend.-Dum Gosht Biryani: husband LOVED this. It's made traditionally in a clay pot, with a great sauce to accompany the rice. This tasted exactly like the biryani we had in Hyderabad. Husband ate every last bit.-Chatpata Chilli Paneer (more paneer): this wasn't as chewy as the paneer from our appetizers. Nice and spicy.We got a few sides - some saffron and fried rice, roti and paneer naan. With all of this food, we only walked away with a tiny bit of chicken and some rice to take home. The service was really great, but just a little slow. It was clear that the wait staff was attentive and was letting us enjoy our meal (which we did!), but getting the check was a bit of a process. It seemed like our servers were genuinely happy that we enjoyed our food so much.All in all, definitely go to Cardamom. It was great fun reminiscing about our recent trip to India while eating such great Indian food. I can imagine this place only getting better the longer it's open!"], ["Breall s.", "Lovely food presentation and impeccable service.The restaurant is very clean and polished looking.Didn't care for my main dish (Gosht Pasanda), which was entirely too sweet. As was the yogurt.My husbands lamb dish was spicy, but great(Gosht Madhurai) and I loved the spiced dhal on the side of our main dish.I'd definitely come back to try other things but would try to really get an idea of the flavor composition beforehand, to avoid ordering sweet things again."], ["Nidia V.", "I love this place!  Nasir is one of the best restaurant managers that we've encountered.  I want to meet the chef.  The dishes are unique while keeping the them tasting authentic.  My husband ordered the Mixed Grill:  He said that shimp taste just like lobster.  I love the combination of vegetarian dishes they offer.  The food is amazing and I will definitely keep coming back to this restaurant."], ["Lynn C.", "I've driven by almost every day since it opened and finally went in for the most fabulous dinner ever.  Service and food are excellent!  I'll have a full post up on my blog soon, but for now I'll just say it's some of the best Indian food I've ever eaten."], ["John-Doe P.", "If you're looking for the best food in Los Angeles look no furtherAnd I am talking in the in food which translated is gourmet Bangladesh Indian conjured up by a UK Indian restauranteur with multiple restaurants. The staff are well-trained the food came expeditiously and was without fault. This is a family owned and operated clean new stylish and cozy establishment that has a private table for six"], ["Nick D.", "Food is excellent quality. Excellent flavor and spice. Only reason I didn't give 5 stars is because I ordered this spicy and I am definitely not feeling the heat as I'd like to. They said delivery would be 45-60 minutes, the food got here in 28 which I was thrilled about. I'll definitely be ordering from here again."], ["Deepika J.", "Been here twice now which means it is not a bad place. I like the decor and the customer service, they have some interesting dishes on the menu that taste alright. It's not amazing but not bad either. The appetizer plate is not that great, the paneer tasted chewy and had no flavor, samosas were ok and the pakoras were too oily/not crisp. The food- chicken tikka masala, dal makhani were good.Overall average."], ["Aashish S.", "Best Indian food in LA.... Hands down... And the service is amazing. Nas takes care of you, best service and ever and that is not even the best part. Best part is the food, it is just amazing."], ["Sanaz E.", "We love Indian food and we go to indian restaurants a lot ! This restaurant was the only indian restaurant that had really fresh food! I could taste fresh ingredients and the place itself was very clean. The service was outstanding. Their food was good enough for us to definitely go back to the restaurant and refer friends! The only thing that I didn't like their was their Kheer ( rice pudding )."], ["Dana K.", "Immediately my new favorite upscale Indian restaurant. Impeccable service. Decent prices.Must get fish curry, beef vindaloo."], ["Saurabh S.", "Service with a smile. Mirch paneer naan.Daal makhani.Best saag paneer, so fresh. Owners are excellent. Celebrated a 50th wedding anniversary and they were extremely hospitable."], ["Cody C.", "Clean place. Nice concept. Food wise: meeeh Meat too hard, we had to send it back. If you like your Indian food not spicy at all, go for it. I like my Indian food super hot so Will never go back."], ["Bhargavi G.", "Have been here once last week! Already tempted to go again! Real good food and flavours!"]], "Samosa House Silverlake": [], "Indus by Saffron": [["H. P.", "One of my favorite Indian food restaurants. Everything tastes really good. Some of foods are a bit on the salty side.  That is the only thing I would change. Service is really great."], ["Maddy E.", "it's ok. nothing special. good food, good price."], ["Stephanie L.", "This is one of my favorite places to eat for lunch during the week. Service is quick, cashiers are friendly, and food is delicious and affordable, which is surprising since restaurants in similar food courts are usually average. I always order the Chicken Tikka Misala which goes great with their mint sauce. Portion size is not as big as Oleego and sometimes they don't include a lot of chicken, but it is flavorful and good enough for a quick lunch."], ["Amanda H.", "This is very \"safe\" Indian food.  If you're inexperienced with Indian cuisine, and have mustered the courage to step a toe in the water, Indus is a fantastic starting point. They offer traditional dishes, with very little spice, which always taste very freshly made.  The menu is simple; choose one or two main courses and white or brown rice to accompany it.  The naan was the only disappointment; it lacked the flavor, texture, and freshness of the real thing. Lunch is quite reasonable from $7 - $9.It's not my Indian restaurant of choice, but it serves a purpose.  I'm thrilled to see co-workers converted to Indian food by way of Indus' simple approach to the cuisine."], ["Holly H.", "Great place to grab a quick bite to eat at fig and 7th. I got the chicken tiki marsala wrap. I got it spicy and I loved it. It has a great kick to it's flavor and really hit the spot. It had rice and lettuce and onions along with the chicken in the wrap. Yummy!"], ["Kathy G.", "This place is amazing ! The food is so flavorful, I ordered the chicken curry and it was perfect the flavors were so amazing I would honestly come back again"], ["Kaitlin H.", "A quick flavorful place to grab lunch for under $10 in downtown Los Angeles. Indus is located in \"The Taste\" food court of the Figat7th plaza. It has the same menu as other Saffron restaurants downtown. The line may look long and intimidating, but moves very quick."], ["Todd G.", "My son was less than impressed by their Saag paneer and left his garlic naan unfinished (which may be a first for him!).  Nice service though."], ["Prem D.", "This place is best to have lunchMy favourite is rice n chicken tikka masala with a naan n soda combo"], ["Christine N.", "Typically food at food courts are not the best, but I am very impressed with the food here. Whenever I work in Downtown LA, it's safe to say this is my quick and easy go to lunch spot. Even the food court it's in is a very elegant area where you can catch up with friends, have meetings, or even just eat by yourself. The entree I order the most is the chicken tikka masala although I have tried other dishes such as the chicken curry and chicken daal. The chicken tikka masala is my favorite but don't get me wrong, the other two are equally as delicious. The chicken is very tender and the sauce goes perfectly with the chicken, the creaminess and flavor are great. Another great thing is that they offer brown rice without the extra fees, like many other places. Even when you don't want to order the platter, the bowl will still keep you stuffed for lunch. They also offer a very interesting mint sauce, it could be a hit or miss for many people, but to me, it is a hit and I love adding it to the meal."], ["Pam R.", "Came here the other day. I got the combo for about $10 and it was pretty good. The sauce on the side of the counter though... the spicy sauce isn't playing around!"], ["Maral T.", "And the winner is....Chicken Tikka Masala.The cucumber raita and mint chutney complement this dish nicely. Love that they have a brown rice option at no extra cost."], ["Downtownbaby T.", "It's not authentic so don't expect it to be--my gripe is that the burrito style that they offer here is just not good.  I prefer the plate with a side of garlic naan and lassi.  I wish that the servings were a little larger but it's probably best that it isn't.If you like spicy, the sauce that they serve in prepackaged containers are spicy and flavorful.  They serve relatively fast (certainly not as slow as Melt or Juicy Lucy), the meal is hearty and tasty."], ["Ryan T.", "Quick-service Indian places don't usually succeed - likely due to a combination of greasy/stain-likely sauces and heavy food combinations - but Indus seems to have a good formula. The menu is short, sweet, and moderately priced. I got the chicken tikka masala bowl, which is their best seller. With a meal purchase, you have the option to add naan (regular or garlic) and a fountain drink (unlimited refills!) for $1.95. That's a great deal in an upscale food court. My whole meal cost just under $10. Everything was tasty and extremely well packaged.The cashier was very friendly and did a great job explaining the menu. She even automatically offered to refill my drink while I waited at the counter for my food."], ["Kevin L.", "I've tried the wrap as well as the tandori chicken + curry. I always tend to get chicken tika masala. The service is great and the food is very tasty. It's located way inside the 7th and fig mall, and I am glad I've stumbled on it. I wish there were just a little bit bigger portions, but it is definitely worth the four star rating without."], ["Christina H.", "what i ate - chicken tikka saladthis is a solid, quick lunch option located in the TASTE area of Fig At 7th (lower level food court below City Target). counter staff was friendly and quick. prices are all very reasonable and you can easily get out for around $10. the chicken on my salad was really good. seemed cooked to order, right off the skewer and with a nice mild curry flavor. the rest of the salad was a little bland though (just lettuce and a few slices of cucumber). it could do with some additional components- tomatoes, carrots, etc. also the ginger soy dressing was incredibly sweet and struck me more as a syrup like marinade than salad dressing. the naan was hot and delicious. and i also enjoyed the mint sauce and yogurt / raita that came with my meal."], ["Shannon V.", "A new favorite!  I love this food! I can't say that I've ever really eaten Indian food, but I'll be a regular at Indus!  Even my super picky eater of a husband says the Tandoori Chicken rivals his favorite, Chicken Kabob Kitchen.   He doesn't go for the saucy stuff, so although I liked the Chicken Tiki Masala, he wouldn't try it.  I loved the flavor and the chicken was super tender.  BUT..... drum roll please...... a flavor I will be craving from now on is the ...... PEELI DAAL!!! Wow!!!  This looks like a mushy mess, but the flavors and textures of this mixed lentil dish, are just amazing.  I had it with the masala and salad on my first visit, but the second visit when I got the Tandoori chicken for my DH, I got it over brown rice.  It was rather heavy on the rice and light on the Daal, but I gobbled it up like a fiend!   It also seems very healthy.  He loved the Tandoori and when I ordered the naan, they loaded it right fresh into these huge tandoori ovens. Everything was super fresh!!  And the people were very friendly, not to mention you can watch the oven action through the giant windows!The veggies that come with the Tandoori Chicken are AMAZING!!  Loaded with flavor, we kept going, \"what is that!?!\"  And the veggies were not just a bunch of peppers and onions; it was loaded with zucchini and fresh broccoli!!  I love that no matter how much I eat, cook, shop, visit friends, I'm still discovering new food, flavors and cuisines.  OH! And the \"chutneys\", one minty and one spicy, also pack a flavor punch that takes the food to a whole different level.  My Gold's gym visits now offer a flavorful end!  Thank you Indus, a welcome new neighbor!"], ["Preston A.", "Great option to get your Indian fix in the Bite foodcourt at the bottom of the 7th & Fig Plaza.  They even have legitimately hot sauces.  One mint chutney and a spicier red sauce, to which you can help yourself.  Need something to quell the burn?  Try the $1 side of mint raita. Word on the street is that the naan is delicious, though I haven't tried it myself.  The samosas were quite good.  Moist on the inside and crispy on the outside, with nice seasoning.  The chicken tikka combo hits the spot.  You get a huge piece of white meat.It's a bit pricey for what is essentially take out, but the food is quality and the portions are generous."], ["Sirinda S.", "It's great to have a \"fast food\" style Indian place in downtown LA.  The food is flavorful and fairly well priced (although it's still over inflated downtown pricing).  The menu is a bit limited, and you can probably eat your way through the menu in 4 visits.  The chicken tikka masala is my go to dish.  The naan is made fresh but a little too buttery/oily for my taste.  A surprise standout is the tandoori vegetables.  They're tangy and flavorful, although how tangy and flavorful they are appears to be inconsistent as I've had them several times and they've been slightly different each time.  I also wish they'd include fewer filler veggies like bell pepper and onions.  I like that they're open until 8 or 9pm and will definitely make Indus one of my regular places for a quick, hearty, and flavorful meal."], ["Linda A.", "This nice little find is located in the new downstairs foodcourt area called \"Taste\" just adjacent to Target. We arrived at 11:40 and there was already a good line forming- rivaling the Korean BBQ place right next to it. While in line I was handed a take away menu card with descriptions and pricing. Good thing too- forgot what was in a Saag Paneer.  (blush) Anyway, just about everything is priced under $10 which is quite refreshing for Downtown L.A.  It's a small menu of bowls, platters and wraps and they have a nice iced Chai tea too. The smells coming fromt he kitchen were quite nice- not greasy smelling or heavy overpowering curry aroma.  As I got closer to the cashier, I could even smell the light scent of basmati.  Ahh nice.   Counter service was quick and cheerfully given and when I asked why there would be no Naan until Friday, (there was a little sign on the register) I was told very apologetically that they had just opened today and that the bread ovens weren't working yet. Bummer- that's a key item but I suppose I could live without extra carbs anyway. (This is the only reason I took off 1 star) I got my food and took a small cup of an orange spicy sauce (forgot the name) that was labeled VERY HOT.  So I put a little tamarind and mint sauce in too just in case it was really true crazy hot. Later discovered the VERY hot wasn't.  Yes it had some good heat but was really enjoyable.  I dug into my Saag Paneer and was very happy with my choice. Nice sized portion with a good amount of paneer - cut into nice small chunks and not overly done sauce. The rice was fluffy and tasty too. A good choice for today's cool crispy weather.Will definitely come back and try the Peeli Daal and Channa Masala and maybe a Samosa too."]], "Badmaash": [["Candace L.", "Badmaash is AMAZING! Everything I had in my last visit was OMGOODNESS GOOD! I couldn't stop saying how tasty every dish was! I've been twice so far and it was just getting better and better. Plus, the service is top-notch an decor is super cool, not at all your typical mom n pop Indian restaurant. Indian food & Beer gets an A+ in my book.The decor is really nice and 'hip', it's a small space but it's two stories. The upstairs dining area is definitely a little more private and not as loud in my opinion.However, I'm sure you'll enjoy the food wherever you're sitting.ROSEMARY NAAN - sosososo good! The rosemary is really aromatic and definitely enhances the food!PUNJABI FISH-FRY - super flaky, the sauce is yummy and not overpowering. A good starter to share.BADASS CHICKEN TIKKA - holy moly, I think this was my favorite so far. The chicken was super juicy and flavor was on point! Everything about this was good! It had a slight spicy kick at the end of each bite. I loved eating this with their basmati rice. Definitely would recommend this!SPICED MANGO PORK BELLY - I'm always on the fence about pork belly because I'm not too fond of fatty parts, but man oh man this was good. It was super tender and the sauce was sweet and tangy.SWEET AND SOUR PUMPKIN - I'm not huge on pumpkin at all (unless fried) but this was great. The consistency and flavor was good.. it wasn't actually sour though.. seemed a bit more sweet to me with a nice little kick you can taste.DADI-MA'S BLACK LENTILS - I really liked the consistency of this.. wasn't too grainy but not overly cooked. This went great with the naan!LAMB CHOPS \"CHAAMPEY\" - I don't like lamb, at all. BUT OH MAN THIS WAS GOOD. The lamb wasn't gamey at all (until the very end when I had too much). It was cooked perfectly! The cream sauce they have was sooo good I couldn't stop dipping my naan in the sauce. For any lamb lovers out there, this is for you!Overall, this place is just great and would definitely recommend any one craving Indian food to stop by."], ["Douglas I.", "Tiny place, decor is nothing special, has the vibe of a fast casual restaurant. Two of us, seated upstairs since no reservations on Thursday night (that's fine), but tables are so close that there's zero privacy amidst the cacophony of voices. Service was fine, if a bit rushed with the clearing of plates. Let it breath!Went \"down the middle of the road\" with butter chicken samosas (tasty, but worth $4 each? no), chicken tikka masala, and saag paneer. Chicken tikka was more like a stew than sauce, nothing special. Have to say the saag paneer was among the tastier I've had, though hard to pinpoint why (fresh spinach?). Rice was nothing special and an add on, which seems cheap. Bill including one $7 beer was $59. Would I return vs. trying another Indian destination? Probably not."], ["Steve R.", "I wasn't blown away by the food that I got here, which is fine and somewhat expected in a local Indian restaurant, but I was a little off-put by how expensive it got to put a meal together.  A samosa here, some naan there, and all of the sudden your bill is quite pricey.  I got the \"badass\" chicken, which it definitely isn't.  I don't know why that dish is highlighted...definitely a skip.  I'd actually love to try some other things on the menu that I didn't get to...like the poutine or the lamb burger or the mango pork belly...but we'll see if I make it back due to the pricey nature of it.  I think the chai tea at the end of the meal typified the experience here.  Indian street-style chai is one of the main attractions of visiting India, and I've been craving it since my visit there.  The chai here was a noble effort, but didn't seem to really come close to what it purported to be.  I figure if you're going to charge a premium in all respects of the menu, I'd like to see the cuisine \"nailed,\" and I think they fall a bit short of that."], ["Seta A.", "How wonderful is Downtown LA food scene & eateries becoming! Lucky for us Angelenos!I loved loved this small two story hipstery with somewhat modern take on Indian food restaurant! Grubbing at its best. Great service included! It gets crowded so call ahead, or just enjoy people watching while you wait. I can speak volumes on how fun it was ordering Indian food with modern settings all the while food being served in traditional very authentic take in tin silverware and dishware! Can you picture that? Awesome!Order what you wish, you will love. Just leave room for the mango pudding/cake!"], ["Steve C.", "The servings are pretty small but the flavor definitely makes up for it.Definitely get the pork belly even though it's $16 for 3 small pieces. I loved how the Chicken Tikka Masala had a kick and spiciness to it that you usually don't get at other indian restaurants.This is a very small restaurant, come early as the wait can get long, and there isn't many places to sit. There is also little to no parking in this area, plan to pay for a garage or park a couple blocks away."], ["Vickie S.", "If you're expecting good Indian food, this place serves it. But if you're like me and expecting good Indian \"fusion\" food, you'll be bit disappointed. I came in expecting a unique dining experience since I've only had Indian food at more traditional restaurants. I was excited to try a trendy \"gastropub\" serving Indian-inspired flavors. Guess I should've studied the menu more carefully. The food is more traditional than \"new American\". We ordered the fried catfish (6 bite size pieces), traditional samosas (they are $4/piece), butter chicken, lamb vindaloo, masala poutine, mango pork belly, and some naan/rice. I have to say that the fry on the catfish and samosas are perfectly crunchy. The butter chicken and lamb vindaloo definitely have the bold flavors and Indian spices, but both were lacking in sauce. I wish I had more sauce to dip my naan. The masala poutine was good, but it tasted like normal poutine with some chicken. The pork belly was my favorite dish of the night, but the mango sauce was very faint and again, I couldn't taste the Indian fusion. There were two flavors of naan - plain and rosemary. Both had good textures, but again, where is the fusion? The restaurant is small with two floors and it actually smells more fragrant outside than inside, which is a plus for me. The decor is minimal and has a very casual vibe. The prices are kept low, but so are the portions, especially the appetizers."], ["Garen A.", "A truly great Indian experience in the heart of Downtown Los Angeles! Badmaash has been on my DTLA bucket list for quite some time. They intrigued me with their blend of both traditional and experimental Indian foods. We had:1. Classic Butter Chicken: Great flavor and wonderfully dipable (which is big for me)2. Tandoori Broccoli: It's an interesting concept, and the execution is nice, but there's just nothing remarkable about this dish. 3. Ghost Chili Lamb Vindaloo: A great dish, with just enough kick. I really enjoyed this one. We supplemented with Rosemary Naan and some plain rice. All in all the experience was definitely great. The wait staff is attentive and informative. I will say the space is kind of small, so make a reservation and be prepared to be quite close to those around you. Stay Cheerful ;)"], ["Theresa N.", "A very cool vibe! I love the movie they showed over hip hop music. The service here was on point, sometimes annoying that they kept asking how the food was.The only thing I dislike here was the pumpkin soup..just awful"], ["Justin O.", "Fairly small little spot but just follow your nose :) Inside is also pretty cozy with an upper level for additional seating. Service was pretty quick and I ordered a few apps and drinks + entrees. Mango lassi was tasty but was missing that little sour kick / spice that I'm used to from eating at Punjabi Dhaba in Cambridge. The butter chicken samosa was solid and had a lot of meat for a samosa! The 2 bite fish fry catfish was buttery and juicy. The sauce really paired well. Finally got down to the ghost pepper lamb and I have to say it definitely had some heat. Very tasty for me but I was a bit hot haha. The waiter actually ended up hooking me up with another lassi to help out (so cool!) so that was awesome and saved my tongue. Only thing that didn't really impress was the naan. I wish they had a good garlic naan that was buttery and light. Rosemary naan tastes the same as just naan.Overall great experience. Next time I'm going to have to save space for dessert.See you guys soon for sure!"], ["Vy T.", "I normally don't eat Indian food, but I saw a few pictures of their poutine on IG and it looked amazing! I stopped by with a few friends on a Friday night and it was pretty busy. Shout out to Knuckles, who got us a table to accommodate our group!We ordered a few entrees to share amongst our group. We started with the chili cheese naan, the butter chicken samosas, chicken poutine, and the spiced mango pork belly. The samosas was my favorite appetizer of the night. Crunchy on the outside with a creamy butter chicken filling. It also came with a cilantro dipping sauce that I loved! The naan was super soft like a pillow. but I didn't really taste too much of the cheese. The pork belly was another favorite of the night. It came with a  sweet mango sauce, and who doesn't like mangoes. The chicken poutine was yummy! I liked the cheese curds!Onto the entrees, we had the butter chicken, the chicken tikka masala and the ghost chili lamb vindaloo. We also ordered a few orders of rice to share, each rice portion is good for 2-3 people. The butter chicken and tikka masala was delicious and creamy. The lamb vindaloo was pretty spicy, so if you like spice its perfect. Overall, a great spot for a modern take on Indian food."], ["Lisa H.", "Came here with a group of four around 6:30pm.  It was kinda busy, but we were lucky to get seats right away.The taste and quality of the dishes are quite good.  We ordered the butter chicken, chicken tikka poutine, and the pork belly.  And of course, regular naan and rosemary naan. The butter chicken was flavorful, but not overwhelming and the chicken was moist. As for the chicken tikka poutine, those are some of the best fries I have had in a while.  It had a good crisp to them. I enjoyed the pork belly the most.  The sweet and tangy flavor along with the soft meat really brings in all together. As someone mentioned here, I agree that the menu is a bit small and lacking in variety, but they still do have a nice selection of dishes.  And yeah, it's also a bit on the pricier side of things. The portion sizes are just slightly on the smaller side, especially for the price you pay. Overall, the ambiance was neat, food good was good, and service was friendly and efficient.  Parking... well, not great."], ["Brandon S.", "We finally made it here for dinner. The main floor is a small space, but there is additional seating upstairs. The decor is cool. Our food came out very fast.We were sat right away. The entire time the staff was friendly and quite helpful. It is pretty much a small plate style, so we ordered several items to try. For sides we ordered the Aromatic Basmati Pilaf and the butter Naan. The rice had good flavor and complimented some of the other plates well. The naan, bread, was great. It tasted very good.For our plates we ordered the Badass Chicken Tikka, Chicken Tikka Poutine and the Spiced Mango Pork Belly. All three were very good. My favorite was the poutine. Fries covered in gravy and topped with meat is almost always good. It certainly is here. Of course pork bellies are always good, and theirs has a great spiced mango flavor. The chicken tikka also came through nicely with the flavor.For dessert I tried the mini ice cream sandwiches. These were great. They use Parle-G biscuits. The ice cream is good, but the biscuits are what make these great. They have excellent rich flavor.Overall this was a great experience. We received good service, food and value."], ["Annie L.", "I came here for a birthday dinner so we went off a pre-fix menu! I believe there were about 7-8 items I actually consumed that night, but I will just write about the ones I remember. 1. Chickpeas and ChipsPersonally, I didn't like this dish very much because I didn't like the texture of the mashed chickpeas. The chickpea mash was also kind of bland. 2.  Chicken SamosaThe best way I can explain this is that it kind of reminds me of a fried wonton filled with bbq chicken. The chicken was moist and dressed with a flavorful bbq sauce. **I also manage to try a bite of the regular potato samosa and personally I think it was kind of bland for my taste. 3. Chicken Tikka PoutineBeing a fan of poutine, I was super excited when I heard that this was on the menu. However, the taste was just ehh for me. The fries and gravy sauce were both salty creating a SALT OVERLOAD on my palate. But the actual meat and cheese were delicious though! 4. Chicken Tikka MisalaThis dish was my favorite of the night! The meat was super tender and delicious. I think I could of just scarfed down the sauce with a side of naan by itself. IT WAS THAT GOOD!Service:Service was spot on! Our big party was seated in the upstairs area and there were actually servers that constantly came up to check up on us! Final Verdict: This was my very first Indian dining experience and I am pretty sure it will not be my last!  Definitely going to give this place another shot and maybe next time I will be more adventurous and try something new!"], ["Rachel D.", "It is a rarity that I dine out for Indian food, and even rarer that I am impressed. But Badmaash is an exception. Located in trendy DTLA, Badmaash appears to be a little hole in the wall establishment very easy to walk right past if you're not paying attention. Honestly, it's not very impressive once you're inside. There is a small dining room with a counter serving about 6 tables, and a small top floor. The decor is clean albeit simple, nothing fancy. However, the food. The food is absolutely delicious, but even more than delicious, it is interesting. The flavor combinations are traditional but with a kicky modern flair.I came here for Dine LA, so my  review is based off of their menu:Summer Corn Gazpacho:A refreshing summer soup! Perfectly pureed and garnished with summer corn and cucumber. It was mild but tasty. The portion size was hearty for a tasting menu!Pickled Beet Salad:This was the first time in my life I ever truly enjoyed a beet. The manager came out to our table and talked to me while I was eating the dish, and he explained the pickling process (he was super nice!). You can taste the passion they put into their food in every bite you take. Another refreshing summer dish, the chopped salad was garnished with a yummy avocado puree.Matar Paloa Somosa:Perhaps I made a mistake not ordering the butter chicken somosa...However, when I pay 4 bucks for a somosa, I want it to be kick ass no matter what it is stuffed with! And I definitely don't want it to be greasy or to be wishing I was eating from the my local tandoori to-go spot. I really expected much much better from an establishment of this caliber.Main Dish:Butter Chicken with rice and Daal:WOW. Just Wow! This chicken was bursting with spices and flavor. Loved the gravy! Rice is rice, but the daal was the best daal I have tasted in my life. No joke. It was a very modern take to it, as it was not just purely lentils, but pretty chunky and seasoned perfectly. I could eat this dish for every meal.Fish in curry with collard greens:This dish was better than I expected. It was white market fish cooked perfectly. So moist and flavorful. The curry sauce and collard greens were delish, but the highlight was the pickled onions. I have never had an indian dish quite like it, but all of the elements worked together and it was quite easily one of my favorite fish dishes I have ever had. Dessert:For dessert they served us these cutie little ice cream sandwich cookies.A simple sweet treat to complete an adorable and memorable meal.The charm of Badmaash will bring me back just as much as the yummy food. From the Sari tutorial served with the meal to the tongue in cheek cheesy bollywood puns, this unique little eatery will have you smitten before you sink your teeth into your first naan."], ["Ariana R.", "Great experience for a first time Indian dinner in DTLA. First, when you walk in you immediately notice the small yet unique venue. Was greeted by Nuckle (pardon my spelling) who handled the table. He originally was going to seat us at the high top stool seating but then moved my boyfriend and I to the table-boyfriend hustled. Great service and really homey feel. I suggest to everyone that this isn't your average Indian family restaurant this a hip and new concept of the newer generation making something great.I will be back"], ["Ken K.", "A friend recommended Badmaash for dinner this past weekend, so I made reservations for 515pm (though that wasn't entirely necessary since they open at 5 for dinner and the restaurant is fairly empty at that time).I found metered (street) parking about a block down. I think you'd have to valet if you're not so lucky with finding a spot.I never noticed this restaurant when driving by. It's small, but fairly trendy inside. There is an upstairs section, though I didn't see it since we were seated downstairs.My friend had already ordered the Indian Pickles appetizer, and I was glad he did. This isn't something I would normally notice on a menu and order, but it was freaking delicious. I had never eaten pickled mushrooms before, but I couldn't stop eating these; I probably could have eaten 50 of them. The other veggies on the plate were good as well, but I sure loved those mushrooms.Of the three other dishes we ordered, my favorite was the Spiced Mango Pork Belly. The pork belly was cooked well, and that mango sauce was fantastic. I scooped up every last drop of it.The Classic Butter Chicken was my second favorite. The chicken was moist and the sauce had just the right amount of creaminess to it. Perfect for the chicken and perfect for dipping naan. Speaking of naan, the Rosemary naan was awesome. My friend really liked the Good Ol' Saag Paneer, but I wasn't as big a fan. I think it's an acquired taste, but the flavors were a bit over the top and bitter for me. But to each his own.I'm already looking forward to future visits so I can try the Lamb Burger, Poutine, Eggplant, and Chili Cheese Naan. I'm sure I'll try other things as well.Prices were a bit high in my opinion, but the quality of the food did not disappoint. And service was on point. Solid place for a slightly different take on Indian food."], ["Candace L.", "Badmaash came as a recommendation from a friend, which I love! I didn't find them on my own, or bookmark them on Yelp prior to this, it was strictly old fashioned word of mouth about good food in DTLA.My boyfriend and I had a 6P rezzie to grab dinner here before an 8P performance at the Ahmanson. I was a bit worried we were pushing it since we'd be driving from here to there, but not even close. We arrived very hungry and I was of course a bit agitated from sitting in traffic on the 101 all I wanted was a cold drink and food ASAP.Service was great! We were greeted and immediately taken upstairs to our table. This is definitively a hip eat - my first time having Indian while a bit of Biggie, yes Biggie, The Notorious B.I.G. plays over the sound system at an Indian food restaurant. Was I loving it? Of course! Was my boyfriend? Probably Not. Did I care? No. ;)We ordered up two samosas right away to get something to the table, one traditional and one butter chicken. I think I preferred the traditional and was very happy with the side chutneys. These come one per order, so you'll probably want a few at least. They didn't have the Thanksgiving samosa we saw on their online menu so that was a little disappointing. We glanced over the menu and I really wanted to have something a bit different than the same stuff we always order when having Indian and what better place to do that at than here?It may be a little lame to start with the Butter Chicken but gosh it was good! I love that their menu describes this dish as \"Indian Wedding Classic\" and although we aren't first timers to Indian we tend to order like we are.I also could not pass up the Chili Cheese Naan! I normally wouldn't be this experimental with a good thing but I love Serrano chilies and cheddar cheese so why not? It was delish! We could have stuffed ourselves silly and ordered two of these but one was completely satisfying paired with a delish yogurt dip and the rest of our dinner.I was all set to order the Chicken Tikka Masala - b.o.r.i.n.g!!! but thankfully my boyfriend spotted the Chicken Tikka Poutine! He reminded me that we had learned of this dish last year while in Vancouver and it was a Canadian thing! Fab, bring it on!We skipped on the Masala and ordered the Poutine, sooooo good! Very rich, but very tasty (two of my fav things ;). I mean can you really go wrong with cheese curds AND gravy? I think not.We ordered a side of rice to dish the butter chicken over and things were delightful.The food came out so quick which was really nice since I was a little concerned with timing. Not an issue here at all, everyone's dishes were coming out of the kitchen super quick.I of course could not skip dessert but after ordering the chocolate pot du crème I realized I could have. This was the only item I wasn't happy with and later wished I would have tried the ice cream sammiches. The serving dish which this item comes in is also a bit odd and makes scooping out the dessert a little challenging. I'd say skip this item, I've had too many awesome budinos that this little pot of pudding just failed in comparison.The small chai was sooooo good and a perfect finishing touch to our meal. I almost wanted another.They also have a beer and wine menu, which I passed on this evening but always good to know.I would definitely recommend this place if you are open to a fun environment, and great food! If you're looking for the more common Indian sit down meals in town, this is not it. I told my boyfriend it was actually really nice to enjoy one of my favorite foods in a completely different atmosphere than what we are use to when hitting the spots we do for Indian. Staff were all very friendly. Looking forward to returning when in the area.Parking - we parked blocks away on Main I think it was, at a meter which is free after 8P and walked around the corner to Badmaash."], ["Andrea V.", "They have a fair amount of options on their menu. I found this place to be average based on their dishes. Some were really good and some were just okay. I had good company (we celebrated his birthday here) so that was nice at least. Butter Chicken - This dish was average. It wasn't bad, but it was not great. I have had better butter chicken dishes elsewhere. I actually had a few bites with bone or something hard in it that I had to spit out. That's a little bit of a turn off for me!Eggplant Dish No 3 - This was my least favorite dish of the evening. It had a weird sauce that came with it (covered in it, actually) that really put me off. It was a weird combination that just did not sit well.Chicken Tikka Poutine - This was easily the best dish. They did a pretty excellent job putting it together. The cheese curds went so well with the fries. And the chicken in the poutine was very tender (and no tough pieces like the butter chicken).Parle G cookies with ice cream - very tiny, but decent. It seems like something you could easily make at home for about 10% of the cost at the restaurant. Maybe their ice cream is homemade? I'm not too sure...Another one checked off the list!"], ["Jackie M.", "Not authentic at all. Portions are ridiculously tinny. I asked for spicy food and they said we don't make spicy. Correct me if I am wrong but Indian food is known for spicy. I asked for nan with garlic they didn't have that they had chili cheese nan tasted like a quesadilla from Taco Bell. The place is super cute and has great service. However it's far from \"Indian\". Will not be coming back."], ["Lenny K.", "Rachel E's boyfriend suggested I check this place out.  He utter three phrases that really got me considering:  1) Indian gastropub 2) Chicken Tikka Poutine 3) Butter Chicken Samosa.I went during lunch hour on a Friday since I was in DTLA for something else.  First thing, parking situation is awful.  I'm rarely downtown during the week and it's $5/hr at the meters.  W T F.  -1 for an awful location and parking situation that results from it.  There was a little time on the meters so I dropped in an additional 30 minutes.  My friend says it's pretty fast so I figure 40 minutes total time will be enough.I get to the place and even though it's busy, they were able to seat for 1.  Since I'm in a rush (I've got 35 min on the meter by this time), I was glad they were able to accommodate me immediately.  Prices a little higher than I was hoping for ($4 for ONE samosa, $12 for the Chicken Tikka Poutine) but whatever, if it's worth it, sure.  I placed my order, took a phone call from a client, then by the time I got done, the samosa arrived.  The samosa itself was good, served with a tamarind and mint chutney.  Except that I ordered a butter chicken samosa and they gave me a potato & pea samosa.  I took another bite to make sure that they didn't stuff it with the butter chicken as well but nope, it was definitely the wrong one,  The waiter apologized and took it away.  The chicken tikka poutine arrived shortly thereafter.  For the record this is the first time ever I've had poutine (that I remember) so I was looking forward to it since Canadians will never stop talking about how awesome it is.  First thing about this, the chicken was some of the best tasting, best cooked chicken I've ever had.  It was DELICIOUS.  The masala fries they were served on top of were meh, as was the gravy and cheese curds.  I like bold flavors and aside from the chicken, there was nothing savory or bold with the rest of the dish.They came back with my butter chicken samosa and apologized.  I took a bite and, I'll be honest, I was expecting a flow of butter sauce to flow out of there like lava.  It didn't, it was somewhat dry but it was still really good.  I devoured it pretty fast and wished it wasn't $4 per samosa or else I'd order more.The staff apologized for the mixup on the samosa and offered a complimentary dessert to makeup for it.  I wasn't even making a big deal out of it, the potato and pea wasn't bad, just not what I ordered so for them to offer me a makeup for something I considered very minor is a plus.  I would've taken them up on the offer except that I had 5 minutes left and told them I had to go.  Got back to my car with negative one minute to spare.  Luckily no ticket."]], "Bombay Grill": [["F H.", "Most delicious Indian food prepared lovingly from the sweetest most kind family you could ever meet. The food is outstanding. I have been eating at The Bombay Grill for over 20 years and every meal a masterpiece. The prices are extremely fair and the orders are The Chicken Tikka.    5 StarsTandoori Chicken.   5 StarsChanna Masala.       5 StarsNaan.      5 StarsIt's all good!!!"], ["Irina S.", "I get takeout from this spot at least twice a month, and the food is, by far, the most delicious Indian fare I've ever had. You don't even know how good this place is until you've gone elsewhere and felt totally underwhelmed and disappointed. It's a family run spot, and again, I can't say enough about the food. The chicken tikki masala is the richest, most creamy delight I've ever had, and I grew up on rich and creamy Russian food. The mango chutney is hand made and chunky, and clearly doesn't come from a can/bottle. My only gripes with the place... 1) the takeout/delivery takes forever, especially since there is rarely anyone in the actual restaurant. It's worth it though, so whatever. 2) the parking lot is a bitch. It's on the corner of two busy streets, though, so that's to be expected. 3) the ambience. It's really pretty gross. The place is clean enough, but I wouldn't want to actually eat there. The baby yellow walls and sparse Indian decor is nauseating, the television is always playing loud Indian shows and the freezers are in the dining space, large and guady and full of God knows what. It's just not a comfortable place to eat, but that's why God invented take-out/delivery. Oh, and 4) this place is not that cheap, but the food quality and quantity is well worth it. Looking forward to the next cold, rainy day to indulge in some bomb indian comfort food."], ["Mingus M.", "We used to frequent this place back in the day when they were by Trader Joe's in this old but interesting plaza and to keep up with the Ritz's, the said plaza is being demolished to make way for more glitzy chain stores & Whole Paycheck Foods.The owners tell us it took many years to resolve the lease situation and search for a new location but we are so glad they did cos we were experiencing withdrawal from the delicious food! Anyone who eats here and say the food's not good or authentic is just... a rookie. Strike up a conversation and you'll see these are good people trying to make great food for their customers. Through the years we have brought numerous friends here and we are all return customers.You can ask to watch him, the owner, cook your meal just to your liking. Admittedly the chicken tikka masala was too sweet the first time I had it so when I told him, he invited me to watch him make it with half the sugar and it was perfect. Now he knows how to make it exactly like I want it each and every time. Ahh, the perks.Thing is, you too, are in on the perks. Imagine delicious Indian food cooked from scratch at your beck and call. And owners who are as passionate about their customers as they are their craft. It's a win win situation for everyone. To this wonderful family run restaurant, we salute you and hope you guys stay here forever! I'm putting in an order of vegetable korma and garlic naan now for my lunch tomorrow. See you then."], ["Dionne M.", "I don't know who came to this place and didn't feel transported to India. the food is amazing and the service is always top shelf! these are the same people who once had a restaurant in west Hollywood next to trader Joe's and I am soooooooo happy they r back! I brought my friend here who is from India and he said the food was so good it made him home sick. I don't understand the 1 star reviews but this place is amazing, I promise. veggie Samosas chicken tikka or the curry. omg omg omg,"], ["Matt A.", "This place is great. It's probably the best Indian food in Hollywood and the folks that run it are super friendly. Delicious options for vegetarians. Don't miss the Chana Saag, Malai Kofta, samosas, and of course, the garlic naan."], ["Thomas C.", "Really great! Friendly and delicious and gonna keep it short... come here! In Hollywood, and despite a few random fame-dropping, chicken heads, \"oh, I know Madonna,\" blah... the ambiance, food and family are all authentic, fun and adventurous!A great Indian place!"], ["Amy P.", "This place has over 4 stars on yelp for a reason...it's INCREDIBLE. This is hands down the most authentic Indian food I've ever had. From the way it's served on a silver tray, to the Indian music, to the spices and flavors, it's all perfect. Note: when you pull up to this place, it looks like a hole in the wall...but don't be deterred! It's the best. I ordered the vegetable samosa for the appetizer, and vegetable masala with the added bits (I can't remember what it's called, but you can upgrade and they give you two sides, naan, and rice). The samosas were Devine. Fresh dough that was just fried filled with potato and peas with a wonderful curry and cumin spice. In addition they brought out two sauces to put on the samosas, and they both were so tasty, I just smothered them in both. One was bright green and one plum colored-- both cold, like a pickle chutney. My main course was fit for a Queen. I only could eat about half. I recommend if you upgrade, sharing. But I didn't mind because now I'll have delicious left overs :) the vegetable masala was sweet and rich and spicy. The chef put the spice on the side, and I'm glad, because the spice level was good for me without addition. It was a medley of carrot, cauliflower, and peas in a creamy tomato sauce. I couldn't stop consuming it. The sides were a spinach and chickpea mix, and a mashed chickpea sauce which I dipped the fresh naan in. It also came with a cool cucumber yogurt, which really cut the spice if I was feelin the heat. I definitely will be back here. I think it will become my go to cheap dinner. And they're open late, so that's even better for my schedule.  Bottom line, eat here! Don't. Second guess, just do it!"], ["Corey B.", "I've had indian food before from a friend's house and  from that day I decided that Indian food is my favorite food above all others. And Bombbay hasn't disappointed. I tried the chicken coconut curry and my girl got the chicken tikka masala. They were both graciously delicious. This was my girlfriend's first time eating Indian food and glad that I chose the right place here in Hollywood because she really loved it too. The chicken coconut curry had real good flavor to it. The whole thing tasted exotic and had a good range of chicken, potatoes, and vegetables. The sauce was full of flavor, could really taste the different spices. It went really well with the rice. Real taste of the tropics.Enjoyed the way they presented their cooking on metal plates and cups, felt more authentic. The price is fair and for what you get, its that much more better. Thank you and we will be back again!!"], ["Crista R.", "I work super close to this place so I've had the chance to A B this spot and the one on the other corner a few times... I gotta say this place is pretty gross.   The first time I ate here, the palak paneer was extremely bland and the paneer was actually rubbery. Thought maybe that's just not the right dish to get there and ordered another time.  On the second go at this place, the masala sauce was really awful, super sweet and it seemed like it was made with some sort of pre made tomato base. In short, it tasted kinda like a fast food version of Indian food that. Maybe the cheapness of the price is reflected in the quality? Whatever the case, I'm not going back. And I really wish that it was better so I could share a good experience."], ["Matt D.", "This place is amazing! A few friends of mine who were over for the weekend went while I was at work. When I got home I could smell the Indian spices floating around my apartment and I immediately asked what they'd gotten themselves into. I was treated to some of the leftovers which were still fresh and warm, and I was IMMEDIATELY hooked. They had some of the garlic naan, tikka masala chicken, and the vegetable dal. Each had their own distinct flavor, each was simply delicious. Although I could go on about the leftovers I had, this review is about the lunch special I just picked up. I was determined to try it again.It does look like a hole in the wall as others mention, but don't let that stop you from peeking in. When I pulled up it was pretty empty (a Friday afternoon after all) but they greeted me kindly and were just wrapping up my to-go order. They had good tunes blasting which really topped off the authenticity of the space.Although I got the lunch order it weighed a ton. I had a grin from ear to ear as I toted it back to my place. I could tell it was fresh because the entire order was literally too hot to eat, so I waited with anticipation for it to cool down a bit. I grabbed the tikka masala chicken and the regular naan. The chicken is incredibly tender and the tikka masala sauce was just as good as the last time I had it. The naan is perfectly baked to be crispy on the inside with lots of fluffy parts on the outside. I eat a lot and I could only finish half, so it's bundled nicely in my fridge for round 2 later tonight. A really good deal for the price and the food speaks for itself. It's dangerous how close this place is to my apartment, I'll be getting very familiar with the menu."], ["Raj K.", "Worst Indian restaurant  ever visited. The place was not at all hygienic and the plates and the serving bowls were pathetic. The naans were so thick and the garlic naan was worst. On biryani serving bowl there were some traces of cooking. This is the first place were I have seen potato in chicken curry. Both the chicken curry had potatoes. On given feedback the lady didn't even acknowledge the feedback saying we will check once and in fact told that this is the first time she had heard such a feedback.None of the utensils were clean and we went to pick our own water bottles  seeing the quality of water. Never ever visit this place. The place is sic..."], ["Puneet K.", "I don't think these reviews are authentic. My friend holds a high position in Yelp here in bay area and I think I am gonna ask him to check the authenticity of these reviews! I don't think these reviews are correct and if yelp itself is going to start misleading us then the whole purpose of this website is futile.I have no idea how people are rating this place stars. This place SUCKS! I mean for real.  We ordered two dishes. Both of them tasted normally, not good not best just normal. Within 15 mins of eating I suddenly started feeling SICK! There was only four people at the restaurant at that time so I don't think they were busy. The server was a young boy who apparently was more interested in watching youtube videos than serving food. worst staff, worst food. Food is below average with worst mannered staff and most importantly if you love your health then you probably wouldn't want to go there.Please improve the quality of food and your staff."], ["Jake S.", "Really enjoyed my visit here. The food is fantastic, service warm and familiar. I cannot wait to return."], ["Teri C.", "This restaurant is run by a husband and wife team, who truly make Indian food with love! Their lunch specials offer plenty of food and are a great deal. I recently discovered their Bhindi Masala dish, and I'm hooked! Not many places offer okra on their menu, or know how to prepare it to actually be appealing, but they do it right.I've never had to wait to be seated at lunch time, although you sometimes have to be patient with the service since this is a two person team, with the husband handling all the cooking. But the quality, taste and price of the food is worth it!They are located in a busy little strip mall which can be challenging to park in. But I hope that doesn't deter new customers from discovering and appreciating this little gem in Hollywood!"], ["Nicole K.", "Probably one of the best Indian Cuisines in Los Angeles!!!!!!!!!!! Everything from the nan, to the vegetables are DELICIOUS! My boyfriend goes absolutely nuts over the okra...I like everything! The chicken, fish...lentils, vegetables .....literally everything. The owners are the friendliest people and encourage us to try new dishes when we come. We have never been let down! Generous portioning!!!!!!!!!!!!!!!!!!!! I LOVE EVERYTHING THEY HAVE!!!!!"], ["Anna C.", "This people have a gift. There food is so good. Such full of spicies, good conbinations, the most tasty bread ever. The place is clean and the people that work inside are so nice. Love small family bussines!"], ["Cynthia B.", "Best tikka masala ever!"], ["Michael G.", "I am not an expert on Indian food, but this is as good as food gets!I haven't been there in a couple of months, and I still think about it. Go there. Go there now!..."], ["Jeff K.", "The food was edible, but rather gross. The dishes we picked up had a ridiculous amount of grease at the bottom of the container, was kind of tasteless, and just generally not impressive. The place itself, though we didn't eat there, was also not very inviting. The paneer was bad, the aloo gobi was greasy, and the chicken tikka was bland. I've had better Indian food from the frozen section of the grocery store."], ["Mikaela D.", "The food here is bomb. It's up there as one of my fav Indian restaurants. You really can't go wrong ordering from the menu but a couple of my favs are: 1)the vegetable samosas which are HUGE and like heaven in your mouth. They seriously are that good 2) The vegetable korma. There are no words - just get it. 3) the garlic naan. Nom!This place is great. Do it!"], ["Robert R.", "Truly authentic Indian food. Nuanced flavors. Special. Family owned and run. Extremely sweet people. Outstanding. The best Indian food I've ever had anywhere."], ["Nicola H.", "I'm so so happy to discover that my favourite Indian has reopened. This place is just the best. The loveliest family run it, they are so welcoming and friendly; and the food is awesome! I don't know what they do to make it taste so good - but I could eat here every day! I haven't been there in eight years - but I've dreamed of it all that time. I think I ate enough tonight to make up for the eight years though! Their paneer makhani is my all time favourite - but their samosas are also fabulous. Also try the korma - yum!!"], ["Seung Eun C.", "Yay!!!!!  They are back in business. Best chicken tikka masala in toooown!!My husband was a regular customer when they were next to Trader Joes and he was devastated when they had to close.  His instincts told him they would re-open nearby someday.He was right.  They're right next door to my nail salon.The chicken masala is uh-mazing.  I cannot stop myself from dipping naan into the sauce and stuffing myself silly.  Simply delicious.The owners remembered my husband.  They said they dropped off fliers in front of our house, but sadly we never got them because we were on vacation.  She hugged me when I showed up and ordered food to go.   Such a sweet woman and her husband was equally friendly.They've only been open for a few months but she said business is picking up.  I'd highly recommend if you like masala.  My husband swears it's the best in the neighborhood!"], ["Cherie H.", "I had a great experience here.  Yes it's a bit jankie but it's Hollywood for Christ Sake!  It was clean and the young lady that served my BF and I was so sweet and accommodating.  We arrived 10 minutes after the lunch specials ended but she let us order it anyway.  I wasn't expecting much for the price, but WOW, it was generous and tasted amazing.  We had samosas, honey chicken, lamb paneer, rice and garlic naan.  My BF's lamb paneer was so good when he got up to use the restroom I snuck a few bites, sorry honey, but that sh*t was good!  This is a family business for sure and I like supporting small businesses.  We will be back!  I only wished they delivered."], ["Johann H.", "I travel to India every year and spend 4-6 months there. Bombay Grill is hands down the best Indian food in LA and maybe in Southern California! Maybe North America! I just picked up my fourth takeout order and I am so impressed that I just had to write a review which is something I rarely do.I have tried several different dishes and they have all been outstanding. Their butter masala is a trip to heaven. The Bhindi fry is transcendent. The Mushroom Mattar splendid. The kheer (rice pudding) is the best I have ever tasted. Even better than in India. The flavors here are so fresh and spectacular! How do they do it? The couple who run the place are genuinely delightful and friendly and I suspect that the secret ingredient in their food is LOVE! I am thrilled Bombay Grill exists! Don't change a thing!"], ["Max P.", "Great little place. I went there for dinner. I recommend the Chicken butter sauce. Very tender chicken and the sauce is super tasty."], ["Veronica B.", "I love the chicken tikka masala here and will eat it a million more times. Food was very hot and fresh."], ["Armen G.", "I had the chicken with mixed veg. I love it and all the people here are the best. Try everything on the menu . It's all great. I used to come to this place when it was at west Hollywood. I was passing by on Santa Monica and I saw the sign. So I went in to check and sure enough it was the same people I remember from years ago. Now I know where I'm gonna get my India food."], ["Jon L.", "Really enjoyed the lamb curry lunch special! This is a great low-key establishment. Hope they stick around!"], ["David L.", "Visited Bombay Grill tonight because of positive reviews on yelp. They were all well-founded. What a nice, comfortable place with friendly people serving delicious food. If you enjoy Indian food, this is some of the best that I've ever eaten.  The mushroom soup is a terrific appetizer - it is mildly spicy, sweet and deeply delicious. The chicken tiki masala and the chicken korma were our entrees and both were delectable. The chicken korma came in a deep brown gravy that was delicious and mildly spicy. The chicken tiki masala was sweet and had great taste.  We also had stuffed paratha and onion naan - both were exceptionally delicious.The husband, wife & daughter were delightful; great service while letting you feel like a family member just dropping in.  Highly recommended."], ["Luca R.", "Certainly authentic! Very good tasty food. I got the Gobi thing (cauliflower potatoes and pees) really good!  It came with a good naan and the spinach cream thing, which was really good too."], ["Derek S.", "Fantastic value ! Friendly family feel - your spending your money for the food ! So good - so grateful ! Do your self a favor try it !!!"], ["Clara C.", "Have tried only a few Indian restaurants and this one is ok in comparison. I ordered their chicken masala dish was super flavorful and sweet. Think the flavoring was too overpowering for me and could not finish my meal. They do give you a good portion though. Not too many people when we arrived so we got our food quickly.  This restaurant is located in a very busy area so parking will be tough."], ["Michelle L.", "THE FOOD HERE IS AMAAAZING!!! My husband and I absolutely love, love, love this place. Not only is the food delicious, but the impeccable service provided by the sweet and genuine family is simply the BEST. As you walk through the door, the aroma from the spices will get your appetite going and you cannot help but to salivate. My friends and co-workers couldn't stop talking about the food for weeks. Everything on the menu is heavenly and definitely made with lots of love. I highly recommend this place to everyone. You feel like family coming here."], ["Kenneth S.", "I've been back now 3 more times and it's fantastic. It is not the fanciest looking establishment but they have cloth napkins even for lunch. The staff is super friendly and happy to recommend something tasty. My friend had the lamb and he said it was super tasty, moist and tender. I highly recommend this place!"], ["Rob K.", "Very nice people.  The chicken tikka lunch special was delicious and a healthy portion.  Great bang for the buck!   If you like Indian food you won't be disappointed with this dish.   Looking forward to trying more."], ["Cliff K.", "I've been meaning to write a review for this place for a while, but I'm glad I waited. The first two times we ordered from here we got Chicken Tikka Masala and it was very good. Good portions and great sauce. The people there are very sweet as well. But, the third time we were very disappointed. Not only was the quality of the chicken very poor and fatty, but the sauce was the worst I've ever had; it tasted more like a bowl of milk than Chicken Tikka Masala. Perhaps just a hiccup, but a disappointment and I'll think twice before ordering from there. The people there are super friendly and kind, but if my first ordered had been anything like the last I would not have gone back."], ["Paul C.", "This place is a serious find! With the diminishing quality of my local Indian eateries I was psyched to find the Bombay Grill. The food is outstanding and the service (owners) so warm and friendly, you feel like regulars from the moment you arrive. If you like Indian food, I highly suggest trying and supporting this hidden gem. Call first for hours as they do a lot of private catering - but are super friendly and accommodating even if they have a big party going on. Don't be fooled by the sketchy corner (Highland & SM), the quality of food and service feels like it is straight from your grandmothers kitchen...if your granny was a badass chef from India. Weather you dine in or take out, the quality is consistent. Parking can be tough at times - be patient and don't \"valet\" with the ever present tranny hookers."], ["Johnny M.", "Did delivery from here and it was barely edible. Chicken was really stringy and the lamb had the consistency of the meat you find in Campbell's chunky soup. Any worse and I would have tossed it.I think some of the yelp reviews are most definately fake. There's no way anyone who's ever had Indian food wold give this place anything above 2 stars. (3 stars if you're just so nice that you never go below 3).I used to think that Yelp was somewhat helpful but lately - it's just crap. Sorry to be a downer - my stomach's not feeling well. I'll go back to Crown of India."], ["Vanessa R.", "By far, the best Indian food I've had. Great family owned business. Love the quality and service will definitely be back."]], "Crown Of India": [["Paul B.", "Won't win any prizes for decor or location, but in my book a restaurant review is all about the food. For my maiden visit recently, I knew I was onto a good thing when I found myself surrounded by twenty-four (I counted 'em) Indian diners. There were obviously two reasons for that - the terrific food and the very nice family owners.Chicken Bhuna was among my best ever, perfectly balanced with ginger, garlic and spices.Just don't expect over-exuberant, elaborate furnishings - which are often based on stereotypical cliches anyway. As Bill Clinton once said: \"It's the food, stupid\".Great authentic Indian food. Well worth it."], ["Wayne C.", "For the flavor, quality and price, this is one of the best Indian restaurants in LA.Food: F'n great! I got chicken tikka (dry bbq) and saag paneer.Location: Ghetto. There's a liquor store, pawn shop, dumpster and the occasional hooker that surround this place.Ambiance: AverageParking: up front and streetPrice: great, affordableService: very friendly, good people.I come every week and love it."], ["Katie K.", "Best Indian food in Los Angeles, hands down.  Lamb Vindaloo on point. Every time I've ordered for delivery, the food has been hot and brought to me within 30 -45 min."], ["Wendi R.", "Very delicious, fresh food. Excellent service. The environment is not spectacular outside as it is in a mini strip mall, but don't be deterred. Some of the best Raita I have had, generally, beautifully seasoned dishes.  This is great Indian food!"], ["Olfa B.", "I had chicken tikka masala and it was delicious. I am really picky when it comes to Indian Food but I can tell that I will definitely go back !Naan is good, chicken and rai sauce as well  Moreover: it's not expensive and the owners are really nice.Good address."], ["Janette M.", "Ordered delivery from Crown of India on a recent trip to West Hollywood and the food was wonderfully delicious!  I called after 10pm and they were able to accommodate our order and within a half hour the food was delivered-- piping hot, and neatly packaged, too!We had the Chicken Saag, Chicken Masala, an order of rice, and Cheese Naan.  The naan was perfectly light and fluffy.  The sauces Saag and Masala sauces were incredibly tasty with the perfect blend of spices that stood out from other Indian places I have tried through the years.  Portion sizes are large, especially for the price, and we had left overs for a few days. Highly recommended!"], ["Isaac C.", "The service here is great. The waiter was able to answer all my questions regarding the type of taste and ingredients used in dishes. Very attentive to the cusomter when it comes to water and anything else needed.It looks small on the outside but you will be surprised at how many people the place can seat. Once you walk in you immediately feel like you're at the 'Crown of India' aka Northern India."], ["Milena C.", "Best Indian food I've ever had in LA. Can't live without their saag paneer, chicken korma or chicken coconut curry, and naan. Even their veggie soup is delicious. They have a very convincing service via Eat24 too!"], ["Adrian C.", "I stepped over the threshold and felt the clean orderly atmosphere entice me, with its calming Indian ambient music filling the space, transporting me from the cold boulevard...  I hadn't planned to but for the radiant claims of authentic imported spiced over that of the British portable powder innovation convinced me...  Had not I seen  a Kitchen Nightmares episode where this method was critical to recovering a New York's livelihood I would not have entered.  However, after an overlong wait for my creamy curried veggies, I was unable to distinguish its character from that of the last 14 such plates I've had in 20 years...  Perhaps it's me, but I have reached the end of this pursuit...  Perfectly suitable fare but without ebullient character of note..."], ["Peter T.", "Seriously tasty food.Great service, fast and quick. Great taste for the reasonable money you would pay. Must try!"], ["Phoenix L.", "FastDelivery, and the food was great! Only tried out a chicken curry as theMain dish to be safe so will try a more adventurous dish before I \"dish out\" fiveStars... Haha, oh how cheesy. Anyway, had great naan bread, although I wish their menu has peshwari naan   popodoms were not bad and great rice. This is probably going toBe my local go-to curry place!"], ["Larry M.", "Well I would say it was definitely a bargain for the price.  I went here on September 4 for lunch with four friends.  Complete meals were between $7.95 and $9.95.  Portions were generous.  The food was tasty.  The servers were friendly and attentive without being imposing or over attentive.  People ordered a variety of dishes, and everyone was happy with the meal.  And yes, I definitely will return if I'm in the area.  I selected this restaurant because I looked at yelp, and a quick look suggested people were most happy here of all of the Indian restaurants in Hollywood.  I have not eaten at any of the others.  I do not always find yelp ratings reliable, though they are very useful most of the time.  In this case, I though the ratings were accurate."], ["Rebekka T.", "I have only been here once, and it was the best Indian food I've had in LA. I had Shahi Paneer which was unlike any other version I've had before. Usually, it's cubes of cheese in a tikka masala like sauce. Their version was more like a shredded paneer, in a light brown, gingery, slightly smoky amazing sauce. It came with 2 vegetables on the Thali plate, which were chick peas and spinach. They both had distinct flavors, the spinach had quite a smoky finish which I've never tasted in a Saag dish. Also, I would like to mention the raita, which was thick, fresh and full of delicious spices and vegetables. I particularly love raita and having it with my curries. Many times, you get a sad, watery, bland yogurt, with a piece of carrot floating around. This place is BYOB, and a liquor store next door."], ["Cori J.", "One of the best Indian food places in NoHo, I love the Chicken curry lunch special! If you love hot food then ask for it to be extra spicy!! You won't be disappointed. Also the customer service is always great here"], ["Chris J.", "Love this place, I honestly can't recommend it enough. The food is great, the staff friendly and the service prompt."], ["Liam J.", "This is a nice family run restaurant. The layout of the restaurant is inviting. Tonight I got the chicken tikka masala and lamb jalfrezzi. In addition, I got the garlic naan bread and cheese naan bread. I couldn't get enough of the naan bread. I would definitely recommend this as an appetizer. Or even to dip in with the tikka masala sauce. The staff were friendly and eager to please. If you like Indian food check this place out."], ["Joseph Y.", "I had been here maybe about 7 years ago and I recently wanted Indian food so I remembered this place.  This is a mom and pop operation and I can tell as the wait staff looks like the family.   I enjoy places like that and like to support he local small businesses.  The food was and still is amazing.  I enjoyed everything I ordered and I even had leftovers the next day.  I had the chicken pakora, the chicken tikka masala and a couple different types of naan.  I am not an expert in Indian food by any means but this is hands down one of the best Indian food I have tried."], ["Michael P.", "This is the best Indian place I've been to in my 12 years in Los Angeles. In person it's more or less a clean hole in the wall, located in a strip mall on Santa Monica. Don't let this fool you: inside lurks delicious Indian at beyond reasonable prices. The korma is a favorite, and the paneer and vindaloo are almost always in the mix. Great for delivery or for a quiet night of quality Indian food."], ["spree l.", "This has been my favorite Indian restaurant for years--though I haven't gotten back in years because it's just far away enough that traffic makes me rethink driving.... But when did they introduce delivery??! It came in less than an hour, like people have been saying, piping hot.I tried their chicken tikka masala and their chana masala this time (I remember loving their baingan bharta and probably their vindaloo when I was on a kick). The chicken tikka was so juicy and the curry tasted of tamarind! (I actually don't know if I like tamarind all that much but man, I can dig it.) Their food has a touch of elegance to it--a little step up from the other places I've tried.There's a ton of food left over and, greedily, I wish they'd package a bit more chutney for the 1.50 you pay for it. I could inhale the mint kind--electric leaf green that lights up every bite.Can't wait to try their other curries. I'm eyeing the korma, coconut chicken, and the saag, extra spicy.... (Compared to Thai food, their extra spicy isn't too spicy, especially in cream dishes like chicken tikka masala.)"], ["Paul C.", "The food is very good for anyone looking for anglicized Indian food. Although I see many Indian people dining here, so that says something. The interior is nice enough and the staff is more than adequate for this type of mini-mall restaurant.The neighborhood is definitely Hollywood with all that comes with, so plan on a casual dining experience and leave the Bentley at home.  Once you get inside all is forgotten."], ["Alyssa T.", "3.5 for COIAccording to my bf, they really spruced up this place and added more seating. I liked that it was very spacious and open, with just a touch of Indian decor--nothing too overpowering. CHICKEN KORMA--I NEEDED MORE heat and/or more bold flavors; other than that, it was pretty SOLIDSAAG PANEER--so DELICIOUS. The cheese was yummy and the spinach was mild but tasteful.KABLEE NAAN--ordered this along with a side of regular naan. A bit TOO STRONG (SWEET) for my liking; I probably just prefer a neutral starch like regular naan to pair with curry. There was something in the filling that was off for me. Service was slow because there's only one woman manning the front as well as the tables.**I'd definitely come back as this place is CLOSE, SOLID, and AFFORDABLE."], ["Ed S.", "I'm no indian food connoisseur but I've tried both the Chicken Tikka Masala and the Lamb Curry here and they're incredibly tasty! You can order the dishes either mild, medium, or spicy...having tried all variations, I'd recommend the spicy. It's so good.You can't go wrong with the spicy Garbanzo bean side dish either and their Naan bread is taken out fresh and oh so tasty!"], ["Jake S.", "Good food, nice atmosphere. The lamb curry was exceptional. I would recommend coming here hungry, because the portions are enormous."], ["Mike S.", "Service was perfect...the food was cooked up and hot.  So amazingly fresh.  got the combo platter and there was so much food, that i needed a to go box.  look forward to coming back again...this place needs to come out of the hole in the wall"], ["Andrea H.", "A bit pricey, but they definitely make up for it with hefty, hefty portions.Roomie ordered Chicken Masala and I had the Chicken Makhni. Our very kind waiter suggested that we order more different dishes to share, but we both looked at each other and said, \"Yeah, no, there's no sharing here we will need to eat both of these ourselves.\"Apparently the Makhni is the fat Masala (Masala + Butter, literally the only difference), but I was all for the extra butter. Both were equally delicious. This place is certainly holding it down for Indian food in the Hollywood area.Holding it.Down."], ["Criss C.", "I've tried so so so many Indian spots around LA, but hadn't been able to find \"my\" spot - until I tried Crown of India. One lazy day decided to hunt around, to see what spots delivered near me. Came across Crown of India, and the positive Yelp reviews lead me to give this place a shot. So glad Yelp didn't steer me wrong - I love this place. I'd never tried Shahi Paneer before, but the description looked interesting...seriously if you're a cheese-loving vegetarian, this dish is the cat's pajamas. Husband likes various chicken dishes, including the chicken masala and chicken coconut curry. Worth noting, like any good Indian spot their \"medium\" may be a bit spicy if you're a sissy like me, I stick with \"mild\" for my dishes. Their naan and rice are fluffy, portions are generous, and they deliver food piping hot."], ["Alana A.", "We were headed to another Indian restaurant when we saw this place. I remembered smelling the food from here when I used to work across the street so we stopped. It was truly an amazing experience. From the Bollywood music videos, to the impeccable and overly attentive service, to the amazing flavors. I will definitely be returning. I always appreciate people who work hard and take pride in being good at what they do!!!"], ["Leo W.", "Growing up in Los Angeles, I've eaten at many good, some bad places and have grown spoiled by Mexican food, Cuban food, Indian food, Chinese food, Thai food that blows my mind and can't be found in small towns or cities that aren't so integrated. So when I find a place that rocks their food, I only go there and I order the same thing. As a kid/teen, in WLA/Venice I ate at a few \"dug deep in the wall - hole in the walls\" that were the best; Indian, Mexican, Cuban, Chinese; some are still there, some are not-boo! Over the years, the authenticity of the average international cuisine grew less prevalent, the increasing number of restaurants also added to my growing disappointment, it made it more confusing to choose a worthwhile choice from, but Yelp has helped.  Of course, I'm a kid of the past who grew up without the letter grading system, so I'm sure I've eaten at many spots that would be considered a \"C\" or less. Go figure, it's a trade off, our environment is so bad these days, you can die just from getting up in the morning.My point is, that since moving to Hollywood from WLA and the Valley, this Indian restaurant is as authentic as you can expect in the USA, makes big flavor dishes, spicy means spicy, the folks who run the place and work there are really nice and not affected by the city, it's very clean and relaxing inside. The food is very healthy and nothing is watered down or flavorless or \"Americanized\". Park on the street if you can't find a spot in the small, shared mini-mall parking lot, it's worth it trust me, just lock your doors people!In closing, order or go here if you want pure Indian food."], ["Sarah D.", "This place is consistently great!  We used to live in LA and ate here every week.  Now we live in Monterey, CA and we still go here every time we're in LA.My favorites here are:Veggie Samosas, Aloo Gobi, Veggie or Chicken Korma, Aloo Mattar, Saag Aloo, Garlic Naan, RiceThe curries are spicy and delicious, the garlic naan is so good, I especially love the Veggie Samosas with Tamarind Chutney.I have 2 favorite Indian restaurants in Los Angeles, and this one is my 1st choice every time!"], ["Buzz P.", "We came to COI on a Thursday night. Pretty quiet night.  NOTE: They do have a 10% off coupon if you check in on Yelp!Decor is typical for a strip-center Indian restaurant. The service was excellent. They were able to make a special masala sauce with coconut cream instead of regular cream for my lactose-sensitive daughter. We had 2 orders of chicken tikka masala (one with the coconut cream), an order of rice, an iced tea, a basket of papadam and water. Both masala dishes were good, The taste was fresh, but it definitely was not he best I've had. Almost tasted like marinara sauce. My daughter liked her special masala dish a lot though. Rice and papadam was fine. Check was $24 and change after tax, so an decent value. For me, food was 3.5 stars and service was 4.5 stars, so 4 stars overall."], ["brian p.", "Ate here yesterday, and we liked it so much we were talking about going back soon I thought I would share with you our experience. So we took a trip to the science center to check out the Dead Sea scrolls and after we where hungry, my friend's GF suggested a place not too far away. First impression was interesting they Are only open between certain times to serve lunch and dinner. I thought it was cool  because I find that to be a good thing, I can appreciate tradition especially if they take pride in what they serve. No joke we had no idea what to buy but we new we like curry, so we went with the chicken coconut milk curry SPICY and the onion and peas rice. For a apatite r we tried the samosa.. Or something like that ( potato herbs appetizer) hour server explained the menu but yet I still didn't understand what we where eating but that the adventure I was enjoying in trying something new.It was delicious,  plain and simple It felt like they invited us over for dinner and the food was delicious with a hint of a home feeling the way it is served.  When they say spicy the mean spicy but it was not a unbearable level it was perfect and yes I did feel the heat like Ben stiller in the movie along came Polly  .  I can see why famous movie actors come to this place it's like a hidden gem. Definitely coming back. If you find yourself in hollywood off Santa Monica blvd. it's a nice change of food from the mex, Chinese or American food norm. Ps the nan ( bread) is great."], ["Pawan N.", "Don't worry about the neighborhood, it is shady, but once you enter the restaurant and start eating you'll forget about the neighborhood, food is that great"], ["Adunola F.", "This place is a very clean and attractive restaurant on the inside. Very decent Indian food! I really enjoyed the vegetable Tikka Masala! I like that this restaurant can adjust your order to be mild, medium-spicy, or spicier. The Naan is fresh and delicious as well! I definitely wouldn't mind visiting this restaurant again, and will keep it in mind for my future Indian restaurant choices."], ["Christopher S.", "My girlfriend and I recently moved to LA from Kansas City and one of our top priorities was to find a nearby, high-quality Indian restaurant. Happy to say that Crown of India fits the bill. Our service was friendly, our food hot and fresh, and the prices were very reasonable. I highly recommend this eatery for those looking for casual, tasty Indian fare."], ["Renata A.", "I just ordered for second time and now enjoying a delicious meal. Everything came super hot and taste absolutely amazing! Send compliments to the chef!!! Yummy!!!"], ["Hitesh S.", "Wonderful place. Wonderful food. I live in San francisco but on two of my visits to LA I visited this place and both times my experience was exceptionally good. Very good food and the owning family is also very nice to talk to.Definitely this place will be on my list every time I'll visit LA."], ["Adrienne A.", "Everything about this place was great: attentive servers (my water glass was a always full), excellent food and great prices. The naan bread is soft and warm, the chicken bhuna and curry were fantastic. We got hot chai after dinner and it was rich and delicious. The pastry balls with honey were a great dessert! I will be back. A LOT."], ["Anjal S.", "I am so sad  this place bad service . I ordered chicken tikka masala ,chicken sag totally bland nathing test .naan"], ["Crista R.", "Been here a few times and this place never disappoints, the food is awesome. Everything tastes so fresh. The portions are great, the service is great and you can really tell that they take a lot if pride in the quality of their food here. The first time I went there they gave us a rice pudding on the house to try which was delicious.   If you like your food hot make sure to tell them when you order to make it medium spicy or they'll make it mild which is basically not spicy at all. Also, the paneer is homemade here, it's perfect."], ["J R.", "I've gone here a few times. Will come back.Food is great as well as the service. Nice family owned operation. If you want good indian food, come here and set your standard. I've come with people that know indian food and they loved it. I have been to many Indian joints in LA, this is at the top of my list. Very underrated in my opinion."], ["Ashlee P.", "I am Vegan and it is hard to find great take out that doesn't lack. This is my all time favorite place!! I order there so much that when I call, they know my voice and always say \"Is this Ashlee? Veggie Curry? Extra Potato? Medium heat? right? And for pickup? Okay see you in 15 minutes\" Lol It absolutely blows me away. What can I say, I am a creature of habit! I will say however that I am going to seriously Miss this place when I move to beverly hills. I eat here 3-4 times a week. Im sure ill find some business in Hollywood as an excuse to return!"], ["Levon G.", "Good Food, heavy though, but worth it."], ["Adam K.", "I order from here twice a month.  While it may be a bit pricey for Indian delivery and only a block away from a very seedy intersection, the food more than makes up for that.I have never been inside the location, so my review is based solely upon the delivery.The food comes delivered in foil bowls with cardboard lids.  The bowls are separated by carefully cut corrugated cardboard boxes (so as to not allow the bowls to collapse in on themselves).  This meticulous packaging is indicative of the care and quality of food provided by the restaurant.The garlic naan is fresh out of the oven, the chicken in all chicken dishes is breast meet and a high quality of texture and taste.  The sauces are not overly creamy and have a wonderful spice to them.I cannot say enough good things about this place!In an effort to keep an open internet I've decided to sign my name to all my reviews.Best,Adam Koppekin"], ["Jera S.", "I LOVE THIS PLACE! So good. Chicken Vindaloo is BOMB! And the Naan is mouthwatering. I've never eaten better Indian food anywhere else. It may seem a little pricey, but you get a bunch of food for what you pay and it tastes just as good reheated(if you can manage to save some)."], ["Carla C.", "Food is flavorful and authentic, absolutely love ordering takeout from here.  Because this restaurant isn't located in the best part of town I will probably stick to delivery for the most part.  Decor inside is very simple and relaxed nothing fancy or outstanding but the food is amazing."], ["Indrajit K.", "First up, don't be fooled by the exterior of the place. This is one of the best Indian restaurants I have ever visited in the U.S. We ordered samosas, Baingan Bharta (mild), and chicken Makhani (spicy) all three dishes were absolutely delicious. I will visit here again."], ["Paul G.", "This Indian place is authentic and fantastic! I thoroughly enjoyed the food. I highly recommend the chicken korma. You will not be disappointed. It was the best korma I have ever had. The staff was courteous and the place is clean. The neighborhood is a little rough, that is the only reason it isn't 5 stars. If this food was in Beverly Hills, it would be 5 stars all the way!!! I will be coming back again for sure."], ["Win K.", "Very tasty.  The pricing is about $12 and higher, which I admit is somewhat pricier than other Indian food places, but the food steps it up for it.  Interior is low lit, with deep reds, giving an upscale feel.   Admittedly, the exterior of the general area looked rather run down, but interior is quite classy. Admittedly, I've only tried one dish here (it was on my way to a meeting)--upon recommendation from another review, I had the Chicken Coconut Curry (extra $2 for the rice).  Smooth, creamy, and flavorful--very well balanced, it was an excellent dish.  Chicken was nice and chewy.  The service was friendly.  I will have to come back here and try out the other dishes.Interior is on the small to medium size, so group of 2-6 would be adequate. There is available parking, but it is shared by other businesses in the corner, and there is not a whole lot of space.  Given that this is west LA, parking may not be the easiest to find."], ["Emily P.", "This may very well be the most amazing Indian food in Los Angeles! These guys got it right. Excellent customer service and the food is delicious. The staff is so friendly and they truly care about their customers. I'm pretty new to YELP and I really think it's awesome to be able to rate businesses based on your personal experience. How else will businesses be able to thrive without the input of actual  customers? I will be recommending this restaurant to all of my friends and family that's for sure! :)"], ["Marie A.", "Much too bland for our taste. And, they're a bit stingy with the naan. Our usual place is closed for renovations, and this will do for the meantime, but not my favorite."], ["Malkeet S.", "Every time I come to Los Angeles with family this is my favorite place to go for food there saag paneer, Shahi paneer are awesome very friendly service good family run and own business definitely recommend to try it"], ["Clancy M.", "SAMOSA SPECIAL. get it. sadly it's only available during their lunch service. but that sorta adds to the charm. it's a samosa cut open face style (like a baked potato cut open). they pour over it channa masala, a little raita and top it with cut up tomato and onion. it's fantastic and a incredibly satisfying and filling vegetarian lunch."], ["Bhavesh S.", "Best Indian food I've ever tasted in the US. Just go there if you wanna try REAL INDIAN food, every other restaurants are fake. I loved it, a bit expensive for me (student) but, totally worth it. Even thinking about the taste of the food that this restaurant offers makes my mouth watery, too bad I live in bay area, but this is my sure stop whenever I go to LA."], ["Virginia E.", "I have been going to this place for the past three years. Everything is delicious. The service is warm and welcoming. My favorite dishes are the saag paneer, samosa lunch special, chicken tikka masala, chana masala, aloo Ghobi, lamb and chicken currries! My favorite time to get food is during lunch hours because you get so much food for an affordable, cheap price. They also know how to cater to people like myself who love spicy food! I prefer to get medium spicy on everything. I've gotten it really spicy before and it was too spicy for me. I could only focus on the spice and not the food when it was super spicy. I love this place so much. I recommend it to everyone."], ["Rio J.", "Ordered delivery of four different dishes and they were all great. Deliverer was very on time, very polite. Food was authentic, perfect level of spices. Unlike some other Indian restaurants their breads were not undercooked. Will definitely try them again."], ["Matt P.", "Ok but not the most flavorful Tikka Masala I've ever had."], ["Melinda H.", "One of my favorite Indian restaurant in Los Angeles.  The chicken tikka masala with the side of spinach is the dish I always order.  The chicken is tender and the masala sauce is flavorful.  Be warned of major food coma!  The price is very reasonable for lunch!"], ["Stella H.", "Have only had delivery, and it's always really delicious! Lamb tikka-masala and vegetable korma last time with an extra side of basmati and garlic naan. Came piping hot. One of our go-to places for delivery."], ["Belinda Y.", "We had tried Anar Indian and were rather disappointed in them.  We tried Crown of India tonight instead.  The food was far superior in our opinion, the portions were enormous (enough for two or three meals), and the quality of everything was wonderfully fresh.  The delivery man was classy, polite and courteous.  It's a little more expensive, but definitely worth it.  I will order from here again next time."], ["Rosy C.", "Best Indian Food in LA!!  I highly recommend this place to all food lovers! Chicken masala and chicken biriany is to die for!!!!!!!"]], "Curry King": [], "Saffron": [["Benilda E.", "Authentic taste for quick lunch no lines easy ordering and warm food just love like mamma's kitchen in India"], ["Theo C.", "Quick, and tasty food. This place has no frills with a simple 5 entree menu. With just the right price, you'll get a bowl/plate of  solid Indian food. Not the best I've had, but would definitely go back again when I'm in the area! Their mint chutney is good, but not as good as their homemade chili sauce. The chili sauce just has the right amount of kick and it doesn't lack any flavored especially paired with their entrees. All the entrees I tried today we're all good: chicken curry, chicken tikka masala, and the peeli daal. Although my favorite was the tikka masala! The naan bread was alright, but with entrees this good, can't really complain a lot."], ["Danny L.", "Saffron is what all food establishments should strive to be. The food comes quickly, good quality, delicious, filling, and affordable. Now this is not the best Indian food I have had, but it is perfect when I need a quick lunch on a busy work day. My go-to order is the Chicken Tikka Masala. I always grab a couple of their green hot sauce to add a bit more flavor to my meal. If you don't mind a little bit of bad breath, I would also recommend the garlic naan.Due to the lack of pho in the area, Saffron has became my go-to place when I need something warm in my stomach. Definitely recommend this for all you hard working people."], ["Alex P.", "One of the better choices to eat in the water food court. Food is prepared in a timely manner and tastes good. Portion size is good as well. I'm not a big fan of Indian food but the fusion style was tasty to me."], ["Alex T.", "It's nice to have Indian food close to were I work. Too bad it's this place. It looks like Indian food, but it doesn't really taste like Indian food. The flavors are all wrong. I don't know how fresh the rice is. Their samosa is barely edible. You are better off eating frozen Indian meals from Trader Joes!!! It's true."], ["Julie D.", "So happy that this place opened closer to my work!  I used to have to schlep to 505 Flower to eat here, but not anymore! The order came out very quickly, though it did not taste like fast food.  The line moves very quickly as a result.  The man calling out orders seemed cheerful enough.  I had the option of getting brown rice instead of basmati, which changes the authenticity a bit, but it's still tasty.My main wish for this place is more variety."], ["Colleen K.", "I had been going to Saffron on Beverly Drive so it's so exciting to see another location downtown!!  It's in the same building as the Omni Hotel but on the lower level in the food court.The food is Indian fast-casual.  It is fresh and delicious!!  I usually get the Combination Plate where you choose 2 entrees and either rice or salad.  I also get garlic naan.  And it comes out to $10.83.It also makes great take-out and it travels well.  I went wine tasting in Malibu on a cool day and we brought take-out from Saffron.  Perfect little meal while wine tasting."], ["Andrea Y.", "A new restaurant arrives at the Water Court!So I came to this place with coworkers during our lunch. Their menu is really limited: there are like 5 entrees to choose from and a few sides. I ordered the chicken tikka masala, which actually turned out to be a little too sweet for my liking. However, I tried my coworker's' chicken curry and that was spot on. Definitely would recommend that one!One gripe I have about this place is that the entrees are really plain, like literally chicken + the sauce. The dish would have tasted SO MUCH BETTER if it just had potatoes, cilantro, onions, lime, and/or peppers in the curry (or masala). I'm not sure how authentic that is...but my reasoning is that this place doesn't seem very authentic anyways. OR have at least a condiment bar, which would be awesome!! GIVE THE PEOPLE WHAT THEY WANT!Anyways, I'd actually give this place 3.5 stars but I just rounded to 4 because they're new and I don't want to lower their stars too much.But seriously, condiment bar would make this place AWESOME..."], ["Bailey M.", "Yummy good and great portion! Got the plate aka two entrees and rice which I liked because I'm so indecisive. Less than $10 which is normal for to-go lunches in downtown LA. Will go back for lunch during the week."], ["Brittany B.", "It's Saffron. It's close to my office. And if Mendocino's line is asinine, I can go grab my Saag Paneer Bowl here instead. The seating is pleasant in Cal Plaza. So, yeah, I'm a fan."], ["Mark N.", "I went to Saffron for lunch.  I really like Indian food and make generous allowances in reviewing fast food.  Even so, Saffron came well short of the mark.  I had the lunch special with tofu tikka masala and saag paneer with a salad.  Quite honestly the Indian food from the frozen section of Trader Joe's is better.  The convenience and the friendliness of the servers are not enough to overcome the reality Saffron's offerings."], ["Jacque S.", "Easily a top choice for a quick, delicious lunch in downtown.  While there are SO many options in downtown within walking distance of each other, Saffron easily stands out.  Favorites are the chicken tikka masala bowl, garlic naan (the best!), and mango lassi.  (You can't go wrong really with anything on the simple and short menu, though.)  Service is fast and friendly, even with the luch line out the door.  I highly recommend grabbing a sauce or two to kick up the flavor a notch.  (Not sure why the tamarind sauce is behind the front counter and not alongside the other two sauces, but oh well... if you want it, just request it.)  All in all, I'm a fan and loyal customer of Saffron."], ["Alice S.", "So excited for the newest Saffron in DTLA!  Just like Saffron CNP - but now in Bunker Hill. Yay!"], ["Markus K.", "This place is LEGIT! I initially went just to try something different so I came in here to pick up an order and everyone in the restaurant was very nice and friendly. The hostess was super nice and smiley (which makes me really enjoy standing there while waiting for my food). The manager even comes out and speaks to you and gives his recommendations of what you would like based off of your taste. Items are reasonably priced, and the garlic naan and mango Lassi is super delicious. This is my new \"it\" place for Indian food. Mmm...I really want some more already. :D"], ["RC S.", "With the addition of Saffron, Bunker Hill finally has a great Indian option to work into the take-out lunch rotation. The food and pricing seem identical to that served at Saffron in the City National Plaza -- but without the schlep three whole blocks from Bunker Hill.I recommend a combination with chicken tikka and saag paneer. Only the white rice is basmati (the brown rice is just regular brown rice), so the rice selection is a no brainier."], ["Andrew L.", "My coworkers and I always joke about how \"remarkably average\" this place is. It's good, but not great. The service is always great, though; fast and friendly. The Mango Lassi is very good. The garlic naan is good, too. I usually get the Chicken Tikka Masala, but have gotten the chicken curry before; it was a little bland, compared to the Masala, but still average. I go a couple of times a month. Glad it's there. But it's nothing new or groundbreaking.Edit: Found the secret. Channa Masala without onions is quite good. Also, again, the people working there are really nice. Bumped up to four stars."], ["Stephanie m.", "Bland topped with Bland with a pinch of salt.Service is amazing, the employees are fast and super friendly...Unfortunately the food is as bland as bland can get. I ordered the Saag, and it was very disappointing."], ["Angela C.", "Excellent Indian food, fast service, great pricing.  I've had the saag paneer, chicken curry, and chick tikka masala, all excellent bold Indian flavors and the spicy chutney is fantastic.  The longest wait for my food was between 3-5 minutes, even when the line was out the door.  Instant add to my normal weekday lunch rotation!"], ["arnie k.", "Indian food at its best. Had all 3 vegetarian dishes, spinach, lentils and chickpeas with the naan bread. They taste out of this world-very delicious-not too spicy-just right and the food was served hot.Plus, you can have tamarind and/or chutney sauce on the side-courtesy of the house.I would HIGHLY recommend this place. The vegetarian dishes are excellent.Maybe, they will start selling those tasty dishes in bulk, in plastic containers to go.-that would be wonderful."], ["Anna D.", "I've had three of their dishes and each was delicious.  And they're fast too which is really helpful when you're limited on time.  My favorite is the Chicken Tikka Masala with garlic Nan.  There is a spicy sauce that you can add yourself that just adds to an already tasty bowl.  Stop by Saffron the next time you're at California Plaza."]], "India's Tandoori": [["Michelle L.", "Had the lunch buffet which is definitely the best bang for your buck. Loved the veg samosas, chicken tikka masala, and the shahi panner was something I've never had before and it was amazing! Would definitely make another trip back or order take out from here again."], ["Paul W.", "Good food. My first time eating Indian food, I would recommend it to other first-timers! I don't know Indian food well but the person who brought me here does and she says it's \"good\" for the area. Apparently, I'll have to travel to Cerritos for the \"best\" Indian food. Friendly service, nice setup."], ["Sergey G.", "Food was not bad , little portions but not bad.Giving 3 stars because they did't send  any fork.Come on guys , are you kidding me ? No fork?No napkins? (((((("], ["Angela W.", "I ordered online for delivery and they were really quick and efficient and the food tasted pretty good! We live in park la brea so delivery to us was extremely quick"], ["Tiffany G.", "Fantastic! I was so beyond craving Indian food, whipped out the Yelp app and found India's Tandoori. Ordered online through the app and had my food delivered. It was way faster than the estimated arrival time. I am definitely a creature of habit and had my usual Shahi Paneer, Vegetable Samosas, Veggie Rice with a salad. Everything was excellent. DOS 0718 2015"], ["Elizabeth V.", "Tandoor? More like gah-ross. Not just gross. But gross with two syllables. Never have I had to suffer through less palatable Indian food. My poor boo barely ate his portion, I gave up soon after, and when I nuked the leftovers for lunch the following day, the awful truth was upon me: this shyte ain't fit for swine!We ordered the mixed tandoori and chicken vindaloo. The vindaloo was watery and tasteless, the potatoes were so undercooked they were almost crunchy. The mixed tandoori is described as an assortment of lamb and chicken including kebab- but the kebab was one tube of brown meat with green parsley flakes sticking out of it. The entrees don't come with rice so you have to order that separately. The one nice thing I can say is the rice portion is huge. One serving served 2 people. And the naan was pretty good. My strongest complaint is the food was cold. I live 3 miles away and we ordered to go. Although there were only 2-4 people in the restaurant we waited approximately 25 minutes for the food. Then we drive home in 5 minutes and everything is lukewarm. Did they give us their leftovers?? I'm not sure but I won't be returning."], ["Diane R.", "It's good, not amazing. I liked it all, but personally I was looking forward to classic curry and sag paneer which I didn't find. It's great for the price. Go if you're in the mood for a buffet, but don't expect classic."], ["A D.", "For what it is, an inexpensive buffet with plenty of variety, it rates relatively high.Don't expect five star. However, the food is decent and the service is good. Service: I waited no time to be seated, the drinks kept coming and my soiled plates disappeared by the time I returned with newly replenished ones!Food: The variety on the buffet is good. Just not great! We'd stopped into another Indian buffet only to find one meat option and a few unrecognizable dishes. So in comparison,....well this place rocks! Here, there were plenty of options from meat to veg to chutneys, salad, etc. The chick peas were ridiculously dry as was the filling for the samosas. However, the samosa was nice and flaky. Tandoori was kinda dry as well. The fish was cooked nicely yet some of the sauces were a tad flavorless. All the same, a buffet with goat on the menu definitely gets extra points from me!Simply put, it's a great value for your buck. Definitely not the best Indian cuisine in town but in comparison to the price of a whack value meal, it's worth it ten times over. I'll definitely be return. And you should meet me there."], ["Betty Z.", "Came here for the lunch buffet with some coworkers since we work nearby. It's pretty spacious even during the lunch crowd - we didn't have to wait for a table. The lunch buffet was about $11 I believe so not a bad deal considering how expensive food is in this area. The buffet had a nice spread - salad bar, hot foods - meat section and vegetarian section, and then cold foods - dessert/fruit. I didn't try anything from the salad bar but picked up a nice green hot sauce there. I had the samosa, rice, goat curry, chicken tandoori, chicken tikka masala, and one of the vegetarian dishes - I forgot what it was. Overall, pretty good food, nothing was really spicy except for the goat curry so that was my favorite (i love my spicy food!). The chicken tandoori was really tender so that was delicious as well. I normally really like chicken tikka masala but didn't care for this one too much - probably because it didn't have enough spice to it. I don't remember the vegetarian dish at all so it was probably nothing special. Nice to know that they do have a vegetarian version for your friends who don't eat meat though! I tried the rice pudding and didn't really like it but I just don't like rice pudding in general. Loved the fresh fruit though -  it varies but they had watermelon and cantaloupe when i went! Overall, not a bad place to eat if you're craving Indian food in the area."], ["Seeta N.", "Two years later and the food is still amazing. The chutneys are super, the papadam is perfect and the customer service is still exceptional. My favorite thing is it is clear that they use fresh ingredients. For those who aren't indian or not familair with Indian cuisine, many places used canned tomatoes etc.  The hubbs  and I bring everyone who visits LA here and they always are impressed. Truly authentic north Indian cuisine. After many many restaurants this one is still my favorite."], ["Landon S.", "Great service! Food was delicious, For $17 i got the tandoori express which came with 3 pieces of chicken, rice, a meat curry, 2 sides, and naan. it was a lot of food. Also got the fried fish appetizer and chicken samosas for the table. both were excellent.Service could not have been better. Even gave us extra yogurt for free because somebody mentioned that the curry was really spicy in convo (they let you choose your spice level)"], ["Eric F.", "Friendly service and great food. I just kept going up and getting more tikka masala and rice and shoveling it down my fat face. Then for desert I got a bowl of sauce and dipped the delicious naan in it until my friends dragged me out from sheet embarrassment. My favorite Indian food in town."], ["Edison L.", "The lentil soup is to die for, we often have them deliver the different curries.  Our favorite is goat and lamb curry with nan bread.  The service is awesome, we'll be back."], ["Catherine C.", "I've dined here before, and have ordered take out countless times.. but Sunday's buffet brunch the last time I was here was what made up my mind about this place. Most of the foods out on the buffet trays were dry and losing flavor. The service here is great, but the flavors and food is just standard. I've had better Indian food."], ["Alexandre K.", "Overall place was okay. I called once and the lady hung up on me probably because she cant operate a telephone. I called back and a guy who barely spoke any english took my order. After a few \"huh?!'s\" I finally got out a complete delivery order. ($20 minimum of course, so I added on a sprite and naan and rice but the rice never made it :-0)  Delivery was a whole other deal... He called two times to find directions to the call box, as if he never delivered before come on buddy! Also they promised 45 minutes... It was more like an hour and ten minutes, but not that big of a deal. This place is okay again... **Lets remember, I was very hungry and the wait just about took over my personality! So I tried desperately to take pictures and do a review before I consumed all the food so this is a toughly judged review!"], ["Moremi O.", "I got take out. I should've known better when the restaurant was empty. Pro: HUGE portions Con: I wish I didn't have a bucket of nasty food to go through.The vegetable korma and chicken makahni and naan is all I can review and I'll say don't order it. The Makahni tastes like they put red dye in it somewhere. Gross. The naan is tasteless I'm not sure how you can mess up naan but it wasn't worth the 4 bucks and huge portions. Man so bummed this place wasn't good."], ["Zac S.", "I cannot count on one hand how many times I have ordered out or eaten at India's Tandoori.  I enjoy the food and the staff here are warm and welcoming.  Great job!"], ["Rose C.", "This was my first time ever venturing into the world of Indian cuisine. I was really hesitant and slightly terrified, to be honest, because nothing is as bad as being super hungry and disliking everything at a restaurant. Thankfully, with India Tandoori, this was not the case. I entered with a party of around 13 around 1145 noon. The place was completely and totally empty and I do admit I was disappointed by that. I enjoy the lunch bustle--it adds to the atmosphere. Anyhow, we told the server we had a reservation and we were promptly seated. I ran off to the ladies room and when I came back there was water for everyone already. Awesome! We opted to do the 10.99 lunch buffet. I checked in on Yelp and there was a 15% discount! Hurray! My bosses were super pleased with that. First I got a salad, which was really bland. Just lettuce and cucumbers. So I finished half of that and decided to go into the actual food. I didn't try as many things as I should have, but what I did get was pretty yummy. I got the chicken tikka masala and dumped that all over rice! I got the eggplant, and the spinach with mushroom too. Everything was perfectly spicy and creamy and mixed so awesomely with my rice. They had a lot of cantaloupe, oranges and watermelon as well. Now, on to the service! Great! They came and refilled our waters and took away our plates at least 3-4 times. Every time someone would drop a little sauce at the buffet area, a worker would go wipe it down. I thought that was really nice of them. Also I think the manager came by our table twice asking if everything was okay. All in all, it is a fairly moderately priced buffet with a good selection and delicious to boot. Lovely service as well. I hope I'll be back one day when I'm in the area!"], ["Austin H.", "Good food. Great naan. Quick service, because it's buffet style. Downside: a couple flies hanging around inside the restaurant, bothering you at your table. The food is very good, at a great price."], ["Connie T.", "I just ordered the chicken tikka masala, and the egg masala. The chicken tikka was SO oily this time. I had to call them and tell them to take it back . The man on the phone apologized and sent another chicken tikka masala. Even though they sent new curries my naan and rice got cold. That was a tad annoying . Also I noticed the portions through time have gotten a lot smaller. Even though they are up the street they take awhile to deliver. I do like the fact that they use chicken breast for their masala.... the sauce is delicious. The only thing was the last two times I've ordered delivery from them I feel like they didn't put enough chicken breast in the entree order. Only 5 small pieces, and the rest masala sauce. Their egg masala was the same. Although they do give you a lot of rice . Their garlic naan is very tasty. I wouldn't say it's the best Indian food I've eaten. It's average if anything. I mainly order from them because they are convenient, and they deliver."], ["Daniel T.", "We got the Chicken Tikka and the lamb Kabob and both had exactly the same presentation. There was about 5 big pieces of meat way, over cooked,dry and laying of a small bed of cold, dry rice. I thought tikka was cooked in a sauce ? . I can feel my stomach doing what ever it can on the tuff meat that's rolling around in there. I want good food.  not yummy at all. booooo"], ["Irit B.", "Went to this place because it was right across from my work- was not disappointed.The service is OUTSTANDING!The manager was so helpful with the menu, he made sure my food was exactly how I wanted it, checked on me several times and my glasses and plates were constantly full.The waiters are super nice and professional and the food - YUMMY!I lived in India for 3 months and if I had this food there - I would totally relocate!!Thank you guys, you were a wonderful experience for my tired afternoon!"], ["Uzair S.", "Are you looking for heavenly food on earth, along with an everlasting impression that stays with you for weeks/months, and fondly keeps you coming back for more?Then look no further. Can't go wrong with Indias tandoori!My wife and I chanced upon this gem many months ago, and have been coming here ever since. Be sure to give it a try and discover the majestic of this place and its menu. Like the saying goes, \"The proof is in the biryani\"."], ["Tierney H.", "This place is great!  Saag Paneer and Chicken Tikka Masala are on point.  If you ask for \"medium\" spicy, they actually make it a little spicy!Mango lassi was really really good too.  I'm glad I live walking distance from this place because I can't wait to come back!"], ["Stephon L.", "Buffet is wonderful! Fresh Naan included and delivered to your table. Friendly and gracious waitstaff who teach me Indian phrases."], ["David H.", "The first time I went I loved the food. The second time they were closed during their regular business hours and didn't open up when i knocked. WTF. Who does that?"], ["Justin A.", "Tandoori dishes taste like joints in India, perfectly cooked and spiced.. Delivered hot, get mixed"], ["Robin W.", "First off when you order a entee it doesn't come with rice you have to order it separately I have been to many Indian restaurant and every entree I have ordered it has always come with rice I thought that was very stupid honestly The lamb rogan Josh was OK kinda bland the cheese naan was OK and I would have to same the plain salad I order was the most appetizing  thing I ate I order take out and had it delivered there wasn't any utensils or napkins in my bag I was not order from here again"], ["Bj L.", "Always love having lunch buffets and take out dinners from this place. Everything I've had is amazing. The folks that work here have always been super friendly. Love the samosas, tikka masala, lamb vindaloo, raita, and saag paneer."], ["Jo C.", "Was feeling lazy to leave the house so I decided to use Eat24. Picked this place because I've tried other Indian restaurants in the area and wanted to experiment with other locations. Boy am I happy to have tried this place! I got the 2-person dinner combination which includes Naan, rice, vegetable samosas, tandoori chicken, choice of lamb/chicken entree, choice of vegetable entree, and dessert. I was worried I would've had to pay to get the extra sauces on the side so I didn't make any note of it. When the food arrived I was shocked by the large portions. This was definitely enough for 4 people especially since the two Naans were as big as personal sized pizzas. The bag came complete with two containers of rice, a hefty portion of saag paneer (my vegetable choice), an equal sized portion of tikka masala, and a container of tandoori chicken that's about half a chicken. Not only that, all the sauces were already included!! You seriously can't beat the price. I would've paid way more for less food at a different location closer to me. The food here was equivalent to the food I've had elsewhere. My other reviews mention the slight blandness involved with the Indian food in this area. I think it's a smart marketing choice to attract curious diners, but for me, I would love to have access to an Indian restaurant that really brings that full bodied flavor that Indian food normally has. Nevertheless, I am completely satisfied and there is a lot of food leftover. Plus the rice pudding dessert really made everything much more worth it. That rice dessert is the sweetest ending to a good meal."], ["Puzant C.", "2014 YELP 365 CHALLENGE - 63/365Picked a friend up from work & searched nearby restaurants on YELP, came across this place & I'm glad I did! Parking was easy in the rear. This place is decorated really well. Very beautiful Indian styles. The customer service was great. We had 3 different guys refill our drinks. We tried the Garlic Naan and Lamb Naan, both of which were really delicious. The garlic naan was a little dry, but the sauces on the table were a great addition. I got a chicken dish in a spicy curry sauce and it was really delicious. I am new to Indian food, and this is the 2nd place I've tried so far, and we will definitely be back when we are in the area. They were very nice about honoring the 15% off for checking in to YELP too."], ["Korissa D.", "I have ordered take out from here once and dined in as well, it is conveniently located across the street from my work and I always smell the food cooking when I go to my car after work so after a while I knew I had to try this place, because I could not resist the aromatic scents any longer.  I LOVE spicy food, Chicken Vindaloo is my favorite Indian dish, I always ask for it extra spicy and they make it perfectly.  Last night I tried Vegetable Zalfranzi as well (which I also ordered extra spicy), and I highly recommend it!  The flavor is extremely tasty!  They also provided me with a complimentary mango dessert which had pieces of real mango and blueberries in it, which I thought was really good as well.All in all I would say this is my new go to spot for Indian food."], ["Rene V.", "Always enjoy coming here!  Great service and wonderful flavors!  Big fan of the tikka masala.  Highly recommend!!"], ["Yousef T.", "Live around the corner, so review is for Take Out.Being able to order by Yelp or GrubHub + 1 starFood being ready earlier than estimated and getting a text about it + 1 starMedium spicy that is actually MEDIUM + 1 starAuthentic spices and creaminess in saag paneer (per Indian wife) + 1 starCharging ~$4 for only 2 pieces of medium sized garlic naan - 1 star"], ["Ricardo M.", "I have never had a bad meal here. Most times we are the only non-Indian people here and I feel that the food must be good :-). Service is always top notch and we are always greeted and recognized.We hit the typical staples, shrimp masala, paleck paneer etc. Food is constantly good, and really... All of life's troubles can be solved with some mint chutney and samosas!"], ["Jessica S.", "I've only ordered food and had it delivered here. The chicken biryani, chicken tikka masala, mushroom rice, brown rice, and cheese naan are all amazing. The samosas are quite tasty, too. They always deliver on time and even delivered to me once when they were about to close. I'm so glad this is the closest Indian food to place to me! Delicious. Love it."], ["David P.", "I tried the Sunday buffet. The selection was good, the taste of the food was so so, and they were sort of soggy. However, the garlic naan was fantastic. The restaurant is pretty and has nice ambiance, but I prefer the food of their location in Torrance over this location if they are still affiliated with them.I also tried the fruit salad. The fruits were not ripe and the watermelon was old and sour. It was probably used from previous day."], ["Paul T.", "Excellent value and friendly staff make this a great place to go to for an easy, casual dinner."], ["Harut A.", "So good!  I have been to many Indian Lunch Buffet restaurants and this has satisfied my taste buds very well.  Lots to choose from and friendly staff."], ["Charlene H.", "My friend came to visit me and we decided on Indian food tonight. I remembered I once bought a Groupon for this place. The food and service was wonderful then and now! Preet was our server tonight and had many wonderful suggestions for our wanting to try something other than the ordinary Indian food we are use to ordering.  Good atmosphere,  sevice and great music. You feel like you're in india."]], "Biriyani Kabob House": [["Nicole L.", "This place is an absolute gem! We found this place on yelp and we are definitely coming back! It's a local joint with a welcoming staff and a passionate chef. You can tell they have a passion for good food by the amount of preparation and effort the chef puts into his dishes.We shared the chili chicken special (a solid 5/5!!) and the lamb shank biryani special, which was PHENOMENAL. The lamb shank was completely unexpected. We actually ordered another dish (that they happened to run out of) and instead they recommended the lamb biryani. The chef asked us if he could experiment by substituting the rice with extra sauce and we're so glad he did!!This was the best lamb dish we've had in a long long time. Perfectly seasoned and falling off the bone, smothered in a slow cooked tomato base sauce.(He said he purposely didn't give us a knife because he knew the meat would fall off the bone). We could go on and on about the dish, but bottom line: we encourage anyone to try this place, it's so worth it! Go with their recommendations and specials -- you won't regret it."], ["Robert R.", "I eat Indian food on a regular basis (1-2 times a week) and love to try different Indian/Pakistani restaurants around LA. Ordered their Chicken Tikka Masala here and was not at all impressed. It seemed to lacked flavor and was pretty bland. The curry had a weird consistency to it that did not appear to be typical of other tikka masala I've tried. Maybe I just need to try their other dishes. Customer service was also mediocre, the older gentlemen at the register did not really go out of his way to be accommodating and seemed to not really care."], ["Justino C.", "Was practically forced into ordering the lamb shank. It was alright but want add tender as I've had. Maybe that's Bangladesh style, idk? Thru have this eggroll looking thing gor a buck fifty that is stuff with chicken, hardboiled egg and some greens that was pretty bomb...I must say. Peeps ate cool and friendly. A good chamber of pace being surrounded by Korean, Mexican and Filipino food.They have done super OG Bangladeshi only style dishes so you already know I gotta come back to taste and get a better feel for the place. Tré stars this time...."], ["Pramod S.", "A review from an Indian:This is not the typical indian / pakistani biryani. The chicken and the lamb biryani was more like  rasam rice. The meat wasn't soaked in the spice as it should be. it was way too bland.The best place to try biryani is at Biryani Point in Artisia. (yelp.com/biz/paradise-bi…) If you don't mind driving for 20 more minutes please head to Biryani Point.This place is expensive and not really worth the money."], ["Jessica L.", "Aside from Halal Guys cart food in NY or gyros at few Mediterranean restaurants I never truly had Indian, Halal, or lamb except for dishes such as rack of lamb. So this review comes from a newbie...The Lamb biriyani had a strong curry and lamb scent I could not get over. There were chunks of lamb meat with bones hidden throughout the rice and the lamb's scent was a bit over whelming. The chicken tikka Marsala I could eat and especially when dipping the naan into the sauce was edible but it really just tasted very ketchupy.  It also stained everything it touched... paper plates, my fingers, other foods.. anything it touched BAM instantly orangy yellow.I gave it a one star rating since I personally can't eat it but had to wonder... was it just me? Then I looked over and the person I came with also couldn't eat anything and two Hispanic guys at the table next to us left more than half of everything on their plate and just walked out. So for people sensitive to smell and not use to Indian food I would highly not recommend it. I would make the drive to Costa Mesa and eat the Halal Guys now in Cali."], ["Judy L.", "This place has parking, affordable prices, good portions, and legit indian food. Pretty happy I ended up stopping by here to try their bomb chicken tikki masala! This portion is plenty for two with an additional sides such as garlic naan. I would definitely come back to try their other dishes."], ["Sid P.", "They are not closed for renovations!!They are closed by order of public health.Vermin!!!!!!!!Ughhhhhhhhhhhh.Never again!!!!!"], ["Zia I.", "Best biryanis in town hands down. And it is open late till midnight. If there are cricket games of Bangladesh, it is open whole night. A must see and experience the real Mughlai Cuisine of India. All the other Indian places are just created for American taste and does not give us the real experience on Mughal Cuisine."], ["Zaid M.", "WORST PLACE EVER!I waited over an hour to get my food and the driver, due to their incompetence and inability to find my place (which is on the corner of Flower and 7th... not hard to find) is now refusing to deliver the food... Nice service dummies. Ever heard of Google Maps?"], ["Claire H.", "Biriyani. What is it? Meat (or veggies,) spices, and rice? How exciting can that possibly be? That's what I foolishly thought before tasting the life-changing biriyani at BKH. I've been here a couple of times and ordered a couple of things. The hyderabadi kachi biriyani with lamb is a total show stopper: a mound of the most flavorful, spicy, buttery rice, piled high on top of a bone-in lamb shank so tender, you could pull it off the bone with a spoon. That lamb is some of the most tender, least gamey lamb I've ever tasted. I understand biriyani is sort of supposed to be a special occasion thing, and I can understand why. It's a rich, delicious treat. Another show stopper that I've ordered was the chicken karahi. They asked me \"Do you like spicy?\" and when I said yes, they recommended this dish. I specifically asked them to make it \"very spicy\" and they delivered. Each delicious bite of tender chicken was drenched in shimmering, seething hotness that made my eyes tear up. I have a high tolerance for spicy food. If you do too, come here and try this dish. It's rich and a little greasy, but the flavor and heat is fantastic. The last time I was here with one of my girl friends, we ordered bindi masala, a special of the day that consisted of okra cooked in a tomato based sauce. It was great! The okra was nice and crunchy, not slimy, and the flavor was great. We ate this with some basmati rice. Yum.I also get the samosas a lot, too. They're good. The green sauce in the squeeze bottle is wonderful. I hear this restaurant being talked about as some of the best Bangladeshi/Bengali restaurant in LA. As a white girl, I can't vouch for it's authenticity, I can certainly vouch for the quality of the food. If you've never had biriyani, come try it here and be spoiled, forever. We came here in the evening during Ramadan and it was packed, so that should tell you something!"], ["Rezvina I.", "We had chicken biriayni tonight with beef curry & the food quality is very poor. The rice quality was not good at all & plus the biriayni didn't taste good. The portion is generous but the biriayni tasted like it was made from Shan packet mix. Not recommend!!!!!"], ["Alice H.", "Great food. The lamb biriyani is a must. The naan is to die for."], ["Kristen Q.", "Biriyani Kabob House, sorry to burst your bubble but you definitely do not deserve 4.5 stars IMHO. Maybe it's because you're the only Bangladeshi, Indian food joint in the area so that's why customers have been gracious. However, here's my bulleted point commentary below.Pros: You have a parking lot, albeit shared with 8-other businesses so we secured free parking, score!There was a short line at the register; orders were taken quicklyCons:Chicken tikka masala is SPICY; I've never had such a spicy version and there's no warning anywhere that it varies from other restaurantsOur order took 25-minutes, usually when you go to a casual order your food at the counter joint, it should not take longer than 10-15 minutes max; if they do take longer it's perfectly acceptable, just tell your customer it'll take that long. Even at fast food joints like Panda Express, they relay, \"this'll take 5-10 minutes til your order comes out.\" The cashier should've said something, just sayin'....The biryani chicken is not boneless--it's attached to the drumsticks. I don't usually expect this when eating curry chicken dishes.Albeit I did enjoy the tikka masala sauce since it was rich and creamy and I could taste the sugars amidst the spice, everything was just not expected and there are things Biriyani can improve upon. If you go here and if I ever return, I would call in my order first before dropping in."], ["Crystal S.", "I came here on my lunch break today so I didn't have much time to spare, but boy was my time well spent in choosing to come to this humble gem! I am a huge fan of paratha but had never tried a paratha aloo and let me just say WOW!!! I am so glad that the gentleman working here took the time to explain to me what the paratha aloo was. It is the most delicious combination of bread, herbs, spices and potato and there are plenty of very tasty sauces to accompany it! My only regret is that I didn't order an actual plate! Next time I am definitely going to try the chicken tika masala! I saw the people at the table next to me eating it and it looked delicious! I am also extremely intrigued to try the rice pudding! As people have mentioned the parking here is horrible but I promise the food and service here are definitely worth the trouble!"], ["Asmaa A.", "This place has the worst service ever! The host didn't bother greeting us or giving us a menu.  He didn't even acknowledge our presence.  We got our own menus but the guy was too busy to take our order so we just left.  I would never come back.  Horrible service!"], ["R R.", "I been trying out Indian curry placa in LA more than 10places ... Now I write review of curry to give all of my curry stars to this place . That good !!"], ["Jade P.", "Ordered the chicken biriyani and lamb biriyani. I prefer the lamb not only because it's more flavorful but also because the chicken had some small shards of bones mixed in with the dish. No idea if that's normal for this particular dish but it's a bit of a hassle. I don't know how authentic their biriyani is since it was my first time trying it but it was quite good. Really huge portions too. One order of their biriyani can probably feed 2. Tried their mango lassi as well. It's a refreshing drink made with mangoes, yogurt and spices. Great especially in this summer heat!Disappointed with the service here though. The guy (younger guy so I don't think he's the owner) behind the counter who took our order was rude...no greetings, no thank you. Also, there's no need to shout at us to pick up our order and make us feel that giving us our food is an inconvenience. Will probably not come back because of poor service."], ["Daniel H.", "Ordered the chefs special lamb shank spicy with rice and added extra side of naan. It was really good. The owner is very nice and personable. I will definitely go again to try the curry and chicken tikka masala."], ["Shea N.", "If ambiance is your thing, this place doesn't have it. But, the food is great! I had the chicken tikka masala, naan, and veg samosas. The naan was perfect and the other two dishes were bursting with flavor. The guy who helped us (assuming he's the owner) was very friendly."], ["Ravi J.", "Giving 1 as can't give 0, worst worst experience ever .. Went looking at so many good reviews and 4.5 Star rating and I am seriously surprised what went wrong (usually 4 with 200+ rating has been a pretty good milestone to try a new restaurant ..Ordered on phone at around 10:00 pm and as it was already late we asked to make it to go, he said should be ready in 15 mins and when we reached it was not even boxed so we asked him to server Dine in ..Thank GOD we did Dine in.. Kitchen was open and we could see the chef, he was sweating due to heat and rubbing his sweat and with same hands he served our Biryani, I was like we are not taking that Biryani .. And then when the other items came, our Daal was Stale so definitely tasted bad, and Chicken Kebabs were cold as if he just took them from Freezer and re heated them .. I am happy that we didn't take to go and realized how bad is our food instead of reaching home and realize it ..He said he not gonna charge for the Stale Daal but that's it, he didn't even say sorry or felt bad that he served stale food to customer .. I was like, take the money and keep the bad food with yourself ..Horrible Horrible experience, never going back everrrer !!!"], ["Nahide E.", "Three stars is only for the food. Chicken biryani was missing the original taste of biryani but was okay. I liked the beef shish kabab. It was delicious. Chicken tikka was not that tasty. Small portions and accordingly inexpensive. Customer service was horrible. The guy at the counter taking orders seems like he doesn't care about customers and I might say he was impolite."], ["Bill M.", "I tried the same the beriani dish this time but actually I was disappointed big difference between the one I had before and this one I think the quality of the food is changed the rice doesn't taste as good as before even the spices are different"], ["Linda N.", "SERVICE SUCKS!Called 25 min ahead for take out. Ordered only 4 items, nothing complicated. Got there and they just started the order... Waited 15 min later and the people who came after us got their food already! We inquired and he responds oh what's your order again and shouts back to the kitchen... Uhh how do you forget an order twice? Anyways about 60 min now after ordering we get our food. Went Home and realized we Paid for 4 items but got 3. Where is our cheese naan????? Now this is a really heartbreaking review because I love their food saag paneer, chicken biryani and chicken tikka masala are all mouthwatering. But they don't care about their patrons... :////If you'd like to be treated like you're non existent please come here."], ["Bisma M.", "Came to eat here while visiting LA, food was pretty tasty. Didn't like how the person at the register was forcing us to order things off the menu that we didn't want to eat. Overall, it was a small diner with good food and quick service. We ordered the chicken thika masala, lamb shank biryani and kabobs."], ["Jee C.", "Great service. Came all the way from Canada and Imran greeted us in true Bangladeshi hospitality. Authentic food, my parents from Bangladesh were impressed."], ["Geo G.", "Chicken Biriyani $6.95++See: 8/10. The chicken meat was mixed with the biriyani rice. I prefer them separated. Good proportion of meat and rice.Smell: 9/10. The smell of the Biriyani spices was rich.Taste: 9/10. As authentic as the taste can be. I will definitely return for another round of Biriyani rice. Feel: 7/10.  The restaurant was small and can accommodate about 20 pax. Customers are expected to order and get their food just like any fast food restaurant."], ["Chris L.", "Great place if you are craving Chicken Tikka Masala for around $10.  Great portions and comes with naan or rice!  The parking lot is tricky and there's a lot going on in this neighborhood.  I realized that this place is pretty hidden since I've been search for local Chicken Tikka Masala for months on Yelp!  and it was my Lyft driver who recommended it!  My roommate ordered the biryani and wasn't too impressed.  It was the perfect grab and go for a picnic concert at Levitt Pavilion in MacArthur park!  Others were jealous."], ["Christoph N.", "I'm having the Mahi Mahi curry special ... Wow.  Awesome. Authentic.  Great low key, family friendly place"], ["Yoojin S.", "Chicken marsala had more tomato flavor than I've had at other places, which isn't necessarily a bad thing. It was sweet and delicious, and although it wasn't the best marsala I've had before, I'd prefer it than some places that prepare an overly creamy and heavy marsala. We had the daily special biriyani that had spicy chicken. It was pretty good and flavorful. The portion size was really big, especially compared to the marsala + naan, and looked really messy.  I liked the marsala better than the biriyani, but it was a good dish to share and just something different to eat.And a point for having naan or rice included for most dishes! :)That's a plus--and also their naan was so good. Crispy on the outside, chewy on the inside. It was really warm when we got it. Nice.Also, the restaurant itself is small and nothing fancy, but we found parking at the lot for free!"], ["Shayan S.", "Was in the mood for Indian food so my fiancé yelped the place for pick up. We got the chicken tikka masala, one naan and one order of rice. Now, we have had Indian food before including in the DTLA area, but let me just say this little place super exceeded our expectations!!!! Very filling and very GOOD! We even asked for extra sauce on the side and they gladly gave us plenty at no extra cost! Highly recommended!!!!"], ["Dan L.", "I admittedly don't know much about Indian, Pakistani, or Bangladeshi food (all 3 of which are apparently served at this eatery) ... but judging from the aggregate patronage I saw dining here, I'd say this place is as authentic as f***.Parking can be a challenge to obtain in the tiny lot of the strip mall in which Biriyani Kabob House is located. I counted myself quite fortunate to have snatched the last available spot upon arrival.My friend and started off with an order of Beef Seekh Kabob and a pair of Mango Lassis. The kabobs were a bit on the spicy side, but otherwise quite decent. The lassis were quite refreshing (although they did little to quench the spiciness of the food, due to the viscosity of the yogurt).For our entrees, I had the \"student\" biriyani (I think it's not on the regular menu), and my friend ordered the lamb biriyani. We were both reasonably satisfied by the palatability of the plates - but no joke, the spiciness factor here was even more severe than that of the kabobs. We quickly secured a pitcher of cold water from the restaurant fridge, and drank almost all of it inbetween bites of the biriyani.For dessert, we each treated ourselves to a bowl of rice pudding. I don't think I've ever sampled bad rice pudding anywhere, and the rice pudding served here was no exception to that rule.The cashier/server (whom I suspect to be the owner of the restaurant) seemed like a pretty cool guy to deal with. Menu pricing is affordable, and portions are filling. These little details are why I awarded the restaurant a 4th star, despite my general perception of the food being closer to 3-star territory.The interior of the restaurant is a bit on the small side, but we were able to secure a table without difficulty. The restroom is acceptably clean.I would be willing to come here again, and I have a feeling that I may upgrade my rating of this place to 5 stars if I can find some less spicy dishes on their menu that prove more suitable for my mild palate."], ["Christina H.", "Before I start, I must make it clear my review is only based on only one dish that I have tried so far: hyderabadi kachey biriyani lamb. I will probably go back another time to try their chicken tikka masala to get a better feel for their food and may edit my review.I was feeling Indian food so after reading so many good things about this place, I decided to give it a go. But I was honestly very very disappointed with the hyderabadi kachey biriyani lamb. Perhaps I should've ordered the regular biriyani lamb rice but this one was very bland in my opinion. The most unflavorful biriyani rice I have tried to this date. It also wasn't spicy at all which was disappointing bc I love spicy food. The white sauce that comes with it was also too sweet compared to what I have tried at other places. I really want to like this place bc I love Indian food and this is the closest one to where I live. I hope the next dish I try is good."], ["Joseph H.", "Hands down one of my top joints to eat in LA. Sometimes its fun to eat at bougie restaurants with just ok food, but most of the times you just want something savory and delicious to sit on your couch and watch Netflix with. This place is it. I get the lamb biriyani and a samosa and its definitely enough for two people. My first time here they even hooked us up with some yogurt! Totally recommend on a first date not because of romantic ambiance, but because of deliciousness!"], ["Isabella A.", "I wouldn't give any stars if I had the choice. I gave this place the benefit of the doubt due to the number of starts.My husband is from Hyderabad, and I am Punjabi so we both love biryani, and I make it often at home! We were tired and I did not feel like cooking, I saw that this place had good reviews so I thought we would try it. Worse idea I have ever had.I ordered veg biryani, he ordered the hyderbadi lamb biryani. We ordered it to go, and picked up an hour later due to the traffic being so bad, even though we arrived so late they still didn't have it ready and we had to wait....My husband was being negative, and thought the place was dirty and the food would be terrible. But I urged him to try it.Mine, the veg biryani, well, you can't exactly taste anything except for spice. It was so spicy I couldn't even eat it. Keep in mind I am Indian And I love spicy food, they didn't even ask me if I wanted it really hot or not, I think the biryani is so bad they cover it up in spice to make it seem authentic. The vegetables were soggy, and after a few bites I couldn't handle the spice.My husband had the lamb, and let's just say he told he thought the meat was bad but I thought he exaggerated. I was wrong because he ended up throwing up everything that night. It's the next morning he still isn't feeling well, I feel awful. All in all, don't eat there, it's not worth it. If you want bad biryani go else where. At least a place that won't make you sick."], ["Jef S.", "Went there since feb 15...but after the shutdown due to vermin infestation...the taste of the food started to change. I suspect there's a change of ownership and the guy who manned the cash register is no longer there."], ["Daanyaal K.", "Lamb Biryani for the win, yayyyyyyy!!!!!! Located in K-Town on 3rd street across next to Vons and a famous donut place. 90% of restaurants that say they are a biryani speciality place offer old, tasteless, and or something that isn't really biryani, this place is an exception. I've been in LA for almost 3 months now and I've been here 6-7 times already (always on a Saturday or Sunday). I always order the Hyderabadi Kachey Lamb Biryani which I finish but it can feed 2 people as well. They give you a big, soft lamb shank, and the rice is maaaaad fresh! I've also had their tandoori chicken which is great as well.Fresh Biryani Days and Time: Saturday & Sunday 12 pm - 3 pm"], ["Michael Z.", "I really like this place! Family owned and just amazing food. I had never had pakistani or bangladeshi food before and they answered all my questions. The biriyani and korma are my favorites."], ["David P.", "First time trying out Indian food and I was not disappointed. The parking here is TERRIBLE, so either try your luck at the small lot they have OR street park (meter and adjacent streets). I think you can also do pick-ups and delivery. Inside has plenty of tables and they also have like 2 tables where you can sit outside. Has a big TV that plays sports so a huge plus. Came here for a dinner on Friday night. I got the Bihari kabob (which was carne asada that was kabob style). My meal came with the naan which was recommended by the owner. My girlfriend ordered the chicken tikka masala w rice.My Bihari Kabob was super solid, marinated and seasoned well. It wasn't too salty or too bland. I guess the Indian herbs were really in the meat because it had a nice kick to it as well. The meat itself was soft and was not chewy at all. Naan was pretty damn delicious; it was just a simple naan but oh man, it was cooked to perfection. The naan went real good with the tikka masala sauce. Chicken tikka masala was freaking delicious. Super juicy, full of flavor, and good portion size. We were both very satisfied w the portion and the taste from this place. I definitely will come back and try the other things on their menu."], ["Samia K.", "Came here for the first time with my mom this afternoon. Ordered chicken tikka masala and beef boti kabob. They accidentally made beef seekh kabob instead (see photo) but corrected the mistake and gave us that extra entree for free. It turns out that mistaken dish ended up being my Pakistani mother's favorite! All dishes were good. And it's nice to have a place that actually has a parking lot in this area (WIN!)"], ["Rachel C.", "This is a great place, service is great, atmosphere is casual. You first come in and order first then they call out your name for the order.The food here is also great. Chicken tikka masala Lamb Biryani Cheese and Garlic Naan are few of the great dishes here. The wait isn't long and price is good. Great place if you like authentic kabob bangladeshi, indian and pakistani"], ["Eric Y.", "Eating delicious food here and 2 homeless men walk in.Owner: \"you guys hungry?\"Homeless men: \"yes\"Owner then gives men 2 chicken biriyani to eat.  Support small businesses!  Mcdonalds would've never done that! Btw, food is great and price is very fair."], ["Dias A.", "Lamb biriyana is awesome,  local , quick fix place .  Not good for the dining in people"], ["Spencer N.", "hold the phone wow okay so that food was really good and it was so cheap like how do they make such good food but not make me spend my money it might be magic i just don't understand maybe she's born with it maybe it's biriyaniso i got the karahi chicken with naan and it came to like ten bucks and i left a 2 dollar tip because the guy was very nice to me while he was ringing me up not like he was flirting or anything but he was just a friendly business person maybe he was the owner or something or maybe he was flirting but i don't think soit took a really long time to get my food and i was kind of getting sad because i could tell that they had forgotten about me and then my worst fears were confirmed when the guy asked me if i had gotten my food yet and i said no but the funny thing was that he already knew my name which kind of surprised me and brings me back to what i was saying about magic because how could he know my first name and it really showed how much they care about every customer to learn these things but then i remembered that he asked me what my name was and wrote it on my ticket and that kind of disappointed me but it isn't their fault i just really needed the attention i guessso i finally got my food and it was so good like for what i paid it was so delicious and the chicken was like perfectly juicy but also cooked with that kind of crunch on the outside not like it was dry or anything but just really good and then the sauce was really well balanced like it was red and tangy but had a kick like when you eat pop rocks and coke and it makes the inside of your mouth go all crazy thats kind of what was happening here but with chicken and tomatoes and some sort of cumin maybe idk i'm not good at identifying spicesanyway so the only bad part was the naan and it wasn't even bad it was just okay like it was really weird because one side was perfect and fluffy and yummy but then the other side was really dry and kept breaking and i like to use my naan to soak up my food because i don't have a lot of money so i can't afford to waste food and leave anything on my plate and i never do but the naan makes it easy especially when there are other people in the restaurant and it would not be polite to eat with my fingers i mean i still ate with my fingers but i did not feel good about it and some of the people were watching me like what are you looking at oh like you've never eaten with your fingers before i find that hard to believe anyway get the karahi chicken and just ask them to not make the naan too dry and it will be a very nice meal for you"], ["Asim K.", "Love this place! Came down from Houston Texas looking for a Halal Restaurant and we came across this gold mine. The service is great, the parking is easy and the food is delicious. Make sure you order the Chicken Tikka Masala!!! It was so good . 5 STARS!!!"], ["Izza K.", "So I went here to get their chicken karahi like I said I would. It was pretty good but it wasn't the best I've had. Karahi has a tomato based gravy but in the dish the flavors didn't come through. It was also a bit spicier than I prefer and I like my desi dishes spicy so that's saying something. It was delicious regardless but not quite what I had hoped."], ["Amy K.", "I had a hankering for chicken tikka masala and this place was highly rated so I gave it a shot. The deal was REALLY excellent considering that the chicken tikka masala COMES WITH RICE! Which is just really aces in my book. I also ordered garlic naan and it was also very good. So price, parking and service wise this place is a total all star, but only reason why I knocked down one star was because I do agree with some of the other yelpers that it was a little sour tasting. It was supremely thick and creamy and it almost made me think if they've put sour cream or greek yogurt in it for the texture. I love that they have a shared parking lot in a little plaza, the restaurant is clean and efficient, they are generous with their portions and add-ons, and they used very high quality chicken in the chicken tikka masala. I may give this place another shot with another dish, aside from the tiniest sour tasting chicken tikka masala this place is one of the best places for indian food fo sho!"], ["Erin Nicole S.", "had a craving for indian food and came here from a recommendation by a friend. food satisfied my crave. really huge serving sizes, nice staff and great food!"], ["Kia R.", "LOVE this place. The food is delicious. A group of us were looking for some authentic bangladeshi food and this place exceeded our expectations. The owner is such a wonderful man who conversed with us and gave us free rice pudding. I definitely recommend the lamb biriyani and an order of garlic naan."], ["Danny O.", "The food and service was horrible.  I ordered the chicken tikka with rice and told the cashier I'll pay $1.50 extra for the naan. Then I saw him ring up $2 and said he'd fix it after I mentioned it.  About 10 min later, the food was ready except for the naan.  Ok.  So when I first took a bite into the chicken, it was dry and almost rubbery.  Dang.  Then I took a bite into the  basmati rice.  Dry.  Shoot.  5 min later, I asked the cashier \"naan?\"  \"It's in the oven.\"  At this point I gave up and asked to speak to the owner.  Soon enough I find out the bald headed old man sitting by the door next to the tv making disgusting noises of him inhaling and regurgitating his own mucus several time was the owner.  I decided I had enough bad experience already and walked the hell outta there.  Don't look into the 4.5 star Yelp reviews. If the native Bangladesh people review it's not authentic and tells you not to eat there, just believe."], ["Leah P.", "Parking is small but luckily was able to find the last space available. We ordered the following. ..Paya Beef Nihari - Beef shanks 2 small cubes of meat full of bones and knuckles also spicyChicken Tika Masala a few chicken and spicyGarlic and Cheese Naan not enough tasteMango Lassi yogurt consistencyThe beef would have been good if we had more meat. I don't thinks it's worth eating because lacking meat,  just full of sauce.Saw the cook licking her fingers while cooking. ..argghh"], ["Connor I.", "AWESOME!They had my to-go order (chicken tikka masala--a classic!) ready in 5 minutes.Had a real good feeling about this place as soon as I walked in and smelled the divine aromas wafting from the kitchen... everyone working there was friendly and cheerful, too.Now, the food... I've been to many an Indian restaurant, good and bad.And let me tell you folks, this stuff is undeniably DA BOMB!Creamy, spicy, richly flavored curry, perfectly cooked chicken. The naan was also on-point.With food this good, you can just feel the love. Such a satisfying and comforting meal.I always pass by this place when I'm on my way home from the gym, so thankfully there will be ample opportunity for me to try some other things on the menu! See ya soon, my Biriyani homies."], ["Eranda J.", "So far the best biriyani place I have been in La. However they are not well organized. The tables are full with left overs."], ["Heidi Y.", "DELICIOUSI'm not sure I've ever had  chicken biryani before, but other reviewers were right, it's legit. it's flavorful, but not saucy or salty. the rice has cripsy stuff on it, and it's got a kick to it even though i don't see any peppers. portions are HUGE. its A LOT of rice. I shared it with another person and it was still a lot of food. Get another side curry dish to eat with all the rice. Lamb curry was also really good. Spicy and full of flavor. Portions are smaller for the curry, but came with a giant piece of naan.  The garlic naan was really good (prepare for garlic breath though!)Lots of seating inside and outside. food cooks super quick.  I got mine to go and everything was ready in 10 minutes.  They take cash and credit cards."], ["Anna B.", "- Best chicken tikka masala I have ever had in life!!!!!! A must order- Huge portions!- Biryani can be a hit or miss but overall tastes good- Its a hole in the wall place which you will not regret trying - I hope they move to a nicer location."], ["Mark S.", "Fantastic, best Biriyani and Lamb Curry I've eaten in the U.S. What a great find, highly recommended..."], ["Jennifer M.", "My friends and I went here for the first time a few days ago. We ordered take out, and were really happy that they got it ready in 15ish minutes!!! We were starving, so that was a pretty big plus for us.A man was at the register and he was very kind and welcoming. We took our order and went back to my friend's house. We ordered chicken tikka masala, saag paneer, and chicken korma. Lemme tell you, everything was soooo flavorful and all 3 dishes were very delicious!I would definitely go again!"], ["Aerin A.", "The aloo paratha is one of the best things I've put in my mouth in a really long time . Ridiculously tasty . 5 stars .I also had the tandoori chicken ( 4 piece in which they only give you legs and thighs btw) and that was just okay . It really needed the sauces that are located in the refrigerator where the drinks are located . The Combination was a bit better. 3.5 stars .Especially with a gingerade gts kombucha .As for the biryani I had the veggie and it was just okay . 3 stars .   Maybe the chicken is way better I might come back for that or maybe the special biryani of the day as well as the charga chicken which I also hear good things about . Oh lastly I waited about 20-30 minutes for my order which was to go so call ahead ....especially at night. The place was pretty packed with families and hipster couples . Lol"], ["Shahzad M.", "The elderly gentlemen on the counter is kinda cranky but the food is amazing. He may have been so because they are severely under staffed. Another, owner/staff member was telling me about their work schedule. It sounded like they didn't have enough help and there was a help wanted sign in the door. I'll tolerate his behavior for the delicious food, though. It's worth it. The other downer was that when I arrived at 11:10 am, per 11:00 am opening time posted on Yelp, he said he wasn't open yet. So, I figured there was a miscommunication. I waited until 11:30 am for him to open. I walked in to place a naan order and he said he wasn't ready to make naan yet. So, what was he doing for the last 30 minutes! I settled for ordering rice dishes, only. After I received my rice order, he forgot to include my mango lassis, so I had to remind him about them. I don't know. They weren't even that busy when I was there. Not very professional. But that's usually how it is in Little Bangladesh. It's kinda informal. Last complaint--this is across the board for the restaurants in that area--the restaurant and restroom especially, was not up to par. I don't see why these places need to be so dirty. There is no excuse. Definitely, minus one star.  I had the Hyderabadi Kachi Biryani, lamb and chicken variety. It was amazing. The yogurt (raita) provided with it was delicious, too. We had some mango lassi to go with it and it made for an awesome combination. The portions were massive. Definitely going back."], ["Romel D.", "Great find, great food, and great service! This is the Yelper's dream trifecta!After the most intense indian food craving of our lives, my friend and I decided to roam around and try this spot and we were pleasantly surprised! BEST CHICKEN TIKKA MASALA IN LA. Big statement but it is absolutely true! I could drink the sauce, it was so good. Also the samosas and garlic naan are warm, flaky, and savory. This mouthwatering combination blew my mind. The curry had a such a great kick, it was almost recruited by the 49ers. Also, friendly service and large portions are such a big plus. Absolutely hits the spot!Support your local businesses! EAT UP!"], ["Andrea L.", "This place is a gem! We found this place from yelp and my bf bought the chicken tikka masala to go. It's delicious! I almost finished the entire serving which i rarely do.We'll definitely order from them again! It's a must try!"]], "India's Restaurant": [], "Manas Indian Cuisine": [["Christina D.", "Their food here is amazing! I haven't been able to find good Indian food since I've come up to LA so it was great to finally find a place I could quench my cravings. I haven't seen cheese naan anywhere else besides here - definitely recommend ordering it!The only downside is it's pricier than most other places."], ["Nishant N.", "Bad quality food with bad service.The waiters are rude and do not attend in time. No shortage of wait staff to number of people in their but the waiters are just lazy and rude. Makes you never go back there.The food is usually dry and tastes bad. Unfortunately one of the only options for Indian food around USC but more oftenly I prefer ordering in from other restaurants than from here or going here.Lots of better Indian restaurants out there ... Skip this ... You will thank me."], ["Gulaid A.", "Worst place ever! Based on my delivery! 8/8/2015. These guys who answered the phone was price of work to deal with. Sorry have to go and don't have time this BS anymore."], ["John M.", "Not a bad choice when it comes to value and the nice spread on their lunch buffet. Next time around I'm hoping they'll up their spices and especially in the Tikka Masala, it was completely void of masala (garam masala) and saturated with tomato flavor:(Other items:  Aloo beans, lentils and chicken curry were pretty tasty."], ["Wendy W.", "College student's best friend = free delivery.My roommate and I ordered chicken tikka masala, baingan bharta, chicken samosas, and garlic naan on very hungry stomachs... and had a pretty good meal on an otherwise lonely night.Thoughts:- Chicken tikka masala was a little too sweet, but still tasted really good- Baingan bharta was too salty, but still okay- Chicken samosas were yummy (but the brown ground meat made me question if it was really chicken?), and a little small for what we had thought we paid for- Garlic naan was too dry :'(The curry dishes come with rice (thank the lawd).Surprisingly, (this may be taboo, who knows) we really enjoyed mixing the baingan bharta and the chicken tikka masala together and eating that with rice. I am curious to try the other dishes and maybe even the lunch buffet, which seems to be a really good deal."], ["Wesley V.", "Definitely not among the most impressive Indian food I've had. Their lunch buffet is about $11.94 after tax. It wasn't worth it considering it was a disappointment. Out of the few items they had, most weren't so great. The tandoori chicken was a bit too fatty with very little flavor. The red coloring was still a bit powdery when they brought some more out. The lentil soup didn't have much lentils AND was bland. My idea of Indian food is the richness in flavor, but their food didn't fit that description. They took the longest time to bring out more chicken masala when it ran out. Considering that was probably the only thing with the most flavor, that really killed my hopes for this place. Oh yeah and the food was bit cold."], ["Sergio G.", "Tastes completely unauthentic. Maybe if you had actual Indians making your INDIAN FOOD; instead of a bunch of Hispanics, then it would taste better. Gave me diarrhea too."], ["Craig M.", "Really enjoy this place, especially for a late dinner near campus.  The staff are always fast and helpful and the food is good."], ["James-Michael L.", "The worst Indian food I have ever had. We tried the vegetarian and meat Thali. What a disappointment."], ["Ariah D.", "The food was delish! I had the vegetable samosas and the mana's special vegetable curry. Both were great and well priced.Also, the delivery guy was really nice and dressed very well. I will deff order from here again. It came within 30-40 min and tasted great. I am so glad I have a great indian place near by."], ["Yvonne H.", "Ordered delivery and even in rush hr, the driver got here on the time EAT 24 estimated. Very friendly. And the food.... BOMB.COM"], ["Syamantak N.", "Walking into the shop, I was feeling pessimistic about the food because of the shabby look of the place. But the food, in reality tasted really awesome. In short, if you are missing India and its cuisine while in LA, this is the place to go to. Lifesaver for Indian students at USC. Would have given it a 5 if it was a bit cleaner."], ["Vishal H.", "Good Indian restaurant in vicinity of USC.Paneer tikka masala tastes great.Some of the staff is a bit rude though, really should improve upon customer service."], ["Ahmad W.", "Basically, I couldn't figure out which bird/animal they had served in Chicken Tikka Masala. The Bhuna Lamb looked like half cooked!..The only thing which was edible was white rice, and they refilled the rice bowl for free too. Moreover, they give you free parking. :D"], ["Alex U.", "Love this place. Samosas are my favorite.  Pala paneer is amazing . My favorite chicken is the tandoori chicken . And gulab jamum is perfect with their hot tea. Love your food!"], ["Cullen M.", "I frequently get takeout/delivery from this restaurant through the Eat24 app. It's really close to USC, and they prepare the food pretty quickly--about 20 minutes. They include rice with main dishes, which is really nice.The chicken tikka masala is full of tomato-spiced-flavor. I like that you can customize the spiciness of your dishes, because there are times when I'm not in the mood to eat super spicy food. I also usually get the palak paneer. This dish is like spinach mixed with cottage cheese or something, and it's very rich, thick, and delicious. It's also very filling. I order what I'm used to ordering at Indian restaurants, and this place doesn't disappoint for the price point and reliability."], ["Connie K.", "I love the food here! It comes out hot, fresh, and oh so delicious.They do not skimp out on spices in their curry--it is full of flavor, without the guilt of sodium overload or incredibly greasy and oily food.Order anything with chicken--it always comes out tender and juicy. Also, don't forget the garlic naan.The staff is friendly and the venue is clean, despite it being busy. Pricing is reasonable. Overall, pretty decent place to eat!"], ["Sparsh R.", "Firstly and most importantly -  their 90% of business is from the Indian students at USC.  AND IRONICALLY,  they are the ONES who are treated like shit. There is so much attitude coming from everyone here at the management, especially from the owner,  who apparently has a pet peeve to remind everyone that she owns the place.Now lets come to the food part - as an Indian,  i can say this -  they certainly don't serve Indian food -_- the tandoori in buffet is cold and charred,  the chicken tikka masala is sweet,  the chicken  butter masala is even sweeter and i can go on and on.  In one line,  guys,  if you think this place serves you good Indian food,  i will tell it to you in a way you would understand -  this place is like the McDonald's for hamburgers -  you know it's not an authentic hamburger,  but hey,  what option you have?TO PEOPLE WHO HAVE CARS - GO TO ARTESIA FOR PROPER INDIAN FOOD. TO THE POOR STUDENTS OF USC WHO HAVE BIKES LIKE ME - SUFFER IN HELL."], ["Wanda T.", "Meh. I've experienced better.Im not sure if i just wasnt hungry, but I didnt even finish half of a plate. I was disappointed in the buffet option because it did not have alot of variety as I am use to. My favorite indian dish is the Saag Paneer, I was excited to try it here, but it didnt even have the right ingridenets =(i was very sad."], ["Yesenia M.", "Delicious food with absolutely amazing service. A hidden treasure by USC area. A must try. The cheese Nam is to die for. Great for a big group of people. Good Indian beers. You know the food is good when there's a lot of custumer from their own country eating here."], ["Anisha V.", "As a lover of indian food and being raised on really good homemade indian food, I wouldn't recommend this place unless you have really intense Indian food cravings. Their buffet is reasonably priced but the quality isn't great. Little known fact about manas is that they have a grocery store which is very low key but you find amazing frozen naans, curries and Indian flavored tetley teabags that i absolutely recommend!"], ["Richard L.", "Nice spot to grab Indian food walking distance from USC.  I ordered the paleek paneer (spinach with cottage cheese) which was served with rice and it was delicious.  The portion size was huge and could have easily been split into two meals, but being the beast that I am I was able to scarf it all down.  I will definitely be coming back."], ["Annie D.", "Amazing place! It could use a little more music to enhance the ambiance but not a problem because I was in the company of colleagues that had that shit downloaded into their phones so we were golden. The place is pretty small but once you walk in you know you're about to embark on a wonderful journey that you won't forget because you get that strong feeling that this is a mom and pop shop.The food was beyond an experience. I have to admit I haven't had Indian food for a long time which really heightens the experience. I ordered the lamb tiki masala with garlic nan and my colleagues both got the vegetarian combo. I wish I could've investigated more information about it for you but I was so hungry and thrilled that I really didn't give a care to be honest. My dinner came with rice and it was the perfect amount of food. The garlic nan came out hot and every bite after I dipped it into my masala was a moment I cherished slowly. It tasted buttery, flavorful and spicy. I don't expect great service when I come to places like this and they still exceeded my expectations. My water glass never got low which was all I was really expecting anyway. The prices were very fair. If I ever get the chance to come back to the area, I would love to come here again. This restaurant is as authentic as it gets! Ambiance: 4.5/5Service: 5/5Food: 5/5Prices: 5/5"], ["Apurva S.", "A perfect place to get good indian food near downtown and it wont hurt your wallet. Service is always top notch for us and many pick ups and deliveries were without any hassle."], ["X Y.", "\"Meh. I've experienced better.\"  -- Thats exactly my feeling last time I had A la carte at Manas. I keep coming here (JH Bajar) for Indian gorcery and I have tried various items from their menu as well as buffet. I have to say that lunch-buffet at Manas is the only thing which is close to good value for money. Mainly because you can find few items in buffet which would tastes OK/good. Also, quality of naan in lunch-buffet has deteriorated. A la carte is total waste of money. And NEVER order any of the Parathas - they were absolutely tasteless each time I got any. So, in summary: Lunch Buffet - 3.0/5A la carte - 1.0/5"], ["Meryl H.", "I wish I could give a lower rating to manas. Non veg is so bad here. I dunno what animals were harmed in the making. I generally hog any kind of food. This was not hoggable I would have rather just left the food entirely. Though service and the staff were prompt and kind."], ["Nicole S.", "I ordered delivery through eat24 that was on time and efficient.  The food was wonderful. I got the chicken tikka masala and the veggie korma along with garlic naan. Portions are big enough but not enormous. Everything was delicious."], ["Natalie B.", "This place is great! Best Indian food around USC area, hands down. Come for brunch for one hell of an all-you-can-eat buffet. There's plenty of vegetarian options (get the paneer anything) and the menu is full of delicious choices! I always get the mattar paneer with naan and raita. I gave this place 4 stars-- knocked a star off for ambiance (but it's hard to get a 5-star ambiance in that area so it's not mana's fault). 5 stars for the food though."], ["Johnson L.", "You cannot beat this place for its great and authentic Indian cuisine and for it being so close to USC. When you find a good place to eat near USC, you get it! The chicken tika masala was decent, but the mana chicken special is where it is at! Be sure to get the garlic naan too. They are pretty popular for their catering and take out. This place is a 5 minute walk from USC"], ["Jin B.", "always delivers on timechicken tikka masala from the gods.closes a bit earlier than i'd want it to but understandable.friendly service great guys."], ["Kadambari P.", "Food is very bland.... non friendly staff... if you in LA and looking for some option... keep this last in your list. Regulor customers are students and i am very sure they dont have any other place to go."], ["Youssef V.", "Great place.. I just came from there. got a lunch buffet.everything was tasty and service is great. Definitely will go back again"], ["Emily C.", "Mana's special chicken curry is the bomb!  Loved the coconut flavors.  Second favorite was the chicken tikki masala. Tomato based goodness. Both go well with warm rice. Sadly, when I went to the all you can eat lunch buffet ($9.99), the Mana's special curry wasn't offered :("], ["Janani B.", "We went for a weekend lunch buffet. The seating area is a little small but the food was okay. The naan and kulchas were good but the shahi paneer was a little too bland for my taste. There is a small Indian grocery store next to the restaurant. The only minus is you have to go through the restaurant to reach the store so we could see shoppers coming in and out of the grocery store which is quite inconvenient.The food is worth for the price of the buffet."], ["Adriana G.", "Love the lunch buffet. I love the different options. Excellent taste good service. Good Indian food!"], ["Harsh S.", "I would give 0 stars if I could. Horrible service and equally matched horrible food.Not Authentic Indian Food at all."], ["Anson D.", "Amazing food. Ordered a take out and they delivered the best Tandoori shrimp n lamb biryani. I still need to taste the samosa chole chat but I bet that's gonna be good too. Although I just realized I forgot to get a drink."], ["Sami D.", "Bad bad food . Worst indian food you can ever get . Never try this place . You are gonna hate Indian food if you eat here"], ["Jess C.", "Love this place.  I went for dinner last night.  Entrees are $8.95 and include rice.  I hate when you have to pay for rice separately!!!  Naan and tandoori breads are about $2.50 - as reasonable as it gets in LA.  Happy hour ends at 6:30 pm.  I got there just in time to order a $3 King Fisher. I ordered the vegetarian thali and mattar paneer.  Thali usually includes dal and the leftover curry the restaurant needs to get rid of.  But at Manas my thali had dal, mixed veg, and shahi paneer.  PANEER...in THALI.  Unheard of!!!!  I asked for extra spice and they almost delivered.  I could have gone spicier, but I understand it's better to overspice than to underspice.  My mattar paneer dish had extra fresh chilies on top - they tried at least.Yah I know we complain about the lack of Indian food in LA not in Artesia.  Manas is a good attempt.  They have Indian channels from DirectTV playing Bollywood videos and there are lots of Indian speaking Hindi.  There are a lot of USC students as well, but not the fratty ones.They have about 8 spaces in the back.  Seems like they do a lot of takeout business as well so you can park illegally there for a few minutes while you run in and get your bag of heaven."], ["Tater S.", "Fresh & Delicious Buffet, Reasonably Priced, clean & bright atmosphere with Bollywood Music Videos. What more could you ask for in this neighborhood?"]], "Anarbagh": [], "Taj Mahal of India": [["dawn O.", "Only reason it's not getting a 5 star is because it's not a \"fancy\" restaurant and you wouldn't come hear for atmosphere.  However if you are looking for consistently delicious food and great service- look no further. I have been going and ordering for delivery from there for years and I have never had a bad experience. love this place."], ["Francois P.", "Overall an average experience. We had our food delivered. Delivery was quick but Sag and Mataar Paneers were good but the Chicken Tikka and the Raita were disappointing. Rice portions were too small to accommodate the curries."], ["Leonard J.", "Went there yesterday day for the second time this week. Can't get enough of their biriyani. (Lamb) my absolute favorite. There naans are pretty good too. It's definitely worth the money nd a buck more. I will be visiting Taj Mahal soon. :)"], ["Jason U.", "Service: attentive and friendly. Water didn't go dry, didn't have to wait to order. Food: excellent. After two visits, we have tried the vindaloo, saag/palak paneer, coconut curry, and a few other dishes. All very flavorful, with rich sauces.  Starters and breads - there is a naan written into the menu with an odd name - the herbs & spices on it are very pleasant. 'Fried onion balls' were very good, but make sure you like onion if you order them. They had the consistency of a French beignet, and I thoroughly enjoyed them.Generally: seems to be a family establishment with care taken towards service, and especially food. Decor is unremarkable, but the food is definitely worthwhile."], ["Will W.", "Came here for lunch on a Friday afternoon. The place was empty at 1200, should've known better than to continue on. But we were in a rush and didn't have time to switch to another joint. So me and a friend were the only ones here and their lunch buffet. Walking towards the buffet the waiter then rushes over to take the metal lids off the serving trays. The Tandoori chicken looked a bit dry and I think it was Chicken Tikka Masala for the other dish looked kind of sad too. There were also several forgettable vegetable dishes there as well.After biting into the chicken, i'm pretty sure it was left over from last night. There was no way that chicken could've been freshly made. It was stringy and dried out or in the case of the tikka masala, it was a bit stringy as if braised too long.I was fooled by the good yelp reviews! This was a pretty crappy indian lunch buffet.On the plus side, I didn't get Delhi belly and get sick, so I've got that goin for me, which is nice."], ["Peter H.", "This is my favorite Indian restaurant in LA. They are very friendly, the prices are very reasonable and the food is amazing. Their chicken tika Masala and lamb Korma are my personal favorites, although the saag paneer is very good as well. The chicken is very tender and the flavor is perfect, not too creamy with a good kick of spices and heat."], ["Loreann T.", "This is based on their delivery service - 3 stars for average \"hits the spot\" Indian cuisine and an extra star for prompt delivery and price range.They take card via phone, and the guy on the line was nice, clear and patient. He said food would be here in 45 mins during the 6 o clock dinner hour and it arrived in time. The delivery guy was really nice too.The chicken tikka masala was on the sweet side but still tasty. We also had lamb vindaloo, which I suggest you specify medium heat (you can choose mild, med, or hot). Lastly, we ordered navaranat veggies, which was creamy and savory,  but I wished I ordered it medium heat too. The serving sizes were about 1 main dish per person, and it comes with a little serving of rice each. Garlic naan was a good size, but keep in mind they get soggy on the trip over. Taj mahal of India is also a great bang for your buck, dishes don't exceed $10 depending on your choice of meat (chicken and lamb are cheapest) so this is definitely my new delivery Indian food joint. Give it whirl and call em up!"], ["Lisa L.", "Picked up an order phoned in tonight. After taking the food home, noticed they missed an order. After consulting with my friends, noticed that they have a history of getting orders wrong as well."], ["Rachel S.", "Finally found my favorite Indian Spot! Previous favorite spot got new management and everything started to go. I'm not picky about service, but Taj Mahal startled me with kindness. I picked up a to-go order piping hot in 10 minutes. Saag Paneer was beautiful and truly unique to them. A magical Malai Kofta (potato-veggie balls in a yellow curry) had me swooning. Free rice and some garlic Naan and it's a perfect meal for 2. I didn't feel gross after (some places sauces' leave you in a coma) I can't wait to come back and try other things, see if they do vegan. Thank you Taj Mahal! You got a new regular."], ["Mike S.", "The BEST Indian food I have had! The owner serves, himself. Taste like home cooking. Ideal spot for someone looking to eat delicious Indian food and move on to the next destination!"], ["Nicole B.", "yes yes and yes!!! and the driver for delivery could not be any better! i saw him running to find my flat..bless him. and the food was perfect!!! tikki masala was on point. and spicy as hell just as we ordered. thank you!"], ["Sarah M.", "I ordered Vindaloo and my coworker ordered Tikka Masala. I ordered the Vindaloo medium spicy. It wasn't very spicy to my taste. My coworker ordered his Tikka Masala hot spicy and his wasn't much spicier than mine. We both enjoyed our meals. Very flavorful quality food. The only issue that both me and my coworker had was that we had our food delivered through Grubhub and we didn't receive any napkins or utensils :( At work, we were all out. Not cool... If they had included the napkins and utensils, I would've rated them 5 stars. You can't forget napkins and utensils when you work in the food industry! My coworker and I both agreed that we'd order from Taj Mahal Of India again. Next time I'm going to be sure to emphasize on the napkins and utensils :D"], ["Tara R.", "I love this place! To the owner I would say you have the chicken tikka masala  was so awesome that I would oder 100 chicken tikka masala . The food is the bomb. Com"], ["Ashish O.", "Basic food and decor is below average The price is low but the most advertised tandoori chicken was dry and not upto the mark .less variety but to be fair the chicken curry was delicious , the dessert was nothing fancy either .Overall a below average restaurant for a $10 meal"], ["Sean W.", "The owners and workers here at this restaurant are amazing :) I had an issue last night with grubhub, but the restaurant is really good and we're able to handle everything. I initially got very mad at them for no reason, but they were very kind. Will be coming back here often and will be recommending this place to my friends!"], ["Lucas K.", "I eat here at least once a week. I keep coming back because the people who work here are really really kind and the curry is insane. I love the Tikka Masala just like everyone else, also really dig the Saag Paneer and the Coconut Malai. The Lental soup is also awesome. If you like spicy food you cant miss this spot."], ["Alpha N.", "Lamb Curry and chicken tikka masala hit the spot. Reasonably priced and quick on the delivery. A bit scimp on the garlic naan, which is a necessity, so definitely order two"], ["S D.", "PROS: cheap prices, the garlic naanCONS: we asked for basmati rice and they gave us jasmine, the chicken tikka masala sauce tasted way too much like tomato sauce out of a can, sag aloo was not good, samosas were lacking flavor but were okay, the women's bathroom isn't the best and there is a sign saying they will fine you $100-$250 if you throw anything down the toilet except toilet paper and there is a teapot by the toilet :-| .... There is one server (at least on weekdays) and she rarely looks at you and you have to practically yell to get her attention, they don't have AC just fans throughout and on a hot day in LA that doesn't cut it."], ["Kyle B.", "Went here once and ordered online for delivery. The experience at the restaurant was amazing. The decor was stunning. High ceilings. Food tasted great and plated very well. Service was terrific too. Must get: Kulfi and Masala Chai. PLEASE GET THE KULFI, its made in-house and they don't use too much condensed milk in it. Delievery experience was phenomenal as well. Kulfi togo was still solid and made for a great dessert.5-stars easy"], ["Krystal G.", "This restaurant is amazing! They serve authentic Indian cuisine as well as authentic customer service! Will definitely be back to enjoy the food!"]], "Anarkali Indian Restaurant": [["Zainah A.", "Food was beyond amazing but service was terrible, very slow. The food took more than an hour to get to the table and we were only two. But, like I said, the food was great."], ["B P.", "What a bad experience.  I ordered through Eat24 and the delivery guy called 2x to explain that they were 9 miles away.  I don't know how it is supposed to work but I wanted to try a new Indian spot and they seemed to have what I wanted with good ratings recommend through Eat24.The tandoori chicken was dry and small.  The Korma was not very good compared to other Indian restaurants I frequent.  They either left out the garlic naan that I ordered or gave me some rendition of naan that was more like a cracker which I would never pay for.I am never someone to write a negative review unless is it was completely warranted."], ["Blake C.", "LOVE THIS PLACE!!!! After living in England for a year, I grew accustomed to great Indian food. I even had a few Indian friends while living there and they took me to the best places where they swore it was as if their mom or grandmother had made it. When I moved back to LA, I was horribly disappointed in the quality of restaurant offerings. After trying several, I gave Anarkali a try. It is far and above anything I've had Indian food wise stateside. I order from them at least once a month! The food is super tasty (it may take you a few tries to find the perfect level of spice for you in each dish) and I absolutely love it. I recommend their vegetable samosas, pakora, garlic naan (regular naan is great too), chicken tikka masala, coconut curry, chicken biryani, and sag paneer."], ["B A.", "I usually only log in to Yelp to give reviews for places I love, but I have to give this one star (but want to give it none).I can't fathom how my order last night could be so different from everyone else's five star review. Was it sloppy/rushed Saturday night cooking?My friend and I ordered in - she ordered biryani and I ordered tofu korma. Everything - down to the garlic naan, which I thought would be hard to mess up - was so tasteless, we didn't even finish the meal. And I don't just mean it lacked spices, which it did, but my meal wasn't even cardboard-worthy material.I gave the leftovers another chance today. I walked around nauseous for a couple of hours until I had to finally vomit out the korma. Then I felt better.Not only would I not recommend this place, I kind of want my money back for everything I ordered. I literally had to eject your food from my stomach. How did I pay money for this?"], ["Brenda M.", "This place is good. A bit on the pricier side. My friend and I decided to get the dinner special with the aloo goobi and saag paneer. They are my favorite!"], ["Andre D.", "I spent 65$ on a meal from this place.. And boy was I disappointed. The chicken tikka masala tasted like it came out of a trash bin, the pashwari Naum was hard and the chicken biriyani tasted the same as what a glass of water would(plain) no flavor... The only thing that was nice and that I ate, was the chicken tikka pieces and the sheek kebab. Such a shame and a waste of money."], ["Trice H.", "First time trying this place and it was really good. You can get food items either a-la carte or as a meal. Nice ambiance. Cute for date night or night out with friends. The staff is very friendly and attentive. I'll definitely go here again."], ["Zachary F.", "This is hands down the best Indian food I've had in LA. The chicken curry was absolutely amazing."], ["Monica K.", "At first glance, (or twice), you think, \"hmm...hmm... That Wing Shop next door is much more crowded and exciting looking than this Indian spot... Maybe this Indian spot sucks\". Well, I was thinking that in my judgy little head...But boy, I was alllllll wrong. This place is a hidden gem... You'll miss it (like me...twice) while driving.  Walked in and there isn't a soul to be found. Just me, my sister and my brother in law. \"Hello... Anyone home?\"(I thought to myself...)Then out comes this waiter whom I forgot his name! I'm sorry!!!! Noman Muhammad, I think. Anyhow! This guy and one other gentleman pretty much took care of us. The food was spicy, hot, fresh, full of life. Saffron rice... Fluffy. Yum. I really want to go back BUT I live 1 hour away from Hollywood. -_-I want to thank them for the free beers to try at home and giving us one free entree on the house. They were so sweet. Just amazing and loving service... I would go back for the spicy Lamb and Service. Perfect.  Thank you so much. Thank you for being patience with me too because I had no clue what to order!  This experience was heart warming. I'm glad we were the only ones in the restaurant... Made it more personal. :) Everyone else is eating those mediocre chicken wings next door! Lol jk...;) PS... Garlic Naan needs MORE garlic :) love garlic... Just drown in it!"], ["Rene B.", "We are visiting west Hollywood from San Diego. We love Indian food and found this place on Yelp. OMG! A-MAZNG!!! the food is to die for. Everything we had was delicious. We are definitely coming here again when we come back up. Mohammed and the rest of the staff were soooooo nice!  He found out we were visiting from San Diego and gave us free beers to to take with us and a free dinner next time we come up. Thank Mohammed. You are amazing!!"], ["Danny L.", "Had an absolutely amazing experience here! Came here with a group of my friends for a birthday and everything was perfect. Don't park at the residential areas cause if you read the signs carefully you need a permit. I had to drive around a bit before I could find a meter to park at. It wasn't until we finished our meal when one of the owners told us they have parking lot at the back of the restaurant!Now the decor is just absolutely beautiful. Was actually surprised how fancy the inside looked compared to the exterior. The place is dimly lit with Indian music playing quietly in the background. The food was all really good, I recommend the chicken tikka masala and an order of the samosas. But what I really want to talk about was the service! The servers and owners really made us feel like we were family. He gave us a bunch of free appetizers and a round of beers! Never been to a restaurant that was that generous! Will definitely be back!"], ["Vamanos H.", "I ate here all the time as a kid, even had birthday parties on the second floor. The bomb dishes are the papardom, chicken tandoori, and Naan.I had great memories here, including meeting Anthony Kiedes from Red Hot Chili Peppers, and Lily Tomlin. (It was a hot spot in the 90's.)"], ["Tabish A.", "It doesn't matter how the food is. If you keep table waiting an hour with no food and only have 1 waiter to host 8 tables.. You need to spend money and improve your customer service.The slowest Indian restaurant.Review update:Gave 1 more star, the food was not disappointing. But expected more after 1hr wait."], ["Bianca D.", "Best tikka masala and naan  I've ever had. Ambiance of the restaurant is really cool and the booths are secluded"], ["Verenice S.", "It was my first time ordering from this restaurant, flavor wise it was a-ok, what's upsetting to me is to see the guy dropping off my food smoking! Not only that but this restaurant is such a rip off!!! 2 small pieces of lamb with some cheap lettuce is $7! The chutney was by far one of the WORSE I've ever had in my life. My mom isn't Indian and her chutney is WAY better! Very disappointed of this place! I definitely do NOT recommend it!"], ["Britanni J.", "I had been craving Indian food for awhile, and I didn't want to go to our neighborhood spot off of Wilshire, so we decided to check this place out after looking it up on yelp - and it was 100% worth it! First off the atmosphere. The dining room is beautiful! A curry aroma sets the mood the moment you walk in.  It's smaller but that's fine. Two intimate rows of booths flank the middle Isle which is set up for larger parties (good to know for the future) We were greeted promptly and welcomed warmly. The server answered all questions that we had clearly. We decided on the Anarkali dinner for two, which was more than enough for dinner and lunch the next day. I asked if we could sub the meat curry for chicken madras (a personal favorite) and the server graciously obliged. Everything was ordered at a medium spicy level. The beef samosas were HUGE, perhaps a tad overcooked, but still delicious. My boyfriend's favorite was the chicken Tikka Masala, and mine the madras. We ordered the garlic Naan for extra and I'm glad we did or else we would've run out!  But everything was amazing and perfect sized portions. It was also a good meal to get if you are not sure what you  like and you want to try a few different things. We ended with mango ice cream which my boyfriend ate both of and enjoyed,  while I wrapped up the meal with a cup of Chai. The manager came by to check on us and we told him how pleased we were. He surprised us with two Indian beers on  the house! They were called Taj Mahal and it was a lager I think,  but if you are looking to try a beer from India - I highly recommend it! We will definitely be coming back and bringing friends"], ["Jacqueline E.", "It's always such a relief to go to a restaurant where you can actually hear your dinner companion.  If you've had a hard day at work, you can just slip into one of Anarkali's booths and relax.Of course, there's more to this place than just its beautiful ambience and low noise level.  I've been coming to this restaurant for ten years, and I've never had a bad meal.  It's always delicious ... so delicious that I can honestly recommend everything, from the samosas to the tandoori.  Also, the complimentary papadum spread at the beginning of the meal is the best in town."], ["Alexa T.", "Ordered for delivery from Eat24. From reading other reviews, I was expecting it would take 45 minutes to an hour to receive my food, which it did--so no surprises there (55 minutes). Food arrived piping hot (yay!), though as soon as I unpacked the bag, I saw they didn't deliver the dessert I ordered (rice pudding), but instead gave me gulab jamon (I think). I was sad, but they gave me complimentary poppadoms which were super yummy, and the dessert I did get was tasty, so it was a wash. I got the chicken korma & chicken curry, both medium, plus meat samosas & garlic naan. The star of the order was definitely the chicken korma--great flavor, nice & creamy, and it paired nicely with the saffron rice. Medium wasn't spicy at all, but korma doesn't really need to be burn-your-face-off-spicy--I thought it was perfectly balanced. But if you really like spicy, go higher than medium on the korma. I found the chicken curry just OK--flavor on the curry wasn't super deep, but in hindsight I would probably get it with lamb, instead, and probably hot instead of medium. It was serviceable--but the korma was better. Garlic naan was good. I've gotten naan from some places and with delivery especially sometimes they arrive burnt, but it was a generous portion and arrived hot. Samosas were just OK? I think I'll try the vegetable ones next time.All-in-all, I've tried four or five other Indian restaurants that deliver in my area, and Anarkali was the best--I'd order again, especially the korma. I want to order again to try and finally get the rice pudding!"], ["Robert L.", "You could not ask for a better atmosphere or better Indian food.  The owner is extraordinarily nice and attentive, the food is amazing and the price is right.  A must go!"], ["Gabby H.", "My fiancé and I have eaten at many Indian restaurants in L.A but this place definitely tops them all. We ordered some veggie soup, samosas, chicken tikka masala & veggie curry with garlic basil naan and a side of rice. It was all very delicious and on our table fast! We felt like royalty as the owner kept coming by to see if everything was ok. At the end of our meal we received a complimentary dessert (gulab jamon) which was also very delicious and a perfect way to end our experience at this restaurant. But our experience did not end there. As we chatted with the owner for a bit after having our yummy dessert, he asked if we liked beer. Of course my fiancé said yes, so the owner stepped away and came back with a couple of complimentary IPA's. Our experience at this restaurant simply got better by the minute! We had delicious food, excellent service, and the restaurant was pretty nice- loved the booths. We'll definitely be back and will recommend this hidden little gem. Thank you for the lovely hospitality Mohammed!!"]], "Paru's Indian Vegetarian Restaurant": [["Payal Z.", "Very cute place with a unique setting. I love their food. It is a bit hard to find as there are no signs outside"], ["Mike M.", "Im tempted to go on with details. Bottom line is if you like chef mic\"s style and flavor this is your place. I like fresh food and thats just not the case here. I had vegetarian Indian in Simi Valley a few years ago that was fantastic and fresh so I have a measuring stick. I will look that place up and write it in here later."], ["Frances N.", "The food isn't the best, and the atmosphere is not going to please everyone... but I personally love Paru's and I'm very happy to keep coming back here, since I live within walking distance and it's completely vegetarian. PARKING - 2 stars========-- Be careful about parking in front: the owner warned me that they ticket quickly!-- No parking lot; you can try to find street parking north of Sunset Blvd but it'll be a toss-up-- Easy to find the place: there's a huge, lit-up sign!FOOD - 3 stars=====-- The food is pricey but the portions are HUGE!-- The combos are the most fun, as they let you try out plenty of different dishes-- Maybe I should be asking for more spices/spiciness... Food could use more flavor.-- Mango lassi is sour; not in an off way, just a different tasteATMOSPHERE/SERVICE - 3 stars===================-- Bottom line: Don't be sketched out!-- The exterior: Paru's is located on a really busy stretch of Sunset between strip malls. As a result, you have to ring the doorbell to be buzzed in immediately; once inside, the atmosphere is much more friendly and comfortable.-- The interior is very dark, with heavy fabrics and decor. Not a bad place for big, casual groups, but it's not the airiest place to take a date."], ["Abhishek G.", "The food isn't that great. Menu is very messed up. Good service, but it is not sufficient for a revisit. Pooris are very deep fried, although it isn't very oily. They taste stale. Dosa is crisp, but they are both hard to eat. Rasam soup is kind of nice. Samosas are very tasty, although they are again differently fried. There is something about the frying method they follow. Yogurt was sour and rice wasnt consistent. Average experience"], ["Dhruv S.", "Best indian restaurant for both north and south indian. We Always come here when we visit  los angle (l.a). This Place is very clean and hygienic. Paru's serve tasty authentic indian food."], ["Luis M.", "Been coming here for years. My tip: make sure you bring an appetite because the portions are HUGE! I always order the Indian Thalie or Queen Parru.The food is seriously delicious. Their mango lassi is great. The atmosphere is very relaxed and friendly. My favorite South Indian restaurant in the LA area by far!"], ["UBuild L.", "I've been going to this spot for over 10+ years.  This is still my #1 spot for Indian food if I was to pick only One.  I've been to many good Indian spots but if you're in the Little Armenia - Thai Town area you might want to check this one out!  It's a small place but very pleasant with great Indian songs playing softly in the background. It might be a better place for a date night, business lunch/dinner, or catching up with a small group of friends.  Family can work but remember, it's very small and intimate.  And of course the food is fantastic!... especially if you're vegetarian.  I'm definitely giving this place a 10 out of 10.  If you don't like it the first time, come back and try another dish!  If you're looking for meat, don't come here unless you're \"open-minded.\"  Here's a few of my \"bread and butter\" items:  Sambar (soup), samosa, upuma, masala dosa, mix vegetables, vada (friend lentil donut), and the rice is good!  Come through, you won't be disappointed..."], ["Rajendra Réjean K. C. B.", "Paru's Indian is very good home cooking served in a splendidly dark and cosy atmosphere. It offers an experience that is good value for dollar on the whole. If you're thinking of dining here and you're in Los Angeles then you're probably in some sort of a motor vehicle that requires parking. If so, just a couple of paces to the East is Shakey's Pizza Parlour which has a large parking lot that is pretty convenient for all of your parking needs! This restaurant is an oasis of a hidden gem tucked away in a somewhat shady enclave of East Hollywood on Sunset. Hence the doorbell that must be sounded in order to get onto the premises. Once you get past the zombie apocalypse / riot proof iron gate you find yourself in a charming garden that invites you to dine al fresco in the Southern California sunshine. Do dine outdoors if you get a chance but more likely than not the surly waitstaff will shuffle you (and yours) to the back of the restaurant for their own convenience. This is somewhat understandable. What are you gonna do? Take a moment to peruse Paru's menu and you'll see that they've got both North and South Indian cuisine. I quite enjoy the thali which is sort of a tasting plate of various dishes. The masala dosas are pretty good as well."], ["Sonam S.", "We waited for an hour after ordering the food. And they started serving other guest who came after us. That got me impatient so I asked how long it will take, they replied \" those guest came before you so we are serving them first \". Then half my order didn't come with the food they served. The food had no taste, no salt, no spices. I would rate this \" 1 star \" only for the ambience.."], ["Michael E.", "My new girlfriend likes indian food so we came here last week. I try the Marsala pollo and she the lamb curry. It was caught aight. Service was cool."], ["Morgan R.", "I do believe this is literally as good as it gets for Indian food. A perfect little gem hidden in east Hollywood, close enough to the Pantages to be the perfect spot before a show. I love how it's like Planned Parenthood and you have to get buzzed in, adds to the charm. The food is amazing, it's the best Indian food I've ever had. Yes it's vegetarian, but even my meat loving beau LOVES this place, he actually introduced me to it! Things I defintely recommend would be the Queen Paru, the malagi podi - you delicious sand you, and the mango chutney. Get that, you won't be disappointed. I have tried a few other items here, but I always go back to that, the Queen Paru is perfection. Even though the food is spiced and all veggie - so full of fiber, I've never had any tum issues after eating here, so you're good to go sit for a few hours at Pantages without feeling bogged down.Also, bring you're own wine, they charge $10.95 for corkage. Paru's is super affordable, enjoy!"], ["Maria G.", "At first glance from the outside you may think you are walking into a shady medicinal dispensary but once you open the gates the cozy dining atmosphere.Entree portions are huge so plan to share.   Everything on the menu is vegetarian and some options can be prepared vegan.  You definitely get your money's worth."], ["Karen O.", "Nice decor and music, yummy food, good service, and a great deal. I got a vegan version of the Indian Thali. Since it was vegan -- and didn't include yoghurt, I was allowed to choose three vegetable curries and got the cauliflower and potatoes (aloo gobi), yellow dal, and spinich and lentils. All of the food was good, though I liked the aloo gobi and dal best. It came with a broth you pour on the rice, poori (fluffy bread), papad (crisp lentil crackers), a cream of wheat dessert (halwa), and soup. It was under $15 and I had about another meal's worth of leftovers."], ["Tito R.", "The BEST Indian Food on EARTH! Hands down. All vegetarian and full of wonderful flavors. The atmosphere is tranquil and unique. Hard to find from the street. Sometimes looks closed, but it's usually not. Ring the bell and you'll be thoroughly pleased. Ask the welcoming staff for their recommendations if you're not sure where to start. Samosas are da bomb!"], ["Jenny C.", "small, intimate, delicious. Their entrees and specialty courses are combo platters, so you can get a huge variety of food for one person."], ["Sandy A.", "Everything on the menu is really delicious at a very fair price, and it feels like you're in a home. I love this place."], ["Suzanne M.", "Easy going simple and comfortable! This place feels like you are walking into someone's living room! Starting with a doorbell at the front door, you get buzzed in, pass through a casual outdoor/garden area. The ambience out here is not tops but it's easy casual fine. Then you enter. It's great.A few tables surrounded by booths, lamp lighting, rugs, pictures in frames all over the walls. Small place. Delicious very traditional South Indian fare. No new culinary experiences to be had here, folks but reliable delicious comforty-type food served with a smile in good portions at very fair pricing. Great for two, four or a larger group.To me this place is always on the list."], ["Jay A.", "I read all the reviews on Yelp and really wanted to love this place.  Sadly I was hoping for a 4 star experience; however, Paru's is a 3 star restaurant at very best.  And it is a restaurant I will probably never return to.From the outside one would assume Paru's was closed.  It is in a sketchy part of Hollywood where they need to buzz you in.  However, once inside the locked gates I felt like I got off a plane in India.  The garden reminded me of outdoor dining in a major city in India.  We chose to get a booth in the formal back area.  The place is very pretty yet quaint.  I did love the décor.  I ordered a $4.95 glass of white wine to start.  It was decent, just a tad pricey for the part of town we were in.  Then chose to begin my meal with the Dal (lentil soup).  At $5.95 it too was pricey.  Problem is the soup was too spicy for my taste.  I could not eat it so my friend had to enjoy it alone.  It came with a piece of pappadum.  Guess they need to justify the $5.95?My main course was the Queen Paru plate which our waiter recommended.  It was not very good.  The dosa was mediocre.  I love dosa and expected those lovely light crisp rolled up delicacies I get in other South Indian establishments.  This dosa needed help.  The filling lacked flavor as well.  The coconut chutney one dips the dosa into was awful.  The chickpeas (chana masala) were too firm yet tasted okay.  The idli was good.  The menu says you get two pieces but I only got one.  The sambar tasted more like lentil soup then sambar.  At $13.95 this Queen Paru plate was just not up to par.Dessert was incredible for some reason.  I ordered the hot sweet nut cake.  It was one of the best Indian desserts I have ever had.  The dessert is what convinced me to give them 3 stars.  Up until that point I was ready to write a 2 star review.  In fact it may make sense to go here just for this dessert.For what you get this place is not cheap.  The employees are super nice and the decor is amazing.  But the food had challenges.  It was as if they assumed we knew nothing about South Indian cuisine and decided to just serve what they wanted."], ["Jennifer L.", "The quality of the food is great - I love the dosas and the curries! The interior of the restaurant is small, intimate and well-decorated.  It's a good place to go on a date or just to catch up with friends.  There's a garden-pathway entrance that looks like it comes from a storybook...but remember you're really in East Hollywood and there's a 99 cent store down the corner and limited street parking."], ["William N.", "I have been going to Parus for two decades and it never ever fails to live up to expectations.  The food is TOP NOTCH, the prices are reasonable, and the service cannot be beat.True story - June 2000 I took a woman I met at Ye Olde King's Head in Santa Monica on a first date to Parus.  She'd never even HAD Indian food before, let alone vegetarian Northern INdian food.  She was so blown away that we got married!  Yes, that's right.  OK we got married 3 years later, but it was still a great first date.  We go back for anniversaries now!Recommended: THe soups, the masala dosas and everything."]], "Electric Lotus": [["Sam M.", "Don't be fooled, this isn't the old Electric Lotus, the one that was a few blocks away a few years back. Now I don't care if it is or isn't the same owners. The original Electric Lotus was cool. It was funky. It had an ambiance and a mood, a great mood. And on top of that, the food was great. This new place has no ambiance, it's much smaller, and the food is just okay.I used to go to the original Electric Lotus often until because I got busy with life I stopped going. That was a few years ago. Then we decided to go again and I was surprised to learn it had moved. I figured, it must have been a lease issue. But no it must have been more.Now to be fair, the food is decent, very decent and the portions are generous. I may go back again if I'm in that part of town, but I wouldn't care to drive from Pasadena like I used to for the old Electric Lotus. Also, I server, even though a little interesting, was very helpful and fun."], ["Matt P.", "We're pretty lucky to be able to say this is our neighborhood Indian spot. We live about a 3 minute walk away, which is certainly an incentive. But the real draw is the terrific food, the laid back vibe, the funky, pleasant decoration, the very reasonable prices, and the always attentive service. For a while there was a waitress who was there every single time we came in. We haven't seen her in a while, but lately Todd and Ashley have been the ones on duty, and they're both great. If you're looking for good Indian food and a lovely night out, this is it."], ["Diana S.", "Enjoyed a wonderful meal here last night with a dear friend.  Ashley was very accommodating in adjusting an ingredient in some dishes, and was just lovely, great service!Todd is also a hoot, as well as a great server.  I look forward to returning.  We were made welcome the moment we walked in.  Todd and Ashley should reach a course on customer service to every one in the service industry.Top drawer all the way. Thanks for a wonderful evening!"], ["Justine J.", "Excellent Indian food in a vastly underserved Indian food area. Love the food, love the atmosphere. I really love the saag paneer and the saag with lamb. Also, the curries are great, can get them hot or mild, and the price is very easy on the budget. Highly reccommend!"], ["Priya G.", "SO OVERRATED!!! Eating Indian food growing up and at various restaurants in Los Angeles, I cannot imagine how some of the other yelpers have said this is the best Indian food in Los Angeles. In my humble opinion, Manohar Delhi Palace (who caters every Indian wedding in Southern California) outdoes this restaurant by a lot. The ambience here is nice, but needs work. It is dimly lit, with Moroccan lamps everywhere, and the seating layout is also good. However, when we first sat down, they did not have any music playing and you could hear everyone else's conversations. I jokingly told our waiter that they needed some good Indian tunes and he told me that they use Pandora, but the Ravi Shanker station they use starts and stops and is unpredictable, although the David Bowie station does not do the same. They ended up putting on the super American music (totally clashing with the theme), which was better than nothing.The food here was average at best. We started with the samosas, which were good. It did not go unnoticed that they brought a caddy of chutneys that were refrigerated. A lot of Indian restaurants in Los Angeles nickel and dime you for each chutney order but they didn't. We ordered the shahi paneer dinner plate which came with chole and saag paneer. It was out in less than 10 minutes and I immediately noticed that it looked very different from that shahi paneer I have had my entire life. I took a bite and it was not good at all. I asked our waiter if this was what we ordered and he said yes. I told him it does not look like the traditional dish we usually have and he was pretty confused. He offered to switch out the dish for the popular electric paneer which I thought would be a good option. It was definitely better then the shahi paneer but still just okay. We still paid for both.I ordered chai but it didn't come out till after the food and they didn't bring any sugar. :-/Overall, this restaurant definitely is not meant for Indians. The food is lacking in flavor and is not authentic.  However, I really appreciated the great service and smiling faces."], ["kendra f.", "Super yummy and comfy on a cold/rainy night!! Big portions for good prices. Oh and Todd is great!!! And James too!"], ["Miriam A.", "Food is absolutely delicious. The chicken tikka masala, the shrimp, the spinach, samosas, rice with onions and peas, and regular, cheese and garlic naan are all to die for. A little bit on the pricer side, but well worth it. The atmosphere is soothing as well. I go here at least once a month!"], ["Sean H.", "Ever have that problem where you want one of EVERYTHING on the menu at a great Indian spot...but you know ordering 3 entrees would a) be too much food and b) be super expensive?Electric Lotus has you covered!Todd suggested I deviate from the a-la-carte Manu and go with a Dinner, affording me my beloved Chicken Tikka Masala, 2 vegetables (Saag acquired!), and Naan...all at a reasonable price.So here I am, with a mountain of incredibly tasty food - literally eating everything I want - ok ok OVEREATING - while Todd and the staff are looking after me and ensuring I've got everything I need.Happy tummy, great service, fantastic location, and wonderful atmosphere...Electric Lotus has it all."], ["Danielle G.", "Yeah, I just love Electric Lotus. The food is delicious and you can eat for days with the portions, which makes it a great value for the price. AND THEY DELIVER to Atwater Village! This new mom couldn't be happier."], ["Brad A.", "ITs NOT CLOSED! Great food at great price....why does Yelp have it as closed? Got the Lamb Korma lunch special... A lot of food!"], ["Mireille D.", "Every time I go to Electric Lotus, I think \"Today is the day I need to write another Yelp review\"... and somehow I never get around to doing it. But I've been so many times now, and I always enjoy the experience so much, that it would be bad karma if I didn't write about it. What can I say? It's yummy, it's a really good deal, it's a nice place for a date without being corny, and the waiters are always super nice and attentive. Also, I love that there is something for everyone. I eat everything, but I've been with friends who are vegetarian and vegan, and everyone can find something to their taste.When we go with my boyfriend, we usually get an a-la-carte entree, as well as another entree as a dinner plate (which includes two sides of the day, some rice, plus a naan bread). There's always enough left for a nice lunch for one of us the next day. Among my favorites are the aloo gohbi, the eggplant entree (can't remember the name), the saag paneer, chana masala, and the lamb mint curry. But really, I have yet to find something I don't like. It all delicious!"], ["O G.", "Ironically and contrary to form, I didn't really order \"Indian\" food per se here, but my experience was really nice just the same. Actually, I was quite pleasantly surprised. But JSYK, I have eaten here before and did find the food to be quite flavorful and authentic. This time, I only ordered the Veggie Soup and the Vegetable Salad. (Or was it the Vegetable Soup and the Veggie Salad?) Well, anyway, the place was crowded to near-capacity, but Todd the server quickly and efficiently took my order. The soup and salad arrived simultaneously and I was really blown away. The salad, costing less than $5.00, was HUGE. All kinds of fresh veggies adorned it, such as red bell pepper, cucumber, tomato, etc., and its substrate was layers and layers of fresh dark greens. No wilting iceberg lettuce turning maroon at the edges here! It came with a large canister of a desi-esque (that means Indian subcontinent country style for you honkies out there) buttermilk ranch dressing, which I used about half of. Another nice touch (not terribly Indian but who cares?) were the crisp (not stale) tortilla strips on top!The soup was also marvelous: piping hot in generous portion, with a heady, seemingly authentic desi pungence, served in an elegant copper karahi. Chock full of fresh cauliflower mini-florets, green peas, carrot spears, savory potato chunks, etc., it redoled exotically of cinnamon and just a tinge of cumin. Perfect, really. Todd does get a bit rattled when it is busy, but don't mistake his \"way\" for rudeness or arrogance. He genuinely cares about your culinary experience and it soon shows. When things settle down later, he lets his hair down a bit, and he's really a great guy. I also observed that he practices genuine compassion in his work in a way that truly impressed me."], ["I G.", "I've walked by this place countless times. Its right in between Public House, a popular sports bar, and Sidewalk Grill, a great little mediterranean restaurant. So, there we were, dinner for 5. I've eaten at every place on Vermont, except for Electric Lotus, so had to finally try it. The food was great and really hit the spot. Chicken tikka, Chicken masala, the rack of lamb, and of course, that beautiful, soft, delicious naan to die for. The waiter was a bit weird. But the food and wine was spectacular. It doesn't get very crowded, so getting a table is not a hassle."], ["Mariah R.", "This place has really gone downhill since I posted my last review. I had such high regards for this restaurant but I feel as though I was really let down. Yesterday when I came in with my friends and was very excited to have a pleasant meal. Our night started off great and our waitress was very nice but when we spoke to her about the calamari appetizer her mood completely changed. We had all taken a few bites of our food and found that it tasted very rubbery with loads of grease. Our waitress sassed us out for eating too much of it and walked away like we had offended her. Food was good but extremely buttery and greasy but we felt as though we could not speak up about it. Great night but bad service.Hispanic man with mustache is extremely kind and polite--he deserves a raise"], ["Eric S.", "This place is our go to Indian spot in LA. Always fresh and generous portions. I had the Mint Lamb Curry with Garlic Basil Naan and my date had the Chicken Masala with Basmati rice. I had a chai tea which was spicy. If you're craving Indian food this is the JAM!! Todd was our server, a baritone with charisma and hospitality. James rocked the house too. See ya guys soon!"], ["Carol H.", "Monday evening on our way to the Greek Theatre we stopped at Electric Lotus for dinner.  (First time, found the place on Yelp.)Our waiter, Todd was excellent, he recommended us (two people) to order one dinner plate & one a-la-carte dish.  We ordered the ChickenTikka Masala dinner & a-la-carte Chicken Vindaloo.  It was perfect amount of food & we saved $6.00 not ordering 2 dinners.  The portions were very good size & the dishes were very tasty.  We will definitely return!!Thank you, Todd, for your recommendation & the great service."], ["James V.", "I have been coming to and ordering Electric Lotus for years, in both locations. It has consistently been great, I'm never let down! Tonight Todd (an excellent dude) recommended the rack of lamb which in all of these years I had never tried and now I have a new favorite! The meal deal is the perfect amount of food, which is often difficult when ordering Indian..."], ["Paula C.", "This restaurant, Electric Lotus, gave top notch service tonight.  They custom made my soup when I asked for extra garlic and the soup was under $4. The garlic naan and the in house chai were delectable. I received exemplary service from all the staff. This place is a hidden treasure!"], ["Susan C W.", "Excellent. I was afraid EL wasn't going to be as good as it used to be but it was delicious. Todd and Ashley were great. Helpful with what to order and were prompt and friendly. The Hot could be a bit hotter so if you lie spivey you should tell them so. Chicken tikka and lamb korma was yummy!!!"], ["Shilpa Y.", "Electric Lotus is the rare indian restaurant located on a trendy street in Los Feliz that appears to be operated by non-indians. The decor and ambiance are eclectic and cool. The menu is quite large, and the portions are ginormous! Any of the \"dinner\" combos are large enough to easily feed two hungry people. I thought the food was decent, and was only disappointed by the undercooked garbanzo beans in the chana masala. We ordered \"rice pudding\" (kheer?) for dessert which was good but a little too runny for \"pudding\". I wouldn't call this the best indian food in Los Angeles, but it will do if you're craving a naan and some paneer, as we were."]], "Anar Indian Restaurant": [["Lauren J.", "I've ordered from Anar multiple times and have had some delicious meals. My only issue with them is when I called to add an item to my order and instead of the guy who answered the phone listening to one syllable from me, he immediately told me my order was on the way and then hung up the phone. I was also trying to communicate delivery information, so I was very put off by the lack of customer service. Otherwise, the food is great."], ["Sreenivas S.", "After having different cuisines during our vacation, me and my wife really craved some home (Indian) food. Went to Anar in a strip mall near Hollywood. Interiors are charming. Took a look at the menu and saw Gulab Jamuns! Definitely going to order that! Or will we??We ordered:Veggie samosas these were actually great. Chicken Biryani we ordered this spicy but was a disappointment as this really did not have much flavor at all. Very bland. Chicken coconut curry - I don't think this was made in a coconut milk based gravy. Felt more like cream based gravy with some kind of flour mixed in to provide thickness. Tasted ok but was way too sweet almost like dessert.  Seeing that the Biryani was not flavorful we asked for a mango pickle to spice things up but sadly that was way too sweet too. Finally wife ordered a masala black tea. To our dismay, this was also sweetened way too much. We left the place with a sugar high. No way we could order that Gulab Jamun after all that sugar intake."], ["Erik B.", "I guess I should have taken more time to read the Yelp reviews on Eat24. !!!!DO NOT ORDER DELIVERY!!!!I ordered some food for my family via Eat24. It took over 2 hours for the food to get here. By then the kids were sleeping and the food was cold. The food itself wasn't that great either, the Saag Paneer wasn't well done at all; huge chunks of spinach, tiny dots of paneer, and so much cream the dish was white. The Matar Paneer was the same, so watered down it was more a soup, with tiny dots of cheese too. I pretty much just tossed it all in the fridge, and maybe I'll have it as left overs some day this week, but over all it's a total loss. See ya $40..Overall, not a great experience.Oh ya, the funny part: My family is vegetarian, so they threw in 2 free MEAT samosas. Gee thanks..."], ["Ralph V.", "The owners here are very special people !They really care about theit customers !The staff is always polite and when something is wrong the accept the mistake and do their best to make up for it and make the customer leave with a big smile in heart and in the belly !I really love this place and will continue to visit !Excellent Food !Great Food !Once you go you Will be drawn back by the food, the atmosphere and the politeness and caring of the staff !Great job guys !"], ["Magdelina G.", "I was there last month visiting California from New Jersey (finally have time to review)I have to say. This place food is absolutely amazing!I have never tasted such amazing Indian food ever.The spice level is absolutely perfect. The food is well cooked. We even ordered food to go for our folks that we went to go visit. The chicken biryani was my favorite! The appetizer sample is great as well!The service is very nice!I highly recommend this spot!Byob! Next door there is a liquor store, bring your own liquor!"], ["Jennifer S.", "Horrible. For real. I made an online order for delivery for lamb tikka masala and it came burnt. They must think that the sauce hides the charred taste of burnt meat. There is a $25 minimum for delivery. For that price, I'm going to need for you NOT to put my mango lassi in plastic ware, and put it in a to go cup with a straw so I can drink it like a human and not out of a bowl like a dog. I'm going to need for you to give me a fork, and napkins. Yea, it's being delivered to my house, but what if I just put all my dishes in the washer (which I just had, actually) and I don't want to dirty one? What if I'm just moving in, and my stuff is in boxes? Do I just eat it with my paws? For the prices you're charging, I'm going to need for you to, when I call about having burnt food, to NOT tell me some ol' bullshit like \"We ROAST our lamb in the oven first, so some pieces may be brown.\" Now you're insulting me. Not as a foodie, (who eats Indian food ALL THE TIME by the way) but as a human being who knows the difference between burnt meat, and roasted meat. Not because I'm a foodie, but because I have a tongue in my head, along with these cool little white things called teeth. When meat crunches and taste like tires, it's burnt boo. Don't do me like that. Bye Anar. NEVER AGAIN."], ["Elleax S.", "Anar is the LAST good restaurant in Hollywood. Great flavors, fresh, tasty chutney, and warm naan. I can't believe I used to go to Masala Grill on Hollywood! Anar really does put that place to shame. Plus they deliver & have lunch specials. Yum yum heck yeah!"], ["Bashkalov B.", "Greet from Ukraine,Yum yum! Bashkalov Babadook love Anar Indian restaurant!Is big fan of India food, yummy yum, and this some of best. gots to go and was happying. Babadook has chicken masala and was excalent. Pefectly tenderness excalent masala sauce, get it very spicey!. Extremely nice garlic naan too, and greats for dippings in masalaIs happy, will returning. Reminds me of food from the old country that great aunt Rafaela Babadook used to make, before dreadful Cossacks and proletariate took all away n made poor old Bashkalov leave for USAs... ok thanksB. Babadook for Keiv Ukraine"], ["Abo Rajaa A.", "Best delicious indian food in los angeles. Highly recommended this place for everyone who loves delicious indian food. My favorite favorite dish on there list is the chicken tikka masala because its on point with the perfect spice and very tasty. The restaurant is very clean and the server is very nice and helpful. Go and try them or do delivery!!!"], ["Brian C.", "I had excellent Chicken Tikka masala and lamb nann, great service too. Ill be back again, thanks guys."], ["Wes M.", "Good indian food in a sort of hidden location that I'd never trust if I hadn't seen other good Yelp reviews. The food was exactly as expected, good Indian food. My only complaint was that the service was slightly slow since we were the only people there the whole time and we had to ask for more water and napkins twice. Staff was really nice though and I'd definitely go back."], ["Jamil M.", "There is no one better than ANAR. I just wanna say,Good good good everything is good and Mr.SHAHAD such a good waiter ever I have seen!See you soon guys!!!!!!Thanksssssss"], ["Felicia M.", "***Delicious*** I was a first timer for Indian cuisine and why oh why did I wait so long? Of course when my friends asked for a good place I pulled out my phone and went straight to my ever so faithful yelp app. Found this place and so glad we did. The inside is not very big but cute and charming. The booths are quite small so we opted for the table. Especially if you plan on ordering a few varieties of dishes to share a table is a better choice. From what I observed it looked like they were getting much more take out and delivery business which makes sense due to the size of the place and the deliciousness of the food. Anyhow, I had no clue what to order so I let my friend handle the biz. She ordered garlic naan, vegetable samosas, Chana masala medium spicy, coconut chicken curry dish mild and a spinach paneer mild. The dishes came with house soup and rice. The house soup was so good. It was cold outside and we walked there from our movie and the soup hit the spot. It was perfectly seasoned and was so tasty. The samosas were tdf! Perfectly crispy on the outside and the potatoes were soft and so yummy and slightly spicy on the in together with the yogurt sauce made it a hit. Not having Indian before I had no idea what to expect but once I started to taste all of the wonderful flavors I had an idea of what each dish may taste like but each forkful was a surprise of different flavors. The Chana was my favorite! Chickpeas in a tomato based sauce that was spicy and went perfectly with the rice and naan. Every single spice went perfectly together. The spinach dish and the curry were also perfect. My friend that has had Indian many a time said that this was some of the best she has ever had. The prices are super reasonable and besides that there was a $10 off of $40 check in offer that made the deal even sweeter! I will definitely becoming back when I am having my Indian craving. Perfect little place!!"], ["Crystal L.", "Went back with another Amazon Local deal...  got the vegetarian dinner for two, which at $28 was a really good deal.  Way more food than we could eat at one sitting...  including a dessert.  It was my girlfriends first introduction to Indian food and she really enjoyed it.  This is a small-ish little storefront that does a heavy delivery business, but there is a parking lot and the service is always very quick (I've almost always been the only table in there) and helpful."], ["Anthony N.", "This is the best Indian food in L.A. ! I've ordered delivery from this location and boy was the food fresh, clean and tasty. Im love the beef tikka. It's almost a kobob like skewer of marinated beef. Very juicy and full of flavor.The chicken masala was amazing as well. Full of flavor, clean and light. Made with nice chunks of chicken breast. The chicken tandoori was delicious as well. I definitely recommend to try that.The food overall was delicious. I will definitely order from here again. The only caveat is that the portions are pretty small. You will need about 2 dishes per person."], ["Asad A.", "I've ate here a couple of time and its quite good. Not the most fancy restaurant especially to sit down and eat but the portions are really good and the price is decent."], ["Penugonda S.", "Was the worst restrnt that i ever seen,No service,No taste,No AC,No cleanFinally nothing"], ["Jackson H.", "No matter how many times we eat here it's always the same..... AMAZING! I have never been disappointed!!"], ["H F.", "I love this place for Indian take-out!  I frequently ask the people working there what they recommend and what are the most popular dishes, and they always lead me in the right direction.  I recommend the Sag Dal (spinach and lentil curry) and Sag Paneer (spinach and cheese curry) to my fellow vegetarians, as well as the garlic naan."], ["Brooke N.", "Best little gem in the neighborhood. Good service good food. Eat here at least once a week."], ["Maksim P.", "Try lamb tikka masala! Really good, you won't be disappointed.Also I liked samosa, delicious.Curry is ok.This place is good for to go or dining in, do what you like.One thing, prices are a little bit expensive, but they have a lot of specials, such as a check-in discount and coupons, but don't forget to ask about it in advance:)"], ["Lili H.", "Ordered delivery twice from this place, left my cell phone number, instructions to open the gate, an hour later waited outside for thirty minutes and no one ever showed.  The restaurant closed without even attempting to contact me or deliver my food.  Don't order here. Nothing but bad experiences and going to bed hungry. Wish I could give zero stars."], ["Deepthi T.", "Pls don't go this restaurant if u are an Indian and expect Indian foodThey gave us chili naan which way full of jalapeño yucki Pls don't go if u are thinking of having good digestion Spoiling Indian good and name Too bad hospitalityAnd lastly they gave us sambhar instead of soup and that too was ROTTEN"], ["Bryce T.", "The best Indian food in Los Angeles.  I have tried many indian restaurants and this one is the best.  They even have chicken wings you can get.  The chicken tikka masala, chicken makhani, and sag paneer are my favorites.  Shrimp biryani is also great as well.  Either way this is the best and there's no need to go anywhere else."], ["Joey R.", "Good was ok - not bad, but just lacking real flavor and spices and heat.Delivery took about 60 minutes and we believe the driver was scamming us as he presented us with a paper hand written receipt that was a higher price than what we were told over the phone and claimed the extra $6 of charges was the taxes to our $35 bill"], ["Martha E.", "This is a hidden gem. The location is small, but don't be discouraged. I ordered chicken tikka masala, beef samosa, basmati rice and chai tea and it was all delicious. Loved the taste of the chicken tikka masala. I recommend this place."], ["Mauricio C.", "Ordered for delivery.Said an hour, took an hour. So that's okay. Ordered tandoori mixed grill. Included beef, chicken, and lamb. For 14$ I felt it was too expensive. Sitar on Pasadena also included shrimp and fish for the same price. The tandoori was excessively seasoned, and seemed a lot more wet, than \"grilled\". I also ordered chicken tikka masala. The sauce was on point! Very delicious. Also had garlic naan, and rice. Both very delicious. Over all, I'll be hesitant to reorder."], ["John A.", "I love Indian food and was excited when Anar opened up. It's in a rather ghetto looking strip mall but don't let that deter you. Have had it a couple times and have always been pleased. The Tikka Masala is a bit on the thick side but still tasty. I usually order online and go pick it up. Tonight, I'm not feeling so well so I opted for the delivery. Apparently, I'm the only one who has had a problem. I waited over 2 hours for food from a restaurant that is literally walking distance. Driver said he was here for 10 minutes and apparently both my bell and cell phone weren't going through. I'm finding that really hard to believe. nevertheless, I won't be opting for delivery in the future as it's not worth the aggravation. Food was finally delivered and the driver had \"friends\" in the car. Guess he had to go pick them up and have a beer first before bringing my food over."], ["Mister Y.", "I can see that my one-word review: \"Crap-nar!\" was removed. In all fairness I accept the scolding from the Yelp censors but I still consider it one of my best reviews, if only because it makes me laugh each time I think of it.But let's get serious before I get myself into further trouble.We ordered delivery. It took two hours to arrive. It was well packed and all the necessary eating implements were provided.The samosas tasted like burnt tires.The rice was bland and left you a wet-blanket feeling.Chicken Tikka Masala was edible and I was starving and I ate it like the little piggy that I am.My wife ordered lamb and she said it was a sad lamb.The vegetables were nothing to write home about ...but apparently worth writing on Yelp about.All in all, I rather eat here than starve but if 7-eleven is open I might be willing to settle for that convenient store gourmet cuisine."], ["Edis B.", "This place had very good food its very tasteful !and have I mentioned very attentive staff . Watch out because you can easily miss it ! They were very quick with bringing food out. And the Samosa are a must specially the vegetable ones!"], ["Neil W.", "I love me some Indian food, but I'm always a little wary of checking out a new place.  It is, of course, the only REAL way of finding out if they're good or not.  I I felt like I had been getting delivery from Thai places a lot, so I changed it up with Anar.  I had a hankering for Chicken tikka-masala. Theirs is really good! One thing to note is that after ordering it a few times now, every time, their chicken has been amazing. No grisly parts, or anything like that.  Always great portions, and the sauce is full flavored.   The meat samosas are among my favorites (Ok, I\"m still a carnivore), LOVE THEM.  And hey, if you order $ 25 worth of food, they throw in one extra for you - free!The chicken tikka is delicious, as well.  The Molai Kofta is yummy, too.  Also enjoyed the Matar Paneer and the Chana Curry.The naan is always soft and warm, and the Pulao Rice (white basmati) is savory and so good with any of those sauces on it.So far, not a bad experience on the food and delivery.  I suppose it's slightly pricey for some things - it's easy to end up with $ 25 worth of delivery - but I don't mind if the food is good. Plus, I can usually get a couple meals out of it anyway.Anar has become a staple on my delivery list.  :)"], ["Amanda P.", "I ordered delivery through grubhub. Great food for great prices! I ordered chicken tikka masala, sag paneer, rice, garlic naan, raita, and two orders of kheer all for about $30 after tax and tip!Everything tasted great and it was probably enough food for 3 or more people. I would recommend everything I ordered, except the raita. It was wayyy too salty. I especially liked the kheer!"], ["hhhhhh g.", "I would give Anar 3 and half stars :)The best Chicken Marsala I have ever had!  The spices were on point. The best Vegetable Samosas I have ever had!  It was just so moist with the slight crunch it kind of melted in your mouth.  The spices were also so awesome.  It was not greasy.I have had better Lamb Korma, but it was still very good.Unfortunately the mint and tamarind chutney was the worst I have ever had.  Way too watery chutney and the taste of the tamarind was almost non existent.The naan was fantastic.The prices are on point!To be honest if they fixed that chutney I would more inclined to return, which I would still return, but since I have had better Indian food in Burbank I still want to venture out and find the perfect Indian Restaurant, but still very good!"], ["Mark D.", "Curry was too salty, chicken tikka had a whole large breast, but it didn't make up for the fact the sauce was too sweet.  Portions sizes are smaller than most places."], ["Billy W.", "DO NOT BE PUT OFF THIS PLACE by the fact it's on a strip mall or the interior decor. We almost walked on by and SOOO GLAD we didn't. I am a Brit and have worried about attempting Indian food here in the states as its so so good in England. Wow. This place is amazing Food 10/10. So so goo. Ha chicken tikka to start , then masala for main. So so so good. Polite and efficient staff. It deserves to be busy. Economical and great food."], ["Alex C.", "Went to this place on 2/21/2015 after the Golden Raspberry awards since 33 taps had a sewage problem that day, It's Pho was take out only, Panda Express was closed and I didn't want to go to Subway.  I sit down and overhear the wait staff talking about the most mundane crap.  \"Oh, i'm going to beyond wonderland....I know that stripper at Deja Vu..... Yelpers are fucking crazy.  That girl left a bad review about the mango lycee. Only crazy people leave bad reviews......Did you talk to the guy with halitosis?\" I ordered the dinner for the chicken tika masala.  They spilled sugar into it.  The rice was dry and clumped together.  About halfway through the meal, I bite onto something slightly hard and painful.  It turns out it was a piece of SCOURING PAD.  That warrants a highly negative yelp review or maybe i'm just \"crazy\". Right.   Don't go to this place if you don't want to find pieces of scouring pad in your food."], ["Buzz P.", "Came here on a Thursday night with my daughter. All of the other guests dining here were Indian, so that was a very good sign. :-)We were looking for some grain-free and dairy-free Indian options and this place could accommodate us, as their curry sauces are grain/dairy free. We had the chicken madras dinner and the chicken curry dinner. Came with lentil soup and rice. Waters to drink. You can select the spiciness of the meal, and we had mild and medium.The lentil soup was good and the curry dishes were excellent. Our check was $30 and change after tax. The restaurant is very small and had typical decor of an Indian restaurant in a strip mall. Service was a little slow but not bad. Also, I noticed they had a TON of deliveries going out the whole time we were there which is also a good sign. I recommend and would repeat."], ["Veena G.", "It's ok. Nice customer service and quick but I'm Indian and I love truly authentic food. The channa masala was loved by my kid but it tasted like garbanzo beans in tomato soup. It was good just not what I was looking for to hit the spot for Indian food"], ["Vijayan S.", "I had a vegetarian lunch ,  ordered 2 side dishes & naan , vegetables were not cooked fully , rice also was half boiled . it was high $$ spent for an very average indian food."], ["Fa I.", "First of all I am a big fan of Indian cuisines, so therefore I have tried many indian restaurants around LA. But this restaurant is always in my favorite list. I always get deliveries  from this restaurant,  but last week while I was driving I thought to give it a try in the dining. At the beginning I couldn't expect any amazing service but I expected only good food. When I entered into the restaurant I was really amazed and was greeted by the waiter nicely. As I was placing my order the waiter recommend many extraordinary dishes those I never had before. While I was eating the waiter came to me and asked several times how am I doing or if everything is alright. This is for sure I am going to place lot more orders in this restaurant."]]}