{"Franco On Melrose": [], "Trattoria Bella Roma": [["Angelina E.", "The service was a bit slow as the wait staff was busy feeding themselves rather than its customers. The food was eh, okay. The risotto wasn't cooked enough and the muscles were overcooked.  Not really interested in going back. sad story"], ["Rene P.", "Great Italian Food and very reasonably priced We had the Lasagna plus a pasta w meat sauce and it was very good and tasty Service was good and food came out pretty quick Parking is right in the little strip mall or metered parking on the street Only thing I thought was lacking were the desserts....we tried a few and they were just ok I'll be back again when I get the urge for Italian food"], ["Beth M.", "I've been wanting to go to this place for a long time & I finally had the time to go. It was so delicious!! We ordered a pizza (quatro stagione), a pasta dish to share (Risorgimento) a bottle of wine, and tiramisu and it was perfect!! Every bite!! The noodles are MADE TO ORDER!! I repeat, noodles are made to order. Practically melts in your mouth. Not bad either $60 + tip!! I'm definitely going again. Dreaming of their ribbon pasta tonight :) Great service, great food, amazing wine. I'm happy to give 5 stars which I rarely do. Btw corking fee is only $5 but they already have a good selection. It's so true too, I'm not a fan of tiramisu and I loved theirs."], ["Kevin P.", "This place is called Bella Roma S.P.Q.R. on opentable! (Go get them points...)For the bread haters, their bread is apparently baked in-house. They have several different types that make it into your bread basket--an egg loaf, a traditional low-salt ciabatta type, and one with small dried berries.Pastas were precisely al dente and sauces were delicious. Prices are reasonable--large portions of pasta for around $12-15 per plate. Tons of veg options (as expected).Will definitely return!"], ["Joe M.", "I came here most recently for my wife's birthday, and we had a great time.  Our server spoke with our friends to make sure their meals were perfect.  He recommended some sauces, and made some other modifications at their requests, and when the food came out, he took pride in what came from \"Roberto's kitchen\" - and with good reason too.  It was f___ing delicious!At the end of the meal, they turned down the lights and sang happy birthday for my wife (not in the annoying, cheesy way, but the traditional friendly way) and everyone left full and happy.I really can't recommend this place enough.  We came here originally in search of authentic Italian after our honeymoon in Italy, and eating here may as well be a portal to the Trastevere.  They provide that unique sense of Italian hospitality, and their food tastes great.  It's perfect for the three course appetizer, pasta, protein style of eating.  The wine is really good too.  If I have a complaint, it's that you won't be leaving without spending some money if you want the full experience.  That said, it's totally worth it."], ["Warren W.", "Service was extremely slow, took them like thirty minutes to take our order and another twenty to get our check.Moving on to the food. I ordered the Alfredo American style. For four bucks more than the original Alfredo, you can get some peas and cream which is a rip off.The portions were very small as well."], ["Meredith J.", "I love the fun vibe & food at this place!!!The owner seems very much attune with his customers & the food is so good!!!!!!!!!!BEST GLUTEN FREE PASTA!!!!They have really healthy options here! 2 things that really stood out to us were the Italian egg drop soup... (No it's not like Chinese egg drop, it's another kinda amazingness-- I don't actually like Chinese egg drop soups anyway, so obviously I wasn't the one who ordered it).If I could cut out & eat the steam in the air from the egg drop soup from here I would... It smells(& tastes) too good!!! Oh my! Such generous portions!!The other= the Norcina pasta!! Soo bomb with the broccoli & sausage!! Now... For you ridiculous people that think this place is too bland... You've probably just destroyed your tastebuds over the years through your unhealthy saltwater drinking habits... Anyway for you drinkers... Just put salt on your food... & seriously... Try to go on a palate cleanse or something... You're making the yelposphere a confusing place.Now back to the people that don't need salt to taste food... They have great flavors here. Didn't try their gluten free chocolate cake but will definitely try it next time!!Happy Yelping!!"], ["Adriana L.", "I love this place SO MUCH!!! Was having a major craving for pasta and the Bucatini all' Amatriciana hit the spot! Topped off with their Flour-less Chocolate cake... I was in HEAVEN! Have been coming for YEARS, and I actually often order for pickup because I live  so close - it holds up even if you takeout. Everything I've had is Rockstar. The Pizza Lisa is another one of my favorites. Their lunch Steak sandwich and fries is so SO YUMMY. Oh... And their SOUPS... Any and all of them are good, so choose the one with the ingredients you like - also ask for their daily soup special. Why are you still reading?!? Grab a table and enjoy their amazing olive tapenade & bread while you wait for your meal!"], ["Nathalie S.", "I ordered a seafood pasta dish. The tomato sauce was good, but there was not enough! Over load of mussels, but still their seafood was cooked well. Over all my dish was good but nothing fantastic.However, their Bolognese was pretty damn good! Tart and blended to perfection. The thick noodles were deliciously al-dente and the meat sauce was very flavorful and blended very well. No huge, random chunks of meat.Worth Trying, I will probably go back just for their Bolognese!"], ["Marc P.", "Went on a date here.  Was a great little spot. We sat outside and enjoyed the surrounding company.  We ordered wine and then had pasta for dinner.  Waiter was very nice and didnt rush us.  This is a SPQR spot, I dont know if that means their pasta is blessed by the italians but it sure was good.Would come back anytime.Parking is fine if you get a spot in the lot."], ["Amanda B.", "Found this Resturant on yelp when I was at a friends house looking for a good place to get take out. Did not disappoint!!! What I ordered was simple but it was really good. I got fettuccine Alfredo the traditional version. The owner is a very nice guy with a GREAT accent and is very personable and friendly. Will be going there again soon."], ["Adrian H.", "This is my favorite restaurant in the whole world. Whenever I travel to Los Angeles, I make it a point to eat here. I've been coming for years and Chef Roberto never fails to impress. He even let's me call ahead to make sure they have my favorite, the ossobuco, on special.Seriously. The. Best. Restaurant. In. The. World. The staff is also very friendly, super knowledgeable, and attentive. Good thing I don't live in LA or I'd weigh 300 lbs! :)"], ["Rachael B.", "What a wonderful authentic Italian dining experience! From greeting to end was a delight! Great service! Feels like family and they care how you like everything! I must admit I over ordered and have leftovers for days cuz was so excited to try everything and eat carbs! Started with prosciutto pizza and must say best I have had! The wine is cheap so u can load up with your meal. The homemade bread and olive spread in beginning is also lovely. I also had half orders of pasta- love you can get half size so you can try more things!!! Pesto pasta is perfect flavor! I would add chicken. The Bolognese was good but preferred with spaghetti instead of pasta it comes with cuz more al dente my way. Ended with scoop hazelnut gelato but was too stuffed to eat much. A+ will be my new hole in wall gem!"], ["Grace C.", "Found this place based on the reviews here and decided to try it! Service was excellent, our servers, especially Frankie, were very attentive and friendly. The bread was hot and fresh and quite tasty. The Ancini, Tagliatelle al Limone, and Rigatoni al Forno are all highly recommended. If you're looking for Italian,  come here.Happy New Years!"], ["Jen L.", "This place is divine. I'm not a big pasta eater--I choose wisely. But here, I have no problem going crazy with pasta. The Maine-stuffed ravioli is to die for. Unfortunately, it's not too heavy...which means there's room for more! At least my brain and taste buds say so. My husband gets the Chicken Lisa. He hardly ever finishes his meal, but again, he goes to town on this, so do I and I've witnessed him ordering a second \"to go order\" (which is completely out of character for him). Very often, we will split the Chicken Parmigiana. I thought I made a pretty darn good version of this dish. After eating here, I will not even attempt. I love their soups, Minestrone and Stracciatella.  And the Ceasar salads are made to perfection. I love the atmosphere here too. Cannot wait to return!"], ["Sahar E.", "Seated right away. Waiter was friendly, accommodating, knowledgable. He brought out water immediately and patiently helped me order. Food was out quickly and it was delicious ."], ["Ben A.", "The bolognese is delicious. The service is great and the owner is super friendly. A great spot for unwinding after a long day."], ["Eric P.", "Over an hour to wait to receive our food. Then they brought my dinner companion the wrong dish. We ended up eating separately. Server kept blaming kitchen.  Overall, Good food but we won't be back ."], ["Ellia K.", "Great thin crust pizza the the mushroom soup was amazing!"], ["Bruce M.", "Not sure after so many years of driving by why we never tried this place.  Been to Italy a few times and the owner from Rome is the real deal.  It feels like a real small trattoria serving up some very authentic food.  The menu is quite large which is always a bit scary.  Been a couple times so haven't ventured beyond pasta dishes and aps.  But they are really great and authentic.  Will be trying some of the other items too.  Antipasta Mista plate is fantastic and a bargain for 10 bucks.  Nice assortment of warm grilled vegetables, cheese, meats.  A great start.  Warm breads and olive paste along with evo and balsamic V give you lots of warm up options.Sauces for the pastas are fresh and truly italian.  Pasta perfectly cooked.  Wild Boar Ragu (off menu special) was spot on for what I remember in a little town in northern Italy.  Portions are decent size (even shareable if you want to sample more things)  and prices are in the middle from $12 -17 for pastas.Pizzas looked very authentic (as I stood drooling at the pizziaola pulling the pies) and on point with a real wood burning oven and the traditional italian favorites. A roman variety with potatoes (no tomato sauce) is again one I saw on the streets of Italy in many a pizza place.  One is next on our list to try for sure.Wine list is short but prices are very good.  Noticed lots of folks bringing their own wine so maybe they dont charge a corkage fee.My only gripe?  They have a t.v. in the dining room.  I  know, lots of places do this now, even in Italy.  There they always watch soccer.  Here, football or whatever sport is on.   I'm just wanting great food, company and some cool music. How about some nice HD images of the italian countryside on the TV.  The next best thing to being there!  But I digress.The owner  (who you can tell is passionate about his food) takes everyones orders.  Thats the way they do it in Italy.   Thats how you know it's the real deal.  And you are getting high quality foods without getting taken to the milano trendy spendy spots where your wallet gets emptied.Now I want to go back to Italy even more... but this should hold me. Maybe.  A new favorite!"]], "Osteria La Buca": [], "Vernetti": [["John P.", "Great and tasty!I kept walking by here and truly just thought visually it was appealing, so, why the heck not...The food was super tasty, and heck it was exactly what I asked for.The service was great too. Coffee no dessert, so a full enjoyable meal sitting outside -- ahh.***BYOB - there is a small bodega next door, so be sure to pick up a bottle of your favorite tasty beverage or bring it with you... of note, the bodega closes at 7.  The bodega owner even came over to ask if we wanted anything else before they closed!"], ["Michele F.", "Totally tasty! Yes, the place is still in its infancy (just a bit over 3 months old) but that being said the food is worth it! Breakdown of the meal:Fresh bread is brought to the table: Olive and plain. Chewy and light, a nice start.Fresh burrata w tomato and basil: made in-house, perfectly creamy and slightly sticky, just dense enough for good mouth feel. There was the slightest sprinkling of finishing salt and a welcome addition of freshly cracked pepper that made what could have been a bland beginning into a tasty treat. The balance of cheese to tomato was slightly off, in my opinion, and I would have liked a few more wedges to complete my bites, however, smearing the fresh bread with the fresh cheese was also quite enjoyable.Osso bucco: PHENOMENAL! In a word. Knife not included as the flavorful meat was more than fork tender. The carrot and celery ragu brought a juicy, deep depth of flavor to the meat and soft polenta...and adding the unctuous bone marrow took it over the top. This is truly comfort food at its best! Spaghetti and meatballs: Delish! Freshly made spaghetti (all pasta is made fresh, daily) along with a perfectly simple red sauce and two tender meatballs. The pasta has just the right amount of chew and was such a surprising treat given that most places that make fresh pasta do not tend to take the time to make regular spaghetti.Semolina waffle w a pear and pink peppercorn compote: waffle is light (could be crisper) and the compote sweet and surprising when you bite into the peppercorn. Definitely perfect for those who don't like too sweet desserts.Tiramisu: Yummy! Individually portioned in cute little ramekins. Lovely coffee flavor as you scoop down to the bottom and dig into the espresso-soaked cake.Coffee: made to order and strong.Water and iced tea served in adorable decanters.The staff is friendly and attentive. Likewise, Chef/owner Steve is personable, full of energy, and passionate about his food and new family business. While certain aspects of service need a bit of tweaking, overall, this place should be five stars in a few months. This is a wonderful addition to the Larchmont strip and the community is better because of them. Take the time to stop in and enjoy am amazingly fresh pasta, warm welcome, and sweet dessert. Bon appetit!"], ["Jam Y.", "Welcome to Larchmont, Vernetti! Whoop! This is the kind of restaurant the block needed, yes yes yes, a nice sit-down restaurant that serves good food during all hours. I've been here for brunch and dinner, and enjoyed both.BYOB-Dinner: Osso buco, seafood linguine, spinach gnocchi, and charcuterie. ALL delicious. The gnocchi, especially, was excellent. Delicate, buttery and oh-so flavorful. Really, really liked the sage. I thought the osso buco was good, too. Incredibly tender beef shank and silky smooth polenta swimming in a pond of juicy......osso buco juice. Also, that portion of bone marrow! Mmm, so fatty and delicious. Loved the charcuterie! All of the meats were very decent in quality, and definitely looking to re-order that.-Brunch: Semolina waffle with berries and maple syrup with a side of sausage links. Waffles are waffles, but that's not to say it wasn't tasty. The blueberries were super fresh and ripe :). And sooo glad I added the cinnamon roll as an afterthought. Thin and flakey outside while soft, warm and gooey inside. And yes, they bake their own pastries. I must try the orange rosemary cake next time.Overall, nothing super spectacular to go out of your way for, but like I said, a really pleasant addition to Larchmont Village. I hope they're here to stay."], ["Lynn C.", "Every single thing we ate was fantastic, from the bread to dessert - probably the best Italian food I've eaten in Los Angeles in a while.  Part of what makes it so pleasant is the environment - owner/Chef Steve cares about the food, and the community.  The service is outstanding, the place feels like home."], ["Eve S.", "We went for my husband's birthday, they were so warm, friendly and accommodating, even bending over backwards to fit my daughter's baby stroller into a tight space. The service, 5 star! the food, well, if you like fabulous crostini appetizers (get the deviled egg!), if you like the best soup I've ever eaten, if you love Oso Buco on polenta, savory moist seasoned to perfection chicken, pumpkin tortellini that tastes like little pieces of heaven, gnocci that are light, fluffy and taste like the best parmesan cheese you ever ate, grilled pork chops with apple that are the size of new York, Chicken Parmesan that covers your plate and is drenched in the freshest mozzarella ever, combined with fantastic service in a pretty, cozy atmosphere, then you should come here. If you don't like all these fabulous things, well then I can't help you."], ["Susan Y.", "I was really hoping to like this place cause it's in my neighborhood but it fell short on all levels.  The salad I ordered was ok at best. The tuna was dry, the beans were undercooked, and it basically had no flavor. My son had spaghetti with meatballs and the flavor was actually decent but the meatballs were almost cold. And for dessert we had panna cotta which one of my all time fave. I even like panna cotta even if it's not that great. Well this was not great. It was not rich and lacked flavor but as I said I like even mediocre panna cotta so I ate it.  The biggest problem I had was with the service. They clearly saw I wasn't eating my salad. I had decided at that point I was going to take it home and try to fix it cause I hate to waste food but they tried to ignore it. The man I assume was the manager asked every other table how was the food but conveniently skipped mine. And when the waiter came he saw that my son had finished his pasta so asked him how his food was and didn't bother asking me how mine was... This is my first review and I eat out a lot but the way that this restaurant handled the service made me want to write my first review. It's too bad it had to be a negative one. I hope things change cause I would love a good Italian place in my neighborhood that I can go on a regular basis."], ["Wesly H.", "This restaurant was marvelous! My girlfriend and I have been wanting to try this place since it opened last month, and it didn't disappoint. The decor is beautiful. As for the noise, it is not as bad as other reviewers make it seem. The staff is very friendly, attentive, and accommodating. There wasn't an open table on the weeknight we went, so it's best to call ahead for a reservation. We were seated in less than 30 seconds. Remember to bring your own wine, the restaurant is going through their permitting process so there's no corkage fee yet.  First things first, the bread. They have the most delicious black olive bread I have ever tasted, so good that I ordered seconds!  The portion sizes were just right. For starters we shared their mushroom soup and burrata. The burrata was love at first bite and paired well with heirloom tomatoes. Our main plates were the pork chop and osso bucco, both which were so tender. The pork chop was paired with caramelized apples which  added a level of sweetness that really brought out the taste. The osso bucco was served on a bed of creamy polenta.  For dessert we had the panna cotta which was not too rich but very smooth and topped with with fresh strawberries. We'll definitely be coming back here again!"], ["Leighton W.", "I promise- I'll come back and see if I can add a few more stars but for now, this is what it is.My friend and I wanted Italian that evening and after browsing through a couple choices, we decided to come to Vernetti.  We knew it was new, so I expected there to still be some things to work out.The decor is very nice- well done.  Not overwhelmingly pretentious yet classy; fit for a family and perhaps a date night.  The waitress was also very, very polite.  A tad slow, but that's fine- the night was winding down.HOWEVER.  The food.  As a previous review had said, the rigatoni was definitely dry and not hot- it felt like it had been sitting there for a while.  It definitely could use a bit more sauce.  Same with my spaghettini.  I attached a picture of it that you can see.  The cheese was clumped together and there was virtually no sauce.  I though maybe it was a simple pesto, but the pasta itself was very dry- most of the taste came from the strong olives it had.One of the better dishes we had is the meat platter.  A word of advice to the waitress- explain the components of the dish FIRST, as you serve it, not when we're halfway done with it.Now, chef- you come from amazing places and I have no doubt in your knowledge.  I observed you from a distance and I knew it was a tough day- tough weeks too, I bet.  But the guys trickling in from the industry giants and the PR campaigning lately will work against you if the food isn't on point.  As you already know, the balancing act between the originality/artistry of your craft and catering to the community is.. paramount to the success of your restaurant.Good luck, Steve."], ["Sandra N.", "This place is OVERPRICED. Service is bad. Definitely NOT and Italian restaurant.I was so excited to try out this new addition on Larchmont.I don't want to elaborate too much. Just simply say: people! Spend your hard earned money elsewhere. The food is just okay (you can get a tastier meal at home).They have a brunch menu as well which should be removed because nothing in that menu says 'Italian cuisine'. Italians actually don't eat breakfast: they only have a cup of espresso and maybe a cornetto (croissant type pastry).Service is horrible: why are we getting a second bottle of water when the first one isn't even halfway done yet?! Also, my boyfriend almost got slashed by the knife that fell from the plate when the waiter was taking it away. Didn't you learn to place your thumb on the cutlery when removing plates?! I needed time to recover from that meal and service. Ugh."], ["Sandra P.", "When an Italian restaurant makes biscuits and gravy for brunch, it better be legit! Larchmont Blvd has a opened a great new destination for brunch and lunch. Great food and service. Try their amazing Caesar's salad! Yum!"], ["Connie D.", "I have been wanting to try our new neighborhood Italian restaurant for quite some time. With our kids being at my aunt's for the weekend, we decided to have our date night here. We live only a mile from Larchmont, so Vernetti is very conveniently located for us. We were seated right away and the staff was very welcoming and friendly. The inside atmosphere is very welcoming and the lighting warm, and the seating comfortable. We ordered some wine and appetizers, the Fresh burrata and Salumi platter, both of which were fresh and delicious. My husband ordered the Branzino for dinner and I ordered the Pasta Gamberi Pesto (or something like that, it was large shrimp with fresh pesto and pasta). Both were delicious and the portions were generous. Our server Sammy was attentive and friendly. We also got to meet the owner Steve Vernetti, what a nice guy! We had pecan pie and cannoli for dessert with cappuccino and espresso of course, also amazing. This will be out new neighborhood restaurant. We will definitely be back soon! Thank you Vernetti for a wonderful date night!!!"], ["Rick A.", "4.5. We had to send the ribeye back for a touch more heat. Other than that it was a damn fine meal. Four of us having an actually enjoyable upscale meal. Almost unheard of. Would do well to have a better wine selection. Happy we found this place. tip your waiters folks."], ["Erik H.", "Haven't been here before, had an awesome meal with friends. Pork chops were massive and delicious, and pappardelle melted in your mouth. Apparently their brunch is even better. I will be back soon. Delicious. The chef/owner checked up on us, he was great. Amazing time."], ["johnathon c.", "Brunch Update:  finally the corned beef hash of my dreams, real homemade corned beef, nice and chunky, along with fingerling potatoes, this was the perfect brunch.  I am so happy with the corned beef hash I want to drive my family across town for it.  Avocado Toast with balsamic cippolini, eggs and calabrian chili on the perfect real bread toast hold it's crispiness is a five star winner winner what's next.Carbonara for Brunch, sure, that is a can do, elegant and perfect.  as it should be, correct, bravo.eggs florentine, perfection, enough said."], ["Tommy Smalls S.", "Been to this spot 4 times and I feel like now is the time to give an honest review. I enjoy good food. And also it is good for my 7 year old daughter loves the spaghetti and meat ball. The staff here treat her like a princess like she is. She is a lover of Fogo De Cho And this place meets her standards of good places to eat. I love the owner and asst. Big Phil. Super sweet guys and always making sure everyone is one point and service is tight. I am glad to have found this spot."], ["Jamie G.", "I went to Vernetti on Saturday night with a big group of people. We tried almost everything on the menu and no one was disappointed. The food was terrific as was the service. I love the vibe of this neighborhoody-place. What a great addition to Larchmont. As for the food - the chicken parmesan was a special that night and was incredible, as was the Osso Buco. The burratta is to die for as is the pecan pie (if you have any room left for dessert). The portions are huge so you will have plenty to take home and enjoy the next day (and save room for the pecan pie which I am still dreaming about).We will certainly be back!"], ["Anonymous G.", "I came in here to try this new spot out based on their yelp review. I tried to avoid the bad reviews and look for the positive.... baaaaaaaaaaaad idea. Food has so much potential but I feel like the front and back of house aren't on the same page. A few of our dishes had to be sent back as well either due to how it was prepared or temperature at which it came out.     Trendy spot, no corkage fee for now, but service and hassle just isn't worth it. I will wait 6 months to see how they are doing before considering going back and updating my review#CRAAAAAAAAAAAAP"], ["Jay K.", "I was so happy to see a new restaurant open up on Larchmont Boulevard. My wife and I went there and we're extremely happy with the ambiance and food. We had a lox platter with bread that was really really good. Oh and the bread they serve you with olives in it is to die for! For our main course My wife had the Scottish salmon and it had such great flavors! I ate some to taste it. I had chicken with a delicious lemon flavor with mashed potatoes. The service was great and I would definitely go back again. The owner of the restaurant actually came out to see how our food was. And he was going to all the tables and making sure everything was great. I really appreciate that being a business owner myself."], ["Daphne B.", "Been waiting for this place to reopen.  Larchmont has been mediocre restaurant row for a while and I loved when the new owners took over Girasole.   I came to yelp to sing it's praises and was surprised to find some negative ones.. don't get it.It's a welcome addition to the hood.  Perfect on a Sunday evening where you want something good, but don't want to cook.1) decor is lovely2) nice servers3) everything we ate was delishIt's a bistro, brasserie style.  Quality, not fussy.  My only critique would be it would be nice if they could make it less noisy at peak times.  Lots of hard surfaces, but I actually mentioned to a live person and they are aware.The Branzino was melt in your mouth.  I could eat it everyday.  We loved the platter of italian meats to start.  The fresh olive rolls could be a meal in themselves.  The Olive oil that goes with them was young and grassy.  The pepper spaghetti was simple and perfect.  the kindly made a simple pasta for my son, only butter.  Another night we had the porterhouse which was top notch.Our desert was great.  Loved seeing my kids gobble up panna cotta.  When they get their wine license the cherry will be on this sundae!"], ["Hillary H.", "Great ambiance, both authentic and creative Italian fare, and a wonderful addition to the neighborhood. Patio dining and indoor space, plus currently it is BYOB with no corkage fee. We tried the beet crostini's, simple and tasty, plus the Spaghetti con polpette along with the Rigatoni spuntature. My only complaint on the whole night was the Rigatoni spuntature could have used some sauce. Likely just a personal preference, but it was just too dry for me. Spaghetti was perfectly cooked and the meatballs were delicious. Portions are smaller than you might be use to for pasta, but this allows you to either A) indulge in a starter or dessert or B) not gorge yourself and leave with your pants still buttoned. Out waitress was friendly and interesting, and all of our requests - balsamic, more bread, etc. were satisfied. Great price point and a nice place for a romantic date or dinner with friends.Bottom line: We enjoyed dining here so much, I've decided to have my birthday dinner here next week. Gratzi!"], ["josselyn g.", "It's been a very long time since I had a dining experience as incredible as my recent dinner at Vernetti....  The service was impeccable, from the accommodating hostess, Amelia, to the bussers (whose name is totally escaping me at the moment) to our server, Bob, we were well taken care of from the moment we arrived.  It was wonderful being able to sit outside with our little dog.  The service alone would warrant a five star rating.But the food.  Lord almighty.  The menu is wonderful and comprehensive but not overwhelming; there's something for everyone.  We started with the tomatoes and burrata (basic but delicious with beautifully ripe tomatoes) and then had the octopus entree and the special pasta, mare e monti, which was tagliatele with shrimp and scallops.  We died.  Kept eating off each other's plates.  The sides of cannellini beans and yam/polenta/sage cake were also fun.  But the entrees were the stand out stars.  Honestly, my biggest regret is having been limited to the size of our bellies.  Everything was wonderful from start to finish, including the bread.  And it goes without saying that the BYOB thing is beyond fabulous.I've boasted about this place to everyone that will listen, I'm counting down the days until I can go back.  It is just always such a treat to be served by joyous people.  But having delectable food doesn't hurt either."], ["Claire P.", "Had an amazing time. I was there last night with my husband and a couple of friends and got a nice table kind of seperate from the other tables with a half booth by the window...great table to sit at, we could see outside and the whole space which was pretty happening for a Thursday night; that street was so quiet except for Vernetti.We forgot about bringing our own wine but our waitress who was amazing helped us get some delivered. She was very knowledgable and had great suggestions. And the food was over the top+++  We had a few pastas, a whole fish, and roast chicken. Our waitress suggested we try the sage polenta cake for sharing and it truly was the best. We'll definitely be back to try more things...including dessert which we were too full to order."], ["Ryan G.", "We liked this place, but we wanted to like it more. The atmosphere was very delightful and so was the outside seating option. The menu had a lot of good options, but seemed to be a bit pricey overall. The hostess was extremely courteous and accommodating, however, our server had an attitude like he was doing us a favor by taking our order or bringing us bread. Our entrees were good, they weren't as great as the price would have you believe they would be. We will probably be back in the future; I know that this restaurant is newer, so we will probably circle back in a year and see if they have found their rhythm."], ["Matt L.", "Authentic B.Y.O.B. Italian restaurant in the heart of Larchmont Village.   Service was attentive and the food first rate.  Two dishes that stood out were the baked ricotta and then the buratta."], ["Robert M.", "Perfect local Italian escape. Warm and friendly environment but omg the food. From the first bite of the fresh crusty olive bread, to the last bite of my pasta dish...it was perfect. Oh and the sage polenta! I have to find a way to save room for dessert next time. BTW they don't have wine or liquor yet."], ["Adam C.", "i'll be honest, my expectations were low. I don't associate Larchmont blvd with high-end cuisine. It's usually \"fine\" and hits the spot. And it feels like more lunch type food. But Vernetti is a game changer. The place is a cool hip look but... can be a little loud. Not at all bad with sound. It was the right vibe. And the FOOD! i had the bone marrow. It's my first... delicious. I used to be scared to try it but now i'm a convert. For a main my wife ordered the cacio e pepe. I thought i'd have food envy. It's a pasta with with cracked pepper and cheese. fugetaboutit! I ate like a third of her plate. I got the branzino. I was expecting, as i usually get, a more \"flat\" flavor. This one was really moist. The subtle butter and lemon kept it simple and combined with a fresh fish the dish KILLED IT. Problem... where the wine at!? People... i need me some wine. I hear they are working on their liquor thing so i came prepared. What's great about this place is that you can hang out on Larchmont after dinner. Many restaurants are tucked into locations that are destinations. With Larchmont you can walk around and hang out. Reminds me more of Europe."], ["Jayk J.", "This place is the best place for lunch and dinner both I swear!!! If you never been here, you are guilty already. Check this place out today!! Action!!!"], ["Emily K.", "Fantastico! Great bread, delicious pasta. Must try the buratta and heirloom tomatoes. To top it off the service was friendly and knowledgeable. Overall a wonderful experience and a welcome addition to the neighborhood."], ["David M.", "Lets start with something good. The ambiance and feel is nice and simple. I can appreciate this as it is a clean welcoming environment that lets you focus on your meal and not the razzle dazzle of a venue. Unfortunately, when the meal is ill prepared then you may tend to focus on it a bit more. Live by the sword, die by the sword.... (feel free to scroll to the end for the brass tax of this review). Our overall service and experience was lacking. Lets do a play-by-play on the evening, shall we? We shall. To get an idea of our table, we were two couples eating family style...and go:Apps:Beet Cristoni's - Simple, but good. Good quality beets. Fresh and with a nice earthy finish. Burrata - Fresh, tasty and lite. I'd recommend it. Bone Marrow - Well it is what it is. Ours came out under cooked. The top layer cooked right, then you scoop right into blood pudding. I eat red meat medium rare and steak tartar when in a nice place, but something about under cooked bloody marrow is a huge turn off for me. It came back out in less than 2 minutes. I told the waiter that it was literally impossible to have been cooked that fast. Sure enough...still raw. Sent back again. Finally came back the third time cooked. Entrees: Rigatoni Spuntature - I portioned out the pasta on some share plates only for us to all realize the dish came out cold. Pasta cold, short rib cold, cherry tomatoes room temp. So I sent this back. Came back to me with the same size portion it was sent back and the waiter says \"well you already ate the difference of the meal\". I explained when we portion to share and we don't actually eat the meal because we need to send it back that he should just have the dish remade. Why should I be expected to pay for a meal but only be allowed to enjoy 1/3 of it? We received a lot of static from our server as he defended his kitchen. He also informed us that they served over 100 tables that evening yet we were the only one that complained. Either he was insinuating that we were at fault for complaining or that his kitchen was tired and ready to go home after a long evening of cooking. Either or it was an unnecessary comment. Roast Chicken - Came out pink. Under cooked again. Salmon - Came out beautiful, until you cut into it. Under cooked again. *Both were sent back. The Fish came back still under cooked. **SIDES: The Polenta cake came out perfect! Good texture, crisp edged, and hot temp! At this point I said to the waiter that we would like to leave. Simply walk out. The kitchen manager came to talk to us in a kind and calm manner. He apologized and asked if he could do anything to make the situation better. All I asked is that he understand where we were coming from. We came to enjoy a nice meal yet there were a dozen of unacceptable service and meal prep issues. As I go on to take my time to explain it to him I hear from the back of the room,\"Incorrect, you are incorrect!!\". I turn around and its the chef and based on his arm-crossed stature, obvious over entitlement and ego he likely may be the owner as well. I welcomed him to eat ill-prepared food all he wants, but as patrons that we won't take the risk of getting sick for the sake of his ego.The chef came out, not to talk to us or reason with us but to badger his customers and criticize our complaints.  Really?  We got into a small verbal back and forth where I reminded him of what it means to be a restaurateur and to take pride in what he does, but unfortunately his pride sits with his ego and not with his passion for food prep and customer service. Genuinely, if the food prep and management of the situation was better, I would expect this to be great go-to restaurant in Larchmont, but I can only express what I have experienced. In a last attempt to not further ruin my evening I excused myself & group from the restaurant and as we made our way out we were gifted by hearing the pompous chef yell,\" people like you are never happy and are not needed here\". Thanks for dismissing me after I already volunteered myself to leave your restaurant. Class act you are, sir. A true embarrassment to the culinary world, culture, and scene. If you want to be mistreated and badgered by a pompous chef in hopes of ruining your evening, then I highly suggest dining here. I caution you to dine at your own risk and I hope that your experience isn't as terrible or as embarrassing as mine was. Even as I write this, I hesitate to post my review. My parents have owned restaurants, been head chefs, and because of this the culinary culture strongly resonates with me. I am not posting this out of ill-will or in hopes of the restaurant doing bad, but my experience was so offensive and embarrassing that it has to be shared."], ["teddy z.", "Finally, we have a pretty solid culinary addition to Larchmont Village. Very simple and cool indoor/outdoor space. The t-bone for two was great and octopus was fantastic. Solid salads. No alcohol yet so you get to BYOB with no corkage. Only downside is a bit pricey."], ["Emily B.", "I loved this place! From the super cutie hostess Roxy to the excellent food I will defiantly be coming back. Everything we ordered was delicious from the prosciutto and melon, the Polenta cakes starters and the excellent moist half a chicken with creamy mushroom polenta. I ordered the spicy Italian sausage pasta with sweet peppers and Gluten free pasta (an excellent choice) and every ingredient was fresh and wonderful! The restaurant is small but intimate and the candlelit tables on Larchmont are a gem. The outdoor tables are sexy and the combo with summer nights are the reasons people move to LA. Enjoy!"], ["Kuja D.", "So great!!!  I'm hesitant to rah-rah too much about this great little find because it will be packed every day and night.  But they are doing so many things right that they deserve all the success in the world.  Phil is a wonderful manager.  So friendly and it feels great to find a new spot that makes you feel you're part of a village. The chicken panini is SO good."], ["Kristen D.", "YUM!!!!! Been here for lunch and dinner now. Had the BEST meatball sandwich for lunch I've ever had in my entire life. The osso buco for dinner was outstanding; the polenta that came with it was especially delicious - creamy, cheesy, comforting... perfection. I will definitely be back!"], ["Cris D.", "Miserable experience all around. Service was extremely slow, one of our dinner meals was never ordered and the woman sitting next to us had her dog - not a small lap dog, a larger Shepard mix - that was eating off the floor, her table and regurgitating the food and rolling in it. Yes, this woman was completely obstinate about it and simply inconsiderate, but it's really up to an employee to say something. Now I could forgive and overlook some of this if the food was good. It was not. Smallish portions are fine, but bland, unimaginative food is not acceptable. Sorry, if you think this food is good, you're a tourist and you do not know Italian cooking."], ["Kim C.", "Vernetti is a welcome new addition to Larchmont.  It's exciting to have a stylish, date night worthy restaurant right in the Village.  The decor is so lovely, you automatically have a little glow.  We started with the burrata, which you really can't go wrong with.  The others partook of the charcuterie, but being a non land lover, I passed.  I did insist on the octopus, because it's tough to cook (and sometimes literally to eat), but over the doubts of my tablemates, it was a hit.  Tender and the right kind of chewy with a good char.  I passed on the meaty rigatoni that the others dove into, because I was focused on the branzino.  The fish was amazing, tender and gently cooked.  I know it's hard to bypass the pasta for the secondi at an Italian place, but this is one dish not to be missed.  Fun to share as well.My hubby loves cannoli, which he was happy to get the last one.  I hoarded the tiramisu, so we had to get two.  We BYOB, and with Larchmont Wine and Cheese just steps away, we were happy to support another local business on Larchmont!"], ["Ben P.", "My first Yelp review!As someone who lives in the neighborhood, my fiancée and I had been looking forward to the opening of Vernetti for the past few months while it's been under construction. Last night we checked it out with my future in-laws and had a somewhat disappointing first experience.While the restaurant is beautiful (if not a bit noisy), it seems like the team in place needs a few more weeks to iron out the kinks and settle in. As my future father-in-law is a vegetarian, we asked if the soups were vegetarian. Our waiter said that they both were, but after we specifically asked about the broths, he realized that one of the soups had a meat-based broth. There was an extraordinarily long wait between our salad and main courses. After we had been waiting for a while a waiter came to our table to inform us that our roast chicken took a long time to prepare, but that it would be ready in two minutes. It took several more minutes before our dinner was finally served. We had to ask several employees several times before our water was refilled. Our salads were good. While the pastas were flavorful, the portions were on the small side. We had the whole roast branzino, which was delicious, but served without any accompaniments. The roast chicken was delicious and well-cooked, but the accompanying polenta was lumpy.Overall, I'm excited about the potential of a great new neighborhood spot, but will wait a few months to try it again with the hopes that the place will improve as the staff gains experience."], ["k m.", "Amazing experience, amazing service.  Was very sad when Girasole closed but so happy Vernetti opened.  It is killer."], ["Dorothy A.", "Great & friendly service! Such a good menu & pretty reasonably priced. Had a wonderful experience here for both dinner & brunch. Would recommend to anyone for a more upscale dining experience on Larchmont, which is the best location. I've been here 4 times since opening and never had a wait. Also love the olive bread & the decor."], ["Joel H.", "I love this place.  Have had Osso Bucco, the Veal Chop, Roasted Chicken, Spaghetti with Parmesan and Pepper, and the Papardelle with Mushrooms - all are excellent, as is the caesar.  Had the Salmon special last night and it was off the charts.  My father in law, avid fisherman from the northwest commented it was the best salmon he's ever had in a restaurant.  Now I'm craving their version of Veal Scallopine so please add this, Vernetti!  Panna Cotta for dessert was amazing as well.  Bravo.Looking forward to the wine service, supposedly coming next month."], ["Fabiana R.", "After a long wait and big expectations, I have to agree with previous reviews there's nothing that wow me and my husband about Vernetti, other than the beautiful decor. Unfortunately Vernetti seems not to be an exception for this new trend of restaurants around LA which care more about the looks than the food, and that's very sad.The menu seems right nothing fancy there, not too big just proper but nothing to die for. The service was ok, our waitress wasn't familiar with mostly any of the Italian dishes listed in the menu, but in this case I will blame my accent, just not to go so hard on her. I ordered the spaghetti and meatballs, the portion was on the small side,  the meatballs, were heavy on the salt and lacking the taste of wonderfull italian herbs to compliment the beef and achieve the flavor profile authentic Italian meatballs are all about, same thing with the tomato sauce, but the spaghetti was perfect and I wish there was more! My husband ordered the octopus, the side dish was so salty he could not continue eating, to top it all the octopus was chewy and flavorless, not sauce to bring out the flavor of this beautiful ocean creature which was screaming for some love. They were very nice to cook a brand new order of the same but unfortunately, the flavor didn't improve the second time around. At this point we were really looking to reconcile with the place, cause seriously we really wanted to like it, but the panna cotta also fell short compared to Italian standards OVER ALL not a familiar flavor to recall any of my Italian roots. The bread was fantastic and they take the octopus out of our bill, so not complains at all about that. THANK YOU!  I know this review is on the down side and I apologize but with the very well versed chef you have in your kitchen and with the great location you acquire on Larchmont, you have everything on your side to be a winner. I believe Vernetti has and ace on it's sleeve which I'm hoping you use when the time is right to win the game, you can do it! Please make it happen!"]], "Angelini Osteria": [], "Folliero's Italian Food and Pizza": [["Phil M.", "The best Margharita Pizza in LA, nuff said!"], ["Calvin R.", "I love this place and can't remember eating better pizza elsewhere. The prices are great too. Relaxed family vibes and great food."], ["Jorge Q.", "Very good pizza lasagna was good to if you like sausage its a perfect Lazanga for you... It's not expensive and you get what you pay for which is good food a great prices... My third time here I will return with an empty belly... I recommend the margarita pizza... It's really good Cheesy pizza..."], ["Rajii M.", "The pizza is the best but feel like I could make their spaghetti, salad, & other foods better at home lol I like how they have fixed it up :)"], ["Dikran J.", "My wife and i don't spare any money when it comes to good food. In the case of Folliero we spared a fortune to have the best pizza in LA. Cheese and Chorizo pizza was heavenly.  The one with jalapeno was out of this world. I always thought there has to be one good pizza place in LA and i have finally found it in the walls of Folliero."], ["John K.", "Been trying to get in here many times but could not wait in line. Love the casual information ambience. Service was quick and pleasant. Shared the antipasti salad on the cafeteria style plates -good. Pizza was excellent. Pasta looked good but to me not special but the pizza was worth the wait. Had a cheese and jalapeño and loved it."], ["Christina O.", "I've been coming here for 39 years. Sure things have changed, the menu has grown, the place is more crowded, but low prices and great customer service have remained the same. I love it when I walk in to this place and still get the VIP treatment. The lasagna is my absolute favorite,  under $7, and always way too much to eat at dinner! I suggest getting here before the lunchtime crowd or coming for an early dinner"], ["Demetri E.", "I had a lasagna dinner.. that was pretty good.. the portion was huge.. service was pretty good.. over all not bad.. the salad was horrible though.. nothing but iceberg not even a tomato"], ["naheed c.", "The pizza is ok, it's like homemade style, not greasy at all so that is good. The topping choices are limited. There is not enough tomato sauce on the pizza. The place is good for families because of the price point, I understand why it's popular. It's cheap decent food. The service is chaotic. They should really switch to a number system where you order at the front, get a number and sit down. The staff is nice but confused. I wouldn't go back......"], ["Karina A.", "Good Pizza, slow service for pizza. We weren't in too much Of a rush but this place could use better customer service! My girl friend says this place is only good for the pizza not anything else so I listened. Deluxe sub the bell for halapanos!! Lol thanks"], ["Paul S.", "I must say, that this is pretty close to New York style classic pizza.  The crust was awesome, the cheese is gooey, and the sauce is flavorful.  So, you should definitely go here for the pizza.  I have to also say that I was surprised that with such great pizza, the side salad was average.  It was only iceburg lettuce with a couple of tomato slices in it.  It was pretty small too.  Lastly, the wait staff was either overwhelmed or short with us.  They didn't seem to care much for being attentive.  I did notice that the wait staff were also the same people working in the kitchen.  That means that they were doing double duty.  Either that is their process here, or someone called in sick.  Nevertheless, I think that they could be more attentive with people.  Maybe knowing that you will definitely return to eat pizza allows them to be a bit crass.  Then again, maybe they are trying to bring their brand of New York to L.A.  Who knows?!However, you definitely want to come for the pizza.  It's very good and tasty!!"], ["Yvonne B.", "This has been my absolute favorite place since I was 3 yrs old! And it's still the best! The waiters aren't your typical waiters! They are more like what do you want! Lol but they get you exactly what you want and need promptly :) the wait is so much longer now but just means business must be good which they totally deserve! The prices have gone up a bit but still reasonable. Everything is Delish but of course their freshly made thin sliced pizza is thee best! So check it out y'all"], ["Ricardo R.", "Horrible service!! I waited over an hour for a pizza when I finally ask about my order. Then forgot to put my order in and the only thing the man making the pizzas (guero) said we're busy. Really!"], ["Cristina G.", "This place always had great food and great service. This is an old building, so there really isn't A/C. On summer days it's almost uncomfortable to be in there, but when you get your food it really doesn't matter. Hahahaha. My favorite are the lasagna and pizza pies. Any topping is a good topping. This is NY style pizza, so if you like thin crust, you'll love the pizza. Wine and beer sections are great as well. Everything here is reasonably priced. You definitely get what you pay for."], ["Chris L.", "We rarely crave Italian food because more often than not, it's overpriced and I'm left feeling that I could have made it at home.  But tonight was different.  We wanted tomatoy goodness.  One dollar search filter on Yelp led us to Folliero's in Highland Park.So cute, so quaint and very cheap!  This is what we ordered:LASAGNA  $6.75Sausage, mozzarella cheese and house style tomato sauce - This is great.  The sausage popped and I was completely satisfied.  It's a favorite!PARMIGIANA di MELANZANE  $6.75Fried eggplant, tomato sauce, topped with housemade meatballs and mozzarella.  I think this dish is much better than the Lasagna.  Delicious and great!SPAGHETTI with HOUSE STYLE SAUCE  $6.25Tomato sauce cooked with beef chunks for flavor.  Terrible.  The pasta was not drained enough and not enough sauce was added leaving a watery bland mess in a plate.  Don't get this!  But of course, who would even consider this since they can literally make this at home.Baby Arugula Salad  $5.25Baby arugula and shaved parmesan cheese.  We asked for the balsalmic vinegar on the side.  Very basic, but a nice starter.Definitely will come back to try the Cheese Ravioli!!  Everyone seemed to be ordering this.The service was great, they were apologetic that we had to wait for a so long (~40 min on Friday night).  I could sense sincerity from the boss-woman who handled the cash register and seemed to be owning the show.  This was her palace and I could tell that she wanted to make sure we enjoyed our meal."], ["Mook G.", "Best pizza in the neighborhood pasta  looks good the place get packed but worth it .   The pizza is cheesey and the sauce is the bomb"], ["Larry O.", "I don't understand why people rave about this place. It's not all that. It's mediocre at best. It's just regular pizza nothing special. The quality of the toppings is no different than what I would get from Costco or any pizza delivery place. Talking about Costco I think it's actually better than this. Don't waste your time or money unless your palette lacks taste. Oh, and for those that claim this is better than Casa Bianca... Y'all need to get your taste buds checked or better yet, stick to Little Caesar's if this is your definition of good pizza."], ["Nicole C.", "Pizza is fantastic! The dough is light, and the whole pizza it's not greasy or heavy. It's so light you feel like you can eat the whole thing. This is possibly my #1 pizza place!"], ["Josh D.", "Great, handmade Pizza. Their sausage is great.Prices very hard to beat. Local fav for a long time.I usually have it take out. Personal, I stick to the pizza. I don't expect great salad as I'm here for the Pizza."], ["Emily C.", "I give 2 stars for the atmosphere. I'm not really sure what all the hype surrounding their food is about. To be honest it was exceptionally greasy pizza with crust that just tasted like flour. I think they were going for more with the spaghetti, maybe a rustic feel? But it was just like eating stewed tomatoes from a can with some ground beef tossed in. All of it just lacked flavor. The side salad we got was 3$ for a small bowl of iceberg lettuce with a couple pieces of chopped tomato. I don't think that counts as a salad, unless they just throw it in with the meal. I was super disappointed since I really wanted to love this place, so many good reviews! I'm not sure if the staff is always so unfriendly and rushed but I can say as a whole, we won't be going back. The atmosphere is awesome but everything else lacks, bummer."]], "Bottega Louie": [["Ian R.", "Place is awesome and I will continue to come back. Pro tip: come in a smaller group (4 or less) and you'll get seated much faster. I usually come at like 10:30 and 1:00 on the weekends and I've never waited more than 10 minutes.I've had the Cobb salad, Mac & Cheese, smoked salmon eggs Benedict, portobello mushroom fries and a bunch of macaroons and cakes and I can safely say it was all 8/10 or better. Special shout out goes to the Cobb salad and the mushroom fries cause those are so bomb.The only complaint I have is regarding the beignets which are unfortunately nothing like the ones you get in New Orleans but then again I should've know better than to get them anywhere but in NOLA."], ["Claudio B.", "I love the high ceilings all in white and and art on the solfits. I believe they forgot my coffee... I still have that feeling that 4 ounces of coffee (macchiato?) looks sad in a 16 ounce paper cup (even when I stated it to be for here) You not only pay for what you consume, but the place you order it from: nice and slightly luxurious... but worth to go there once in a while."], ["Nicole Y.", "This place is AWESOME from the classy ambience to the macaroons to the delicious food!!!! I came here for brunch with my friend and we had a little bit of a wait. Once we were seated we were attended to frequently. Our waiter was SO NICE. This restaurant definitely ranks up at top for having the best service. The food was SPECTACULAR. I loved the smoked salmon eggs benedict and I loved how it came on hash brown circles instead of an english muffin. It was so scrumptious and tasted as good as it looked. Everything on the menu truly looked delicious and I can't wait to come back and try it again. The reason why I give it 4 stars is because when I got a box of macarons to go I paid at the cashier and he told me another member of the staff would be with me shortly so I could pick out my macaroons. However, after waiting and standing for 5 minutes I realized the message never got across and I had to ask to pick my macaroons. Next time I hope there is better communication so I'm not just standing there all confused."], ["Liz M.", "BEWARE OF 3% SURCHARGE I've been to Bottega a couple time and I really wanted to like it. The food is ok for the price. The service is always great. The place is extremely noisy, a little to noisy for dinner but may be fine during lunch. I was just there  yesterday for lunch and was really turned off by the new 3% SURCHARGE.  I don't think it my responsibility to pay for the employee healthcare benefits and I don't want to get into politics on yelp. I don't want to see this on my bill!"], ["Kim N.", "**Only reviewing the bakery part**This is my go-to fancy dessert place. I absolutely love everything to come out of that bakery. The macaron selection is bigger than most places and there's lots of unique flavors. My favorite things to get here are the beignets (so soft), le grand macaron (a big maracon with raspberry jam), and the eclairs. It'll put a dent in your wallet trying all the bakery has to offer, but it's worth every penny."], ["Angela H.", "Who doesn't love this place from the massive selection of macaroons, tarts, cakes, cookies, and breads to the delicious menu they have?Been here a couple of times but only reviewing for the items most recently consumed. For appetizers, started off with the Modena and the Caprese salads with fried zuchinni. The Modena, a butter lettuce dish, was delicious and the pairings of the candied walnuts with the goat cheese and balsamic vinaigrette really brought out the flavos in each. The caprese had an overwhelming portion of tomato to mozzarella, which I personally enjoyed, and the fried zuchinni are also delicious especially with the green aioli sauce. For mains, ordered three pizzas, the margherita, the sausage, and the burrata. Personally, the pizzas didn't really stand out to me but I  am more of a flatbread person than full on pizza so I appreciated the thinness of the slices as well as how fresh the marinara sauce was on the pizzas. Dessert - We ordered the salted caramel macaroons, and the BEIGNETS which are to DIE for. I smothered mine in chocolate and raspberry jam and my mouth was so happy of sweet goodness. Very satisfying lunch and you will be sure to be full until dinnertime.:)"], ["Renee D.", "I've been working in Downtown for 7 years as well as living here for 3 years now. I come in to Bottega Louie almost every morning for coffee and eat here once a week. When I tell you my other half and I received the best service today from Patrick (bartender) and Michael (I believe, bus boy) it's the honest truth! Not that I have ever gotten rude service here, but let's just say sometimes it isn't the greatest ( I STILL LOVE YOU B.L!!!) These guys went above and beyond from start to finish making sure we were taken care of the entire time, despite them being busy serving the entire restaurant drinks, wrapping silverware, taking other guests orders all while busing tables too. Your hard work didn't go unnoticed boys, thank you for the great experience today!"], ["Nishad J.", "I walked past this place the first time because I thought it was a jewelry store. Bogetta is beautiful. High ceilings, marble everywhere, and what I'm assuming is gold leaf paint makes it a very elegant dining experience. When you walk in you have a ton of dessert in your face and if you're able to keep walking past it you finally walk by the the peek-into kitchens and get to the seating area. The service and the food here are both great! I ate alone, but my waiter Isaac came by so often I didn't feel lonely! He was extremely helpful and courteous and helped me to find the vegetarian items on the menu. I ended up ordering the Casareccia a very green pasta with kale and asparagus without a compromise in taste. A little pricey, but I'm glad I came!"], ["Melissa M.", "The beignets and mimosas are delicious here. I wasn't a fan of the Italian Scramble but I'll be back for the beignets and mimosas...pure deliciousness!We also didn't have to wait so long considering they were pretty packed when we got there."], ["Elaina W.", "This review is solely for the macarons Bottega Louie sells....Bottega Louie a dainty little place on the corner of Grand Ave--super easy to spot with its glass windows and huge LOUIE letters in gold outside. I walked into the restaurant on a Saturday evening and the place was packed! The tables were mostly filled and there were at least 15 people walking around the front entrance where the macarons and other sweets were sold/displayed. Many different colored, flavor macarons were in the front, then a couple displays of beautiful pastries, and then cakes. On the other side of the wall were some packaged goods that had the most beautiful packaging and colors I've seen! Everything was just so orgasmic to the eye. Just like in the pictures on yelp, the macarons looked amazingly perfect and very well made. Ordered a box of five: Earl grey, violet, salted caramel, grand cru, and raspberry.The five came in an aesthetically pleasing hard box and looked amazing! I tried a few the day I bought it and a few after I put it in the fridge overnight. The macarons definitely taste better after being in the fridge! The violet and raspberry macarons I ate the day of were not very impressive--texture and taste were meh. The other three were much better, my favorite being the Earl Grey--light, refreshing, not too sweet, just as earl grey should be!Overall, the service is wonderful, packaging and product looks amazing, ambience nice, macarons pretty good--I will definitely come back to try their other foods and desserts!"], ["Becky L.", "Excellent macarons. Every flavor is vivid and well executed. The crusts are crispy on the outside yet chewy on the inside. They are expensive but if you love macarons, like I do, they are worth the occasional splurge."], ["Monica L.", "Honestly it's like a 3.5...why? The desserts are 4.5, and the food is 2.5 mehhhhh! Let me break it down...first we'll start with desserts:Absolutely beautifully designed, and made so that nothing was overally sweet. The cakes are moist and rich when needed, the macarons perfect in texture and taste. My favorites include the salted caramel macaron and the almond flour cake...the bf likes the earl grey macaron and the blood orange panna cotta. Everything is, of course, on the pricy side...with macarons going for $33 for 13, or $2.50 each. The chocolate soufflé was a winner, as it was moist and not too sweet, dark chocolate cake on the outside, and a light (this was very sweet on its own) creamy syrup drizzled in.The service for food was very good as well, with the servers all being well-dressed, well-mannered, and good looking. The food itself was up in the air:Ceviche: Very small portion for $14. I didn't even fit in my hand...and honestly, taste was good, but I've had just as good at mom n' pop ceviche joints for much less.Frutte di mare: A wonderful chilled soup made with very fresh ingredients, though the liquid could've been spiced up a tad more. Once again, not worth the $12 for a few mouthfuls of peppers and shrimp.Lamb chop: My poor cousin came from Texas to try the restaurant, only to find her lamb chops burnt and dry :( She ate it anyway because she felt bad sending it back, even though we asked her to.Pasta (starts with a T...): Totally forgot the name, but it was pan sautéed, making the penne pasta crispy, which was interesting. Taste was pretty decent, and the meat was soft enough to eat. Probably one of our better entrees.Overall, the desserts are what you want to come here for when you have money to spend. Forget the food and dine elsewhere."], ["Javier J.", "Because of the review traffic this is the review that's going to get passed on like Tom Brady in the draft but here it goes...Parking: 7$ all day lot across the street is a bargain for DTLA. +The exterior of the building matches the inside decor which not so many places always do +Even though the bakery/cafe area is connected to the restaurant, they do a good job at making it a distinguishable separation +Drinks:  Bellini- Wasn't my order but the tasting of it was nice. Well mixed with a smooth aftertaste. 4/5\"Green\" Juice- Happy with it. It's all veggies aside from the green apple but the apple diffused the all veggie taste perfectly and gave it a playful tartery fruit twist to it, making it enjoyable 4/5Food:Lobster hash- Everything above average except for the potatoes, season them maybe? Considering it's the base of the plate (literally), it did affect it. They weren't bad but didn't live up with the price of the plate. Eggs and lobster, sauce and all were great though. 3.5/5Waffles- Made the mistake of having these brought to me with my main dish, they would of been to die for if I would of had them warm. The batter used turned these into delicious waffles, the whipped cream was quality, syrup topped it nicely. Recommended by our waitress, good pick over the french toast or beignets. 4/5American Breakfast: No judgement, who comes here to order this?Desserts: Tiramisu- Very rich and sweet. It was good but not worth the price tag. 3/5La Vanille- White chocolate and vanilla bean dessert. Overly sweet. 2/5Macaroons- Delightful. 4/5As for the desserts, aside from the macaroons, there are way better ones out there in LA, for the 12$ price tag for each, you can probably get 2 better pastry desserts elsewhere for a mediocre one here. It's a cute place and worth going to, but it didn't climb into an obsession range for me."], ["Benjamin S.", "I finally got to dine at Bottega Louie after hearing about it from friends and co-workers for quite some time.  We parked down the street in a parking structure on Grand and walked the one block over.  There was street parking (came on a Sunday) but didn't bother even checking.  We walked in and immediately my kids wanted to buy the macarons.  They're beautifully displayed in a rainbow of colors.  The desserts in the rest of the cases are also really elegant and look delicious.  More on that later!  Atmosphere is very elegant and formal feeling even though no one except the staff was dressed nicely.  It was very loud in the restaurant so we had to talk at almost in a yell to hear each other.  We didn't have much of a wait.  Most of it consisted of waiting for my brother-in-law who was joining us and the reason we even came downtown in the first place.  Then, they wanted to put us at the table directly behind the host stand which is visible for everyone waiting to be sat and everyone walks by the table.  Um... no.  Maybe they should take that table out!  We waited for a different table to open up.  We ordered quite a bit, actually.  Bruschetta, meatballs, and duck proscuito crostini were our appetizers.  Presentation of everything was beautiful, but wouldn't say the bruschetta was the best I've had, though pretty good.  Bread was a tad on the crunchy side.  The meatballs were quite good and the duck prosecute crostini was awesome!  I had the club sandwich as my entree.  It sounded unique and interesting from the description but was a bit of a letdown.  I wish I would have ordered something different.  Next time.  My kids had the mac n' cheese and that was really good.  Loved the presentation of this dish.  It made me ravenous just looking at it!  As my brother-in-law was about to enjoy his sandwich, there was a hair in his food.  We called over the server and he was so apologetic (in earnest) he replaced the dish very quickly.  The manager then came over and apologized and made it up to us very generously.  It was impressive!  Otherwise the service was a bit on the slow side.Of the macarons we tried the lemon, violet, earl gray, pistachio and chocolate.  They were all really good.  We also got the raspberry grand macaron which was also quite good.  Fruit tart and peanut tart were awesome!  They do desserts really well here and all the food is beautifully presented.  The food was all quite good, but nothing exceptional.I'd come here based on the desserts alone over and over again and am not opposed to their menu.  Great spot in the area for sure!"], ["A B.", "If you're looking for a great place for a delicious drink, gourmet desserts, and wonderful service, this is definitely it. Nestled in DTLA, bottega Louie offers a European-cafe ambience great for birthday's, dates or a delicious meal. Yes, it's pricey, but the ambiance and service are spectacular! If you're in downtown, definitely check it out. Highlights include the Moulin Rouge drink and the Burrata and prosciutto pizza!Ask for Ben, one of the delightful and helpful managers, and Zack, one of the best servers I've ever had!"], ["Marie A.", "This place is, by far, my favorite Italian restaurant. Everything was terrific!Make sure to make a reservation because the wait is crazy! I went last night and got a Shrimp scampi and their dessert special of the night, a chocolate souflé. The shrimp scampi was amazing! The mashed potatoes were perfect, the sauce compliments well with the shrimp and everything else. It just melts in your mouth! I highly recommend it! Also, the service was amazing!"], ["Pete S.", "I don't know what else to add because this place has always been great for me. The musts:Portobello fries-addicitingMacaroons-One of the best I've had and super nice packaging to give as gifts. CROQUE MADAME sammie. Because, I've not had anything quite like it. Also came her for Brunch on weekend and it's not super crowded. Of course, I was only here because I stayed in the area. Otherwise, brunch is usually in the OC area for me. And the brunch prices are actually way better than their regular menu prices so I recommend coming here when you're in town. d31xooys4m1bfb.cloudfron…Yes, it's an open plan concept so the noise level as many have said can get quite noisy but then again, compared to dim sum Chinese places, it's really not that bad."], ["Garett T.", "This place is all about the AC. Hallelujah! When it's so hot outside, that outright is welcoming. Then, you realize you're at a restaurant that specializes in pastries, so you probably won't be going hungry again any time soon. I believe it was around 96 degrees Fahrenheit that day in downtown, so to be chilled felt fantastic.Onto our order! I had the following:-Duck Prosciutto Crostini (shared)-Clam Linguine -Green Tea Arnold Palmer-Beignets with Raspberry CompoteMy absolute unhealthy favorite (which only makes sense when you walk in and see them displayed) were the Beignets -- any dessert pastries could have been great. Texture was soft and spot on. Plenty of sugar, but it's dessert... I got to taste a few of their macarons from my other half as well, also delish.I did enjoy the Duck Prosciutto more than I expected to. I'm already a fan of \"more typical\" prosciutto, and this version seemed to work pretty well. The Clam Linguine was good and fully devoured, although I think the clams were a tad chewy. Did like the freshly ground pepper.Friendly service. Overall, it was a great escape from the heat that allowed us to eat as well!"], ["Lute A.", "Packed on the weekends but worth it.  The food is great. Open air kitchen and the Cameroons are great."], ["Shayne S.", "I love this place. I love how European it feels. I love that I can get in and out quickly and order something to go.  I'm becoming a regular whenever I go DTLA for business meetings.Anything Italian is always better than everything else. Ciao!"], ["Jason L.", "I'm a big fan of Bottega, not only for the macarons, but for the delicious food. Everything about this place screams class, from the ambiance to the decor to the bright gift boxes. There is a mini cafe seating area in front of the bar where you can grab a drink while you wait for your table in the main restaurant area. The menu is the same for both places so if you're in a rush and don't feel like waiting, you could definitely sit in the small dining area. The lighting is dim and definitely sets the mood for a nice evening dinner.While we waited for the rest of our party to arrive, it was nice to be able to sit at the bar and order the same items from the menu inside. We got an order of the mac-n-cheese bacon to start and it was fantastic! One takeaway from this dish: the macaroni noodles weren't soggy, like you typically find which makes for a great taste! Yet at the same time, it was nice and creamy and you can definitely taste the bacon infused inside the dish. Pretty good if you ask me! We ordered a tartufo pizza for the table. I'm a huge fan of eggs and if you love eggs, you'll love this pizza. The best way to describe this pizza is a nice overeasy egg with truffle on top of a pizza. Delicious!!!!! Makes my mouth water just thinking about it.... For my entree, I got the trenne, which is unique in that the trenne pasta is pan sauteed which makes for a nice crunch. There are nice portions of the braised prime rib eye which is tender and packed with flavor. I'm personally not entirely big on the pan sauteed trenne so I'd be cautious about ordering that if you don't love crunchy, hard pasta.My complaints about this place are the noise and lack of reservations. The way the restaurant is set up with high ceilings and all, noise echoes throughout the place. It's tough to hear your counterpart across the table so you kind of have to speak louder than normal. Also, this place gets so crowded that they should take reservations!! During peak hours, you can be waiting a while. Luckily, they have the cafe type seating outside so you can relax and grab a drink/pastry before you get your table. Service was impeccable. Our server was friendly and got us everything we asked for immediately. Just a little tip...if you are wearing black slacks and don't want the white lint from the napkins all over your pants, you can ask for black napkins!!"], ["Lydia N.", "Kinda ridiculous and over the top glamorous.. but I guess this is LA. Loved the Earl Grey macarons the most! It was tasty but mostly intriguing with its pretty flecks of gold."], ["Alex L.", "Ahhhhh, Bottega Louie. I mean what's not to love about a French-Italian tapas inspired restaurant? This place is my go-to in DTLA when I'm with a group of friends or family, and here's why:For starters, it's fancy yet casual. You'll see patrons dressed to the nine, as well as Kings fans in cargo shorts and hockey jerseys sitting steps away from one another. The interesting atmosphere is created by the cafeteria-like setup that's decorated as elegantly as any five star establishment. The high ceilings create a loud atmosphere, which is great for pre-game drinks with friends. But the low lighting and classy ambiance creates a relaxed enough setting that I also feel comfortable bringing my family along for a nice dinner.Speaking of dinner, the food here is outstanding. As I mentioned before, this place is great for sharing. Treat your table to a delicious pizza, portobello fries, or (my favorite) asparagus with poached egg. You really can't go wrong with the small plates. The entrees are great too. I recently enjoyed the Tenne Pasta, which is crunchy noodles over prime rib and a delicious light pasta sauce. Outstanding.Next up, the service. Everyone here is a professional. They're courteous, well dressed, and quick to help you. The restaurant is also very well staffed, which is always helpful. The wait can sometimes be a little long to get a table, but the bar is always equipped with lightning fast bartenders who are ready to keep you occupied until your table is ready. After dinner, don't forget to grab their signature lava cake (which you should order before dinner, as it takes twenty minutes to prepare!), and grab a bag of their famous macarons on your way out the door. This unique dining experience will have you coming back again and again."], ["Michelle L.", "Finally got to try the most reviewed spot in Yelp History! Whoa!Seating/Service: 3 StarsOur party of 13 came to celebrate a birthday, wait was around an hour on a Sunday evening, which isn't too bad.We were initially seated at a round table, and the hostess must have been high or something because looking over at the other round table, there was a party of 6-7 seated comfortably. How in F's sake do they expect us to squish 13 people in that round table? Good thing someone in our party took charge and noticed there were 2 tables along side the booths that would be good for us, so we moved.Service was great, our waiter was very nice, and welcoming. Please note, this place gets LOUD, due to the very high ceilings, and of course, the crowd, you pretty much have to yell at each other.Food/Drinks: 4 StarsI loved their drinks! Black and blue (blackberry mojito) was my weapon of choice for the night, and it did not disappoint. It was both tasty and strong.My friend had the Green Tea mojito which was really tasty, too, it comes virgin, so I would probably ask the waiter to throw in some fun juice, because personally for me, that would just be a total waste of calories.Had a sip of my friend's bloody mary, and that thing is so delicious. I felt like I was drinking a shrimp cocktail. It was super flavorful, and spicy. It definitely had a nice kick to it.We shared a chicken, avocado, and lemon salad, that was soooooo sad. You could easily whip something like that up at home, and it was just too sour and tasted whatever. Would not recommend.Everything else after that, was superb though.Their pork chops were the star of the night, because it was so juicy and tender, all while being perfectly charred and flavorful. If you are a pork lover, you will LOVE this dish. The short ribs were very rich and decadent. It was served over some mashed potatoes. This dish was definitely hearty and should be shared. It was very flavorful and tender as well.Lasagna was really good, although I could have used some chili pepper flakes, but it's a winner too.The Portobello fries thoughhhhhhhh, mmmmmmmm. I love mushrooms, I love fried stuff. I love fried mushrooms! It's a happy marriage, and a party in my mouth. Get it. You won't regret it.Beignets tasted how they should, super fluffy and steamy hot, dunked in some raspberry sauce or nutella. Yum.Final Verdict*I will definitely come back again, hopefully for brunch the next time around!"], ["Nina M.", "The place is nicely decorated and really sounds french to me, but the food there is maily italian style.I've had only sweets this time, macarons a must, they have so many kinds, fresh and crispy. The opera cake was really tasty and moist, the donuts were soooo good and soft and fresh :)The sweets are definitely good to try, all of them!Around us people were eating mainly pizza so I suppose this is the most ordered thing there after the sweets. The pizza was looking nice, especially the four cheese one, will try next time.I saw them making really fancy cocktails so I guess you can try these with the sweets :)But its too noisy indeed, inside there is even kind of an echo, it was very disturbing, definitely not a place to relax over tea and sweets."], ["Silvia G.", "More than just macaroons!During my first time here, the wait for the dining room was so long that we just grabbed one of the small tables on the bakery side and shared some appetizers and desserts. I was not impressed.Recently I came back with some out of towners and had a very enjoyable dinner! We shared:*Pizza with half burrata, half artichoke.  It was good but the thin crust tasted a bit burnt.*Truffle mash was good but didnt taste the truffle*Lobster soup was nice and light, more of a broth*Portabella fries: people rave about them but I personally prefer them sauteed and soft and not crunchy and wrapped in batter*Grilled octopus: also tasted a bit burnt and portion was super small with roe*My entree was the star of the night, Ceppo Gamber: Pasta with shrimp, it was super garlicky with a light olive oil sauce and broccolini. The pasta were little rolls, like scrolls, and very delicious*Hubby got the Trenne: Rib eye pasta with kale and wasnt crazy about it. It was on the heavier side with red sauce. The Trenne pasta is fried on one side which makes it crunchy and a bit hard*Le grand macaron is a nice looking big macaroon with berries but flavor was just ok. I'd rather get other flavor macaroonsService is good but the dining room is loud and dark.    Aside from my shrimp pasta, everything else is average. I'd come back for the shrimp pasta if there is no wait!"], ["Dana K.", "Came here on a late Saturday morning and scored a parking spot right in from of Louie. Finally I got to visit the infamous bottega louie. After perusing the bakery case, I decided to get a box of 13 macarons, blood orange panna cotta, pistachio éclair, and a mixed berry mini tart.The presentation at this location is very high scale, classy, and \"cute.\" Every pastry I received, it was placed in it's own cute square box (you're basically paying for the packaging).The macarons here were okay - the flavors weren't distinct as their individual sign was more tasty than the actually macron. You pay and then get a piece of paper to tally which macaron you want. The girl ended up giving me the wrong ones which is frustrating cause how can you mistake a tally next to the name?! Argh!! Pricey suckers, I'd stay away from these.Blood Orange Panna Cotta- was pretty good, slight hint of blood orange, the fruit/mint on top elevated the flavors. Good creamy consistency and feel in the mouth. This was my favorite goody out from my purchase.Mixed Berry Mini Tart- You can eat this in 2-3 bites. Side note - it isn't filled with custard, but rather it is a vanilla bean cream. So that was a bit disappointing. Had I want a fruit and cream, I would have gotten their cream puff.Pistachio Éclair- Unfortunately, they ended up packaging the wrong pastry and gave me a raspberry pistachio tart! Cool that I paid less, but if I wanted a raspberry pistachio tart, I would of ordered one. The tart had a raspberry filling that oozes out, which made for a pretty presentation, but I'm not a huge fan of raspberry filling and the pistachio/raspberry combination was weird for me.I'd check your goodies before you take off, because they seriously messed up 2 out of 4 for me and there's nothing more frustrating than to drive 45 minutes back home and noticing that they gave you the wrong things!"], ["Albert H.", "Bottega Louie has now over 11,000 yelp reviews. I suppose this is another one for a drop in the bucket. I came to Bottega for lunch on a Friday, and sat on the cafe tables instead of inside, but the wait was pretty short. First walking in, you notice the bakery and the very high ceilings and the pillars on the side. The interior of Bottega reminds me of something a high end place in Paris or New York City. FOOD: I got the Ceppo Gamber (jumbo shrimp with cherry tomatoes with ceppo pasta), which I thought for $20, the portion size did not equate equally. It was not bad at all, but was somewhat expecting a larger portion size. Onto dessert though and this aspect of Bottega justififes its four star rating for me. I got a pistachio macaron ($2.50), although priceier, the quality is very good. I found the cookie to be the right give and tasted very much like pistachio. I see people buying it by the boxes here, and there's a reason why!  At the end of the day, I find Bottega Louie to be a nice date place and really, their pastries are where it is at. Next time I'm in DTLA, I will pass on the meals and skip straight to dessert.Note: There is a parking garage around the corner of Bottega Louie. It is pretty full, at least on a Friday afternoon, but there is parking there and flat rate is $10."], ["Mel L.", "Super cute place and plenty of space. Amazing selection of really nice macarons! Not too pricey compared to a lot of other macarons. They weren't quite as fresh since it was later in the day and they didn't keep as well as Laduree but still nice!"], ["Emily S.", "This place was gorgeous!!  Once you walk in you will see a huge array of desserts all beautifully decorated. I went around noon for lunch on a Saturday.  We were seated immediately. Our server took a little while to greet us but overall she was pretty good. We had the ravioli ($12) , portobello fries ($14) and a tartufo pizza ($20). Everything was delicious! For dessert we had this lemon tart i forgot what the name was but it was a little too sour for my taste. But overall i would definitely come back and visit this place and try out the other items on the menu."], ["Stella B.", "I have heard so many good things about this restaurant so I find decided to give this place a try. Went on a Sunday afternoon and it was not as busy as I had expected it was only a 30 minute wait. We had gotten the turkey club which is really good came with chips that were also very good!   The Eggs Benedict was good. Burrata Pizza was good but I've tried better. Food was delicious, wanted to try everything! Macaroons are worth trying! Lots to choose from. Ordered a few and loved them all. Expresso was my favorite. Would definitely come back"], ["Olivia T.", "Macarons 'n mushrooms.Bottega Louie - the place to go when I feel like I deserve to eat human food... as my daily diet is very similar to the diet of a rabbit."], ["Brenda M.", "I have been to Bottega multiple times. Generally for lunch and amazing desserts.I went in today for brunch and had the Salmon Benedict. However this time it felt extremely salty. I was in a serious hurry, not Bottegas fault, but was also starving and gulped down my food with a lot of water. However I do recommend their desserts! Especially their macarons! Everything I've had dessert wise has never disappointed!"], ["Alana T.", "Beautiful ballroom style restaurant with a great menu, amazing servers, and delicious pastries. If you love good food and a luxurious experience, I would definitely recommend Bottega Louie. I'm sure tourists would love to eat here while staying in LA. It sure has that posh new LA vibe. Everything on the menu is delicious, you won't be disappointed."], ["Mia S.", "This review is solely on the dessert side, not the restaurant. I love their macaroons for the most part. Mango, earl grey, espresso and sea salt chocolate are my favorite flavors. The rose one is subpar compared to some other places.. The staff here are so helpful and friendly. I really love coming here ordering a little treat for myself.. The cheesecake is good too.. I need to try the portobello fries next time!"], ["Amna A.", "A very unique dining experience here. Okay it's a rather pricy outing but def worth it at least once, especially if you are visiting/discovering good places to eat in downtown La. I'm glad I tried it out . Love how it's an open style kitchen so you can see the chefs prepare your meal, although it's pretty loud so if you're looking for a peaceful place to go, this isn't ideal. Gourmet style, clean, super fresh and tasty food. Even if you don't have lunch or dinner, it's a perfect place to grab some dessert and tea/coffee, and the macaroons are to die for! They make a great gift too ;) next time I'd go for tea only"], ["Kimberly H.", "I came here for dinner with my boyfriend since he was craving italian that night. After noticing the 11k+ reviews, I figured that this place must have gotten something right. We came here at 8PM on a Thursday night, and it was still bustling. It is a pretty loud and exciting place to eat at, so if you want a more intimate, quiet, Lady in the Tramp type setting, this may not be the optimal place for you.Our server was good and did everything like he was supposed to. My boyfriend had the chicken parmesan. It was good, but it wasn't worth 4 Yelp stars. I ordered the scallops dish, and they were alarmingly salty. Usually I don't like to bother my waiter with subpar food and just stomach my meal, but I couldn't take a bite and wash it down with a gallon of water and not pucker my cheeks. My boyfriend tried it as well, and he refuesed to let me get hypertension secondary to the extreme salt intake. We spoke with our server and asked if we could just remove the dish from our bill, which he gladly did.We ended the night with their chocolate souffle, which was to die for. I hadn't had such good souffle since going to a fancy French restaurant in Toronto. Oh boy was it worth the $16 price tag and 20 minute wait (it is made to order).The pastries/desserts are chic and impressive in display and in taste. It reminds me of an LA version of Laduree. I have yet to try their macarons, but I'm sure they're worth their $2.50 a piece value given the amazingness of that souffle.Come here for the desserts for sure. The actual food, perhaps not so much."], ["Elvin W.", "Food:  My fiance and I ordered - flat-bread, portobello fries, lobster hash, beignet, and blood Mary.  Everything we order was pretty good.  The fries came with some pesto sauce, lobster hash had some pretty good hollandaise sauce, and bloody Mary was pretty tasty.Food rating:  4.5/5Service:  Our waitress was friendly and attentive, when the place is so busy!Service rating: 4/5Price:  Expect to pay about min $10 for whatever you order.Overall:  The food that we tried was pretty spot on.  This place gets VERY busy which is one of the draw backs of coming here, but really, it's a great place to eat."], ["Mark David Y.", "First, this place is DTLA eptomized.. I had to rave about DTLA's Italian restaurant reputable for its foods and pastries. Bottega Louie embodies an ideas than the sophistication and lure of days past are not intangible. Louie is well thoughtout with 3 kitchens which consist of one main kitchen, one with an in wall Woodfield burning pizza oven, and the another where bread, sweets and macarons are made. Every inches of the restaurant and gourmet market emits class and thoughtfulness.  I ventured out to Bottega Louie located at 7th/Metro Center Red, Purple, Expo and Blue Line Station three months ago cause everybody keeps mentioning this place all the time...There is an elegance and attention to every detail in this restaurant that I adore from marble flooring and delicate ceiling  designs to beautiful pink salt crystals in the shakers on the tables. If you are going to come here for dinner you SHOULD know that they DO NOT take reservations. Basically, it's strictly first come and first served. As others said, it's always extremely busy during dinner time, so I would suggest getting there at least half an hr before you plan to eat. The menus at Bottega Louie is quite extensive and features mostly Italian fare with few French dished combined with in. It offers options including $10 (Salads), $12-15 (Pastas), $20 (Entries). The food itself was a worthy of a repeat visit, although the margheritta pizza to start was a bit uninspired, I've had better on many occasions, and the portobello mushroom fritters were edible but was not fully packed up with full of flavors as we had expected. The mains, however were oustanding. Chicken with artichoke came to grilled perfection, the artichoke melting in one's mouth and the gamberi pasta featured a host of giant shrimp. (4/5)The sausage and bean stew was equally generous in portion sizes and was packed full of taste with good quality meat and NOT the track of gristle or herb stalks (take that Bocca Di Beppo). (4/5)For the Clam Casino aka clams with parsley, breading, bell petter and salt. This dish was truly tastefully done because clams were moist and juicy, slid with the shell with total perfection. The surprising thrill of bacon infused into the topping makes this place a hit. As breading can be bit on heavy side, blend of ingredients are quite interesting enough to keep your attention without overpowering it's intention.(5/5)For the roasted beet terrine which is roasted beet, buffalo mozzarella, watercress, chive, tomato, radiccio, light vinaigrette with salt and pepper, such a bright salad. Beets were prepared to perfection and each notes reveled in the culmination of flavors happening on the plate. From visual presentation of color to wonderfully lighted dressing, welcomed success. (5/5)Brussels Sprouts with Pistachio, As Brussels Sprouts are not the majority of the people's favorite vegetables, they are nature's unsung Victor ONLY if it's prepared correctly. This place has found a rather understated approach that feeds the need for a baby Brussels Sprouts by adding very simple element called Pistachio.(4/5)The real star was the dessert which is Chocolate Souffle which needs to be ordered at the beginning of the meal because it requires beating the eggs white for 20 minutes until it becomes firm peaks form.  Perfectly risen and perforated by the waiter by vanila custard sauce, it truly made the evening complete. (5/5)My only few complaints are that the restaurant is very open so it is a louder establishment and plus the portion sizes of some dishes didn't really satisfy my hunger. So far, I had pleasant experience dining there with my buddies and hope your dining experience is great as well. Great downtown eatery by the way!!"], ["Maya W.", "Yes this place is loud, and probably crowded all the time (except when kitchen opens on Sundays).But every time I've been here I had a great experience, whether it was drinking at the bar, getting a pastry, sitting down for coffee or getting a meal. I've come here with small groups and large groups and they were always able to accommodate me.The food looks wonderful, the place feels very clean and honest (the kitchen is visible and the chefs look competent). This place is serious about their image and quality. The service is top notch. They make you feel important. It's in the middle of downtown, so there isn't really parking, so I stop here if I'm already downtown or on a weekend when i can find cheap or free parking within a couple of blocks.  This place has something for everyone (except the claustrophobics and the people sensitive to loud sounds). I take people that are visiting or new to town here. I have also celebrated my birthday here a couple of times. There are also some great gift options like macarons and candies."]], "Osteria Mamma": [], "Colori Kitchen": [["Kenny H.", "Let me just start by saying \"no corkage fee!\" Food is hands down exactly what you are looking for in this dtla. This is a hole and the wall and deserves all the love. From the great meal to the great service! Coming back again!"], ["Maria C.", "Very unassuming, but don't let that fool you! Honestly, we were looking down the street and thinking \"did we take the right street?\" The sign outside looks like you're going into a dive bar. Low and behold, when you walk in, it's super charming and rustic. I love how the restaurant is very cozy and intimate. Make reservations, however. I made 530p reservations and luckily we were led to a table promptly. The tables are close together and your neighbors are super close to you. Kinda awkward if you're going on a date. There are lots of groups that come here. I think what brings people here is that you can BYOB and BYOD (booze and dessert). NO CHARGE! We noticed people bringing in their own bottles and people seated go out and buy bottles from neighboring stores and bring them back! WHAT?! That's awesome!!!We were provided waters, comp bread and hummus. OMG, the hummus is delicious! The warm bread was yum too.We orders came from the specials of the day menu. We split the Insalata Cavolo ($10) which is baby kale, baby arugula, avocado, red onions with park dressing; Tagliolini mare monte ($19) which is homemade pasta with mushrooms and tiger shrimp and tomato sauce; and Chicken Risotto.The salad was amazing. I didn't think I would like it honestly. Simple yet tasty! I really liked the risotto better than my pasta. The risotto was flavorful and buttery. MMMM!!!Service was good. It was super busy the night we came and we had to ask the various servers for water, bread, and hummus. Despite that disappointment, the establishment and food were good! I would definitely come back and grub on more Italian."], ["Sandra S.", "Used yelp to make reservations on a Saturday nite. Yelp reservation gave me time when open table said it was booked. calori kitchen was packed , great service and good company. This place was a hit with our friends who visited downtown for the 1st time."], ["Linda H.", "I LOVE COLORI KITCHEN! One of my favorite Italian restaurants in LA (the other is C&O), but the pasta is so much better here, hands down! And I lov e that its so affordable and BYOB. BYOB- I've brought 2 bottles here between 3-4 people and it's been fine, so I'm not sure what the cap is on how many you can bring?Calamari Appetizer- Must get! Definitely unique and a nice change from the deep fried calamari you get at most Italian placesTagliatelle Bolognese- Hearty, meaty, and oh so goodI had alot of other pasta dishes on the menu and none of them have really disappointed."], ["Christina T.", "This place won me at homemade pasta and no corkage fee! If you're looking for a good Italian restaurant without the fancy-schmancy, then this is definitely the place to go. From the exterior, you would probably never imagine this gem of a place..honestly you would probably walk right past it without thinking twice. The inside on the other hand, is very inviting and comforting; from the open kitchen layout to the brick walls covered in art paintings. It is a small restaurant, so they do advise you to make a reservation. We made a reservation but it didn't seem too crowded. I'm sure on the weekends it's a different story. We got seated fairly quickly and the waiter came to open our wine bottle. NO CORKAGE FEE for first bottle! He was very friendly and told us about all the specials.. we ended up ordering everything from the specials menu. Trancio di calamari: This was their grilled calamari steak appetizer. Cooked perfectly.. not chewy at all. It was very light and refreshing, the perfect appetizer before our heavy meal. The garlic sauce on top was amazing. Lasagna della nonna: The flavors were really good, but lasagna is lasagna. What I did like was that every bite had a perfect amount of pasta, cheese, and meat. Tagliolini mare monte: This was my favorite! Homemade tagliolini pasta with mushrooms and tiger shrimp in tomato sauce.  They cooked the pasta to a perfect al dente and they weren't stingy with the shrimp either....it was super delicious. I definitely would order it again. There's street parking or parking lots. I parked in the lot on Hill between 8th and 7th and it was $4 after 4 on Thursday. TAKEAWAYS + Calamari+ Taliolini mare monte+ BYOB. No corkage fee for first bottle!"], ["Minkkwan W.", "Four stars for:- Sliced Calamari Steak which was cooked perfectly, sliced on a bias and topped with a delicious sauce. Served with a side of leafy green salad with vinaigrette. This dish I would definitely come back for!- Spinach and Ricotta Ravioli with Red Sauce, where the pasta was perfectly Al dente with just the right amount of bite to it. The filling was so fresh and not overly cheesy which I loved. The pasta sauce was also light and tangy with a nice texture from the Parmesan cheese. Love love loved this dish!Three stars for:- Parchment Paper Wrapped Cod with Assorted Seafood, as everything tasted a bit too seafoody and the cod was cooked quite tough. The flavor of the burnt parchment also seeped into the food which left a bad aftertaste on your tongue while eating this dish. Perhaps we should have tried the other cod dish our server kept trying to push us to order. Either way, I think there were plenty of other delicious items on the menu I will just forego this one :)"], ["Isobel L.", "There aren't many great restaurants within walking distance of my office in south downtown L.A.. And by walking distance, I mean one mile or less. Thankfully, Colori Kitchen is there for those times when only homemade pasta will do. Having eaten here several times, I can vouch for the consistency and deliciousness of the pasta. Last night, I had the ravioli ricotta e spinaci  which was fantastic and also happens to be vegetarian. Prices are on the high end but I was able to take home enough leftovers for lunch the next day. Interesting that a generous portion of fresh, warm bread and garbanzo bean dip are served free when you arrive; but tap water is $.50 per glass! Odd, indeed, but the waiter informed me that this was due to the drought and fees imposed by the city of L.A.Colori now has a frequent diner's program: visit five times, earn an entree up to $13 free. No alcohol. BYOB (rumor has it there is no corkage fee but I didn't ask....)Service was great. Atmosphere was \"local Italian restaurant with cool art on the exposed brick walls.\" Better than Bottega Louie! That's right, you heard me. Ciao."], ["Maxwell N.", "Colori kitchen is a very loud and festive place making it feel warm and welcoming, which it was. The service was great and the specials thoroughly explained and my water always full. However the food was subpar. The mozzarella on my Caprese tasted like it was on sale at sprouts, and there was little to no vinegar on it. The meatballs came in a Marinara that tasted like sweetened tomato paste and the meatballs themselves were very basic and left a lot to be desired. My girlfriend ordered a green salad and bolognese and both tasted unseasoned and I wouldn't recommend this place."], ["Carolina S.", "I have to say, Colori Kitchen is the BEST Italian food I have had thus far. I've never been to Italy, but hope to one day visit and eat my way through every city, but for now Colori Kitchen will do. First off, you MUST make a reservation, especially if you are going to show up with a gang of people (6 or more). They get really busy and the place is pretty small. So call ahead and make a reservation!Appetizers I recommend: 1. Calamari- It's a pan-seared calamari steak drizzled with a lemon sauce and served with baby arugula and cherry tomatoes. So delicious!2. Eggplant Parmesan- It's baked in the oven and the cheese that melts on top is delicious.Entrees:1. Spaghetti al pesto- the pesto is homemade and absolutely delicious!2. Cappellini puttanesca- delicious angel hair spaghetti with cherry tomatoes, olives, capers, and olive oil. (I HATED olives until I ate here)3. Pollo funghi al vino marsala- you get two thick chicken breasts topped with marsala sauce, broccoli, and potatoes. So freaking good!You have to get dessert!! Order their house cheesecake which is made from ricotta cheese (thank me later).Another great perk about this place is the fact that you can bring your own bottle of wine or beer. There is no corkage fee! They do not sell alcohol there!Honestly, everything is delicious. Their specials change daily and are worth trying.***Greg is an awesome server who is enthusiastic about everything and quite the comedian. If he is there, tell him Carolina sent you.***"], ["Michael C.", "Top 5 of all Italian spots ever and best In DTLA. I go at least once a week I've been to Rao's Martaronos and its up there with them"], ["Lily T.", "Colori Kitchen is awesome for many reasons:-No corkage fee= always nice :D-Lots of diff pasta dishes and everything tastes fresh-Affordable-Friendly serviceFOOD:-Complimentary bread + hummus dip: Bread was forgettable, but liked the dip!-Calamari Steak: Good appetizer, nice texture and topped with a nice sauce-Pesto spaghetti: Added chicken to this, but chicken tasted extremely dry.  However, the pesto sauce was good.-Tagliatelle alla Bolognese: Tasty and I liked the thickness of the pasta noodles.-Pumpkin ravioli: Surprisingly, this was my favorite dish of the night! I usually don't like pumpkin too much, but it worked well with the sauce.-Risotto- Meh, could have done without this plate.  We added shrimp to it, but it did not look appetizing, nor did it taste appetizing.  I felt like it was missing something or it was too bland in flavor.-Panna cotta: Tasted light, but this was just okay for me.  Not sure I would order this again-Cheesecake: I liked this, but probably because it was less cheesy and more like a sponge cake haha"], ["Kelley L.", "If there was such thing as the most perfect delivery, it would have had to been presented by Colori Kitchen.You have no idea how excited I was to learn that Colori Kitchen delivers for free ($15 minimum purchase) via Eat24. I was SO excited that I put in my order around 10 A.M., although I knew they did not open until 10:30 A.M. As someone with only a half-hour lunch in DTLA, thinking of having an Italian lunch is impossible. Work is too busy, and even if I coordinated time to work around other people's schedule, it would be too difficult to order and consume that food within 30 minutes.Thankfully, I was able to enjoy my meal! I ordered the spaghetti combination. It's only $1 more than the regular entree, comes with a drink and soup. I got the tomato soup and iced tea. When the delivery guy arrived at my work location -- AND HE GOT IT RIGHT ON THE FIRST TRY, unlike most other delivery people -- he was probably the best delivery person in life. In fact, he delivered the best customer service ever: showed me all the food items, got all the utensils, didn't spill, AND he asked if there was any more he could do. He was even more amazing than the food.However, the food was pretty amazing. It was well worth the $20 (including tip) I spent that afternoon. In fact, I had so much food that I did not finish the bag of fresh bread and my soup. It was sooooo good though. I am definitely ordering from here again and also hope to have that guy for delivery again. GRAZIE!"], ["Ruth K.", "Please get the calamari appetizer. I could eat five plates of those.I decided to be basic and ordered the spaghetti meatballs. I think the pasta sauce was just okay, but the meatballs were heavenly!! My table also ordered the arugula salad? (Sorry I don't remember the exact names of the items...) SO GOOD. I tried a little bit of the risotto and pesto pasta. Both really good! The pesto was really thick and strong.. If you like that, great! OH and they have a black cod dish and it is heavenly. So buttery smooth, mm mm mm. The ambiance is pretty chill; our server was nice and informative.BUT I had a huge problem with the busser or food runner or w/e he was. So rude... He literally gave me \"the hand\" when I said excuse me after he ignored us five times. Crazy how one bad employee can almost ruin the whole meal. He's lucky I was with good company! I'll definitely be coming back, hoping that the rude guy won't be there."], ["Juan F.", "4.5 but I'll round up.I am not a pasta fan but I do enjoy a good pasta every now and then. I really hate mushy pasta or oversauced pastas. I came here with low expectations as I have been previously disappointed my Maccheroni Repubic and C & O Trattoria.Made reservations for 7pm and my GF and I got there a little early. Surprisingly not packed, but busy. Since it wasn't too packed, we had the option to chose were we sat. Restaurant is pretty small. It is very cozy and intimate with nice decor. Staff was super friendly and attentive.Bread and Hummus? - Not sure if it was hummus, but it was a hummus like spread. It was super flavorful and delicious. The bread was warm and the crust was nice and crispy. Definitely one of the best complimentary breads I've had! It made me hungrier!Calamari Steak: Every body raves about this. I wasn't sure what to expect since the pictures looked pretty plain and boring. The calamari steak is lightly pan fried and sliced perfectly. It is topped with some lemon aioli with a side salad. The calamari was simply amazing. Super sweet and tender - almost has this sashimi taste and texture to it!Tagliatelle Alla Bolognese: I loved the meat sauce and the pasta. I definitely recommend this for meat eaters... it will satisfy your meat cravings temporarily.Pesto Spaghetti: Rich and delicious pasta over perfectly cooked spaghetti. Added shrimp as the meat for $6... not worth it since we only got about 5 shrimps. Very tasty though!Overall, one of the best traditional pasta/Italian food I've had in LA. Parking is a hassle. I found metered parking 1 block away though. Even metered parking is expensive!Oh I forgot to mention, BYOB!!! No corkage fee!!!"], ["Danny N.", "So I had a pretty rocky start and was ready to give this place one star because they CANCELLED my reservation for no reason and without even notifying me.  So I was already unhappy when I came during my reservation time to find out that my name and table wasn't even reserved or even on the computer system.  Luckily, we got a table after we waited for a few minutes right away. So I was a little bit happier after that.  There are two reasons why I wanted to try this place. REASON 1...Bring your own wine and beer! So I had two bottles ready for our feast.  REASON 2...the cioppino!So I had to order their famous cioppino, no matter what.  MAN I WAS IN LOVE.  The taste and flavor, so rich and no really seafood smelly.  The sauce was so sweet and delicious, I want more!  The prime rib was nothing special, very dry and disappointing.  The spaghetti with pesto sauce was very good.  We also got another one of their famous pasta dishes, the damage was done with 35 dollars per person.  This place is good, no doubt.  The only real complaint I have is the food takes a really long time to come out.  We probably waited at least 30 minutes till our first dish came out.  They need faster ticket times!TIP: THERE is always street parking in the front!  If you want a drink, stop by the bar next door too!"], ["Yushan W.", "Came here to celebrate anniversary. My bf was careful finding parking because some streets are kind of dangerous. This place is tiny but quite romantic. We got seated as soon as we got in and the waiter was really friendly (really talkative) Its a BYOB place so me and my bf got to enjoy the wine and food and NO CORKAGE FEE.They provide complimentary bread with humus dip. I have to say that i love the bread, it was warm and soft. The humus dip was rich and you can taste the chickpea. Me and my bf got three round of that...(not guilty) Appetizer-calamari steak was outstanding, the calamari itself was tender, buttery and well cooked.  The dressing was so fresh that it increase your appetite. Main dish- I had the pesto pasta with shrimp, the dressing tastes light and not heavy at all. Some restaurants are pretty bad at giving dressing when it comes to pasta but this place definitely gives you enough amount of food and dressing. My bf got Tagliatelle alla Bolognese, i actually like his better than mine, the meat sauce totally got me. The pasta noodle was chewey and homemade.I would recommend this place for a romantic dinner and gathering with frds!"], ["Catharine Y.", "I received a lunch combo of fettuccine alfredo with meatballs + minestrone soup +an arnold palmer for $18! The pasta and sauce are fantastic. The sauce is creamy and the noodles are made/cooked perfectly. The meatballs are also tasty in a carrot/tomato/onion sauce. I ordered through Eat24 and tt took them awhile to deliver the food (~1 hour) but it's totally worth the wait! I'll definitely come back here again."], ["JoEllen S.", "I was expecting more based on the YELP reviews. Ambiance... Loud and crowded. Nice that you can bring your own wine and there is no corkage fee. The Gopher Bar next door sells liquor if you forget to bring a bottle of wine.Food was disappointing. My husband had the calamari appetizer, he and our friends all agreed it was mushy and had a bizarre texture. We told the waiter we were not pleased with it and they took it off the bill.  I ordered the lasagne, it was creamy and gummy with very little sauce between the layers. I didn't eat very much, it was hard to get down.Waiter was attentive, and that was a plus, although it was obvious by his demeanor he was a struggling actor wanna be. that's L.A. for you, to be expected. I probably wouldn't go back again, however the Gopher Bar next door is pretty cool!"], ["Laura Y.", "Colori Kitchen is a small Italian restaurant on 8th & Olive and it's a must try if you're in DTLA and craving pasta! I came here a few times when I lived a few blocks away. It's definitely a local joint but I feel like word has spread how delicious it is and now people from all over come and try it, which is never a bad thing!It's definitely not a fancy joint so you don't need to dress up or anything. Reminds me of a cute little mom and pop joint but with a hipster vibe?? It's small and cozy inside and make sure you byob since there's no corkage fee. The bread with hummus is a great start! What other Italian places give hummus instead of butter or oil & balsamic? The prices are very reasonable as well. I don't know if this is like a first date kinda place since it's so casual but it's definitely somewhere I would come for dinner on any night of the day, with a bf or just a group of friends.Food I recommend:-calamari steak: great appetizer, pieces of easy to chew calamari topped with an amazing sauce -caprese: simple, fresh and a great salad to start off with-pappardelle with wild boar ragu: sauce is to die for.... Pairs oh so perfectly with the amazing thick pappardelle noodles -tagliatelle: noodles are perfect just like the sauceService has always been okay. I think I only had one bad waiter experience here but it was trivial. I also had one bad experience with food as well. I ordered a cooked fish instead of my usual pastas and regretted it terribly. Fish was dry but whatevs, I sucked it up and ate it. I feel like not every experience at one place can be 100% perfect. It doesn't stop me from loving this place though! A great place to try in DTLA for sure! You can grab drinks afterwards at Golden Gopher next door, which is a pretty cool bar. Parking, of course, is gonna cost ya. Maybe $4 min & $10 max around that area. After 8:00, look for free meter parking or loading zones!"], ["James B.", "I heard so many good things about Colori. I'm sad to report that it was overhyped and overpriced for what it is.Food:1) Burrata - can you really go wrong with burrata?2) Pesto Spaghetti - it was good, but not worth the money.Service:The servers were friendly and provided great service.Parking:Street parking on 8th street in front of Colori. It's free after 6:00 or 7:00. You'll have to double check."]], "Maccheroni Republic": [], "Bacaro LA": [["A T.", "SOOO GOOD! Bone marrow is my FAVORITE. Boyfriend takes me here a lot now that I introduced him :). Idk what they do to the zucchini but it's the best part of the hanger steak which is amazing. We also got the Bacaro Fries and macaroni and cheese which were delicious! My boyfriend got the pizza with mushrooms on it and a few other things I can't remember but he didn't really like it, as did I, but maybe we can order a different one next time :). He also got the sangria because it was happy hour (all the plates are $6 compared to $8 Mo-Thu 5-7). I'm not much of a drinker but the Sangria was VERY good and he loved it too, so. Anyway, all in all, one of my favorite places to eat and hope to be back soon!"], ["Eric E.", "This place is bomb. Service was on point. I had the hamburger and a Bloody Mary for brunch today. The fried egg on top was amazing. This is a gem of the area, and when you see their beer selection available, you'll see why too. Definitely check it out, especially if you live around the USC area."], ["Jessica M.", "I am updating my review because my waitress today was amazing! Celina was attentive and overall outstanding!!! Thanks for proving good service Bacaro!... I lived in Italy for a while, and this place always takes me back to Europe. The fries, chorizo pizza and sangria are my favorite. I come here at least once a week, and I'm still not bored :D! I would give it 5 stars but the service kills it for me :(."], ["Erika M.", "Hands down, Bacaro LA has my most favorite Dine LA menu!For $40, you got 2 cheese options (4 if you came with a date/friend), 2 entrees, a dessert, and, get this, open bar for 90 minutes! What?! That, in it of itself, was a selling point. But, the menu options really solidified our choice. So, we got to try all four of their cheese choices, along with salami, figs, almonds, and a side of delicious honey. This is the perfect way to start a meal, FYI. For the entrees, we shared the crab crostini, mac & cheese (with added bacon for an additional $1), bacaro burger, and seared scallops (for an additional $6). Everything was amazing. The seared scallops...scrumptious! Mouth watering, orgasmic deliciousness. The crab crostini was so good. It's a bit of the mayonnaise-y side, but even the hubby, who hates mayonnaise loved the crostini. The mac & cheese was cheesy and on point! And, it paired really well with the burger. The burger itself was... interesting. It was served in a deconstructed format with an egg on top. It wasn't bad, but it didn't wow as much as the other plates. We each got to try  their dessert items. The bread pudding was heaven-sent. Paired with the vanilla ice cream...yuuum! The malabi was surprisingly good. I don't think I've ever tried anything with rosewater, but it just went very well with the custard, habiscus, & pistachios. The drinks were flowing the entire time we were there. I got their sangria and the hubby went with a white wine. That alone, was probably more than the $40 price tag, so we definitely feel we got our money's worth, while trying all this delicious food.Bacaro LA really knows how to keep things spicy with all of their specials:*HH: M-Th 5-7pm with $5 sangria and $6 small plates*Half off wines by the glass on Mondays 5-10pm*Wine down Wednesdays 5-10pm - wine is $1 cheaper each round*Beefsteak Sunday 5-10pm - All-you-can-eat petite filet, house fries & onion rings & Open Bar (house sangria, red wine, white wine, champagne, Bacaro Beer) for $35/person. *& you can also add the open bar option to any meal for $20 (that's a steal!).They also have an amazing brunch that I absolutely gotta try! Free brunch drink with Yelp check-in!"], ["Kate B.", "Everyone raves about this place so I really wanted to check out what the fuss was all about. I came with my boyfriend and we had a livingsocial coupon. The bad side is that we can't use the livingsocial coupon for happy hour so for two people, we spent the $40 of livingsocial coupon + $25. For $65 dollars total, we did not have a great experience.We ordered the grilled pork belly skewers, bone marrow and bacaro burger with an egg. Everything was actually really disappointing. Everyone says the bacaro burger is to die for, but honestly I would rather have an In-N-Out burger for 1/3 the price. The bread was really hard and dry, the meat was not cooked to medium, and overall, it just wasn't that good. The bone marrow came with pieces of burnt bread and we asked for new pieces in which the server was happy to provide. The pork belly skewers were probably the best out of the three but a little too thick and fatty for our taste. We also got a cheese and salumi plate with delice de cremiers, cana de cabra, and the salumi calabrese. The cana de cabra was a little too strong for my taste, but I really liked the delice de cremiers as it reminded me of brie. The salumi calabrese was pretty good and kind of covered the cheese taste so it was good. The bread came out warm. We also got a liter of sangria to share between us two. Because we could not get the happy hour price, $15 for a liter of sangria is kind of expensive. I did get a good buzz from it but I doubt the boyfriend felt anything. Overall, I was disappointed given I had really high expectations for this place. One thing is that I felt like the service was really good because we wanted to watch football and they don't usually play football on Mondays but they played it for us anyway. PARKING: street parking. don't walk too far away from the restaurant as the area gets a little ghetto. I think I would come back for the open bar because $20 all you can drink is an awesome deal. For the food, I don't think I would return."], ["Trang B.", "BrunchWent with a group of 12 for open bar. I definitely prefer the food during dinner time because I can't resist mac n cheese and burrata, though they did have overlapping items like the open faced burger and bacaro fries on their brunch menu. The goat cheese polenta and potato hash were both full of flavor, I recommend splitting with someone as they're both heavy dishes.The rest of the afternoon was filled with sangria, mimosas and belinis by the pitcher. The belinis were my favorite, and their bloody marys can use some work.Their service was superb that day. We definitely were a noisy bunch, but all of our waiters were affable and patient, and there were always drinks coming."], ["Shirlene L.", "The restaurant is somewhat small and the acoustics in there are terrible! It gets very loud and noisy even with a few tables seated, though I might add it's probably because everyone has been drinking. Hearing was quite difficult in our group of 6. There is a tight, small parking lot in the back or you'll have to battle the LA streets for some parking.This visit/review was for Saturday brunch.I love their variety for brunch cocktails. We went with the bottomless option for 1 hour - yes, they do time you & they don't give you a last call. They bring out your drinks in half-liter or liter carafes. I was happy with my sangria throughout the meal. The rest of my party started with strawberry bellinis - they mostly tasted like straight champagne, and ended up having the sangria.For the tapas, we went with 12 tapas for 6 girls which was a bit too much food. The menu could basically be described with two words: Egg & Carbs. French toast was my favorite dish. Soo good, not too sweet, & crisp to perfection. The tofu scramble was also surprisingly very good. Full of flavor and the warm kale complements the tofu scramble. The bacaro fries includes a fried egg atop a bed of fries with boring gravy - nothing special. The one bite of their croque madame I had was good, but I wasn't clamoring for more- partly due to cutting carb intake in my diet. Crab cake benedict had a nice crisp and was full of crab. Shakshouka: most of my party really enjoyed this dish, but it was much too salty for me. I'd skip the potato hash and goat cheese polenta next time. A good deal of these tapas have a fried egg in it - we didn't break the yolk in most dishes since my friend has high cholesterol.. this may have changed the likelihood of each dish."], ["Vy T.", "Came to Bacaro with a livingsocial deal. I like the atmosphere, very relaxed with dim lighting. Onto the food, I ordered a couple different tapas. 3 for $21, unless otherwise specifiedThe bacaro burger: open faced burger, added an egg on top for $1,  was okayLamb burger: really good, parsley tahini sauce made it refreshingFree range egg pizza: smokey flavor and egg was perfectly cookedGrilled hangar steak: Amazing, the meat was high quality and flavorfulBread pudding: very light, not too sweet. Perfect dessert to the end of the mealIt's in a weird part of town, but the interior definately makes up for it!"], ["Soojin S.", "Came here on a Friday night. Extremely loud. Huge groups of what looked like a frat (at least they talked like it) and college students, probably from USC since it's nearby. We would've probably had a better experience if we were looking for this kind of atmosphere but we most certainly were not lolol. Thought maybe the food would make up for that but it didn't. Bone marrow: probably only tried this once before at FO but it was pretty good with the baguette. I mean, if you like that sort of stuff. Bone marrow, blood, tendons, intestines, you know. The usual. Mac n cheese: recommend without the bacon. Without bacon?! Who is this crazy lady?! I'm all for bacon but this was just wayyyyy too salty. Eggplant with lamb: I don't know exactly what I was tasting, but it was good... And interesting. Sliders: meh. You can live without them. We ordered this because the Bacaro burger looked way too messy. I doubt I'll come back here. The neighborhood is not so nice and parking no so great. It was worse cuz they were shooting How to Get Away with Murder. Yeah... Perfect neighborhood for that. HAHA"], ["Candace L.", "Bacaro provides the perfect setting to chatter your head off while munching on good eats. Fairly noisy, rather dark lighting, and small plates style sharing -- grab your gal pals and head over here. However, be prepared to wait since they only take reservations for parties of 6 and it can get real busy. Conveniently located close to downtown, Bacaro was my dining spot of choice before going out to DTLA. Everything was bursting with awesome flavor. From the cauliflowers to the mac and cheese, the flatbread pizzas to the bone marrow, it was like a party in my mouth. The shared sangria pitcher was the confetti. My only gripe would be that the complimentary ice cream birthday dessert they served me had entirely melted... so essentially I received vanilla soup with a candle in it. :( Why the waitress thought it would be alright to serve me that, I will never know. Bread pudding was ordered to try and fix this situation, but I would say out of all the items we ordered, the bread pudding could've been passed on. It's a good thing I like you Bacaro. I will be back for more (of your main dishes)."], ["Jennifer W.", "I really wanted to like this place, but I am 99% certain I became ill from the barramundi. My husband and I came for his birthday, ordered 5 tapas, and shared everything except for the fish (he's vegetarian). Upon first bite, I thought it tasted oddly strong for barramundi, which is generally quite mild. In the interest of being easy-going, I didn't send it back, and we proceeded with our celebratory meal. Towards the end of dinner, I began to feel very nauseous. We grabbed the check, and rushed home, where I vomited several times. I had headache, nasuea, and chills for about 24 hours afterwards.With food poisoning, one can never been completely sure what caused it, but sometimes you just know - this was one of those times. Everything else we had was delicious, but I still shudder every time I am reminded of that fish."], ["Doug P.", "I've been back a couple more times and we had a great dining experience each time.  Love every food and beers are great!  Parking sucks though.  The parking lot is long and narrow with the exit gate locked. If you do't find a spot, you have to back up the whole way!  Don't know why the exit gate isn't open.  There's usually street parking in front of Papa Johns tho."], ["Gladys h.", "According to \"1/27/2015 Refinery29 LAThe All-Time Best Brunch Spots in L.A.A favorite haunt of USC students, Bacaro L.A. serves up small-plate brunch, with dishes meant to be shared with the whole table. The tofu scramble is not to be missed, but meat lovers will also revel in the signature Bacaro Burger.\"I definitely suggested the Bacaro Burger with fried egg, and the kale salad which has a twist that added egg and bacon and it's a hot dishes! Bottomless drinks are not to be miss and the restaurant is very nice to cater your need. My friend is pregnant and instead of wanting to have bottomless mimosa the waitress is very thoughtful and understanding to switch it to bottomless OJ. We have 4 people ordered about 7 dishes and are totally enough!"], ["Sara D.", "3.5 good food but way way too expensive. It's such a small quantity you'll be eating an appetizer for the same price as an entree. But definitely good quality so it could be nice to go to once."], ["Vivian S.", "Came here with a friend for a Saturday brunch date. We had a trio with the Bacaro burger, French toast, and the fries. My favorite was the Bacaro burger. I loved the ciabatta bread, the egg on top and the seasoned patty. The fries were underwhelming, we even added the additional egg on top, which didn't do much to it. The French toast was good, not too sweet. Service was friendly. There was no wait. Parking was not the best."], ["Rayshawn W.", "Visited on a Sunday night with friends. The food was pretty good. Tried 4 dishes and was satisfied with all, especially the Bacaro Burger and lamb stuffed eggplant.I was shocked to see that it was a very small restaurant and how quiet it was but then again, this was a Sunday night. Service was excellent...the downside was I was hungry again about an hour after leaving. This doesn't take away from the experience but just a heads up that you might want to order a bit extra due to the size of the portions.Dinner 1/6/2013"], ["Ryan A.", "Such creative food and the friendliest staff. Tiny joint, so make a reservation. Great selection of wine, and each item on the menu has a lot of flavors that keep things interesting. The plates we got were small, so we ordered more than we expected. Despite that, it's still very reasonably priced. This place is on par with the fancy DTLA restaurants you always hear about (Baco, Bestia, etc.), so be sure to give this place a try."], ["Clara K.", "I've been to Bacaro a few times and think it's a great place for tapas, wine and beer. Happy hour prices are great but if you miss happy hour, most of the menu is 3/$21. My favorites are the cauliflower, pork belly skewers, lamb-stuffed eggplant, mac and cheese, and burrata.I wasn't too impressed with the hanger steak, and they were out of the Lambrusco so I got a glass of the Moscato and it was way too sweet.It's usually pretty easy to find street parking, so that's a plus."], ["Vangie A.", "Came in around 7- all seats inside were reserved (no reservations for parties less than 6). Came here for my boyfriend's birthday dinner.Luckily,there was one last outside seating available.We sat, it took about 10 mins for someone to come out and get our orders.We ordered :(rate on scale 1-5)Seared scallops :4-well cooked with good flavor Cauliflower :2-bit disappointed, under seasonedLamb eggplant : 2-it was just crunchy... With a bit of lamb flavor Lamb burger :3-complimented by sauce Shrimp tower : 3-It was OKHangar steak:3-VERY small portionPoached shrimp :1-not a fan, couldn't taste the citrus Pork belly skewers :4-tasty! But nothing amazing Bacaro burger :2-okIt was good. Just not \"coming-back-for-more\" good for me.Also, I told a server it was my bf's bday- nothing."], ["Erika D.", "I loved this place! I took my SFO friends here and they loved it. The $35 bottomless (select) drinks for 1.5 hrs with 4 (shared) cichetti was unbeatable. Our server was helpful and patient, and I hate that I don't remember her name now, but we left her a big tip! Girl, you were awesome! Anyway, best items were the glazed pork belly skewers and the bone marrow (duh - photo attached). The wine selection on the promo was limited but it was good. Can't wait to go back and try the brunch this time!"]], "Maximiliano": [["EVELYN Z.", "I'm genuinely perplexed as to how to rate my experience at Maximiliano - it would be between a 2 and 3 stars, so I'll round up. Our friends had been wanting to try this place out. And since we hadn't hung out in a while, this seemed like a good opportunity. We had made reservations ahead of time, to avoid having to deal with the dinner rush. And I'm glad we did because even though when we got there it was almost empty, by the time we left, it was almost full. They have a good enough selection of wines, and the beer selection was good, which is always an indication as to how the night goes. Food:My fiance and I started with the crab cakes. He and I are super picky about them, because even though restaurants claim they are made-to-order, some are not. After being reassured that they were not frozen, we order and await. Long story short, it was just \"all right\" but nothing to write home about. We've had amazing crab cakes before (Nikka Fish & Grill - review coming soon; Ruth's Chris - OH. MY. GOD. GOOD.) and these were not \"mmmmmmmmmmmmmm\" worthy. The aioli that they use at the bottom of the cake was delicious, though. We then ordered a Margherite pizza and the braised short ribs to share as our entree. Now, the Margherite pizza is one of my favorites because of the freshness of the basil and the mozzarella cheese. Unfortunately, this was not the case. The pizza was thin/crispy, so it resembled a \"pizza on a cracker.\" The mozzarella was not at all fresh. It looked like it had melted into the pizza, when it was supposed to be big chunks of cheese slightly melted to the top. Also, the basil was wilted and just mixed in with the marinara. All in all - it was not good at all. We finished it, because we do not believe in wasting food and we figured that was just the way they made it. I had to cover the pizza with grated Parmesan cheese to give it some flavor.  As for the short ribs, they were actually decent. Thank god we chose another entree, because the pizza would have led me to cross the street and order a small at Pizza Hut. The meat was soft and full of flavor. The mushroom risotto was really good. I would have that on its own. And I wish they would have served more brussel sprouts because they were seasoned really well. Finally, we opted for the  \"dessert special\" which was a blueberry tart with a vanilla bean scoop of ice cream. It was good, but really sweet. The ice cream helped cut the sweetness. But for a dessert, it was all right. I just remember why I never order desserts to begin with. They're always hit or miss. If I were to come back, I would order either the pork chop or the mushroom risotto as an entree. But definitely NOT the pizza. Ambiance/Decor/Etc.The service was good. Like I mentioned, the wine/beer selection is satisfactory. The boys LOVE their beer and they seemed happy with their selections. They are good at making sure that we have water and our plates are cleared quickly. Our server was a bit chatty, but it wasn't annoying or obnoxious. I'd come back for the wine and appetizers but not for an entree."], ["Margot S.", "This place has horrific costumer service. The only good thing about this place was the helpful hostess once we got there . It took 10 minutes of calling for them to answer the phone so we could make a reservation. The food is heinously over priced for the eagle rock/ highland park area. They exemplify gentrification of the neighborhood. They are condescending and obnoxious and stuck up. Although the food is ok (although not always hot), I would not go back here because of the poor service from our waiter and the prices."], ["Jon E.", "This restaurant was good. The pizzas and pastas were on point. The only downfall is theres only street parking with valet as a option (don't know the price). Had a great time with the family though."], ["Suzanne M.", "Ate here on a Sunday night. Lovely ambience for a pizza place, some really nice design elements going on.The food is pret-ty darn good. It's not blow your socks off Italian but hey, we're not in old Napoli so...I wish they ONLY offered the fresh pasta and I'll tell you why: People either forget to ask for it or don't notice it as an option on the menu and if it's really as much better as fresh pasta normally is from the boxed stuff then they'd probably be scoring some even better reviews here. I'll put my money down on the assumption that MOST people don't know how much better fresh pasta is until they have it and they only see the higher price tag. Split the difference and offer fresh only."], ["Les L.", "Maximiliano is an easy and relaxing place to have brunch.  When we first decided to brunch here, we had these fears it would be jam packed and it would involve lots of waiting so we purposely waited a while.  All this was unnecessary because Maximiliano is still a little under the radar, at brunch at least.  We sat inside but they have a very spacious back patio that looks very appealing.  We shared a few things, including their breakfast pizza and the pulled pork biscuit.  The pizza was nicely done, with a tomato sauce, rounds of fingerling potatoes, bacon confit, fennel sausage, mozzarella, and over-medium eggs.  It tasted like breakfast and had the right balance of meats and tomatoes.  I would have liked the eggs slightly runnier but it was still good.  The pulled pork biscuit was very, very rich.  It sat on a cheesy Asiago biscuit and the piles of pulled pork plus the country gravy with sausage was a lot to handle."], ["Seta A.", "Yes, yes. I am a fan!What a wonderful place to grub! Love everything on the menu. Risotto is to diet for! Pizza, is a YES please. What I like most about Maximiliano is that it feels more like an experience in dining, which is more than having a good dinner.Grab a friend or two, and go and check it out. Worth the drive and the money."], ["Michael L.", "I've only been hear once and despite the food being very good the experience was not. We went for brunch with our kids. It was super quiet in the restaurant so there was no obvious reason for the staff to be grumpy but from the moment we arrive we did not feel welcome. The hostess seemed annoyed with us, the waiter seemed annoyed with us, and any tiny change to a dish we requested required approval from the chef.  Our conclusion is that they don't like kids and I don't think this is a place we would take young kids for dinner anyway but for a brunch on a quiet weekend day we thought it would be alright. Normally the quality of the food would warrant 3 stars but the experience was so terrible for no apparent reason that I have to drop it to two."], ["Brian F.", "Not sure how many stars to give...here's the story.Have been going (no, not a weekly or even monthly customer, but a few times a year)Went tonight, salad portion SHRUNK big time,  hard to even split it.My pork chop was not the same cut of meat you used to get, sorry it's been changed out for an inferior cut of meat.Wine pour skimpy.Help was very good as usual. No problems there, they just had their offerings changed by ownership."], ["Stelle S.", "Great for groups! Had a super fun birthday dinner here.Dericious food, friendly staff, prices are right."], ["Mario R.", "Great ambiance, great service, the back patio is awesome!I will definitely go back. :)"], ["Sarah H.", "We went all out on this meal. Let me tell you what we found. Appetizers: cheese and meat plate are good, but pretty standard; you'd expect what you get. Burrata is delicious and comes with delicious little toasts. Win. Pizza: I had a mushroom pizza and added prosciutto. Still patting myself on the back for that one. Crust is a little doughy, which isn't everyone forte, but I enjoyed it. The mushrooms were delicious. Pasta: first of all, they make their own. This always makes a huge difference. I make my own, but I never bother with the little shapes so thank god I've got this place. The orecchiette was definitely my favorite. Those flavors just love each other! Tagliatelle: simple and delicious. Dessert: hands down the lemon ice cream cake thing. Best thing we had. That alone makes this place worth going to regularly. Strawberry shortcake was also impressive. Tiramisu was okay, but not worth remembering. Olive oil ice cream, not so much. But we'll forgive them because that lemon masterpiece changed my life."], ["Angelie D.", "I know it's hard to stand out when you are making Italian food. I do not expect too much considering that at times it does tend to all taste the same. I just ask that the flavors are all there to really compliment each other. The only dish that I enjoyed was the roasted beets. My spaghetti dish was average and can't really recall if I really enjoyed it or not. The wine was very average as well. This place is in a very cute spot and like one of my fellow yelpers said, maybe this place will grow on me..."], ["Maddie V.", "Nice little place in Highland Park. Definitely going for the modern Italian food. Wide variety of pizzas few pastas. I ordered the Cesar salad with chicken, it's was tasty. I also ordered the spaghetti and meatballs with the handmade fettuccine noodles. I was expecting to be wowed but it was just mediocre.The meatballs had little to no flavor, I think a bit more oregano would be great.All in all my server was nice & attentive. I will give it a second try sometime & try a different pasta."], ["Sarah B.", "I've been here a few times now and I am a fan!  A chill spot with tasty food, what more can you ask for.  They have a dog-friendly patio, and I actually find the atmosphere of the patio nicer than the interior.  They have a variety of Craftsman beers on tap, including a house lager that tastes like pizza - in a good way!  I like everything I've tried, especially the meatballs.  Maximiliano is a great spot."], ["Mina A.", "The dining room gets very loud due to poor acoustics, but the garden patio is nice. It's Italian food and it's great but don't come in expecting anything traditional.Beets and goat cheese is my favorite starter. Some of the menu is seasonal."], ["Leighton W.", "For their special that day, I had their seafood pasta, almost like a cioppino but less soup and more saucey.  I also had their polenta- a bit lackluster, but whatever.My friend had the pork chop which, for the portion, was fairly good.Ambiance- great, service- attentive.  Not quite 5 stars since nothing about it sets it apart from its competitors, and none of its facets shines.  I'll come back and do another, more thorough review, once I've tried more things."], ["Juan Carlos S.", "I've been wanting to try this place out every time I would drive on York. Since my girlfriend and I recently moved to the neighborhood, we decided to finally walk there for our first dinner. The place is really cute on the inside, but the patio is a much better deal - especially on a warmer night.We decided to go simple, ordering the bread plate, arugula salad, a pepperoni pizza, and the local beer they carry. All of it was very delicious, especially the pizza. I'm excited to return and try the other choices on their menu. The staff is also very nice and attentive without being overbearing. Prices aren't too bad, I think worth the quality of the food and service."], ["Joe C.", "I've never been a fan of Italian food. I think it's over hyped and poorly executed by the Americans. This was a surprise find. My buddy Fleming picked the place and we ordered a pizza and a pasta. Sorry I didn't get the name but the pasta has kale in it. Both were delicious! It wasn't over salted, has cheese burnt, or stale crust.The key that makes Italian food so well adored is the fact that each ingredient stands out. And one can easily ruin that by adding the ingredients in the wrong order, or cooking too long. I'm a train chef you can trust me on that analogy. I love tomato as much as the next guy but went they did tomatoes like they way they did it...mmmm another plate please. I enjoy the pasta more than the pizza. For me I like more yeast in my pizza dough.So the one star off was because it was pricey for its location and ambiance. I mean its not poor by any mean but I don't remember the last time I'd paid $70 for a pizza, pasta, and two wines. Inflation? It's definitely a date spot outdoor is heated and well lit. We ordered Pinot Noir from Garnet Monterey 2012. It was one of the best Pinot I had in a while. In fact, I love it so much I'm ordering a case at BevMo, lol.So if you're in a mood for Italian food and don't mind paying over $50 for two this is the spot. You won't be disappointed with the food, service, or wine."], ["Norah C.", "Delish! I love this gem in Highland Park. Reasonably priced and fresh ingredients too!I love their sides - I ordered the beets with goat cheese and the baked cauliflower. I could order those every time. My favorite is the burrata pizza, which is DIVINE. I mean who DOESN'T love burrata. This place always has amazing specials, which keep me coming back for more."], ["Terrence D.", "I am continually disappointed by this place. I always ripped feel off. Good graphics though."]], "All' Angolo Pizza & Pasta": [["Chelsea C.", "This little place is a small very casually unassuming dining experience with bold food.  The smell hits you when you walk in the door....tomato, basil, garlic with a hint of oregano.  The menu is simple but easy to find something you'd enjoy. We ordered Caprese, Cesar salad, breadstick with marinara, Carnivore pizza, lasagna, rigatoni, a special shrimp rav, and a special lobster linguine. The Caprese was good but standard. I truly enjoyed the simplicity of the Cesar w/ shaved parm bc it was so fresh and flavorful.  I love a good Cesar. My son loved the Carnivore, the crust was bubbly and thin, the sauce simple and flavorful.  The pasta sauces were robust, heavy even, and delicious with the pasta fresh and Al Dente.  My shrimp raviolis w/ a heavy vodka sauce could have had more shrimp in the ravioli for the price ($20 for 6 raviolis which were mostly cheese), a little heavy on the mozzarella & very little Ricotta for what should be a more delicate dish.  The ravioli pasta was lovely, thin and flavorful.  My sister loved the Lobster linguine.  The lobster was very fresh, you could taste the ocean, and the linguine must have been homemade it was so easy to eat. All the sauces were a little heavy but it worked very well together with the lobster linguine none the less.  My nephew enjoyed the Rigatoni and my niece the lasagna.We had dessert, which was good but not mind blowing. This place was surprising for the unassuming location. All in all, a very good dining experience.There was some commotion at the end of the meal about the check charges but it was rectified easily enough.  My sister mentioned that the chef, who I can only assume was the owner by the other not so happy yelp reviews, was not happy about it but I payed him no mind.  It is what it is. ;)"], ["Paola B.", "Came down to LA to visit family and on out way back to the Bay Area stopped here to eat with the help of yelp. IT WAS THE ABSOLUTE BEST food that I have tried in Los Angeles. Not too fancy of a spot but the food is over the top delicious. Tried the pasta with the the clams and shrimp and it was so well cooked prepared. Seriously will come back here everytime I come down to LA. Also best customer service I have had in a Long time :-) happy staff and makes it that much more of a pleasant visit.GREAT PIZZA TOO!"], ["Grace B.", "I actually have never been to this restaurant. One day, I was too lazy to cook so I ordered food online from this restaurant. I trusted the reviews on yelp, but I was disappointed when I got the delivery. The portions were so small for the price I was paying. More disappointing is that the pastas I ordered were dry. I had to force myself to eat the food, because I didn't want to waste it. I don't think I will ever order food or try eating at this restaurant."], ["Jesse R.", "The food was really fresh! The cook takes pride in his job but unfortunately he's not a Cordon Bleú trained chef. But it's decent and for the price you can't really complain. The place is very small and isn't quite mastros but it does fit in its setting. Our waitress was really friendly though which was a huge plus!!"], ["cherry h.", "I am so sad to give a bad review because I am a regular and love the food here...but this is the 3rd strike in a row where something was wrong. 1st was when we called in to see if it was okay to come in at a late time to be seated. The person on the phone said we were fine and as soon as we walked in, the chef was cleaning the kitchen and told us we couldn't be served. It seemed they had closed earlier because it was slow. 2nd was when we came to eat and there was trouble outside with the chef and a fight with some of the guys outside. It was a scary situation and we decided to leave. 3rd is today. We called for delivery. They said it would be an hour which it did take. We did not mind the wait but my pizza was cold and stale and well the our pasta, which seemed mushy and overcooked due to sitting out too long. So sad but i think it's gonna awhile for me to come back here again. :("], ["Jere C.", "I lovel this place. Lentil Soup is great. Caprese very good. Carnavore Pizza is my favorite. Parking is scarce. Baskin Robbins is next door and that's never a bad rhing"], ["Lissa S.", "Hopefully, the so-called chef that was public ally coughing (a nasty, wet/phlegm cough) over the food and on his hands while preparing food and grabbing bites to eat from the food orders waiting to be packaged up has been fired by now. I witnessed this a few weeks ago while waiting for my food there. I refused the food, complained to the owner directly, and received a full refund. But why allow a nasty beast with such disgusting habits work as a cook there?  Especially, when your kitchen is in full public view? No excuse for this."], ["Drizelle B.", "What is this five-star hole in the wall doing hiding in k-town?!?!I came here to celebrate my best friend's birthday and our waitress was...Kimberly? I really hope that's her name, but whoever you are, you were wonderful! She was really helpful on helping us decide what to get menu-wise and portion-wise for two.PROS: -Great service-BOMB food (GET THE EMILIANA PIZZA! It's a little messy to eat but the prosciutto and the taste make it worth the mess)CONS:-It's really small so I wouldn't recommend bringing a large party here.I'm not big on Italian food, but this place made me a believer. You can just tell that their prosciutto and their cheeses are super fresh. For all you Italian lovers, you've got to try this place! (And $2 valet in the parking lot!)"], ["Jane K.", "Tiny restaurant with great food. Their calamari is delicious. I requested extra lemons, but didn't end up needing it because the sauce already had a tangy kick to it.Every pasta I've tried (linguine w clams, penne alla boscaiola, strozzapreti alla trentina) has been flavorful and good. This is because the chef is constantly tasting the sauce as he goes, I saw. The good ol' dip and lick, LOL. Finger to sauce in pan and lick - haha. But the kitchen is in full view of diners so that's probably the worst that goes on. It's all good, I ain't trippen."], ["Andrew K.", "Authentic Italian in the heart of ktown. Worth weathering the rain for? Absolutely.Go with the WHITE (bianca) pizzas! They were flexible enough to split the pizza (given you order a medium) and the \"Amiliana\" (the one with arugula) was my favored half. The pizza, did however come out slightly doughy and undercooked in the center. I admit I did find myself too hungry to care.The rigatoni is hearty, spicy, tangy goodness in a bowl. It would have benefited from a touch less salt, but delicious nonetheless."], ["Steven N.", "Been here several times and tried something different everytime. And everything is generally fantastic. You can see the food being prepared if you're seated next to the cooking station. Parking is pretty tough to find but there's a neighborhood around so you might get lucky. If not there's metered street parking on 3rd.This time I ordered two of the specials, the shrimp ravioli in vodka sauce and the lemon chicken with spinach and mashed potatoes.The shrimp ravioli was delicious. I cleaned the plate off with the free rosemary olive oil flatbreads they give you. My only complaint was that 5 ravioli for $16 made me sad. But honestly these are handmade and delicious I probably just wanted more.The lemon chicken was a bit too lemony for my taste. It was tender and good but the lemon tang was a little strong and it also seeped into the spinach and mashed potatoes. The sides here we're nothing to write home about: the potatoes were pretty mushy and plain (other than the lemon taste).Both dishes were $16 each so it was quite a bit more expensive than my standard venture here but I left satisfied."], ["Hussein S.", "Walking into the restaurant, I noticed italian contemporary design and Mexican music haha! Menu was intriguing and informative.Workers lacked enthusiasm but that's what You'd expect 10 minutes prior to closing time, however, there was a middle aged lady (who was beautiful) who had the biggest smile on her face while I was walking towards the door to open it staring at her pizza while cutting it. Best vibe ever!I ordered a margarita pizza, the bread and sauce tasted home made, and the cheese was phenomenal. I will recommend people here, I will come back."], ["AgentxAngel X.", "seriously good rigatoni. tastes fantastic... perfectly al dente... the bacon is a great additional. appropriately portioned."], ["Kyeong J.", "I would choose this place over any italian restaurants in LA. MUST TRYs are Strozzapretti Ala Trentina and their eggplant pizza.While dining in, you could see the chef cooking. Its pretty entertaining watching them make pizza. Service is good as it gets and when good food is served, that is the only thing you will remember. Its a very small dining room so be prepared to wait or go an hour before regular dinner time. I know this place is in K-town and I don't think alot of people would think there is but here is a hidden gem. Go try it! Thats all I could say."], ["Angelo K.", "I went All' Angolo because my name is Angelo.   If your name is Angelo, you should go too!                  Food was delicious, delivery was almost instant.  I am proud to share my name with this place."], ["Tim M.", "Pizza used to be amazing at this place. I went last night and they gave me the seafood pizza with the most disgusting and smelliest clams. 20 mins later I was sick all day! Service is not attentive either. Loved this place but I think I'll go for Anima"], ["Allie L.", "this review is for the pizza only.I ordered the carnivora pizza via LABITE and it was really really bad. I hate writing negative reviews on yelp, and I'm sure they have other lovely dishes, but the pizza did not do it for me. The cheese fell off the dough-not in a yummy-gooey sort of way, but in a crumbled-cold sort of way. I spent $36 and couldn't even eat an entire slice.I should have gone with a pasta. Based on the pizza alone I would give 1 star, but I see so many glowing reviews, so Ill give it 2."], ["Sue K.", "In the heart of Ktown, you find the best pizza! We ordered margarite pizza and a cream pasta. They were absolutely amazing! The pizza was rightly baked - crispy and thin. The chef gave us flatbread to try - and it was great!Will def come back"], ["Ken F.", "Awesome little spot in K town for fresh homemade pasta and pizzas. Definitely worth a visit. It is a small place and gets very busy so come early."], ["Vee R.", "I absolutely love this little Italian Gem. It is fairly priced and the staff is really nice! Of course the food is best when you eat there but takeout is a great option too, Since I do not eat chicken or red meat anymore I usually call for the daily specials. My favorite plate has got to be the spinach ricotta ravioli, the lobster ravioli, and the linguine ala riviera. They're all delicious! and the bread with rosemary and sea salt is amazing to dip into the sauce is delicious too. Before moving to only seafood I had tried the pizza bianca emiliana it was to die for! If you're looking for Italian I would def recommend this place to dine in or order out. Id like to add that they do have beer, red and white wine and a small selection of desserts to chose from. I actually have an order on the way as we speak and I ordered Calamari takeout with my lobster ravioli, I just hope it comes hot and crispy!"]], "Bestia": [["Raquel A.", "Okay, okay.  I get it.  I see why there's so many great reviews for this place.  My only question is, how did it take me this long to try it? Oh that's right, getting reservation can be a b*tch. But hey, just set your reservation way ahead of time to get a proper time and day otherwise, all your choices will be to dine there after 10pm.  Cool spot in the Art District. I love establishments that have exposed brick wall. As we were there earlier than our reserved time, we enjoyed some drinks from the bar.  Had the Chef's Old Fashioned (lardo infused bourbon, hickory smoked sugar, angostura bitters and salt). So yummy.Once seated, we ordered the following (yes this is for two people)Homemade Country Bread. wood grilled. olive oil. garlic. salt.  Char on the bread so good. Mussels and Clams. housemade spicy 'nduja sausage. fennel seed. preserved orange. grilled bread.   The spicy broth is so good. Definitely sop it up with the toast.  Grilled Beef Meatballs. braised beet greens. soffritto. tomatoes.  Though flavorful, this was my least favorite.  I'd rather fill my belly with other stuff. Cavatelli alla Norcina. ricotta dumplings. housemade pork sausage. black truffles. grana padano.   This was recommended to me by a friend and it's certainly a must when coming here. 37 oz. Pork Tomahawk Chop. charred escarole. fennel pollen. sea salt. served family style. The spice on the pork was great and so moist and tender.  It also came with a cheesy buttery polenta.  Tried something different by ordering a non local drink and ordered the Brasserie Pigeonelle. la loirette. farmhouse ale. france.  Great drink to have. We both enjoyed this spot, though we both agreed that this certainly a spot for special occasions only.  We'll definitely be back."], ["Adam T.", "Simply wonderful!I must start by warning people who have not been, that the drive up to this place may deter you... like it did me (luckily I was not driving).  But once you step inside you are transported to a completely different environment.The food is spectacular.  It always fun to enjoy a restaurant that serves family style and also knows how to pace your meal so you never feel rushed, full, or starving.  You really cannot go wrong.  Some of my favorites were the pizzas, the ravioli, and the Pork (a must for any meat eater).Just an awesome experience that you should not miss out on. Make reservations way in advance, this place tres popular"], ["Gid K.", "Finally got to Bestia! I give it 4.75 stars; it's very hard to get 5 stars. First, it's super trendy and PACKED. It also gets pretty loud, and if you're lucky you can see the kitchen staff shouting and pushing plates; it's basically 5-6 hours nonstop. Make a reservation and use the valet parking.The Mussels & Clams was delicious, with tender mussels. The sauce is spicy with sausage in it -- we got extra bread and CLEANED the plate. Also, the Burrata Pizza was very good. The olives add a nice kick, and it's even better if you let it cool off a bit. Then came the Grilled Calamari, my favorite, which was FANTASTIC. Very tender, grilled and smokey, with the bitterness of the endive -- you must try it. The whole table agreed it was 1st or 2nd place. The Roasted Bone Marrow was very good, hearty, oily, salty, and matched nicely with the pasta. The Farro Salad was also good, with mint and a nice tangy kick to balance out the avocado, but it's a salad so....The pastas we ate were: Spaghetti Rustichella which had a nice seafood flavor without being too fishy. First time trying sea urchin. The plate was good, but I probably wouldn't get it again because I liked the other dishes more. The Quadretti Alla Carota was actually better, even though it's vegetarian. It had a very smooth texture and mellow flavor. Now, the Cavatelli Alla Norcina was the best pasta dish, and 3rd or 4th place overall. Lots of delicious sausage, with truffle in a nice sauce, and not spicy.Drinks: The Company Man was good, but very strong flavor, pungent, and not for delicate palates. The Cops And Robbers was sweet and tasty, but too small and too much ice. The Duke Silver was sweet and cool, with a nice green color -- probably the best of the 3. Another friend got a pink colored grapefruit cocktail that was good, not too acidic. The white wine suggested by the waiter was also very good, crisp with citrus note.Overall, it was a great meal, with very attentive and friendly service -- we asked a lot of questions about the restaurant and area. We didn't try desert because we were stuffed, but heard it is very good, too. The bill was nearly $400 before tip for 5 hungry people.P.S. -- all my pictures are of partially attacked dishes."], ["Craig R.", "Things started off on the wrong foot with the ridiculous LA Story-esque \"service\" when we arrived.  We had a very large party and since the reservations were changed at some point they refused to seat us together - and they could have.  They were just \"punishing\" us for the confusion.  The food?  It's pretty good, I can't lie.  But that said, it's pasta folks.  The prices they charge are insane for pasta.  For what they're charging the portions should be huge and they're actually quite small.  I didn't leave full.Atmosphere.  It's in a pretty crap part of town, but they've turned their little corner of it into a hipster paradise.  It's pretty cool."], ["Kayla M.", "You can never go wrong with this place. This is one of our favorite restaurants. It's hard to make a reservation but we still love to eat here because we feel like we are in NYC. We moved to LA from NYC and this place reminds us of the city atmosphere.   We love their marinated olives. We always get them to go. So good!!! I love their cocktails especially \"I am Sky\" is my favorite!!! Must order the \"Spaghetti Rustichella\". It tastes amazing."], ["Kathy H.", "(Best)ia in town! I definitely recommend this place. Unless you want to wait 2+ hours, I highly recommend making a reservation. I went for my gf's bday with a group of friends and I loved the vibes and music here (90s hip hop and rap - lotta Tupac and Biggie). COCKTAILS:Beam Me Up Scotty $13 / The Doctor's Orders $14 -we definitely felt like drinking dark for the night. I didn't try any of their vodka, gin, or rum so I wouldn't know if they are good or not. ANTIPASTI:1. Grilled Octopus & Calamari salad $17 - very surprised at how much flavor was packed in this dish. That chili lemon vinaigrette made it taste amazing. 2. Grilled Beef Meatballs $14 - mouthwatering!3. Mussels & Clams $18 - good but nothing special. 4. Chicken Gizzards - maybe it was the beets, I don't know. It's just not something I would order again. My other friends loved this dish though!PASTA:1. Cavatelli Alla Norcina $29 - I would of had a double order of this if I knew how good this was going to be. The ricotta dumplings and sausage were made to perfection. 2. Spaghetti Rustichella with Sea Urchin $25 - Sea urchin is usually a hit or miss with me. This was lacking some flavor but I would order it again to give it another try. 3. Bucatini with 'Nduja Sausage $21 - it had an interesting mix of flavors. I like this dish because it was a bit spicy but the group I went with said it was their least favorite. DESSERT:1. Maple Ricotta Fritters with huckleberry jam ice cream $12 - MUST TRY! 2. Chocolate Budino Tart $12 - it was alright. The salted caramel made it tasty for me. Can't wait to go back, I want to try some of the new items as well as my favorite Cavatelli Alla Norcina pasta!!"], ["Brittany H.", "definitely by far one of the BEST and tastiest restaurants in LA.... so far!  i like that it's not that trendy and over the top, but the atmosphere is lively and cool.get any vegetable dish.  We tried the grape and tomato salad and it was out of this world. roasted bone marrow with the spinach gnochetti was my favorite dish of the night.  salty, creamy, just the perfect balance of saltiness and fattiness but in a seriously stellar way.creamy polenta - so creamy, with bits of sweet corn heaven... i couldn't stop eating this.. this is the dish to get and that i still dream of.  super simple, but i'm sure they put some butter crack in here.  spaghetti rustichella - dish was well crafted with crab and just the right levels of saltinesswhole grilled branzino - i was SO STUFFED at this point, that it was hard to say whether i enjoyed it or not.    last but not least, we tried the dessert, which composed of mint ice cream wedged between two delicate, thin dark chocolate cookie. It was SO GOOD.  my friend isn't a fan of mint, but this was a hit!Waiting for over an hour without a reservation was well worth it. the dining experience was fun, vibrant and overall ... i'd do it all over again.  Well, I'd try to secure ressies in advance!"], ["Fran B.", "Bestia so tastia!This had been on my bookmark list for everrrr. I made a reservation approximately 1.5 months earlier and that was probably the only time I've ever made a reservation so far ahead for NO OCCASION AT ALL. Haha I had to do it, it was the only way..... So yeah, do yourself a favor and reserve ASAP! It was so tough to even score a Friday-Sunday rez so I settled for a Thursday night..... geezzzz lol.Alright so THE FOOD! I think the best way is to do family style or tapas it up and share with your party. I went with my bf so we couldn't try tooooo many dishes, but we sure did try. I would liken this to Animal, which is also another amazing LA eatery, but I would say Bestia's dishes are slightly bigger (even the smallest ones) and the prices definitely reflect that. We ordered 6 dishes, although we had to cancel the last one (skirt steak :( next time) because we were so full before it even came out.Chicken liver crostino - BOMB! My bf fell in love with this one and so did I. What an amazing starter. It was a little chunkier than pate-ish so you get a bit more chew on this one. Flavor was FANTASTIC! Seriously so flavorful and delicious. It was kinda big though, so shared between the 2 of us was good.. but probably woulda been better to share between 3.Mussels and clams - The pics looks too good so I ordered this one anyway knowing the bf will not help me eat it (seafood hater)... but it was so good that he tried the clams and did not stop. LOL he said the mussels were too oceany but the clams were super bomb. It was that good! It actually reminded me of Boiling Crab's whole shabang sauce, but more refined lol. The seafood were cooked perfectly, so clean and soft and tender. The broth was amaaaaaazing, especially to dip in toast. Garlicky and spicy.Grilled lamb meatballs - This was hot and cool all at the same time. The yogurt and mint was a nice contrast to the grilled balls heh, and altogether made for a delicious dish. Texture was off the charts, so tender!Cavatelli alla Norcina - Probably the best pasta I've had........ maybe...... I dunno but that shit was fucking delicious. The pasta itself was springy and al dente, soaked in the best creamy smooth sauce EVER. It kinda reminded me of like a chicken noodle soup flavor, but just elevated and included these fantastic pork sausage pieces. In love. No wonder it's their most popular dish.Roasted bone marrow - This was different because it came with spinach gnochetti (some type of pasta) instead of the usual bread or toast. Omg! The pasta was slightly crisped or toasted or something, and that really really made this dish so much more delicious. With the bone marrow scooped out and mixed in, that crisp was definitely necessary. The flavor was amazing, but I gotta say it was rather oily. Very interesting (and new) way to eat bone marrow. MMM.The food came out in the order above, and the pasta and bone marrow came out around the same time. I would suggest ordering one or the other if you only have a party of 2, because those dishes are mass carboz, which I love of course, but fills you up. They were both basically pasta dishes.Between the 2 of us, the above dishes REALLY filled us up. We couldn't even eat dessert so if you plan on getting some, order a little less? lol and me and the bf are pretty big eaters.... so you know, don't underestimate em.Total was about $100 (almost) even, and with tip like $120. I prepared myself for it soooo it didn't hurt too bad lol. If we had gotten that skirt steak though, mmmm lol.So the other aspects - service was amazing. Our server was nice and quick, which is all I ever ask for. They also have valet for like $7 so you don't have to worry about parking. I hear there's also street parking available sometimes. The location is very very modern, industrial, and pleasing to the eye. Seriously it was in a very unexpected location, but the place is beautiful.Til next time!"], ["Ada F.", "Creative items, fresh ingredients, fun atmosphere. This place has it all. It is hard to get reservations so I surprised my husband with date night here. This place is amazing. Everything we tried made me do the happy dance. The waiter was spot on with his recommendations. Check out my pictures to see what we ordered. This place has valet but we managed to find street parking. A must try if you live or visit LA. We will be back for more."], ["Sarah D.", "First off - 5 STARS FOR THAT BONE MARROW DOE. Also 5 star for their cocktails, I was with one of those rare non-drinkers so I could only partake in two. Agnolotti alla Vaccinara - we got this based on another yelp review that said it was so good i'd want to \"stab someone in the eye\". It was good but I didn't feel the pull of stabbing unfortunately. Spaghetti Rustichella - honestly I don't know what the hypes about. It was only okay. Got the peppermint ice cream - very good and the maple fritters which were also nice. The older I get the less of a sweet tooth I have so I might not be the best judge. At the end of the day $200."], ["S Y.", "Bestia......def a crowd fav in LA :) frequent visits since it first opened couple years ago....menu have changed quite a bit, our recent favs on the menu are still the sea urchin pasta, tomahawk pork chop (new), foie gras toast, Cavatelli alla Norcina, and the chocolate tart. Items I miss from the original menu: Truffle pizza, Santa Barbara spot prawns. Please add them back on the menu! Strong n bold flavors, fun & upbeat vibe, definitely a must visit restaurant."], ["Ara G.", "So I wrote a review about this place, and of course, these guys contacted {paid} yelp, (yelp is not about reality, it's about money....we all know that....) and yelp removed my review - claiming it was unfair.So, I've re-written it, taken out what they wanted censored, and what Bestia likely complained to have removed....I got a reservation date about four weeks out...it was for 4 people and pretty easy to set up, and, they did a nice job of following up with me...So...here's my revised review...Slow start... STRAIGHT DOWNHILL FROM THERE. Garbage overall experience... One word to describe this place from top to bottom: pretentious. DO NOT GO TO THIS OVERRATED SHACK. It insists upon itself...unwarranted We all ordered our drinks, were served something completely different...called the waitress out on it and she said they'd tried sneaking an alternate past us...terrible... All you have to do is tell me that you don't have what I ordered. Common sense. I can't believe that they would actually try to sneak something else past their customer. I've honestly never even come across that before. Then we tried ordering a couple different drinks, they didn't have either of them. How does a place not have a common whiskey on a Friday night? The clientele is less-than-classy...hipsters/flamers/try-too-harders..purple-colored-hair everywhere Suuuuuper slow service.. Food is 1/2 way decent.. Very small portions... Brought the polenta porrage out with no spoons..weird Several quiet lulls with no food, no drink, no check-in... Painfully ready to leave, we ask for our check - it takes 15 minutes to come out - we pile on 4 cards and ask to have the check split evenly....the waiter brings back one of our cards and says: \"there is no money on your card\" This insane fool ACTUALLY tried to sneak in this underhanded, disgusting comment - I don't let nonsense like that go..I call him on it and ask him what he said, like a coward, he changes it, knowing we all heard him and now he's at a loss for words, stammering, feeling stupid....I ask him three more times and he continues trying to act like he said something else, making a bigger fool of himself, so I had to slap him around...We rectify the issue with cash and he then brings our check with no concession for their mistakes, shocked, I tell him to correct it...this clown argues, I set him straight like a petulant child, he feels stupid, sends out some manager, who tries to give me double-talk, actually has the audacity to argue with and speak over me...I set him straight and dismiss him to make the necessary changes...he tucks tail, does as he is educated to do, makes the correction, we leave. THIS WAS A TERRIBLE EXPERIENCE FROM START TO FINISH.Tip to the restaurant....do not put the utensils on the tables, they are dirty, the fact that you don't know that shows massive, inexcusable ignorance. Management, this is a very poor commentary on your level of training and service. Pitiful."], ["Cindy W.", "Living up to its raves.Great vibe, awesome food, fantastic service and one greatest experience I've had dining in a restaurant.Place is tricky to find and I did overshoot the street and have to turn back.  Parking valet available at the front of restaurant.My dinner double date with my husband and his two friends was incredible. I had arrive late and my husband and them started eating without me,  when I got there, Bestia had prepared my own meal served hot and appetizing.  The servers quickly helped me \"catch up\" with the group on food and drinks.  Since we sat at the counter, the waiters were all very attentive and courteous.  The food was well made and flavorful.  In all the dish we ordered, I was blown away that each dish was so delicious.  The bone marrow, the truffle pasta and the octopus were all so yummy.  A tiny reminisce of its goodness still lingers in my tastebuds.I would definitely come back here again. Reservation required."], ["Sarah S.", "Emperor's new clothes.I don't get it. At. All. A feature in Food & Wine a-chef-does-not-make. You can keep the hype. I'll be at Gjelina...eating real food."], ["Christine K.", "Overall, it was a nice experience and I would come again to try other dishes.Ordered:1. Mussels & clams- very flavorful BUT very salty2. Margherita Pizza - soft, chewy dough3. Spaghetti Rustichella - noodles & lobster cooked perfect...once again SOO SALTYThe ambiance and service was good - bustling and cordial. Maybe my 2nd experience would bump up the 3 stars to 4."], ["Grace C.", "No kidding, you really have to reserve waaay in advance for a table. Made a reservation for an anniversary dinner in late April on a weekday evening....almost 4 months in advance (booked in January @_@)!So the place is in a very industrial looking part of downtown LA. Bestia is at the end of a dead end street, so don't feel confused when you're driving down the street looking for a bougie restaurant and all you see is large warehouses. Parking is valet on that dead-end 7th Place street, so look for nearby street parking if you must. Keep in mind how late you may be walking around at night, but know that it's likely the other parked cars have owners dining at Bestia.Once we were inside, it looks very much like a hip and happening place. Loud music. Tons of people. Both the music and crowd noise level made it very hard for me to talk to my bf and hear anything he is saying. Not to mention hard to hear the server as well.Now, let's talk about food! Our server mentioned plates at Bestia are meant for sharing. You do need a lot of plates to be full though! Portions are TINY for the price. Dishes on the menu come and go, so some good recommendations from other Yelp reviews (like the coffee and donuts and the uni spaghetti) would and may not be available during future visits. Chicken liver crostino $10 - rich with a slight sweetness. Very rich. I would either order this or the bone marrow, but not both together -- it may be too much!Grilled octopus and calamari $17 - a good balance to the other dishes that were very rich. Came on a bed of greens.Roasted marrow bone $16 for half size. Like the chicken liver, it was also very rich. It's super small for the half size. Absolutely mixed it in well with the spinach gnocchetti -- you won't regret it!Cavatelli alla norcina $29 - tastes better than it looks. Served in a deceptively shallow plate so I thought I had more left of the entree than I actually did. Bucatini alla'nduja affumicata $21 - a bit spicy. Cheesy. Has pork sausage. It was our back-up entree since the uni spaghetti was off the menu when we went. Strawberries and cream $12 - the substitute dessert since their menu did not offer the coffee and donuts. Came with a walnut macaron (size is in between the small and large at Lemonade) with the cream in the center and strawberries surrounding it on the plate. They added a candle since it was our anniversary. (No, the dessert was not comped.)Food did take a little while to come, but during the time we waited, our waters never went empty. Like seriously. If we drank a 1/5 of our glass, one of their bus boys would swoop by and refill the glass with the container of water we had on our table. Towards the end of the night, I got scared of drinking too much water because I worried any dip below a full glass would be refilled almost immediately. Definitely the only place I've seen so much water refill.When you get your bill, they also include a slip of paper notifying you that there is a separate mandatory 3% kitchen charge, in addition to tipping your server. I have mixed opinions on this (both from a political and tax perspective), but just wanted to share the presence of the charge in my review.Oh yea. You will smell afterwards too. Felt like I had just dined at a hot pot place or Korean BBQ joint. Overall, we left feeling hungry still but full from all the richness in the food we ate. It's not that we couldn't order more. It's just that given what we ate, we felt everything was super rich (too rich for our arteries kind of rich) and we needed to do a major workout or detox afterwards instead of ordering more heart-stopping food.I don't regret choosing Bestia for an anniversary dinner, but it's one of those places where once is enough for the experience."], ["Michelle H.", "I finally had the chance to dine at Bestia last weekend - I can honestly say I've never had so much trouble getting a dinner reservation! Here's the rundown...We were seated on the outside patio and from the get go the service left a lot to be desired. I mean, it's Bestia, obviously we were super excited to be there, but our server was giving us zero enthusiasm and was pretty inattentive. We ordered a couple of cocktails to get started - the Ambassador's Tea and the Slot Machine - both absolutely delicious, though we received food before our drinks. We went with the chicken liver crostino and the bone marrow for apps. The chicken liver was very overwhelming for me, but the bone marrow was divine. Easily the most unique and memorable bone marrow I've ever had. I loved that it was served atop gnocchetti to be mixed into as a sauce. After a lengthy debate we settled on the casarecce al pomodoro and the cavatelli alla norcina for our pastas. Both were utterly perfect and contrasted each other so well. I would highly recommend ordering both, but I can say for certain I'll be ordering that cavetelli next time I'm there!For dessert, we chose the maple ricotta fritters and the chocolate budino, and both were some of the best desserts in recent memory. The fritters are so unique; they're served with a maple butter and a berry sour cream ice cream that absolutely sang in an ultimate bite. The budino was the perfect level of chocolatey; the filling was so creamy and bordering on dark, but the crust was light and crumbly. Both are musts! If we can manage to get a reservation again, we'll definitely be back.*My overall MUST ORDER dishes are: cavatelli alla norcina, roasted bone marrow, maple ricotta fritters, and the budino."], ["Anthony H.", "A wait until springSoft marrow on toasted breadHer gentle smile"], ["Lillian C.", "Did not have the best experience here. The atmosphere is so beautiful with light bulb decor and hip decor everywhere. My sever was rather rude and made it a less enjoyable experience as the people next to us who came after us got their food before us and left before us as well. The spaghetti rustichella was delicious! It is the pasta with sea urchin and squid ink! It came in a rather big portion as well. Some of their dishes are on the smaller side. The margherita pizza, however, was burned and rather unimpressive. They also charge for water ($1) per person by the way. Overall, was not impressed. I have had better experiences at Italian restaurants in San Diego."], ["Diana B.", "I've been wanting to try Bestia during my last LA trip after seeing photos of the octopus and the zabaglione al moscato dessert, but forgot to book online in advance. I called the week before my visit, and after waiting in the queue for 10 minutes, I scored a counter reservation for two over the phone. The staff was very friendly and even accommodated my change in time the same day via email. I arrived two hours earlier than my 11pm reservation, and the nice hostess got us seated at the counter in 40 minutes. The space is beautiful although very loud.  Every staff person that we encountered was very nice except for our dedicated server who ruined the experience for us. Our server took our order, and then other staff members served our food. My boyfriend got a beer while I wanted something non alcoholic. Our server said for the soda they had coke and lemon soda, or they can make a soda for me with ingredients they had on hand, and left to give me time to think. I wanted to see if they can make a fig leaf soda but didn't see our server which wasn't an issue until later on during the meal.They have a changing seasonal menu so we started with the oxtail in cacao pasta parcels which was delicious although a small portion for $20. I was excited to dip our pizza crust in the pasta sauce. However, when the neopolitan pizza arrived, it was very burned to the point of being acidic and bitter. Our server later walked by but never asked us how the food was. We saw him standing and talking with another server so we flagged him down when he walked by again (nope, he wasn't going to even check in with us). We showed him our burnt pizza and he said Bestia's pizza is supposed to be \"charred\" like that and walked away!Finally he comes by again after our plates have been cleared to ask if we wanted dessert. I got the maple ricotta fritters with maple butter and huckleberry ice cream. It was good, especially the ice cream. I was curious to try the fig leaf ice cream, but then our server brought us our bill. We didn't even ask for it yet! After waiting 40 minutes, we only dined in for 40 minutes, and four seats were unoccupied next to us. The bill came with a quote by Alice Waters of Berkeley's Chez Panisse and a note that they charge a 3% gratuity for kitchen staff so we can adjust our tip accordingly. It was ironic that I came all the way from Berkeley to LA just to have mediocre Alice Waters'-inspired food (I love Chez Panisse and have never had a neapolitan pizza this burnt). The 3% fee didn't bother me since in SF we're used to paying a health fee for the staff, but that fee is typically printed on the menu too. Bestia's menu didn't mention that and only noted the $1 charge per person for water. We paid, tipped, and mentioned the experience to the manager on the way out, and he apologized that we were rushed."]], "The Factory Kitchen": [], "Speranza": [["Britt W.", "I've been to Speranza many times and they always get it right. Their pasta dishes are incredible and all are large size portions, their breads are amazing, and the service is on point. They have an extensive wine list (only a few beers though), but my favorite thing on their menu is the heirloom tomato + burrata cheese appetizer. Pro tip: it's always better to call and make a res, this place gets busy. You might have to leave a voicemail but they always call back (as they're only open for dinner service)."], ["Kate S.", "I have kind of a mixed feeling about Speranza feels like you're in a rickity place in Greece. Its mostly(maybe only) outside. It is contained by the street by Orange plastic. It kind of hippy quaint. I like the food and the service is pretty friendly relaxed. I guess I was disappointed because I'd read a previous Yelp review stating you can bring your own wine. They changed that and now you can't. i made a special trip to LOU wines on Hillhurst and Franklin to buy biodynamic wine I have allergies to pesticides. I have yet to drink it. Couldn't drink it that night. The pros are the food is pretty good. Although I ordered the Branzino while good it doesn't come with a side so then it's an order of something else. I just feel like for the lack of decor, as casual as this restaurant is it might be more generous with sides and or  offer corkage.The gluten free pasta puttanesca is very good."], ["Cynthia J.", "Yes, the hot bread and tapenade are good. Yes, the $9 yellow beet salad, served carpaccio style, is good. But they lost me at the Ziti.  It was served lukewarm, with unevenly cooked chunks of eggplant with skin. Chewy, not smoky, and the ricotta salata was nearly imperceptible. A bit overly garlicky to boot and wayyyy too salty. Not my cup of tea to say the least.  And they were sold out of the lasagna at 630pm so trying that was not even an option. Hmmmm. Not great.Service at first was generally good if of an intermittent nature. We noticed that as it got closer to 730pm and more large parties arrived, service got a lot worse. We were there on a busy Saturday night. When our waiter disappeared for more than 30 minutes and we ran out of water, we really started to wonder about this place.  Her explanation when she finally returned (after being summoned by us and at least one other quizzitive table) was simply that they all help each other out.  So we should just know to flag any old person down?? On further discussion, she did say they had a shift change at 7 and she was moved to another section. Really? A shift change at 7 on a Saturday night?And to top off this frosty review, we knew to preorder the berries with cream and almond meringue cookies. So we ordered them at 630. When dessert time came, they were out of berries. What?  Out of the main ingredient for one of your THREE desserts?   Are you kidding me?  The manager's explanation was that they had a lotta kids show up \"through the night\" who had eaten all the berries. This explanation differed from our waiter's: she said \"the guy\" forgot to buy berries so they had been sold out since 640 -- just a few minutes after we placed our order.  Give me a break, y'all!!Something is very wrong in the chain of communication here.  If I didn't know better, I would guess it's time for a new manager. But something tells me no one is even paying enough attention to notice that."], ["Bobby R.", "This place is the thief of souls.  From its complete lack of service (literally- at one point I considered going back into the kitchen to forage for food) to the man (host? It was unclear due to the fact that no one helped us) who snapped at me when I asked who might seat us. (Me: \"is there someone who could seat us? We have a reservation but have been waiting for 20 minutes.\"  Him: \"I know!\" As he walked away and did not return).  Then when we finally got a table (much, much later) our table was literally wedged into a tree, and I had to crawl under the table to leave due to the hipster in the table behind me whose chair was backed up directly against mine Three staff members later we finally received menus.  It was unclear who exactly was our server, as we had to ask the bussers and flag down any random person walking by for help. All in all, the night was a success.  Not because the service got better, but because I escaped with my life."], ["Leanna W.", "Went to Speranza with a few friends after looking for a nearby classy-ish place to meet up and eat, and chose it based on the excellent reviews. It went above and beyond our expectations - homemade pasta dishes (perfectly cooked pasta dishes + exquisite, flavorful sauce), appetizers (a sort of caprese dish with some of the best mozzarella I've ever eaten), and solid service. My husband is a picky Italian (a contradiction, I know) and he ate my leftovers very enthusiastically the next day. Prices are great and portions are huge. I'm not an expert in Italian food but the essence of it tasted very authentic. The only thing mildly lacking is ambience, as it sits right on Hyperion. However, it is obvious that they put a lot of effort into taking care of the property; there are plants and vines and small trees to spruce up the place and make sitting outside enjoyable."], ["C.C. L.", "Very solid italian food. I like their fresh made pasta, the fettuccine with pesto is delicious as is the lasagna. The complimentary bread and the dipping sauces are great and I like the little flaky cookie they give you at the end. They have a nice wine selection and the indoor/outdoor atmosphere of the restaurant is nice. I will say the service is definitely sparse, after we ordered we never saw our waiter again until we had to flag him down to get the bill. But the food and drinks we did order arrived quickly. Would have probably ordered another drink if anyone had bothered to come by."], ["Eric R.", "I have been to Speranza many times and have nothing but great things to say.  Walking in can be awkward as there is no formal hostess stand, but if you stand there long enough someone will take care of you. The service is always on point. We came last night with a group of 18 people and we were well taken care of the entire night. Food here is amazing, and the quality of their dishes is on POINT. They also have a fantastic wine selection. Be prepared to wait a while for your food, as their kitchen is on the smaller side.  This is a great place to come and enjoy a meal, your surroundings and conversation with friends."], ["Jeanene E.", "On 2/28, I ate the most amazingly delicious lobster risotto I have ever dreamed of having! Right when I saw it on the menu I said that's what I'm ordering!! I had had a very long and dreamy day of applying yoga and was famished and exhausted. I even told my dear friends that I am very picky about my risottos! I don't eat them all the time, but when in an Italian restaurant, I can't resist! ....and when one of your friends used to be a chef!....as well as outstanding food, appetizers were INSANE with flavor....they were super busy, and we were inside....Loved the energy in the kitchen. You are literally in the kitchen, I was so excited, in my exhaustion I never once felt tired!! Because my tastebuds were exploding and all around me was ALIVE!!Awesome can't wait to go there again, really!!"], ["Alexis W.", "The best bruschetta ever. Juicy heirloom tomatoes over fresh bread, mouthwatering! I've been here a few times. The squid salad was decent. The scallops were huge and  perfectly cooked. The crab legs are great, my fiancé hogs them! Im going to try their pasta next time. My favorite part about eating here are their little cookies. Soft yet crispy and nutty, its perfection."], ["Eve S.", "Irresistibly yummy pasta... busy during weekend... reservation suggested... outdoor seating is quite very comfy..."], ["Anne W.", "After mistakening the wrong date for Griffith Park Eat See or Hear... we had two bottles of wine and thought it was the best idea to find a BYOB.  Yelp.. you are not too intelligent because it's NOT.  My gripes about this place:1.  No parking anywhere nearby.  It didn't even have valet.2.  You can't even recognize it's a restaurant.  Has orange curtains that remind you of what you'd enter if you were going into a freezer unit.  This was especially helpful when...3.  It was SO HOT.  They had no A/C.  The orange curtains really kept the cool evening breeze out.4.  They no longer have BYOB.  This should be removed from Yelp.5.  The food isn't all that.. the squid pasta which I thought would be delicious didn't taste that great either.  It resembled worms.  They did replace it with a seafood tomato sauce pasta which was also just okay.  One star for that.I've had better... meh."], ["Anthony B.", "I came back; my friends and I couldn't decide on a place that had the equal balance of proximity, price, and taste so we ended up in silver lake. Same deal, cute atmosphere, slow service (but not bad service)....highly recommend the cheese plate especially if you happen to be super high."], ["Adam K.", "Went last night with two great friends.The beef carpaccio is beautifully sliced with a lovely assortment of greens and cheese atop.  The caprese was comprised of fresh basil, a lovely mozzarella, and firm and tasty heirloom tomatoes. The bread came out fresh and piping hot, with a lovely pair of sauces to dip.The home made pasta is out of this world.  I went for the linguine with clams (heavy and wonderful garlic), with a generous portion of clams.My friend had the bolognese which was cooked to perfection.The steak was tender and tasty.For dessert we had the tiramasu and the chocolate mousse.  Both were divine.The atmosphere is welcoming, blankets are provided and plenty of propane heat lamps.  The hipster-crowd was clad with porkpie hats a plenty, and the staff was quite attentive.In an effort to keep a fair and open internet, I sign my name to all my Yelp! reviews.Adam Koppekin"], ["Melody Z.", "A foodie friend recommended we try this place; we're always exploring new spots. It was a bit hidden, looks like an apartment atop a garden patio with no street signage. I was quite pleasantly surprised at how good the food and service was! Definitely a no-frills rustic feel with a charming ambiance. I often judge a place by their bread...the fresh, hot little loaf was perfect and the olive tapenade was delicious! What was great is that I was waiting for my friend and they still brought me the bread and water right away instead of waiting for my guest to join. Thank goodness, because I was starved. We shared the fennel salad with pine nuts, arugula and shaved Parmesan; very refreshing. I ordered the fettuccine with shrimp and asparagus with a tomato cream sauce. They make their own pasta and the scratch dough was delicate and delightful. The shrimp were cooked so exceptionally, tasted fresh and were well seasoned. Often shrimp in pasta can be rubbery and over-cooked, but these were the perfect consistency. Our server, Nic was great. Attentive, genuine and imparted the true sense of European hospitality. Overall, it was a lovely dining experience! Thank you!"], ["Lyndsay S.", "Love this spot now! I highly suggest the squid ink pasta!"], ["Kevin W.", "Excellent restaurant.  The quality of food and taste have not changed since day one of opening!  Even tho they have expanded quite a bit with the patio seating and the wine bar. Good job!  Keep it up. It's hard to find restaurant that can keep their quality and taste over a long period of time."], ["J J.", "Atmosphere:  Romantic out on the patio.  Great date spot.  A little cramped.Parking:  Ughhh pretty frustrating. Food:  Totally solid.  Try and share some things because the portions are huge."], ["Albert K.", "Food: Best handmade pasta ever. Service: Aside from our actual server being pretty hands off, the rest of the front-end staff was top notch."], ["Leighton W.", "It's a hit or a miss in terms of walking in and not having to wait.  Reservations are definitely recommended on Thu-Sun nights.I've been here many times now, everything I've had is very good.  Except the linguini with clams- that was a tad plain.  The shrimp and asparagus fettuccine is exceptionally good.  The dishes are all quite large, so eating family-style is definitely possible.Be careful of anything with squid ink- it is all you'll taste.  Oh, and your poop will be obsidian black the next day."], ["Desireh S.", "Great atmosphere but honestly the pastas were not so great.. There was three of us and we each ordered a different pasta and none of us were happy with our food"]], "Trattoria No 25": [], "La Pergoletta": [], "Vinoteca Farfalla": [["Tiffany Z.", "One of my favorite restaurants!! My 400th review!!This little gem is amazing.They have an amazing happy hour. Every single day from 4-7pm-The house wine selection is great! $5 both reds and whites-fancier wines on happy hour $6-premium wine $8!!-oysters!!!!!! $9 for 1/2 a dozenThere is not one bad dish, not one rude person, customer service is great, the ambiance and atmosphere are dark and chill.Great for a girls night out dinner or romantic dinner.What I recommend: anything that is involved scrapping the pasta cheese wheel!!!!! Yessss a cheese wheel. Explosion!The risotto and meat sauce spaghetti are awesome.The bruschettas are all greatCaprese!The veggie and focaccia flat breadsThe Isabella great as wellI will skip the ceviche though I remember it being kind of sweet.I love this place. But it can get a bit crowded its tiny, they only have one table long table that fits about 8"], ["Lindsay H.", "One of my favorite spots in Los Feliz, by far. VF is really intimate (small, and dark, but in a good way), and the food and drink selection is standard but still somehow impeccable. I absolutely love their ceviche- huge portion compared to most other places' app ceviche. And it's quality. Happy hour is a pretty good deal for the food and wine. And I believe it's all day on Sunday and Monday, which is wonderful for weeknight socializers like myself!"], ["Emily F.", "Just got back from our first visit to Vinoteca Farfalla, and we couldn't be more pleased with our entire experience.  We went on a Sunday, pleased to discover that there was a happy hour all evening, though we hadn't planned on going to one.The ambiance of the bar is great - even during the early evening, the entire place is dark and quiet, soft music playing in the background which only adds to the overall experience.  The tables along the bar are a little small, so if you are planning to order food, I would suggest sitting at one of the larger tables in the back or at the bar itself.I enjoyed two glasses of wine (Tempranillo and Torrentes). Both were extremely delicious and reasonably priced ($6 during happy hour).  My boyfriend had the Maudite on draft, which he was delighted to find.  Its one of his favorite beers and rarely available at bars. Even more, a 12 oz glass during happy hour was only $4! Definitely a nice surprise.We had the Parmigiano Vinoteca (fried Parmigiano Reggiano) $6 and Foccacia Vinoteca (pizza with procuitto, arugula, fresh mozzarella, and tomato sauce) $11.  The food was delicious and filling, something we were surprised about.Our service was also superb.  Bianca, the woman at the bar, was phenomenal.  She noticed when we we wanted new drinks or to order food, which was greatly appreciated.  While I didn't need recommendations on drinks, her knowledge and communication to other customers was impressive. She, along with the rest of the staff, were friendly and helpful through our whole time there.Overall, one of our new favorite places and a great steal during their happy hour!"], ["Candace L.", "I've been to Vinoteca three times now, once on a first date ;) then on an anniversary of our first date a year later and most recently for an \"official\" two year anniversary to celebrate over a glass of wine at the spot of our first date ;) Everyone got that? Yea, we are \"those\" people! We like Vinoteca not only because it holds special memories for us but because it's a super chill spot in Los Feliz which is probably one of the best little neighborhoods in LA.Vinoteca has a daily HH from 4P-7P with a wide selection of appetizers. Get the empanadas! and a large selection of wines by the glass which range from $5- $9 during HH. I like their Tempranillo. The cheese plate is not so impressive in my opinion. You're probably fine skipping this item.I love the vibe of the place, dimly lit with candles on tabletops. It's a small place with 2 person rounds set against the wall across from the bar, bar seating, a handful of tables in the back and a couple out front.Service is great and accommodating. $5 Valet parking is located in the lot next door."], ["Michelle P.", "We went here last night and the service was the nicest it's ever been. That was a pleasant surprise, however the grilled calamari was a rubbery, tasteless mess. So surprising as I've enjoyed it in the past. I find this to be an issue with West Coast restaurants-- inconsistency. One night the food is amazing, a week later, it's awful. In the past when I read bad reviews on the food at this restaurant, I thought reviewers were crazy. But it seems to be a draw of the cards. I still love the atmosphere and their wine selection."], ["Nattie M.", "This place is falling apart without Chiara. We asked where the chianti was from and the manager derisively told us: Italy. To be fair, he did come back to tell us that he found out it was from Tuscany. Oh really?! Then they brought my pizza out so late that my dinner guest was already finished eating. And the pizza recipe is completely different from what it's always been. It was smothered with cilantro. So gross. We had to send it back. Please vinoteca, get your shit together before we stage an intervention. You're just not the same wine bar we know and love."], ["Angie C.", "Nothing gets my attention like late night happy hour. My bestie and I went on a Sunday night (happy hour is 4-midnight Sunday's and Monday's). I was genuinely impressed by the assortment of items on the happy hour menu! My girl had oysters and empanadas. I had a kale salad and we both split a cheese plate. Not to mention, the owner(I think he's the owner?) gave us a free glass of dessert wine! He's such a nice guy and told us to come back.. Well, guess what? I think I will"], ["Farhana S.", "Used to worked a block away from here so decided to check it out one day and turned out that my co-workers and I became regulars soon after! Great place for wine and happy hour. Though it does tend to get a bit crowded and parking is valet only (unless you get lucky and find street parking). Nice ambience and good service makes it one of the top happy hour spots in Los Feliz. My recommendations are: the grilled and fried calamari, mixed empanadas platter, ceviche and avocado pizza! Great happy hour prices and delicious food will surely have you returning back! Food Grade: AWorth The Money: AService Grade: AAmbience: A+Parking Convenience: B, due to Valet $3Overall Impression: A"], ["Maggie S.", "The food is very authentic Italian. Well, authentic Italian to someone who's only been to Rome and I'm not sure how Americanized or tourist-friendly they make their food there but if you like that you will like Farfalla!The menu is in Italian, everyone there speaks Italian- it feels very legit and I like that. We had the bolognese and the amitriciana pasta- I have not been able to find an amitriciana dish yet in LA so this was an automatic win for me! Rich, thick sauces on both plates and the wine selection is a bit pricey but come during happy hour and you won't feel the sting at all.I know Strommen does group language classes in Italian here on week nights and after seeing how authentically Italian this restaurant is I'm thinking that I will give their course a try! An excellent choice for great Italian food without being at a fancy stuck-up place. ....However, I took off one star because the prices don't match the ambiance. The restaurant is nothing to stare at, very basic decor, and a super casual atmosphere. There were lots of families with little kids which is great- I'm a preschool teacher I LOVE kids and babies, but I don't love paying upscale ritzy prices for my meal when I could imagine myself in a McDonald's if I closed my eyes inside the joint. You know?"], ["Mike H.", "Has been here 10 years...and the reason is obvious...neighborhood vibe....thoughtful wine selection...excellent service...and possibly the best Happy Hour in the area.Also, they are quite generous with the pours and sampling."], ["Samantha A.", "I am VERY disappointed in Vinoteca after our visit today. We have been here numerous times and always order oysters. My husband ordered a dozen oysters, ate a few, and then had one that was completely rotten. It was so bad that he had to excuse himself to go to the restroom. The oysters smelled exceptionally fishy and he didn't want to risk getting sick after biting into a bad one. When we told the female bartender, she took one of the oysters to the chef who said it was fine. We asked them if they could just charge us for half a dozen and/or bring us something else instead. She refused to compensate us in any form and would not even seek input from the manager. This is awful customer service considering we spent $100 on happy hour and come here regularly. Get it together Vinoteca!"], ["Biffy L.", "Every once in a while you have a meal that is unforgettable, and my experience here was just that.  We were crammed into a small table shared with another group and it was dark and cold in the restaurant, but a few of the dishes I had last night were simply incredible.Two things that I would eat over and over again if my stomach and budget allowed would be the Burrata with Prosciutto and Risotto in Carrozza.  The first was a toasted bread with garlic and olive oil topped with creamy Burrata and salty, delicious Prosciutto.  The Risotto, recommended by our friendly server, was perfectly cooked risotto in the Chef's special creamy mushroom sauce delivered to our table in a cheese wheel and scraped out with all its cheesy buttery goodness onto my plate.If this restaurant were closer to my house, I would be in trouble...thankfully it will only be an indulgence before any Greek Theater shows."], ["Sean M.", "Ok...this is definitely one of those places that Yelpers should rate as 1 star. If you've been here, you know you want to keep it as your secret and yours alone!For the quality of food and the beers on tap this happy hour is the best. Perhaps a little too 'best' as my head can attest to the following morning. I came here for a friends birthday and we dined solely from the happy hour menu, leaving quite full and toasty. The vibe I got from the staff was that of a warm and family run environment. Eager to please and proud of their menu. No pompous airs and graces, just good food and drink.Come one, come all...just not when I'm going because I'd like a table.Parking: Theres a parking lot out back. Street parking can be tough to find in the area after 6 in the evening."], ["Pretzelcuatl L.", "This place is actually great, but they should tell you that \"filtered water\" means \"$6\" water. I hate this kind of tactic.  At least I got a nice bottle out of the deal.  That I didn't need or want.Edit:  Ha, I guess I wasn't supposed to take the bottle!  A waiter chased me down on the sidewalk to take it back!  I told him I paid for it and went home with it, only to find online that I wasn't supposed to keep the bottle!  Ha ha, you idiots, when my wife agreed to filtered and I said tapped, you should have come clean and told us it's a special service.  Honestly, this kind of dishonesty makes me want to not go to restaurants.  Except I have this amazing $6 bottle!!!!!!!!"], ["Sandy A.", "This place is cozy, has a great selection of wines and cheeses. I like it for a night out for chatting with a friend AND its great for a date. The guy who runs the place is very friendly. Prices are fair as well."], ["G L.", "This is a quaint restaurant close to the Greek theater . Food was very good and bordered on fabulous  ! ! Great service , friendly knowledgeable waiters. Great Wines and beers ! Only three stars because the restaurant had an air conditioner out and we were not told , we got there just after they opened and as soon as it filled you could smell the kitchen ( which was not bad smell) and we wilted and wilted , As we left they were still not telling people coming in . This is a disservice to patrons and very unthoughtful of the owner. This is why the 3 stars and I will have to ask if the air will keep up if I go again ,  gary"], ["Peter G.", "My wife and I stopped here for dinner prior to our concert at the Greek Theater. It is a small, corner restaurant that provides a great ambiance in a small dining area. We enjoyed our server who was very attentive and knowledgeable about the dinner specials and made time during our dining to check-in with us several times despite the restaurant being very crowded and busy. The meals were served quickly, were hot (not warm) and also very well portioned. We enjoyed our experience here entirely and would recommend this place to those who crave authentic Italian cuisine served warm and fresh."], ["Lacy R.", "I came in here with my friend on Oscar Sunday. Being musicians who had friends playing in the show, we were feeling slightly sorry for ourselves so we ordered a bottle of wine and ordered some calamari to munch on.  For whatever reason, my friend decided it was time to try \"grilled calamari\" it took a while to come - finally came - and it was gross and rubbery; basically we just didn't like it grilled. we kept trying to like it - as we thought the kitchen was closed; and no one ever came to check on us. I finally decided it was too awful to eat and asked the guy if the kitchen was still open and if it were possible to get \"regular\" Calamari. He agreed; and it came out soon - MUCH BETTER!! ahhh!!! It wasn't their fault - i just think we don't like \"grilled calamari\"  but the guy tried to charge us for both plates! When i mentioned it he said \"you ate half of it!\" and I'm like \"well that's bc we were trying to force eat it bc no one asked us if it was good\" anyway; he took it off the bill - with much dismay. I knew where he was coming from  - but at the same time, check on your customers. Besides that - everyone was nice - he was even nice as well (I guess it was the owner we were talking to?)They have a small TV (which I like - not a fan of huge TV's everywhere) it's a small/intimate spot. nice wines."], ["Ursula N.", "No. Just no. Actually, I want to explain:Positives:  It is beautifully designed. Inside you'll find a nice, cozy resturant that's decorated with great care. I also appreciate the friendly staff.Negatives: The food and the prices. I had the Fritto Misto Di Pesce and tasted some kind of pizza with pears. My issue with the Fritto Misto Di Pesce: I was asked if I wanted the seafood to be fried or grilled. I decided grilled. The end result? Not that grilled, and pretty bland. I know this dish is typically fried, so perhaps they weren't prepared for my \"grilled\" response but then why put the offer on the table? I just wasn't impressed.My issue with the pizza: Also bland. My issue with the prices: Well, I went during happy hour so maybe I'm just being cheap but I felt like even the happy hour prices were too high for the food I got. I really wanted to like this place. I went in with high expectations and ended up really disappointed. I hope it was just an off night for the food, but perhaps I'll never know; I doubt I'll be paying another visit."], ["Lisa W.", "Happy Hour  4-7 everyday!Superb selection of wine at great prices during happy hour!  Glasses are $5 and up, and poured with much love and care.  Service is excellent.  Food is well priced, most dishes are under $10, and all designed to pair perfectly with wine.  My favorites include the ceviche and bruschetta--both some of the best I've ever had.   Pizzas are thin crust and delish.  The spicey shrimp pizza is an excellent choice for those who like fiery foods.I LOVE the ambiance.  It is dimly lit and romantic, small and intimate.  It is usually mellow since their patrons tend to carry themselves with quiet (though perhaps inebriated) dignity.  The opposite of, say, the Cabo Cantina happy hour crowd, whose intoxicated cackles can be heard from across the street. Great place for a date or small get-together with friends."], ["Kay M.", "I'm from D.C. and this is where I come when I'm feeling nostalgic.  As soon as I walk in, I feel like I'm back at a great and non-pretentious  Logan Circle wine bar.The wines are great and the servers very knowledgable.  Do not fear taking their recommendations.  Food is wonderful, ambiance is perfect.  Wonderful spot for cozy conversation- first date, catching up with a friend, etc.Easy valet parking for $3- this is LA, after all."], ["Cat B.", "Vinoteca will always have a special place in my heart. The ambience is cozy and romantic, the staff is so great and we always feel welcome with open arms, and the food is some of the best.I have been going to Vinoteca since it first opened. Years ago it was the gathering place for Happy Hour with the girlfriends , then it became the go to date night spot for me and my boyfriend, and now we have moved not too far away but far enough where it's not our regular spot anymore.About once a month we make the drive over, grab a corner table and order all of our favorites. After all these years it still holds up.Great wine, great food, great service.I highly recommend."], ["Brandon W.", "This is my go to place for happy hour. Great service with excellent food and wine selection. The ceviche, bruchetta and Foccacia Vinoteca are my favorite dishes. Ambience is chill and cozy."], ["Karl K.", "Thank you for saving the night!!!-------------After getting crapped on by the Sushi Gen host who thought he was better than my $150-200 (see my review), I was literally seeing red until my better half said, \"well why don't we leave? You're going to be pissed off throughout the dinner anyway, and why reward them for being jackasses?\"You know what? She was absolutely right. So we did a 180 and came to this wine bar, where last week I had an awesome happy hour.  This place definitely saved the night. Now before you think this is a \"rebound\" kind of an experience, I will say clearly - this is far from it. Our hostess seated us immediately at the communal table. I started off with a malbec, and she got the Pinot Noir. We moved onto the olive tapenade - perfectly salted, and extremely savory - glad we got the red wines!The ceviche had just the right amount of tart, and was well complemented with a flight of dips - a delicious green sauce, a freshly chopped salsa, and a chunky guacamole. The highlight of the evening? The brazil burger. The beef tastes freshly chopped, and there is a savory, beefy flavor - which is very rare these days. Even In N Out can't boast that. Definitely worth coming back."], ["Jina H.", "I've found my new Happy Hour spot! Love the ambiance, good food, good wine, good company.Rushed here after work to make it in time for Happy Hour.Happy Hour from 4-7pm on M-F, Sundays all dayThis place is pretty small. I feel like it's more of a spot for 2-4 people.We ordered:-Caprese-Shrimp thin crust pizza w/ jalapeno, cilantro, avocado  -Half a dozen oysters: They were super fresh.House wines available for $5/glass. They also have sommelier's choice & premium wine options available for Happy Hour as well as beers.The food was great! Drinks were reasonably priced, but the food prices are not that happy hour friendly. I think HH food ranged around $11-13.Service: Excellent! Parking: I suggest looking for parking in the surrounding neighborhood. I usually get lucky in Los Feliz. Otherwise they offer valet for $3.50 in a lot right next to the restaurant."], ["Graham S.", "A haiku review: Cosy little placeIncredible happy hourAnd friendly service"], ["Anthony B.", "If you are feeling very chic (i.e., dressed in all black while wearing patent leather oxfords with a zipper detail), then this is the place for you! The restaurant is very intimate and erotic, kind of New York-ish without the New York-ish smell or attitude. It's very reminiscent of an underground massage parlor--so naturally I enjoyed the ambiance and sultry/sexy aura of the space. The food was really great; we ordered calamari to start (cooked/seasoned perfectly, friend said it could use more crunch though), angel hair pasta in a light tomato sauce (I think, I was on my second glass of wine so I may be wrong), and fusili with mushroom and ricotta. Delish. Overall: sexy ambiance, sexy food, sexy wine, sexy night."], ["John P.", "This place was a hidden gem. Seriously though! It was hidden! We walked by it twice before giving up. We decided to go to the Brazilian restaurant next door, but when we walked in the side door we realized we had found the wine bar. Dumb luck I guess. Upon sitting down we were greeted and presented menus promptly. The server was great. The dishes were good. The wine selection was above average. I got their Somm Selection's for both glasses, Malbec and then Grenache.I've already recommended this place to several people. I will definitely go back!"], ["Scott G.", "One of my favorite local places. Great daily 4-7pm happy hour and all day happy hour Sundays (and now Monday) are a huge draw. Prices are great during happy hour but can be a little steep at other times. Their addictive complimentary toasted bread is hard to pass up. The dim lighting, brickwork and background music create and ambiance conducive to spending several hour at a time there. Try the Braziburger, Focaccia Vinoteca or the Ensalada Vinotecca (just to name a few)! The staff is knowledgeable and attentive. I've never heard anyone say anything bad about this place."], ["Irina M.", "Best place to get delicious wine and amazing antipasti. I love the ambiance, so romantic. All day happy hour on Sundays is the best weekend treat!The Antipasto Vinoteca is the perfect thing to snack on while enjoying a glass (or three) of wine."], ["Tracy F.", "I have been to many wine bars over the years and found the wine list lacking and overpriced. Not very creative. The service was also poor and rude. I was very disappointed and will not return"], ["Jaime W.", "Went here for dinner and don't expect an extensive menu on food but wine only. It was a birthday dinner and it had good reviews but my fellow Yelpers, I am disappointed. This place was more of a wine bar, not a restaurant. Also, the space is very limited. The table we sat was merely a foot away from another. So in terms of having a romantic dinner, don't come here. If you're here to get drinks, this is a place for you. The entree we ordered was overly salty and the meat was overcooked. It was horrible. I left the place hungry. Also, the valet service wasn't anything special. They just park your car for you in the lot you pull in."], ["Melkon T.", "Sunday all day happy hour with $3 beers! Great little gem tucked away in the Los Feliz village. I love their selection of wine and the beer isn't bad either. Service is always great any time I've visited. Even before closing when I went in, I was still generously greeted by Radu the manager and offered a drink. Appetizers are great. I'm a fan of olives and nuts and cheese and all that hoitie toitie stuff with wine and they've put together a nice spread. I must say though, the burger tasted a little too much like store bought meat. It was very nicely put together and all the flavors were complementing, but the taste of that beef wasn't where it needed to be. Nevertheless, great place to eat and drink."], ["Anna D.", "Great spot for happy hour. Their $5.00 ones are perfectly paired with $11.00 pizzas and salad. And I like that their service is attentive but not obsequious, which means they leave you alone if they sense that you want to be left alone and chat with your dinner companion, but they are there when you need them."], ["Nikki L.", "Came here this weekend with my dad and boyfriend. It's a very cozy location, and they staff were great! However, it's pretty pricey and I was underwhelmed with my meal choice. The next time I'm in Los Feliz I'll probably try something new."], ["Laia R.", "Been here for happy hour and at night and i Looove it!Great wine, food and ambience!Its so dark and cozy inside.One of my fav spots :)"], ["Brian K.", "I used to like this place but the incident I had this evening where the waitress said she didn't get our money and they charge me double. Not thrilled. At all"], ["Sennett L.", "Came here last night with the gf for happy hour.  I remember a friend recommending this place as a nice romantic place to take a date with good food/drinks.  It all started when I got the parking spot right in front of the place.  Score!  We walked in around 6pm and sat down at the first table by the door.  Immediately we were brought out menus and some bread.  Server was nice and knowledgeable about the wines and menu items.We went with the raved about Ceviche, three empanadas, and the Focaccia vinoteca.  I also got a Maudite, and the gf got a Reisling.Ceviche: Excellent! Very fresh and citrus-y.  And the guac/salsa/chimichurri sides that it came with were all great!   (side note: the chimichurri is amazing)Three Empanadas: Very good, we got 1 beef and 2 chicken.  Both were stuffed with a mixture of the meat and some veggies.  The chicken ones reminded me of a chicken pot pie for some reason.  This comes with sour cream, guac and salsa as well.  Focaccia Vinoteca: Prosciutto, mozarella, and argula on a thin crispy focaccia.  This was excellent as well.  I was expecting it to be salty due to the prosciutto but was pleasantly surprised.  It was not too salty, the mozarella was cut into small cubes and was very fresh.  Overall a nice mixture.Would definitely come back here, although it is a bit pricey for happy hour.  Spent $50 after a generous tip."], ["Vanessa M.", "My friend brought me here and it was love at first sight. The inside is small, dark, casual, and somewhat romantic. A little seating in the outside and street parking. They have great happy hours on sun all day! and a nice bar, great selections of wine and drinks._Ceviche Vinoteca was amazing. I thought La Cevichera was the best but I actually liked Vinoteca's a little more. I love that it comes with guacamole, pico de gallo, and some green garlic like sauce. The shrimp and fish is fresh and it's a perfect dish to start. Light and citrus y. Some like their ceviche more with lemon/lime and some like it a but on the sweet side. It was definitely a combo of both. And the chips were great too._Foccacia Vinoteca, I'm not a big pizza eater just because It's very carb heavy and I try to stay on the light side, but their pizza comes so thin crusted, it's more like on a huge tortilla wrap rather than a dough crust. Very thin and crisp, after we finished I did not feel as full or stuffed. Salty from the prosciutto and the arugula adds the prefect amount of greens. I wish it was less salty but its to be expected when you get prosciutto. A definite must try._Kale Salad, I don't remember the name but it had kale, avocado, quinoa, tomatoes and cucumber with olive oil dressing. Light and great to share, another great dish to start off with. The service is great! friendly and accommodating. Overall great experience. Would definitely come here again with friends for their happy hour menu."], ["Carol M.", "Someone needs some wine 101.  I think they store their wines in a sauna.Had the house red, which tasted like it came from the Applebee's menu, followed by a $13 nebbiolo, which tasted like a $7 glass of wine because of the temperature.   Both were served at about 75 degrees. I dunno, it may be just me, but I think any restaurant advertising itself on wine should respect the wine it serves.  Proper serving and storing temperature is critical to enjoying wine."]], "Monarca Pasta & Grill": [["Turner R.", "WOAH.  Surprisingly good. Classic Italian. Amazing food. Would highly recommend to anyone!!!!!!"], ["Simonne K.", "The chicken fettucini was really good. The portions are super large so I suggest sharing (seriously food for days).Staff was really friendly, it was a perfect on the wall gem."], ["Alondra S.", "Service was excellent, food was amazing much better then past aroma, will definitely return soon!"], ["Mazamir Y.", "Best italian food near USC by far! And the people are super nice too. Surprised that the place isn't packed every time I go."], ["Jovan P.", "Monarcas was bawm! I really loved the food and service here! I mixed it up and got the primavera pasta and I added chicken, with a side of jerk sauce to tip it off! The crab cakes with salad were top notch! Trust me, this restaurant has the quality of Beverly Hills. I will definitely visit this diamond in the rough soon."], ["Luz M.", "My favorite plate at Monarca pasta grill is the florentina pasta delicious flavor.  I also loved the BBQ grilled chicken salad.  Woohoo it makes my day."], ["Roxana C.", "This place is AMAZING. The people whi work in that restaurant are very nice and attentive. The food is sooo deliscious. I HIGHLY recommend Monarca pasta and grill."], ["t o.", "A HIDDEN GEM!!!  Been here twice.  Both times pasta.--delicious, generous portions and inexpensive.  High quality Italian food at a third of the high quality price.  I'd eat there much more often if it was closer to me.   Good, friendly service.  A must GO for Italian food lovers."], ["Sushant P.", "Was walking around looking for a place to sit down and eat when we ventured a bit too far off the street and noticed this place.Looks very humble but offers a cheaper dining experience with a homely, familial feel to it.Got the fries there and found them to be extraordinary, considering the setting of the restaurant. A nice little place to eat if you're hungry don't want to spend too much."], ["Chai N.", "Had the pasta fettucine in red sauce. Was pretty good. Although they mixed up my order. I'd asked for the pasta fettucine in white sauce. Small place but seats small groups properly. Their fries were good too."], ["Nathaly P.", "My boyfriend and I had dinner here and the food is delicious. I had the camarones negros and he had the pasta primavera. Amazing flavors!! Good people and very chill environment. You don't find quality food like this in the hood!!!"], ["Jaime D.", "Love this place had never seen it before it looks new. Had it for the first time its kind of hidden. Had the shrimp pizza let me tell you best pizza i've had in a very long time the flavor its amazing it simply melts in your mouth. The shrimp pasta was awesome better than the one at Olive garden for half the price."], ["Julissa M.", "This is my new fave restaurant. I got recommended to this place from a friend and ever since then I come here almost every weekend. My fav dish is the pasta primavera, I mixed it up with both chicken and shrimp. I've tried almost everything on the menu from pastas to pizza to burgers and even burrito. They never disappoint. Hands down the best restaurant. When you come here its a nice friendly family vive to it, plus the employees are really nice."], ["James K.", "excellent food at a very reasonable price. assume the chef must have cooked for a upscale italian restaurant before opening up this spot. for me, the location is a bit out of the way but the food makes the trek worth while."]]}