{"Sidewalk Grill": [], "Panini Cafe -Downtown": [["Dan R.", "Food is always amazing, the music and service could definitely be better. For some reason all Panini locations are delicious with terrible music and staff that doesn't really care unfortunately. This review has nothing to do with the food just the vibe."], ["Sara L.", "The chicken soup is homestyle and wonderful.  Food is good, and chicken kabob plate is a best bet.  The $10 corkage fee is another plus.  Not gourmet, but perfectly lovely for a kabob plate and a casual dinner."], ["Jil W.", "We ate here last Saturday night while staying in the area & finding them on Yelp.  Walked in and were seated right away without a reservation.  It was WONDERFUL.  Great service, excellent food and prices.  We wish they were in our neighborhood!  We shared the appetizer sampler (hummus trio really delicious), the lamb kabob (husband says best he's ever eaten) and Mediterranean salad. Go there!"], ["Dulce D.", "The best ever! Although our service was slow. Our waitress was taking forever. I wish I got her name. We were a party of 6 girls finish shopping downtown & we were definitely hungry. The waitress was talking to some other ladies a couple of tables down. I was like she's getting all the gossip. Literately was waving my hand to get her attention. She was deep into the conversation. Until some waiter notice and came to our table. Overall, good food would rate 5 star but, the service would rate 4 star."], ["Narciso A.", "I am never not satisfied when I come here. Never not satisfied in the food taste.Never not satisfied in the food portion. (Read: HUGE!)Never not satisfied in the service.  My fave dish here is a special that never leaves the specials board, the chicken kabob plate. Order it with the Bulgar wheat, you won't be sorry."], ["Joe R.", "This place kicks ass. I used to eat here quite a bit when I worked in DTLA. I'm a huge fan of their chicken kabob plate. I think it may have gone up in price because I remember (possibly incorrectly) it being $9.99 then. Either way, I'm still a buyer at $13. It's a lot of food for the money and you could honestly split it with someone.I returned a week ago to have breakfast here. The portions for breakfast are just as big. I believe I ordered a chicken sausage scramble. It was a normal breakfast scramble but every bit of tasty. The coffee here was really good and our server definitely kept my cup full. Just ask the clients I was with because I wouldn't shut up once the caffeine kicked in. Check this place out for a good and affordable option for a sit down restaurant in downtown LA whether for breakfast, lunch or dinner."], ["Vanessa M.", "Good and healthy food for a great price. Came here after work for a quick lunch. Parking is street only. The inside is pretty big and the outside as a couple seats. The wait was quite long as we came during brunch rush hour. I always get the usual. _Charbroiled Chicken Shish Kabob ($9.95). Served with Basmati Rice or Bulgur Wheat Pilaf, Skewered with Grilled Vegetables and Choice of Caesar, Mediterranean Greek or Romaine Avocado Salad. I got the wheat pilaf which was good but the basmati rice is better with this dish. I also chose the Mediterranean salad. The salad was good and the balsamic dressing was simple but great. As for the chicken it could have been more moist and warm. I've had the chicken better at other locations. Still always my go to. _Koobideh Kabob ($11.95) (Available with One Skewer for $9.95)Two Skewers of Charbroiled Seasoned Ground Sirloin, with Skewer of Grilled Vegetables, Basmati Rice or Organic Wheat Pilaf with Choice of Caesar, Mediterranean Greek or Romaine Avocado Salad. I actually prefered this a bit more over the chicken. Although the meat could have been a bit warmer the spices and flavors were good. I recommend getting the basmati rice. Portions are pretty big so you can either share it or take the rest to go. I would try avoiding the brunch rush because it seems out meat was not as warm as it should have been. And my gf's vegetables did not really come grilled and the onions were pretty raw. Service was nice. Other then that great to come for lunch or dinner."], ["Uyen N.", "Circa 2008 I was a FIDM student who discovered the most amazing cafe in the world located across the street from campus. I would have lunch with friends or grab a quick bite before class. I was elated by my discovery and to top it off FIDM students received a 10 percent discount. Score! My usual lunch consisted of a panini and Mediterranean salad which were both very good at the time. This review is solely based on the fond memories of my college days and eventful lunches had with friends here."], ["Chanel C.", "I'm allllllll about that PATIO LIFE.Great sit-down lunch spot if you enjoy dining outdoors! I work in the area so I'm always looking for lunch spots where I am not confined to 4 walls-- getting some fresh air is SUPER IMPORTANT to me. Panini Cafe can get a bit busy and crowded during the lunch rush, but it's totally worth the wait. I wish they took reservations, but it's first come first serve. Affordable non-fast food lunch spot ($14-$18), fresh, and tasty. + Salmon & Brie Panini ($11.95): The sandwich comes with perfectly roasted and tender Salmon, melted brie cheese, tomatoes, fresh dilll, capers, & red onions. The fish is expertly prepared and I love the squishy grilled foccacia bread it's on. SUPER GOOD.+ Mediterranean Salad: Crunchy, fresh, and dressed perfectly. They are generous with the sprinkle of feta cheese, and a litttttlleee tooooo generous with the raw red onions. I think a little less onion would make this salad perfect. Definitely recommend this as a side salad to your entree. And also, I recommend a breath mint after. + Lentil Soup: Their lentil soup is really hearty and filling. Perfect to accompany a salad, but a little too much to go with a sandwich. I really loved the soup though. The lentils were soft and the broth tasted like home-cooking."], ["Russ C.", "We had a working lunch meeting, 6 chicken Shish Kebob and 2 beef, all with rice and Ceasar salads. Prepared with chunks of Onions, bell peppers and tomatoes. Very flavorful and hot. Call in the order, and all ready in 10 minutes. Clean restaurant, cool bar, nice dining room and 2 outdoor patios. One of the few restaurants in DTLA where you can bring your dog to the outdoor patio."], ["Angel G.", "Normally this place is great, which is what i expect. But today apparently the chef didn't care enough to serve me a dish with CHARCOAL BLACK POTATOES!!!! Literally as burnt as possible!!! I told the waitress, she was very busy & asked if i wanted another side. I said no just tell the chef he shouldn't plate garbage like that. Anyway i ended up paying full price for everything & a manager never came to talk w me. Terrible for hospitality/food standards. Panini, i thought u guys were better than that...... :(Please view the photo i posted!!!"], ["Hannah K.", "Have been here 3 times (twice for dinner, once for brunch) and loved it!! Especially like the falafel platter and the breakfast sandwich with brie avocado and egg whites. The outdoor seating is nice and I've never had to wait for a table. Can't wait to return next time I'm in LA."], ["King J.", "Went here last night. I noticed in some areas of avocado and tomatoes was not good...The service that was provided was not appropriate. At the same time, the atmosphere was not enjoyable due to individuals negative personality in our surroundings."], ["Di C.", "Been coming here for over 5 years and don't get v tired of this place.  I usually get the beef kebab or chicken kebab with basmati rice, grilled veggies and salad. The chicken is moist and has a faint lemony flavor. Ive also had this dish with bulgur and is delish. The date salad is tasty as well. They offer a great variety of dishes to choose. Would highly recommend."], ["Matt M.", "This review isn't for the food! I've been here on numerous occasions and the food is amazing. However, I called this evening at 9:19 pm (yelp showed that they close at 10), I got there at 9:23 pm, and I was told they are closed. I told them I just called, they asked me to show them my phone. I did, and the manager said 'sorry my kitchen is closed, sorry.'"], ["Eddy H.", "So I stopped by to order a fillet mignon kebab and I was pretty disappointed by the food and the restaurant. The meat was cooked right but it was a bit dry; I'm not sure if this is how they normally serve this dish but when I order the chicken kebab the meat is juicy and the consistency of the chicken is perfect. On this dish however, I felt like the meat was dry and hard to chew on; fillet mignon should never be this dry. As for the vegetables that come with the meat I felt like there was a lot less of them and they were smaller. The white basmati rice was noticeably undercooked to the point where it was unpleasant to eat and it was greasy as if it had been fried, poorly. Now this I know they messed up because normally the rice is always very nicely cooked and it's not this greasy, if I remember right normally the rice feels like it's steamed. For my side salad I got the romaine avocado and the salad was good; they used fresh vegetables and the consistency of the salad was good with all equally chopped vegetables but they were not julienne cuts this time so it was hard to eat with my fork. I also noticed they put a lot less avocado this time it was ridiculous you might as well not put any in there just call it a romaine salad and exclude the avocado. I used to like this restaurant a lot but now it just feels like there's been bad changes in the kitchen. They're taking a more \"efficient\" corporate approach and it makes you feel like they didn't put any thought into their food. I was very disappointed today the staff seemed less friendly I just don't understand. Did they change ownership? What happened? I might come back just because their chicken kebabs are still good but if they mess that up too then I won't know where to go for good Mediterranean food around the area."], ["Marisa Y.", "You are in for a treat if you try their baganooj! It is this incredible mix of eggplant, yogurt & olive oil that is a pure delight for the taste buds. I was there on a rather hot day, so I got the babaganooj cold, which was amazing with the warm pita. I've also had it warm and it's fantastic both ways. If you're in the mood for a grilled sandwich, you cannot go wrong with the chicken pesto. It is my favorite sandwich, but I've also had the turkey and gorgonzola which is very good. I've had a bite of the chicken roasted pepper as well - the peppers are on point! I don't love goat cheese, but if you do I recommend that sandwich. As far as entrees go, the charbroiled chicken shish kabob is their classic. The grilled chicken, tomatoes & onions are wonderful (and healthy!) The entrees come with a choice of rice pilaf or basmati rice. I have only ever tried their basmati, which is amazing so I cannot bring myself to change to the pilaf, although I am sure it would also be superb. The mousaka is also veryyyyy good. It will appear like ground beef, but the meat is higher quality. It comes with pita & hummus as well as wonderful Tatziki sauce. Yum! I've also had the koobideh kabob, which I highly recommend. Entrees also come with your choice of 3 salads. I've tried the Mediterranean Greek salad & the Romaine Avocado salad (the last option is Cesar). Both are very good.Also, on this particularly hot day, I had their chilled chardonnay. It was crisp and delightful, and they kept the bottle on ice to keep it cold - how nice!To sum it up, you cannot go wrong. I have not had one item that I was not absolutely crazy about. And as far as eating out goes, this place is pretty darn healthy! For all my Orange County friends, they have restaurants there too :)"], ["Sam F.", "The food is excellent. But the service is lacking. It's either a hit or miss. They need to be more friendly and attentive. Even when the restaurant isn't busy the waiters seem to get annoyed easily if you ask for something."], ["Chris T.", "No complaints.  I had the salmon sandwich.  It was fine.  As with anything in downtown LA the parking a sucks.  Other than that this place was good."], ["Melody R.", "I was early for an appointment and I stumbled upon this place on a early Wednesday morning. I knew this place was god when I saw 6 of Los Angeles's finest sitting at a table. The place was remarkably clean and the servers were in top of their game. They serve organic, cage free, veggie, and wild options at a fair price point. Awesome breakfast choices and yummy too! Try this place out instead of the pricy places around LA live."]], "Cleo": [["Archer A.", "Wow.. I was really impressed. Review based on 1 visit, but going back very soon!:: FoodStated as Mediterranean Tapas style on Yelp. Portions are bigger than traditional tapas that I have had. Server recommended 2-3 items per person. I think 2 are sufficient, unless you have a larger appetite. Mine is smaller by American standards. However, I don't peck like a bird, I do eat a decent meal.The Dips come with a homemade pita style bread. Kind of like a good Indian Naan in texture. Delivered in a paper bag to keep it warm.I had two items: 1) the Cucumber & Yoghurt dip, which had 2 thin slices of cucumber on top. I really though it would be more of a cucumber dish for me greens lol, but it was fantastic (most likely much better than I envisioned).Item 2) the Roast Lamb.. Excellent! Really really good. I was going to opt for falafel, but it was a toss up and my server recommended the lamb. Glad I trusted her.:: DrinksOrdered the Vineburry but swapped out the Absolut vodka for gin (tanq 10) - really good. Presentation was excellent. Had two  even though just a tad sweet for my taste  ..too good.:: AtmosphereLoved it. Darker lighting, but not in a cave. A big modern open space, with cool decor, and lots of people enjoying their night. I was a bit jealous of the ones sitting at the high and longer wood tables.. but my part was rather small for that. Next time!For a date.. Yes, excellent. However, I noticed that part of the room had these big armchair type seats that looked a bit awkward to eat from, since you would have to perch to stay present at the table. Never a fan, but making a judgment from a distance. Also, it's better to sit next to each other than opposite, so try and get a table for 4 just for 2. It's more intimate that way. A little piece of advice ;):: Service & StaffTop notch. Hostesses (yes there were 2) were super friendly with a fun positive attitude, and professional.Server.. She was awesome, even though it was busy, and she was obviously a little stretched. Her recommendations were well received, and without her the order would have been far too much food.:: Value / CostTough call on this one. It is expensive, but not pretentiously so. I found it a good value except for the drinks that seemed a bit steep. My order of 2 cocktails and 2 items was just shy of $71.I have paid far more, and considerably less. Was it worth it? Hands down yes! Would rather a great food and experience for $$$ than a greasy big place for a bargain price. This is my preference.Long review because I really enjoyed this place more than possibly most of the last 1000 dining experiences.Oh yes.. If you got this far YMMV, and KCCO!"], ["Charm L.", "This is a late review, as we came here for a birthday dinner last month (10/3/15). There were 8 of us, and we waited about 30+ mins after our reservation time to be seated. In the meantime, we ordered drinks at the bar. A few of us ordered espresso martinis (which is important because it is relevant to our experience later on).Anyways, Cleo was super understaffed. Everything just took forever. Everything here is tapas style, so we ordered a bunch of things. I think we ordered about 12 items, of which we only received 8. We even got a order of something we never ordered. Trying to order & receive our drinks was crazy, because it just took forever. Our server was great, but he was just too busy. It's definitely not the server's fault that the restaurant chooses to understaff the restaurant, especially on a weekend evening.At one point, another server brought us our drinks we ordered about 40 mins earlier. She brought us a drink that she claimed was an espresso martini. We told her that it was a mocha martini, which we didn't order. She then argued with us that it was indeed an espresso. Another girl & I already had espresso martinis, so we showed her that this is what it looks like. That server continued to say it was an espresso martini. One of our other girlfriends had a mocha martini and showed her. For some reason, this server still insisted she was correct that the drink was an espresso martini. She started giving us an attitude, and she left. We were kind of shocked and laughed in disbelief (See the photo I posted of a mocha vs espresso martini at Cleo). When our original server came by, we told him what happened...and he put in orders for espresso martinis (which we all needed by this time because we had all finished our drinks).All in all, the food was pretty good. Our server was nice, and the drinks were good too. Too bad for the slow service and the weird girl server we encountered during the night. I doubt I'll be back here. There are so many restaurants to try in LA!"], ["Mary M.", "This review only covers the customer service I received (or lack there of) from the front end of the restaurant. I waited almost an hour for my table on my birthday and they charged me for my birthday dessert. Here is my story:I wanted to celebrate my birthday somewhere nice this year so I made a reservation a month in advance for a 7pm dinner on Saturday, November 14. Since it was my first time dining at Cleo, the helpful person on the phone even suggested that I sit in the main dining room (mainly for the atmosphere) for an ultimate dining experience.The week of the dinner, I called to confirm the reservation to make sure that my table is inside the main dining room and NOT at Cleopatra's Table Under The Stairs. The reservation was confirmed.On November 14...7pm - All 11 people in my party had arrived and were ready to eat. We waited about 5 minutes until the host finally led us to our table. She points us to the direction of table under the stairs. I mentioned that this is not what I had requested and that I would like to be seated inside as planned. She agreed and said she will get a table ready for us.7:10 pm - 10 minutes later, the same hostess approaches me and says she's just getting the table ready now.7:30pm - It has now been 30 minutes past our reserved time and we are still waiting for our table. My friends go up to the podium to ask the hosts how much longer we have to wait for our table. All 3 hosts at the front were clueless and didn't seem to be prepping any sort of arrangement for us. One chimes in and says \"the group at your table has a show at the Pantages at 8 so they should be leaving soon.\"7:45pm - I go up to the podium and ask for the manager. I'm sure she already knew this but I reiterated how I have been waiting for 45 minutes already. She responds with \"Well, we tried to sit you in there (pointing at the table under the stairs) but you didn't like it.\" I had to explain to her that it was Cleo who suggested I don't sit there. And it was Cleo who confirmed I am not sitting there. But now I am stuck here in the lobby feeling like I never had a reservation to begin with. She replied \"It's your birthday, right? Happy birthday. We're going to get you seated as soon as possible.\" Her assurance still left me without a solid answer. Right before 8pm, a host finally took us to our table.  The meal was good and the food service was good. But I realized that not once did the manager approach us to check if everything is going well. Also, am I crazy for thinking this? But I would expect any reputable restaurant to throw in a few appetizers in there for the inconvenience of the one hour wait. But not only did we not receive anything on the house, they even charged me for the birthday dessert that they served.It was all aggravating, frustrating, and disappointing at the same time. I would give Cleo's customer service negative stars if I could."], ["Ani P.", "This is mainly a review of the awful service and not a representation of the fantastic food. It's taken me a while to write this review but after someone suggested we go there next weekend, I remembered the rage I felt the last time I was there and had to say a big \"NO\" and share this story. My friends were appalled! I've been a huge SBE fan for years; have dined at every one of their restaurants in LA and frequent their hotel bars quite often. I've had nothing but excellent service and food in every single one of them until I decided to try out Cleo. I booked a table for 3 to celebrate my mother's 70th birthday a week in advance.We showed up there on a Friday night and the place was packed (to be expected). We were there right on time as I walked up to the counter to check in and was told \"we are getting your table ready, it'll be a few minutes\". 20 minutes later, there is still no word so I approach the hostess again, she says \"well people are paying and are about to leave so it'll only be a few more minutes\". At 40 minutes of wait, I am wondering why they aren't being honest so I walk up to them again and ask and this time they have a major attitude about it as if I am inconveniencing THEM! The nerve! My 70+ years old parents have been on their feet for 40 minutes waiting for a table! at 50 minutes of wait, the hostess tells me that our table is ready. \"What a relief!\" I think but then she proceeds to take us to a dark corner of the hallway BEFORE the entrance to the main dining area and offer us a terrible seat! I politely tell her that it isn't acceptable to wait 50 minutes for a reservation made a week in advance for a BIRTHDAY celebration and be offered a walk-in table. She gets even more annoyed and says \"well then, you have to wait more\". I say we'll wait because I am not going to bring my parents to a top notch restaurant and have them seat at the entrance! At this point I walk up to the manager and tell him about the situation. His response? \"HAVE YOU EVER EATEN HERE?\" I say \"No\" his response? \"WHEN YOU EAT THE FOOD, YOU'LL GET IT!\" - umm.. WHAT? Did he just say that? Are you freakin' kidding me? Is this nobody restaurant manager suggesting that I've never experienced gourmet meals and hence have no idea what it takes? I politely respond that \"I've had many culinary experiences around town and this is not normal.\" he says \"well, there is nothing I can do about it!\" I respond by saying that \"of course you can, you can be more organized in your scheduling and be nice to your customers when you aren't able to deliver on your service in a timely manner.\" - at this point he walks away! NOT ONCE did anyone apologize for this experience. NOT ONCE did they offer to comp a drink at the bar while we waited for over an hour for a table (yes, we got a decent table after AN HOUR of waiting). Had they not lied to my face multiple times and said \"the table is almost ready\", we would have happily left and eaten elsewhere. Mr. Nazarian, I know this is not how you run your businesses but you should know that your employees at Cleo have absolutely no manners and have no problem insulting your patrons. I know for sure that I won't be back. No matter how good the food you serve is, the rude and negative energy at the front door takes away all the fun. Thanks for ruining my mother's 70th birthday dinner."], ["Tami H.", "Cleo, in the Redbury hotel, offers yummy Mediterranean tapas in a hip setting.  The menu is huge with small plates for sharing from meze to roasted veggies to diverse proteins.  Everything was super fresh, served to order, and flavorful.  Cocktails are also excellent. My only complaint is that the pacing of the meal was a bit off.  There were moments when tons of food arrived at once, then others where we waited.  Recommendations:kibbehscallopsgrilled octopusBrussel sprouts"], ["Aryo S.", "Minus one star for the drama that ensured that evening. This review is based off a visit from a couple years back. The food - tapas style, small lovely plates of delectable foods.The environment - charming, open kitchen (awesome!), and trendyThe service - GreatOrganization - BlahMy issue is only with the ordeal of serving a custom made cake for a birthday girl to the wrong table! TWICE! How does that happen? Luckily the first time some party members were able to catch the mistake while we were still waiting for our table, but to our dismay, that custom made cake was served to another wrong table and whatever deliciousness that would have surely touched our taste buds were forever lost in the mouths of strangers. We were treated to some comps, dessert, and my friend received some gift card I believe. They took care of the situation in a great and professional way, but all of that could have been fixed with the organization of the cake that was brought in. Everything else was awesome, I would just be a little extra cautious about any items you bring here to be served to you. Definitely a cool place otherwise!"], ["Cecilia C.", "Cleo from the very start, was an enjoyable experience. My friend and I pulled up to the Redbury Hotel on a Friday evening and was welcomed warmly by the Hostesses. Our waiters and bus boys were also very courteous and friendly and make recommendations based off of our food preferences. The food was delectable and very authentic to the Mediterranean cuisine, I would definitely recommend Cleo to anyone open to trying exotic but tasty flavors."], ["Yasaman J.", "I am not into drinking at all. But oh boy, this place's drinks are bomb!!! I mean it is delicious...... The only thing that I remember about this restaurant is the Clementine drink that I had there.Besides my yummy drink, we had some appetizer sized dishes such as their lamb and brussels sprouts... But the highlight of my dining experience was again my drink... Our waitress was not very good I have to admit. She forgot to put in our order to begin with and she made some excuse when we confronted her.Are we going back to this place? Yes, just for a drink or two! For sure..:-)"], ["Silvia G.", "Tapas style mediterranean food in the heart of Hollywood!I came for dineLA but we ended up ordering from the regular menu. Each dish is approximately $12-15 and good for sharing.  Inside the Redbury Hotel, this restaurant has a nice old Hollywood feel with big drapes and some rustic tables, very modern yet elegant.Cocktails are good! Im not a big drinker so I appreciate flavors more than the taste of alcohol and these drinks were made with fresh ingredients and delicious. My friend ordered the Vinebury which had a very cool and refreshing cucumber taste and i had the Lotus Flower which was sweet with berries.*The warm pita Bread was very delicious.  Hummus was very good and although waiter described it as elevated, I didn't really taste the difference*Watermelon salad was so good and refreshing! Just enough savory on the sweet watermelon and with some cheese, great combination*Brussel sprouts is what people rave about. They were a bit bitter which is what they tend to do when overcooked*Grilled Octopus was not bad, portion on the smaller side*Bone marrow oxtail: new item on the menu and my favorite. Tender and very tasty*Duck bastilla, wrapped in phyllo. Interesting but not my favorite. The duck just tasted as a regular meat*Sticky tofeee pudding: very good, soft and warmOut server was great and described every single item we asked about. Valet parking with validation for dinner is $10. Good place to have dinner if you are going to Pantages or are nearby. They also have a screen outside of the restaurant where you can take a quick video and send to yourself!"], ["Nancy N.", "Came here for dinner with my nieces before heading to the Pantages around the corner. I can't believe I have never been here before in all the times that the Mr and I have gone to the Pantages. First, it's located inside The Redburn Hotel, the building is RED with the words Cleo on the side in white. Look for it by the corner of Hollywood and Vine. Otherwise you'd be driving around the block forever. I'm totally bummed out that the parking lot next to this hotel is $5 , but the parking by the theatre which is literally around the corner is $10. ::::sigh::: live and learn! The hostess(es) were ever so gracious and excited that I was able to make it finally. Traffic was horrible and I had called earlier to say I running late. Our waitress, Briana, was absolutely amazing! I rarely make up my mind half way through a meal that  I will definitely come back to a restaurant not just for the food but service alone. Briana was THAT good! The place was SUPER busy but Briana was ever so cool, prompt and had her A game on the entire time.It's tapas style, which I LOVE because you get to try a little bit of everything. These were the things we tried that I could remember: Hummus with pita bread - with three different types of dip 5/5Spanakopita - nice and crispy but not oily 5/5Dolmades - rice stuffed grape leaves 2/5 (wasn't feelin' it Roasted green peppers - 3/5- these were different, they looked like green string beans but they're peppers. Not spicy really. I recommend dipping it into one of the dips that comes with the pita bread! Spicy cigars - MY favorite! 6/5 )I could order that and eat it all day long. Roasted cauliflower- 4/5 Brussels sprouts- 6/5 -this is what they are known for! Everyone loved it! Instead of preparing the entire Brussels sprouts as is, the leaves/petals(?)/layers have been peeled apart and roasted that way so it's got a bit of a crisp to itRoasted potatoes- they they were cute little baby potatoes - smaller than a ping pong ball even. They looked like hush puppies almost. :) 4/5Then I had their grilled shrimp and marinated chicken , while my nieces got the chicken ragine (it comes out in a cool looking pyramid shaped dome, and lamb and steak kabobs. I'm not a fan of lamb so when I was offered a piece to try it I thought it was a bit overwhelming. But it seemed to have had a lot of flavor to it. The steak was very good though! My chicken kabob was very well marinated as well, the shrimp was good but I was too full to finish it. For desserts we had baklava, green tea frozen yogurt , and chocolate cake. Baklava and chocolate cake was a big hit. Green tea should just stick with being a tea or ice cream. Cheers! If you're seeing a show at 8 which we were I recommend getting to the restaurant at 6. We got there at 6:30 for our 6:00 and left by 7:45 (our waitress, Briana, once again was great with keeping us on schedule without making us feel rushed). I cannot not wait to introduce this place to the Mr!"], ["Missy F.", "I came back after months of raving about this place. We rarely come out to Hollywood so when we got the opportunity to come see Jerry Seinfeld at the Pantages, there was no question about coming to Cleo. Unfortunately, the hostess that assisted us this evening was one of the meanest and rudest I have come across. We arrived before 6pm for a 6:30 reservation. My sweet husband walks up to check in and ask the hostess if they were open yet. She replied \"in two minutes.\" We were not in a hurry so we sat at the nearest chairs. Not even 10 seconds later, a couple walks up asking for a table. They explained to the hostess, they did not have reservation. She takes them right in. After about 10 minutes, the hostess ask us what name the reservation was under. She couldn't find it for good few minutes. Finally, she looks again in her screen, finds us, and seat us by the bar. I asked her if there is any available table inside the restaurant and she annoyingly replied \"Everyone has requested to sit inside.\" Umm... Are you kidding me? The unnecessary tone should have told me just to leave but again, we patiently waited back at the chairs. After about five minutes, the same hostess took us in. There were plenty of seats inside! Why? Because we were here right at the beginning of the dinner time. And keep in mind, we dined from 6:25-7:45pm with plenty of seating. It's unfortunate and completely unnecessary when an unpleasant person power trips right before dinner. Not only that, as we sat down, she proceeded to talk crap and pass notes like grade school child to one of the girls that helped get our drinks. My own kid doesn't even behave like that. And I did not expect this kind of bad behavior at a nice restaurant. Other than the mean front lady, my husband and I had a delicious meal. Our waiter Jay (who sounded like a guy from Breaking Bad) was amazing and attentive and the food didn't disappoint but we probably won't be coming back. There are plenty of amazing restaurants in Hollywood, and kindness can go a long way."], ["Kell S.", "Everything here is so flavorful, delicious and well executed! Kabobs are all so tender and extremely flavorful, I'm especially a fan of the beef one. Hummus and all the mezzes are bomb and the fluffy bread is amazing as well, served piping hot in a brown paper bag. They gave us extra free of charge :) Branzino was super tender, not fishy at all, and the pilaf mixture with the creamy sauce was perfect. The flavor is unique and was welcome after all the meaty kabobs we inhaled prior to being served this dish. Chopped salad is okay but too salty. The eggplant lasagna type of dish was a bit took mushy and salty for my taste but super cheesy. The real MVP was the Brussel sprouts OMG whatever you do make sure you get this!! Times three orders. It's super crispy and oily in the most delicious way...I need the recipe. Ambiance is bougie causal. It's way too dark inside though. Our server was great--super sweet and attentive."], ["Toni W.", "I came here recently for my birthday dinner with a friend. We had a reservation but still had to wait a bit until our table was ready. This came as a surprise to me because it was a Tuesday night, but as we were seated I can say they definitely were busy. The restaurant is quite intimate. The tables were too close to one another for my taste. It left no room for privacy. Also, it's pretty loud in there so it was hard for my friend and I to hold a conversation without feeling like we were raising our voices or constantly repeating ourselves. The food was quite delicious. It's essentially a Mediterranean tapas restaurant. They suggest around 3 dishes per person but I have to say that that would have been way too much food for us. I say start with about 3 dishes per 2 people and go from there. Everything we had was great. My only complaint is that my lamb tagine was about 80% fat and 20% meat. Don't get me wrong, I love fatty pieces on my meat but there was way too much of it and it was not edible. Oh and be warned, the later you dine the more likely the kitchen will be out of entire dishes or ingredients  (i couldn't get tuna tartar and my friend got a flatbread without the artichokes).Although the food gets 2 thumbs up for me, I don't know how soon I'd return based on the fact that it was hard to socialize and I felt like both tables next to me were in my conversation because we were so close together."], ["Anthony V.", "Expensive but the food and cocktails are great"], ["Sandy C.", "Had an unexpected birthday dinner here, friend and i came here before our show at Pantages Theater. This place is know for small bites but omg we had sooo much food.We started with some delicious drinks (had 3 each) :oPClementina 15Ketel Oranje, Crushed Cucumber Basil and Serrano Chili, Orange Juice, Fresh LemonJanapolitan 15(BELVEDERE) RED Vodka, Crushed Strawberry and Basil Leaves, Fresh LimeThen they started us with some fresh baked bread and also brought us Hummus and Cucumbers /Yogurt, so yummy!We also had the Spanakopita (spinach, feta cheese, onions, egg) & Spicy Cigars (crispy beef sticks) Get it!!Okay so now for the main dishes:TUNA TARTARE 13Oranges, Olives, Harissa, Avocado (this was very fresh, I would get it again)BRUSSELS SPROUTS 10Capers, Parsley, Almonds,Red Wine Vinaigrette (Must try, order 2 if you can)MUSHROOMS 10Seasonal Mushrooms, Dates, Hazelnuts,Puffed Wild Rice ( I thought the mushrooms were okay, I can pass on this)ROAST LAMB 15Sonoma Lamb, Lebaneh, Israeli Couscous ( Perfectly cooked, so tender and falls off the bone)GRILLED HANGER STEAK 15Grilled Peewee Potatoes, Spoon Salad ( I didn't get to try it cause I was so full but my friend said it was really good and would get again)MEATBALL TAGINE 13Soft Egg, Smoked Tomato, Piquillo Peppers (Yum!! This was super yummy, get it)GRILLED OCTOPUS 13Celery, Crushed Potatoes, Lemon Vinaigrette ( I was so surprised how tender the octopus was, great dish)TOMATO AND BURRATA 12Heirloom Tomato, Purslane, Basil ( I would pass on this, I can get burrata and tomato anywhere nothing spectacular about this dish)Had a great time here and our waiter was super friendly. Come check them out!"], ["Morison W.", "Classy & Upscale. What more is there to say? Romantic vibe. Definitely a good date place. Plenty of small plates to try out if you feel like sharing. The DineLA menu was definitely enough to fill you up, especially if you come with a big group. You get to share a lot of the smaller plates.Valet parking at the hotel."], ["Kristin H.", "I really like this place.  I came last night with some clients.  We were immediately greeted and sat right away.  It's all tapa/family style so we just ordered a few dishes at a time.  We started with the hummus.  So creamy!  The bread came out in a paper bag, fresh from the oven.  We were tempted to just eat this all night as we ordered a second helping!  Luckily, we ordered some veggies after; the brussels sprouts, asparagus and the spicy potatoes.  My favorite were the brussels.  They were shaved so thin and baked to a nice crisp!  They came tossed in a really good vinaigrette and topped with almonds.  Hands down my fav dish of the night.  The asparagus was good too.  The potatoes were just eh.We finished with the flourless chocolate cake.  It was a nice textured cake with a gooey chocolatey inside.  It came with a side of vanilla ice cream and a cooked banana. Delicious!We really wanted to break plates, based on the reviews here... our waiter informed us that it's only on the weekends.   Guess I'll just have to go back!!!"], ["Ada L.", "Came here for dinner on a Saturday night a few weeks ago for an early Mother's Day celebration. Be sure to make reservations, because the place gets pretty crowded.The dishes here are expensive, but luckily I had a gift card to use up. We went crazy and ordered a good number of dishes (all pretty small portions). Some were delicious and some were just okay. The Babaghanoush and Labneh with Feta dips were tasty, and served with freshly baked bread (we asked for a good amount of extra bread).The Tuna Tartare was fresh and delicious, but the portion was so tiny. Probably not worth the price.For some reason, the Clam Flatbread did not taste good at all during dinner, but when we ate the leftovers the next day it was tasty--maybe it was the combination of dishes we ate? I had a bite of the Mushroom Flatbread and didn't taste anything spectacular.We ordered the popular Brussels Sprouts. The flavors were good, but it was way too oily for my taste. They do fry it, so it's not unexpected, but it would've been nice if they drained off the oil more before serving it.The Chicken Tagine was a decent sized portion (unlike most of the other dishes), but there was nothing special about it. It tasted pretty bland to me.Our waiter recommended the Grilled Daurade, which was an excellent dish. The fish was flaky, and the sauce was unique and paired well with the fish.The drinks were average prices for a high end restaurant. I ordered the Spiced Ginger Mojito, which was tasty, but not very strong. Service was okay. The place was busy, and sometimes we had to flag down the waiter, but he did check on us every once in awhile. We were there for almost 2 hours, and we eat fast, so some of the dishes took awhile to come out.As for ambiance, it would've been nice if it wasn't so crowded. The tables are way too close to each other. Someone sitting behind my fiance coughed, and my fiance felt something wet land on his arm--GROSS! I would've given that guy a dirty look, but it was way too dark for him to even notice me. It's not the restaurant's fault that guy couldn't cover his mouth properly, but this just shows how cramped it is in the restaurant. Definitely not an enjoyable and comfortable dinner experience.Cleo was on my list for a long time, and I'm glad I was able to finally try out the food. However, I'm not sure if I would bother coming back for such an expensive meal. We did manage to get really full off of our food, but some dishes were kind of disappointing."], ["Pia A.", "Fantastic place!!! Went here last night and the food was really flavorful. I know it was tapa style food but the servings were pretty decent, good for 2. We ordered the following:Tuna tartare, Great Hanger Steak, Grilled Octopus (which is a MUST try), Bomb Beet Salad, Scallops (amazing flavors this dish had). And to put the final cherry on top, order Sticky Rice Pudding for dessert! Soooooooooo good. Totally going back!"], ["Lynda L.", "Hello again...you never disappoint.Girlfriend had a birthday dinner here so we did the prix fix menu.  Some of my favorites were missing but that's ok, the brussel sprouts made the cut.A+: Brussels sprouts - never fails. ORDER ITA: Beef Kabob - tender and flavorful, went really well with the rice pilaf (although it was a little dry for my taste)  I really like the chili sauce for the meatsA-: Chicken Kabob - it was ok, not too dryA: Sauteed Shrimp - sooo salty, sooo crunchy, sooo goodA: Hummus - bread was fresh and the hummus was rich in flavor, garlic?Hmmmm what a delightful meal, I guess I'll have to wait until March to come back :)  I give them a B on their desserts, cute presentation but nothing memorable."], ["Renata G.", "My last visit left me quite unsatisfied. Nate was my server and when we were seated, even though he was helping the table right next to us and had seen that we were being seated, after he was done helping the other table he was quickly nowhere to be found for 10 minutes. It's not that difficult to pop by and ask for a our drink order or if he was really busy to simply acknowledge that we were there and he'll be right with us.They started adding bellpeppers into their lamb sliders but don't mention it on the menu. Just a heads up for those that have allergies. I hate bellpeppers. Yuck.I think I'm done with Cleo. I suggest others to do the same."], ["Jess C.", "Delicious tapas style. Cute atmosphere and great service. Very dim lighting. Close walk to all the night life on Hollywood blvd."], ["Marisa R.", "Always great food, drinks and service!  Won't be let down!"], ["Ivy W.", "Cleo is so good. If it wasn't so pricey (tapas, ugh), I'd eat here all the time.We came for the DineLA menu to celebrate a \"monthiversary\". We parked around the corner on the street for free and walked over to the Redbury hotel. Reservations were made via OpenTable, so we were quickly seated. I ordered a glass of La Spinetta Moscato d'asti to go with my meal and it was one of the best moscatos I've ever had.DineLA 5-course menu ($30 pp)Spicy Cigars(2) Hummus & TahiniShishito PeppersChopped SaladBrussel Sprouts (suppl. $10)Chicken TagineChicken & Lamb Kebab PlateSticky Toffee PuddingBaklavaThis was easily one of my best DineLA experiences. Everything, I mean EVERYTHING, was delicious and we were stuffed to the max by the end of the meal. There wasn't anything we ordered that we didn't like, and that happens very rarely for us. Our favorites were definitely the Hummus (which came with delicious, freshly baked, gigantic pita bread), Chopped Salad (quinoa, yum!), Brussel Sprouts, and Sticky Toffee Pudding. But honestly, you probably can't go wrong with any of the choices.I only have two tiny complaints. When the bill came, we noticed that there was a 20% gratuity added onto our bill. We asked our server what this was and she said it was for DineLA customers. Nowhere on the menu stated this, so I wasn't too happy about that. I don't mind paying a 20% tip, it's really the principle and assumption that annoys me. Also the fact that our server wasn't that great doesn't help (she took our drink orders 20-minutes after we sat down and in that time took the food orders of parties that sat down AFTER us). The second thing was that no tables, including us, were given the DineLA menu. It was only given to us after we asked for it. In my four years of doing DineLA, I have never seen a participating restaurant \"hide\" their DineLa menu. Ever. Every restaurant up until now has always promoted it. This was very weird to me.Otherwise, our experience at Cleo was perfect. DineLA saved us about $20 but if we went back, we probably wouldn't order everything we had just because it really was too much food for us. Seeing that we'd still be spending around the same price without DineLA, we'll be coming back again very soon!"], ["Carolin M.", "Must go I went there for my birthday and I have been hooked ever since. It's by far the most romantic peaceful, friendly atmosphere, and did I mention there food is amazing. I ordered a few different side dishes- hummas, lanes w feta, Babagnoish, seasonal mushroom, falafel and the list goes on. Yes there small dishes but there so goodI wish I could have there personal chef at my house everyday."], ["Lital L.", "The food was perfect and the service was good. The plates are small so we ordered many dishes, everything we tried was good."], ["Camile C.", "I came here during dineLA. It's elegant but very dark inside, I almost can't recognize the words on menu. Actually it's my first time to try mediterranean food, I don't know if it was because the menu for dineLA was too limited, or it was because I'm not get used to mediterranean food, I almost don't enjoy the meal at all. (＿)I forget the name of the antipasti we ordered, but they were just so-so for me,except the cauliflower with cashew, I never thought of these two kinds of Ingredients can fit in with each other so much, it was just perfect!The bread was tasty.Chopped Salad, well, it was healthy, but it's too sour.For main dish, we ordered chicken tagine and chicken & beef kebab plate,the rice tasted really strange for us, maybe it's because we are get used to Japanese and Chinese rice. And we have sticky toffee pudding and baklavathe for dessert, they were too sweet.The pudding didn't like what I eat all the time, it was a little like honey cake.Maybe it is a good restaurant, but not for me."], ["Sandy K.", "4 1/2 stars. I had dinner reservations for a Friday evening.  Located in a hotel my senses were mesmerized by the aroma of the kitchen.  We were seated asap and my friendly waitress took our beverage drinks. The restaurant is on the small side and the tables are close to each other. I've dined at the Las Vegas location at the SLS and have been wanting to visit this location since I enjoyed the Las Vegas branch so much.After receiving our drinks, I placed our order for our tapas. This is what we ordered-Humus and tahini served with bread baked from the stone oven - very good Greek Salad - beautifully prepared visually and tasty.Brussels sprouts with capers, almonds and vinaigrette - light, flavorful and delicious.Lamb  & Couscous - Not gamey, tender and seasoned perfectly.Grilled Octopus - Celery, potatoes and lemon vinaigrette. The Bomb & so tender!Mussel &Tagine - generous portion and the baby mussels were full of flavor.Apple strudel  - One of the best I've enjoyed - HAPPY ENDING! Overall the food was stellar, service was solid and the interior decor is sexy and full of beautiful people. No wonder this is in the top five of reservations made on open table. BTW, the Pantages theater is nearby and the restaurant would be a perfect dinner spot before going to a play!"], ["misbah s.", "Great mixed drinks, hot waiters, good looking people, good small plates, and eclectic atmosphere all make Cleo a perfect LA dining spot! Unfortunately the protein and most of the dishes is very small so expect to order multiple dishes just to get your normal size plate. Cleo is great for large parties and especially birthday parties. The drink concoctions are great and it kind of reminds me of a 1920s Prohibition era with flapper dresses and a cool vibe. Don't forget to go upstairs to the lounge to have more drinks. This is definitely in LA shindig kind of joint where you're bound to bump into a friend if they live in the area."], ["Rachel D.", "The perfect dinner spot, especially if you are on your way to or from the Pantages. Located in the Redbury at the historic intersection, Hollywood and Vine, Cleo is a charming little haven decorated from floor to ceiling in \"old hollywood chic.\" The tables are closely situated, but the over all vibe is still intimate. The service was amazing. Our waiter as well as the rest of the wait staff was helpful and friendly and provided top notch service from start to finish. They are very mindful of people on time constraints for the Pantages, yet they never made us feel rushed. Winning combination!I came here with a girlfriend of mine for restaurant week, and we could not believe the spread! The tasting menu was only $30, and yet our table was littered with little dishes of deliciousness.Course 1: (We first began with cocktails but I can't remember the names! But they were awesome!)Flat bread and hummus: This fluffy flat bread is served in this cute little brown paper bag and is perfect accompaniment to some of the best hummus ever.spicy potatoes: These were just ok. Something about the spice was lacking to me.Beef Cigars: Adorable! Beef in puff pastry. Think of them like a mediterranean taquito. Served with a very yummy yogurt sauce.Roasted cauliflower: These were outstanding for me. Loved the cashews and pickled onion mixed with the cauliflower. So good!Course 2:cucumber chopped salad: very similar to the chopped salads at persian restaurants. Chopped onion, tomato, cucumber,etc tossed ever so lightly in lemon juice and cumin.  Really enjoyed this salad.Optional 10 dollar upgraded brussel sprout salad: An absolute must!!!! They pull the leaves from the sprouts and flash fry/saute them in something heavenly. OMG one of the best dishes on our table, and that is really saying something!Course 3:Chicken Tagine:Very flavorful and moist chicken. Didn't even need a knife. Served in a cute little dutch oven. The chicken is atop pilaf and served with almonds and olives garnishing the top. If you like a Moroccan flair, this dish is for you!Chicken and beef skewers: very flavorful chicken, but I liked the skirt steak even more. It was marinated in brown sugar, and the skewers are served with this chili sauce on the side. I dug the sweet and hot flavors mixed together.Course 4: Dessert!!!Sticky toffee pudding: Served a la mode with a caramel crispy garnish. I'm not crazy about toffee, but this was an amazing dessert!Baklava with cinnamon ice cream: Need I say more. Some of the best baklava I have had, and the cinnamon ice cream wasn't overwhelming. The hint of cinnamon complimented pastry perfectly. My favorite dessert of the two.Restaurant week or not, run don't walk to Cleo! 4.5 stars!!!!"], ["Neha G.", "Picked this place for dinner based on the Yelp and open table reviews and it did not disappoint us!Food- The portions are small as they mention on the website but perfect based on the price. We ordered - Chicken and shrimp kebab, Pork belly, Brussels sprouts, Seasonal mushroom flatbread, roast lamb and Sticky toffee dessert. I loved every single thing we ordered! Brussels sprouts are a must try! It's different from how you usually get it at other places. They are crispy like chips and mixed with almonds. It tastes amazing! Chicken and shrimp kebabs were juicy and so flavorful, enjoyed every single bite of it! We did not like the Pork belly at all! Sent the whole dish back. It was very soggy and tasted like it's not cooked well at all! The flat bread is very thin, thinner than think crust pizza. It's white sauce based and so good! I recommend it if you like mushrooms.The roast lamb was good, it comes with couscous and tahini as the base! It's so good! I don't like red meat but I ate a few bites of this as it was so good.The dessert OMG! It's a must try! I loved it! Hot toffee cake with cold ice cream! So good! Drinks- There is a list of martinis, beers, wines and other drinks. Not bad for options. Overall- The service was really good; our server was attentive and friendly. Ambience was nice, a little loud but it's because the place was busy. I would definitely go back!Pictures to follow.Cheers and live,laugh and love."], ["Jen Y.", "My fiance and I vacationed in LA a couple of years ago for a week, and I had a little reunion with some high school classmates who happened to be living in the area. One of them suggested Cleo and I'm so glad she did!We ordered some champagne and malbec for the table, and then ordered a bunch of dishes to share. It's been a while but I do remember some really good chicken, AMAZING brussel sprout salad, octopus, hummus, and various flat breads. Everything was absolutely delicious! I think the brussel sprout salad is somewhat one of their famous dish, and even my fiance who's not a fan of vegetables loved it. I found an online recipe which is supposed to imitate the exact dish from the restaurant... I have yet to try out because it's pretty involved and require many different ingredients, but it'll happen... someday!!!Our waitress was very friendly and helpful the entire time, although perhaps that was because my friend's boyfriend was a regular at the restaurant? He lived in the W Hotel right across the street in the Residence section so it was an easy walk. The ambiance was great, a little dark but very romantic and relaxed. The prices were also very reasonable (I thought). The only downside was that it was very loud in there, so it was a little hard to chit chat and catch up with the 6 of us. But all in all, it was a wonderful experience and we will surely go back the next time we are in LA!"], ["Ky S.", "Not even sure where to start with this epic place. First time there and I can't wait to go back. Bread in the bag! Pro tip: get the side of chili and add a spoon or four to your white yogurt dip, makes it 10x better and it's already good. The best thing we ordered which was surprising to me were the lamb sliders. The spicy cigars were delicious as well. The lamb was okay, I've had better. Had the Janapolitan and got it with whiskey instead of vodka and it was awesome! This place can be a little loud, but it's fun with a group."], ["Irina N.", "Food is good quality and tasty. Service is horrible. Wine was served after starters, one of the entrees came 5 minutes after the others were served. Waiter didn't know how to open the wine. Need to speed service. We waited for 30 minutes even if we had a reservation. If you're going to offer a Thanksgiving dinner you need to have the staff ready. No one was is the reception when we left to validate the parking ticket, we validated ourselves. I said I wanted to give a formal complain and the entire team disappeared."], ["Hsu W.", "This place isn't bad and i was gonna give it a 4 star it 5 but then we noticed that this place taxed our tip with our bill, it's not really big deal and not much but it's the principle, the manager came back after we brought this up to him and he shook his head at us and said they been always doing this and never anyone brought this up to them, no sorry or anything and gave the bill back to us.  Food not bad but just had a shady feeling about this place.  He said the tips isn't taxes but clearly it was"], ["Dorothy L.", "First impression... OOO so this place is not a club?  From the outside it looks like a club that hasn't opened.  But I think it's a hotel??  anyways.  The food is so flavorful!! the ambiance is great.  Not too casual, but not too dressy either.  A couple of people on a date or a few friends having a cocktail.  You MUST GET THE OCTOPUS!  and the Brussel sprout dish was amazing! Portion sizes are on the smaller size since it is a tapa style restaurant.  Even better in my opinion!  I love variety.  Our server was friendly and we never had to ask for water.  I loved my first experience here.  I've already recommended to all my coworkers.  :D"], ["Erica J.", "I came here for my birthday this weekend with a bunch of my friends. We loved everything so much. First of all, I ordered this spicy green cucumber drink that was DELICIOUS. I tried my friends' drinks as well and they were all spectacular and tasty. For dinner, we tried the brussel sprouts (yummy crunchy salty yum) the mushrooms (perfect), falafel (simple and great), this fried zuchini thing which all my friends loved the most out of the small plates (it was really savory and unique). We also tried the beef kabob- We finished it in two seconds it was so delicious. we tried the lamb. I love lamb and order it everywhere but this was one of my favorites. we got the ravioli- i didn't try it but my friends said it was perfectly sweet and tasty. Oh yeah the burrata! MMMMM the tomatos and burrata are so good here. we also had a mushroom flatbread which was also a personal favorite. GET THE MUSHROOM FLATBREAD. and try every drink...lol. It was really a great experience, good service, and everything came out perfectly. My friends and I had a great time and i would definitely come again for sure."], ["Carl J.", "Love this place. Superb ambiance in this restaurant at the Redbury Hotel in Hollywood. Excellent Mediterranean tapas style food! Order several dishes, but don't miss the Brussel sprouts, and share at the table! The cocktails are sublime, very experimental and exotic. A fun place with lots of fun people! Highly recommended!"], ["Tara C.", "Not a bad experience however there were hits and misses. Starting with the good stuff : bread that comes with tapas (humus, etc) is awesome. Decent falafel and other middle eastern items. Bad: tuna tartar.  First of all it was literally  2-4 bites depending on how large a mouth you have. Pay close attention to my photo - i put the fork there to show scale. Second it was just not good. Sent it back. Also we ordered shrimp skewers but they never arrived so after finishing eating we just officially cancelled them.Another bad item (maybe it's just my taste but I've had this before at other places and loved it). Sticky pudding. Yuck yuck yuck. Tasted like a bitter / sour/ tart froyo on top ...I thought it was going to bedelicious ice cream.negatory. and the pudding thing itself was gross! I tried 2 bites to make sure my taste buds and ingredient distribution wasn't deceiving me. Yucky and disappointing. A waste of $7.00Ambiance is lovely and the food (overall) is good. But yes the portions are small which makes this place pretty expensive. I can't believe they have the audacity to charge what they do for most of these items."], ["Winnie M.", "love, Love, LOVE their brussels sprouts!!! Absolutely a must if going to Cleo's. It is a beautiful restaurant located within the Redburry Hotel. I came here right before going to the Pantages to watch the Phantom of the Opera on a lovely warm, Tuesday night. Although our reservations were at 6:30p.m., they gladly accommodated to our 30 minute late arrival. The venue is very dim and cosy filled with nicely dressed neighbors, my guess is they are also going to the Pantages after their meal. After Yelp surfing for nearly five minutes, my date and I decided to order the..Brussels Sprouts:($10) This is a must if you come here. I enjoy brussels sprouts, but after 6 or 7, I get sick of it. However, I can probably eat this for a week straight and not get sick of it. The brussels sprouts are coated with a nice acidic vinaigrette and sliced almonds.  Tuna Tartare: ($13) This didn't wow my tastebuds, but it was still enjoyable. If you get it, you get it, if not, you're not missing out on much.Seasonal Mushroom Flatbread: ($14) Sadly, this was my least favorite. Mainly due to the burnt sides. I wasn't sure if the bitter taste of the flatbread was due to the burnt pieces or the veggies on it.Grilled Hanger Steak: ($15) Very juicy, chewy, delicious. This would be my number 2 favorite right after the brussels sprouts. I'd recommend this as well.Evian Water: ($9) Now this... I feel lied to. When our waiter came by, he asked us, \"Would you like house water? Evian or Sparking?\" Now... was he giving us 3 options? Or was he telling us there is only Evian house water or sparking? Well, we decided to pick the Evian not realizing it was $9. So if you don't care much for tap or bottled, I'd suggest you ask for the house water. Service: Loved how quick they were with the food. Immediately after being seated, our server made notice that we were in a rush to make it to the Pantages. She sped the food up and the service and made the night very enjoyable.Price: It is tapas style so just know that you will be eating maybe two to three plates per person, paying nearly $30 or more per person, and not being full. But hey, you really do get what you pay for which is quality.Parking: LA Parking sucks. However, you'll find a few lots that charge from $10-$20."]], "Open Sesame": [["Dylan V.", "GREAT authentic Mediterranean food. Highly, highly, HIGHLY recommend the chicken shwaerma lunch plate, which comes with rice, chicken shwaerma (obviously), a side salad, hummus and pita, all for ~$12 which is a steal for the amount of food you're getting...all of which is delicious, high-quality and well-prepared.I've eaten here quite a while over the last few months, and they've become a go-to for me. The flavor of the garlic sauce combined with the chicken and rice makes me salivate just thinking about it, and I can't even begin to tell you how many times their spicy hummus & pita has served as an appropriate dinner-time appetizer or post-dinner snack late into the evening.I'm not a huge fan of the interior ambiance of this restaurant, which is somewhat intimate and bright (white walls, white tables) on the inside, which confuses my senses and isn't for me. THat being said, I rarely eat in the restaurant, opting to order pickup or delivery instead--you could also opt for outside seating, which in my opinion has a much better vibe, even with the hustle & bustle of Beverly Blvd. in eye and earshot."], ["Bridget B.", "Location: As usual, there is no parking and almost impossible to find any. Ambiance: I thought this place would have nicer ambience, considering its' location, but the seating was not what I expected. It is very small and the outside patio does not match with what the restaurant is. It just seems run down.Service: There were only 2 waiters on a Sunday night so we waited about 20 minutes to order. Our water was only filled once and they were not even that busy. Food: The food was amazing, but not for the price. This place is way too overpriced for the portions that are given. The combo entrée came with \"3 skewers.\" We got 1 Kafta and 2 chicken. It turns out, the chicken skewer is only 3 pieces. That is ridiculous. If you have ever been to a middle eastern restaurant, you know that the chicken skewers are at least 5 pieces.Overall, I would not come here again. The hostess walked past our table every minute holding her iPad and I did not know what she was doing. I don't know if she was trying to look busy or pretending to work, but it made the dinner very awkward. If I were to eat at open sesame, I would eat at their other location in manga man beach that has better ambience."], ["Latisha P.", "Pretty good Mediterranean food. Came with family so got to try a couple of things (=APPETIZERFried Cauliflower (4 stars): Really flavorful. Sauce it comes with goes with it well. DINNERChicken Tawook (4 stars): Tender chicken! Good garlic sauce but I have had better. Wild cucumber pickles were fresh, not too sour. Grilled Tiger Shrimp (3.5 stars): Cooked a little too long...it was a bit chewy. I'm pretty picky on how my seafood is cooked. Lamb Chops (4.5 stars): Really juicy, not chewy at all, they cooked this really well.Spicy hummus (5 stars): Creamy! So good. Open Sesame Salad (4 stars): All of their salads almost sound the same. Not a fan of mint but it was actually pretty good in here. The feta they use is really good. DESSERTPistachio ice cream (3 stars): If you like rosewater ice cream you'll like this. I am not a rosewater fan /= I feel like rosewater just takes over any other flavor, so you don't taste any pistachio really. Ashta ice cream (3.5 stars): Liked this better than the pistachio one. Baklawa (4 stars): Good baklawa, not overly sweet. I'd recommend this for dessert. SERVICEOur waitress was really nice. Everyone who bought out food was great. They forgot to bring out one of our appetizers, but she was sincerely sorry about it so it didn't bother us. ATMOSPHERESat outside so not sure how it is on the inside but it looked small. They have heaters outside but it gets pretty hot since they can't control the temperature on it. PARKINGStreet (meter) parking is limited. Valet is $5.50 and all they do is park it in the back alley )= But had to do it after wasting 10 minutes trying to find street parking. *Don't forget the Yelp check in for a free appetizer (="], ["Priya G.", "My hubby and I came here for a late lunch today and were totally impressed. When you walk in, you feel like you are in another country. It has a great ambiance - dim lighting, good music, beautiful exotic decor. We were seated right away and Skyler was our waitress. She was so attentive and friendly and super bubbly. We really liked her!! The food was so delicious. As a vegetarian, it's often hard to find Mediterranean/middle eastern food that has a good variety. We started with the hummus and it was so flavorful and perfect. I love that they added fresh garbanzo beans in the center with olive oil and sumac. We also had the falafel which were very good - they were moist on the inside and very crispy on the outside and you could taste all of the spices inside. The tahini was very well-made. Finally, we had the zaatar flat bread which was cooked to perfection - not too oily and not too dry. Yum!!!! The price is very affordable as well. They give you a free appetizer with checking in though we would come here without that! Amazing place, amazing service. Can't wait to come again!"], ["Sarina V.", "YUM been wanting to try this place for awhile! Good authentic food!Moroccan iced green mint tea was delicious!If you check-in you get a free appetizer, awesome!Appetizers:Got the watermelon and grilled cheese (3 stars)- I just wanted something light- this was pretty good, middle eastern cheese is def different and I like it! Would maybe try something else though next time.Spicy Hummus (5 stars)- super fresh and also got more with our entrees that was their special house made and oh so good.Entrees:Chicken Tawook (4.5 stars)- really good flavor and tender, garlic sauce that comes with it is amazing (I love sauce & garlic hahaha), rice was good, the salad was amazing with it too. The one I get near my house is still the best, but this one comes really close to it!Chicken Shwarma (5 stars)- Ok usually shwarma is really dry, not this one, this was actually the best I've tasted! They split it in half too and did this with the tawook.Lamb Chops (5 stars)- Really good, tender and simple! My brother loves this!Pita Falafel (3 stars)- My mom said this was better the first time she came too, a little inconsistent :(Tabouleh (4 stars)- It was my mom's second time, she said it was better the first time, but I enjoyed it. Dessert:Of course I really wanted dessert haha. They all looked so interesting and I wanted to try something different and crispy and flakey!K'naafeh (3 stars)- I wish I would've stuck to baklava (one of my favs), says it's a wheat pastry so I was thinking something flaky like baklava, this is more like a cake, the orange blossom with it was good, but this was just waaaaaay too sweet for me, got it with the cheese too. Interesting dessert but next time I'll stick to the baklava. :("], ["Crystal T.", "First of all, everyone was super nice. Second of all, the food was seriously amazing. Thirdly, the decor and ambiance were super cute. This was my favorite restaurant we went to in LA - granted, I was there over Thanksgiving weekend, so we didn't eat out a lot, but it was really nice. It rivals Zaytoons in Brooklyn, my other favorite Mediterranean place. MEDITERRANEAN FOREVER. I took half of my chicken shawarma panini to go since I was so full from our appetizer (Foul M'Damas - IT TASTES AS GOOD AS ITS NAME IS FUNKY), and ate it on my flight home the next morning - it was still amazing and I'm pretty sure everyone around me was like, dang, I wish I had that girl's panini. Yeah."], ["Lynda N.", "More of a 3.5 star rating. The food and ambiance was good but I don't know. Something was missing!I started off with the Yalla Baby Yalla cocktail which was sweet but kind of had a strange after taste. The fried potatoes (appetizer) were good but the bottom of the bowl had so much damn lemon juice that it just totally turned me off. Even with the garlic sauce, I couldn't get over the overwhelming acidity.I had the lamb kebab which was actually really good. The basmati rice was also really nicely made but the salad was also very acidic. Towards the end of the meal, my tongue actually felt really sensitive due to the amount of acid. It kinda felt like it was cut which is why my rating is kinda low. Cut back on the acid please!The environment is nice and the waiters are attentive. Kinda pricy but that was to be expected at a restaurant in this area haha."], ["Javier F.", "Dining Service and food is great... With an exception that the bar really sucks.... So this review and rating is for the bar only. Service there is non-existent. I was there Friday Nov20th around 9:30pm this girl in charge of the bar needs some serious training. You just can't ignore a customer and keep on talking to your friends. Me and my friend were timing to see how long it will take for her to realize that two customers just arrived and leaning on the bar and perhaps want some drinks. The bar is not huge lady...! You can seriously manage if you get the training, specially if I can bring my drinking money to may bars just in one block in any direction from your restaurant.I will go back for the food and invite my friends to a good dinner but for the bar find somewhere else for sure."], ["Andressa W.", "This please is great! The portions are big, the food is very tasty and the price is just right. The staff is very friendly and they can accommodate big parties. They have the best kibi I ever tried, the hummus is amazing, the meat is very tender, the salads are great, the lamb to die for. I could go on listing all the good dishes; therefore, I guess it's safe to say that anything you will order will be great, that is, if you are a Mediterranean food lover like me of course :)"], ["Stephanie B.", "Came here last night for the first time and had a very enjoyable night. We originally had a reservation at 8:00, but at 7:37 I realized we were going to be running late, so I called and asked to push the reservation to 8:30. They said that would be fine. When we arrived at 8:30, we ended up having to wait 30-45 minutes to be seated. They did apologize for overbooking, although if they were going to give our table away I wish they would have just said so so we could rush on over right away instead of saying they would push the reservation and not telling us.That being said, once we sat down, everything went smoothly. We started with the eggplant leaves, haloumi & watermelon, and yogurt dip, which were all delicious. I would definitely recommend trying the haloumi & watermelon, it was different and interesting. For dinner, my companions and I had the chicken shawarma, filet mignon kabob, lamb kabob, and for me a single grilled lamb chop a la carte. Everything was well-seasoned, juicy, and tender. I would definitely come back, but on a Saturday night, be prepared to wait. The wait is worth it, though!"], ["Frank G.", "This was an amazing place. The vegetarian experience is superb, with a fine cross section of vegetables and a good portion of protein, often not found in other restaurants that try (but fail) at meeting the vegetarian's needs. The service was excellent and the decor was beautiful. I would strongly recommend this charming restaurant to anyone interested in a good meal -- and this goes doubly so for vegetarians."], ["Diana G.", "This place is great. Customer service was great, I love the ambiance, the music, very Mediterranean feel to it just as it should be at this place. The food is finger licking as well."], ["Tryphena D.", "One of my favorite foods: Lebanese. That being said, I was excited to try Open Sesame. **THE SETTING**There are 2 locations. One in Long Beach and this one. It's located on Beverly, facing the street. Street/metered parking. It's much smaller than I thought. That wasn't a problem, I just thought it would be bigger. There's an outdoor seating area, when you walk up the steps to the restaurant. **THE SERVICE**My server was waiting on the whole house when I first arrived. More servers arrived a little later. She acted as the bartender and handled all the tables well! **THE DRINKS**I ordered the Sesame Standard. Nice and zesty. Perfect amount of citrus taste, fresh. I recommend it.**THE FOOD**I'd read good things from fellow Yelpers about the lamb here. So, I knew that's what I would try for sure. -Pita bread: nice and soft, good.-Foul M Damas: (Fava and chickpeas, can be eaten as a soup) this came free with my Yelp! check-in. A nice bonus. It was very good. Subtle flavor, good serving size. It came with a vegetable plate that included: cucumbers pickles, radishes, tomatoes and onions. -Lamb Chops: I ordered them medium rare and they did not disappoint! Very good! Also, the price (for the amount and size of lamb you're served) is great. The meal came with rice and two sides and I chose hummus and salad, both good as well. -Dessert: Ashta, or Rose flavored ice cream. Yummy!! Highly recommend! They cater and their food is great, so keep that in mind! I will be dining here again!"], ["Rolando S.", "As always the food here was so so so good, and surprisingly enough the customer service was excellent.  The one in Long Beach has terrible customer service.  Our server tonight was Audrey, she was amazing and really took care of us while always having a smile on her face!  Thank you for an awesome evening!"], ["Linette F.", "First time trying Lebanese food and this I can get used to. I love their outdoor seating, especially on a hot spring night. Their staff was also on point: very kind and attentive.I checked in and got a free appetizer so I tried their GRILLED HALLOUMI CHEESE & WATERMELON. This took me back to when i traveled to Greece. They always had baked cheese with some type of fruit. This was so delicious. THe Halloumi cheese had that savory taste but not too overpowering. It complemented the juicy light flavor of the watermelon!KAFTA- The meat itself wasn't dry and had just enough flavor. I am not a huge fan of lamb, but the meat didn't have that smell at all. So major props to this. CHICKEN TAWOOK- Loved the chicken. So juicy and the garlic sauce on the side was pungent at all. You bite into that chicken and all you get is a mouthwatering tasted of flavors: the bbq taste, the hint of garlic and the springy flavor from the pickles. YUM. FRENCH FRIES- How can I not mention about this? The fries tasted so fresh! It wasn't overly salted and just had the perfect balance of crunch and softness. It was a perfect addition to my baba ghannouj. Thank you Open Sesame for the delicious food!"], ["Gina M.", "Loved it.  I wanted to order everything my first time there.  Now I've been back 3 times - and every time I order something new - it doesn't disappoint.  I especially love their lamb chops, fried cauliflower, babaganoush (I may have misspelled that) and their spicy humus.  I could go on - but then I might as well just cut and paste their whole menu.Don't forget to try their cocktails as well.  Different and very interesting."], ["Nicolas F.", "Been here before with awful service. The food is mediocre and the owner is a complete idiot and extremely rude! DO NOT GO HERE! Plenty of other good restaurants on Beverly. Possibly why it's empty all the time."], ["Danny H.", "Feeling Christmas all aroundAnd I'm tryna' play it coolBut it's hard to focus when I see him walking 'cross the room\"Let It Snow\" is blasting out at...OPEN SESAME! - Ariana Grande (santa tell me)We were here on a late Saturday night after watching a show and they were more than accommodating even before they were closing. There's outdoor seating too if you're in the mood.I like this place a lot. I ordered the filet mignon kabob and she ordered the shredded chicken combo and it comes with a salad and one or two sides. The portions were really big; we definitely had leftovers. The drinks were really tasty and the fried cauliflower appetizer was delicious. The restaurant itself doesn't have much seating but that's true of many restaurants in this part of LA. Would not hesitate to dine here again!!"], ["Paul P.", "Owner should really learn how to treat clients. I will not return based on his customer service etiquette."], ["Bobby C.", "I'm not sure there are enough superlatives to sufficiently praise Open Sesame.So, let's just go thru several positives: Attentive Staff (including the owner), Great drink selection, Music creates a nice vibe, Massive portions, THE FOOD!!!I know that I can't wait to try everything on the menu.Definitely be back again, and again, and...again, etc..."]], "Sultan Chicken": [], "10e Restaurant": [["Ella B.", "I love the ambiance of this restaurant. The interior is pretty, the servers are very attentive. The bar tender pours a big glass of wine when you order seconds- the more the better! :)I've been here twice for Happy Hour- they have such great selection of foods and good wine for a great price! You can find street parking or public parking- it's downtown la so it'll be pretty much the same anywhere you go."], ["Joe P.", "I saw this Middle Eastern place in DTLA that has been open about a year, and I said I want try it.  Plus my pal Maggie C gave it a favorable review, and I trust her reviews.  10e is on W. 7th St, in between Fig & Flower.  They offer small plates, and entrees including kebab and shawarma.  BTW, the name of the restaurant is a play on the owner and chef's name, Tenny.To start, we were provided complimentary puff bread, and a dip w/ spinach & yogurt.  The bread was excellent.  It came out warm and went well w/ the dip:  5 Stars.  For our meal, three of us shared moussaka ($8 - roasted eggplant, garlic & pepper), mussels ($15 - garlic, saffron, thyme, aleppo pepper, za'a'tar & chardonnay), scallops ($16 - cucumber, roasted pepper, radicchio, yogurt), bastuma & quail egg ($9 - cured beef, quail egg on crostini), and sujuk flatbread ($14 - Armenian sausage, egg, cherry tomatoes & basil).  For dessert, we shared a pistachio ice cream.First of all, the moussaka was very good.  It had a nice smoky flavor, and went well w/ the puff bread or crostini:  4 Stars.  Secondarily, the mussels were excellent.  The saffron, garlic & thyme really stood out and made a tasty broth.  It was the best dish of the evening, and was a big portion for the price:  5 Stars.  On the other hand, the scallops were just OK.  The one I bit into was a bit cool in the center, and didn't have as much flavor as the mussels:  3 Stars.  Likewise, the bastuma was just OK too.  I've not had this dish before, and I will likely not have it again.  It wasn't bad, it just didn't do anything for me:  3 Stars.  Our last big dish, the flatbread was really good.  The bread stood up well to the ingredients, and the combo went well together:  4 Stars.  Lastly, the pistachio ice cream was also very good.  It had big flavor, and pistachios on top.  Middle Eastern cuisines do pistachio right!:  4 Stars.Regarding the ambiance, it is very nice.  There is a swanky bar at the rear, the decor is pretty, and there is an upstairs as well:  4 Stars.  The service was very good.  Our waitress knew the menu well, the remainder of the team was attentive, and the food was spaced well:  4 Stars.I am a fan of 10e!  I like it better than other popular places in DTLA like Faith & Flower, Maccheroni Republic, and definitely better than that $hithole, Badmaash.  I'd like to come back on busier night (we were here on a Mon), and check out the bar scene and HH."], ["Philip C.", "Very exquisite dining experience!  The hummus with filet mignon is to die for!  Come during happy hour before 7pm and enjoy their list of other great appetizers and drink specials!"], ["Caroline K.", "Came here for Happy Hour, which runs every day (including weekends) from 3 p.m. to 7 p.m.  I tried going once before, but it turned out they were closed to the public for a private party, which kind of sucked.  It's probably better to call before going during the Holidays since it is a small restaurant.Decor is clean, and the staff is nice.  They have a small selection of specialty cocktails for $7.  We got a few of the dishes on HH, too.  My friend couldn't eat the Falafel, as it had a really strong herb taste.  I'm not sure what the herb is called.  I've had falafel many times before, but theirs had a slightly different taste that was on the strong side for me, too.  I didn't enjoy it as much either.  We also got the Duck Schwarma, which I liked (friend didn't eat duck, but other friends seemed to think it was good), the Kibbeh (average), and Lamajun Flat Bread (can't really recall, but we didn't quite finish it).  Overall, the food was average, though I don't recommend the Falafel.  Maybe other things on their menu are better.  Place wasn't crowded at all, so it's a good stop for HH.  It's not in the entire restaurant, but it includes the seats at the bar and some tables near the bar area."], ["Dafne G.", "Came for dinner on a Saturday night. Absolutely beautiful space. Our waiter, Wil, was awesome and full of recommendations. We were going vegetarian so we had the dolma (made with eggplants yumm), eggplant salad, and za'ahter flatbread. I've never seen za'ahter outside of the very small region where it originates (southeastern Turkey/northern Syria) so I was really excited!! All of the food came out quickly and it was super delicious! I also had the Lebanese petite noir which was really nice. For desert, it had to be baklava! At the end the bill was only $50 for tons of high quality food and a glass of wine. Amazing deal!They also had a live guitar player who was fantastic and set the mood. The lighting was high enough that it didn't feel too romantic or pretentious. Next time, I want to bring a group so we can sample more items!!"], ["Jeff B.", "Great food and drinks, coupled with friendly bartender and owner, equals a place I recommend and will visit again.We sat at the bar and ordered food there. Prices are lower when ordering at the bar. We ordered many different items including the steak tartar. Everything we ordered was delicious, except the sausage was pretty unremarkable.Drinks were strong and flavorful. Put this place on your must visit list."], ["Min Z.", "We had lamb chops (amazing), cauliflower with yogurt (really good) and quail egg on top of cures beef and bread (super mignon). Dessert was baklava bites (delicately done) and they accommodated our request for a scoop of pistachio icecream. Things were on the salty side but the place was super pretty with high ceilings and service was attentive."], ["Clara L.", "popped by for lunchthe space itself is nicethe food and service were lackluster IMOi ordered the lahmajounand when they brought it out, it was cold and flavorless the bread was also soggy and inedible i used the bread they serve prior to the meal because that was actually tastier(and warm!) i've had authentic (piping hot and tasty) lahmajoun that they sell for $1 in east hollywoodso the fact that this cost $15 (and was terrible) was no buenomy friend ordered a chicken kabob dishwhich i thought was 1) dinky for the price 2) not tasty at allthe chicken was flavorless to the point that we had to ask for saltand even then, it wasn't juicy at all he seemed unimpressed we both ended up eating 1/4 of our dishesand i gave my leftovers to a homeless person on the street(i felt bad even giving it to him!)i don't think i'll be back"], ["chris s.", "Love this place!  Food is great! Service was perfect and the place is beautiful.  We know Middle Eastern food (Armenian) and this was prepared perfectly with an extra level of goodness.  The fresh pita was an added bonus. Full bar also if you want a cocktail and no crazy drink prices!"], ["lisa l.", "My sister and I were craving Mediterranean food after a visit to the convention center. We yelped and found this place. They had a pre fixe lunch special for $20 that included an appetizer and entree. There was plenty to choose from. I went with the fattoush chicken salad and dolmeh/Sarma appetizer. It was all tasty,  but the highlight was the pita bread. It was fluffy, warm, and fresh."], ["Anthony N.", "My friends and I went here a couple of weeks ago for Dine LA Happy Hour week. The place is right smack in the middle of DTLA.We had a fairly big party so we waiting for about 10 mins to get table which wasn't too bad.I personally ordered the duck shawarma, basturma & quail egg, dark and stormy, and ginger jake.I liked their food, it was pretty good. The drink were good as well. My friend ordered a different drink and the waiter said they had to substitute a the vodka because they ran out which disappointed my friend-it probably made a difference in the taste of the drink.I'd definitely come back here for happy hour, it's decently priced and good. It's also walking distance from where I work."], ["Farin E.", "Understaffed and unprofessional. We were moved twice and the 3 working all told us a different story. Coworker had an allergic reaction and waiter was unable to give us a rundown of ingredients used. Bartender overcharged me on wine after mentioning Happy Hour and received an apology. Ok. Overall a mess, the location and building is nice but the staff...not so much. Food was a decent, but overpriced. I enjoyed the Brussels sprouts and cucumber."], ["Brandon S.", "It took a while but we finally gave 10e a try. We certainly should have done it sooner. The decor is cool. It has a touch of modern and a touch of classical. The staff was friendly and helpful through out the meal.We started the night with the Htipiti spread. It is made up of fire roasted red bell pepper, feta cheese and thyme. It comes with four pieces of pita to spread on. You get a good amount of the spread. There is more than enough to cover the four pitas.We also tried the Boreg. It is a puff pastry stuffed with feta cheese and kashkaval cheese. You get three of the pastries. They have rich flavors. We enjoyed them quite a lot.For my meal I ordered the beef shawarma. It comes with a side salad, I chose greek. The salad was good. The shawarma also comes with batata harra which is seasoned fried potato wedges. The wedges come with a garlic sauce drizzled over them. They were tasty. The beef was seasoned perfectly. It had all the earthy flavors you expect from Mediterranean food. The shawarma plate is enough food on its own, but I recommend trying some of the mezze."], ["tae k.", "The chicken lule kebab was good.  The hot bread for table is very good and they definitely could have been quicker about refilling the basket.  Maybe I was just impatient because it was so good."], ["Jason L.", "Came here for their DineLA Happy Hour week special and boy did it exceed my expectations! When I first arrived at the restaurant, I had a special request to sit close to a TV to watch the sports games on and Catherine was so kind! She went out of her way to ensure we had the best seat in the house. Throughout the night, she periodically came by our table to check in on us. She was awesome! It did take a little time for the food to come out... That probably has to do with being understaffed.As far as the food goes, I was a big fan of the Duck Schwarma. The sauce on the dish was amazing, definitely left me craving for more. The hummus (with filet mignon) was also fantastic. It came with HOT pita bread that was literally right out of the oven. My only complaint was the falafel. I am not much of a vegan and the dish kind of had a bitter taste to it.Otherwise, I would definitely go back!"], ["Alex D.", "The moment you step into 10e you are transcended into old world NY or maybe Chicago. In reality, of course, it's old world Los Angeles. Yes, LA used to have beautiful wide open spaces which are now being brilliantly utilized for restaurants. As you enter through the wide clear glass doors, you are are greeted by a hostess station. Once past, the dining room opens up onto a vast seating area with a gorgeous bar at the far end and a staircase to the upstairs seating area on your left side. Old world charm with ritz and glamour of Lucille Ball era Hollywood. The restaurant was rather empty on a Monday night visit, but that's bound to be expected. Our waiter was a little bit scattered and not overly attentive, but he did eventually bring us menus, waters and our ordered wines. A Cote du Rhone blend and a Cote du Rhone Blanc. The wine list does feature a lot of Lebanese wine as well as a full bar menu including specialty cocktails. Their mezze had something to entice everyone and so for us we picked a few dishes to sample. Labne, Baba Ghanoush, Dolma, and Spanakopita. The Labne and Baba Ghanoush were as expected. Although the eggplant spread was a bit bland. The Doma was quite disappointing. The rice inside the eggplant, yes, eggplant not a grape leaf, was way overcooked. If it wasn't for the yogurt and pine nuts atop, there would not be much flavor. Albeit the flavor that was there was way too sour and overpowered the whole dish. The Spanakopitas had very nice flaky dough, but the inside had more feta than spinach, which made the whole pastry too heavy.Overall the meal was somewhat mediocre, but I would come back and sample other offerings. Just need to get there a few minutes early to find parking. Perhaps this time I'll go on a weekend and listen to some live music as well."], ["Merrill H.", "Yelp led me to 10e, and I wasn't disappointed. The interior is beautiful and peaceful, a definite contrast from the hustle and bustle of downtown LA's streets. If you are here for lunch (like me) you can order from their lunch prix fixe- a starter and entree for $20. My starter of tabbouleh and salmon salad entree were enough for me and I even ended up with leftovers! A very good deal in terms of quantity, but what about quality? Definitely. I made a gamble on the tabbouleh, as I normally don't like it (too much bulgur or olive oil) but their tabbouleh is bright, crisp, and refreshing. The salmon salad had a full salmon filet with a nice sear and cooked well. Overall, 10e is a bright spot in the downtown LA scene and worth a visit."], ["Thao T.", "Great food but horrible service from a specific server. They have live music, which is nice but it is quite too loud for a small restaurant. Must try the chicken kebob, salmon dish, and brussel sprouts!"], ["Vijay R.", "I came to 10e restaurant for dineLA with my wife and a friend.  We got the humus and roasted eggplant appetizer and it was extremely tangy and delicious.  I ordered the veggie flat bread, and I felt like I was eating a well balance pizza with the Mediterranean twist.  My wife got the veggie felafel salad, and the felafels were very well cooked but not too dry.  My friend got the chicken, and she seemed to enjoy it a lot.  The ambiance was a little fancy and nice, but we just came from walking around the Flower District in t-shirt and shorts.  They still welcomed us and enjoyed our business."], ["Megan R.", "This was hands down the absolute BEST Mediterranean food I've ever had (and I've had a lot). Wow, the service, quality and prices are all right! Also our server Wilbur (tall German guy) treated us like royalty. We had an incredible experience. Will definitely be back!!!!"]], "Beverly Chicken": [["Renata A.", "I'm their customer for a while. Prices are reasonable and food is AWESOME!!! All the dishes are amazing, so I suggest you to try THEM ALL!!! :D Seriously!!!I always order delivery and it's always fast and perfect.I highly recommend them!"], ["Ash D.", "I actually love this place although never been inside.they have a great delivery service.Their food is  really well seasoned and fresh.chicken is tender and my favorite is tabouli with lotsa lemon juice. The lamp chops are great. They have been always on time with their delivery and always so efficient on the phone where you don't have to spend so much time ordering."], ["Lisa L.", "Ordered from them a while back and the food was good so imagine my disappointment with the food last night. Greasy rice, and a couple cubes of my kabob were not cooked. The hummus also had some bitterness to it and extra oil on top. The side salad was delicious. It arrived on time, but I would not do it again. Disappointed."], ["Amanda P.", "Ordered delivery via GrubHub and had problems with our order. We ordered 2 chicken shwarma sandwiches (one without onions and pickles), a side of Greek salad, and a chicken kabob plate. Order was placed around 11:40 a.m.. A couple minutes later I get a call saying they are out of chicken shwarma...umm it's the beginning of the day, how are they out of chicken shwarma? Whatever, we switched it to beef shwarma. I repeated that I wanted one without pickles and onions and one with everything. Additionally, I wanted a couple sides of garlic sauce.Food was delivered on time. However, it was missing salad dressing for the Greek salad, sides of garlic sauce, and both shwarma sandwiches had no onion and no pickles. I had to wait another 30 minutes to get salad dressing for my salad re-delivered.Beef shwarma sandwich tasted okay, but it was small and the meet was dry. I had that and a side salad and wasn't full (and I'm a small girl). Glad that they re-delivered the salad dressing though, so I could actually eat the salad."], ["Kelsey L.", "YUM YUM YUM!!! I ordered delivery while being in LA for an overnight stay, and it did not disappoint! The delivery only took about 30 mins and the food was a spiritedly delicious!"], ["Nicole S.", "so that one star is for the two hours and half of waiting for the delivery!!! and this place is only 5mins away from my place so why is it taking centuries to come? uggghhhhh will probably write a better review when my food comes but until then.... i want my fooooooooddddddddd i haaaateeeeeee thissssss! ugh"], ["Tony H.", "Three words are all that is needed to review this place, damn good food!  I had the combination plate #1. Very tasty. If i want just passing through i would be back!"], ["Penny K.", "Zero stars if I could2 and 1/2 hours later and still no delivery. This after they promised to deliver an extra 45 mins late to begin with. Do not eat here. Do not give people like this your money. Go to zankou or ANY other place that makes similar chicken. The last 3 times in a row I've ordered from them something like this has occurred. The last time they called me an hour after ordering to tell me they were out of chicken. That's right, a place called Beverly Chicken, was out of chicken. This time I ordered earlier thinking that if they at least HAD the chicken things might go ok. NopeThis business is run by morons. Worse still they could care less about their reputation. Hence not even offer in an apology let alone some for of compensation. So fellow foodies, go ahead place your bets, maybe you might actually get your food. Or maybe you might wait 2 1/2 hours and get nothing."], ["John H.", "Great place. Vegetarian plate was exactly what I was looking for. The staff is nice but the owners are even more awesome. Nicest, kindest men. I don't live close but I will definitely be coming back and bringing people. Can't wait to try the rest of the menu. You should  try this place out."], ["Natalia L.", "I ordered around 3:30pm, and I had to wait 55 minutes to receive the order. Once I checked the order, there was a missing item. Immediately I called and the lady told me that the missing item would be delivered in 15 minutes and after 1 hour I am still waiting. Do not order from here. They have poor, poor, poor customer service."], ["TaylorAnne G.", "My original post is below in quotations. However, since then the owner and an employee have reached out regarding the situation. They were very kind and apologetic. Original post: \"I ordered and purchased Beverly Chicken through Eat24. The order was confirmed, but after 2.5 hours it was apparent that they simply just didn't Deliver my order. That was my first and last visit to Beverly Chicken. If you're really hungry I don't recommend gambling with their spotty service.\""], ["Ilgiz D.", "I came today with my friends and have the combination plate it was the best to Kobob ever tasted!!! Highly recommend and their meet its Halal!!!!!!"], ["Jasmine R.", "Food is relish! Customer service is great and one of the best hookahs. Try their mint tea for sure!"], ["Masha B.", "Our new go-to lazy friday delivery place. Very consistent, delicious meat products. We always get the combos. Extra super yum."], ["Elijah S.", "One of my absolute favorite restaurants in Koreatown! Always such a delight. The chicken is the best! My favorites are the combination and sampler plates, since they include a wide variety of all the great tastes this place has to offer. Probably the best Hummus and Tabbouleh I've tried as well. Fresh, and delicious and always really friendly service. My friends and I cannot get enough!"], ["Jen E.", "The owner was nice and gave us complimentary warm and crispy sweet baklava pre-meal. It was delicious. Very appetizing. We got the combination plate for $12.99 each. The chicken was delicious and well seasoned. It had the right tenderness.The beef and lula (ground beef)kabobs were too salty for my taste but they aren't bad. The rice,hummus and salad were okay. The lost of two stars is due to the uninviting interior, and the small parking. I chose to eat at the tables outside. Overall,it was just okay. Will probably come back :)"], ["Eric S.", "I've eaten here now two times. Both times they were out of Shwarma. The staff are friendly and the side hookah part is byob and can be nice. Little pricey but the food is decent. Nice change from other spots in the area."], ["Anne C.", "This is the second time I have had delivery and I just have to say WOW. Very fresh, perfectly flavored, plenty of pita (unlike Gaby's where ya have to beg them to send more than one). Ordered baba ghanoush, tabouleh and the falafel plate. I asked if they would substitute tzatziki instead of tahini sauce with the falafel and they were fine with that.  Excellent food and fast delivery. Love this place!"], ["G B.", "First time trying this/Delivery. I was very pleased. When you are craving Middle Eastern food  this does the job! We ordered Chicken kabob plate,  Combination plate and baba ghanouj...very good! We'll definitely be ordering here again!"], ["Lindsay A.", "Wow i dont even know how to eat the pita i think its called and hummus but omg the combination plate is so delish wow the rice on point! And delivery, wow just wow! And the chicken sandwich love thanks guys!!"], ["Alicia B.", "I really enjoyed Beverly chicken! I had the wrap, while my friends got the combo plates. Both were very delicious. I love their garlic paste and hummus. I just wish my wrap had been well, wrapped better. It was open on both ends and falling apart. But over all I would definitely come back."], ["Rachel V.", "Great, but Inconsistent. On a good night this place is phenomenal, but you never know when you're going to catch them. I'll keep coming back, only when I have spare time/money to gamble with, because about 50% of the time the gamble is totally worth it."], ["Denis K.", "I'd give more stars but seriously, who ever is taking the orders has to be replaced. I asked for 1 2liter diet coke and got two cans of diet coke instead. No excuse for not understanding the metric system its globally known already, even within the mediterranean countries, no?Also last time I ordered via eat24, it took 2 hours and 45 minutes to get to me, seriously forget order much ?"], ["Daniel C.", "Good food!  Had beef kabob and chicken wrap and tasted great.  Order took over an hour for delivery but I believe the driver (delay due to traffic)."], ["Victor C.", "Upgraded. I had a half-day at work yesterday, so I decided to stop by on my way home to hopefully try their rotisserie chicken. Request finally granted.Well I'll be damned. It's not just rotisserie chicken... it's pollo-a-la-brasa!  Given the place is Middle-Eastern owned and run and is attached to a hookah lounge, I wasn't expecting this. But this is great news! Since El Dorado stopped serving pollo-a-la-brasa, the only place semi-close to me that I could satisfy my fix was the original Pollo-A-La-Brasa on Western (where the side dishes, atmosphere and parking all suck)... until now! And they do it right. It was delicious. Mohammad came by my table to check up on me at one point, and asked if I wanted a side of garlic sauce for the chicken. ABSOLUTELY NOT!I did ask for some extra napkins though, and the guy returned with a huge stack of em. Now, I really love this place!"], ["Jason F.", "I hated it. Their chicken was dry, flavorless and definitely not worth the money. Even tho I am close to that location I don't mind driving somewhere else and getting some better quality food."], ["Susana M.", "I've been wanting to try out this place and I'm so glad I did! The only reason why this spot caught my attention was the big sign that says \"Shawarmas\" on it. I went to Dubai on vacation last September and ate Shawarmas for breakfast, lunch and dinner. They were delicious!!!Yesterday I walked into Beverly chicken with my coworker and was greeted by the owner, who was very nice btw! I ordered a beef Shawarma with a big smile on my face and really high expectations!When it was brought to the table, it had a little salad on the side and some hummus.The Shawarma was to die for!!!!! I felt like I was back in the Middle East! The beef was seasoned so well, the garlic sauce was so yummy, and the pita bread it came in was warm and soft and just perfect. The salad was very fresh and tasty, it was great.And the hummus..... I could eat a bucket full of it with a spoon! Sooooooooo good!!!!!!! I can't even describe it. So delicious!!As we were leaving, the owner was kind enough to give us a piece of baklava. It was so good..... My co worker who had never tried it before loved it. Definitely coming back!"], ["Jaz C.", "Absolutely love this place. It never fails to satisfy my late night cravings without any guilt from my diet-fairy. Go for their combination meals! I usually order a lot more than I can eat, because of their minimum order delivery rule. The service was always friendly and satisfactory! Funny story about this place was that I called like 5 minutes before closing time, so the cashier told me that he can't make any delivery orders. I begged him and told him I am really hungry and I can't eat anything else in LA except for your chicken. He chuckled and was nice enough to delivery my food, and I was able to enjoy my hot and delicious kebab and shawarma, as always."], ["Zubin T.", "We ordered delivery.  The food was late but it was good, and the lady running the phone was beyond considerate and communicative when we called and asked for an update."], ["Michelle B.", "Eh, just okay. And I think okay might be an over statement. I tried the Cesar salad, the chicken shawarma sandwich and the combination plate. I'll break this down for you. Combination plate: that did not taste like beef. I'm going to say it had to be the seasoning because I don't even want to imagine eating something other than beef. The rice was actually really good. The rest was okay. Caesar salad: this was my \"if all else fails, eat a salad or if it's great, you have leftovers\" choice. Note for the business- a Cesar salad should never have tomatoes. Ever. Or cucumbers. I didn't order a house salad, I ordered a traditional Cesar salad. How can you mess up the most simple of all salads? Chicken sandwich: definitely the best of the three. I actually ordered beef but they were out. And after trying the beef from the combination platter, I am so glad I got chicken instead! Still nothing spectacular. Literally just the least horrible of the three items. Really fast delivery though. Other than that, I would definitely try somewhere else. This place isn't worth your money."], ["Pamerson O.", "max is a cool guyfixed my order on the housegood food for the neighborhood"], ["Melly V.", "First time here! Ordered the combination plate.... Seriously delicious. I will definitely come back  chicken & meat seasoned to perfection."], ["Jin H.", "I JUST finished chowing down on some delicious chicken.  my buddy and I found this spot last night by virtue of it being the only place standing when I checked \"open now\" on filters.  I was excited to see a mediterranean place so close to my apartment, and open so late!  a healthy alternative instead of drunk food like alpo bell, AND all 5 star reviews?  I had to check it out.we arrived 20 mins prior to close and saw them closing up shop (guess it was a slow night).  not wanting to be those guys, we said not to worry about it, but the man behind the counter told US not to worry about it, he would take care of it. glad he did.  he went around the kitchen plating up our food while his young daughter closed up.the aroma from the boxes made the drive back torturous.  when we finally got home, the chicken was still hot, juicy, and well-seasoned.  the hummus was creamy and delicious - a make it/break it for any mediterranean place; I'm kind of a hummus snob =p  and they also had a homemade garlic sauce for the chicken, but unlike zankou, there was a little horshradish which gave it a great kick!the portions were generous, especially for the price!  so let's recap - friendly family owned business, open late, delicious food, a lot of grub for less than you're used to - that's 5 stars.  with all the variety of LA, I very rarely eat the same thing twice in a week, but I've made it two days in a row...so far.  great place, they've earned themselves a regular!"], ["Christina P.", "This is so far my favorite place for authentic middle eastern food! Anything with the lamb and beef is delicious and I haven't tried a place with better hummus! Limited parking, but it's thereStaff can be slow but their friendless makes up for it :)"], ["Jenna S.", "This is my go to place when I'm in the mood for chicken kabobs. The hummus is great and I like their house dressing a lot, I just wish they would use Greek olives instead of black olives on the Greek salad. Other than that no complaints at all. And they are open til midnight!"], ["Xuan C.", "Beverly Chicken always hits the spot! The food can be a bit inconsistent - the chicken ranges between tender and juicy and a bit harder and drier - but it's nothing some extra sauce can't fix. The servers are always super friendly and helpful, especially that one time when they ran out of chicken! I guess their customers really love their poultry. It's more like fast-food Middle Eastern cuisine in terms of the carbs-to-meat ratio, but that's just fine with me! I'm also consistently impressed with the quality of ingredients - the vegetables are always fresh and crisp and I've never gotten sour hummus. I used delivery service through the RushOrder app once and got really good results. I even got 15% off, which is crazy considering how generously-sized their nicely-priced lunch plates are!! If you order take-out, be sure to buy your designated driver some baklava and coerce them into picking up your food, because that parking lot is a nightmare for a girl who can barely drive a Mario Kart."], ["Sennett L.", "Came in yesterday and got the 1/2 chicken with hummus/rice/salad plate for ~$10. It was pretty good.  Still everything in my previous review, i'd say stays the same but I felt it was worth the bump to 4 stars.  I'd still say, it's a good substitute for western pollo a la brasa on 8th or Zankou if you are in a crunch."], ["George I.", "I had the combination plate and each dish was quite excellent, especially the chicken kabob. Very well seasoned and tender. Probably one of the best chicken kebobs I have had so far. Rice and hummus were both quite good too. Staff was very friendly. They're open late, so that's a plus too.Not much of a parking lot, but it looks like there is a decent amount of street parking nearby. Looking forward to trying more dishes here."], ["James H.", "Wow the food was excellent,  I had ordered the family chicken meal - it came with beans , rice and hummus- I was amazed how juicy the chicken was - great flavors! Oooooh and owner gave us 2 free sodas he said they were on the house, I will definitely be back!"], ["Hanley C.", "I don't live quite close enough to have this place deliver to my house. However, I do sometimes go over to my friends place to watch football on Sundays and his place is within delivery distance. I've tried many items here including the chicken, kabobs, and shawerma. My favorite would probably have to be the chicken. I believe the chicken is completely halal and the couple times I've been at the restaurant to pick up my dinner, the place just smelled fantastic. I really do like the chicken here as I'm a huge fan of rotisserie chicken anyway. The hummus is good, the garlic sauce is good, and it does't make me feel like fat blob after I finish the meal (relatively healthier than fast food burgers, or chinese/thai food, imo). The only knock I have about this place is that the delivery sometimes takes a while (every time i've ordered, the food arrived anywhere between an hour and an hour and fifteen minutes.) It's not a huge problem as the food wasn't ever cold when it arrived, but just make sure you're not super hungry when you order, considering the average delivery time. Been seeing this food app called RushOrder in the area, they're offering 15% off to all customers (not just first timers)."]], "Carousel Restaurant": [["Bachar A.", "Always there on all my trips for Breakfast ,best ever ,no menu ,just ask for what you want .I love it ."], ["Harry D.", "Hands down best Mediterranean resteraunt. For some reason I prefer the Hollywood location over Glendale's.  The waiters were very friendly and service was great! Will be back."], ["Saleh A.", "Some one his name in juck one the service guys he is so bad with his talk and Manner so they also take 18% money for the service of ur price so they are expensive while really order a little food and they charge us 320 dollars ..."], ["Dorothy Y.", "We were highly recommended by our friends to go try their food since we were planning to having a party at home, to our surprise, service was great, excellent food especially their sujouk, grape leaves and kibeh. We end up ordering the catering last night, they were punctual, all of our guests love their food. We highly recommend this restaurant."], ["Peaches A.", "this is one of my favorite places to eat. I love everything about this place from the food to the atmosphere to the staff. If you're looking for good quality food and a good fair price then I would highly recommend this establishment. It's probably one of the best Places to eat in Hollywood."], ["Sandy K.", "Came in for dinner before heading over to the Hollywood Bowl for a summer concert.It was early evening and the restaurant was already quite busy. I lucked out and found parking in the private parking lot.Started out with ice tea since it was so hot. We started off with a order of hummus which was decent tasting. My entree the lamb and Lula kabob combo with Armenian salad and wheat rice. Food overall was solid with the exception that they overcooked the lamb which I requested medium rare!Service was decent and the interior of the place was nothing exciting. I could tell that this place is frequented by regulars which obviously a plus. I'll have to check out the other location in Glendale."], ["Melyssa G.", "Really yummy food. I do prefer an eggplant babaganoush, but their tahini one was still pretty good. They don't serve alcohol, but let us bring in wine without a corkage fee. I wish I lived in the area, so I could go more."], ["Brian G.", "Unless you know what you're looking for and where it's located, you will most likely pass by this East Hollywood location without knowing it existed.  It's tucked in the back of a deep shopping plaza and is currently undergoing renovations so it's even harder to find.  So for now, don't judge Carousel by its appearance since it will not be winning beauty contests.The food was good.  Some items were much better than the others.  For example, the chicken kebab was very tender and juicy.  The lentil soup is quite good and would be an excellent meal in its own right.  However, the prices associated with the quantity and quality of food is out of synch.  I ordered a mixed chicken and lam kebab plate and there were 7-8 small pieces of meat, a small side of rice, and some onions.  On top of that, even though the chicken kebab was cheaper by several bucks and on their suggestion, mixed my lamb and chicken kebab, I was charged the higher lamb kebab price as if I ordered a full plate of lamb kebabs.  I thought that was pretty disingenuous.  Furthermore, we were misinformed not just once, not just twice, but three times what items they were out of on the mixed vegetarian plate.  I mean seriously guys, that's just incompetent.  Just tell us straight the first time so we could have decided to get something else rather than hobbling together a dish with other ingredients that we didn't want.I still give Carousel 3 stars because some of the items I sampled were quite good and deserve credit.  But the price/value equation overall isn't there and our experience wasn't exactly stellar."], ["P K.", "food poisoning alert. my gf is still sick from eating the lamb on friday. she noticed something odd but thought it was justthe seasoning. she missed work for two days, decidedto finally see a doctor.i do not understand these positive reviews."], ["Tiffany C.", "After a long hike to the Hollywood sign, my friends and I were famished.  We needed a good meal.  My friend was craving Mediterranean food, so we ended up here, at Carousel Restaurant.  Honestly, if he hadn't suggested it, I probably would have never stepped into this place.  Maybe the name of the place throws me off.  CAROUSEL Restaurant.  But I'm glad he did, because I had a really good experience here.Everything on the menu sounded tasty.  So of course, when faced with numerous options, I had a hard time choosing.  Thanks to the recommendation of our waitress, I ended on the Yogurt Kebab.  I had never tried anything like it.  Sure I've eaten at Mediterranean restaurants before, but I hadn't been adventurous enough to eat something like this. I'm glad she made this recommendation.They lay a bed of pita chips underneath a layer of yogurt, then the beef kafta.  The yogurt soaks into the pita chips, giving the pita chips much more flavor.  I enjoyed every bite ... that I could finish.  Yes, I'm a weakling.  I couldn't finish the whole plate.  It was a very large plate of food.  I probably finished about half until I was completely stuffed.  And remember I said at the very beginning that I was famished from a hike to the Hollywood sign.Good food and plenty of it for your buck.  Not to mention great service.  This place gets my stamp of approval."], ["Tarik H.", "Best Lebanese restaurant bar none in Los Angeles. On par with its sister restaurant in Glendale, maybe a bit better."], ["Michael M.", "So delicious!!! Kabob is so juicy & tender! They make amazing hot & fresh bread! Everything is scrumptious!!Highly recommended!!"], ["A H.", "I sampled food from all over the world this is one of the worst nothing was right and too expensive for nothing look somewhere else.The meat is barley cooked falafel are dry"], ["Ann K.", "this place is so good and refreshing if your sick and tired of eating the same foods everyday and want something a lil bit different. IF that's the case, this is for you.BE prepared to be stuffed! We ordered the armenian salad *OMG DROOL* I LOVE THIS SALAD. Their cucumbers and tomatoes are so crunchy and fresh and it has just the right tang to it! i can eat this all day.YOU WONT BE DISAPPOINTED. We also ordered the hummus(spicy) and the lentil soup. I don't know why everyone is so gaga over the lentil soup, to me that was the only disappointing factor. Maybe its an aquired taste? AND LAST but not least, we got the chicken kebabs for the main dish. It comes with rice. I posted up a picture. because i feel the picture will do it more justice. The price is very reasonable too. IF you haven't tried this place, GO NOW! you will thank me later."], ["Connie F.", "Been several times and the food is fantastic."], ["Mia S.", "Oh Man!!! I want to give Carousel 10 stars!!! (not just the Yelp 5).My bf & I discovered some stellar reviews about this place, but we still arrived totally open to possible disappointment as in the past, Yelp reviews can be misleading.... Well, may I say that we were BLOWN AWAY by the entire experience last night. I felt like I was eating in a close family friend's grandma's house or something. The food was so perfect and delicious, and the service was impeccable. From Gareen our fantastic server to George the manager and meeting Greg the owner, we felt super welcomed and taken care of. We ordered the Carousel family style for 2 plus the Moussaka. Ahhh-maze. My faves: Moussaka, Fattoush Salad, Kebbeh Nayyeh (steak tartare), and the grape leaves..but everything was so flavorful and fresh.We are definitely going back....OFTEN!!!"], ["Mathew N.", "This is the best Middle Eastern food I've had in Los Angeles.  I was taken here for the first time by a friend who had been living in Saudi Arabia who told me it was the most authentic tasting food.  I wouldn't be able to vouch for how authentic it is but I can tell you it is the most fresh and delicious.  The Glendale location is much more upscale inside, this location has no frills in terms of the location itself.  However, the food is the same and it's delicious."], ["Pauline L.", "We came here for my birthday dinner with a party four gals.  We made reservations and were promptly seated after everyone arrived.  The wait staff was pretty nice and friendly but sometimes lacking when it came to service.  We got a plate of olives, radishes, carrots, cheese and mint, which I'm assuming every table gets complimentary.  I ordered the kebab combo plate (pork and lula beef with rice pilaf), which came with your choice of a salad. I got the salad with the pita chips and it was pretty yummy.  The portion of the combo plate was pretty large and filling, but the tomatoes on the plate tasted like they went bad.  I don't think they were supposed to taste like that cuz I've had Mediterranean food before and the tomatoes definitely never tasted like that!  And it wasn't just me...it was everyone's tomatoes on their plates!  None of us said anything though and now looking back, I regret not saying something about it, especially after the owner came out to greet us and pretty much asked us to give them five stars, assuming that their restaurant deserved it.  It was kind of off-putting.  All in all, the food was good and I like how they have a parking lot (although a bit small, but it's better than not having one).  I also like the firework candle that comes with the slice of birthday cake!  It's pretty awesome!  I just didn't like that the tomatoes were rotten and that the owner automatically assumes that they deserve a five star rating.  In my book, you shouldn't ask for a five star rating when your tomatoes are rotten and when your service is lacking.  A five star restaurant should speak for itself right?  Just sayin'..."], ["Andre B.", "I'm a regular in here; one of the best Armenian restaurants around.  Pretty much everything in here is good"], ["Tom H.", "I've been here half a dozen times before, but I'm writing this review now because I promised the manager (whose name escapes me) that I'd do it about a half dozen visits ago. And I'm going again tonight, with no excuses.Kebabs, hummus, ghanoush and the like can be simple in general, but at Carousel they are luxurious. This Lebanese-Armenian thing is a winner.Great place for groups. I've never had a bad experience regardless of party size, but you may want to call ahead with 5 or more. The family style menu options are a bit pricey, but not for the amount, quality and variety. Try it at least once for a birthday dinner, etc.So,  in summary: great food, service and value.See you there."]], "Ta-eem Grill": [["Mashty S.", "Is the parking bad? Yes, it's horrible, Is the line big....Yes super big.......Typically I take a star or two for those reasons.....but NOT THIS TIME! Because the food is simply the BEST KOSHER FOOD IN LA HANDS DOWN! They get your order right despite being super busy at all time. Food is so delicious that it's hard to explain..........The owner is soooooooooooo lovely, he's just a good human being. So glad to give business to amazing people like him.  G-d bless you!  Keep up the good work."], ["Caroline G.", "Went to this restaurant to get a to-go order... Mind you I tried to CALL In my ToGo order and the line was busy.... Went inside the line was long. Finally made it through the line and placed my order, about 10 minutes in line.. I asked the cashier how long the wait for my order would be roughly, he satiated no more than 10-15 minutes. That is realistic ok. So I wait........ And wait..... While babies are crying and acting crazy, running around, parents yelling! Nuts.30 MINUTES GOES By and STILL NOTHING??? I could I have gone anywhere at this point, so I went to check on the food and how long from now I would have to wait, and they kept saying I'm next, I'm next... No joke I swear ANOTHER 20 MINUTES PASSES!! Finally got my order after 50 minutes for a \"ToGo\" order, and I wasn't alone. People asking for money back, and to cancel orders due to the ridiculous long wait!I honestly this was horrible service, I think if you work in that kind of place that you as an employee should be familiar with the busy weekends and let TOGO orders know that IT WILL TAKE 50MINITES TO GET FOOD! Not ok. Very upset and disappointed!!!!"], ["Eric I.", "The best shawarma in town! Very friendly service.I eat thir at least 2 times a month Nd it's never disappointing."], ["don g.", "I first want to start off by saying that other than frequent patronage at this place I am no other way connected to this establishment, its staff, or the owner. The definition of a good restaurant. They offer large portions at a fair and reasonable price. The food is always fresh and the meat is really good. They don't nickel  and dime you and they offer the best service. I can't say enough about the owner and the staff...this place is a must try. Go in hungry come out full! Check out the picture of my steak frites I got from here"], ["Lilia K.", "This place is kosher we here to calibrated a fried birthday the food is really good and the most important that is kosher the place is loceded in malrose we enjoyed"], ["Dean D.", "This place is the absolute best for Mediterranean located on Melrose blvd. They will have you licking your lips as you enjoy their Mediterranean food. Ta-eem Grill gets busy around 12 ish so prepare yourself. I go here at least once a week. If you are not experienced with Mediterranean food try the shawarma combo in a pita! Comes with fries and drink. You will not be disappointed!"], ["Sean T.", "Went to this place today for lunch. The food was fresh and authentic . They have amazing salads and meats."], ["Phong L.", "This was one of my favorite lunch spots when I worked in West Hollywood!!! The only negative thing about this place is probably the horrible parking on Melrose... it's pretty jammed pack during lunch hours and it's quite the wait as well.... besides that... I would HIGHLY recommend the Chicken Shawarma baguette... the pita version is good too but I just prefer the baguette because it's kinda like a foot long sandwich from Subway type of size.  I think the sandwich is around $11, and please make sure to ask for the RED HOT sauce!!!They renovated their entire storefront a year ago or so, so it's a lot roomier and has a ton more seating now...Anyhow, I definitely miss working in Weho because I haven't made it out there recently!!"], ["Seung Eun C.", "Who cares if this place is kosher???  Everyone should try it b/c they are going to LOVE TA-EEM!!!The food here is Israeli/Mediterranean food.  We're talking kabobs, hummus, falafel, and all the good stuff in between.  The food is fresh, affordable and so so so delicious!!!My favorite is the ground beef platter.  The meat is well seasoned and usually very moist.  I like mine a little more well done and they always accomodate my requests.  My husband's is the chicken shwarma sandwich style.  It's rolled up on a flat bread and you can basically pick any salad or veggies with it.Don't be afraid to come here especially if you're not an orthodox Jew.  It's their not-so secret restaurant anymore.  YOU WILL LOVE IT!!BTW, closed on Saturdays =)"], ["Kevin R.", "My perspective is, perhaps, limited, but I find it hard to take seriously a Middle-Eastern restaurant that doesn't offer tabbouleh salad or who fashions a kebab from ground beef. But that's me.Lunch started with a very pleasant plate of four salads. The babaganoush stood out as did the red cabbage cole slaw. Another big mark on the plus side is their pita which is standout good. The kebab was ground as mentioned, but much a bigger problem was the lack of any character to speak of. The result was more a slider plate, and not terrible sliders, but not what I expected.Staff is to be complimented for the speedy service and frequent check ins. To be sure, nothing was bad, but nothing was that remarkable, save for the pita and babaganoush. Traffic patterns around the cash register make for a somewhat confusing cafeteria experience.Middle eastern food is among my favorites, with Yemenite Israeli cuisine topping the types. I will however, need to keep looking."], ["Alex I.", "It only gets better! Try the pargiot. It's a personal favorite. Every time I want an authentic Mediterranean meal this is my spot by far the best in LA."], ["Lenny K.", "I love the concept here.  The cooked foods are fresh and the value is really good for what you get.  You get a lot of food for your buck.The issue is the flavor.  One, I don't like laffa bread, period.  I've tried it multiple times thinking it was probably just the particular place I was at.  It's not that, I just don't like laffa.  Unfortunately Ta-eem's most popular stuff is Laffa-based so by default I'm not really going to enjoy their signature dishes.Last time I was here I got the platter which was loaded and they gave me like 3 sides to go with it.  It was all delicious and the pita they gave me instead worked out much better.  But one more knock, they have the blandest tahini I've ever had.  It was so bland it actually took AWAY from the flavor of other foods.  I'm not sure how that's possible so I just avoid it from here.  Nothing else had a super WOW factor when it came to flavor.  Value wise, you definitely get a great deal here.  I won't mind coming back but the laffa and tahini are things I'm definitely avoiding."], ["Andrea C.", "I cannot say enough about this restaurant. Their food is unparalleled in taste and especially in freshness. I recently brought my dad, as he is the Israeli food expert, and he said \"Wow, this reminds me of the stuff I ate while walking the streets of Jerusalem.\" Also, their portions are hefty and definitely meant to be shared, unless you're getting a wrap. Check this place out. You will not be disappointed. Considered yourself warned, however. Their lines on Sunday nights are extremely long. But other than that, the place definitely deserves five stars."], ["Izza K.", "I shared the kabob plate and chicken shawarma with my friends. Both meat were succulent but I felt that they could have been seasoned a little more. They do serve condiments and a plate of pickled vegetables that consists of carrots, beets and purple cabbage. It's a decent place though and has a very homey feeling. Customer service is good! You pay at the counter for food that really saves the hassle of paying the bill if you're with a large party."], ["Pers S.", "I understand why some people have rated this restaurant 4 or 5 stars, but I won't.The place is noisy, not exactly clean or pretty and somehow disorganized. You will order with the register and get a number and then you wait until your number is literally yelled (an LCD display will help).I ordered the steak and chose sides myself, the meat turned out to be very bland, tasted like they prepared it with no salt or spices. I guess you can make it up by choosing certain sauces and side items but I wasn't familiar with the sides and what I ordered didn't help much. It helps if they display the name and ingredients of many sides and sauces they offer. The meat quality was very good and so was the Greek Salad-looking side item. This is more like a fast food setting."], ["Atira S.", "Pretty expensive for average food! 2 chicken shawarmas came to $24! It's a little tucked away restaurant on Melrose Ave. Upon entering, you are greeted with the chaotic kitchen. You have to walk past the busy kitchen to order. We ordered 2 chicken shawarmas; the chicken was bland but the hummus was great! The sabich was pretty good, but the falafel balls weren't good. Portions are hugeeeee!!! So be prepared to share! Only reason I gave this place 4 stars was because of the service!! The servers were helpful and polite. They seem very close and all work together well! Amazing service."], ["Diane R.", "Best Israeli food outside of Israel. Actually, this place feels like any alley way kitchen in Israel and used to look like one before they renovated. Come in for juicy, crispy, well seasoned shwarma and pair it with mayo filled Israeli salad - your choice of beets, corn and mushroom, babaganoosh, tumeric carrots, and more.Eat your food with pita and amba (mango sauce) for the full experience!!"], ["Anthony A.", "I feel compelled to write a review, I am impressed!! I ordered the chicken shawarma on a baguette and it was amazing, especially with the garlic sauce, my friend had the plate, if you order the plate they bombard you with salads, portions are great, everything was delicious ( I was stuffed, yet I felt like ordering another one, feel like i might just have a problem ) chicken was off the hook!!! Atmosphere is casual and the customer service was on point, I saw a fly or two, but no fly was going keep from devouring my sandwich or keep me from coming back"], ["Michael A.", "Love Taeem! Especially since the remodel and expansion. Went back twice last week. Got the merguez on baguette then a baguette plate with all the fixings and the beef kabobAll of it tastes superb! Will return as often as possible even though it's in my old neighborhood, which I hate"], ["Anthony S.", "Food was tasteless , being fromMontreal were the capital of shawarma. The chicken used on the rotating slab was fatty and low quality. Fries were cold and tasted like paper. Hummus had the consistency of tahini and not hummus . Placed was packed and happy i tried it but would not go back. $33 for a meal that wasn't amazing. Better shawarma places exist in the city at half the price. The average Americanized customer are probably very happy. Not for a trained pallet."]], "LA Skewers": [], "Al Wazir Chicken": [["Juan M.", "My buddy and I came in for lunch. I'm so glad we did. I ordered the beef kabob combo. It comes with 2 kabobs consisting of 5 chunks of tender,juicy and seasond to perfection beef along with rice,salad and the most amazing hummus ever! As an appetizer I recommend the baba ganoush with fresh hot pita it's delicious. I can't wait to come here again!"], ["Jasmine L.", "A generous 3 stars. The pita was crisp and dry (how long was it out for?). Wanted the chicken shawami but it would be ready for 40 minutes.  Really???  That's a main entree.  Their isn't that much variety so how can u run out?  Settled for the beef which was dry and bland. Everything was bland here. I've had much better (for a cheaper price too).  Go here if u r super hungry otherwise it's a place to skip."], ["Henrique R.", "Never get tired of this food.Great portions per plate.Healthy eating. Can't beat that!Convenient parking too..."], ["Amber M.", "I love this place to death. And they deliver all the way to Los Feliz. Shawarma or chicken shawarma plate is the way to go. Yummy garlicky hummus. Always go for extra tahini and garlic sauce. Obsessed. Avoid their bathroom though!"], ["Laura S.", "How lucky are we they had fresh baklava tonight! Mmm didn't wanna stop eating it to write this review but thought they served some props for the explosion in my mouth  all the food is good just a matter of preference on meat choice. Do et!"], ["Art K.", "I workout at the gym down the street and I found this gem a few days ago heading for 711 staff is very friendly talkative and will go out of their way for customers I'm sitting here waiting for my very fresh and tasty chicken breast plate they are getting ready to close and I'm watching staff scrub down everything not only do they have great food at fair if not dirt cheap prices but they are cleaning like Cinderella did when her evil step mother and sisters had her scrubbing the floors this place is awesome !!!"], ["Eric G.", "Awesome chicken and garlic sauceAt a time the chains are throwing underage miniature chickens at the poor consumer, its nice to order a half chicken and get a bird worthy of a Thanksgiving Dinner.Never been disappointed. The kabobs, shawerma and falafel are all good"], ["Helen D.", "Really good food. They give you plenty for cheap. Seems a lot of locals go here... Well, everything is freshly made and tastes like home. If my home was in the Middle East. Absolutely delicious. It was the closest find from the museum of death, so we walked there."], ["Nick B.", "The best lunch in LA... hands down.  There's a reason why they've had the same menu for 12 years.  There's not a better way to spend $10 on food.  Perfect everytime.  The #4 (chicken kabob) is the sure fire thing...  You can't go wrong with any of their meats on sticks...."], ["David H.", "Great food. Prompt quick friendly service. Would come again for a lunch or some healthy dinner."], ["Major H.", "Very friendly shawarma place that's above average and very reasonably priced. Tasty chicken! The only problem is the filthy parking lot at this mini-mall, which is constantly full of trash and homeless vagrants asking for money. The mini-mall owner needs to do his tenants a favor clean this place up."], ["Ryan G.", "Fast, simple, and tasty. Can't ask for much more. I ordered the Chicken Shawerma and it came with a huge plate of shredded chicken, rice, and hummus as well as a side plate of 2 pita pockets....for 9 bucks. Hard to beat"], ["Angel H.", "Food is great. Canned sodas are a bit pricey though. Parking is decent and the place is clean although a bit small but that's OK.  Probably the best Chk Shawerma in Hollywood. I've tried most the spots."], ["Michael P.", "This little place is great.  It serves up some of the best grilled meat I have had in L.A.  I won't wait in line at Zankou Chicken on Sunset anymore.  This little gem is better."], ["Eric D.", "Pretty good food. Their tap water container was a little soapy. Not bad for the price."], ["Raena T.", "Love this place, its so convenient to order delivery, and meal is fresh and tasty, even girls who care about waist can find amazing chicken salad, without dressing its exactly what gym person needs. Thanks guys for your business!"], ["Connie L.", "delish and close to where i work"], ["Connor T.", "Al-Wazir is my go-to takeout spot in Hollywood. I call in my orders in advance and the food is always available when they say it will be ready, typically 10 minutes or less. I recommend the veggie plate and any combination of half or whole roasted chicken. The baba ganoush and garlic sauce are the stars. Reliably delicious."], ["Noneya L.", "Wtf this place would not let me use  the restroom even if I purchased a soda.  Don't go to this place. Rude! I just watched Book of Mormon and my sister was picking me  and mom here and the bi!$@tch at the counter said I had to buy a plate of food. Selfish people.UPDATE: I just got a email/note message from Raffi \"ZEN\" A.   He stated that I had issues.  My answer yes! It is called having my period! Dicks won't understand. I am girl, I was bleeding!"], ["Sally E.", "I was watching a play nearby and walked over to this plaza. Being Middle Eastern, I'm ALWAYS down to eat mediterranean.Al Wazir did not disappoint! It reminded me a lot of a smaller Zankou Chicken, which I love. The guy working recommended the chicken shawerma that come with a bunch of sides, as well as bread. It honestly did not disappoint. Everything was well seasoned and moist and pretty inexpensive. My only complaint is that the pita is definitely bought in bulk from the arabic store and was pretty dry. That aside, everything else was delicious! I won't go out of my way to come back but I would eat here again if I'm in the area."]], "Papa Cristo's": [], "Sevan Garden Kebab House": [["Art M.", "There's nothing like a warm and tasty plate of Manti for lunch.The dish resembles a micro tortellini, each laid out open in a honeycomb formation filled with seasoned meat. It comes with a garlic yogurt seasoning which is to be liberally applied and savored.If you've never had it, most definitely stop by and try. If you enjoyed manti growing up like I did, the folks here make it just like nana did, it's pretty damn good."], ["Stuart K.", "We had eaten here before and enjoyed it.  Yesterday was a different experience.  The hummus tasted like Trader Joes and the salad was plain"], ["Nasos P.", "Great food. Maybe the best spot for doner/gyro. And the location makes you feel like you have walked in an alley somewhere in the middle east (exaggerating a bit).It's neither fancy nor trendy, but simply GOOD!"], ["Jason C.", "If you are downtown during the day and walking around wondering where you can stop, cool down, rest, eat and zen out in crazy downtown LA, this is the place. This place is hard to find (even with google maps), probably why it feels so peaceful. Essentially this place sits in an ally between Spring and Main, and the entrance to the alley is on the north side of 7th st. Sevan's sit at the end of the ally and with the neighboring parking lot it crates a nice wind tunnel effect results in a nice welcoming breeze on a hot day if you choose to sit outside under their umbrellas. They serve your typical Mediterranean/Greek menu. I always get their gyro plate, which comes with a huge plate of gyro meet, rice, salad and all the pita you want to eat. The gyro meat is very delicious, well seasoned, and juicy (unlike most gyro stands). Their rice is cooked to perfection, well seasoned, and complements everything well or awesome by itself. The salad (greens, not crappy ice berg salad) deliciously tossed with a light balsamic vinaigrette sauce, it is cooled and very refreshing (especially on a hot day). The pita bread does taste like it is fresh, but not bad and there is plenty of it. Hummus is hummus (nothing special there). Do ask for the their special yogurt dipping sauce, it is really delicious. All in all for the price and the amount/quality/taste this is an awesome deal! Their lamb was not bad. Fish was delicious good but I am not a big fan of grilled fish... jut no special flavor there. Gyro plate is the way to go. We have been to Sevan's a few times now and every time we leave, we leave super satisfied."], ["Mercedes P.", "My boyfriend and I checked out this place a few weeks ago and absolutely loved it. We both ordered the beef Gyros which were really tasty and enjoyed the salad, hummus, pita bread and french fries that also came with the meal. The price of the meal was also very affordable and the service was great.Because everything on the menu sounded so good, we ordered the Manti (mediterranean ravioli) To-Go; this was delicious as well!Overall, we were very satisfied and will be coming back to this nice little restaurant.P.S. For those of you planning to check it out, this place is NOT on Broadway as the address says and other Yelpers have mentioned. It's in St. Vincents Court yelp.com/biz/st-vincent-… which is on an alley parallel to Broadway that you can access through 7th St."], ["Cheri A.", "I stumbled across this place on my walk today.  The alley it is in reminds be a some of the cobblestone alleys in Paris.It was a difficult decision which place to try but we opted for Sevan Garden.  The server (but could have been the owner) was very friendly and greeted us outside to tell us about his menu and what he recommended.I ordered their Greek salad and my husband ordered the number 5 which was spicy beef.  My husbands side salad arrived along with some pita and hummus.  Both were very good.  Actually, I though that salad was mine and was thinking wow I thought it had more to it.  It DID!Shortly our food arrived and I had a HUGE salad with feta, tomatos, cumcumbers, olives...really really good.My husbands beef thing he told me it was very good and NOT overcooked like a lot of places tend to do.  I would definitely recommend checking this place out....IF you can find it."], ["Tony M.", "I liked it, good flavor."], ["Brett M.", "I can't get enough of Sevan Garden's lule kebabs.   Great stuff.But I'm adding this review to help other readers find the place.  The address is 621 St. Vincent Court (not S. Broadway).  St. Vincent Court is like a cul de sac alley between Broadway and Hill.  Enter from 7th Street.  Now stop walking in circles."], ["Kristin M.", "Food is four stars, but the fact that they allow smoking on their patio reduces the rating to three stars. And by smoking, I mean a couple cigars to the right of me, a constant cloud of cigarette smoke billowing behind me...Eat here if you like your kabobs smoked!"], ["Takis K.", "i dont think ill be coming back to this place for a while.my last time there they seated a group of four men in the  table next to  me.. all of whom were smoking cigarettes and being pretty disgusting, spitting and whatnot. i understand this is an outdoor area but this shouldnt be allowed.if they allow this type of behavior from their diners, whats going on in the kitchen?"], ["Nicole H.", "Food was okay yet way overpriced. My fiancé ordered the gyro wrap which was dry gyro meat in a tortilla-why not pita?! Very confusing. Best part about what we ordered was the tzatziki sauce on the side."], ["Luke R.", "This place was hard to find at first. The address is wrong, which another Yelper pointed out, but I didn't see that review until after I walked around for a while. It is at the very end of the St. Vincent Court. The downside is that as you pass a restaurant, someone asks you to come on in. So you have to say no to 3-4 ladies before getting to Sevan. Plus, the area looks like a scene out of crime movie where older Armenian and Russian dudes are sitting outside smoking, working out who will control what areas of town. Everyone sort of stares at you as you walk by.Me and three co-workers ate here for lunch. We each got something different. I had the Lule kabobs, someone else had a gyro sandwich, one guy had a gyro plate and I don't remember what dude number four had. But the consensus was clear - the food was very good. One other thing I would change would be to have someone outside waiting for customers. We walked in and couldn't find an employee at first. And it is a deceptively large place. I didn't see a hostess stand, cash register, or employee after walking to the rear of the restaurant. Eventually a waitress saw us and showed us to a seat.All-in-all, I really liked the food and the atmosphere. I'll be heading back soon."], ["tom c.", "I came here last Saturday (04/16/2011) and was just looking for a place to eat and we saw this little alleyway that had all these restaurants. We decided to check this place out b/c they had a tv and were watching soccer. Anyway, the food is amazing.  Best kabobs i ever had. The rice was amazing.  I really recommend the DONER plate."], ["Annie P.", "Fresh, fast and delicious!I ordered the dolma plate (Thursdays only) and got salad and yogurt on the side. Great yogurt! Also ordered the sampler appetizer which was a bit small but fresh and tasty just the same.Extra bonus points for being really quick on delivery through Grubhub.com."], ["Grace K.", "*This review is for delivery.FOOD: 4 StarsI just had their kadana kabob and it was really tasty. I liked that it had some spice to it. Their rice was also good. Different from the Persian basmati rice, but def tasty. SERVICE: 3.5 StarsThey were good. Nothing over the top. Although it did turn me off that when i asked for an updated price on 3 items, they said to check yelp because somebody posted prices there. -1 for attempted laziness. +0.5 for giving in and actually giving me the price.  PRICE: 4.5 StarsGreat food for a great price. The price is about average compared to other persian/mediterranean food places.. It might even be like a dollar cheaper."], ["Kevin Y.", "If I didn't live so far from LA, I would probably be up there all the time trying to find gems like Sevan Garden. The place is tucked away in the jewelry district of downtown like a mediterranean food oasis along with four or five other restaurants and cafes.Everything on the menu looked so good that Fiancee and I wanted to try everything. The server was nice enough to let us mix and match combos (even though that wasn't an option on the menu) so we could sample a little bit of everything because we are gluttonous slobs.Before the main event, we got pita and hummus. The hummus was nice and creamy without being heavy, and the pita was thin (I don't like when the bread is too thick). When you bite into the pita, you get the usual softness, but you get a little crispiness at the end that tells you it's really fresh. The salad that came with the combo was very simple, but very light and refreshing - more so than other places that drown their salads in dressing.In all, we tried the doner, lule kebab, chicken kebab, and shish kebab. Again, a half order of each. On suggestions from other reviews, we also tried the bulgur rice with one of our combos. The doner is the best I've ever had. Some might think it's a little salty, but when it's sliced so thin the way it was, the crispy meaty crust you get combines perfectly with the savoriness. The lule reminded me of a spicy version of beef koobideh. Usually when places serve koobideh, there's so much of it, one can easily get flavor fatigue, but with the lule kebab, the spiciness adds another layer of flavor, which I really liked.The chicken was surprisingly moist and had decent flavor. The shish kebab was also nice and moist. Only the last piece at the end was a little dry, but I think that can be forgiven considering that 99% of the meat on that plate was spot on. Also, you should try the bulgur rice. I don't even think it's really rice. It looks like couscous, but it's 10 times better than the rice.The service was very friendly and helpful and the prices aren't bad. For two combos with four kinds of meat, salad, rice, hummus, and pita bread it came out to about $25 with tip. Not too bad for a belly filling excursion. If your wallet has just been depleted by some expensive jewelry, go here and cheer yourself up."], ["M M.", "My husband and I went to the jewelry district this Saturday and decided to give Sevan a try. The location happened to be very close to our jewelers place in a cute alley like scene with several other restaurants.  Sevan is the restaurant at the very end of the alley.Everyone was very attentive and before our meal came they brought out a fresh salad and pita bread with humus for us to share.  I ordered the Shish Kebab plate (Pieces of tender filet mignon, marinated in our al sauce and BBQ to perfection). My plate came with a choice of fries, rice or bulgur and a salad (I like that they had the healthier option of bulgur as a side).  My husband ordered Iskender (Thinly sliced pide bread topped with our famous doner kebab (gyros) served with tomato sauce and plain yogurt in a special dish). Everything was fresh and cooked to perfection.We will DEFINATELY eat here again next time we are in Los Angeles."], ["Michelle P.", "I am a flexatarian and usually don't crave meat but I couldn't resist the Lule kebab! The meat melted in my mouth which left me wondering if it could possibly be something other than beef.I also had there vegetarian bean plate it was tasty. Love the secret entrance most def returning when I am in the neighborhood!The patio was very European kind of like the cute bistros in Paris."], ["Jackie D.", "DEELISHH!!!Come here for authentic Middle Eastern food. Just to get to the point: Order to Kuffteh that is so moist and oozing with butter, the mante that is pretty close to homemade that I have found anywhere in LA ( its a lamb/beef dumpling served with garlic yogurt dipping sauce and tomato soup dip) and a great bulgar pilaf. The prices are reasonable and the alley they are located in is pretty cute. Looks like disneyland almost. A little hidden lunch spot in downtown with  great outdoor seating."], ["James E.", "Amazing Turkish food, this is classic Turkish comfort food. Watch out for the peppers they are hot The meat and chicken kabob are done perfect, ask for bulgur ( kinda rice but ohh so much better). The Doner is not gyros, it's beef and is done very well. You can opt out for the saucy and vein clogging Iskender, which is a layer of pita bread, doner over it, with tomato sauce and hot melted butter drizzled on top. The lentil soup is as good as it gets and has a homemade flavor. The service is great and the servers know the food well, ask before you indulge Did I mention to be careful with the peppers :-)Gotta love it"]], "Meze": [], "Shekarchi Restaurant": [["Nassim K.", "I had great food here. I was missing a home cooked meal and had the gheimeh and it was amazing. It tasted just like my moms cooking! I hope the new hours stay extended for dinner. I will always get food from here."], ["Mark A.", "For a hidden place in DTLA, It was fine. I break my ratings down into 1. service 2. cleanliness 3. food quality and taste 4. value and 5. dining experience/would I recommendThe service was ok. Got seated but waited a bit long for service given it was not busy. After I was done I waited way too long for my bill so I got up and went and asked for it.the place was ok clean for a place like this. Meaning it is casual. The food was tasty. I had lamb, salad and rice. Again food was Ok, lamb was over done versus my request.The total meal was a bit much for lunch.Overall I didn't hate it. I would consider going back if it was one of my only options"], ["Hart A.", "It takes long to cook because when it comes to your table it will love you long time! Haha! Cooked perfectly, beef kebab, chicken kebab and lule kebab. Great service too!!!"], ["Fabian A.", "Understated restaurant incredible lamb shank, cherry rice, kebabs and salmon. It's the real deal around downtown LA. Highly recommended!"], ["Betul E.", "I have just left this place and it was awesome! First of all, when you get in, you come across a very nice environment with nice background music. The service was very good, too. Everybody was very nice. And the food. That was as good as everything else about it. I had white boneless chicken and lemonade and liked both. Recommended!"], ["Maysah F.", "Really good persian food. Close to where I work and they walked the food out to me so I can pick up from my car. Great service will definitely come here again :)"], ["Jonathan T.", "If you like kabobs,  this is a must stop place to have it, nice and clean,  great service,  if you like lamb,  try the lamb shank with sauce or the lamb kabob,  chicken and beef are fantastic of course,  and don't forget to order some of the appetizers.  I love the long rice that come with the kabobs.  There is nothing negative about this place except that they don't open on Sunday."], ["Angelina R.", "Amazing food! Beef Koobideh is the best !"], ["Kristopher P.", "I've tried almost every Persian restaurant spanning from Malibu to Glendale and over to Santa Monica. . . and Shekarchi is one of the better ones.  The quality of meat is the star of their show and it really shows.  The problem with most Kebob Restaurants is that they either buy pre-seasoned / pre-blended meats or lower quality cuts and the flavor is always off.  The second you have a bite of their Koobideh, you know that they are not abiding by those principles.  The flavor is fantastic... keep it up!"], ["Amanda A.", "Love the food here. They are my local and friends. And w the remodel there's an outdoor for my pup too!! Plus plus plus!!"], ["sasa l.", "I love this place!!! My friend took me there for the first time and i had their lamb shank with some kind of rice that had special herbs and lima bean. It was good. The service was great maybe because my friend was a usual customer. He order the chicken kabob and it was delish too!!! Will definitely go back!"], ["Robert D.", "This place is great! Great service and very clean! Best Mediterranean/ Persian food in DTLA!"], ["Ellie M.", "The food is good and one of the only decent places to eat in DTLA.  But I'm giving them a 1 star because their service is absolutely horrifyingly bad! I found this place as I work in downtown and first couple times was pretty good food but OK service.  My clients and colleagues love Persian food and so I figured,  I will take them here for lunch.  What a big mistake! Be aware as they often they to over charge you on the bill! I'm not sure how many times this has happened before as I don't scrutinize my bill when I'm out with professionals,  but fortunately I caught on the last couple times and I couldn't believe it! When I called to tell the manager,  his response was \"mistakes happen.\" no apologies! I can understand 1 mistake,  but anything more than that,  not acceptable Decent food but lowsy service.  You guys should decide if it's worth it.."], ["Marcus R.", "This is a great place to enjoy some friends and some drinks... Fabulous view and the staff is marvelous... By the way, if u like, BYOB... Love this place.."], ["Ivan A.", "This place is amazing - i love the tadig and kabob. Their service was really great, we were greeted and seat immediately. Atmosphere is nice, very calm, and peaceful to dine in. Great food! Ali the owner is super cool and hospitable and I Highly recommend this place for first timers and other non Middle Easteners who want to try incredible persian cuisine."], ["Omar L.", "This place never disappoints bar none!  If your in the mode for middle Eastern food this is the pace to be .....Ali is the best and Ali treats u like family and makes you feel like you are at home.   Come down and see for  yourself."], ["Ali B.", "I have to start with the things that could be much better; the rice, the salad, customer service and the parking!Rice is usually the main part of the main dish in Persian cuisine. Tall and soft flavored whit rice with saffron (or herbs) is what comes to mind when talking about Persian food. Unfortunately we didn't experience this in our Rainbow Trout order with herb rice! Besides, the odor from the rice made it a not very pleasant dish for me and my wife. Besides, the salad was well below standards. \"Salad shirazi\" is associated with Shiraz (a city in Iran and far from France) is supposed to have onion and must come with lemon juice. My salad shirazi came with 'a lot' of french dressing and had no onion in it! Customer service was OK. However, I wasn't expecting them to charge me for the second salad when I asked them to change it because of excessive french dressing. Also, the parking beside the restaurant gets validated but you still need to pay $4 for one hour stay. Considering the food price, the service and environment, this seems to be a little too much.Having said all these, the fish was marinated and pan fried to perfection and tasted fine. I would have given them a second try if it was not for the parking and not so welcoming service."], ["Parmiss D.", "It's not easy to find a Persian restaurant in down town LA. This place is not only \"a\" Persian restaurant but it's a realllllllly good one. Delicious food, amazing atmosphere and very kind and polite staff. I ordered my food to go and while i was waiting the waiter offered a drink on the house. Totally recommend this place and will be coming back for sure."], ["raquel g.", "Great place to eat . Came here with boyfriend and friends and all of our dishes were great . Service was great really nice manager of restaurant. Will definitely be back"], ["Manija H.", "Shopping in downtown la we wanted to stop and have some Persian food, so glad we did. We had the ground beef, chicken, and beef stew. Everything was really good. The service was exceptional. The owner was such a gentleman. I will stop here next time I'm in la."]], "California Kabob Kitchen": [["Denise W.", "Overpriced!. A can of coke for $5.00??? I ordered the lamb shank. It was pretty small for the $32.00 price tag. My son found a sheet metal screw in his Caesar salad!!! I have seen bugs and hair but NEVER a screw!!!  I'm sorry doesn't cut it for that kind of mistake. There are SO much better kabob places that are much more reasonable. Don't get screwed. Save your money and find somewhere else."], ["Sophia P.", "Wow. This place is great. I ordered hummus and the veggie kabob salad with chicken added to it. The delivery showed up pretty fast and the food was delicious. Definitely ordering from here again."], ["Marie J.", "I need to start this off by saying the customer service at this place is absolutely top notch.  We were the only people dining in at that time of night but since it was so close to closing time, I appreciated the fact that they paid close attention to us rather than focusing on cleaning up and cutting out. The lamb shank was very good, the shirazi salad was pretty tasty as was the polo rice (green beans, tomato, meat...) and yogurt sauce.  However my California chicken was dry.  I usually avoid breast meat kabobs because of this issue.  I should have listened to my gut but I couldn't resist all the tasty sides that come with the California chicken combo.Apparently they are working on a liquor license and it will be nice to have a glass of wine with the meal in the future.  But even without that I'll be back to enjoy this place or have them deliver ."], ["Julie N.", "My favorite place to order for delivery when I worked in downtown. I use to like Santee Falafel (SF), but when I found out about CKK, I dropped SF with a quickness.CKK is always fresh and tasty with huge portions. The owner, his name escapes me :(, is so nice. My food was always delivered on time and hot; never once did I have any complaints. In fact, I love this place so much that I've converted everyone in my office to abandon SF for CKK."], ["Marina R.", "Love, love, L-O-V-E.  Found this place on Eat24 and was pleasantly surprised.  The food was fresh and sooo flavorful.  I ordered the Gheimeh which was what sealed the deal for me.  Unfortunately, it didn't come with the french fries (not sure if they forgot them or don't do it for delivery), however, it was incredibly flavorful, good portion, and tasted homemade.  I also tried their \"salsa\" (Diced tomatoes, chopped onion, chopped cilantro, minced garlic and three different chili peppers (jalapeños, Serrano, Fresno chili) which I mixed in with the rice and was fresh and flavorful.  To meet the delivery minimum I also ordered the Shirazi Salad which was great but I prefer the salsa.  So glad this place exists AND delivers (for free with minimum)."], ["wayne l.", "The food is ok but the service is outrageous.  This place has a habit of clearing out your plate without asking you.  There's a serious misunderstanding in this practice.  When you pay for food it is your food.  Common courtesy and practice is to ask \"May I take your plate?\"  And with an affirmative yes is when you remove the plate.  I had reserved half the plate to take home to see it gone.  I brought it to the attention to the waiter.  After an apology he whispered into my ear that they're working on a fresh to go order.  Oooh giddy Ma I getz a new plate!  A bit tacky but whatevers he meant well.  Ijust wanted what I paid for.  A few minutes later I receive my \"supposed new order to go\".  Upon opening the bag which was hot on the bottom to sprinkle some of the pepper flakes I realized they had packed in fresh hot rice with what looked like to be pieces of meat from my previous plate.  Alright that's disgusting, not cool and insulting.I grab the mustached gray haired manager walking by who confirms that it was he who had ninja'd my plate off the table unbeknownst to me.  Started to argue with me that he had asked to clear my plate.  \"I just told you nimrod that you didn't, if I answered I would remember right?\"  Continues to explain that the meat is clean that it didn't go in the trash but was on top of stack of plates in the bus tray.  Very nice nimrod you succeeded completely in making me understand.  Life is about being on the top stack of the bus tray... not the bottom nor the middle.  Got ya.  Once you removed the plate I don't give a shit where you said you put it.  That's disgusting.  You just replace it.  No questions asked get it?  We leave and he rushes immediately out saying I have your order right here please take it..... grabbing my hand to hold the bag.  As if I were his king and had traveled across the Sahara to bring me some crimson.  Or was that because we left a note on the receipt that he gets one star on Yelp?  Kinda flabbergasted by this man's audacity at this point.  Does he assume people are out to maneuver through situations to walk away with more food?   I blew a kiss at the drive thru for an extra piece of Original Recipe wings once.  Score!!! Note to nimrod.  When a customer pays for food in your establishment it's theirs.  Simple as that.  Ask before you remove it and when you forget this simple rule you replace it.  Done.  If you don't think this is true then Jim Docker thinks the pants you're wearing is your privilege too.  And the clue I'm giving you.. well it's not really yours either."], ["Misty F.", "**Dinner 4-6pm take out special! Chicken-beef kabob $7.95!Located on 11th St. and Broadway.Arrived late in the afternoon and there was no wait. People started filling in afterward for dinner. Don't let the exterior deceive you. It looks like some sort of fast food joint, but in fact it is a nicely decorated sit in restaurant. (see photo) Service was great and attentive.I tried the food from here when they were at their old location down the street, which was many many many light years ago. The food at their new location is just as I remember it to be.. DELICIOUS! While you wait for your meal, they start you off w/ a basket of warm pita bread and butter. :)Here's what we ordered:Ckk Shish Kabob (half order: $12.90): Flavorful and tender filet mignon skewered w/ bell peppers and onions. So delicious!! Boneless Chicken Kabob (half order: $8.95): Chicken marinated w/ lemon, saffron and herbs. Tasty, tender and filling!! YUM!** The orders above came w/ basmati rice (the sprinkle of yellow rice on top is just like color decoration, it doesn't taste any different than the white rice underneath) , grilled tomatoes and chili, lemon wedge, and raw onion strips. Season the rice w/ the purple colored spice mix for a zesty and flavor enhancing meal!Lobia Polo ($5.95) w/ Beef Koobideh ($12.95): This is basmati rice mixed w/ minced filet mignon, green beans, and tomato sauce accompanied w/ beef koobideh. Beef koobideh is skewered ground beef marinated w/ spices. It has somewhat of a meatloaf texture. Very tasty!! YUM!!Check it out!"], ["Susanna L.", "Random find online while I was in a meeting. I decided to keep it random and I ordered the Gormeh Sabzi (a stew of roasted herbs and beef). I also ordered the eggplant (akin to babaghanoush). It came with pita and rice.Delivery was fast and efficient. The stew was out of this world. I highly recommend it."], ["Shannon V.", "CKK has become a weekly lunch spot for me and my DH. The consistency can not be beat.  We love it!  He orders online from the office and brings it home to me! Soo special! I love my white fish plate, it is always fresh, hot and delicious and enough for dinner too. He gets the chicken kabob plate and usually gets me a little salad. They make it with baby romaine mix and the dressing is my favorite! I save it for the next day's salad too, it's that good! I'm pretty sure it's a balsamic vinaigrette. Anyway, the owners are really nice people working hard and serving up some of the best food downtown at reasonable prices. It beats Panini Grill. That grilled tomato ROCKS!!"], ["East N.", "Excellent food in a nice room - strange that the logo almost communicates a fast-food environment.  They're open for dinner now as well which is a GREAT alternative. Tough to find reasonably priced good food in this neighborhood. Gormeh sabzi is excellent with strong flavors; grilled salmon is cooked just right - every-so-slightly charred on the outside and flaky.Other reviews say everything else you need to know but a couple of things on some of the criticisms:--The owner is always on the phone because they do a tremendous to-go and delivery business. Should he hire someone else? Yes - service gets annoying sometimes but he's not talking to his bookie or his girlfriend.--Re the overcharging complaint: Sounds a little passive aggressive. Mistakes happen, so why not speak up and let them know? None of the reviews here indicate a pattern of chiseling customers.Can't wait to go back."], ["Niki M.", "Vegetables were so crisp and fresh!  They were efficient and very nice.  My husband and I randomly dropped in on our way to a concert at the Staples Center.  The owner was very friendly and welcoming and the food was perfect!!!!!!"], ["Ariana W.", "This place is awesome! (I ordered delivery) they were so kind and accommodating and not to mention the food is amazing and they give you well your money's worth. I ordered the veggie kabob and hummus and it was really delicious. I highly recommend!"], ["C Q.", "I've ordered a lot from CKK. I've tried the Kabobs, Koobideh and I loved all of them. I found out about the restaurant from one of the ordering sites and since then I have been hooked. It's now my favorite food lol. I love the packaging. I love the portion - very generous. The meat is just perfect, generous portion and I can really taste the quality difference. I tried the Mediterranean place close to Fig and 30th and their meat was cheap. The veggies in the salad are high quality too. Yum!  I love the roasted tomato and I love the rice - best rice I have tried. It is just right and the taste is perfect. Wow, what do they put in these? I grew up eating rice but the one they have is so different in a better way. I love the combination options too! The purple cabbage with hints of lemon(?) is good too. Did  they change their bread? I love the new one Ive tried. I did not like the previous bread. Now it's just perfect, except for the onion - not much of an onion fan. Wish there was an option to change that side to something else coz I just throw the onions.Looking forward to seeing more dessert and drink options and fruit add-ons! :)"], ["Val M.", "California Kabob Kitchen is a quaint sit-down Persian restaurant behind the ATT building. I was overjoyed when I discovered it! The staff is so sweet and friendly and the food is fresh, flavorful and tasty. I am no stranger to Persian cuisine, and thoroughly enjoy CKK food.  I always get the chicken koobideh with salad and sometimes rice if I'm not avoiding carbs (hehe).  I need to spice it up a bit and try out some other menu items, but I'm sure they are good as well. During the lunch rush they are always busy, but manage to get your order out quickly even when dining in.  The full order feeds me for lunch two days in a row which is perfect when trying to be cost effective. The food selection in the ATT building is sparse and CKK saves the day when I'm craving a scrumptious lunch.  Icing on the cake..they deliver!"], ["Billy K.", "Just viisted this place for lunch with my co-worker.It was a nice jaunt but worrying if it was going to rain on the way back to the office.  The place was quiet.  Half filled ( looked like regulars).We didn't see the same special on their website as on the menu.But they had some special written with chalk near the counter.We both ordered the California Kitchen Special1  appetizer1 salad 1 boneless chicken kabob.We tried the eggplant and cucumber.  The eggplant was rich. Never tried before so not sure if right.  But it tasted good.The plate was very appealing.  The grilled veggies in one corner of this large rectangular place.  The rice was topped with another color rice.  The chicken was moisty and very juicy. More food for lunch.  Saving half for dinner."], ["John L.", "I've been living in downtown LA for almost three years.  if it wasn't for my neighbor, I would've never have found this place within walking distance from my loft.  the owner is extremely accommodating and the food is fresh.  the food is inexpensive and the portions are generous.my only complaint: they need to open later, b/c 3PM and no weekends are just not enough to fix my cravings."], ["Richard E.", "Delicious food and friendly service. Nice little hidden treasure in Downtown. Highly recommend the lamb chop kabob! The Cornish hen kabob is also delicious. Will definitely be eating here again."], ["Cheri A.", "Lamb stew is so tender and tasty!"], ["Yochanan R.", "Great food, but kind of slow service, clean place and nice ambience. Beef stew is great, comes with a huge side of rice. Chicken and beef khoubide are juicy."], ["Sharon L.", "I love this place!  I work a few blocks away from them and have them deliver lunch to me at least once a week.  They offer great food and good service at a good price.  Plus, they allow me to change up my order as much as I need to accommodate my diet  ... I highly recommend the Veggie Salad, Eggplant appetizer, Yogurt & Shallots, and their Chicken Kabob."]], "Marouch Restaurant": [], "Spitz - Little Tokyo": [["KaThy T.", "It was a Thursday night.  Since my friends didn't show up to the first place we were supposed to meet them for drinks yet, one of my friends and I decided to drop by this place first.  The reviews and star ratings were good, so why not.  Too bad we missed Happy Hour, but we we're still glad we dropped by.  I liked the setup of the bar.  And the service was great, along with the food and drinks.  We ordered one dish and a couple drinks. The dish we ordered was so good.  We didn't leave any leftovers behind.  We ordered the MEDITERRANEAN DONER - hummus, kalamata olives, feta, romaine, cabbage, tomato, onion, green pepper, cucumber, tzatziki, beef, lamb, chicken.These drinks were pretty good too:SUENOS MANGOS MARGARITA - Tequila, mango, vanilla, lime, agave, bitters, smoked chili salt rim.SPRING CUP - Vodka, rhubarb, juniper, orange, cucumber, sweet vermouth, lemon, bitters, soda.TOKYO STRAWBERRY - Vodka, green tea, lime, St. Germain, bitters.Can't wait to come back in the future..."], ["Yenny D.", "Woohoo! I've been wanting to try Spitz for a while now and came here on a Friday night for dinner with my BFF. As we were ordering, we mentioned that it was my birthday and they were all so awesome about it and actually gave us free shots! Woohoo!FOOD:- street cart fries - yummy!! Like carne asada fries but no meat and different flavors and toppings. So good, especially with some ketchup!- street cart doner (wrap) with chicken - this was pretty good too but the chicken was a bit dry. Sriracha and ketchup solved that problem for me- berlin doner (wrap) with falafel - now THIS was good!! Loved the flavors and the falafel was so tasty!Portions are really big and we ended up having a bunch of leftovers. To go boxes are at the bar counter for you to take if needed.SERVICE:Awesome! Free shot, what more can I ask for?? We even took pics for their Movember wall with fun mustaches they provided for us.VENUE/PARKING:Kinda dim inside, there's patio seating. Free for all seating, we didn't have a problem grabbing a table. Order at the window and they bring the food out to you. There's also a bar area and lots of TVs. I've never had a problem finding street parking in Little Tokyo, just gotta be willing to walk a few blocks! There are a few lots nearby too.Will definitely be back!"], ["E K.", "Doner cart fries are always so amazing! Be careful because the fries are addicting and you'll want to come here everyday. I've tried their sandwich, wrap, and doquitos (?) and they're all great. I heard they have really good and creative cocktails, so I'll have to check that out soon."], ["Deb S.", "The cart fries are soooo good. The pita chips too! The drinks here are good too, pretty strong."], ["Hao T.", "Spitz. Yum. Why didnt I come here sooner. Such a different atmosphere for a little Tokyo eatery. The ramen places were closed or either packed so me and my friends decided to go here! It was all of our first times and I can gladly say we all love it! We got two doners and the street cart fries, bc duh everyone here talks about it ! Ahah! I got to try the doner that was boxed on the menu LOL sorry I forgot the name but it was so good! Anything with garlic aioli is good. Grab yourself a bottle of sriracha and go to townnnnn! The street cart fries were on point and so unique! The fries were so crispy on a whole notha level! They resemble the fries you get from those hk cafes down here in the mpk alhambra area if ya know what im sayin. It didnt get soggy at all. I would totes come back! (:"], ["William B.", "Went here for lunch the other day, hit it early, which was good, they get a decent lunch crowd.From start to finish it was a pleasant experience.  The counter service was good, food came out quickly.  Portions were decent, very fresh ingredients, and price was expected for the area.I was there with a regular, and he knew all the menu items.  I opted for a salad, which was delicious.  The pita chips were superb.  I can't wait to go back and try more items.Very clean, and plenty of room to relax and enjoy some grub.  Not overly hipster, which is good."], ["Heather S.", "Friendly staff, nice location, good food. It all was very tasty and they have great fries, but minus a star because I felt like I hit a sodium overload halfway through."], ["Matt C.", "the street cart fries are fucking amazing. period. coupled with a beef/lamb donor kabob you can't get any better unless you wash it down with a tall as ipa and a side of that famous hummus/sauce they come with.I'm particular about my pita/gyros so I have my preferred  spot for that (top falafel) but the fries here cant be matched. those alone have me coming back on a regular.this is the other usual go to meeting spot for the friends to catch up and talk about stuff and we always end up getting a bit too drunk but it's always a good time with good food. I'm glad they opened one closer to me in the valley."], ["Rr J.", "WOW. I am really impressed. This place is amazing, the vibe and the food. Colorful street art covers the walls. The food is pricey, $9 for the street doner cart but its the best wrap Ive ever had. That first bite really makes me believe the $9 are worth it. The fries are pricey and the quantity is good....the wrap seems small but it is very filling and I never seem to finish it all. I will keep coming back here, definitely one of my new regular spots."], ["Chloe K.", "Omg their street cart fries!!!!! I don't know what it is about those fries (is it the feta cheese? Garlic aioli? Chopped veggies? WHO KNOWS), but I guarantee it's like a party in your mouth. They're pretty pricey at $8+ per dish.The street cart doner is okay, but sometimes the meat in it is really dry and chewy. And I wish the veggie-to-meat ratio was a little better... It can feel like you're just eating whole chunks of a cabbage wrap.I'm giving 3 stars because even though the street cart fries are bomb, I wouldn't go to a restaurant just for their fries. Come here if you're in Little Tokyo and don't want to eat Asian. It's not a bad choice, just not my #1. Don't forget the 10% off!"], ["Yuen R.", "Awesome place for drinks, good food, and fun times.I'd recommend the Street Cart Fries and the Donner Wrap. These 2 are my guilty pleasures, and even though my doctor says I can't eat food like this anymore, I can't resist. Sometimes, I even order it for delivery via Postmates or the Rushorder app (HUNGRY3 promo code)."], ["Joanna L.", "I decided to pass off all the Japanese food in Little Tokyo to try instead Mediterranean food at this place and it was a pretty good decision. I was on a low (bad) carb diet that night and decided to get the Garden Bowl with a mix of beef and lamb and it was delicious - full of flavor yet light because the dressing was yogurt base and it also came with hummus. My boyfriend ordered the Street Car Doner with Street Cart Fries...which was pretty much like my Garden Bowl except it was wrapped - so it was just as tasty. The service was okay but the decor of the place was pretty neat. The food was reasonably priced and they are pretty healthy and have health-conscious options."], ["Jean R.", "Going healthy and paleo may not have been the best option while dining here, but I got the garden bowl with beef & lamb and was a tad disappointed with it. The garden bowl basically consisted of sliced veggies like carrots and cucumbers with two dipping sauces - hummus and tahini. Unfortunately, I thought both the hummus and tahini were way too thin and runny for my liking; I normally prefer them thick. I also did not like the fact that the meat was shaved off into paper thin strips - it was my first time having meat prepared like this (doner meat) and perhaps I was more off put by the dark brown color of the meat and the texture than the actual taste, so I had a hard time consuming all of it. Maybe if I had gotten one of the wraps where the meat was buried inside with other things then my mouth would have accommodated better..."], ["Jennifer Q.", "LOVE the vibe and interior of this place. food had a LOT of flavor and had quick to little no wait time for food and was an explosion in my mouth!lamb doner wrap (about $6.50): very filling, had lots of delicious veggies, and i highly recommend! the flavor was incredible... sometimes a little too much for me to handle but it was something i wouldnt mind eating again!streetcar fries ($5.50): the sauce it came with was not to my liking nor my friends so we didnt eat that.... but the fries along with all the ingredients was amazing! kind of pricey but it was pretty yummyOVERALLtoo pricey but food was above decent and very flavorful"], ["Rayshawn W.", "A more hipster take on Mediterranean food that is decent in portion and taste.The sandwiches which gives you the option of three meats or all, are filling and the dosquitos are very delicious. I ordered the dosquitos as a side dish but would easily make it my main. Good stuff!!!I didn't order any beers to go along with it. With that being said...the sandwiches and dosquitos alone are enough to rack up four stars from me.Dinner 11/28/2014"], ["Ray T.", "The Döners here are AWESOME! The sweet potato fries were great but the street fries are even BETTER. The location itself is great and very eclectic on the inside, they always seem to be playing great music. This is definitely a good place for 20-something year olds who in the area. One of my favorite Mediterranean food places in the area because of the array of items on the menu along with the drinks available at the bar. I would recommend this place to anyone who was yet to try this restaurant."], ["Thi Anh T.", "I'm not sure why this place has such a high rating and good reviews. My gfs and I came here for lunch, we ordered a doner kebab basket, a lamb wrap, street Fries and a veggie bowl, everything was bad.  Lacking flavor and dry meat.  They fries were good until it got soggy with all the dressing drizzled on it.   Spitz is like a fast food joint- not a good fast food joint.  We left lunch feeling  dissatisfied and bloated by sad heavy food.  If you expect good Mediterranean food, spitz is far from that!  It's heavy, big portion fast food with dried meat and little flavor!  The staff was really nice though. So that stars go to them, and the street fries (for the first 10 min)."], ["E.J. S.", "I do like Spitz I'm willing to admit. I've only really had gyros when it comes to Mediterranean food, and I wasn't too familiar with doner kebab until I came to LA. One of my friends is obsessed with this place, so I decided to check out the one close to me in Los Feliz. I've ordered the doner wrap and the doner salad, and they were fine, but nothing that really caught a hold with me. We decided to check out the Little Tokyo location, and he suggested the doner with pommes as the sandwich option. It's now my favorite of the three and what I'll be getting every time. Mixed meat (beef, lamb, and chicken) was the way to go, along with the delectable street car fries on the side. I'm finally sold on making Spitz a go-to in my rotation."], ["Pat C.", "I'll be honest with you, untill I gobbled down the falafel wraps here the idea of a meat-free diet was laughable to me.  But say no more my friends, I've been enlightened.  These heavily spicied, deep fried legume balls are flavorful, deeply satisfying, simply delicious.  In an area packed with great eateries this joint's a standout.  Missing a star due to servers who could care less (I've been here a few times).  Great, flavorful falafel wraps nevertheless."], ["Sarah S.", "Grabbed lunch here with my coworkers and I'm in love! Spitz has a really chill, cool space with lots of artwork for an urban feel. It was pretty crowded on a weekday afternoon so I can imagine this place gets really crowded on the weekends. However, I love that you order at the counter and take your number to your table- it makes it really casual and easy.I ordered the Street Cart Doner ($8.25) which comes with your choice of Beef/Chicken/Mixed Meat (Beef + Chicken), garlic aioli, chips, lettuce, cabbage, tomatoes, onion, green peppers, cucumbers, and tzatziki sauce. It was SO good! It's not exactly like a traditional gyro wrap, but a more modernized, fusion type. All the flavors work well with this sandwich, the meat isn't too salty, and the chips and cabbage give it the perfect crunch. My coworker ordered the Street Cart Fries ($8.25) which is the fries version of the Street Cart Doner- garlic aioli, feta, onion, green pepper, tomatoes, olives, and pepperoncinis. For an additional $2.50 you can add your choice of meat as well. This is definitely a meal in itself, but it's also great for sharing. To end our meal, we tried their Cinnamon-Sugar Pita Strips ($5.50) - it basically has the same flavor as Cinnamon Toast Crunch, but the brown sugar whipped cream dipping sauce it come with makes it so much more decadent and special. The whipped cream is really light, fluffy, and not too sweet at all- it definitely tastes homemade, not like the ones in the can.Prices are pretty good since the portions are pretty generous. I was already stuffed after finishing the doner! Service is also really friendly and chill. Overall just a really solid spot in Little Tokyo :)"]], "Spitz - Los Feliz": [], "Pita Bar & Grill": [["Noelani K.", "The very best Mediterranean for miles and miles - this place is pretty much as good as it gets! I live near by and visit often and it is always delicious, so, when it came to catering my intimate little wedding party - I knew instantly that I wanted Pita Bar & Grill (that says a lot, its good enough for a wedding, guys, seriously). We told the owner that we wanted enough food for about 25 people - and he more than accommodated that (for a very good price), all of my guests went back for seconds and some even thirds - I still had so much food left over (Delicious leftovers? Yes,please).Not only did the food arrive at the exact time the owner had said it would, it was so incredibly delicious and fresh! Annnnnnnnnnd, not to keep rambling on about the amazingness of this place BUT the owner set all of the food up for us, opened everything, made it look nice, he did everything!!! Bottom line,  if you have not been here yet - go here. Go here all the time, eat everything and don't forget to try the Schug!"], ["Ali S.", "I called asking if the meat here is halal or kosher. She said she doesn't know what that is. So I asked again... You don't know what kosher is?You're restaurant is in the middle of Jew town and you don't know what kosher is? So then I asked , can you ask someone else? ... She said she was the only person working there tonight. One person kitchen eh... Lies. Get your shiz together."], ["AF 6.", "The worst food and dirtiest place I have ever visited in LA !!!!!Small place .. bad service.. disgusting food.."], ["Gigi D.", "Juicy Juicy Juicy and LOTS OF FOOD! I've ordered the chicken breast plate here before as well as the chicken shawarma plate, both insanely tasty, both could probably serve you for your next 2-3 meals... Unless your mouth is like a vacuum cleaner and hoovers in the whole plate without even blinking an eye. While I am certainly proud of my \"no food left behind\" motto, when I do that here, I tend to get a bit Thanksgiving full... And feeling like you have a whole turkey and vat of gravy in your stomach mid-day isn't the best way to fuel your productivity.... Just a nap! Ha!So when eating here, use your willpower and try not to eat EVERYTHING IN SIGHT! It will be hard not to though cause this place truly has delicious food!PS: street parking!"], ["Antho L.", "*Way too expensive for the portions you get. There's another place on Melrose that has better food and is a better value*The food is good but I think this place charges way too much for their plates.I had a Shawarma Pita sandwich which wasn't very large IMO. Now these things don't really have much in them at least this version didn't. There was some shawarma with a few other ingredients but not much of a sandwich if you ask me. If you think about the fact they charge over $10 for this, it's really kind of a joke. I'd say the ingredients in all cost about $3.00 maybe $3.50 at the most? I mean, a few pieces of sliced chicken shawarma and seasonings, etc., a sliced at the top pita bread...so to charge over $10 for this is highway robbery! Sure, you do get to have some of the free pickles from the condiment bar and there are a few different hot sauces to choose from. In fact, the girl who brought me my sandwich then brought over three bottles of the sauces. I felt like this was her way of trying to make up for the small sandwich that came with a high cost. \"Here, I know we overcharged you for this small sandwich but hey, we have hot sauces!\"  If you do the math, the mark up is about 285% over cost versus the customary 100% over cost. Hey, I was a math major so I can't help thinking that way.The television was set to a UFC match. That's great if you're into it which I am not. Is the television supposed to be for the pleasure of the workers or the guests? I don't suppose it matters much however, since there doesn't seem to be much that is good on t.v. these days.Anyways, it's really hard to find a place serving good food that also has a good value for their customers in this town. Not sure I'd come back as the whole idea left a bitter taste in my mouth. To be fair, the sandwich was decent tasting and the hot sauces were on point and appreciated. But 285% over cost?!?! Pfft...I'd rather go to Ta-eem Grill on Melrose. You can get a humongous chicken shawarma wrap/burrito stuffed with generous portions of sizzling and juicy chicken shawarma and your choice of the various pickles and side dishes they are able to stuff into it. AND...it's only $7.99 too.I could come back here again but I'm not really inclined to do so. I think I'll stick to my go-to place on Melrose."], ["Alana L.", "We had the worst experience.We came for Shawarma and they ran out, we wanted hummus and they also ran out, the lamb kebab was not tasty and the salads were bland. Service was also slow."], ["Mick A.", "It had been a busy day and we looking for a healthy and quality dinner. Mediterranean styled food seemed like the perfect fit for us. As we pulled up in the Uber we did wonder as the physical appearance is one which is very understated, and on this occasion there were only a couple of others eating in.We decided to trust our decision and give it ago. We were greeted by really nice people who patiently explained the menu options. The food was a terrific experience. The chicken breast plate was outstanding and amongst the tastiest and tender breast I have had. It was stunning......and we also shared the Shawera, a mix of a nicely seasoned lamb and chicken which was succulent and tasty too. The accompaniments on both plates, including lentil rice and Israeli salad were very complimentary with the meats.A really good eating house and for good food when you are on the go this is an ideal destination."], ["Linette F.", "To tell you the truth, I am so amazed at how giving Sam, the manager is. He enjoys giving back to the LA community and somehow word on the street is that he gives away complimentary food to the homeless around the area. Out of the kindness of his heart, he wants to help these people and as a patron I really admire that. Now let's dive into the food business:grilled chicken breast plate- this is my go to order. Freshly marinated and grilled chicken breasts over a subtly minty tabbouleh (I substitute this over the rice) makes this meal so delicious. The pickled veggie bar has a great assortment from pickled cabbage, to pickled radish and to pickled onions.grilled fish plate- I love it when I can get a nice piece of grilled fish at a Mediterranean place. Lightly flavored grilled salmon but it had a nice crispy finish on the edges! It was perfect. Thank you Sam for great food and always welcoming us with a smile! Keep up the amazing work and giving back to the community!"], ["Dorothy H.", "I discovered my new favorite dish here, it is so good! The Shakshuka is excellent, I had never heard of it before, but read the description and loved the idea of eggs. It's a real comfort food, but spicy and bold. The service is also very friendly and efficient. There's also a pickled veggie and sauce bar that is very generous. Great place!"], ["Hollywood A.", "I've been meaning to try this place and finally had an opportunity yesterday. I walked in after the lunch rush and was able to order immediately. I ordered the chicken plate which came with hummus, cucumber and tomato salad, rice, and fresh pita bread. The chicken was juicy and nicely flavored, everything was fresh and made to order. My favorite was the hummus and pita bread. The only downfall was how small their water cups are, I literally had to refill my water 5-6 times during my meal. Overall great food and good customer service, I'll definitely be back."], ["Bisma M.", "This restaurant comes up under Halal food when searching on yelp, good thing I asked before placing my order because the food was not halal! Really enjoyed the food here, ended up ordering a plate of falafel which included rice, salad, hummus and falafel. The prices were a little high compared to other Mediterranean food places I have visited."], ["Maham M.", "First off thank you to the very friendly staff. Cashier was very welcoming and gave great recommendations for me and my GF.The two pitas that we got (Shawarma & Streak) were great. Especially the streak very tender and cooked to perfect."], ["Alex N.", "Small location on Fairfax, I parked on the street, not sure if they have a parking in the back.Staff is ok, service was fast.Place is decent, not new , not dirtyNot a fan of the area .I had - a Moroccan merguez pita sandwich, I really liked it, pretty tasty, but expensive ($11 for a sandwich !)- french fries were okMy friend had the shish kebab steak, I had half of it , the meat was dry and not tender, not my type of seasoning... Didn't worth the $11 at all.I would go back and try other dishes but $16 for a pitta sandwich and fries, it is way too expensive. For that price I would at least expect a nice place/area to hang out."], ["Maria M.", "Loved the food. I ordered the shish kabab and some french fries. Everything tasted great. What I didn't care for was that when I was ordering it seamed like such a hassle to the girl that took my order. It was my first time here so I asked a few questions about what was what. Over all I wouldn't let that stop be on coming back again. I personally am huge on customer service. I do recommend this place. The watermelon juice is amazing!!"], ["Izza K.", "My sister and I ordered the shawarma in pita and a chicken kebab plate. I liked the chicken shawarma more than the chicken kebab. The kebabs weren't very flavorful. I believe they are made of chicken thighs, which though juicy was a bit too chewy. The portions are on the smaller side given the price. This isn't to say the food is not good but I've had way better Mediterranean food. They do have condiments that include some wonderful sauces and pickled veggies you can pile on your plate as many times as you like."], ["Theresa E.", "Was that Shish Kabab or was that the best MF meal of my life? I don't know yet.SOLID TABOULISCHNITZEL Check!!!Raise your hands if your favorite dish is the hummus con carne. My stepbrother and his gay friend were all over the LAMB Shashush-kabab. Their sides are Huge! Kudos for the hot delivery guy!!!!!"], ["Sepehr M.", "Love this place!!!Solid food on a consistent basis with great service.... What more can you ask for?I have ordered lunch and dinner at this place and never been disappointed.I recommend the shawarma on lafah.....I can't get enough of it!"], ["Agustina K.", "I really wanted to like this place. I went here with a friend after reading the massive numbers of 5 star reviews. My friend ordered the pita sandwich with shawarma and hummus and I ordered a greek salad with shawarma added on it. It wasn't bad really. But it also wasn't great. The Greek salad was just your typical greek salad and the shawarma, although tasty, felt so fatty that I felt my arteries clogging (even after eating a healthy mediterranean salad guys). The pita bread was warmly toasted and delicious, but honestly, it's pretty hard to go wrong with bread.. One positive thing is that the hummus was really delicious. So if you're going to come here, atleast get the hummus and you'll be satisfied."], ["David Z.", "I went here for lunch with a group of about six and we had no issue saddling up a couple of tables for a great, fast and easy lunch. What I've Had: Schwarma Pita with Mint Lemonade and a sampling of all their pickles and sauces. I'll be the first to admit that I like creamier Middle Eastern sauces like tarna and tahini, and both of theirs are on point. But their harisa is an offering that I don't often get with my schwarma and that's a flavor combo I'm going to seek out again!A second try here could bump this up to a five star review, I just need to know it's as good a second time around."], ["Vanessa M.", "Been here quite for sometimes and always seem to get the same thing? because it's so good so why change it?! I love chicken so I always come here for the chicken only. Parking is street only. Inside is pretty small and outside has 2 tables. The owner is real nice and accommodating. _Chicken Breast. Marinated and Grilled. All plates are served with a side of hummus, salad, lentil rice and pita.* Pita - $9.75* Baguette or Laffa - $11.75* Plate - $13.752 Big portions of chicken breast, Always cooked perfectly tender and juicy. The hummus is good and real smooth. The salad is a mix of chopped cucumbers, tomatoes and I think onions and their dressing. Refreshing and simple. The lentil rice is different since it's usually with jasmine rice or basmati rice. The lentil is fluffy but not a huge fan. The pita is pretty thick and fluffy. Real good when it comes out warm. This is more than enough for one person, I always take some of it home since I can never finish the whole plate, They have many other options as well; Chicken Kabab, Shish Kabab (steak), Shawerma, Lamb, and other specialties. They also have a small stand with different sauces and spices, as well as some sliced onions with a dab on pepper, pickled carrots, red pickle, and some other condiments. If you are in the area and shopping around Melrose, make sure to check out Pita Bar :)"]]}