{"B.S. Taqueria": [["Andrew M.", "I have to say I don't write many reviews, being that I'm usually on the other side of the review. With that said, places usually either wow me or make me upset that they are still open for business.We walked in and we were just going to order food to-go because my friend had to catch a 9:30pm train at Union station. As we were ordering the manager comes up to us and asked us if we wanted to be sat at the community table and he would take care of us and make sure we don't miss that train. Wow it's the little things like this that make customers feel special or at home.We ordered 2 Carne Asada plates and a papa and chorizo taco plate. The Carne Asada was cooked perfectly and had the right balance of citrus, spice and heartiness to it. The tacos were amazing, I'm not a huge fan of chorizo but this place really made each bite just as good as the first. This not your \"traditional\" LA Mexican restaurant and they know that, but they really did a Amazing job bringing out \"traditional\" flavors in their food. Thank you again Felix for the hospitality and everyone else that works there!"], ["Cath M.", "**3.5 STARS**Came here with my girls from paddling... for that random kumbaya :) It was a weeknight so it wasn't that packed yet... it looked small from the outside but pretty narrow on the inside.Ambiance: very festiveFood: spicy! I even joked with the girl that picked the res... if she really liked me or not due to all the spicy food res we've been going since! The rest of the ladies loved the food... but this token islander was not enjoying it besides the chips. That's why it's 3.5... reviewing it in behalf of the girls."], ["Steve M.", "New mex place with not so traditional items. If you want a burrito or tostada please proceed to Chipotle.Tried first time. They have very interesting menu items and bizarre flavors. Heres what me and cousin i treated had:Shrimp tacos =very good but 2 tiny tacos for 14 bucks. Ditto the chicken ones 12 bux. Very pricey. Flavors are great but ridiculously overspiced, as are pretty much most items. If you can't handle heat best you don't come here.  As for me, my taste buds say yes but hemorrhoids say no mas por favor.Weird fried corn or potato?chips= only bargain,2 bucks gets you airy crispy air popped like chips with a bit of cayenne pepper im assuming.  Fried chicken pieces and skin.....didnt like this item. Very salty.Rice and beans=prepared very unusually. Rice was burnt and crispy on purpose. Beans were cooked with huge garlic chunks and reddish flavors tasted like garbanzos. Didn't like this either.Quality of the food is pretty good but the flavors are just too risqué for me to come back again.  And as mentioned spicey and pricey as fuck. Spent 60 bucks on a lunch with only items stated and 2 drinks. Great environment and decor just not a fan of these combinations of the flavors and odd pairings."], ["Liezl E.", "It's my birthday week. I treated myself. Chorizo & Papas tacos, Durritos, Jamaica agua fresca, and churros for about $20. The tacos were good as well. Surprisingly filling since I'm used to getting 3 or 4 street tacos. If I had to pick something a taco I'd probably get those again.  Though if we're being honest here, I'll probably just go back for the churros. Hot damn, those are some good churros."], ["Wes S.", "Los Angeles is probably one of the cities in the United States that tacquerias (taco shops) outnumber Starbucks, just maybe. There's enough that the choices can be overwhelming or underwhelming, depending on who you talk to.Then here comes an \"upscale\" type place that sells tacos. I do like the upscale/relaxed vibe of this place, without charging their patrons the \"upscale\" pricing (to me at least).For an appetizer, I ordered the Lemon Pepper Chicken Chicharrones + Fried Clams and Shishito peppers. The Chicharrones and fried clams were nicely crisp and the lemon pepper and Shishito peppers add to the flavors and it's a nice \"wake up\" to the senses without assaulting you.I then ordered the Clam and Lardo tacos (2 tacos per order) for my main appetizer. The Clam and Lardo works and was quite surprised that the clams didn't have the typical rubber band texture to them and the lardo complements the clams perfectly and just melts with each bite. I didn't want to douse the tacos and ruin the flavors, so I left them without adding any.The watermelon agua frescha was really refreshing without being too overly sweet.The wait staff and I believe owner were always on point when they saw that we needed things and didn't leave us for too long for own devices (phones, heh). I have to come back and try their other tacos to fully round out my review, until then, stay hungry my friends."], ["Jonathan R.", "I've been on a taco quest in LA lately, and of the 20 some odd places visited last week, this was far and away the most innovative and tasty Taqueria rollin' in LA. I have not yet gone to Broken Spanish, but after eating here, I am expecting a great experience. Rice and beans where crispy and crunchy, very tasty and unexpected. The Chicken chicharron were amazing! Tacos of Pork & shrimp were both outstanding. The tortillas were freshly made with heirloom corn masa. Its about as good as a corn tortilla can get.  I can't wait to try more. The low star reviews here are all \"punishment\" reviews because the place is doing so well they are having a hard time keeping up, so they are rating on service alone. They were smited, so they are using Yelp to get some pay back. Just ignore that noise.  They are definitely doing the right things food wise. I had no service issues, everything was fast and accurate. I love this place because of the food. You just have to try it yourself."], ["Lans S.", "Wow, what a fresh take on Mexican cuisine. The Rice & Beans are out of this world. Nothing like you'd expect but phenomenally delicious. I highly recommend.And while my carnitas tacos were good, the real winner was the mushroom taco. Seriously. Amazing. I could've eaten 10 more mushroom tacos... For real.The ambiance is colorful and inviting. The service is good. And the food - well, as noted above, impressive. I'll have to try to cocktails next time!"], ["Anthony N.", "I came here today with some co-workers to celebrate people's birthday and to just have a drink after along work week. Given that my friends have been here before, I didn't have too high of an expectation.Located in the heart of DTLA, B.S. Taqueria is a hip taco shop but in all honestly nothing special.  Don't get me me wrong my experience was pleasant however not exceptional to an extent.I had the lazy daisy, a couple of tostadas, and the churros. The food and drinks were excellent but not mind blowing, I definitely have high standards when it comes to Mexican food because it's such a staple in LA culture. The drinks were strong which made me only need one. The churros were yummmyyy!! It comes with a cold chocolate dipping sauce which is a nice temperature to warm and soft churros.  I was also able to taste chicaron which was made well and was delicious. I'd definitely comeback for happy hour, I do think their tacos are a bit pricey when you can find amazing tacos for a quarter the price and for better quality.My verdict for rating lands between a 3.5 and a 4 but will give them the four this time."], ["Kenneth P.", "A formal proposal to change the name of \"B.S. Taqueria\" to \"NO B.S. Taqueria\":1.  Whereas, the letters \"B\" and \"S\", in English (rather than in broken Spanish), implies the horrible term, \"bull shit\"-- as in, this place ain't bullshittin'.2.  Whereas, they took nor gave zero B.S. when creating any of their cocktails.  The paleta, gordo cup, and B.S. handshake, alike.3. Whereas, both servings of carne asada and churos con chile de-arbol chocolate enter you mouth and cause involuntary break into beautiful song4. Whereas, there is no bullshittin' that theirs is the absolute best service.  We, the bearers of salivary sensation, propose that \"B.S. Taqueria\" change their name to \"NO B.S. Taqueria\" in order to resolve the misconstruction of the association of someone's bullshittin' with the name of my bodacious succulent restaurant.All in favor say, AYE."], ["Laura Y.", "I finally got to try this place, after weeks and weeks of trying to find time to eat here! I pass by this spot everyday and was slightly disappointed that Mo Chica closed down.. but after trying this place, I am so happy it took over.Let me start with the wait... it is not the business. We had reservations for 8:15 but we sat at 8:50. I was pretty haaaangry by the time we sat but the delicious food dissolved my anger and hunger. It wasn't the hosts' fault that we sat so late, it was those damn lingerers. If you are done eating your food, get the fuck out, not chill and talk over empty glasses of water. But thank you to the host for being understanding and trying to seat us as fast as possible. I guess an hour wait is a norm here so prepare to wait! Seven grand is right across the street so grab a drink while you wait. :) The service... The restaurant is too crackin to provide stellar service, in my opinion. It took about 17 minutes for our drinks to come out, water included. I don't think it takes that long for a glass of rose, a cocktail and two shots of tequila (the drinks were all really good btw)... but I know the restaurant was slammed so it's okay. Once the food came out, all our impatience went away. Our water cups were never empty and the server checked up on us many times. The food:Lemon pepper chicken chicharrones: perfectly crispy and full of flavor, highly recommend! Wish I can snack on these while I watch tv at home-----------Rice and beans: different than your usual rice and beans but delicious nonetheless! Rice is crispy-----------Chorizo and papas tacos: favorite of the night by everyone at the table, taco is bursting with flavor from the chorizo and soft potato -----------Shrimp tacos: yummy shrimp with yummy sauces on top. I love shrimp!! -----------Mushroom and garlic tacos: if you like mushrooms, you'll definitely like this! -----------Grilled Brentwood corn: so good we ordered two orders of it!! Best street corn I've had! That kewpie mayo makes a huge difference!! -----------Carne asada: cooked perfectly and tender! Wish there was more of it though-----------Campechana verde: spicy as hell!!!! Seafood is fresh and goes well with chips -----------Tres leches: they were out of churros (FML!!!) but I'm so glad we got to try this! It was delicious! Moist cake and the macadamia nuts and the brown sugar meringue topped it perfectly. The decor of this place is cute, with color splashed around the restaurant and pillows for your back at some tables. I liked the presentation of the food as well, minimalistic and cute. The appetizers come in small brown bags which I thought was not a bad idea. Candle lit ambience makes it a good place for a date. There's valet out front or a structure on Grand Ave that goes for $7 (flat fee). The restaurant can get a little pricey but I think the quality makes it worth it! Definitely a great addition to DTLA, can't wait to go back."], ["Trisha A.", "WOW! just wow! i can't stop thinking about the carne asada ($14) i requested to have the meat cooked on the rare side and it almost melted in my mouth. the flavors worked well with the sauteed spring onion, tomatillo, and roasted squash. the flavors were so rich and the meat was very tender. the only downside is the very small portions at this restaurant. i guess quality over quantity. we also got the durtios ($2) i would skip on this the next time because it lacked the lime and tapatio flavor that i am used to. the \"rice and beans\" ($6) is not what you expect. it was more of an appetizer. it was toasted rice, beans, and chiles. it would go perfect with your beer. i liked that the carnitas tacos ($9) came with a good amount of guacamole. the carnitas were moist but the tortillas weren't that soft.we had excellent service from the staff and our waters were always being refilled. we had to skip on the churros because we were going to be late for our movie. next time for sure!"], ["Julienne D.", "Never lie about what you are allergic to or what you don't like. So I did tell the waiter offhand that I was allergic to cilantro (which I'm really not.. But I really really hate it).. But GIVEN it is a taqueria, I should've known better. I ordered the Chorizo & Papas taco. It seemed harmless enough but the waiter did tell me that the pans they use and some of their mixing are all usually done with cilantro. So yes, fair warning. Finally got the plates out and so many cilantro pieces on the papas.. My friends were impressed with how hard I tried to get every piece or shred of cilantro off of it! It was like an intense game of operation. From the moment those plates touched down at our table.. Our waiter went MIA. Never revisited us. Probably because he saw me picking out the cilantro. The only time he made a reappearance was when the manager gave us the wrong check! I ate one taco. I did my best. The moment I tasted cilantro, I downed my glass of water in one drink! Lol. Never got a refill for water because I think the waiter was trying to ignore the whole cilantro ordeal. Lesson learned: This is a clear reminder why I CAN'T do Mexican food. Ever. Cilantro. Ugh. You ruin everything. Stars for awesome interior decor, friendly welcoming from the staff, & cleanliness. Two stars off because of the above."], ["Ed H.", "Tacos here were just ok. Each order of taco is for two pieces, and they start at $8. For that price, I'd rather go a few blocks away to Guisados. The Duritos were interesting and quite spicy. I think one thing that wasn't clear on the menu was how spicy the food would be. Not good for people who don't like spicy food and get surprised by how spicy things are. Luckily, I was ok with all the spiciness, but not everyone in the party was I tried the chicken and the chorizo & papas tacos. The chicken wasn't anything special. The chorizo and papas was a bit more interesting, mainly due to the crunchiness of the potato.  The churros were probably the best part of the meal. Perfectly fried outside with a warm and soft inside. The chocolate sauce had a kick to it too. If I ever end back here, will have to try the carne asada that everyone raves about."], ["Gary I.", "In the same space as Mochica Peruvian cuisine. (Requiescat in Pace)The BAD:   BS Taqueria is another rip off joint, but not quite as bad as Bar Ama.  They both serve, for the most part, mediocre food at highly expensive prices.  Cauliflower for $11 in which the amount of cauliflower if bought from a supermarket would amount to at most 50 cents???  Clam & lardo tacos that aren't that delicious & have greasy fat w/ no flavor that would clog arteries for $7 bucks a piece.  Puffed rice & fried garbanzo, butter beans touched up with fried Fresno chiles & a bit of Cotija cheese which tastes OK for the first few bites, but they end up being mouth drying & boring.  The sliced Nopales cactus paddles & bean sprouts seem to be doused in sour dill pickle juice which doesn't seem to take too much skill to create.     The shame of it is is that most of the above foods can be made at home by a fairly amateur cook & cost far less saving money to pay the rent or house payment or to a Roth IRA for a more comfortable retirement.   I feel as though I have been culinarily raped.    The GOOD:   The Tacos de Carnitas/pork were good being braised in a meaty broth, kind of like pot roast, but at $4.50 a piece, I would expect it to be good.  The Churros were extra light & creamy in the center w/ a milk chocolate sauce infused w/ a bit of piquant, smoky chile arbol which worked well.  However, these two dishes don't hide the fact that most of this food at BS Taqueria are super overpriced for what you get.  Our waitress was kind, friendly efficient as well as the Maitre de Restaurant who kept a watchful eye on what was going on & pitching in when there was a need.  Certainly no complaints on the service end of things.    2+ Yelp stars for third rate food at first rate prices. There was no bang for the bucks.  If I were to come here often, I may as well say good bye to my 401k retirement fund or the next house payment."], ["Michael C.", "Beet torta! No idea this would taste so good, thanks BS Taqueria for opening my mind. This dish and other imaginative dishes have me excited about going back to check out BS Taqueria in the future. I wish the beer selection was a bit better, but I think they're more focused on cocktails anyway. Great addition to the DTLA dining scene."], ["Vanessa M.", "3 1/2 stars.My gfs and I planned to have dinner, so it was my duty as usual to find a place to eat. I have heard about Taqueria, and that they were known for their churros. The food looked good and I loved churros so I thought this would be a great place to check out. Parking is valet $6 (validated) or street parking. A bit heard to find at first so make sure to look up on their sign. The inside is real quaint and colorful. Has that modern Spanish feel to it. The color scheme inside was great as well as the hanging decoration from the ceiling. But for the yelpers not a great place to take pictures of the food since it's pretty dark inside. It seemed like they had seating in the back as well but I did not check. Menu is tapas style, even the entree we had was pretty small. They have a happy hour menu (5:30-7 / mon-fri) of a few drinks and one food item, which is tostada for $2_Campechana Verde ($18) Squid, Scallop, Snapper, Cucumber, Shrimp, Octopus, Tomatillo, Tostadas. Great presentation. Comes in a huge margarita type of mug. The chips were served in a rolled up brown bag, and were perfectly crisp and warm. The ceviche was good. Good amount of mixed fresh seafood. Wish they added a bit more though. My one thing, I wish it said on the menu that it was spicy. I can't do spicy so when I had it, it was pretty spicy to me, and even to my friends, whom can usually do spicy food. There were small green chilies everywhere. Luckily it was not too bad but still a heads up. Out waiter was nice and gave us all a shot of some horchata drink (usally made with ride but this was made with barley). This helped to clear out the spiciness. The drink was pretty good! I've had better authentic cecviche and tostada elsewhere for half the price but this was still pretty good to share with friends as an appetizer._Chicken Tacos ($8) Comes in 2. The chicken was cooked well but pretty salty. I liked the avocado that was spread out. That was pretty much it. Not that memorable and not worth the price. It would be worth the price if it just wowed me. It was just okay._Lengua Tacos ($9) Comes in 2. This was pretty good. The lengua taco was a bit more stew like. Kind of like Guisados (if you have been there). Served with pickled onions, which helped to add some citrus and sweetness. I would get this again but it can be a bit rich and heavy._Carne Asada ($15) Spring Onion, Roasted Squash, Tomatillo. This was a lot smaller in portion than I had thought from when I saw the pictures. But it's a good portion if you had a few plates here and there as well. The asada was cooked perfectly. Very tender and smooth. However it was a bit salty. It was good throughout but my gf's and I each had a moment where it was like holy F that's salty. Must have been a few bites that had extra salt. However what really elevated this dish, aside from the asada itself was the roasted squash. I thought it was potatoes but now seeing the menu I guess it was squash. This helped for texture as well as extra tomato type of taste that paired real well with the asada. I would recommend this, my only thing would just to ease up on the seasoning/ salt._Churros ($7) Chile de Arbol-Chocolate. Okay, so after all the hype about their churros, I must say I was a tad dissapointed. Maybe my expectations were too high but this was not up to par. It was good yes, but different than your typical churros you get at disneyland or food stands. One, the churro size is short/smaller but chunky. Two, the texture is way more soft and fluffy instead of crunchy. And third, they put too much sugar on top and could have used some cinnamon. I can tell it was handmade, and that I appreciated, I liked that it was real fluffy, but when you eat it you miss that crunch you get and the more you eat it can almost taste dough like as it was real soft. The chocolate on the side, however was great. Not too strong or rich and was perfect to dip the churros. _Gordo Cup ($6) (Part of happy hour) Mezcal, Cucumber, Lime, Agave, Fleur de Sel. I usually stay away from Tequila, but this drink was pretty darn good. Not too strong or sweet. The cucumber aftertaste was very refreshing. I would come here and get this again and again.Our waiter Tim was great! very helpful, attentive, and sweet. I would come here for the drinks but not too crazy about the food."], ["Vanessa L.", "I stopped by for lunch yesterday. Order and pay first. Once we sat down the food was brought out right away. I ordered a bag of duritos- taking me back to some fond young memories. The tacos were flavorful. A little pricey but definitely a good spot to check out."], ["Akello S.", "Just when you thought you had eaten enough Mexican food in your life after living in LA, I realized there is still plenty of culinary room!   My friend brought me here, because she had eaten there the night before and wanted some more!   That is a true testament of an ideal eating situation for any self-proclaimed foodie!We sat in the back the dining room was amazing - it felt like the jungle with diverse foliage hanging from above, and the surrounding walls painted with beautiful (almost cosmic) and serene scenic mural. And now the food - amazing!  Fresh, flavorful - just delightful!   We ate \"tapas\" style and had tacos - chicken, shrimp and the mushroom/garlic.  Exceptionally delicious.   We also had corn, a chick pea dish which was exceptional, and these chicken chicharones that I would call \"culinary crack.\"  The staff was quick and friendly and I will most definitely be returning for some more grub!"], ["Alex P.", "Dear Mr. Jeremy Stoppelman (CEO and Founder of Yelp),With all your holiness and magnificent all knowing power, I believe you and only you will have the ability to change the Yelp rating system so that it accommodates a secret 6 star rating for restaurants that go above and beyond the \"WooHoo! As good as it gets!\" 5 star rating system.  The new secret 6 Star rating would have a quote as follows, \"Where's Paul Walker?! I must be in heaven!\" The secret code to unlock the 6 stars will be: up, up, down, down, left, right, left, right, B, A, B, A, select, start.  Prerequisites of this awesome rating will need to pass the following tests:--  Over the top mind-blowing handcrafted drinks such as the Borracho Gazpacho that takes just about 5 minutes to make--  All so tender, juicy and explosive carne asada that you wish you could marry--  Service that makes you feel like you're a guest in your own home--  Elevated tacos that God made--  and the Churro (notice the capital \"C\") of all effin' CHURROS!Mr. Stoppel, now that I've laid out the new and improved Yelp Rating system model, if you would like to hire me because of my over-willingness to to be awesome, please contact me.Best regards,Alex"], ["Sandy P.", "Nice staff, attentive service, and pretty delicious tacos and chicharron. Nice Happy Hour with $5 cocktails and small eats. Very cute decor, with bookshelves and festive hangings. Apparently affiliated with Broken Spanish, a full-blown Mexican restaurant with bigger plates and bigger food & drinks menus. In fact, this place impressed us enough to try Broken Spanish, which also yielded a great experience. In summary, liked the cactus tacos and the chicharrones, but just wished the portions were bigger for the price."], ["Eehur R.", "If you can't handle the heat get out of the kitchen!!!Hands down: TASTIEST, spiciest tacos in town and best Guacamole and doughy warm delicious tacosAmbience 5/5 - I suggest sitting in the back it feels a little like a rainforest very coolDrinks 3.5/5 - I don't typically enjoy spicy drinks but if you do then you will love itFood: 5/5I'm such a sucker for CORN tortillas - blue corn tortillas totally delicious totally organicTips: GET THE TACOS! It's a taqueria after all Guacamole is on fleekDessert: CHURROS CHURROS CHURROS. These are right out of the fryer, warm, doughy with a little crunch on the outside, cinnamony and just the right amount of sweetnessBasically I will be back"], ["Meghan N.", "To eat:  Lengua Tacos, Shrimp Tacos, and Chorizo and Papa Tacos, Duritos, and Rice and Beans with Cotija cheese.Awesome place.  Order at the counter and pick a seat.  Wait staff is attentive and very nice.  Tacos are amazing, rice and beans are spicy (Fresno chiles), along with the chorizo taco- spicy too.A good mix of Mezcals and Tequilas, a seemingly nice happy hour too (we weren't there during those hours).Def be back."], ["Seung Eun C.", "I had the pork tacos for lunch the other day and thought they were rather bland.  There was a shmear of avocado ontop of the blue torilla and the topped with pork.  I've had better tacos at less than half the price.The cucumber salad was a complete disappointment.  It was jumbo cuts of cucumber which made no sense sizewise and radish and onion.  There was no taste...  I added some tajin seasoning which made it much better.  You would think the restaurant would realize that this dish needs some help?Churros were the saving grace hence the 2 stars.  They were delicious.  The name should be changed to BS Churros."], ["Katherine W.", "It was really good! Everything we had was skillfully made, and very tasty.  I want to try more.  Will have to go back in the evening to try the cocktails.  Chorizo and potato tacos - with pieces of very crisply fried potatoes; a little spicy,  delicious.Clam and lardo tacos - good flavors, garlic chips on top, clams are cooked right.  It's good when eaten all together,  but eating stragglers of the tiny cubes of pig fat without the clams was not too enjoyable for me. Nopales salad - with chipollini onions and bean sprouts (small sprouts, not with the beans); nice combination, tart and sweet, with crunch.Rice and beans - the rice is roasted to a crunch,  roasted creamy beans, roasted whole cloves of garlic - lots of garlic,  yeah!  Served in a paper bag. The salsas and pickled veggies on the table were very fresh and bright.  The bottle of sauce on the table is habanero,  spicy.The agua frescas all delicious.You order at the counter near the entrance,  and they bring the food to your table. This was at lunch.  No reservations at lunch. I hope they start allowing orders of individual tacos, instead of a mandatory two.  Not everyone eats everything, so it's not always easy to just share. The back room, that they call the patio, smells a little funny.I must go back for the churros."], ["Justin F.", "NEVER IN MY LIFE have I experienced what I did last night at this bs establishment (spoiler alert: its at the end of this review).I drove three hours through traffic up from San Diego to LA as it is a good midway point for family. We were all getting together to celebrate my birthday!The restaurant had a TON of empty tables when we arrived yet service was sloooowwww. The food is good and unique but the kitchen is incapable of bringing out the entire party's  meal at one time. It took forever and the waitress was inattentive - I never was even offered a refill on my alcohol. By the time the end of the meal came around we wanted the famous churros but thought it would take forever. So we pay our $200 bill and fast forward ten mins and someone came over to ask us if we would move to the bar because he had another party to sit. Wtf? This place is tiny, you want the six of us to cram over at the bar in a line unable to socialize with each other because, \"they are waiting outside in the cold?\" No sir, fuck you, I will not go to the bar and give you more of my money...I'm leaving and will never be back.Tl;Dr opened up birthday gifts in the car because restaurant management are assholes that value single-hit profits over good experiences and repeat customers."], ["Steve L.", "Damn, I would give this place 6/5 stars. It was my first time there, and didn't really know what to order. The waiter was super cool and accommodating, kind of helping me and my gf through the menu. So things that you can try if it's your first time there with no disappointments are: Campechana Verde (really refreshing ceviche with seafood, cucumbers, and some spice. Get the Grilled Brentwood Corn side for sure, it's so flavorful and good as an appetizer. Carne Asada and Cebada con Pollo are awesome dishes. and lastly we finished off with the churros. Honestly, when I saw the menu, I was like what can possible be different about this place compared to any other tacos and meat served at other mexican restaurants. But doode, I was wrong, everything is super flavorful and unique to my taste. Service is great too, the food came out in like 15 mins."], ["Carlos C.", "good service, good tacos, good drinks. Try the chorizo con papas tacos. Make sure you drop by the bar and grab one of their signature drinks. The bartender is really friendly. She gave us good conversation and earned them a good review. Keep it up guys and gals"], ["Christopher M.", "First off: the service here is absolutely incredible.  One of the tightest-run ships I've experienced, without feeling excessive or hovering.  I honestly wasn't terribly impressed by this place otherwise.  I didn't have any of the cocktails, and that might have turned the night around, but a lot of the food was perfectly fine yet utterly forgettable.  The \"rice and beans\" is a zesty little starter, I enjoyed this one quite a bit.  And their sauces that sit on the tables are absolutely spectacular.  But for some reason both the lemon pepper chicharrones and the carne asada that I ordered had an unpleasant fishy taste to them, no idea why.  Happy hour here is an incredible deal, and I'll likely return to partake in some of those incredible looking cocktails.  But there's just too much great Mexican food in LA, downtown even, to justify stopping in here even somewhat frequently."], ["Pete K.", "The only B.S. About this place is I haven't come earlier! Great food. Had the chicken tacos and I can already tell I'm going to crave them tomorrow."], ["Ellen S.", "I had dinner at BS Taqueria this past weekend with a group of friends. We had a larger group of 9 but I was easily able to make reservations online just two days before (I did have to provide my credit card number to hold the reservation since it was for a large party). We were seated in the front portion of the restaurant next to the bar. I didn't check out the back area so I'm not sure how large the restaurant actually is. I ordered the chorizo & papas tacos and the chicharrones. Both dishes were both just okay. The tacos were extremely flavorful and a bit too salty for me. The potatoes in the tacos were a nice addition and did balance out the saltiness of the chorizo a bit. The chicharrones was also pretty salty. Parking is always a huge hassle downtown. Parking meters are generally $5/hour in the area so you're better off looking for a cheap structure nearby."], ["Cherry T.", "This place was commended by NPR so my love and I decided to check it out..Great decision!BEST CHURROS EVER! They just melt in your mouth!Love of my life took me here last night, and we had a great experience! Place can get super busy, but trust me it's worth the wait. Drinks: They have cocktails that feature Mezcal, super yummy and pleasing to the eye!Food: We got the Champecana, Rice and Beans (totally not typical), Chicken chicharonnes, carne asada, pollo plate, and honestly just about all types of tacos they offered. ALL OF THEM WERE delish!This is not fusion food....it's Mexican food with a suprising twist. We will definitely be back!"], ["Monica N.", "Tacos come two per order and they're pretty good. The lengua was tender and cooked perfectly. The salsa isn't very authentic in my opinion. I think that's more my bias talking though. I want a real taco, I just can't get on board with this new hipster trendy taco. It's weird to me. I'm old and resistant to change. What I'm excited about is their plans to open for dinner (drinks) and Sunday brunch (more drinks). Keep in mind it's still brand new, and the staff has that dazed it's-my-first-day-on-the-job kind of feeling that makes them all seem like they don't know what they're doing yet. It's a learning curve though, it happens."], ["Sidney Z.", "Wow!That's my review. Thank you for reading it.Oops, YELP is not allowing this review. So, I must pontificate:The \"Wow\" factor is a good thing in every arena. Something as benign as a smile to as important as a John Coultrane solo. Wow = Good.B.S. Taqueria \"Wowed\" me today. It was just that good. Everything about this place worked. The location is in the heart of the new downtown L.A. The set-up is good; you walk in, order your food at the counter, and take your number place it on your table and wait for the good stuff to happen. It's super clean and the staff is super friendly and helpful.Now lets talk about the good stuff happening. I ordered shrimp tacos and the Brentwood corn. The two tacos you get are laying in a heavier corn tortilla than usual. This proves to be important due to the fact that there is so much going on, in and on these tacos, that this heavier tortilla holds the whole thing together without it falling apart. Good form B.S. It is very much an excellent taco (the first Wow).I have had corn prepared 1,000 different ways. Ray Garcia's Brentwood Corn-on-the-cob-on-a-stick is eons better than any corn dish I have ever eaten. Understand the gravity of what I just said. This means that the 999 other corn recipes I have eaten were inferior to this (yeah, the second Wow). This dish was unbelievable - period.I would have ordered dessert, but the meter I had just put 2 hours worth of parking on hiccuped and only gave me 45 minutes (thanks L.A. for another broken parking meter). I had to rush off to avoid an $85.00 ticket.But, be sure I will return!"], ["Hae A.", "The first thing I noticed on the menu was how quickly they had raised their prices after receiving attention from Jonathan Gold. Beans and rice were good. I liked the flavor.  Clams and lardo tacos were unpleasantly greasy. Yes,  I know what lardo is. But the lardo tasted greasy and bland rather than rich and flavorful.  Cauliflower was good. This was my favorite dish. But it was a tad overpriced for what it was.  I liked the churro. Light,  airy,  fluffy.  The chocolate with a hint of spice was perfect with the churro. Overall,  it was overpriced for what it was."], ["Amy S.", "LA-Mexican inspired outpost by chef Ray Garcia. Beautiful, fun, colorful space, great for a casual lunch with co-workers or friends. They just started full service dinner too!Not your typical tacos, but if you are willing to try something new, this is the place! Garcia twists up traditional dishes and infuses dishes he grew up on in LA.Tried a few items on the menu: Lengua tacos, Grilled chicken tacos, Bologna tacos (surprisingly tasty!), chicken chicharrones (just what it sounds like), clam and lardo (unique and interesting!).The Campechana Verde (like a ceviche) was a favorite! Bright and citrus-y: Squid, Scallop, Snapper, Cucumber, Shrimp, Octopus, Tomatillo, Tostadas...Also loved his take on churros.As an example of his creativity in the kitchen, chef Garcia makes a matzo ball soup made out of masa instead of matzoh meal."], ["Salem D.", "Came here with the hubby over the weekend. Nice friendly staff greeted us, which is rare. The waiter was friendly and we had great service. As far as our food, wow. Everything was delicious! We were hungry and also curious so we tried a few things. He had lengua tacos which he loved and I had the chicken tacos which were great! We shared the carnes asada which we ate too quickly and we ended the dinner with the eggplant dish, which was surprisingly good and flavorful! I lived that the manager kept walking around the room and making sure every one at every take was happy. This was very appreciated. They kept my cup full of water, which u appreciated because some of the things were a bit spicy (for my weak palet!). Anyway, I highly recommend and we will be returning. Oh and my drink, the tamarind one, was amazing!! A must!"], ["Candace J.", "Just visited B.S Taqueria for dinner for my first time and was thoroughly impressed once again! I had the campechana verde, which was heavenly and absolutely perfect for a hot day like today downtown! I also got the chorizo and papas tacos which were amazing and have a creamy cheese with crispy edges! You MUST order a side of their rice and beans, which is actually puffed rice with fried garbanzos, chili, and cheese and was literally on every single table. Their bean dip with chicharon was a game changer and I swear could eat a pint of that stuff! Their cocktails are always balanced and really go well with the food.Open a B.S. Taqueria is West Hollywood too!!! (Pretty please!)Ps. The grilled corn is TO DIE FOR!"], ["Ruby Y.", "Believe the hype, this place is phenomenal!!!!B.S. Taqueria has great ambience and decor, excellent service, and delicious food.  I didn't really know what to expect from the place because the menu looked interesting but pricey, but we stopped in for dinner tonight and had an amazing time.For starters, they have a great happy hour that lasts until 6:30 PM (not sure when it starts, unfortunately), even on a Friday.  All drinks are 50% off, which is great because at full price, cocktails are 10+ a piece.We ordered the chicharrones, the chorizo y papas tacos, the campechano verde and the churros and everything was absolutely delicious.The tacos and churros were definitely standouts.  The churros were so airy and delicious ugh between two of us we inhaled the order in like 1 minute.The chicharrones are super tasty, they have a great lemony flavor, and the chicken oysters are super fatty, moist, flavorful and delicious.  Unfortunately they only come with probably 3 pieces of chicken and the rest is the skins, which are really delicious, but also really heavy, so I'd say only order these if you're sharing!The campechano verde had really fresh seafood in it and a nice spicy kick, but I thought it needed more acid.  We asked our server for some limes and squeezed them in and it was perfect after that!The restaurant is crazy dark though, when we finished dinner and walked outside I was like completely disoriented by how light it was outside.  Whether that's a good or bad thing I haven't really decided yet, because it kind of felt like we were in a different world while we were in there, it was nice!The decor is super adorable and the food is great, def worth checking out."], ["Andrea H.", "I've been here several times and have tried most of the menu. The food is very explosive in flavors and quite bold. Don't expect traditional Mexican here, everything has been taken up a notch with a twist. Coming here with a group of at least 4 will allow you to try and explore the menu. The \"rice & beans\" is one of my favorites. Puffed rice and the flavor of the seasoning makes this is good. Also try the clam & lardo and, chorizo & papas tacos, the Carne Asada. Don't miss the churros, you may not want to share these. They are that good. Their cocktail menu is quite unique and good. Service is attentive and efficient."], ["Andy L.", "Do yourself a HUGE favor and get the churros. Even if that's how you start off your meal or that's all you get, do it. I promise you won't regret it. The beef tongue tacos are small but pack an umami punch! Amazingly unique Rice and bean dish. Just try it, trust me! Thank you Chris for being such a great host to our lunch!"], ["Andrew T.", "Place is almost too good!  Normally I'm very skeptical of tacos are ever $5 or more per taco... But this place is worth it!  The shrimp taco was one of the most flavorful and best tacos I've had.  They also had an horchata-like drink (forgot the name but it's very similar) that I highly recommend getting.  Their lengua tacos were super solid, but not quite as high of a level compared to their shrimp tacos.  Competing w the shrimp tacos, I think my favorite dish was their lemon pepper chicken chicarrones.  This flavor packed dish had great crispy texture and made me feel like I was eating a savory snack that I never wanted to stop eating.  Ok... Enough from me... Go try it for yourself!  But last thing, nice comfortable and simple atmosphere.  Very pleasant and definitely could take a date their if you want to."], ["Dylan A.", "What more can I say than in the words of J. Gold himself; why not? As in why not try everything, seriously. Top to bottom, from the agua frescas to the mezcales and cocktails ( best happy hr downtown ). Ray Garcia's food is out of this world, whether you're going for tacos or more traditional plates it's hard to call which dish was the favorite, because again, they're all amazing. And the tres leches and churros change the game (drops mic)!"], ["Soo H.", "Very tasty but wish everything wasn't quite so heavy.  I had the lengua tacos, the famous clam tacos, and my friends and I shared the rice and beans.  My friend also had the carne asada.The food is all delicious but it is very rich.  I had hoped that the sides (like the rice and beans) would be a little bit lighter to balance everything out, but maybe that was our fault for ordering poorly since they do have some veggie and salad options.  Overall, the decor in here is colorful and fun and the food is tasty, albeit a bit pricy.  The clam tacos are a little different and def worth the hype although I'm not entirely sure I would say they're worth $7 a pop.Not a bad addition to dtla but in all honesty I wish mo-chica were still here in its place."], ["Nancy Y.", "Bull Shit is right. Very unimpressed.Maybe it's because for $8 I expect my tacos to come with breast meat and not thigh meat.I'm also chewing on the chewy thigh meat wondering if it's fully cooked, because damn, this is a chewy piece of meat.I double checked and they didn't give me beef.It's like Carl's Jr. Place your order at the counter. They bring your food, and you get your own water. Tastes just as crappy as Carl's Jr. Bonus! This place has a bar. Maybe to hide the taste of chewy (possibly undercooked) chicken.I don't know how this place has so many starts. Purchased reviews maybe???I won't be back. Don't waste your time or money."], ["Alan T.", "Went for lunch. I got the carnitas tacos. They were good!The prices are a little out of touch with taco prices pretty much anywhere else. $9 is a lot for two average sized tacos.Be prepared to send some time looking for parking or paying for a spot. This part of downtown is a headache with a car."], ["Maria M.", "Just when you thought you've had every single taco and taco truck in so cal, I was proved corrected. This taco spot is on point! The tortillas are different, complex and delicious. The meats are carefully orchestrated to bring you the best flavor. I enjoyed the choriZo and vegetarian tacos. My absolute favorite are the chicharon appetizers. That and a BS handshake, it feels like 1991 all over again!"], ["Denny C.", "I had some high hopes for BS Taqueria, which is blowing up over all the food blogs.  I came here last week with some friends for DineLA.  We had reservations so there weren't any issues getting a table.  The layout is kinda weird.  Similar to some other restaurants downtown, there's a small space right when you come in, and then a much larger seating area in the back.  This seating area in the back kind of reminded me of a Rain Forest Cafe set up in terms of the fake trees and attempt to create a space that was tropical.  A bit hokey, if you ask me.I ordered off the DineLA menu.  I got an order of the chorizo and potato tacos (which come, like most of their tacos do by default on a blue corn tortilla), the cabbage and cueritos, and since we went on a Monday, we got the mushroom tamales.  I ended my meal with tres leches.It was a classic example of how taste can be so subjective.  I thought everything I had was just about ordinary or suffered from some flaws.  For example, I thought the tacos, while interesting, were overly salty, and I thought the tres leches was way too sweet.  The cabbage ended up being more like a coleslaw, but unfortunately, a lot of the vinegar they used (or whatever flavor that made it tart) crept to the bottom and so the first half was fine and the bottom half was overly flavored.  The only thing that I thought was appropriately flavored were the mushroom tamales, a type I'd never had before.  I will say this, though:  they said the portions for the entree were plus sized.  In the end, I got two tamales - something that felt like a good amount of food, but I'd never call that plus sized.On the other hand, two of my friends thought the tacos were flavored just right, and another thought they weren't flavorful enough.  Yikes!Service:  Water refills were a hit or miss, but our server was LA-friendly.  Bottom line:  The food here is really heavy and heavily seasoned.  Make sure your taste buds are ready."], ["Bridgett O.", "Absolutely amazing food and cocktails! The carnitas and chicken tacos are beyond amazing and just packed full of so many flavors. I was stuffed after two! The green salad had a beautiful and well balanced dressing that is a great compliment to the flavor explosion in the tacos. The Gordo Cup was a delicious drink and highly recommended. Natasha had great recommendations and always made sure we were well taken care of."], ["Lisette C.", "Stopped at BS for lunch this week.  Was really optimistic.  Upon arriving at peak lunch time, we were pleased to see seating options, but still a nice busy buzz about the place.The staff that greeted us was friendly and informative and very eager to help.On these fronts, BS is great.  Cute decor and friendly staff.The problem was that my colleague and I spent $43 on 2 tacos, a small cucumber salad side and an agua fresca each...REALLY?  WAY TOO EXPENSIVE. WAY.Ok, I know, if something is AMAZINGLY delicious, then you suck it up and pay the $43...but it really wasn't.  The tortillas were blue corn and the guacamole was good...but that was it.  The cucumber salad was kinda bland and forgettable and the aguas frescas were too sweet and lacked any real flavor (tamarindo/apple and watermelon mint).  It was a really lackluster experience.  It wasn't terrible by any means, but i would have been happy to pay $10 for my meal....not $20+.  Sadly, I have to intention of returning."], ["Katrina S.", "The intrigue of this place was strong, so come Sunday Funday, the crew decided to meet for dinner at BS.  A big mistake of ours was coming the day after a glowing Jonathan Gold/LA Times review.  We arrived just after the doors open and they were slammed within an hour.  The menu was unique and kinda difficult to assess since all the dishes were limited to the likes of sides or tacos.  We were there to eat and it seemed our group would be forced to order the $29 Plus Size Daily Special (which appealed to none of us) in order to satiate ourselves.  After being frustrated with the options and blinded by the camera flashes of Joe Schmoe food bloggers, we decided to stick with tacos and drinks for a warm up and then head out to another spot for dinner.Of the tacos, we ordered the Carnitas and the obligatory Clams & Lardo.  To be honest, they were ok.  But after the 9 and 14 dollars ticket price, I was so over it.  As for the drinks, the Hoja Santa was raved about, so I went for it.  I can seriously handle any drink, but this one challenged me.  I'm assuming it was that damn leaf that was foliaging up the glass, but everytime my nose approached the lip for a sip, I'd get a whif of feet.  No joke.  I stuck with it though and finished it.  But that's because I was paying 12 dollars... to smell feet.The place is gorgeously decorated.  And I'm sure the staff is great (our visit was rough, but I'm blaming Gold for those pitfalls).  But this place is definitely not my scene and all the scenesters are welcome to have it."], ["Ray N.", "Came here after Sugar Fish, since my friend and I were craving dessert. Yes, we did go to Bottega Louie, but the macarons and cake were eh.The interior is like a mexican bar, but more of a sexy-fied version. Candles lit and super clean environment.Service was perfect. Our waiter Sam was EXTREMELY friendly and great with suggestions! Extra points for being super cute too (I think)-- not sure since I was a little tipsy.The food was pretty delicious. I got the carne asada, which was so good. The steak was medium rare and had lots of flavor. Although it's a tad more chewier, I don't know how to really eat this with the tortilla (inside I ate it without the tortilla). I also got the tamarindo cocktail (since it was HH)-- the drink was pretty good as well (more on the bland side, but had that extra kick from the tamarind). My friend got the lenguas taco-- those were SO AMAZING. Cooked perfectly and had lots of flavor from the salsa. Last but not least, CHURROS WERE INSANELY delicious! Probably one of the best churros ever! The dip was sweet yet spicy, which provided an extra kick! The churros were fried to perfection-- more soft on the inside though. But nonetheless, so. damn. delicious!Overall,  I really enjoyed my experience here. Service was beyond terrific and food was pretty good. -1 star for location, only since parking is always so damn difficult in DTLA. Would I come back? Yes!"], ["Tuanni P.", "This place was pretty awesome! The service was friendly and helpful. The food, well it was packed with flavor. Each bite seemed to have a different unique flavor from spicy to citrus, to simply savory.The portions were just the right size so you leave feeling happy,satisfied and not needing a nap. I do recommend starting off with a couple appetizers. We had the chicken skins and the beans and rice.Price was in my sweet spot, dinner for two, plus glass of wine including tip $50.Beware however that it is not your typical Mexican food. It's upgraded Mexican, trendy bites, and refreshing.The wine list short and great! Just a couple of well selected choices. The place is cute, intimate atmosphere with modest decorations however well thought out with a great theme."], ["Alyson B.", "Delicious and amazing environment!!! You can't go wrong with any of the dishes - amazing flavor!"], ["Anderson L.", "I appreciate the time the manager took to reply to my review.  But I still strongly believe that this place is NOT fit for large parties and the large party pre-fix menu either needs to be adjusted or eliminated."], ["Gev M.", "It happens way too often... it's Sunday night, I'm craving Mexican food, and Guisados is closed.  Oh wait, there's Case la .... no, closed.  Bar Ama? Hmmmm... a little too fancy.  And Chipotle never seems to be a good idea the next morning.  It's at this point that I pick up a $2 bag of Santitas from Circle K, rummage for an avocado in my fridge, and settle for the (4th) next best thing.  Enter B.S. Taqueria.  Admittedly, I was initially turned off by the lack of veggie-friendly taco options, but was swayed by their many vegetarian sides and full bar. After just one visit, I have to say that I am a fan and will definitely return.Ambience was great - lively, but not obnoxious.  And can we please talk about the picnic area in the back that looks like a themed party gone bad? It was spectacular!  Staff was friendly too.  They were constantly checking in and making sure we were content.  Props to Sam, our waiter, for handling our seemingly infinite questions like a champ.The food was mostly a hit.  Doritos were OK.  \"Rice and beans\" were really interesting - with puffed rice, toasted garbanzo and summer beans, sprinkled with cotija cheese - and surprisingly, pretty filling.  Cucumber salad was a nice and light side dish with just a little bit of kick to it; I wish there was more.  The cauliflower al pastor was my favorite.  Although my eyes were watering as I was eating it (my spicy tolerance is -5), I couldn't stop myself.  I ordered a small side of guac and went to town.  And finally, and from what I recall, as I was pretty tipsy at that point, the calabacitas tacos were pretty good too. That brings me to the drinks.  Not a super big fan of mascal, but the Orange Bang ($11) was pretty great.   I also had the hoja santa ($12), which was a-OK.Overall, a great experience!"], ["Frankie O.", "Heard some good things about this place, and based on my great experience at Broken Spanish, my wife and I dropped by for a Monday lunch in early October. FANTASTIC. Although we only tried three items, we were both blown away. I'm a pretty picky Mexican, and I was not looking for boring Mexican food. BINGO. What I found was progressive, non-traditional Mexican food, definitely not-my-mothers-cooking.The dishes are simple in nature, but seriously thoughtful. Every bite was tasty, from start to finish. We had started with the mushroom & garlic tacos, rolled into the eggplant special dish, and topped it off with what I call legendary churros. But for my fellow Mexicans who prefer the thick, batter-laden traditional churros you find in Mexico, this is not for you. The airy-ness , the reduced milk chocolate dipping sauce, not too sweet, not heavy at all....best dessert I've had in awhile. Awesome drink collection of craft beers and cocktails as well.Can't wait to come back for dinner and experience the \"platos especiales\". Fun, tasty comfort food, that represents the best of what modern latino foods have to offer. Shout out to the servers for excellent service."], ["Mariecar M.", "I love the chorizo and papas tacos here... In fact, if I could just get two scoops of that stuff on my plate with a side of chips, I'd be perfectly happy.Their cocktails are good too... I had the Orange Blast and really enjoyed it (though I couldn't have more than one because it is pretty creamy).Their juice drinks are good too, but super sweet so be sure to ask them to water it down... Or if you're like me, get the watermelon drink, go to the bar and also ask for a shot of gin  It really does help cut the sweetness!But I do have to agree with some other Yelpers in that it's pretty expensive for how much food you get."], ["Rosana R.", "The food was tasty, drinks were strong! Came in with my friends after a night of drinking. We got some tacos, the al pastor cauliflower, and a few other things. The tacos were really good and the salsa was spicy! I really enjoyed their take on the al pastor cauliflower. Friendly waiter with great suggestions."], ["Sarah S.", "Popped in here for a quick, late night snack before heading across the street to Barrel Down. We must've sat down close to 11pm, unaware they closed at that time, but they were cool about it. Everyone was really nice-- but it got kind of annoying to the point where it felt like they kept hovering over us (but that could've been since we came close to closing).Obviously this place is a nicer restaurant so you're not going to find cheap tacos here-- I split the Lengua Tacos (2) with my sister which came out to $8. Not cheap, but they were really good. I also got their Citrus Agua Fresca-- I think they feature a special one daily-- and it consisted of orange/blood orange/grapefruit. So refreshing!Overall, this place is OK, it just wasn't anything THAT memorable. I wouldn't mind coming back though to try more of their stuff."], ["Mui K.", "This is located in a trendy area of DTLA, on the same block as Bottega Louie actually.  So you should expect it's going to be trendy food and good looking people.  BS Taqueria is a slight twist on your usual taco but not too much of a departure.  I wish they had done a little bit more to be innovative and creative.I'm wavering between a 3 and 4 star rating but I'll round up since the service was good.Food+Tacos!  They hand make their tortillas so it has an excellent texture.  The meat they use for it is also delicious.  Pork was fork tender and chicken was juicy.  Each order comes with two tacos which was pretty filling for me.+Rice and beans.  They toast the rice and beans so it has a nice crunch to it and has a nice lemony tang.  It's nothing like the traditional with the soft rice and soupy beans.  I highly recommend this!+Campechana Verde.  Wow this was good.  It's like a seafood ceviche with tons of avocado.  I wish they would automatically serve a basket of chips with this.  It only came with 3 chips so we had to ask for more.+Service.  Waiter was excellent and checked on us a lot.+Food came out fast.+Romantic ambiance.-A little pricey but reasonable for the area.Overall I'm a fan of this place.  Great service and good food!  ***Though I will add my husband would rather go to your mom and pop taco shop.  We spent about $60 for the two of us"]], "Tabachines Cocina": [], "Manuel's Original El Tepeyac Cafe": [["Jennica R.", "My first time here was three years ago. My bf suggested it cuz he'd seen the place on Man vs. Food. Back then, I remember a long line just waiting to be seated inside for lunch. But when I've visited, it's basically hit or miss. There is a pick-up window on the side for Take-Out orders. On Yelp, there's a link to their Actual menu making it super convenient to order if you're on the go. They have their own personal parking lot ONLY for Customers. Street parking is also available. Service is super friendly, quick, and efficient. Every time I've had take out for Pick-up, my food is always accurate, fresh, hot, and ready! When dining in, the waitresses are nice, attentive, and on top of everything. Despite a busy night, we got our drinks immediately and our food literally came out in 5 minutes!! Love the complimentary tortilla chips and salsa cuz the chips are SO crispy! The Food here is Huge, Colorful, and Delicious, especially their Burritos! Every time I visit, I usually alternate between the Okie and Hollenbeck Chicken (Pollo) Burrito. The Okie de Pollo has shredded chicken with onions, tomatoes, rice, beans, and guacamole drizzled with cheddar or jack cheese and red enchilada sauce. The Hollenbeck de Pollo is the same exact burrito, except with Ranchera sauce. Both are $10.85. My pics show everything minus the Guac cuz I'm not a big fan. Last night, I opted for the Okie de Carne Asada (with Beef) which was good, but not nearly as great as the Chicken and a little pricier at $11.50. Whenever I visit, I plan to try something new and different but always give in to the Burritos! I'm sure everything else is amazingly good, but if you're unsure of what to get I highly recommend the Okie or Hollenbeck Burritos! You'll definitely leave with a full, happy belly!!!"], ["Nancy M.", "I was really expecting more since this place was recommended by many people.  Unfortunately, the waitress that helped me was rude and the food was ok.  The beans were dried, the rice cold, and the tortilla was cold.  I'll go back though and maybe try breakfast.  By the way I had the machaca burrito."], ["Andres V.", "El Cholos Burger has the amazing taste in every bite juicy tender Its so good you will be amazed by the flavor enjoy! This is the 16oz (1.lb) Burger so Good its a must have!"], ["Hazel L.", "As a full blooded Mexican, I wish I could give this place a 1/2 star. How can a Mexican restaurant NOT have carnitas or lengua or possibly buche? I came here with family members of the owner who originally opened the place expecting a lot more. I got a lot less though. So dissatisfied of the menu, I ordered a plain bean & cheese burrito due to their lack of bomb meat options (I'm sorry but chicken & carne asada is too basic for me). The cheese was not even melted, it took 25 minutes when 3 people behind me got their order, and the cheese wasn't even melted. Never again.Oh, and it came with a metal shaving which the cook pulled off with his bare dirty finger from the beans on my plate."], ["Alice C.", "I got the #6 Taco & Enchilada combo to go. PROS:The chicken enchilada, rice, and beans were pretty good. They gave me lots of lettuce and tomato which was nice. I love the red sauce, and will definitely be getting that again. The chicken was also really tender.CONS:The beef taco was not very good. The shell got a little soggy (but such is the nature of take out tacos, which is my bad.) It was more so that the meat wasn't seasoned well (or at all?) -- it could have used more flavor. I ended up eating it only because I hate wasting food and the copious amount of cheese gave it some oomph.Overall, I would give the food I had that day a 3.5 (variable, depending on the item), but I rounded up to 4 because of the other perks like the friendly service and free parking. Take out was also packaged securely enough that it didn't make a big ol' mess all over my floor mats, so that's always a win. Next time, I'll likely stick to the enchiladas or something that comes with a soft shell, and the chicken...or a big burrito depending on how little fat girlish I'm feeling."], ["Garrick A.", "Been coming here for years. Usually get the Machaca burrito or the Manuel Special/Hollenbeck. If you get the Manuel Special/Hollenbeck try to get the steak because the carnitas is usually overcooked."], ["Arnold O.", "This is hands down the best Mexican food you will find anywhere! The atmosphere adds to the experience. I've been coming here since I was born. Or I should say my parents have been coming here since I was born! My favorite is the Hollenbeck burrito and the taquitos. You have to try..."], ["Marc I.", "We went to El Tapeyac on. Saturday evening around 7:30 and did not have to wait!  The flavors were amazing and the food was fresh.  Great value and good food hard to fine this combo anymore!  Not in the best neighborhood but worth the risk."], ["Matthew K.", "Love the burritos here... I get the chicken burrito (holenback de pollo) with no rice and beans! Just a ton of chicken and guac inside this massive tortilla. The ambience is 'homey' and adds to the authenticity of the food. Definitely a hidden gem for a filling meal."], ["Erick R.", "Came here with my wife and here nephew a while back. This was my first visit here and would say it was well worth it. Parking lot much like restaurant itself is quite small. We did 3 laps around the lot before finding a spot. Afterwards, we had to wait in line for a little over a half hour to dine inside which tells you how good they really are. By the time we got in a sat down, I was starving!  Our meal orders taken shortly after and food arrived hot and fresh within minutes. I had ordered their specialty (breakfast) burrito and let me tell you... Each bite was like a little bit of heaven. I can't wait to come back and wait in line again!"], ["Susie M.", "Had not been here in 15 years because we would drive by and it's always so crowded with people standing outside and no parking. Today was our lucky day!  We  found a parking space and atable. It was all so delicious as we remembered. 10:45 a.m. was a perfect time to arrive."], ["Amy S.", "Bf gets the breakfast burrito. So good!Last time I got Chilaquiles and it was so big! Flavors were bomb. Would get again. Their menu says this one takes 15 mins to make so call ahead to place your order. Parking: small free private lot dedicated to them."], ["Elias R.", "After hearing a lot of hype about this place I finally came with some friends and ordered the Manuel's special burrito and wow I thought it would be bigger but it's still pretty big and very filling it feed all me and three others pretty well, the food is very delicious and full of flavor. The location is somewhat small with just a few tables. The staff Is hella friendly and automatically make you feel welcome. Great little place in to eat great food. Also this place has appeared on Travel Channels \"Man v. Food\""], ["Marlyn R.", "I love coming here for their well known Manuel special burrito. It just hits the spot. The melted cheese covered burrito, stuffed with goodness is well worth the price! This place usually gets really busy on weekends but good news *you can order ahead of time to avoid the anxious line waiting outside their doors!"], ["Federico M.", "No lie, I've been coming to this place a few times a year ever since I was five years old. Three decades later and I can honestly say the food has not changed one bit. The food taste exactly the same for all these years and why would they change it if they created a menu that keeps the masses coming back for more and more and more. Throughout the years I have tasted everything on the menu and everything taste sooooooo good. If someone said I have to eat at the same restaurant for the rest of my life I will probably pick this place, it's that good. (Disclosure: food tastes like me moms home cooking and that's probably why I wouldn't mind eating it for the rest my life.)"], ["Lisa G.", "Oh so yummy.  There is a very small lot and street parking, but it usually gets crowded around the lunch hour so try to go before or after or you'll have to scramble for parking and wait to be seated.I had an enchilada with a taco and yes, it was amazingly good!  We also had to get a side of guacamole.  The burritos looked massive!  Prices are reasonable, especially for the big portions.  Everything they serve is doused with a delicious sauce.  It's very filling so make sure to wear your stretchy pants!"], ["S V.", "What a disappointment this place turned out to be on a b'day exploration.  Went because we looked at the pic of the supposed biggest burrito.  Took professional camera to post on my blog and what came in front of me was a lot of hot air.  I wanted jalapeno's for some heat and what I got was fried slices of jalapeño.Please open your burrito to check for meat because I swear I got but 2 small bites of meat on my 1/2 of this falsely advertised burrito.  $14 for nothing but rice, beans, guacamole.   Shame on you for taking advantage of whatever fame you think you have from other customers posting burritos the size of a plate.  The waitress obviously was clueless to catch on that I wanted some hot hot sauce."], ["Efrain M.", "You can never go wrong with a manuels special machaca of course for a meal to share with friends. This place has been here for ever and as long as its here i will always know what to get."], ["Clara L.", "holy...burrito!a coworker of mine was talking about how she grew up eating at this neighborhood spotand when i saw it had 1000+ yelp reviews i had to check it outi got the machaca (shredded beef) burritohollenback style (they douse the whole thing in ranchera sauce which has PORK/veggies, add a mound of cheddar cheese which melts on top like a blanket of yellow-orange sunset love)i think the pork was pork belly stewed until it falls apart on your forki almost criedi didn't opt for the beans or cheesebecause i didn't want to die a slow death at the officebut the thing was still stankin' deliciousi wish the ranchera sauce was a little spicier but otherwise please don't do a thing to that machacaservice was quick and efficient"], ["Alan L.", "It was delicious for a $30 burrito. However, I don't like to give out five stars unless I have been completely and utterly astounded. The avocados, though, give you an extra star. I do appreciate, however, placing the beans as a side order. My stomach cannot handle the refrying of beans, although my friends have assured me that the beans were quite enjoyable. You are an appreciated member of the burrito society. Continue on your mighty quest to serve your magnificent burritos to the world."]], "El Huarachito": [["Kerry O.", "Love breakfast here, but bring cash!!!  And you should try their El Vampiro juice - delicious!!"], ["Erika A.", "Simply good and authentic food for a phenomenal deal.  A must try if you on this side of town.  Bring cash in hand because these folks do it the old school way."], ["Matthew W.", "My favorite breakfast place ever. Huevos ran heros are amazing. I also recommend huevos divorciados."], ["Cristina F.", "I was convinced that I needed to come here cause I saw real cotija cheese in the pictures.Then I went in and ordered a giant carne asada burrito smothered in molé.  I didn't get molé all over my blouse (for once) cause it all made it into my mouf ! Ohthemeatwasntallthatgreat, but the molé made up for it. Seriously - it wasn't crazy sweet. It was pretty damn good. I also ordered an agua de jamaica, but I'm super glad they brought out the wrong drink. The agua de melon they brought out was the best one I've ever had. No joke.But then I look at the pictures I took and I get kinda sad cause this place closes at 5 pm. At 5 pm!? So sad. I'll never have it for dinner:( oh and it's cash only!I think I'll have to plan a two hour lunch for the next time all the bosses go away cause I needs to get me another agua de melon."], ["Melinda G.", "Cash only!!!I tried this place out last year after bookmarking it on yelp with my parents. I was kinda nervous, as a mexican who hardly eats mexican food in restaurants (taco trucks don't count) I knew my parents would be complaining all throughout breakfast if something wasn't done they way they like it but I took a chance anyway.My dad got the huevos rancheros and me and mom ordered the chilaquiles. My mom did her usual questioning, how do you make the salsa, do you pour it over the tortillas or cook it in it blah dee blah blah (cooking talk I don't understand) The woman taking our order was very kind answered all pie questions and even said she could make a different more \"waterey\" sauce (the way my mom likes) as opposed to the regular red or green. Food came out timely everything was amazing. My parents are hardly impressed my mexican food, my mother is a phenomenal cook so for them to like something and compliment the meal the whole time is a big deal. The handemade tortillas are amazing and the aguas are mind blowing. Nopal and piña?! My family lives in east la so this area is a little unknown to us but now it's our spot !!!Easily best mexican restaurant in laEdit: just editing this to say another reason why I love this place is really the people. You can tell a family owns it they are there everyday smiling and welcoming. I brought my parents again and after taking our order the woman asked if we wanted a spicier salsa. She didn't need to or have to, it was quite busy on a Sunday for breakfast but you can tell they take the time to make sure you are comfortable and enjoying their food!"], ["Veronica V.", "This place is great! They have large servings, very yummy and filling Mexican food and if you want it a lil'extra spicy they have some nice salsa that you can ask for to do the trick. Its family ran and they are on it, if they run out of something they will make a supply-run to the next door market.It took me a while to find good Mexican food closer to home so it took me just as long to share with others -Only because I'm greedy and didn't want them going to the location and enjoying the yummy food without me! And sure enough once I shared this place with family and friends they started going without me -meh, oh well Good times!.Anyway they have a good variety of Mexican dishes/drinks but my personal favorites are the Delicious and refreshing natural aguas frescas, more specifically the agua de Nopal con Piña (cactus and pineapple) - a weird combination but totally yumm! Food-wise, I especially enjoy the steak and chilaquiles and always recommend the El Rey plate, which has a nice amount of food, steak, beans, rice and more. Their horchata and coffee, er Cafe de la Olla are also pretty good. The minus 1 star is due to their Customer Service, this can vary, sometimes they are great very attentive and other times (to put it nicely) they are rushed and frazzled, you have to experience it for yourself - But You just have to remember we are all human and we all have good and bad days... Totally understand and this is why I keep coming back --- Great Eats!Tip: Cash Only -but they have an ATM right outside their door,        Plenty of Street Parking,        Best Time to go is early; 8am or Noon as it tends to get a bit crowded.Enjoy!"], ["Lluvia G.", "The food is bomb dot com. The staff is super attentive and the food feels like you're at home getting a warm meal from mom. Try the menudo!"], ["William T.", "So my 2 star review got flagged and removed. Well here's a brand new 1 star review for this terrible Mexican restaurant. The tacos here are the worst tacos I've ever had in my entire life. The meat was burnt pieces of carne asada. It tasted like beef jerky. I thought maybe it was just what I ordered that was bad so I tried my cousins chicken tacos and they were gross. It was way too dry. Also had a bite of my uncles burrito, also gross. It tasted like a microwaved burrito from 7-Eleven. Is this place for real?Tacos are the quintessential Mexican food. If they can't get tacos right then I surely wouldn't want to try any other dish.I really don't know why this place is rated so highly on here (fake reviews maybe). The food sucks. Though the service was excellent. Our waitress was super friendly and attentive. Would I eat here again? No way...not even for free."], ["Sylvia F.", "If I could make it 5 golden stars I would not hesitate! This place is by far one of the best mexican restuarants in all of Los Angeles.  Nestled in Lincoln Heights which is east of downtown LA it's worth getting to. It's not fancy by all means a very humble place but once you taste the food in your mouth atmosphere is irrelevant.  The sauces are fresh and delicious.  This time around I ordered the Pozole and it did not disappoint in fact it was perfect on this chilly day which was New Years day and also great for my previous night of drinking, wink. My husband ordered the huevos divorciados. Divorced eggs.....one in a red sauce the other in a green sauce, hence the name. He was in heaven! Loving every bite! When we told the owner we were out of towners she began to roll out different food for us to sample.  This was so wonderfully good as we enjoyed each thing she brought out. Happy dance! I highly recommend this place to all my California family and friends! I'm just sad I'm in Florida and have to wait until I return to feast on this deliciousness."], ["Chiyon Y.", "I love Huevos Rancheros and El Huarachito is known to have the best Huevos Rancheros in LA. I was really looking forward to trying them out and was quite disappointed. The first thing I noticed was that they give you breakfast potatoes (which was salty) instead of rice, making it, imho, an odd combination to eat with the refried beans. The tortilla was warm and crisp, you could tell they had just fried it. The eggs were cooked perfectly. So what was my disappointment? The salsa. It brings the dish together and this one was salty and had nothing special about it. I ended up eating the eggs and tortilla leaving the potatoes, refried beans and salsa. On the plus side, the service is very friendly."], ["Andy S.", "This heartfelt and well composed chilaquiles presently carries the champs' belt. The fresh tortilla chips are uniform in size and texture. Well sauced with a red or green blend of chiles and the bright acidity of lime, the chips are not the wilted masa-mush that has infected taquerias nationwide. Softly crunchy and not swimming, the bed of corny goodness has delishly larded refried beans as a dancing partner. Topped with \"the parmesan of Mexico\", cotijo, and a not-too-thin crema, that brings the gutty comfort into balance.The storefront is clean and pleasant with attentive and kind service. The cinnamony vs. Sugary horchata, along with a competent example of red mole rounded out my great time at this earnestly exceptional establishment. No matter where you are in L.A., this isn't too far. Have some wanderlust!"], ["S Z.", "Delicious mole!!  Ordered the cheese enchilada with mole and the mole was exactly how I like it, not too sweet, not too bitter and with a kick.My husband had the chicken mole and the tortillas were so soft and went great with the moleOn my list of places I need to visit more when I come down here!"], ["Joe W.", "If you blink twice you'll miss it...food is great and the environment could not be more relaxed.  Worth another visit for sure. The Chilaquiles were so good they brought tears to my eyes."], ["Edith R.", "Work right next to this small little gem, authentic Mexican food, I love the their mole enchiladas and Tortas, Sooooo good ! Only downside is they only accept cash"], ["Jamaica Y.", "Yelp, sometimes I think you are my long lost digital twin--leading me to fabulous gems in nooks and crannies all over the world.  At other rare times I think you are some type of dope fiend, talking total nonsense on the street corner.  It was apparently the drug abusing version of you that led me to El Huarachito, expecting hole in the wall Mexican food heaven.I drove across town with the hope of experiencing amazing huevos rancheros.  Unfortunately, I was pretty darn disappointed.The good:- fresh made tortillas- pretty decent guacamole (not awesome, just decent--creamy not chunky)- friendly and attentive server- the cucumber agua frescaThe less good:(just about everything else... but I'll be specific)- the papaya agua fresca is horrid- don't order the huevos rancheros--think a plain fried egg on a fried tortilla with some salsa thrown on it- the carne asada burrito was meh according to my dateThis is definitely not worth a trip from another part of Los Angeles.  You surely have a place just as good or better in your backyard."], ["Sarah P.", "Really good food! Had the chile relleno and it was tasty. Home cooked meal deal and great service."], ["Nancy A.", "I'm actually a bit hesitant to write a review for this spot.  Mainly because I want it all to myself and would hate it if it blows up and I have to wait a long time to get seated.  But alas, I should not be selfish - the world must know about this place.This spot is a hole-in-the-wall Mexican restaurant.  No fancy menu or fancy decor...just authenticity.  So real that it feels like I'm eating at my aunt's house.  The service is as real as it gets too -  the perfect amount of friendliness and service.  The manager lady (or I think she is?) is a total character.  She calls everyone nicknames and has the same loud personality like my aunt.  Love her!I've only been there for breakfast/brunch so I don't have much say on their dinner items. I wait at most 15-20 minutes for a table and I eat here at least twice a month.My go-to items are...- Chilaquiles (or the Campesino w/ Chorizo if I'm REALLY hungry) = the best in town.  You can order it in either green sauce or red sause. The green sauce has great flavor, but its waaaaaay to spicy for me to enjoy on my whole meal. So I usually get it in the red sauce.- Guacamole = lemony goodness- Cafe de Olla = legit"], ["Jimmy G.", "5 stars just based on taste. Not a \"date-night\" place to go, that's for sure. But when I get breakfast to go, it doesn't get any better. Campesino every time."], ["Carol L.", "There's just something about the weekend that's made more complete with some good, cheap breakfast.  I've had this place bookmarked for some time and finally remembered to offer it up for a meet-up with a friend.  We came at a good time just before families and those looking for hang-over grub packed in.Of course we had the CAFE DE LA OLLA.  There's piloncillo for that distinctive flavor and it's sweetened with sugar.  We split the HUEVOS CON CHORIZO and the PLATO CAMPESINO (chilaquiles, carne asada and eggs).  Both included diced potatoes and beans.  We couldn't get enough of the beans, which are cooked with lard and onions here.  My friend inquired about ordering a side of them to-go.  The server said it wasn't offered as a side, but the owner (?) okayed it.  Yay! We were very satisfied with our meal."], ["Mario G.", "This is a real Mexican restaurant the food delicious and the people here are extra friendly love this place"]], "Broken Spanish": [["Nikki S.", "Unexpected Mexican food. #dtla #restaurantreview Not your typical tamales or enchiladas. A modern take on Mexican food. Recommend the tamales, crudo (spicy!), tortillas (homemade), and hot chocolate dessert. We also liked the pulpo, the queso fundido and the mango chile dessert. We were mixed on the mushrooms with sopa-  a little too salty. Pass on the enchiladas, though still good. Everything is tasty, from the cocktails through to dessert. Service is good, atmosphere is warm and casual. We ate a lot and each had a cocktail. Bill was around $50 per person including tip."], ["Frazier G.", "same people that brought you b.s. taqueria. it is bigger space and the aesthetics were clean. had a reservation from open table and got seated right away. we ordered the camote - potato with pigs tail, spicy good. rebanada - toast with foie gras butter, double order status. pulpo - octopus with alberjones and chorizo, spicy good. and the main dish was duck with mole and persimmon. the tortilla with refried lentils tasted great.will be coming back since we had no room for dessert."], ["Heidi H.", "Everyone I know who dined at this establishment either loved it or hated it.  It's safe to say that the BF and I were fans.  The BF more than I...  We arrived with no reservations on a Friday.  Luckily there was no wait and we were seated at the counter.  Loved that we could see the sous chefs hard at work.  It would be cool if they had a pre-fixe menu for new customers to order or go off of...  Or if the servers could recommend dishes that pair well what.. Overall everything was very salty.  It would've been nice to pair the heavy dishes with some fresh sides.   Oh, and they don't serve corn anymore. :[ Scallops: Very refreshing with a spicy kick.  Scallop was also very fresh.  I would order this again to start.  Pulpo:  BF usually doesn't like octopus but he was able to eat this!  Texture was soft and on point.  Would order this again.  LOVE octopus. :PCabbage:  Nice and refreshing esp with all the heavy food we ordered.  Great pallet cleanser and side.  Chicharron:  Fatty, crispy, tender, greasy, salty, but overall TASTY!  Wrap it with their tortillas and you get AMAZING tacos!  $30 worth of pork tacos that is.  BF loved it.Tortillas:  Homemade and you can taste it!  A must order with the chicharron.Lamb Tamale: Initially ordered this as an appetizer..  Think our waitress forgot about it so it came out last.  Very salty.. Not sure if I would order this again. To sum it up, Broken Spanish consists of Mexican food with a fancy/gourmet and expensive twist.  Bill was a little over $200 with tip for a party of 2.  Cocktails were amazing and unique.  Valet is located on Flower."], ["Diana I.", "My husband and I came here recently for dinner. We made reservations easily via OpenTable. The restaurant is near LA Live/Staples Center so it's a good option if you're planning on going there for a game or concert. I would describe the place as lively, modern upscale Mexican. It was pretty loud inside so I don't know if I would recommend this place for a first date... but better to come with your friends! Cocktails: They have a creative list of well crafted cocktails to choose from. I got the Surfer Rosa which I really enjoyed. It was fruity and a little sweet, just the way I like my drinks. Esquites: OMG SO GOOD! I LOVE corn so I loved this dish!! It was definitely my favorite dish of the night. It was like an elevated amazing version of elotes in a bowl. Perfect amount of heat, and perfect texture! I could eat 5 plates of this all by myself....Chile Relleno: Great flavor with a nice kick but since I'm such a textural eater, I was looking for something crispy or crunchy to balance out the mushy soft textures of this dish. The couple little crisps on top weren't enough for me. Chicharron: I didn't like this dish as much as I thought I would. It was way too fatty and heavy for me. Too much fat... literally that's all I could taste. If you like meat in this rich form, you'll probably enjoy this but I had a hard time eating this. :( Dessert: Empanada - like a Mexican version of apple pie. Yummy and enjoyable. Overall the food was 3.5 stars but I'm rounding up to a 4 for the AWESOME service! Shoutout to our server, Diana C! And the super friendly hostess! I'm not sure if I love this place enough to keep coming back but I'd recommend trying this place out at least once. Valet: $5 for the first 2 hours with validation."], ["Coree T.", "I came here spontaneously with a couple friends for dinner. We had to wait awhile for our table because it took a while for our whole arty to arrive and they don't seat you until your full party is present. We enjoyed a few cocktails at the bar-plenty of drinks containing tequila if that's what you're into.When we were finally seated, we were given a few free dishes to compensate for our time. One dish was a tostada place which was wayyy to spicy for me and another was a bread with cream cheese which was much needed to calm down the spiciness. We ended up ordering foie gras which was amazing- highly recommended! We also ordered enchiladas, a lamb's head, chicharon and duck. Everything was very rich and flavorful so if you have a weak stomach then this isn't the place for you.The staff was very friendly and my glass was never empty. If you come here with an open mind and an appetite then you'll be pleasantly surprised."], ["Sandy P.", "Nice creative cocktails with mescal and tequila.We definitely recommend going family style with a group, with lamb neck tamales, the rabbit, the chicharron, and the lamb cabeza. The standout being the chicharron for the flavor and the absolutely perfectly done skin (thick cut crispy skin with melted juicy fat on the other side) and the cabeza for presentation (leave nothing but the bone uneaten!!).None of the more pescetarian dishes stood out, i.e. the goat cheese tamales, the huitlacoche enchiladas, and the pulpo. These were all tiny portions and didn't burst in flavor as much as the meat dishes.For drinks, highly recommend La Plancha,l and the Cazuela (which comes in a bowl much smaller than a fish bowl but bigger than a candle holder, if that helps)."], ["Viviana C.", "We came here for dinner with friends new to the area. We liked the reviews on Yelp and decided to check it out. We ordered drinks first and they all taste very well balanced. Our waiter asked how hungry we were and we all said \"very\" hungry so he asked us to trust him with choosing our meal. He brought us everything under the sun from scallops to tamales all the way to the chicharron and whole fish! We were so impressed with everything we put in our mouth. If you're in the area check it out and don't be afraid to try something new! Broken Spanish is doing it right!!!"], ["Daniel G.", "Just as good as the former place, Rivera. Portions are small for sharing. We had the chile rellano, mushrooms, chipotle tamales and cheese tacos. All were delicious. We finished it off with arroz con leche for dessert...yum. The entire staff was so passionate about the restaurant and the food they serve. Our waiter Luis was great. If you in dtla, looking for some place different, try Briken Spanish."], ["Jenny K.", "Really enjoyed my dinner here! Our server literally knew the menu like the back of his hand and gave us a thorough explanation of the menu and recommendations. Drinks first (and most importantly): Had their Mariachigroni. Tasty and well balanced but a bit too smoky for me. Next two were the Senor Ted Mosbley. I really liked it but the first one was too sweet for me (but I drank it anyways) so the second one, I requested and they were kind enough to adjust the sweetness by making it stronger and I was a happy camper.Food. It was a hit or miss for me...Esquites was our appetizer and I wasn't blown away. The cream was too heavy and I felt it overpowered the corn. Lamb Neck Tamale was beautifully presented on a skillet with generous chunks of lamb. So good. Enchilada was a miss for me. Texture was too mushy and flavors weren't very bold. Lastly and surprisingly the best, dessert. We had the Chile Mango. So unique. Perfectly spicy and sweet...Blew me away.Will be back to try more items on the menu :)"], ["Evelina W.", "Wow - what an incredible experience! We were looking for a fun place before a concert at the Staples Center when we found Broken Spanish (right off the Expo line!). The restaurant/bar has an elegant feel to it but you don't need to be in a dress/tuxedo to enjoy the delicious Spanish food. We ordered the duck and the cazuela (the drink that is good for two people. The duck was amazing! It is covered in their mole sauce and topped off with spices. They also have an impressive mezcal drink list if you're looking for a smooth drink. Because it's so close the Staples Center, the servers are very accommodating to your schedule. We told them we had a concert at 8pm and they were speedy with their service and the check. I highly recommend this place for a date or your pre-Staples Center/LA Live adventures!"], ["Giulian J.", "great location, wonderful easthetics, but  sub-par food that is overpriced!I went here twice hoping for the best, but should have gone elsewhere. I like when the chef tries to be ambitious, but odd pairings, lack of flavor and way too small portions for this trendy dtla spot.I suspect the flavor of the weak will be gone soon."], ["Chris S.", "Broken Spanish has amazing cocktails and amazing food. I recommend anything that the waitress recommends, especially if it contains Mezcal. The chicharron dish is the best one on the menu, hands down. Other highlights include the blood sausage, which I thought was presented really well considering how acquired of a taste it was. Can't wait to go back."], ["Richard M.", "Came here on Thursday night, parking was rough because there was a clippers game. After finding a lot and paying a ridiculous price we walked into Broken Spanish. I really like the look and the feel of the place, open bar area to eat, patio on flower street and lots of tables inside.Service was warm and friendly, maybe a bit to talkative. The menu is fairly straight forward so we ordered the following:Goat cheese tamaleOxtail quesadilla scallop cevicheLambs head with tortilla'sThe quesadilla wasn't really hot (temperature) and the same for the tamale. It almost tasted as if it had been prepared before and sat under a warming light. Flavors where good but didn't seem freshly made. The lambs head was delicious, but almost no meat on it, after digging around I found the tongue and brains. I'll go back because I like the ambiance and think about trying some other dishes."], ["Wes C.", "Great food and atmosphere! Our server Johnny extended a warm welcome to us and explained the concept/menu very well. He knew the menu inside and out. We ordered all of his recommendations and loved all of them except for one. All the savory dishes we enjoyed included the tostada, chile relleno, and rebanada (sweet bread with foie gras butter) to start with, followed by the moronga (blood sausage), then the rabbit and chicharron. My three favorites were the tostada, chile relleno and rebanada. The dish I wouldn't order again was the rabbit - not a fan of the flavor at all. We ordered three desserts: flan, apple empanada and arroz con leche. Of the three, the goat's milk flan was my favorite. Thanks for the hospitality and delicious food!"], ["Giao T.", "Overall good experience. We just watched the finale of Master Chef in which Claudia was announced the first Latina master chef and the dishes she presented made me excited for elevated Mexican food.I thought everything was pretty good. The only thing was that I felt everything was similar in that it was creamy and cheesy. I know this is Mexican food but my thought on elevating it includes making it less typically heavy. We ordered the esquite, goat cheese tamal, and chile relleno, and finished with the mango panna cotta. Our favorite was the dessert. It was unique and refreshingly tasty. My bf ranked the chile relleno 2nd while I thought the tamal was 2nd. I felt the chile relleno was pretty good. Cheesy (I love cheese) with kale (making it seemingly healthier) but I didn't really taste the chile. It was mainly cheesy kale. And my bf felt the tamale didn't have enough filling though I felt it was enough. But overall we liked the food and would come back and try other items (the chicharrone, enchiladas, quesadilla to name a few). The menu was only one page (which is good) but everything did look interesting and good and picking our items was a challenge in itself.Oh, I almost forgot to mention the cocktails. We got the special of the night and it was delicious.Service was good. Our server was helpful, knowledgeable and attentive enough without being too pushy. The ambiance was right. I would recommend checking it out."], ["Erin O.", "Blindly chose Broken Spanish as the destination for my birthday dinner last week at the loose suggestion of a friend who had read about it recently. And I am so glad I did.Located across the street from the Staples center in the old Rivera space, the restaurant is the perfect representation of Chef Garcia's vision - urban LA meets down home Mexican comfort. And this vision was not lost on the menu. It was spot on in fact.Because it was my birthday, I indulged in an adult beverage: the Surfer Rosa (Pimm's No. 1, Ancho Reyes, Lemon, Strawberry Shrub, Basil Flower). Now, I am a fan of Pimm's so I thoroughly enjoyed this drink. It was served with the tiny crushed ice you find at Thai restaurants and Coffee Bean. As an ice snob, I found this to be a really nice touch.Pretty much entirely at our lovely server's suggestion, we ordered the Requeson, Esquites, Fava Bean Tamale, Chile Relleno, Quesadilla, and the Chicharron. For three people, this ended up being the perfect amount of food. And to be completely honest with you, there was not a weak dish in the bunch. The crunch of the snap peas paired with the black sesame and agave in the Requeson made for a very unique and surprisingly refreshing dish (not typical of plates centered around cheese). The Esquites were a delicious and spicy nod to Mexican corn on the cob. Do yourself a favor and get the fava bean tamale. As our server mentioned, you won't find anything like it anywhere else. The relleno and the quesadilla were also pretty spectacular, each bursting with flavor.While I maintain that there was no real star because it was all fabulous, the Chicharron was particularly fantastic. It is presented in the round and the entire thing is covered in perfectly crispy skin and topped with this unbelievable garlic sauce. We ordered extra heirloom corn tortillas (housemade, black corn, awesome) to soak up every bit of it.I knocked off a star because it is on the pricey side for the portion sizes, but that really shouldn't dissuade you from making the trip. It is really quite a sensory experience all around. Bravo."], ["Alex P.", "Man, my Spanish is broken.Hola, mi nombre es Alex. Aprendi espanol en la escuela secundaria.  I no lo uso mucho. Se podria decir que mi espanol es bueno. Muy bueno. Me gusta la comida mexicana. Los Angeles tiene la comida mexicana. ¿Donde esta la biblioteca?!Yep, I should probably stop.Elevating Mexican food is probably one of the hardest things to do, like harder than sneezing and coughing at the same time.  What? If you're a newbie like me when you think about Mexican food you think about The Corn Man, taco stands on the side of the street, the original LA food trucks, heck maybe even Chipotle and Taco Bell. Bottom line is Mexican food typically is commoner type of food.  To elevate it to this level and reinvent is something that is extremely hard to achieve, but Chef Ray Garcia and Jacob Shure have created something special.Ninja HospitalityI like feeling at home when I eat out, everything from the eclectic decor, friendly busers, folded napkins when you leave the table, and lastly an awesome motherly waitress.  Everything just short of just tucking me in at night with my teddy bear and a kiss on my forehead.See in, See OutThey transformed the old Riviera restaurant into a true LA restaurant that has massive windows and sliding doors that open out to the street so you can check out all the hot chicks and dudes walking by to LA Live.  Hollar! Can I have your number? Can I have it? Can I?Pricey but just rightDon't forget to bring your wallet.  It's definitely not casual dinner prices...unless it is for you, then I would like to hang out with you! For instance, it's hard to justify a $14 quesadilla unless it was sprinkled with gold dust and the cheese was made from extinct wooly mammoth.  But if you end up going, make it a celebration and just have a good time."], ["Josh S.", "I'll make this easy for those skimming over reviews -- I expected better from Ray Garcia. But if you'd like to learn why, I'll explain where the stars were lost. Just to set the mood, Broken Spanish is located in South Park, a few blocks from hustle and bustle of Staples/LA Live. A friend recommended it, and based on the menu (duck heart, foie, oxtail, all with Latin flair from a spectacular chef), seemed like sure slam dunk. OK, so maybe I set myself up with overly high expectations.The venue itself is slender, with a look I can only describe as mid-century modern garden chic. We got there early, and grabbed a seat at the bar while they got our table ready. We probably sat within 5 minutes of our reservation.A note on the cocktails, they're fantastic. While I'm not sure I'd return for the food, I'd drink here in a wink (is that a term?). It's a travesty the drink menu is not on the website, because I can't remember the names, but I did my due diligence in sampling a healthy share, and didn't taste a dud.OK, so not all the food was bad, but it was definitely mixed. What was great? The Pipian, an obscenely large turkey leg that easily serves four, was fantastic. Same goes for the Queso Fundido. The Camote was pretty good too. The not so good include the Salpicon, which I think was more a case of ignorant expectations. It's a cold beef salad, but you wouldn't know that based on its description. I expected something closer to ropa vieja.The whipped carnitas fat was a big disappointment. I love lard, and butter, but it was missing flavor, particularly salt. Finally, we come to the Corazon Asado. I like heart - chicken heart, beef heart, so I assumed duck heart would be something more like fattier chicken heart, but the taste ended up being far gamier. That could also be on me.But after all that, the biggest complaint was the service. They just wouldn't leave us be to sit and enjoy conversation. I understand businesses need to turn tables, but the moment we stopped eating something they wanted to clear our table, and they'd come back every few minutes to ask. We wasted a lot of food because not once did they ask if we wanted any of it boxed. And it's not like we weren't drinking our share in the meantime. I'll give the food a pass, and would be willing to try it again, and I'd definitely drink here in a heartbeat, but for the love of god, let your patrons converse.Side note, if you happen to use the men's bathroom stall, look up. Ceiling is huge, and uh, there's a colorful full sized cow climbing down the wall like Spider Man."], ["Adele F.", "Came here last Sunday for early dinner before the J Cole concert at Staples. Pros:- very friendly service from the hostess (who offered to watch our car and wait until the valet arrived so we could head on inside) to our server who was very knowledgeable and to all the busboys.- great cocktails- good food- beautiful spaceCons:- no chips!!!- some of the items were a tad too salty for me (and I generally like salty things)"], ["Kate M.", "(Updated now that I've been twice!)Love love love Broken Spanish! The esquites, relleno, pulpo (octopus), fundido, mushrooms, chicharrones, and duck are all DELICIOUS. In two visits we ordered the chicharrones both times. But one of the simplest pleasures is their side order of homemade blue corn tortillas--Evan Kleiman discusses this blue corn on her KCRW show Good Food, and it's worth a listen before dining and a few orders with your dinner--one is not enough! Desserts were kind of misses, but the whole experience is so wonderful--the best servers in LA work here--that I don't even care. I hope it thrives. Pretty sure it will."], ["Tony H.", "What a great time! I couldn't stop eating and the ambience is incredible and alive in the heart of downtown. Our waiter, Rob, was so easy going and knowledgeable that I loved every dish that came out. The tortillas are immaculate. Order the tamale (1 of each, trust me)! The shrimp plate is amazing. We loved the oxtail quesadilla, tacos de jamaica, and the Chile Relleno was the best Relleno I've ever had. And to close out, get the Chicharron and the Pipian turkey leg, then just go to sleep happy. We dined in the \"sala\" room and got to walk out of the retractable glass walls when we were done. I'm coming back next week. This place was impressive."], ["Megyn C.", "Aye. Big fan of BS Taqueria, but the service last night at Broken Spanish was dismal. It took 15 minutes and a busboy offering (of his own volition) to put in our drink orders before a waiter came to the table. The table that was seated after us received multiple dishes before our tortillas came out, not to mention it took almost 20 mins for our table to be cleared & receive the bill. So, here's the thing. My partner is vegan, and when asking if any of the vegetarian dishes could be modified to not include dairy, the waiter looked dumbfounded and suggested the chicken to him. I totally get it, not all restaurants are accommodating to everyone's dietary restrictions (nor should they be), but the servers at BS Taqueria have always been more than willing to check with the kitchen to see if modifications are possible. Not so much at Broken Spanish. He ended up with the mashed potato-stuffed chile relleno, but I took the first bite and I'm pretty positive those potatoes were loaded with butter. It's a shame, because the food IS delicious, the drinks are fantastic, but if the menu can't be modified to accommodate certain dietary restrictions, at least be honest about it."], ["Amanda H.", "Everything about this place is fabulous.  From the super enthusiastic staff to the valet guy outside!!!First of all, the staff knows they are serving up some of the best food in DTLA -- so they are proud and ready to help you have an experience you won't forget.To be honest I am at a complete loss for words - Chef Ray Garcia has really elevated Mexican food to a new level.  Everything I had was fabulous from the first bite to the last.  And I plan on return to taste everything I didn't try on my first visit and bring my mom.I highly recommend everyone go to Broken Spanish and enjoy what I would like to think of as a High End Home cooked Mexican Meal!!!!!!!!"], ["Dylan M.", "Everything was great. So many flavors, all on point! No head for me next time, but glad we saw it.. You're crazy if you don't try the tostada!"], ["EchoPanch O.", "Overly spiced food, overly loud space, overly priced food. If you love good food and actually want to enjoy it, do not come here. Everything from the parking to the service to the crowd was hectic and loud. This is a bar that serves food, not a high end restaurant where you want to drop $160 on a meal. What a regrettable decision."], ["wayne l.", "This is a new restaurant and with 60 odd reviews still a great hidden gem.  I highly recommend you check this out now because it'll get more popular as time goes by.  Super friendly staff that really know their menu.  Cocktails are superb!  The dishes range from tapas style to full plates.  The service and quality are notches above what you pay which makes this  a hidden treasure in my opinion.  I've been here twice and have had nothing less than a great experience.  The restaurant is a tight ship for sure with strong captains.  I wish I can list off the menu items but every time I walk outta here I carry on through the rest of the night because the place is conducive to living in the moment with  your conversations, great food and drinks. You can probably come here with someone you hate and walk away buddies.   I'll say this... the Red Snapper is a go to for me and quite large for two.  Yet you'll both finish it even after the delicious tacos....and the purple corn tortillas.. gotta have those..  moist with a tiny bit of chew and subtle flavors.  They really do cocktails right so you can't go wrong with what you choose... make it fun and share.For you daters, they have seats at the bar, most along the length of the wall and a street corner seating with 90 degrees of glass view of the streets.  All of them are nice spots.  I really like the counter height tables that bring conversations together that are in between the bar seats and the wall seats.  You can't get a bad seat in this house.On my last visit a few weeks ago, I was stuck in a jam at another restaurant (Red Bird, see my review there) and called in to ask them if they could save the night.  We walked in with a warm \"Happy Birthday Rosie!\" and I just sat back the rest of the night.. it's like the Love Boat docked on Flower Street."], ["ron w.", "Wanna get some head? Of course you do. Who wouldn't want a chili spiced, roasted lamb's head?This was the old Rivera after John Sedlar packed up his Painted Desert Salmon and blew town. Eat at the large counter overlooking the kitchen and watch the squadron of cooks...cook.  Thankfully, there is no cacophonous rock loop to keep you from over hearing the banal chit chat of the couple at the next table or the inspired insights of the companion at your table. Although it gets noisy as the night wears on and there is a constant buzz as if all of Bill Cosby's dates showed up there at the same time to drink, share plates and tales. The vibe has lots of thigh high leather, wobbly heels, and G Q portfolios to gaze at if that adds to your night out.The Staff is truly warm, friendly, and really wants you to enjoy your evening of B. S. and their spin on Mexican/Latin food. They are efficient and unobtrusive and there is always someone dropping off and picking up from your table. It's as busy as Monday morning at Day Care. A Patron Saint: Bourbon, Ancho Reyes, Lemon, Tamarind, Egg Whites, Bitters, all in a cutesy little stemless glass. Tasty enough, but what else should you try? A Gringo: House made Coffee Liqueur, Cardamon, Cinnamon, Piloncillo, (es...Spanish for brown sugar), Barley Horchata, Spices (grated Nutmeg) on the rocks. It was a Starbucks Frappuccino in a bottle unleashed. A Yoohoo on steroids. I had four and waited to be wide awake until the next Debate, or dead by morning. Neither occurred. A tasty caffeine fuzz with no buzz. Was it yummy anyway? I'll have four more to go thank you. There is short stack of snacks to be had, shared or hogged along with some larger plates. The Molletes, traditionally a Mexican breakfast item, appeared on a sliced toasted baguette topped with smashed frijoles negros, English peas, Yerba Buena, Ground Pecans and Panela cheese. A Cafe de Olla and the NY Times Book Review Section...I'm all set for the day. It also had a kick like a nasty four year old at someone else's birthday party. The Quesadilla: These were delicious. Oxtail, Plantain, Habanero, Salsa Quemado all in a long simmered Guisado. (Stew) It too had a slow crawl of heat and the two perfectly formed Quesdillatitos were posed together like a Tortilla Factory calendar. You know, with the Aztec hunk carrying off the swooning virgin Princess to her delight or doom. The Queso Fundido: A guilty pleasure, (don't let my internist know) was fun and different. This version was made with Bacalao (Cod), Roasted Tomatoes, Garlic Chips and it's own fired up chili. (More Habanero? They must have cornered the market).The Bar Tender raved about the Heritage Blue Corn obtained from small Mexican heritage villages and grown by heritage farmers of mixed heritage. The tortillas resembled blue Injera. They were ground and made in house and would have given Sean Brock, (cookingdom's advocate for heritage anything) a woody. No matter, they easily held whatever was heaped onto them, and hot ones just kept a comin' as passing servers noticed we were running low. Now, you're ready for some great head, right? In a large fish platter (yup, a fish platter instead of a lamb platter...Bah!!!!) sat a half roasted Lamb's head sticking it's tender tongue out at you in a last gasp of defiance. It was the Stephen King Special, gouged out eyeball, creepy orthodonture, and cheeks hangin' off the bone. It looked like the main course at an American Horror Story dinner party. It's pugnacious jaw looked like something Biblical in a Kevin Sorbo film. So, believe you're gonna love it, and if you have the starch to order it, you will.           Put you ear close to the plate and you might just hear it rasp...\"Go ahead...Eat Me\", and you should. Be advised, this is not a \"first date\" dish. It was gelatinous, fatty, meaty, spicy, and juicy just like the chubby chick in Accounts Payable that winks at you on your way out and you probably should have taken here in the first place. The Head came with pickled onion and cabbage which was buried under the head, and was only revealed when the picked over noggin was flipped. The Slaw was lip burnin', tongue tinglin', throat closin' hot. It made my hair sweat. Man up, you can take it. You just have to find it as it's perfect with whatever you easily yanked off the carcass...in a heritage tortilla. And then there was the long black hair in the Slaw, as black as your ex-wives heart. (The Lamb was a blonde). Hey, its Mexican food, so don't go gettin' all squeamish. Hair happens. The manager came and inspected the extra protein and begged forgiveness and spiffed me dessert. Very classy. Dessert: Ethereal. Tres Leches Cake in a puddle of Strawberry Coulis so light it had to be tethered to the plate. Crema Ice Cream, Market Strawberries and Freeze Dried Strawberries. So tangy it gave me Betty Boop lips.B. S. is not an acronym for my review. B. S. es muy good. Eat aqui, ahorita."], ["Jerome O.", "Explosion of flavors and textures. Best blood sausage I've had in LA. Sweet potato and pig tail? Amazing.And, cherry on the cake, the place is gorgeous and people so nice (Dillan, Jacob...).The panda cotta I had last time was probably also one of the best I had, on par with one I had at Hatfield's.Go chef Garcia, go!"], ["Chris W.", "Broken Spanish deserves 5 stars for the service alone. I felt at once welcome and relaxed by the accommodating staff and warm vibes in this place. Everyone was excellent and you can easily tell that service is of incredible importance to the entire team. But the food! My lord. We got into the foie gras toast, fava bean tamale, fresh cheese and figs, grilled masa and mushrooms, the corn, and the best chile relleno known to man. Fun and inventive cuisine that tasted amazing and left us in lingering conversation long afterward. Oh hay. We got drunk too. The cocktails were quick and perfectly explained. No complains. I'm going back tomorrow!"], ["Rahee B.", "Hubby and I found sitters for an evening but plans got canceled and we ended up here last second  due to good old Yelp. We were both pleasantly surprised by Broken Spanish! I'm vegetarian and he is a meat lover but he liked my dishes as well. The goat cheese tamale is a must. Chile Relleno and mushrooms also pretty good. Hubby also enjoyed his chicharron. Very friendly and attentive staff. His blue label was 50 bucks which is a bit much -- but hey, we had a great night!"], ["Diana W.", "Came on a sun night and the restaurant was not busy. Service was super attentive and everyone was so nice. We weren't entirely sure if we were walking into the right restaurant as they didn't have signs up yet (they're supposed to have them up soon)!We ordered:Rebanada-foie gras on a brioche bread which was good but I felt the bread was a little too dense. And I prefer to have a thicker spread of foie gras but good nonethelessCorazon asado-duck hearts which was interesting and pretty good! I thought the onions were a good touchRabbit mixiote-our server said it was a whole rabbit! Super spicy and yummyLamb neck tamales-was kinda gamy and might not be tolerable for who don't like that but I do and it was really savory.Oxtail quesadilla-really good too. Came out in what looks like black tacos. Interesting presentation.As for drinks, we ordered two and they were both really tasty and pretty! For dessert we tried the tres leches. So good and loved the presentation. But definitely on the pricey side and probably not for those who need more substance to feel full."], ["Kevin I.", "Recently had dinner at Broken Spanish with my wife. Perhaps I suffered somewhat from expectations that were too high, but was, all in all, not super impressed.We had a couple of cocktails, and both were 5 star amazing delicious. Seriously. Some of the best drinks I have had in a minute. I would go back to the bar any time.As to the food, the starters were good, the tamales were great, the tortillas were amazing...then it started to slip a little. We had a bacalao queso fondito that was overly salty and really disappointing. We had a sweet potato with pig tail that there was no pig tail to really be found. We also had octopus with chorizo and again, could not find any chorizo at all (in defense of the octopus, it was delicious).This is a place that I would happily return to for drinks and apps, but would likely not come back for dinner at the price ($49 for red snapper??!!)."], ["Rachel F.", "Broken Spanish is a once in a lifetime opportunity.Food: I do not regret a single bite. The duck hearts, lamb tamale, oxtail quesadilla, hibiscus tacos, and chile relleno were all flat out fantastic. The menu boasts creative combinations and is executed perfectly by otherworldly cooks. The portions are not shy and left me satisfied and stuffed.Drinks: Just awesome. The cocktail menu is tequila heavy but offers some bourbon and rum options as well. The creativity and flavors make each drink its own dish and worth every penny. The wine list is extensive and the wine locker is a sight to behold.Decor: They've somehow managed to strike a perfect balance between modern and rustic. The place is cozy without being cramped, warm without feeling dated, loaded with metal and glass but not lacking in soul.Staff: Simply wonderful. Our waiter, Robert, was extremely helpful with the daunting task of NOT ordering one of everything. His recommendations paid off in spades and the whole staff kept a watchful eye on our water glasses. We had the opportunity to chat with one of the cooks, Katie, who was cheerful and very informative about the dishes she was preparing. The house manager Brian even stopped by to say hello and check on our experience. Everyone you meet has a smile on their face and is attentive to your every need without making you feel fussed over or interrupted.I am thrilled to have been introduced to Broken Spanish and hope to return soon to taste more of the amazing menu!"], ["Jess D.", "This place is really delicious, but what put me over the top was their exemplary customer service. After a day of wine tasting in Santa Barbara, my friend and I were starving and Broken Spanish was near the train station and had reservations available last minute. So we went. At some point during the meal, a combination of booze and what we've now realized was food poisoning hit my friend. I tried forcing her to eat, but she wasn't having it. I really, truly enjoyed the food but we had two dishes coming still when I realized we needed to get my friend home stat. I didn't want to paint her in a bad light, so I worded it delicately and the server and manager were just so understanding. We didn't get charged for the additional two dishes, and they packed us up and got us out quickly. I had a leftover quesadilla this morning. The shredded chicken, mole and corn tortilla was phenomenal even a day later. Can't wait to go back under better circumstances."], ["Evan L.", "Oh man, what a dining experience. I can't even really call it Mexican cuisine; it's much more wide-ranging. Chef Garcia applies awesome technique and near-perfect execution to a wide variety of dishes from duck heart to lamb neck tamales to the largest steak-sized piece of pork belly you'll ever see. Really great service in a wonderful environment - albeit not a major overhaul, aesthetically, from the Rivera which was previously in that space. A fantastic tequila menu with some great cocktails. In short, an excellent meal and great addition to the robust downtown scene."], ["cynthia c.", "Best meal in LA in a long time! Inventive combinations and great flavors & not afraid of heat, thank you! My crush on Ray Garcia deepens. From the green cocktail (and the other 4 my cohorts had (which I tasted) to the dessert and everything in between...In particular, the jamaica tacos (new veggie friendly taco option - dense like cabbage - but a flower!), oxtail quesadilla, chile rellenos, and the whole red snapper in green clamato sauce with clams and leeks. Finishing it off a heavenly tres leches and the chili mango with passion fruit curd and habanero caramel - yes, please, more, pretty please!Next up .... BS taqueria. His sister spot for tacos in the former mo-chica space."], ["Julia J.", "Voted by Esquire as Best Chef in the country. Pretty impressive, huh?  Seems a lot of other Angelinos thought so too because despite our reservation, we weren't seated till more than a half hour later.   And tons of walks ins trying to weasel in. The staff were terrific though.  Apologetic and they ended up comping our valet ($5 under 2h; otherwise $15).  As usual, I quizzed my waiter thoroughly and he passed with flying colors.  Highly knowledgeable about both the cocktail list (they made my drink perfectly and I am a tough critic) and the food.  Unfortunately all his favorite dishes/recommendations were things I couldn't eat. I have a feeling the chef won not necessarily for taste/skill but for his bold risk taking, bringing unorthodox things to the table like lamb's head, complete with eyeballs and brains, blood sausage and cock's comb (that floppy part of a rooster's head).  I'm usually up for new things, but i draw a line (mad cow disease anyone?).  Winners were the lamb neck tamale and the duck (which comes out whole, still looking like a duck and is huge, so be careful.  Disappointments were the carnitas whipped fat (lack of taste made the extra calories not worth it) and the pollo prensado (no actual meat; just chicken skin and cock's comb in a spicy sauce).  The mushrooms and the foie gras app was so so.  I've had better.  All in all i'm glad we went just to see what the hype was about.  Great staff and a good vibe (albeit loud)."], ["Shalen O.", "YUM!!! Food is definitely atypical, but very good.  Oxtail quesadilla was delicious.  We ordered almost one of everything on the menu and was pleased with 90% of the selections.  Waiters were great in that they made great recommendations and knew the dishes very well.  We had a party of 7 so I understand that we were one of the largest parties there, but it took almost an hour to seat us.  Hence, the 4 stars.  Oh and they ran out of grey dragons and my friend was pissed.  He was about a dozen in and was about to throw a fit that they stopped making them.  The place is crowded and loud."], ["Luigi D.", "Solid A.This space used to be occupied by Rivera, a \"pioneer\" of sorts in the neighborhood, as it was one of the first higher end restaurants to open in this part of DTLA. While it was a brave endeavor, too often the food would miss the mark, and the price point was too high (IMO) for the food there (except for the Barbacoa. Julian Cox is the bomb). Broken Spanish takes a lot of the elements of Rivera, and transforms it into something that feels more traditional and authentic, but at the same time new, and \"elevated\". A lot of the dishes are classic mexican fare (pipian, requeson, tamales) but have been bestowed with some modern flair. To put this in perspective, I think that trying to create a menu of \"elevated\" Mexican food is usually a complete waste of time. Mexican food is a very \"homey\" sort of food. So every time I see a fancy restaurant with mexican food, I usually pass, because the end result is usually some cross between El Cholo and Acapulco. Well, today, I stand corrected. The food is mexican, at it's core, but there is a decidedly modern feel to every dish. And it's fantastic. The atmosphere feels more open and inviting than the sort of steakhouse/speakeasy vibe that Rivera had. Glass panels the open to the outside now surround most of the rooms, often feeling more like somewhere in new york or SF than downtown LA. Service was great, as it should be at this price point. Didn't have a cocktail but they looked great. Wine list also looked fairly comprehensive. Definitely worth a try, and then some, for anyone within Uber-ing distance. Highly recommend. I am dying for yelp to add half stars, because this place is 4.5 stars."], ["Melissa W.", "First yelp review in I think 4 (?) years! And a solid one to start. This was probably one of the best meals I've had in the last year. Although high end Mexican food sounds like an oxymoron, the meal was pretty much perfection. To start:Rebanada- sweet bread with foie butter: put that shit on everything yo! At first I was a little disappointed that the bread wasn't crispy but the minute I took a bite it all made sense. Definitely different than anything I've had and THANK GOD they allowed foie back in our little kale eating hearts. Lamb neck tamale: awesome! I would come back and just get those. 'Twas cornmeal pockets at it's a-game.Duck hearts: surprisingly the least favorite thing we had. Completely shadowed by everything else we ate. I wish I could describe it more but before I could have another taste it was gone.Chile Relleno: what all chile rellenos should aspire to be when they grow up. The filling was amazing and the chili was perfectly cooked. No weird skin problem some rellenos have. The main stuffPollo prensado: just give me a big bowl of these with the tortillas please. I would have licked the bowl of it was socially acceptable. Although I'm pretty sure I did anyways. Had mainly the squishy parts of the chicken but those were my favorite. Didn't have much meat but the flavor was amazing. Shrimp: no special name for this but it was technically a single prawn and so so good. Spicy so beware but the mango salsa that went with it balanced everything out. Chicharoons: just take me now... Perfectly crispy where it needed to be and perfectly perfect everywhere else. It was a pretty hefty piece and the garlic whatever whatever that went with it cut the grease so well. Tortillas: homemade blue corn tortillas used as a vesicle I which to eat every little bit of everything. Warm and fluffy. Dessert:Horchata ice cream: my favorite but you really can't go wrong with anything horchata. It had a bit of salt to it which was nice and cool little rice crispies. Poblano sorbet: WEIRD! My eating mates liked it but... Uh uh. Not in this mouth Strawberry gazpacho: very refreshing and nice after a pretty heavy meal. Anuelita hot chocolate: I don't really know what happened here. I can't really tell but I didn't get much before it was devoured by the others... This place is in an interesting location but it convenient if you're in the area or doing something at LA Live. It has a weird flow to the restaurant with a whole private room in the back. I'm pretty sure I watched a couple guys walk around the place looking for the entrance and never really found it. They have huge glass windows that they open on nice days. Note to self: when eating with boys make sure to take first bite before letting them at it."]], "Casa La Doña": [["Shawn G.", "We were downtown and my sister had to have al pastor tacos so we decided to try this spot. I really liked that they give chips and have about 15 different kinds of salsa. Also really enjoyed the fideo soup that came with some of our meals. My sis had her al pastor tacos on home made tortillas. My bf had a pambazo. And i had a huarache. To me the huarache was too thin but all of the toppings were good. Decent but wouldnt go out of my way to go back."], ["Lans S.", "Any place w/ a fresh salsa bar is automatically getting a star in my book. And these bad boys are spicy as hell! A crazy variety of bomba$$ salsas, y'all. My mouth was on faiyah!My 3 fish tacos were fantastic & muy economico. I'm very pleased w/ my experience at Casa La Doña and will certainly come thru again next time I'm in DTLA."], ["Sara A.", "This place is great for some quick, inexpensive, and healthy Mexican food. All of my meals here have been fairly light, not greasy, and they don't use lard. Best part is that they have a fun salsa bar with 18 choices ranging from mild to habanero. They deliver m-f only so plan accordingly. Otherwise, I haven't had a bad meal here yet and would recommend it if you're looking for a quick bite while shopping in the men's fashion district of DTLA."], ["Peter T.", "I think I would give the restaurant 4 stars if the food was fresh.I ordered the pambazo which was pretty good but was heavier than it should of been and didn't make me or my gf feel well at all.You can just tell from the cleanliness inside and atmosphere that it's not getting an A from the health board. Normally I don't care but again I felt iffy after eating and I have a pretty tough stomach.Also had the fish tacos Ensenada style which weren't special considering Ricky's isn't far away.Salsas are ok, lots to choose from."], ["Devin L.", "Muy bien, their burritos are excellent be sure to load up on plenty of sauces. The staff here are kind and fast, lines usually are pretty quick and you will only want more."], ["William L.", "I have passed this place so many times before. I never went in. When I see some positive reviews of their nachos in yelp, I'm completely sold.I went there to have some food for breakfast. The \"Casa La Doña\" bar is legit. They had 20 different flavors.Their Drinks are great and their food is even better.  My favorites are the smoked mango salsa and sweet. I am really impressed with the food in this restaurant. AMAZING!!!The chef was cordial. He took my order and the food came out quickly than I expected!!My ordered enchiladas were solid and also very filling. The plate came with a side order of rice and beans. It was amazing and solid all the way through. The Tacos pescado we ordered were also solid. It was Packed with the part of a good fish taco. We got the plate comes with a side of chopped cabbage and rice.In addition to the food the service was excellent! It was a solid place. Definitely I would come thru again. I really love this place!"], ["Jade M.", "My boyfriend ordered chicken tacos, carne asada tacos and ceviche and he gave everything 5 stars which is big coming from him because he is so picky! I had the salad with carne asada and added grilled veggies (which were delicious!) not one complaint! Everything was cooked perfectly and timely. Can't wait to come back! Side note, try the salsa bar. So many delicious options."], ["Rebecca H.", "Gotta say I was very impressed with this place. The customer service was superb compare to most mexican restaurants. They were quick to put a table together for a party of 8 and were great at bringing out all the food quickly. I think the most exciting thing of the meal was my delicious and refreshing la fresca watermelon drink! It was not overly sweetened and just was so perfect on a warm saturday afternoon. My potato taco were not bad either, the chips with a vast amount of different sauces ranges from super spicy to mildly spicy. I loved the mango spice it was so perfect with everything!"], ["Andrea D.", "I been wanting to try this place for a while now, but I never got around it yesterday it was taco Tuesday so it was I dollar tacos they had a big chalkboard with all the options, I asked what kind of vegetarian tacos they had they said nopales, mushroom and potato. I got one of each my favorite ones were the potato and mushroom the nopales one was good too. For the salsas people weren't lying the salsa bar was amazing I tried the mango cilantro, chipotle and two green salsas mixed. Don't forget to get some horchata too."], ["Veronica A.", "We tried the chicharrones gorditas, which reminded me of my mom's cooking!Their chicken mole enchiladas with rice and black beans were pretty good.My son had the carne asada and al pastor tacos and those were bomb.  They were so good, I ended up ordering al pastor tacos to go.  They make them with home-made tortillas.I like their salsa bar.The only drawbacks are they don't have a restroom and you have to park across the street and of course pay for parking.Prices are super reasonable."], ["Jennifer N.", "Little shop at the corner of Main & 8th St!The staff was really friendly - you order and pay at the counter and they bring your food out to you. There's 4 main taco selections - carnitas, pollo, asada, and al pastor. Each at $1.75, but $1 on Tuesdays! They also offer seafood options, but I didn't try any of those. My favorites were the asada and al pastor with al pastor winning me over completely. It definitely had the most flavor to it. I also really enjoyed the tortillas that these tacos were served on! A little thicker than what you usually come across, but it was great because the taco didn't fall apart! The salsa bar: YASS. So many options! I had a hard time choosing! I went with the mango cilantro, onions w/ habanero, and unfortunately I forgot what the last one was called..but it was orange and spicy. They were all really good! Especially the onion mixture.  A combination of these on top of the tacos and spritz with lime juice made the meal delicious."], ["Yaneisy V.", "This is a cute little restaurant. Relatively clean and friendly staff. Ordered tacos de papa wich came with a small cup of chicken noodle soup. Pretty tasty. Also ordered taxos de asada and one pastor. Tortillas appeared to be hand made, they were good the meat on the other hand was mediocre and not much meat in each taco. A little side of guacamole was almost $4 bit it taste good. Overall the food was decent. If you need a quick spot to eat while shopping in the garment district."], ["Steve H.", "So glad i found this place! I've been eating here every Tuesday for the past month, Each visit i've gotten five tacos (they're only $1 each on Taco Tuesdays). I think I've tried every taco they have to offer. They're all good, but I specifically recommend the chorizo/potato option.I ordered it on a whim when I was feeling adventurous and ended up loving it. It's such a unique blend of flavors and textures that always seems to hit the spot. While the tacos are great, the most fun aspect of this restaurant is their huge selection of homemade sauces. They must have about 20 different sauces to choose from. They really have everything, from basic salsa and salsa verde to avocado/cilantro to chipotle/peach. I use about six different sauces each time I visit.  I highly recommend Casa La Dona to anyone looking for an affordable and delicious meal. Essentially, I recommend this place to everyone. Only downside is they don't have a bathroom, which can be problematic for someone like me, who uses lots of hot sauces and ends up drinking lots of water. Besides that, everything is ideal."], ["Deepen G.", "For those with gluten & dairy allergies: their meats aren't cooked with dairy and all tacos are safe to eat. Clean, tasty, and super friendly staff. The salsa bar is the best part."], ["Virian G.", "When having breakfast I like to change it up.If you like The Pantry or The Nickel Diner then you'll certainly enjoy this twist. Mexican breakfast at its best! Absolutely authentic and check out the salsa bar! So many choices! Flavor fiesta!"], ["Duc D.", "I stopped by here craving some legit Mexican food while staying downtown. I was not disappointed! The staff was extremely friendly and I could definitely tell they took pride in what they cooked and how they treat their customers. I ordered the baja style fish tacos and was pleasantly surprised when it came with free chips and a hearty, rich tasting noodle soup of some sort. The salsa bar isn't anything to scoff at, as they have over a dozen different types of salsa to mix and match. I was eyeing other customers orders and asked the waitress about each one, in which she kindly filled me in on. Must come here again. Cheap, clean and good!Price: 5 starsService: 5 starsFood: 5 starsAmbience: Didn't care"], ["Jess C.", "Unfortunately horrible food poisoning was had by all. And therefore we shall not be back. =("], ["Esther L.", "Surprisingly, one of the few places that celebrates Taco Tuesday. Got my order to go and came out soon after. Customer service is meh and parking is only metered."], ["Lexi H.", "Amazing!!! Homemade tortillas, huge selection of salsa and delicious horchata. I had chicken tacos and it was seasoned and very flavorful. My new favorite mexican spot downtown."], ["Michael Z.", "I came here when it seemed to be a little bit slower. I got the three tacos platter (asada, al pastor, carnitas), which comes with chips, soup, rice and beans. The rice were decent, but I didn't really care for the beans. I found this to be a bit of an expensive plate (~$10-11) given the amount of food they ended up bringing out. Give that I've heard that the tacos are $1.75 each, I would have much rather have gotten twice as many tacos without any of the extras in retrospect.The tacos were reasonably sized for being cheaper tacos. I thought the asada was pretty great, as well as the al pastor, though the carnitas were a bit forgettable to me. Compared to a place like Guisados, I found the tacos to be just a tiny bit lacking--either a bit larger portions or quality would I think make up the difference here. I ended up scooping up every last part of the rice and beans plus what fell out of my tacos with my chips and wished I was filled up with a little more meat in the end.The salsa bar is extremely well stocked (~18 selections) and has tasting sticks for you to try, which is a huge plus. I personally was a big fan of their spicy pico de gallo and fresh green.The service was also very, very friendly and welcoming, which is sometimes not the case in similar restaurants in the area.I'd love to have a chance to come here on a Tuesday, when they open up their taco selection to other meats and sell them for $1 each, but I can't base my review off that idea without trying it. I imagine that experience would bump them up a star, so hopefully I'll get the chance to update this someday."], ["Jose A.", "The asada is bad, but hey it's bad everywhere. The carnitas is fine. The ceviche, de pescado, to be clear, about which they are not clear, is as bad as it is everywhere else. The worst part is the tatted up girl at the register. She's awful. They get two starts because I have to try more of the items and hate them before I give them none."], ["Jorge M.", "Great Place to eat. All the food was great. Has a big salsa bar and service was great. Must come again."], ["Peter D.", "I had heard about this place through a few friends and finally last week I tried it out.  The place was packed when I arrived (always a good sign).  I ordered potato and chorizo enchiladas.  They were amazing.  I was served chips before my meal.  They were good.  Not the best but they were good.  The salsas from the salsa bar were solid.  I returned today for lunch and had the chicken flautas and they were pretty good.  I would definitely come back and order them.  The special today were fajitas and from looking at some orders going out, they looked Amazing!This is a great spot downtown LA."], ["Jae P.", "Just stopped by there for lunch today. Great food!!! The salsas...even better. Huarache is really good. I got the 3 tacos plate. Their Al Pastor is delicious. The pricing of the food is not bad neither. Definitely will be back....for their breakfast. I would give 5 stars if they sold beer. But they dont. :("], ["Cuong D.", "So dangerous being a block from me. Good thing they close at 8 or this would be my dinner most nights coming home from work. Second time eating here and still impressed with the quantity/price ratio. The ingredients are fresh, especially the salsas. You can tell they make the salsas fresh every day. First time I got the enchiladas de suelo which are filled with potatoes, chorizo, and jalepenos. Flavor was on point. Second time around I got the volcano al pastor based on the recommendation of a friend. This did not disappoint. Thing was loaded with pork and pineapples. Reminded me of the time in Cancun when I ordered tacos from a small shack. Ladies working here are friendly and quick. Both times I got my order to go and loaded up on 2-3 salsas. My goal is to try all of them before choosing a favorite. Careful, the ones in the hot category have a good kick."], ["Elaina P.", "This is my favorite Mexican food place ever! The sisters who are always working are so sweet- one's the salsa queen and the other is the cooking queen ! Always quick to get my meal together and a sec to say hi (: it's great to come home and be able to pick up some good food for dinner. Thanks for the great food and service !"], ["Molly H.", "If you happen to be tailoring a suit nearby, definitely stop by this place.I had the El volcan de al pastor and pretty much consumed that thing with a vigor and speed that would terrify most by passerbyers. On top of my delicious meal and fresh Horchata, the salsa bar selection was by far the best I've ever sampled. Especially the mango cilantro. I would like to bathe in a vat of that if I could. But anyway, it's getting weird so I'll just say TRY IT."], ["Marcelino A.", "I've been on a somewhat recent quest to find the \"best\" Mexican food in downtown.  The first thing to give them props for is the salsa bar.  Which to me, was the best thing about this place.   Many different salsas to choose from earned this place good marks.I had a carne asada burrito.  It was definitely good, but not great.  The flavors were fresh but nothing to write home about.   If you consider Taco Bell Mexican, then you will absolutely LOVE this place.  Plenty on the menu so I will revisit."], ["Mehmet B.", "Cheap Tacos are always a great find, but I'm surprised at the love this place gets: There are much better tacos out there; and as some other reviewers point out, a bit on the small side, these.We had the fish and shrimp tacos; the fish tacos got high-marks, the shrimp tacos were boring.The salsa bar is nice, but the tiny salsa cups are... tiny. I want to dip my chip. Let me do that.The worst part: any restaurant with sit-down service, MUST have a bathroom. Casa La Dona does not. They have the room, they just don't want to deal with cleaning it. That's unfortunate, and made me drop a whole star for that."], ["Princess O.", "Amazing food. Every plate is good. It gives you the same great taste of a home cooked meal. Very authentic and I would defiantly recommend it. Amazing salsa bar huge selection. The only bad thing is the service. It's slow and there's only one person working in the morning other than the chef."], ["Rachel C.", "Friendly service at the register, delicious authentic food, and a nice sitting area. Would definitely return!"], ["Tiffany Y.", "Not your typical SoCal Mexican food. Try the huaraches (open faced taco with meat, chorizo, and cactus) with al pastor. Their al pastor is some of the best charred smokey pork around. Oh and don't forget the salsa bar, at least 20 different salsas to try! My favorites are the mango cilantro and the fresh green salsa! All orders come with chips and free soup! Today's was a simple chicken noodle soup.PS There is no public restroom here so make sure you take care of your business elsewhere before coming to eat!"], ["David C.", "Best Mexican food in DTLA. They make all their salsas from scratch. Nothing frozen. Food made with love!"], ["Kristopher P.", "This place is fantastic.  The menu is very diverse and the salsa bar is amazing.  The only problem is I get a little anxiety trying to decide which salsas to go with (good problem to have).  The food is super clean and they will accommodate your request for changes to an item.  Highly recommended."], ["Sandra Y.", "Taco Tuesdays special not advertised anywhere in the restaurant,  $1 tacos, menu has about 10 tasty choices on the blackboard, open bar of 18 homemade unique salsas plus free street parking after 6PM makes this winner. They throw in a basket of tortilla chips so you can have even more of those wonderful salsas. We got there at 7PM and there were only 2 people before us in line.  Staff were very pleasant, too. Will be going back."], ["Sandra S.", "I love this place but my husband does not :( so we don't eat here often. So far I have tried the tacos ( taco Tuesday), burritos and enchiladas. The agua frescas are good too. My honey doesn't like the carne asada...I find it to be ok...not the best but pretty good. I enjoy the location, the dining area is pretty big and if you sit facing the street you can people watch. Good spot for groups of 4 or more but no cervezas lol. I wouldn't come from far to eat here, not sure parking even exist. I would say if your here visiting the callejones or live in DTLA then this place is a great option for good Mexican food and a killer salsa bar. Salsa bar has a million options ranging from sweet to sour and hot to hottest, if your a salsa fan this place is prob for u. Check them out on taco Tuesday!!!!! AND the staff is super sweet ( always nice and food get to you table promptly)"], ["Alissa W.", "Love this place! Great authentic Mexican food! Vegetarian options, black beans, great salsa bar. Definitely will be back, thanks!"], ["Mohamed H.", "Great pollo asada quesadilla, the dips weren't so amazing though to be honest. Friendly staff."], ["Kai B.", "Really amazing. One of the best taqueria's in the city."], ["Daniel P.", "I came here for the first time and goodness gracious.... This place is ridiculously awesome. I bought the al pastor taco and asada taco-just phenomenal. The tortillas are homemade!!! They also have a salsa bar where they have homemade sauces. The workers are very nice too. I would come back in a heartbeat. Tacos are $1.75 but its definitely worth it. On Tuesdays, it is a freakin $1.00!!! Get your buttocks over there now."]], "La Noche Buena Restaurant": [], "La Serenata": [["Charlotte L.", "This is a really homespun place but absolutely  delicious.  We had mixed feelings when we first got here. But wholly  guacamole  it's so good. I ordered a cheese Chile relent 2 fish tacos, nachos with black beans. Yummy. Great service.and super margarita. I highly recommend. Screw those 1 stars. Give this place 5 stars and I go everywhere for good Mexican food."], ["Sarina V.", "Came here for dinner with my family one night, this is more of a seafood place and we decided to give it a try since we heard good things.Margarita (4 stars): Good margarita, this was made with agave and fresh, salt on the rim just how I like it on the rocks.Pea Soup (4.5 stars): This was really good and flavorful, I hate peas but it was kind of sweet & didn't taste anything like it, it was perfect with the seasonings.Guacamole (4.5 stars): Fresh guacamole, pretty small portion, they should give more!Chips and Salsa w/ Quesadilla (4 stars): The salsa was different here, not chunky, but still tasted pretty good, also came with cheese quesadillas which was a nice touch!Camarones Al Mojo De Ajo (5 stars): This was really good, the sauce was amazing in a butter garlic sauce and came with rice.Chicken in Tomato Cream Sauce (4.5 stars): This was also really good, the sauce was amazing and the chicken was tender. I love places that have amazing sauces. Also came with rice.Enchiladas in Salsa Verde (4 stars): My mom and I shared some veggie enchiladas, I didn't eat too much that day since I was pretty full from something else. Again alot of sauce and good flavors!Toffee Flan (4 stars): I think this was like a toffee flan, it was good, just not a huge fan of flan, I prefer fried ice cream, but they didn't have this :(Our waiter was super nice and attentive. I would come back here if we were in the area again, the area is pretty sketchy and looks weird but it's a cool place and you can valet instead of find street parking somewhere."], ["Irma B.", "Made a quick stop here a few days ago for lunch. I believe I came here over 25 years ago before Yelp was around. I didn't have a bad experience then but a lot has changed.I can't say the food was bad, it was decent but not out of this world. I ordered basic green chicken enchiladas and a watermelon drink, Agua de sandia. The drink was delicious, no complaints there..my enchiladas were a little too greasy and were loaded with melting cheese which is not how they should be served if they were truly authentic. I like cotija cheese on mine and I should have asked for it prior. The white rice was okay but not great. Chips were crispy and salsa was okay.Service was not very friendly and entrees were priced too high. I paid 25 dollars for enchiladas and a drink, tip and tax included. I work hard and refuse to pay that much for lunch again..with that said, I'll stick to smaller mom and pop places, skip the fancy decor, garnishments,  etc. I can get a decent meal for half of what I paid here. Boyle Heights and East Los Angeles are flooded with great places.I'm from Los Angeles, I know what good Mexican food tastes like..this place does not live up to the hype, if you have money to burn then be my guest.Final note, menu was impressive.there were items there I've never heard of, a creative twist on Mexican food but very expensive. I don't believe these menu items were available 25 years ago when I came here.I gave 2 stars which I believe to be reasonable and fair."], ["Sonia B.", "Service was good.  Food was fine- although to be fair, we didn't try any of their fish...which looks like is their specialty. Liked: red salsa with chips and quesadilla, pea soup, guacamole, fresh made tortillas."], ["Alice D.", "This is the most incredible Mexican restaurant outside of Mexico that I have been to. It is hard to find authentic regional food in the United States and this is a gem for sure. Plus, the service is great! You are treated like family."], ["Anne A.", "Overrated for mediocre \"authentic\" Mexican food and really overpriced for lack of service.  They are really fooling people into thinking that this is a \"nicer\" or upscale restaurant experience.  I feel their clientele are politicians with expense accounts using tax payer dollars to support this restaurant when they have \"lunch meetings\" here. They definitely are not catering to families in this neighborhood with their exorbitant prices.With better and more attentive service, and if this place was located in the Westside or Beverly Hills, I would be more forgiving.I've been to upscale Mexican restaurants and even one in San Antonio that had far superior food and better service.They weren't even busy and never came back to refill my drink or give me water that I asked for. How can they price their items so high in Boyle Heights?  They are charging $20 - $30 per main entree when there much better dining options in the same price range.  I listened to a family of six near my table talk about how they have to sacrifice so many things to be able to afford eating at this \"nice\" restaurant. I heard them say that they were going to get one appetizer to share. I've had better Mexican food for a lot less money.Skip it and don't believe the hype.  Go to Casita Mexicana or Corazon y Miel in Bell only 10 minutes away instead.  If you want gourmet tacos head to nearby Guisados for less money and a better value.One more thing, I got really sick after eating here that I had make an urgent stop at the gas station (if you know what I mean)."], ["Rossi H.", "Dear Senorita Serenata, It really isn't you,it is me.You have a lot going for you.And before you respond, senorita,please, please let me finish. You are beautiful. Your decor is charming; a perfect frame for your beauty. Your food looks deliciousand your attentive servers are most graciously around and do their job to the T.But...Yes...hush my dear. Shh shh shh!Do not say a word.  Please don't make this hard.The food... well, it is alittle pricey. Great ingredients, I know.  Exquisite food costs, it isa good plan on paper. You are a friend to see when I want to act rich but that isn't me. It just isn't.Maybe in another time and another place it would work.Just not today or any time soon. 'bye."], ["Ms M.", "After all these years, still creating the finest sauces and never overcooking seafood. This is not the '60s style giant combo plate with overflowing margaritas, not that there's anything wrong with that. If you want Mexican cuisine that is authentic and accomplished, Serenata is the place!"], ["Adriana A.", "The food was good but it was over priced. What upset me more was that I went for lunch and told the server I was in a rush. He never refilled our drinks unless we waved him down.He only had two other tables which were parties of one. He was gone for 20 min! Come to find out he was chatting with coworkers!! I would be more understanding if he was really busy. NEVER coming again!"], ["Barbie A.", "I went here 4 days before mothers day not knowing I needed a reservation when walking in everyone that worked there looked at my family and I up and down and turned away, I waited at the door to be seated for about 10 minutes until I asked could I get a table for 6 of us... I got no response the female there who I believe was the host looked around when yet there was only 4 people eating in the whole restaurant and told me to wait in spanish...OMG. the worst service ever so I walked out the door never ever, ever would i go back to that restaurant again.... I DON'T KNOW WHAT HAPPEN TO CUSTOMERS SERVICE THESE DAYS. ALL I COULD TELL YOU GUYS IS DON'T GO TO THIS RESTAURANT."], ["Ivy R.", "The food here is amazing ! I was so surprised how nice and big their meals are ! Their vegetable soup is perfection !!"], ["Ladee L.", "I ordered the shrimp gorditas. The shrimp was cooked perfectly. Very light and tasty. The rice and beans good. The starter soup (zucchini) was a little salty. My friend ordered the chicken pipian, very rich and yummy."], ["Cristine G.", "I wanna end this year on a positive note and I was thinking which business to review that will make me keep my promise to my friend Hugh H. What better place than La Serenata?Like Maggie C. mentioned valet parking only. You go up the steps with wrought iron balusters and railings. I also love the native vibe of the interior with its dim lighting, it made me think of the last time I was in Mexico. It just felt like a very cozy place to unwind after a crazy time at work. I had a Carnitas burrito and it was good, quite authentic. I loved the green salsa, so fresh with a kick to it. After stuffing my face, I had Mexican coffee and I was in heaven. A perfect ending to nice travel to Mexico via a quaint restaurant in Boyle heights."], ["Justin R.", "This is not Mexican food. It's just awful over priced crap. My wife and I are both ill from our \"meal\" there tonight. Avoid this place at all costs."], ["Ramon F.", "This Place was one of our Favorites in the Area a beautiful Restaurant hidden in Boyle Heights. Very exclusive, until we came for our last time my wife ordered Fish Fillet (Basa) she started tasting it and felt a weird fishi smell she ordered more Lime and tried it but it wasn't  helping until I tried it OMG, that fish was Bad never smelled anything that bad. We spoke to the waiter and smelled it he agreed and offered something else, but we just had to leave. Bad experience."], ["Lucy M.", "Love this place its a  fancy Mexican food... the food was quality amazing flavors and the atmosphere perfect"], ["Tania G.", "Service is AWFUL. Nobody was at the door to greet us, or anyone that came in after. Food tasted good, but portions were way too small, and overpriced. Salsa was like ketchup and tapatio, charged $5 for pico de gallo. $15 for two tiny enchiladas with shrimp (way overpriced)"], ["Jinko G.", "Authentic Mexican seafood restaurant in Boyle Heights.  I have been dinning here since the late 80's. It reminds me a bit like Senor Pico's which was my favorite Mexican restaurant in Century City growing up in the early 70's..."], ["Frank R.", "I went last night and was wondering why it was empty, until I opened the menu and realized why. I almost spit out the corona I had just ordered. If you enjoy overpaying for mediocre food, then you have found your place. I get the sense that hipsters frequent this place and think this is the best Mexican food ever. It's not. Love there \"salsa\"? I'm pretty sure its tapatio. Go to the grocery store, buy it there and save yourself some money. For what it's worth, the place has nice decor and a friendly staff. That's the second star. Would I visit again? Definitely not."], ["Araceli A.", "I have been to this restaurant twice, if you just drive by, you cannot imagine what's inside, beautiful decor, nice ambiance, the food is unique, I was impressed by their cilantro based sauce, not heavy but full of flavor on their dishes, if I am not mistaken, their food is the style from the state of Oaxaca, beautiful bar, the only downside is their location, other that, excellent restaurant to go out on a date."]], "Guelaguetza Restaurante": [], "Taqueria Los Anaya": [["Brittany T.", "Love this place! Food and services is great! I started going here when they first open. But it starting to be one of those places that change when they get popular. Prices are going up. The portion is reducing. The quality of food is changing. Still my favorite Mexican restaurant for now! It work my nerves when expansion make my favorite place change to my least favorite."], ["DonnaAnn W.", "I know, I know, \"Great Mexican food in LA!\" is not exactly a surprise, but Los Anaya is great Mexican food in LA. They grill the burritos just before they bring them out so the tortilla is crisp and hot. I don't know what they're doing to that rice back in the kitchen, but it's wonderful. Good price, great staff, and a clean, warm interior. Love my lil local."], ["Kat M.", "Kinda just ran into this place on my way home on Saturday while looking for a place to grab some tacos, and I'm so happy I saw this place on Yelp as I was literally a couple miles away, because it is DELICIOUS! Upon walking into the restaurant, I already had a feeling I was going to like it. I liked how clean it was, and the festive decor. I got an horchata, which was really good. I also got the three taco plate combo, which I believe was $7.75. I picked the shrimp, carnitas, and asada tacos and the plate also came with rice, beans, and chips. The shrimp taco was my favorite, it was lightly breaded and fried. The carnitas was good also, its chunks of pork instead of shredded pork. Asada, which is normally my favorite was my least fave of these three tacos. The asada was kinda burnt and overcooked, no bueno. The rice, beans, and chips were great. My BF got the shrimp burrito, the filling was good but not the tortilla, he said it was kinda hard and not fresh, bummer! Service started off great, then the servers kinda disappeared. We had to hunt them down for the bill. Overall, I had an enjoyable experience, and will be back if I'm in the area."], ["Audrey R.", "I went to this restaurant with my sister . I really liked it ! The decoration inside is great! We ordered a cheese quesadilla for $5,50 each, chips with salsa and agua fresca pineapple for $2,50 each. Be carefully because they dont say that you have to pay for the agua fresca, it is not Free!It was a good restaurant ! I recommend"], ["Robert O.", "The Gem Of Mid-City!This neat little restaurant is an authentic Mexican restaurant with great food for reasonable prices and generous portions. I live near by so this is usually my go-to take out spot now. Forget about the Jack in The Box on Jefferson and McDonald's on Crenshaw! And the food is usually ready for pick up in roughly 15m. The grilled chicken tacos are one of my faves! The flavor is amazing and their chile that comes along with it gives in an extra punch. My girlfriend's all time favorite are the chilaquiles. Don't forget about the Horchata!"], ["Sherry T.", "O what an adorable little spot on Adams street! It's a cute little taqueria with fun and colorful decor and a clean bathroom =)The sampler platter was a little greasy but real good. My favorite was the chicken and beans thingy on like flat bread ...? I also enjoy all of their burritos. (Shrimp is my fave) The homemade guac is amaze too.Parking can be a little hecktic since it's only street parking ..but who cares! It's good food with friendly servers =D"], ["Elinor L.", "This place is so amazing- one of the best Mexican food ever!!! Everything from the tortilla chips to the meat to the tortilla soup was excellent! Everything was perfectly made - my burrito was so tasty with a perfect blend of herbs and meat and spices and the tortilla was slightly crispy just like in a commercial.They also have diablo hot sauce which was just the right amount of spiceThe service was great- very nice, fast and helped us out because we were in a rush so we got VIP service.Great for kids and groups- the place has a party vibe with small piñatas hanging and colorful decorationsI will be coming back many many times!"], ["Travis I.", "1/3 = 33%This is a sad update. For me, this place is almost like a second home. I know the family, I love the food, and I live down the street. I was really bummed out by a few recent visits.In my first review, I mentioned the importance of not raising prices to support expansion. Unfortunately, the prices have gone up... Not astronomically, but enough to warrant concern.I came in one day to get burritos for my co-workers. They mislabeled the burritos and everyone ended up taking a bite out of a burrito they didn't order. 0 for 1.Another day, I ordered a steak burrito for myself and they quoted me 20 minutes. I showed up after 30 minutes (10 minutes to ensure that the food was waiting for me) and they still hadn't fired my order. It took them 40 minutes after all was said and done to get me a single burrito. 0 for 2.I went again a few weeks back to score some tacos and--other than the increased price for a taco combo--the flavors were awesome and the food was ready on time. 1 for 3.If any other place did me like this, I would never return. However, I have been here a number of times before and this was a freak thing. As business has picked up, they need to be able to maintain that quality and timeliness. The entire Anaya family is awesome. All three brothers, their sons... Hard workers and the flavors are on point. They are aggressively expanding their business and while I'm rooting for them, I really hope the cost of the expansion isn't placed on the shoulders of their customers. OVERALL. Great shop, friendly family, some of the best tortilla chips on the planet, tasty food, and they cater, too! Los Anaya is a great option if you're feeling peckish and an even better option if you're downright hungry. Best Mexican food in the area, by far."], ["Linda H.", "the best mexican food and best horchata i've ever had. i am definitely coming only here anytime i want mexican food. i found this place on yelp yesterday and accidentally, i passed by it since it's by my house. so i decided to come in. i wasn't disappointed. you wouldn't be either if you were in the mood for mexican food. thee absolute best. this places good reviews accurately depict how this place is in real life. i wish they had carne asada fries though but i guess i have to go elsewhere for that."], ["Spam-Lunchbo X.", "We came here to fulfill our taco craving and because we've heard great things about this place for a while now. I don't know if we happened to catch them on an off day, but we were thoroughly underwhelmed. We'll let it slide that we came in and placed an order to go and had to wait over 30 minutes for 8 tacos, while people that ordered after us were getting served. The wait would have been justified if the food was amazing. It wasn't and our taco craving was not satisfied.We ordered 6 different types of tacos, hoping to find some gold:Pescado taco - Most reviews were saying this was one of the best fish tacos in LA. This was our favorite of the 6, but definitely not THE best fish taco in LA. The breading was heavy which took away from the flavor if the fish. If you want THE best fish taco, I suggest taking a trip to La Cevicheria. That's how you make a great fish taco.Camarones taco - Not too bad, but again not the best we've had. Same problem with the fish tacos, the breading is too heavy and you can't taste the food. Nopales taco - The nopales itself was a little waxy and lacked seasoning, but was otherwise cooked fine.Lenguas taco - The meat was cooked well enough, but we've had better. The 1 dollar lengua taco at Ruebens Taco trcuk is far superior. Al pastor taco - This one as brutally over cooked. It had similar qualities that we associate with a good piece of beef jerky. Honestly, I couldn't tell you about the seasoning, because it was too dry and flavorless. Worth waiting in line at Tacos Leo down the way.Carnitas taco - Another dry and overcooked meat. It seems very common these days, that getting good carnitas in restaurants is hard to come by. Slow cooked, incredibly juicy and flavorful pork is what we all seek. Sorry, not here.Hot sauce - More flavor and heat in Cholula.On a side note: the horchata and watermelon aguas frescas were good. Only had to be asked 4 times to recieve it, but at least that was worth the wait.To sum up this review; to say that we were unsatisfied with our meal, would be an understatement. For a place with such glowing reviews and $2 dollar tacos, we can honestly say that most roach coach $1 tacos would be better (ie. Rueben's, Tacos Leo). In a city crawling with amazing tacos, this place just doesn't cut it."], ["Hilary S.", "If I could give his place 4.5 stars I would.  The chicken taco is the absolute bomb! Juicy and flavorful in a yummy sauce. The grilled fish taco is also amazing - it literally melts in your mouth with a nice fresh slaw. All on perfect thickness homemade tortillas. The hubby loves the carne asada and shrimp (fried) tacos.  Loved the cantaloupe and watermelon aguas frescas - so fresh and flavorful. Also you get homemade chips pico de gallo and guac for only $3.50. All yum.  Very friendly service as well and met the chef who is very nice.  Beware - This place is addicting!The only reason I didn't give it 5 is the al pastor taco was just ok - not as juicy as it should have been.  Husband didn't love the fried fish taco. Also BYOB - great place to come with friend and just hang and eat!"], ["Leslie A.", "This restaurant never disappoints. The quality and taste of the food is amazing and authentic! The enchiladas and shrimp tacos are my favorite. Aside from the delicious food, the customer service is great! Servers are always friendly and welcoming."], ["Mane A.", "best damn fish tacos in los angeles!Truly authentic Spanish food. Little place but big value!"], ["Sean M.", "This place is good.  Its just that simple.Nice and cozy atmosphere that can get pretty bustling when its busy, so come for the food and fun.  Our waiter was awesome, remembered everything we ordered without writing it down and brought the food to us quickly!  Come check this place out, its in a seedy neighborhood but the food is BOMB."], ["Wendy G.", "Amazing tacos. I've tried a lot and these are on the top of my list. Staff was really friendly and service is very fast. Everything is good pretty much. The fish tacos are breaded so beware if you don't like that. Otherwise really great food for the price. The quesadillas also come with complimentary guacamole which is really nice. The place isn't tiny but it still is decently small and you are going to hunt for street parking though weeknights after 8 shouldn't be too bad."], ["Yolanda G.", "Just had a pregame dinner and I have to say we are so happy to have found this little gem.  The food was fresh and great tasting, good portion sizes.  Excellent service and good prices.  We will definitely be back.  This USC Trojan family loves it.  #fighton"], ["Alan V.", "$$ Overpriced for what it isOK serviceKinda rachet locationFood kinda meh, nothing really outstanding about itThey charge for the chips and salsa (WTF, that really is rachet) and they try to push guac on you multiple times.I'd go to Leo's taco truck on La Brea/Venice Blvd. The food's way better and cheaper."], ["Veronica R.", "I really wanted to like this place. Stopped by with my sis to finally check it out. Together we got chilaquiles w/ asada, 2 sopes and 2 tacos. Maybe we're just a bunch of chubsters but for the price the portions were super small. Overall, the food tasted good the portions were just super tiny to me. And no chips and salsa for the table. For being pretty empty the service was slow too. Luckily I was near the cashier so I could ask for stuff by just turning back and telling him. But if I didn't do that I would have never seen the staff.  Not sure if I'll be coming back since there's so many other Mexican joins just as good around. But this place is worth a stop on your own to decide for yourself."], ["Irma A.", "Our overall experience  was great, it is very folkloric,  decor and music. The children  loved the guacamole  and chips. Their critic on the guacamole  is a must on every Mexican restaurant  we go.  Costillas  norteñas  were great to the ones that like that crisp flavor.  Mango Chicken really good. They got Bread  pudding  Which  is awesome. The restaurant  is clean family friendly.  Beans are a little  dry to my taste."], ["Joe P.", "I heard the fish and shrimp tacos were good here... I heard wrong!!! I do have to say the service was good, but I was looking for good food and this is not the place. Rice and beans were probably a day or two old. Nothing special at all. Disappointed to say the least.Both stars are for service..."]], "El Carmen": [], "Chichen Itza Restaurant": [["Vic C.", "I NEVER give a place 5 stars, this place definitely deserves it. I didn't go in with high expectations, then i saw the menu's prices and thought it was way too pricey for a fast food Mexican joint. But after trying a variety of appetizers and entrees... damn! It's worth every penny. So bomb and freshly prepared, everything was delicious and i ain't even lying. Even the aguas are fresh and tasty.  Oh! And i guess they make and bottle their own habanero salsa that is really good on their food it complements it. Spicy but not overwhelming. Super hooked up too, a whole lot of meat, we boxed it up brought it home, i microwaved it later and it was just as bomb and juicy, the leftovers fed 2 people."], ["Madeline R.", "Love, love the food.  Had the ceviche...amazing & very. Fresh!  Had the fish tacos...they were big sized & very good.  Oh, I tried a new drink, Chaya..from spinach & has various juices in it.  All yummy!  DON'T let the outside of the building this restaurant is on it fool you.  It's in a spot you would guess would have absolutely delicious fresh Mexican food.  I'm coming back!"], ["Trang B.", "This place really didn't live up to the hype. The food itself was okay, disappointing for what I was expecting, but okay. The problem was waiting 30+ minutes at 3PM when there wasn't a line.Cochinita pibil - braised pork in banana leaf. This pork was tender, but lacking the flavor I wanted.Plantains - cooked well, but the plantains themselves weren't very sweet.Rice and black beans were just.. rice and black beans, nothing special.I feel like the food should've been earth shattering amazing because I was so hungry, but it just wasn't. It also didn't feel quite worth the $11. I'll be ignorant and unworldly and stick to Mexican food."], ["Jury C.", "Yummy longanisa asada and the Poc Chuc boneless chicken are delicious. The resto is based on homemade cooking the chef grew up with from the Mexican Yucatan mountain range. They also have breakfast and taco options as well as fresh fruit drink options. I drank the tasty guanabAna which is a tropical fruit. Location is in a co-op market by USC. Highly recommend. The market has other options like tasty and affordable vegan Ethiopian, Thai, and taqueria."], ["Michael L.", "If you like authentic Mexican food (yucatan style) without pretentious atmosphere... This is the place. No chips and salsa or typical dishes here. Just real food prepared and served with care and pride. The menu was full of great choices and did not disappoint. Cochinita pibil was great but I think the pollo asado was the signature dish. The chicken was full of flavor and not like anything you get at a typical Mexican restaurant.  Located in the neighborhood with cool and casual outdoor plaza and indoor market.  This place is on my short list when in LA.  The plantains were perfect."], ["Sara D.", "Pretty expensive but good food! Definitely better than other places around USC, I would go once in a while. Feels a lot more authentic Mexican than many of the other places!"], ["Smart G.", "Pretty good food. I had the Tacos De Cochinita Pibil (Pulled Pork) and they were awesome. Most of the food has deep southern Mexico flavors; likely inspired by Aztec cuisine and culture.The food court is pretty much the whole building. Not sure what else is around to keep the place open."], ["P'Angeleno L.", "Best fish ever.  A grilled Branzino served with rice and beans, tortillas, sliced avocado and pickled onions.  Amazing.  Bomb diggity and super fresh.  That fish tastes like they just plucked it out of the water out back.  Panuchos are beautiful crispy little tacos.  And I just spotted Tacos de Chicharron.  Next time."], ["Lainy C.", "Love it! I'd been meaning to check out this place for years, ever since sampling them at a taco tasting event but never made it back to mercado. Then one weekend we decided to check out the Endeavour at the science center and it was a short walk away. We shared the tikin xic and the cochinita pibil and it was delicious. The sauce for the fish is quite good. The food takes awhile to prepare, it's definitely more like a restaurant despite the food court atmosphere of mercado la Paloma. Prices are very reasonable and the people working here are very friendly."], ["Russ C.", "I would not have thought there was a restaurant around here. I have been wanting to come back to this place for quite a while. We had the Cochinita Pibil y Tacos de Poc Chuc. Both were excellent.  The Cochinita was prepared quite with lots of flavor.  While the tacos were a little different with tender pieces of meat. It felt like we were eating at my friends house in Mexico with the wooden table and chairs. Cool setting and ambience.Parking was good right in front of door. Restaurant is in a Food Court setting in Mercado de Paloma."], ["Lovedabu B.", "Far for me but worth it.. I love all of their tacos, I had the fish it was very good. The orchata is on the sweet side, plantains are very good.. Some of the best authentic tacos in LA.. Our Italian friend liked the pibil tacos and the bartered fish tacos.. Kids also loved the tacos.."], ["Bruce H.", "My second visit and the food was wonderful! I had the Pollo Pibil and it came with corn tortillas. It was enough to feed two people. Also the Jamaica was the best I've had in LA... Just the right amount of sweetness. Next time I will try the Cochinita Pibil. Besides the delicious food, everyone was very friendly and made it fun to be there."], ["Andrew T.", "Chose this place at random after tailgating at a USC game. Came up recommended on Yelp. Ordered the Conchita Pibil tacos and also tried a friends Pollo Asado as well. Both were excellent.Also tried the Sikhil dip and the Kibil as appetizers and both had great flavor as well. Fried plantains are great too. The seating is open and cafeteria style, with other food establishments in the marketplace (think food court). Highly recommend this place."], ["Ali I.", "My bf found this place on yelp so we went because we are obsessed with all things habanero. The food court was cute and kinda reminded me of Berkeley.Didn't quite know what to order but we decided to share the papadzules and the tacos de cochinita pibil. I got a jamaica and bf got the atol de coco.Papadzules: Wouldn't order again. Not sure if this was an off night but there really was nothing good about this dish. There was barely any hard boiled egg in each tortilla. The egg seemed super over cooked and really chewy or maybe it was refrigerated? not sure. The tortillas were super dry and I could barely cut them with my fork.The pumpkin seed sauce was also not very good...I love pumpkin seed salsa and was expecting it to taste somewhat similar. This sauce tasted more like the white shell of the pumpkin seed than the seed itself. Tasted like microwaved tortillas with sauce thrown on top. Didn't really want to eat anymore of it after the 1st or 2nd bite but we did pay for it so we doused it with their habanero sauce and ate most of it. Tacos de cochinita pibil: Again the tortillas were super dry like they had been microwaved. The cochinita pibil itself was good. Tasted like carnitas with some brown sugar added to it. Portion wise there was probably about 2 tablespoons of meat if that. Also one taco had maybe 4 big chunks of pure fat...so there went a 1/4 of my taco meat. Jamaica: One of the better ones I've had....not too sweet.Atol de coco: It was yummy and my bf loved it.... but just tasted like warm coconut milk like the kind you use in Thai cooking.I do want to give this place another chance and will. Maybe it was an off day or maybe I ordered the wrong thing? The pollo asado with platanos looked good so maybe I'll try that next time."], ["Melina G.", "Omg so good to eat! Like incredibly fresh and yummy(:And so very affordable! So, I left my purse here, and as soon as I noticed I called the restaurant. Jose Manuel saw that I left it and put it off to the side for me (: I am so thankful that they would do that(: Anyways, yummy food with an awesome staff! What else do you want?!"], ["Shichun H.", "Like it a lot, bread good, chicken tasty, black bean paste surprising, sauce amazing."], ["Liz F.", "The food is awesome, this second time come with my aunt and cousin, and they had Tikin Xic, Puc Chuc,  Plátanos Fritos con Crema, and of course the Cochinita Pibil,  the flavors are unique on each dish. I recommend all the dishes you won't be disappointed if you like authentic Yucatan  food."], ["Pamela E.", "As someone who has family born and raised in Merida, Yucatan - this place is pretty damn authentic - not to mention delicious!!! If you know anything about Yucateco food then this is gonna be your new spot!  And even if you don't, this should still be your spot. It's located inside of a little food court/plaza in LA but you can tell the majority of the people in the plaza are going to Chichen Itza. This place fills up!!! Its open seating so be ready to jump on a table as soon as someone gets up to leave. Guy Fieri has even been here. Anything featured on Diners, Drive-in's, and Dives is usually a win in my book."], ["Logan N.", "Love the authenticity of this place! It's located inside a market with other restaurants (kind of like a food court). It's located in the back, but if you get lost then just look for the one that is the most crowded. Everything we ordered was recommended by yelp:1. Horchata: yum! it goes so well with the spicy dishes2. Guanabana: refreshing but the horchata paired better with the dishes. They say it's made fresh....but maybe he was confused with what I asked because fresh guanabana is expensive3. Poc Chuc: 2 tacos with pork shoulder, avocado, black bean, roasted tomato and onion (gotta try)4. Pollo asada: I actually liked this dish more than the pork because the chicken was juicy (and you can smell/taste the mesquite charcoal). The dish came with plantains and black beans, which were both delicious.Ask for habanero sauce!!! Without this sauce you're not doing yourself justice. Will be coming back for sure!!!! and parking is easy/free"], ["win h.", "Food 5 stars. Environment OK. Torta cochinita pibil, pork was tender and flavorful, but plain sandwich. the potato salad with it was tasty. We also orded the tikin xic fish. Very good for the price. Good tasting food for fair price..We marked off one star because the dining area is not very enjoyable, feels lilke a cafeteria. Wish they would make a restaurant! Oh yeah and the horchata was very different, more ricy and authentic opposed powdery and sugary sweet like most."]], "CaCao Mexicatessen": [["Anne A.", "Cacao Mexicatessen is an interesting concept of a fast food restaurant. It's a deli, coffee shop, and Mexican restaurant. For some reason, I expected a full service restaurant experience when I walked in.You walk in through the door then order at the counter. You're given a number to put at your table and they bring your food over to you.  Not much for service at this restaurant.I wasn't too hungry so I ordered two tacos as suggested by the cashier. The spicy cochinta pibil (shredded pork) and the taco de guera (fried breaded shrimp) topped with uni (sea urchin).  Both tacos packed some heat in each bite that I had to sip on my horchata between every bite. It's seem like the item they are famous or most know for is the duck confit tacos.They have so many interesting \"Modern Mexican\" items on the menu other than tacos to try. This is not your typical Mexican restaurant, so expect to spend more time looking at their menu.I loved the handmade tortillas used for their tacos.  It makes all the difference when eating a taco.Parking might be tough. The restaurant is located right by the Trader Joe's in Eagle Rock. I was able to find street parking in the neighborhood."], ["Tricia M.", "A friend recommended this place and raved about it so I was pretty excited when she suggested we meet here for dinner. Once I arrived, I realized it was an \"order at the front\" restaurant and then seat yourself. As our entire party hadn't arrived yet, she and I decided to sit at the bar for a margarita first. We each got just a regular agave marg and it was pretty good...didn't taste too strong for my liking. Once everyone arrived, we were going to go to the front and order but since it was pretty crowded on a Friday night, we decided to just grab a table first. One of the servers saw us sit down and said she would be able to serve us from the table so that we wouldn't have to get in line. It was nice. The table was incredibly small for 3 people so we were pretty cramped. We ordered chips with salsa and guacamole for the table and I ordered the Abuelita's Enchiladas with mole verde. The enchiladas aren't your typical rolled enchiladas, they were stacked in one round circle. It came with a zucchini/corn side dish and Spanish rice. I found the enchiladas to be really dense (felt like I was eating a stack of 10 tortillas). It didn't really taste all that great either...I've definitely had more flavorful enchiladas in my life. I ended up only eating 1/3 of it since it was sooo filling. The service is subpar....one of the servers spilled all over the gentleman sitting next to us and barely apologized to him, which I found to be unacceptable. This place wasn't what I expected it to be...the other kicker is that the parking absolutely SUCKS. The driveway to their parking lot behind the restaurant is SO narrow, I was so worried my car would get scratched...once in there, there was no parking, I had to do a 5 point turn to get out. It was very inconvenient. I ended up parking down on a side street and walking."], ["Terry G.", "This place makes the richest, tastiest, most decadent mexican food around. Gets my vote for specialest restaurant in eagle rock. Definitely 'sit-down' style food.The hot cacao is an amazing treat.The fig/poblano mole will fill you with warm fuzzies.Top notch ingredients. This is artisanal food of the highest caliber.Excellent beer selection.I'm vegetarian and I was well fed with rich tasty treats.DO IT!!!"], ["Taty G.", "We love you Cacao!Ignore the whiners, this place is legit. What it is: a slightly foodie twist on Eastside Mexican with a great mostly-Latino staff. What it is not: a taqueria in Boyle Heights. Most of the whiners seem to think that this is a supposed to be a greasy or down-home Mexican restaurant, it's not. Nothing wrong with either but don't judge a place for being what it isn't. Word!We love to come here after shopping at Trader Joes next door (because there's only so many free samples I can jack). The blue corn chips are epic. I love the camarones enchipotlados tacos (shrimp).  They have a citrusy spice to them that is the bomb. My husband loves their giant burritos and carne asada tacos. If you order the enchiladas be prepared, it will be the size of your face! They don't mess with portions.It's a great spot to watch games if you want to avoid a rowdy sports bar. All the staff are super kind. We especially love Edward! He's the young guy with the big smile and afro. He's always happy and helpful. (He's also a student so tip generously.)"], ["Dora V.", "Always amazing food and loud chill restaurant! It's a must if your in the Area!!!"], ["Charlton C.", "It seems like it is a tradition now to get margarita's on Sundays. This location is an interesting take on a restaurant, there are no waiters/waitresses here but instead you order at the counter like a fast food joint and seat yourself and wait for the food to come to you. There are booths that are reserved for parties 3 or more so nab one while you can.After looking over the menu, my gf and I decided to get their version of a carne asada burrito \"wet\" style and an order of their take of carne asada fries as well. The good thing about not having a server is that you can get everything yourself. Need more water? Head over and grab a big bottle yourself! Need more plates/utensils? No problem! Get as many as you desire. Need to go boxes? It's right around the corner. You see where I am going with this, everything is just so much more convenient when you can just get up and get it yourself without having to rely on someone to get it for you, which I find nice. The food is kinda pricey for what it is. I always considered Mexican food as cheap \"street food\" since pretty much it revolves around choice of meat, rice, salsa, beans. Basic foods that do not have high costs and can be purchased at large quantities for cheap, but I guess for a location like Eagle Rock they have to charge more than usual for it. Price aside, I think that this place is pretty good for what it is. The portions are pretty good, the burrito was more than enough for 2 people, and with the fries on the side it was a perfect way to fulfill my craving for Mexican food. With the limited Mexican food options in the area, this place is a good option. I will come back here again when the situation presents itself."], ["Zin W.", "I came here on a random day with my boyfriend and his mom. I'm not sure why this was bookmarked on my yelp but it was and I am happy.I got their shrimp wet burrito, which was good but I really liked their carne asade wet burrito that my boyfriend got. We also got their micheladas but I thought it was okay, at least it was happy hour. I like their chips and salsa!!Environment:  Cozy inside and outside seating, there is a bar, order at the counter before seating.Service:  The girl helping us with our order was very helpful and friendly.  All the waiters were nice.Parking: On the streets, I'm not sure if they have their own parking."], ["Violy M.", "Walked into this place a realized it was a mad house! Almost all the tables were being occupied, a good amount of people in line waiting to order, busy servers hustling this way and that way in the tiny little restaurant. Luckily, when we informed the server we were only here to drink she didn't skip a beat & right away scored us a table & went to make our drinks. 3 rounds of micheladas in & the crowd dying down, we ordered a carne asada taco, fish taco & a cochinita pibil taco. All 3 served on fresh hand made tortillas. My favorite & most flavorful was the cochinita pibil taco. I absolutely adore this place! Can't wait to continue to go back & try the different items on the menu! ^_^Your Homegirl,Violy"], ["Gary I.", "Cacao Mexicatessen is a wonderful mongrelized word: Mexican & from a Franco German word combination, Delicat = delicate, Essen = eat, food, meal.  Façade of Cacao looks like a small ranch house made from red/brown adobe w/ a small front porch for al fresco dining on an hacienda in Northern Mexico.  The look deceived me since I thought I would be greeted by meseras in a dress closer to regional dress.   However, upon entering, expect to get in a line so you can get to the order counter, and as the signs say, \" Please be ready to order at the counter.\"  Grab a menu while you are in line or look up at the blackboard  since indecisiveness at the counter wastes time so that the people behind you get delayed. There is no wrath greater than from strangers w/ empty stomachs.  Once you order & pay, they give you a stainless steel rod w/ a number card so they can bring the food to where you have claimed a seat.  1)  Taco Asada:  beef seemed marinated in a reddish tomato/chipotle/garlic sauce so that when the beef was grilled, it retained a moist, soft texture unlike a lot of Carne Asadas that come out being over cooked & extremely dry & hard in texture.  Diced onions, microgreens, cilantro along w/ a red salsa which also tasted of chipotle, tomato, garlic were the garnishes.  2)  Taco de Confit de Carnard:  Confit in French cooking means cooked in its own juices or fat so the duck meat in this case is cooked in its own fat.  Meat is shredded, & dressed w/ pickled red onion slices reminiscent of the Yucatan style & thinly sliced smooth, unctuous aguacate/avocado.  Squeeze of green lime provided a gastrique to counter some of the oiliness.  The duck is meaty, subtle in seasonings so that the nuanced duck flavor comes through.3)  Vampiro de Taco: is of fried duck skin, guacamole, Pico de Gallo/chopped up tomato, chiles, onions, micro cilantro, Cotija/aged dry cheese, Salsa Verde/tomatillo, chile, onion, garlic.  Tortilla is closer to a pancake that is thick, moist, soft, pillowy w/ 3 cheeses infused in.  The complex flavours all marry well & swing toward a more funky, fermented, dairy flavor w/ the fried duck skin acting as the rich, fatty foil.  However, the fried duck skin retained a strong \"old oil\" smell & taste that ruined this complex taco.  4) Aquachile de Camarones:  Julienned crunchy Jicama, diced red onions, cool sliced cucumbers, sliced aguacate, ultra thin rings of Serrano chiles, cilantro microgreen, about 6 whole medium shrimps slightly seared, but still raw in the style that Japanese chefs would call Tataki. There is a complex watery salsa that has a strong scent of lime juice, serrano chile infusion, possibly a touch of medicinal, bitter Epazote & Oregano that adds an herbal, oily, smoky funk.  Semi-raw shrimp was velvety, soft, moist, & since there were so few shrimps, I decided to chop up the shrimp into fine pieces & tossed them in the julienned vegetables for more equal distribution.  Lady Isobel L. & I thought the Aguachile de Camarones was the best  dish chosen.  Lime/serrano salsa w/ its complex mixture of herbs & seasonings awakened the refreshing vegetables & shrimp as well as adding citrus gastrique & earthy herbals tastes. The chile heat was toned down for us \"gringos\". Purple corn totopos/corn chips are provided.  1-4a)  Ordered the wine flight where you can choose 3 wines from their selection.  However, the Chenin Blanc & Petite Syrah by LA Cetto were flabby & unbalanced in terms of sugars, tannins, acidity.  Merlot by Bodegas Santo Tomas was better, but still rather lackluster compared to a better wine like El Grenache also from Baja California del Norte in the Valle de Guadalupe as served at the incomparable Babita Mexicuisine.  5)  Hot Cacao: Hot chocolate from Oaxaca w/ scalded milk, sliced almonds, powdered canela/cinnamon.  I stirred all the ingredients together to incorporate all the flavours. The mellow chocolate, & canela made the scalded milk take on a more thick, viscous quality. Nice alternative to dessert.     Nino appeared to ask us if we needed any further assistance.  He's the one who made our excellent Hot Cacao.  He told us a little bit about the history of Cacao Mexicatessen.  Initially it was to be a Yogurt joint until another yogurt place was set up before Cacao did so a new concept restaurant scheme was developed. Nino's sister is also a chef at Cacao.  We also talked about the food at Cacao, & Nino also elaborated on the production of Oaxacan chocolate & pointed to a bunch of brown chocolate pods hanging from the ceiling near the order counter.  After all, the origin of chocolate is Mexico.   Generally, the food at Cacao Mexicatessen is well executed w/ a few faux pas such as the wines & the fried duck skin, but the price & the quality of ingredients  are reasonable.  Nino was charming, helpful, & informative which upped it to the next star.  4- Yelp stars for a pleasant Wednesday evening."], ["Val R.", "Micheladas were delicious! My favorite was the cucumber Michelada, so refreshing. The Duck Taco is a must have! It was very rich in taste. The shrimp taco was also very delicious.   Downside: you need order your food first at the cash register before you get a table."], ["Kay V.", "I've been here a few times since my original visit and I've tried different plates and they have all been tasty; I still wish they had kept the Rib-eye steak vs the Skirt steak but its okay, I can get my steak fix elsewhere and still come here for their tacos. They have opened the other side of the restaurant which offers more seating. They also now have a bar where they serve a variety of craft beer; just up my ally. Over all my experience here was good."], ["Loree K.", "After reading amazing reviews about this place and recommendations from others, me and my boyfriend finally decided to try it. We walked in and loved the vibe. Its very authentic looking with a very elaborate menu (mostly in spanish). He got a torta and I got the carne asada special from the lunch specials as our entrees, and the corn as an appetizer. We also took home some guacamole and chips and the chile apple. All I have to say is that I am extremely disappointed. The service was slow even during a time where the place was pretty empty. The food was OK, edible but not amazing. The carne asada meat was the problem. The corn on the other hand was PHENOMENAL. The guacamole, once again very WHATEVER. I expected more from the place but I guess I have to test out other menu options before I make my final decision. My tip for now, do NOT get the carne asada. Did like the vibe so will be back to test out some other menu options."], ["Nancy J.", "This place is a little pricier than most Mexican restaurants. But this is not your typical Mexican fare. Portions are a bit on the smaller side, and you'll finish your dish wanting more.I love their cafe de olla.One of the reasons for this is their amazing coffee mugs. When I asked the friendly cashier if I could purchase one, he handed me the artist's business card (I now own a set of 4 mugs)I think I prefer the breakfast to their regular menu, but I am partial to their mole fries. They also have a lunch/dinner dish with squash blossoms. I haven't seen squash blossoms on a menu since the 90's, so I had to try that. It's a self-seating restaurant, so you may need to wait. I've never attempted to park in the lot. There's always street parking nearby in this very walkable Eagle Rock neighborhood."], ["Stephen S.", "I'd heard some good things about this place. Thought I'd check it out. Ordered the mole chicken and the sweet corn. Absolutely delicious!!! Really good flavors. The staff are attentive and friendly.For drinks my wife had sangria (the best sangria north of Mexico) I had michelada de casa. Wow! So good!We will be back soon!!!And the chips were fresh and spicy!!!"], ["Eehur R.", "Tastiest Mexican food in LAService 3/5 Food 5/5Ambience 4/5The hot salsa is incredible Recommendations:Tacos tacos tacos - never tasted a bad taco hereBurritos are HUGE I recommend sharing"], ["Paola N.", "Mexicatessen ... I like the sound of that. THE AMBIANCE: CaCao looks like a small cafe from the street but it is actually a decent size inside. Right when I walked in I noticed wood and that there were little signs and colorful writing everywhere. There are some black belts like the ones you see at the movie theaters where patrons start forming a line to order. The menus are at one (1) of the two (2) cash registers in wooden tray boxes. I really liked the decor of the place. Mexican meets cabin meets cute. There is a good amount of inside seating, seat yourself-style, in this cozy place and there are also tables and a bar top outside on their front patio. THE FOOD: I went with an \"Ensenada fish taco\" ($3.50) and a \"Pollo Asado Sope\" ($5.50). The fish taco at CaCao is the fish taco with the closest batter profile to real Ensenada fish tacos that I have tried in LA. The difference I saw, however, between the CaCao fish taco and the real Ensenada fish tacos is that the CaCao fish taco has a burnt oil after taste. It had that \"it's time to change the oil/it's starting to taste charred\" taste. The tortilla de maiz was on point and the fish taco overall is a WAY better fish taco than Ricky's fish tacos in Los Feliz/Silverlake. I am still flabbergasted as to how people write that Ricky's fish tacos are the best fish tacos in LA! Dios mio ... No way, mi amigo. If the CaCao fish taco hadn't had that burnt oil aftertaste I would think it was the most authentic/best fish taco I have tried in LA so far. The sope is not the best sope you have tried because that would be your grandmother's sope but let me be fair. The masa was really good. I was happy that it had a slight crunch and semi soft middle, as sope masa texture is supposed to be. The chicken was soft, cubed, and well-seasoned. The toppings were fresh. Also, it's pretty big and filling. I enjoyed it. I tried a watermelon agua fresca and it was good. There are other agua fresca flavors to try. THE TIPS:There is parking in the back of the restaurant but there is a mean dip when you exit back onto Colorado. I saw an older woman making handmade tortillas and it made me feel warm inside :) The menu said $3.50 for the fish taco and my bill said $3.75 ... Hmmm.. I only asked for the salsa on the side. Might it be a \"fried\" charge of 25 cents?"], ["Pauline G.", "The only downside of this place is the \"deli\" aspect.I absolutely love their food: shrimp sope, sea urchin chile guero taco, the potato taco with a generous helping of shredded cheese, mole fries, and tamarindo candy apple-- all fantastic. However, the service at the deli counter is the reason I can't truthfully give this gem five stars. In a perfect world you'd be able to seat yourself and have staff provide you a menu and take your order. They have very friendly staff walk around and check in with diners to make sure everything is enjoyable. The younger kids stationed at the cash register is what frustrates me about this place. Half of the time they are slow to take orders due to chatting with other staff- a teen that rather finish their conversation than help a guest and lacks a welcoming tone when she does ask what you want to order. Not appreciated.But when you do get your food- it's heavenly."], ["Marissa B.", "Went here this evening and I have to say, I was impressed! Ordered the Mission Fig Mole plate, ordered my 3 year old a kids burrito and my other half ordered the Abuelita Enchiladas. My daughter's burrito was the perfect size for her, and was simple and yummy. Now - my plate - the mole was delicious. Rich, with small chunks of grilled chicken and an blend of chopped veggies mixed in. It came with a bucket of handmade corn tortillas. It was a great food experience. I also decided to treat my kid to a hot chocolate and also ordered an Aztec chocolate mocha latte. Another great item - my drink was spicy and warm.  Overall a wonderful place that I will DEFINITELY try again and again."], ["Daisy L.", "Finally decided to come here, and what better day than on Mother's Day.As a Mexican-American Yelper, it is hard to find good quality Mexican food, but mostly Mexican food that will satisfy your parents' palette. By far, one of the most modern twists on Mexican food and my parents are in love with this place! The food is very varied and they do have vegetarian options. As for drinks, I'm on a mission to try all the different coffee options they offer. Will continue to come here so I can try the various options. PS - you MUST try the tres leches pancakes they offer for breakfast!!"], ["Eric M.", "I love this place. Creative. Tasty. Great tacos, burritos, enchiladas you really can't go wrong here. They have a taco special of the week that are awesome and my favorite taco is the chorizo and egg. It's one of my favorite tacos in LA."]], "La Azteca Tortilleria": [["Judy Z.", "YUMMY quesadillas! The quesadillas have the perfect balance of meats, cheese, and salsa, and the tortilla had just the right amount of toast and crunchiness! The hot sauce they give you is not very spicy, it's more on the bitter side. I thought the burrito was delicious too, and I'm not even the biggest of fan of burritos in general. We tried the chile relleno, which again wasn't spicy at all, that was a little disappointing because I love spice! Overall, great lunch spot if you're in the area and in the mood for Mexican food!There's not very much seating inside, so if you come during lunch rush hour, I'd consider getting take-out!There's a small parking lot next to the restaurant, and street parking is available. Just make sure you don't park in the clinic parking lot at the corner, we got yelled at by a police officer =X."], ["Estaban U.", "my new favorite place hands down the best carnitas...tacos where so good and service was awsome I will be coming back for more.."], ["Porsche C.", "I decided to stop by here for lunch after visiting the CHP office down the street.  Cops suggested it and for whatever reason, they always know the best places to eat.  Anyhow, I was a little disgusted by the lack of parking.  Parking is very important to me.  I had to park a couple of blocks away and walk--very disappointed in this fact.  I got there and ordered a burrito and chips.  I was shocked to hear that there would be AN HOUR WAIT for a to go order.  Really?  I decided to stick it out.  I was not disappointed.The chili relleno burrito is out of this world.  It was fresh.  The tortilla was soft and crispy--how do you do that?  The beans were light and airy.  The carne asada was seasoned throughout.It was worth it."], ["J B.", "Best refried beans in Los Angeles! A wonderful family business with great customer service. I had a need for last minute catering size beans and carne asada.  They had the order ready within 30 minutes and walked me to my car! So glad I found this place!"], ["Ray T.", "Do the expectations live up to the hype? Yes. Would I recommend this place to people? Most definitely. Is it worth a trip? Depends how hungry you are. The restaurant is a small space on Cesar Chavez Ave with a few tables and barstool for dining in. It can get crowded so if you don't wanna wait call ahead and pick up your order. The burrito is all about the freshly made flour tortillas!! This was my first visit but I will gladly be coming back."], ["Randy C.", "Just enjoyed a chile rellano asada burrito.  I was a bit skeptical at first.  How different can a burrito be??If you enjoy a good tortilla, you have to eat here.  After I took my first bite, I knew this was gonna be different.  The tortilla is flaky and crispy and soft and pliable.  It's everything you never knew you could have in a tortilla.  If a tortilla married a croissant, this tortilla would be it's beautiful love child.If you haven't been, it's time to go.  Bliss awaits~~"], ["Rachel E.", "Excellente! Asada was a bit grisly, but otherwise, my asada chili relleno burro was on point. It was so large I could only eat half. If you enjoy authentic Mexican food this little spot is definitely worth a try.  Tip: Get pan dulce across the parking lot at El Gallo."], ["Cristina L.", "Im rating this based on my first and second experience.  I had the Chile Verde burrito. Best burrito I've had. Tortilla reminds me of the ones my grandma used to make. My experience was great, so I decided to take my boyfriend...Negative in his opinion. He had the asada burrito. It wasn't a typical burrito. Just had the meat, beans, and  tomatoes, (can't say Pico de Gallo because it just has huge chunks of tomatoes with no flavor) and unfortunately a hair. So for my boyfriend it was a TERRIBLE first experience, but in my opinion the Chile Verde burrito is still the greatest burrito so far, I have yet to try the Chile Relleno burrito.SUGGESTIONSAdd some ingredients to the classic burritos like asada and carnitas.Wear hair netsCut the tomatoes in the Pico de gallo more."], ["Vicente P.", "Best tortillas is town. Every bite is like a kiss from an angel. This is the only place you can get tortillas made to order. My mom won't even do that."], ["Eduardo H.", "Great Food. A must do if your in the area. I drove 97 miles for this burrito. But was worth the drive."], ["Crystal C.", "Fresh flour tortillas for your burrito, need I say more? Yes. The ingredients for their burritos are tasty, well seasoned, and taste fresh. All burritos are made to order, so you get a hot yummy burrito to indulge in."], ["Bryanna P.", "Do you love burritos?Who doesn't love burritos? (Crazy People)We were finishing up a meeting in the LA area and it happen to be lunch time, my co-worker stated he was going to go have one of the best damn burritos around.  There is no way you can say that to me and not expect me to invite myself :), so I followed him from our jobsite to a nice little stretch of East Cesar E. Chavez Avenue.  This area of East Cesar Chavez is actually a cute spot, lots of restaurants and store fronts and apparently there is a really good Mole place across the street.We entered La Azteca which has a very simple set up, a few tables, bar style seating, and the counter where you order that has the menu written above on some black boards.  My co-worker said that I must try the Chile Relleno Burrito with Carne Asada and that their home made tortillas where just the best ever, I trusted his judgment and we both ordered the same thing.  The gal at the counter was super sweet, and informed us that our burritos will take a few minutes which was not a problem.  As we sat there my co worker told me how he found this place by reading an article in USA Today, and since the first time he has been there he hasn't been able to stop coming back.  He and his girlfriend make sure to always stop by when they are in the area, and even go out of there way when they have a craving.Well... I know why they go out of their way!!!  We got our burritos, with our side of red salsa I could smell the tortilla and was beyond excited to chow down.  The burritos all come stuffed with beans, their home made pico de gallo, something about their pico de gallo is special it really pulls everything together.  So I began to munch on my burrito goodness, and me oh my!  It was so flippen delicious, just every bite was amazing and the cheese that oooozed from my chile rellano on to my savory home made tortilla, spectacular.  I literally scraped the cheese that ooozed on my wrapper and whatever pico fell from my burrito into my mouth.  This burrito should be named \"Little Piece of Heaven\".I am so looking forward to  my next visit, and I am going to be sure to bring back home a dozen of their home made tortillas.  **There is no public restroom here, so be sure you dont have to go ;)**"], ["M N.", "Wow the best burrito I have ever had , I order the chile relleno with chcicharon.  I will definitely be back ."], ["Char A.", "The only reason I am not giving them 5 stars is because I want to come and try their regular burritos. So far, just from the breakfast options, I can say that a 5 - star rating is highly probably in this place's future. The chicken chorizo burrito (add cheese, trust me) was crazy good, wrapped in the deliciousness that is a handmade flour tortilla. I'm already counting the days til I come back for more!"], ["Marcy N.", "Got myself a chile relleno burrito with carne asada all rolled up in their homemade flour tortilla...sooooo delicious and perfect portion!"], ["Giovanni F.", "My friends and I decided to take up on LAist.com best Los Angeles burritos and they had this place listed as a must try their 'Chile Relleno burrito 'The food did not disappoint, come here expecting a good sized burrito that tastes amazing. There is little room for dine-in, I would say there are like 6 tables total for dine-in... so you may have to wait for a table or sit at the bar against the wall.Service was pretty good."], ["Adam R.", "The salsa could be hotter, the dining area could be bigger-but everything is forgotten when you get your food! I had the chile relent burrito which was good-but the tacos were great-homemade chicharrones, homemade tortillas, salsa and coke in a glass bottle!  I can't believe I have been missing out on this place! A must try on the east side-we ended up ordering extra to take home for later!"], ["Jeff H.", "Got the chile relleno burrito with Asada Pretty unique and definitely deliciousI bought flour tortillas to go too"], ["Nicole M.", "I recently got a new job in the area and I'm unfamiliar with the area so I was browsing around looking for a place to eat. I came across this little place and wow, Im glad I did. Its literally right down the street and just UGH SO GOOD. I'm pretty picky with burritos and I'm native to San Diego style, but I've found my salvation up here. I really hate when ingredients aren't proportioned correctly, ie. one bite all cheese, another all meat etc. but this burrito had perfect amounts of goodness in every bite. I'm also a sucker for tortilla and hate to waste even a bite and these are made from scratch and so perfectly chewy and drool inducing. LOL, please pay them a visit. The service is very polite and they're runnin a great business. yes, yes and hell yes.OH and for the guy who gave a 2 star review, I guess everyone is entitled to their own opinions, but please learn how to distinguish \"FLOUR\" from \"FLOWER\" tortilla."], ["Jorge P.", "Love them breakfast bacon burritos, as well as very friendly employees. Will go again and again."]], "Restaurante Tierra Caliente": [], "Tlayuda L.A. Mexican Restaurant": [], "Yxta Cocina Mexicana": [], "Guisados": [["Wayne C.", "If I'm reincarnated, I want to come back as a pig and  then get turned into a chuleta taco at guisados. I'd be swimming in that delicious marinade, (and what's in that marinade?), wrapped in that warm cashmere tortilla blanket.Food: awesome. pescado (fish), chuleta (pork), bistec (beef), chicken tingaPrice: cheap, 2.75 a popService: friendly fast, long line but movesStreet parking, outside seating"], ["John Q.", "Dang these are good tacos!  Trumps King Taco in my opinion. This has been a favorite of mine since moving to LA, I bring friends or family who are in town as well. You have to wait in line to actually order your food but then you can sit out back in their awesome patio area or inside if it's chilly. They have a great atmosphere, good music and it's BYOB!As for tacos... Prices vary but roughly between $3-$5 which is great! I usually get two or three and find that to be pretty filling. Just get the sampler, it comes in a great variety. My favorites are the pescado (fried fish), mole poblano (chicken) and the regular quesadilla. But they are all so good! They also have specials and serve some yummy horchata as well as a variety of fresh juice. Wish they have A/C. Its too hot to dine in here! I'l pick it up to go next time."], ["Seth D.", "SO GOOD. And what a good deal! Payed $7 for two tacos and a soda! Got the fish taco and the conchinita pibil. Both amazing. Although I got #3 salsa and it was way spicy. And I'm the kind of person who likes spicy. I can't imagine what a number 10 would be. Ambiance was great! We ate on the patio outside near a little fountain. Lovely. Service was also great! Cashier gave us lots of good recommendations and told us what to avoid for my girlfriends rant allergy. Great experience!"], ["Leyva R.", "I like the outdoor dinning area. It has a fountain. The inside dinning area is accommodating. I ordered 2 chorizo tacos and 2 bistek tacos 1 quesadilla and 2 shrimp tacos. They have delicious horchata, melon juice..I am a big fan of their chorizo tacos. *I wasn't a big fan of their bistek*shrimp tacos are delicious. *quesadilla is cheesy. ^^*the tortillas are handmade. *recommend horchata and chorizo tacos.*The restroom is small but clean and door swings outward. Kind of scary. Lol."], ["Jeff D.", "This is the definition of an East Los Angeles Mexican place.  I'm not a huge fan of spicy tacos, but even I was way into the offerings here.  I had the sampler, which is 6 small tacos.  Each taco has its own charm and was unique.  The presentation was OK, but the food really delivers here.  And the price?  How's about $8 for a sampler plate of six small tacos (I'm a big guy and I was definitely filled by the sampler).  Was it the best Mexican I've ever had?  Not sure.  But was it the most authentic?  You bet.The staff was fantastic.  I have to go out of my way to mention this.  They had suggestions, were very cheery, and made my visit feel comfortable and enjoyable.  What a delight to meet such nice people!"], ["Blessie V.", "This has been on my list for awhile, and now, I finally understand the hype with Guisados. Though their tacos can't really be classified as authentic Mexican, I like the interesting twist on traditional tacos. Parking can be hard to come by in the area. There are a few limited spots by the patio area. Otherwise, street parking is the next best option. Guisados operates like a fast casual restaurant: order and pay at the front, find open seats, and wait for the server to bring your food out. We ordered the sampler, which I would suggest if this is your first time here. It comes with 6 mini tacos, each filled with a variety of stewed meats. Although none of the tacos stood out to me, the chicharron taco was my least favorite. I'm not very fond of pork rinds, and this taco simply tasted like flavored fat. The mini tacos were about half the size of a regular taco. We also tried the chorizo quesadilla and the fish taco. This wasn't your run-of-the-mill quesadilla. It was stuffed with a thick layer of queso panela (fresh and smooth Mexican cheese) and was well complemented by the spicy and flavorful chorizo. The fish taco consisted of grilled white fish with the fixings (cabbage, avo/cilantro cream, and pico de gallo). Like the chorizo quesadilla, the fish taco was delicious! The horchata seems to be everyone's drink of choice here, but it was a little too sweet for my palate. Guisados also offer aguas frescas and Stumptown coffee. If you are in the LA area and in the mood for tacos, I would recommend trying Guisados. However, is it worth traveling to LA exclusively for this? Probably not."], ["Jesus M.", "A must try when in the LA area. Homemade tortillas with a variety of choices to please anyones taste buds. If you are unsure of what to get, you cannot go wrong with the sampler. It comes with six mini tacos of the different choices. The aguas frescas are amazing as well."], ["Brenda D.", "I really wanted to like this place! But the truth is I'd rather hit up the local taco truck.We stopped by before the Dodger Game, based on the reviews. I liked the East LA vibe, they have nice artwork on the patio, they play good oldies on the speaker.But lets talk about the tacos...I think they tried to add too much to the tacos. I tried the sampler, thinking I'd order 2 normal sized tacos based on the best tasting. I didn't order anything after the sampler...I figured I'd have a dodger dog instead. The fresh tortillas are good, the marinated meats were cold. The pickled onions are a good touch, but the meat ruins it. I didn't enjoy any of the tacos enough to try them again, but I do remember hating the chicharron & the pork. I consider them gringo tacos, because the quality of the meat and sauces wasn't there, but I can see why people assume they are great."], ["Louisa B.", "Love love love these tacos! This has been a favorite of mine since moving to LA, I bring friends or family who are in town as well. You have to wait in line to actually order your food but then you can sit out back in their awesome patio area or inside if it's chilly. They have a great atmosphere, good music and it's BYOB!As for tacos... Prices vary but roughly between $3-$5 which is great! I usually get two or three and find that to be pretty filling. My favorites are the pescado (fried fish), mole poblano (chicken) and the regular quesadilla. But they are all so good! They also have specials and serve some yummy horchata as well as a variety of fresh juice."], ["Cris R.", "I used to come to Guisados frequently, especially since their tacos are made with fresh tortillas and a good assortment of chicken, steak, fish, vegetarian and pork tacos. They offer a \"stew\" type of meat and sugary juices to drink. Today, that deep desire for Guisados tacos has come to an end. The quality has shown steady downgrade, as the meat was a bit fatty, the tacos were lukewarm, and worst of all there was a rock in my taco. YES  a rock. The thought terrified me since I bit into it and luckily my teeth didn't break. The question that followed my train of thought is, \"why is there a freakin rock in my food?\"This led me to support the fact that the quality has in fact gone down. I let them know about the incident and I didn't get a validating response back.  They were of no help which is worst of all. The negligence and uncaring attitude has led me to denounce Guisados.  I just hope that I don't get sick. It seems that they don't put forth sufficient effort in the quality of their food, rather they just keep a blasé routine. Next. Note: Please look in your food and make sure it's safe to eat. Thanks."], ["Steph H.", "Now I know why this is fast-becoming an LA institution! After getting thwarted by the tamale lady at Echo Park, this was our #2 choice. This was my first time at Guisados (haven't been to the other locations) and I loved it! You order at the counter and they bring out your food. I was VERY hungry, so I went for the 6 mini-taco sampler plate, the cheese and chorizo quesadilla, and a horchata with a shot of cold brew--YUM! All of the tacos I had were fantastic, with my favorite being one of the pork ones (not the jelly-like pork one). Sorry, I've forgotten all their names! So juicy, flavorful and interesting--these are not your usual run-of-the-mill tacos (although those are awesome too!) They're like stew tacos so they can be a little runny at times but they are delish! The quesadilla was very good as well, and also off the beaten path. I thought the chorizo added the perfect amount of salty oiliness to the quesadilla--not sure if I would've liked it as much with just the cheese. It could possibly be a bit too bland. Anyhoo, the patio area at this location is quite nice, and they have a parking lot a little ways down the street! STEPH JUDGEMENT: Soon to become your favorite LA taco spot."], ["Eric E.", "Best taco shop in LA for high quality and authentic tacos. Beware the toreados and cochinita pibil at max hot are incredibly hot. The chicken tinga is amazing. Rajas are really solid. Can't say enough good things about these guys and their food."], ["Theressa Nicole G.", "The hype is real about this place. I'd heard friends talk about it for years, but had never been myself. My family and I finally went after we did a Color Run and my goodness, those tacos are heaven sent when you're starving after a hard workout.There are several different types of tacos, different meat, chicken and vegetarian options. From what I've gathered the flavors and spices change seasonally. I also had an agua fresca that was perfectly sweet and refreshing to wash down the tacos. I can't praise this place enough.The patio is kind of small and I imagine there's no place to sit when it's super busy, but seems like a great spot to check out if you're in a patient mood. The art is fun to look at and I'm sure a great distraction when you don't have your own seat!"], ["E.J. S.", "My favorite tortillas ever are here. Guisados is deliciously dangerous. I get multiple tacos (a lot) each time and just shuffle my way through the delicious meats. I got the sampler this time and they are really mini tacos, so if you have an appetite you might want something a little extra. Tacos are more pricey than other stands ($2.75 for the usual) but I don't mind to splurge here once in a while. Drinks are pretty good too. Can't go wrong with either horchata with added Stumptown cold brew (bomb) or the Armando Palmero (Limon + Jamaican)."], ["Sage E.", "This place was a great surprise. I thought i was going to find a hole in the wall taco shop, but quite the opposite. The outside patio in the back was beautiful. Great atmosphere with the music. And tacos done very creatively. Great job!"], ["Joana Z.", "I tried the sampler plate bc it was so hard to decide what to get. They do the work for you and serve you 6 of their most popular tacos on a platter. Done! My friend and I got the same thing to go so my review will be a bit limited. I liked about 50% of the tacos. I suppose I should've looked more closely at what they give u and switched out a couple things bc I don't like pork. One of the tacos was squishy pork skin w salsa (chicarrone). I about lost my appetite until I came across the tinga de pollo taco. That was my personal fav. Every taco has its own unique salsa and toppings. They are happy to adjust the level of spiciness or other needs but for the most part, it's a fixed thing. And for good reason, they put a lot of work into their creations and u can tell by the amazing flavor profiles and many options. Also, handmade tortillas always get brownie points in my book. Oh! I also got a chorizo quesadilla. Chorizo and cheese are very oily on their own and together it was a greasy mess. Okay flavor but not worth the 4 cups of oil I felt I showered in after. Even though I didn't care for a couple of my tacos it's still a five star bc lets be real, it's rare you'll love absolutely everything on a menu. What I did like, I loved. Check it out!"], ["Luke F.", "Asked for no onions at least 3 times. Made it real clear I was allergic. Girl at counter said she'd make sure. Boom! Of course, onions. Took it back in, lady got rude. I asked for money back. No one ever apologized. I hate this place and I hear such good things. I should have eaten the meal, got sick, and sued them. DO NOT GO HERE IF YOU HAVE DIETARY NEEDS!!! NO ONE PAYS ATTENTION!!!"], ["Neelam P.", "3 1/2 *My husband and I LOVED the cheese quesadillas which were totally different than the ones we find back in NYC.  The cheese was perfectly grilled and salty...yum!We sampled the following tacos: mushroom (a little bland), veggie (hubbie's fav), bean and cheese (just ok), fish (a little bland).  We were big fans of the horchata.Service was friendly and seating in the back was cute."], ["Areli H.", "Guisados is amazing! For first-timers I highly recommend the platter.Also, if you don't eat spicy let them know and they can help you customize. My favorite is the fish taco, they grill the fish instead of frying. Parking can be tricky, best parking advice is look for street parking on Sunset Blvd and be sure to check the parking regulation sign. Great place to take out of town visitors to try a taste of L.A."], ["Alejandra C.", "This place is amazing I highly recommend it I literally fell in love with the tacos even though they were a little too spicy for me lol the service in there is great you guys should totally try this place"]], "Guisados DTLA": [["John T.", "I couldn't have been happier when I was more than drunker than usual. But such are the things that happen when your unranked Trojans finally win a home game against #3 Utah. Super flavor, super price, super place. I don't know whether to be surprised or not that they have 10+ locations. Surprised that the quality is not compromised after having more than 2 restaurants. Not surprised that they have 10 or more locations because the food is that DAMN GOOD. But enough, the 3PS system is here: 1. Product: super tasties. handmade tortilla -- gluten free for all you super pickies out there! Try the quesadilla con choriso and tinga de pollo (nice spice to it). Holy goodness2. Place: convenient and relaxed. Good late night spot. 3. People: typical young DTLA hipster-inspired crowd. 4. Service: friendly. This is a quick serve restaurant so order at the counter, sit down and enjoy an horchata and before you know it, your food is there, you'll finish it, forgot you ate, and go straight back to the counter."], ["Young Kyung K.", "I hate to use this phrase but yes, the overly hyped taco joint was finally my destination for dinner after a wonderful afternoon at the Broad museum. I see this place tagged, pictured and mentioned in more than enough social media outlets that I thought I tried it. But FINALLY I gave it a go! It's like chipotle but ...authentic HAAHAHA you see the lady behind the glass window prepare and cook the corn tortilla when she get the order and the few other staff prepare the fillings inside. My friend ordered the sampler which consists of 6 mini tacos for a little over 7 dollars, that's a steal! My fatness thought I'd get 3 regular tacos... (the gluttony) I ordered the two beef (spicy and bistec) and fish, to my surprise was NOT fried. The pictures and the ideas of this place definitely ruled over my head and offered me high expectations. There is nothing more disappointing than yourself not being able to taste the expected. To me the meats all basically tasted the same... the sauce on all the meats were very salty and had very little differentiation. I expected the meats to be very savory but they were not. They definitely didn't lack in flavor... which was the sauce they were cooked in. Although I have to admit the tortilla was impeccable. The mini tacos were definitely my size but since I decided to order regular taco orders I had to opt for the bigger sized ones... (the mini tacos are so cute!!!) The fish taco was good and the fish not being fried gives a plus for the population of LA residents that are watching their figure ahaaha!I'd definitely come back if I'm around the area. I'd definitely get their melon agua fresca it was over the top amazingly delicious haha!!"], ["Leona S.", "Horchata is the best here. Best horchata in LA. Creamy, cinamon-y, tasty. Get it. The taco sampler platter. Did they raise their prices? Slightly. Now, for small tiny tacos it's $7.25, not sure about the other locations. The tacos sizes, as other Yelpers have mentioned, are tiny. Like way tinier than I remember. Or maybe the Echo Park/Boyle Heights locations are different. They're literally bite size, which I guess is why it's called the sampler, but still cmon now. $1.20 each for these things, I can get a real taco. Meat of course is deliciously stewed. We always get the two beef tacos (Steak Picado and Bistek in Salsa Roja) both which are not spicy.Great location right on Main St. though a bit small. Parking is always an issue in DTLA. Very much hipster. Go to the original location in Boyle Heights for appreciation of how this all got started."], ["Mitzi E.", "It's hype season here. Sometimes you just want an old fashion quesadilla and taco. Not all this shenanigans."], ["April P.", "I happened to be in the area, so my sister and I decided to give it a try. It's located at a newer looking plaza called the Arcade. We decided to share the sampler. The food was delivered to our table, and we were given an explanation of each taco. The sampler size taco is tiny, but can be filling for one person. The tacos that stood out were both the steak tacos. They were flavored and cooked nicely. The tortillas were also so good. It tasted handmade and fresh. I will definitely be back for more!"], ["Todd N.", "Came here to meet a fellow Trojan, and he recommended this place.  I've never been here before but the good reviews comforted me.It's a pretty casual taco place and is definitely something that's quick, easy, and in and out.  They have a great 6 taco sampler! I highly recommend it as you can get a selection of everything! I don't exactly remember what I ordered, but I believe my photo shows it.  You get to select the meats you wanted and I remember I got all except for chicken.  They even hand make the tortilla, so that in itself is worth trying! The size of the tacos are quite small, so don't come here thinking you'll be too full!"], ["Ian R.", "So I'm on the fence about these guys. The tortilla they use is on point; really high quality stuff. Anything you get with the chorizo will be real good. However, I've had the sampler and the quesadilla and while the sampler was good it wasn't great. The quesadilla wasn't good so pass on that guy altogether.I can quite put my finger on what's bothering me about this place but everything (but the chorizo) tasted 6.5/10... My best guess is they're trying too hard to make it gourmet/hipstery that they sorta missed out on the basics. Idk. Also, I still don't know what half the things on the menu are which is cause I don't speak Spanish but that's probably more on me than on them."], ["Sara H.", "Guisado's tortillas are hands down one of THE best tortillas I've ever had in my life! To think that I'm such a fan of flour tortillas too, maaaan, what was I thinking?! (Don't judge me, please! Lol) The amazing part about their tortilla is that it's thick enough to hold all the toppings and absorb sauce from the said toppings but then it also has the right amount of chewiness and since it's made in-house, it's always fresh to the bite! The boyfriend went with the sampler while I chose the Tinga Pollo, Chicharonnes and Steak Picado. He had all three as well as a bunch of others but can I please take a minute to talk about the Tinga Pollo? DAT TINGA POLLO IS THE BOMB. Between the right amount of spice and the flavors you get from the chorizo and chipotle. It was seriously mind blowing. The Chicharonnes was a tad disappointing since I expected the pork bits to be too soggy. Steak Picado was good too but deep inside my heart I wish I tried the salsa roja instead. Not going to beat myself up over it though since Guisado's could expect another visit from me. Besides, they're in a prime location being that they're right beside Gelateria Uli which is pretty much the BEST gelato spot in Downtown!"], ["Clark W.", "Such a great addition to the neighborhood.  Reasonably priced and delicious food!Great job Guisados!"], ["Jen M.", "Blah, blah... not authentic, blah blah... SO WHAT!!The braised meat idea is genius and so flavorful without a bunch of toppings, hands down just great tacos no matter other comparisons. I usually go the WeHo location, but I've been to this one on some lunch breaks and it's the same vibe & taste... so works for me! I've done the sampler once, but now I know my favorites (mole poblano, tinga de pollo, bistek en salsa roja)... was not a fan of the chicharron, has a weird texture. Someone above said small appetite get 2 tacos, normal appetite get around 3... I think that's a bit much... I would say normal lunch would be 2 tacos, 3 if you're really hungry... I don't think I could manage 4, they're very dense & filling!The staff is always really friendly and the menu is easy to order from... well laid out.The only down side for me for this location is the outdoor seating... a lot of time that arcade has some pet & other smells if you catch my drift... not Guisados fault, but something to note if you're going to sit on the patio.I hope this location gets beer & wine like the WeHo location at some point!"], ["Jane L.", "We came here after our trip to the Grand Central Market. We wanted a quick snack so we thought we could try a few tacos to hold us over until dinner time. It's in a little hidden location that has an outdoor and indoor seating area. We came here on a Saturday afternoon and it was relatively empty. There were 2 people working the cash register, but they made us wait while they chatted with the customer before us. I thought it was annoying because they saw us wanting to order but they kept chatting away. The finally took our order and we decided on the taco sampler. We tried 2 chicken, 2 beef, 1 pork, and 1 veggie. The total was about $7. We took our seat and the food came out relatively quickly. The guy who dropped off our food told us which tacos were which. We started on the chicken. I have to say that the taco was not good at all. The chicken was weirdly watery, mushy, and dripping with sauce. Each of the tacos had avocado on it and it kept falling off my taco because the meat was so watery. I tried a bite of the beef, which was a little less mushy, but still too saucy. I didn't try the veggie or the pork because by this time, I did not want to try anything else. My friend ended up only eating a bite of the pork and giving up eating the rest. I did like the handmade tortillas, which was a little thicker than most tortillas, but I can taste the freshness. But, even with the fresh tortilla, I am definitely not coming back here."], ["Paul N.", "WOW. Hands down the best Mexican food I've ever had. I really really enjoy Mexican food and have come accustomed to it, however I immediately had an upset stomach as soon as I finished my pork taco with chiles. I highly suggest having pepto at hand just incase you react the same way. Otherwise, the service was PHENOMENAL. Food was as delicious and fatty as I could hope for. Super glad I walked in when I did. Very satisfied as a whole. Highly recommended!"], ["Lainy C.", "I first tried Guisados years ago in the Boyle Heights location. The Spring arcade is a much hipper and accessible location but it loses a lot of the personality and warmth of the original spot. Although I like their variety, there are definitely some that are more interesting than others. I have only ever ordered the sampler here because I can never decide what to get. Last week we shared two samples, sampling almost the whole menu. I will say that some of the vegetarian ones are pretty boring - the beans with only a sprinkle of cheese and the mushroom are lacking in the flavor department. The braised meats are more interesting. Also, their spicy options are definitely not kidding around! As fun as it is to get the sampler, I still kinda prefer my favorite taco truck when I'm craving a taco."], ["Vickie S.", "4 stars for their homemade tortillas. This location only has braised meats so it starts to taste redundant with the 6 mini taco sampler. The mini tacos are the size of the bottom of a water bottle so bite-sized. I'd skip this and order two regular sized tacos that you actually want, which comes out to be the same quantity and better price. Tortillas are amazing and actually good on its own!Beware of the habanero sauce. It's super spicy and my ears were burning when I took put a generous quantity on my taco."], ["Candace L.", "So instead of getting a 'sampler' we had the guy give us recommendations.Honestly, some of them were NOT that memorable.. BUT they were all very tasty.. I just can't remember which I liked the best.The star...COCHINITA PIBIL! Holy moly this is hot. I knew going into it, with the cashier warning us, that it was going to be spicy. But I figured I eat pretty spicy anyways so whatever, right? The default level is a 3.. you can choose between 1-10. Our first visit we got an 8... and holy moly my mouth was on fire after the first bite. You think to yourself \"this isn't bad at all..\" but this will SLOWLY CREEP UP and set you ablazeeee. But it was so tasty and so delicious. The flavor of the pork was definitely my favorite! It was really spicy though and I had to go on over to the gelato place next door to cool off.You also have to try their Quesadilla con Chorizo! So good! The flavor of the chorizo is on point!"], ["Clara L.", "i tried guisados back in 2011the sampler was unimpressiveso it never came to mind when i wanted tacoscame by on a random day when i was pressed for timeand needed a quick bitetwo beef tacos - one red salsa, the other one i forget the nameand one chorizo & cheesefull size tacos were much better than i remember the sampler beingthe chorizo and cheese one was great although i like my chorizo crispieri also remembered why i wasn't a total fan of the beef tacosbecause it's shredded saucy beefi prefer my beef chopped with just onions/cilantro/hot saucebut i'll give them credit on the flavorsand nice tortilla a-ok"], ["Myra W.", "I came in to grab a quick bite to eat before a show at the ACE... Pretty dang delicious.I wasn't to hungry and I couldn't decide what to get so I got the sampler. A little pricey for the size, but the tacos pack some flavor! Really good homemade tortillas. My favorites were Mole, Chile verde, and chorizo. The tinga tacos I've had better elsewhere and cochinita pibil is not the style I'm used to. But overall it was good and I was satisfied. Oh! Their aguas frescas are pretty bomb too! I'll stop by again if I'm in the area"], ["Lisette C.", "Solid.  The sampler is always the way to go...even if you've already ordered it 10 other times.  This location is a little sterile, as I prefer the Echo Park location, but in a post bar crawl pinch, this girl won't be picky.Highly recommend."], ["Chris M.", "I was in LA for a conference and I have never been in DTLA. Before leaving home I made it a quest to eat some good tacos. I trusted Yelp and found this spot. There was a small line but it was worth it. The service was exceptional, they explained everything and followed up even using my name after getting my food. Very friendly service and some delicious tacos."], ["Fran B.", "I fucking love tacos. As far as Mexican food goes, tacos are probably my fave. Of course I'm talkin about those authentic Mexican tacos, which you can find at little hole in the walls, taco trucks, or just a random street corner lol. Not dem Taco Bells crunchy tacos. But I don't mind those... lolAnyway, Guisados' tacos are a little different, and a couple of my Mexican friends say it's not really authentic, but they think it's bomb anyway. I agree. Food doesn't have to be authentic to be good. Their tacos are definitely unlike any tacos I've had before. First off, their corn tortillas are different. They're a little... bready? They're soft, fluffy, and chewy! I actually really love that texture. BUT...... and I'm probably alone in this, I still prefer regular corn tortillas for my tacos lol. I really do like their tortillas though. Not to mention they make them super fresh (I literally seent it with my own eyeballs).So they have a variety of meats and seafood and veggies to choose from, and they have a sampler plate you can order! It comes with 6 mini tacos of your choosing (meats or veggies only, seafood you can only get regular size). Personally, this was a good size for me. I was like pretty full (but still got room for dessert) off one sampler (which is probably better than food-coma-full anyway), but if I were hungrier maybe I would've ordered an extra taco or something. If it's your first time I definitely suggest this so you can try 6 different flavors.All of their meats are braised, which makes them extra juicy so you never have to worry about having dry tacos here. That's the other big difference from regz tacos vs Guisados. Check out the online menu from their website for detailed descriptions. Some of the tacos include beans so I asked the cashier to have no beans on any of mine. Just a personal pref.What I got:Steak PicadoBistek en Salsa RojaTinga de PolloChicharronChorizoCochinita PibilMY #1 FAVE WAS CHICHARRON! That doesn't surprise me one bit seeing as my fave taco in the world is the chicharron taco from El Taquito Mexicano Truck (shout out to my fave taco truck). So flavorful and so good! It was only mildly spicy, but that's ok. It had LOTS of flavor. My second fave was the tinga de pollo, which was a bit spicy also and equally flavorful.The other tacos.. hm. They were all tasty, but I didn't feel like the rest stood out too much other than the 2 I just mentioned. I think the cochinita was my least favorite. It had a sweetness to it, which is fine since it's also spicy.. but meh. Not a big fan of the sweetness.I think next time I would order the chicharron and tinga de pollo in regular size, and maybe some other ones. Honestly though, they were all good and different. So you just gotta figure out what you like!Welp... I still prefer regular tacos lol but this was definitely good. Also their melon/cantaloupe aguas frescazzzzzzzz omg so refreshing! Also your food comes out fast. Just hope that line isn't too long!"]]}