{"Churros Calientes": [["Chris T.", "Food is amazing, get an order of regular churros and an ice cream churro. The vanilla with churro combo is worth the wait and the trip!The owner is extremely friendly and service is clearly very important to them.Heads up, it gets crowded at night!"], ["Elissa W.", "ATTENTION: THIS IS A STEP ABOVE THE BASIC COFFEE SHOP DATE. It's a more cultured version of coffee date. Perfect if you want to feel someone out, but not have the obligation of spending at least $50 and 2.5 hours out of your day. The shop itself is tiny, very close together spaces. So that may be a problem. But who knows, maybe that'll force you to lean and mhmmmm. ;) But it's not that great for groups because there's no room to be able to talk to everyone. However, the lack of space is compensated by the awesome, tight knit staff. They joked around with us and gave mad family vibes. The atmosphere in general is a big part of this place. I love the cantina-esque music they play and the jangled decor. Approve.On to the food, aka the infamous Churros. They do a few options with their basic churro. You can get it if filled (chocolate, guava, etc). They have skinnier churros that come with a small cup of hot chocolate; they have a churro with two scoops of ice cream on the side; and they have one churro filled and topped with various sauces. All are equally sexy and delicious options. Can't go wrong with any dessert option. It's not the cheapest, especially considering you can probably finish it in three bites, but not that expensive on the spectrum of food. Check this place out! At the end of the day, it has great dessert options, specifically churros. Not that dry $1 one you get from Costco. We talking about some yummy stuff here. GO. now."], ["Rachel S.", "Yesterday we got our churro on at Churros Calientes. Yesterday was a good day. It was too cold for ice cream, so I Yelp'd \"hot dessert\" and Churros Calientes was the first place to pop up in my feed. Needless to say the group was down for some churros. The tiny space was packed when we arrived and the only available seating was outdoors. It was rather chilly outside, but the staff brought over a few heat lamps and we were able to stay nice and toasty. The group ordered the churros con chocolate, mochas, mint tea, and some type of chocolate ice cream churro concoction that I can't remember the name of. I had the churros con chocolate and mint tea, both of which were delicious. One of my friends recently went to Spain and said that the churros are just like what he ate in Barcelona. All in all we had a great time! The staff was exceptionally friendly and made my friends and I feel very much at home. I've never been to Spain, but I imagine that the atmosphere in the cafes have a cozy vibe similar to that of Churros Calientes. We'll be returning soon!"], ["Tiffany G.", "What a delightful little spot! The inside is a bit tight in seating with only a handful or seats outside. They have a list of various teas to order and of course coffee. My friend and I shared the nutella churros... just perfect! They were fresh, the right amount, and fulfilled my sweet tooth for sure! Definitely will come and back again.Side note: They dont have a bathroom, but they are nice enough to give you the pass to use the bathrooms at The Landmark next door."], ["Lisa W.", "My 300th review!A dessert staple after Sawtelle and WLA shennanigans!Churros Calientes is the place you wanna go for authentic churros, not the footlong theme park variety (not that I have any qualms with those)! I love the sidewalk cafe ambiance and the selection of churro varieties is unlike anything I've ever seen. They have regular churros that are small and skinny, with the perfect dusting of sugar, the perfect crunch and moist center. They also have the stuffed variety which are SINFUL. I love the guava and cream cheese combination and I have friends that are fiends for the dulce de leche. Churros con chocolate is a must. The hot chocolate is thick, robust and creamy, and the perfect consistency for dipping and dousing.I have yet to try their dinner, but I appreciate that they have a good selection of salads and paninis.Though the storefront is small, I have never had a problem finding a table. Service is extremely efficient. Within a minute of sitting down, I am always greeted and served. Their hours of operation are odd, be sure to check Yelp to see what time they open. Tip: For those days when you're feeling lazy and blue, for a small charge you can order through EAT24!"], ["Nhung N.", "Churros with ice cream? Yes please. I randomly stopped by on a Saturday and finally got to try! After looking over the menu for so long I still couldn't decide. Who knew it'd be so hard to pick churros.My boyfriend and I got the churros grande with ice cream since we weren't too hungry. We got the churro with strawberry filling and condensed milk topping. I expected the churro to be bigger since it is called grande but it was still good. It was $10 which is an ok price. The churro was nice and crispy but difficult to eat. They should supply knifes with the forks and spoons. The ice cream was actually my favorite part of the dish.Next time I'll have to try just try churros with a topping like dulce de leche."], ["Monica J.", "We ordered late last night to pick up some churros and got stuck at every red light along the way.  I've been scoping this place out for a while now and so being in Santa Monica, I really wanted to stop.  We showed up 5 minutes after they closed and I felt so badly, yet, the man had my order for me.  Unfortunately, it turned out my order could only be paid for by cash and I didn't have cash.  I felt SO bad and he should have been super annoyed with me for being 1) Late and 2) Without cash.  Yet, when most people turn sour, the man reacted with such GRACE.  He was so kind, smiled, and said \"Take it - you drove here late.  Enjoy.\"  Thank you for your understanding and generosity...we will be back to order more churros and to pay you back soon.Fellow Yelpers, I urge you to support this business.  Not only do they serve great churros, Churros Calientes is staffed by a true gem in this world."], ["Julia T.", "Churros calientes serves delicious churros. You can try many different varieties like drizzled with guava, chocolate, and caramel. They have churros filled with chocolate and other delicious fillings as well.My favorite ones are the churros with chocolate dipping sauce.  It comes with 8 thin churros. These aren't the ones from Disneyland with the cinnamon and sugar...these are a bit lighter with just sugar. Closer to Spanish churros. The chocolate dipping sauce is delicious. There is a floral note to the chocolate I can't place...some kind of cardamom spice? Either way, the dipping sauce is delicious! I just want to drink it straight from the cup. Overall: they do one main thing and they do it exceedingly well. If anybody wants a great place for a dessert, this is a must-go!"], ["Meng O.", "My mouth is watering just reminiscing about the churros here. I had a difficult time believing that such a place as this establishment, exists outside of the awesome Disneyland Churros Cart!!! Parking:Metered parking on the street. There's also a parking lot around the corner $1/hr.Staff / Environment:Owner and co. were super friendly and attentive. Tiny place. (very few tables inside and out) - Cozy and comfortable ambiance though.Food:I had the Churros Laggos w/ Guava Cream Cheese and Condensed Milk. Undoubtedly, love at first bite! It was super fresh, creamy and delicious. Must TRY!Churros Calientes is EXCELENTE!"], ["Ian L.", "A killer European-feeling dessert/hangout joint!I've always wondered why there is a crowd gathered here on late nights. This is truly a diamonds-in-the-rough establishment on Santa Monica Blvd!We shared a Churros Con Chocolate which was six churros with a small cup of sipping chocolate. The churros were amazing; nice, warm, and crunchy with the right amount of sugary crackle. The chocolate was unexpectedly rich and creamy. Combining the two was crazy delicioso. I just wished they had brought the two out together rather than the chocolate before the churros.  I will definitely be back to get my churro on!"], ["Christine C.", "I love finding unique dessert places and this is one of them! Where else can you get fresh delicious churros and with dipping sauce?! Three words: Churros con chocolate. I don't have a big sweet tooth but these churros are SO GOOD and really aren't that sweet even coated with sugar. They're not too big so you won't feel guilty eating two, three..or maybe all of them :X. Absolutely must dip the churros in the Spanish hot chocolate. I think the hot chocolate is too rich to drink by itself but perfect for dipping.The food looks good but kind of pricey. I contemplated getting the chicken noodle soup but didn't think $9.50 was worth it..I recommend coming here for dessert...or maybe dinner AND dessert :). Can't wait to introduce my friends to this place!"], ["Cynthia P.", "I've heard so many good things about this place and I was around the area and I decided to give it a try. There's only street parking, so it can be a hassle looking for parking. Another tip this place is packed all the time, a lot of big groups tend to come and hang out so if you don't want to order to go you should be prepare to wait. I went on a Monday night and it was really busy. The good thing it was only for two people so we got to sit down right away. Too bad I was full from dinner and I just got the Big Churro with ice cream & guava filling. It was pretty amazing but not too big of a churro. After trying the churro I wanted more but I had to stop myself from over eating, I tend to do that a lot :) I will be coming back to this place. In addition to churros they do have café menu (sandwiches, salads etc. ) But everyone comes for their amazing organic churros"], ["Jaime L.", "This place reminds me of Spain, without the added benefit of being able to walk there (goddammit Los Angeles) and being judged for eating these for dinner (who judges when everyone else is doing it?).They have several different kinds of churros, of which we ordered two - the filled kind, and the small, dip-in-chocolate kind. To be honest, I loved both. There really isn't much else to say - I didn't get a meal (maybe you should stick to what they do best), and what they do, they do well - be prepared to wait. It's a small place, and it's clear they've been discovered."], ["Amanda H.", "I absolutely love Churros Calientes and so when I am in LA visiting family, I always make it a point to stop by. This place is small but mighty and the service is fast and friendly. I really enjoy the many different ways you can eat a simple churro; it's fun and delicious!!! I love the cream cheese stuffed churro topped with guava and dulce de leche, and of course, a la mode!!! The owner is friendly and makes you feel at home. I love the art they do with chocolate syrup for the lattes, this place is MUY DELICIOSO!"], ["Oliver O.", "I came here the other night for dessert after having dinner at Bad Sushi. My friends have been dying to try this place and I couldn't help but get excited. I love churros, probably one of my top 3 favorite desserts. As we walked up we were kindly greeted by a waiter who asked if we would like a table, we were kind of confused/surprised because we were not expecting a sit-down restaurant for a place that serves dessert items. We sat down inside at the only table for 4 peoples available, most of the seating was located outside.We ordered the churros with ice creams which was good but not what I expected. I'm used to churros that have the cinnamon sugar all over but they put a little bit of powered sugar directly on top. It was still good when combined with the ice cream but nothing more than that."], ["Andrea V.", "These are literally the best churros you will ever try. I don't know how they do it, but they have perfected them. I had a churro dry spell for years. Well, luckily I went back to this place just recently and much to my surprise, it is still just as good as it was 5 years ago. I always just order the regular churros with the dipping sauces. I like the dulce de leche and the condensed milk. If you have not been and you have a craving for sweets, you must check it out."], ["Kasumi Y.", "My favorite dessert location in LA! This has been my go-to for churros for a few years now, even though I don't get a chance to go as often anymore. The staff is very friendly and will sometimes treat you to a hot chocolate... I always order the same dishes - churros with hot chocolate and churros with guava and cream cheese. Both are to die for! Both are very sweet, but I always end up getting a cubano as well. Since it's pretty cramped inside, I prefer sitting outside especially on summer nights."], ["Tiffany R.", "Best churro I've ever had. It was really good! The place was small but charming and the ambiance was really cool. I liked the music and the wait staff was really nice."], ["Shannon L.", "Lots of churro upselling as soon as you get inside. He was friendly but still, it was a bit too much.I tried a couple things:-churro with dipping chocolate-churros drizzled with strawberry and sweetened condensed milk-churro filled with dulce de leche and drizzled with guavaThey were all good but start to get really, toothache-inducingly sweet.  If I have to recommend one, it would be the churros with chocolate because then you can choose whether or not you want to amp it up or eat it plain.  They give you enough chocolate to drench every bite then sip some more on its own.The actual place itself is very tiny and seems like a good place to meet and catch up with one friend."], ["Julie T.", "Pricey for sure. My second trip here was a little funky. So myFriend and I waited a hour for them to open because they open at 630 pm on weekdays. This place fills up fast! Their heaters weren't working outside so every inside were literally rubbing elbows and their butts kept hitting me when they walked by. We ordered the mocha latte and latte. Both were good but nothing really special. We we received our churros, they were burnt. I mean hard on the outside and not even soft on the inside. When I was chewing the churro, my teeth getting stuck together. I knew I had to complain because I waited one hour to come here. So I told the waiter and he brought it to the back. And it seemed like the owner wasn't happy about it. Finally after a couple minutes he comes back and tells us he will make new ones. They brought us out four? LOL ARE YOU JOKING. You guys are that cheap to not cook 2 more? I mean those 2 small churros we ate were not enjoyable at all whatsoever. I don't know after that happen this place left me having a bad taste in my mouth. I'll just go to Urth for my Spanish latte and Costco for my churros."], ["Celestine A.", "I lied, I ordered the churros with hot chocolate again - this time through Yelp for pickup. It estimated a 10-20 minutes wait. I got there in under 10 minutes and it was already ready! Just as good as I remembered. The perfect amount of crunch and chew to each bite, with a decadent dipping chocolate to pair with. NEXT time, I'll get the grande churro with ice cream. My boyfriend lives five minutes away from here so I guess we can never break up because it's just too convenient to be Churros Caliente's most regular customers."], ["Jia-Wen H.", "Churro Calientes was decent. My friend ordered the churro and ice cream ($8). I ordered their stuffed churro ($5) with guava and condensed milk topping. I tried my churro and my first thought was - Jack in the Box churros are better. The churro tasted a little stale and not that fresh, although I'm sure it was fresh. I tried a bite of my friend's plain churros with ice cream and it tasted like cardboard. There's no cinnamon on the outside. But the ice cream with the chocolate syrup was delicious.I think I prefer Jack in the Box and Costco churros more than Churro Calientes."], ["Jack R.", "If you're expecting Costco churros then this place is not for you.And what's with the Blair Witch prints on the wall? LOLOnce again I wish Yelp offered 1/2 stars. I think this place is more of a 3 1/2 star place for me.Here's why. I ordered the churro with condensed milk and caramel. The thing is the churro is really tough. Like super fried. Like you need a sharp knife and some sharp teeth to crunch this down.Like I'm eating cinnamon toast crunch or something.I just wasn't a fan.Their mango juice was bitter and watery. Their hot chocolate was thick and rich, if you like that type of drinking chocolate then this is for you.Nice service though.Their churros just weren't for me. Costco here I come."], ["Yenny D.", "Had heard so much about Churros Calientes and finally got to try it one Saturday night around 10:30pm. We were afraid we would have to wait to be seated since there were people waiting outside on the sidewalk but we were seated right away indoors.FOOD:- churro grande with guava drizzle and dulce de leche filling - so they switched the order of how I wanted it, but this was still pretty good. The guava is more on the tart side and the dulce de leche isn't tooth achingly sweet.- churro with ice cream - really enjoyed the ice cream!I think we were both disappointed with Churros Calientes because our churros didnt come out hot! And the texture was harder than I had expected. Maybe I'm used to Costco churros where its crispy on the outside and nice and soft inside, but the churros here were hard and crispy throughout :(SERVICE:Friendly and fast. Smiling, ready to take your order and make suggestions.VENUE/PARKING:The inside is tiny! Tables are squeezed in around the bar counter seating. There is also outdoor seating. A lot of people wait outside for to go orders. We found a meter a block away, free since it was late but plenty of residential parking around too.Glad we tried it, but was disappointed in the food and the prices. Definitely expensive for the amount of food you get! :("], ["Bahar R.", "Service: Super friendly, authentic & helpfulFood: Guava & Dulce de Leche churro w/ melted chocolate to dip was super tasty. Churros were fresh & devoured within minutes (reminded me of Spain!) Ambiance: Upbeat & pleasant, diverse crowd of people all out to enjoy some churrosBottomline: Don't hesitate to try this place for dessert!"], ["Anna R.", "I wish there were more places like this around - especially in the Bay area. LA is lucky to have this gem. If you are a churro afficionado like me (and we're not talking like the $1.50 ones at Costco - though those are tasty as well!), you will love this place! The Churros Largo with Strawberry and condensed milk topping was delicious. You can also try other toppings like Guava (supposed to be wildly popular), Dulce de Leche or Nutella.  The standard Churros con Chocolate was my fave. You only get 6 churros, so you may want to consider placing an extra order for churros, or sip that delicious chocolate up! We also ordered a couple of Shakeratos (a hit with our party) and a blended Ghirardelli chocolate drink. So good.The other star here is their young GM Michael who was so hospitable, friendly and gracious that we came in. Be sure to say hi to him if you visit!I will definitely be returning here when I'm in LA.  I only have two other places that do Spanish churros right - one is in Barcelona and the other is in the Philippines, atleast this one is on the same continent and state!"], ["Ani P.", "A bit pricy for what you get.  The Spanish style hot chocolate is tiny.  I understand this is decadence and you don't need much, but my Spanish sister-in-law is even accustomed to a larger size in Spain.The hot chocolate is my fave in LA.  Creamy, chocolatey, thick and very reminiscent of the real thing.   The churros are made or organic flour and were light and not too sweet (apparently they can be a hit or miss).This place is tiny but was still comfie with 3 little kids.  I recommend making your own Spanish style hot chocolate at home; but if you are having a serious craving, this is your spot!"], ["Cindy P.", "Green tea latte was too bitter for my taste cause I like it sweet. Churros were okay. This place is too crowded and small. We had to share a table with other customers. The waiter was kinda forgetful, but when he remember, it was fast."], ["Ariana R.", "Came here two Saturdays ago for a late night snack. Since the venue was about to close, those standing outside could order to go. Wasn't exactly thrilled with the idea and many people in our group got discouraged and didn't order anything because where would we sit and eat these. Well no need to fear because the boyf and I just held onto the box and leaned over like two hungry kids and devoured them in 15 seconds. Ordered the guava churro, but this wasn't my first time here. I can also speak that the dulce de leche and chocolate sauce drizzled on the churros are also great.Try not to come with big groups since the seating area is rather small."], ["Daanyaal K.", "Came here on a Friday night with friends around 10 pm. I was expecting a fast food like joint but its a sit down place with outdoor seating as well off of Santa Monica Blvd, right off the 405. They have your basic churros, and then you have the options for nutella churros with ice cream aka Super Saiyan style, so I went Saiyan mode for $10. After 10 minutes or so my order came out and it was amazing. The churros was very fresh, the service was great, and the prices are nothing to argue over."], ["Eric C.", "If you love churros then this is the place to be.  We came here late on a Friday night and only waited 5 minutes.  Their specialty are churros so I can't comment on the dinner items.  We got the churros with a cup of thick hot chocolate.  Simply put it was amazing, both the churros and the hot chocolate.  The hot chocolate was thick and dark, thankfully not too sweet.  The churros came out hot and delicious.  There was magic as you dipped the churros into the chocolate!My recommendation is the churros with a cup of hot chocolate!"], ["Stefani T.", "On our way home one late evening, I got the munchies and Yelped desserts near our home.  This came up as a must try.  How can you go wrong with churros?We ordered:Churros con chocolate:  $8 for a mostly empty basket of skinny churros and hot chocolate for dipping, 3 starsChurro caliente:  $4.5, 2 starsCafe latte: $5, small cup, 3 starsIt was good - it tasted just as expected, but because of the price - we paid $20, not including a tip, for churros and a coffee.  Why all the 4  and 5 stars?  Is the sugar imported from some mystical place I'm unaware of?Churros are cheap and difficult to mess up.  I'm not exaggerating - I just double checked with a churro eater at the Promenade and yup, they're cheap.  Like $2 for over a foot.The ambiance is cute, though, as in small and cozy - it reminded me of a touristy place in Rome, including the price tag.  I'd like to try it once more, but this time no kids to eat all my premium sugar bread."], ["Nisha S.", "One of the only places in LA that has churros, and they are amazing.  I've only been here twice, but I will definitely continue to come here.  It's an intimate cafe and perfect for after-dinner dessert and coffee.  I've only had the churros here, but they've all been amazing.  I recommend getting a few and splitting them.  There are the thinner, crunchy churros and the fat, stuffed churros.  My favorite toppings are chocolate and condensed milk.  The dulce de leche and strawberry are also good.  However I don't recommend the guava, stuffed or drizzled.  Either way, I highly recommend going here but beware of the crowds!  Even on a random Wednesday night, you may find yourself waiting for a table."], ["Seth R.", "Churros in heaven would taste like this. Very cozy and heart warming food. Their churros with ice cream is a must try. Small location though, so its hard to come here with a big group of friends."], ["Roxanne B.", "Came here on a Sunday afternoon. Very small space. The staff was very warm and friendly. I had the churros con chocolate. Delicious! I've had this dish once in Spain. Obviously different. I expected the chocolate to be a bit thicker. I also had the cafe Cubano which I loved! Wish this place was closer so i could order a cup everyday. Will make sure to visit again!"], ["Jonathan B.", "got the regular sized, dulce de leche churros a la mode. Churros seem perfect texture, right amount of crispy. Ice cream was premium too.nothing else really set it apart. I'd do it again, under the right circumstances."], ["Alex M.", "After some drinks with the guys they wanted to try this place out so I went along. I've had churros befor so I expected the same fried pastry but this one was a little different. We sat outside which was cool and looked over the menu. They had more to choose from then just churros but we were there just for that. I ordered the churro grande with cream cheese filling and guava on the outside. I expected this deep fried goodness but it actually wasn't that good. The churro looked very nice but when biting in to it, it was a little harder then I anticipated. Creek cheese filing was on and the guava was good. It was an ok experience. Would I go back? Probably not but everyone has there own opinion so you may need to try it out yourself."], ["Samee M.", "Im obsessed with desserts and CHURROS are def one of my favorites! I got beyond excited when i found out that there was a place known for their churros. This place is super tiny and crammed. There is also outside seating but tables are limited so i recommend that you call ahead of time to see how long the wait is. Luckily when i went there were exactly two spots inside at the counter. DESSERT: i got the plain sugar dusted churros with the spanish hot chocolate for dipping and it was just perfect! The chocolate in the little cup is not too sweet and it also helps with the hard crunch that you get from the churro. Right when you dip the churro is soaks the chocolate up and softens the texture. Im not gonna lie... I had alot of chocolate leftover and i ate just chocolate by itself by the spoonfuls. No shame. Def going back to try the other churros on the menu :)"], ["Iris C.", "Perhaps I had really high expectations for this place because 7 of my friends rated this place on yelp a 4 or 5, but I personally did not find anything special.  My friend told me that the churros she had were crunchy on the outside and still doughy on the inside.  I do not think the friend I went with and I got that same experience.     We got the churros grande with cream cheese guava filling and the churros with a cup of chocolate.  Before we got our dishes, we expected the churros to be big, hot, fresh, sweet, and crunchy, but to our surprise, these churros were lukewarm and actually a lot smaller than we expected (these yelp pictures made them look HUGE).  While both of these dishes were crunchy, they were really hard to chew and difficult to cut in half.  I'm guessing that the reason why these dishes had that hard-to-chew texture is because they weren't fresh batches...or maybe we just came on a really off day.  The cup of hot chocolate (lukewarm) made the mini churros, which were lightly seasoned with sugar, softer...but not really.  I liked the churros grande with the guava cream cheese filling better because of its flavors, but it was also difficult to chew.      The waiter was really nice and the ambiance was great, but the churros just wasn't working for me.  Due to this bad experience, my friend and I do not think that it was worth spending 16 dollars on these desserts, but I am really hoping that the next time I do go, these churros will blow my mind.   I was going to give this place a 3, but come to think of it, I'm not eager/curious to try this place again and I've actually experienced better, cheaper churros elsewhere."], ["Mouna J.", "This place is my #1 favorite churros place and my #1 favorite sweets place since I don't eat sweets to begin with but Churros break all the rules. They are a must especially dulce de leche and the condensed milk!!"]], "Barbrix": [["Chris H.", "Whether it's an intimate dinner or a social night with your friends, Barbrix has the right atmosphere and food to satisfy any party.Barbrix isn't cheap; a Mustard Caesar salad to start off a Chicken and Mushroom Parpadelle with a glass of white win came out to $49 plus tips ... for myself. However the service is fast, the pasta is freshly made and surprisingly stayed hot through the last bite. I would come here again."], ["Jamar M.", "Where do I start! I don't know how to put it but I absolutely have tried this place three times within the last few months, all for Brunch.  My first two experiences where okay, not bad, not great, but for $8.00 bottomless mimosas, it was doable.  HOWEVER, TODAY was my greatest and most pleasurable experience. My waitress was Molly and I explained to her that I had been there before but never really had food that was great and that I would like to try what she recommended.  She absolutely requested a specialty item that isn't always on the menu, but it was perfect. I can't remember the name of the item, but it is a stew with baked egg on top! I don't like runny eggs so she told me that she will have them bake it hard, and it was cooked to perfection.  Also my boo, had the churro french toast.  I don't usually eat french toast, but this french toast was wonderful and to die for.  It had strawberry and bananas with chocolate and whipped cream.  The manager Deborah was very nice as well as I spoke with her to tell her how satisfied I was with the service. Be aware that seating is difficult, so if you can call to make a reservation it will be better.  We sat at the bar and still had the best service ever, and did I mention $8.00 bottomless mimosas...OMG!!! Never do you have to ask for a refill, it seems as soon as you take a sip, they are trying to top your glass off again! ALSO try the grapefruit and champagne, I tried it today, and it was great as well!! I guess it is true, the third time is the charm! Great Brunch!! Great Service, and finally today, I am made a believer, GREAT FOOD!!!"], ["Alessio B.", "I would give it 1 star but I've had great meals there in the past. Something changed there and I don't know what the story is and I also really don't care what the issues are. FOOD:Brussels Spouts that claim to be crispy are in fact crunchy...why you ask I use the word crunchy instead of crispy? We'll...they were so undercooked it was closer to being a raw dish that was placed under the broiler for a moment to toast the tops but the inners where absolutely uncooked. Not a dish to serve raw because that particular vegetable is a difficult one to get through in an uncooked state. The flavor was uninspired, lack of carmel, no deep flavor at all and not even salt which may have made up for the lack of POV. Yellow Tail Crudo ;Bland beyond belief. Cauliflower :Again...same exact issues as the Brussels Sprouts. Extremely under cooked and then touted on top without any understanding that the previous process was not properly completed . Flavor was better than the Brussels sprouts but not exciting in any stretch. Sea Bass: It may have been a decent dish had the others had any potential. Panna Cotta: HOLY CRAP!!!!!! what a mess. First...they serve it in a mason jar assuming that they make this once a week and store it until some customer orders it and then they pull that puppy out of storage and then top it with berries so that you cannot access the body of the dish so we were forced to pull all of the berries off of the top of this small meson jar and then attempt to engage the panna cotta and go back to grabbing the removed berries to make for a proper mix. Who comes up with such foolish serving techniques. Lets got to the actual body of the dish. It was thick and a total lack of understanding what this desert needs to be. It was no more than thick sweet cow lard. It was my last attempt to locate a positive result with the food at this place that has taken a total nose dive. I used to love this place and could only get room at the counter to grab well developed farror and roared vegetable dishes. This place was well over 1/2 empty and for excellent reason. It is a poor poor excuse for a restaurant and it needs to go away. I am not sorry for this review. It displays lazy food and terrible management. We did not complain, I was too pissed to do so and did not feel the need to teach the management. It was a long difficult week and I was simply interested in going to a well proven haunt that I had enjoyed in the past. Well...that was then and this is now. NEVER to go back."], ["Linda C.", "Came here last weekend with reservations to celebrate a birthday.  We were immediately seated outside, but it was a pretty hot day so we asked if we could move to a different spot, luckily they had a nice table indoors ready.  Came here wanting to try the crab hash but they said they don't have it anymore but that the corned beef hash was its' substitute.  The corned beef hash was really good.  The beef was marinated for hours supposedly and you could really taste the great flavor in it.  My fiancé loved that.  I got the smoked salmon benedict for myself with fries.  Loved the thin cut fries.  The smoked salmon benedict was decent overall, didn't really like how everything ate pretty mushy/soggy.  I usually get benedicts so I'm pretty used to the texture but this one wasn't one of the best for sure.  Loved the $8 bottomless mimosas, that's why Barbrix deserves the 4 stars in my opinion.  It's a pretty good deal, of course it's $8 only with the purchase of a $12 or more entree.  Usually when I find a deal on bottomless mimosas it usually comes with slow service and/or attitude.  The server was quick and attentive, always coming around to make sure our glasses were full.  The downfall of Barbrix, one restroom for the ladies and one for the gents...with bottomless mimosas, calls for frequent visits to the restroom.  For the birthday boy was a coffee like drink with ice cream in it... when the bill came, we were charged $9 for it.  We asked about it and I guess there is no complimentary anything for birthdays, would have been nice if they had told us that when we told them it was someone's birthday, we probably would have skipped it and gone elsewhere for dessert.  A lot of restaurants do a little something for birthdays, so I guess we were disappointed and letdown in that aspect.  Also, I hope they take care of their fly situation near the windows, they were going crazy during our meal since we were sitting near the curtains."], ["Everett B.", "Brunch stop #2 on our guys trip, we were drawn by the delicious looking food and the bottomless mimosas. Barbrix did not disappoint. This would be a regular place of mine if I lived in LA. The long and short of it.1. Crab Hash. My favorite out of everything everyone ordered (not my order..... Food envy ensued). They did not skimp on the crab, which was fresh and full of flavor. A close 2nd was the smoked salmon Benedict, which was absolutely delicious. Everything served tasted super fresh.2. Bottomless Mimosas. The real reason we came here. Bottomless drinks can be daunting when a large group such as ours orders them but our stellar bartender Christian always made sure our glasses were full of some pretty strong morning booze. Hats off to that man.3. Kicking Us Out. Hear me out here, as I'm actually considering this a plus. We managed to get cut off from bottomless mimosas by the owner (maybe manager? I was pretty drunk). This is the kind of hardline management of your customers you want in a popular place. In short we were far too drunk and were probably starting to annoy other customers. They made the right decision to take the drinks out of our hands and move us along to our next adventure.4. Price. Everything is a pretty standard brunch price with above average quality food. Everything in LA is a bit pricy so it was nice to find an adequately priced place.Our experience with Barbrix was brief, yet well deserving of a good rating. Stop by for some crab and mimosa brunch, just maybe take an Uber home!Overall Grade: A"], ["Mickey H.", "My review below is for brunch only: The real main reason why I decided to dine here for Brunch is because of their $8 bottomless mimosas.  I thought that was pretty awesome, as long as you order a minimum $12 entrée, you're set! Food was mediocre but the ambience, vibe and their wonderful service/accommodation to seat our party in their outdoor patio during their busiest of times should be recognized. Our wait staff was super sweet and she attended our needs. Our glass was never empty so we definitely got our bang for the buck with this brunch deal. I ordered their frittata which is this egg pancake shape dish that contained broccoli, cherry tomatoes, burrata cheese and shishito peppers. It was good but it's definitely not something to rave about. Valet is $6 but I always end up finding parking outside along the streets. Oh, I also heard about their $1 HH oyster Monday night specials and Thursday pasta-palooza deals.  I'll have to come back again and try out their HH oysters soon!"], ["Hannah K.", "Breakfast here was okay, but the food at dinner was really good- balanced cheese plates with great variety, lots of tried and true appetizers with their own little twist on them; and the atmosphere is nice- dim candle lighting and no pretentious vibes. Even though they are a wine bar, there are plenty of other interesting drinks to try.Service felt off both times I visited Barbrix. At dinner the wait staff started off overly attentive then disappeared for longer periods of time, forgetting to bring us items we asked for, like water. I thought this was likely because of they get busy during their Monday oyster bar happy hour, but when I visited again for breakfast and we arrived about 5 minutes earlier than their opening time, the hostess was clearly annoyed that we were there early.I really wanted to like this place, but it's just okay. Overall it isn't absolutely terrible, but there are plenty of other similar options in LA with better service."], ["Louisa B.", "$5 Bottomless mimosa's for brunch!!!! I feel like that's all I need to say!Just kidding...GREAT food as well. I have been about three times now for brunch and it's definitely a must try place if you're looking for a brunch spot in Silver Lake. It's on Hyperion, easy access, valet parking lot, but you can easily find street parking. I've gotten the tomato, avocado and cilantro scramble which was good. The frittata I ordered another time and enjoyed it. My roommate always gets the dungeness crab hash and RAVES about it - but I can never seem to eat crab in the morning... But back to the bottomless mimosa's, they really are the definition of bottomless. The best part about Barbrix brunch is you don't really need to flag down the waiter, the service is great! They constantly re-fill your champagne glass and are ready to take your order at the right moment. It can get very crowded for brunch though! I'm planning on going to try their dinner menu soon - or even $1 oyster's at the bar on Monday nights."], ["Linette F.", "The ambiance and the food definitely rocked my world! A hidden gem in this neighborhood definitely!pork & ricotta meatballs- sounds simple and plain, but oh golly, these were just divine. The savoriness of the cheese complimented the ripe tomato sauce poured over the rich meatballs. The spring flavor of the fresh tomatoes just made your mouth perk up. Devils on Horseback- literally the name of this dish lives up to your expectations. I have never been a fan of goat cheese, so to try the \"whipped\" goat cheese, I was even more hesitant! HOLY COW! This dish was amazing. The saltiness of the bacon wrapped over the sweetness of the date was just the best combination. To top it off, the light whipped goat cheese was the cherry to the icing. You almost feel like a burst of flavors exploding in your mouth. hamachi crudo- Not sure why I ordered this, but don't. It's really not that great. You get two pieces of hamachi, which had a slight smell to it. The mango pieces were a unique balance to this dish. The chili oil was interesting, and I was thoroughly too impressed with this dish.....try something else I would say. Hams of the world- of course you have to get this....it's a little bit of everything. My favorite was the proscuitto and the speck. 3 Cheeses- ashlyn, pecorino marzolino rosso, brillat savarin: These were the top three cheeses that were not as pungent. The dried figs were so delicious. and there wines....Man, I love a good Italian/ Spanish Wine. I love it here. The service could have been a little bit more on par, but perhaps they were busy."], ["Byron S.", "We came here for brunch on Sunday without a reservation. You can only sit at the bar without a reservation. The bar is pretty big and serves the whole menu, but we had to wait 45 minutes for a seat. This place is packed! I HIGHLY recommend reserving.The highlight is, of course, their $8 bottomless mimosas! They're very generous on the champagne and they're constantly refilling my glass. Almost the entire restaurant ordered this!The food was good too. My gf and I shared the crispy brussel sprouts. It was deliciously crispy and the grated ricotta cheese on top wasn't overwhelming. The bits of cheese just melts in your mouth. It is really oily though so I wouldn't recommend it if you're not sharing because it gets too much after a few bites.I also had their burger. It was big and juicy, but they charged me for tomato ($2) without indicating that it would be extra on the menu. The shoestring fries were great, we ate the whole plate of them.We also got the wild boar bratwurst as a side. Very flavorful and spiced.  Comes on a small bed of arugula."], ["Marie C.", "After hiking we decided we wanted to reward ourselves. After looking on yelp we saw that Barbrix had the best Bottomless mimosa deal. Add a bottomless mimosa for $8 with purchase of a $12 food item (s) or more per person! I made reservations a week in advance and arrived around 11 on a saturday afternoon. When we arrived we had to pay a whopping $6 for valet.. for brunch.. -_- There were plently of people but it wasnt packed. By the time we were leaving the line was out the door. We ordered the:Eggs with applewood bacon or wild boar bratwurst 13 - mehFrittata broccolini, cherry tomato, burrata & shishito pepper 14 - DryBreakfast sandwich fried eggs, cheddar cheese, french ham, bacon,grilled onions, lemon aioli on grilled ciabatta roll 14 - SaltyDungeness crab hash poached eggs & tomatillo salsa 17 - The crab was no good for me.Brioche french toast-3 berry compote thick cut, egg-dipped brioche.blueberry, raspberry, blackberry compote, vermont maple syrup 12 - mehFried chicken breast sandwich buttermilk marinade, napa slaw,grain mustard aioli, pretzel roll 15 - blandBarbrix burger - 8oz. ground sirloin, chuck & short rib, aleppo aioli,arugula, dill pickle, arugula & brioche bun 17 - decentOverall we all left thinking we had wasted our money. Everything was subpar or no good. We couldnt even taste the liquor in our mimosa. Might have well just have ordered orange juice."], ["Danny L.", "Man they do not joke around about their mimosas! I sat at the bar and the entire time I watched as they just mixed orange juice and champagne non-stop. Make sure you make a reservation before you come because this place gets packed! I came with a group of friends without a reservation but we were fortunate that the bar was empty.Pros:-food was really fresh, you can taste the quality of ingredients-servers are really friendly-bottomless mimosas for only $7 if you get an entree-they make a killer cappuccino Cons:-limited parking - ended up just getting valet-food was also a bit bland, I had to add hot sauce and pepper to give it some taste-a little bit on the pricey side, and you don't get too much food"], ["Juliane L.", "Staff is so friendly here! I love the outdoor seating and everything about the restaurant felt cozy. Valet is $6 We got: soft shell crab bao, shrimp pasta and skirt steak. I got the steak and substituted broccolini for steak (+$2) but the server brought out my entree with fries. Before he even set the plate down, he apologized for the fries and said the broccolini was coming out at no charge. Perfect :)"], ["Michael K.", "This place's Sunday Brunch is booked for hours for a reason. The food is delicious. The ambience is full of good vibes. The staff is courteous and attentive. I had the skirt steak and eggs. Those over-medium eggs were the best I've had in a long time. I know. It sounds basic, but I eat a lot of eggs. The difference was noticeable. The skirt steak was also tasty.My friend had the breakfast sandwich, and it looked perfect. She also loved it.I'll definitely be back."], ["Faryoung B.", "Tried going to Barbrix a while back but since we hadn't made a reservation, they could not accommodate. The thing with popular and hip.. I want it more. So Marie C. makes reservations a week in advance so that we can hit this place up after our hike. Never having been a drinker, bottomless mimosas don't do it for me. Brunch on the other hand is my favorite meal of the week. But when such an in demand hot spot like Barbrix fails on that end. Well.. for shame.I ordered the french toast with berry compote on the side. Just your average run of the mill french toast.. like a bit better than Dennys. Am I missing something here? Did Barbrix reimagine the french toast and i'm not hip enough to see/taste the difference? Maybe it was gluten free toast battered in certified organic chicken eggs and non GMO berry compote the likes of which my unsophisticated palate can't discern. Probably not. Bf got eggs and bacon which I dont think the amount of food warranted 12 bucks but lets go with it. Friends ordered sandwiches with fries. Those fries.. should just start calling them chips. Those mimosas.. should just start calling them OJ in a fancy cup. I understand some places never get generous with their cheap ass champagne but Barbrix put the S in shiesty. We sat in the patio section so I could see the line starting to build. BTW we came by after a hike, in our tanks and sneaks. Talk about being underdressed. Everyone was dressed to the 9's in their Sunday fineries in order to see and be seen. They get 2 stars for being dog friendly."], ["Kait F.", "Everything was meh. I don't like to leave reviews like that, but everything was very bland and unmemorable. The ambiance was cute, but when we went it was completely empty, which makes things a little awkward. Too pricy to not have knockout food."], ["Sarah S.", "A very unassuming place at first, but quite cozy and nice when you walk in. A group of my friends came for Sunday brunch and managed to get a long table out on the patio. They have an $8 bottomless mimosa deal which we definitely got our money's worth! I got their Breakfast Sandwich ($14) which comes with fried eggs, cheddar, ham, bacon, grilled onions, and lemon aioli on a ciabatta roll. It was good, but nothing special. I took a bite of my friend's Honey Lavender Panna Cotta w/ fresh strawberries ($8)-- it was really good! Not too sweet or heavy and just the right amount of lavender flavor. Service was OK-- they took a long time to bring out my coffee to the point where I thought they forgot and we had to keep asking for hot sauce because no one seemed to understand what we were asking for, but they were good about refilling our glasses-- both water and mimosas, lol. Even though they close at 3PM, they were good about not rushing us out, so that was appreciated as well."], ["Mai Y.", "I came here to do tapas and was underwhelmed by their offering for the price. A glass of wine averages $13....so unless you're a big, big fan of wine, I'd skip this place (I like wine, but I don't know enough about it to really appreciate a $15 glass of wiine). Nonetheless, a friend and I were looking forward to some awesome tapas because the reviews seemed decent. I think my favorite things here were the brussel sprouts and the bacon wrapped dates. We also got the cheese plate...but this is only fun to get if you get wine. And the cheese plate is pricey too.I'd still come here again because it's really, really cute and their entrees on the menu looked delicious (and perhaps even worth the price). But...I don't think I'd consider this a great tapas place. Brunch and dinner seem the most ideal for this place. I'll maybe even stop by for happy hour since it runs Sunday-Thursday and isn't too far from me.One more con: service. My friend and I walked in without a reservation and the hostess seemed annoyed that we wanted to sit outside when the place wasn't even packed. Also, the waitress took a really long time to take our order. We actually had to flag her down to even order. And then our table sucked because it was all wobbly. Thankfully someone took care of it right away, so they earn some stars for that."], ["Arpi G.", "I was relatively unimpressed with Barbrix. I had heard great things about their bottomless mimosa brunch and I assumed it would carry over... I didn't try any food on their menu other than the cheese platter and Spanish olives, which was lack luster and over priced for the portion size. In addition, they only carry ONE kind of a Cabernet red wine...a girl needs options! I'm willing to give this place another try for brunch only (Because, who doesn't love bottomless mimosas?)"], ["Anthony N.", "I came here with friends after going on a hike at Griffith Park. Parking wasn't too hard to find, there's street parking and valet. I order the brussel sprout salad which needed lemon because it was pretty dry.  I was a bit disappointed by it. For entree I ordered the dungeness  crab hash. It was definitely better than the brussel sprout salad but it was okay. I wasn't blown away by it.I'd go back to this place to try something else and maybe the bottomless mimosa."], ["Queenie I.", "#SundayFunday #BrunchAdventures (Yes, I did just hashtag my review. :)I'm not gonna lie, $5 BOTTOMLESS mimosas (w/entree) = automatic 5 stars. Haha. But seriously, my criteria for a great brunch spot is a little bit more lenient than most others: must have good, reasonable priced, and bottomless  mimosas. Barbrix has definitely won me over. I prefer my mimosas to be a little more champagne with a splash of orange juice but thats a different story..lol.Don't worry, I made sure to be responsible silly! I got food too: [Tomato, Avocado, & Cilantro Scramble] with FRENCH FRIES!!! If I didn't already make my mind up about the 5 stars after the $5 mimosas, I would have here at the fries for breakfast -no additional cost. I was talking about this with my friends and the waitress, that if they had an option for bottomless fries and mimosas, I would pay anything up to $30 for that. Gold. :) The scramble was yummy and Barbrix is generous with the avocado, which I really appreciate because a lot of places charge a lot for it and only give a little.[Deviled Eggs w/an anchovy on top] I was quite shocked when she told us it only came with 3 because at $10, thats crazy talk! I also forgot to mention there were 4 of us. Our waitress gave us the option to add a 4th which of course we did. I jus wish I would've known it was going to cost an extra $3! Yikes. They were good but at $13?? I'm afraid not.The [Brioche French Toast-3 Berry Compote] was also very yummy but I was so sad to see that it only came with 2 slices and no side dish for $12. Kind of steep but I guess its the going rate for a brunch entree.[Service] was good. Our waitress was attentive, friendly, and patient. She and the bussers made sure our glasses were topped off at all times. Which obviously is a big deal haha. [Parking] Just remember, this is Silverlake, so parking is close to non-existant. But thankfully they do offer $6 valet :) We got very lucky and had street parking right in front."], ["Jackie K.", "Cannot beat $5 mimosas for brunch. Came here with two girlfriends for some lovely brunch and mimosas. I made reservations the night before for 11am and didn't seem like I had to make reservations. However, 30 minutes later, it was pretty packed. Everyone was taking advantage of the $5 mimosas and having a great time. The people are all so very nice and welcoming.Restaurant is clean. My friends and I all got the fried chicken sandwich with the pretzel bun. It was pretty good! As you know, we also got the $5 bottomless mimosas. The only catch is that each person must order an entree over $12 to get the $5 bottomless.Parking is not too bad here on a Saturday morning. You can either valet park for $6 or street park. It is $1 per hour on the meters with a 2 hour max. We left here full and happy."], ["Rachel Q.", "Came here for a friends birthday on a Sunday afternoon - the place was packed! Even though we had reservations, we still had to wait about 20 minutes and it was freakin humid outside.  We tried to squeeze into the doorway to beat the heat but so many people kept coming in and out.  When we finally got seated, it was outside in the humidity! The menu didn't really have anything that sounded amazing.  I got the crab hash and my bf got the waffles - they both tasted good but nothing was like OMG I know why there's a huge wait.  The $8 bottomless were great but it took a while for us to get refills,Overall this place was okay but wasn't super impressed."], ["Kelly R.", "Came here yesterday for the first time with a big group for birthday brunch for one of my girlfriends. What a cute place! It was probably a little too hot to be sitting outside, but they have a large patio with tons of outdoor seating and plenty of umbrellas to give you shade.Brunch was great. My friend and I shared the French toast, which was served with delicious sweet berries and so fluffy, almost a cake-like texture, as well as the salmon benedict which can with with super savory hollandaise. For a group of 8 ladies, we were also loving the $8 bottomless mimosas with any $12 entree!Our service was fantastic, they made sure our mimosas and waters never ran low and they even gave us 4 plates of complimentary pomme frites to share at the table since our group was pretty large. Would love to return for dinner tapas and wine sometime."], ["Courtney J.", "THIS RATING IS FOR BRUNCH.Because I've never been for dinner.This is my favorite brunch place in LA. Mostly because I thought their menu was on point. And the mimosas.****UPDATE 7.19.15Lindsay (Lindsey?) was our server today and she was absolutely amazing. Ninja refiller for sure!Steak and eggs: 17 dollars, a little skimpy on the amount of steak they give you but it's very good and comes with side salad and bread Brioche French toast: FLUFFY AND GONE SO QUICK! Tastes like your mom made it. Berry compote has amazing consistency and not too much like \"jam\"Frittata: big, fresh tasting but it could use a little bit more flavor, comes with side salad Bfast sandwich: satisfying but not better than your average bfast sandwich Side of eggs: good - a very nice light bite if you don't want too much foodSalmon Benedict: amazeballs! *****From 7/10/2014Crispy brussel sprouts: yes, very crispy, not overly oily, delicious and comes with fresh grated cheeseCrab hash: really good too! Not too salty which I find most hashes generally are.Buratta salad: you can never go wrong with burrata. Plated nicely. Affogato: great expresso and the vanilla ice cream was really goodBOTTOMLESS MIMOSAS! $5 with purchase of $12 food item. Definitely worth it if you plan on having more than 1 glass! I had 6....Ive had their yogurt with granola, and I loooove the yogurtBreakfast pizza was also good, though I'm not sure if they serve that anymore...Servers are great, place is clean!Oh, and i should mention that the servers are mimosa refilling NINJAS. They will refill your glass so fast you won't even realize you drank it all! MAGIC. (My favorite kind of magic)."], ["Trixster B.", "Best kept secret. You should really go somewhere else.Great place to try excellent wine by the glass; keep your eye on the board for  what my be a wonderful surprise indeed."], ["Ashton W.", "MAKE A RESERVATION. Otherwise you'll be waiting an hour ;-)Bottomless mimosas are good"], ["Erika H.", "Wooow. Not coming here again. Wasn't a huge fan of dinner, and tried brunch to give this place a second chance (bottomless mimosas). They asked us to leave due to having an overlapping reservation. They said they'd continue our service on the patio, but instead LIED  and told us they were done serving us. Obviously, we wouldn't have left our table if we knew they were going to be shady. Seriously, screw this place..so rude!"], ["Tiffany T.", "Came here for brunch for one of my girlfriends' birthdays. It's a pretty small location and it was pretty crowded on the day we went. We had reservations and we were immediately seated outside. It would have normally been very nice but it was about 90 something degrees that day and our whole group was just sweating our faces off haha. The brunch menu wasn't that appealing to me, and I ended up ordering the bratwurst and eggs. It was pretty good, but nothing special. My favorite part of brunch was the $8 bottomless mimosas!!! That price is amazing. The service was really good as well. The workers were very attentive and friendly :) There is a small parking lot in front with $6 valet. Be careful during peak times though, I was the last car they accepted and I came at 12:30. I'm not sure if there is street parking nearby. Also, if you've never been there, pay attention to your GPS when you're close by! It's kind of easy to miss. I like this place, I just wish they had a more interesting brunch menu."], ["Ticha B.", "3.5 STARS! I've lived in the Los Feliz all my life and drove past Barbrix millions of times off Hyperion. Never stepped in until recently. First impressions? I was totally impressed. Valet parking? Sure just because I almost missed turning into the restaurant the first time around. I should have just looked for street parking ($6 valet service charge, what? Are we at an establishment in BH?). It would have been cheaper to walk a couple of yards to find local street parking. I'm not a cheap-a$$ but come on now, we're in Los Feliz/Silverlake. The valet park guys actually parked my car across the street by the hardware store. Barbrix is a great place to take a date, grab some wine or have a nice dinner. But be prepared, the suds and food doesn't come cheap. Once again, I am not a cheap person by any means, I love to eat, but I did pay a lot for great food that came in small portions (yes tapas, I know what tapas are).The service was great. We walked in and was seated right away. The place is big enough to seat a lot of people, heated patio or inside. Our waitress was super cool and attentive. The spinach salad, Hamachi (yellow tail) tapas, pork belly bao tapas were great! The Pei mussels was good too. Great beer (Stegl) and wine were good as well. Unfortunately our bill was easily over a Benjamin.Good times. I loved the Barbrix atmosphere, the food and service were great but I'm a more \"meat and potatoes\" kinda guy....."], ["Sarah D.", "I've lived near Barbrix forever and I've only been to dinner twice in 5 years. Doesn't make sense since I love wine and tapas! Came here for a little 4th of July hangover brunch with my ladies and a tiny dog. Dogs are allowed on the patio which is nice! I got the burrata salad - AMAZING. Service was fast and friendly especially considering we showed up without reservations the day after America's Birthday. I'm sorry I never think to visit you Barbrix. Thanks for the tasty brunch though! Will come back :) I WANT THAT CRAB HASH REAL BAD"], ["Damien M.", "Bottomless mimosas! Enough said, can get bussy early but if you wait till around 11 or noon its not to bad. I always make a reservation you never know what the traffic is like."], ["R. A.", "Just had brunch with my girlfriends yesterday! Bottomless mimosas are a steal for only $8!!! The waitress was awesome and kept pouring the champagne constantly topping it off. I probably had 8 drinks!!!!!!!!   my champagne was never empty!!!!!!!!!!!!! Some errors were made on my salmon Benedict. I ordered fries not salad on the side. Anyway, they just gave me fries on the side additionally."], ["Marie D.", "I went there for brunch today and had a wonderful experience. I sat at the bar (the bar is available for those of us who don't make reservations) and was served by the bartender who did an excellent job.I ordered the quiche that came with a green salad and I was not disappointed. I also ordered the bottomless mimosas for $8!!!!! I would highly recommend this place and I would for sure come back again."], ["Jennie L.", "Came for the endless mimosas after a hike, left with a dissatisfied ehh feeling. I get it. I live in Los Angeles. This is where the pretty people live; as in, \"LA face w/ an Oakland booty\". But this place was like.... one of those LA spots that makes you feel cringey at how LA it is. I came here after a hike (so cliche I know) and of course that's the beauty of the eclectic scene in the lovely city of angels... you go do your pre-brunch hike and then you get trashed on endless mimosas and cheese smothered garbage food. But something about this place really left me feeling weird about being an angelino... Here's my list of nonos:1. THE WAIT. It must be the froofrooness of this place, but hot DAMN there is HIGH DEMAND! Basically, make a reservation or don't come here. 2. THE PATIO. Red umbrellas in a super sunny area make everyone look like we were all in the blood soaked hallways of The Shining. Not TERRIBLE, but pretty irking to me.3. THE FRIES. If I could have flipped the table that day, I would have. The pictures of them are down right FRAUDULENT!!!! My all time favorite food is fries. This place made me not finish my fries! (THIS NEVER EVER HAPPENS EVER!! EVER! AND I WAS BUZZED!). They're so thinly shoestringed that they were like.... chips like. I don't even know how to describe it. Ok... imagine deep fried... linguini noodles. yea. 4. THE PRICE. I had a barbrix burger + endless mimosas. With a 15% tip i paid about $32. Overall. Its just not my cup of tea. I'm those hole in a wall, bang for your buck, this is the best authentic taco truck in LA kinda gal. This place made me feel like it was too good for me. Which maybe it was. But whatever, I don't wanna be their friend either."], ["Ann K.", "The food is OK and the only good thing about this place might be their bottomless mimosas. So for that I give you a star.....I came here for a birthday celebration and I accidently left my brown leather jacket (a present from my mom) here. After I left, I later on recalled my mistake and called the restaurant to make sure that they have my jacket. They said they did and I said to please make sure to keep it safe for me.. THANKS! Barbix is a little out of the way from where I live so I thought I would pick up my jacket when I'm in the Los Feliz area again. So the following week goes by and I call one more time to make sure they still have my jacket and they reassure me that they do. Couple days later, I go back to the restaurant to retrieve my jacket. I see the hostess and let her know what I'm looking for. She then proceeds to lead me to a clothes hanger/mannequin/shelf that is shaped like a tree. It's a piece of furniture thats designed to hold clothes, scarfs, etc. This is where she tells me is where they place all the lost and find items.  I was kind of shocked because It is RIGHT next to the entrance of the restaurant near the hostess table and it is on full display where anybody is allowed to just come and take whatever they want.  I take a look and realize that my jacket is NOT THERE. i tell her that I had called previously and had been told that they indeed DO have my jacket. She goes and tells the manager and the manager tells me...\"YES, we have seen that brown jacket but if it's not on that ledge, then another customer must have taken it\".WHAT THE HELL?!?! ARE YOU SERIOUS.. WHAT KIND OF DUMBA$$ restaurant leaves a customers items/belongings on a display shelf for just ANYONE to take. They should put it safely in the back and only give it to the customer if it fits the description. It is literally decorated and displayed where anyone can just come in and take whatever they want from the display.UNCLASSY!!!"], ["Marisol R.", "I just left this place!!! Absolutely amazing!!! The food was delicious and the server was prompt, courteous, honest, and provided the upmost customer service! Who can beat $5.00 bottomless mimosas??? I wish I could remember what I ordered?! I'll update my review once the alcohol wears off! Lol I'll I could say is that this place is a must! Oh yes, you can bring your pets too!"], ["Sascha B.", "Love this place ! Amazing service, delicious food, relaxed atmosphere, what more can you ask for? Had almost every dish on the menu in the last 2 years ...( in my opinion: the best burger in town )"], ["Eric T.", "Brarbix holds as one of the pioneers in fine dining in Silver Lake. It was one of, if not the first small plates offering in the neighborhood and has been able to remain relevant since its opening in 2009I have not been in years & went on a lark half expecting an eatery in decline - only to find a lively, vibrant scene - with food to match the atmosphere. They have bar seats in the back that overlook the kitchen that are usually open, they are not particularly intimate, but for people who love food it beats any IMAX in town. There kitchen is tight (if not a bit mechanical) under the strict efficient observation of Don. The menu tends toward a mediterranean foundation - and flavors do not journey far into the unknown - but scallops were among the most tender I have ever had, and tuna carpaccio was paired with flavors that took it to great places. Be warned - you can easily double (or more) your bill on their well crafted wine list... There is a reason that Barbarix  is still packed on a saturday night. Menu: Ahi tuna carpaccio - 3.5*: The tuna could of been better but the blend of oranges/seaweed salad/ & pickles were fantastic. Ricciolina bay scallops 4.5* : Scallops were perfect, the dish was rich & favor was dominated by garlic -  but not overwhelming. Prime hanger steak: 4*: This comes exactly as described- very good but no surprisesWarm chocolate nutella souffle cake: How could this not be good!!!"], ["Christine H.", "A beautiful, sunny day in California calls for brunch and day drinking. Barbrix delivered my needs! They have a $8 bottomless mimosa!!! I called in on a Sunday morning and made reservations with no problem. If I had known they had outdoor seating, I would have chose to sit outside but at least it was nice and cool inside.I was really excited to try the dungeness crab hash but it was sold out! Bummmmerrrrr. It was probably cause we got there towards the end of brunch hour. So instead I got the steak and eggs. Everything was cooked as I had asked, but nothing on my plate was extraordinary. What I did really enjoy was the burratta salad w/ proscuitto. Very light and fresh. Overall, I can't complain about my visit here-- our glasses were kept full (they even had a grapefruit juice mimosa) and our plates were empty by the end of our meals. I will be back!"]], "AOC": [["Vickie S.", "I would've given this place 5 stars based off my dinner experience, but my brunch here brought it down one star. For dinner, I tried 4 glasses of wine (syrah, zweileght, red blend, and moscato) during my 3 hour dinner here. I was surprised that each glass was to my liking.  My friend and I started off at the communal table while we waited to be seated. We shared the bacon wrapped dates, baby broccolini and burrata focaccia, and the chicken liver toast. The only thing I didn't enjoy was the broccolini focaccia. It was probably an hour before we were seated on the outside patio which is absolutely gorgeous. They have lights up and it feels like you're dining in a beautiful garden. For our entrees, we shared the Spanish fried chicken and the squid ink black rice. Both were very delicious. I didn't think I had room for dessert until the panna cotta with Meyer lemon sorbet fell on my tongue and I was secretly hoping my friend would let me eat the entire thing. I wanted to lick the plate afterwards. For brunch, I shared the chicken and waffle, corn beef hash, and brioche with gyruere and prosciutto. All were disappointing with the expedition of then chicken. The chicken is fried and the same as the Spanish fried chicken for dinner. The brioche is just an open faced sandwich with cheese and prosciutto.  The corned beef hash wasn't exciting either and came out cold. I had high expectations after my dinner experience here. Oh well."], ["Steven Z.", "This place has a very cute and well designed interior. Lovely ambiance and friendly servers.Ate lunch on a weekday with two others. We ordered a cheese platter and some Serrano ham. Tasted delicious. For a main lunch course I ordered the mustard chicken spinach salad. It was ok. I wasn't entirely happy that the chicken came with skin on it and a bit fatty (when I'm ordering a salad I am trying to eat somewhat healthy). Friends ordered some drinks and a salad as well as steak/fries dish. They seemed to enjoy and we're happy.  For desert we shared a pastry filled with sorbet and covered with cream and fruit. It tasted pretty ok.  Overall it was good and ok. Might come back another time to try brunch or dinner instead of lunch."], ["Jessica W.", "I had brunch here on Sunday morning with my husband, my mother and my one year old daughter. The atmosphere is elegant, the service is friendly and the food is beyond wonderful. I had an omelet with squash and avocado and it was perfect.If you go for brunch, I highly recommend the vanilla bean french toast. My husband had it and we all stole some bites. The grilled blueberry bread was the perfect appetizer.The next time I visit LA, I'll be back for dinner. Thanks, AOC!"], ["Diana H.", "I loved it here! I came with my girl friend for brunch on a Sunday. We made reservations and it was hassle free. We got seated as soon as we got here and they gave us great customer service. We sat outside in the patio and I loved it out there. It has such a great feel to it, and the decor is very nice. The food was also great and I am definitely coming back!"], ["Michelle Y.", "3.5 if I could've.Came here with a close friend for a catch up brunch. We sat at the outdoor patio seating which was lovely! We started with the Fried Chicken appetizer which were great! (4 stars) and The Brioche with Prosciutto, egg, and endive which was delicious! ( 3.5 stars) Prosciutto tasted sooooo amazinggg however, the brioche itself and others were good, but nothing special. Also, fries were like anywhere else. This place is a bit overpriced for what it is, but I feel like you're also paying for the ambiance too! I would come back here if a friend wanted to try it though! However, service was spectacular! He was very attentive and made sure we had everything we needed."], ["Roxana Q.", "This is more 3.5 stars.Came here for brunch.We ordered the baked eggs,  AOC brioche & gruyère omelet. The baked eggs with feta, sumac & chickpeas made this a good dish with lots of flavor.The AOC brioche was a thick slice of brioche topped with frisée, prosciutto & a sunny side up egg. Good but nothing amazing. Gruyère omelet was a little disappointing. It would have been better had there been some vegetables in the omelet.  Also, the accompanying potatoes did nothing for me.  I think they would have benefited from a sauce or something drizzled on top of them. Also, the dish came with 2 thick, delicious slices of bread. While they were good (i mean, it's bread.  When is bread NOT good, right?) they didn't feel like they went with the meal. There was no sauce on this plate to dip the bread in & they did not even serve it with butter so it felt like it didn't go. Kumquat & blood orange bellini was pretty good but not $14 good. For a cocktail I'd be more understanding of paying the premium but for a bellini it's not worth it in my opinion.Overall was it good?  Yes.  Was it great?  No.I should say that the ambiance is fantastic & I imagine it's a wonderful choice for dinner. I would come back to try dinner & cocktails but for brunch i think there are better choices nearby."], ["Lucy K.", "Came here for a Sunday Morning brunch with my bestie. We made reservations for 10:15am but the place was pretty empty, should have known that was a bit too early for the Sunday Morning brunch-ers. There is some street parking or you can valet it for $6. It was a beautiful day so we decided to sit out on the patio, which is covered by lots of umbrellas so it provides some decent shade as well. We had some coffee which they always made sure to refill. My friend got the corned beef hash with looked super tasty and the eggs were cooked to perfection. I had the chicken and waffle. The chicken was plentiful, super moist with the right hint of paprika flavor. It was also coated in some type of maple syrup which made it super tasty.  The waffle was soft and a bit thinner then I had expected. The only thing I would have changed is maybe providing a side of honey or syrup, because i felt like my waffle could have used some directly on it instead of just on the chicken.Overall super tasty food and good service!"], ["Jane L.", "I would give this place a 4.5. I loved the atmosphere the service and food.Too bad I didn't get to take many pictures of food but I would definately come again to try other dishes.We came for our friends' birthday. Was taken to and upstairs sitting area. My kind of place with the wine rack walls and wooden tables and etc. i just loved the place!!"], ["Greg T.", "If given the choice, I normally avoid tapas restaurants since I don't think you get the most bang for your buck.  In that regard, AOC is no different; you're essentially paying prices that could get you a larger, albeit perhaps cheaper quality, entree at the same price.  But what makes AOC stand out from the rest of the crowd are its beautiful ambiance (especially the Mediterranean courtyard), its great service, and its interesting, if not delicious, food.  If hungry, I would recommend ordering 2-3 dishes per person.  You can probably get away with two if you're not particularly hungry.  The waitress recommended ordering 3-4 per person for a party of our size, but that was far too generous of an estimate, especially since you'll probably get full while you wait for the food to emerge from the kitchen.  Because I have a dairy allergy, I opted to order separately from the rest of the group in order to ensure I would be able to eat something.  The waitress was very accommodating and knew off the top off her head which items had dairy or not and which could be easily modified by the kitchen to accommodate my needs.  (For the curious, the clams are smothered in butter and can't be easily modified; the hangar steak is all right minus the roquefort butter; the market fish could have the smoked tomato butter removed at the possible expense of taste; and the broccoli as well as the arroz negro are okay as is.)  I ended up ordering the arroz negro ($15) and the modified hangar steak ($18).  While I was told that the arroz negro would take 30 minutes to cook, it actually ended up taking more like 45-60 minutes.  When the dish arrived, I eagerly devoured it, but was somewhat disappointed given that it was a highlight of many other reviewers' dining experiences.  While the rice had nice flavor and texture, the rice seemed unevenly cooked.  Some pieces were still tough and crunchy while others were soft and smooth.  The creaminess of the aioli nicely balanced the slight spiciness of the peppers(?) mixed into the rice.  The few pieces of sliced squid were good, but I would have liked more!  Unlike the arroz negro, the hangar steak didn't disappoint.  The fried shallots offered a nice crunch to the otherwise tender steak, which was cooked medium / medium rare without prompting.)  The meat was nicely seasoned, though salt predominated.  The portion size was expectedly small; about five or six slices of meat per plate.Generally, service was excellent.  Although I didn't catch our waitress' name, she was probably one of the nicest waitresses I've ever had, giving me frequent updates about when my food would emerge from the kitchen and offering olives, almonds, or bread to satiate my growing appetite while everyone else was digging into their milk-infused morsels.  Other staff made sure our glasses were always full of water, wine, or other drinks.  And, when it came time for dessert, we were serenaded by a worker with an operatic voice.  The one major drawback to my experience here was the slowness of the kitchen.  Our entire dinner took more than two hours because the kitchen was super slow in preparing food.One of the reasons why my friend selected AOC was because the restaurant didn't require a prix fixe menu for large parties, so if you're hosting a large group event but don't want to fork over $100 per person before drinks, then this might be a good place to consider."], ["Anthony H.", "I'm a fan of AOC mostly because of their patio. It's a great atmosphere and the wait staff are super attentive. Lunch menu is a bit simple. Focaccia, sandwiches, a pretty awesome burger, a few ok appetizers. Pretty much a carb lovers anti-Atkins menu.  The only blunder with the meal we had was the arugula salad (check the picture). Overly salty and way too much lemon. It came out half wilted and by the time we tried it, it was pretty much pickled. The Sheep cheese was awesome (cheese plate but I ate it before we could take a postable pic.   The medium rare burger was really rare but I like raw meat so it wasn't an issue. Everything was ok to pretty good. Make sure to get seated outside. That's what this restaurant is good for. A great patio that takes you out of the busy LA streets and into a relaxing (maybe a bit tight) space.  Not a fan of the $6 or $8 valet parking because there's pretty much no other option. The street parking is always full.  On a side note, this group has really awesome cookbooks."], ["Sage S.", "A strong showing for brunch.AOC is a beautiful wine and cheese bar that serves gourmet and not overpriced food. AOC, as explained to me by the waiter, is a professional designation in France that certifies excellent quality wine and cheese. It's not clear to me that this restaurant has earned such a distinguishment, or rather just takes its name from it. We went for Sunday brunch this last weekend, and we all thoroughly enjoyed everything about this place. We arrived at 10:00am sharp--right when it opened--so there was no wait for a table. We also got a spot seated in between the restaurant and the covered patio--the best spot in the house owing to the fact that we could enjoy both the indoor and outdoor scene of the place.But now, the food. You MUST order the grilled blueberry bread. WOW. The grilled blueberry bread made the experience for me, honestly. We got an order of the blueberry bread to share among the three of us--two pieces per person--and it was extremely delicious. Though grilling blueberry bread sounds like an eccentric way to prepare a sweet bread dish, it added just the right amount of contrasting flavor. Throw some butter on that baby, and you got yourself a winning dish.For the main meal, I ordered the Spanish fried chicken and cornmeal waffle, as one does at this place (apparently). The fried chicken had a very unique taste--it was sweet, savory, and had strong herbal undertones. I enjoyed it very much. It was also a lot of food--I couldn't finish the meal.I also had a chance to try my friend's brioche. It, too, exceeded expectations. I loved the tangy flavor of the greens matched with the [bacon? thin pork belly?] and fried egg. I would probably order this over the Spanish fried chicken and waffle, honestly.Altogether, AOC is a wonderful spot for brunch. If you can make it early enough before it gets too crowded, it makes for a very nice experience.My only quibble point is the limited brunch and breakfast menu--I'm sure they serve mimosas, but we didn't see it on the brunch menu. Just like we didn't see the coffee they served us on the brunch menu.Parking is a pain--I had to leave halfway through my fried chicken and waffle to put money in the 30 minute meter. Don't park in the neighborhood! It's permit only. A good bet is to park on Robertson, if there is street parking available."], ["Sarah S.", "Things I love about dinner at AOC:1.Intimate and beautiful patio lit by candles and fireplace, with olive trees that make you feel like you are in the Mediterranean2.Friendly and knowledgeable host and wait staff3.Declious small plates served in cast iron pans - try the farro and kale salad, all of the vegetables, the spanish fried chicken with romesco aoli and the roast chicken to share with crispy panzanellaEnjoy it all with a big red in a big glass (and a great companion).Done."], ["Jam Y.", "AOC ranks really high in my book, and I'm a super big fan of theirs for the reason that they're operating a restaurant that brings about a lot to the table, both literally and figuratively. Food, location, ambiance, and service. Those four elements. Practically perfect on all counts, down to the T. Smoooooth operator. If I were ever to start up my own restaurant, I'd imagine it to fall along the lines of this exact restaurant.... with an outcome of premature aging and panic attacks, since the restaurant biz is not for the faint-hearted, and I most certainly am not competent in coping with such chaos. Food: During my first trip, I didn't think the famed Spanish fried chicken was anything spectacular, and the romesco aioli had a curiously strange consistency where the texture was gelatinous and stubborn making it impossible to dip into as it refused to budge. To top it off, the aioli was completely flavorless and served no purpose to the dish, which definitely needed it seeing as though the chicken, despite its deep and alluring tone in color, was also flavorless and mostly banal.Didn't love the Arroz negro with squid and saffron aioli either, but I don't usually like seafood, and since this dish wasn't my choice to begin with, my opinions on it should be ruled out.The Duck confit was amazing! They cooked it soooooo well, and it must've been one of the best renditions of duck confit I've ever had! It was served with black rice, fresh and aromatic mizuna, blood orange butter and skinned blood oranges. Put together, it was incredibly tender and savory with a mild touch of sweetness and acidity that came from the juicy fruit. Delicious!We also ordered the Squash blossoms that were stuffed with, not just any old ricotta, but with brown butter ricotta (appreciating that simple, yet ingenious ka-pow), deep fried, then drizzled with honey with the finishing touches of thoughtfully sprinkled chunks of hazelnuts. UGH! Need I say more? Order it!Because 2/4 dishes were misses, I had deemed my first experience to be lukewarm.. until I went again!This is getting too long. Quickly...Second trip, ordered the:-- Vinter's plate (rillettes, cheese, cured meats, gherkins, roasted grapes and THICK slices of grilled toasts). This should be just as obligatory to order as the Squash blossoms. Great combination. Salty meats, creamy cheese, tangy accompaniments all tied together with a buttery toast... an amazing segue to your coming courses.-- Bacon-wrapped dates. Really sweet, but not bad.-- Focaccia (fig, prosciutto, taleggio, walnuts, and saba). Thinking back on it, you MUST order this one too on top of everything else I think is a must haha. Just order it, the portion is tiny, and one bite in, you're going wish it was bigger.-- Pork belly with roasted romano beans, romesco and marconas. The overall flavor of this blend of ingredients was tasty, I thought. Nutty and rich. My only gripe with it was that all both of us really got was the fat. Not that I minded the fat, but that it just lacked the balance.-- Hanger steak with Roquefort butter and shallot rings. Tender, hearty, good.Besides the food,--Location - convenient, easy to find, valet offered.--Ambiance/decor - A little on the upscale side of the spectrum by like a slight nudge, but in no way pretentious. (The patio is beautiful, and the second floor is more close-knit and colonial-ish) Ambiguous, gentle and pleasantly paced music playing in the background that accommodates conversations, so no need to shout. It easily gets diffused out. A huge plus in my book.--Service. Not snooty, nor uptight. Attention to details, naturally friendly vibes, not over-bearing and in-my face. It was as if they weren't even there, all the while meeting our needs in the suavest manner. Very easy-going, and above all, it was a peaceful dinner where the arrival of each dish was on point in terms of timing and overseeing, never feeling rushed nor delayed and..... just allocating a calm and perfect mood for dining in."], ["Jennifer R.", "Full disclosure: I am pre-prejudiced. I am a big Suzanne Goin fan! Tavern is right up the street from me, and I love to go there. Been to Lucques and had been to AOC once before...great experiences all. Now, of course these places are pricey, so they are typically more \"special occasion\" meals for me, although I really appreciate the effort made with the Larder at Tavern to be a bit more accessible price-wise. That said, I REALLY wanted to love this visit so much that I could give a 5. But, a few things fell short.Let's start with the meal. There were three of us, one ordered the \"mock goddess\" green tea beverage - she said it was amazing, refreshing and quite flavorful. For food starters, the bacon-wrapped dates were Mouth-Watering! But, they are SO GOOD, you just want MORE...not enough in that little dish. I REALIZE it's called a \"snack\" on the menu, but I could eat them ALL DAY!Next we shared the Spanish fried chicken. I really enjoyed it. There was a good bit of spice on it, and definitely the flavor of Madrid. It was a well-composed opening-round. Then we got the main affair. One of us went with the farmer's lunch. It comes cold. I think it would maybe be a bit better if the veggies were warm, but that's me. the highlight of this dish is the muhammara. I know, I didn't know what it was either. It's a dip. Just trust me. It's really good!Another went with the roast turkey sandwich. He reported it was quite good. I tried some of his fries - they were cooked perfectly. For my meal, the focaccias - house-made lamb bacon, laura chenel chèvre & braised leeks - sounded fantastic. How could one go wrong with lamb or bacon? Well, you can go REALLY WRONG apparently with lamb bacon. It was WAY too fatty and tasted like mush. There was TOO MUCH chevre on there, and the braised leeks should have been cut into shorter bite-sized pieces, as it was, I kept getting huge slabs of it that I couldn't bit along with the crust. Sadly, though it was well-cooked - crispy - the crust wasn't even great, it had a hint of sourdough-ness to it, and that is not my style...This focaccia was a \"fail\" in my book. Sadly.Finally, the service was good, but not great. At these prices, I think you have to live up to a higher standard - best service, best food. The valet was super nice. The hostess was super nice. Our waiter was nice enough, but not super helpful. When asked \"what's torchio\" his answer was \"pasta\"...no explanation of what sort of pasta - is it short or long, more of a noodle or a twist, is it hollow, or solid, no more information was provided. When asked \"how big is the focaccia, is it like a pizza, is it big enough for one person for lunch?\" he struggled to demonstrate the size and it turned out his example was WAY smaller than the actual item. He was not as \"on it\" as I would expect here...the server we had for dinner the first time was AMAZINGLY helpful. Our server this round, not so much.So, I go with the \"4\" - I debated \"3\" - but definitely falls well short of a \"5,\" disappointingly."], ["Emily G.", "If I could give more than five stars, this would be the time to do it. I recently came here for a private party and can honestly say that everything about AOC is perfect - the decor, the food, the drinks, the service... thank you for making our night so wonderful!AOC is known as a wine bar, but I have to recommend their cocktails - I had both the Tennessee Shandy and the Rothschild and thought both were phenomenal - I know cigar liquor sounds weird, but it tasted awesome. My friends commended me for drinking a \"man's drink\" - girls can totally drink it too, though!YALL THE FOOD. Every single thing we had was spot on: Bacon-wrapped dates, the Farmer's table, Cauliflower, Grilled whole fish platter, Roasted chicken platter, Hanger steak... yum yum yum!! I could not stop eating because everything was so good. Oh and probably the BEST thing is the peach salad - it's a must with burrata and dandelion!And don't even get me started on dessert!! It was like I died and went to sugar heaven - Butterscotch pot de creme, Chocolate torta, Homemade s'mores, Homemade chocolate peanut butter cups... ugh too unreal. AOC, you did me dirty and I can't thank you enough for it. Seriously can't WAIT to come back! Also, shout out to the waiters - yall were so attentive and sweet - thank you!"], ["Michelle K.", "Food is amazing. Service is amazing. What's not to love?The chicken and waffles is delicious as is the brioche. The french toast looked great too. I also loved the bread for the table.Overall an amazing experience."], ["Claudia B.", "Alright, peeps....... a bit of personal YELP info for everyone....... this is my 1,000th review, which I feel mighty proud to proclaim.  That's a lot of opinions about food and other stuff that I've had the pleasure of sharing (and hoping you've had the pleasure of reading)...... I'm proud of myself for reaching such a lofty number of reviews.  It's been great fun, and I have enjoyed every minute of sharing my findings......onward, I go.Tonight, we dined at A.O.C., which was also for my hubby's 'n my wedding anniversary.... so, that's another celebration revolving around this particular review.  However, I heave a rather heavy sigh as I state that A.O.C. let me down.  I didn't really like it, to be perfectly honest.  I expected and wanted that blissful state of moaning and groaning over the amazing flavors of the food prepared for me.  I simply did not get it.  With anything.  I expected far more from a restaurant of this caliber, fame, and popularity.While it's an attractive restaurant, especially the patio area, the chairs (at least at the indoor tables where we sat) were VERY UNcomfortable.  The kind of chair that is wood backing and bottom, without cushion, comfort or coverage.  Even their booths, which we had the option of dining in, looked stiff and unappealing.  Honestly, the patio looked to be the most comfortable (hindsight is 20/20), but it's been so disgustingly humid these days, I wasn't interested to dine al fresco, even at night with the sun gone.  Humidity is there 24/7.  Dammit.While other Yelpers have complained of the wait staff being less than decent, WE found them to be delightful.  Smiling, kind, concerned about our dining experience, we had no problems.  We waited a bit in between each dish brought, but honestly, I liked that.  I HATE when several dishes are brought at once...... it's too much, too fast, so this way, it gave us time to digest a bit, and we didn't have to feel rushed.  All that was just fine to me.So, now for the dishes.  Here's what I've found over the years.  IF the food I'm eating makes me happy, makes me blissful, makes me moan and/or groan with pleasure, I know I have hit pay dirt........ and I know that all the money I'm pouring out for this state of perfection, I'm happy to shell out.  Tonight, we shelled out our hard earned money for just okay food.  It wasn't good, it wasn't bad.  It just was.  It had flavor, but minimal flavor at that, and not necessarily flavors I enjoyed.  It had texture, but nothing making me say \"wow!\"  Last year, we dined at Jose Andres' The Bazaar, another small plates venue, and my husband and I are STILL talking about that dining experience, and we remember VIVIDLY what we ate.  It had THAT kind of impression on us.  A.O.C. does not hold a candle to that place AT ALL.  A.O.C.'s dishes SOUND good, but here's what we experienced...1.   Focaccia - summer squash, gruyère, pecorino & salsa verde - probably the dish with the most...and best flavor, but it was too greasy.2.   Kampachi crudo, citrus, marcona almonds, avocado & fennel - Just items on a dish, didn't work together.3.   Tuna meatballs, spiced tomato sauce, kumquats, mint & pea shoots - different, and probably a little too spicy for me, but meatballs had good flavor.  4.   Stuffed squash blossoms, brown butter ricotta, honey & hazelnuts - ricotta very bland.  Hazelnuts just there...... didn't add to the dish.  Squash blossoms perfectly cooked, but no real flavor.5.   Spanish fried chicken, romesco aïoli & chili-cumin butter - overly fried chicken, ultra greasy, didn't love the flavor of the chicken, aioli or butter.6.   Hanger steak, roquefort butter & shallot rings - steak good but nothing great, could have done without the roquefort butter. We didn't even want dessert.  Between the chair issue and not feeling wow'd by our meal, we just didn't want to spend even more money.  We spent approx. $150 to be underwhelmed.  Again, it wasn't bad food, but it wasn't amazing either.  I'm sorry to have a less than raving commentary for my 1,000th review, but I pride myself on my honest approach to writing.  This was my experience, and I simply expected more.  Sorry, A.O.C."], ["Hailey C.", "This is my hoooood! My brunch spot!Parking:Valet park it. It's hard to find a street parking in this area but if you must... Service:I wouldn't say their service is the best...but the servers do their job. I never had to wait to be seated because I always make reservations when I go here. I feel like they are short in staff because I've never had anyone come and check our table while I was eating. Also, when I needed something, they were too busy taking orders and brining out food to other customers.Food:I've been here several times for brunch. Now, some of their dishes are really good and some are really awful. Like the chicken and waffle was really not worth the money but their brioche is pretty good. I guess it takes a trial and error to get to know this place. My coffee was good, soft shell crab was delicious. I was always too full to try their desserts though. (Or went to Lady M next door. lol)Overall, a decent brunch spot...semi-outdoor seating is perfect to get some vitamin D. Try this place!"], ["Michelle B.", "We went to AOC last night and were pleasantly surprised with the food. The drinks were AMAZING, I highly recommend the green goddess or the chupacabra. Highlights of the night:-Pappardelle (one of the best I have ever had)-Sunchockes (delicious!)Very nice, romantic atmosphere and the food was very good."], ["Jeremy S.", "Yikes, A.O.C is freaking awesome! I mean the food and ambiance here is top notch. My review is based on lunch alone as I have never had dinner at this place. This place has a cool vibe and definitely pleases your palate with an explosion of unique flavors. I ordered the turkey sandwich with fries and was absolutely astounded by the flavoring associated with this sandwich. It was a beautiful blend of unique Italian olives, avocado, sauce and perfectly baked bread. I paired the sandwich with some wonderful fries, washed it down with and iced tea and butterscotch for dessert. All of the above were absolutely fantastic and the service was on point. Located near Cedars Sinai and the Beverly Center, A.O.C is a nice chic place to grab a meal with some friends and/or clients.  Highly recommended. Pros-ServiceTasteMenuLocationAmbianceSeatingUniquenessFlavoring Cons-Crowded during peak hoursParking"], ["Marina R.", "I have to admit that I was worried this place was all hype and no bite but nope.  The food is amazing.  We went on a Saturday night and were seated outside in the patio area.  The romaine lettuce salad with green harissa dressing and clementines was amazeballs.  If it was socially acceptable to lick the plate, I would have.  We also had the pappardelle with green garlic and morels which was cheesy and good, the Spanish fried chicken which was seasoned perfectly, hanger steak was good but we ordered it medium and it came back medium well so I'd definitely order it medium rare next time, and some kind of Meyer lemon semifreddo with pistachios and honey that was a perfect ending.  The cocktails were also strong and well made.Can't wait to come back.  Definitely worth the praise."], ["Sophie P.", "PRO-TIP:Come in for happy hour AKA cocktail hour, everyday from 5-7 PM. The cocktails on the list are $10, as opposed to $14, and some of their options are $3-4 cheaper, which can definitely add up! If you like a variety of menu options, definitely start out at the happy hour area and move to the dining area to maximize your experience.FOODBacon-wrapped dates ($5 - HH): This was pretty raved about in the reviews below, but let me just warn you and say the serving size of this appetizer was literally laughable. The six bacon wrapped dates came in a ketchup serving container size. [Look at my picture for reference]. I've never had bacon wrapped dates that I didn't like, and this is a great way to start out your meal for $5.Spanish fried chicken ($10 - HH): Should this be called Indian fried chicken? I swear, the flavoring on this chicken tasted like Indian herbs. Anyway, the chicken was very flavorful and really didn't need aioli/butter dip on the side. The chicken was not too oily, but so flavorful that I wished there was some sort of bread to balance out the flavors.Brioche with prosciutto/gruyère/egg ($14): This mountain is essentially a giant salad on topped with an egg sitting on a bed of perfectly crisp, but soft, brioche bread. I did like the variation of textures and flavors on this dish, but I didn't think anything about the dish was TO DIE FOR.DRINKSPistolero ($10 - HH): This cocktail was really good! I honestly cannot drink any form of tequila after college, but the honey, lemon, and ginger really made the drink taste more like a whiskey and the flavors worked really well.Green goddess ($14): This drink was really refreshing, like a summer day.SERVICEFrom Happy Hour seating at the communal table by the bar to our dining table that we had set with a reservation, we had great service with friendly bartenders and waitresses. My cocktail had a dead fly in it, and my waitress made sure I was brought a new drink right away and kept apologizing about it. LOCATIONSince this is located right next to Lady M, the parking around here is pretty bad. I suggest valet ($6). The restaurant itself is beautiful and looks like you are dining in a mansion's personal patio with beautiful vines and lights!"], ["Andrea H.", "One of the nicest settings in LA. The patio is an oasis in the middle of the city. Whether it's for a bridal/ baby shower, special occasion or for no reason at all, AOC continually exceeds expectations.The service is always great. I've been here when it's packed and service never fails. It's nice to see restaurants with consistent staff that have been there for years. Weekend brunch/ lunch is one of the best. Don't skip the bacon wrapped dates. You can pinpoint the trend starting here. They're very addictive and very temperature hot. (Be aware before popping one in your mouth)Chicken and waffles in a kicked up gourmet level are so good. The vintners platter, a delicious combo of cheese, cured meats and fruit (grilled grapes!) is either a great share plate or a full meal. Always will be back here and in my restaurant rotation."], ["Grace K.", "We made reservations for 8pm, but showed up an hour early, thanks to hubby's growling tummy. The hostess led us up in their wine room and we were seated at a window seat with an awesome view overlooking the restaurant below. We were the only ones to be seated there for a good while so we felt extra special with a whole room and servers to ourselves.Our server was extremely attentive and pleasant. For the dishes he recommended that we ordered 2-3 small dishes per person, so we ordered the arugula salad, sherry garlic clams, spanish fried chicken, farro and black rice, and duck crepinette. All 5 dishes were great, I would have to say the spanish fried chicken was the winner if I had to pick. Perfectly seasoned and crispy on the outside and oh so juicy on the inside. Dip in it the accompanied sauce and mmmmm.I had stuffed my face just a couple hours earlier at Eveleigh and now here I was stuffing my face all over again, yikes! For drinks, I ordered the moonraker. It was really good, very refreshing with lots of fruit notes. For dessert, we got the chocolate torte with candied nuts and a coffee cream. It was good, but looking back we wished we had ordered something more adventurous.I would love to return, the ambiance was great, the food was superb, staff was on point. All around great experience! Valet parking is $6."], ["Soo H.", "I just need to reiterate my opinion of the brunch here with WTF.Service is fucking awful; very haughty and slow.  Food is served in basically a pool of grease and I had to ask for extra ketchup three times.I thought maybe they were having an off day the last time I came so I gave them another shot this past weekend and I can definitively say now that I will never be back."], ["Josh L.", "Went here for the first time.  I heard a lot of good things about it and I was not disappointed.  It is close to restaurant row by the Beverly Center.  You go in and it has good lighting and a casual and cozy feel.  There is an indoor and out door.  We sat indoor due to the weather, however the outdoor area has a nice ambiance too and I think there are heaters out there when it gets too cold.  I had a few dishes when I was there.  They have a lot of menu items with small plates so you can taste a lot of different dishes in one sitting without getting too full and wasting food.  So if you like that kind of thing then this place is for you.  Here is what we had: - black cod, artichokes barigoule & meyer lemon aïoli - Good flavor and the cod was cooked perfectly. - english peas, green garlic, pea tendrils & saffron butter - Very tasty.  Had a good flavor too.  I think this dish would be good if it came out with one of the meat dishes at the same time. - cauliflower, curry & red vinegar - Good side.  Had a good bite to it with the vinegar.  - spanish fried chicken, romesco aïoli & chili-cumin butter - I thought this fell a little flat and did not have a ton of flavor.  The chili-cumin butter was not great either.   - hanger steak, roquefort butter & shallot rings - This was my favorite dish.  The steak was cooked perfectly and full of flavor.  with the Roquefort butter it added additional flavor to the dish.  Just fantastic. - butterscotch pot de crème with fleur de sel & salted cashew cookies - If you like butterscotch flavor, then you will love this dish.  It was good to split to end the dinner.  There was one more dish, but I can't remember which one it was.  Good restaurant, I will be coming back for a visit to taste more of the menu."], ["Jamie D.", "There is valet for $6 if you don't want to deal with trying to find parking on the streets.Service, from hostess to servers/bussers, was not memorable. We wanted to order a side of fries and our server confidently mentioned that my Hanger Steak dish came with fries...except it says potatoes on the menu, but we trusted she knew the menu better than we did. Well, sure enough, she was wrong. No fries.We ordered the Bacon-Wrapped Dates and the Fig, Prosciutto, Taleggio, Walnuts, and Saba Focaccia to start. Both were cooked well and tasted great.We opted for the breakfast choices and although the rest of my party thought the dishes were good, I thought it was average, forgettable, and underwhelming. However, the other two in my group agreed that it wasn't a restaurant they would go out of their way to revisit. It would be more out of convenience when in the area. The dishes lacked a wow factor and left my taste buds wanting more!Spanish Fried Chicken & Cornmeal Waffle: the cornmeal waffle was a bit on the soggy side. The fried chicken actually tasted decent with the right seasoning and crunch. I definitely wouldn't be able to eat this entire dish myself as I was already sick of it after a couple of bites.House-made Corned Beef Hash: the beef was a bit on the dry side though it was seasoned well.Hanger Steak and Eggs: the hanger steak is cooked medium rare and it was my mistake that I missed the fact that it was topped with a tapenade, which I hate. I hate olives. It was supposed to come with roasted baby artichokes and I literally had two on my plate but plenty of bland potatoes to fill more than half my plate! The sunny side up eggs were cooked well with a little crisp on the outer edges, which I appreciated. The steak was good, but everything together was just okay.We asked for a side of either ketchup or aioli for my extremely bland and lackluster potatoes. A server suggested aioli and as a fellow Yelper pointed out, it had a strange consistency not reminiscent of the texture of a normal aioli. It was a bit gelatinous, tasteless, and off putting. The mouth feel was not appealing and almost plastic-y. We ended up having to ask for ketchup as well.This establishment has a lot of rave reviews, but the further I delve into it, the more it seems that everyone is generally unsatisfied with AOC's breakfast/brunch items and execution and more happy with the dinner and tapas options."], ["Peter I.", "In a word...pretentious. I used to like the other location and will admit I don't go often. But, I thought I would try and see the new spot and I was disappointed with the food and the service. I get LA spots, we are trendy and hip and you should glad to pay whatever we want to be around us. This is what I felt. Wine list is still one of the best and had some great Malbec that was smooth and well priced. The food was OK, nothing stood out. Cheese plate was good and the Spanish Fried Chicken was chicken strips. Nothing Spanish about them. The space is beautiful and well thought out other than the one table that sits halfway between the two rooms that 3 other parties wanted no part of....including me. It was really the service that put me off. Not rude, just aloof. Oh well, on to the next."], ["Shannon S.", "My boss took my coworkers and me out to lunch, and we had a great time at AOC! I loved the rustic vibe of the restaurant. The outdoor patio was beautiful with the ivy running up the walls and the colored tiles in the decor. Our waiter was very quick to come and tell us about his recommendations for food and drink. We ended up sharing the Marcona almonds and olives for our starters. For my main dish, I had the lentil salad with shrimp. It was delicious! I got my dressing on the side, and I didn't even need it -- the salad was already so flavorful! My boss had the artic char, which he loved. It had couscous and grilled nectarine. I might have to try that next time! My 2 coworkers had the cheeseburger and the farmer's lunch plate. Everyone enjoyed their meals. Overall, we had great service and a awesome food that was healthy and filling. I can't wait to come back and try more dishes!"], ["Milton M.", "The bacon wrapped dates were delicious, but the other dishes we tried were generally all small-sized and oily. This is a romantic spot and the patio has a lot of ambience, but I service was mediocre which makes me reluctant to go back. I'm also disappointed by the 3% health surcharge. The employees definitely deserve health coverage but the restaurant should just set appropriate prices. Who knows if the owner is just pocketing this money."], ["Caroline S.", "Ambience is beautiful when you dine outside, especially at night time.Their peach salad is amazing.The wine list is a bit overwhelming, but their staff will help you out.My gripe about this place is how their portions change. When my girlfriends and I ordered the clams, the plate came with 6 pieces. There were only 3 of us, so each of us got to have 2 pieces. Sure, it tasted good and all, but it was $14 for that dish. My friend showed me different pictures the next day of that dish from AOC's instagram and yelp photos, and there were at least 10 clams in those photos. Not cool."], ["Melissa H.", "Came for a quick lunch break from work. Was immediately greeted by Raj and he was one of the best servers I have ever had. Very attentive, quick, knowledgeable. He made the lunch a wonderful experience. The food was on point and so were the fresh drinks. 1 star off for the hostess who said \"she wasn't sure she could seat us\" although the place was practically emptu"], ["Lisa K.", "Delightful. Adorable.Also the food will not disappoint!Chicken&waffles- best you ever have. I have to say prob better than bouchon even :pBrioche open sandwich with gruyere, light bitter greens that I cannot think of the name right now..... prosciutto, egg sunny side up :)Corned beef hash. Yum.Turkey on focaccia sandwich. Well done AOC!!!"], ["Kazu O.", "I didn't know that LA does the whole farm-to-table thing, but the brunch here was solid. I definitely like the outdoor space on a warm day, and my steak & eggs were excellent!"], ["Megha T.", "Came in for brunch with my husband off of a recommendation. The location is great, right off of Robertson next to the swanky shops and the famous Ivy Restaurant. The restaurant itself is very cute with an enclosed outdoor patio, complete with trees and flowers. The crowd is 30 and up, it's a wine bar first so it's definitely a mature crowd. You won't find a DJ and bottomless mimosas here!We ordered bread and jam ($6- you do have to order it, nothing is free in Beverly Hills!) It was excellent but then the bread got hard after some time and hard to chew. Our entrees however were delicious- we ordered the chicken and waffles and corn beef hash with eggs. Both dishes were large portions and were very tasty. The server was hospitable, though hard to find at times when we needed water or the check. Beautiful, understated brunch option for the Beverly Hills area."], ["Elora H.", "Well my meal was absolutely INCREDIBLE! A.O.C. really put it on for me and I had an excellent experience. A.O.C. is a tapas style restaurant and right away they asked if I had been before then explained how the menu works and suggested 2-3 plates to fill me up. I had such a great service the whole time I was there - don't think I've ever had a better service! Each time I emptied my water glass there was someone to quietly fill it up; something that was needed in this heat! Very attentive and caring staff who actually felt like they enjoy their job. I started off with their bacon wrapped dates which were a divine way to start my meal - sweet and savoury colliding in one glorious bite. I followed it up with their stuffed zucchini blossoms - something which I have never tried before. This was my 'naughty' choice of the evening, a choice I made as I have wanted to try stuffed zucchini blossoms for such a long time! They didn't disappoint; stuffed with a browned butter ricotta filling, deep fried and topped with honey and hazelnuts. I was definitely not disappointed! A great first experience - they were so tasty! The sweet zucchini flavour paired with the creamy and buttery ricotta with the hazelnut and honey meal to finish off was gorgeous. I finished off my meal with a classic favourite - pork belly! This pork belly was served with charred green beans, a curry paste and roasted almonds. The pork itself was melt in your mouth, buttery and perfectly cooked. The beans were tender and flsvoursome. I wasn't too sure on the curry but it did work - especially with the crunchy crisp almonds. Superb food, excellent service and a must visit if in LA."], ["Wendy W.", "SO many things about AOC to love.The restaurant space is absolutely beautiful, from the nice outdoor dining patio to the open air indoor space and the beautiful wood and bar. The atmosphere is also great--waiters are attentive and check up on you frequently (but not to the point at which it becomes annoying), and you can see many a couple or a group of friends chatting it up at a table.My friend and I shared the blueberry bread with lemon butter, and we were astounded by the freshness of the bread and the delicate, yet noticeable presence of the fruit aromas. She also ordered the brioche with prosciutto, and I ordered the house-made corned beef hash. Both dishes came out plated beautifully and tasted amazing as well. Again, we could not get over the bread. We were so full at the end of our brunch, but still kept wanting to eat more.I think a good way to describe AOC is that every part of the experience is actually very simple, but they do the simple things exceptionally well. From something as ubiquitous as outdoor seating to a staple carb like bread, it's very apparent that there's something special about this restaurant."], ["Farrah S.", "Celebrated my birthday here last Friday - table of 12 women. Julie the manager was very accommodating and waived the set $65 dollar menu in order to keep me happy.Venue was beautiful, so pretty! Food was amazing, so so good, flavorsome and hearty. I had the arroz negro with squid and safron aoili, brioche with prosciutto and egg and the Spanish fried chicken - all so yummy!Down sides:door was open and we were freezing3% health insurance benefits charge for THEIR employees, this is optional but you then feel like an idiot asking for it to be removed.I definitely want to return to try the rest of the menu!"], ["Aiden S.", "AOC is one of my favorite tapas restaurants. The arroz negro with squid and saffron aïoli is outstanding. The sweet potato with bacon and spinach may be the best sweet potato I have ever had. Only complaint is the swordfish was too salty. But the israeli couscous that it was served with was very good.Great atmosphere and service. This restaurant has a very hip style. Sitting by the fireplace was great."], ["Sarina G.", "Had a lovely dinner at AOC last Saturday with a group of gals - 4 of us total which was great as we could try more things!   The atmosphere is nice- can sit either inside or out in the patio, we choose inside as it was rather chilly that evening.Started with a round of cocktails - I had the leaf and spear which was quite interesting- it was like a green juice from a juice bar but spiked with rum.   Kind of tasty, but not sure I would order again.  One friend had the Sancho Panza with vodka and ginger beer which she really liked.As for food- we ordered the baby broccoli focaccia which I highly recommend, this was probably our favorite dish of the night.   We also had the charred carrots salad, the cauliflower which had an Indian spice to it, the young broccoli with chili, the tuna meatballs, the spanish fried chicken, and the pappardelle.   So quite an assortment!  The pappardelle was also another favorite, so rich and creamy and perfectly cooked with an amazing mushroom flavor.   The tuna meatballs were the only dish we did not like- had a funky taste and we couldn't even finish them.   Server didn't charge us though which was cool.For dessert we had the berry rhubarb cobbler with ice cream, wow it was sooo good.   I had never had rhubarb before, I want to make this dish at home if I can.Overall, a nice evening and great food!   Would definitely go again."]], "Paseo San Miguel": [["Veronica C.", "Came here earlier for a desayuno and I was very happy that the food tastes just how my grandma used to make for me.I got the huevos con todo but I ate it so quickly that I forgot to take a photo lolThe ensalada was really good too it's a fruit drink with cubed apples and they give you a spoon so you can eat the apples.If you want great home cooked salvadorian food, come here. The food is good and the waitresses are welcoming."], ["Tessani T.", "WHY I WONT COME BACKThe service of the cashiers needs to be better. I've felt discriminated and pushed to the side while buying food. My sister and I bought food and paid separately. When the food was packaged to go no one spoke they just handed a bag to my sister we waited 10 minutes in the front of the restaurant waiting for the 2nd order only to find my food was in my sister's bag.(seems small but why would you give her my food I was right next to her) The female cashiers make it a point to make little to no eye contact and hardly any speaking. I never get warm welcomes which should be given in both Spanish and English. The staff here has made me uncomfortable to the point that I will not come back. Fortunately the food was good but why would I risk having bad service just for food."], ["Ursula H.", "Came in for some dinner with my mom and we got attended right away! Took me by surprise. Not only that but we also got our order quicker than usual. Food service has improved tremendously! These ladies are lovely and are on point with service today. Glad I came. The sopes were delicious as per usual. The Ensalada is refreshing and sweet! I'm never disappointed with the food here.It's a must try spot and I highly recommend this place to anyone.5 stars for great service and food comedor Bella vista ! :)"], ["Abraham T.", "Good food. Good service. Even when busy, not a long wait.  Pupusas are pretty big, barely finished two. Fried plantains are delicious.  Plenty of noise and tvs on sports channels so no biggie if taking a moody baby. Would come again but I don't live close by."], ["Israel C.", "Been here about 4 times. Mother in law recommended it to me. We're Mexican but we love a taste of this fantastic Salvadorian food. They have a variety of pupusas."], ["Evelyn U.", "Everything was delicious, big portions, good flavor. The excellent service. I think they're having a little problem with AC but it didn't diminish the experience.First restaurant we've been with my husband that offers fresco de arrayan (cas) like he calls it and it tastes delicious."], ["Doris G.", "I will be coming back!  The food was worth the drive. Can't wait to try something new from the menu. A definite must if you're in the area stop by have a drink, snack, or what ever your little stomach desires."], ["Glenda M.", "I always pass by and wouldn't stop by...today I decided to bring mom for lunch...Delicious salvadorean food at a reasonable price."], ["Daisy L.", "I live two blocks away from this restaurant so you can only imagine how much my family and I enjoy walking over to go eat here.Anyway, my 4-star rating is solely on the food. I have yet to try other items on the menu but I always get pupusas with my side drink called ensalada. I love the fact that their pupusas are varied and you can even mix other ingredients from other set pupusa orders. Although the food is phenomenal, service is extremely quite the opposite. I think the level of popularity of this place is what makes it hard for servers to adjust. We waited more than 35 minutes on orders of pupusas. I also saw a lot of people who were growing frustrated with either their order, not getting seated, or not even getting their order taken down. Highly suggest they revamp their service because after some time, it will start to lure customers out the door. In between the wait time, was an even longer wait time for drinks and refills."], ["Kay K.", "Ordered bean empanadas and they probably put a teaspoon of beans so that made me upset because I have bought some when they first opened up they will give them to you just right not too small nor too big but now that they have stablished clientele they are getting sloppy . I decided to give them a try so we ordered pupusas and we found a hair , I told the waiter and her response was impossible !! Will never return here !!!"], ["Alfred Z.", "Best Pupusas I ever Had!! Wow!! I had the carne asada and queso along with the traditional queso and it was tasteful!!"], ["Brian M.", "Pupusas: Unfortunately, none of the pupusas came with the ubiquitous Salvadorian herb called Loroco, except for the plain Queso con Loroco, and the Revueltas. I had to ask for it to be added to the others at an extra charge, even then, they barely had any inside them. I understand that some people might not be a fan of this herb-it's actually the buds of a plant that only grows in El Salvador-but I, for one, expect it in all of the pupusas I eat. Even though I might have a few disappointments with a couple of their pupusas, it is not all bad. For $2, you get a pupusa that is quite larger than pupusas of any other place I've tried. One alone can almost cover your whole plate, depending on how large your plate is. I got full off of three of those suckers, and if you see me, you KNOW I can eat more than three regular sized pupusas.Revueltas- Although normally Revueltas have queso con loroco, chicharron (pork belly), and beans. These didn't have the latter, but still had a great flavor to them. Out of all the ones I've tried here, these were my favorite. I was able to taste the loroco in the cheese, as well as the tomato, peppers, and cumin in chicharron. When people see the chicharron before it goes into the masa, they think it's raw, ground pork because it looks slightly pinkish. This is not the case. It takes on that color because once it is fried, it is passed through a food mill along with bell peppers, garlic, onion, tomatoes, and salt/pepper/cumin S&P&C (HIMYM joke, but true) for flavor. So, once it has all been ground together, it takes on the reddish hue due to the added ingredients.Sopa De 7 Mares- The Salvadorian version of seafood Consommé that contains: crab, mussels, clams, octopus, white fish, shrimp, calamari, carrots, squash, with speckles of parsley strewn around. Rich broth with its succulent flavors that are uniquely balanced due to the variety of jewels from the sea added to this dish to elevate it to another level. You can never go wrong with a squeeze of lemon to add  a little more complexity to it.Aguas Frescas- These were some juices made from Central American fruits that most places I've been to did not have. Since these fruits, are not typically found in regular stores, you can find them in the frozen aisles of Latino markets.-Arrayan- Slightly acidic and tastes kind of like a blend between guava and a pear. Very refreshing, it is in the guava family, but more on the sour end of the spectrum.-Marañon- A very sweet drink with chunks of the fruit floating in the glass as if frozen in time. You wouldn't have thought of it, but is actually made from the fruit of the cashew nut. The fruit is a bright orange color and naturally sweet, but too thick to be sucked through their straws.Even though they had a few downfalls with a few of their pupusas not being up to par, do not hold it against them- I'm sure they will take care of it. The rest of the food and drinks on the other hand, are well worth stopping by to at least try and get hooked on to keep coming back.If you want to see the full review, you can find it at: thechonchudofiles.wordpr…goo.gl/6xEdCE"], ["Pablo R.", "Some of the best Salvadorian food I've had in a long time. After trying their breakfast, dinner, & everything in between, I've become a regular customer. They have reduced the amount of food they put on the plate a bit, but hopefully  it wont become less."], ["Mayerlin C.", "The only reason they dont get 5 stars is because some of the ladys are a bit rude and their salsa is not to my liking.Anyways Their Pupusas are HUGE and delicious! I love the curtido! Horchata is pretty good. Their platanos are delicious too!"], ["Kathy V.", "Food is good... But make sure you check the receipt! They will return the wrong change or charge too much!!! Anyway they fuck up on orders tons.... I'm done coming here"], ["Elvia M.", "Service is great and the food is delicious!! It gets busy so the wait time might be long but it's worth it ."], ["Alberto M.", "Food is great! Waitresses are nice. Menu price is very affordable and good portions. The food quality is very good. Pupusas for $2 is outstanding! 7 mares soup  $12 and is awesome. Love it. If you come you won't regret it."], ["CHERYL H.", "The food here is so so so good, the grilled shrimp dinner is very tasty and that All Seas Seafood Soup is tha bomb - not to mention it is just across the street from me - Hey guys I love the continuing upgrade to the place, however it would be lovely if you would get rid of that unused drive-thu and add an outside patio with umbrellas. CH"], ["Noemy M.", "I really wanted this place to be good but once tour try good you will never go back to anything lower than good. Sorry but this food sucks. I tried but because is closer than the one place I go to. But I guess I have to choice to keep remaining faithful to the other place. Food is not good at all."], ["Jürgen A.", "Amazing , tasty and affordable food. Waitresses are kind and helpful. Amazing place overall"]], "Casa Córdoba": [["Eunice C.", "A rather expensive way to get a taste of Spain's rich cuisine, but altogether an excellent representation of Spanish fare and tapas. When my family of 3 visited Casa Córdoba, we decided to pull out all the stops and order a good number of items:Boquerones (anchovies in white vinegar), the house paella (with chicken, duck and chorizo), salmorejo, and a cheesy dish overlaid with an egg and served with small, hard bready crackers. Sorry, I don't remember the name but it's a popular item - ask your server. Overall fantastic, although the pricing does tickle me just a little bit.As a huge seafood lover, I enjoyed the boquerones. The anchovies were laid, whole for the most part, on top of bread with some rich cheese and perhaps other ingredients I'm forgetting. This is a very fishy dish and probably not for everyone. One dish provides six bites. The paella was everyone's favorite: Two pieces of meaty chicken, breast and thigh, overlaid a hot platter of yellowed rice, chorizo bits, and other delicious things. We ordered the one that serves 2 people and had no problem feeling relatively satisfied split amongst 3 diners. However, that's considering my family also ordered three tapa dishes.The cheesy dish was quite rich, and flat-out comfort food in the best way. When you dig in with your cracker, the egg splits open to introduce runny egg yolk into the rest of the dish. You can request for more crackers if needed.My only complaints would be that:1. The salmorejo was not what I've tried during my five months abroad in Córdoba, Spain. Casa Córdoba's salmorejo was reminiscent of chilled tomato puree with crumbled hard-boiled eggs and jamón (ham) on top. Given, salmorejo probably can have many different interpretations depending on the chef, more watery or not. However, the ones I've grown to love would be the thicker salmorejo that has tomatoes, fresh crusty bread, garlic, and olive oil blended to a creamy smoothness and served cold, same garnishes on top. I was rather disappointed to find out that Casa Córdoba's did not mimic that creaminess I sought. Nevertheless, it was good. I was a bit thrown off that the salmorejo was served in a small glass cup rather than a bowl, though.2. When my family requested dessert, we were informed that the restaurant is out of everything minus one item. While I understand that the items must be popular, especially the churros con chocolate, exactly for that reason it would be great if desserts did not run out rather early into the evening. Finally, the atmosphere is gorgeous. We sat at a table furthest from the outside entrance, surrounded by lush greenery, a fountain, a wall almost cinematically tressed with ivy and Christmas lights, and live Spanish guitar music from a musician tucked away in a corner. It was quite romantic and beautiful. My mother, like any happy non-Spaniard, ordered some sangria and admired the scenery. Without a doubt, Casa Córdoba offers a wonderful experience reminiscent of Spain in many accounts. I would come here again, and I hope that time around I'll be able to have some churros con chocolate."], ["Corey B.", "Great ambiance and tasty food. Everything we have ordered here so far has been yummy.  We sent the steak back as it was a little too rare and they did the right thing and brought it back with fresh fries. Love the meat and cheese plate and the paella. Tapas and main courses are all great. Live music often!"], ["Mane S.", "Five stars and here is why: The fig salad, fired eggplant, and potatoes was amazing. The setting was so beautiful and perfect. The customer service was great, fast, kind. The price wasn't bad at all. Would I return? Yes"], ["Rachel S.", "Delicious!My family and I went to Cordoba for the first time last week to celebrate my getting a new job. We ordered the following tapas: fried eggplant, the jamon rolled asparagus, the calamari with squid ink sauce, and the octopus. The eggplant was my favorite. It was crispy and light, salty and sweet. The calamari was also some of the best calamari I have ever tasted (and calamari is my Italian husband's favorite thing in the world - so we know our calamari). The squid ink sauce was very unique. Not too salty, well balanced, and with the delightful surprise of tiny bits of pickled cucumber chopped up in it. I never ever would have imagined squid ink and pickle going together, but it was heavenly.The only thing that I thought was less than spectacular with the paella. It was still good, but just not phenomenal. The paella lacked enough saffron, and didn't get very crispy on the bottom of the pan. For the $40 we paid for the seafood paella, I would have much preferred spending it on a few more tapas.Oh, and the Sangria was easily the best Sangria I have ever had."], ["Evelina S.", "Saw this place many times and never went in there to try it out until recently. We went there for dinner and as I walked in I felt in love with the place. Seems like you are having a dinner in your backyard. The inside was cozy and gives you the home feeling. We started with few tapas (appetizer) which were delicious and then the main course which was to die for. The waiters was so sweet, unfortunately I don't recall her name. She helped us with the menu and was so patient with us. Another waiter Artin was very sweet as well, and he made quick check on our table to make sure we got everything. This is a place I will definitely go back, mainly in summer to enjoy that beautiful outdoor space and whenever Spain in playing."], ["Liz S.", "Minus one star only because they ran out of a menu item. Other than that, all around great service and food. The patio is perfect for any solo, group, family (with children) in the day or night. An instant favorite place for its ambiance, Casa Córdoba has a fan in me. Their white sangria is something to talk about and their jamon wrapped asparagus with honey are a must have. I can't wait to go back for flamenco night."], ["Stephanie D.", "Words can not describe how great this place is! Coming in on a Sunday there was plenty of seating, we ordered the White and red Sangria to start both of which were excellent, with the perfect amount of carbonation. Our server was Eduardo, was one of the best parts was fast and attentive his recommendations were great! Appetizers: the bacon wrapped asparagus is a must when coming here! Also the shrimp is very tasty. Entree: we got the caesar salad with shrimp, if I could go back I would probably have gotten the chicken but only because I don't like peeling legs off my shrimp lol. Dessert: vanilla ice-cream with cookies and they pour warm coffee stuff on it... by this time I was too full to really enjoy it lol needless to say, the cookies were delicious! Overall we will be definitely coming back and very glad that we came upon it!"], ["Lucy G.", "Love that this wonderful hidden gem opened up in my neighborhood for all the times I feel the need to be transported to a quaint Spanish village & let the sangrias & beautiful music take me out of the city. Have enjoyed many Girls Night Out evenings here just taking in all the warm Spanish ambiance under the twinkling outdoor lights & night sky. You can't go wrong with their seafood paella, beet & goat cheese salad & red sangria. Wonderful service & live Flamenco show every month. We always call to find out the date first & plan our GNO accordingly. Don't forget to put a flower in your hair & brush up on your dance moves because you just might get called up to show them off at show time! ;)"], ["Ruth K.", "Amazing food, awesome service. Had tomato toast, garlic prawns, queso fundido, paella marinera, along with a glass of sangria and churros for dessert. The meal came with complimentary bread and olives/garlic and literally every dishwas delicious. A really great ambience outside, and there was live Spanish guitar music! Will definitely be back."], ["Terence O.", "The best paella I have ever eaten!!! We had the largest sized paella plate which was enough for all seven of us. The seasoning was delicious. In addition we had several tapas which were ordered and received in waves. The service was impeccable. To finish off we had authentic Spanish churros served hot and fresh with a sensationally rich, thick chocolate sauce for dipping. The churros went marvelously with coffee or latte. The ambience was outstanding. We sat outside in the courtyard with the relaxing sound of the fountain. Spanish music could be heard wafting throughout the restaurant. Afterward we took a moment to survey the Picasso prints on the interior portion of the restaurant and noted the handcrafted Spanish plates that were on display. I highly recommend Casa Cordoba."], ["Lorena S.", "The taste was good but the prices I thought were outrageous.  Thinking about it, they weren't out of this world ingredients that cost a fortune to get.  I had albondiga tapas, croquetas, pimientos alineados,  patatas bravas, eggplant in honey and 2 sangrías (one each for my hubby and I).  These few small portions were a bill of $80.  Just insane!  The plates were tapa size and the only meat we had was the albondiga balls.  I mean c'mon....a few potatoes, tomatoes, eggplant, cheese etc where really all the ingredients we purchased for a whopping  $80.  Expensive lunch if you ask me.  They should lower the lunch menu since they don't have entertainment during lunch. I will not be going back.  My husband is from Andalucia and comparing apples to apples you just feel raped here in LA when it comes to spanish food prices.  It's a joke!"], ["Layla H.", "This is a charming little spot with a beautiful outdoor garden seating area. I went with a friend for dinner on a weekend and there were live Flamenco music and dancers performing. We shared a few tapas plates and everything we ordered was very tasty. Sangria is amazing. A little pricey but you're paying for the ambiance and it's worth it!"], ["Shervin Y.", "Absolutely amazing outdoor patio. The attention to detail and atmosphere and the sangria here alone get the three stars. Upon sitting down, the waiter  brings a complimentary olive medley along with some bread. Unfortunately, the menu here is extremely limited and whatever food we've tried here has been been very disappointing."], ["James L.", "Beautiful Old World European / Southern Spanish restaurant with a beautiful courtyard for outdoor dining.If you ever traveled to Spain, then this place will take you back.  It's absolutely legit.  We went with just tapas, going with a choice of small plates to share.  It became fork hockey towards the end because the food is too good to be polite and leave the last piece on the plate.BOQUERONES Marinated anchovies on toast points with tomato confit, herbed goat cheese arugula and radish.  This came out first. Light bites that tingle the tongue.  Perfect starter as a prelude to the next wave of starters.ALCACHOFA A LA BRASAWhole Grilled artichoke served with lemon/caper aioli (the citrus blend in the aioli is a nice touch).  Easy warm dish before . . . the QUESO FUNDIDO! Idiazabal and Manchego cheese dip with mixed mushrooms, chorizo topped with fried egg.  A really fun, pardon the pun, warm dish as well.  Ask for extra bread, lots of it.  You'll want to soak up all the leftover cheese in the dish.  ALBÓNDIGAS AL ANDALUZ Andalucian style meatballs.  This is a staff favorite at Casa Cordoba.  Not a bad choice for heavy meats mixed in with the lighter bites and an interesting bookend to the Boquerones.BISCOCHO DE ALMENDRA Almond flour cake, tres leches broth topped with lavender-honey ice cream.  I want to emphasize the lavender-honey ice cream.  I want to simply emphasize lavender. The taste of lavender.  Just the lavender alone.  The ice cream is made by a woman in Pasadena.  I must find this woman and blab her genius to all of Yelpdom.  But it might be a JD  Salinger or Bill Watterson kind of genius and she wants to be left alone making her awesome lavender-honey ice cream.MAKE SURE YOU DON\"T MISS the giftshop with handmade ceramics, sangria pitchers, paella pans, glassware, gourmet food items and other specialty products from Spain in Casa Córdoba's giftshop"], ["Rachel S.", "Casa Córdoba is one of my new favorite places to go. The outdoor court yard is so pretty and cozy, especially nice in the evenings. They even put throw blankets on the chairs if you should get chilled. The staff is very friendly, knowledgable and on top of things. The food was is very nice. I really love the olives, bread and olive oil on the table. The jamon iberico is delicious along with their Spanish cheeses. The Spanish wine and cider selection is great. Having gone there a few times now I think I have tried the menu highlights and most everything was yummy. The only thing I wish was different is the Pann con Tomate. They serve the Tomate on think focaccia style bread and I am accustomed to it being served on thin crusty sliced of bread...,perhaps that is just this family recipe. Anyway, I recommend trying Casa Córdoba Oh! And do not skip dessert!!"], ["Anne J.", "The one thing that I was really looking forward to was disappointing the seafood paella. The rice had no seafood flavor and kind of bland and the seafood was just lightly decorated on top. The mussels were so small it barely had no meat. The shrimps were decent size and fresh but only few. The fish was bland with no flavor and tiny. For a 40 dollar dish this is definitely overrated and the portion was so tiny that it shocked both my husband and I since this was for one person's portion not two. I felt like the chef was definitely being skimpy on ingredients so for the price I think it's not worth it. Go for the small dishes since you will get your money worth way better than the paella."], ["Dan H.", "We came here with a large group for Mother's Day and it was a great meal and experience.Their wine list has most of Spain's most popular varietals and regions represented by nice wines. The sangrias - both red and white - are refreshing and wonderful.Our appetizers were great...the patatas bravas were roasted, rather than fried, potatoes, which was really nice. Albondigas Andaluza were a HUGE hit at the table - those disappeared very fast. The tortilla Española was really good.Sopa Andaluza was perfectly spiced and rich with yogurt and saffron rice. My wife and I could make a meal of that with a bottle of Rioja, some bread, and a tapa or two.The mixed green salad with dried figs and jamon serrano was spectacular and went quite well with the paella Casa Córdoba (chicken, duck confit, chorizo).The only complaint anyone had was that the paella was a tad salty. The chicken in it was perfectly cooked and completely delicious - the rice was salty, even for the kids.Without question we'll be back. A lovely restaurant with warmly attentive staff and delicious food."], ["Sarah B.", "I've traveled all through Europe and Casa Cordoba is definitely in the ranks with the best of them.Pretty courtyard tapas/Spanish restaurant.If it's a nice night---sit outside. They had live guitar and singing tonight.Sounded lovely.The seating inside is adequate---perhaps better for people with kids?We were a party of 5 and we ordered many dishes to share.The Gazpacho (or their version of it) was worth coming back here again and again.Bring an antacid for those with delicate tummies."], ["Mimosa K.", "Went there for dinner on Sept. 4, nice ambience like a garden with live band, we sat inside still nice.  However, we ordered seafood rice (paella) and stated the waiting time is 25 minutes, after 25 minutes chicken rice arrived, wrong order! Chicken rice was taken away.  The waiter said he will take care of it and asked us to order something, so we ordered another appetizer.  After 25 minutes seafood rice arrived finally.The bill came both seafood rice and chicken rice were charged, we didn't eat the chicken rice but they billed it.  They are dishonest or what? or want customers to order more?Terrible!  Won't visit again!"], ["Elizabeth C.", "Wonderful service, food, sangria. This place is what I would describe as upscale casual or could be romantic dressy. Great atmosphere. Live music. What could be better?!"]], "Smoke.Oil.Salt": [["Jalop N.", "This place great it really is.  It's one thing to have a 'Spanish' cuisine, but as any Spaniard can tell you, there are multitudes of nationalities in Spain itself.  Among them is one of the largest, but little known here, Valencian.   Valencians are a subgroup of Catalans, but a large part of its identity is its resistance against Catalonian nationalism.  Valencia is where paella and horchata originated. LA, already a laggard nationally in the breadth of its European cuisine (that's not a bad thing!) lands itself a rara avis, Valencian cuisine.I pulled my lonesome to the bar because I really wanted to try the place, and not about to wait to wrangle up a group.  Host was gracious and friendly and didn't make my presence awkward. Like that kind of welcome.  Ordered a glass of Priorat and the delectable canelons de rosa, and I thought this was the best meal I've had in a long time.  Nothing fancy, nothing to burden the server or the cooks so I'm not distracted by pissant commentary on service. Just plainly I KNEW what to eat and how to best enjoy it."], ["Jen G.", "We have a great evening here. First, the service was excellent. Our server was Andre. Probably be best service we've had in a long time. He was just so nice -- he really made you feel at home, and even special. The food was excellent. We liked everything we ordered. It was so good that one person at the table said they wanted to go back tomorrow and order completely different things to try them. We also got on the waitlist for Paella night."], ["Das Y.", "We came here last weekend for my wife's birthday. Nice atmosphere and informative staff. We first ordered the cod croquettes, olives and octopus (which was really). They were all quite good nothing out of this world but had good taste. We then got the Squid ink pasta which also had clams. It was disgusting. The clams were full of sand. It was so off putting it left us feeling really bad about the whole experience.I had heard really good things and was hoping it would blow us away. Hence why I had picked it for a special occasion! But it failed... Badly!!! Won't be going back."], ["Hanna K.", "A friend who was visiting from SF picked the place. She had been to Spain a couple of years ago and armed with recommendations from a friend who lives in Catalan, we went. We opted to eat at the bar despite our reservation- ended up being a good idea because the dining areas are a bit cramped which lends to the places cozy charm but I need my space! As soon as I sat down, Noreen, the sommelier, came over. What a lovely woman! We ordered two glasses of wine and then our adventure began. My friend and i were in paradise. We ended up buying a bottle of the wine we started with. I'd definitely recommend this place- it's great for dates!"], ["Pablo G.", "I'm from Spain and I had never found a spot in LA where you could eat real Spanish food (Jose Andres' Bazaar is great, yeah, but his cuisine explores a different type of cooking, a much more experimental one). Of course there are some places that claim to serve Spanish food, but none of them are designed for people who likes and expects great dishes, but for those who want to play the stereotype of eating paella. I have nothing against it, but since I love eating and I don't like to be teased, I have never gone back to those places. And then I found Smoke.oil.salt, a place where not only do you find paella (really good by the way) but also the type of food you would do in my country. And there is more good news: Chef Perfecto Rocher not only cooks well, but he is one of the most extraordinary chefs in town, which makes this place both a good spot for sentimental people like me and an excellent option for anyone who wants to have a great dinner. I'm a foodie, have been to Smoke.oil.salt. four times and every time was better than the last. Everything tastes great, but here I leave some of my favourites: braves trencades, llonganisses (homemade), bunyols the bacallà, polp a la brasa (actually, the only good octopus I have found in America), carn de vaca vella and carabineros. The desserts are also out of this world. Perfecto takes some of the most traditional Spanish ones and gives them a very interesting twist. Last time I ordered all of them because I simply couldn't pick one.  And if you still want to eat paella, don't hesitate. S.O.S. makes the best Spanish rice I have ever tried. They do paella Sundays, but they're backed up for reservations, not surprisingly :-)"], ["Lisa N.", "Everything was amazing . . . From the Ambience to the food to the perfect little booth by the window that my bf and I were seated at. As if that weren't enough, the owner came by towards the end to ask how everything was. Waitress & hostess were both amazing as well. For the record we had the lamb belly, cuttlefish & fava beans along Wh a bottle of wine which the waitress recommended. This restaurant is a must try if you are in the area & looking to treat your senses in an intimate way !!! Xx"], ["Brenda V.", "So - great environment (music, tables, lighting) setting off great food.  I'm a fan of savory, spicy, delicate and rich - and here I could have it all satisfied. And the wine list: I'm so often disappointed by affordable options, but here even the 'house' red is sophisticated and smooth.  Other options provide even the pickiest connoisseur  with great options. Loved the Octopus and tomato toast -  and tasted delicious tuna and duck. Yes it's elbow pressing and a vibrant - but that's a positive in my book.  And you can spend either moderate or more depending on your appetite and wine assortment!"], ["John-Eric C.", "Similar to many of the other reviews, the food here was excellent, the decor was great, noise was excessive, and the service was extremely lacking.Walking in, the place has an authentic Spanish feel to it that is immediately appealing. After waiting 40 minutes for our table even though we had a reservation, our group was squeezed into a table for four that was unconscionable for our group of five. We would have asked to move, but after 40 minutes we simply couldn't wait any longer.As we began ordering, the noise was clearly an issue as our server spoke over us trying to ask questions and/or speak to her because she simply couldn't hear us. She was clearly as flustered by the crowd as we were, but things finally calmed down once the food arrived.FLORI-COL AMB ALLETS (caramelized cauliflower and broccoli, garlic spicy chili)Well cooked and delicious albeit a bit too much lemon that overpowered the garlic and spicy chili.XARCUTERIA D'IBERICcharcuterie of iberican meats & cheeseWonderful presentation, great selection, and each and every item was tasty.PA AMB TOMACA I LLANGONISSEScatalan tomato toast with house-made red and white sausagesOne of the best plates of the night. The tomatoes were so fresh they might have been fresh off of the vine. The sausages were well cooked and a good addition.BRAVES TRENCADESfried potatoes, serrano ham, chorizo, fried eggDefinitely a must get for any dinner. Everything you want and more and the chorizo pushes it over the edge (in the best way).CARN DE VACA VELLAwood-fire grilled dry-aged NY skirt steak, potatoes, piquillo pureePerfectly cooked meat and very tender, the piquillo puree adds a great touch of heat to the dish and I wanted to spread it on everything at the table!There was a shrimp dish that I couldn't find on their menu that was some of the best shrimp I've ever had. My mouth is watering as I type this... the ONLY bad thing about this dish is you only get two, and trust me, two is not enough.As the meal finished we ordered flan to share which was good, and ordered coffees for the table. Our server forgot the four coffees, brought the dessert and the check. We reminded her about the coffees as we paid and she gave them to us on the house. Nice of her, but it would have been nicer to get them with our dessert.OverallFood - 4.5Service - 2"], ["Jen G.", "This was an outstanding dining experience. Met with a couple friends for paella night yesterday and had a wonderful evening. The food was remarkable--both elegant and engaging, the wine list well-curated, the service warm and attentive, fantastic music, with Chef Rocher as charming as ever. I will definitely be back and am excited to try the weekday menu in the next couple of weeks. This is what the communal dining experience is all about.Well done, smoke.oil.salt."], ["Chris B.", "Delicious! Fully enjoyed dining here. The moment you enter, your senses are fully exercised. The menu is delicious. I am very excited to return and try the other half of the menu. The wine list offers an option for the lightest of winos to the more experienced and compliment nicely with your meal. A reservation is encouraged, however I sat at the bar not having a reservation and had an amazing experience with a great wait staff. This is a local fav!"], ["Armenoid B.", "Are you kidding me yelpers?!?!  I think i'm done with you lot.  I keep being told that you (in aggregate) don't review restaurants accurately. I can't believe how good our dinner was. and just blocks from home..   it's pricey, that'd be the only downside for me.."], ["Christine S.", "We had a great time with some amazing wine choices from our very own sommelier! I've been here twice and each time our choices excite my senses! Their seafood dishes are amazing and sexy! I love the ambiance of the place with cool Photographs of the artist Dali... The squid ink dish was awesome and their desserts are great, too! Donuts!!"], ["David F.", "Food was amazing. Service was great - they are almost too present; you never have an empty glass of water, for even a second. We arrived early, and were told that we could hang out at the two empty chairs at the bar while we waited for the other two in our party to arrive. A gentleman, who I took to be the owner, quickly stepped up to offer us wine, water, etc. He was very friendly and chatty, told us about how he had tried 800 wines while determining the final list, etc. I settled on a 2013 Grenache blend of some sort that was really great. Our server was friendly. He didn't push any particular dish - the menu apparently changes frequently, so there is no \"go to\" dish. We bounced some ideas and restrictions off of him and he helped us confirm a few of our selections as good choices based on that input.The only potential gripe is that it's a bit cramped; tables are very close together. But, it's a small space and they have to turn tables to stay in business, so the more the merrier. If elbow room is a requirement for you, you might not be thrilled with that aspect of this place. Otherwise, this is one of the better places I've eaten at in LA."], ["Elizabeth H.", "4.5 for food, 2.5 for service. I have a special affinity for tapas and Spanish cuisine. And honestly, all the food here was quite good. The tomato toast, cod croquetas, and caramelized cauliflower and broccoli were all delicious and beautifully presented. The richest dish of the evening was the braves trencades, an unworldly mashup of roasted potatoes, serrano ham, and chorizo, with a fried egg on top for good measure. We also ordered the grilled quail, which was good but hard to share - such a little bird!As good as the food was, the service was not great. We found the wait staff to be a bit pretentious. I briefly lived in Basque country in Spain and always get excited to find Txacolina on a wine list. The waitress poured our bottle into an aerator carafe, \"as they do in Spain.\" She then lifted the carafe above her head to pour the wine in a long, steady stream into our glasses - which were still on the table. Every time she came over to pour a little more, the wine spattered - on the table, on us, etc. I had seen this technique before, but they took your glass OFF the table when attempting this elaborate pouring technique. Our waitress also gave excessive, elaborate descriptions and her opinions on every dish on the menu without us asking any questions about a single dish. Also, seriously, what is with the high table trend?? This is a nice date spot - who wants to shimmy into a bar chair and eat at a highboy table while they're in a dress and heels? I'm not at a bar. Stop it with the high tables. But the food is really good, so give it a try."], ["Julia V.", "We will not be rushing back  !overpriced for small portion of paella ..smoking smelling environment"], ["Dorothy Y.", "Authentic Spanish Tapas, from Jamon Iberico to Valencia callos, squid with black ink, duck liver, matrimonio (tomato, Spanish almonds), cab"], ["Davy K.", "My stomach literally hurt after leaving this place.  The food was very average, nothing special at all.  It was definitely over-priced for average, bland food.  The beet salad had very little beets and was nothing special.  The tuna was OK.  The prawns were flavorless and not worth $26 for only 2 prawns!  The flan dessert was tasteless and the topping was super bitter.  Don't waste your time."], ["Bonnie G.", "I'm so happy that I was able to dine here before they officially open (whenever that is). When you walk in, you're olfactory system will go into overdrive! The smokiness of the wood will carry over into each dish you sample, which creates a nice continuity throughout the menu. Overall, we had the most amazing service (gracias, Alex!) and food I that totally surpassed any expectations I had. Forgive my translations in English and Spanish. I don't speak valencià. :)Roasted broccoli and cauliflower: amazing.Beet salad: greatScallops: Can I have....oh...I don't know...like FIFTY more?Pulpo (octopus): deliciously smoky and tenderTortilla de alcachofa (artichoke omelette): amazing last minute surprisePan con tomate: tasted like Spain. I would recommend starting with this!I predict that this place will be a huge hit. They were out of the sea urchin flan and the sea bass so there are just two reasons for me to make the trek up to Melrose again very, very soon. If you want authentic Spanish food (none of this Cafe Sevilla crap), go here. Liberate your taste buds. Take it all in, one dish at a time. And make sure to have a nice bottle of Spanish red as an accompaniment. !Viva Espana!"], ["Douglas E.", "Spouse LOVES paella, so family members gave us a gift certificate to eat here - great gift!  Accompanied by a copy of the 7/18/2014 LA Times rave review.  Tight room - no space between tables.  Loud room - brick walls (that look beautiful).Our server, Christine, was perfect - just attentive enough without hovering.  She explained the few things we needed explained.  Prix fixe menu Sunday night is now $49.A man I believe to be a co-owner walked around greeting guests, including us - nice touch.That we were \"warned\" (my word) about all dishes hitting the table at about the same time didn't make it OK.  By the time we got to our paella, it was only warm.And undercooked.  That LA Times review said that the chef \"values chewiness over dreamy softness...and anything over soupiness.\"  I have to assume he took the night off and left someone else in charge.  The paella lacked even a hint of Soccarat on the bottom and was quite wet.  It was also much too salty for our tastes."], ["Ira W.", "We would actually give this place 0 stars if we could. We were refused service here when we came with our small, registered service dog...first we were told there would be an hour's wait although there were several empty tables...then the manager (not the hostess) told us point blank that she could not accommodate us in a very rude, nasty and totally unprofessional manner....She was also in violation of the ADA act that permits service animals in eating establishments...we are filing a complaint with the Justice Department over this!"]], "Bäco Mercat": [["Zach G.", "Came here on a Sunday for a 2-person dinner and the place was busy. Our order: boquerones (sardines), oxtail hash sandiwich, hamachi crudo, blistered okra, pork belly ravioli. If I had to recommend only one, I'd select the hamachi crudo, but everything, and I mean everything was great. When that happens, I have to give the place 5 stars. Food absolutely trumps ambiance when I review a place, but Baco has a clean, modern feel. The prices aren't ridiculous and unlike some other reviewers, I didn't at all detect a pretentious vibe. Serve me Baco's food in a hut on the east-side and I'd still be giving a rave review."], ["J M.", "I had the fava fritter and the Brussels sprout Caesar salad. Both were quite good. Nice ambiance right  in the heart of DTLA. I sat at the bar by myself and thought the bartender would be extra attentive or personable but I didn't get much of that from him."], ["Kate B.", "YUMMY IN MY TUMMY!!! THE ORIGINAL BACO IS SOOOOOO GOOOD!I went to Baco Mercat today for the first time for lunch and the place was packed! I can see a lot of people that work in the area would go there for lunch. I had the Original Baco and my boyfriend got the Bondiga flatbread (3 cheese, smoked jalapeno, and lamb). I LOVED the Baco!! I don't know how to describe it but it is like a big flatbread taco. THE BEEF AND PORK chunks inside were cooked to perfection and the sauce was soooooo amazing. Each bite was a bite of heaven. One thing is that the baco is a little hard to eat. You have to make a decision to whether grab it with your hands or be classy and cut it into chunks and pick it up with a fork. I think picking it up with your hands is a better way to hold everything together and more enjoyable. :) I want another Baco already!!!"], ["Arika S.", "Great dinner in downtown LA - loved the olives, ceasar brussels, mushroom flatbread and ravioli. All were amazing!!Would def go back here next time I'm in LA. Cool vibe - smaller restaurant though so I'd be sure to get reservations!"], ["Jennie C.", "This place was amazing! I made a reservation online and they called me the day of to confirm. I wasn't really sure what I wanted to drink but did want to try the anejo so our server suggested he make me an old fashion with bitters and lime juice and it was really good to sip on. For food, we got the Brussels sprouts which has Caesar in it so it was like Brussels sprouts and a Caesar salad combined! We also had the hamachi crudo and shared the mushrooms pizza with pork belly sausage added to it which was so necessary! The ambience of the place was great and the staff is super nice!"], ["Jon W.", "Almost perfect!Baco Mercat is an original, tasty little place. Wife and I started off with the pear and snap pea salad, followed by an original and toron baco. All three were excellent. The salad was light and crisp, with nice hints of dill and rosemary backed up by a healthy dollop of burrata. The bacos were both excellent, with the toron winning out slightly. If the crispy beef and pork belly on the original baco was just a little bit more moist, we would be hard pressed to decide which one was better.Service was also on point, although they were quite strict about their seating. We came early and landed a patio spot, but I'm sure it can frustrating for walk-ins who come later in the day, say past 7pm. Lastly, the after dinner coffee was some of the best I've ever had. They don't have espresso, but they brew a mean batch of Stumptown- not bitter in the slightest, with slight floral notes. Better than what I've had at Stumptown itself!The only bummer was the parking. We got a metered spot right in front, but the darn thing was $6 an hour! Should have valeted the Chinese Recreational-Vehicle."], ["Stephanie C.", "Oh my squash blossoms, how I love Bäco Mercat! At first calling to Catalan roots, a quick glance over the menu shows that the restaurant's dishes draw from European, Eastern, Asian, and Latin American influences.The signature bäco was created by Chef Centeno, and is a kind of flat bread sandwich with a variety of fillings. I tried the fava fritter bäco and enjoyed every bit of it. The bread was warm, soft and chewy (reminiscent of pita), perfect to carry the fritters and salmorejo spread. Vegetarian or otherwise, the bäco is a must-try if you're dining at Mercat.Other dishes include the coca (their flat bread version of pizza) and a variety of smaller plates, including several vegetable-based dishes.They treat vegetables beautifully here; my favorite so far is the eggplant salad, which is brightly dressed and sprinkled with feta. And of course, the squash blossom appetizer - fried and stuffed for a creamy crunchy bite of eggplant, ricotta, and garbanzo.And if you're looking to end on a sweet note- the caramelized upside down cake is moist and fruity while the acidity keeps the sweetness to an suitable level. The service was excellent both times I visited - friendly, helpful, and ready to give suggestions based on your price range and the kind of meal you're looking for. I find this particularly important because some of the ingredients may be unfamiliar to diners, and it's always more pleasant to ask questions to an approachable, helpful server. It's a small establishment, so reservations are recommended - I've sat both inside and outside. I loved the hedge surrounding the outdoor seating - it helps you forget you're in the middle of busy downtown and encourages you to imagine yourself dining in the rustic Spanish countryside. I left impressed after my visit; I left impressed and appreciative upon my second. Bäco Mercat contributes significantly to LA's foodscape, and will hopefully remain a jewel for years to come."], ["Katy D.", "My friend and I ate dinner here after a day spent at the new Broad museum. I will start with the outstanding: the Coca Carne Picada was amazing. I haven't tasted anything this good in quite awhile. Beef, yams, peanuts and goat cheese were such a great combination. It was an explosion of different flavors and textures. Loved it, loved it!  Our waitress was also great, very nice and efficient. Now, for the not quite as good: The Soca Corn Cake was decent, but just didn't taste as good as the Coca Carne Picada. It was lacking a little bit of flavor.I would come back to try out more food. Maybe another museum day is in order soon."], ["Andrea H.", "I've been here for dinner in the past but more recently for lunch. The menu is more limited than dinner but there are many choices to choose from. Even with the restaurant not at capacity, the noise level and aggro music can be deafening. Our server disappeared after the beverage order but we lucked out by having someone who was quite helpful in giving us some good suggestions. The original bacö \"sandwich\" was quite good. The beef carnitas was well seasoned but the pork belly on its own had no seasoning at all. The salbitxada spread ties the meats and flavors together along with the red onion and mixed greens. A very filling sandwich.The Salty Jowl Cocoa is just that. SALTY. The cured meat is just doused in salt and add that in with the Taleggio cheese, you have a very salty flatbread pizza. The egg definitely helps level the saltiness but I may have sodium poisoning. The check was given to us before the dessert menu was even offered so will have to try dessert another time."], ["Samantha C.", "Josef Centeno has outdone himself with his creative dishes, but at the end of the night, did they blow me away? Unfortunately no. Came around 630 on a Saturday and waited 20 minutes which is super reasonable since all reservations were booked until 9. Make sure you make a reservation because all inside seating is for reservations and we sat outside in the 40 degree weather. SoCal, It's illegal to be that cold.Baco (sandwiches)\"the toron\" (14) -  oxtail hash, cheddar tater, horseradish-yogurt Oxtail was incredibly tender! Hashbrown added a nice crunch. Overall, pretty damn good.yelp.com/biz_photos/bäco…\"el pesco\" (12) - crispy shrimp, sriracha, chive dressing Spicy!! Sirarcha hits you and shrimp is nicely done.yelp.com/biz_photos/bäco…Coca (flatbread)\"double mushroom\" (14) - shitake, crimini, fontina, chili flakes Mushroom on mushroom on mushroom. I was on a mushroom high. A bit overwhelming for me.yelp.com/biz_photos/bäco…Vegetables \"caesar\" brussels sprouts (11) - pecorino, anchovy, garlic Love brussel sprouts, love caesar dressing, so what could go wrong? Super garlicky and delicious!! I would order this again. yelp.com/biz_photos/bäco…patatas bravas & pickles (10) - crispy potato, egg, smoked paprika Potatoes and pickles smothered in cheese. Real comfort food right here. yelp.com/biz_photos/bäco…Meathand torn pasta w/ pork belly sugo (19) - kale, soujouk, pine nuts, raisinsFavorite dish of the night!! The sauce was sweet yet had a spicy kick to it. The pork belly was flavorful. So good. yelp.com/biz_photos/bäco…Unfortunately, later that night, my stomach started to hurt a bit. Not too serious, but enough pain to wake me up in the middle of night. I asked my friend if she had a stomach pains too the next day and she confirmed she did. Maybe the food wasn't fresh that day? Disappointed."], ["Linda S.", "The menus didn't have much focus and I feel I need to go again to try some different items. I also found this place a bit pricey. Nothing memorable."], ["Su L.", "I don't really like sandwiches but we were told this place is known for good sandwiches, among other things (e.g. tapas). So we ordered \"The Original\" (with pork belly and beef) and the sandwich with oxtail hash (forgot the actual name). First of all, the names already look/sound delicious. Second of all, they tasted even better! The Original was made with a red sauce mixed with probably almonds. I know pork belly sounds fatty but it's not! The sauce gave the sandwich a light, healthy feel plus the pork belly pieces were slightly crispy on the surface so you won't feel greasy at all. The oxtail one has ground oxtail in it along with arugula and white sauce, which is more delicate in a way but at the same time quite tasty. By the way, the pita bread was the key for me (a sandwich hater generally). Such good bread! We also order dessert: hazelnut chocolate cream and pineapple upside down cake. You'll like the first if you like creamy, soft dessert. Pineapple cake was simply wonderful and seems to be the most popular dessert on the menu."], ["Shilpa D.", "Went here last night and had a great meal with my friend.  We split three dishes and each had a cocktail and the bill was $40/each.  On the higher end, but worth it.We couldn't find a cocktail we loved so we told the bartender what we were looking for and he made us two delicious and creative drinks.  I always appreciate a mixologist with skills that takes pride in their work - and I love a delicious spicy tequila cocktail!We had the Caesar Brussels sprout salad which was unique and fresh and flavorful with some fresh Parmesan.  Then we had the caramelized cauliflower which was also great.  Not too spicy or seasoned but cooked just right.  And lastly, and bestly ;) , we had the El Pesco baco which is a shrimp sandwich with cabbage and sriracha and fried shrimp (I could swear there was also a thin filet of fish in there as well).  And the bread was a delicious, thin, lightly buttery naan-style wrap.  This was so good.Service was great, ambiance was great, food was great, drinks were great - this would be a great date spot too.  Oh, and get my fav chocolate chip cupcake in LA, Big Man Bakes, from across the street (open till midnight!) for dessert."], ["Jiwon S.", "Awesome spot in downtown. The crowd and the wait? Not so much... But the food is so delicious! Went with a group of friends and ordered a bunch of dishes. My favorite was the ricotta fritters, the beef tongue schnitzel, and the carne picada. Next time I'm going to order delivery through RushOrder app because I don't think I can wait that long again. You can use the 'hungry3' code for $3 off"], ["Sarita M.", "Try the Baco!Hip, trendy and chic restaurant in DTLA :) I enjoyed the Spanish inspired menu and the creativity of the chef.  With so many new restaurants opening up in downtown Los Angeles, Baco Mercat is definitely one worth visiting. It has a relaxed, yet chic vibe.  Service was great too!"], ["Christianne F.", "One of my favorite restaurants in DTLA. Small and intimate without being too pretentious.  A little pricey but worth the splurge.  3 of us came for lunch and chose to sit outside where we were seated right away.   Waiter was attentive without hovering.  Dishes are served tapas style which allows you to order and try many dishes. I love variety!  Many items but deciding which to order can be overwhelming since you want to try it ALL.The flavors are bold and explosive, rich, deep and loud.Crispy Sunchokes $14:  first time tasting sunchokes and they were amazing.  Each crispy starchy bite covered with dressing.Caesar Brussels sprouts salad $11:  crispy, light, and airy croutons crumbled over the fresh bed of shredded brussels.Hoja Verde Coca flatbread $15:  Woa.  The sauce on this kicks ass.  Made with Harissa (yum!!), tomato, and just a spicy party in your mouth.  A veggie flatbread.Salty Jowel $17 .  Salty is right. I love cheese but damn that taleggio was very potent. Fried egg on top.The Original Baco $13.  Don't let the size fool you.  This packs a punch.  With thick juicy cut of pork belly, carnitas and a smoky sauce, I kept wanting more.Pineapple Upside Down cake.  A perfect way to end a meal. Definitely wiped away the traces of that taleggio cheese.  Wash it all down with some wine (ask the server for suggestions on wine pairing) or try their house made soda.  Damn, I just made myself hungry."], ["Lisa K.", "Flatbread sandwiches. Sounds really simple but they have some damn good flatbread sandwiches. So good in fact that I will occasionally day dream about these sandwiches.We had The Toron & Beef Tongue Schnitzel - both amazing."], ["Daniel M.", "This is easily one of the best restaurants that I've been to in  all of LA (and being such a food city, that's no small statement) The restaurant is in the heart of downtown & it's (deservedly) very popular, so trying to find parking will be an adventure in of itself. They do have valet, for a cost) Furthermore, it's a good idea to make a reservation if you can. The vibe if the restaurant is busy, energetic, loud, & dimly lit. It's very trendy. When it's dinner, it's especially crowded & can feel a little cramped.The food is a unique fusion with Spanish, French, & American influences. Most of the menu is food you'll be hard pressed to find anywhere else. Let me walk you through my 3 course meal: Drink: MOXIE: This cocktail was solid, but nothing special. It has a little kick too it & some citrus hints.1. RICOTTA FRITTERS: These were warm, soft, & creamy. Their savory flavor is complimented nicely with honey, in a subtle fashion. 2. THE ORIGINAL BACO SANDWICH: This was incredible. One of the best sandwiches I've ever had. The meat isn't too tender nor too tough. And the add plenty of meat. They aren't stingy. The salvitxada sauce was amazing & made the flavor pop. I'd never heard of it before, which is a shame, because it's life changing.3. PISTACHIO CHEESECAKE: This was intriguing to me because I've never come across this flavor of cheesecake. The texture was creamy, but firm. The taste is very nutty & authentic to pistachio. My friend ordered the Yogurt Panna Cotta, which I tasted, & was also great. It's light & creamy. I would definitely recommend.Overall, this restaurant is a must for everyone who comes to LA, tourists & natives alike. My friend & I had a full 3 course meal in under an hour. It was that good. I will definitely be back."], ["Briana V.", "I came here a while ago and now just getting to a review. For four us us with drinks the total wasn't too bad at around $130 after tip. We ordered something from almost each section of the menu and it was all delicious! even the vegetarian dishes I woudn't think I would like like the squash blossoms or spring time flatbread (no longer on the menu it looks like)What we ordered-Ricotta Fritters- lightly sweet and perfect little bites-some type of coca that is no longer on the menu. It had peas on it and was vegetarian. It was ok but not the best thing I had there-Beet Salad- no longer on the menu and I hated it but I am not a fan of beets-The orginal Baco - loved this-Polenta (no longer on the menu) my favorite item of the night!-Squash blossoms - they were pretty good too but don't know if it would be a go to next time.I love bar ama and would definitely come back to baco again."], ["Janis Rebecca A.", "A delicious and unique meal, a nice environment, probably will come back sometime in the future. I came in a party of two for my boyfriend's birthday, we ordered 1) an Original Baco (pork, beef carnitas, salbitxada, some kind of arugula (i believe), sauce on a warm flat bread)2) the El Pesco Baco (crispy fried shrimp, sriracha, chive dressing, some other fix ins, on a warm flat bread) 3) the Bondiga Coca (A basic flat bread \"pizza\" sort of dish, 3 cheese, lamb, smoked jalepeno, read sauce, other fix ins) We decided to sit outside because we're not too into the whole Downtown LA tight indoor dark seating scene, the seats/tables were still quite small but it was lovely and bearable. The servers were very friendly and great with suggestions, but it was a bit hard to capture their attention in the start and in the end, probably because we were sitting outside and the place started to become packed for it's dinner rush. So why 4 stars? The food was great and something a bit different. I really did enjoy every bite of my meal. BUT it's nothing I would go ahead and give 5 stars to. Perhaps if I ever go back to try different dishes I'll change my mind :) Man, I wish Yelp had a a 4 1/2 star option! Regardless, the food was filling and delicious. If you're in DTLA looking for a nice sit down restaurant for your next date night, stop by Bäco Mercat your next visit!MORE PHOTOS ON MY BLOG janisrebeccaahn.blogspot…"], ["Amanda H.", "I found this on LA Weekly's top restaurants to eat downtown LA and then again as a highly rated yelp spot. Luckily I managed to snag a last minute reservation for two people at 6:30pm (Sunday)  because this place was an amazing find. The service was really attentive. The busboys (?) always had water at hand and the waitress gave us the right amount of attention. With her recommendation we ordered two entrees to share between two people: the Lamb Riblets and the Toron sandwich. Out of the two I would have to say that the lamb was my favorite. The lamb had so many complex flavors that just melted into your mouth. The outside was crisp and the inside was so soft and tender; the meat just slid right off the bone. Moreover, the lamb was paired with some cucumbers and refreshing lentils (with some grapes for a sweet touch) which allowed you to take a break from the rich flavor of the lamb. The flavors complemented each other and made for a delicious dining experienceThe Toron sandwich seemed to also be really popular based on the number of yelp reviews. Its flavor was complete different from the lamb which i found refreshing because too much of the lamb can get rich. It was like an upgraded burger but on a flour tortilla (definitely could be wrong about that). The horseradish yogurt really tied the entire experience together. Also a very memorable dish. Sadly, those were the only two dishes we could try for this visit. But it is definitely worth to try if you are in the LA area. The food is a beautiful fusion between Spanish (more emphasis really) and French. The flavors are complex, but blend really well. We were not disappointed about our experience from the moment we stepped through the door. Really well done."], ["Jeff B.", "A great tapas spot, where you order small bites of many items and share. Everything we ordered was tasty and exceeded our expectations. Octopus, squid, okra, you name it, all the items were delicious.Very inventive drinks rounded or the evening. A great spot in downtown."], ["HOUMAN A.", "After receiving the 4plus star average facade rating I thought best to take my first date to this establishment on a Sat night.Let me say from the moment I walked in this establishment I was greeted by homeless gentleman off the streets of downtown LA then again female who I identified herself as the hostess.  I'm not on yelp to give my personal opinion but rather of an establishment attempting to present themselves with dignity.  Let's start with a properly dressed hostess who welcomes her guest with a smile.We ordered brussel sprout salad ahi tuna and pizza.  Food was served timely and hot.  Not a big fan of gastro pub beer selection.  But our server was very kind and helpful.  Hence 2 stars otherwise, I would have posted a negative had it not been for him. I WOULD NOT RETURN...."], ["Joyce C.", "Delicious! Came here based on recommendations from locals and here's what we got. Definitely enough for 4 to share:Roasted Eggplant 5/5 - my favorite dish of all; slightly sweetPeaches and Goat Cheese 5/5 - nice balance of sweet with creamyCaesar Brussels Sprouts 5/5 - like Caesar salad but with sprouts and anchovyHamachi Crudo 4/5 - served with hash brownSoft Shell Baco 5/5 - soft shell crab sandwich Toron Baco 4/5 - oxtail sandwichBazole Soup 5/5 - asianesque broth soup with pork and beef carnita, enoki mushroom, and noodlesBlackberry Mint Shrub 5/5 - their vinegar based soda that is sweet and sourService was fabulous as we had made reservations. You really can't go wrong with anything you get here - highly highly recommend!!!"], ["Julie H.", "I have been meaning to check out Baco Mercat for a while now and am so glad I finally got to try it for the perfect occasion. One of my best friends and I were looking for a good Sunday night meal in LA to share while we exchanged our Christmas gifts. Baco Mercat was perfect for such an occasion. Setting: It's small and intimate. I would recommend sitting outside if you're up for it. The outdoor seating area may look small and close-knit, but it has heaters and vines that encage it from the busy sidewalk just outside of the dining area. It's a cool experience because from atop you can still see the pretty LA street Christmas lights while not necessarily haven't to be a part of the hustle and bustle of the city.Service: Perfection. Our waitress attended to us within 5 minutes of us taking our seats. She had a very cute and witty personality and explained the menu for us with enthusiasm and contagious energy. I often felt as though we had about a handful of servers all to ourselves. Any time we finished a plate or were even halfway through with our water glasses someone walking by would notice immediately and clear our plates and refill our waters. We received food recommendations from multiple servers who each took their time to explain their favorites in detail. It was really a joint effort and we definitely appreciated it! Drinks: We ordered the eggnog and the tequila mockingbird. The drinks were pretty small but I definitely enjoyed by eggnog! It was mixed with cinnamon and bourbon. My friend described the tequila mockingbird as tasting like Fanta. Could be good if that's what you're into. Food: The menu was a bit overwhelming. We consider ourselves to be pretty knowledgeable about food but we found ourselves having to quickly google many of the items on the menu. This wasn't necessarily a bad thing. It made for a fun, new experience. This is definitely a place where you want to share plates. It's mostly tapas style. We each had an appetizer of our own, a shared appetizer, a main dish each and a dessert to share. Our waitress recommended we order a few dishes to share and this all turned out to be the perfect amount of food for us. Lace-battered squash blossoms: So good! They had a creamy filling which complemented the crunchy outer layer of batter well. Mangalitsa and apricot: You really can't go wrong with the combination of apricot and cured meat. The bread it was served over was thin and equally crispy and soft. The shredded pieces of cheese on top added to the savory flavor of the meat and paired well with the sweet apricot.Pork belly sugo ravioli: I was warned that they would be spicy and spicy they were. Perfectly so! The sauce tasted like a spicy curry and the pine nuts and golden raisins gave it a sweet kick every now and then. Really good. The fava fritter baco: The pita bread was amazing in itself. It was fluffier than most pitas I've had and the chickpea and salmorejo mix was very good. Patatas bravas: This dish stuck out to me the most. I was a bit skeptical about the combination of pickles and potatoes but it turned out to be amazing. The dish included shredded parmesan and a creamy cheesy sauce that enhanced the flavor of the earthy potatoes. The sweet pickles provided a deliciously sweet contrast to the more salty flavor of the potatoes as well. Caramel upside down cake: The cake comes with a whole slice of pineapple on top with caramel drizzle and a side of whipped cream and ice cream. Both dense and moist!  When our bill arrived we both decided that Baco Mercat is more of a special occasion/treat yourself sort of place. It's not cheap, but it's delicious and the ambience is cozy and the service is outstanding. So glad I finally visited!"], ["Sue F.", "We had the following:-squash blossoms (****)-double mushroom coca (*****)-toton (*****)-caramelized cauliflower (*****)-Caesar brussels sprouts (*****)-hamachi crudo (*****)-caramel pineapple cake (***)We made a reservation for opening time of 530 and by 6pm, they were packed! Not cheap and not low calorie, but OMG, the food was wonderful and the service terrific. Our water glasses were always filled and all of the servers were very attentive. Even though I gave the dessert 3 stars, I do not think you can have a bad meal here. (BTW - the yogurt panna cotta was recommended by the waiter and I wish we had gone with that).I would absolutely come back here again. It is tapas style, so this is a fun place with lots of people to try lots of different things. This place is a can't miss!"], ["Jenna U.", "If I could give 10 stars... I would.Let me start with I am not a DTLA fan nor am I a Mediterranean food fan, but I was going out to eat with co-workers and everyone was excited to try Baco, so I didn't want to be the party pooper, so I put on my big girl pants and figured there must be a chicken dish I'll like. Boy was I happily surprised....Baco was amazing from the moment we stepped in and was greeted with a smile and a table ready for us! Our server was great and super informative of all the dishes. We started with drinks (obvs) and I had the ginger smash and it was everything and more. It was delish but different with a perfect twist, I had two and wish I could have it again!Then my team and I split various tapas. We had roasted japanese eggplant, caramelized cauliflower, caesar brussel sprouts, endive & citrus salad, quail, chicken ribs, and lamb riblets. While I was not thrilled with Mediterranaen, I will try everything at least once and I am so happy I did because I am now in love with the food group and Baco. My favorite dish was definitely the brussel sprouts. I am so sad my new fav dish is on the west (and wrong) coast, my next trip to LA will have Baco incorporated into the itinerary."], ["Justino C.", "Geeeeeez ---Amazing little joint in DTLA. I never thought this place would blow up the way it has. Much respect to the owner and team that has developed the palates of Angeleno's from all walks of life. Honestly, no joke...ANYTHING you get here is going to knock your socks off!!!Any of the vegetables, meats, fishes, beefs...oh and OF COURSE...the BACOs!Not much of a drinker but they do have a full bar with some great mixologists. (So I've been told.)For the ever so \"nazi\"... I've brought Japanese foodies here who are very particular of the culinary arts and they've been blown away every time. Especially from the fish dishes~ (that may or may not mean anything to you but it does to me!) In fact, my mouth is watering just thinking about it!!! You're probably going to want to make reservations wed - sat bc it gets packed!"], ["Dawn W.", "What can I say this place was to die for. Here's what we had for a table of 6 people:Main meal- cauliflower - Brussels sprouts - ricotta fritters (doubled up)- bacon wrapped half hen- quail- soft taco w/ crab- oxtail- squid- double mushroom flat bread - peaches with goats cheese- patatas Braves- yellowtailI literally think I am missing a couple of dishes as I can't remember it all but we tried what felt like almost everything on a wonderfully different menuDesserts- pistachio cheesecake- caramel upside down cake- baked semolinaHands down the ricotta fritters, Brussels sprouts and peaches with goat cheese are a must have. The meat dishes are the biggest let down, on an otherwise inventive and quirky menu. Not only are they small (like bite size) but they are pricey for what you get. $24 for a bacon wrapped \"half\" hen which turned out to be just a chicken leg that was overly sweet? Get real. What happened to the rest of the hen?!Luckily it was a meal that was paid for by work. So I am not complaining too much ;-) but it's best going in a group as you really can sample everything as long as you're a little adventurous. $70 per person including drinks and a tip. The Spanish fusion I feel really comes from the sharing concept of the dishes served as \"tapas.\" Not particularly Spanish inspired food but really good nonetheless."], ["Peter I.", "This is one of those downtown spots that have me saying to myself....\"am I cool enough to eat here?\" We went on the night of the demonstrations downtown and it was a mess so we ended up very late for our reservation. The person at the front desk did not care a bit. In fact was so rude we almost left, but we had theatre seats less than an hour later. So we finally got a seat and ate fast. We had a few of the specials bacos...the slayer being our overall favorite. All kinds of great meat inside and an egg on top. Delicious. Also had the shrimp and the original. Those were OK, but would try them again. Very interesting food. The space is downtown hip and has a beautiful bar. Easy parking. The food and the management is the reason for the 4 stars, they rallied to get us seated and fed. Hooray for them. For the hostess with the least-est....1 star."], ["Jeff M.", "Really good. Good beer and wine menu and the food was really tasty. We had the Caesar Brussel sprout salad and the double mushroom flatbread with 2 beers. A bit pricey but so damn good."], ["Paula C.", "I love downtown LA...it's edgy so there's lots of new creative restaurants opening up. This is tapas style and fantastic. Only one I'd pass on is risotto fritters, otherwise all was yummy, esp the lamb! This place has a casual, old Euro cafe feel; I like it!"], ["John W.", "Baco Mercat was a fascinating little experience that kinda feels a little all over the place (with not all the dishes exactly working) but a lot of delicious flavors to be had.  Parking-wise, there is valet right next door (about $5 when we were there) or some limited street parking or attempting to find parking in nearby lots.  Service was really nice and helpful in trying to explain the dishes to us and accommodating when a bug fell in my friend's drink.  We went in around a Sunday brunch time with seating not too hard to find.  We were seating outside near the patio which had a nice vibe with the lights up above.  I ordered a bloody mary (not too bad) while my friend had one of their custom ginger soda pops which my friend adored.  Food-wise, we shared several plates.  Their specialties include interesting sandwiches called the baco and flatbreads among their other smaller entrees.  We got the following:-za'atar  &  eggplant: Not a bad dish - reminded us of a nice mezze dish-Crispy Sunchoke: A strange dish - the flavors were pretty good although the sunchoke took a little bit of getting used to-Hamachi Crudo: A pretty simple dish although the flavors were solid-Caramelized Cauliflower: It was okay - wish there was a bit more of flavor in this one-Blue Crab Baco: It was a special for the day and was quite larger than we were expecting.  Not a bad dish with a lot going on although it was a little difficult to eat.  All-in-all, I'm not quite sure if Baco Mercat impressed completely with all the dishes but the dishes that were good were solid and the service/decor made it an interesting little stop for those looking for a fun brunch area."], ["Alan T.", "This review is just for brunch. Came here with a few of my cousins, just to talk and catch up with one another. Eating brunch here is just not worth it. You can pretty much make a better breakfast at home than have breakfast here. I also did not like the seats here for the tables. Some of the stools are either too high or too low. I had to switch out a stool just so that I wasn't too tall for my table. I would have given this place an overall three star but I took off one more because we were over charged about $40  on our check for alcoholic beverages that we did not order.Onto the food:Buttermilk biscuit w/ egg & gravy - The name of it pretty much explains what you get. presentation looked nice, but the taste was just okay. Could use a little more gravy.All three sides, which is pork belly bacon sausage, fried potatoes and scambled eggs. Nothing special at all with any of these three items. Parking- There is a parking structure right across the street that you will have to pay for. Next to it is big mans bake"], ["Johnny B.", "Delicious!!!  There are so many amazing appetizers and starters we didn't really need the sandwiches and flatbread we ordered.  The Ricotta Fritters were perfect with a touch of honey on them.  We could have eaten the Battered Squash Blossoms as our main course.  The sauce was so good we were practically licking the plate!  It was a kind of Romesco sauce.  I noticed that most of the pictures of the Squash Blossoms don't have the Romesco sauce.  Maybe it's new?  Hopefully they keep it.  It was delicious!  The Shishito & Kale Panzanella was so good with the avaocado in it.  So many great appetizers.  I say just order a bunch of those and forget the rest.  They run about $10-$13 each.  Also, they make their own sodas there.  I'm not a huge soda fan but we tried one and it was really good!  It was a kind of ginger ale with orange and juniper?  Or Hibiscus?  Whatever it was, it was tasty! I'm only giving four stars because, unfortunately, the air conditioner there is not very powerful.  It was a hot day downtown and it was SUPER humid and warm inside the restaurant.  It was very uncomfortable.  It got to the point where we just wanted to leave.  Too bad because everything else was perfect!Oh!  Great service too.  Yay!  :)"], ["Vivian H.", "Baco - basically a giant taco, but with pita bread. Street parking is a bit hard to find, but there's a garage across the street. This is a great place for both lunch and dinner. Here's what I've tried so far: The Original Baco & The Toron - Both are really good, but can be a little salty...which is probably why they also have a pretty nice drink selection...Sugar Snap and Pear Salad - Burrata. yes. with grapefruit and pears. what. This salad was small, but so refreshing. Clean, crisp, light and sweet flavors.Coca - I've tried two different ones, but can't exactly remember what they were called. Either way, the cocas are what has made me come back to this place so many times. They are so flavorful and I personally would choose them over the bacos any day. They're even good the next day with a little microwave action.Lamb riblet - 3 pieces of lamb on top of a bed of lentils. I don't even like lentils or barley and I thought the mix was perfect. Wow, what a blend."], ["Lisa T.", "We threw this in the running to come for a cousin's brunch and with such good reviews we decided to come here. Cute location right across from big man bakes. I made reservation for 8 on a Saturday for brunch. This review is only for the brunch. I did not go eat there for dinner. What we order to share: \"Caesar\" Brussels sprouts-it was okay. caramelized cauliflower-I thought it taste a lil too lemony but it was my favorite of the dayroasted Japanese eggplant-wasn't a huge fan I ended up ordering: buttermilk biscuit with egg and gravy. I really enjoy the gravy but there was little of it. I thought the biscuit was good at first bite but toward the end I didn't like it too much. Also, be careful to look at your bill. We were charge three drinks to our table when none of us even order a drink. It was almost an added $40 to our bill. Lucky my cousin-to-be saw it or else we wouldn't have notice it. Overall: would not try this place for brunch again but maybe check it out for dinner."], ["Aaron E.", "Bäco Mercat offers a fun and inventive menu along with a relaxed hipster friendly ambiance.Located in DTLA's old Banking District, Bäco Mercat has a decidedly modern interior for the area and the servers are dressed casually and have a great friendly vibe about them that I found refreshing. Their menu knowledge is vast and they assist you in creating a custom experience with the tapas styled menu, something I was worried about after being warned of poor service. Here is my take on the meal:The Roasted Spanish Olives were nice and briny and the Olives bursted with flavor, but the addition of heat via saute pan did not add much to the flavor of the Olives. The Caesar Brussels Sprouts were all Sprouts and no Caesar. I thought these may be inline with The Playground's rendition, but this was a relatively plain dish. All that registered for me was chopped and sauteed Spouts, Garlic and Olive Oil. Far and away the best tapas I tried was the Fried Ricotta-Stuffed Squash Blossoms. Sweet, fresh and Tempura fried, this is a killer dish and a must have if you dine at Bäco. The Bäco sandwiches is where the rubber really hits the concrete and sets Bäco Mercat apart from the fray. After careful consideration I went with the \"Original\", Bäco's celebrated sandwich boasting crisp pork belly, beef carnitas, salbitxada and seasoned with caraway. This is a fun sandwich to eat, part Burger, part Taco and all awesome. The contrast of mouth feel from the Flatbread to the Pork Belly to the Carnitas is whimsical and there is a surprisingly spicy close without the heat getting stupid. This is a gourmet food truck concept if I ever saw one. I really enjoyed Bäco Mercat's Euro/Med/Spanish brand of fusion and only wish I had more stomach capacity to try more of their creations but must admit the menu can be hit or miss without a little help. I look forward to another visit to try the Hamachi I spied."], ["Dawn U.", "I love Baco Mercat.Amazing food.  Huge wine selection.  I want to try EVERYTHING on their menu.Don't forget to make a reservation!"], ["Maria C.", "So I've heard so much about this place and my friend and I decided to grab brunch one morning. When we walked in, I had a feeling of pretentiousness in the air. The hostesses seemed stand-offish, felt they didn't want to be there, and just not friendly. There was no wait and we had our selection of seats. We opted to sit on the patio, which made for great people watching. We were happy that we got a friendly and helpful server. We decided to share everything. Mind you - these are TAPAS so don't expect large portions!We ordered the following:-cesar brussel sprouts ($11) - Seriously looks like a cesar salad, but warm. Oddly it tasted pretty good. If only we had more cheese on top! MMM-original baco (taco) ($12) - Looks like 1 big taco. The pork pieces are pieces of fat (like lechon - Filipino food). The sauce had a kick and I didn't care for the taste. I wasn't impressed. -the salty jowl (flatbread) ($16) - Definitely a MUST!!! There's an egg that you crack all over the pizza. WOW - SUPER DELICIOUS! The service was OK. What I thought was a piece of hair engrained in my pizza flatbread was allegedly \"dill\" so the server said. It looks like a piece of hair to me?! Anyways, didn't get an apology or anything - just a new plate. Kinda pricey for what you get, but it's worth a taste of the sprouts and flatbread."]], "Flor Blanca": [["Rafael M.", "Oh boy, am I a sucker for holes in the wall!  If you like pupusas or are thinking of trying them this is a fine eatery to set your sights on.  Every bite of each pupusa put me one bite closer to my purpose in life, whatever that is.  A pupusa connoisseur-friend brought me here, claiming that these are the best pupusas west of the Mississippi and there is absolutely no grounds for dissonance on my part.  You will NOT regret eating pupusas here.  Try the revueltas, bean and cheese, cheese, and cheese with loroco (some type of flower with an unusual flavor).  I'm very picky but I still liked the loroco.  Be sure to douse your food in salsa and curtido (pickled cabbage mixture).After you've put a substantial amount of pupusas away - say 5, like I did - try an empanada (mashed plantain mixture containing cinammon inside of a deep-fried bread) for a happy ending (pun intended)."], ["Perlita H.", "This place have delicious food, the prices are affordable, the people are very friendly. Their soups are fresh and flavorfull, their pupusas are never oily nor burned!! My favorite dish is Pan con Pollo!! But their dishes are soooo delicious that doesn't matter what a person orders, it will always be a good choice."], ["Amir N.", "I used to love going here. But over the years service and quality has gone down hill. The last two times I went the waitress messed up our orders then argued when we brought it to her attention. Only went this time because my Abuelita wanted to go. They were rude when we walked in, the coffee was old and bitter and they messed up our order... again. This time another customer agreed that we got the wrong order. Its sad when the table next to you remembers your order better than the waitress. Anyway, the customer service is just horrible if they don't correct their ways, its only a matter of time before they go out of business. Seriously, this is Los Angeles, Salvadorian Restaurant's are a dime a dozen. One thing is for sure they've lost me and my family as paying customers."], ["Bathing A.", "What a nice little find. Not beautiful on the outside. Nor on the inside, actually. But the food was mighty fine indeed. The pupusas (I had the revueltas, the calabaza, and the loroco) were delicious and three of them was more than sufficient when smothered with the curtido and bottled tomato salsa.The horchata was really excellent and the empanadas with sweet cream were delicious to finish with. Highly recommended."]], "Ración": [], "Tapas and Wine Bar C": [["marlon e.", "spent 160 bucks...French maids? Yeah?Can you spank me hard? I want it harder!!! Harder!!!!Done? K b*tch get me more galvatron!"], ["John C.", "WHERE IS BOSS LADY?!I've been to this place a few times in the past. The only reason I don't come here more often is cuz it is a bit pricey, and it's about 20 miles from where I live.anyhow, i revisited bar c this past monday just cuz its been over a year since my last visit. to my surprise, the place seems alot brighter than before. the waitresses were nice and friendly, but boss lady was missing!!!!i dont know wut her name is, but she was the manager there. u'd know cuz insted of the french maid outfit, she'd be in a be is a pencil skirt and a business jacket, awesome secretary look. i dont remember what she looked like but i think she told me once whe was asian and some sorta european. im sure long time customers of bar c know who im talking about...as for bar c, i think it lost some of the cool/mysterious factor it had back when it was poorly lit. they still play the galvatron vids once in a while but it doesnt feel the same. the waitresses, from wut i remember, were more attractive before, but it might be because i didnt drink much cuz the waitresses werent as cute, spiral of death. still a nice cozy place to drink with ur buddies, prices arent cheap so spending everynight here would be a big no no, but please....BRING BACK BOSS LADY!!or atleast tell us where she works as now haha. forreal tho, anyone know?"], ["Katherine N.", "Met up with Marlon E. and Alvin V. and a couple other people here last week. This place is all about the furry feeling. Decorated kind of in a french tone mixed with textured walls and bathroom doors. Drinks here are a bit expensive, as one beer is $7, I can only image how much a cocktail is. The servers are dressed as french maids, and to be honest with you I wouldnt mind coming here just for them.You should try the Galvatron, galvanize yourself with the tastes of Maker's Mark, Bacardi 151 and Patron all in one shot!"], ["Maria O.", "Tapas!  Really? where?Wine!  Really? for how much???!!A couple of friends and I decided to check out this place after having dinner at a nearby restaurant (which closed a bit early),  I was still in need of another glass of wine and immediate reaction nowadays is to check for yelps suggestion, which lead us to Bar C which was within walking distance.   It was a slow Friday night at Bar C, plenty of open tables.  We were seated and given the menu by our waitress who was dressed in a cute skimpy maid outfit (ya the cheap outfits you buy on Halloween, lol).  Going thru their menu was heartbreaking; nothing seemed to catch my attention, and the wine list was shocking! Exaggerated mark up on wine bottles!!   Wine bottle prices ranged from $80-$2,000; for California wine, really?!  NOPE! Not worth the cure, so we moved on to simply ordering Japanese beer and edamame, which were fairly priced. Overall decent little chill bar, with a clean and well stocked up restroom (this was probably my favorite thing of this place), and table games (dominos, jenga, etc.) that can be convenient when you are trying to spare an hour or two with a simple drink and simple talk with your friends.  This place comes in handy in  J-Town where everything else closes sooo early."], ["Cate T.", "The night I came here, it was dead. The only patrons were a handful of guys that looked like they were probably regulars or friends of staff here. But I sidled in with two friends and took a seat. All we wanted was sake. Glancing at the food menu, I was even more sure that all I wanted was sake.I bet I would totally enjoy this place so much more on a weekend night, when there's actually activity. It was uncomfortable when the place is empty, but thank goodness for good friendly company!Stick to sake. At least, that's what my plan will be if I return.Do fries and sake go well together?"], ["Elton W.", "This place was D E D dead on a Thursday night.  Had a beer and left.  Meh"], ["Joel Y.", "This is sooo Japan-tastic that I had to review it.  You know you are in for a treat when the sign is bloody pink and all of the walls are as furry as the boots that are described in Flo Rida's music.  The owner is really cool and all of the waitresses are all very nice... I wonder why.  I especially liked one of the girls named Echigo, which is Japanese for Strawberry. I think she literally just came to America from Japan but dude she is great.They have pretty good food (very pricey) but I recommend the Foie Gras Potato Skins. Delicious.  The drinks on the menu seem a bit too foo foo for me with sexual names so as a guy, I would prob. say it's not a good idea to order it.Totally different off the normal scene in LA, this is such a great place to just chill and not deal with the usual BS that the LA scene is known for. Just remember, there is a price to pay for Japanese women wearing lingerie/French Maid outfits.... 20% service charge included at the minimum!Totally worth every penny. Guys, as a man, you must experience this at least once if you are in the area!!! Or bring your sister."], ["Michael M.", "10 Stars. White Devil approved.You get it or you don't. If you don't then F.U."], ["Chris G.", "What an adorable establishment.  All night I kept staring at the baroque-prints, faux-fur covered walls, and lacy draperies.  This place is adorable and very thorough in their thematic decor.  I seriously felt like I was inside a very elaborate boudoir-esque diorama (designed by Prince in his 'Diamonds & Pearls' phase) and we were all miniature Lego-figures hanging out, having a fab time.The desserts were very tasty and the service was off the hook.  How adorable are the French Maid ensembles?  I think I know what I want to be for Halloween, now. :)"], ["Lyn F.", "Good customer service. Nice and cozy place for drinks with friends."], ["Paula G.", "You know, I think this is a bar that either you love or you hate. There's no in between. As expensive as it is, I actually liked this place a lot. It's quiet, which is good because my friend and I came here to have a quiet drink and conversation after having a couple of libations at the slightly noisier Edison. It kinda threw me for a loop that there was baseball playing on the screens, but then again, there were only three groups of patrons there, including a group of Japanese men having their quiet drinks and chatting with the hostess in the sexy maid outfit. I really liked the velvet over-the-top walls and bathrooms. After going to Royal/T, I realize that this was the other end of the spectrum when it comes to maid cafes. The hostess was definitely a lot more flirtatious toward the men, but still very cordial and took care of everyone including the women. She definitely earned her large tips because that woman was quick and attentive, despite being the only one working.As for the food and libations, my friend had a Maiden's Blush which looked and tasted like a delicious lemon vodka martini and I had the First Love - a champagne and cherry combination. Both served in beautiful glasses though both quite expensive at around $9-$10 a pop. It could've been more but they don't have the cocktail list on their website to double check (which is kinda annoying...).It was their food that totally surprised me. We ordered the Spicy Shrimp with Cheese ($18), some sweet corn tempura and chicken karakage. The later two I totally forgot what the price was, probably around $9-$10. The spicy shrimp was, hands-down, my absolute favorite. A spicy thick tomato sauce with swiss cheese on top, garnish with yummy enoki mushrooms with large shrimp just juicy, tender and delicious. Basically, a salary man's lobster. If nothing else, go try this dish. It is amazing! So amazing I won't even dare to copy it at home. The corn tempura was pretty surprising as well. Just super, super crunchy bunches of sweet corn that vaguely reminded me of eating popcorn. Salty and crunchy from the incredibly light batter, but the sweetness of the whole corn kernels really made it a delicious snack for drinks. Totally changed my perspective on popcorn for movie nights. Compared to the other two dishes, the chicken karakage wasn't as mind blowing. However, it was still crunchy, juicy and absolutely delicious. My friend and I were actually expecting to hit another restaurant to have a \"real\" dinner after we went to this place. We were really quite surprised on how full and satisfied we were. If you have the money and a special day to celebrate quietly, I really do recommend this place. The food is fabulous. The staff extremely attentive. The libations are quiet heavy-handed. Well, done. ^_^"], ["Lisa G.", "Saturday night around 10:30 we stroll in...I wanted to like this place. I really did. The decor was awesome...fuzzy pink leopard chairs outside, lots of red velvet and lace inside. That was where the awesomeness stopped.Their wine list is ridiculous. One glass of normal priced wine per category and then it jumps to $18 dollars and up. This ain't the Four Seasons mmmmkay? I'm not paying 18 bucks for some semi okay wine just because it's being served to me by some chick in a french maid outfit. I got a beer. $8? Anyone who would rather pay $8 a Sapporo there when they could go next door to Sushi Gen and get it for $4 plus have good food is not all there in the head if you ask me. If Sushi Gen had been open I'd have been gone after the first overpriced beer. I have no problem paying more for drinks/food IF the food/drink are good and worth it. Bar C is not. Chicken Karage...okay Potato skins with foie gras...where the hell is my foie gras because that's bacon! We called the waitress over, her name was Tina, and asked her where the foie was. She goes over to who I'm guessing was the manager or owner (chick in white suit who while talking to table full of men next to us decided it was necessary to shove her ass directly in my face for at least 5 minutes) and white suit chick comes over. She blamed Tina which pissed me off. Said Tina should have told us they were out of foie gras and she'd reduce the bill. Tina was frazzled as it was...bless her heart...and I'm willing to bet money nobody told Tina they were out of foie gras that night.Check comes and there was no \"reduction\". Um, hey White Suit why don't you stop texting people on your Blackberry and come reduce that bill will ya? Or will you only come over when you want to stick your ass in my face? ARRRRRRRRRRRGH. So she took $5 bucks off the bill and that was that. Somebody mentioned the chef had 30 years of experience. If that is true I'm really sad for him. My 6 year old could have made better chicken karage and potato skins. In fact I was ready to go to Jack in the Box for their bacon cheddar wedges/skins!We still had a good time with people watching but...I'm. Never. Going. Back. Again."], ["Kat N.", "2.5 stars maybe? I'm a sucker for random kitsch.I had seen an ad for this place in the always quirky and entertaining JapanUP magazine and was stoked to pass by this place after a decent dinner at Sushi Gen a few doors down. We figured, why not? Let's grab a drink.Shaggy, fuzzy walls, super goth chamber feel and the icing of course, are the Japanese waitresses in French maid costumes. Hilarious. And cheesy drinks like the \"Orgasm\" and \"Climax?\" (I had the Red Silk Panties, a syrupy sweet concoction for $12 -- silly) The novelty of it all wore off quickly. Men in Black 2 was playing on screen and Red Hot Chili Peppers blared from the speakers. I musta been there the same night as Charles D., ha. The highlight of our visit was when some random homemade rap video came on & some Asian dude using a vocoder was rapping about a drink made with 151, Patron and something else nasty -- I wish I remembered now-- but it was the funniest thing I'd seen since RKelly's Real Talk. (please Google that if you haven't seen yet.)Not sure I'd come back to Bar C because of said drink prices, but was funny to check out for an hour."], ["William M.", "The drinks were great here, and my host Miyuki was the best. She played a good Dj set live. The food was very scarce on the menu. I had fun with my friend and host DJ Miyuki."], ["Chelsea V.", "When a 7 and 7 costs $8.00 I know a bar isn't right for me. Seagrams comes in a freaking plastic bottle! The cocktail cups are super tiny, but the drinks are pretty strong.Make sure you try a Galvetron when you go too. It will kick your ass!! Don't ask what it is, just be brave and take it. Ask questions later!This is a nice place to chill and maybe one day I will try the food. Waitresses are pretty attentive...their costumes are cute. Place seemed more like a hangout for all their friends. i don't think one person there was someone random.I guess I am more of a Dive bar kinda gal."], ["Tope C.", "It was unexpected to see what i was going to see when you hear Bar C!  I came here with a group of 9 people.  I didn't expect our party to fill 1/4 of the place.  It probably fits up to 45-50 people.  A close friend of my fiancee (Brian H.) knew the Chef and he whipped up this really tasty pasta dish, I don't know if it  was sort of a fusion of italian and asian.  I can try to describe it was fettucini tossed in a light butter sauce with various mushrooms and topped with thin slices of raw tuna and with a light drizzle of lime juice.  This was really good!  compliments to the chef!For a Canadian boy, anywhere I go in LA is an adventure!  Bar C is a place to say to you've been, you've saw, and tasted.  Come on, it has fur on its walls and the waitresses were dressed in french maid outfits.  Plus was quite drunk from this venue.  I'll admit...i puked.  Also they highlighted this artist named Galvatron who filmed a music video in the bar.  Quite Entertaining!"], ["Dupree J.", "As far as french maid cafes go here in the states, this was ok. I mean they tried. The bar there before was a nice little set up. Seemed only fit to turn into a kyabakura (hostess bar) but I guess this was the next best thing. The service is good, the girls are nice. Only problem is the original bar was pretty expensive. Now this bar has doubled the price on most of its drinks."], ["Charles D.", "I notice that people are giving only fabulous or terrible reviews for this place.  I will be no exception.  Terrible.  Seriously, my wife and I felt dirty as soon as we walked in.  The shag covering every wall seems to trap and hold the gross stink of countless men looking for a night of staring at young Japanese girls in french maid outfits.  And even if that's your thing, I think you have to be able to do better than this place.We were not there at a time when they had karaoke or a DJ, so maybe it's better on such nights.  Nope, we had Men in Black 2 on the TV and endless Red Hot Chili Peppers on the iPod.  The wine list was decent but pricey.  The sake list was disappointing.  The cocktails looked silly and cheap (yet expensive, if you can believe that).Food.  We ordered one thing, just to see if it was good and worth continuing.  The fois gras topped potato skins were gross.  Lots of potato and cheese drowning out a tiny chunk of overcooked fois gras that looked and felt more like a mushroom.  We did not order any other food, so maybe we missed the better parts of the menu.My advice:  If you want Japanese-French tapas and wine, head west to Orris.  If you want a strip club, go to a damn strip club.  If you want to stare at Japanese girls in french maid outfits surrounded by shag walls and other gross men, get a life."], ["John A.", "No beer on tap!I stopped by on a Friday night expecting to see a crowded and lively bar. The place seemed pretty dead. There was one couple at the bar, and the manager was sitting at a table with what appeared to be her friends. The waitress working there at the time did not seem to want to be there. She didn't seem too knowledgeable about what was on the menu. I went there looking to have a refreshing beer after a long day, but all they had was bottled beer! I've been to better bars. This one was merely \"meh.\""], ["Sam S.", "All I can say is Wow! What the fuck were the first reviewers smoking when they wrote about this place? They must be employees or co-owners. I went to this place looking for tapas and wine and found inexperienced, slow, staff, an unappetizing menu and a ridiculous atmosphere. On a Friday night I went to this tiny room sporting two large flat-panel TVs blaring the MMA fight for the mostly male clientele groping the Japanese French maids. If a place calls itself a tapas bar, it better have tapas, and at least several SPANISH tapas. No such luck.Want authentic tapas and wine? Don't go here. Want a tiny room sporting two large flat-panel TVs blaring the MMA fight for mostly male clientele with bigger wallets than cocks, and a chance to grope Japanese French maids? This is the place you've been looking for."]], "El Cid Restaurant": [["Joel V.", "El Cid kills it on the open mic front. Didn't realize it till tonight though, as I strayed away and tried out an open mic someplace else. They are super organized with the whole process and really know how to keep the flow. If somebody f*cks with that flow, dude will be sure to let you know. It's pretty hilarious. Sound system is on point, and they have an engineer up top to Keep it that way.So... Thanks el cid!Also..Wait staff, and bartender's are all easy going and friendly. Tina who works the door is a tough cookie but equally as welcoming. Come on down into the trenches of LA's secret Monday night storage bin of talent (or sometimes lack there of). Never really know what you're gonna experience. It's great!"], ["Phillip V.", "What an awesome brunch!!We came over this morning because this is the brunch place in the area with amazing patio space and no line. Plus, we wanted to have a couple drinks.My fiancée and I are vegan, and looking at the brunch menu - we looked to be out of luck. Spanish style omelettes and French toast but nothing without eggs. We asked our waiter if there was anything we could do with tofu, and in a few minutes the chef was out offering to make us vegan chilaquiles off-menu. OMGTwo types of vegan cheese by Soledad, tofu scramble, and their housemade salsa on chips - this was the BEST chilaquiles I've ever had and it's not close. The chef here now was formerly chef at Elf and the menu has improved a hundred-fold. Oh, and the chilaquiles or going on the menu. WIN.In addition, our waiter Thomas was a pleasure - super chill and nice, and everyone working appeared to be having a great time.Right now, this is the the best kept brunch secret in Silver Lake, but surely not for long."], ["Eric M.", "Such a fun, divey spot for drinks and finger food. I love the outdoor space. It's quiet and for smokers its a dream. There is a new chef and new menu that I am eager to test out as I usually pop in for cocktails. Its not trendy, its not widely popular but that is why I like it. You kinda have the place to yourself and even when there are lots of people the space is so big that you never feel uncomfortable. You feel very relaxed and right at home. I am a fan."], ["Erin J.", "Best flamenco show I've ever seen!  We went to the Sunday show, kid friendly, got there at 5:15 for the show @ 5:45 (you have to order everything before the show starts) we had the chips and salsa with guacamole (YUM homade) the cheese plate with Ham and chorizo, empanadas (YUM) and ceviche (could have done with out the ceviche)"], ["Veronica L.", "Was going to eat brunch at Home up the street but didn't want to wait an hour to be sat.  Started driving wound up here. Brunch is kind of a new thing for them. Definitely worth it! The ambiance is really chill, great wait staff, and their bloody Mary's are kind of to die for!"], ["Dan B.", "A pretty neat little bar with an indoor area that we didn't even explore!We were so content to get a table in the pleasant outdoor patio that we just happily sipped our beverages there.4 stars because of the ambiance and the service, for sure.Our waiter was hilarious. He joked with us about his trip to Hawaii, and maybe I shouldn't even post it, but he tried a beer with us to see if it was any good and something he could recommend to a future guest. A good laugh was had.The patio is pleasant, fairly quiet, and the tables are separated from the near-bar area by about 25-30 feet ... just enough space to keep the volumes down.Oh, almost forgot: super old movies play on the wall from a projector. A little creepy, but kinda fun. No real sound, so it's only as distracting as you want it to be.Even the entrance/exit is a little neat and different as this bar is built into a steep side-hill, and you have to descend about 20 cockeyed concrete steps just to get to the good stuff.Potential to increase to a 5-star experience if the indoor area (plus what we're told is awesome live music) is as good as advertised.For now, a solid 4."], ["Peter R.", "I was here for a private function. The room was great and the bar staff friendly. There was a problem with the PA that messed with the show. But those kind of things happen. The reason why I can't recommend the place is for the following reason.I'd left a pair of glasses behind and called the next day to ask if they'd been handed in. I was pretty confident they would have been as it was a private function. But the woman I spoke with told me that nothing had been found. She seemed irritated by the call and showed no interest in helping. They were good glasses and I was still pretty sure no one would have stolen them, so I drove 45 mins back to the place only to be told by the same woman that nothing had been found or handed in. As she was talking I looked over to the bar and there they were. Obviously one of the nice bar staff had found them and put them there, but this woman (who I imagine might be the manager) had no time to even look behind the bar and decided it would be easier to just lie to me instead."], ["Samantha D.", "I really love this place, what I like most about it is that you feel at home. It feels like chillin' in someone's patio. The brunch menu is delicious, their grilled \"Cheesus\" is out of this world, also the tuna poke is extremelly refreshing and tasty. From their dinner menu I recomend the veggie cakes with romesco sauce, they are very complex and yummy. The Saturday paella is a MUST! Great ambiance and amazing seafood. The dessert menu is also wonderful, My favorite thing is the flan. You can't go wrong with the flan."], ["Melissa L.", "Went here to celebrate sister's band, F U MaryLou's, record release and watch them perform.  Parking: free parking on the street.  Fortunately, it wasn't too busy; may have been difficult to cross otherwise.Walking down the stairs to the venue can be treacherous, but when you get there, its very secluded.  I did not eat, but did drink.  Bartenders were nice and served quickly.  Show was great, and they had tables you could see the stage or room in front of stage to dance.Stayed after performance and met new people in courtyard after show.  Only thought I'd be there for a couple hours and ended up staying until it closed. Fun Time."], ["Justine S.", "Came too late for the flamenco dancers! I wish I would have known earlier I missed it however, got to see some cool hipster bands instead. The food service wasn't what I expected; We were told that the kitchen was apparently closed tonight for the dinner plates and only tapas were available so guess what!? I ordered the entire tapas menu. Patatas bravas: season potatoes with a picante chile seasoning Chips and salsa: spicy salsa roja and chips made in house so the grease and flavor is definitely there yayyyy!Sangria: liter Is $30 versus $9 a glass so went with the liter for sure!!!! The flavors from the brandy, lemon juice and peaches combining the citrus infused slices oh my!!what a buzz!! Really good down to the last drop Calamari frito: fried squid served with a creamy white lemon aoli that looks like a topping to a soulflè only the flavor isn't desert-ish at all its a lemon cloud of heaven Empanadas de pollo: chicken, tomato and corn stuffed served with garlic and herb aoli the aoli tasted more like chipotle mayo that complimented the empanadas if you want to spread the sauce on them Muscles: served with a wedge of bread to dip into the juice. The juice from the muscles tasted like a melody of flavors about to touch my tongue...if only I had been able to try the paella shucks!! Crowd was very hipster, that's not my scene nothing personal it's just not me, there was a cover for the band it was $10 and parking is probably best if you valet or uber it since the streets are full of cars and red zones. I had a lot of fun, kicked back my heels enjoyed the tapas and people watched...till next time El Cid I would have given 5 stars if I would have been able to see the actual flamenco dancers."], ["Suzie B.", "Came here for a bday celebration.  The ambiance is superb. The decor indoor and out is very sexy, soothing and welcoming. Def order the Diablo shrimp, huge pieces and not spicy though. The performance was outstanding.  Limited menu. A great experience."], ["Kenneth S.", "I had a great experience at El Cid. I was a little scared by the first act as it seemed like another touristy flamenco trap but I quickly observed the masterly of the dancing/musical art paired with the passion and fun with improvising a tune. The food was great as well. I enjoyed the patatas bravas, empanadas and mushrooms."], ["Laura E.", "El Cid is LA's little hidden gem.  We reserved the outdoor patio for our fundraising event.  People from Canada, DC, Florida, Washington, Kentucky, Virginia, and Philadelphia to name a few came to our event and they loved it.  The ambiance was excellent and the food to die for.  We delighted ourselves with their world famous paella, tapas, Spanish meatballs, chicken empanadas, crispy brussel sprouts, kale salad, assorted cheeses, and spicy Castilian pork wings and to finish it off a not so sweet tres leches cake.The Red sangria and concoction of mixed drinks was a true delight to the palate.  The bar mixologist uses a Los Angeles favorite - the Laura Ann's Jams, which perfect any drink or meal.  Those can be purchased at lauraannsjams.com.PS - Working with their management to make this event possible was a pleasure.We will definitely return!"], ["Marjorie U.", "When you come here make sure you watch their shows. It varies every night. As for food, it's a hit and miss. I do like their steak. The paella... not so good. The empanada... nyeh... U gotta try their Sangria."], ["Brendan C.", "Went for the Monday Night Open Mic that blended into a comedy show later in the evening. I thought I would just come play a song and then take off but I stayed right to the end of the comedy set. This is an fun show, a lot of talented, diverse musicians and comics. The shows are executed really well by the stage managers. There is a cool patio area outside. Chips and salsa are great. Good price for beers. Friendly service.  Ole el Cid!"], ["Lourdes B.", "Food was perfect! Really good. Our waitress was really bad... Never came back from the 2nd time she went... She opened the bottle and left cork residues in my wine... Didn't offered to get us a new bottle, something simple to say but never mentioned it...."], ["Collin C.", "Bringing Reggie Watts in every Tuesday for the past few months has been awesome! The stage is great and I've heard a few bands I'm into. The outdoor patio offers a couple levels keeping things open and fun. Their beer selection is not the most deep, and if you order food from the bar good luck getting it if it's prime time. Definitely a fun atmosphere. The $10 cover charge can be a great deal or a shaft depending on who's there."], ["Ellis J.", "I came here for a friend who had his short film premiering and it was quite an evening. I like this place but beware it is on Sunset so parking will be scarce. I just opted for valet which was $10. This is a cool spot because the layout is interesting and the ambience is chill. The drinks are pretty good for the price and the service is just ok, seemed like my waitress wasn't having a good night but whatever....eventually I got too buzzed to care and all the films were pretty good so the night stayed fun at this spot.  I could def come back here, the drinks were good and next time I may have to try some of the food as everything I saw looked pretty damn tempting!"], ["Judy S.", "took friends to see what Paella on the Patio was all about.   I'll talk food later - the experience of being there is itself remarkable.  it is clearly a place of history - architecture, theater, old L.A. glamour, sophistication - and the sense of it hits right at the front door.   My friends,  international in origin, neither stuffy nor easily impressed, asked within about 10 minutes of seating, if \"this is open for Thanksgiving\".  And  there it all is - thinking about coming back even before the food is served.Paella was a 3rd-helping for my friend with the most cautious appetite -  superb horsdeurves and great drinks preceeded - i asked if it were possible to have anything vegetarian and the chef said of course -  and out it came from the kitchen at the same time that the Paella on the Patio was ready.don't miss this -- oh - and the wait staff is more than attentive - they're fun !"], ["Ebony M.", "This is such a fun location to see a show. I had friends whose band played here a lot. El Cid makes the tastiest sangria ever. I don't generally like booze, but it's sweet and fruity. I wish this place had a great big dance night or something. It's always pretty vacant when I'm here, whether it's for a party or just a hang. Let's change that L.A.!"]], "The Briks": [], "Spain Restaurant": [], "La Barca Restaurant": [], "Lempira Restaurant": [["Merlin Y.", "Incredibly authentic Honduran food! Having spent several years in Honduras, this place is a find. Good, personal service. A real mom and pop feel. Baleada and Pupusas are both fabulous. Good prices as well. Come here for an authentic Honduran experience!"], ["Irene B.", "WORST EXPERIENCE EVER!I drove from Torrance (1 HOUR) have \"amazing\"  Honduran food...little did I know that they would have terrible service, none of their popular menu items and JUST RUDE! I asked for Baliadas, pastelitos,rice, and meat and they said it would take an hour and a half...I said fine but they insisted we leave. The old man is rude and they said they had to attend to their customers which was only one person because the cooks were too interested in watching novelas DO NOT WASTE YOUR TIME HERE"], ["Brian L.", "I had never had Honduran food before, so while I was in LA I looked up this place. It is very much the archetypal hole in the wall in an anonymous urban shopping center off Hollywood Bouevard - the Hollywood Boulevard far away from the tourists.I had two baleadas - the ones with the carne asada. They are very, very similar to Mexican burritos and are basically giant soft tacos. The two baleadas and the Mexican coke I got were very filling and cost me just $8.Yes, the waiter/owner? man who serves you is not the typical fake-smiles, I just want tips, kind of server. He is a no-nonsense type of man. I conducted my business entirely in Spanish,  so he was probably friendlier to me than he might be to others - he called me \"joven!\""], ["Keila V.", "Most amazing and delicious hondurañe restaurant!I almost come here atleast 3 times out of a week ever since i came here looking for bailadas! I fell in love with all there food. It's so good! I love sopa de mondongo here!"], ["David X.", "We came from westcovina for like a hour drive and we called ahead but no one answered. We get there and we ordered 15 baliadas con carne and 6 tamales. They then come back out and tell us theybdont hve tamales and we order more baliadas and some drinks. After that we waited 40 minutes and the same old guy came out and told us there is no more baliadas. What are they doing? Making us wait so long for nothing i wish i could give 0 stars . This place is very small only fits 10/15 people sitting down. By the way the old guy that attended us had his shirt unbottoned and his hest was showing. He looked drunk and smelled like beer i dont know if he is the owner or anything but that is no way to run a business. We payed the sodas and left."], ["Antho L.", "This is a pretty cool find!They are an Honduran restaurant serving some really great eats. It's located in a mini mall and is pretty unassuming except for the large signage out front. I actually had visited Honduras years ago on a short term mission trip through a church I was attending but for some reason, I don't recall having these foods there.The cuisine is based on the central American theme which consists of hand made tortillas that are fluffy and thick. So good!!I came here with a friend recently and we shared a few things like a pork, cheese and bean pupusa, a loroco and cheese pupusa, two Honduran baliadas which are made using the hand made tortillas flattened a little more and folded over with goodies stuffed inside. The two we selected were a bean and cheese baliada and the other was called a Baliada de Huevo y Aguacate which consisted of refried beans, grated white cheese, sour cream, scrambled eggs and avocado. We also shared a Bistec Encebollado (steak and grilled onions) breakfast plate consisting of grilled beef with sautéed onions, some refried beans, rice, a salad of diced cabbages topped with sliced tomatoes, cucumbers, and radish plus a side of the hand made tortillas.The pupusas were really enjoyable (4.5/5) and typical of the ones found at a lot of El Salvadoran eateries but the baliadas, which are native to Honduras, were the BOMB!! I especially liked the one with the Huevo y Aguacate combination. It's a sure winner in my book and a must have when dining here (5/5). The beef of Bistec Encebollado wasn't the greatest quality beef as it was a little tough and chewy but was decent enough (3.5/5). I'd probably order something else in its place next time.I also had the guayaba fruit drink which tasted similar to mango juice which I love and this was really refreshing and went well with my meal. (5/5)I'm so glad I decided to try this place out because I really enjoyed my experience here. The food is authentic and you could hear the cook in the back patting our freshly made tortillas for cooking, hehe! The gentleman who served us, who was most likely the owner, was a quiet and polite man. When I requested the check after our meal, he came up to our table and just recited how much it was going to be.Good authentic eats at a really reasonable price. I can fondly say I'm a fan of Honduran cuisine and will definitely be back again!"], ["Karl K.", "What if the Wu Tang Clan sang Honduran rap songs?----------------Then their song title might sound like \"lempira gobierna todo alrededor de mí\". Ok three things:1. Lempira is Honduras version of cash2. That is supposed to be C.R.E.A.M.3. Google translate doesn't work for nerd jokesThis is a pretty Cool place. Tucked inside of a strip mall, I have driven by multiple times and did not even know it existed. Until today. We came here for a last minute lunch. We got the house special - the baleada. Each is $2.75, and is packed with carne asada, a type of Honduran cream, cheese, re fried beans, scrambled eggs, and avocado slices. It tastes pretty good, and is exceptionally filling. One of my coworkers got three! Hope he had a good nap that afternoon, lol. Try it with some Tapatio sauce!Apparently this was too much for a group of trannies that walked in, who then promptly left. LOL. If you've never tried Honduran food, you should check this place out!"], ["Randi R.", "Nice spot right near me! Much tastier than el pollo dorado in the same complex. A lot more variety here. They don't exactly have the friendliest attitudes (the male store owner in particular) but I've grown to appreciate his intolerance. The food is good and that's what matters!We usually order.....(trying to recall)....oh yea- pollo frito and take it home. I also get a side of stuffed tortillas (pupusas?) Looking at some of these yelp photos I will certainly try the baliada next time!"], ["Sadie S.", "Simply shitty service.  I gave it the benefit of the doubt and returned weeks later after my first incident. Different cashier, same rude service. I speak Spanish and asked about what size their baleadas were. He fuckin points at the picture that was 3 x 4!  I rephrased it thinking he didn't understand me but I realized, he wasn't having it with me. Then he mumbled they didn't have any!  No lies. No eggs, beans and cream? This Salvi walked away hungry and gutted. The Honduran restaurant off of Beverly is far superior and I will do the damn drive."], ["Eric C.", "So here is the thing with Honduran restaurants, the service is going to be terrible. No matter how nice you are to them, no matter how good your spanish is, no matter anything expect to wait unusually long times for the food add to the fact that the service will be less than attentive. but with all that being said, the baleadas here are amazing (as amazing a baleada can be) and worth the wait. from the soft hand made flour tortillas to the buttery eggs with \"crema\" this always hits the spot."], ["Brian P.", "Growing up in a Honduran family, I knew I had to try this place. And I come here for 3 reasons:1. Las Baleadas2. Enchildadas3. MoraGive me those 3 things any day and I'm there!The male waiter is as everyone else has said, not too friendly. Although I did once speak to him in Spanish to ease him up and actually saw a smile on his face. They appreciate it. I love it here! Takes me back."], ["Natty H.", "They get a 5 star! Because of the awesome food! Not the service necessarily...be prepared  to wait. For me, it's worth the wait when it's not too packed! Love their baleadas and the platanos maduro with Carne molida. I also look forward to drinking their authentic Banana! Imported from Honduras! This food is awesome and tastes like mom's food! I love it! And will continue to wait for my baleadas!"], ["Jane L.", "The 2 ladies cooking the food in the back know what they're doing. The pupusas are so good. It takes a long time but worth it. Prices are reasonable too especially for the portions. I'll definitely be coming back regularly."], ["Ash S.", "Came in with my family for a quick bite at 5.15 pm on a Thursday. There were 4 other diners in the place.  We ordered 3 bean and cheese pupusas. The owner said they would be 20 minutes. Ok no problem. One of my kids politely asks for a glass of water and is met with a scowl by the owner. Fair enough. No problem. We wait 45 minutes and no sign of any food. The owner has not been by to check and to let us know whats going on. I go to the counter and see the owners wife who I presume is the cook finally putting the pupusas on the griddle. Wow. I ask the owner how much longer and he arrogantly says they are coming. I politely ask why its taking so long and his response....\"you can leave if you want. we are busy.\" good advise. I leave. Too many decent people serving great food to give this guy any business."], ["Patrick M.", "Order ahead of time"], ["Guillermo G.", "Never had Honduran food before when I discovered this little restaurant on Sunset in East Hollywood. I'm not too familiar with Central American cuisine, aside from Costa Rican and Panamanian. I must say that Lempira gave me a nice introduction to Honduran food. I'm now a big fan of baleadas. The place is pretty much run by a couple, at least they're the only ones I see in there. The husband takes the orders and brings them to the table and his wife cooks. The food will take a while to be ready, they take their time (very Latin American), so if you're in a hurry or are a person who has no patience this isn't the place for you. If you are patient the wait will pay off."], ["Isis J.", "Want to taste authentic Honduran baleadas? Go to Lempira Restaurant. Their baleadas are the best in town!! I'm also a huge fan of their delish platanos maduros (plantains) the chicken tacos and the guanabana drink. The guanabana is a tropical fruit which is an acquire taste, so if you're trying it for the first time you'll probably not like it, but once you get used to the taste you'll love it. I will definitely be back regularly here - SO BOMB!"], ["Mercedes A.", "I absolutely love this place! Their pupusas are soooo tasty! I definitely recommend this restaurant. You will enjoy their stuffed plantain. It's to die for! There is always parking available and never over crowded... Enjoy!"], ["Mildren B.", "First off, if you come here, you need to have patience or order 15 minutes before you get there. They cook everything from scratch to it's takes a little bit for the food to come out. Besides that everything is great , I feel like I'm at my grandmas house every time I eat here. Great Honduran food with great prices!!! Don't forget to tip!! Xoxo"], ["Cawia N.", "Came here twice. The first time was last Saturday afternoon when I was really hungry and ended up leaving after waiting 10 mins since no one attended us. The second time  was last night when I called ahead for a to-go order. Got 5 pupusas for about $9.50 or so which was a pretty good deal. The pupusas themselves were decent nothing really special. A bit on the drier side and not greasy like some other places I've had. Service wise though, not the most welcoming."]], "La Flor Blanca Restaurant": [["Kaqchikel C.", "The worst customer service ive ever experienced. Good food, but not worth the 45 minute wait."], ["Brandon T.", "if you're taking Gustafson's GE 5 course you're bound to find this review. Hopefully it will encourage those too lazy to actually come out to La Flor Blanca to try their pupusa!With that being said, most USC students wouldn't venture any further west beyond Vermont but this restaurant is worth the journey. It may look a little shady from the outside but La Flor Blanca does a pretty decent job keeping the place clean and presentable! I got to try they pupusa de calabaza and their pupusa de chicarron served with a bowl of sour coleslaw and tomato sauce. The pupusas may look a little small but for ~$2.5 each they're actually quite filling and relatively cheap. These things look like Taco Bell's Crunchwrap Supreme but they're much more traditional. The cheese and mashed beans are creamy and rich wrapped elegantly within the soft tortilla. Top it with the coleslaw and you got a pretty good Latin American meal. The tomato sauce was a little bland IMO but it seemed to be more authentic than sauces loaded with sugar or salt. Overall, I would recommend it to anyone in the area. These were my first pupusas and I'll definitely return when I get the chance !"], ["Susana D.", "The Pupusas were ok... Fairly big in size but I like the traditional smaller pupusas. I would have loved to tried another dish but Due to the Fact they ONLY ACCEPT CASH pretty much sucked I only had $16 in my purse bummer I was craving platanos con crema. 5pupusas and two cokes were $15 I would have gave it 4 stars if they took debit . Their service was great though."], ["Luis O.", "Most delicious and filled pupusas that I've ever tasted in my life! I don't even live near the restaurant and I'm still willing to drive 33min to go eat here. Not to mention that xiHero and Hoods Dream work here and they know how to treat their people. Overall amazing food and true Salvadorian ambient."], ["Janeth H.", "Pupusas are great. They are big and not too greasy. Their Sopa de Gallina is top notch!! Comes with a half a chicken and rice and garden salad. It's so good. I've tried other plates and they are pretty yummy too, but the pupusas and soup are amazing!"], ["Irma V.", "Was craving some pupusas and this place is down the street from USC.  The loroco pupusa was basically cheese with cheese and more cheese with a hint of loroco.  I'm a huge fan of cheese but I was hoping for more loroco in it.  The bean and cheese pupusa was yummy and had a good amount of both beans and cheese.  Can't comment on anything else because that's all I had."], ["Annie G.", "Oily, cheap, and comforting!  This place is SO close to my apartment, I'm not sure why I never tried it before.  I had my first pupusa here, and they were quite good. I'd just been to Roscoe's Chicken and Waffles the day before, so I wasn't quite feeling the oiliness, but I'll give this place an extra star because I imagine it'd be much better if I was more keen to eat something greasy. The tamales were my favorite.  The textures and flavors were wonderful, and the cornmeal bit was not too dry. To me, proper cornmeal in my tamales is more important than what you put inside. Some people may be put off by the small, grungy feel of the place, but like with many good Chinese restaurants, some of the best food comes out of places like this, so give it a chance! :)PS I wish this review was more helpful, but my lack of knowledge of Salvo food makes it hard to be particularly insightful. :("], ["Dude Food G.", "No matter what part of the world you are from you should find your way to places like this. The manager is aware, concerned and runs a good spot.!First timers, try the Sopa de Gallina India."], ["Vinny V.", "Food is good but the wait is horrible.  Every time I call it in they say 15mns. When I get there 30mns later I still have to wait at least another 20mns. It doesn't take that long to make breakfast n pupusas cmon now."], ["Danny M.", "Its the best pupusas i have ever tasted too bad they are not in long beach would go more often.  Sometimes its hard to find a table because its a small place and so there are customers who really like the food and make hard to get a table. Yeah is in the ghetto but is clean inside and food taste good. The down is it gets hot inside in hot days and when there is a lot of people and may take a while to get order. But you know what, the food lets me forget about the negative. I just order by phone and take it home. Oh yeah no credit cards yup 2014 and no credit cards lol Bakery on the left side is good too. Looks ghetto from outside but food taste good and bread too."], ["J C.", "the pupusas are a most if you havent tried them you need to asap"], ["Lecia H.", "The food is good,  it took also about 30 minutes to get our food,  and also waited for the restaurant to open they open ONE HOUR LATE,  people were inside the employees were there on their cell phones while other people were trying to get in as well...   Don't know if I will be coming back here,  they didn't even apologize for opening late...  :("], ["Kim B.", "This was my first time trying pupusas.   I came here with my Salvadoran friend.  I fell in love with the flavor.  The pickled cabbage with the sauce and the cheese pupusa is so yummy.  The food was hot and super fresh.  I also had the fruit salad drink.  They put alot of fruit in the drink.  Very good.  I will definitely be back because those pupusas are addictive!"], ["Bernadette A.", "Lets get this out the way right now: 1. Yes the place looks Sketch and bootleg2. Yes You will be shown an array of Bootlegged CD's, DVD's and Cassettes3. Yes... There is a Man walking around with a huge container of Quesadillasand Last but Definitely Not Least4. YES You will have to get sugar for your coffee from the Communal Sugar Jar (Awesome)Nonetheless, the food from here is great. The service is awesome, and the people are down home Salvadorian People who have nothing but love for their food, their country, and having others share that with them. Their Pupusas are HUGE and pretty tasty. The Fried Plantains with Black Beans and Cream are Bomb-Diggity.BTW, the Quesadillas the guy sells out of his container are pretty good. Definitely going back when I feel the need for some Platanos con Frijoles and Crema."], ["John H.", "100% Salvy and the pupusas here are aight.Little on the gresier side than normal. Still good though, just not great."], ["Hue L.", "When I first heard of \"pupusa,\" I assumed it to be some kinds of dessert. I went here for one of my class' food review project. La Flor Blanca is surprising close to USC! I guess the reason why a lot of people have not heard about this place is because it is located a relatively unknown and sketchy neighborhood. If you are coming here for dinner, I recommend going with a large group of friends, especially if you are planning to walk instead of drive! Even though it is small, the restaurant gave me a welcoming and homey feeling. The paintings on the wall gave a nice cultural touch to the restaurant's atmosphere. The owner was very nice and friendly. The scorching heat from outside did not stop the owner from giving each customer who entered the door a welcoming smile and a friendly greeting. I ordered a pupusa y queso con loroco to-go and was charged with a not bad price of $2.73 with tax. Even though I ordered only one pupusa to go, and there were not a lot of customers at the restaurant at the time, I still had to wait for almost fifteen minutes to get my pupusa... I suggest calling in your order ahead of time to avoid having to wait for a long time. . Despite the disappointing wait time, I was satisfied with my pupusa. It was big, cheesy, and delicious. The loroco added an interesting flavor and texture to the pupusa, but it did not overpower the overall taste. The order came with a side of slaw and tomato salsa. Both the slaw and salsa perfectly complimented the pupusa. The slaw, in particular, was crunchy and delicious, and added a little citrus kick to the overall taste. I wish the tomato salsa would be chunkier and more flavorful, because the salsa alone tasted almost like plain water. Overall, good pupusa at a decently cheap price. It's nice to try a new food that is close to USC!"], ["Geraldin F.", "I have been coming to this place for the last 10+ years and as always its satisfying to the max.  I drive all the way from pasadena to get a pupusa fix that only this restaurant can give. Love it !"], ["Jaz J.", "Okay To start off Their Pupusas Suck..With that said Im Really upset At this Restaurant I Ordered A Chicken Soup to find out that #1.The size of the soup isn't even worth what I payed for,Its more Like a Small Water Soup with a side of chicken and rice. #2.It was Cold Ass Hell when I got it and #3.It was bland...besides me Not getting what I Payed for,Now Im stuck with a tummy ache that has me Thinking the soup was probably old :("], ["Benjamin S.", "For someone with a delicate tongue for delicious south Americans goodness; Flor Blanca floored me. The best pupasa I have ever had, absolutely scrumptious. The meat was tender and flavorful. If the food wasn't convincing enough, the Salvadorian soft core porn on the TV during my meal was. The owners are incredibly friendly and they manage to keep a restaurant on south central free of transient disasters and nastiness. Kudos."], ["Maria M.", "I came here on Friday 10/3/13, for breakfast and I was a very happy customer.I had huevos rancheros and a popusa.. It was yummy the food was full of flavor and hit the spot. The service was good too."]], "Golfo De Fonseca": [], "Little Spain": [], "LA Paella": [["Vishal B.", "Went here for birthday dinner with 16 people and they were sooooo accommodating. Perfect for large groups (if everyone likes paella obviously....) There is a weird \"rule\" where everyone has to order $20 worth of food but like idk it wasn't a deal breaker. Paella was sooooo good ugh I got the squid ink and miss it. Sangria sangria sangria yes yes yes"], ["lisa p.", "Sadly disappointed in the food quality. For 60 bucks I expected at least a good meal. Love the cute little restaurant and the owner was very nice.I hope the food wasn't bad because it was a take out order! Yelp got this one wrong."], ["Linda V.", "The beau brought me here for my birthday. The restaurant decor was very homely and charming. There's meter parking in front and the restaurants is located on a small strip. A little weird to get into.. But  didn't have trouble finding parking at 8pm on a Saturday night. The bread basket came with a side of clarified butter and olive tapenade... Super yummy! Carbs overload! We ordered tapas and the seafood paella. Tapas were amazing, but I've had better paella. It was pretty good, but I don't feel like it was the best. I would definitely come back here for the Tapas though. Price point: Tapas $6-10 Paella (2 orders minimum) - $40-54."], ["Pauline G.", "Although the service is a tad slow the staff's genuine warmth and accommodation make up for the slight delay. I have had the pleasure of dining here twice. The calamari on the tapas menu is a beautifully bright, simple delight with a squeeze of lemon. We actually ordered a second serving! The complimentary toasted bread with their tapenade is a lovely snack while you sip a glass of wine and wait for your paella. The squid ink paella is literally one of my absolute favorite dishes of all time. The photo is dark but it's loaded with seafood. A must try!"], ["Michelle L.", "I love to travel and have seen a lot of the world. One of the fondest memories I have is trying my very first Paella in Spain in a small restaurant with my family. It has since then become one of my favorite dishes to eat and one that I yearn for often. I recently graduated with my Masters and I really wanted to celebrate it by eating one of my favorite dishes. LA Paella seemed to be the answer and we found ourselves here around 9:00PM on a Wednesday. Maybe because it was late and on a weekday (they close at 10:00PM), there was plenty of seating for us and we experienced excellent service. First of all, their garlic butter and olive tapenade is fantastic. They serve it up with a loaf of their house bread. I do think that their bread is a little too hard (almost crouton like for some of the pieces). But it was really quite tasty and they are generous with their bread. A little softer next time please. Now, they make their paellas to order which means you're going to be waiting about 30 minutes for your food. And if you want paella, you have to order for two which means for all you solo diners, you won't be eating paella here. Anyways, in order to carry us over, we ordered some calamari. The calamari was very average and nothing special. The portion size is rather small too and they don't serve it with any sort of dipping sauce. Pass next time. The Paella Valenciana Mixta (Rice, saffron, meat, vegetables and seafood with a touch of red peppers and rosemary) was a glorious thing that was beautiful to look at. The servers will bring it out to show you first and then serve it to you table side. One bite in and I was hooked. It was seasoned right, the rice was cooked to the right consistency and they were't too skimpy with the different meat and seafood. Because the price is a little steep, I think they could have thrown in a few more mussels and squid and such but this is definitely one of the better ones I've had in the LA area. We really enjoyed our meal here with a bottle of cider. I think for everything we ordered, the bill was around $80. It wasn't a cheap meal, but it wasn't outrageously expensive neither. The restaurant has that Old School Europe feel too so it could be considered intimate and romantic to some degree. Well worth a visit. 4/5"], ["Christy W.", "This place is a very small Spanish restaurant--maybe 5-6 tables max, although I am not sure if there are extra tables on the upper level. The atmosphere is very warm and home-y--dimmed lighting, home-y décor, candle light in the middle of the table, etc. I recommend coming here for a date or with family, as the environment is nice and quiet for conversations. As its name suggests, this place is known for their paella--Spanish rice dish. So we (a party of 5) decided to share 2 hot tapas and 2 paellas. Keep in mind that the minimum order for each paella is two (aka for two people), so the paellas we got are 2 orders each. This place serves a generous amount of complimentary bread--comes with vinegar, salted butter, and tapenade (olive spread). Our whole table loved the bread--I highly recommend the tapenade spread along with the butter. SO GOOD! 1) C A L A M A R I   W/   G A R L I C   &   B U T T E RThis was my favorite dish of the night. The calamari was so chewy and it soaked in the garlic and butter sauce. Make sure to squeeze in the lemon because or else this dish may seem a bit heavy--plus, the citrus flavor really compliments seafood. Must get! 2) M U S S E L S   I N   W H I T E   W I N E   S A U C EThis was also really good. The mussels were nice and big--none of that teeny tiny business you get from some of the other restaurants--and the white wine sauce was nice and sweet. Excelente! 3) P A E L L A   M A R I N E R A This paella is surely a showstopper because it comes with a generous amount of mussels, clams, shrimp, and lobster. The menu explains that the paella dishes take about thirty minutes to cook. So you can imagine how the flavors of the seafood really seep into the rice, making it super delicious. Recommend! 4) S Q U I D   I N K   P A E L L A I personally love squid ink, so I was really looking forward to this dish. Unfortunately I thought this dish was average. Unlike the Paella Marinera, this paella only comes with a few mussels and small bits and pieces of calamari mixed into the rice :( The squid ink flavor is definitely there though, so I can't really complain. I just wished there were more to this dish. Be careful when eating this though, because the squid ink will stain your lips and make it black if you don't clean up after every few bites (now we wouldn't want black lips on a date do we? XD).The service here is also wonderful, I loved our server--super polite and knowledgeable. Looking at other pictures posted by fellow Yelpers I realized it's the same old man. I wonder how long he's been working at this place for? Either way, I had a great experience here and would definitely recommend it to paella lovers."], ["Eric F.", "10 years ago this place was way more crowded and I would have given it less stars.This evening my friend and I were the only ones there for a while - and the food is much improved.For a Beverly Hills joint LA Paella offers wine and fino sherry by the glass for as low as $6. Hot and cold tapas are between $5 and $9. Major entrees are from $11 to $26.In other words - for what you get and where you get it - LA Paella is a bargain.We ordered the Serrano Jamon plate for under ten bucks - and got so much ham that we took some home.And everything was delicious.Getting here is tough though... not because it is up in the mountains or it is in New Zealand - but because it is on a part of San Vincente that is almost impossible to get to. The best way to go is to approach it from the south east - not from La Cienega.The real winners in tonight's meal, besides the Jamon, were the garlic shrimp and most especially the Spanish tortilla. I will come here again and again."], ["Jon R.", "IF YOU'VE BEEN TO SPAIN AND LOVE AUTHENTIC SPANISH FOOD, DON'T COME HERE BECAUSE YOU'LL BE DISAPPOINTED.I love Spain. I went there a few years back and the food literally changed my life, so when I heard there was a \"good\" paella restaurant here on the westside and it had four stars on yelp I was excited! Unfortunately, that excitement quickly dissipated. Bread & Aioli & Tempenade-Bread was old and hard like croutons-aioli was very bland not enough garlic flavorChampiñones con Chorizo (Potatoes with Chorizo)-Potatoes were cooked but way underseasoned-chorizo was not like Spain at all more like really bland Portuguese sausageMejillones Costa Brava (Mussels with White Wine)-These were actually good but again, very underseasoned-Tender, juicy, succulent musselsPulpo a la Gallega (Slow Cooked Octopus)-bland bland bland-no flavor aside from a subtle paprika-not as tender as I would've likedCaracoles al Ajillo (Garlic Snails)-bland-mushy-overall not very good at all and I LOVE escargotPaella Marinera -pretty good but again, obviously not even close to the quality of Spain-seafood was a bit overcooked especially the shrimp and lobsterYelp is rarely so wrong but in the case of La Paella they were. It's been a very long while since I've eaten such an unsatisfying meal. And it wasn't just me. Even the friends I took here that have never been exposed to Spanish food didn't care for it. No taste, no flavorful, just blah. The service was very good but the food sadly, was not."], ["Janice L.", "The service was great and the food was excellent! We really enjoyed the paella mixta. Thanks to David!!"], ["Elvin C.", "3.5 stars. I wanted to give 4 stars because the owner is such a delightful and welcoming person, but I found the food to be rather unimpressive despite how great the menu alone made me drool. I came with my family to celebrate my birthday just to try it out. This is in fact, my first time at a Spanish restaurant, and I had very high expectations for Spanish food in general from what I've seen and heard. I expected my eyes to roll back, I expected something refreshing considering it was my first time eating Spanish food, and I expected to be interested in coming back regardless of the price. In those regards, I was somewhat disappointed.I wanna start off on a positive note by saying that the complimentary bread here is toasted and comes with both garlic butter and olive paste. I could've eaten baskets of the bread with those awesome condiments if it weren't for me trying to stay hungry in anticipation of the paella. Great job on that bread. I was pretty excited to try the tapas because they all sounded great.Champinones con Chorizo: I thought it tasted fine, but there was nothing particularly impressive about it. Not sure how great I expected it to be, but I don't see myself itching for more. 3.75/5.Tortilla Espanola (requested warm): I've been wanting to try this dish for a long time and finally did. Who doesn't love potatoes and onions cooked with eggs? Well personally I was underwhelmed and it wasn't even as delicious as the potato omelettes I make at home. Bummer, 2.5/5. Patatas Bravas: I sautee potatoes all the time with ketchup and chili sauce for breakfast, so I was looking forward to see what they could've offered. I didn't think the dish overall was that great, but I did really like the spicy kick of the sauce. 3.75/5.Vieiras al Ajillo (Scallops sauteed with garlic and chili): This was probably the most anticipated  of all the tapas we ordered and it was solid. You couldn't mess up something so simple unless the scallops weren't fresh, but they were good. 4/5.Croquetas de Pollo: One of the more anticipated tapas also, it ended up being not bad at all. I just wish it was more... memorable. I couldn't say any one thing about it stood out or wowed me, but it was alright. Could be cheesier, could have more chicken, and could've been a bit hotter coming out. 3.75/5. We had the Paella Marinera and the Paella Valenciana Mixta. They're really not too different from each other, maybe I should've went with the Squid Ink option for variety's sake. The Paella Marinera was full of seafood and it was all pretty good especially the prawn. However, the overall verdict of the paella was that there was a tiny bit too much stock still around which made the rice more watery with the rice still being on the al dente side of the spectrum. Maybe a bit more cooking time would've fixed that, or maybe that's just how it's made here... 3.5/5. My first time trying paella was actually at a French bistro in South Pasadena, and that was much more to my liking. The rice was cooked perfectly, there was the ever so coveted crunchy rice packed full of the flavors from the cooking juices, and the dish as a whole was so  cohesive and delicious. It felt like Christmas eating that particular dish.Dessert wasn't bad at all.Flan de Naranja: Supposedly they won the best flan in Los Angeles award in 2009. Not sure who passes out these awards, but regardless, it wasn't close to the best flan I've had. It's not very sweet (and many like it this way) with a strong orange presence so keep that in mind if you're thinking about getting it. 3.25/5.Crema Catalan: If you like creme brulee with a cinnamon kick, this has your name on it. It's a good stab at creme brulee and I have absolutely no gripes with this, 4.25/5.Although I very much appreciate the cute little decor in here, along with the friendly and welcoming service, I can't say that the food was good enough to justify the $$$. If you're desperately looking for your Spanish fix, this should do the trick, but don't expect anything transcendent.P.S. The owner has been looking for a busboy or a waiter for 2 years now, COME IN AND APPLY. Does no one need a job anymore?"], ["Maureen S.", "My husband and I have no complains about this place. The owner was so friendly and welcoming. We ordered the snails, grilled squid with chile, and the seafood paella. I've never been to Spain but whether or not it tastes different, it was flat out delicious! The squid says a hint of chile but it definitely brought some heat. The paella takes a while so definitely have some of their bread and enjoy a couple glasses of wine. Slow down. Take your time! The restaurant itself is simple, small, and quiet (but you don't feel like you have to whisper either). Perfect for great company and good conversation. Just a homie, relaxing atmosphere for a date or small group of friends. We're already looking forward to our next meal there!"], ["James W.", "Stopped by this place on the way home from another restaurant that had a one-hour wait. Glad I did! We weren't very hungry, so decided to share some tapas. And yes, although the name of this place has \"paella\" in it, we did not opt for it given the fact that you have to order at least two portions of it in order to have it. Shame. Because the table next to us got them, and they looked amazing!Instead, we got some hot tapas to share:1. Spanish tortilla: potatoes, egg, onions. Done really well. Quite large too. Light.2. Potatoes: Pretty standard, although there is a little kick with the spicy sauce.3. Mushroom and chorizo: Awesome. I kept dipping the bread in the sauce because it was so good.4. Calamari: Well fried, fresh.5. Special croquettes: Crispy outside, mashed potatoes with some meat on the inside. Enjoyed this very much too.6. Spinach with pine nuts and raisins: Our only veggie dish of the night, and it was well done. The raisins add a really good flavor to an otherwise normal spinach dish.Wines were cheap ($5-7 a glass). Service was excellent. Street parking is abundant."], ["Rebecca L.", "I may be biased because I have only had paella in Spain or at restaurants by Jose Andres, but the paella here is just not that impressive.  I really like paella where the rice is a little bit crunchy on the bottom and still holds its shape.  Unfortunately the paella here was soggy, for lack of a better word, and kind of reminded me of Rice-a-Roni.The meal started off with bread, which was accompanied with a garlic butter (good!) and an olive tapenade (unique and good!).I was excited to try the sangria, but found it to be pretty average.  Very weakly alcoholic, but not surprisingly given how much ice was in the pitcher.  The waiters served the sangria for you, so I was waiting for my glass to be filled for a little while.Our waiter was friendly and attentive, but might have been a robot programmed to say \"everything is good!\" every time we asked a question.  While he was jolly, he was sort of super unhelpful and left us to navigate the menu ourselves.Undeterred, we ordered a range of tapas that we figured would be \"good\" since \"everything\" is.  I thought the portions were small given the prices, but it's tapas so I kind of expected it.  I didn't really like any of them to be honest.  The calamari was too oily and salty.  The croquettas, while crunchy on the outside and soft on the inside like they should be, were too salty as well.  (We got the ham croquettas but maybe the chicken would be better?)  The sausage and mushroom dish did not have much sausage, although the mushrooms were pretty good.  I liked the mussels in white wine, and used the bread to soak up the sauce.  I also enjoyed the octopus, which came thinly sliced and was grilled to the perfect tenderness. The artichokes were average.We ordered a squid ink paella (came with shrimps and squid) and a sausage paella paella (with shrimps, sausage, and edamame (?)).  I was not impressed by the sausage paella.  The Squid ink paella was good in comparison to the other one but nothing to write home about.I really wanted to love LA Paella, but I just didn't think much of it, unfortunately.  Street parking, however, was pretty easy to find on a Friday night around 9."], ["Jonathan K.", "I'm no paella expert, but I was pretty underwhelmed by LA Paella.The restaurant itself is nice, but nothing to write home about. From reading some other reviews, I expected something a little more unique with the decor and atmosphere, but I thought it was nice, but not special.The service wasn't bad, but our waiter was completely unhelpful, in that every time we asked him for certain recommendations, he would just say \"everything's good.\" Or even when deciding between the chicken and ham croquettes, he was just like \"they're both good\" without elaborating, giving us any more information, or even asking us what kinds of food we liked, or what portions we were looking for, etc.The sangria was average but the appetizers weren't bad. The calamari, artichoke, and mussels were all very standard, but the octopus was really good -- not rubbery at all, and soft and flavorful. The croquettes (you can get chicken or ham) were delicious as well.I didn't like the Paella Mixta, it was tasteless and soggy, but the Arros Negre -- the squid ink paella -- was pretty good. Beware, though, that it stains your teeth way more than I've ever seen with any squid ink dish.Overall, I had a mediocre experience here, and for the price, it definitely wasn't worth it for me, so I probably won't be coming back. Minus an extra star for the service."], ["Michelle R.", "I can't remember how I discovered La Paella, I'm guessing either Yelp or LA Magazine, after returning from my trip from Spain in 2008.  According to foursquare, my last visit to LA Paella was in 2011, and I can't believe I didn't take the time to do a review until now.The paella is their specialty, and requires a minimum of 2 orders, and run $21 and up, per person, depending on the type of paella you order.  Give them about 30 minutes to make it, and enjoy the wait by ordering tapas and a pitcher (or half pitcher) of sangria.   We shared a 1/2 pitcher of sangria, house bread with garlic spread and olives, and appetizers serano ham with figs, and the tortilla espanola, which is  a potato and onion omelette, served hot or cold.  By the time we finished our starters, the paella mixta was ready. I had upgraded our paella with the spanish rice, and asked to have the paella \"more crispy\" so that the bottom of the pan got a little burnt, making the rice crispy and crunchy.  The serving for 2 was plenty, and with the appetizers, had just enough room for dessert and coffee.For dessert we shared the rice pudding, served cold.  It was a dense rice pudding, not mushy or creamy , and paired very well with coffee.Overall, the meal wasn't that bad.  For 2 appetizers, sangria, paella, dessert and coffee, it came to $100 before tip.Reservations highly suggested on the weekends.  DIning at 8:00 was nice, as it was not crowded, and the noise level was low.  Service was spot on, and the owner stopped by to make sure we were having a good meal.  He even tried to photobomb us.. that rascal!Meter parking on the street, and its free after 8:00 pm.  Otherwise, bring coins or use your credit card to pay for parking.If you've never been to LA Paella, it can be tricky to find.  Rely on your GPS, and keep an eye out for a tiny street inlet.  Its not on the main drag of San Vicente."], ["Barbara L.", "LA Paella is as close to an authentic Spanish restaurant as you can get in Los Angeles. We ordered the seafood paella for two, and while it's typically a bit on the dry side, I love a paella to be more \"asopado\" so we asked the waitress if that was possible and they switched up the rice and were able to cook it with a bit more broth for us.Definitely worth the 30 minute wait for the paella.  We had a few tapas to begin with and ended the night with a chocolate mousse and an amazing Crema Catalana (creme brulee).I'd recommend arriving early for dinner or making reservations as space is limited inside."], ["Rd C.", "It's a small restaurant, quiet, very nice.  Good food and wine.  Good service."], ["Rusa B.", "Came here b/c of the high review and super disappointed ... we tried the garlic scallop, grilled squid, wine sauce mussels, monk fish and one of the paella. all seafood are super low quality and not fresh!! The paella is so off too. Not sure how they get the high reviews..."], ["Food C.", "i hate to give them a 2 because the service was pretty nice and everyone was friendly but the food was just \"ok\" to me. I did not try the paella but the other things I had here were again, just \"ok\" but did not seem to warrant the high prices for relatively average food. the sangria was not very good at all. in fact, i actually hated it. im not sure how you can make bad sangria but they managed to do it. the sangria looks good in the pitcher but it was VERY watery. I think they use boxed red wine and it almost tastes like someone pours cheap red wine, water, ice, and soda water and a few pieces of fruit into the pitcher. Its really quite bad. I have had better pre-made sangria from a bottle.  the place itself is really cute and awesome for a date. very intimate. service was ok. I had to flag someone down for my check even when I asked the busy boy for it and he never brought it so i had to flag someone down for it. i guess i was just expecting something that would blow me out the water but it was just \"ok\". the bread was very hard and tasted stale and old. I did not eat any but maybe one bite. It was not edible. maybe i got the wrong things but unfortunately as nice as they are, i would never come back.Sometimes I dont understand why people rant and rave about a place and when you try it, it's not that great. The sauce the mussels came in had no flavor. It's just bland, bland bland. VERY overpriced."], ["Desiree Michelle M.", "I really like the ambience of this place. We got the pasta seafood paella which is Cataluña style. It reminded me of Barcelona and the texture was just right. I just felt a lack of something but maybe I need to try the actual rice paella that they are moreKnown for. I will be going back to try that. I really liked the tapas. The croquetas & patatas bravas were on point in taste and everything. Service is really good and helpful staff."]], "Cascabel": []}