{"Tsuri": [], "Sushi Zo": [], "Sushi Ippo": [["Felix L.", "Eating sushi is a lose-lose situation to me. I find it unsatisfying to eat 10 pieces of sushi for $20 to $25 and then fill up with cheap pizza or hamburger afterwards. For the same price, the more reasonable alternative to me is AYCE sushi, where I can order as much as I need to be full, although the quality of seafood is usually compromised and sometimes the food is actually inedible due to problems with the preparation of fish or rice. The best scenario for me is to find AYCE sushi service that is up to the standards of basic Japanese sushi bars, but then so far, none exists in LA. After hearing about newly opened Sushi Ippo and sold on their Yelp description of \"Premium quality sushi\", I stopped by for lunch. I didn't know what to expect, since there were no photos of the menu uploaded on Yelp. Turns out that this restaurant is still in soft opening phase. The servers were still learning the table numbers and trying to figure out when to take away finished plates.After browsing the menu, I found the sushi variety to be fairly \"run of the mill\". There were no premium fish as I thought there might be. One unique item was called the \"white fish volcano\", a baked white fish smeared with a mayonnaise or cheese-based sauce.I noticed that the chefs at Sushi Ippo sliced the fish very thin and placed it on top of a very small ball of rice. One of the energetic chefs who had previously worked at Morimoto in Napa told me the motto of Sushi Ippo - \"we don't want to fill up customers with rice\". If you like the nigiri style at Sake2Me, then you'll probably like the sushi here also. Personally, I found the rice to be a bit problematic; in fact it was probably the worst aspect of the meal. The rice consistently tasted a tad more salty than sweet, which was a weird combination. In addition, the rice was hardly molded into a tight ball, so the grains often separated without effort when I attempted to pick up the nigiri. Sometimes the grains stuck onto the plate. It was a challenge to pick up the fish and rice without one element collapsing.Moreover, the chefs appeared to only use one type of topping for the nigiri - raw onions - which wasn't very thoughtful or interesting. It does complement albacore, but does not really pair with red snapper or mackerel, I think there are better sauces for those types of fish. The final issue is one that most AYCE sushi bars seems to have - for the sake of speed, all the fish is pre-sliced in large batches and then stored back into the refrigerator. As a result, the tuna had a noticeable freezer burn mouthfeel. Despite these problems, there were many aspects in which Sushi Ippo outperformed their competitors. Most of the fish were reasonably fresh for AYCE standards. Particularly, the octopus and squid were very tender and arguably the best I had for AYCE. My other favorite was the albacore tataki with a thick meaty texture and addictive smokey flavor. All of the other fish besides the tuna were very standard. Sushi Ippo should be recognized for its ultra clean sushi bar and seafood storage, plus the cheerful attitude of the sushi chefs' which is not easy to find at AYCE sushi bars. Finally, this place is appealing because even during lunch time, there were at least 5 sushi chefs and some kitchen helpers available. The food was prepared quickly - I never waited more than 5 minutes for an order to be brought out. At the moment, it's possible to be in and out for AYCE sushi within a 1 hour lunch break."], ["Ann K.", "All you can eat sushi. ENOUGH SAID.It's about 20 dollars for lunch and about 30 bucks for dinner. The menu is extensive and includes all appetizers, salads, rolls, as well as nigiri. The fish itself is decent for an all you can eat. GO NOW as it is their grand opening. Restaurants usually tend to use better quality ingredients when they first open. Lack of customers lead to worse quality overtime. I think it's refreshing to have an all you can eat sushi restaurant right in the heart of Ktown. However, we all know the pitfalls of an all you can eat sushi restaurants (e.g. TODAI). It's really important to find that right medium between the quality of the fish and the price in an AYCE restaurant. I think having a continium of customers will ensure freshness. As fellow sushi lovers out there know, FRESHNESS IS OF UTMOST IMPORTANCE WHEN IT COMES TO FISH."], ["Alice C.", "New AYCE sushi place run by Korean, but the sushi quality is pretty good, and it is really good in AYCE standard. AYCE include not just sushi, but a lot of other dishes that include udon, yakisoba, and even bulgogi. Basically you can order three rounds, and they will even let you order one round of uni, but everything else you can order one order per person each round. Some of my favorite is hamachi, unagi, and they have really good roll. Tempura is also good.They do have rules of not wasting rice, but they don't put a lot of rice with each nigiri. Decor is good, the table is a bit too high for me. Service is really great though. $20 for lunch, $30 for dinner, and you can also order el la carte."], ["Christina J.", "Second time coming here for the AYCE.What really bothers me about this place is that even though it is rarely busy when I visit, they still manage to get my order, that is written down on their AYCE paper, wrong. The first time I came here with my sister and mom, there was a fly in my miso soup. Instead of believing that there was a fly, they had every member of the waitstaff and the manager inspect to verify that it was indeed a fly, which I found to be a bit insulting. After the fly incident, we waited for more than 20 minutes for the salad that we ordered to never be served to us, among other food to be missing. During our second round of ordering, we noticed that the quality in the fish dropped from a 7 or 8 to a serious 2. The fish that was served the second time around was horribly dry and had very bad freezer burn.Second visit, again not busy at all, food is missing/never served and waitstaff get what is brought out wrong. When I brought up that food was not served, waiter says he will take a look at what has happened and never came back. Had to flag down another waiter to let him know that I didn't want what was missing and to just bring the check. Really annoying to do considering there were less than 10 people in the entire restaurant.  The sushi is not terrible in quality, but seriously lacking or inconsistent in the service department. Gave this place two tries and will only be coming back as a last resort."], ["Jen R.", "ITS ABOUT TIME they open up an ALL YOU CAN EAT sushi place in ktown. It's kinda weird because most AYCE sushi places I know ARE usually owned by koreans.. hmmmm. Anyways, this restaurant is located on the first floor on the mercury building. Parking is free right behind the restaurant.I went here on a Sunday night with 3 other people. Dinner AYCE is around $28. The variety you get to choose for your AYCE is pretty good, and the quality is also very good for its price. Some of my favorites were the Peppered Tuna, Mackerel, halibut and UNI (only 1 order of uni per person for AYCE). I was dissapointed that they didn't have sweet shrimp on their list! :( 5/5I think their service was OK. The staff was very friendly and easy to approach. however, there is definitely room for improvement. It was hard to understand our server. Her english was not good and she had trouble understanding our order. and I had trouble understanding what she was saying...  Also, they take forever on their ROLL ORDERS. We ordered a roll in the beginning with our nigiri orders, and our roll didn't come out until the end of our third round of nigiri orders. lol. 4/5FYI They don't have their permit to sell alcohol yet, and this was as of 9/27. I'm sure they will be getting it anytime soon!I thought this place would be packed with younger crowds, but it was both older and younger crowds. The ambiance was like a bar atmosphere when we went during dinner time - Pretty dark and had purple-ish lighting.I will definitely come back since this is the ONLY ayce sushi place in ktown right now - as long as they keep up the quality of the fish, I think this place will soon be packkkked with people."], ["Kristy N.", "Excellent place for sushi AYCE in K town.I really like there services  sometimes  little  busy but still so good sushi in town."], ["Ivy E.", "Sushi Ippo welcome to the neighborhood! Clean, good service, great sushi selection and even their iced green tea is delicious. We'll be regulars!"], ["Rick C.", "This place is amazing!! Can't believe they have ayce sushi place like this in heart of K-town!! Very good quality and presentation for ayce. manager scott seems like nice kul guy who checks up on every table. Good attentive service by cute waitress are big plus!! I will be royal customer! ! Keep up the good work ippo sushi!! Make it last forever! !"], ["Lindsey W.", "The ~$20 lunch AYCE is Monday through Friday only! Was kind of annoyed when it wasn't anywhere to be found on the menu and they didn't tell us until we started to order food that this was the case. On weekends the lunch AYCE situation is ~$30, which makes for a pretty pricey lunch. BF and I ordered some apps but mostly went HAM on sushi. Some of the salmon we had was so fatty and decadent and their sushi comes with pretty small portions of rice, which let us fill up on the good stuff. Sort of made up for the higher weekend lunch prices. However they're still working out the kinks - no alcohol license still (even though all their signage advertises sushi and sake) and they still have issues with staffing (like others have mentioned). Poor server had almost 10 tables before another guy came to help. This and the pricing issues puts them somewhere between a 3- and 4-star review but giving them the benefit of the doubt here since I think they're technically still operating under a \"soft\" opening. Also free parking! Whoop whoop!"], ["Edward C.", "I went to get sushi with a couple of close friends for a birthday dinner. At first thought it was a really nice,clean and big place. But as soon as I sat down and pulled my seat closer to the table the chair had a (needle like) piece of metal sticking out that cut my finger. I told the manager about it and all he did was say sorry and didn't even offer To change the chair for me. I then wanted to order but I didn't know a sushi restraunt can run out of almost all sushi... Spent 200 to get a cut on my finger and to find out the all you can  eat sushi menu was limited to about 5 options of nigiri and rolls ... I guess I can't blame anyone but myself for trying to save a little money on sushi .... Go and check this place out for yourselves."], ["Cho L.", "Stopped by after a busy day at work. Wanted to try it out since it had opened recently. Ambience was nice, clean, and bigger than what I thought it would. Staff was attentive and knowledgeable of what they were serving. Me and my friend had the dinner all you can eat which was about $28  per person. We had almost every kind of sushi on list. Our favorite was of course, the uni. The first round of uni is included in the all you can eat and there on are only $2.99 per order. We ended up ordering more uni since it was soooo good and fresh. Another new favorite of mine was the spicy miso. Never tried it spicy miso but it kind of looked like Tom Yum but tasted like the miso ramen broth. Will definitely be going back soon."], ["Marie M.", "Ventured out to the heart of K-town with the mister last Friday night to try this \"hot new\" sushi joint people have been raving about in Yelp. Super disappointed! It was truly an Epic fail. We had such a hard time finding this place. The gps kept leading us to the H-Mart building. We park and walk around only to find that it was across the street. We get stuck in the crowd letting out from the concert across the street.  Finally find parking inside the parking structure of the restaurant building. We follow the signs from the parking lot pointing to the restaurant leading us to the front entrance on Wilshire Blvd, which was closed. So we had to back track and walk around the parking structure. Finally get to the restaurant only to be greeted by someone saying there's no more AYCE at 10 PM. To our disappointment, we agree to do a la carte. Tried to order the beers on their menu, only to be told that they don't sell liquor yet since they're still waiting for the license. Come on! Why even put it on the menu?! Ridiculous!!! Didn't find anything extraordinary about this place. Very overpriced. Sushi was ok. We dropped $90 for a meal that was not even worth half of what we spent. Too bad this place disappointed me. It had such potential. Never coming back again."], ["Audrey C.", "Went in for dinner at around 9 and ordered the all you can eat dinner and they ran out of practically everything.... No shrimp no halibut no uni .... Whats the point of an all all you can eat sushi when you say you dont have all the expensive and delicious entrees.... Half way into the dinner a small bug came out of my dish and all the manager did was say sorry i have nothing to say.... First time here but a horrible experience."], ["Peyton M.", "Didn't order the ayce. We ordered 3 rolls, sweet shrimp, scallop, and one other. I will list the rolls and sushi that were a miss. The portions are very small here.-crawfish roll, over priced and the portion was small. The crawfish was not crispy and was very salty.- uni, for two pieces they were VERY tiny. 8.95 for 2 tiny pieces is definitely not worth it. Every other place I have gone, the size was twice as much for the same price.-salmon hand roll. Three tiny pieces were in the hand roll. 5.00, no thanks.I definitely would not come back here to order off the menu, instead I would do the all you can eat. However the AYcE has many restrictions and you have to add more $$$ to order certain items."], ["Zion C.", "All you can eat sushi in Ktown! Came here for lunch today. When you think of all you can eat you think low quality, but not here. Everything tasted very fresh and delicious! There's a lot to choose from and if you're not up for all you can eat they also have a regular menu. The interior is very modern and the staff are very friendly and welcoming! Will be back again :)"], ["Grace L.", "So much better than i had expected. Went for Sunday dinner. Restaurant was half occupied but waited aboit 15 min to be seated (I guess because of lack of servers). We sat at the table with booth on one side and chairs on the other side. Booth seats were sunken in and low so if youre short, might be u comfortable because the table is too high. Our first round came out pretty fast.. about 10 minutes? Their quality of sushi was better than any ACE  sushi ive ever had. Obviously you cant compare it to places like sugarfish, sushi zo, etc because its AYCE. You get what you pay for you know?I liked how they didnt give huge portions of rice for their sushi and their fish was was on the fresh side. Uni was so so because the quality wasnt that great but it wasnt gross. Their service is great and they are attentive to your needs.. they keep watch and when your'e done with a plate, take it away asap. Refill water if its empty, etc.I might want to come try lunch too one day. Will def be back."], ["Hwang J.", "Great great sushi for the priceMostly ayce sushi have too much rice so that you can hardly feel the sashimi but this place is where you can have real sushi with not too much rice"], ["Esther N.", "Came back here again this time for lunch... Ill get staright tk the point again:Service- still attentive. Cant complain.Food- the rolls and some sushi (esp salmon) are still great... But the rest of the sushi left an unpleasant aftertaste. It felt like as if the fish were not cleanes properly, leaving hints of bitter bloody taste in my mouth. The unpleasant taste became stronger after drinking water. Hm.. Makes me want to think if its worth paying $20 for unlimited.While the spicy miso soup was great, the udon was extremely sweet. In conclusion... I will go back only for rolls and some sushi."], ["Michelle C.", "I didn't do the all you can eat option but ordered the rolls separately. We ordered 2 rolls at first and the other 3 later. I think the server got confused that we were doing the ayce option and the later 3 rolls were substantially smaller. My friends and I paid around 70 without tip for 5 rolls that were worse than roll roll roll. Also there were a lot of servers but it was very disorganized and we still didn't get good service which was weird... Won't be coming back."], ["Sugean P.", "I am surprised it took this long for an AYCE sushi joint to open in la. There's a bunch in riverside where I went to college but you'd think a huge bustling city like la would've already had one by now? LolAnyway, I tried this place out w a couple friends for dinner. Dinner price was about $30 and they had a huge selection on their menu. Not just nigiri and rolls, but they had udon, yakisoba, chicken etc. like a lot of people here mentioned, they just opened so the servers are still learning the rolls and are a little slow. However, a lot of them don't speak English very well. One of the servers were explaining something to us and then had to stop and ask if we knew Korean & lucky for her, we did lol. (Note to management: yknow non-Koreans love ayce sushi too right? You guys should def hire some more servers who are bilingual. In ktown?! those are not hard to find haha)Service was friendly enough though and I have no complaints there. But lemme get to the food...it was amazing! Obviously the slices of fish on their rolls are pretty thin but this is pretty common at ayce. But the quality was decent and they didn't pack everything w rice which I looovvvved! However, and I'm gonna go off on a bit of a tangent here, I'm a picky eater and I hate cucumbers (sue me). I requested no cucumbers on all the rolls w our female server for the first round and she said she will let the chefs know. Great! For the second round, I requested no cucumbers and a guy server comes over to us and says for ayce, there are no substitutions. Ok..? I mentioned that they did it for us the first round and he said it was a one time thing and substitutions in general are not allowed. I asked him if the rolls are premade and he said yes. So yeah there you go yelpers. Lol the rolls here are premade. I didn't want to cause any trouble so I told him it's fine and to just make them as is. I'm just a picky eater which is all on me but if someone were deathly allergic to something in their premade rolls..is that too bad for them? They're just gonna have to drop dead in Sushi Ippo? That's another rule management should change. The food was great (but we'll see if the quality is still there once the restaurant is more established). Service was good but as a former sushi server, I noticed a lot of things that could be worked on (i.e don't take away plates when there's still food on them and customers are still working on them! They did this to us several times and at one point my friend got pissed lol) I still really liked it here though and I know they are still training their employees and working on kinks here and there. Sushi Ippo is still a godsend and I'm excited to try them out again :)****edit****So the manager just messaged me saying that the rolls are not premade and are made fresh. And they changed the rules yesterday about substitutions. Thank you for listening to your customers' comments!"], ["Tomoaki N.", "Sadly this place is a wreck . I was so excited to be here  with my wife until the incident occured . First order of the sushi  yellowtail they will give you the fatty part then you order more but the fish will be not the same .Then the salmon collar I had ordered was spoiled . I notified to the manager . But what he told me is its not spoiled its actually yellowtail collar not salmon so it taste different . Come on ! Really ? I really wanted him to take a bite off the piece but he wouldnt try it and hes telling me that its not spoiled when I literally had to take the food out of my mouth and go to the bathroom and rinse my mouth!The collar was precooked it was so clear that it was wrapped and microwaved . Not freshly grilled   . I dont know the difference on how the fish taste? I worked more than 3 years at a sushi restaurant as a manager , I know the difference of yellowtail collar and salmon collar and absolutly know the difference if the food was spoiled. I mean come on look at the sushi showcase almost all the fish is sliced up and not even  preserved right in sushi trays . I can see the skills of the chefs and boh . Sadly managing was not up to par as well. One advise if investing this much money on interior please invest on higher quality employees ."], ["Yooni L.", "Note that Uni is limited to 1 order per person.  Also the 2nd round comes with way better quality but you get charged $2.99 per order.  I mean seriously I've never seen Uni not even wrapped with seaweed.  But when it's the 2nd round it comes with double the amount of Uni.  I've been fooled by the photos.  And the server hovering over us mentioning that any left over will be charged.  I feel pressured to eat here.  Not coming back again."], ["Timothy H.", "New AYCE sushi place in ktown. They're brand new and currently don't have their liquor license yet so they only serve food. The sushi quality is better than most AYCE but the sushi is so tiny. It's kind of cute but not so bad because the fish to rice ratio is pretty good. They also have a variety of non sushi options such as udon, fried rice, kbbq, etc. It's pricy but worth the try. Surprisingly not too crowded."], ["Noelle K.", "My boyfriend and I were on our way to Jamba Juice when we spotted this place and saw that it had just opened. We decided to give it a try. We both had their lunch combination: Sushi/Sashimi + Tempura + California roll. The dishes were a decent amount and came with miso soup, salad and rice! Quality of all, especially the sushi/sashimi and tempura were very good! Was amazed at the quality and amount of food for a good deal at $12.95. There was all you can eat sushi with a great selection of options from appetizers, sushi to rolls for $19.95 lunch and about $28.95 for dinner. They should be serving alcohol this coming week as well. The staff are super friendly and checked in on us several times. Everyone greeted us when we entered and left the restaurant. Definitely worth a try and we will be back soon! :)"], ["Lora K.", "First time here, and the food is great! There are a lot of people so wait time between is long. Other then that everything is good. Its clean, service okay, and foods great! Also the price is good. Definitely a place to visit if in LA!"], ["Kevin W.", "Really nice staff, sushi was pretty good, did the all you can eat and thought my stomach was going to explode. A bunch of the rolls are imitation crab though which I personally am not a fan of."], ["Qha H.", "I tried Ayce today lunch. Food was great and the ratio of rice was good. Service was great as well. For the price I will definitely come back. Only thing that bothered me was the Manager.  His service was good but the way he treated his staff was really bad. It almost made me to leave the place. He was so rude to the chefs and servers. He needs to understand that he doesn't own them...they just work at the place. I had owned a restaurant and worked all my life in the field as a manager, server and chef....just one recommendation to sushi ippo... you need to train your manager to train others."], ["Rob Q.", "This place is amazing , really good quality of sushi. Friendly staff, nice atmosphere and they serve ice green tea in carafe. Love It !!!"], ["Jess P.", "wish they had a dinner combo/special. food was good but thought it was a bit expensive"], ["Jessi L.", "A friend told me that theres a new all you can eat sushi that opened up . We decided to go today. Strangely its pretty dead. When we walked it there was only 1 table then few after us.. We all wanted to do the all you can eat so we started marking off all the food we wanted on the paper menu. The waitress came and took our menu. It start off good, meaning the food started coming out in order then it stopped. We were confused for a bit thinking if this is all we ordered, so we asked if we can order more. They said that they'll bring the paper menu back. we add on what we wanted to order and also realize we didn't get half the other stuff we ordered. We let her know and she confirmed and said they'll bring it out soon. Then another gentleman came by and said that the first order didn't go through. But they already marked it as it went out. bleh .. That \"break\" made us full and not want to eat anymore. We ordered more but that didn't come out as well. We just ask for the check, and normally they would say that their are some food still coming but i think they forgot the rest of our food. ** Reminder - You gotta keep asking about your food. LOL Food - Sushi seem fresh , and the appetizers we ordered was good. Their is udon is sweet and very salty. Their ice green tea is really good. Unlimited as well. Over all it was okay."], ["spree l.", "You ever have a sushi craving? You look through the lunch specials and and then you look through your list of options: great sushi; few pieces for many dollars ($40+). Mid-grade sushi, few more pieces for a good amount of dollars ($20+). A Mitsuwa grocery store sushi pack, meh-quality at a few extra dollars at about $12. Or...fairly average sushi but as much as you want for $20. Ding ding ding! I'm all about that salmon nigiri.The quality of the sushi here is between \"meh\" and mid-grade, but if you've got that craving, you can eat your fill quite happily for about $20. The fish is fresh, slightly tasteless, but still hitting the spot. None of the sushi really stood out but I liked the green mussel appetizer and the spicy tuna roll on the crispy rice. We had about 15 orders of nigiri between the two of us as well the aforementioned items. We didn't go for rounds two or three as we were pretty full. (Ok, also my grandfather didn't think the sushi was that good, but again, AYCE, right? He's been having trouble with tasting and smelling things lately, so I thought I'd take him to get some of his beloved sushi.... But if he's tasting things well enough that he can look down on average sushi, I'm pretty happy!)This is the first AYCE sushi place I've been to, so I can't compare the quality to, say, all the AYCE sushi places popping up out in Orange County. (I feel some research coming on.... *g*) I'm pretty happy that there *is* an option right here in Koreatown--and with parking, even! So four stars from me. I'd definitely be back for lunch whenever I'm craving more than 10 nigiri and not too caring about the melt-in-your-mouth quality of better sushi.Certain items are only available on the dinner menu, the uni for instance, or the crawfish roll. FYI.Service was great and everyone spoke both Korean and English. The staff are obviously very focused on ironing out the system and getting the service down. Our food came out pretty quickly and the presentation was marvelous. I wish I'd gotten some pictures before we started scarfing down."], ["Willis H.", "It's a great place for meeting up with friends for drinks and small plates.  They even have TV's with sports playing in the background if you want to catch a game.  The AYCE is a great deal, too.  I'd definitely be back."], ["Victor R.", "For SUSHI lovers this place is great!!! Good quality, many options, great service!! I'll be coming back for more!!!!"], ["Robert L.", "By far the most amazing Japanese food I have ever had being that I actually have spent time in Japan and experienced many types of Japanese food hands down the best sushi rolls"], ["Ro C.", "One the best all you can eat sushi place I went. I don't really like ayce but this place has some really great high quality sushi. Everybody should try yourself because me writing this won't explain how good this place is."], ["JW I.", "been to this place three times in the last 10 days.  while service and all others have been good, sashimi quality has not been very consistent.  the first time was quite impressive, second time was subpar (particularly salmon), third time was mediocre.  given the fact that this place is AYCE, i do not have a $$$$ place-like expectation and my rate is purely based on their sashimi quality (somewhat inconsistent)+size (not big but fair) and rice-fish ratio (good enough to waste none).  i would surely come back (for weekday lunch) and change to 5-star if/when quality holds consistent.  hope to see this place survive and thrive as there's no other decent AYCE sushi place in k-town."], ["Daniel C.", "I was hoping something awesome would open up in this space given that I live above the restaurant.  I was secretly hoping for a combo of a taqueria and liquor store.  Anyways, the sushi here was not that bad for an AYCE place.  The rolls were not that bad either.  However, my favorites were the garlic edamame and shishito peppers.  One interesting/sour note - My wife and I were finished with round 1 but they had yet to clear our table.  We put our orders in for round 2 and then when they started to clear our table, we were informed that we would be charged for leftovers.  Cool..I get that.  I looked at our table and EVERYTHING was eaten except for 1 piece of an 8 piece roll.  The roll was good but we couldn't finish the last piece because it was too sweet.  We were then informed that we HAD to eat that 1 piece or else we would be charged.  I asked what would happen if we didn't eat the last piece and was informed we might be charged for the entire roll but would be up to the manager's discretion.  However, it is okay if we have leftovers for non-sushi/roll items. So geebunnapuh..I ate that last piece.  We got our second round, which included another roll.  We ate all of it except for 1 piece and then asked for our check.  No issue was made of it...C'mon..you have to use your common sense here.  We weren't being wasteful and I had previously told one of the waiters that I live right above the restaurant.  I know that at any AYCE, one can be charged for egregious leftovers.  However, the policy here is extreme.  You neglected to tell us about your 1 piece leftover policy at the beginning and then tell us this mid-dinner.  All the facts point to maybe just NOT telling us at all and allowing us to eat our meal in peace? Other than that, we might be back.."], ["Young C.", "First time here and everything tasted great! The quality of the fish was very good compared to other ayce sushi places! The staffs are very friendly and attentive! Definitely coming back!"], ["Malia S.", "Very Yummy and the \"all you can eat\" option is totally worth it! I've gone back 3 times in one week."], ["Patrick T.", "Great to have a new sushi spot in the neighborhood.  We went in to try out the all you can eat option for dinner which is priced just under $30 per person. The staff is very attentive but seem to have a few kinks to work out before they have a truly efficient operation. We had 3 or 4 different servers (all of whom were very kind and attentive) but they missed one of our orders I think due to lack of communication between all of them. The rolls were good. We had a few favorites including the Marilyn mon ro and the seared pepper tuna. The other rolls were also good but not really show stoppers. I'd recommend looking at the menu prior to ordering the ayce to see if it falls in line with what you would normally pay. We did the math at the end of our meal and realized that we would have paid roughly the same if we had ordered individually.  That said, we ate a lot of sushi, enjoyed each dish, and liked having the option to order more. To sum it up, this place is much better than other sushi spots in the immediate vicinity. I highly recommend dropping by and stuffing your face."]], "What The Fish": [], "Sushi Enya": [], "KazuNori": [["Tammy T.", "Fun ConceptCasual LocationNot a substitute for Sugar FishLacking valueI'm a huge Sugar Fish fan (used to eat there at least once a month, maybe more). The fish was always fresh and the rice was at a good temperature. The flavor combinations were fantastic. With that said, I was excited to try KazuNori. It's a pretty casual setting where you sit, fill out an order form, and watch your rolls come to life. It's that sushi bar feel but less pretentious. Overall though I felt like the rolls weren't as flavorful as what I was accustomed to at Sugar Fish and it was nothing to write home about. It's a quick casual location though (in contrast to long waits at Sugar Fish) so I can see the appeal."], ["Julie T.", "I never liked rolls or hand rolls until I came here! It's been in my bookmarks forever and finally got to check this place out! I came on a Monday 5pm and it was pretty much empty. I started out with the 4 roll for $13! I got the daily special (toro), scallops, salmon, and blue crab. Everything comes made to order so I was told to eat it right away when the chef gives it to you.EERREMAHHGOD! The rolls were so good! The seaweed was so crispy and broke so perfectly in my mouth. The rice was warm and complemented the cold fish in the middle. I love every single roll except the blue crab. It was kinda boring and made me want another to finish it off right. So I ordered the yellowtail and that helped me end a perfect meal.They were nice enough just to add it as a 5 roll combo and the total was $22 with tip included. The parking here sucks but other than that they have such simple and amazing hand rolls here!"], ["Andy N.", "The best handrolls of all time! KazuNori is so good! It's a handroll restaurant created by Sugarfish. It's a bar type seating here. It's very simple. The fish all chopped up. The most important parts to all this is the nori and rice. The rice is just delicious! The nori is fresh and crunchy. I ordered the 4 rolls for 13.50. There's also a 16% service charge and they recommend no tipping. The 4 rolls started with the toro handroll, then the salmon handroll, 3rd I went with a cucumber handroll, and finished with the blue crab handroll. I wish they open more locations of this awesomeness! Recommendation: choose a pre-set handroll menu"], ["Grace C.", "Awesome place for quick eats! Might be the best deal in LA! Seriously. 5 delicious hand rolls for $17.50! If I lived closer, I'd be here at least once a week. I'm sad it's so far :(Walk in, take a menu and use their little golf pencils to mark your order as you wait for a seat. You'll have to seat yourself around their bar and hand them your order sheet. They then make your hand rolls one at a time so the nori stays crisp while you enjoy the deliciously wrapped fish in a bed of warm rice. Ohmagerd... Sooooooooo gooooooooood!!! Nom Nom Nom... Once you're finished, ask for the check and take it to the register to pay. That's it. Simple, right?! Enjoy :D"], ["Kayla M.", "I have died and gone to hand roll heaven!No seriously, this place is AMAZING! Same owners as Sugarfish so the concept is similar. Prompt and speedy service. Your meal will not last longer than 45 minutes. You are in and out without even noticing how quickly time went. Self-serve seating so the line can get sort of crazy. I was informed that there were only 24 seats total at their sushi bar so just imagine how crowded this restaurant gets during peak hours! Luckily, I arrived with my party of 4 just in time. With about 10 people ahead of us, the wait was only 20-25 minutes at best. Not bad at all considering that there were people waiting down the street when we left. Now for the hand rolls...sensational. Like I can't even express how pleased my tastebuds were. I ordered the 4 hand rolls meal that included the daily special (yellowtail), salmon, toro, and bay scallop rolls. Favorite of the night was the bay scallop hand roll. It was just phenomenal!! I thought about it all night after, seriously. A friend ordered the sashimi of the night (halibut) and oh man. Delicious!! Like nothing I've ever tasted before. They also serve their sake cold and in this adorable glass jar. You can opt to take the jar home with you also! Super cool. All in all, this was the best meal I've had in a very long time. I look forward to coming back!"], ["Grace C.", "LOVE!!I am a big fan of sugarfish so when I heard they opened a handroll bar version- I was ecstatic.  Luckily it lived up to its name, my first visit was amazing and I now go whenever I find the time. Dinner gets pretty packed but the wait isn't too bad because the concept is to eat and go quickly.  I always get the 5 handroll set and always add in an extra blue crab handroll (i love themm!) so 6 handroll total and I leave stuffed. I'm a pretty small girl with a big appetite so most people leave satisfied with 5. Overall great food, great service and interior is small but shows a great use of its limited space. 10/10!!"], ["Yasy R.", "They have one of the best hand rolls I've ever had. Great quality, good service and good pricing. I wish I lived closer to here so I can go everyday. I would suggest this place to anyone that likes fresh fish and great tasting hand rolls or sashimi."], ["Anna T.", "Oh my goodness, this place is so freakin good! I came here with my friend on a Monday around 4pm and there was no one here. I was excited because I've been waiting to come here for so long! I ordered the 5 hand roll combo for $17.50 (including tax and tip was $22). I was really blown away by the toro hand roll, this one came out first as it was the daily hand roll. This was by far the BEST one. It also came with salmon, blue crab, scallop, and lobster. The others were very good but did not compare to the toro for me. I think the best part about their hand rolls are the warm rice and the crispy warm seaweed it is wrapped in. It really makes the hand roll so awesome. I can eat here all day! Except that parking is a pain. You can park in the garage but it's usually pretty expensive. After eating at this place,  I am dying to try sugarfish now. This place is a must eat for those who appreciate good fresh hand rolls!!!"], ["Michael M.", "I really like this concept. Sushi, but they only serve hand rolls and have a sashimi option. They don't use plates, just paper place settings and plastic trays and cups. There are no tables, just a large bar. This makes it very quick with a high rate of turnovers. All the rolls are very good. They roll them super quick and i usually get about five hand rolls. The lobster and toro are my favorite. You have soy sauce, ginger, and wasabi, and thats about it. Very simple but good quality of fish and great warm rice. The staff is very nice, especially the manager. There is usually a line to get a bar seat, but it goes pretty quick. The price is very reasonable for what you get. The only downside is that parking can be tough."], ["Stephanie C.", "Oh, how I'd love to have a burrito-sized blue crab hand roll...I'm glad we live ~15 miles away from KazuNori, because if it were a neighborhood joint, we'd be forming a fast and pricey habit at KazuNori.  Simple, fresh, and delicious.  They could stuff the rolls a bit more to balance out the rice portion.My only downer is that everything they use is disposable, though the plates, cups, etc. looked compostable.  Nonetheless, the thought of all those throwaways make me frown."], ["Sarah L.", "Was looking for a quick lunch in DTLA over the weekend and was in the mood for sushi. I've been to the sister restaurant, Sugarfish, but didn't really want to stop there for a lengthy dine-in experience. To my surprise, I found the perfect answer... Kazunori! Yes, the prices are still on the steeper side, but the quality of the fish, the signature warm rice, plus the crunchy nori exterior make it completely worth it. We got the 5 piece (toro, scallop, salmon, blue crab, and lobster). The hand rolls were made and placed in front of me one at a time. It's as if the chef was orchestrating a sushi hand roll meal masterpiece. The only comment I have is that the seating is limited and is a bit unorganized. We didn't realize until having stood in line for a good 10 minutes that it was free seating; the party in front of us was not filling in the open seats because they were waiting to sit together (note to self: not good for groups). I wish that these guys were on my favorite delivery app, rushorder. I've tried postmates, but they take way too long and get my order wrong most of the time. Until then, I guess I will just have to hope to get seated and dine-in.Will definitely be back!"], ["Lauren M.", "How could a menu so simple, with food so simple, be so good? I ordered the 4 hand roll set menu, which included the toro, scallops, salmon, and crab. They were all delicious. The warm rice and crunchy seaweed put them all over the top. If I had to pick a favorite, maybe I would choose the scallops and toro, but they were all bomb! Believe the scallop hand roll was tossed in a light/sweet mayo, which melted in your mouth. Loved the set up. One counter with one sushi maker. Got a roll every 5 minutes or so (with a full counter)."], ["Anthony B.", "Simple. Fast. Good.Sit down. Mark what you want on the menu. Grab some iced green tea. Definitely grab some iced green tea. Rolls are super simple, but they're really good and consistent. They also come out pretty quickly.Price- you're looking at $10-20 depending on how many rolls you get. Not bad for good sushi.Staff is friendly and nice.Winner in my book."], ["Christina P.", "I tried the 5 handrolls and the salmon sashimi and they were so good!! My favorite would be the blue crab roll and also the lobster roll. The food is filling, but it doesn't make me feel like I overate. The setup of the restaurant is like a small bar so it was a completely different dining experience. It operates just like an actual bar because the staff goes around asking if the customer needs anything else and they'll just add the items to their tab haha I thought that the price of the individual handrolls were pretty pricey. Just a cucumber roll is $4 and the most expensive is $4.75 for the lobster roll. I would suggest getting either the 3, 4, or 5 handroll sets because they're cheaper! Definitely going to come back here!"], ["Candice N.", "It's no secret I'm a huge fan of Sugarfish, so when I heard that Kazu Nori was opening in Downtown LA, it was a trek in high heels I was willing to make. Located on Main St. between 4th and 5th, Kazu Nori is a small space that fits about 20 people around a bar. You get to choose from a combo of three, four, or five hand rolls (a set menu), or individual hand rolls.  A customer will be quickly reminded of the hand rolls at Sugarfish, including the advice that the hand roll be consumed immediately, when the seaweed is still crisp.  I ordered the five hand roll menu, which included their daily special (yellowtail!! my favorite :D), your choice between bay scallop and cucumber (bay scallop, duh!), salmon, blue crab, and lobster. You can also order it to-go, and they will cut it in to cut rolls for you (which is exactly what they do for to-go orders of Trust Me at Sugarfish).Total fan!"], ["Tiffany Y.", "Dare I even say that I love KazuNori more than I love SugarFish!? Great and simple concept. Perfect if you want to be in and out and don't want a long ordeal of a meal. Warm rice and tender fish are my jam and handrolls fill you up! Prices are not bad and it's a set menu so you don't have to overthink it."], ["Daniel K.", "OMG I LOVE THIS PLACE. YES, ABSOLUTELY LOVE IT.When I'm trying to show my friends a good time and the amazing eats that DTLA can offer, this is definitely on my hit list. I try for non-peak hours though, since this place can get pretty poppin and it's not that big.From the same people that brought you Sugarfish, comes a sushi bar that only offers hand rolls. You can get these rolls a la carte or grab a 3/4/5 hand roll combo. Go for the combo friend, you won't be disappointed. And make sure you get the toro. PLEASE GET THE TORO. That fatty tuna will change your world. They also let you substitute some of the rolls offered on the combo, so don't be afraid to ask! Shoot, I'd get 3 toros haha, but no, try out some of the different options...then get 3 toros the next time you go! Parking's painful though. Street parking in DTLA is never fun. But the rewards....toro........."], ["Anh L.", "One Word - Over Hyped!Food isn't orgasmicIt's better than Average5 Rolls runs about 17.50 + 16 percent Service ChargeWhich is the tip too I believe.Cannot Togo the rolls :( WTFIt's literally a food barI wouldn't wait to eat here again, I prefer their Main Location Sugarfish. Service is Spectacular!"], ["Tony D.", "The Skinny: OK place for hand rolls in LA, but I feel like there are other places that would have better food. The place is more about environment than hand rolls.Environment:It's a cool little place along the busy streets of LA. The parking is pretty horrid; you would have to park in the structure around the block and walk there. However, can't complain too much because that's all of LA. The place is super clean and neat, and the place only seats people in a bar fashion. You come in either on the bar side or the to go side.Service:Service is a little slow here, but that seems to relate to understaffing. There should be more workers at the desk, and it takes a long time for seating in a larger group just because of the nature of the bar seating.Food:Hmm, I guess for the 5 roll price, it looks good on paper. However, I was expecting the hand rolls to be a little larger than what we actually got. The sushi for the handroll was okay, though some of it I felt was not as fresh as it could have been. Maybe a bad day. I would rather go to a different place so that I can order something other than the handrolls, because that's all you can get here when seated. Their iced green tea is good, though.Overall: 3/5If you are really craving handrolls and don't mind bar seating, check this place out at least once. It's not a place I'd come back to for the food, but it's a nice place to hang out and chill while having some ok handrolls."], ["Nida K.", "This is the casual side to Sugarfish which means quick service and more bang for your buck. KazuNori specializes in the handrolls and you can get a whopping 5 rolls for only $17.50. I always go for the 5 rolls because this set includes my favorite: the lobster roll, and I would be an idiot otherwise, because they charge $7 for the lobster roll on its own.If you're lucky, you won't have to wait in line. There are no tables, just counter space, and right after you order, your \"chef\" will prepare your rolls magically before your eyes. You'll be so amazed, because right as you swallow your last bite of a roll, another magically appears in front of you. They time it perfectly because they know you're hungry and also they want to get you out of there ASAP because you're taking up valuable counter space. Just kidding, they don't ever rush you which is nice, but it's hard to linger for too long when you've already eaten all your rolls within 20 minutes of sitting down and there's a line out the door of other hungry people eyeing your seats. Fast, casual, delicious... KazuNori delivers an experience that quickly satisfies!"]], "Nabeeya": [["Tank M.", "Surprised to find the place in a dead end.3 or 5 combo rolls are perfect fit to 2-3 people.Sashimi bowl contains rice and soup, which is wonderful.Wasabi hidden in the plate.Best sushi ever met in LA."], ["Kiley L.", "I think I had really high hopes for this restaurant because I have such great reviews. However when we got there, I was really not live in the food.The restaurant itself is super cute, reminds me of the cute little restaurants in Tokyo when we were there last year. It has a very authentic Japanese feel, so I definitely dig that aspect of it. We ordered a sushi roll called the Sunfire and that was actually really really good, but I ordered a beef dish for my main course and the beef was way too chewy. The blue ordered the seafood Ramen, and he really liked the amount of seafood he got however the sauce they were using was really not that delicious unfortunately. I'm giving them for stars because the customer service was actually pretty great, the lady was super sweet and very helpful. I'm sure there are super yummy dishes on the menu, and if I'm basing it off the sushi then yes you should definitely go check it out, I don't know if I necessarily order another main entrée though.I'd say if you're in the area and there's nothing else open...(like what happened to us), then yes, definitely check it out. Little Tokyo is just a few blocks further though, and I'd say maybe check out by area instead if you have the option."], ["Denis S.", "Listen, we had a horrible experience here. First, the side walk tables are unfortunately located just down wind of the all the traffic on 8th street which meant while we ate raw fish we were accosted by the smells of gasoline and a cacophony of car noises. We would have sat inside but the place was so hot, just so so hot. The service started off not so great and only got worse. We were both very hungry and immediately requested an order of California rolls while we looked through the rest of the menu. This request was ignored and nothing was done until we put in our full order. Mind you, we were the only customers there. We also ordered one of our favorite sushi dishes, avocado and cucumber rolls. It's something we've ordered in a dozen restaurants without issue. Here, the waitress said it wouldn't be a problem, but then when she came out with our food she brought us plain avocado rolls with a side of cucumbers. Just to make it clear that there was no misunderstanding, both she and the chef came out to explain that they had simply forgotten to add the cucumber inside the roll and the side of cucumbers was their way of making up for it. Then, they offered to put extra cucumbers in the rainbow roll we had coming. Never did it occur to them to bring us the avocado cucumber roll we originally ordered or to in any way adjust the bill.As for the food itself, it was average but unworthy of the praise Yelpers have been lavishing on it. Additionally, the low prices that are exhibited in Yelp's three year old pictures are no longer accurate. Overall, you can get much better quality and service for a similar price in downtown LA."], ["Mark A.", "This hidden little gem is perhaps the best sushi in downtown LA. It's really delicious, super friendly, killer prices."], ["Emily S.", "Awww :( I ordered chirashi and ate a spoonful. Something tasted rotten so I spit my food out. I thought it was the veggies so I picked them out and it did taste a bit better. Still, that was sad. So sad!!! I love raw fish like crazy.Might try again another time? And update the review? But after this I'm feeling undeniably reluctant. Looking up on Google how to tell if food is safe to eat."], ["Kara L.", "A great place. The restaurant is sort of hidden and is super small but it is really decorated cute outside with seating outside as well as some seating inside.The food was awesome. I had nigiri and the fish is very fresh and looks great. The owner is very sweet and took really good care of me. Right when I walked up the cook greeted me and came out to give me a menu. I would highly recommend giving it a try. prices arent bad either!"], ["Moises A.", "When I think 3 star,I think, mediocre. Well, that's exactly what this place is, mediocre. The rise in sushi places and \"oriental\" cuisine has def. helped my taste buds become accustomed to the savory flavor of sushi, and while I'm no sushi-snob, I do enjoy a delicious roll once in a while. That being said, this place personifies the feel of downtown, old,shanty, and a little beat up. The parking is ridiculous (as expected),the chairs and table outside make for an interesting sight (homeless,druggies,wanna be models,and possible craigslist murderers) but hey, welcome to Santee and 8th. But I digress,the service was ok. Limited English, but pleasant enough not to drive me away. The food,as stated earlier,was mediocre. The flavor was lacking, the crunchy was hardly crunchy,and the tiger roll,well let's say it wasn't as fierce as a tiger should be, and one big reason for dropping a star, only bottled water. I drink gallons of water (almost literally) and I hate having to pay for so much water (it's arrowhead, c'mon it tastes just like tap water). So,needless to say,I won't be craving this place again but it's always nice to support a local business when I can. But as always,check it out, I guarantee my review will be spot on."], ["Cara H.", "The Nabeeya roll, a California roll with tuna and avocado on top and fried garlic is really good. The fried garlic takes it to a diff level, yum! The Ferrari roll is also good and the baked scallop roll was pretty good too, although it had a lot going on.  My fave rolls are the Nabeeya and Rock & Roll.    The lady is super nice !"], ["Debie L.", "First of all, this place is truly a hole-in-the wall spot. It is very unassuming; it is a little difficult to spot especially because it's at the end of a cul-de-sac. The set up is very cozy inside and with a few small tables set up outside. The service we received was so-so... We had to get the lady's attention more than once, and when we asked her a question about a roll, she just decided to \"give us more time,\" rather than answering the question. That was a slightly awkward moment...The food itself was decent. I had ordered the crunchy roll and my boyfriend got the tiger roll. It was prepared fairly quickly, and it was good but definitely did not stand out from other sushi restaurants. The fact that we had visited during happy hour (4pm- close) made the experience better. It's a relatively long happy hour, but the percent discount isn't as great - a sensible trade-off in my book!Other than those things, I didn't really like that they didn't serve water other than water bottles (of which they charge you for).All in all, it's a good place to go if you're in the sushi-mood and happen to be in the area."], ["Jes A.", "Well, that was unexpected!I saw the reviews were good and it was Christmas Eve, so anywhere would do!We brought a few friends here and we were pleasantly surprised!The woman who runs it is actually Korean. But don't let that fool you.The sushi was was great! All my friends loved it. They gave it 3-4 stars depending. Some of them know some cheap sushi places, so they would rather go there, but they agreed that the food was quality.I didn't see a sushi that I wanted, so she let me create my own, BIG POINTS.I would come here again. It's not much to look at, but it's kind of fun sitting on the sidewalk eating sushi with your friends on Christmas Eve!"], ["Judy Z.", "4.5 stars rounded down!I love getting take out here, and I have become somewhat of a regular. I always get the chirashi bowl and any 3 rolls for $21.99--it is such a good deal! You get enough sushi for 3 people which only costs around $35 dollars. The sashimi is fresh and the rolls are delicious and generous in size! I always call to order then drive onto Santee street and park in front of the restaurant for 2 minutes while I pay for my order. A sushi gem in DTLA! Definitely check it out!"], ["Alice L.", "I'll be upfront and say that I've only had one thing from Nabeeya and I've always gotten it to-go - the chirashi bowl. It is pretty damn good and it's only $12 for a hearty portion of sashimi goodness. There's salmon, tuna, spicy tuna, shrimp as well as some delicious seaweed salad over a bed of sushi rice. I'm no sushi expert, but everything tasted great and it was well worth price. Can't really comment on any other food items since the chirashi bowl is the only thing I've ever tried, but based on this and its price, a solid 4 stars.Really small spot in the Santee Alley area in Downtown. The area's not great and parking's a pain so it's always easier to just call-in ahead of time and then pick-up your food!"], ["SK S.", "I don't know what happened to the previous owners but the quality of food has gone down. I've eaten here for about 8 years. Dressings once delicious are reduced to hot sauce. Portion sizes smaller. Good Japanese food has become cheap fusion, room temperature miso--mind you I've been eating Japanese cuisine cheap and top notch for over 30 years all over the place,  the lady had the nerve to \"correct me\" and let me know miso is not served hot... I miss the old owners, good food served by a guy who went to the market that morning on a bike to buy it. In a few words: pricey for the quality and quantity. Used to be great."], ["Wendy W.", "Three words: Change of management.The cute little sushi shack that I used to love frequenting is still a sushi shack... just with a more varied menu and more options. However, although there is an upgrade in the number of options, I was sad to see the prices go up and the quality go down. It's hard to see the cute little couple that runs the shop anymore, and I feel like that was also a lot of the magic that made me love Nabeeya. It's still a nice place to visit; it's just not as memorable as it used to be."], ["Julie T.", "WTF HAPPENED? The place is renovated, prices are doubled, and the staff are different. Last time (a year ago) I came here I had a bento box for 8.99 I believe. The owners were so nice and gave me another roll because I guess she could tell I love their sushi. I left there so happy and content with everything! Oh and water was free.TODAY......I walked in and I noticed the tables were gone and we had to be seated against the wall with stools. The waitress gave us the menus and I started to noticed the prices raised. It also didn't help the waitress was rushing me to order and asking me seriously 4 times if I'm ready! Ugh so I decided to go with the chirashi bowl for $11 and a $2 bottled water since they don't serve tap water. It was honestly OKAY and nothing special. The fish was a little fishy which scared me since they had B grade for the restaurant. It also came with a seared raw fish that I couldn't identify?Well my bill came out to $14 and I felt like that was a waste of money and .07 mile walk to there."], ["Manuel C.", "The place is barely noticeable, kind of like any downtown Tokyo sushi place I would believe. Yes, it is literally a whole in the wall, and very reduced space which is charming in its own way. The lady was super sweet and polite. The food is awesome. I got the Mexico City Roll and was satisfied with it and the price. The flavor was just ok, but definitely worth the money. The only downside is that they don't serve tap water or beer."], ["Ginger P.", "This hidden gem at the dead end of Santee reminds me very much of old school Alphabet City around East 9th St. / Thompkins Square Park. Another review so helpfully tipped me off that you can text ahead and they will have your order ready for pick up, so I can grab the $9 bento box, and they open early in the morning, too. (If I'm closing that day and going in at noon.) I got the bulgogi today, because they make solid Korean as well as sushi. The place reminds me of an old apt. of mine in NY, because I painted the walls that same pale violet gray, a color called First Light as a nod to my late nights."], ["Katya O.", "My favorite sushi place in downtown! It's cheap and delicious!!! Plus the lady is so kind and friendly..... Sometimes they can't be super fast but it's worth it!!!!"], ["Celine L.", "Came in here for a quick late lunch. This place is surprisingly small, with only a few seats at the bar and two or three tables outside. The food was also at a decent price, with the chirashi at $12 and the chef sushi special 12 pc around the same price. The rolls were about $9, but we didnt have a chance to try them.Chirashi- a wide variety of choices, but the best fish was the eel. Everything else was okay to decent quality, but for the price you get it for, it is most definitely a steal. Chef sushi special- my favorite was the ono and the salmon. Again, okay to decent quality, but you really can't beat the pricing. My least favorite was the tuna, and the snapper was pretty good! Some already have sauce on it, so don't double dip!The chef also served us salmon belly on the house, and that was super freaking delicious. It melts in your mouth and is extremely buttery.. mmm... They also don't have tap water here (only bottled) so the total came out to be around $30. Miso soup is included. Overall, great service (the lady constantly checked up on us) and the price is super cheap. This is the perfect place if you're on the go or looking for a quick lunch!"], ["Lauren M.", "This place is extremely small and very unassuming, but delicious, and I mean delicious sushi! Finding this little treasure made my day and if you're craving great sushi, this is your place!"]], "Murakami Sushi": [["Cady G.", "This place couldn't get any better. Fresh, delicious sushi. Friendly, attentive service. What tips it over the edge is the value. The thing to get here is the sushi bowl. They have a few set options but you can also do a \"make your own\" and completely customize your order. The servings are generous - particularly for the quality of the fish. The bowls come with sushi rice as well as some mixed veggies.The service is extremely prompt and friendly. Our server was extremely forthcoming with recommendations and you could tell she genuinely cared if we were enjoying our food or not (which we definitely were). The ambiance is minimal yet casual. I actually came here after a pilates class and didn't feel weird rolling up in yoga pants and a sweater. However, the atmosphere is nice enough to be a great, yet relaxed date spot as well. This is going to be a go-to for me."], ["Megan S.", "I just love Murakami!They are so satisfying, fresh, delicious, and prompt.I have finally had the pleasure of dining in this restaurant. It is clean, airy and bright! I haven't been getting the chirashi bowl lately and have just been getting nigiri (albacore& yellowtail), tekka maki, and a spicy tuna hand roll. I can't get enough. This is my go to spot!"], ["Nikki A.", "One of my new favorites.Came here on Sunday night with my boyfriend around 8 PM. We were greeted and quickly seated. It's a pretty nice restaurant - casual attire so it's nothing fancy but my boyfriend and I were worried since we showed up in gym clothes. Regardless, the staff was welcoming and kind. We both decided on getting a bowl and were pleased with our choices. We customized our bowls both choosing 4 items. I had initially ordered 5 items but they ran out of Uni. My boyfriend also ordered sweet shrimp nigiri. We came in starving but the fast service and the great portions will have us coming back very soon. Such a great find!"], ["Gary I.", "I remember Murakami back in late 2010 when it was located on 1714 N. Wilcox Ave., a small dark side street north of Hollywood.  It was a small space w/ a subdued atmosphere which served mostly Maki/rolls & Kaisen Donburi/seafood bowls at decent prices, but had no alcohol license.  I mean, what is Sushi without Sake (sah keh)???  Like French cuisine & wine,  the two have an affinity for each other  since they both evolved together over a long period of time, and have similar origins since Sushi & Sake both arise from the use of rice.  I had to console myself by pairing the Sushi with Ocha/Japanese tea in a paper cup.  Also, the chefs were hidden behind in the kitchen so there was no way of watching them assemble the Sushi to see how masterful they were at their craft.  So I went once & never returned.  Now almost 5 years later, Murakami has resurfaced into a full fledged Sushi restaurant w/ a limited list of good premium Sake.  There is a small outdoor dining area in front, long spacious bar seating in an L-shaped configuration w/ 3 Sushi chefs, Chef Murakami front & center, & table seating for those who just want to have the food.  I chose the Chirashi (chee rah shee) bowl which gives you the option to choose various Neta (neh tah)/ingredients to put on top of the Shari (shah ree) or Sushi rice which is infused w/ Japanese rice vinegar, bit of Mirin (mee reen)/sweet Sake & maybe Dashi/broth of Kombu/kelp,  The 8 Neta version runs $22, and chose:  Aguacate, Kani (crab), Unagi/eel, Shake (shah keh)/salmon, Ikura n(ee koo rah)/salmon roe, Hotate Gai (hoh tah teh gah ee)/scallops, Hamachi/yellowtail, whitefish - I forgot to ask.  The quality, fresh sea minerality & scent of this Chirashi made for a good deal.  If you got the same order of Neta on Nigiri (nee ghee ree) Sushi, it would almost cost twice as much.  I lucked out in sitting at the center of the Sushi bar so that Chef Murakami took my order.  He is not impatient & takes his time creating each bowl.  There is a tranquility about him that gives a reassuring feel that good things do not come out rushed which is similar to the old English aphorism, \"Good things come to those who wait.\"I paired the above with Hakutsuru Sake (sah keh) that came in a 300ml blue bottle.  The bouquet is subdued faintly smelling of rice Ko-ji & a bit of white florals.  The flavour was of a faint echo of strawberry & kiwi with a enlivening light bitterness that cleansed the palate for more.I believe Kaz was my waiter who is helpful, thoughtful, but at the same time he gives off a Shinjuku-like hipness & insouciance.  I get the feeling that on Friday & Saturday nights after work, he would go clubbing around West Hollywood til 4am just because it would be a cool thing to do.  For some strange reason, he remembered me from when I went one time to the old Murakami on Wilcox. He later told me why since he had also seen me hanging out at the Masters of Latin Art gallery at the Brewery for their semiannual Art Walk. Even in a big city like LA, there may be less than 6 degrees of separation. Murakami is a pleasant place, brightly lit w/ a happy feel.  When I got there on a late Friday night, there was a friendly buzz, but not the dreaded harpy, shrill, cacophonous bellowing like at Bestia, Animal, Son of a Gun, Bottega Louie, etc. that seems to be becoming the norm in LA.  Good Sushi, good Sake, nice atmosphere, reasonable price that doesn't break the bank.......4 Yelp stars for a nice nosh without having to wear earplugs."], ["Amanda K.", "Simple, clean and fresh!I got the make your own chirashi with 4 items ($14): scallop (with masago and mayo), spicy tuna, spicy salmon, and yellowtail. The rice was perfectly flavored with rice vinegar and the fish slices were well cut and great quality. The ginger, daikon, cucumber, and seaweed all worked great together. The bowl may appear on the smaller side, but it is well-packed and pretty filling! Everything was yummy and fresh, I will definitely be coming back!Parking sucks since it's on Melrose, but if you can find parking in the neighborhood areas it's a great place to grab a bite and explore the area after."], ["Patty S.", "I've been here twice and both times it has been amazing. The highlight here are the Chirashi bowls.  There is the option to make your own chirashi bowl  (pick your fish and veggie toppings) or select from the pre-set bowls.  I've tried it both ways and it was awesome both times.  I recommend the hot sake with it. The service is friendly and fast.  I will definitively go back."], ["Ede R.", "I'm not sure why all of the reviews here are great. Maybe the pricing? Decently priced but the quality was horrendous. Service was slow and the waitress was rude, forgot to bring extra ginger and did not remember any requests or modifications made. But all of that aside (sometimes sushi restaurants are just like that...) the sushi was drenched in wasabi.....the worst thing you could do to a beautiful fish. Maybe their specialty items are drenched in enough sauce or ponzu that it masks the gross fish they use but their attempt to mask the freshness of nigiri with liberal amounts of wasabi was just heartbreaking."], ["Elisa B.", "This place lives up to its hype. The chirashi bowls here are too good to be true! I made my own with four items for $14 with shrimp, spicy tuna, salmon and scallop (comes with masago + mayo). It was loaded with fresh fish and the combination with the garlic soy sauce was delightful. Like other reviewers noted, the bowl may look small but is surprisingly filling.Yes, parking on Melrose is horrendous but if you don't mind walking a few blocks, go down a few streets south (2-3 blocks) and you'll find free parking that's not residential permit only. I'll be sure to be back next time I am back in town!"], ["Laura Y.", "I love chirashi bowls and my favorite place for it was Akasaka and Sushi Go 55... until I tried this place! What differentiates this place from the others is the simplicity and the cleanliness of the location as well as the food itself. You also get to choose what goes in the bowl rather than just receiving what they put into the bowl. I like the simplistic modern design of the restaurant. It is on the smaller side but there is also patio seating available which is great on a day with nice weather. There's valet parking available as well as street parking on Melrose or the surrounding neighborhood streets. We went on a Saturday night around the time they opened for dinner. The menu is easy to understand and simple. You order a chirashi bowl with how many different types of fish you wish, and the prices vary depending on how many you choose. We ordered two chirashi bowls, a cucumber sunomono salad, as well as a shrimp tempura appetizer. They had a small but good sake list so we ordered some Hakkaisan as well. We also ordered the red bean ice cream and it was sooooo good. The brand that they use is super tasty.Omg!!!!!! The chirashi bowls are so good!! The fish was super fresh and everything meshed well together. The rice was seasoned perfectly, the embellishments (ginger, daikon, cucumber, seaweed, etc) paired well with the fish, and the amount of food you get in one bowl filled me up. Out of everything we tried, I would recommend the spicy tuna, bay scallop, yellowtail, and the tuna. My boyfriend added avocado to his bowl and he said it was amazing. My final verdict is that the fish is fresh, location and design of the place is ideal for a date night, and I would come back for sure, hopefully soon!"], ["Wendy T.", "Great service, delicious food, but difficult parking (you can find residential street parking if you come for lunch).I absolutely love the chirashi bowl from this place! You can get a bowl from the menu or create your own. You can choose from different types of fish on the menu: 4 for $14, 5 for $16, 6 for $18, 7 for $20 and 8 for $22 (3 pieces of each). I got the 5 for $16 (scallops, double salmon, tuna, and yellowtail). The fish is very fresh and great quality. The sushi rice, seaweed, pickled daikon, ginger, and cucumber complement the dish very nicely. Add a splash of the garlic soy sauce and it's perfect! I wasn't able to finish the rice because there was so much food. My boyfriend also got their toro (2 pieces) for the market price of $12 that day and he said it was absolutely delicious. I'll definitely be visiting again soon!!"], ["Sarah L.", "Love this place and the concept. Murakami is known for their chirashi (rice) bowls. You choose the quantity and the types of fish you want (uni costs extra but is worth it) and they put it over a bed of sushi rice. The quality of the fish is top notch. I usually go for: scallop, albacore, salmon, yellowtail, mackerel and uni. The rolls are awesome too! You can get Murakami delivered through the rush order app (there's a discount using code HUNGRY3). Perfect for when I just want a quick chirashi bowl while I binge watch netflix at home."], ["Ingrid L.", "I love, love, love chirashi bowls!!! Had Murakami bookmarked and saw that I was nearby so I met a friend for dinner. Got the number seven but subbed scallops for the shrimp. The bowl came and it was so pretty I almost felt bad eating it. Get the garlic soy sauce on the side, it's free and adds another dimension to the bowl. All of the fish was super fresh and delicious. Price was super reasonable too. It's pretty close to me so I think I have a new go-to sushi place!"], ["Kristie T.", "WHAT TO EXPECT:-- Street/metered parking-- A 15-25 min wait if it's busy-- Expect to spend a lot of money if you have a big appetite but craving some good sushi--People who aren't a fan of raw fish, this place probably isn't for you! This place is expensive because they have great sashimi, not for their California rolls and such. (Although they do serve a seared steak that looked pretty good)Definitely try the \"create your own\" chirashi bowl. Tons of different fish/toppings you can choose from (my favorites are salmon, albacore, tuna, and mackerel), starting off with 4 toppings for $14. I would say get a few hand rolls or split another dish to leave with a full stomach, but if you're cheap like me, go ahead and enjoy the fresh chirashi bowl, and then head somewhere for dessert or McDonalds."], ["Betty H.", "My girlfriend told me good things about Murakami and since sushi is my favorite food, this place was added to the top of my must try asap list! ;D  I was not disappointed at all!!  The BFF & I stopped in at 2:00 PM, 30 minutes prior to their lunch closure.  They were very friendly and welcoming.  It wasn't very crowded at the time, but the place is pretty small so I can see how it can get packed.  The service was good, no complaints there.  The sushi bowls are popular here.  It is awesome how you can customize your own bowl for $14 - $22 !  I ordered the Number SEVEN since it had everything I wanted anyway.  I ordered:Chirashi (Sushi Bowl) Number SEVEN.  $20.00--- Topped with tuna, salmon, yellowtail, albacore, crab, shrimp, eel, avocado, scallop--- The bowl looked on the small side, but it was really filling.  The fish was super fresh!!!  I could eat this every day! Iced Green Tea (unsweetened).  $3.00--- Yummy! Strong green tea flavor.  I really like green tea :)Rainbow Roll.  $14.50--- California roll with avocado, yellowtail, tuna, salmon, shrimp on topA typical rainbow row! Topped with fresh fish.  It was very good.  I like the fact that they use real crab meat in their California rolls!Can't wait to come back here!  Next time I will try another sushi roll and get some sashimi... and a chirashi bowl... How am I gonna eat all this food!!?!"], ["Kee g.", "This is my favorite Chirashi sushi spot since they were in hollywood location. The owner used to work at top notch sushi place in W.hollywood before he opened this one. Super fresh, excellent quality, authentic and come out fast if not crowded,   Staff are very friendly also :)"], ["Sue K.", "Service- great! Especially the sushi chefFood- Omg the BEST for the price!  I mean if want to compare to the 4$$$$ places it's not your best but let's face it's not $$$$ its $$. This this by far the best $$ sushi place I know on this side of town. I use to drive to Jtown to get my very good sushi but after finding this place I just take a $4 Uber ride here.Love love love this place!"], ["Megan B.", "Our go-to Japanese place, we're obsessed with their chirashi bowls. Unless you want tons of fish, just make your own and choose 4 and its $14 for a tasty perfectly sized bowl of fresh deliciousness. Their rolls are good too! We always park across the street near the school on weeknights and don't have much of an issue finding a spot.The staff are also super friendly and I love sitting at the bar and watching the chefs if we can."], ["Tom T.", "Delicious chirashiI like the fact that you can create your own bowl... So if there are things you don't eat (such as fish eggs in my case) you can leave them off!Sushi rice was well cooked. Garlic soy sauce on the side was a huge plus.Overall I like the place for what it is and if you are near the melrose area by the grove,  definitely a place to go for lunch."], ["J K.", "For its signature dish, the chirashi bowls are pretty on spot. The fish is fresh and the Japanese fried chicken we ordered was decent. Overall I'd definitely come here again. The staff was friendly and you know the place is legit when it's actually run by Japanese Americans."], ["Luke L.", "Are you looking for high quality sushi places that don't break your bank?In the SGV (San Gabriel Valley), there's Yama Seafood (sashimi).In the downtown LA, there's Sugarfish (nigiri).In the west LA, there's Murakami Sushi (chirashi bowl).Parking situation is pretty bad around the Melrose area. Since the restaurant doesn't offer valet parking, you'll just have to drive around and look for an available parking spot. Our group came in without any reservation. Staff was courteous and efficient. Hot green tea is $1 with free refills and you can request garlic-soy sauce for your chirashi bowl.---Edamame ($3): Not a bad starter - edamame were partially peeled and lightly salted. Not a must order, but definitely a reasonable price.Make Your Own Chirashi Bowl (tuna, salmon, mackerel, uni with garlic-soy sauce - $13 + extra $5 for uni): Oooooooooo such a fresh sashimi + uni! Uni was totally worth additional $5 and garlic-soy sauce simply enhanced the overall flavor of the bowl.    Number Seven (tuna, salmon, yellowtail, albacore, crab, shrimp, eel, avocado, scallop - $19): Colorful, beautiful, and flavorful. And most importantly, FRESH FRESH FRESH!Toro (nigiri, market price - $12): Excellent melt-in-your-mouth toro, but I would just spend those $12 (with one more dollar) on another chirashi bowl.---Ability to customize, fresh fishes, affordable, and great service - pretty simple formula and Murakami Sushi hit all these four points. Two BIG thumbs up.P.S. - Murakami also opens on the New Year's eve!"], ["Kevin P.", "I had Murakami bookmark and I had to try it right away. Wow!! For all your Chirashi lovers out there this is the place for you. At Murakami you can either create your Chirashi bowl or pick  8 different kinds they have on the menu. The service here is outstanding and very friendly. I recommend sitting at the bar. They don't take reservation for the bar, but for the tables  they do.As for the starter we ordered Agedashi Tofu. Simply awesome. The tofu was perfectly lightly battered and fried. The dashi broth was one of the best i have tried yet. A perfect starter.Nigiri Spanish Mackerel simply just melts in your mouth.  Very fresh.Salmon nigiri awesome. Kanpachi nigiri one of my favorite fish. Toro just like butter.The highlight of the night was mine my creation of the Chirashi bowl. I decide to pick the 5 items just because this was our first time here and didn't want to go overboard yet. Man one of the best yet. (Tuna,salmon, albacore, spanish mackerel, and uni) Everything was fresh ,also great cuts of fish, presentation was amazing. (Note $5.5 more the add uni to your bowl but it's worth it).Murakami Sushi you got me hook. I'm definitely a huge fan,and will return very so.Oh almost forgot parking is a pain. Street parking only."], ["Johanna A.", "Went here for dinner with an old friend last night. Absolutely delicious food and all the reviews are correct, their signature chirashi bowls are well portioned and did not leave me hungry. I love that you can also customize what fish you would like in it, very nice touch.Casual atmosphere, definitely a lively spot. Parking is street parking but good luck getting a spot at prime time. My only qualm with this place was that we were sat at a table directly next to the server kiosk and i felt like we were just in a corner but if you're with someone you don't have trouble keeping conversation with, it's not noticeable. I'll definitely be back!"], ["heather p.", "Delicious, clean fresh fish. The bowls are the best deal and seem to be what they specialize in. Good price for the bowls but other sushi was a bit pricey. I'm definitely going back when I crave sushi! Happy it's in walking distance but they do have valet now, I read another review that said they didn't, but they do."], ["Brandon A.", "Yepppppp you either recently moved near by or didn't know the place existed on this part of Melrose.... regardless you are in luck... because it's all that and then some more.  Most people don't know what a Chirashi bowl is, but please treat yourself. Super authentic and chock full of quality fish. Either way... naturally you probably want to come here for sushi... given no one searches for a Chirashi bowl, and yes the sushi is refreshingly fresh and oh so delectable. You know it's authentic when there aren't countless crap rolls with spicy mayo, cream cheese, and fried nonsense (none of that American lard here).  This place is all about the quality of fish and melding of real genuine flavors.  Get ready for Katy Perry's \"Firework\" to play in your mouth because the flavor grand finale is about to commence."], ["Justin C.", "Been a fan of this place since the OG spot on Wilcox.In my opinion, this place gives you the best bang for your buck. If you're in need of a cheap and solid sushi fix, I highly recommend coming here. The fish quality is great and proportions are just right. I usually get the Mixed Bowl here. It comes with 4 types of Sashimi over a bed of rice and various types of edible garnish. You can also mix and match your fish/meat/veg options in your bowl. All of this will run you about $12-15. Last but not least, don't forget to try the Garlic Soy Sauce. You have to ask them for it, but it's worth it. Even Vampires ask for it. Quick Hitters:1) GET THE GARLIC SOY SAUCE.2) Great spot for a quick lunch. 3) Or a slow dinner.4) Or a non threatening first date."], ["Libby R.", "Much like that time I found my long lost cousins on Facebook, I am delighted that I found Murakami again.It used to be by a friend's house.  Totally hole in the wall with KILLER sushi bowls. I was in love.  A few weeks later, I drove out to dig into some fishy goodness and *SLAP* a closed for good sign.I may have cried.Don't judge me.Anyway, I was on Melrose the other day doing some errands and lo and behold, Murakami.I may have cried.Don't judge me.Later, I ordered my favorite bowl, the Zuke-don, and a few pieces of sushi while my friend got a couple of rolls and am happy to report that even though the space is bigger and more beautiful, the food is exactly as it used to be...killer."], ["Hillary H.", "We walked in on a Saturday date night and sat at the bar. I love being able to watch the sashimi being cut and the rolls being made. The atmosphere is clean lines casual, similar to Sugar Fish but more industrial feeling. I stumbled onto this place after looking for a sushi place as good as Sugar Fish. My boyfriend and I recently spent two weeks in Japan, and we were so spoiled it's hard to eat at just any sushi joint now. After reading rave reviews we took the plunge.We shared the salmon avocado roll and a 4 fish chirashi bowl. First the salmon avocado roll was delicious. The fish quality in the roll was fantastic. Eat piece was melt in your mouth good. Next we dug into our salmon, tuna, yellowtail, and albacore bowl. They give you three pieces of each fish over a large portion of sushi rice. Each piece of fish was perfection. Due to yelpers we ordered a side of garlic soy sauce. I do not recommend this on the fish as it dilutes the taste, however try this with your left over rice and it is glorious.All in all I'm super excited to have found a new sushi spot on par with Nazawa. Not only is the fish quality exceptional, it was incredibly inexpensive. $41.00 total including sake, edamame, two green teas, and the sushi. Love everything about this place."], ["Pricilla D.", "I love fishes cause they're so delicious!!Less sodium!!More flavor!!Fresh and quality fish at a great value, what's not to love?   It is a really small place with a smaller outdoor front patio.  Think like maybe 10-15 tables inside, with a sushi bar and probably like 5 tables at the outdoor patio.  It looks very minimalist.  The restaurant is visible from the street as you are driving down Melrose, however it can be easily missed as it is a really small place and there are tons of restaurants surrounding it.  The bathrooms are single stall bathrooms and pretty clean.Parking can be a pain because as far as we could tell they did not have their own lot.  We did not want to park where the Winchells and Baskin Robbins was and the street residential non metered parking had signs on top of signs stating times where you couldn't park.  Typical LA parking situation, make sure you read before you leave.  Luckily we found meter parking with an hour left, so we dumped in 20 more minutes.  We were greeted immediately upon entrance and seated and given menus.  It was not too busy which surprised me.  We ended up getting 3 bowls because my boyfriend was still hungry after finishing his first bowl. Our first two bowls were a build your own bowl with 5 items each.  I got eel, yellowtail, spicy tuna, crab and salmon.  My boyfriend got eel, salmon, yellowtail, albacore and white fish (halibut).  My boyfriend got the garlic soy sauce with his and I stuck to it being plain.  Less sodium.  The fish was delicious and not fishy tasting at all!  It was so soft and did not leave a gross aftertaste and it was not slimy.  They use real crab, non of that imitation crab stuff.  My favorites were probably the salmon and eel.  The salmon was delicious and it just melted in my mouth.  The eel was delicious but sadly they only give one piece.    My boyfriends bowl tasted a bit better because he got the garlic soy sauce.  Seriously, that stuff is awesome.  It is so good, I mean the bowl by itself is really good and it's less sodium.  However, the garlic soy sauce adds more flavor.The albacore was also really good but like I said, to me, the salmon and eel were the best.  The second bowl we got was a mixed bowl and it was just as good as the first bowls.  Mmm that garlic soy sauce.  Service was very nice and attentive.  We will definitely be back and look forward to the next visit.  But to recap, garlic soy sauce!  Get it, you will be thankful."], ["A.m. K.", "There are three things about Murakami sushi that are not mediocre. But let me start with what is mediocre: the location, the menu, the setting and the ambience are all pretty much average. The first thing that is not mediocre about this place is the food, it is certifiably well below average. We ordered five cut rolls, some nigiri sushi, a hand roll, and a cooked salmon dish and every single one of them was substantially inferior to what you would buy at a Ralph's or Trader Joes. The rolls are mostly rice with a smidgeon of fish that's barely fresh. No flavor, just the building blocks of sushi with no creativity or heart or soul. No pride in craft. Bland to the core. Which is almost impossible to do in LA when it comes to sushi.The second thing that is not mediocre is the service. It's certifiably lousy. I walked in with two small children and instantly the hostess was snapping at us as if we're walking in with the plague. I think I almost heard her say \"oh good\" under her breath when we declared our order was for take out. Rudeness aside, the take out order had no cutlery for the Salmon, rice and broccoli. Barely two napkins for four people.Now for the third thing that is not mediocre. It's the name of the joint. If it's homage to Haruki Murakami, then the name is about the best thing about this place. Unfortunately, I don't give out stars for great restaurant names.Avoid at all costs, unless you enjoy mediocre, but be warned that the prices reflect far tastier fare."], ["Vanessa M.", "I came here awhile ago when It was at the Hollywood location, which was way smaller. Glad they moved to a bigger location. Parking is street. Right in the heart of Melrose and all the shops. The inside is cozy and casual. A small outside seating as well. Menu is pretty simple. Chirashi bowls, sashimi and a few sushi's, salads and soups. They are mostly known for their chirashi bowl, which is a bowl of sushi rice and selections of fish on top. Kind of like Yoshinoya but a thousand times better. Okay that was a bad comparison but you get the idea of the rice bowl and fish on top :) On the left side of their menu is their chirashi bowls that are already picked. If you do not like some of the fish listed, like myself then on the right side they have a make your own chirashi bowl. There are a few price and item selections that range from $12-$18 ($5.00 extra charge for Uni). I also recommend asking for their garlic soy sauce, which just makes the dish that much better. _Make your own bowl of six items for $16. I usually always get the salmon sashimi, yellowtail sashimi, spicy tuna, avocado, scallops and spicy yellowtail. The rice portion is pretty big but one thing I wish the fish size was a bit big as well. I think they go a little stingy on the fish size. Especially when i ordered the spicy tuna and yellowtail it was the size of a small ice cream scoop. _O.M.G roll. The name says it all. It was indeed pretty O.M.G and in a good way! a little pricey but it's a shrimp tempura roll with asparagus and spicy tuna on top. It's also served a bit warm so that's a plus for me. _Sashimi Salad. Nothing spectacular. Just some greens with sashimi on top. The dressing was some sweet miso that was good but nothing that wowed me. I got this to avoid rice for the night, but I just recommend getting the bowl. I would definitely come back here again. I would be a complete regular if they gave more of a fair amount of fish but other than that the staff is always real friendly, helpful and overall great service!"], ["Rachel R.", "Murakami Sushi, you are the definition of a perfect Saturday night date in LA. I absolutely adore you for this and will make this a weekly habit of mine now.While most have to deal with reservations and long wait times, me and my bf walked right on in on a Saturday night. I loved it.  Sat by the bar to get all the action. Menu was straightforward and didn't have to sift through it at all since the main attraction was already on the front page- MAKE YOUR OWN CHIRASHI BOWL. These words together are a rarity to be spoken out loud so you can imagine my excitement.I did the choose 4- tuna, salmon, scallop, and avocado with garlic soy sauce. HOLY MOTHER OF CHIRASHI was this bowl mind bowling (pun intended). My dream has always been to choose my own shit to go in my chirashi bowl bc I'm so picky.Can't waittttt tooooo comeee back!!"], ["Stella L.", "I love the varieties of chirashi bowl, sushi and sashimi they have, as compared to other japanese mart. It has became one of my must-go place to visit at least once a week as my school is just nearby. Visit here for takeaway japanese bento box if you are craving for a quick meal for the day!"], ["Max N.", "Great spot. Visiting LA for first time. Knew we wanted sushi but had no idea where to start... So looked on yelp. Not too loud.  Not empty. Friendly servers. Clear menu. Got the number 6 sushi bowl and eel avocado roll. Both were excellent. The rice was especially good. We also ordered green tea and although it was not complimentary, they kept it flowing, which was a nice compliment to the meal. Two thumbs up."], ["Melinda H.", "I've been to Murakami about 4-5 times and I always end up ordering the same sushi bowl because it is so good!  I always get the tuna, salmon, unagi (eel), and crab sushi bowl.  The sashimi taste really fresh every time!  If you have room, try the green tea and red bean ice cream!"], ["Jeff M.", "Came here for  dinner last night around 7:30 and got a seat right away. By 8 though there was a line forming for tables so try to get there earlier!I got the pick your own 4 bowl out of their list of about 20 things (Salmon, Albacore, Spicy Salmon and Mixed Greens). The mixed greens came with Avocado, sprouts and a couple other veggies and nice touch!The fish was super fresh and really tasty! The bowl came with Nori and was on a bed of rice (I did the option for it to be tossed in the garlic soy sauce). Will definitely come back again!"], ["Fran T.", "Great food, love the #5 bowl.4.5 stars for the food and 1 star for the cost of valet parking. $7 for parking + tip is a bit steep for a restaurant of this stature. Fair price would be $3 or $4 tops.Hopefully the owner reads this and considers dropping the price to not gouge the customers on parking revenue."], ["Emily S.", "Was really disappointed by this place.First of all we called beforehand to let them know we would be ten minutes late for our reservation. They were incredibly rude about it- they previously had said they would hold it for fifteen and we were calling to be courteous and they said they would cancel the reservation and they kept talking over us.The  sashimi bowl and the sushi were bland and small in size.There's nothing particularly pleasant about the place i don't think it's worth the money. The service was great when we got there but otherwise i was pretty disappointed."], ["Mrs. P.", "Stopped at this place for dinner because we were in the area and share our surname with the place. The create-your-own chirashi bowls were a hit with both my kids and my husband. Prices spot on for the quality. Staff were friendly."], ["Diana W.", "Love this place. BEST bang for your buck for CUSTOMIZED chirashi bowls (Sushi on rice bowl). Ranging $12-18, depending on how many items? Get their garlic soy sauce. Meter parking, friendly staff. Cute small patio area.customize your bowl $12-$18!!!PS every time I've gotten \"eel\", I've only gotten ONE eel. So don't get it."], ["Charles A.", "This place is a gem. I love sashimi, and loved making my own chirashi bowl. Chirashi bowls are clearly their specialty.Prices were very reasonable. Everything was very fresh. The sushi chef was chatty and made us some quality recommendations.I seriously cannot wait to come back again. I took one friend with me. He has already revisited in the two weeks since we went."]], "Roll Roll Roll": [], "Sushi Gen": [["Jennifer H.", "One of my top 2 sushi restaurants to dine in Little Tokyo~ Sushi Gen is where I go if I feel like sashimi. Personally I think the sushi is better at Komasa and the sashimi is better at Sushi Gen. Both are still very good for me either way. Just to get a little taste of everything Sushi Gen has either sushi deluxe combos or sashimi combos or sashimi deluxe combos which I think are great. The sashimi deluxe combo is good for two people and maybe you can add on an appetizer or two on top of that. Everything is fresh and it never disappoints! I don't know if I've ever noticed before but be careful when ordering sushi a la carte off of the white sheet because prices are not listed. So don't get carried away if you don't want a fat bill at the end. The wait can be quite long but sometimes they'll call you in sooner than later but it's definitely worth the wait."], ["Rudy V.", "This place is truly legit. My wife and I have always heard the hype and finally decided to undertake the wait time for a table (about 30mins for us on this particular day). Service: really, really solid. Our server answered all of our questions and was you can tell that the staff work as a team. Food: we ordered so many things since we were excited to try as many things as possible. Started off with miso soup which usually is a throw away but it was so damn flavorful here. We also ordered this pickled seaweed dish that I can't recall the name for but it was really fresh and tasty. The sushi deluxe combo is a nice way to get a sample of all of their amazing sushi. We also ordered this steamed egg dish which was good if you like that custard-like profile. The uni-octopus dish was good but not as exciting as I was hoping for (these are usually two of my favorite items). The star, however, was the yellowtail collar. It was charred to perfection and was incredibly meaty. Overall: I'd definitely would recommend showing up early or making a reservation. However, having dined at high profile places like Nobu I can tell you that this place is definitely on par with that restaurant. Now Sushi Gen may not have all the neat food & cocktail items of Nobu but the sushi itself is amazing."], ["Huamei Y.", "I came here in May and kept forgetting to write this review.Their customer service is top notch for the price you're getting. Okay this is no fancy restaurant, but for a popular joint, I'm impressed.The fish just melted on your tongue and I even liked the sushi rice. I think that's kind of rare for me.I came 30 mins prior to opening time on a Thursday, approx 10:30am. There was probably 10 people in front of me. The restaurant is cozy, so definitely come in smaller groups or come early--otherwise expect to wait! This was the best Japanese food experience I've had in the states. Hopefully I'll make my way to Japan one day!"], ["Maryam S.", "The best sushi in town.I can eat there everyday. We sat in the sushi bar, it was fun to watch them make it by all that  delicacy."], ["Jane K.", "Sushi Gen has made a name for itself in LA as a high quality restaurant that offers truly unbeatable value.  While its fish isn't the absolute best available on the market, Gen's product ranks pretty damn high on the list and at $15 for a sashimi lunch, you can make out like a bandit. Omakase at the bar is great but will run you a pretty tab.  The sushi deluxe is the perfect size for one person-- it comes with 2 cut rolls (tuna and cucumber) and 9 nigiri (halibut, tuna, hamachi, unagi, ikura, ika, toro, tamago, and shrimp).  The sashimi deluxe, on the other hand, is a platter large enough to be shared by 2 or 3 people; it features generous cuts of salmon, hamachi, halibut, tuna, toro, ika, octopus, spicy tuna, snapper, clam, chopped tuna, and crab, along with baked salmon and cooked fish marinated in soy sauce-- it's a lot and it's all amazing.My favorites here are the uni, toro, and Alaskan salmon.  All three are so fresh and decadent-- the toro and uni literally melt on your tongue as you chew.  At $42, the Uni Dinner is a little pricier, but it's served with additional sashimi and the quality is superb.  The uni is bright gold in color, has a firmer texture, and is sweet and buttery in flavor-- all are signs of fresh, grade A uni.  I highly recommend if you're a fan.I typically don't like tuna, but Sushi Gen's fish is so good that it temporarily changes my long-held opinion.  My first time at Gen was the first time that I remember enjoying tuna-- it melted in my mouth with each bite. I'm also not a huge fan of tamago, but I love it here!  It's fluffy, just sweet enough without being saccharine, and a quick dip in soy sauce gives it the perfect salty flavor contrast.  It's so good T__T If not personable, service is always efficient.  The parking lot is usually crammed and you should come prepared for a long wait-- tonight, I waited for almost 1.5 hours.  Granted, it was a busy Friday night and I have been almost immediately seated on random weeknights in the past.  The waits are long enough to dissuade some diners, but if you stick it out, you'll enjoy some great quality sushi for relatively reasonable prices!"], ["Kabir K.", "Oh yes. The hype is real. As an LA resident, I quickly learned Sugarfish was the hot place for great sushi. Sushi Gen has a full Japanese menu with an emphasis on their quality sushi. The prices are high,  but the quality is evident. If you have a decent appetite, expect to pay at least $50 a person (more if you drink). I loved the quality. Service was quick and our waitress was friendly. Prices weren't listed on the sushi menu so be sure to ask and the server will mark the prices for you. Alaskan Salmon sushi was killer. The color of the salmon was so deep. Not a hint of fishy smell anywhere to be found, just excellent quality sushi. Their tamago (Japanese omelette) tasted amazing! So much umami and a fantastic balance of flavors. It was perfect. Shrimp tempura were generous and beautifully battered. Japanese sweet potato tempura was fantastic as well. If you haven't tried Japanese yam, you are missing out.We arrived at 6:50pm for a table of 2 and were seated almost right away. This place will get busy so plan ahead. They have their own parking lot and validate too!"], ["Yenny D.", "What can I say about Sushi Gen that hasn't already been said? I've been here twice now, once sitting at the bar and once at a table. The wait for bar seating is usually quicker, but you don't get to order off the full menu and there's a 4 piece order minimum. I prefer the table seating :) We only have 20 minutes for a table on a Tuesday night.FOOD:-sashimi deluxe - holy crap, sooo much fish!! And sooo delicious! Some of the fish simply melts in your mouth it's so fresh and buttery *sigh*- chiraishi deluxe - very generous chunks of fish, they even include a piece of stewed fish that was really delicious too- chawanmushi - probably the best chawanmushi I've had at a restaurant. Perfectly silky egg, with lots of shitake mushrooms and a big shrimp inside!SERVICE:Friendly and fast. No complaints, we were seated in this corner booth table that was pretty cool and comfy.VENUE/PARKING:Place is pretty spacious, the sign says they have a max capacity of 72. Left side is bar, right is tables. Bathrooms are straight towards the back from the front door. You can park in the lot, I think its $2, or just find free street parking in the surrounding streets."], ["Julia Z.", "This place seems to be my husband's all time favorite. And he always went there for lunch. And he decided he has to take me there once, lol so there i was!Hmm about 30 minutes wait till we got the table on a Thursday night, and the lot was full hence we went for street parking.For the sashimi deluxe, it's fresh and well cut, with good soysauce and wasabi. And for the sushi, it's also good with the rice. Uni is good too.Though i was allegic to one of fish i guess... had some allergy effect after that dinner :( And quoting my husband, best sashimi and sushi in LA."], ["Agustin K.", "So bar seating is only for aka carte dining and no lunch special which I found very odd.  Maybe that's a typical arrangement in Japan.  I was traveling solo and would have much preferred sitting at the bar.I had to wait about 15 minute for a table around 1.30pm.  The sashimi is certainly very fresh but not unique.  The high turnover certainly helped them to serve very fresh ingredients.  Overall it was certainly a great value for what you're getting.  I actually left full, which was quite rare when eating sushi."], ["K T.", "Ditched our regular sushi place to try something a little better. It was just okay... Expected more with all the reviews and prices. I appreciated that it was authentically Japanese! Sushi was medium sized, which is fine if the taste and quality of the rice is superb. This place was not so. Don't waste your time on the dinners. We got the chicken dinner...not good.Overall okay sushi, but I will try a different place next time."], ["Kira L.", "They get top pick at the fish market, so they have some of the freshest fish around town. Their omakase is worth the $$, and I loved what the sushi chef gave. The sushi chef was friendly, and I really enjoyed my experience with him. Going on a weekday close to their mid-day closing time (around 1:30 PM) allowed us to not only find a parking space but also no wait for the sushi bar. The negative of that is we were a bit rushed and couldn't stay too long. They validate parking. I had no complaints about service, and I'd definitely go back when it's not busy to avoid the crowds. Sushi Gen is great, and I always have a good meal when I go, but I don't enjoy the hour plus waits during peak hours."], ["Yong K.", "So good. So fresh. So affordable. LA... why you do this to me???I highly recommend the lunch special - $15 for either a sashimi or sushi plate. Both are really good, but i think the sashimi plate is slightly better. the fish is really fresh and delicious.i also ordered Uni a la carte (my first time) and it was like... seafood butter. #melting so yes, definitely check this place out. and get there about 30 to 45 min before it opens because a line will start to form."], ["Denny K.", "This sushi princess is skeptical about your lunch specials, Sushi-Gen----------------------------------------------------------------------------------One thing LA folks like to do is rave about how great this \"so and so\" sushi place is.   Take a guess on which place I hear about most often - Sushi Gen.  And in particular their \"Sashimi lunch special.\"  It didn't sound too exciting quite frankly.  How many sashimi and sushi lunch specials have you had in your life?  I've had one too many with essentially all of them being uneventful.  So it was with some hesitation and skepticism that I finally tried this place.  I arrived 25 minutes before opening time to beat the crowd.    Da F*CK?!? Of course there was a line seven parties deep.   The asian sushi bouncer sporting the yukata and glasses kept order amongst the patrons.  God forbid a sushi riot breaking out with all these impatient customers. Sushi bouncer means business and can't be bribed.   No BS.  ALL party members must be present before being seated. There will be no use of cell phones while eating.    And don't even think about sitting at the \"reserved\" tables, as those are for the long time regulars.  He is watching you.  I wish he would say \"NO SUSHI FOR YOU!\" Just once.  Now for the food review: Mind you, I lived in northern Japan (Aomori-ken) for 2 years.  The bar is set pretty high for me.    ***Arms folded waiting to be impressed****  I ordered the popular and famous- Sashimi lunch special - $17.  EXCEEDED my expectations.    Best sashimi lunch I have had for that price. Ok, Sushi-Gen I am a believer.  Your food has delivered with flying colorsHowever, you still get dinged a star because of the wait.  Sorry, thats just the way it goes."], ["Lloyd G.", "After hearing so much about this place for several years we finally had a chance to try it last week.  The fish was excellent with nice size cuts giving you a feeling of contentment when being served.  Some places slice it so thin you think they were serving a rare commodity.  The Tuna and Salmon were good, not exceptional.  The uni was good and the rice was very good.  our overall  meal was good, but after the place having so much hype i was a little disappointed.  There wasn't anything special about it.  Maybe that is why it rates high.  Traditional Sushi.  To be fair I will try it one more time and order differently."], ["Julia J.", "i've stayed away from this place for years hearing about the horrific waits.  it's true.  even 10 min before closing there were 8 tables ahead of us.  regardless, this is when i would recommend going.  there is ALWAYS a long wait.  however, there is a reason for that and that is the high quality of the sushi served.  it's no zo or hiro or nisha-ya, but the quality is fresh and the pieces are generously sized.  it's not cheap though, especially the way i order (i think only their lunch special qualifies for that) so given the surplus of other sushi restaurants who have less of any annoying wait, i'm not rushing to go back. all and all solid.  just not special."], ["Julie L.", "I always wonder what this hype is all about! The portion are small, the wait is at least an hour. And the price is way overpriced! I have been here a couple of times. And every time I am done with a meal, I feel a it disappointed. I had the worst experience in my life at sushi gen! I put my name down for 4 ppl. I waited for about 45 mins before my name was called! By that time the 4th person never responded so I was under the impression he wasn't not going to show up. So I told the manager we have changed the headcount to 3 instead. So after being seated and water was served, I would say it was about 10 mins before my friend texted that he's almost here. He was planning not to eat and will just order a beer and hang out. The waiter was ready came to take our order. But before ordering , I told her that our 4th person is gonna make it after all and should be arriving soon. After hearing that she said we can't be seated if that's the case and walked away without taking our order. At first I thought she was going to update our headcount, but it turned out that she told the manager the situation.  This next part was unbelievable. The manager asked for us to leave our table and will put us back on the waiting list. I told him my friend isn't even going to eat so what difference does it make. We still had the table and the ppl that are actually eating were present and ready to order.  I guess he didn't believe me and he was arguing with me that this is their rules and that I should respect their policy!!!! I count believe that I was actually getting kicked out of our table!!!!!!!! It was the most embarrassing moment in my life!!!!! I was mad beyond belief and just stormed out of the restaurant and never looked back!!  There are many other restaurants in sushi joints in the area. I don't need to ever come back to this place! I can't believe how rude they were. I was just honest with the party change and I get penalized and kicked out of the table and after they already served us our drinks too!!!!! Unbelievable!!!!!!!I also heard they don't give you much ginger and when you do order a side of extra ginger, they charge you $1.00!!! Seriously???? I wish I can give this restaurant no stars!!! But I have to rate them at least 1 so I can leave a review!!!! Never again will I come back and I'll continue to tell my friends of my horrible experience here."], ["Christine S.", "I've heard of Sushi Gen for years now and have seen it on just about every restaurant list in Los Angeles. In fact, it's rated #2 on Zagat's best restaurants in LA. I do not think the hype is reflective of the quality. As a huge fan of Sugarfish, I couldn't help but compare the two and Sugarfish by far supersedes Sushi Gen. I enjoyed the uni and albacore belly more than anything else. As a huge fan of toro, Gen's toro had a strong fishy taste that I have not experienced at other top sushi restaurants I've visited. We ordered the sashimi deluxe which had a variety of fish, the sushi deluxe, and albacore belly, yellowtail belly, salmon belly, and uni. It was fresh and good but incomparable to Sugarfish."], ["Rebecca L.", "Sushi Gen's lunch special is amazinggggg.  Fresh, huge portions, and so satisfying. They raised their prices from $15 to $17, but honestly, it doesn't make a difference because it's still a steal.  The lunch special starts at 11 am and I recommend getting there right when it starts unless you have an extra 30 minutes to an hour to spare. The line here is brutal, but it's worth it. The lunch special comes with tsukemono (pickled cabbage), steamed tofu, a bowl of rice, and the famous sushi platter.  Definitely get the iced green tea to wash it all down.  You get free refills while you're there!I got the sashimi tempura lunch once and it really wasn't as satisfying as the sashimi platter.  Don't make the mistake I did and always get the sashimi platter!We got the ama ebi which was amazing.  We asked for the heads to be fried and served along with the nigiri.  Best decision ever.  Eat the heads, they're good for your soul."], ["Vicki L.", "DEAR LAWD, I'VE GONE TO SUSHI HEAVENSeriously, this place is THE BEST for sushi lunch.Came here for lunch during a weekday, BEWARE! even though it was a weekday there was still a line to eat there! Actually there's always a line to eat here...Anyway.. for $17 you get a whole plate of fresh combination sashimi fish and miso soup, some tofu appetizers, and rice! Never had a better deal that this place for an amazing sushi lunch. But come early if you're starving!"], ["Marie C.", "Holy Moly ... After months of  my mother in law talking about this place she finally took me here. She wanted to eat it for lunch but because I work during the week she said she would wait in line early before they open so that I wouldn't have to waste my lunch hour. I'm thinking to myself .. seems excessive. We had made plans to meet at 11:30. The restaurant opens at 11:30 I didn't feel like there would be many people at that time. Especially during the workday... on a Tuesday. I was wrong. I arrived and there were about 50 people waiting for the restaurant to open 0_0 My mother said she had gotten there at 10:30 and she was 3rd in line. What?!??!?!? At 11:30 they open their doors and people are stampeding to get in. What is this madness?? I feel panicked. I feel like if I don't get a seat soon I will be trampled. We get seated at a booth and look at the menu. Very limited. I like that. That shows they know what they're good at and they don't need to have a extensive menu. We ordered the Chirashi Deluxe and the Sushi Deluxe. Both were amazing. The Sushi just melted. The prices weren't bad and the miso soup was so hot and delicious. But damn... that wait. I may bring my husband back here one day... if he doesn't mind waiting."]], "Arashi Sushi": [], "Hama Sushi": [["Christina A.", "If you want authentic sushi, Hama is the place to go. I'm a sushi purist, meaning I cannot be bothered with California rolls, Rainbow rolls, any rolls named after an area code, or anything other than plain fish on rice. Hama gets an extra star from me for not allowing cell phones, because the focus should be on your meal, not on Instagram photos of it. I came here for a weekday lunch and was more than pleasantly surprised by the simplicity of Hama. There is nothing fancy here, nor does there need to be anything of the sort. The fish was fresh and supple, very thick cuts with little tiny dumplings of rice tucked beneath. If you want an experience that resembles Japan, this is your place. The spicy tuna rolls were the most Americanized thing I ordered and I have to say that they were, hands down, the best spicy tuna rolls I'd ever had. This is how sushi is supposed to be."], ["Andrew Y.", "Yikes, Hama missed the mark for me. To be fair, 1.5 would be a more accurate rating. Also bear in mind I am factoring in other options in the area. After all, this is little Tokyo. The positive - very good hamachi. come early, and the wait is not bad. The negative - rest of the stuff just wasn't all that. From Spanish Mackeral, to kanpachi, to snapper, it was all very meh and unimpressive. Cuts are also on the stingy side. You'd probably have to eat a good 20 pieces or more to get full. For a joint like this to operate like sushi snobs (no phones allowed, very strict at the table, unfriendly wait staff), you've gotta produce better stuff than this. Very disappointing and not recommended."], ["Duy T.", "It was the best sushi I've ever had. Chef was very nice and generous. We came here all the way from Philly and it was well worth it. All these other bad reviews are probably of stuck up people that don't know how to order food. Seriously it's a small restaurant. Get in. Order your food then pay with a generous tip and GTFO and come back lol. We had the Salmon, tuna, tamago, spicy tuna hand roll, spicy salmon hand roll, ikura, uni, sweet shrimp, scallop sushi. We also ordered octopus but the head chef accidentally gave us red snapper and said \"no soy sauce please\" and it was the best mistake ever. We had to order 3 more orders. So everything was very very very good but the red snapper was the best thing we had there. I saw they had monk fish liver when we were leaving but we will try that next time we are back. Highly recommended"], ["naru k.", "This place is probably the most authentic, delicious, and freshest sushi I've ever tried in LA. Located in the heart of Little Tokyo, this tiny hole in the wall attracts sushi lovers from all over. If you're lucky, you get seated right at the sushi bar, where the chefs are serving you up directly from their board to your plate. The place gets crammed, but for good reason! Their sushi is friggin delicious!! I'm definitely going back. Try to get there when they open so you don't have to wait in line -- don't worry if you get stuck in that line.. it's worth the wait!!"], ["Ben L.", "Review #200!TL;DR - Hama Sushi serves stellar sushi at its peak freshness. If you like traditional style nigiri and sashimi over the fusion style of Sushi Zo, eat here.(Read FOOD #'s 3 and 6 down below if you want to know why I love Hama so much.)When I hit review #100, I had to choose between my first love (steak), current love (sushi), and naughty mistress (ramen). Sushi won - I reviewed Sen Nari Sushi. For review #200, sushi wins again!I've always imagined what great sushi would taste like, and I didn't quite get that feeling 100% at Sushi Zo, Mori Sushi, etc.In the past year I have been to:Mori SushiSushi ZoTamon SushiMako SushiK ZOSugarfishKanpachiIshi Sushi, and many others.Knowing what you want makes a world of difference in the world of sushi. After Sushi Zo, something wasn't quite right, and I forced myself to try Mori Sushi. I'm so glad I've found Hama. I prefer Hama over the likes of Sushi Zo and Mori Sushi. This really is the journey of a lifetime (that will hopefully culminate one day with a sushi eating spree in Japan).Three disappointments:1. They ran out of albacore toro!2. They told me three times not to take pictures3. The sushi chef doesn't serve you the fish from lightest to heaviest. He goes down the order form from top to bottom. If they're so strict about no pictures, why aren't they as diligent about serving the fish in the proper sequence?I love nigiri, which is comprised of the fish and the rice. The sushi rice was excellent. It was served slightly warm, with a beautifully chewy consistency. The flavor was immaculate. Each order comes with two pieces of nigiri.The 19 seat sushi bar is the feature attraction. There are two small tables in an adjacent room.Oddly, they don't offer omakase. So I chose my own lineup of fish.FOOD:1 toro - not mind blowing. Good, but not that melty. I thought it would be the showcase item, but it was disappointing. I've had better toro at Mori, Zo, Tamon, and Ishi recently. So why the five star rating? The toro and uni were the only \"not mind blowing\" orders. Hama sushi is great. I want to try Komasa to make a direct comparison, but until then I am a firm believer in Hama. Sure, Zo and others have fancier, rarer kinds of fish. But Hama executes quality, freshness, and simplicity like no one else.2 uni - just ok3 tuna - There are times when simple, regular tuna is exquisite, delicate, and sensational. You don't need chutoro (medium fatty tuna belly) or otoro (highly fatty tuna belly). I was really surprised that I enjoyed the regular tuna here more than the toro.4 yellowtail - excellent, melty 5 halibut - soft and spicy. Lingering kick.6 tuna -second round. I want you to notice the color of Hama's tuna. There's much debate on this issue. It's estimated that 30% of all tuna is sprayed with carbon monoxide in order to maintain the bright red color. I don't like the way those tuna taste. The tuna here at Hama does not have this bright red characteristic popular at so many other places. I'm not sure if this is the reason it's so good, but it's surely part of it. This tuna tastes natural, the texture is heavy, there's a real chew to it, yet it's also tender. This is what tuna should taste like, instead of the bright red pieces elsewhere.7 salmon - very good8 red snapper - marvelous. Meaty, soft, delicate - best snapper I've ever had.9 Spanish mackerel 10 spicy tuna handroll - best spicy tuna handroll I've ever had. Perfectly portioned tuna, rice, and crisp, fresh seaweed combined into something pristine. Get this.11 scallop - excellent12 sea eel - quite good13 sweet shrimp - You can get fried shrimp heads or miso soup with the heads. I chose fried heads because I like to eat the whole thing. (I'll try the soup next time.) The head was packed with rich, bursting flavor. There really is nothing like it. You must try it. It's crunchy, crisp, and delicious.They validate parking in the Japanese Village Plaza garage if you spend a minimum of $20.Props to Shelley Z because Hama uses her photo of amaebi and toro as their profile photo on the Yelp page. (Does anyone know how that photo is determined? Do businesses choose it?)Disclaimer: I had to rush and quickly take each picture without being noticed. The result is sushi photos that are not up to my standard. My apologies.To Hama Sushi management: I know you have your policy. Just consider, a lot of customers use Yelp and won't try a business unless they look at pictures and reviews on Yelp. I came solely because I had friends who have reviewed your restaurant and posted good looking sushi pictures. Without those pictures and information, I never would have spent $100 at your restaurant. Just food for thought. It's your right to say \"no pictures,\" just the know the effect it will have on your business.To Hama management part 2: Your nigiri is phenomenal. Nothing can dispute that. 5 stars.Hama, I love you. Forget steak, forget ramen, you are the best."], ["Kandice C.", "Normally, I try not to dock down a rating because of bad service. I like to be fair and maintain focus on the food. Besides, I have many, many days where I'm a cranky monster and have a severe resting bitch face so I get it. Life is tough sometimes. But when your restaurant concept is as intimate as a sushi bar, where the entire place is literally CENTERED around the sushi chef, you better believe that your food and quality of your dining experience is heavily dictated by your interactions with them. And when you're dropping a pretty penny on sushi, the last thing you want is bad service. So let's just say our sushi chef was kind of a dick. When we were ordering, we hesitated a little because we didn't really know what to get. I'm not sure whether or not it was the lull in our ordering (like, one minute of confusion) but he was palpably annoyed; when he wrote down our order, he proceeded to SLAM his clipboard down on the counter. Um, excuse me? I'm sorry, but what the hell is your deal? I've only had such positive experiences with sushi chefs in the past... where they make conversation, recommend dishes, and provide such a calm and enjoyable environment. Look, you don't need to be my BFF4LYFE, so if you don't want to make conversation, the least you could do is be polite. Not to mention, the fish was not good. The tuna tasted like it had freezer burn and some of the fish was shockingly COLD. I seriously left this place with such a bad taste in my mouth. There are way too many great sushi restaurants in this city to deal with such ridiculous behavior. I don't f--k with you. #BYE"], ["Linda S.", "I just can't get enough of this place hence an updated review!It's a nice local restaurant with just quality fish and very consistent service and menu. I can always count on my sweet shrimp, spicy yellowtail handroll, yellowtail, scallop, and tempora cut roll. There's no pictures really ... And no chicken teriyaki type food :)"], ["Angela W.", "I was thoroughly impressed with Hama Sushi, walking in this authentic sushi bar, it reminded me of the sushi restaurants at Tsukiji fish market in Tokyo. The fatty toro was hands down one of the best pieces of sushi I've ever had in the states. And the sweet shrimp fried shrimp head, was fried to perfection. The entire meal overall for two costed us about $100, but if you pay with cash it's 10% off (don't quote me on the $ for this, but I was certain there was a cash discount)"], ["Jack R.", "It's like a Japanese speakeasy in the sense that it's hidden in between other Japanese restaurants, and if you didn't know what you were looking for, you could easily walk right by.There are signs telling you to have your party together and not to ask about teriyaki or tempura. This simply isn't that kind of place.Purist sushi or sashimi, ONLY.No reservations.Was about a 35 minute wait.Here are my thoughts:--Blue Fin Toro at $13 great value and flavor---Ankimo was a let down, old tasting and not fresh--- Spicy Tuna roll wasn't very spicy and had a weird pureed taste to it, like they blended the tuna and some spices together in a blender, but still couldn't get that great balance--Rock and Roll was good--Softshell crab was excellent---Softshell crab roll was even better, super hot and tasty--Hamachi was fresh---Sake (Salmon) was just okay---California Roll was disappointing, not very tasty and rather plain--Unagi very tasty--Albacore goodFor sushi purists, I can see this as being a 4 to 5 star place.The spicy tuna and California were a let down, and so was the ankimo big time.But everything else seemed to be great, and the service was spot on, hence the 5 stars.P.S The bill was more than $200 for two people. So your sushi will add up fast!"], ["Jenny C.", "This place is authentic and has the freshest fish. There is a sign that says, no California rolls, no teriyaki chicken. Haha FYI- All the sushi will come with wasabi. So if you don't like wasabi, remember to let them know. My favorite thing here is the salmon sushi, scallop sushi, and soft shell crab roll. Everything is amazing.It is pricer than some sushi places but you pay for what you get. I cant have this all the time, but it is a nice treat whenever I am in the mood for traditional fresh nigiri."], ["Kathy S.", "I've been curious to try Hama ever since people have talked about it rivaling Sushi Gen, which is my favorite. What I would say after finally trying it is that the nigiris are okay, but the sashimi is what really stands out. We ordered sashimi plates of the salmon and yellowtail...they were delightful. We also got nigiris of uni, sweet shrimp and toro and a spicy tuna maki - all good, not spectacular. Got there half an hour before they opened on a Saturday and we were the first ones in line so the wait was not bad at all for us four."], ["Denny K.", "Little Tokyo/ DTLA  4-star plus Omakase Reviews:  Part 1***************************************************************************The purpose of this series is to rank all the sushi restaurants in Little Tokyo/ DTLA (4 star and above).  Omakase style ~ I've heard lots of positive reviews about the place so I finally went on a Sunday. ****Tip****Go on Sundays and come 10 minutes prior to open.  There are huge lines any other time of the week.  I was a bit shocked there was no \"Omakase\" option.  Everything must be ordered on the slip of paper.  At first, I was a bit annoyed but upon further contemplation I appreciated the level of transparency in pricing.   I did have high expectations for this place.  So I will grade accordingly.  Tuna Toro - meets expectationsAlbacore Toro - slightly above expectationsSweet Shrimp - M.E.Kanpachi - M.E.Sea Urchin - M.EHalibut - slightly above expectationsYellowtail - M.ETuna - BELOW expectations. Even for tuna, it wasn't that greatEel - BELOW expectations.  Basically drowned the eel in that heavy sauce. TOO SALTY.  Opt for the sea eel instead.  Albacore - slightly above expectations.  Salmon - M.ERed Snapper - ABOVE expectations.  ExceptionalSpanish Mackerel - slighly above expectationsSpicy Tuna Handroll - ABOVE expectations.  Never had a spicy tuna roll like this!  DeliciousMAJOR DING:  TWO OF MY SUSHI HAD SCALES!!!  I would have given this place a 3/5 for that major infraction.  However, the spicy tuna hand roll and  red snapper bumped it over to a low 4.  So it barely eeked out a 4 star.  Rankings thus far:1.  Sushi Go 552.  Sushi Zo3.  Hama Sushi"], ["Frank S.", "Best Salmon Skin Roll in Los Angeles.  Red Snapper is right on the money, though they could add a shizu leaf for good measure.Halibut is overdressed.  Too much sauce like they're trying to hide something.Spicy Tuna is delicious.Atmosphere is perfect downtown sushi joint.  Makes Los Angeles a better place.  Old Sushi Chefs are the bomb -- as in they rock.Strong Recommend."], ["Jason L.", "One of my favorite sushi restaurants in LA!!! Without a doubt, Hama sushi is up there with the best sushi restaurants I've been to. If you are a sushi/sashimi fan and don't care for the teriyaki, tempura, or noodles, this is the spot for you. No messing around here...sushi and sashimi only!Everything I ordered was top-notch quality. You can instantly tell from the appearance and the taste. Salmon, yellowtail, tuna, uni, monkfish liver, spider roll....all amazing!! The miso soup was great and the edamame was on point. I even loved their seaweed salad. The presentation of the sashimi was also nice. They got pretty creative.The service was fine. No complaints. There is a bit of a wait if you come at the wrong time but there's a reason for a wait...this place is BOMB!Obviously, there's a price you pay for top-quality fish and that's understandable. So if you're looking to ball out, come to Hama."], ["Sisi K.", "Besides the long wait, which was worth it, everything was excellent.Loved it and will go back if i get the chance. The food was awesome, very clean and quiet. It is a sushi bar and they have four tables but it we had a great experience."], ["Ahmed S.", "+  Delicious/fresh sushi+  Fast service-  Staff not so friendly-  Very limited and cramped seating-/+  Prices are on the high end-/+  Can't take photos insideI'm a big fan of all types of sushi so I was excited to try this place with a few friends, as I have never been here before.  Upon entry, the establishment was very small.  Our group of 6 or so had to separate into two separate dining areas, one of which was bar only type of seating.  The other dining area had only 2 tables.The first thing I heard coming in was an older employee yelling at someone not to take photos inside.  Okay fine, I get it.  But immediately afterwards he was brushing off an incoming customer asking for wait times.  \"How long is the wait?  I'll be right outside.\"  He responded with \"No call, you come back\" and walked away with a wave of his hand.  This happened several times more as I was eating.The waiters/waitresses would come by often to remove random paper/refill your water/etc, but they would reach right in front of your face as you were eating.  A little awkward.  My gf placed her water cup on the one inch lip above her plate and someone immediately grabbed it and moved it back down.  I felt I was in an episode of Seinfeld in the Soup Nazi kitchen.  Had to be on my best behavior, or I'd get kicked out.The sushi served was top notch.  Very fresh and tasty and the sushi chefs behind the bar seemed to be very skilled in their art.  The price was pretty high @ $4-7 for normal pieces and $9-13 for something like sea urchin.  That dollar amount gets you two pieces.  While I understand the high price for top notch sushi, the experience here really turned me off.  I would not come back here again."], ["Jennifer H.", "Came in here for the first time the other night and I can't believe I haven't tried Hama sushi before! Came here because Komasa wasn't accepting anymore customers even though we went nearly an hour before closing time. This is always a no bueno for me when stores can't abide by their operating hours. But fortunately I happened to try Hama sushi and I really liked it. All the sushi we tried was fresh and delicious and the pieces of fish were huge, too. I particularly liked the seaweed used for the handrolls. Definitely of good quality. It was crisp and it stayed crisp. The sushi chef was also quite friendly, despite the language barrier, unlike most other sushi restaurants I've been to. I am so glad I got to try this place as I would definitely come back again! Way to go, Hama sushi!"], ["Gary I.", "Small, old fashioned, unpretentious Sushi~ya in the midst of historic Little To-kyo-  looking as though it should be a down home neighborhood \"Cheers\" where they always know your name. In tiny Sushi~ya like this in Japan, the owners take special care to create a neighborly, get-to-know-their customer approach. But a relationship w/ the Sushi chefs will probably never happen since this place is like a cattle car. It's very popular so the orders keep the Sushi chefs so busy that there isn't even time for introduction.   The customers are friendly, & there is a feeling of \"hail fellow, well met\". The more established looking Sushi chef does try to recognize their regular customers by saying a word of personalized greeting  & being a bit playful w/ the regulars.  If you want more than  a \"take a number, next\" approach & want to create a relaxed relationship with the chefs/owners, I suggest going to Mako Sushi on the third floor of Weller Court Mall just a block away where Mako~san doles out Edokko magnetism along w/ excellent Sushi & Sashimi artfully constructed. Edokko refers to an old time resident of Old To-kyo- w/  fast to strike a conversation charm.  Farther east, two miles away on 1st Street  is Otomi~san, which does not have a Sushi bar, but does have tasty rolls & Chirashi. The lady owner is hospitable tho it helps to know a bit of Japanese. In Tujunga go to Tori Yen, where Mariko~san will engage in friendly, rather louche talk & jokes as her son puts in his \"two cents\" as the straight man in this comedy team. The service & the Sushi here at Hama are fine if somewhat harried by having to take care of the hordes sitting hungry at the counter. I ordered: 1)  Amaebi (ah mah eh bee)/sweet shrimp which was fresh, velvety with a bit of a snap & ocean inflected light dulcet minerality.  The head was presented back in the form of  Miso soup contained within a small lacquer soup bowl.  There is not much to eat inside the head, although it is worth taking a bit of time to extricate the sweet meat, but the shrimp head affords the Miso soup a subtle, urbane Umami. 2)  Hotate Gai (ho tah teh gah ee)/Scallops were extremely soft almost like a delicate mousse that could still maintain its own shape even under the force of 1g.  Like the Amaebi, there was an oceanic sweet minerality that was a bit more pronounced. 3)  Kanpachi (khan pah chee)/Amber Jack had a smooth, moist, maybe even touch of slipperiness on the surface, but upon the first chew there is an al dente quality along w/ a nuanced meaty texture.   4)  Learned this Sushi roll combination from a long ago amazingly sophisticated Sushi restaurant called Katsu which was on Hillhurst Ave. back in the 1980's.  Katsu was the masterly chef who combined Uni & Ikura/salmon roe along w/ emerald green Shiso/O-ba leaf, Kaiware (kah ee wah reh) Daikon Sprouts.  The sea mineral, delicate, soft, unctuous mousse of the Uni & the salty, fishy, oiliness encased in the egg membrane of the Ikura was a wonderful combination of  rich oceanic Umami, but the refreshing green herbal scent of the Shiso & slight spicy bite of the Kaiware Daikon sprouts made for a complex flavour sensation.  I had to request a \"Tokubetsu Chu-mon\"/special request for this sybaritic morsel at Hama Sushi. 5)  I'm not into gimmicky rolls w/ too much mayonnaise & sweet, cloying \"Eel sauce\" which is all too prevalent in fake Sushi restaurants throughout Los Angeles that try to disguise their low grade, not too fresh, inferior quality of fish, & then call their Sushi \"fusion\".  However, I was curious to try Hama Sushi's \"Yawara Kani Maki\" better known as the Spider roll.  Version at Hama is excellent.   The battering & frying of the soft shell crab is perfect.  Over fried, the crab takes on bitterness &  be dried out.  Here the crab is soft, moist, sweet, meaty with a soft crunch. Tobiko or Masago fish roe is added crunch & savory, green Kaiware Daikon sprouts to contrast w/ the orange colored Tobiko, julienned cucumber for a moisture laden texture to add refreshment to the fried crab, a bit of what may be an aquacate based spiced aioli t adding  more complex Umami.   This Spider roll was  non-traditional, but excellent on any level. 1-5a)  Kikusui Sake (sah keh) of the premium Junmai Ginjo class.  Neutral in bouquet,  light sweet dryness, &  finish has astringent cleaness serving as the ideal palate cleanser after each bite of Sushi.  I believe  Sake is the ideal pairing to all Sushi & Sashimi.  After all, rice based foods, fish, & Sake have all evolved & interacted together through more than thousand years of Japanese cuisine.  What could be more ideal?  Hama Sushi: good food, relatively good price w/ good bang for the bucks.   For cognoscenti who want  good customer/chef relationship where they know you by name &  what you like as well as engage in personable conversation, then I suggest the 3 Japanese restaurants listed above.  A good solid 3+++ Yelp stars."], ["Maruko X.", "Ambiance: small and crowded traditional Japanese restaurant, only good for sushi or sashimi, no many hot stuffService: very slow and impatient, had to remind the waitress few times to get water refill, and servers speak poor English Food: in general just ok  Miso Soup (Tofu) - *** average taste  Softshell Crab - ** so so  Sashimi Combination - *** average taste, albacore tasted ok, tuna was so so   Smelt Roe - *** tasted good   Sea Urchin - **** very fresh, recommend   Surf Clam - ** tasted so so  Eel - *** tasted good  Sea Eel - **** soft and flavorful, recommend   Halibut - *** average taste  Shrimp - *** average taste   Salmon - *** average taste   Red Snapper - *** average tastePrice: similar stuff priced on the high ends compared with other Japanese restaurants, not worthy for its quality at all. Overpriced! expect at least $30 per ppl, though we tipped 20%, it should be the first and also the last time we visited this place"], ["Edmond N.", "Came in on accident because we wanted to try Komasa. Come inside and nobody is eating at 6pm on a Tuesday. That's fine I guess, but when we realized it wasn't Komasa, I told the old man that sat us we were leaving. \"Why are you leaving?\" \"Sorry I thought it was somewhere else...\"Then he goes \"Leave then and don't come back\"Nooooo problem. Regardless if your food tastes amazing or like shit no guest in a restaurant should take that kind of talk. So pissed."], ["daniel b.", "Delicious sushi!I have been craving to go back, which I typically don't get only a day or two after I have sushi.The staff is very friendly and helpful. But you will need to wait an hour or so.  Well worth the wait."], ["Stephanie L.", "Hama Sushi is one of those places where you constantly find yourself comparing to other relevant joints. After taking a bite of sashimi at other sushi restaurants, I always have to ask my companion, \"Is it better than Hama?\", \"Does Hama cut it better?\", and/or after a terrible experience..  \"Is Hama still open right now???\" Don't get me wrong, I don't think every single thing at Hama should be deemed of the utmost excellence or considered mind-blowing with every bite (although the salmon here IS the best salmon), but it's just a mixture of the service, food, and overall ambiance that makes this place the best sushi restaurant in Los Angeles in my opinion.I'm extremely picky about my sushi and so I've tried countless reputable places yet Hama will always be my go-to sushi spot in Los Angeles.If you go here, you should always start off with an order of the salmon, monk fish liver, tuna toro, and a spicy scallop handroll. You won't regret it!P.S. Special shoutout to the sushi men here for always hooking it up whenever my boyfriend and I come to dine. I think it's safe to say we're their favorite regulars when free toro is thrown in the mix (;"], ["Rachel V.", "Had to wait almost an hour to get in, but to be fair, it's a small and popular place. I liked that they are no nonsense, and only serve really fresh sushi/sashimi (no noodles or imitation crab here!). The hand rolls were really exceptional. The sashimi was really fresh, but had tons of wasabi paste (if you're into that, you'll love it). They are really serious about the quality of the fish, though, and the service was great. Got a fair amount of food for $50 (split between 2 people). I'd go back, but want to try other places in Little Tokyo, first."], ["Vincent V.", "A little cramped, but they make up for it with top quality and well cut fish. I came here with a friend and we sampled the list with no complaints.I have nothing but praise for this spot!"], ["Jaimie C.", "Worth the long wait. We were attracted to this place because of the sign on the door saying only sushi and sashimi. We kept passing it up because of the wait (45-60 min on a Saturday night).Today we decided we were just going to wait to see what the fuss is about.Everything we had was exceptional. I like sitting at the sushi bar and watching them prepare the fish and putting it directly on your plate as its made."], ["Nicole A.", "If you're looking for fresh and authentic sushi, this is IT! This is as authentic as it'll get! I've been to many many sushi joints all over LA, but the sushi here had a different freshness to it. My favorite was the salmon for sure! Everything on the menu was super tasty, but definitely try a few orders of salmon!!!!"], ["Natalie Y.", "I am hating myself at the moment for not knowing that I have yet written a review for my favorite sushi restaurant in Little Tokyo.I love sushi and I can literally go to a sushi bar alone if I have to. Its weird because all my close froends dont do sushi at all.Anyway, I have gone here so many times and I never took pictures because 1. I was busy eating 2. it says no camera in the restaurant walls. But I managed to take a few pictures of some sushi I had here. Definitely not all.Like everyone says, please try their spicy tuna handroll. It has to be the best spicy tuna HR ever. Yes, it looks pretty different when you look at it because its not really red. But it tastes so amazing! Their seaweed is the best ever. Its so toasty that when you take a bite, it does not cling to your teeth and it just comes right off. So good! Just the right amount of rice and spicy tuna, you will be amazed! Their spicy salmon handroll is also as awesome! Theyre priced at $4 each.I have tried everything at this sushi bar. Toro, kanpachi, hamachi, aji, amaebi, sake, uni, tamago, ikura, tako, and even their kappa maki, softshell crab roll, eel/avocado roll are the ones I can think of at the moment. I am a crazy uni lover so I always order at least 3-4 uni and its still not enough!The sushi man is really funny too. He will sometimes give you some salmon belly when he has some while you wait for your sushi. He jokes around a lot and he will make your dining experience a lot more interesting! Service is very professional. You will never have to ask for more water or have your empty plates seat around for so long. They always check up on you and very attentive!Parking is free for 2 hours with validation if you spend over $20 at the Japanese Village Plaza parking structure. There is a mimimum per person which is $12 and for credit card its $20 (visa, master & AMEX too!).I dont know why people go to the next door, Komasa. I have gone there couple times, their sushi wasnt special, service was whatever and their sushi man dont talk to you at all. Come here and see/experience yourself!!!!"], ["Ricky M.", "This place is soooo good!!  Seem like folks either love this place or hate it.  We liked it pretty well.We came in on a Wednesday night around 8pm and it wasn't too busy. The service was really fast and food came out really quick. The rice to fish ratio is amazing! We didn't have a lot of rice in our sushi which was great since I don't like having too much rice in my sushi.  I'll definitely be coming back during this time. If you're in the area, come try this place!!"], ["Luke R.", "The complaints here are nonsensical. I have eaten here many times and it is amazing. Best sushi I've ever had. NYC, Toronto, San Fran....this place is the best. There is one sushi chef for every 4-6 customers, so everything is quick and fresh. They often give you extra pieces just to be nice. I've never had a bad piece or selection. I would eat here 2-4 times a week if i could."], ["Michelle S.", "Hands down my favorite sushi spot in Little Tokyo, nonetheless DTLA. Sushi Gen, Sugarfish and all the other sushi joints are nowhere near in comparison to this place.  Everything you order is super fresh and the ratio of meat to rice is perfect!  They are very generous with the meat portion.  My personal favorites: 1) Best scallops I've ever had2) Toro3) Uni4) Unagi5) Spanish Mackerel6) Sweet Shrimp7) Hamachi8) Red Snapper soup is to die for"], ["Anna L.", "Hama Sushi is a place like home. Here, you will always be well taken cafe of by super high quality sushi, kind attentive chefs, and a traditional Japanese atmosphere. It's really great for two people, and it's also one of the few places I don't feel awkward to go by myself. You can interact with they chef if you like, and they are always so kind and nice and fun to talk to!Home-Run Dishes:Albacore sashimiSalmon sashimiSweet shrimpSnapperUnago and Anago (Eel and Sea Eel)UniSpicy Tuna RollEven their California roll tastes amazing!Tips: Free two hour validation parking in the little Tokyo mallArrive early, there's a line every eveningMaximum 4-6 ppl, table onlyLunch line is usually shorter ^^"], ["Clara L.", "have ko san serve youorder the anago (or unagi if you prefer)and the red snapper with fresh lemon juice and sea saltsteer clear of the grumpy owner"], ["William L.", "This place is so good! Very intimate and informal. Love the simplicity of the menu, and the price is pretty decent too!Our sushi chef was really nice and explainend the difference between the various fish and eel, and had a lot of great recommendations.I usually sign up for the waiting list , then walk around for 20 minutes looking at cool stuff around Little Tokyo!"], ["Duke C.", "Come here for the awesome nigiri sushi, crafted by awesome Japanese sushi chefs.  The sushi bar seating is most of the restaurant so you really are getting an up close look of the chefs.Huge fan of the unagi.  Eel done right.  There's a bite to the eel here that you don't get anywhere else!  Salmon roe is very flagrant here, most likely shoyu marinated instead of salt marinated.  All the raw fish here are good, with mackerel being my favorite.  Of course, very fresh uni for the uni fans.They have have these bomb tamago.  Huge pieces of small amount of rice! One thing that's a hidden gem for me was the Miso soup with clams. Essentially you get a decent sized bowl of miso soup, with a ton of small clams!  Great value for the price.Also had the meatiest soft shell crab.  I don't know where they find these soft shell crab but it was crazy haha.As always, there's a line on weekends, so best to come early."], ["Sarah K.", "Well, it's been a few years and I am re-reviewing this place. Two stars if you are getting sushi or sashimi.Three stars if you are getting rolls. I'm not really a roll fan, but this time around I ate a bunch of the rolls and they were decent. I personally did not like the strawberry roll, but that is a personal taste. Strawberries and sushi did not mix well as a flavor profile for me. The rest of the rolls were decent and average at best.This place is still pretty darn pricey. Still not a place I would choose to go if I was given the choice of sushi places."], ["Ann N.", "Very small and looks like a whole in a wall kind of place. Tried this place since a patient of mine said its as good as Sugarfish, Nah disappointed sushi was fresh but nothing like SugarFish. I only like the salmon sashimi.Not for me"], ["Kelly D.", "ehh....pretty disappointing sushi.it was pretty expensive-- $18-20 rolls. there was almost nothing cheaper than thatand it definitely didn't taste like a $20 spicy crab roll with albacore on top.you can see the chefs making everything so you know its fresh but it just tasted bland and slightly raw.  I was definitely expecting something more based on the ambiance of the restaurant and the price tags on the food."], ["Michelle L.", "We arrived here around 1PM and got seated immediately. The restaurant is small and has narrow hallways. The place probably has 30 seats available. We sat at the bar and ordered 2 spicy tuna hand rolls, 2 red snappers, 2 Spanish mackerels, 2 salmon bellies, 1 toro, 1 amaebi, and 1 uni. This place has fresh fish, though definitely not the rarest cuts. The prices were decent, and I was satisfied. Total came out to be $85 and it's not bad for 2 people. Because this place is small, the waitress was attentive to everyone's needs. If you want water refills, then you will get refills in the next second. Note: This place is sushi and sashimi only! If you are looking for teriyaki, tempura, or noodles, then this is not the place for you."], ["Cielito D.", "A random find in Little Tokyo. This place is great, a little pricey but well worth it. The sushi I had were fresh. There is nothing left to say but give this place a try.  It's quiet and mellow inside the restaurant so you can really enjoy your food. It's cash only and parking can be tricky in Little Tokyo but it's worth the trip."], ["Terri M.", "I think this might be favorite sushi restaurant in Little Tokyo. Order the salmon skin hand roll and the spicy yellow tail tuna hand roll. The albacore sashimi plate is also great.After your meal you usually get some sliced oranges to round out the meal, I really love this little touch.  the sushi chefs are super friendly and will answer any questions you may have.There are signs that request that you please not use your cell phone or take photos. Dinner is far more pleasant when people are actually talking to their dining companions instead of staring at a screen."]], "Yakuza Sushi": [], "Sushi Ye": [], "Restaurant Komasa": [["Crystal N.", "This place is not for the castraphobics. Be prepared for no escape as you will be closed in with 2-3 dozens of happy sushi-loving-souls! If you're lucky, right when you try to enter the cozy little restaurant, you'll be greeted by the nicest gentleman who's going to be your host! You'll find him gracefully busying himself in and outside the restaurant to ensure all patrons are happily seated as quickly as possible. When it's cold outside, he'll even gift you with cups of hot teas to keep you warm! He swoons us as much as the delicious sushi does. The secret behind Komasa's awesome nigiri is their sushi rice. They always say a good sushi chef must first master the art of rice.  You must order:As many yellowtail, salmon, uni, sweet shrimp nigiri you can handle.As many dozens of raw oysters you can handle.The monkfish liver (foie gras of the sea) here is also fresh, creamy and delicious. *They also have an assorted sashimi platter which I thought was even better and more reasonably priced than Sushi Gen's - I definitely am a bit biased as I am more of a traditional mom & pop shop kind of girl when it comes to sushi. Komasa wins my heart instantly. Sushi Gen would be great for their lunch specials and ambiance (if that's what you prefer more). Cold or hot sake excellently compliments the fresh nigiri and monkfish liver here as well. ---Free Parking - Park in the structure between 1st and 2nd street on S. Central Ave. Pay first ($5-7 depending on time and day). Komasa validates your ticket and you'll receive a refund when you're heading out of the lot."], ["Molly K.", "Very disappointingI was visiting a friend in the area, we decided to try a new sushi spot, Based on the reviews- We chose this place, small when we got there, easy to find, paid parking lot across the street, Nice host, semi friendly server- explains the 2 stars but the sushi at this place is ok! I am a sushi lover, have explored spots from inland to the valley and this place is just a yelp hype! I ordered baked mussels- were ok, my alaskan roll was alright, and my sashimi sucked, except the 2 salmon sushi pieces were eh! My friend was also very disappointed with her yellowtail roll and spider roll. Thanks, I willnot return for the food!"], ["Linda Q.", "Pretty decent sushi, but not as good as the sushi only places nearby. The tempura was also just okay. The food is typical of Little Tokyo, but not remarkable. The waitress was incredibly rude. She was very eager to collect the bill and hovered by our table while we were enjoying our conversation. The waitress even grabbed the money on our table before we were ready to pay. Maybe she had some customers done and dash on her but I hardly think my 60 year old parents were going to do the same. It's a shame that our meal experience was completely ruined by this one waitress."], ["Joanne L.", "I think they hav really good quality of sushi ! I always wait like.. 30~40 minutes, but it is really worth it!!I used to go to ones that are near by, but i would reather come here instead. compare to what i pay, really really good quality!:) very recommended place for sushi if you got some time ! :)"], ["Steven U.", "Been to Hama (essentially next door) and always wanted to come to Komasa.  I ordered the combo set c (the 11 pieces of sushi) and a couple supplemental pieces of sushi such as fatty tuna, spanish mackeral, scallop without mayo, octopus, eel, and egg.  The highlights for me, were the salmon, fatty tuna, and spanish mackeral (a little salty but that's what I was looking for).  For what I got, I felt that $60ish was bang for your buck.  Not the best quality fish I ever had but it wasn't bad either.  Salmon was the stand out sushi for me.  Wasabi can have quite a kick here."], ["James S.", "Best sushi in little toyoko LA. No reservation. Come early. Average waiting time is 30 minutes."], ["Eric Y.", "A small and cozy place with great service.  I always order the salmon skin salad before gorging on their sushi.  You can never go wrong with the uni, ikura and salmon sushi.  I always feel great after a meal here.Of course, space is limited so it's best to go with with a small party.  But seriously, the wait is worth it."], ["Steven H.", "First time trying it! An old friend recommended this place and I was absolutely delighted!  There is only one sushi chef so be patient it is worth the wait. The place is a bit small but the wait was only about 10 minutes. It is very busy so be sure to sign your name. The three of us got sashimi combo C, which was wonderful, pork cutlet and steak teriyaki bento, and freshwater eel sushi."], ["Kelly D.", "Great customer service at this place! We showed up with a party of 6, which was relatively large considering the space, and the staff went out of their way to keep us updated on our anticipated wait time - I even got two phone calls while we wandered around nearby! The sushi rolls I ordered (salmon skin and spicy tuna) were pretty good - nothing out of this world, but I'd happily eat here again if I'm ever back in Little Tokyo."], ["Stephanie Y.", "Monkfish liver is my favorite!!! Also their sashimi are really fresh and they make a pretty good size. Try their yellowtail ! Can't wait to come back!"], ["Saleem H.", "One of the best sushi places in Los Angeles. The service was fast. Fish was fresh and the restaurant is small and cozy. Eating here was an experience."], ["Amanda B.", "I really enjoyed this place. Full disclosure: I was kind of hangry by the time I sat down so it might be fair to say that I would've enjoyed _any_ place. :) I had the sushi combo b and sake. Company had chirashi, fried shrimp, octopus salad, sushi combo c, and tempura. All was delicious. We waited for about 40 minutes; not so bad, considering it was dinner time on a Saturday night.The good: solid sushi.The bad: not really bad, but my buddy had to wait for like 30 minutes for his trash--used moist towelette and wrapper--to be removed while the rest of us enjoyed our ample elbow room. We made a few good jokes about it, so really, I should be thanking the wait staff."], ["Hannah D.", "We went here on a Sunday night at 8pm and wait for 2 people was 45mins.  It's in the Japanese Village in Little Toyoko so we just walked around until they called our cell phone.Ambiance:  Small place but clean, has a homey feel.  We sat at the sushi bar and the owner was behind the counter making sushi.  Our waitress was his wife.Food:  I had the 9 piece sushi combo B.  Came with miso soup give it extra points b/c lots of mushrooms mixed in with tofu.  The sushi itself was very fresh.  It was generously portion and not too much rice.  The yellowtail salad was also well sized and great salad dressingService:  very attentive, although we waited to be seated we didn't wait for more than 10-15mins for the food to come outParking:  validated parking in garageWould definitely come back again and try more things next time!"], ["Raul R.", "Service is very slow. Compared to their neighbors Hama sushi, this place Komasa can have you seating for more than 15 minutes and not getting served . At least that was my experience at the sushi bar. I was really hungry and had that short break from work. Unfortunately Hama opens until 5:30 pm. And couldn't wait any longer. I regret going into this place and I am not going in there again."], ["Michael M.", "Great restaurant. The staff and the sushi chef were great.  They were so nice and the chef stopped what he was doing when I was at the door and said good bye with a smile.  I really liked that."], ["Darlene Y.", "Komasa is one of the better sushi spots in Jtown, and it's quite small. Good quality sushi for a decent price. UNI & SWEET SHRIMP are must dishes while there. ENJOY!"], ["Suzanne S.", "I come here every time I visit LA.I find it relaxing."], ["Jennifer H.", "One of my favorite sushi restaurants in Little Tokyo, along with Sushi Gen, to dine in! Everything, and yes, I mean everything is delish! From sashimi to sushi to beef teriyaki plates...all delicious! From their appetizers, agedashi tofu is my fav and their oysters are also fresh and tasty. Komasa's spicy tuna hand roll is one of their best from the menu, in my personal opinion. The size of the restaurant itself is extremely small and so there is almost always, usually a wait. But, honestly, the wait is always shorter than what they tell you it will be or close to it. You can leave your name and phone number so you can walk around and do a little shopping while you wait for their call. I think there is a \"Cash only\" sign in the restaurant,  if I'm not mistaken,  but they do accept credit cards. It's one of my go-to sushi restaurants in J town."], ["Michelle K.", "Come here you won't regret it at all it's the best suishi place . This is my go to place for my suishi fix.  The staff is very kind always picking up trash and giving water really sweet people ."], ["Nathan G.", "Really great straight-up sushi. The fish is fresh, ample sized cuts and the price is not bad at all. Even the side of pickles was delicious. The rolls are simple and not the complicated fancy types seen elsewhere, and are delicious. The sweet shrimp was especially good. It's the best I've had in Little Tokyo."]], "Mia Sushi": [["Dana S.", "First time trying out this place and I absolutely loved it. We got the Firefish yellowtail , lobstertail roll and highland park roll and the philly willy roll.The yellowtail is really fresh. Lobstertail roll was amazing! Highland park roll is very tasty because I love scallops. The salmon on the philly willy roll was awesome! We will definitely be back!"], ["Lilian J.", "This review is for the service although the food was mediocre giving it a solid 3... Walking in, smells soooo strong like they need more vents or something but whatever I could deal with it. We sat down and from there on out felt like we needed to flag people down to help us even though there were like 5 servers... The guy helping us looked like he was mad at the world and absolutely no farewell or a \"thank you for coming\" when we left. Won't be back"], ["Ken W.", "I was craving for sushi, so I did a search on Yelp. We went to Mia Sushi because of all those 4 and 5 star reviews.  I don't want to be mean, but just came back from the restaurant. My wife and I ordered 4 rolls.  The rice was dry and hard on all four rolls.  If they are a sushi joint, how can the rice be dried and hard???  The fish was not as fresh as it should be.  The bill came out to be $40 after tax and tip, but we both were still hungry.  We had to buy 5 tacos from taco truck.  This would be one and done deal for me.If you want real good sushi, don't waste your time and money, please find another sushi place.  Don't let the restaurant appearance and Yelp ratings fool you.  Believe me, you will thank me."], ["Chris H.", "Great food. Cozy place. Fast service. They had Echigo Beer which is hard to find. The Lobster Roll came in a Lobster tail and was amazing delicious. (Check the picture) My girl had the bento box with teriyaki chicken and it was loaded with chicken. We will definitely be back. If it wasn't so cold we would sit outside in the nice patio."], ["Elizabeth B.", "Came here a while ago - but all really great things. Price is right and the quality is even better. Neighborhood gem in eagle rock, great addition. Service is attentive and the people who are running the joint are genuine. Both creative and traditional- awesome price and a lot to offer. Very warm atmosphere, comfortable but young. Definitely coming back to have another girls night again. yummmms"], ["Frank Z.", "Miso soup, Cali Roll, Whisper Roll, and Dynamite Roll. All amazing. Nice clean area and relaxed atmosphere. Definitely the best sushi spot in the area. Friendly and attentive staff. Our order was ready surprisingly fast, except for the Dynamite Roll which was well worth the wait. Mixed Tempura looked amazing and I'll definitely have to try the Lobstertail Roll next."], ["John R.", "Ok, I don't ever post on Yelp, but this place is too incredible for me not to. I moved to LA from Boston and I am a big sushi lover. I was nervous to try this sushi because it seemed \"too fusion\" for me. Three months later, I come every Thursday! The food is on point at all times and the staff are equally, so. So friendly, personable, and professional! Great spot for any and all occasions!Try it. Love it. Keep coming back!"], ["Mae C.", "Sushi is good BUT what really upset me is how selective the servers are. We are all the same, people. I observed and sat there the moment we got seated. It started off well, from there it went down hill. The servers did not acknowledge us at all. I watched them attend to everyone else, our drinks were empty, we wanted to order more but not even the chefs or servers bothered to look at us. Can't believe the way the servers and chefs made us feel. If they felt that we didn't look like we didn't have money to eat there, we wouldn't have even bothered in the first place. Just a friendly advice, careful what you look like when coming here cause apparently when you're not some white descent you're non-existent at all. It saddens me how people easily judge just base on what they see and categorize you base off that. Coming from a business background you guys have lost some loyal customers and I hope this teaches you guys how to equally treat people. This is the first time a restaurant made me feel like I was being discriminated, super upset."], ["Edwin A.", "Skip the Nigiri/Sashimi and stick to the rolls if you must come here. The location is great if you're in the Eagle Rock or Glassel Park area, but despite what people say location isn't everything when it comes to food. The salmon nigiri was chewy and lacked the buttery texture and amazing flavor that I've come to expect from high quality salmon. The yellowtail and albacore were both sub-par as well. The highlight of the night was their firecracker roll. It was well made with great flavor, which although good, somewhat overwhelmed the fish (might have been good in this case). Aside from that sitting outside is also not what one might expect. Given that it's on Eagle Rock Blvd, you get an endless stream of cars passing by, many of which seem to rev their engines right as they pass by. In fact one guy parked right outside to the right of the restaurant and kept revving his engine thinking everyone thought he was really cool. I can't really fault the restaurant for this, but it does ruin the experience.  To top it off, it ended up costing us almost twice as much as some of the good inexpensive places I'm used to going to in Little Tokyo."], ["Alicia B.", "The new-ish owner Justin works in the floor so the service is polite and efficient. I've become a regular here and enjoy it very much. All the dishes are well done and you can pretty much order anything off the menu and be happy. The vibe is friendly and inviting while the front patio is nice to grab a drink after work to get some \"fresh\" air."], ["Pam L.", "June 10, 2015Was craving some sushi so decided to come here on a random Wednesday night. We got seated outside in the front patio and was nestled perfectly next to a heat lamp (I get cold fast). The waiters were very attentive and consistently checking in on us. For starters DRINKS. We decided to get the warm sake and Japanese Red Ale that was recommended by the waiter. The ale was good, light with a bite to it. It complemented the salad we got. The regular sake was good, but the waiter then recommended the sake that had an added splash of plum wine in it and that was delicious.Salmon Skin Salad- There was salmon skin in every bite and was crispy complementing the greens.Spider Roll- I get soft shell crab everywhere I go and this definitely was fresh. Oxy Roll- This is my kinda of no rice roll. Filled with tons of goodies (salmon, white fish, shrimp, avocado) topped with crab and spicy mayo. Every exploded with a burst of flavor. Last but definitely not least DESSERT. The wonton green tea ice cream tacos were topped with whip cream and drizzled with chocolate syrup. The wonton were lightly fried and complemented the ice cream so well, by not taking away from the green tea flavor. This finished our meal off right!"], ["Josephine B.", "Had this Fusion Japanese food for few months ago.I usually go a traditional Japanese sushi bar,and dislike some American style Japanese food, such as California roll! Any roll made for big portion big entrée. It just like anyone can put rice in plate. But I kinda like this restaurant!!!Mia sushiEnvironment: first time when I walk in, I want start taking picture. The facility are clean ,nice, and very style. The worker all wear nice Japanese uniform~ and use energy voice tone to talk to you. Restroom are clean and their sushi bar can show the food all fresh. They medium size place really impress me want share it to my friend.Service:They really care about how we trying to order. They will have patient to introduce food we asked. And not pushing us to order everything. Even we really crazy to have almost all the food of the menu lol. They clean table very quick and nicely talk to you and try to use like friend tone to communicate. Even they will show some special create food and tell you how they cook different. Which is very nice.Food quality: Well,this is more important part for me. As I said I don't order roll, but some of my group they asking roll (cause a lot of GUY) and they came really really delicious and flavor.Even I want start try another style roll~I love their sashimi carpaccio. And some fried food are yummy too~ basically you paid what you get and Here you can pay a little bit less but you still get nice food quality.So far~ I start missing this place and I'm gonna ask some of my friend to have a try Again! And let them bookmark this place like me^^"], ["Ashley J.", "Mia Sushi have such a pleasant looking patio that we knew we had to check it out. The patio faces busy Eagle Rock Blvd but beautiful lighting helps make the space feel intimate. Great place to grab a drink (beer, sake, or wine) and have some rolls.  It gets quite busy on the weekends so plan to arrive early if you want a good seat. All the servers are super nice and well informed on the menu. I highly recommend the firecracker roll. Also great to know they take orders through Eat24."], ["Robert L.", "The management and staff went out of their way to provide the best booking, planning, follow-up/confirmation, and service for our large party. We were celebrating a significant graduation with a party of 20+. The food is fantastic and again, the (new) management was out of this world. We are locals and will continue to come to this gem in our neighborhood."], ["Joon A.", "The food here is really amazing and the price is just right for it. The seaweed salad is one of my favorites, salmon tartare  is really good. Service here is excellent, very customer friendly. Atmosphere is just right for the nights and weekend."], ["Lily Y.", "Nice ambiance. Very clean and modern. Good for dates or a yummy solo meal at the sushi bar!What I ordered:-Freshwater sea eel: Good! Not the best that I've had but still tasty.-Firecracker roll: I was slightly disappointed with this roll. It tasted very Americanized and I thought that it didn't have enough fish in it. I felt like there was too much rice and tempura flakes.Free green tea ice cream with yelp check-in!Free parking (in the back) or you can find street parking"], ["Alexandra K.", "Cosy little sushi place with an amazingly friendly staff. Fortunate combination of aesthetically pleasing food presentation and amazing quality of fish. Try their oysters with uni and red caviar topping,i normally prefer pure oyster taste,but this mixture of flavors simply blew me away.And they looked like jewels on a plate. Will be back!"], ["Tiff L.", "Came here with my girls and I absolutely loved it. I rarely write reviews but the staff and food was just excellent I had to encourage them. We sat outside in their beautiful patio. It was cold but they turned their heaters on and it was great after!I ordered their seaweed salad, yellowtail belly, salmon belly and lobster tail roll.Seaweed salad was a big portion and it was the best I've had at a sushi restaurant. Yellowtail and salmon was so fresh it just melt in my mouth. Lobster tail roll is just amazing! It literally came out in a whole lobster tail shell, huge portion and the taste is awesome. Highly recommend this roll!My friend said she loved the uni and firefish yellowtail and the fish tempura. I love this hidden gem! Great service by Xavier!"], ["Sandy F.", "Happened upon this place by accident and so happy I did. I had the yellowtail sashimi (delicious and extremely fresh), rock n roll shrimp roll (yum), firecracker roll (awesome), and the spicy tuna on crispy rice (really good).  Then finished off the night with a macaroon ice cream sandwich (mango and strawberry). This place is a hidden gem. Can't wait to come back soon."], ["Jin Y.", "More like 3.5 but I'm rounding up because they allowed me to use 2 discounts in one visit. I showed the HLP app for a free bottle of sake, I got a green tea, and also an ice cream. I pretty much milked them for all the free stuff I could get and that makes me cheap... or resourceful.Anyway, the food was pretty decent. We ordered Uni nigiri, yellowtail roll, dynamite, rock n shrimp roll and we would've ordered the oysters but they were out. Apparantly they have oyster happy hour during the weekday so it sells out. My favorite was the uni nigiri. the dynamite was an interesting presentation and I enjoyed it more than the normal presentation. Yellowtail roll was good. The rock n' shrimp looked much better in pictures than in real life, and this was probably our least favorite. Service was good, ambiance was great, and I'll definitely be back! I'm glad I didn't have to drive all the way to little tokyo for some sushi."]], "Sushi by H": [], "SUGARFISH by sushi nozawa": [["Kate M.", "I felt like I was getting great value for the Trust Me and basic sake. All that keeps me from eating more sushi than I do is the price, so value is important to me. I also appreciate that they will call you when your table becomes available, so you can grab a drink at any of the gazillion restaurants and bars in that intersection while you wait.My only bummer was that my rice didn't hold together in a few of my pieces when I picked them up with my fingers for the first time. I might expect that with chopsticks or multiple bites, but with fingers and one bite (the right way) I really didn't expect to see chunks of rice fall to the plate."], ["Elizabeth Y.", "I love the fish that they serve here. Extremely fresh, and so smooth. Sure the wait can be long, but you can always jot your number down so that they can call you when your table is ready. Meanwhile go across the street and grab a drink. I recommend the Trust Me course. It's the right amount to fill you up and won't hurt your wallet too much. $30! Note, this includes hand rolls, but no actual rolls. The only one thing I would ask for them is to have the rice for the sushi a bit more packed as it does crumble the moment you pick it up, even for the chopstick experts. I would definitely come back to this place again."], ["Maheen M.", "What on earth is this place?! It certainly doesn't deserve to be called a sushi restaurant. I ordered the trust me and I was sorely disappointed. Clearly the sashimi that was served was freezer thawed. It ruined the entire taste of the fish. Then was the sushi. It was sorely lacking in taste. Some were too salty and the rice was all over the place. Also, after eating it, my mouth was very dry that I had to take huge flips of hot tea to help me swallow. Lastly, there was a roll. The toll was warm, crisp, and flavorful. It was a bit salty so that was a turn off. Service is quick and the waiters are helpful. You get served asap. There's no time for dilly dallying here. The ambiance is very western and modern. This place is beyond over-hyped. The food is mediocre at best. I would advice not to come here."], ["Tiffany E.", "This place was so good. I came here with my boyfriend after only hearing good things about this place. There is no real need to dress up but we did and saw a couple other tables of well dressed people. Of course we had to get the \"Trust Me\" so we got one each and it was enough to satisfy yourself without feeling unbearably full. Also got the daily special oysters which were unbelievably fresh and sweet!Definitely loved the fish as it melts in your mouth but my personal favorite was the blue crab handroll. Worth every penny to me!!"], ["JR C.", "Been walking past this joint the last couple years, but never bothered to walk in because sushi usually means expensive and Sugarfish is franchisey to bat. Turns out that the stuff that comes out of here is pretty fresh. Sure, you lose touch with the intimacy of an authentic sushi bar, but that's not what Sugarfish strives to be. Sugarfish churns out tasteful sushi at a prefix price, and most of it melts in your mouth. It's a upscale dim vibe in here, so dress accordingly. Pretty packed inside and there's almost always a wait. No reservations are taken so get your name in there so you can be dunking your sushi within 15 to 20 minutes.-=-So you missed DineLA-=- No big deal. The regular everyday dinner menu here has something just like it called a Tasting, which is super similar in price and +/- one roll.-=-DINNER Tasting-=-This is it, all you'll ever need to order. It's displayed prominently on the menu and probably the most popular. You'll already notice that sushi served here is not the most traditional. Mostly every sashimi is drenched in sauce. It's tasty, but not your vanilla sushi experience. One of the biggest departures from tradition is the warm rice. Purists will say that this cooks the sashimi, but really though, just put it in your mouth. My favorite, as well as everyone else's, would be the blue crab handroll. It's just one of those simple flavors of crab you can't get enough of. CRAVING NOW.Edamame starterTuna sashimi served with scallion and ponzu sauce2 pieces of albacore sushi2 pieces of salmon sushi2 pieces of yellowtail sushi2 pieces of halibut sushi2 pieces of large scallop sushi1 toro handroll1 blue crab handroll$35"], ["Connie S.", "Great place for sushi lunch! I always get the Trust Me and I'm stuffed by the end. Meal starts off with edamame, 6 pieces of sushi, then 2 handrolls.  It may not sound like a lot of food but it is! However, get their uni and sweet shrimp a la carte. The uni is so sweet and fresh. One of my favorite places to get it. They will not accommodate for no rice but they do have a few sashimi plates. (In my opinion, it's not worth it.)  but they will do little rice! Also, tip is already added onto your bill, which makes it easy to just pay and leave. And the service is great so you don't feel ripped off with the automatic gratuity."], ["Daz L.", "I am picky when it comes to fresh, raw food... Sugar fish did not disappoint. I can still imagine how sweet the freshness of the seafood sushi they served us. It is worth every single penny that you'd pay for each serving! Definitely a sushi/sashimi go-to place. My only worry is the parking situation. Hmmm..."], ["Harmony L.", "First off, I want to mention how impressed I am that my friend and I were able to be in and out in 30 minutes since that's how short our lunch break was. Usually if you get the packages (Trust Me, Trust Me Lite, etc.) they bring out the next dish when you're done with the one you're eating. Knowing this, we asked if they could just bring it all out at once or as the chef is done preparing it. They did a decently good job, a bit slow, but it's understandable.It wasn't busy, which was shocking, so that helped. I like that there is also a parking garage around the corner that's decently priced.Back to the food, it was delicious, this was my first time here. The fish literally just melts in your mouth AND pairing that with warm rice is perfection. I regret not getting the Trust Me (I got the Lite); I didn't want the food to stop coming!It's really not as expensive as everyone says it is. For the quality you're receiving, it's definitely worth it. However, I wouldn't come here on an empty stomach. Will definitely be back!"], ["Elizabeth L.", "Sugarfish is my go-to for sushi. I come here with my bf often, and the food is always always consistent and delicious! Also, the servers are attentive and nice. It's nice seeing familiar faces every time we go in, also.The wait is inevitable, but it does become a huge inconvenience. Sometimes (like yesterday), we had to wait an entire hour! Thankfully, we live nearby so we went home to wait until they called. When they call, they only give you about ten minutes before they give your table away. It's a little ridiculous, but I guess there's nothing you can do about it.The nice thing is, even though they close at 10pm, they take names until that. The kitchen doesn't close until much much later since you could be seated around 11pm.Obviously go with the Nozawa or Trust Me. They are the best value and give you a great sampling of each dish. I also love adding on a lobster handroll, and it is delicious.Don't forget you can ask for light rice on handrolls for those of you on a diet :)"], ["Ray N.", "Came here the other day, and let's just say-- I'm reborn again.Location wise, not the best. it's DTLA. Good luck with parking. $7 for all day parking at that East West parking structure. Wah.Service was pretty awesome. The waitresses were extremely genuine and friendly. Gotta love them genuine people! Keepin' it 100, ya feel me?Food here is AhHhhhhhhh, mazing. Keep in mind this is NOT the typical \"oMg LeTs Go fOr a KaLiFoRniA rOll\" kind of spot. This is the legit RAW FRESH sushi spot for like nigiri style fans... Like the REAL RAW sushi fans. The quality of the fish here is insanely delicious, fresh, and melts in your mouth with just an exhalation. I don't know what was the secret, but ALL the fish I got from the combo was addictive! I WANT MORE. Now if only I could get a hot date to treat me anything I want here...... haha. But trust me, all the nigiri here does not disappoint. Oh, and stay away from anything with seaweed here-- it just sorta kills it with the chewiness. I don't know why, but it just tasted different (even the handrolls). Just say no to seaweed and taste the REAL freshness of them fish, yall! I feel like I'm about to protest for this, lol. But beware, the price is way on the steep end. But on a brighter note, gratitude is included in the bill I believe...Overall, I LOVE LOVE this spot.... if it wasn't so expensive :'(. But with the quality of fish, I totally understand.. it's not you, it's me being so darn broke! Haha. Service was great and quality of fish was amazing. The End.Will I come back? You betcha. BRB saving my money begins now. Plays: Rihanna- B better have my sushi!"], ["Michelle Y.", "Been DYING to try this place and finally tried it tonight!So my boyfriend and I decided to come here for DineLA (but realized it's not really a huge diff between the regular menu and DineLA) We ordered the DineLA option and The Nozawa trust me.DineLA menu came with:Edamame starterSalmon sashimi2 pieces of albacore sushi2 pieces of salmon sushi2 pieces of yellowtail sushi2 pieces of halibut sushi2 pieces of large scallop sushi1 toro handroll1 crab handroll1 lobster handrollAll for $40The Nozawa trust me came with:Organic Edamame2 pieces of Tuna Sashimi2 pieces of Albacore Sushi2 pieces of Salmon Sushu2 pieces of Snapper Sushi2 pieces of Yellowtail Sushi1 toro handroll1 blue crab hand roll2 pieces of \"Daily Special\" Starting off with the Edamame: it was nice and salted! Tasted sooo great. My main highlights were the Tuna Sashimi which tasted soooooo fantastic. Each piece literally melted in my mouth, it was sooo amazing. And I'm not a huge fan of Tuna either soo, this was a total game changer! The Halibut and Snapper stood out the most (not saying the others weren't great; they were all sooooo amazing!) I can really tell how great the quality and and texture was with each fish. Sugarfish... I seriously don't think any sushi joint and top this. Everything is so fresh and superb. The sushi is also served with WARM rice which was sooo heavenly. The ONLY thing I did not really enjoy was the blue crab hand roll, which tasted okay to me. The 2 pieces of Daily Special was a piece of scallop on each shell. The lobster handroll was very good. All in all, the hype totally lived on for me. I'd come back here in a heartbeat. Seriously, fell in love with this place with the first bite. Ambiance is spacious and very modern looking. Service was kind and friendly. They're very on top of their tasks. Parking is validated at a discounted rate for $4! Right across from Bottega LouieOverall, great dining experience :) Pretty pricey, but worth it."], ["Nikita D.", "I have a skewed review because I am a vegetarian. but for all my fellow vegetarians, do not go here! Most sushi places cater to vegeterians a lot more... the only option here is a cucumber roll.. All my friends who had the real food enjoyed it but NOT THE SUSHI PLACE FOR A VEGETERIAN."], ["Jennifer H.", "The hype unfortunately did not live up for me.I've been blessed with the opportunity to try wonderful sushi in my life and sugarfish is mediocre to me. I got their special sushi plate and it was okay at best. I thought the quality of the fish was okay not great. I could definitely tell the tuna was not fresh but had been frozen due to the color and taste. Which leaves me questioning why I even bothered to eat here if I wanted fresh fish?The fish quality wasn't even really what bothered me the most, it was understandable but some other things aren't.Why I didn't love it:1. rice to fish ratio: I thought there was too much rice to fish. Yes it's cutely shaped but I don't care about shapes, I want fish and the appropriate amount of rice to go with it.2. VINEGAR: that's all I tasted when I ate the sushi. typically sushi rice has vinegar in it to enhance the sushi taste but maybe it was that night or whatever, but holy crap.... the vinegar was strong and overbearing. It got to the point where I removed all the rice and just ate the fish.3. Selection of fish: Dismal is what it was. They only had basic fish cuts and maybe a couple of the more exotic ones. If I'm paying to go to a nice sushi restaurant then provide that quality. I didn't pay the special sushi plate price to get salmon, tuna, and yellowtail. 4. This last one is just my personal preference. I did not like how you cannot see the sushi chef make the sushi. This means I can't see how fresh the fish is and how they're making it. It makes me question the quality of the sushi. The kitchen is closed off and all I pretty much saw was a couple of guys just mass churning out sushi. It was really just disappointing. I have never had sushi like this until this restaurant and I don't think I will ever again. The service was good. They are normally very busy so expect a wait. I don't think it's worth the wait but if you're looking to eat sushi in a trendy, modern restaurant, I guess this fits the bill. But in comparison to other sushi establishments I've had of the same class, sugarfish is the bottom for me. I don't mind paying $$$$ for sushi but I just wouldn't bother here."], ["Kavya P.", "I came here for dinner a few months ago, and it has been by far my favorite sushi place in LA. The food was spectacular, the staff was kind and helpful, and it doesn't hurt that the restaurant offers parking validation for the parking structure around the corner.If you're new and don't really know what you want, go with the Trust Me! It was the perfect portion size for me, and $30 felt like a very reasonable price for the amount (and the quality) of food I got. But if you think you're a more voracious eater, try the Trust Me Nozawa($40), or the Trust Me Lite($20) if you have a smaller appetite. This option makes it easy for sushi newbies to try a little bit of everything, and to get a feel for what they prefer.One thing that is blatantly clear is that this restaurant values quality. Every bite melts in your mouth. The seafood is fresh, the rice is perfectly cooked, and it all comes together so astoundingly well. The food was served in a timely manner, and in the end, I don't think I've ever been more satisfied by a dining experience in my life.I can't wait to go back and try some of the other menu options!"], ["Isobel L.", "Sugarfish sushi is always awesome but it WINS dineLA this year. For $20 at lunch: Edamame Salmon sashimi1 piece of albacore sushi1 piece of salmon sushi1 piece of yellowtail sushi1 piece of large scallop sushi1 toro handrollNeed I say more? I've been to Sugarfish several times (once for dineLA dinner) but the lunch offers the best deal by far. And it's delicious.Arrive early. There are no reservations at Sugarfish. There will be a line at 11:30 am when they open. We were lucky to be the first in line so we were seated right away; others were still waiting an hour later. My friend has some dietary restrictions, so she was not able to avail herself of the dineLA special but loved her sushi (shrimp, tuna).Hurry!"], ["Kelley L.", "Hands down, this is still my favourite sushi restaurant ever. It is also one of my most favourite restaurants, not just in L.A., but the world. Weekday lunch is quite possibly the most busy time. Can you blame them? Nope.The food is always perfect, and the service is just as good. If you order one of the set menus (I recommend the Trust Me, $30), you get a dish one at a time, so there is no pressure to eat quickly or to wait impatiently for the next dish. They are very good with timing and are always available if you have any questions or requests. If you decide to pick up an order, you can call them in advance and wait about 20 minutes for your order to be ready. So simple!Love, love, love everything on their menu. I have eaten it all, not just here, but at their other locations too. Now that they have gotten rid of the Sugarfish app, you can record your check-ins by filling out a card that comes with the bill. They will manually record your visits and you will be notified of your free birthday meal when your birthday is nearing.I also love that they have a reasonable service charge (16%, which is absolutely great for the quality of food and service), especially since (for the most part) TIPPING IS AN INSULT in Japanese culture. Also, they will split the bill for you, if you ask. Just love everything about Sugarfish: food, service, ambiance (though it can get real loud in here), and the location. LOVE!"], ["Cydney M.", "~~~DineLA 2015~~~The sushi and sashimi were very good, but be prepared for an expensive lunch.Two friends and I met for lunch during with intentions of ordering from their DineLA menu.  We took one look at the regular menu and realized we could get a lot more bang for our buck if we ordered \"Trust Me\" for $25.00 which almost doubled the amount of items listed on the DineLA menu for $20.00.  Please see my photo for the comparison.Food:  5/5 StarsEverything tasted really fresh and delicious.  I wish the edamame was warm that they bought as the starter.  The first course was the tuna sashimi and it was delicious served with scallions, second course was albacore sushi and salmon sushi with two pieces each, third course was yellowtail sushi and halibut sushi, fourth course was toro hand roll (really liked this) and the last course was the blue crab hand roll.  This seemed a little fishy to all of us.   We were all a little surprised based upon rave reviews for the crab hand rolls.Service:  3/5 StarsThe staff are flying around the room and they really don't look up much, so it can be difficult to ask for something.Ambiance:  3/5 StarsIt's alright for downtown I guess.  The side of the restaurant on 7th Street has windows, but there isn't much to look at.  I bet the other restaurants in Marina Del Rey, Studio City or Beverly Hills have got to have better views.Parking:  1/5 StarsWe parked in the Athena Parking Structure on Grand, just south of 7th Street, and each ended up paying $10.00 each which is the maximum.  I would highly recommend carpooling from somewhere.  They will validate after 4:00 p.m.Recommendation:Would I go back?  I'm not sure.  The sushi was very good, but the parking prices and traffic downtown are a major deterrent for me."], ["Chrissie O.", "I was supposed to be at a work event but eating is more important.  Decided a lunch date with my baby cousin was more important.  Luckily I work with my family so it's ok.  Lol.  We were trying to decide what to eat and we both love sushi so I was naming off some places close by.  When I said Sugarfish, she mentioned that she heard the place is legit so of course that's the spot we decided to go to.  The restaurant was packed for lunchtime but not that many people were waiting.  The hostess said 20 minutes but I don't think we waited that long.  Everyone was really friendly and told us what they recommended since it was our first time.  After seeing some orders coming out we decided to order 2 rolls and 2 sashimis.  It's definitely a small serving but the quality of the fish was great.  We got the lobster roll, yellowtail roll, tuna sashimi, and halibut sashimi. All were amazing and so fresh.  You can really tell the quality is really good.  You really need to order a lot to feel full though.  The sashimi is a very small serving and cut up into tiny pieces and the rolls are small.  I loved how everything tasted but it gets expensive ordering multiple items on the menu.  It's a nice and simple place.  Definitely a great spot to eat for good quality sushi."], ["Clara L.", "I've been to multiple sugarfish locations multiple timesthe service here is friendly and promptthe wait can be pretty heinous thoughI usually get the trust me and add on a few items because I'm never fulland the daily special on the nozawa is never good(they had pink scallops the other day and they actually ruined the end of my meal, boo)"], ["Raul T.", "It's insane to see how many 5 star reviews this place has. Is it because people have not tried real sushi? Is it because the media has hyped this place so high that it's now a phantom effect? I'd like to think it's just really really good advertisement.With this said, the food is NOT bad. Is it very good? Nope. Sushi is misshaped, cut thick, rice is too warm,long waiting time. Do i need to say more? I am a huge sushi fan and trust my judgement and specially my 're japanese gf's pallet. She agrees with me. Is it eatable? Yes. Will we go back on our own? Absolutely not. However, every time i've been there it's either been a vendor or a client. I recommend people to go and discover other places. The 40 minutes plus wait is NOT worth it. Unless of course you've been brainwashed into thinking that this sushi style is actually Japanese."]], "Shojin Downtown": [["Elvin C.", "To start off this review, I should probably mention that I'm not a vegan, and never had the slightest of interest in becoming vegan. I'm not on Ron Swanson's level, but the fact that I have 0 friends past and present who are/were vegan probably isn't by chance. I'm that dude who used to eat steak 4 or 5 times a week in college. I couldn't recall a meal that didn't include some type of meat in it, as the last time was very likely to be before my teen years. With that said, I like what they're doing here at Shojin. All things considered, Shojin puts out some pretty interesting vegan versions of Japanese dishes. Despite this, I probably couldn't see myself coming back because I feel like this place primarily satisfies vegan palates. At this price point, I could definitely have more value and possibly flavor going for the real deal non vegan alternatives.The food wasn't bad at all. The real issue is that it's too underwhelming for me when factoring in the price. I did also very much so miss the meat to my meal last night. We ordered: White Corn and Edamame Croquette, Spicy \"Tuna\" on Crispy Rice, Crunchy Tiger/Hidden Dragon, the Crispy Golden Gate, and the Ramen Revolution. The croquette wasn't that great to me. It was well made and nicely presented (same goes for everything that they served), but it was kind of dry inside and I wasn't too big of a fan of the edamame in it (yes I do like edamame on its own). I guess I just prefer the typical potato croquette. The yuzu mayo and tomato/mustard sauces were nice accompaniments though, 3/5. The Spicy \"Tuna\" on Crispy Rice wasn't very enjoyable either. The tofu substitute didn't save it and I felt that the brown rice cracker was way too hard and crisp for me. There was no soft delicious center like you find in tater tots or other versions of crispy rice cakes, just a very thoroughly fried brick of a rice cake. I thought that the The Crunchy Tiger/Hidden Dragon was the better of the two sushi rolls we got. The avocado, tempura asparagus, wasabi mayo/sweet tamari sauce really make this stand out. Definitely glad we chose to get this, 4/5. The Crispy Golden State wasn't bad or anything, but there was not much in this roll that I could really get myself to like. I wasn't too big of a fan of the balsamic sauce on it, and only the mushrooms and avocado stood as positives to me, 3/5. I should've taken the waitress's advice on getting the Super Pirates (d'oh!). Last, but not least, the Ramen Revolution was actually quite impressive for being a vegan rendition of a dish that is completely comprised of meat in just about every single facet of its composition. I recently watched the episode of Shokugeki no Soma where the dad returns and makes a really amazing looking vegetarian ramen, so that definitely got me a bit excited. The spicy miso broth was the most impressive of all. It actually had a lot of flavor and really was the primary reason this dish is enjoyable. The avocado is a nice addition (as always in just about every dish), and the flour noodles are pretty good for being vegan. The thing is, there was so many beansprouts intertwined with the noodles that it made it hard to really taste the noodles. I'm not a very big fan of beansprouts at all, but it was good enough altogether that I finished everything in the bowl anyway, 4/5. Once again, the food overall leaned more to the 2 or 3 out of 5 neighborhood, but considering it's vegan I guess it gets a slight bump up.Servers here are really nice and suit this place wonderfully. They're attentive, switch out plates and dishes when needed, and make sure to refill water/bring us whatever we need in a timely manner. Couldn't ask for better servers, especially how they seem to reflect the culture and feel of the restaurant (unlike the baristas at most Starbucks who are usually just a bunch of randoms who were looking for jobs). The interior is really cozy and romantic, definitely a positive. Overall, I'm glad I tried it and I am legitimately glad a place like this exists to the delight of vegans and vegetarians. However, considering the price (Ramen Revolution was $15) and the fact that I can eat (and enjoy) meat and animal products, it makes very little sense for me to return. I'd say it's worth a try for just about anyone with an open mind, but if you're in love with consuming animal products as much as me, this place is likely not going to convert you to becoming vegan. They do have a lot of other dishes that sound interesting so I wouldn't be totally against coming here again.Tips: - the place can be hard to find, but it's on the same floor as Honda Ya - enter through some red colored curtains - they validate for parking in the structure"], ["Debby L.", "Romantic spot for a lovely week date! If you told me Vegan dishes can taste this good, I will not believe you because I looooove MEAT! Every single dish is exquisitely made. Very impressed! My favorites are the TORCHED! Spicy baked scallop roll and the Pumpkin curry tempura on green roll! MmmmmMm...tasty! I will def bring my coworkers here...soon! Only downside we were seated too close to the entrance since we do have a large group. Highly recommend the Matcha Russian :)"], ["Michelle P.", "Another unprecidented 5-star review from me after just one visit?!?!?  (I guess it now has precidence and is possible.)  This review was truly deserved, and (in honor of my #53 fan, whomever you may be), I am excited to share this gem of a restaurant.Shojin is a world of quiet romantic ambience and deliscious vegan sushi (vegan sushi is probably an oxymoron, but it really is true).  It's one curtain that separates you from a loud japanese mall in little tokyo and the inside of a world of soft lighting, art work and decor that pleases the eyes, music in some bluesy jazz style that pleases the ears/heart, and flavor profiles to please the mouth.(See my photos).I was seriously blown away by the quaint other-world feel and was transported on this journey by a lovely gentleman (seriously, y'all, he's the type that gets up to pull out your chair when you leave the table to use the ladies room).  At his recommendation, we ordered a variety of interesting dishes/drinks.1) Drinks: Cucumber cooler with fresh ground giner for me; peach tea for him; and with dessert - Sweet Rose Tea -- with it's fragrance and flavor, this will delight a Tea Afficionado whose traveled the world for great tea.  (Believe me, I was in Taiwan last month at a 5-star restaurant last month and no tea compared to this!!)2) Appetizer - stuffed mushrooms - WOW!  Deliscious.  If I wasn't with a gentleman, I may have fought him over the last one (served 5 pieces), but he graciously allowed me the last bite.3) Entrees - Orchestral Magic ? - I have no idea the title or what was in this, but it was an orchestral performance of flavor in my mouth!  - Scallops (the one with table side tourch) - again, a fun experience to watch and savor the flavor.4) Dessert Chocolate Creme Brule with Coconut Ice Cream (they let us sub out the orange ice cream.  I have never liked orange with chocolate).  Wonderful!Service was superb.Plus many items are glutten free for those of you with allergies.Now, randomly, ladies, I must mention the bathroom.  It was like being in someone's french ladies room... pink... heart-artwork, scents, and tons of lotions and mouth wash.That said, it was a lovely evening.  I even think the ladies having dinner next to me were a bit envious of how sweet and lovely my escort was.  They kept smiling and blushing at us.  :)Fan #53, I hope you liked this one.  Thanks for following me!"], ["Amber F.", "My first vegan sushi experience other than the lame veggie section in most sushi bars. We came to the downtown location to celebrate our anniversary and are so happy we did. We had a fabulous meal and could have easily tried everything on the menu and still want more. They have some seasonal options as well, so the menu changes a bit. This is a must for any vegan in LA or visiting. They also have a location in Mar Vista if you're out that way."], ["Hayley G.", "The service here is totally impeccable. Such a wonderfully different experience tonight. They all were so attentive and kind and the atmosphere was incredible. Make this your new date spot!! Vegan Sushi... Who knew it could be so incredible!!!?? We got:  Ginger cooler: YUMMY! Tasted fresh. Needed a little stevia. Genmaicha tea: they kept that sucker comin! And it was amazing. We had three pots. The toasted rice flavor was on point. Pumpkin croquets: I wished we ordered the bigger size!! On the sweeter side, so if you want a savory app get something else. Very unique flavor. Apricot kale salad: delicious. And they split it in two for us! I'd strongly recommend this. Has a well balanced flavor and the kale isn't bitter at all. Eggplant roll: I'm sorry I forget the name. But skip it! It's the only roll with eggplant and it wasn't very good in my opinion. Dynamite 2.0: I believe this is the other one we went with. They said it's the number one seller and we could see why!!! It really was so awesome. It has a nice smokiness to it. Raspberry cake: it was good, but pretty standard. I wished we would have gotten the green tea brûlée for a different taste! They charge for ginger, and I actually didn't like it as well as normal places. But they do it in house. They brought us ginger tea and the end and it was so good! And a cool was to end an amazing dinner. P.s. The music is amazing and relaxing, the bathroom is adorable and they have cool lotions, and once AGAIN the service is incredible. Like one of the best, if not the best service I've ever had. GO HERE!!!!!!"], ["Lilly C.", "First thought as I walked into the restaurant, \"Am I in the right place?\"  The entrance, which is just a covered drape, leads you straight to the middle of the tables and there is no hostess area to greet you or check in.  I had to stand awkwardly for a few minutes to figure it out.  Secondly thought: \"Wait this restaurant is so romantic.\"  It was dimly lit and soft jazz music was playing.  I was very skeptical to try vegan sushi because I'm a diehard carnivore and very anti-vegan.  The fact that I tried vegan sushi itself says a lot.  And I actually liked it!  Stuffed Shiitake Mushrooms - It was ok, prob my least favorite of the night.Dynamite Roll 2.0 - This one was soo good.  I took a bite and I could not believe how similar it tasted to a real sushi roll.  I think this was my favorite roll.Pirates of the Crunchy - This one had cucumber in it so I could def tell it was a vegetable roll.  But just as good although I'm not sure if I was too big a fan of the tempura flakes.Ramen Revolution - I am also a huge believer that ramen MUST be made with pork broth.  Shojin obviously proved me wrong.  The soup was really good and flavorful, although I wish it would come with more soup than noodles.  Surprisingly, this was filling enough for 2 people.  I usually say I can't get full until I eat meat.  I have been proven wrong.  I will definitely be back on those days I'm craving something fresh to eat."], ["Willa P.", "For the first time in forever (heh, I snuck it in a Frozen pun), I didn't scour Yelp for pictures and reviews before eating here. It was a last-minute option before heading to LAX, and at first, I was completely ignorant of all the awards and acolytes this place had gained. And like Elsa going through her ice-magic puberty phase, this place really doesn't want to be noticed. A heavy curtain completely covers the entrance, and the entrance furthermore halfway blocked by a table. It's a little off-putting.But I never take points off because of ambiance. What really matters is the food, and for a restaurant that lives on its hype of organic, natural, super vegetal ingredients, I didn't expect the food to be so....well...so goddamn salty....It was a weird irony. The Stuffed Shiitake Mushrooms and Shojin Ramen were just ruined by whoever decided to get wild with the salt shaker. I can just imagine the chef's instructions were something like \"just shake it like a Polaroid\". Also not sure if Seitan strips are the best idea to put in soup-based dish. \"Soggy\" was the overwhelming taste and texture of it.However, I was pleasantly delighted with the Green Dynamite Roll 2.0. This is clearly what Shjoin excels at because they thankfully left the salt shaker far far from this roll. Instead, it left me feeling really fresh and clean as I chomped on this ridiculously green roll. Like I was going through a really delicious detox. Honestly though, while the concept of vegan sushi is definitely innovative and admirable in its goal towards freshness, it's not like the flavor combination of avocado, lemon, jalapeno, and cilantro is a completely new discovery.  So with a heavy heart, I really must say:Dear LA foodies, This place ain't that worth it. I guess you'll just have to....wait for it....let it go. Hehe. Disclaimer: Sorry if I am completely not funny to you."], ["Doug P.", "Ended up here by looking up ramen places on yelp it had bunch of stars.  Didn't even realize it was vegan.  It's inside the mall but once you enter the restaurant, you wouldn't know you're inside a mall, looks very classy inside.  Ordered the tasting menu for simplicity.  Each item was tasty.  A couple items seemed very similar in taste.  Would have preferred the items be more varied since it is a tasting menu. The ramen it came with was dellllicious!  Best ramen I've ever had possibly.The service was cute and good."], ["Stacey S.", "Can I live here?This restaurant is a hidden gem, and as I write this review, I kind of don't want to share it with you, I want it for myself.Every single waiter and waitress in this place is an absolute pleasure to be around.Not a single glass ever went empty.If anyone ever got up to the bathroom, their cloth napkin ended up folded neatly over their seat.I just... Wow.The ambiance in here is romantic and intimate with the flickering candles with the resulting shadow of a blooming/breathing flower on your table.The top 40 hits performed in a lounge style, sound so much better than the originals.I ordered a teapot of rose tea, and was immediately transported back to Portland's rose gardens (the servers monitored my teapot).The spicy \"tuna\" crisp was absolutely perfect, and a great bite - although it was a large appetizer.The mushroom appetizer was ordered, and devoured (just not by me).I had the hot and spicy ramen, and as a meat-eater, I didn't complain one bit.The broth was amazing, and the seitan was filling with the noodles.We finished dinner with the creme brulee and earl grey ice cream, it was basically heaven (and vegan).If you're vegan, vegetarian, or just a person who happily enjoys all types of food, I guess you should check this place out. ;)"], ["Ashley S.", "Top notch in every way. Amazing service, amazing food. Atmosphere is great, too. I love that their bathrooms are stocked with lotions/perfume/mouthwash. Small detail, but they all add up and are what make this place great. They really pay attention to the details. Food-wise, everything we have tried has been great. An absolute must is the spicy tuna on crispy rice. Unlike anything I've ever tasted. On that note... I wouldn't say anything here tastes like traditional sushi... their food shouldn't be viewed as sushi replacement, but as an entirely new imagining of sushi that is just really delicious. Don't expect it to taste like spicy tuna, just expect it to be delicious."], ["Meghna P.", "Hidden behind a thick curtain is the entrance to this gem. You enter into a zen-like space that features closely placed tables. Groups larger than 6 should definitely reserve. The staff is extremely polite and very helpful. You are in for a treat! I'm fairly certain everything on the menu is vegan and a majority of it is (or can be made) gluten-free.We ordered two rolls each, and stuck with the ones everyone recommended, since it was our first time. Dynamite, Pirate, and then I felt adventurous and got the lotus roll. My server tried to warn me that it had root vegetables that are rare outside of Japanese cuisine, but I got it anyway. It was strictly okay, the other rolls were much better. Two rolls may be a bit much for one person who has a smaller appetite, the rolls are huge and very filling. I recommend asking your server a lot of questions, they are very attentive and helpful. The alcohol is a bit overpriced, the Dassai is $17/glass and not a very big glass. It is delicious, but the market downstairs has it for $32 for the bottle. I will definitely go back, this is now one of my fav spots in LA."], ["Araceli C.", "The entire experience is a treat. The staff welcome you in, put your bag away in a basket underneath the seat, seat you, and lay a napkin on your lap. Thus, you embark on your dining adventure. I have never seen so much attention to detail. They make sure you have everything you wish. On my friend's birthday, they even took a picture of the group and framed it.The food itself is so tasty. The soups are incredible, but, for me, the true stars are the sushi options. The combinations are just so inspired. Please do yourself a favor and bring your friends, so you can all try different dishes all at once. As you can imagine, it is pricey. Think of it as a once-in-a-while splurge. Besides, you can't beat the location. It's in the same mall as a bowling alley and a karaoke studio."], ["Ryan W.", "I respect every single persons opinion when it comes to vegan or gluten-free items, so I decided to give Shojin a try after hearing pretty good reviews about it from my family. I came with a group of friends since one of my friends absolutely loves vegan food and it was her birthday. We were seated after just a 20 minute wait. I was quite surprised at how small the place was, but it was pretty crowded. I figured the food must be pretty good if all of those people were eating at Shojin. The service here was very good and they were all nice and welcoming. Our waitress gave us a couple of suggestions and we decided to order an array of items and just try everything in a tapas style. // FOOD //Pumpkin croquettes: Crunchy pumpkin and tofu croquettes served with tomato sauce. This was honestly not that bad. It was sweet with a great crunch on the outside. 3/5Marinated garlic seitan steak: Grilled, tender seitan steak with a garlic herb butter sauce. I honestly, gave it a fighting chance, but I can honestly say that this was not good at all... If you love meat then you will most likely not like this dish. 2/5Dynamite roll: Spicy tofu and avocado roll, with slightly torched spicy mayo with spicy dynamite sauce. This was actually pretty good. I would eat this again. 4/5Spicy baked scallop roll: Onions and mushrooms on a spicy tofu roll with spicy mayo and spicy dynamite sauce. This roll gets torched at the table which makes for a nice show. This roll was also pretty good, but I honestly think I liked it because of the dynamite sauce. 4/5I also had a few other rolls, but they didn't leave an impression on me. I honestly, came in here with an open mind and open taste buds. My mom always told me that you should always try something once since you never know if you'll like it or not. The couple rolls were actually pretty delicious and I would actually eat both of them again. All of the other 6-7 items that I tried, I would probably never order again."], ["Cristinabella D.", "Everything I always wanted in Japanese fusion vegan style is here. It is phenomenal. I paid 65 and my daughter and I tried 6 things u see in pics. Great service great ambience. I can't wait to go back. The peach drink was amazing. I. We bought a 3 bags of their special cookies and they were yum. You have to try it for yourself. Southern CA rocks for vegans. the plum tart dessert tasted just right not to sweet not to tardy, my 5yr old approves. Great experience cor treating my 5yr old out as a reward for doing extra well in 1st grade."], ["Beena K.", "Wow! Wow! Wow! For any Japanese cuisine enthusiast, Shojin while its vegan--it offers a fantastic flavor that any non veg eater will LOVE! Make it a point and try Shojin, I promise you'll come back...I know I will!!"], ["Tracy M.", "Incredible food, beautifully prepared, with amazing service. Couldn't ask for more!Recommend spicy tuna on crispy rice, dynamite roll, and crunchy tiger hidden dragon roll."], ["Sheiva K.", "I do not typically eat vegan, and really love sushi, so I thought I would hate the concept, but this place is absolutely delicious! We went for my friend's birthday and at the end the staff even framed a picture they had taken of us as a gift. Such a wonderful memory. My favorites were the Pirate roll and the Spicy Baked Scallop roll. The gyoza is also delicious!"], ["Jessica R.", "Every single time I eat at Shojin I have a great experience. The staff is SO SWEET, and very respectful. The food is amazing. I love it so much!"], ["Randy G.", "I been on a Raw Food, Vegan, Vegetarian kick lately...and wow this place was amazingly good for Organic Vegan Japanese food!So good I am returning a week later!Got the set course tasting menu...Consisted of:Stuffed Shiitake Mushroom, Apricot Kale Salad, Dynamite Roll, Purple Treasure and Ramen Revolution...we did get a dessert as well..but don't recall what the dessert...Everything was great and fresh and refreshing!Consistency was good and flavors worked perfectly with everything!Even the Ramen noodles were better than I expected...comparable to a lot of the other ramen places in the surrounding area...definitely a must go again!"], ["Erik A.", "Very good food, but very small portions, pricy too."], ["Gabriel G.", "SHOJIN never disappoints! My lady and I have been coming here for years (she showed me the magic that is Shojin) They have a wonderful menu loaded with all kinds of tasty vegan treats and drinks. But one thing you can never go wrong with is the Shojin Ramen. It's hard to try a different dish because the Shojin Ramen is just so damn tasty. We did however start adding the Dragon Roll to our Shojin dinners.In addition to the amazing food, their service is top notch. Everyone is so friendly there and they are always very welcoming.Shojin really goes above and beyond with consistency.They truly deserve this 5-star review! It's always a must anytime we are in the Little Tokyo area. We love Shojin!"], ["Diana I.", "This is a JAPANESE VEGAN restaurant. So if you're not vegan, come with an open mind. My friends and I came here for a birthday dinner, none of us being vegan at all, because of the high ratings on yelp and for the unique experience.Ambience was really nice, dim lit, definitely a date spot. I was surprised to see how intimate and romantic the place was. Loved the cute origami string lights! Service was really great too. It felt more like a fancy restaurant. They even had a cute basket under our chairs for us to put our purses in. The 6 of us shared a bunch of plates! As a non-vegan, the ones I liked and would recommend are:- Grapefruit Quinoa Salad: refreshing, light and yummy. - Ramen Revolution: the most normal dish of the night! Basically a spicy miso ramen but it just tasted so amazing compared to all the other very vegan dishes.- Spicy \"Tuna\" On Crispy Rice: It's actually spicy tofu (not tuna) but it was pretty good! - Dynamite Roll: my favorite roll of the night. Although it was tofu instead of tuna, it definitely tasted the most normal because of all the flavorful sauces. - Spicy Baked Scallop Roll: they torch it at your table which is pretty cool! But instead of actual scallops, they use mushrooms. The spicy mayo and dynamite sauce made this roll really delicious! The ones we didn't like so much were the Takatonic Roll and the Seitan Steak (definitely not steak. Had a carb-like glutinous consistency). Unless you're vegan, I would say definitely pass on those... they were definitely the most challenging for us to eat.  Overall, I think for a vegan restaurant, it's really good. But since I'm NOT vegan, and I know what real sushi is supposed to taste like, it was hard for me to love the food here. I probably wouldn't come back. If you are vegan though, definitely give this place a try! Located in the same indoor mall/shopping center as Honda-Ya. Parking garage on first floor, entrance on Alameda. Take your parking ticket with you and get it validated by the restaurant!"], ["Crystal N.", "The ambiance was interesting. The chairs were uncomfortable. The waiter was very nice!Among the 4 of us, we ordered three rolls, yuzu ponzu seitan (wheat meat), the apricot kale salad and a chocolate and green tea mousse cake to share. Just like my sporadic descriptions of Shojin, it was exactly what the dishes taste like. Very random, unexpected and slightly amusing.The dishes were interesting and at the same time, very straight forward and sub-par. Although everything was organic and vegan, I did not feel much healthier after the meal. We were all still hungry, even after dessert! When we stepped out of Shojin, the udon and ramen shops across looked ridiculously hypnotizing! We were on the verge of stepping into one of the restaurants ready for dinner round II."], ["Vered B.", "There were no raw vegan options. When I asked if they could just make a salad raw, they literally brought out a plate with 3 tiny pieces of lettuce, 2 grape tomatoes and a thin slice of cucumber. The service was horrendous. It took forever for each item to come out. The table next to us had come in way after we arrived (same number of people), yet their dishes arrived before ours.I'm 100% organic. I taste the difference between organic and poison. The food did NOT taste organic, even though they claim to be organic.The only plus was that the waitresses were sweet, though not helpful.I would not return."], ["chris l.", "Uniquely vegan.  It's good but for someone like me who enjoys robust taste,  it's too plain and it's just not for me.  It is pricy but the service is top notch."], ["Robyn M.", "I didn't even know vegan Japanese food existed! I'm so glad a friend recommended this place to me. I'm just sad I couldn't eat everything on the menu! We started with the pumpkin croquettes, and of course had some ramen. Oh, and the peach sake, perfect pairing with the whole meal! (Don't forget to grab some vegan cookies on your way out too!)"], ["Grace Z.", "The atmosphere definitely feels more upscale and so is the price range. I had the ramen revolution and the baked scallop roll. The ramen revolution was quite good, but for 15 dollars the proportion was on the smaller scale. The baked scallop was amazing, I used to be a sushi crazed fiend and their vegan options definitely can fool you. The only difference I would say is that the vegan sushi doesn't taste as heavy as actual sushi, but besides that I think anyone, vegan, vegetarian, meat eaters alike would enjoy this place."], ["Andrea W.", "I came here because I have a recently acquired gluten allergy and they seemed meticulous in making sure on their menu that customers know what is gluten free (non vegetarian). I stated on my reservation my health concern, and the waitress immediately let me know right away which items were not gluten free. Great service. My water glass also never emptied and they explained every dish when it was served. The food itself is interesting. The stuffed mushrooms and french onion soup were absolutely delicious. I would definitely come back for those. I tried 2 rolls as well (dynamite and spicy bake scallop) and to be honest... they tasted the same and were both pretty mushy. I normally love vegetarian food but veggie sushi IMO can never surpass real fresh raw fish. I didn't try the ramen but the broth smelled delicious.If I were a real vegetarian, I'd love this place for their interesting and unique take on Japanese cuisine. Only gripe is that is is VERY expensive (70 for 2 before tax and tip). More expensive than what it cost would be if there was meat and fish in the dishes. But that's the price you pay for having a special dietary concern.Tldr - great for vegetarians and gluten free. Great service. Unique food. Expensive."], ["S Z.", "Came in on Sunday night June 14, 2015 to pick up my spicy scallop roll.The 3 stars is for food which should be 5 stars. Service is -2 stars.The entrance is not obvious (see picture) so I go inside. Am I at a restaurant or the Magic Castle? I'm a fan of both but a curtain with a window and some drapes is very inviting.So I go in. Confused to find myself at some people's table. I spot the waitress and greet her 'hi, I'm here to pick up my order'. She looks at me like I'm crazy saying 'wait outside please'.I go outside. Waitress does not appear for at least 6minutes. When she does. She asks 'pickup?'. I say yes, ask if I can pay. She says 'just let me get the bill'.In short she goes back each time to get bill, Food etc so I wait 20minutes for something which should have been ready because j called and said I was in a rush, specifically asking nicely whether I could pick up and go.If she's the only waitress its management's responsibility to make sure there's enough service.Amazing roll though - compliments to chef."], ["Kinjal S.", "If there is a vegan sushi heaven, it's at Shojin near downtown LA!I am fortunate to have more than one vegan Japanese restaurant in San Francisco, but this little hidden gem stole my heart! The most delicious vegan sushi I have ever had, hands down!The ambiance is just tooooooo adorable and cozy, you must visit their bathroom too... it's so cutely decorated.The staff is very polite and friendly.Some of the things we ordered were:Tuna on crispy riceSpicy scallop roll -- my favoriteCrunchy Tiger Hidden Dragon rollgarlic ramen - don't remember the exact name, but it was garlicy and spicy -- yuuuumended with a chocolate orange cake for dessertThe restaurant may be tricky to find - it is located on the 3rd floor of a small mall.Between the 5 of us we tried various appetizers, ramen and sushis. Everything we ordered was fantastic. I also bought gingerbread cookies - vegan, organic, gluten-free and macrobiotic. They were sooo freakin delicious, wish I had bought more."], ["Annie L.", "Vegan sushi..worth giving it a try?  I say yes!Service: Service is amazing here. Every server in house probably paid our table a visit to check up on us which was great! However, the reason why I speak so highly of their service is because upon delivering each dish to the table, the server will reexplain dish to you ( what it contains). It kind of reminded me of a $$$$  restaurant. 5 star service at a $$ restaurant,  I would say that is a steal!Food:Pirates of the crunchy:Out of the two rolls, we ordered I would have to say this would be my favorite. I am a sucker for fried/crunchy items so when I saw it on the menu I had to get it. The filling of the sushi roll consisted of some cucumber and avocado and the topping was tempura flakes. The only complaint I have is that the roll fell apart really easily. Other than that, the taste was spot on!Dynamite roll: I thought I would like this roll because it was suppose to mimic the regular one but I didn't. There were no problems with the roll itself, the issue had to do with the preparation of it. In the description it states that the roll is slightly torched but I didn't think too much of it, however when I actually tasted it I did not like it too much due to the smokey taste. If you are a fan of BBQ than this roll should be okay for you. Ramen revolution:The portion may be a little small for those who have a big appetite but it was perfect for me. The broth tasted clean and was not filled with the typical MSG.The noodles, tofu and kale were all cooked perfectly. The best ramen I have had in a while. Final Verdict: I love the concept and the fact that I am not leaving with a giant food coma which I am accustomed to. I will definitely come back!Tip: This restaurant is dressy not casual! Perfect ambiance for a date night with your significant other !"], ["Michael H.", "Traveling for work and was craving sushi and they definitely delivered. Recommend the yuzi and yukizo rolls. Delicious!!!!"], ["Andrew N.", "Looked for a place to eat in Little Tokyo and found this under vegetarian listing.  It turns out that this place is probably the best vegetarian/vegan Sushi I've ever had!I went with my sister whom is not a vegetarian and only agreed since I was visiting her for the weekend.  What did she think?  She loved it!We had to wait for about 30 minutes to be seated, and I will say it was worth the wait.Once we got seated, the servers tucked us into our chairs and gave us some great service!  They even refolded the napkins when you go to bathroom or away from your seat.On to the food.  We got:Tuna on crispy riceSpicy scallop rollRocky Mountain rollCrunchy Tiger Hidden Dragon rollGyoza(Naming this on top of my head, so I may have mixed it up some)Thoughts:Tuna on crispy rice - Great!  I will say I expected more based on all the photos and reviews.  It was somewhat spicy considering the jalapeno slice on top.  I will get this again, but I suggest consider getting a side of soy sauce or something to dip it in.Spicy scallop roll - The best thing we ordered!  The bring out a torch and torched the rolls to give it a nice toasty flavor.  For a vegan dish, this was a creamy awesome roll.  We did get wasabi and soy sauce on the side, so that made it even better.  Would definitely get this again!Rocky Mountain roll - Loved it considering it was topped with a fried Shitake mushroom.  Another favorite.  To be honest, all the rolls were great!Crunchy Tiger Hidden Dragon roll - Avocado galore and yum!  For sure this is another great roll.  I recommend it.Gyoza - At first glance it looks a tad small and more like a spinach tempura.  Turns out these are also great.  We only got the half order, but I can say that if you have more than two people eating, get the full order!The cost is on par with regular sushi restaurants (or high end ones) so expect to pay some money if you are hungry.My last suggestion, go in with no expectations."], ["Carolina H.", "The food is amazing!!!! My husband and I took advantage of the tasting menu, and we were not disappointed at all. Everything was terrific with the highlights being the spicy \"tuna\" on rice cracker, ramen, and the dynamite roll. The service was friendly, efficient, and warm. The restaurant was clean with good ambience. Hands down, one of the best lunches we've had!!!"], ["Cristina M.", "Simply amazing , genius menu , tasting delicious , cooked with love and very creative . Lovely staff and worth a visit for vegan or non ! Enjoy it LA people , this is amazing . Wish we had one in NYC"], ["Jason H.", "This place is Great! Its in sort of a weird place but once you get inside it feels classy. This is a vegan \"Sushi\" restaurant. The Spicy Tuna is good. Dynamite roll, Pirates of the Crunchy and dragon roll are a few of my favorites. I would recommend taking a few friends and sharing some things. Just a side note, it can get pricey. If you have never tried this place you should definitely check it out. Very unusual flavors. Its great for omnivores as well as people who dont eat fish.The staff are super friendly and very polite. Definitely feels very upscale. They do have a second location in Culver City."], ["N K.", "The torched sushi was insane. Skip the apps and dessert, they left much to be desired. Staff was great. Love the baskets under the chair for personal items, genius! Nice decor and use of space ( it's it a cheesy mall foodcourt). Very chic. Bathroom! Will def ho back!"], ["T C.", "Japanese need not come. If the night club-esque entrance or tacky appolstry does not turn you away the oppressive slow jazz soundtrack will. If you are looking for an authentic Japanese experience genki sushi does a better job. The best thing on the menu is the tea."], ["Tiffany S.", "Amazing Japanese vegan dinner last night at Shojin Downtown in Little Tokyo. Equally impressed with taste, service, and presentation. We did the tasting menu and we were not disappointed at all!"], ["Yuka K.", "I'm not vegetarian, but some of my close friends are so I decided to take them there since this place was a rare opportunity where our worlds collided. As a Japanese food snob, I had mixed feelings of curiosity and incredulity with the concept of vegan Japanese food. So much of Japanese food consists of seafood, meats, and especially dashi (what some consider to be \"umami\").We ordered the brunch special for two plus a roll. We had shiso gyoza, apricot kale salad, revolution ramen, crunchy tiger hidden dragon, and a green dynamite roll. I am not a huge fan of shiso, but it was not overwhelming in the gyoza so it was very tasty. Still not sure how they made the wonton without eggs, but it was good. I don't normally like kale (I swear I'm not extremely picky), but the kale salad was refreshing and delicious. It balanced the sweetness from the apricots with a tangy, not-too-sweet vinaigrette. The revolution ramen had good heat and had great depth in flavour, especially considering that it's vegan. The two rolls were less memorable. I remember them being good, but I missed the raw fish. But perhaps for vegetarians it's perfect. For another friend it was the first time eating sushi and she enjoyed it, so there's that.Atmosphere-wise, it's very upscale. Definitely a great date spot. The bathroom was phenomenal and they fold the napkin on your chair while you're away."]], "Noshi Sushi": []}