{"Sanamluang Cafe": [["Jahcobie C.", "As much as everyone raves I just haven't found the right thing here. Last two times I came in I got sub par food. I order takeout because I live within walking distance. I really prefer to go to Pa Ord or Pho Thai."], ["April Rose P.", "I wanted to give you good ratings, Sanam. I really did. But our last experience here was not at all appetizing.We came here on a drunken night and fell in love with the pad Thai noodles. We woke up the next day debating whether it was the food or the alcohol that made it taste so damn good. So to ease our mind, we decided to stop by again, sober. We ordered the coconut soup, pad Thai and the pad see ew.We were most excited for the pad Thai which ended up coming out last.I started digging in to my pad Thai until my boyfriend  showed me a strand of hair he found in his share of it. It was evidently cooked with the food and not just a piece of hair that happened to fall into our dish because my boyfriend held the strand up high and dangling on the other end of it was a piece of egg. I then found ANOTHER strand of hair in my food, and quickly lost my appetite. The workers seemed sincere about it, apologized and took it off our bill. It was such a disappointment for us both, but at least the pad see ew and Tom kha made up for it. Sort of."], ["Donna C.", "*************CASH ONLY*************This restaurant is open late, so it was the perfect place to go after a concert. Our friends frequent this place often, so we came here under their advise. If you choose to park your car inside the parking lot, you have no choice but to do valet. It wasn't too busy when we came and we were seated right away. I like how they have outdoor seating as well (perfect for a summer's night out). I would've chosen to eat outside except it was raining (I know!) at the time. The restaurant was buzzing away with orders and people coming in and out. It seems that they have a pretty quick turnover of customers, so I don't think waiting is an issue. We ordered their chicken pad thai, pork pad see ew, boat noodles, and shrimp cakes. I really enjoyed all the food we ordered except for the soup. There was an aftertaste I didn't like, but I can't quite figure out what."], ["Courtney W.", "Not a fan. Portions are tiny for Thai, it's not really that cheap, the beef was way overcooked (read: crispy), staff is kinda meh and the interior has the same kind of drab mehness as the food. I am expecting to get my weekly recommended dose of sodium in one sitting while dining Thai but at least come with some flavor. Not here.The only way I'd ever find myself at Sanamluang again is if I go way off the deep end at Jumbo's (strip club/circus-magic show across the street) at 2am on a random week night. At that point, anything open tastes good."], ["Crystal J.", "My favorite Thai dish is Pad Thai. I order it any Thai place I go to. The Pad Thai plate here is the best I've tasted in a long time. I was a little disappointed they don't have roti on the menu, but overall the food here is amazing. We stopped off here on a road trip from San Francisco. We got here 30 min before they open, but they opened the doors and let us in. Service was quick and friendly. I will definitely be coming back next time I visit."], ["Bella M.", "This place is right in the center of all things Thai in LA. I like going here after a night out. The food is really good and they're open late. Service sucks but I don't mind, I just don't tip over 20% there.  This is the kinda restaurant where everything is sticky."], ["Adam J.", "I haven't been here in a few months but noticed they changed their menu a little bit and raised their prices. Their cheap prices were the main reason I used to like it but as far as the food goes it's average, at best. The only reason we went this time was because it was late (around 2am) after the bars closed and there weren't many other options open at that time. I've had the pad thai (meh), the pad kee mao (good), and pork jerky (good), and pad see ew (meh). The service is also not great and parking can be rough. Plenty of other better options in Thai Town."], ["Anne B.", "This place is really good for their noodles & opening late nights. My personal favorite dish here is good the pork pad-kee-Mao in medium spicy with a dab of chili paste & vinegar."], ["Will C.", "Wanting to hike the Hollywood sign and finding out that the parking lot is closed indefinitely my gf, her uncle and I did the opposite of working out. We decided to go to nearby Thai Town and get some lunch. Arriving around lunch time we were seated immediately. We ordered the Chicken satae, fried shrimp cake, spicy beef noodle soup, sanamluang noodles, and my gf had some dish which I am failing to recall the name but it was item #39. I will first start off with the appetizers, their chicken satae is a bit bland. It is definitely drenched in this sticky yellow sauce, I am pretty sure it is peanut sauce. The satae comes with a cucumber and onion dip to eat with which I found a bit odd. I feel like it didn't accompany the satae well. I would say I have had better satae else where so skip it at this establishment. Their fried shrimp cake was also disappointing, it was very greasy and to me I couldn't even taste the shrimp. Now for the main entrees I am not very good at handling spicy food so I asked them to tone down my spicy beef noodle soup and I am sure they did. Upon tasting the broth, it wasn't too bad a bit of a spicy and sour taste. However as you kept on eating it, the spice built up quick. I am not blaming the restaurant for this issue, I should have just ordered something that was not spicy. Even though it was spicy it was really good and I ate every bite of it. I was not a huge fan of the liver (didn't like the texture), so I just didn't eat that. The other two noodle soups I had a sip of the broth and it tasted pretty similar. My gf and her uncle seemed to enjoy the food. Comparing between all the food we ate, I am pretty sure the other two noodle soups came with more noodles than my spicy beef noodle soup. So keep that in mind if you come hungry. Would I return to this establishment? I wouldn't rule them out but I would  want to try the other restaurants Thai Town has to offer. They have a private lot, but it seems to get filled quickly. Many Yelpers have complained about the customer service, however it seems like that might just be a hit or a miss. Fortunately for me our service was decent. At the end of the day it is an Asian restaurant and I don't expect much."], ["Kenny T.", "Huge selection of classic Thai staples -- had the General's noodles (broth was excellent), pad thai (perfect combo of savory and sweet), and egg rolls (might be the best in town).  Highly recommend if you're seeking cheap, no-frills comfort food."], ["Francis B.", "After coming here for years and always loving the Roasted Duck noodle soup,  I tried the Koo Chai appetizer, and unfortunately didnt care for it. So it's hard.to give five stars when I don't love everything.  They were nice and crispy ( I had them fried ) on the outside but too doughy/ chewy inside, which made it hard to taste the filling,  but I expect that's how they are supposed to be. Will be trying other things next time.  Still great though."], ["Stephanie R.", "I tend to come here for a late dinner or a 2am meal with my dad. He has late shifts at the hospital so its nice to be able to come here so late. I know there are other thai restaurants pretty close by, but this one takes the cake. It's not fancy and the parking lot is a tiny thing shared with three other small stores, but it's casual and comforting (kinda like a 24 hour donut shop at three am). Their apps aren't that great, though my dad's a sucker for their shrimp cakes. And they water down their drinks with lots of ice. But their rice and entrees are filling and it's a good place to eat on this side of town when you just want something warm in your belly."], ["Raymonde R.", "I have been to Thailand a few times and trust me the food at Sanamluang Cafe is quite authentic. The prices are very good compared to many other Thai restaurants. At other Thai restaurants, one or two dishes will be their best. At Sanamluang Cafe, I have actually tried 90% of the menu and they did an excellent job on all of them. How is this even possible?Some may complain about the place being dirty or maybe the service is not good enough, but the very reasonable prices and excellent food definitely more than makes up for the lacking in other areas.The best Thai restaurant in Southern California!!!"], ["Minnie N.", "I've been going here for years and it never fails. My favorites are the pad see ewe, shrimp cake, combo fried rice, and beef salad! We decided to be adventurous and try out their spicy beef noodle and seafood salad. The spicy beef noodle is amazeballs, they aren't kidding when they say it's spicy! My nose was running for the hills after a few bites but it was so worth it as I was choking back tears from how spicy it was hahaha. The seafood salad .... Imitation crab meatball thingys .... Don't mix well with the lemon flavor of the salad that's all I'm going to say. It was strange and we both didn't enjoy it. Their Thai tea is yummers! It's never too sweet or bitter."], ["Lisa W.", "Let me preface this review by saying I've never eaten at Sanamluang Cafe during regular hours, so my experience and my perception of the food may be...influenced...However, I've found that Sanamluang is a solid late night dinner/midnight snack option.  The food is on point, albeit a bit greasy (but if you're eating at midnight, isn't that a plus?), the location is convenient, service is reliable, the restaurant is clean enough and prices are fair.  They are open until 4AM!  I'd say if you're stumbling into a restaurant in the small hours of the night, you don't deserve to be too picky.Sanamluang is famous for their noodle dishes.  The pad thai and pad see ew are both tasty, but a little on the sweet side.  My personal favorite is pad kee mow with shrimp.  The flat noodles are perfectly cooked (not sticking together) and seasoned with chili and basil, with the savory, distinctive undertone of umami from the fish sauce.  I also enjoy the spicy fried rice, which has the same flavor profile, but in rice form.I particularly enjoy the salads here, namely the grilled prawn salad.  The spicy lime dressing is the best I've had at any Thai restaurant--it's savory and tart, with just enough citrus and chili to complement the fish sauce.  They don't seem to put garlic in their salads, mostly onion and shallot, so the dressing is not overly pungent.One of my favorite dishes here is the fried chicken cutlet on flavored rice.  The breading is airy and flavorful, the chicken is white meat and tender, and the rice is rich with seasoning from being cooked in chicken broth, but is not overpowering.  This is a great option for pickier palates who cannot handle heat or bold flavors.There is free parking in the private lot out front, and there is usually a spot to be had during off hours.  Otherwise there is street parking on the residential side streets.  It's CASH ONLY, so come prepared!"], ["Jenny N.", "Food and service are great. Prices are very reasonable.Parking: there is free parking in the private lot out front, and there is usually a spot. Otherwise there is street parking on the residential side streets.  Sanamluang is famous for their noodle dishes. The Pad Thai and Pad See Ew are both tasty. I usually order mine with tofu, but there are other meat selections like beef, chicken, and shrimp you can choose from. I particularly enjoy the salads here. The spicy lime dressing is the best I've had at any Thai restaurant--its savory and tart, with just enough citrus and chili to complement the fish sauce. I've tried other dishes as well and have no complaints.Service: I haven't had any bad service so I don't have any complaints thus far.You must get the Thai ice tea, it's so yummy!It's CASH ONLY, so come prepared!I would come here again for their food."], ["Lyn C.", "Sanam is nice for late night eats, but realistically I only really come here when all other Thai places are closed.  I tend to get some type of noodle soup, even though there's a huge The service is okay, typical.  We've always been seated right away, and even though they probably don't like it, they let us sit and hang out for as long as we want.  Cash only!!"], ["D W.", "1) food. It was greasy, didn't have flavor, and I'm not sure if the chicken was .. Well it tasted like bad Chechen. If you are coming here I suggest tofu. 2) service. Way worse than the food. I asked for a different dish and the manager told me \"you just aren't use to Thai food. \" I finally  gave up. 15 minutes later she decided not to charge us for the food she took away. She didn't offer to let me order anything.Overall, just don't. We live in a city with plenty of good Thai food with good service. Just don't."], ["Deborah C.", "1 star is generous for this place. Food was horrible. Service was worse. Venue was disgusting.. Lots of flies and mosquitos, and we were sitting inside.Took more than 15 minutes to have just our water. Had waves for service ignored. Even asked from the other side of the restaurant for our check to see the servers busy chatting amongst themselves. FYI, they charged our tip to our check without letting us know, so just make sure when checking out. Also, there was a sweet young waitress with short hair, but didn't see her until we were leaving. Worst Thai place ever. Won't be back."], ["Renee L.", "Shrimp cakes are to die for. Also it's cash only, so make sure you're prepared."]], "Ayara Thai Cuisine": [], "Hoy-Ka Thai Noodles": [["Alexander A.", "Atmosphere is very nice - kinda rustic and craftsman(?), and the layout is spacious and clean.  The staff are incredibly friendly and pleasant.Of course, THE FOOD IS AMAZING.  My vegetarian GF loves many of the options they have, too.Parking space can be difficult to find, especially during lunchtime, but such is LA."], ["Michelle V.", "check out my photo on their green curry. it came out and i looked at her like wtf.Me: are you kidding me...Her: oh it's not really supposed to be green.. Me: It's pretty green in the photo on your menu..Her: That's just for the menu. It got such good reviews.. I've been here once before and had the pad thai so i figured i'd get something different. Damn, I don't know if it's the location or what but the Thai restaurants I've been to around Hollywood all suck! AND they have great reviews. Maybe it's that they have prime time real estate and it's tourists from bo-donk middle America that's having Thai food for the first time. Ugh, so frustrating!"], ["Eunis H.", "I finally decided to write a review after eating here 4 times! The 4th time I ate here, I went back twice in 1 day and did a Togo order because i was embarrassed of eating there twice HAHAHonestly, I didn't expect much because this place opens till 2am or something so I assumed lots of intoxicated people like to give superb ratings. However, first time I tried here i was pretty satisfied. Their customer service was pretty darn good and their #18 soup noodle was very GOOD! 2nd time i went back I told myself, if they make the same #18 Hoy Ka noodle soup the exact same way, they maybe our new Thai spot. 3rd time, I said if they make Pad See Ew and Pad Thai the way I remembered eating in Thailand, i'll never cheat on Hoy-Ka with another Thai place! Well......IT IS DELICIOUS & I WON'T CHEAT ON HOY-KA!!! Their Pad See Ew and Pad Thai and the ground meat over rice and fried eggs were all really flavorful and authentic like how i remembered it in Thailand. #18 Soup noodle with Pork- SO GOOD!Pad Se Ew- very flavorful and noodles perfectly chewyPad Thai- it came out more yellow and didn't look as flavorful as the orange pad thai i'm used to BUT, it was REALLY good!!Even their TOGO packages were wrapped and taped 4 ways so it wouldn't spill. =)"], ["Jane L.", "Hoy Ka Thai Noodles is a Thai restaurant located on Sunset Blvd in Los Angeles. They're not located in Thai Town anymore, that was their first location before they moved to this location. They just pretty much used their old menu and didn't change the location information on the front cover. Their menu includes a variety of Thai dishes including appetizers, soups, salad, noodle soups, stir fried noodles, rice dishes, a la carte, curry dishes, and side orders. They also have a vegetarian menu. Their noodle soups include small size and large size. For noodle soups, there are different types of noodles you can choose from which include flat rice noodles, small rice noodles, egg noodles, glass noodles, or Thai vermicelli.I've had the Boat Noodle Soup with Beef large size. I requested mild spicy, no bean sprouts, and my choice of noodles was small rice noodles. This noodle soup consists of pork liver, tripe, and meatballs. Generous portions of everything. The broth was seriously heavy and rich but it was really good. The noodles had the perfect texture. It was soft, chewy, and thoroughly absorbed the flavor of the broth. The noodle portion seemed to be never ending. My mom had the Hoy Ka Noodle Soup with Pork large size. She enjoyed it very much. I also tried a bit and it was pretty good. It was awfully crowded the first time we went. It was pretty chaotic. The second visit we came right when the restaurant opened so we were one of the first ones. We arrived at 11am and within 10 minutes came three other tables. Service has been good. The servers are really nice, accommodating, and very soft spoken. Sometimes, we did have to flag them down when they were busy. The owner recognized us from our first visit and welcomed us. For our first visit, it took us forever to get our to-go orders. Keep in mind we ordered to-go at the same time we ordered food for dine-in. We waited pretty much another hour after we were done eating. When we finally got the orders, we received numerous apologies from the owner (who was also our server that day) and we got a discount from $52 to $45 which was nice. For our second visit, our to-go orders arrived promptly after we were done eating. But then again, it was far less hectic that day. The restaurant it itself is very spacious. There's a lot of seating available in including regular tables and high top tables. The interior is a bit interesting. There's photos of patrons in the form of a heart shape, artwork consisting of paintings, and several TVs. On a random note, servers here all wear plaid shirts.Parking is awful. Couldn't find any in the back on the first visit. Even if we were to find parking in the back of the restaurant, all the spots are incredibly narrow. For both visits, we were lucky to find a spot on the curb in the front of the restaurant. Overall, their Thai noodle soups are pretty awesome. Will definitely be back for another visit!"], ["Alan T.", "Everything we tried was excellent and unlike anything I've eaten at other Thai restaurants. What stood out the most to me were the Papaya Salad and Hoy Ka Noodle Soup. I've had Papaya Salad at a number of different restaurants - both Lao and Thai - and this was the best I've had. We ordered it Thai Style with Braised Pork and the flavors were just perfect. Just as unique and bursting with flavor was the Hoy Ka Noodle Soup. This soup comes with a choice between a few different types of noodles and meats and I ordered mine with chicken and rice noodles. This has to be one of the best Asian Soups I've tried. I eat a lot of pho but the Hoy Ka is in a league of it's own in terms of flavor profile and depth. It was an extraordinary bowl of Thai Chicken Soup to say the least. Everything we tried was extremely good and received the approval of my inlaws who just arrived from Thailand the same day. The service was outstanding. Our servers were very attentive and the speed was good from the time we were seated to the time we paid our bill and left. The owner came and conversed with my in-laws before we left. The owners/management seems like really great people.The only downside is parking which might be a problem on a busy night. We were fortunate enough to find parking directly across the street.This is a great place for Thai food. It's fairly cheap and they make excellent food. I liked everything about it which translates to five stars. I will definitely be back."], ["Tony J.", "Absolutely perfect!Love the vibe, the service, and best of all, the food! I just had to write this review while I was sitting at the table, after I just finished my meal. This usurped my previous top draft pick.Took us 45 minutes to drive here and I'd drive an hour!Try the green curry - it's deliciously zesty. The Thai tea is a great end to the meal too."], ["Jennifer T.", "Holy Hoy-Ka Thai Noodles!  If you're looking for an authentic tasting Thai restaurant in Hollywood, look no further!FOOD:   1) Papaya Salad - I think it was papaya salad, but whatever it was, it was definitely a very delicious salad.  I think the waiter wrote down our order wrong, but still gave us a delicious papaya salad nonetheless.  The flavor was strong and delicious.  Even the butter lettuce at the end had to be eaten because there was so much sauce left!  Their sauce seriously made all the difference!     2) Crispy Pork with Chinese Broccoli - GET IT!  Don't be a fool...just order this!  The crispy pork was fried so well and had just the perfect taste and texture.  It was not spicy at all but I'm sure you can have it spicy if you wanted.  There aren't too many pieces of pork though, so if you're going with a larger group, make sure that you either take all the pork at once, or you share.     3) Hoy-Ka Noodle Soup with Pork - Also don't be a fool...GET IT!!!!  There's a noodle selection on the back of their menu for different noodle options.  I picked the thin rice noodles.  The ingredients in this noodle soup consist of pork meatballs, ground pork, bbq pork, pork liver and fish cake.  You can always ask for an item on the side or not at all if you're not a fan.  This was extremely delicious.  The flavors come together so perfectly with an ever so slight hint of sweetness.  I add their chili to the soup, because everything, no matter how good, tastes just a bit better with chili!This place won my heart!  With such a delicious menu, and a super adorable ambiance, I'll be sure to come back for more if I'm in the area!"], ["Jonathan S.", "This restaurant embodies everything you're looking for in a neighborhood restaurant: Mouth-watering food, gracious service, and a beautiful eclectic atmosphere all for a terrific value. True story: My wife and I flew in from Atlanta for our anniversary, and we couldn't make our reservation at the highly-acclaimed Bestia, so we decided on Hoy-Ka Thai Noodles. Makes sense right? Nope, not at all. Sure, nothing says hot date night like pan-fried ciccioli or roasted bone marrow, but we pulled the ripcord and went a different route. We were rewarded.We were greeted with very warm smiles by all. The ambiance was very cool - a mixture of greenery, wood, metal and stone, with lighting, art and tv's mixed in. We both had the drunken noodles (one pork, one beef, medium heat) and the balance of spicy and sweet was superb. The meat was seasoned well, the veggies were crisp and fresh, and the noodles made all the flavors talk to one another.And of course what venture into Thai cuisine would be complete without one of my absolute favorites, Thai tea, accompanied with a hearty amount of tapioca boba doo-dads which make not inhaling them into your wind pipe a sort of delicious exhilarating high-risk sport. I'm all in!Great spot. Definitely recommend."], ["Son N.", "Ordered number 18A. Got a extremely salty bowl of noodle with uncooked pork liver. No apology received. When asked for another bowl, got just a small bowl of liver. Felt so pissed that I had to write a review. Disgusting restaurant, wont ever come back!"], ["S J.", "The best TOM YUM I ever had!!!!I would suggest ordering it medium spicy...I eat hot stuff all the time and I ordered it HOT and it was very very spicy but still delicious.  I feel the the medium spicy would have been more enjoyable on the palate."], ["CAROL L.", "I always get the Hoyka with flat noodles at a 2 level of spiciness. It's still spicy & tangy enough for me to gulp down a lot of water. I really like the fish balls and can do without the liver (though I love fried liver). The papaya salad is refreshing and good. Parking is pretty easy too. There are a couple of non metered spots along Bronson Ave.Service is always friendly."], ["Annie L.", "- Reccs: green curry, papaya salad- come for lunch- really well kept and decorated interior; a welcomed changed from some of the grittier places in Thai town. - great service"], ["Tristyn H.", "I have ordered food to go many times, but this was my first time dinning in. I love the atmosphere and decor. It is very mixed with exposed brick, wood slats unpainted, but then a cute fifties dinner counter. They have little knick knacks thrown about and movie posters on the walls. I personally like places where there is lots to look at. The seating is open and comfortably spaced. The back wall has a row of tall picnic table style seating. Other tables had chairs with tennis balls on the pegs, haha. I found that amuzing and hey, no one likes a squeaky chair pull out.  The food was even better than I remembered. the Tom Kha soup is just incredible! But watch out for the pieces of lemongrass, those bits can be painful.As an overall tip, if you don't like spicy food, order on the lower scale. The server will ask you how spicy on a scale from 1-10. I like spicy and the 5 was HOT. We ordered the Green curry which was good but nothing mind blowing. The Pad See Ew with Shrimp was SPECTACULAR. The perfect flavor combination and the texture was very pleasing to my senses. typically I have found Pad See Ew to be very soft with almost mushy noodles. Here they were still soft but with crispy edges. They also de-tail the shrimp up to the fan part. so its really easy to eat with chop sticks, no need for the pulling with your hands. I LOVE THIS PLACE 1000% worth the extra drive."], ["David P.", "It's located in Hollywood so parking can be bit difficult. Small parking lot in the back of the restaurant or you can try your luck on Sunset blvd after parking meters expire. Rag-tag decor with bunch of things on the wall. I thought it was really coo, goes well with Hollywood's diverse culture. Ordered Tom yum pork rib soup with flat noodle and BBQ pork with rice (because I love BBQ pork). Tom yum pork rib soup was freaking amazing. The broth is very flavorful, bold, and even clean (what the hell?). It had grease it in, which I liked but it tasted very home-made and fresh. The noodles inside (you can choose which noodle you want) were cooked to perfection. My BBQ pork with rice was your standard BBQ pork with rice. I thought it was solid but nothing to rave about. Good service, I believe it's family owned so if you have craving for some good ole Thai food in Hollywood, this place should be in your bookmark."], ["Cici C.", "The Best thai food , clean , fresh , love it !  Outstanding & Excellent  Customer service . My favorite place to eat . I'll completely recommend it."], ["Precious C.", "You never seem to let me down. I tried something new today. Crispy Pork with green beans, basil and red bell pepper.  The crispy pork here is great however this dish had too much green beans and not enough pork. But its all good because the dish tasted great. I shouldn't blame them for my big appetite.  :) As always, we left as full bellied happy campers. I always enjoy how nice and attentive the staff is with everyone. They are so patient with new customers. They explain their dishes and spices. Oh yeah, prices are always good. I love this place!!! As always....5 stars."], ["Matthew T.", "A good Thai place, cheap prices, and decent service. However, the parking situation is terrible especially at night. They have their back lot but there are only really like three spaces and the rest are for Arby's next door. Additionally, they were out of mango sticky rice that night and this was around 8pm so that was strange. But aside from that it was a clean and spacious restaurants. Several TVs which was good to watch the NBA Finals. Tons of tables. An extensive menu too with dishes all around or under $10.My favorite was the yellow curry. I thought that tasted the best and second best was the deep-fried egg rolls. They were smaller than normal but you get a whole plate and they were tremendously crispy. The pad see ew was good but not memorable. Finally I thought the Hoy-Ka noodle soup was something I wouldn't order again just because the glass noodles aren't my thing. Working out of Hollywood I've been able to try a lot of Thai places recently and will have a list out that will rank them but so far Hoy-Ka is up there."], ["Nitar L.", "3 ladies and 1 dinner only $30!How can that be? We were fully satisfied by the intense Thai flavors and totally stuffed. Here are the items we ordered:- 3 Small Hoy Ka Pork Noodle Soup - 1 Crispy Pork Over Rice- 1 Papaya SaladEverything came out mild, then we spiced it up ourselves with the condiments. Hoy Ka has some of the best chili sauce and chili flakes. Most genuine Thai restaurants will have generic spicy condiments, but the ones here are truly one of a kind spicy!We'll be back again for mango season so we can indulge in mango and sticky rice for dessert. Yum!"], ["Melinda L.", "I have to say yes, the food is great, except the service. I have came in many times for Thai Ice tea after the show. I always get different price from them. Sometimes $3; sometimes $3.27. Also, when I first ordered the dish with $9.69. The lady told me they don't accept credit card until $10 or more. So I had to order extras. But funny thing was, I came with a group of others. They also spent less than $10. The lady only told them the is the only chance they can use the credit card. Some of them not even being told by the service. WTH!!! Single me out!!!And when I ordered the noodle, spicy. The old service lady wanted me to tell her the level 1-10 instead. Geez...Didn't you write none, mild, medium, spicy & very spicy on the menu??!!! Another thing is, my friend ordered a rice to go, which comes with the soup on the menu. But, she didn't get the soup. The service told her that they don't include the soup if you order it to go, except this time. Well... But this policy isn't even on the menu. Because of this, she never wants to come back anymore. Very disorganized!!!I used to add this in my bookmark. But due to these bad customer services & policies, I decide to remove it."], ["Tammy C.", "Great place, super slow service and SUPER BAD food. Why is the rating so high? I don't recommend this place at all"]], "Sticky Rice": [["Mohib Q.", "While I couldn't understand anything the nice woman at the front was telling me after saying \"I don't want anything spicy,\" I knew I was in for a treat. Being the only Thai place in Grand Central Market, I find that Sticky Rice is a great representation of not only Thai town but what a greater part of LA loves as well. If you look at Westwood and parts of Hollywood, they're littered with some of the best Thai eats around. I suppose it was just a matter of time before a nice place threw down for a stall in the market. I took all my bias and forgot to set it aside when I ordered the curry soup dish called the Khao Soi. Why? I wanted to see what kind of curry they threw in the hodgepodge. It was also important to note whether or not it would permeate through the noodles to give the food itself some flavor. As many have said, be prepared to wait, as the food appears to be made to order. After ten minutes, and going through a short line, I received a large cup about the height of three baseballs stacked up. The noodles were fresh, and flavored with curry quite well. While the Thai have several types of noodles, these resembled the classic fettuccine shape. Along with chicken cutlets, green onion, and undesired parts of chicken skin, I began my descent into bliss. I tossed aside the skin pieces and found that every bite was very flavorful not just of an Indian-style Madras curry, but of a thin coconut milk. For those unfamiliar with coconut milk, I recommend you try it at least once. The dish did not come with rice, and didn't need it. It was so much to consume in itself. It may even feed two moderately hungry folks. Located right across from their old spot and next to Olio Pizzeria (originally from Santa Barbara just like McConnell's), the stall is open late some nights when Grand Central is open late. I recommend coming after 1:00 p.m. and being prepared to wait 10-15 minutes for your food. Consider street parking if you're coming here from far away, but walking here is your best option. Many patrons were backed against the old unused stall waiting for their names to be called, all the while gazing into their phones. The things that you own, as Palaniuk would say, end up owning you in the end. So try the Khao Soi, especially if you've never tried Thai food, or if it's a cold day, or want a quick warm meal with a kick. Don't use the hot sauces unless you can handle a swift judo-chop to the throat and digestive system. Bring folks who are like minded, and not those you're truly looking to impress. It's a simple place, a simple stall, and a simple menu much like the rest of Grand Central Market's other shops. Remember to know what you want and keep the line moving as if you're there to see the Soup Nazi. There's more to discover outside of the Khao Soi and this lovely joint, so go make like Levar Burton and don't take my word for it."], ["Brian M.", "I was feeling slow and wanted to find a hearty soup to pick me up. I really enjoy the market and always like discovering new things. I had a wonderful meal at Sticky Rice and the staff couldn't have been nicer. I tried the Khao soi which was displayed on a cool looking menu over the booth. I later learned more about this great Thai dish, something I had never tried. I read khao soy is a Burmese-influenced dish served widely in northern Laos and northern Thailand. The ingredients and flavors in this curry are fantastic. I added Shrimp and next time will try chicken. If you are looking for a complex delicious curry look no further!Skip the Fanta and try something else. I also recommend the Lemon Watermelon refreshment to go with it as a drink."], ["S D.", "It was okay.You get an okay amount of food for a decent price for the name of Grand Central Market.  But you really can get Thai food somewhere else for a much better price and better quality.  I got Pad Thai which didn't have much flavor and was subpar Thai food."], ["Jessica F.", "Moved down the street and decided to give this place a try. Probably going to become a regular because it was just that great. The crying tiger was the best I've ever had *drake voice*, ESPECIALLY THAT SAUCE. I've even contemplated going there to just ask if I could buy some sauce. It's that serious.The pad thai and BBQ chicken were also very yummy, everything cooked perfectly but then again, you shouldn't be in business if you're a Thai establishment that can't get these two dishes right. The only downfall is the GCM is cracking on weekends and not in a good way so expect a crowd if that's when you're visiting.TIP: it's the same restaurant on both sides of the column. Took me a minute to figure that one out lol."], ["Graham S.", "A haiku review: Be prepared to waitPineapple fried rice: tastyWill try it again"], ["Eric T.", "This is one of the first of the new generation of Grand Central Market \"revival\" food stands. Their simple chalkboard menu posts offer 2-3 dishes with a few specials off to the side. Primarily rice bowls and curry. Sticky Rice resoundingly delivers on its name... the rice is, well, very sticky, very delicious. This is clearly the outstanding  anchor to this spot. The rest of the flavors were pretty straight forward, good quality and flavor but not memorable or particularly groundbreaking. Pretty much what you expect from any rice bowl. All in all tasty reasonably priced lunch - Not life changing but return worthy."], ["David J.", "In the line of southeast Asian food, you want to eat the ways the locals eat. Street food, national dishes, etc. Sticky rice is a food market stall but is serving up some of the best Thai food in this country. I've had Thai from top zagat restaurants in NY and I honestly can say the Pad Thai and pineapple fried rice are to die for. Good food doesn't have to be expensive but it should taste good. For a large portion of food between 10-15 dollars, it's well worth it. The flavors are intense but balanced and follow the southeast Asian cooking standards of sour, sweet, savory all in one dish. If you're ever near Grand Central Market in LA, check this stall out make sure you go to the side where the menu looks painted on (the side with no seats) and order from there."], ["Jinyoung P.", "Decent Kao Man Gai, and it becomes amazing when you put a little bit of the fish sauce with peppers on the chicken. The broth is straight up comfort food. Next time I'd like to try their Panang curry."], ["Andy N.", "Located in the new updated Grand Central Market. A lot of new places are popping up here. Sticky Rice is one of them. A thai food joint with a small menu. We ordered the Hainan chicken. We also got a side of sticky rice. Our plate had garlic rice, ginger soy sauce, cucumbers, and boiled chicken. It was really good! It also came with a chicken broth on the side. The portion was really big. I was stuffed after eating this. Yummy! This looks like the go-to item to order here. Recommendation: Hainan chicken"], ["Ryan R.", "Went here to check out the famed pineapple fried rice.Lucky for me, there was no wait when I arrived shortly after noon and I ordered right away.The fried rice is priced at $10, but it is served with chicken and is a generous portion. The flavors of the rice are very good. Not so much a sweet flavor, but more of a curried, earthy flavor that goes well with the chicken and pineapple. The texture of the rice is good as well as it has a certain bit of firmness to it that is not usually found in other dishes.I also had the opportunity to sample the almond boba tea which was very tasty and refreshing as well.Overall, the pineapple fried rice is worth trying here and could easily be split with a friend. Definitely check this place out if you're at the market."], ["Daisy S.", "Really good Hai Nan chicken with garlic rice.  Central Market intimidates me with its foodie crowds and long lines, so go when it's off-peak.  Then you can sit and calmly enjoy this fresh Thai food."], ["Adrian Robert H.", "75%Solid thai BBQ chicken and papaya salad***Came here for lunch with a co-worker, Nov '14The business here operates out of a smaller space with about a dozen stools by a counter in Grand Central Market.  The menu is small.   There might be around a half dozen dishes.  When I visited around 12:30 for lunch, the skirt steak or crying tiger dish was already sold out.  I think its a good sign when any eatery offers a smaller menu.  It shows dedication to focus, all things equal.  What seemed odd was that Hainan Chicken with rice seemed to be part of the menu.  That isn't a Thai dish, so its a bit confusing to to see it offered.  The mango and rice dessert didn't appear on the menu, although I didn't ask to confirm if such was the case.I liked the food overall.  I'll get more into the details.  The 'Gai Yang' or Thai BBQ chicken ($10, and Id rate 75%) with papaya salad and sticky rice were done very nicely overall.Some notes:- Because its cooked right there, the serving temperature remains nicely hot.  I would try not to wait before eating to keep this.- The chicken is cooked very nicely, with the interior remaining more juicy.  The ends and skin had a very soft char.  Behind all the other flavors, the flavor of the chicken was notable and delicious.  Thankfully, there's a good amount of fatty chicken skin as well.- There was a good balance in flavors.  I liked the seasoning or marinade used a lot.  It complimented the protein well.  It was more sweet than anything else (my guess from a fish sauce) but not in a harsh and overpowering manner.  There was also a notable spice presence that I could not identify.  My guess was there may have been lemongrass, among other spices.  It worked well.- portion size quite reasonable for the chicken, if a tad small for the papaya salad.  If you are an eater with a larger appetite, I might suggest order 2 portions.  I know I'll do this for myself with visits in the future.- there is a side of what appears to be a sweet sauce, although I was so pleased with the existing flavors and balance, I never saw the need to use it.- the papaya salad was quite refreshing and crunchy.  The sweet, tangy flavors were milder than a typical thai place.  I also liked that the heat levels were not as aggressive, although I understand that's not for everyone.- I did not care so much for the sticky rice.  I found it to be a bit on the dry side, although it retains the pleasant bouncy and chewy texture its known for.  Portion size appeared a bit small, but I understand that's not unusual for the dish.  Given the choice, Id opt for regular steamed white rice instead that came with my co-worker's curry beef.My co-worker seemed to enjoy her Penang Curry beef with rice.  She mentioned she liked the sauce, commenting that it was not too sweet, heavy, or spicy.  She did mention that she wished the meat was more tender, but it did not seem terribly dried out to me either by appearance alone.She also didn't seem to care for her Thai Iced tea.  She mentioned it lacked a stronger presence of milk, and the texture was more watery.  She mentioned the flavor was more muted than she'd prefer.  That's something I may be less inclined to order at all, but then again its not something I would be excited to order to begin with.Value is reasonable to me.  Prices are on the lower end of moderate, and comparable to what most Thai places might charge.  Portion sizes seem more or less in line to similar thai restaurants.  However i think the quality of cooking was more to my liking than most Thai places, where I might often struggle to detect the flavor of the protein under typically stronger sauces and heat levels.  Seems like most lunch dishes, including their BBQ chicken, are around $10 even.   Ambiance is okay but to be expected.  Because there seldom is room to sit at the counter, I just ordered my food 'to go', and sat close by at one of the many eating areas in GCM.Service seemed okay.  The staff were cordial and efficient.  I dont fault them for not being the most friendly.  This was a busier time.  Perhaps a visit outside of conventional lunch hours may offer a more intimate experience, although Im not sure how realistic those expectations are with the nature of such establishments.  I would also be afraid if they happen to run out of more items.In any case, I was pleasantly surprised with my lunch and can see myself coming back on a more regular rotation. Recommended!"], ["Sasha N.", "I'll be the guy that says this is \"the best thai I've had since I was in Thailand.\" the shrimp curry can get a little spicy, but the sweetness is well balanced. And the price is perfect. The BBQ chicken is also delicious."], ["Vincent T.", "Excellent selection of Basmati rice. For those of you who are not rice experts. Basmati is gluten-free and low in fat. It contains all eight essential amino acids, folic acid, and is very low in sodium and has no cholesterol.Basmati has a low to medium glycaemic index, meaning that energy is released at a slower, steadier rate leading to a more balanced level of energy.Would return here again!"], ["Jasmin M.", "First time here on a S U N D A Y, and let me tell you! It was packed!! But fun. It's tucked away inside a food mart/court. I got the drunken noodles with beef and chicken. It was amazing. Came with peppers, mushrooms, baby corn and more veggies! So so good. But when I saw the Pad Thai come out. I immediately wanted to change my order. I'll deff get it next time. Don't go on the weekend. Unless you don't mind crowds and long lines."], ["Jessie M.", "I've only tried that beef Penang curry but holy Moly was it amazing. $10 For a rather large portion so enough for two meals. Wish they delivered."], ["Frances C.", "A year later, STILL good. The cooks weren't as chatty/friendly this time, but given it was a Saturday the crowd was a bit nuts. Try the Beef Penang, you will salivate at the thought of this dish... kind of like Pavlov's pups. Enjoy! P.S. They do have the Northern Thai selections (more well known -- Pad Thai, etc.) on the other side of the booth, but you can get that anywhere in LA."], ["Mariella S.", "I've tried 3 dishes here. The negative star is mainly for the mediocre customer service. The young woman who is there most of the time is cold and not very helpful.The Pad see Ew and Pad thai are pretty good. Nothing memorable. The PAD KEE MOW is a five star in and of itself! I am a huge fan of their pad keep mow, and will continue to be so as long as they don't change the recipe! Thank you Sticky Rice!"], ["Stephanie P.", "S- ticky rice is a T- iny little counter in GCMI- happen to love love love itC- urries are delicious. My favoriteK- ind is the green with veggiesY- um! The rice is excellentThis place is very busy during lunch hour!"], ["Ege J.", "Good food, quality good, and size ok. Had the Beef Panang, really not bad! Just a little bit too expensive $10. 4 Stars."]], "Thai Original BBQ And Restaurant": [], "Ruen Pair": [["Sarah P.", "In my opinion, Ruen Pair is the best restaurant in Thai Town. They boast a huge menu with dishes covering a wide range, for all tastes. There is a reason they're usually packed to the gills - it's all delicious, and affordable to boot! Plus, they're open late in case you need a drunk-food fix.Service is always great if you're nice. Don't expect anything fancy. Cash only. Parking lot is valet and street parking can be a pain, but such is life in East Hollywood."], ["In Ian C.", "The best thai/southeast Asian food I had tried in the state! Service/environment: The restaurant is small and packed. Service was okay, one of the servers didn't seem really happy though. Food: The morning gory was the bomb. It's a must try! Being as a noodle freak, I needed to try their noodle soups as well. OMG. They tasted heavenly. I tried the one with fishball and the other with duck. The broth was flavorful and they were both delicious. My friend really liked the Tom yum soup, but I was not a fan of it (too sour to me). *Need to pay $3 for valet parkingDefinitely recommend this place to my friends, and I am coming back for more authentic Thai food for sure."], ["Clara L.", "we ordered a bunch of items for take outbeef pad see ewchicken pad thaipapaya saladspicy fried rice chicken and green beanseverything was finebut kind of blandnothing stood out but nothing was terrible"], ["Vanessa M.", "I was in the mood for something that would hit the spot on a cold day. A soup sounded good as well as something homey so decided to go for Thai. I been to Thai patio and others but wanted to try someplace new. I was told Ruen Pair is pretty good and it's in the same plaza as Thai Patio and 3 other thai restaurants. Parking is valet ($2). The inside is small but spacious and cozy. CASH ONLY! they have an ATM machine in the restaurant just in case._Chicken Sate ($8.95) Grilled chicken or pork on stick served with peanut sauce and cucumber sauce. This was so so. Hard to mess this up as it's a staple appetizer in Thai cuisine but the chicken was just okay. It could have been a tad more moist. The peanut sauce was good, thicker in texture than most I've had._Coconut Chicken Soup (Tom Gha Kai) ($9.95) Chicken, mushroom, lemon grass, lime leaves, galangal and lime juice in coconut soup. I usually always get this soup when I want Thai food. It's almost a tradition with my dad since we would always get this together. It's served in a bit hot pot, good for 2-4 people to share. Right amount of coconut flavor, not too spicy, and has a sour flavor from the lemongrass. I love the button mushrooms and the chicken is moist. _Glass Noodle Salad ($8.95) Glassy noodle mixed with red onion, ground pork, shrimp, chili and lime juice. I saw this on yelp images and it looked pretty good so wanted to try it out. I'm glad I did, the flavors are simple and light. The glass noodles, I'm told are supposed to be less carbs than others, so that's a plus. The shrimp was good, I wish they added more. Good amount of ground pork that is spread throughout. It was a bit sour and refreshing. _Chicken over Rice ($8.95) Special steamed rice topped with chicken served with homemade sauce and chicken broth soup, This is always a classic and can't go wrong. The rice is steamed and fluffy, has some flavor from the broth. The chicken is very moist and the dish itself, minus all the rice feels light. I've had this dish better elsewhere, but it it's still good.Price is great for the amount you get. Service is good. I would come here again!"], ["Ticha B.", "Thanks Ruen Pair....we walked in around 320am Friday night and you accommodated our party and two other tables after us before closing the kitchen and closing shop for the night. The late night crew was cool. They were nice and attentive. The late night food here is good as well. Go for Thai-style Kao Tom (rice soup) with Gaap (side dishes). For the Thais...Ruen Pair is known for their Kao Tom Gaap. Other good dishes include the usual Thai dishes: pad see eww, kao mun gai, seafood soup. $2 self parking. CASH ONLY!"], ["Joanna A.", "My favorite Thai restaurant in LA.  The food is delicious and doesn't make me feel crappy afterwards! (Lol) I'm lame and I don't venture out from my usuals (pad see ew, pad Thai... Both that are super delicious!) but recently I tried their chicken and rice and it was amazing. Tender boiled chicken served with flavorful rice, a small side of broth, and a tangy soy sauce. So yummy! Valet only.  Cash only. Serves beer.Be careful driving out of the parking lot. Scratch the bottom of my car every time! And I swear it's not because I am a bad driver LOL :P"], ["Leah A.", "I came here with my cousins because I know they would never take me to a place that sucks. Ruen Pair definitely is worth the wait as it is located in an overcrowded strip in Thai town with challenging parking regardless if you use valet or not. Just give the keys up and let them park it for you so you can go eat some delicious food.I never do the ordering when my cousin's are involved. They're both solid when ordering amazing food and picking out obscure hole-in-the-wall places to enjoy Los Angeles' best. Ruen Pair is definitely one of those places.I loved the whole fried Pompano served with this tangy spicy sauce and the crispy pork belly. And of course, I always enjoy the pad Thai. Fast service and efficiently run. Very busy place and a terrific choice when you're craving Thai.."], ["Liz C.", "I've never seen a Thai town before, let alone so many Thai restaurants so close in proximity to one another! There were so many choices but this place satisfied our Thai craving. After roaming in LA looking for a place to eat, we settled on this highly reviewed Thai restaurant. The place is CASH only so make sure you have some before coming in. If not, they do have an ATM inside. The place isn't huge but does utilize it's space to have as many tables as possible. We were seated right away during lunch time on a Thursday. The menu is extensive including your typical Thai dishes as well as more authentic dishes. My partner always get the same thing though, pad Thai and pad kee mao. Spice level goes as follows: mild, medium, spicy and very spicy. The pad kee mao with tofu has the option of fried tofu or soft tofu. I went with the soft tofu and loved it. The pieces were big chunks of tofu and they were soft, but still had some firmness to it to keep it from falling apart. I really appreciated that this kee mao did not leak a bunch of oil like other places. It didn't have that greasy, oily feel to it. Furthermore, every noodle was separated and absorbed the sauce. I don't like seeing pieces of noodles stuck to each other and having a pure white side that never touched the sauce. I got mine at spice level medium and found it to have just enough kick. There were plenty of veggies and it was not overly salty. My partner likes his pad Thai spicy but apparently they don't alter the spice level of pad Thai here. They said it messes with the authentic flavor of it. However, they said they would bring out the mini spice rack for him if that would be okay. The pad Thai was well coated in sauce and had a very authentic flavor to it. It wasn't ketchup-y, and not flavorless either. It was a flavor of pad Thai that I've never tasted before, but I liked it. It was more on the subtle side, but adding the spice seasoning helped to amp up the flavor. If you're looking for more flavorful pad Thai, then I'm not sure if you should get it here. The chicken is very tender though!Service was perfect. We were given water and checked up on. I saw the waiter glance over at us here and there to make sure we were doing fine. Once a plate was cleared of food, someone came over to clear it. You can pay up at the register. Once again, cash only. It was roughly $20 without tip so pretty standard for a Thai place. If you're looking for dessert, go right across the street for authentic Thai desserts and Asian flavored ice cream!"], ["Grecia P.", "Any time somebody asks me for a recommendation on a Thai restaurant in LA this is the place I always recommend! Ruen Pair is so YUMMY! It was recommended to me by my friend and her boyfriend which happens to be Thai so I had to trust his recommendation and give this place a try and I'm glad I did, I was not disappointed.My 2 favorite dishes are the papaya salad and the broccoli with the crispy pork! SO GOOD! You do have to pay for parking, $2 dollars per hour but the restaurant is inexpensive so its not a huge deal. Weekend nights tend to get a little crazy but can you blame them? This place is perfect for those late night cravings.LOVE RUEN PAIR!"], ["Charisse A.", "Came here twice now with friends and both times I was not disappointed with their food. I'm not Thai, but I've had my fair share of trying Thai food. As far as what my friends have told me, this place serves authentic, Thai food. Authentic or not, their food is very good for my Filipino palette.  On both occasions, we ordered variety of dishes. One thing that stood out was their papaya salad with fresh crab. I eat raw fish, but never thought I can eat fresh crab! Oh my, the combination of papaya and fresh crab was so delicious. I really liked them, so did my friends! Aside from the food, service is good and price is affordable. So, why the 4 star? The place needs to be cleaned. On my way to the bathroom, the tray for dirty dishes was just laying out there which is less than 10 feet from the dining area. Their supplies are out piled up in the hall way, and they don't care that their customers would see it. I think every restaurant have to consider cleanliness as a necessity. What I saw was not impressive. Thankfully, I already had my food and had a happy tummy or I would have said something to my friends. That being said, I will come back to this place. I will order the same food but hopefully no more messy hallway."], ["Gwyne P.", "Where do I begin? This authentic Thai food spot makes me always wanna visit whenever I'm in Thai Town! My cousin told me about this place. Parking is valet parking for all stores. Since the hub is pretty tiny. The place is pretty spacious & tables are big enough to fit meals comfortably! It's cash only! There's an ATM inside & it's $2 charge.Here's what we ordered:Khao Man Kai- this is chicken over rice & I love the flavors!Curry Noodle- loved this! Wasn't watered down.Fried pampano with special sauce- heavenly! Especially the sauce!Mooyang- BBQ pork! Must try!Tom Yum Plaa- loved!!Tom Sab- reminded me of sinigang! (Sour soup)Morning glory- yummy veggie dish!Loved everything that was ordered!! Definitely will be back!"], ["James S.", "Parking is not free...there is a valet or you can street park.The restaurant is CASH only!So come prepared to use the ATM if you don't have cash on you.There is an ATM there which will charge you $2.00 surcharge fee.The food is not bad...it is family style.I got the chicken curry and the chicken pad thai.Chicken curry was good, portion is a bit small for me.But it tasted pretty good just wish it was a bit larger in size.Pad Thai was very good.I got the chicken pad thai, which i recommend with white rice on the side.OVERALL: lacked the \"wow\" factor for me since someone said it was the best in town, so I had higher expectations.  but worth a try!"], ["Hanning X.", "I heard great things about this Thai place in WeHo. It's one of those places where you have no idea what to order, but end up loving everything you get.We came on a Sunday night. The wait was only a few other parties in front of us, not too bad. Parking in the lot costs a few bucks however and increases with time. Oh yeah, this place is also cash only. Make sure you have enough for parking and food!Since we didn't bring enough cash, we couldn't order too much. But we did have enough for a thai tea and 2 entrees. The Thai tea looked amazing and was just right on the sweetness factor. I ordered this seafood soup dish that I have unfortunately completely forgotten the name of. Silly me. There were shrimp, fish cake, squid, congee, and pork blood all mixed together in a blood red kind of broth. I had no idea what was going on, and I had no idea what it was that I was ordering either, but it turned out tasting great! I loved all the different textures and flavors that were dancing in my mouth. I think it's a great idea to be adventurous at this place. I also really wanted to get the raw crab, but unfortunately we didn't have enough cash. For next time I suppose."], ["Kong O.", "One of the best here in LA. *CA$H only*Valet parking but street parking is available...if you're lucky. Gets packed during the weekends and after 2am."], ["Lucky S.", "*CASH ONLY*Hands down, one of my favorite Thai restaurants ever.  Thanks to my parents, I first ever came here about 15 years ago and have been occasionally coming here ever since then. Now I'm the one who introduces all my friends to this gem.[Location/Ambiance]Nestled in the heart of Thai Town in a small, busy plaza that's stays open late night. Casual, family owned authentic Thai restaurant that's good for lunch, dinner, and even after the clubs for late night munchies. Some nights and weekends will have a long wait time, but so worth it![Parking]Small plaza parking lot. Self park during the day and valet only, after a certain time (maybe 4-5pm) but it's $2 with validation.[Service]Great service even when super busy.  I think all the workers are family members as I remember their faces from over 10years ago.  All the women are so sweet and soft spoken.[Food Highlight]I love that the flavors of their food have been so consistent over all these years.  A few favorite dishes of mine are:- Shrimp Cakes: (appetizer) not to exaggerate but possibly best shrimp cakes ever- Tom Yum Soup w/ Seafood: I like to order mild-med spice and it's the perfect amount of spice ratio to sourness. - Pad Saw Ewe: (beef) have to always order this when I'm here. Classic, non-greasy, generous portion.- Spicy Combination Salad: (mild spice) Perfect combo of spicy, sweet (from sweet Chinese sausages), and slightly salty (salted boiled egg)- Papaya Salad w/ fresh Blue Crab: (medium spice) great tasting sauce[Summary]I like to order family style so I can get to eat a little of everything.  Everything is just so good & flavorful!  No matter how full you may be, do yourself a favor and walk across the plaza afterwards to Banh Kanom Thai for some yummy dessert! You will thank me later ;)"], ["Andrea B.", "It's my first time here and I absolutely loved the food. I already have a favorite Thai food place but I love the taste in this one too because you know every Thai place has its own unique taste. The fried rice is delicious just be careful about not ordering it spicy if you usually don't eat a lot of spicy foods. I eat spicy foods but the spicy rice was a little too spicy. Next time I will go with a medium spicy. The soup is very delicious and lemony and it has a delicious natural flavor and not a chili paste flavor like in other places. The curry is delicious as well but it's more of a soup and it's not too thick like other places! The Thai tea is very good but they don't have boba. The reason I took a star off is because the waitress never came to ask if anything was ok."], ["Natalie S.", "Crab fried rice: Pretty good.  Real crab meat.  Simple.  Can't mess it up really.  I liked it with some fish sauce and chilis and lime though.  Helps it from tasting bland later onSom Tum w/ blue crab medium spicy- Perfect amount of spicy.  Good portion for two or three people.  Full of flavor.  Not too sweet, salty, or spicy. Crispy pork with Chinese broccoli - sort of on the salty side but not bad! goes well with the fried ricegrill pork neck - highly recommend!  Juicy and flavorful.  The sauce that comes with it also gives it an extra kick of flavor.  My favorite type of pork besides pork belly/bacon!"], ["Xochitl G.", "Went back a second time and just as amazing.  Larb was delicious!  And do try the Thai dessert place across the mini-mall - Bhan Kanom Thai.  Perfect way to end the meal!"], ["Cara E.", "4 stars for authentic down home cooked Thai.  Also cute atmosphere - small place, close tables and line/wait to get in.  You can't go wrong with anything on the menu.  And prices are fantastic."], ["Kevin L.", "Possibly my new favorite Thai restaurant.  It is located in a small shopping center on your left if you are coming down Hollywood Blvd when you exit the 101.  It is smaller than the other restaurants in the shopping center but size doesn't matter because the food is good!Waited for 5-10 minutes but I heard that the wait can be long. The things that I loved:1) Pad Prik King: Tons of spices and full of flavor.  The green beans are crisp and the meat is tender.  A bit watery but it didn't dilute the flavors of all the Thai spices.  The addition of the lemon leaves added a sour tang to the dish and all in all a great balance of flavor2) Fish Cakes:  5 large fish cake patties with a side of sweet dipping sauce.  The patties were huge and the mixture of meats and minced veges was also filled to the max with spices.  Fried but it didn't feel very oily.3) Morning Glory: Stir-fried with garlic and fermented beans (I think).  Relatively small compared to the size of the other dishes and also \"seasonal\" priced.  The vegetables were young and not tough as morning glories can be if they are not really in season.  The dish came out piping hot and remained hot.  Full of flavor like all of the other dishes.Service was on point.  Servers was hustling around and ready to help when asked.  Extremely friendly.  As for prices, the dishes ranged from around $9-$12 which is what I would consider relatively cheaper than other Thai restaurants.  The portions were the same as other places.  The dishes seemed a bit salty but I don't know if it's just salt or if it was part of the flavor.  Parking is a bit annoying; you have the choice of street or valet.  Try to find some street parking around the corner before giving in to valet parking."]], "Pa Ord Noodle": [["Lin N.", "If only Pa Ord was closer to my house, I would come here more than I usually do.  I have been coming here for a few years and have noticed the prices have gone up.  It's okay though because I thought the prices were too good to be true back when Pad See Ew was about $5 and the Boat Noodles were less than $4.Don't know what to order?  Here's a list of my top five items:Boat Noodles (with #2 noodles and medium spicy)Tom Yum Noodles (with #4 noodles and mild spicy)Pad See EwPad ThaiThai Iced TeaFull of flavor and spice for your Thai cravings.  You can not go wrong with any of these.There's a small parking lot and the restaurant is tucked in the corner of the plaza. Definitely one my favorite Thai restaurants."], ["Ryan B.", "Was very skeptical about coming here, and it was mainly because of its location (I'm not one to usually dine in a strip mall), but I'm very happy I came here. We ordered the rice with holy basil and crispy pork and although it was delicious I became aware, after the first few bites, that I am not a fan of pork belly. I guess I was under the impression it was more like pork, and less like fried pork fat...but the dish still was delicious and seasoned perfectly. We also ordered fried rice with pork belly (I really thought I liked pork belly). The rice was amazing, same problem with the pork belly though. And lastly, we ordered shrimp Pad Thai; and that was amazing (I like shrimp a lot). The staff was very nice, but perhaps could be more attentive and more curious why I didn't eat much of the pork belly, but it's okay, it's my fault I didn't like it - not theirs. I would definitely come here again, just wouldn't order the pork belly."], ["Harrison X.", "Giving 5 stars for quality and mainly price. The boat noodles are really good and only cost $6! The mild was super spicy still and I'm horrible with spice. Just a warning!"], ["Ruby C.", "Delicious Thai food, great prices, and friendly staff. ++ Order One Spiciness Level Below What You Want ++One important thing to note is that the food at Pa Ord is on the spicier side. My first visit to Pa Ord, I did not enjoy my meal since my \"Medium\" spicy request turned out so spicy I teared up with every bite and kept reaching for ice water.  On a scale of 1 to 10 (0 = not spicy; 10 = dangerously spicy), \"Mild\" at Pa Ord is a 6 or 7 and \"Medium\" is 9 or 10. For someone who enjoys spicy food, \"Mild\" at Pa Ord allows me to enjoy my meal without needing to down glassfuls of ice water. As for the dishes:+ Tom Yum Noodle Soup: Chicken broth soup with a very distinct lemongrass taste and ingredients including char siu, fish balls, basil, bean sprouts. Small bowl is ~$4 while large is ~$6.+ Seafood Fried Rice: flavorful although a bit greasy.+ Drunken Noodles: This stir fried dish has a bit of a kick mixed with sweet. My favorite of the 3 dishes we ordered.3 Dishes set us back $25During lunch on a weekday, parking was a breeze. Private lot with tight parking spaces or metered street parking."], ["Eran F.", "Very good little hole in the wall place. The food is really good and caters to the Thai tounge. This is legit Thai food! Be warned, I'm a huge fan of spicey and this place is spicy! If I order a dish's spice level as hot, it will take me a long time to finish it. Their medium heat is spicier than most places hot. My friends from Thailand confirmed that that's the way it's supposed to be. The flavoring and ingredients are right on. I really like this place! Try the #2! :-)"], ["Jacklyn Fidella T.", "This little Thai food restaurant is a gem, their foods taste so good. Blue crab papaya salad, duck soup noodle, and etcetera, I meant they are very delicious. Folks, I recommend this Thai restaurant and I will come back again."], ["Ami T.", "I liked this place. Very casual and cheap, but with good quality food.The décor is very minimal. The service is average. The food was spicy and delicious. They specialize in their noodles but they also have curry dishes. I had the drunken noodles with tofu and it was very good. My friends raved about the crispy pork and the chicken that they got. They also really liked their noodle/soup dishes. They had minimal vegetarian options but I would come back to try more.beware: they spice their dishes up! My mild was bordering on too spicy for me."], ["Sara H.", "Pa-ord is my go-to spot when I can't think of anywhere else to eat. Don't think of it as a bad thing because it definitely isn't but, how can I not go to Pa-ord? They're consistent, cheap and they never let me down. I've tried a few things off their menu but seem to keep coming back for their Tom Yum noodle bowl with #4 noodle which is a flat rice noodle. Tom Yum's broth is on the lighter side yet still flavorful. I have such high tolerance for spice but, I don't dare order Pa-Ord's medium level of spice. Trust me, you don't want to learn the hard way like me. The beauty of ordering mild with Pa-Ord is that if you're still looking to build up the heat, then you have an array of spices and condiments on your table so, fear not my friend and go ahead and order mild then, customize! The boyfriend loves their boat noodle as well as their other noodle bowl that has pig offal. Broth tastes much richer and the pig offal noodles have a thick consistency to it which is perfect for windy/cold nights. Both taste amazing as well. Another must try here at Pa-Ord is their holy basil with crispy pork with a fried egg on top. I don't know what it is with fried egg and a runny center but you could put that on anything and it will instantly make the dish perfect. Plus, their crispy pork is just beyond amazing - crunchy yet still tender from the fat that's in it. Ugggghhh so good! They used to be a cash only establishment but now accepts credit cards for transactions above $15! Go to Pa-Ord and make it your go-to spot as well! You won't regret it!"], ["Kathy K.", "I Love, Love spicy food. But Holy Moly even the med spicy was too hot. I've been here twice and I've only order only the boat noodle soup with beef. It was full of flavor. You get to choose your noodles. I'm boring so I get the regular flat thick noodles in which you pick your own spice level. Eat at your own caution, because man Ive never experienced heartburn until I ate here. I don't think I've learn my lesson which means I'll probably be back for more heartburns and I don't mind it at Pa Ord Noodles. Parking here sucks. It's in a small plaza."], ["Cathy K.", "Definitely a hole in the wall, awesome Thai place in LA.My friends and I decided to get some Thai food after a night of drinking. One of them recommended this place because of their Tom Yum Soup, so I was like hey, let me search them on Yelp and see some pictures. At first, I didn't think it looked so appetizing. It looked way too oily, but I still gave it a try when they ordered it. It was pretty bomb. I think they should put more noodles in the soup, the bean sprouts overtook the noodles. The soup was really sweet, which I am not too fond of but weirdly, I liked it. By the way, it isn't the red soup with flaming fire pot Tom Yum Soup, it's something different and I recommend that everyone should at least give it a try.I also ordered the Pad See Ew and Spicy Chicken Fried Rice. Damn, does the chef really have high tolerance of spice level or what. I ordered spice level medium and I pretty much was sweating and couldn't talk throughout my whole meal cause it was spicy, and I like hot and spicy food.I will be coming back to try more food here, cause I enjoyed it. Their service is really nice, I just can't understand what they are saying though, because they can't speak English too well."], ["Greatest E.", "Amazing is an understatement, My family and friends including myself are borderline obsessed with this place, THAI BOAT noodle is the best I've ever had in my LIFE!!Every time we travel to Hollywood or passing thru, we have to make it a point to get our Thai boat noodle cravings fulfilled... Being from Fresno, nothing even come close or even scratch the surface compared to this restaurant... One can only wish that one day it comes true but for now I'm loyal to the core.. Let me tell u the broth is really rich due to the blood infused into the broth(sound simple and grotesque but there is actually a certain way to do this properly, like art)- also a little sweet, spicy, earthy, a little sour from the noodles and I'm in heaven.. As for the meat- meatball, steak, liver, tripe and also couple pieces of Chinese broccoli.. I've also tried the tom yum noodle and yen tafo and a few other rice dishes, they're all quite good.. But the highlight is still the boat noodles... Waitress are a little bit challenge with the English language but to me makes a better authentic setting.. I'm gonna stop with this review, it's making me hungry for some now"], ["AC D.", "I seriously don't know how there aren't more reviews warning people that if you ORDER PICKUP ONLINE for this location- it automatically goes to their location over by La Brea. This is SO NOT OK. I imagine it's possible to take this option off the yelp page for this location- why keep it up and make customers like myself (picking up for my boss's lunch hour) unhappy for the extra travel during lunch rush hour and getting back to the office late?? Lock it up, Pa Ord. Not coolio!"], ["Jen S.", "TASTE makes it a 5 out of 5 stars immediately!!! WARNING: NO SPICE still means a spicy level of 7 (or medium) out of 10 in my opinion.  It was actually perfect for me, but I know had I ordered a medium level of spicy, the food MAY have been inedible for me.  I met some gal pals in LA and they recommended this restaurant. I was game for anything, I told them. They even spoke Thai so the ease of ordering and the customer service we received was so great!! By the time I got there, the restaurant was packed at 10ish at night. Parking lot was ok, but luckily I drove  the smaller car and we found a spot right away. I could see how parking can be a bit iffy depending on the hour/traffic. Didn't even look at the menu, I gravitate to my usual Thai favorites i.e. pad Thai, panang curry, fried rice, pad woon sen, but this restaurant does not serve curry. Nonetheless I didn't even miss it!  The girls ordered for me basically.  I tried: crispy pork with Chinese broccoli (YUMMM, No spice but I see red pepper flakes and it was perfect for my taste buds) sausage (light and tasty)fish cake (light, slightly sweet and also tasty) pad see ewe (Soooo good and DEEEELICOUS also THE BEST I've had!!!) pad woon sen (BEST I'VE EVER HAD)papaya salad (my first time tasting and LOVED it, again no spice, but it was a medium spicy level and pepper flakes are very visible)Beef salad (YUMMM!!...tender beef is the BEST)2 different boat noodle soups (that was my first time trying it and it was good but I definitely preferred a few of the other dishes)A first for me as well, I didn't even eat a single grain of rice!!... Surprising as rice is my staple for any Asian dining. I never missed it though. Looking back now I could really see enjoying sticky rice with that papaya salad. At the end of our meal, one of the girls ordered a dessert. I have no idea what it was called but it was coconut milk and some jelly squares and red jelly-like fruit with a chestnut texture crunch. It was also delicious. It calmed the spicy sweat for me. Everything I tasted was really delicious, I can't say that enough. I absolutely will have to add this to my dining destinations whenever I'm in the area, even if I drop in for takeout so I can enjoy it at home. I told my friends I'm ruined... I will never enjoy Thai food near my home and work as much as I had that evening."], ["Nyla K.", "There was a bunch of hype about this place and the boat noodles.  I ordered them but was sorely disappointed.  I got a large size bowl and there was hardly any noodles.  I was like five bites in and it was over.  Very anti climatic.  The broth was a bit salty and extremely brown, but the crunchy pork rinds in the soup made for a tasty surprise.I got to sample the papaya salad, but really was a bit too sweet for my liking.  I also tried the fried pork belly rice dish which was a lot better than the boat noodles probably my fave, but everyone assured me the boat noodles were Bombay when in reality it was just a bomb.  The next time I'm in town I would like to try the curry."], ["Derek K.", "I would say that this is the best Thai food I've had outside of Bangkok, but I'm honestly not sure if I had better food in Thailand itself.Sure, the street food is just as much a taste bud explosion in the motherland, and price-wise, obviously a bit cheaper, but the absence of sanitary standards of the street food over there means you'll either be picking flies out of your plate, or forcing your stomach to brave the pollution from the constant vehicle traffic passing through. Well, probably both. Pa Ord comes essentially as a best of both worlds, in that you get burn-your-tongue-off-spicy street Thai food at extremely affordable prices, coupled with the comforting hygienic standards of the good ol' USA. (They've got an A for their Food Facility rating, and I'm fine with not prying any deeper than that.)I always come assuming there'll be a wait, but mysteriously I've never had to. The biggest obstacle standing between me and my food (besides finding a parking spot) is deciding what to order. With all meat dishes you can choose your meat, and with all noodle dishes you can choose your noodle type (see the choices on the menu or in the cute little noodle display cases).Ga Pao is my favorite Thai dish, and theirs is incredible. With generous amounts of succulent meat, exquisitely balanced flavorings, a perfectly crispy-yet-runny fried egg, and enough peppers to incinerate your tongue, this dish is just as delicious as the Ga Pao I had off the streets of Bangkok--(except with no flies!)Equally impressive is their Pad See Ew. It pairs well with the Ga Pao because it is sweet instead of spicy, and has noodles instead of rice.And then there's my favorite dish of theirs: the Pork Spare Rib Tom Yum Noodles. (The #5, that is.) Whether it's your main dish, or if you're going to be sharing it, I definitely recommend not missing out on this, or alternatively on one of their other soup noodles. With both large ($6) and small ($4) prices, you pretty much have no excuse not to order one. I don't really know how to describe this, except that it is so comfortably fragrant and unbelievably full-bodied. The many types of meat (assuming you went with the #5) make every bite/sip unique, and the occasional crunch of peanut seals the flavor deal. This is why they are called Pa Ord NOODLE, rather than Pa Ord Somethingorother. I could drink a bowl of this every day.With most Thai places, I've found the greatest shortcoming to be meat quality. I don't know what they do to their meats here to prevent them from having that pre-frozen, out-of-a-bag feel to it while still keeping these prices, nor do I care to know. The vegetables are incredibly fresh as well, and it's not uncommon to see a dude hauling a fresh batch of them to the kitchen during your meal.I'm not sure if, ok so what maybe they use some MSG, but this is what I like to refer to as Blind Eye MSG, as it's fine to turn a blind eye because it's just so darn good, and the food would seriously be lacking without it.Your other option is of course going to Jitlada a few blocks down, and paying for exorbitantly overpriced Thai food (and admittedly better ambiance), but I'd choose Pa Order any day of the week. Plus, here you have the awesome 80s pictures of a Thai pop idol scattered around the walls. (I was told that this lady is related to the owner? Or is the owner?)Remember that the food is hellishly spicy, but they will reduce it if you want. I find \"Medium\" to be burningly delicious."], ["Viola W.", "Its just too good that makes me posting my first review on yelp. Ive had so many thai food in US and non can beat this one, it tastes exactly like the one i had in thailand. Service and the food are way more you would ever expect from the price. Sincerely would recommend for someone who wants really local thai food!"], ["Cheryl S.", "Perfect for a rainy day when you're not carrying much cash in your wallet and your solution to staying warm is filling your belly with a warm noodle soup. Be prepared, this place is CASH ONLY, but no worries, they have an ATM machine inside their restaurant. The popular noodle soup dish on their menu is their #1, their Tom Yum noodle soup dish which you would think tastes like the usual Tom Yum soup but actually tastes more like Pad Thai in my opinion. If you're not that hungry, you can order a small bowl but if you came with an appetite, go for the large.You can choose from 4 different type of noodles which they have in pictures (along with the some of the entrees) on the menu (egg noodles, rice noodles, thin/thick noodles). You will also be asked what level of spice you prefer (keep in mind, Thai food can be really spicy so be prepared).If you don't want the #1 or soup, have no fear, there are other items on the menu that you can choose from. It's also nice that they have a small, private lot, since parking in Thai Town can get tricky at times. I like a good \"hole in the wall\" and this is a good \"hole in the wall\" that you know is good when you see other Thai people eating there too. Enjoy!"], ["Alicia K.", "Warm, savory filling soup, awesome for any cold or rainy day. My friends ordered the #1 soup dish with egg noodles and they really enjoyed it. They liked the juicy pork and the sweet and sour (and spicy for some of my friends) soup base. I don't eat pork so I ordered the Tom Kha Kung with seafood. It has a coconut milk base and it's sour and savory. It's really good with a side of rice, to balance the strong tarty flavor of the soup and the soup is huge so you can share. My friends and I shared a chicken Pad Thai and it was really delicious! I would recommend this place to those who've never tried soup based Thai noodles. My friends loved it! I loved it! I'll be back!P.S. There is a small lot to park in but it was full so my friends and I found street parking."], ["Mel B.", "Warning - read reviews and warnings about the spice level.  I was raised with a Thai mom and I ordered the 9 - yen ta fo and 11- seafood noodles medium. I now have no feeling in my lips and flames are shooting out my mouth.   The soup itself seemed very good but I couldn't quite tell because the taste was masked in what seemed to be chili oil.  We aren't quitters and can usually handle a medium anywhere else. We choked down about half a bowl each and then gave up. Yes. We quit. For the sake of our taste buds we quit. Well not just the taste buds - the old saying \"burns going in burns going out\" came to mind and for the sake of our intestinal tracts we decided to stop before any permanent damage was done.  To kill the pain we ordered an order of pork lad nah. No spice. I was happy to see it was more like what mom makes - though the pork was tougher than moms. Perhaps hers is sliced with love. Brown beans, Chinese broccoli, shiitake mushrooms - noodles pan fried before being drowned in gravy - check. It did have a strong hint of MSG which killed the taste for me. Overall, the price is good and they are open late. With so many choices in Thai town, I may try a few others before I come back."], ["Kimmy Y.", "Definitely your typical hole in the wall gem! :)It's seriously located in the \"shadiest\" looking complex with other small businesses in the corner. There is a parking lot but it is TINY but there are street metered spots you can park in. When you first walk in, it looks really small but there's actually another side with additional seating so I think there's more than enough space if you do have a big group. There were so many options and it was pretty hard for me to pick but a lot of the pictures on yelp helped persuade me to get the Yen Ta Fo noodles (which you can make spicy per request). There are also different prices for different sizes ranging from $4.50 for small to $8.50 for large (depends on what dish you get for price). I personally thought the large was enough for one portion (I can't imagine how small the small portion must be!). You get to pick from 4 different types of noodles, egg noodles, rice noodles, thin/thick noodles.I personally loved the broth and the noodles and they had a good portion of squid (yum!) but their spice was pink which made the broth and noodles and ingredients pink haha. I still finished it though. Also, they do have some special side dishes listed on the wall. Make sure to ask how much it costs because we thought they cost $3 because they had a little sticker on it with Thai writing (our fault for not asking) and we thought the side dish (we ordered calamari which was really good) only cost $3 but it was actually $10. Relatively easy parking and cheap prices, I would definitely love to come back and try their other dishes!"]], "Araya's Place - Thai Vegan Restaurant": [], "Thai Boom": [], "Thai Deli": [["Jineen A.", "Just FYI this place is always rated a C in cleanliness. Although their food may be tasty, their sanitation is horrible!! Not too long ago this place was shut down for 3 months and they didn't disclose to their customers the reason for their shut down, it was due to a Rodent Infestation!!!!!! Definitely not worth it to me to eat at a place like this! Not only that, most of their selections are filled with grease almost anything around seems more healthy then this. Unfortunately on this side of town there aren't very many selections In healthy eats but this is by far one of the worst choices that can be made. After their re-opening management remained the same and their cleanliness doesn't seem any better than before, so unless you don't mind rats roaming around while your food is being made, I suggest not to go here."], ["Angel R.", "When you're shut down for a couple of weeks for an \"infestation\" (probably the neighbors), and people do NOT think twice about coming back, you know it's good!Oh that heavenly smell of perfectly cooked meat as you exit on State Street from the 101, how have I missed thee!Beef teriyaki with double mac, please."], ["Trenell S.", "Tasteless & dry & the beef was very tough, won't be returning even tough the service was good."], ["Elizabeth A.", "I enjoy coming here for lunch. The checkem is so great. I was pretty bumbed to hear they were closed due to a infestation. It's now a bit difficult to start going back. I really hope that if it was done sort if a infestation it is cleared by now, I need to feel comfortable in return back to order my regular. Either way. They are ver yummy and cheap on their pricing"], ["David V.", "They're chicken and beef teriyaki are my fave. And the Mac salad is bomb. I always come here for the teriyaki"], ["elvira g.", "Open again, But it was shut for down 2 weeks! Infestation! When it's shut down for two weeks, it's bad folks!!! Usually places get shut for 3 days for little things that possibly have nothing to do with infestation, I.e., water, faucets ... No biggies but when it's for 2 weeks, it's bad!"], ["H. S.", "This place was shut down on 6/10/2014 by the Department of Public Health because vermin infestation, very disappointing news."], ["Roman P.", "No other word or words can describe this place. Simply freaking delicious! Totally worth your money!"], ["Lola R.", "Health department closed it down for infestation. Omg! I ate here all the time. That's just gross. People like that shouldn't be allowed to serve food."], ["Jen A.", "I didn't know what to expect when my boyfriend brought me to this place because the inside of the restaurant looks very old and it's very small. Just few tables and chairs to eat in there. What had me wondering was \"is the food that delicious that it was packed of people waiting to order.\" Because the place doesn't look appealing, anyhow, finally when I tried the food it was delicious. I ordered the teriyaki chicken with double scoop of macaroni salad and I liked it, great flavors. I'm giving it 4 stars because they really need to paint the walls and remodel the place. Plus, the parking lot OMG! it took sooo long to get one spot to be available. I don't know if it always gets that way but I've been there 2 times and it's always been packed so good luck and enjoy your food."], ["Betsy M.", "Love Love Love this place I have been coming here since I was 9 years old. It never gets old, and always as delicious as ever! The chicken teriyaki is always tender. Never the less the macaroni salad is to die for, always creamy and never over cook. The other dishes are as good, but the chicken teriyaki is my fav! Double macaroni please!!!"], ["Bianca L.", "I've been coming here with my mom since I was in elementary. It still taste the same, but even better now that I'm older. My mom and I share the teriyaki chicken with double Mac. And when boyfriend and I come we share chicken teriyaki and short ribs with salad and Mac. My boyfriend has also tried the teriyaki chicken, pork, and beef and likes that the best. Their Thai tea is also very flavorful. Their staff is very happy, caring and helpful."], ["Sami B.", "Teriyaki plate with double macaroni good stuff!!Meat is excellent, teriyaki sauce is excellentWhen I'm working at USC/LAC hospitals this is definitely my to-go lunch/dinner spot.Samantha"], ["Amanda D.", "Right now the sign says it is rated  a B by the department of health. While I usually love thai, I have tried this place a few times and am not impressed."], ["Aileen C.", "I've been coming here since I was a child. I absolutely love their teriyaki chicken. Its cooked well done the sauce is amazing and the mac salad is delicious. The price has changed over the years but it's still a great price. It's a small place and usually it's busy but man oh man it's worth the wait. Only down side is that it's cash only. Friendly service though. Whenever I come back from school (out of state) this is one of the restaurants I have to visit asap. I'm getting hungry just thinking about it."], ["Susan B.", "I seriously  love this place.  Especially  during my pregnancies.  I've been coming here for  about  7 years  now.  Never  disappointing.  I love the  mac  salad and the short  ribs.  Gosh  my  mouth  is  watering thinking about it.  I guess  it is time for  a Thai  deli  run!  It's not  fancy. It's a fast food joint.  Don't  expect  anything  special just  really  good  hot  delicious  food.  Call in order is best and fast pick up and go home and enjoy your food!"], ["Frank C.", "I'm disgusted that these people did not value the loyal customers, because they did not take care of the problem until the health inspector shut them downWhat does that tell you about the owners"], ["Richard C.", "My sister was the one who got me hooked on this place! Thai Deli is not too far from our house which is a plus. She would bring by their chicken teriyaki plate and I was stuck on it ever since. I finally went in to pick up some food to go and was surprised to find other Thai specialties, such as Pad Thai and Pad See Ew, on their menu. The place is SMALL! (3 or 4 tables) I haven't got around to trying their other offerings but plan on doing so next time... I'm the type of person where if I know one item is so good I always settle for it each time I get the chance. The chicken is always moist, never burnt and dried out, and covered in luscious teriyaki sauce. The plate comes with steamed white rice, delicious mac salad and a green salad with French dressing with onion and tomato. Always a good choice!Cash only."], ["Sy S.", "What a strange place, a few pros and cons.  I like it and in the area there isn't much around.  Nice owners and people that work there are usually kind and pleasurable to talk to.  At first I didn't think they were really Thai based on the fact their menu wasn't purely Thai.  However, from talking to the neighbor (who is Cambodian) they really are Thai, so Kapun Kap Thai Deli!  You are bomb diggy!  PROS: Huge portionsCheap PricesThai food, but stretches all over Asia, has a bit of a Hawaiian flavor so a good mix of things to try and enjoy.  Sri Cha Hot Sauce on RequestCons: Horrendous parking, especially during lunch hourBit of a wait for foodLoud and lacks seating at timesCash Only I believeSalty and a bit over charred meatOily pad Thai All in all, great place for the area, thanks Thai Deli!"], ["Nadine G.", "#1 with double mac is amazingly good! It's chicken teriyaki, on top of white rice with a side of macaroni. So good I always buy another plate to take home. Good prices, generous amount of food, good service. They don't accept cards, however they have an ATM inside. Not a lot of tables to sit either :( and the parking SUCKS! But the food is worth it. I wish I lived closer to this place."]], "Luv2Eat Thai Bistro": [], "Hae Ha Heng Thai Bistro": [["S. P.", "This place gets a 3 star rating for two reasons. If you remove delivery from the rating, it gets 4 stars.It gets 1 star for delivery. The first time I ordered (both times were during non-dinner hours) the meal was an hour late.  I am located 1.1 miles from the restaurant. This was unacceptable but since I always give a restaurant a second try if the food is good (even though it arrived cold), I did.Well, on the second order, my food arrives an hour and fifteen minutes later, one item is lukewarm, another is cold.So basically they get a big fat ZERO for delivery,  HOWEVER.... the food is good so do not get delivery for this place, go there and get take out or order inside the restaurant.Items I've had so far that are really really good:Pineapple fried riceTom Kha soupYellow curry - mild (vegetables)Items that I've had that seriously need work:Spring rolls with tofu. They're TOO big, it should be three rolls with the same amount of ingredients, not two.  The way they add/cut their cucumbers, they end up breaking the fragile rice wrapper skin and finally, they don't' serve enough sauce (for delivery).  BUT they ARE tasty."], ["Lisa S.", "I ordered delivery.I have three words... no thank you!"], ["Matthew L.", "The food was awesome here and the outside second floor patio was a nice atmosphere given the LA weather. Only two servers working on a busy Saturday night. More servers would have caused me to have a four star rating. Ordered tropical iced tea, papaya salad, crab fried rice, ground beef wth a fried egg, and fried banana with vanilla ice cream. Food was great and prices are awesome. Hire one or two more servers please."], ["J K.", "Awesome scenery. Top floor so nice view. Car part is the bar and old fridge is room divider. Beautiful green cacti wall and lovely outdoor patio. Great menu with essentially a tasting menu for happy hour. Courteous server and very cool vibe. Tom yum was perfect for 2 ppl and well seasoned. Pineapple Thai rice was sweet and light. Panang curry was mild and served with roti!"], ["Nara K.", "Really cute interior, and great service!I really loved the Thai BBQ Chicken, super juicy and flavorful. Also had the Thai Fried Rice which was great. They have a happy hour from 3-7pm with Thai beers for $2!! Definitely coming back another time for that"], ["Jimmy S.", "I've indulged into this majestic meal and I'm ready to share this with the world; the wangs were orgasmic. The pat Thai was untouchable, but my friend, the one that ate it, devoured it with pleasure! Was so delicious, as he told us, that he still carries crumbs in his beard. Our free Thai teas were impeccably crafted with the finest glucose and Asian mastery. We are definitely staying for the free fried bananas! Bring your posse and get turnt"], ["Eugene R.", "Great atmosphere. Food was delicious. Ordered the Tom Yum and Pad Thai. Happy Hour 3-7 pm everyday. Plus you can order takeout or delivery. Will be back."], ["Sophano V.", "Great food and service when we arrived we were greeted and seated right away. Food arrived fast I ordered the beefjerky fried rice. First time ordering this dish and it was DELICIOUS!YOU WONT BE DISAPPOINTED The thai ice tea is also really good not too sweet like somenolaces but just the right amount of sweetness"], ["Sophie P.", "Green Curry was soso good! Highly recommend their lunch menu. I will come back for pad thai."], ["Esther H.", "Great atmosphere with their lovely patio.Overall, the food is pretty good.Their green curry fried rice is a must try. Tom yum soup is also really good:) Customer service is awesome."], ["Mocha C.", "The food here was pretty good I didn't get to adventurous in my choices( spring rolls and pad Thai) but it was fresh and seasoned well. The decor is very easy on the eyes, and the employees were very nice, albeit a little slow."], ["Yohan P.", "Beautiful setting interior and exterior, friendly staff, and really good food!This is gonna be one of my new favorite spots."], ["Aileen G.", "Pretty good place, I just finished eating here tonight for my friend's birthday. The food is alright for me, I ordered the Spicy Basil Crispy Pork and I prefer my food to be on the spicier side, so I'm glad that they offer the spice rack. The Drunken Noodle dishes are good here though. The service is very accomadating and that'd mostly why I gave this place a 4 star review. Our group was late to our reservation by 45min but they were very nice and served us quickly."], ["Audrey J.", "Green curry is a beautiful choice, but order a side of rice to go with. Spicy is not actually hot, it's a good aromatic level with depth. The roti goes well with the peanut sauce that comes with the spring rolls; the rolls themselves are nothing special, just a lot of lettuce wrapped up. The free Thai tea is pretty good."], ["Andy C.", "I only came here since this place got high reviews here on Yelp. I'm ordering takeout and the waitress offered a glass of water. The simplest things go a long way. Awesome ambience. Love the VW Bus as part of the bar!! Nice touch!"], ["Elon S.", "Sawat di ka!I Love the theme of these restaurant. The patio area is awesome. Inside they have this volks wagen van converted into a bar that you see in Bangkok. They play jazzy music, cool :)I ordered the Chicken panang curry. It taste good. It's comes with fried gyoza. The side of salad is not fresh, taste rotten. They gave me 2 slices of tomato for replacement. The owner is very nice and friendly.Khop kun ka!"], ["Happy M.", "I honestly don't understand the positive reviews. I've ordered twice from here and been disappointed both times by the blandness of the dishes."], ["Pascal S.", "This is the best thai place I have been too and they give you free dessert for a review! I mean it's one minutes work and you get a dessert!  Isn't that super nice! The ginger beef has a lot of ginger."], ["Stephanos A.", "Great food & drinks & service & view.Definitely recommended it if you are looking for a place to eat around K town.Free parking!Smoke friendly!"], ["Daniel H.", "They're open! Ever since they changed the restaurant from the previous one, it's been awesome. I ordered the pineapple fried rice, yellow curry, basil chicken, and pad see ew. All tasted really good. I would go again and again and again.I ordered online via Yelp and they had my order ready within 15 minutes. Amazing.Their lunch specials are also very good. $9 includes your choice of item, brown or jasmine rice, salad, and dumplings."], ["M. C.", "Incredible service! Probably the best part of coming here...but equally great is their happy hour! One of our favorite places to come."], ["Kailey F.", "Excellent cocktails. Highly recommend the Mojita and lychee martini! The portions are VERY generous. The chicken satay off the happy hour menu comes with not one, not two, but SIX skewers. Talk about the most bang for your buck!"], ["Yeoreen K.", "Okay... no.I came here 3 times and absolutely loved this place and I even advertised this place to my friends because I felt bad how underrated this place was!The food was still good but service was NO.I ordered for delivery & they said it can take up to an hour. I love this place so I said it's okay and waited about and hour and 15 minutes... and I called them. They said the food was made 30 min ago and the delivery guy left. This place is located on 3rd and Western and I was on 7th and Western. NO NOT FAR AT ALL. It does not take 30 minutes to come 5 blocks. It takes 10 minutes to walk from 3rd to 7th. They said they will check back and call back... nope they did not call back. We called 25 times and they finally answered saying he's on his way. He finally came after like 20 minutes and we checked to see if our order was correct. We asked if we can see and he gave a (wtf) face. We weren't going to tip him ever since then...1) he took 40-50 min to deliver.2) he was RUDE.So we said thank you when we got our order and took it. He asked to sign w his pen so I did, and he SNATCHED the pen away because he knew we weren't going to tip him. We called the place because the food was really cold and disgusting & the delivery guy was so rude. They said their manager was out to deliver so they'll call back in 15 minutes. We called back after waiting 30 minutes. They didn't answer for a LONG TIME.... then finally answered. We asked for a full refund and they gave it to us.I was really disappointed with this place because I only had good vibes from this place so I decided to order delivery from here without any doubt when my friend asked which place is really good... & this is what I got. Maybe, MAYBE I'll come back to dine-in but definitely not for delivery."], ["Felipe F.", "Great tasting Thai food. Hip ambiance and great for happy hour too.  Even my 3 year old loves it. It's definitely our favorite Thai joint in the neighborhood!"], ["Miso J.", "Great interior, good food, free parking, and good location.Cute decor and a fun place to come with friends.I recommend the pad see ew."], ["BunBun H.", "woah, this place is like a hidden gem. Good food with a nice decorationsI got crying tiger and the sauce was bomb. But remember to order a rice on the side. I would definitely come back here again.Though the outside looks like a normal dining place the inside is like a whole new world."], ["Adaeze N.", "OMG this place is amazing. Happy hour every day from 3-7. The sitting inside is nice enough but there's a beautiful patio or you can overlook all of Koreatown. There are heat lamps and lots of chairs and sofas it's a really relaxed but comfortable and cozy vibe. The entrees are pretty well priced, the portions are good, and god they're delicious. I recommend the salmon panang snowcrab curry thing and also the bbq pork noodle dish. We took full advantage of happy hour and got the Mojito the sake and the beer all super cheap under five dollars each. I highly recommend the fried banana and ice cream ice cream is really good and rich and the little banana yellow gyoza that  come with it are so bomb"], ["Derrick L.", "Flavorful food. Fantastic Happy Hour. I came with my girlfriend and ordered the Happy Hour appetizers. Each one was great. Shrimp rolls, eggrolls, crispy tofu. Then we ordered the yellow curry and pad see ew. The curry was deep with flavor and the pad see ew was delicious. Great place to pop in and have lunch or dinner."], ["Sheena P.", "I ordered the chicken satay and shrimp pad Thai for delivery. To my surprise they delivered 30 minutes earlier then expected which was awesome! The chicken satay portion was larger then I'm used to. The shrimp pad Thai was a good size and they don't skimp on the shrimp."], ["Jason P.", "Great atmosphere. The decor inside and outside the restaurant adds to a great dinner/brunch experience. Come for their happy hour menu!! The crispy fried tofu and beef salad are some personal favorites of mine but everything I tried here is delicious! Customer service is excellent as well."], ["Adren B.", "Ate here once with a friend the other night. Food was tasty and the ambiance was nice with dim lighting and jazz playing in the background. Decided to stop in today for a quick lunch and it's just as delicious as it was last time. The girl I was with enjoyed the presentation of the food as well."], ["Susan Y.", "Charming place for yummy thai food. We had ginger ginger with seafood and panang curry with tofu. Both were excellent. Highly recommend for seating outside terrace. Parking is in basement which is convenient. Only reason not giving 5 stars is a small crack/chip on rice bowl."], ["PJ B.", "I gave this place a 4 star. Overall, it is very nice and the food taste great! 4 star because to me, the food tasted like any other thai dishes... nothing extra special. But the place is really cool... they have an outside seating that is lovely. I would come back here again and try their other dishes.. maybe I will find something that tastes better than other thai restaurants. Location is good.. there is valet parking for $2. Service was great, friendly, not slow. This is a nice place for a date, too. :)"], ["Jose M.", "Order some pickup last night with some friends. The location was empty, because it was right as they were closing, but I loved the decor. Very hip and fun. The food though... Wow! Delicious.I had the Drunken Udon with Shrimp. It was amazing, though next time I would ask that they take of the shrimp tails.My friends had the vegetable Pad Thai, it's what they usually order from HHH, so they were more than satisfied."], ["Patomwong P.", "Nice decor & great Thai food.We had Yum Woon Sen which came out perfect taste.(With a medium spicy);-)"], ["Lori C.", "Ate at the restaurant and had food delivered, and on both occasions I wasn't disappointed. The pad thai and yellow curry (I only wish the curry was a little creamier) were great."], ["Sara K.", "Ordered take out - it arrived in good time, the presentation was good, (i.e not all mushed up in transit) the QUALITY was good and the portions generous.  I am happy to have found a good Thai delivery place.  I am looking forward to trying their salads next time."], ["Diane P.", "This place is delicious and the veggies taste fresh. I just wish they'd throw more in because they taste so good, especially the eggplant. They're pretty generous with the meat, tofu and shrimp though. On top of being good food, it's also a fun restaurant to eat in. And they offer delivery through eat24!"], ["ChoHee I.", "Great atmosphere, tasty food, kind staff, and reasonable price. It was my first time to try out here, but I would definitely come back."], ["Rafael C.", "Delicious food at a great price! The atmosphere is very rustic and mellow which makes your meal so much more enjoyable! I'm definitely coming back for lunch or happy hour!"]], "It's Thai Hometaurant": [["Katelyn E.", "I am a regular here and so are many of my friends. It's great for lunch or dinner and has good hours so it's always open when we want to eat at a random hour of the night. They deliver, which is an added bonus. I recommend their yellow curry and their red curry. I've had their pineapple fried rice, several of their vegetarian options and several of their soups, and probably all of their appetizers. I've never had a problem with getting my food quickly, the service, or the quality of the food. Overall, I'm just a REALLY happy customer!"], ["J. T.", "First time tryin this place. Decor is very nice, very vintage/thai style. Service is perfect! Ordered basil chicken w white meat. Flavor was awesome but next time i will def ask them to make it spicy. Very healthy clean taste and not oily like other places. Lots of meat, big portion.Ordered chicken curry w white meat. Flavor was super strong and tasty! Wish they had more potatoes in it. Their brown rice is great. Its like the purple kind. I believe its $1 extra.I will def come back. Also they are super clean, they dont just wipe the table w a wet towel. They actually wipe it w all purpose cleaner. Love it!niiice romantic patio seating. U can bring dogs.4 stars because its not something id crave."], ["Jason P.", "The only thing I have that's isn't super delish is the crab rangoon. But the curry and the black rice are amazing! By far my favorite Thai place in LA and the one reason I miss the east side."], ["R R.", "I have ate at alot of places, I usually get the Yellow Curry and Brown Rice. The Brown rice is super unique and incredibly good! I cannot complain one bit!! Every time i have gone it has been super Delish!"], ["Gregory H.", "Usually here for lunch and have always had a great experience. Always get the Priking and another dish.  Never had anything I didn't like.  Service with a smile."], ["Cynthia Z.", "I ordered delivery from It's Thai tonight for the first time, and it's absolutely delicious! The delivery was right on schedule, and the food was nice and fresh.I had the Beef Salad and the Chicken Wings. I'm extremely picky about meat, so I normally wouldn't order 2 meat dishes on my first try, but I was pleasantly surprised to find that both dishes met my standards! The beef salad (medium spicy) had bite-sized strips of lean, perfectly cooked steak, and the dressing was just the right amount of spicy. It was so good, I seriously considered saving the tiny bit of leftover dressing from the bottom of the box! The wings, in contrast, had a lovely sweet flavor. Great combination! They weren't too messy, and I didn't have to use an exorbitant amount of napkins. Not that I really mind that, usually (it's part of the experience!), but it was a plus.So, yay! Go to It's Thai!"], ["Anita L.", "Their cream cheese wontons were amazing, but their chicken pad see ew was subpar. Even though I told them to make the pad see ew mildy spicy, it should still have an abundance of flavor without having to make it spicy. It was kind of watery too. Portions are big though, as with most thai places... but that doesn't make up for lack of flavor."], ["Kellie M.", "I love this place. I have had delivery and I have eaten at the restaurant as well, either way it tastes the same. I love the pineapple fried rice I could eat that everyday. Their chicken wings are sticky but very flavorful. They always get the food to me fast and they package everything very neatly. I have had a couple of other Thai places around here but this is so far my favorite."], ["A M.", "Came here for lunch and got the Pad-see-yu (sp) special.  It included soup, salad, and an egg roll for about 8 bucks, not bad.   My friend and I also ordered a side of rice to share. It was alright.  I've had better Pad-See-Yu (sp), this one was a lil too sweet for my taste.  The salad was delish and I'm not sure what the egg roll was filled with but it was too mushy.  Thai iced tea was good, nothing special and I also had an order of bananas, those were DELISH!  Ahhh memories of that location. I worked at BK when I was 18 back in the day and I remember that It's Thai was Adelita's!  How time has changed.  We sat outside and straight ahead was that Homeboy Mini Mart, I think it is called, I was telling my friend that those were all sweatshops at one time... I miss the old Echo Park, however I enjoy some of the new restaurants and of course the old."], ["J F.", "It's Thai is no longer a restaurant I will got to.  They do not care about their customers and when trying to discuss a problem with the own I could not get a return phone call.    Having shared my experience with others I am learning that I am not the only frustrated patron. I have spoken to the staff twice about what happened and request the owner to call me, however its been 6 days and I am now done.  It is clear they care more about having cars towed from the parking lot.  Take your business elsewhere and save yourself the aggravation and disappointment."], ["Jesse O.", "Cute small place, thai fried rice was yummy!"], ["Mark V.", "Had the pad see ew delivered.  The delivery was fast and the food warm.  Food could be better flavored."], ["Theresa S.", "I had red curry with vegetables and tofu and it had a huge variety of vegetables including green beans and sugar snap peas and something that looked like a cross between zuchini and cucumber. veggies were not over cooked and they were also very fresh. i went back the next day and ordered it again!!! and had the spicy fried rice also , very fresh and delicious."], ["Mari S.", "We order quite a lot from these guys.Great service, and the dishes are fresh & full of flavor.I recommend it."], ["Jessie W.", "The food was GOOD.... Not the best. Head a little further down hollywood blvd for some actual amazing Thai places.But the customer service is HORRIBLE! After two encounters with the waitress, me and my mother had to get up and walk out before we spoke our mind about how rude she was! NEXT!"], ["Alina S.", "I love to go to echo park, it's a nice area. Last Friday I was craving for some Thai food and this place turned out to be amazing as the food, drinks and service were great. Would def come here again."], ["Jenny M.", "It looks nice it smells nice...but the customer service is really bad...the host walked to us and we asked for a table for four but we immediately left because no outside food was allowed...so our girls couldn't take in their food...food...shame on that...I see no problem on enjoying both foods i mean it's not like we were not going to pay for our food"], ["Billy P.", "Did dinner here family style. Got the yellow curry, pad see ew, and a fish dish with spices and basil called pra some rod.Food was very good, portions were good. The fish fillet was a bit thin, but very tasty nonetheless. They had an interesting selection of bottled beers from different Asian countries. I had a Saigon beer (Vietnamese) which had a quite interesting after taste.Service was great, very attentive. Location is small, but intimate and the decor was eclectic. Great spot with good food. Recommended for a casual dinner!"], ["Paul B.", "the pad see u was a little weird this time"], ["Dee J.", "No one is answering the phones, they've already charged me for my food and oh yeah I'm still waiting for my food to be delivered. It been an hour and fifteen minutes since I placed my order - WHERE IS MY FOOD?? Not happy about this - if my food ever shows up I'll adjust my review based on the quality of the food"]], "Thai Daily BBQ": [["Luis B.", "Love this place!  I moved far away and still make the monthly trip!  Been coming since it was. Small whole it the wall!Love the #3 fried rice double Mac!  Spicy shrimp soup is just the right about of spiciness with a little tangy flavor!  Over all food is great, only problem is very little parking and they charge you to use your debit/credit card if under $20!"], ["David V.", "I always come here for there combo number 6 is soo delicious!!!! The Mac salad is also bomb."], ["Yessi Jes R.", "This spot was recommended to me by my boyfriend. I ordered a  #6 which was ok. Also ordered  the fried wong thongs and I do not recommend those. They where supposed to be chicken wong thongs and didn't  have almost  anything inside and where  supper hard we tried to eat them but was impossible. The boba was ok."], ["Ernie P.", "I love this place.Delicious, always has been! Been coming here since it first opened, they even have a location near white memorial! It's first original location,I'm a loyal customer here, prices have gone up, the location has been expanded but the food is always delicious,The only down side?! PARKING it's horrible to find but once u finally find some it's worth it, don't want to drive there?! The do take out!  Delicious and worth the price!"], ["Julio R.", "The chicken was good ,  mac salad had way too much mayo, but that is just my opinion. I mean, I hardly like mayonnaise so ..but the service was awesome. Owners are really nice and that is how it should be everywhere."], ["Rick V.", "Great place ,,the portions they give is plenty the food taste very good a huge selection for you to choose from,,chicken,beef,pork,noodles,soup,,I highly recommend it,,"], ["Veronica G.", "Love this place, large portions with lots of flavor. They have a variety of dishes, so you're bound to find something you like. I have tried their chicken teriyaki,  macaroni, crying tiger, eggs rolls, spicy chicken,  chow mein, boba, and the list can go on and never been disappointed.  Parking can be a pain sometimes but it's worth the trouble I promise.  The staff are friendly. Beer is served.  It's super casual."], ["Armando L.", "#6 Is my favorite.It's soooooooo good! Although this is Thai , this beats all the Chinese food stores where there food sits there all day being heated by a lamp. I've never received a bad order. The chicken and beef is always cooked properly and the lettuce is never no fresh.If you want to eat good and get full , this is the place. People always say it's a bit expensive , but tell me the extra buck isn't worth it. I personally don't see where they get that from though. When I move out of the area , I will not mind driving to this location. I recommend."], ["Patty M.", "So i called to make an order for delivery and the man taking my order was really nice and polite and so was the delivery man. Great customer service. I ordered the chili chicken with rice, and shrimp tempura and not only did it look and smell good it tasted delicious!!! the sauce from the chilli chicken was perfect for the shrimp tempura, its a must try! This is officially my new favorite spot. Cant wait to try their other plates."], ["Neddy C.", "In the mood for noodles and decided to try the Som-ma-kuy (Sweet & Spicy Chicken over noodles) if i didn't have SO much sweet it would have been better.  Note to self next time order it with the \"sweet\" on the side!  The place looked cleaned and smelled good.  They sell beer... that's a plus and transactions under $15.00 get a .75 cent fee when using your credit card/debit card.  I was not a fan of my choice but I would stop by again and give something else a try."], ["E M.", "This place was recommended to me by a friend. \"The best Thai in LA.\" He tells me.  I think I need new friends....My wife and I were in the area for an errand and we decided to grab a quick bite to eat. I remembered that my \"friend\" told me I needed to try this place so I point my car in its direction.  I drive past it, looking for a parking lot, but see nothing but street parking. Maybe there's a lot in back. Drive down a tiny alley, no luck. Just when I'm about to exit the alley I see someone driving away from a street spot right next to the self service car wash. I busted a U and snag it. We walk over to the restaurant and it's kinda busy. I look around and see tons of what look to be locals. We order and go grab a table in the next room. First thing I notice.... It's really hot. We sit for a couple of minutes and notice a small group is leaving, so we grab the table they were using. Much better. Away from the windows and under a dusty ceiling fan. Huge difference. The dining area is large. A weird mix of chairs, booths and tables. Nothing really matched, but who cares right? The walls are super dusty, the tables were kinda greasy and the framed posters on the wall are super outdated. But I'm really just here for the food. Our order:Mixed Teriyaki PlateChili Basil ChickenEggrolls2 Thai Iced TeasHuge portions, screaming hot.... Smelled great. Couldn't wait for it to cool down to try it. The teriyaki- Chicken/Pork/Beef on over-cooked rice. Under flavored macaroni salad and a tiny green salad with Big Mac sauce dressing. Seriously, that's what it tastes like. It wasn't bad. Found a ton of gristle though. Every other piece of chicken had cartilage. Over all, still not all that bad. Chili basil chicken was just that over mushy rice. Lots of sauce. Very flavorful, but again, tons of gristle and cartilage. The eggrolls were underwhelming. Especially the watered-down S&S dipping sauce. The Thai Iced Teas (without boba) were very good. I noticed that they water down the sriracha sauce and they also water down the chili paste sauce. Fail. Overall still ok food. At least I thought.  We get about 4 or 5 blocks away and that's when my MSG allergy kicks in. Totally sucked. Never again. What did I learn???? The rice is way over-cooked and comes out mushy. They water down all their sauces. They use MSG.  This place is a locals spot who like the big portions and enjoy the boba drinks. They don't care if the parking sucks because they're walking here anyways. I need to stop listening to my so-called \"friend\"."], ["Angela G.", "The place is not much to look at, so I had never gone until my sister ordered a #3 for me and now every pay day that is what we eat. The love the food right there, I'm a big lover of thai food and for it to be a fast food thai place it's great!!!"], ["Amy M.", "I was really craving some good teriyaki chicken, so of course i go to yelp for some help. I found this place and i was excited to try it. The lady asking for my order was really nice. I ordered the teriyaki chicken with double mac:-) yummerzzzzz!!!! And i also ordered their cream cheese wontons and a watermelon boba drink. My meal was really good! It is heavy and served in huge portions. I shared this with my sister so it was perfect. I really enjoyed the wontons too!:-)The watermelon boba was light and refreshing. I will definitely be coming back when i am craving a good carb load!:-)"], ["Aracely B.", "Super friendly staff and great costumer service. I'm vegetarian and their menu accommodates to it: #27 tofu curry is actually spicy and the serving is enough for two and the option to make it more spicy exist. The pad Thai noodles will stick together after 15mimutes so not the best option for delivery or pick up. Great food and great price."], ["Priscilla A.", "This is thee spot for my thai cravings. Can never go wrong coming here. Only thing I hate is the parking (there is none) other than that the food is delicious."], ["Mimi M.", "This place is surprisingly good.  I love the fact that they deliver and their prices are very affordable.  We've tried their teriyaki chicken plate, the pad thai and the bbq pork spare ribs plate.  Everything was so delish! And amazingly, everything is nice and hot when it arrives at your door.  Portions are good too.  The thai iced tea is also yummy with the exception of the boba.  It coulda been a bad boba day but i wouldn't wanna risk it and try it again.  By the way, for those that are a fan of the teriyaki chicken plate from thai deli on cesar chavez and state, let me tell you, this place's teriyaki chicken plate comes pretty damn close!!!"], ["Laura M.", "#6 teriyaki chicken with double Mac, simply the best! Would like to try other items on the menu, but what I tried so far was delicious."], ["Vanessa R.", "Okay since yelp had good reviews I decided to try this place... wrong choice! !!! The food is not good except for the spicy seafood soup....The place was very dirty and hot! !!!! I will definitely never go here!!!"], ["Elizabeth B.", "**Good Food but CASH ONLY.   **I've updated my review from a 4 Star to a 2 Star.  They just told me they only take cash and that's not what has been the case the last 2 orders I've completed.  For delivery being the only option I am disappointed since I rarely carry $40 in cash. The following is my previous review:   I moved back to the neighborhood I grew up in.  I wasn't aware there was a Thai delivery service and after reading some of the reviews I decided on ordering:Beef Pad Thai, Orange Chicken and a Watermelon Boba.I've NEVER had Boba or pad thai.  The orange chicken is ridiculously amazing.  Not too sweet, crunchy and all around great!  I normally don't eat fried rice, but the one they sent with my orange chicken is... is... JUICY.  Never tasted it that way.Ok, I've had orange chicken from other places and have a way to compare.  The Pad Thai is my first time and it was good.  I will update once I try it from somewhere else.Now what is Boba?  *googles it*  Ahhh... \"balls of tapioca!\"  I LOVE tapioca AND I LOVE watermelon and this drink is YUMMERZZ!  I like my drinks super cold and placed it in my freezer for a few minutes and it was PERFECT!OH!  FASTEST DELIVERY I'VE EVER EXPERIENCED... 15minutes!!!Customer service was GREAT and the delivery boy was sweet too!*raises watermelon boba drink* Here's to MANY MORE 1st time experiences with Thai Daily BBQNext time I want to try their Korean BBQ.  AND... Did anyone else worry of sucking the Boba too hard and choking on them??  *Shifty Eyes*"], ["Jason F.", "Great place!! I'm sure a lot if these paisa don't know what good Thai food is. Cuz there are veggies but hey at least they try. Plus bobby the owner super nice guy!! Always takes take of me. Super clean super fast super convenient. Forever customer!"]], "Wat Dong Moon Lek Noodle": [], "Isaan Station Thai Street Food": [], "Bang Na Thai Fusion": [["Achyuth S.", "This place is a close walk from my apartment which is great but I'm not sure about the parking situation here. The place was really well decorated. I ordered the pad Thai and a Thai iced tea. They were big really good! The serving size is generous and can lead to some yummy leftovers. The service is usually good but they did forget my Thai iced tea until I reminded them. Besides that, it was a great experience. I plan on coming back!"], ["Chalene P.", "My first time here :D  My friends and I wanted to try something new around Chinatown. I ordered Bang na fried rice and Ramen Pad kee maow beef. They were pretty good expect Ramen Pad kee maow was a bit salty...but still good!"], ["Rachel W.", "Pretty much a disappointment. I should have listened to reviews and went elsewhere but was lazy and already in Chinatown.I paid $22 for some horribly executed fresh rolls and coconut water, I mean green curry. \"What are thooooseee\", I exclaim as I open the container to my rolls.The fresh rolls were 94% lettuce, a sliver of tofu and three carrot shreds. Completely disproportionate and unsatisfying. Not to mention the the peanut sauce was super thick and caramelized. I didn't know whether to use it as a dip or drizzle it over vanilla ice cream.The green curry had ok flavor, but was very watery and was splattered all over the place. It had no depth or creaminess to it. It looked like vegetables in green water.And I didn't understand the side of katsu-like chicken. It was already soggy from the curry at that point so I took one bite and stopped.The iced green tea latte was good and the waiter/cashier guy was nice so that's the only reason for the stars. With a number of other eateries in the DTLA area, I won't be returning."], ["Milkiiz P.", "I came here with my friend so many time. I like decorating and food here. I always ordered Pad Thai ramen was sooo good!! And Curry with Soft shell crab yummy. Waitress was so nice and super friendly. I'll be back soon!!"], ["Chris L.", "Bang Na does a good job with innovation.  The ramen kee maow (11) punches the mouth with amazing Thai basil flavor.  Just wished the portion was bigger for the price.  The Thai food market in LA is competitive with huge dish that are less than $10.The Bang Na Fried Rice (12) is a safe choice.  It's delicious, but nothing too unique.  The crab meat was good quality.The space is a bit sterile with a minimalist vibe.  But it's very roomy and parking is a breeze.  Will come back to try the other fusion items....and there's nothing on the Menu that makes this place Vietnamese.  This is purely Thai."], ["Khanh N.", "So, the restaurant was open when they were suppose to be this time. I'm glad I did not waste another trip over here. However, this is not their fault, but the parking meter fee is absolutely ridiculous, $4 an hour. I dropped a few quarters in and then decided to pay with credit card and I believe it cancelled out my quarter minutes. Someone let me know if you experience the same thing.OK. I totally went on a tangent there. LOL. My first impression of Bang Na is that it sadly smells like a dirty restroom. (Not like, OMG! I want to throw up, but that feeling that lingers in your head, \"What is that smell?\" irritable level) The service is great. She presented us with the menus, got us our drinks, served us our food in what was more than timely as if someone had cancelled the exact same order 15 minutes before us. We ordered the ramen pad thai with tofu, which was deliciously weird. It tasted like pad thai, but the consistency was so different. Also, not sure if it's because it was ramen noodles, but very dry. We ordered the chicken pad see ew. It is perfect, flat chewy noodles, but not too dry, not too wet, loaded with lots of chicken. Lastly, my favorite dish of them all, the SS crab curry. A crispy fried crab packed with its crabby flavors with an eggy, jalapeno curry sauce in the center. You'd think I'd drop a star, but I didn't. Stay open during business hours, Bang Na. You'd do fine."], ["Emily L.", "I really want to give this place 4 stars, cause their \"Chicken Pad See Ew\" was really good but sadly their \"SS Curry Crab\" was way too sweet and it was nothing special at all. It was just few deep fried soft shell crabs with some sweet curry sauce, onions, bell pepper and scramble eggs on top! (I know I can't compare with Thailand's curry crabs) but I still believe they can cook it better.Also I understand it is a new restaurant in town but they need to hire more staffs \"at least 2 more\" to take orders & serve food cause it really hard for one person to handle all these stuffs in the same time when it's busy!"], ["Esther L.", "Very disappointed in my food.  I got delivery and ordered the ramen kee mao and specifically asked for \"extra extra spicy, Thailand spicy!!\"  and it is not even a hint of spicy.  It's super greasy and oily.  Also got the spring rolls with tofu and it's the most sorry excuse for a spring roll I've ever had.  It's like 99% bitter lettuce and a few microscopic pieces of cucumber, carrot and tofu.  The dipping sauce is gross too, some kind of syrupy sweet and sour sauce which is way too sweet.  Would be better off with a savory dipping sauce."], ["Anne C.", "Love ordering them through Eat24. The ramen pad Thai made with Veggies is excellent! I have also had the fresh rolls with tofu, very good!!! Delivery is quick and convenient though the app. Highly recommend for DTLA!"], ["J V.", "When I first discovered Bang Na I was so excited that a Thai place opened down the block. Initially it was great food and great service. However the past 2 orders of my were pretty dreadful. Especially the last one. One disclaimer is that there was a new girl there and it was her first day. That usually isn't a problem for me, but what seemed like a simple order turned into a disaster.I called ahead to put in a to go order. There seemed to be something wrong with their phones so I hung up and decided to walk there to put in the order. They called back while I was on my way. I put in an order for ramen pad Thai with chicken but as I proceeded to order the larb buns the lady didn't know what that was. I said it's not a problem I'm almost there I'll place the order in person. So I order the larb buns, pad Thai with chicken, and the fried chicken curry. I said I'll come back in an hour to pick it up after my massage so make it closer to then. She said no problem and so I did. I came back to pick up the food after my massage and the girl had to manually enter each price onto a calculator. I put my phone # down for my 5 stars and the girl didn't know what that was about. I said no problem, and she said the guy in the back will take care of it. I walk back to the apartment and I'm starving. I open my food to find the fried chicken in the curry was soggy because they didn't separate the sauce and the chicken. The buns in the larb bun plate was soggy as well. And lastly the ramen pad Thai with chicken (which I saw her write down chicken, and she asked me several times that it was chicken) was actually tofu and it was extremely spicy. I called back to tell them they gave me tofu instead of chicken and they thought I was calling in to order to go. After a few mins the confusion cleared. The girl was talking to the person in the kitchen and she said she would have to call me back. At this point I was so frustrated with them that I said forget it and just hung up. I feel bad for the girl but damn where was the guy in the back the whole time? There was no one in the restaurant and he didn't even help. To top it off she didn't even put utensils or napkins in the bag. I don't think I would return after this fiasco partly on the mishap but also the food doesn't taste as good as it did before."], ["Maleerat P.", "My first time got a delivery from Bang Na. I called around 1 pm and they said it will take about 45 mins - 1 hrs. Less than an hour, my food arrived and it still warm !!I ordered shrimp roll and pad see ew with shrimp. They were pretty good except my Pad see ew was a little bit oily and the shrimp was over cook.. Not too bad! One thing I want to point out is the delivery minimum order is $17. For lunch time, if I want to order lunch just for myself..$17 is too much. I didn't mean too much money to spend , it is too much food to order. My pad see ew was $9 and I added shrimp for $2 . It was under $17.. So I had to add more dish to make the minimum.. So I added shrimp roll for my appetizer. It was too much food at lunch just for myself. I could n't finish all of it. And I don't like to eat the leftover for my dinner. I will order again if I can get someone to share my order.."], ["Mar R.", "Amazing food. Got the pad see ew (ask for it spicy) , chicken fried rice and a Thai tea. Two thumbs up. I'd put up more but I only have two. Give this place a try! Only didn't give 5 stars because we had to wait a long time for everything but it was worth it. Food was fresh, hot, and awesome."], ["Jenny V.", "First time here.My friends and I wanted to try something new.This place was close by. Came in, it was empty on a Friday night. The atmosphere felt uncomfortable. Seems like all the furniture were bought from IKEA. Poorly built, my chair was wobbly and the table that they sat us down was not even.Service, was slow and hard to talk to the waitress, as she seems confused.... We got the free Onion rings if we check in with yelp. Those were delicious! Love the batter it was dipped in,Ordered the Ramen Pad Thai, my friends really liked it. It was okay to me.Chicken thai basil, it was okay... with brown rice. Rice cost extra $2.Thai Tea, $3, was way to sweet.Really hated the plates they serve the food on. When my fork touches the plate, it creates this chalk board shrieks.... OMG!"], ["Carolyn T.", "Is this place ever open?! We've called in an order for delivery twice, and BOTH times they called us ONE HOUR later to cancel our orders. Both times they cancelled, they said it was because they were closing.. But it's only 8pm and they don't close until 9pm. We placed our order at 7:30..We also walked over there on a Sunday during lunchtime. We thought it would be a great way to exercise and then go stuff our faces. One mile later, we get to Bang Na and the doors are locked. We were greeted with a paper sign on the door that said they were closed for that day and would reopen on Monday. I don't get it, does this place just close whenever they want? I don't know, all I know is that now I'm hangry and Bang Na should change its name to Eat, Na. Cuz Na, you ain't gettin no food."], ["Lester K.", "This place is my new go-to Thai restaurant for food delivery in DTLA. Online ordering was convenient via Eat24 and the restaurant's delivery staff was professional, friendly, and efficient. The food was packaged in a responsible and spill safe way. The Pad See Ew noodles I ordered melted in my mouth and were probably the best I've had of any Thai restaurant in DTLA. The shrimp rolls were presented very nicely and tasted fresh. And the Thai Ice Tea I ordered had the perfect balance of sugar and spice - which is difficult to achieve in my view since I generally find Thai Ice Tea too sweet for my taste. Will definitely order again! Prices are reasonable, the order minimum is $15, and the delivery fee is minimal."], ["Kaori S.", "I ate ramen pad Thai and green curry. They are super delicious all of them!!!Actually I'm vegetarian so they can cook it for vegetarian. This restaurant 's interior is pretty good! Its clean and cute. I had fun!!!:) I'll be back again."], ["Tina H.", "The customer service was amazing best I had in a while loved the atmosphere!!  I'll recommend the Raman Phad Thai it was delicious!  Perfect place for a date when in Los Angeles. Loved the interior design it was super modern. Overall I had a great experience here."], ["Briana S.", "Was walking to lunch into Chinatown and happened upon this new spot... the menu looked good, so we took a chance and headed in. What a treat!Ramen pad thai... wasn't sure what to think, but it was delicious! The ramen noodles are a nice twist on an classic Thai dish.The green curry was a bit spicy for my taste, and came with a side of panko-crusted chicken breast. The rice is a side order and is not included.We finished off with the fresh rolls, which are a vegetarian take on the rice paper rolls seen in many Vietnamese restaurants. In lieu of pork and/or shrimp, these have tofu.Thai iced teas were on point, and served in mason jars.Service was friendly, lunch was quick and the food delicious. A win in my book!"], ["Mui K.", "I have been wrestling back and forth on what to rate this because I like the decor, ambiance, service, and concept but something was a bit lacking for me.   I think I'm going to go with 3 since I honestly feel it was A-OK.Food: Since the restaurant is labeled fusion, you can expect it's a twist on the normal Thai cuisine.  I think while it does do some things differently, don't expect too big of a departure.-Fried Shrimp Rolls:Fried well, tastes good.  Kind of your normal fried appetizer, nothing out of the ordinary.-Ramen Pad Thai:Not bad.  The ramen gives it a chewy texture so that is different.  I didn't dislike it, but I didn't particularly love it either.  I might have to say I prefer my pad thai with the traditional rice noodles.-Soft Shell Crab Curry: Fried well, nice and crispy.  Served with scrambled eggs and some veges with a nice curry taste.  It's mildly spicy and a tad salty.  I think next time I'll order a side of rice to go with it.  I enjoyed the salty/fishiness of the dish but I think it's something that well go well with rice.  This dish is truly a nice fusion dish.-Roti: Dessert roti with some whipped cream.  It looks almost like a green onion pancake so it surprised me when it was light and crispy.  I thought it was nice, but I wouldn't order it again.  Service: Really really attentive.  I believe since they just opened they were really trying to provide exceptional service and kept checking on us.  They even brought us free dessert.  However they do need more time to iron some things out (i.e. forgot to bring one of our drinks, was confused on how to split the check, etc.)Price: Very reasonable.  We ordered a lot and it came out to about $20-25 a personParking: Street parking.  There are some small lots and some metered parking.  Free metered parking after 8p!Overall: If I lived or worked closer I'd probably stop by for some Thai food but I would not make a trek for it."], ["Jackie O.", "Ordered the crispy noodles with white sauce to go. Service was good, prompt etc. The food left a lot to be desired. It was $14 for a small container. The dish is quite heavy which isnt super clear until you see it. Deep fried rice noodles with some kind of white sauce. Not sure if its curry white sauce or bechamel or what. No veggies in it. The texture of the shrimp was fine immersed in the sauce. Didn't see any of the garlic. However the chewy softness of the calimari would have been better suited for the fryer than the noodles. Ambitious effort but na..as in na I'm good. China town is gentrifying but there's still enough places to where you can get your money's worth in really good food."]], "Khao Soi By Inthanon Thai": [], "Esaan - A Taste Of  Thai": [["G W.", "As always the food was tasty, the service awesome and the owner as wonderful as can be. Love it****This is a LUNCH ONLY*****"], ["G B.", "I usually pick up lunch and bring it to my desk because the seating is extremely limited (outside only).I have ordered all of the bahn mi sandwich options.  The traditional Vietnamese and Japanese versions are good, but stay away from the Thai version.  The peanut sauce does not pair well with the pickled veggies.  Even the Japanese wasabi mayo is suspect, but I love wasabi.  Thier smoked tofu is a new alternative for vegatarians and has a unique flavor that is a must try (for the non-meat eaters).Their Pad Thai Salad is a great spin on the traditional noodle entree.  I had it with shrimp, and it was delicious.  If you like salad, then this is the dish for you.Tom Yum soup was flavorful, but lacked in the amount of veggies.  It seemed like just broth and shrimp with a mushroom here and there.The service is always great with friendly hello and a smile!"], ["Patrick S.", "First visit, ordered the lemongrass steak w/ quinoa.   I'll add the girl at the counter was super friendly and pointed out what's popular.Star worthy:+ Steak is advertised as grass-fed and was decent quality+ Black quinoa offered as an alternative to rice+ Cucumber salad was delicious+ Good quantity of steakMissed the mark:- Hot steak on top of cold quinoa & broccoli was confusing.  I thought ordered from the hot menu?- Steak could use a sauce or additional marinade option.  Maybe a house chili sauce?Next visit i'll try a salad and post an update."], ["Adrianna A.", "I go here because it's across the street from work.. Generally feel its WAYYY too expensive for what you get. I get it.. organic blah, blah blah.. but still. Portions need major help. The Shrimp Tom Yum Soup is delicious - I add sprouts and overpay for those. Pad Thai is so-so ... I like the Yellow chicken curry, but I generally feel crappy about spending $9 on Potatoes, Brown rice and 3 tiny pieces of chicken. (Oh I got 5 tiny pieces of chicken today! Must be the Monday special!)  Shrimp spring rolls are also a nice healthy treat. Generally just Ok. If there were more variety around 5th/Grand I'd never come here again."], ["Tim C.", "I stopped in and had the chicken and red curry with brown rice.  Quick and friendly service and the food was great! Cost was $8.50 with no drink."], ["Lily T.", "Came here for lunch since I work across the street. The menu is limited to only a few items each categories (salad, sandwich, and curry). I ordered the banh mi beef sandwich and soup combo based on yelp reviews.  The soup was very sour and had a strong smell of fish sauce.  I normally love fish sauce and put too much in my food but this soup somehow smelled funny to me.  I didn't taste much flavor in the soup except the sourness and the weird fish sauce smell. The banh mi sandwich is a little better but the beef is on the dry side and too chewy for me.  While I was eating this, I couldn't help but thinking that I could have a much better sandwich for a few dollar more if I had just walked 50 feet more to Mendocino Farms down the street. Overall the food is so so and the service is not great.  Don't think I'll be coming back again."], ["Maggie C.", "Yelper Marilou C & I took yelper Juliet R for her birthday lunch.  I had high expectation of this place and I was very disappointedThis new restaurant had outdoor seating and daily menu.  We placed the order at the register and picked up the food when they called our order number.  The place looked like typical assembly line-type sandwich shops, similar to Subway, Quizno's or Togo's.It was my fault.  Why would I order banh mi (Vietnamese sandwich) @ a Thai restaurant located in downtown LA? Chicken Satay Sandwich:  One of the worst banh mi I've had.  The bread was stale, not crunchy like other fresh baguettes I get @ Mr. Baguette or Lee's Baguette.  Banh mi usually comes with very thinly sliced carrots and daikon.  My veggies were super huge and weren't pickled.  Satay is a Southeast Asian dish and this place messes it up pretty bad.  I grill my own satay and it's much better than this satay.  The chicken was too big and dry that I had to ask for extra peanut sauce.  My peanut sauce was watery.Lemongrass Lemonade:  I liked this much better than my banh mi.  It was very refreshing and good.I walked out starving because I forced myself to eat half of the sandwich.1 star for the lemonade!!Esaan is not yummylicious!!!"], ["Karin D.", "I always order their pad thai salad, no carb, and with the smoked tofu - just delicious and a healthy option for lunch.  I'm never disappointed...I guess I should try something new next time I go - hahaha"], ["Julie L.", "On the fence....but 2.5 stars.I'm intrigued by Essan...but not with the food I ate...but by the other items on the menu! From pad  thai salad, panang curry to lemongrass lemonade, the menu maybe a bit small, but I like the different options. This week they also had a brown rice salad and a melon tapioca drink as a special. The melon tapioca looked so refreshing on a warm day. What I ordered though was...kinda meh.I ordered the half sandwich + side combo and got a steak satay sandwich (banh mi style) with a cucumber side salad ($7.50). Satay steak was rather dry and chewy and they should have been more generous with the peanut sauce. It was seriously lacking. I'm pretty sure it wasn't the peanut sauce that made my french baguette break apart after 2 bites. No bueno. It made the sandwich really messy. The pickled daikon and the carrots were wonderfully refreshing but cut too big and crammed into the sandwich. It might have been the juices from the pickled veggies  that made my bread soggy too.The cucumber salad was pretty good and pickled just like the daikon and carrots (sweet and tangy). Portion size for both and the sandwich and the side was really good. They don't skimp.I would come back, atleast to try the other things on the menu. All the food looks really well-flavored, it is just the execution that maybe lacking, atleast on the sandwiches. Really small space and very limited seating, gets kinda crowded at lunch but the line moves fast. Open only during weekday lunch time!"], ["Cintya P.", "I was waiting for the Rapid Metro Bus with my boyfriend, since we were headed to Santa Monica, when my stomach began grumbling. I turned  around and realized Esaan. I walked inside and saw that their good looked fresh and delicious and it was busy lunch place. I ordered two spring roll orders, one tofu spring roll and one chicken spring roll and an order of their Thai iced tea. The spring rolls were fresh, the bean sprouts, lettuce, and basil where crisp. The Thai iced tea was not sweet, just right, and delicious. Best Thai iced tea I've had in so long!I will be coming back to try their banh mi!The customer service is great! Very hardworking and friendly staff here.  A very clean restaurant. They have a small patio and limited seating in the inside."], ["Ceci V.", "This is the second time I've eaten here, both times got a salad with beef, to go. First salad was just OK. Beef was strange, barely edible. Today, having somehow forgotten about the first time, I went back and had the pad thai salad with beef. The pad thai salad itself was okay. Despite not being made with the traditional noodles, it was pretty tasty. It was a little 'wetter' than I expected, but the salad itself was otherwise decent. I really wanted some crispy veggies, and the quantity of bean sprouts and cabbage (more than noodles) was just what I had in mind. The beef, however, was repulsive and utterly inedible. In my first bite, there was untrimmed fat. I picked it off and ate the beef. Ugh. Tasted like straight up cow. Like I just bit into a cow. Overcooked and on the salty side, too. I don't know how they marinate and cook it, but whatever they do, tis' no bueno. Or maybe the beef was old? Or not even beef? I texted my sister (a big proponent of grass fed beef) to ask her if it tasted different from non-grassfed beef. Nope. If I was eating it there, I would have asked for something else, but alas, I ate it at my office, about .5 miles away. So gross beef goes into the trash can. Fool me once...fool me twice..."], ["Keerati J.", "I come here twice a week. Always get the market green salad, green curry and panang curry. The food is clean and very healthy. My boss is also hooked on their salad. Portion is good for the price. Excellent place for lunch if ur in downtown la."], ["Sing Sing T.", "I work in downtown and tried this place and got the steak satay sandwich, came out to be like 9 bucks with no drink. I ate it the meat was beef stew from pho meat and it was not good. This place is overpriced and the food is not good. I rather go to lee sandwiches and I don't even like lee's"], ["Christine D.", "Tried one of their weekly specials which was spicy pork with eggplant and basil - very tasty especially with brown rice!  It comes with lots of gravy and sauce so it pairs well with the rice.  A bit spicy if you can't handle spiciness but overall yum and a decent sized portion for lunch!"], ["Marie S.", "Really liked the vermicelli salad with steak. It tasted fresh, a huge portion, and worth my money. It's also a good break from everything offered downtown. Small but nice seating area outside to people watch. And definitely going back to try the other offerings!"], ["Steph C.", "Esaan is one of the closest lunch spots to my office, and I've gotten food there many times over the last couple months.  When I first found it, I was thrilled.  It's fast, easy, and occasionally, I like to mix up my continuous rotation of Mendocino sandwiches.  I still go about once every couple weeks, but I'm less enthusiastic now.The place is very quick and convenient.  If you see a line out the door, don't even sweat.  It takes no time to get to the register, and once you put in your order, food comes out fast.  Service is consistently cheerful and competent.  There's limited seating, but I almost always take out.  Prices aren't exactly cheap, but they're fair enough.  You get out for $10 or under if you don't tack on sides or drinks.  I've sprung for a drink once - a green melon tapioca drink - and I liked it.  Worth getting if you're in an indulgent mood, sweet and refreshing with coconut milk, cantaloupe, honeydew, watermelon, and tiny seed pearls of tapioca.The best thing at Esaan is the steak banh mi, a solid version of the iconic sandwich.  The bread is crusty with a good chew, and the pickled vegetables and spicy mayo are great with the meaty steak.  I haven't tried this with chicken, and I never will.  I once had the satay sandwich with chicken and it was borderline terrible.  Where the banh mi flavors popped with spice and freshness, the satay sauce was bland and goopy with a dull peanut taste.  The chicken was also not good, just dry and flavorless.  Even the bread tasted stale with these sadder insides.  If you're in a sandwich mood, don't stray from the steak banh mi and you'll be happy.  I like to go for the combo, which gives you half a sandwich and a choice of side.  The shrimp tom yum soup is delicious, a thin aromatic broth with a lot of mushrooms and cilantro.  I would pass on the cucumber side salad.  You can also substitute spring rolls for an extra charge if you ask, but I don't love the spring rolls here.  Thick gooey skins, too much raw bean sprout on the inside.  It doesn't help that the chicken I had in mine was the same dry stuff as in the sandwich.The chicken works, though, in Esaan's curries.  I guess the stewing process imbues the chunks of meat with flavor and lets them get tender.  There are always a couple curries on the menu, a yellow curry and a rotating spicy curry of the week.  The yellow curry is quite good, mild but not without character (and frankly, a little bit of heat).  The curry is milky and flavorful, and it soaks well into the rice and chicken and big hunks of soft potato.  I've had two of the spicy curries, which do recur often.  I like the panang curry with chicken, red pepper, carrot, and jalapeño. It's spicy, tasty, and very satisfying.  The red curry with chicken, bamboo, and Thai eggplant is also a winner, less spicy but still hot and delicious.  I get all my curries with brown rice, and it's decent brown rice that takes well to spoonfuls of curry.I've learned not to stray from the steak banh mi and the curries.  I was very sorry after the satay sandwich, and I really disliked the pad Thai pasta salad.  This came with a seal of approval from Serious Eats, but it was kind of awful.  The spaghetti was bland with an out-of-the-box texture, and the most flavorful element of the salad was probably the unpleasant mass of raw bean sprouts.  Otherwise there was peanut, cabbage, cilantro, carrots, and a tangy but weak dressing.  I got the salad with tofu, which was another mistake.  Esaan's tofu is that rubbery strip kind that crumbles in a weird way while you chew.Now that I've learned all my lessons, I do well whenever I go to Esaan.  I stick to my favorites and never get tempted to stray.  You can't go wrong with the curries or steak banh mi, but don't say I didn't warn you if you get curious about the rest."], ["Tammy T.", "I'm a huge fan of pad thai and pad thai in salad form sounded like a refreshing alternative perfect for lunch! (And sadly Esaan is only open for lunch). I came maybe thirty minutes before closing so it was not crowded. They're located right by the U.S. Bank building. I ordered the pad thai salad with beef to go. It came stuffed in a clear plastic container with lots of veggies and meat! Most ingredients were the same as those found in pad thai except for the noodles. Instead of the semi-translucent flat rice noodles they use something more akin to al dente spaghetti noodles. To be honest I was a bit sad at first, but that type of noodle holds dressing better. Service was okay and I didn't have to wait too long for my food."], ["P P.", "This is a pretend-to-be-Asian restaurant catering to yuppies that do not know what real good Asian food is like. Their food is bland, weird tasting and very disappointing. If you are looking for authentic Thai or Asian food, STAY AWAY. I had a chicken sandwich, it was nothing like the authentic Vietnamese sandwich I expected. It was huge with a ton of tasteless chicken. My colleague had a special salad of the day and it was aweful. We usually love Vietnamese and Thai food but this place was a big disappointment. The lack of seating space is a huge turn-off too.Will not be going back, it's a big shame as there are very few Asian restaurants (admittedly most of them are pretty bad) in the close proximity."], ["Tiffany D.", "Great lunch option for dtla. Food is consistently pretty good! Not blow your mind, but definitely good enough to spend your hard earned cash on.I really liked the steak banh mi (sandwich). Delicious! The tom yum is supposed to also be mind blowing. Thai iced tea was respectable too.Nice little patio in the sun to enjoy a little R&R before heading back to the office."], ["Katherine W.", "My my, all these 5 stars.  Lemongrass grill chicken with garlic rice.  The brown rice is fine, the lemongrass sauce that you pour over is very good.  The chicken, however, is another story.  It's so dried out, it's as if they used the chicken to make soup stock and then took it out once it's devoid of all moisture and flavor, and cut it up for this dish.It does come with a side of cucumber salad, which is nice.Prices are a little high for what you get.  But I'm pretty sure I'll be back because it's so convenient."]], "Palm's Thai Restaurant": [["Matthew T.", "One of the better lunch specials for Thai. From 11am until 5pm you can order lunch and get pad thai or pad see ew at $6.25 each. $15 is the minimum for lunch deliveries and also the minimum to use credit card according to the delivery guy.I was very satisfied with their service. I called around 4:40pm and they delivered quickly. As far as the food, I really thought the pad see ew stood out more than the pad thai. I think it is one of the better cheap pad see ews I've had. That goes for Thai in Hollywood too and considering Hollywood is pretty much the scene for Thai food.Their Thai Iced Tea was good but wasn't memorable. I'd put this place over Nat's Thai nearby and under Hoy Ka so far."], ["David C.", "I had a wonderful experience at the Palms Thai Restaurant, and their food is too die for! First thing we ordered was Thai ice coffee. The best coffee ever! So much flavor! For food we ordered calamari, pad see ew, green and red curry dishes. The calamari was good but we preferred having it serve with lemons. Maybe a little more crispy would've been better also.The pads see ew was so good. I would've been fine with just this dish. The beef was cooked with perfection and the noodles were cooked well. The green curry was very sweet! I prefer my food salty and spicy! The red curry was the way to go. Both curries had a good variety of vegetables, and you can tell they've been cooking with the sauce boy! #0to100 lol.The service was good, but a little confusing since we had two different servers."], ["Chris M.", "Very busy and popular spot. Been coming here for a couple years now and tried over a dozen different items, all have been good. Good prices on great tasting food, though they do seem to be cutting back on the proteins a little bit. Service is a little odd, ordered 5 dishes and all came out about 5 minutes apart from each other, kind of a bummer when dining in a group. Service is always fantastic, very attentive even on a busy Friday night, Aloha"], ["Irena A.", "It's my must eat place whenever I visit LA. My parents took me to this place when it was just a small restaurant in Thai Town and it's been a joy to see this restaurant grow! Chinese Broccoli and crispy pork is my favorite dish along with the seafood soup! It's truly a Hollywood gem!"], ["Alex K.", "I came here for a late dinner a few weeks ago with a friend.  We were hungry from working on a project, and since we were in Hollywood, you might as well get Thai.I ordered a papaya salad with salty crabs. The papaya salad was ok, but the salted crabs were just overpowering. They also had a brininess that was borderline fermented. I'm sure it's the way it supposed to be made, but not balanced.I also ordered the spicy wild boar. Crazy hot and spicy, Szechuan influence with large strands of peppercorns and dripping in oil.I didn't see the Thai Elvis; is he still a thing?"], ["Tryphena D.", "*5 stars* I haven't had a meal this good in quite a while!!! After a very nice first-time massage at Sparadise, I was ready to eat. I saw Palm's Thai when I pulled up for my massage and decided that's where I would eat when I was done. I quickly proceeded across the street and was in for a surprise in a couple of ways. The ambience: The space is MUCH bigger than it appears to be from the outside. I expected it to be tiny, considering the other establishments nearby, but that was a misconception. Bamboo tables help keep the decor consistent with the food served. That's important. A lot of restaurants miss that. Don't be a sushi restaurant without a stick of Japanese inspired decor. It doesn't make sense. I noticed a large Elvis Presley statue and what looked to be a Karaoke stage. There were CD's behind it, so that's my assumption. The service: Our server was on top of it! Our drink orders were taken almost as soon as we sat down. We were impressed by the menu. It's almost overwhelming. I did appreciate the way it was sectioned off; soups , salads, fish, noodles, etc. They have lunch specials from 11-3pm. I'm not sure if that includes weekends, but it does include holidays since I dined here on Presidents' Day. After a few times of our server coming back and forth, we decided. We ordered sweet and sour chicken (a mainstay with me whenever I eat Thai--I just love it), Pad Thai, Seafood Combo and a soup that resembled Tom Yum. Our order came out no longer than 7 or 8 minutes after we gave it to our server. Fast!  Pad Thai- I'm not always a big fan of this dish. However, this was excellent!!! It had hints of smoky and almond-y flavors in there and the chicken was tender and moist! Yum!Tom Yum- Very good! Crisp and extremely fresh! Other restaurants' Tom Yum is so heavily spiced, it makes you want to choke! This was very smooth. The tomatoes didn't come with it and I like tomatoes, so for $1, I added them in there. Seafood Combo- An unexpected order. I saw this dish once I was done placing my order and threw it in there. It was chocked full of squid, clams, scallops, shrimp and imitation crab! I didn't feel cheated; there were no carrot and zucchini fillers thrown in there. Sweet & Sour- They accomplished something that other restaurants cannot master: not making the \"sweet\" taste like table syrup or Agave. It didn't give me a super sweet or sugary sweet taste. It truly was sweet and sour. I loved it.Parking: there's a parking structure located in the same building as the restaurant. The valet fee was low, $1.50; I don't know if that changes with busier times though.You have to buy rice, it doesn't come with the meals. I thought that was odd. Other than that, this was a great, affordable, Thai meal! I didn't even Yelp! this place. I just knew I was going to eat here since it was across the street from my original destination. I see it is a fan favorite for many and now it's a favorite of mine, too. I was pleasantly surprised!"], ["Regina O.", "Came in last night after Create with some friends and all our dishes were only $7-$7.50!  Score!  The food was good, decent in size and all came out pretty quickly after ordering.   The only thing I question is that when I ordered my beef pad see ew, I asked the waitress to make mine spicy and she said that they are unable to do that?  What kind of Thai restaurant cant make their noodle dishes spicy? -__- She brought out the spicy sauce on the side for me but it's just not the same!! I've worked in a Thai restaurant before so that just seems unheard of, but oh well.  Not thaaat big of a deal, I suppose :P"], ["Tuyet H.", "Their positions are huge. That being said, I'm glad I can bring home Togo for a later consumption because it's pretty good. & the fact that they're open pretty late, definitely a plus. Pineapple fried rice with shrimp: 5/5 they don't skimp out on the shrimp and the flavor is pretty strong. I wouldn't mind getting this againTom Yum soup with shrimp: 5/5 I can consume this entire soup as a meal itself because this is definitely my favorite thing to order at Thai places. The portions huge and it doesn't taste watered down like other places. Again, they're really generous with the amount of shrimp they give you. Tom yum kha? (the coconut milk soup base one): 3~4/5 hmm....  I'm not fond of milky and zesty soups so it's kinda a no go for me.  My taste bud was kind of confused as to what I was consuming lol.  It's not that it was disgusting,  it's just a strange soup for my liking. It's basically the Tom yum soup with coconut milk added to it. Between the two  I'd stick with the one without the coconut milk. Parking: 4/5  validation in their parking structure for $2 I believe which isn't bad considering you're in LA. Service: 5/5 they were friendly and thorough with questions I had. Even gave me honest opinions with things on the menu I was curious about."], ["Lynda N.", "I love this place! Really affordable Thai food with a great atmosphere and entertainment! The waiters and waitresses are really attentive and the food is always really good.Their pad Thai isn't as soft as others and I love the sauce! Slightly tangy but not overbearing. The pineapple fried rice is also a must. The cashews add a really nice texture and the raisins aren't sweet to make an aversive taste difference. The green curry is my favorite because I love basil but the roasted duck curry is delicious as well! It's basically red curry with duck haha. Everything was so filling but the best part is how cheap it is! Almost every dish except the seafood items are under 10 dollars and the portions are big. I have yet to try their desserts because I am always too full by the end of dinner but I will try to next time! I loveeee mango sticky rice so it's on my list."], ["Jeff K.", "i can see why people like this place.  the food is pretty cheap and extremely flavorful.  however, i don't think i can give this place 3 stars.  the service negates anything good about this place.  we came here on a sunday night after a show at the pantages.  i wouldn't say it was packed, but there was a good amount of people eating.  we got seated fairly quick.  we got the coconut soup and the pad thai.  both items were delicious, however, the pad thai came with more bean sprouts than noodles.  however, the sauce for the pad thai was phenomenal.  the service is what this place is notorious for.  they forget items (drinks, rice and check)... and they never come by to ask you what's up.  i really wish the service would get a lot better.not to mention, they have a security guard chilling near the front... i wonder what happened in the past to warrant that. another weird thing is the little cups that hold the sauce.  they are hard as fuck to open.  i don't know if its the greasy or the design, but getting sauce from those canisters require you to have a steady grip... or maybe i have butter fingers...lol in the end, order to go if you must.  the food is awesome, the service sucks."], ["Za Warudo J.", "Great food, great service, festive atmosphere.Came here on a whimp last week before the Seinfeld show.  Was incredibly surprised how good the food was as these Thai places with live music many times only have passable food.Order Penang and some fried rice dish.  Meat was cooked perfectly and so was the rice.  Flavors were great.Service was professional warm and friendly, left nothing to complain about.  Would definitely come back again."], ["Susan C.", "This was a pretty decent Thai restaurant. I ordered the Beef Pad Thai. You can't really go wrong with that. I had the lunch special it wasn't expensive and the portions were big so I took it to go. Overall  I give it a B rating."], ["Jennifer W.", "We came to Palm's Thai for lunch. The new location has structure valet parking for $1.50. They are most famous for having a Thai Elvis perform in the evenings. The restaurant is huge and filled with all sorts of decorations (carved wooden cats, even a giant Elvis made of mechanical parts). Our party of six ordered Thai iced tea. Each glass was a little inconsistent with the amount of milk/cream we got (each glass was a different color). Each dish (lunch special) or regular was a pretty small portion. Even a small eater like me didn't get filled up by my own dish. I got the \"Boat Noodles,\" which they call Thai beef noodle soup. It had more ingredients than actual noodles. Would have been nice to trade some of the liver for noodles!I tried a bite of some of the other dishes my party ordered:- Garlic Chicken - it was served with rice and a tad sweet - forgot the dish's name, but it was minced chicken - it was just meat, no rice or lettuce to wrap with it. The meat was seasoned a little salty, but the spicy element was good. - Green Chicken Curry - it was just chicken and some slivers of bamboo shoot. The curry itself was on the sweet side. Overall the food and service was just average. Maybe you get a better experience from the dinner crowd when Thai Elvis performs? There are so many places in Thai town to try. I might skip this one next time. Yelp 100 Challenge - 27 of 100"], ["Tiffany H.", "I used to come to Palms all the time with my family. This place was our go-to spot for Thai food. Our last visit here was a little disappointing though. We ordered the shrimp cake, fish ball noodle soup , coconut soup, pad Thai, shrimp fried rice, pad see ew, and the Thai tea smoothie. The shrimp cake is fried in Panko crumbs and is usually a crowd favorite. However, when we ordered it this time around, we found the shrimp cake to be lacking the correct consistency. It was too soft. Not crispy. The coconut soup was very sour. Didn't really get the rich coconut flavor. The pad see ew was overly sweet and the pad Thai as well. We were quite disappointed with the way our food came out and everyone left quite thirsty. Way too much salt and sugar put into our food. We never experienced that before coming in the past! Such a surprise because I know they pride themselves on being no msg and no trans fat. I really do hope it was just an off day because I love coming here to listen to music and enjoy Thai food."], ["Lam S.", "A great place to eat just down the street from the TCL Chinese Theater & Hollywood Walk of Fame (corner of Hollywood Blvd & Bronson Ave). We've been here twice now and Palm's Thai restaurant hit the spot for a delicious Thai cuisine both visits. We were impressed by the size and decor of the place.Parking - valet for $3. Service - this place was packed! There was a 30 minute wait just to get a table! So that was a good sign, they are obviously doing something right if people are willing to wait just to get Thai food, when there are so many other restaurants to choose from. The service was a little slow but then again, they were so busy! We'll take slow service any day as long as we know we're getting delicious food. Just make sure to make a reservation!We ordered:- Thai tea - served it with the crushed iced, so creamy and perfectly sweet.- Thai papaya salad - a wonderful blend of the Thai triad of flavors: spicy, sour, and sweet!  It was worth every spicy bite.-Angel wing & fish cake - delicious & tasty.-Crispy battered fish fillets (trout) served with mango sauce. The mango sauce provided a wonderful and beautiful counterpoint to the deep-fried trout, mildly sweet and tangy without overwhelming the wild flavors of the trout. It ended up being a perfect pairing. The only downside to the trout was picking out the bones.  -Pad see ew - satisfying and tasty. Nice portions, fresh vegetables, chewy noodles, and good amount of meat.-BBQ beef and Pork jerky were also delicious. We can never get enough of them.They also had live music playing. There was an in house entertainer singing popular love songs. It was nice and entertaining to listen while we ate. The only downside is that this place gets PACKED!! Long waits are typical. Nevertheless, it's worth the wait!"], ["Christina P.", "This place is great. The only reason why it isn't receiving five stars is because of the rude valets. They didn't even park our car and they charged the fee. When we were already in the restaurant, they came in to bother us and to tell us to move our car even though we parked in the spots that said Palms Restaurant only. So you have been warned. It would probably be best if you find street parking and don't get pissed off before you even walk into the restaurant and sit down.Anyways, onto the food and drink; we ordered a Thai tea which was pretty good. We Also ordered fish cakes, pad Thai with chicken, pad se ew, trout with mango sauce, pineapple fried rice with pork, frog with basil, stir fried vegetables.Everything was amazing, but the frog legs, we could have done without, and the spicy beef salad was really tangy. The rest of the dishes stood out a lot and were very good."], ["Jan Z.", "My favorite Thai restaurant in Hollywood! Family style dining, entertainment, and they open late. There's many dishes I like, but some of my favorite dishes are yellow curry,  pineapple fried rice and pad thai!! YummParking is $3.50 or if you're lucky you can find street parking. Enjoy!"], ["Molly O.", "I was, unfortunately, totally underwhelmed by Palm's. Came really excited about my dinner (despite the Elvis impersonator having moved elsewhere) but found the flavors to be rather muted. In Thai Town, there are a million and one options, and Palm's likely won't be my choice in the future."], ["Jason R.", "Had to drop a star. I didn't think the yellow curry dish held up as well the second time."], ["Thuy H.", "Aside from having to pay for valet, I had a good time.  Good live music, good service, and good moderately priced food.Also, there were at least 20 people in my party and they did not give us a hard time."]]}