{"Darna": [["Sarah S.", "Stopped into this little gem for lunch and was very pleased! Lunch Buffet was kept full, all the food tasted fresh and hot. Staff took used plate away quickly and though it cost about $15 per person it was well worth the price. I loved everything I had! Falafel was yummy and their chicken kabob was so flavorful. I also overheard some regular patrons asking if certain items were available. The waiter stated not today which excited me to know that when I return I will be able to experience different foods, and I assume those items to be good if patrons ask about it!Definitely stop in to experience Darna!"], ["Amal S.", "Very personable, hospitable, and kind staff. We were a family of 11, we had to wait for a while to be seated, with the restaurant being pretty empty. Food was very delicious, juicy, and perfectly seasoned. I loved the choices of different kabobs (kofta and chicken) we also enjoyed the roasted lamb. They had a live band that played oum Kulsum, Egyptian classical singer and a favorite of mine. Onto tea time and the Baklawa, which I have grown up loving and prepared frequently by my mother and my grandmother. This one by far THE BEST tasting baklava ever!!!! It tasted like an authentic original PALESTINIAN baklava, the filing was made from scratch using mascarpone type cream and corn starch (according to the owner's wife).The only thing, I think they're a bit on the high price. $25 for 12 and older. I think $20 is the perfect price. Regardless, I can't wait to come again in the near future."], ["jeremy t.", "This place is definitely worth the try if you are about to get into middle eastern food. You can try a lot of variety without incurring a huge cost. The hummus was pretty fresh and tasty. baba ganoush was also on offer as well as several kabobs, rice, Tabbouleh, lamb, chicken etc.On fridays they have bbq ribs. Buffet is around $14"], ["Alex T.", "Knock knock, Kabob Who?!!, AYCE KABOB VIBE I have always dreamed of kabob for all you can eat, man i can never get enough when i order elsewhere Ala carte and only receive 4 to 6 pieces only with lots of basmati rice. Yes when i saw ayce kabobs, i was suspicious wondering how the quality would be like, so one way to find out is to try. LAYOUT It is a pay first, before you sit down and eat, because of the neighborhood i guess. The entrance is greeted with some nice poles, and bright floors which reminds you of a greek environment. Nice waterfall wall along the buffet food area. Lots of seatings, for large and small parties. There is a soda machine, where you can help yourself when you purchase the all you can eat. The location is right in the corner of the light rail, on k street, next to insight and buds sandwiches. Parking would be hard, but there is parking garages nearby or park on j street with the meters. PRICE As of September 10, 2015, lunch buffet is $13.85 with tax included it comes out to $15 for lunch. Yes $15 for lunch buffet. I think it is worth it for kabobs, if your a meat lover! FOOD Chicken Kabob - juicy and tender, and just cooked well with a char grilled favor. I wouldn't have thought the quality for a buffet would be so good. Beef Kabob - You can definitely see herbs mixed in with the ground beef. The beef tasted like hamburger meat, and not much herbs flavor in it, but yes you see lots of green herbs mixed in though. I do prefer the chicken kabob any day. Eggplant - this is a greasy dish. The non spicy eggplant tasted like an italian flavor dressing. It was different and good, but just a bit too oily for me. Hummus - this was just an average hummus, can't go wrong with this. Nothing to special like in flavor or anything, but it is pretty good with the pita bread offered in the buffet :)Yellow Rice - This did have some flavor in it. Light and fluffy, kind of reminds me of a quick ten meal cook up kind of yellow rice. I didn't find it too authentic in  the flavor inside the yellow rice. Basmati rice - the presentation does look like its fluffy and mmm. I did find some hard or uncooked grains in some bites, might of been dried up or something. But i do like basmati rice, but finding some hard pieces was just ehh.... i like it fluffed.... Lentil soup - This was great. The soup was creamy with lots of lentil. The soup flavor was on the calm and bland side. Falafel - this was in a pretty good bite size. The outside is kind of hard on the outside and kind of dry in the inside, i didn't attempt the second round of plate.  spicy eggplant - Yes on the more oily side. The eggplant was not spicy, but more on the mild side. I did like to mix this dish with the 2 kinds of rice offered. cucumber salad - This was refreshing mixed, which is a great all around dish and perfect for the summer and spring. It had a light italian dressing mixed kind of flavor in it. roasted squash / Zucchini- This was my favorite. Yes i love my veggies roasted and yes it was perfect! so good and just on point with the chicken kabob and rice. SERVICEThe only service you get is when they come and fear the plates. They do ask if you need anything else or have any questions. They do like to interact with the customers and ask if it is their first time or not. Friendly staffs here. JUST A NOTE Don't go to a buffet before an interview or work, because food coma is real, lol... yes oh man was i stuffed and couldn't move. i needed someone to roll me out of there. I can feel my pants getting tight, and my button up shirt popping out. lol"], ["Aleeta P.", "Everything looked delicious and was very appetizing.  The workers were very friendly and the place was filled with customers.  The buffet had numerous dishes, both vegetarian and non-vegetarian. Lentil soup, spicy eggplant, falafel, chicken and goat kabobs, beef ribs, and 2 types of rice among other things.  Once I finished eating I needed to be rolled out of the restaurant (it was quite embarrassing).  Other than that, everything was wonderful and my Mediterranean buffer experience was very positive."], ["Brittney K.", "Darna definitely stays true to the reviews as a lunch spot...as when we came in for dinner on a Saturday night, it was close to completely deserted!We didn't let this bother us, however. Perusing the dinner menu, I noticed that most of the entrees were quite pricey and decided to go for the beef shawarma sandwich ($9) with fries (extra $2) instead. The sandwich came stuffed in a nice little pita pocket, which made it less messy to eat than if it were a traditional two-slices-of-bread deal. There was a hearty portion of beef and the flavor was quite tasty. The fries were thick, hot, and delicious. I almost wished there were a bit more but I was still left reasonably full afterwards.The shawarma sandwich seemed to be a way better deal for the price than the actual dinner entrees that a few members of my party ordered - the shish kabob and moussaka both came on nicely presented plates with rice but there didn't appear to be that much actual food for the amount that you were paying. For a similar price, one could come in at lunch time and eat way more at the buffet! Service was not bad, as we had our water refilled regularly and our waitress was friendly. Food came out quickly. The decor was interesting, with the glow of a green light over the buffet in back and a large television screen in front. Although we were fairly lonely with few other patrons, the space was large enough that it didn't feel too awkward. They also have a display case with yummy-looking desserts at the entrance...oooh so tempting!Overall, while very quiet around dinnertime, Darna is not a bad downtown option if you're in the mood for some shawarma and want to grab a drink on K Street afterwards!"], ["Alan X.", "Eh, I'm not really a fan. We came here to grab some food before going to watch a movie since it's not too far away. Arrived on a saturday at night and there was pretty much no one there. The food was pretty good, I got the beef kebab but it's just too expensive for what it is. Considering you can get a sandwich for $9 or a plate for $19 there's quite a disparity there. I would be much more inclined to go for their lunch buffet if I could that way I could sample more things. It just feels very disjointed. I can't tell if they're supposed to be a nicer sit down place, or more casual. From their website and everything it seems to play it up as more upscale, but my experience was anything but. The food was well seasoned and very flavorful though. Just wish the price was more consistent to reflect the overall experience."], ["Yixuan Z.", "This is a very nice Mideast restaurant. I went for its 15$ buffet. It has a variety of dishes. I enjoyed several classic Mideast salads, chicken kebab, and falafel. Most customers are the managers working around this area (u can tell from their shirts). The coffee is good, deep roasted beans but not much acid.If they heat up pitas a little bit would be better.If they provide lamb kebab would be perfect."], ["Jessica S.", "We got here at 11:15 and the door was locked. We waited and an older guy finally came and opened the door. While paying, my S.O. asked if they opened at 11 (we thought maybe it was later and we'd misread the website or their hours has changed or something). The guy was really curt and unfriendly and said, \"Yeah, 11\" like he was doing us a favor by letting us in. Not a good start. So, for 2 people, it was $30 which I think is absurdly expensive for a lunch buffet. Especially considering the selection is pretty limited. The baked chicken was pretty good, as was the labneh and the hummus. The pita bread was awful - clearly out of a bag, a little bit stale... The smaller pieces of chicken were really dry, and so was the falafel. Just, overall, it was mediocre for $30. I was pretty disappointed."], ["S B.", "Went there for lunch today. This place is AWESOME!!! A 5+ stars restaurants based straightly on their food ratings. All meats are super juicy ~ one of the best juicy kabob I have ever had!!! Chicken meat is very juicy also. They served beef ribs on Friday lunch ~ Oh my goodness!!! They are the bomb!!! Great meat, juicy and awesome bbq flavor. Very good hummus and eggplant dip, although their pita/naan is only ok, and too much dressing on their salad. With the amount of great and yummy food in that restaurant, it's definitely worth 5+ stars!!!Price wise - it's decent since I got beef ribs today. hahaha.EVERYTHING I had tried was so yummy in this restaurant. Highly recommended this place."], ["Vladimir G.", "Can I give this place 6 stars?Was planning to check this place out for a long time and finally the opportunity had arrived. So, our group of 6 co-workers headed to the spot. It was pretty busy during lunch on Friday, but we were seated in a timely manner. They have variety of plates from hummus, sour middle eastern salads, appetizers to BBQ halal beef ribs (served only on Fridays), chicken and beef kebabs. Everything was so delicious that at the end of my carnivorous feast I had a big happy bbq smile across my whole face due to those bbq beef ribs. Their chicken kebab is made of chicken breasts and I am usually hesitant and prefer thighs over breasts due to the fat and juicy factor, but their chicken breast kebabs were not dry at al, but instead - juicy and flavorful, and by far-the best chicken kebabs I have ever tried. Price includes buffet and a soda, and you have to pay for extras like desserts, etc...P.S. The service is very attentive and the empty plates were removed quickly. Definitely \"I'll be back.\""], ["Tammy S.", "I came here for lunch for the first time and for me, it was a mixed experience.ProsLots of delicious food options on the buffet - seriously, the food was great!Dining area was spacious and cleanThe people seemed quite friendlyConsMany dishes on the buffet were severely depleted - they were having a hard time keeping even the basics, like pita bread, hummus & falafel stocked. Empty pan syndrome!Beverages are included in the buffet, but their iced tea machine was broken. How hard it is it to brew some tea over ice and serve it in pitchers? My only choice was soda, which I don't drink$15 is a lot to pay for a buffet that they couldn't keep stocked and had limited beverage offerings. I waited for over 15 minutes for them to bring out more pita bread & hummus!Were it not for the actual AVAILABILITY of the delicious food, I'd love to be able to come back, but based on this experience, I have a hard time recommending it, not knowing if there will actually be any food available to eat. It's a bummer because I feel like this place has a lot of potential."], ["Moozhan T.", "We were going to have lunch at Bud's, but as it was a rainy, stormy day, Bud's was closed, so by complete chance we ended up at Darna.  Let me tell you, the food is 3.5-4 star quality, but I felt that $12.95 which comes to a little over $14 was a little too high for lunch buffet.  Otherwise, this place is totally worth a visit. I think you should order things off the itemized, ala carte menu to get a delicious value meal. I tried most of the items in the buffet, and almost everything was cooked perfectly, and was nicely seasoned.  I'm pretty sure I'll be back soon enough!"], ["Jim K.", "I had a wonderful buffet dinner at Darna last evening. The food was very tasty and well prepared. I spoke with one of the family that owns the restaurant and much of the food is Palestine based, but it also offers other middle-eastern style dishes. Lots of flavors and textures to try, which included lamb, beef, chicken, vegetarian dishes (including a cauliflower dish that was both a pleasure to look at and good), salads, hummus, pita bread, a yogurt dip, and more. They even had a dish that apparently consisted of bread with cheese on top (at least I think it was cheese). The ambiance is somewhat sterile, so this is not a good place (in my opinion) for a romantic dinner, but that was not off-putting in the least since the food more than made up for that. The staff answered by questions very professionally and offered some really good information. My only real issue is that their website lacked some key information, such as that on weekends they apparently only serve buffet style. But otherwise, it was a wonderful meal for a reasonable price. I will definitely go there again and recommend it to my friends."], ["Kristi B.", "I preface this with I set my falafel standards high. I spent a year abroad about 20 years ago at a university that edged Tahrir Square and I would eat falafel (Egyptians call it tamaya) almost daily,  at this barely there hole in the wall,  hot crispy patties, with a splash of tahina, topped with pickled vegetables. Within a handful of bites,  I would walk back to campus or my apartment in a happy falafel bliss.Today I was hungry at lunch,  the first three restaurants I visited were closed. The cashier invited me to check out buffet,  saying there were a few vegetarian options on it. I declined,  opting for a falafel sandwich to go, about $8. When I got back to my desk,  I was pleasantly surprised it came with french fries. While I loved the pickled vegetables and the yogurt cucumber dip and even the bread, the falafel fell flat. I  finished the french fries before I ate the second half of the sandwich. While I shouldn't judge a restaurant based on one sandwich, admittedly I am. On a positive note,  a few days ago I booked a flight to Cairo,  and while the most of the university moved to a new campus,  this visit to Darna reminded me that one of my goals is to see if I can find that temaya stand a few blocks away from Tahrir."], ["Kristian D.", "I am so glad that I finally tried Darna. These guys have transformed the former Farley's into a wonderful Middle Eastern restaurant and buffet. We had the lunch buffet with included a tremendous amount a good food for only $15 each including tax and soft drink.The restaurant is very clean and open with a nice modern Middle Eastern theme. There are lots of tables with open seating after you pre-pay your food near the entrance. The star is the buffet with lots of typical dishes - hummus, various salads, lentil soup, grilled meats, and fresh fruit. They have a standard menu as well for a la carte ordering.The food was fresh and plentiful, however some meats may take a while to refill since they are grilled fresh in the back. Everything was very tasty, and the whole group was thoroughly impressed. This is a great lunch spot for downtown workers and even before a night on the Kay."], ["Nina H.", "I stopped by here for a chicken shawarma sandwich one day and it was pretty good.  I didn't know it came with fries, but it did and those were good too.  I came back here a while back for the buffet.  The food in the buffet was pretty good quality for a buffet.  It was a bit pricey though.  But not bad."], ["Ron P.", "The Lunch buffet was amazing! It was totally worth it. Soda/tea included.  Everything looked house made and Halal! The quality of all the dishes were excellent. I pretty much tried everything.  I wanted to try the Lentil soup but I was way too stuffed. I had the hummus, babaghounoush, chicken kebab, kefta kebab(ground beef), falafel, they even had moussaka - isn't that greek? Their menu describes themselves as mediterranean, is that the same as middle eastern? Anyway, I digress...There were sauces/appetizers next to the fresh lettuce salads I had never tried before. Really good and flavorful without being too over spiced.  The dining area was very casual and clean. This place would be perfect for an office or family gathering.I will be back!"], ["Kevin M.", "Went here for dinner on Friday night. Had the buffet with water, and was served a dessert item. The food and service was good. I was shocked when I went to pay. $27.95 for one person. That's right. $27.95!!!! I still can't believe it. Won't come here again."], ["Shelby L.", "Amazing!!! Food is delicious!!! My friend and I wanted to try something new and we were impressed!!! Delicious flavors we will definitely be returning!!"], ["Erik L.", "Trying to teach a one-trick pony to do a second trick can only end in heartache. Darna's one trick being its lunch buffet, well, even that seems to have mixed reviews. Anyways, Darna is clearly a lunch spot based on its location near day-offices, large buffet area, and level of service. We ordered:1) Kabob combo: Shish tawook (chicken), kefta kebab (finely ground beef with seasonings), shish kebab (beef cubes), and rice/veggiesThis dish was fine, but nothing remarkably special. The almonds on the rice were appreciated2) Eggplant Massouka: Baked eggplant, ground beef, seasonings, covered in mozzarella, with a side of riceThis dish seemed a bit small once you really got into it, also the cheese on top wasn't evenly melted at all. Seemed rushedThe ironic part of it seeming rushed is that with just these two orders, it took 1 hour and 45 minutes to get in and out. We were totally fine with this as time was precisely what we wanted that night. But if you're in a hurry, don't count on this place. The service was also a little odd, it took a while for anyone to notice us and a family, the family ended up just wandering through the tables and seating themselves. The staff eventually seated us and tracked down that other group. After that, 3 different waiters and waitresses approached our table to ask if we had been helped. The one bright spot on the service front was our main guy, who acknowledged our reeeaally long wait with some pita, dessert, and genuine apologies. But still, that's not much good to someone who didn't have about 2 hours to spend on a simple dinner. It's pretty clear Darna's main target is the lunch crowd, and dinner's just the after-thought."], ["Adam G.", "Well I will definitely have to check out the lunch buffet next time I come here because I clearly missed out on that. I instead made an order for the Beef Shwarma sandwich  to go. There is a large portion of sirloin sliced into pita bread with all the Mediterranean works inside. Was also pleased to see a side of fries on the side when I opened the box up at work. I will be back, because the sandwich was delicious and kept me fully fueled for the rest of my shift."], ["Edward P.", "Got there at 5 PM, but evidently the time hadn't been updated with Yelp.  They open at 6 PM.  I'm glad I waited.  Super friendly and hospitable owner and family.  Wonderful buffet with a huge roasted lamb slicing station.  The roasted lamb was juicy and tasty.  The hummus, the kefta, and the many other options I'm too lazy to list were all great.  I was particularly surprised how good the falafel was.  It was crispy, not too dense, and flavorful.  Only thing I didn't see was taziki, but with all the choices I didn't even bother to ask.  Great food, great service, great music.  It was a nice evening for a business traveler away from home!"], ["Diane G.", "I was so excited to try this place, I love mediterranean food and work right around the corner. I was waiting for the day I didn't have time to make lunch and when it finally came this was the first place on my list. One star for atmosphere...i was surprised when I saw how nice the store front and inside was compared to the surrounding businesses. I ordered the Beef shawarma  and took a seat...My food came out pretty fast which was great for a quick lunch break, the Gyro was cut in half and each half was individually wrapped. First red flag was the fries they were not very good, of course when you have fries you take a bite of those before everything else...fries are pretty hard to mess up so i started to get nervous as I unwrapped the first half of my Sharma gyro...I took my first bite and my taste buds immediately hated me...it was awful. There was way too much sauce and the sauce ruined the entire thing- it was SO bad. I had a few bites and wrapped it back up, walked out, and proceeded to give basically my entire meal to a homeless man outside...Waste of $10. Will not be back"], ["Mary G.", "I will definitely come back here. The food was just very flavorful and unexpected! I love this hidden gem!"], ["Toni L.", "This place is having an identity crisis. Food: If I had written this review after coming here once, it would've been five stars all the way. Now, having visited a number of times, I can say that consistency is not their strong point, but I still think they are one of the better lunch options within walking distance of the California Capitol. During my first visit, I ordered the Shawarma sandwich, a pita filled with meat straight off the spit, pickled veggies, sauce, and thick fries (yelp.com/biz_photos/darn…, yelp.com/biz_photos/darn…). I have nothing but good things to say about this sandwich. The meat was seasoned well and had that perfect roasted and slightly crispy texture you crave when you order red meat shawarma. The weather was amazing, so I decided to eat in Capitol Park. Here one of the highlights of eating at this place: If you order out, they give you a green mock single-use bag that is totally reusable. To top it off, it's a nice green hue and stamped complete with a redundant \"Thank You\" and a smiley earth stamped on the front. I've since been using this bag like crazy and people keep asking me where I got it. Unfortunately, my second visit wasn't so hot. I came with a couple friends and for some reason the shawarma was replaced with this nasty substitute. I don't know if that was a permanent change because I didn't have a chance to visit afterwards, but it was pretty gross. Luckily the falafel and other components of the meal were good enough to compensate. The lunch buffet seems a bit more consistent, but it's pricey unless you can cram massive amounts of food down your gullet. If you have a chance, check out their collection of sodas. They have some interesting stuff I'd never seen before. Atmosphere: The transition between the dirty, seedy strip of K street this place sits on and the interior is rather shocking. This place looks like a palace. The walls are decorated with gorgeously intricate geometric and floral designs (yelp.com/biz_photos/darn…) and there's even a huge flatscreen tv to keep you entertained if dining alone (yelp.com/biz_photos/darn…). All of the surfaces sparkle with cleanliness and the seating goes on for miles. Service: Maybe this is a family owned business because it seems like many of the operations could use some streamlining. The first time I visited, one of the younger employees seemed to have trouble operating the cash register. It also took me forever to get my food during my second visit. Synopsis: If I could guarantee the kind of quality I encountered during my first visit, I wouldn't hesitate to recommend this place. I say, try one of the pita sandwiches, get the takeout bag and see for yourself."], ["Andrew And Lynelle H.", "This is by far my favorite Mediterranean restaurant. I went there a few weeks ago with my mother-in-law. We had a sampler of many appetizers. Everything was delicious and then the main dishes came out. We had a rack of lamb, grilled chicken, steak and ground beef kabobs along with grilled vegetables and rice topped with thinly sliced roasted almonds. I was extremely impressed with the quality of all the dishes. Everything was full of flavor. To top off the appetizers and main dishes, we got a plate of Kenefa, a savory yet sweet dessert. Without saying too much, it is now my favorite  dessert. I would highly recommend this restaurant!"], ["ny w.", "Magic.Halaal is so hard to find in Sacramento, places that you'd think are Halaal sometimes cross contaminate the food. The best chicken Swarma I've had, in a long time. It gives my mom's a run for her money. The price is fair. The atmosphere was nice and the service was excellent. Heads up: if you have a half hour lunch - order to go! The service isn't slow but it isn't fast either. If you have a longer lunch - go for the buffet it's definitely worth the price!"], ["H C.", "Best Middle Eastern restaurant in the Sac area, hands down!The buffet is great, a good variety, and very good value.They also have a family platter for multiple people, really good value for the price and the quality.I just wish they were open for dinners during the week. I think with a little marketing they can fill that restaurant every night :)Thank you Darna, you are a great addition to the Halal places in Sacramento!"], ["Jennifer S.", "I came in around 3pm (just after the lunch buffet had ended) and got the chicken shawarma sandwich, which I think was $7.99. The menu stated that fries or salad were available for an extra $2, so when I didn't ask for them and they came on my plate, I thought I would be charged extra, but I wasn't. I'm not sure if it was a mistake or if all of the sandwiches come with a small serving of fries, but there were enough for me to only be able to eat half of them, so I don't think paying $2 for more would be necessary even if I was starving.The fries were pretty good. The chicken shawarma sandwich was amazing. It was all hot, and the pita bread was overflowing with chicken and a combo of tomatoes, pickles, garlic sauce, and tahini. There were some extra pickles on the top of the sandwich, too, and they were probably the best pickles I've ever had.The chicken was insanely flavorful, and juicy. I'm not really a Mediterranean food connoisseur, but this food was better than I've had at any of the other handful of places I've tried. I thought that $12.99 sounded a couple bucks too expensive for a lunch buffet, but as I watched them clean it up, I realized that they really do have a ton of selections to choose from. I will definitely be back for that sometime.I love the ambiance here. I can't really think of a better way to fuse American and Mediterranean decor than to hang two giant flat-screen TVs in the middle of plants and tiled walls and clay plates. There are also waterfalls all throughout the restaurant, and the sound is very relaxing. Maybe it's meant to make you eat more.The service was outstanding."], ["Daanyaal K.", "Came here on a Friday evening. From the looks of it, this place is fairly new as the inside is very shiny and spiffy. I wanted to eat back at the hotel so I ordered a Beef/Lamb Shawarma (forget which one I got) sandwich which was $9 and a lentil soup cup which was $4. I waited 10 minutes and the food was ready. I went back to my room and opened my sandwich box which had steak cut fries with some parsley or cilantro on it. My sandwich was great, it was literally 90% filled with meat which stuffed me up real well. The lentil soup was also really good and extremely filling. For $14 you can't go wrong. I look forward to coming here during the weekdays on my next visit and trying their buffet which is from 11 am and 3 pm. This place is also a 5 minute walk from the Sheraton Grand Sacramento."], ["Angela L.", "I hadn't seen it mentioned here, but if you park in one of the nearby Sac City parking garages (the Capitol Garage at 10th & L, or the City Hall Garage at 10th & I) and show the ticket to the cashier as you pay for your meal, they will give you a ticket for a $5 parking credit. That's enough to cover 1.5 hours of parking, and one of the reasons why I'm rounding up to 4 stars. This was our second time here for the lunch buffet, and our reactions mirror our first time. My dining partner liked it much more than I did. I feel the $15 (including tax) price is a bit too high. I loved the Falafels and the lentil soup, but nothing else jumped out at me as above average. However, my partner also raved about the baked chicken and the fish, and liked several other dishes, too. So to be fair, 4* it is."], ["Elisa M.", "Their pita sandwiches are delicious! They were also exactly the right size to make us feel full without bursting out of our pants :) The restaurant is nice, with a casual ambience (not lowly-lit); it was pretty empty when we went for dinner, but I imagine it's really nice when it's full. The service was also friendly and fast, and we paid $20 total, which I think was just right.(I docked one star because I've been to restaurants with nicer ambiences, but that's also not to say that this wasn't a pleasant place to eat.)"], ["Kareem M.", "Pure middle eastern excellence !!! Everything from the shawarma to the entrees is wonderful ... Well done !!"], ["Bill A.", "My favorite middle Arabic Restaurant. I eat here several times a week and continue to enjoy the variety. They do change the items in the buffet regularly.I find the atmosphere very pleasant and peaceful and the staff are particularly friendly and helpful."], ["Mosheem K.", "I have a feeling that they will get 5 stars when I actually dine here for the buffet. I ordered a steak burger. It was good, nothing too fancy to brag about. I give them credit for using really fresh ingredients.  At first I thought it was odd for them to open across the street from Crest cafe (which offers a very similar menu for a lot less $$). But after stopping in here, I realized that they are very different from Crest Cafe b/c they are upscale and they know it.But the good rating is due to their decor and presentation of their restaurant. This is a really upscale halal place. The restaurant was crowded- I wouldn't say it was fully packed either. The buffet selections seemed endless! The atmosphere was amazing. I look forward to updating my review when I actually dine inside. Stay tuned"], ["Lee M.", "I checked this place out on a Friday for lunch.  They were offering a buffet at about $14 a person.  It had been a while since I tried food served in a buffet style.  This place really surprised me.  They had a smorgasbord of all things acquainted with Mediterranean/Greek and it was very enjoyable. I started off with a plethora of hummus and spicy creams and made my way towards the pita bread served next to the rice.  Yet, the ultimate surprise was the ribs.  The amount of meat on these ribs was very surprising.  I had to serve myself about 4 times because there are so many great tidbits about this place.  It's just too bad they aren't opened on the weekends."], ["Charles A.", "Great food! Wonderful buffet. Nice change."], ["Michelangelo S.", "Darna Delightfully Delivers Delicious Delicacies!SITREP[Note: I've chosen to update-edit my original review, since if I do a separate subsequent update, my ROTD-acknowledgement for my original review on Darna will disappear from my profile.  That's a gl]Sometimes a restaurant really does pick up it's game.  I've since been back to Darna several times since the time I went and I couldn't find any food I liked and/or even available in the pans since they were empty.Today is what I would call a great Darna experience. ORIGINAL ISSUE:To give a Cliff's Note's version of my past problem:  customer service / cooking prep were lax.  When you are on the clock, the buffet is supposed to be an efficient option, letting you get in & out in a timely fashion without fuss or muss of ordering from a table. However, that was not the case:DEFICIENCIES THEN:*  Out of Kabobs (a gentlemen in front grabbed these last ones as I took picture). More than 10 minutes to refresh pan:yelp.com/biz_photos/darn…*  Out of Pita Bread and took 10 mins to replace:yelp.com/biz_photos/darn…*  Out of Falafils and took 15 minutes to replace:yelp.com/biz_photos/darn…*  Massouka was NEVER replaced entire time from 12:20pm-12:50pm:yelp.com/biz_photos/darn…BUFFET METRICSAt the time, I finally confronted the shawarma attendant (who was periodically in & out), and said, \"You are out of Massouka, Pita and Falafils, and other things.\"  His golden response was, \"Oh!  We're busy.\"  Really?  Like it's MY JOB to inform staff that they are out of food?  And \"busy\"?  Like having people come to your business at lunchtime is some unexpected surprise? .POOR RACHEL AND HER \"TO GO\" ORDERHowever, the worst case-scenario of deficient \"buffet-prep & delivery\" was the poor gal who had been 2 spots in FRONT of me at the register - she had gotten the \"To-Go\" option, probably thinking (like I would LOGICALLY also) this would make things \"faster\" for her.  (\"Hahahahahaha!  Oh god.\")  She just confided to me that this was going to make her late in getting back to her office and her whole idea thinking that this would \"save time\" for lunch was \"hijacked\" by lax customer service.  \"Hijacked\".  I liked her use of that word. Funny thing is that I'm already familiar with lazy buffet operations who engage in lax attitude about food replenishment - they include such notorious stalwarts as Annabelle's in Old Sacramento and Mountain Mike's Pizza buffet off of College Town Road.  I just had no idea that DARNA would devolve to such depths.  But the fact of the matter is that Annabelle's and Mountain Mike's are only charging me between $7-$8 to waste my time, not $14.02.SOME THINGS DO CHANGE!But I have to say now that in the last few times I've been here to Darna, I've been delighted at how quickly and efficiently food replenishment does take place for the buffet.  And today was probably the best example of this, especially since this was the choice for several of us to come together:The Roasted Chicken - Kept Full!yelp.com/biz_photos/darn…The Ribs - Plenty!yelp.com/biz_photos/darn…The Hummus - Great Presentation!yelp.com/biz_photos/darn…And the same for the other items I took pics from on this occasion.  THE LOWDOWNYour food - when PRESENT - Rocks The Casbah!  Thanks for a delicious time with friends today at my most recent visit.  :)"], ["Crystal C.", "I came here for an early half-hour lunch and beat the crowds. There were only 3-4 other people here when I came, so I think I avoided the empty-pan syndrome that so many other Yelpers have been disappointed by.Service was generally good and the restaurant and buffet were spotless. We found a table, drinks, and everything we needed with no problem.The buffet is smaller than I expected, but there is a good variety of food and it ranged from pretty dang good to pretty much buffet-style mass produced food. The meats had generally good flavor but were a little dry. The roasted veggies were awesome and done perfectly. The rice was also very good - well seasoned and not too dry. I was not a fan of the stuffed cabbage, but had seconds of most of the cold salads. All in all, I would say $14 is a little high considering the size of the buffet and the quality, especially considering I only have a half hour lunch (which isn't their fault), but once in a while it would be worth the splurge to come early, avoid the crowds, and feast on some of the better dishes."]], "Lucca Restaurant & Bar": [["C. H.", "One star is for the nice staff and one is because my fathers meal was good.I was drinking from my water glass and noticed something on the rim, I wiped it and it was LIPSTICK!  Gross.  I don't wear lipstick.  I called the waitress over and she said sorry and brought me a clean glass.  My husband And I split a burger and both of us were unhappy with it.  Absolutely no flavor and by no flavor I mean I couldn't taste the beef.  I would have asked for the manager about the lipstick but I was with 5 people and didn't want to make a fuss.  You'd think they'd comp part of our meal?  Oh hell no...I will not return to this place.  How disappointing."], ["O F.", "I was looking for a quiet but exciting place to take older family members for a Saturday night dinner and this place definitely met all this and more! Reservations were super easy, give them a call if your ideal time isn't available online. I was even able to specify a quiet corner and indoor or outdoor, etc. Pros: food was good, zucchini chips are a must, atmosphere, attentive staff, wine listCon: food wasn't spectacular flavors, maybe yelpers fault but def not Mediterranean food,"], ["JE B.", "Went here for happy hour! The food was delicious but you can't really get full from their happy hour menu. It's mostly snack items and the portions were small. But still tasty!"], ["Mel L.", "This is a great place for date night or a drink with the girls. I appreciate the complimentary zucchini chips when I check in on Yelp too. They were not greasy at all. I started off with a white sangria which was light and refreshing. For our entrees, we got the chicken risotto and the pork chop. My risotto with was okay and the chicken was moist and plentiful, but a little lacking in flavor. The hubby said his pork chop dish was perfect. He talked about that chop for two days! I had a taste and it was nice and smoky.Try to save room for their caramelized banana dessert. It was super tasty."], ["Lisa B.", "Really enjoyed a nice evening here at Lucca. The food was great and the service matched. Must try the zucchini chips and the creamy polenta appetizer! I had the chicken risotto and my friend had the beef brisket, all very flavorful. I'll definitely return."], ["Mark C.", "Can't go wrong here.  Eat on patio and enjoy yourself.  Northern Italian food @ middle to high end pricing."], ["Kelsea R.", "We had an appetizer, two entrees, and the single most delicious dessert I've ever had in my life for only $36. The atmosphere was upscale and the service was superior. I wish I lived in Sacramento so I could eat here every day. They also had separate vegan and gluten free menus available. Honestly, the caramelized bananas dessert was the second best thing I've ever put in my mouth. Come here and order it."], ["John H.", "Lucca Restaurant & Bar has been part of the downtown restaurant scene for so long it's easy to overlook in favor of some of the newer, trendy eateries...but don't!  It's a casual yet classy restaurant with a full bar and Mediterranean-Italian fare. It's perfect for a date, but arrive early Thursdays to grab a seat at the bar for the all-evening-long HH. There's a covered, enclosed patio that's used year-round.The owners have a new venture, Happy Dog Ranch, which supplies pasture-raised, grass-fed, aged meats to some of the finest restaurants in the area (including, of course, Lucca and its sister restaurant, Roxy).The down & dirty:Food - 4+ - Everything's good!Service - 4 - They're good at it so you can focus on having a good time.Value - 4 - HH all evening on Thursdays in the bar!Setting - 5 - Old brick. Patio. Retro posters. Ride your bike and walk off dinner afterward!Date worthy - 5 - Just beat the crowd to HH so you don't feel like a putz!"], ["Kathy M.", "Flew in to visit my Family. We were hungry and found this place. We were pleasantly surprised. I had the Pesto Chicken Risotto and it was wonderful. It had lots of flavor. My sister got the gnocchi which was also fantastic. My dad had the chippano and that was really good as well. We were not disappointed by anything. The non alcoholic spritzers were very good. This place was very good."], ["Susan S.", "Quite impressed. Had the grilled brussel sprouts, parmesan fries, cioppino, and special ribeye. The fries were boring but everything else was really very good; seasoned well and healthy portions."], ["Angelica R.", "We got a reservation for 6 here during graduation weekend, so we were thrilled. The restaurant was festive and the staff was extremely pleasant. We ordered steaks, pasta, and some mixed drinks. We were all happy with our meals. The zucchini chips were just okay, but they were complimentary, and that's always nice. It was a busy night at this restaurant, and the server took good care of our table, kept the water flowing (which is important to us), and had a good attitude when we asked her to take a group photo. It was a fun evening, and we would return."], ["Thuy T.", "I don't think I wanted to try many things on the menu when I was here. I strained to pick something I really wanted to try and it wasn't anything special. I had the risotto and it was actually kind of odd. The combination of corn and whatever else was int here wasn't balanced right, and it made the dish very hard to eat.Our waiter checked up on us sometimes, but when we needed him he never seemed to be there. It was very busy though, but still I'd wish he come check up on us more often. I came here once, and I don't think I'd come here again. It's not a bad place to eat; it's just okay. The food wasn't anything to rave about, and the staff weren't there as often as I would've hoped."], ["Thomas H.", "Lucca's was a bit of a disappointment. First off, if you're looking for a spot with a hip younger crowd you won't find it here. To be fair, we dined on a Sunday evening which isn't exactly the best time to eat out, but this definitely seemed more like a family-friendly or comfort-food-for-elderly-patrons kind of place than a modern experience or good place to take a date. And so Lucca's follows a long list of American-Italian establishments.The interior is dated and noisy, and not at all in a charming, rustic kind of way. However, the outdoor patio is nicely appointed and spacious--definitely worth waiting for if you have the choice. Service was friendly, but a little slow for the number of diners present.Our meal started off well enough with a fantastic plate of zucchini chips, a large hot plate of well-prepared mussels, and two creatively inspired and excellent refreshers. Unfortunately things took a turn for the worse after that. I had pan seared salmon, which came on a very uncreative bed of could-have-been-instant mashed potatoes. My wife had a disappointing rendition of cioppino; although the seafood was generic, there was plenty of it, but the sauce had a strange aftertaste and little of the deep flavor you might hope for. Now granted this isn't San Francisco, but you can easily make a tastier cioppino with premade sauce from the supermarket.Despite our disappointing entrees, based on Yelp reviews we decided to stick around for caramelized bananas. Unfortunately, this too left us wanting for... well, something else. The bananas themselves were tasty and the salted caramel was delicious, but the layer of semifreddo beneath didn't really go well with the dish, and instead of being creamy had a texture rather like ice cream that had been left out too long and then refrozen.It's quite possible Lucca's best servers and chefs had Sunday night off, but it will be a long time before we consider eating here again. However, based on the quality of our appetizers and drinks, it could well be worth checking out for happy hour."], ["Cyn T.", "Ambience, service are okay. Had mussels as appetizer and these didn't smell and taste fresh anymore. Was not a good way to start a meal."], ["Spencer R.", "Food is very good and reasonably priced for the quality + portions. Cocktails are on point too. They have a happy hour that's a lot of fun. Lucca is a good place for a date or after work drinks with coworkers. Fun atmosphere. Good service."], ["Marcus A.", "I haven't dined here in awhile.  The guests,  the back and front house staff, the chef and management all strike me as a class act. The food is reasonably priced, 4 star quality, and with the feeling of somewhat fine dining. Something is still missing.  Sacramento is hosting Baconfest this week, and evidently Chef Ian McBride was the winner from last years competition. Congratulations sir.  @ bacon festival @ lucca @ hospitality. The something missing was in an attention to details.  It happens right?  On Thursday, January 15th this beautiful concoction was advertised on Lucca Facebook page. Unfortunately somebody I know and knew I had a former relationship with Lucca drove all the way to Sacramento from Galt just to get 4 pieces for s special dessert for her family.  Come back next January 19th that's when we sell its."], ["Kat T.", "I'm not sure if it's the abundance of quality restaurants in Sacramento or my evolving palate but what happened? I have often recommended Lucca to friends for the food and lovely outdoor patio. On my most recent visit, I found the patio to be EXTREMELY loud and the food to be standard. The chicken risotto was good but I could have easily recreated the dish in my kitchen. The service was VERY slow and staff seemed as if they were stretched too thin. Our party ordered a bottle of wine with dinner and we were disappointed with the extended wait time. We were halfway through with our meal the wine finally arrived.  We watched our server buzz around endlessly so kudos to her for maintaining such a positive attitude."], ["Tarah F.", "I've had several special dinners at Lucca and they've always easily accommodated my groups and their various needs. Don't forget to use the Yelp appetizer deal - you'll love the zucchini chips! My favorite spots are the back dining room (for large groups and including an optional private bar) and the long table in front of the fireplace on the side patio. And the food is delicious, even satisfying my dad, who is a picky super taster. Plus, they have a delicious happy hour! Just plan to get there early, park blocks away or just pay for a lot or valet because this corner is a midtown hotspot any day of the week."], ["Amber M.", "Still love Lucca's! Came here for my bday the other night and had wonderful service and food! Really top notch! I always recommend Lucca's to my friends!"], ["Jason J.", "For my birthday dinner, I searched for a place that I haven't been and that would be great for me and my family. From the many great reviews, Lucca was my decision. When I arrived to Lucca around 7pm on a Friday night, it had a lot of energy; being my first time and my birthday celebration, I was excited. I was guided to my party who were sitting at a large table with booth seating under a large image of a blue goose!We had a wonderful server who took great care of us. We started off with beverages where I spotted the...*Jalapeño Martini...which had a great kick to it. For starters, we ordered...Zucchini Chips $7*Parmesan Fries $6black truffle aioli*Fried Calamari $13sweet pepper, fennel, black olives, spicy harissa sauceIron Skillet Roasted Mussels $12sea salt, drawn butter[* = Favorite Dishes]We had so many starters, I was beginning to get full before my main course came out. For my main course, I decided to get the...*Linguine with Prawns $18roasted tomato, spinach, lobster cream, manchego cheese...delicious in every way; I almost started to lick the plate! You would would think that I had enough, but the server was informed we were celebrating my birthday where she brought out a little bowl of vanilla bean ice cream with chocolate syrup and topped off with a lit candle. Having the sweet tooth that I have, I also ordered...Double Espresso $3.75*Chévre Cheesecake $6.50ginger snap crust, apple compote, chantilly cream, and toasted pistachiosI enjoyed every bite and and a great experience. This place definitely makes a great dinner date and I'm sure I'll visit again. I heard they have a great happy hour which I would be \"happy\" to try out."]], "Pita Q": [["Lili F.", "I've been coming to Pita Q since they opened back in 2008, so it's about time I've sang there praises. Rancho Cordova doesn't have much to offer in terms of cuisine, but Pita Q is a shinning example of good simple food. I always get the chicken pita on wheat..cucumbers, onions, feta cheese, avocado---extra 75 cent, that green suace and there jalapeño ranch? Omg!!! So yum. Throughout the years pitas have gotten smaller and prices have gone up, but I'll keep coming because it's consistently good. There outdoor seating area is a beautiful calming oasis, that makes it really hard to go back to my work cube....be warned. Oh, and the falafels are also pretty good too. Service has also gotten better, there were a few bad eggs there before who looked like they wanted to be anywhere else but there. Occasionally you can see one of owners a pretty Greek woman with short brown hair who knows what shes doing. I wished they'd open another location. Viva la pita Q!"], ["Shala R.", "I went here today (1/30/15) and order a chicken pita. When I say the chicken was burnt, it was BURNT!I've never had a bad experience here but this trip was by far my worse. I couldn't take the food back because I had to return to work, but if I had the option to, I definitely would have requested a refund.SMH"], ["David C.", "Food to price, it is definitely one of my go to in the area. I love falafel and it isn't the best I've had but for the price of it, and a bunch of veggies to boot there isn't really a place that beats it.The times during lunch may be a little rough, and the worker turnover can be pretty high due to this. A few of the more consistent workers are knowledgeable however and will not steer you wrong with choices. My suggestion would be to have what you like in mind though since honestly it makes it faster for all of us. Or stick to a staple of veggies rather than try to invent the wheel each time you go."], ["Karen K.", "I've been wanting to try this restaurant out for at least a month now especially after seeing Frank R's review. I have always favored Greek food and not normally do we go for just a salad but after seeing a pic of the steak gyro salad my eyes got big!!!!We got to the restaurant and my HB barely got a parking spot as there was a truck parked in front of the liquor store next door but took up like four spaces in front. So if you come to this restaurant parking could be an issue.We entered inside and I thought the restaurant was small. Not that it was a huge issue but I like room.  The style of eating here is casual where you order your food up front like cafeteria style. It was my first time here plus it seemed on the noisy side. So every time the waitress asked me a question, I would respond could you repeat that?! I know I'm getting up there in age but my hearing is failing me too?!!! Yikes?!! Lol!Anyway I did order a salad where you pick your greens and six of the ingredients they had there. I'm picked a mix of the spinach and romaine lettuce, cucumbers, red onions, chick pea mix, quinoa mix, kalamata olives and broccoli. My choice of dressing was the fig vinaigrette. That was an awesome choice!!!  I did say the salad was to go but the guy just figured we were going to eat it now. So he poured the dressing literally on top! Now who was hard of hearing?!!!I did order a soda drink and bc I checked into Yelp we got one large drink complimentary! Sweet!!!  Plus it was self serve too!!! We decided to eat in the outdoor patio seating which was cozy & tight just like inside! There was a nice waterfall feature and various patio seating either bar height or regular table height.I had to use the restroom which meant going back inside the restaurant. I followed the server but she herself was using it first as she had the key to it! I waited impatiently as usual but there was only one bathroom. Remember this is a small place?!!! Anyway when she was done she gave me the key. It must self lock or someone can walk right in on you!!! Lovely huh?Anyway I hurried back outside because I was famished! I started to eat and Ken would say why are you taller than me? I said bc you're short Darling?!!! Jk! Naw it was bc I was sitting on their cemented patio sitting which was more stable than the patio black table and chairs which was what Ken was sitting on! And it was jammed up next to each other but yet I liked it better!As I was eating my salad I noticed everything tasted delish but I won't get those olives as I found them to be way too salty!!! Not ever again fasho!Other than that if we are in the area we will definitely come back! Of course my hubby wanted to try their pita entrees & I will definitely get a salad again but no olives for me! I guess we should yell for dressing on the side. Maybe they will get the hint??? Next time Lunch Frank?!Lol!!! Maybe William?! How about you Monica?! It's in your hood..."], ["Kenneth K.", "As I was waiting for my wife to get out of the doctors office, I happen to be looking at last weeks New & Review Magazine. There I found an advertisement for Pita Q which is a Mediterranean Grill located on the corner of Bradshaw & Folsom Boulevard in Sacramento California. It read \"Eating Good is Feeling Good\". Like they say, you are what you eat!  A few of our Yelp Comrades have eaten here and posted some amazing pictures of their salads and Pitas. My wife and myself were both craving for a salad  today so this would be the perfect opportunity to try Pita Q.We arrived around 12:30 in the afternoon. The lunch crowd was just starting to arrive. Parking area seemed small because the parking spaces were shared with the other businesses in the strip-mall. This was our first time here so it took us a few minutes to figure out the ordering process. Today process of ordering a salad reminded me of \"Pluto's or Jacks Urban Eats \"where you pick your greens, then choose your toppings and dressing.Today I ordered the \"Steak Salad\". Mixed greens with my choice of 7 different toppings. I selected red onion, red cabbage, beets, double broccoli , diced tomato and mushrooms with \"jalapeños ranch\" dressing. My wife ordered mix greens with \"Shrimp\" as her protein. Any type of protein added to your salad comes with a additional cost between 2-3 dollars depending on what you order. We ordered our salads to \"GO\". Our salad dressing was not on the side so if you don't eat your salad right away your lettuce will get soggy! So if you have a salad to go, make sure you have them put your salad dressing on the side!When you check in here on Yelp, you get a free large drink with any purchase.There was plenty of seats inside as well as outside in the patio. The employees were very friendly. We will certainly be back to try their \"Pitas, Rice Bowls, and Soups\""], ["Raja S.", "Quite good pitas: however, i felt the size was smaller... My friend suggested the bowl fills you up better :)"], ["tony f.", "I got the gyro pita! The lamb&beef is good but isn't as good as other traditional Mediterranean places but still good. Their secret sauce is good, it's a large pita and it's really filling. Horrible seating arrangements but the food is good. Price wasn't too bad for lunch. $8 for a giant pita and for checking in I got a free large soda."], ["Frank R.", "Honestly...one of the best Gyros I've had in California. They offer salads and rice bowls made to order and everything is fresh you can tell just by looking at the items. The meat in the gyro was delicious and it was a nice sized gyro also. Every single one of the guys working there were as friendly as cab be. I'm glad I stopped in as I only live just over a mile from here and I can see myself being a fairly regular customer here."], ["Rene L.", "This area needs a Mediterranean/Greek spot, and PitaQ definitely delivers the taste!  I was ridiculously hungry and craving a falafel pita (back when I wasn't gf), so off I went to try it out.  I went a bit fat camp crazy and ordered the usual suspects:Falafel pita - a lot of flavor packed in, but I wish the falafel had a bit more crunch to hold up in the pita.  The pita was a hot mess with bits falling apart by the time I finished it :-(4 good sized dolma for $3 - very delicious and generously sized for the priceHummus w/pita - $2.25 for 4 oz of hummus and a large bag of house made pita chips.  Satisfied the crunch factor with tasty hummus that was a great texture.  I hate runny hummus.I've since been back again for more good eats, when pressed for time to grab my beloved Mediterranean goodness.  I loved their falafel salad, but forgot to take a picture.  Sounds boring, but hey, I'm all about the flavor!"], ["LA M.", "Here are my straight up thoughts: Eh. Mediocre. Boring. Flavorless. I feel bad for you if you go here. Terrible customer \"service\". No name tags. No receipt. The place was full of olive oil smoke as we stood in line. The kid burned my first tortilla. I wouldn't feed those \"veggies\" to my dog. The lady in line corrected the man when he made my meal incorrectly. You can purchase the same meal at your local grocery store in the prepared foods section. I'd be mad if I had to work on a Saturday too stuck working there. Do you feel better charging $3 for \"sauce\". Good ------- luck. Y'alls reviews fooled the heck out of me!"], ["Kim L.", "I was trying this place for the first time I seen it on Yelp and it had good reviews So my mapQuest said I was down the street and I am not familiar with this area so I was like OK let me try it out.. When I first walked in everything was so clean and fresh.. I ordered the chicken bowl with vegetables Brown rice it was so good!! Did not know what to order but I did look at all the pictures that was on yelp.. They was very friendly and helpful. And since I looked it up on yelp I got a free large drink I ate there because I had to drive all the way back to Fairfield.. The food was so good I will make that drive to come all the way out here to get it again. I think I want to try the salad next time."], ["Liz D.", "I LOVE THIS PLACE!! I come here to get the steak pita, it's amazing!! Tonight I came in and had a little mistake with my take out order. I drove back and they made everything better. (They even trough in a chocolate chip cookie) They are really nice people and, I'll be back probably next week. The ingredients are fresh and I totally recommend this place!! And their very generous with the meat portions. Which is always nice. Try the criss cross fries, so good! The ranch dress is green but, so good!! Try the grilled tomatoes, yummy... We'll try it you won't be sorry. Can't stress enough how great this restaurant is!!"], ["Helen B.", "I ordered platters for a late night of working for my team. We had falafel and steak pitas, chicken bowls and rice, grilled vegetables and hummus and pita chips. Everything was great, and we had enough for lunch the next day. I think we generated new customers for Pita Q because everyone asked where we purchased it and where they were located. I love greek food, this was definitely really good."], ["Dana R.", "There was a fantastic place for eating new meditrainian food with a good salad , so delicious!!It's in Folsom you will eat your fingers try homos with fresh chips"], ["Vlad P.", "Just had the Gyro rice bowl! Always impressed flavored never dull! Great food! Always leave full!"], ["Alex S.", "This place is always clean, music always playing , i just got the gyro for the first time looks bomb !!!"], ["Binh D.", "I wouldn't say it's the best pita, dolma or gyro I've ever had in my life, but it's good. And the staff is pretty cool about letting you add whatever you want to put into your pita. Cous cous, cucumbers, spinach, secret sauce, you make it however you want. So if you're pita tastes bad, it's your fault. The restaurant is clean and well designed.Just a heads up, this placed is closed on Sundays."], ["George A.", "Omg I love this place. Rice bowl is Da bomb. Mine is totally custom. Pitas are also amazing. It all comes down to their spicy sauce. This makes this place stand out. I am addicted SPICY Pita Q sauce."], ["Fer R.", "First time here and I enjoyed it. Chelsea was the first person I came in contact with. I told her it was my first time and she explained how the menu works. I knew what a falafel was so I wanted to get something that worked with that. Chelsea suggested a falafel pita and had me choose from the many ingredients they included and also added avocado slices for an additional $0.75. The falafel pita was similar to a big burrito but had the cucumber, mixed greens, hummus, etc. I enjoyed it but only ate half since it was big. I got a 20oz green tea and the pita and my order was about $10.40, not bad for lunch. I chose to sit outside and it was very a comfortable atmosphere, had succulents around plenty of shade and a water fall off in the back. This is a nice place if you're in the mood for Greek food. I would like to come back and try another menu item maybe the falafel salad. Everything was made fresh that day and the falafels were freshly made when I ordered, everything looked eye pleasing, the restaurant was clean, the employees were pleasant and I will come back again."], ["Rouel N.", "I frequented this place a lot but recently I had a very bad experience. My girlfriend and I came in to eat as usual, and order our two rice bowls. Everything was fine until a few days later the charge was posted on my bank account. I was charged $62.72! For two F**ing rice bowls!. I contacted them to have the situation rectified. However, I have heard nothing back. I really liked this place, but after this experience I won't be coming back and will be telling my friends and family to stay away from now on."], ["Bryana M.", "one of my husband and I's go-to places to eat. The staff here are very friendly and quick to offer sample tastes of the different sauces! I am partial to Greek food so I am giving this place a high rating. The food is tasty and healthy, good prices too! Not the best location is the only reason I give this rating 4 stars and not 5"], ["Jess H.", "Just had my first experience at this fine dining establishment and let me tell you, holy s**t, that was the best food I've had in a long time. The food was made fresh right in front of us and omg... Don't get me started on the jalapeño ranch sauce...divine. And! To top it all off they were the nicest people I have ever met. We just had to go next door to get cash back to give them a tip. That my friends, is our new favorite spot. I love Pita Q."], ["Samuel F.", "Fast, and delicious. All the employees I encountered were very friendly. I had to go for the falafels. I was going to get a regular pita bread but it was recommended that I go for the tortilla bread instead and it was delicious. the only thing I added was chili sauce. It comes with lettuce, hummus, tahini sauce, red sauce, some sort of couscous relish. Just very great and only 7 bucks. I am definitely going back."], ["Sara L.", "This is a 5-star-for-the-price rating.  This was a totally pleasant surprise.  A lot like a Chipotle for Mediterranean food, and in my book a whole lot better than Chipotle.  it's Chipotle-like so you get the concept, except the choice of ingredients is much bigger, more varied, and unlike any other place I've seen.  REALLY tasty.  We had 2 \"bowls\" , one with falafel as the main ingredient and the other gyros.  We added couscous, olives, feta cheese, garbanzo beans, grilled vegetables......and there was a lot more of that kind of stuff to pick from.  And then we took it to go and had a picnic by the river.  Awesome."], ["Candace C.", "Wow! This place is amazing. Great find in Sacramento area. Staff was super friendly and helped me through my first time there. They have so many fresh and delicious options and you can smell the freshness as soon as you walk in. It's very clean and modern. They also have outdoor patio seating, which I will definitely have to check out next time when I'm not getting to go. All in all this place deserves TWO THUMBS WAY UP!!! :) hahaha"], ["Stephanie H.", "Great food. We ordered to go to eat at the drive ins. I had the chicken over rice and it was nice and hot and had plenty of flavor. I will definitely check this place out again."], ["Frankie P.", "I'm so grateful for Pita Q. High quality food at an affordable price in a shady part of town. But a new job requires a new lunch spot and Pita Q it is. Pita Q is serves Greek food cafeteria style. You go up to the line, order and pay at the register. They serve wraps, salads and Greek bowls. The bowls remind me of Chipotle. You pick your rice, your veggies, your meat and sauce. I had the chicken with grilled onions, peppers, tomatoes and feta cheese. They finish it with lemon and olive oil. It was delicious. The peppers and tomatoes were a little too soft but still good. I also ordered a side of falafel's  and the taziki sauce was amazing. The store is clean and they have a nice waterfall outside so you can try to forget that you're eating in the hood. You also get a free drink when you check in on yelp. Great lunch under ten dollars and back to the office in no time. Thanks Pita Q."], ["Jessica M.", "Tried the falafel in pita bread and their special fries for lunch. Really good!! Sat outside in the cute little patio. Loved it!"], ["Chris S.", "JUST HAD ANOTHER GREAT LUNCH HERE! NEVER DISAPPOINTED!  I ony wished they had one in Natomas! The rice plates with grilled veggies and grill steak or chicken is delious. I can't wait to make the drive down again."], ["Joe K.", "Sometimes you feel like a pita, sometimes you don't.  Pita Q has pitas, Pita Q has salads too.  You start by picking from lettuce, spinach, or cabbage, and then you choose six other items from a large array of choices and your favorite dressing.  The process is a lot like Jack's Urban Eats except Pita Q has moist, delicious falafels to add to your salad.  They start cooking them when you first start telling them what you want in your salad and they come fresh and piping hot out of the fryer by the time you get to the register.  Truly a great deal for two dollars extra or you can top it off with your choice of your favorite meat.I chose a combination of spinach and romaine with their secret sauce as my dressing and, of course, the awesomely wonderful falafels.   I am on a low sodium diets so I only ate half of them but I savored every precious bite."], ["Danny H.", "Love Pita Q! I would come here every day, but it's a little out of the way for me. Worth the trip, but I wish there was one in Elk Grove. The staff is super friendly and the place is always clean. I get the chicken salad with cucumbers, mushrooms, onions, bell peppers and feta and it is AMAZING. I have also had the steak pita and that was great as well. The pita is fresh so you need to eat it right away or it might start to get a little flaky. The food is fresh and you get a large portion. The flavors are distinct, but not overbearing. The spicy sauce has a kick to it, but not mouth-on-fire hot so you can't enjoy your meal. I feel completely satisfied when I eat here. I feel like I ate fresh, healthy food prepared to order. You should definitely check it out. Oh and try the pita bread too. Yummy!"], ["Celine Y.", "I love how organic this place always looks and the smell of all the food smells so delicious right when you get in. They have this really cute sitting area/gardening area that is nice to sit, eat and enjoy the weather. Though the place is located in an odd spot it's got a lot of spunk to it. The customer service is always friendly and patient. The food is really good, especially the pita bowl (my favorite part is the grilled tomatoes Yums), the place is always clean and tidy. Definitely will be returning"], ["Manh S.", "Love their pitas! No one else makes them this good. I'm surprised that there is not a line a mile long every time I go. My favorite is the Souvlaki Chicken Pita with secret sauce, and a side of Falafel balls with Tzatziki sauce."], ["Dre T.", "This would receive another star if they were open Sundays and later into the evening. Their hours are horrible and service is SLOW. Other than that, they're clean, friendly and the food is great! We love the patio! Best patio dining in Rancho area! If they were open in the evening and put some white tree lights up, the patio would be almost as magical as Tower Cafés. Quinoa or brown rice would be a nice addition; however, Pita Q does provide whole grain pitas!!"], ["Shane T.", "Fresh, fast, and tasty! Not your everyday cuisine so you can call it \"treating yourself\". I can tell you for a ten buck lunch I almost passed on dinner later in the evening. My Gyro was fresh and tender with homemade sauce. Please add the falafel balls as they are tasty goodness (also comes with a couple of side sauces). Staff here was very helpful and I will always keep them in mind for my Greek lunch when I'm in the area!"], ["Angela Y.", "I work close by so I come here for lunch often. It is one of the only quick healthy options around. I like how everything is fresh and tastes so good. ALL the employees are so awesome and very nice. I wish I had one closer to my home because I would prob go twice as much. I only have a 30 min lunch and I never have a problem with time. I get my food, done in usually and still make it back to work on time. I LOVE PITA Q!! So good!!!"], ["Brandon A.", "This place is right around the corner from my office.  So glad ii found it!!  Great food!!  Plus they have a lunch special."], ["Karina M.", "5 stars for the food, 4 stars because of the service. The food is absolutely great but the workers are a bit on the slow side. I have a lot of patience for people but can't help but get frustrated every time that I come here. It's usually around lunch time so it gets pretty busy which is understandable. You usually have to repeat yourself multiple times to make sure that you get exactly what you want. Regardless, I keep coming back because of the food. The Souvlaki Chicken pita is my favorite. The quality of the food and the ingredients is unbeatable. I will usually get a side order of falafel balls with Tzatziki sauce because they are delicious. Since this place is close to my work, I will most certainly come back but hopefully they can change my mind about the service in the future. Make sure to check in on Yelp for a free large drink!"], ["Terry B.", "OH MY GOD... Sweet mother of god, their felafel is to die for. I literally cannot get over the warm, mushy center of that little ball of heaven. I've been on a falafel tear for the last year since trying it for the first time in my life.. Yes, I'm in dire need of trying new ethnic foods, I'm aware. Regardless, this place has the best falafel I have ever had! It literally beats anything and everything in Sacramento, hands down. Their gyro was also very delicious and fresh tasting (easily a top 3 Gyro in Sac). It was a pleasant surprise to try this place on a whim and be absolutely floored by the quality of the food!"], ["Steve M.", "What a great place!  Been coming here since they first opened and have not been disappointed yet.  They offer a nice selection of both vegetarian and with meat options for their salads and their Pitas.  As much as I love Pita's I usually end up with one of their great salads.  It is the best around in my opinion.  They allow you to choose between a wide variety of greens (all or a mixture) as well as picking a large number of toppings and a dressing.  You can also add steak, chicken, or Falafel to your salad for a little extra $ (worth it!)Since there theme is Mediterranean, many of the spices used lean towards that cooking style/taste, however, if you are not a big fan (my kids are not) they offer standard dressings like Ranch and Italian if you are in the mood for a more Americanized salad.  We have a family of picky eaters, and everyone loves this place, that makes it a winner for our family."]], "Sam's Mediterranean Cuisine": [["Andrew K.", "So rude. Walked in. Place was empty. I'm paleo. I asked if they would make me a side of hummus and a side of gyro in any configuration and at any price. The girl behind the register went back to ask the owner and said they will only configure things as listed on the menu. They were dismissive. They just said no - flat out. Stupid. Hope they close.Edit - read the owner's response and I am in shock. First time in 3500+ reviews that someone has flat out lied. I didn't even talk to him directly but the poor cashier girl who served as the middleman. And, there was no discussion of six dollars. What he writes is simply a fabrication."], ["Amy T.", "Still by far my favorite Mediterranean place in Davis! A MUST TRY! :) Though this place is quite small (mostly indoors), they also have seats outside as well. Staff here is really friendly and they definitely want to make sure you enjoy your meal. You order inside and then you have a seat anywhere you want and they bring the food for you.All I got to say is that their Shawarmas here are the best. If you never had a Shawarma before, you definitely got to try one here! It's basically roasted meat with veggies served in a pita bread and they either ask you if you want their yogurt sauce (aka white sauce) and/or their spicy sauce. I usually end up getting both but I always ask for extra white sauce ;)My to-go order is always their Beef Shawarma :) For about $8 including tax, you get a huge meal that will make you happy. Sam's will definitely satisfy your tummys and your mouth :P"], ["O F.", "Love this place, it's a must-visit for anyone looking for a cheap, tasteful, and filling lunch . If you don't know what to get, ask the cashier, all of them have expert recommendations. There's not a ton of ideal seating so be prepared to either (1) sit really close to other people in an medium air-conditioned lil place or (2) sit outside in the shady but stagnant patio picnic tables. PROs: yummy food no matter what you get CONs: not super comfortable seating"], ["Sampson F.", "Love the beef shawarma. Always satisfies my craving for some middle eastern food. Yummy. I wish they accepted credit cards though."], ["Kim B.", "I had the falafel pita. The veggies were fresh, the sauce was good, but the falafel had a weird, spongy texture. A falafel should be crisp on the outside and not too soft on the inside. The service was good - very friendly people. It's definitely a student hangout, but not a great spot for a family night out."], ["Jonathan T.", "Small shop. Strange seating arrangement. The man at the register who takes your order at the front is also your waiter. It seems sort of strange to me because this causes you to have to wait very long for your food. He's also very friendly and talkative, which is great if you enjoy good casual conversation, but if you are in a rush somewhere, it may get frustrating watching him talk to customers about the weather when he could be taking your order instead. Nonetheless, the food here is sublime. It's Very flavorful and not too heavy. They use a secret cucumber sauce which is very well prepared and complements the gyros really well. They also serve fries here as a side which are okay. I'm really between 3 and 4 stars, but it's still closer to a 3 than a 4. Would get a solid 4 stars if they split the waiter/cashier position into 2, like how it should be."], ["Lexy L.", "My friend recommended this place to me, and I have to say it was worth finally trying this place. I ordered the beef shawarma over rice, which comes with yogurt and fresh vegetables. The food portions here are very generous, the vegetables on the side were fresh, and the seasoning on the book was great! A recommendation I would make is to add more vegetables, as the beef/rice is so rich in flavor, there is more of a need for something a little blander on the side like the vegetables. Another thing I liked about this place was the customer service. The chef was delighted that I enjoyed the food, and the girl who took my order was very polite and made sure everything was to my liking at least twice during my stay. I will definitely be coming here again!"], ["Thuy T.", "I am a huge fan of Mediterranean food, and Sam's does a pretty nice job. I think it's one of the better places in Davis, and it's really affordable, but Davis is a very small city. I always get the beef gyro, and it always satisfies my cravings. The only reason it doesn't get 5 stars is because of their lamb. I don't know if it's just me but every time i order anything with lamb in it, the texture of the meat is always very soggy. I don't know what it is, but I feel like I'm eating lamb paste as opposed to lamb meat. I'd advise against getting lamb because in my opinion I don't think meat should be that consistency. BUT the beef gyros can't be beat."], ["Allison S.", "Good food. Pita is fresh. Seating inside is kind of annoying and hard to maneuver. Not wheelchair friendly at all considering I couldn't even walk between the tables. Also cash only is a bummer. They probably miss out on a lot of business due to this."], ["Prio H.", "I have been eating here for over three years, so I felt it was time to finally write a review.This is hands down my favorite restaurant in Davis. It is a small family owned place, staffed by Sam, his son, and his two daughters. They are hands down some of the nicest people I have ever met and will always put your satisfaction as their top priority.The food is absolutely phenomenal. It is also halal which is really great because there aren't many  of these places in Davis. My two favorite items are the beef shawarma over rice, and the cheeseburger. I switch off on these two every time I'm here because even after 3 years, I still haven't decided which one I like better.Of all the mediterranean food options in Davis (Sams, Shahs, Alibaba) this one is by far my favorite. Please try it sometime!"], ["Sanford F.", "Excellent family owned restaurant. Sam's daughters are outstanding at customer service. Cashew baklava was great."], ["Abdu A.", "As a non Palestinian who has lived amongst Palestinians my whole life I will say... Sam's Med, had me feeling like I was smack dab in the middle of Jerusalem... The chicken, beef, mixed SHAWERMA was so on point.Sam's got a simple menu, not large, but what he does do... He does well. Especially the Burger.. Double... cheese... Spicy... Extra spicy.... *wipe drool*...The food was so good I had to try the HUMMUS. I mean it's a Mediterranean joint right? And boy was I happy that I went back for this order. None of that garlic, pesto, yellow pepper, asparagus shenanigans. Just some authentic, mild, ground chickpea spread. And it is NOT Sabra... ++ So no homes were demolished in the making of the product: double plus. ++The yogurt and chili sauce (shatt'ah) were great contrasting CONDIMENTS for the meal. Does Sam make it himself?So I say...If you got 7 bucks and an empty stomach head to Sam's and get a sandwich... BAKLAWA 2 if you got $9.Only knock on this place... I wish they had a FOOD TRUCK. Granted I can't take a star off for liking 'em too much, but I'm writing this review back in LA wishing o woulda grabbed more hummus...      Thanks!"], ["Derrick C.", "Beef stuffed shawarmaFresh veg, yogurt, tahiniBring yo dollar bills"], ["J L.", "I look forward to coming here whenever I'm in this area. Their food is always consistently good especially their chicken shawarma. The really nice owner often makes an effort to talk to the customers which is awesome. However, I just wish they picked up their phone sometime especially when I'm driving all the way from SF and want to make sure they are open. We had a craving for their shawarma one time over the summer and drove all the way up but arrived to find that they were closed for vacation. We always try to call ahead before driving up now but we've never had any luck reaching anyone as the phone just keeps ringing. However that won't deter us from returning as we absolutely love this place and wish we lived closer so we can come all the time."], ["Danelle T.", "Everything is good here. CASH ONLY!"], ["Sheldon F.", "This place was awesome! I love college towns, great scenery and lots of great food for decent price, this spot fit the bill for this. Excellent food, under $10. Will definitely go back. :)"], ["Crystal M.", "It was my first time coming here, I was a bit hesitant because I had no idea what to order. My cousin suggested I order the lamb shawarma.....I had no idea what I was ordering but it's ok, I like surprises. Food came out within 10minutes, warm and delicious! Generous amount of lamb, lettuce, tomato, cucumber and yogurt sauce? Any Who it was delicious!!!!!! Next time I'm definitely asking for more yogurt sauce. My cousin ordered an appetizer dish....I don't remember what it was called but I wasn't a fan at all. The place itself inside is small, there are a few tables and interesting wall paintings, there is also outdoor seating."], ["Baarkullah A.", "Intolerable customer service, decent food. My friend and I were kicked out of the (empty) shop via aggressive language because I didn't want to order food (my friend ordered a full meal, he even forced me to get fries). Even after explaining to the owner that I was afflicted with food poisoning and had little to no appetite, we were still kicked out. While leaving the lot, the employees followed us and stink eyed us on the way out. Sam might have had a bad day, but I've been a customer for over 6 years, no one should be treated with such disrespect, especially a loyal customer.In Response To Samir:Hey Samir, I just wanted to clarify a few points for you. I have definitely been a customer for over 6 years. Since my siblings started going to Davis (the oldest one graduated in ~2006), I've patronized your store multiple times a year (essentially every time I'd visit them). Last year I patronized your store so much, your son knew what my \"usual\" was (a spicy beef shawarma with tahini sauce). Your definition of \"soliciting customers\" is very different from mine. Those \"customers\" are my roommates. And if you're angry that I \"solicited\" them (asked them if they wanted to eat somewhere else because you ran out of shawarma over rice- the thing I used to come to your restaurant for) you really need to grow up and learn some empathy. It's pretty normal for roommates to want to eat together, especially if they all came in the same car. If you run out of an item, don't be offended if people no longer want to order. Instead of taking offense to people leaving, you should work on improving the availability of that item.I'm really disappointed that you didn't even give me (yes, a six year customer) a chance to explain what happened. Instead of talking to me like an emotionally balanced adult to find a way to mediate the \"problem\", you booted me and my friend out of your store (remember how I was being respectful while you were screaming at me?). It seems the only reason this dialogue is actually happening is because of Yelp-shoutout to Yelp for keeping business owners accountable."], ["Mela P.", "I just discovered Sam's and I crave this place! I usually get the chicken shawarma with a mix of the sauces and it's addicting. The lady at the front is starting to recognize me and she's super sweet :) the restaurant is pretty small but they have outdoor seating with lots of space. Also MAKE SURE TO BRING CASH! They only accept cash. I'd recommend Sam's to anyone!"], ["Karyn E.", "My husband and I feel compelled to update our review.  Sam's Mediterranean is still the BEST in Yolo County and beyond!!  Sam's has relocated to 301 B Street (formerly Ciocolat), and Sam's son has done an amazing job of beautiful artwork in their new venue.   Food and service continue to be extraordinary with expanded menu which now includes one of my husband's favorites, chicken sub, \"perfectly blended seasoning, fresh veggies, and grilled tender chicken filet.\"  \"Generously portioned entrees will keep you satisfied all day!\"  Do stop by to check out Sam's extensive menu for delectable shawarmas, kabobs, falafels, subs, hamburger, hummus, dolmas, and baklava!  Tasty, healthy cuisine served in an inviting, vibrant atmosphere (comfortable indoor and outdoor seating).  You will become an avid fan of Sam's Mediterranean and meet Sam and his beautiful family!"]], "Eat A Pita": [["Jagadhish Babu D.", "Just wonderful. Must go. Everything is just awesome.Falafals are so nice. Baklava superb."], ["Kathy P.", "I really like the food here and will come here whenever my taste buds are in the mood for something different. I haven't had everything YET, but can tell you #7 is my favorite dish. The workers are also nice. I ordered an entree and they told me it would be ready in 15 mins. I happened to be at work and wasn't able to pick it up until an hour after - they called a few times to remind me that my food was ready. When I came to pick up my order, they re-warmed my food to ensure I won't be leaving with my food all cold :)"], ["Ron D.", "So far, I have had the gyro and the schwarma, may have just misspelled that one, I digress.  The gyro is super tasty and the schwarma was just so so in my opinion.  Next time I will order the falafel and try that out.No complaints here, place is always busy which is good, right?"], ["Star N.", "This place is one of a few of my GO-TO places in Rancho Cordova.  I've tried the delicious pitas (chipotle pita is unique and delish!), the falafel salad, the shwarma salad, the gyro salad, the hummus, and baklava. I'm a huge fan of all of it! Glad they are here. Heads up if you visit around lunch time they may have a long line so go early or a little later.."], ["Michelle C.", "I had noticed that I gave this place a three-star review and one of the management of the restaurant reached out to me.  When I re-read my review and thought back to my experience at Eat a Pita, I knew I had to revise my rating to four-stars.  I will be the first to admit my mistakes.  This restaurant is good, clean, good customer service, etc.  Therefore, an updated review is appropriate."], ["Aaron M.", "Excellent service and even more excellent food every single time. Try the Chicken Shwarma Wrap & Greek Fries."], ["Anthony O.", "I used to work here & came back today. I couldn't decide what I missed most, other than my old coworkers. I decided to get the hummus plate with gyros."], ["Russell J.", "Food was great, exactly as you would expect based upon the menu. Kitchen is visible from the ordering counter and is clean and well kept.Service was fast and polite. A great spot for a satisfying lunch."], ["Tatyana F.", "I come here a lot on my lunch breaks. I love how you can call in and order your food for pick up. I love their salads! So delicious."], ["Mia C.", "I have been to Eat a Pita around 5-10 times in the last year. Food is consistent every time and relatively cheap compared to similar places. Most of the time they have a 10% off with Yelp Check-in deal going on, so that helps a bit. Service is good. I only wish they were open late. I think they close around 7pm, because their main customers are the nearby office lunch crowd.I have tried Beef/Lamb Gyro, Philly steak Gyro and Chicken Chipotle Wrap. Everything is as good as the other. But the Chicken Chipotle is something which is unique to this place, so I try to order that most of the time."], ["Bri H.", "Eh, once you've had falafel from a LEGIT Mediterranean place, nothing else compares. This place was definitely just mediocre for me. They took about 40 minutes to prepare my order since I went during my lunchtime, and my falafel was falling apart! Not only that, it lacked true Mediterranean flavor, they need to use authentic spices. They put tomatoes, iceberg lettuce and falafel with sauce, bleh. Definitely won't be returning! It's not a burger, it's a falafel, do better! Lol, two and a half stars."], ["Paulamertha A.", "Since we were staying in the area, since I had business to attend to in the Sacramento area, we were looking for something cheap and delicious. I've seen other Eat A Pita restaurants in other locations, but I never tried it until the day that we decided to dine here.First and foremost, the service here is wonderful. The lady that took our order was very friendly, helpful, and knowledgeable about the menu.The food here is delicious and they give you fairly large portion sizes at a reasonable price. I'm definitely looking forward to eating at this place again."], ["Karen T.", "Been here twice so far and got the beef & lamb gyro both times. Both times, they were DELICIOUS! The gyro is stuffed with meat, so it's definitely worth the money. Meat was soft and well cooked. No complaints here!Lunch time can be pretty crowded as people from nearby work places come. Indoor and outdoor seating is available."], ["Paige M.", "Found this by accident as it's hidden in the back of an office building.  Everything we had was great.  11 yr old son had a Chicken Chipotle wrap and said it was the best chicken he's ever had.  I had a Gyros platter.  Meat was perfectly prepared - crisp on one side.  Salad and Taziki sauce were fresh and the pita bread was soft and fluffy.  Restaurant and bathrooms were clean.  Would definitely go back again."], ["Brittney K.", "Eat A Pita is a place to do exactly that - whether it be wrapped in a gyro, dipped in hummus, or baked into pita chips - satisfy your pita fix here!Being somewhere inbetween a fast food joint and a sit-down restaurant, you order at the counter and the menu is very fun and colorful, yet the price, presentation, and amount of food is definitely more than you'd get at a simple fast food place. My one complaint was that no one immediately met us at the register when we first entered. Granted, we needed time to peruse the menu and they were kind of busy...but I feel like someone should always be at the register when customers are there. I was craving shawarma so I ordered the tri-tip beef shawarma platter ($9.99). It was HUGE (they don't skimp on portions) and the food was arranged well. If you want a little bit of everything - salad, pita bread with hummus, shawarma, and your choice of pita chips or rice, then this is a good choice. I opted for the pita chips and they were CRISPY PIECES OF HEAVENLY DELICIOUSNESS. Boyfriend got the hummus and shawarma ($7.99). There were 4 different types of hummus to choose from (original, jalapeño, red roasted pepper, and olive), and you could choose to try them all at once. We were told it came with 2 pieces of pita bread but were pleasantly surprised when it came with a whole ROW of pita slices and a PILE of sharwarma on top of the hummus! Worth the price for sure.One final note: DO NOT forget to use the check-in offer for 10% off your bill! That's another dollar you could be using to put more pita into your belly. Future you will thank you."], ["Brianna N.", "My friend thought the lamb was a little dry but other than that, this place is the BOMB DIGGITY. We both had #7 gyros platter and it was super yummy"], ["Dan K.", "This place is pretty amazing. When you're looking for something different and healthy, alternative to the typical fast food restaurants, this place definitely delivers!"], ["S B.", "This place is an excellent value. The food is good and always fresh, and their full size salads are huge. I don't go away from this place hungry. My personal favorite is the Greek Salad, topped with shwarma or gyro. I think the chicken shwarma is better than the beef, but both are good. They gyros are good too, beef (lamb?) being better than the chicken. Although Greek food isn't typically at the top of my list for lunch fare, Eat a Pita gets my regular business. The food is as good as competitive Greek/Middle Eastern restaurants with plates costing twice as much."], ["Henna K.", "The lamb was a little dry but it's really good for the price. The tzatziki sauce is TO DIIIIE FOR and the salad"], ["Blakeley L.", "I'm a huge fan now!!I still get the beef & lamb gyro.  The sauce tastes a lot better compared to the first time I had the gyro (not too sure if they had changed the recipe).Today I had tried the dolmas and they are delicious!!  I used to eat a dish similar to this (grapeleaves wrapped around meat and rice) but I couldn't find a place that did them justice, until now!The dolmas has the tartness and the filling has a bunch of flavor!  The grapeleaf is my favorite as that adds a huge flavor factor, but the sauce that comes with it changes it to satisfy my palette as well.I'm happy I found things that I liked with this place and so far, it's been consistent =]"], ["KeiKei B.", "Great, great, great lunch spot!  All the food is good and I love the white sauce they put on everything.  Service is always with a smile and the baklava is always freshly made.  They even have specialty meals for vegans and vegetarians which is great.  There are many places in the center but Pita is always the most crowded.  Went here on the recommendation of a friend and the food is wonderful.  I always have the beef points and salad and hummus.  Always fresh and the pita bread, yummy, yummy in my tummy!  I always run out of bread and order extra because with the hummus it is perfect.  It also goes with will the salad too.  I love the meat the tziki."], ["Leonard A.", "So much improvement with service since my original review.  The wait time is much better, and the tables are being cleaned quickly for the next customer.  Great job, Eat a Pita!The falafel wrap, falafel pita or falafel pocket pita with the spicy tzatziki sauce are awesome!  Similar ingredients, but it's much better with the pocket pita because you don't leave feeling stuffed and heavy.  It's the perfect amount for me.The spanakopita was huge and delicious too.  I could not finish it in one sitting.  It had layers of crispy filo stuffed with creamy spinach.  They probably should serve It in smaller triangular shapes for the same amount or cut into small squares like they do with the baklava.Love this place, and I'm going to miss it because my job has relocated.  I'll be visiting again in the future when I'm in the area."], ["Luciano R.", "We were looking for some dinner in the area and decided on Greek food. This place is great. We had the platters. Eat-a-pita platter and the gyros platter. Both were generously portioned and very very tasty! The meat was juicy and tender. The spanakopita's were nice and flaky. Very delicious tzatziki sauce! Would def come back to try more!"], ["Katie L.", "The food here is delicious. I went here for the first time last week and had to go back for more the next day. Fresh food and authentic. I do recommend to call ahead for pick up as they are super quick but that's because the food is made fresh and well worth it!!"], ["Justina B.", "The food here is alright, nothing too special.  The kitchen doesn't look to clean and when I went I had to wait about 25 min for my food...I was the only one in the restaraunt. Needless to say it is the only Mediterranean place nearby and it's good if  your craving Mediterranean but don't expect it to be absolutely delicious because the food is ok."], ["Cindy D.", "I love this place. This is my favorite to get a salad .. I usually go with a falafel salad with lamb. The meat is cooked really good. There is outside seating. Service is great because you order, get a number, sit down and be served. No need to clean up because they will do it for you. Great spot to grab something healthy and delicious."], ["Sean B.", "Eat a Pita is good and solid food, but their prices are a little high.  And sometimes they reheat meat items for cost cutting measures.  A solid choice and you will be fed well."], ["Mark T.", "Located on the southside of Hwy 50 on the southeast side of Zinfindel and White Rock Road in the plaza with B of A,  SOHO Sushi, Mr. Pickles and Famous Burgers.  Yelp has a Checkin offer for 10% off the entire bill which is great to save a buck or two if you're going to try them out. I usually order the chicken kebab platter that comes with Hummus and pita (which is good), small Greek salad and the chicken over a bed of rice for $10.99.Last time I came in I ordered the Chicken Kebab platter and a chipolte chicken pita for $5 which comes with lettuce and tomato and a good portion of their chipolte chicken.  Normally I am a fan of chipolte sauce, but I took one bite and was kicking myself for not ordering the chicken kebab platter.  It sucked and I spit it out which I rarely if ever do.  Horrible.  Wouldn't let the dogs eat it!  I usually never do not eat my food and I try to NEVER send food back.  I fear retribution!The chicken kebab platter is very good, albeit a smaller portion than my favorite place off Sunrise and Greenback (Royal Kebab) which incidently kicks this places teeth in, but I digress since i'm not seeking any \"Royalties\"It's close to my house so sometimes I get lazy and come here."], ["Maria S.", "Great place to go for lunch. We ordered the kabob plate which is a combination of beef and chicken.  I like the chicken better than the beef as it tastes like hamburger! Rice is good as well as the hummus."], ["Tina L.", "Well. I've been waiting for a a pita pocket and fries for 30 mins. It was a bit busy... but it should not take 30 mins. People who ordered after got there food before me. I got no apology nothing. I had to ask a few times where my food was. I'm still waiting and ordered at 1234... it's 105. Awesome."], ["James M.", "Garlic Fries are Fantastic.  The salads are OK.  Portions are large, you get good quality and fresh food!"], ["T D.", "This place is delicious, well at least all my two visits. But, I'd come again and have sent friends the place closes earlier than most restaurants and takes a while but it is authentic so, I guess you gotta choose. The service is wonderful and the place is casual mostly a lunch spot. They have a ton of different options from authentic to new takes. The baklava is delicious!!! Not that it's a bad thing but not a lot of pita options so don't expect this place to be like other pita places. Definitely check out, it's a nice change to the everyday and always cool to try something new."], ["SD S.", "I ordered catering for my sons birthday and all of my guests were very pleased with the food and enjoyed it very much.The delivery was just in time hot and ready to eat. I will definitely come back and order again. The combo deals for parties were a good mixture and large portions."], ["Robert Y.", "I came here during lunch hour and ordered the chicken shawarma plate. It took about 25 minutes for the food to arrive, which is kinda of a long time to wait in my opinion for a greek place. The portions were above average and the garlic and tatziki sauce that came with the meal made the slightly bland and overcooked chicken taste better. Overall, if you're in a hurry and thinking of a fast option, I would not recommend here but if you have time to sit down and chat its probably the best greek option in this area"], ["Alex S.", "I will always be back here food is bomb .i hope this spot always stays in bisiness."], ["Kali D.", "Rancho Cordova does not have the greatest food scene.  So I was a bit worried when I realized one of my duties for my new position was traveling out to Rancho to our 2nd office for various meetings.  But to gratefully my girlfriend who works up the street from the other location, suggested we meet for lunch at Eat A Pita.  1st let me say this parking lot is HORRIBLE and SUPER BUSY during the noon lunch hour but I did not let that bother me.  2nd let me say Eat A Pita was just as BUSY!!! Wow this place had a line to the door.  But as we waited, I watched as these huge salads, pitas, and wraps were carried out the kitchen.  My mouth began watering and I was ready.Trying to eat less carbs, we both settled on large size salads; Gyro Salad with Lamb and the Sharwarma Salad with Tri-tip.  We quickly grabbed a table outside and waited.  Our waitress brought our salads, and we were both blown away with the size!  Though I posted pictures, the pictures do not do it justice!  We sat, talking, eating and dipping our meat/salad into Greek tizaki sauce, salad dressing and spicy sauce. . .and both commenting on the wonderful flavors and the tender, lovely meat!  My tri-tip was amazing!  Tender, not overcooked, full of great spices, and the spicy sauce added a burst of flavor! I am big on condiments so having three sauces/dressings to dip is like heaven in my world!As we continued to talk and catch up, we both realized the salads were way to big for us. I vowed next time I would get a small salad. . .Nope that did not happen lol!  Within a week I was back (twice lol) and ordered the Greek Salad with tri-tip to-go with dressing, spicy sauce on the side; which I ate for both lunch and dinner! By the third visit the owner remembered me and Thanked me for posting pictures on Yelp.Despite the busy parking lot, and busy location I have become a Eat A Pita Queen!  I love the tri-tip and spicy sauce!  I am sure everything else is great but I usually stick to what I know and like.  Use the check in offer, it will cut the salad from $9.50 to close to $8.50 (after tax).So if you are in the mood for a large meal and Greek food. . .Eat A Pita. . .or Eat A Salad!"], ["Cindy K.", "This place is close to my house. I enjoy Mediterranean food every now and then. I also saw some good reviews for this place. For dinner, I thought we could give this place a try. Well, this must be better for lunch or something. Dinner was terrible. Meat was overcook/burnt and dry. Almost like jerky. Everything else was flavorless. I ordered a side of dolmas. I like to judge how good a place is based on their dolmas. Oh no! The was was undercooked. The dolmas themselves were puny. So disappointed."], ["George B.", "Having grown up in the Mediterranean area in the late 70's I developed quite a taste for Hummus and Shawarma. I'm always hoping to recapture that flavor by trying out Mediterranean, Greek, Persian and Middle Eastern restaurants. I stopped here and ordered the #16 Hummus Plate which included Shawarma, Falafel, Pita Bread and of course Hummus. I choose the original hummus flavor as I believe flavored hummus is a western influence and not what I grew up with. The Shawarma and Falafel was very flavorful, but the Hummus was very thin about the consistency of split pea soup. The flavor of the Hummus suffered from the consistency and had a very weak flavor. I can't say I've ever had Hummus this thin and watery and thus dropped the rating of this review. So in summary, OK if you're hungry and wanting to get your Greek on, but nothing to write home about."], ["Eagle O.", "Enjoyed another great lunch at Eat A Pita.  The Gyro was delicious and the salad was fresh.You can't beat the great service.  They never let me down.  You have to try the food."], ["Issac M.", "Service? Okay. Food? Okay. However, raw chicken and a hair? I'll never come back. That's ridiculous."]], "Opa! Opa!": [], "Café Europa": [["Letie W.", "I just picked up the gyros dinner special ($13.95) and let me tell you...it's a lot of food. The avgolemono soup is delicious! The beef/lamb gyros are plentiful. I definitely have leftovers for lunch tomorrow. There is absolutely no way I could have finished all the food. Good price for large portions!"], ["rosa k.", "Best Greek food in town, Hands down! Can't forget about the great service! I love this place"], ["Alicia R.", "I had a major prego craving for gyros today and happened upon this little gem.  Simple, slightly retro decor with a small dining area (although a giant party of about 25 women were there and there were still tables enough for all other patrons).  The (presumed) owners were super friendly, gave me a menu, and I ordered the lamb gyro with fries and a drink, plus a side of falafel.  What?  I'm pregnant!  All for $12 BTW.  Anywho, I am so glad I stopped in.  The gyro was HUGE, with super fresh veggies and the best tzatziki sauce I have ever had.  The falafel was crunchy on the outside, well seasoned, and also came with tzatziki.  I was so full by the time I got to the fries, but they looked amazing.  For the taste, the price, and the quality, you can't beat it!  I will definetely be coming back (maybe even tomorrow!)"], ["Ashley B.", "Love the family feel here and they are so nice! But the best part is the food. Delicious! Authentic! I personally love the falafel pita and gyro salad but the avgolemeno and lentil soup is the shiz too. Who knew a Greek restaurant would also be amazing at making hamburgers too?!"], ["Michaela S.", "AMAZING. Gyro lamb/beef entree I HIGHLY recommend. Customer service was great also. Overall experience was amazing!"], ["Emily J.", "I've got to give a shout out to Yelp for this find. I was in town for business and couldn't decide what I wanted to have for dinner. What I did know was that I wanted something semi-healthy and something that I could get to go.  A quick search on my handy dandy Yelp app and I was on my way here. It was fairly early on a weeknight and I almost had the restaurant to myself. After a quick menu perusal, I decided on the chicken kabob entree. It is served with rice pilaf or a greek salad. I opted for the salad. The vinaigrette is served on the side, as well as a nice portion of warm pita and tzatziki (cucumber yogurt sauce) for dipping. At just over $10 with tax, it was a generous amount of delicious food.The man who helped me was incredibly nice and offered me water while I waited."], ["Monica C.", "I can't believe I didn't include this in my original posting but this place provided the food for my graduation and they did an absolutely great food.  We ordered lamb gyros and spanakopita among other dishes and everything was phenomenal.  The owner, Taki is the nicest person and will try to be helpful in any way possible.  I believe he even lent us a couple of catering trays that have those burners underneth.  Recently, my brother and sister graduated from Sac State and we had a gathering for about 20 people at the restaurant.  We brought in linen and they set up an area for us complete with a menu that included appetizers, main course, and sides.  The corkage fee was super cheap and we even brought in a cake.  The food is always so good that even those that aren't open to trying new things (a lot of my traditional Latin family) have nothing but positive things to say."], ["Julia D.", "Been here twice now. Super fresh both times. The guy working the register is quick and polite. Definitely an excellent spot."], ["Mike P.", "The genuine experience we had this restaurant takes me back to the days when you would actually see and meet owners and their establishments. The owner was the gentleman working who helped us through our meal. He made some great suggestions and answered all of our questions and it's good to see someone taking pride in their place. I'm shine Gyro fanso I was drawn to this place like a Junebug to porch light. Their Gyro was a nice portion size and very good flavor. The only comment I can make is that I wish they had put the Tzatziki sauce in the pita instead of on the side. But it was still great. My wife got their chicken club that was served in the pita and my son got a grilled cheese that was also served in a pita. Then we shared order of the Greek french fries. Crispy french fries with creamy for cheese, seasoning and lemon. Sounds kind of strange but the flavors really came together it was a nice change to fries. If I'm in the area I will be back."], ["Blia L.", "I LOVE their gyros, gyro fries, and falafels.  The price is good for what you get.  Whenever I'm in the mood for some tangy feta Mediterranean food I come here.  It seems to be a family business and a lot of the customers seem to be repeaters.  I think that says a lot!"], ["Stan B.", "Love this place! It's run by a family who is always so friendly and accommodating. Ask them about the menu! They love to tell you about their food and get you what you want. I've been here several times and it's been delicious each time. It's a relief to have a locally run, non-chain food option in the middle of what is quite frankly, a bit of a good desert. I always look forward to being on this side of town and grabbing a gyro :) Plus they always have the Giants game on, so what more could you want!"], ["Helen F.", "Amazing food! They are so nice too! I wish I lived here so I could eat here every day. I love the chicken gyro and lentil soup. My husband also loves the lamb/beef gyro.So delicious and what great service."], ["Caitlyn W.", "The people working there were SO friendly. The kabobs are amazing. Great pita bread. If I lived around here I'd be returning."], ["Megan F.", "Best Gyro ever! This restaurant is a hidden gem. If you love Greek food, this is an excellent choice. You will not be disappointed in any choice you make. The baklava is so delicious. I highly recommend this place!!!"], ["Marina A.", "I went here for the first time yesterday, and I loved it. It's a small cafe right before the big shopping plaza on Howe bout Arden. It's hidden, so it took us a minute to find the place. Once we entered, the owner( I think he was the owner) greeted us, and was very welcoming. We ordered a special beef/lamb gyro, Greek salad, and Greek fries. We came in around 7pm, and there were about 5 other customers in the cafe. We received our salad within 5 minutes, and our food about 10 min later. I absolutely LOVED everything we ordered! Everything was so FRESH, and authentic. The tzaziki sauce was so delicious with the fries and the gyro! The owner was so friendly with all of the customers, and you don't really see that very often. He makes you feel welcome which I really liked! We will def be coming back, and comparing this to Opa Opa, Cafe Europa is way better!"], ["Luis L.", "A must in Sacramento! The food here is so good! I started coming here in college some years back and took about a year (or little more) gap away from this place once I moved, but when I came back.. The food was just as phenomenal as ever! It's set the standard for Greek food for me and nothing has come close so far. What to order? Everything! From salad, to chicken, to lamb, to gyro, to pita, this place delivers deliciousness every which way!  The chicken (all the meats) are tender and marinated perfectly with their special Greek sauce. Just melts in your mouth! My favorite dish is the chicken over rice pilaf. Huge fan of rice pilaf and theirs is fantastic! It comes with an order of pita bread and an order of salad. Btw, the dressing on that salad is to die for!This restaurant brings out the beast in me! I come in, talk to the friendly owner (very nice guy, always willing to help or give recommendations), order my food, wait for it, and once I start eating it, I don't make a sound until my plate is clean. The Arden area isn't generally the best spot for great food, but this hidden gem delivers!  Do yourself a favor and if your ever in the area, stop by Cafe Europa. The only regret you'll have, is not going."], ["Kathy N.", "I'm not too familiar with greek food, so i probably would not have gone here if I was not with my friend who recommend that we ate here.Upon coming in, it was empty. There were two workers who greeted us and showed us the menu. I don't remember the name of the food that we got, but it was the #1 sandwich and the greek fries. The sandwich looked more like a \"pita\" rather than an actual sandwich, and the portion was fulfilling. It tasted great and is something new that i never ate before. The greek fries were delicious as well. I didn't finish my food because i was full, but i took some home because everybody knows that leftovers are bomb.com the next day. Unfortunately I forgot my leftovers in my friend's car, BUMMER! It's okay though, i'll be returning here to eat again when i get the chance.Oh i forgot to mention, fellow sac state hornets also get a 10% discount on their meal with a sac state one card!!!"], ["John O.", "We've been here a few times since I'm a sucker for Gyros, but after our last visit I can't just get the courage to come back. My partner is a vegetarian and usually goes for (and likes) Greek because of the hummus, falafel, etc. The funny thing is... the last time we went together, we both got sick! Now, remember that I'm a carnivore and they're a vegetarian.... the only thing we both ate was that I had a bit of falafel. About twenty minutes after leaving we both got massive headaches and had to cut our errands short and go home. Later that night, the partner tried to eat our \"to go\" leftovers and got a bad bad taste of the falafel and had to toss it out - a bad enough scare that we just tossed it all out! I had made the mistake of ordering the Taky's Gyro AND Greek Fries (more than enough potatoes), and they got an extra greek salad by mistake because the kid running food to us brought out an individual salad to our table instead of the falafel/salad platter. So that meant a bunch of fries, salad, and falafel went into the garbage. Boo!Cafe Europa is no-frills, and in a dying little shopping center that used to house Great Escape Games and a Pet Shop - about the only reason we go in there now would be if we wanted Mongolian BBQ. The service is a little odd - you order at the counter, like a regular \"fast food\" restaurant, but then they bring your food out to you... need ketchup? You get a few packets of no name generic condiments. The food isn't BAD, but it's just kinda average-to-overpriced, which sucks since there aren't a lot of Greek places nearby and Greek Village Inn closed a few years back (I've heard Opa Opa is overrated but haven't been and that's the only other place in the area I know about)... also, apparently they mash(?) their falafel and this is an odd thing, according to my partner-in-crime. Maybe it's the handmade thing. We're not sure. Normally Cafe Europa would get like 2-3 stars but thanks to the food poisoning.... sorry, can't recommend and would not do again."], ["Issac M.", "Food is excellent. The staff is as well. Had the gyro and chicken plate. Came with rice, tiziki and pita bread. Ran about $14. Easily two meals but since I eat like a grizzly, it was only one serving for me."], ["Mimi J.", "Looking for a quick bite on a dark and rainy evening in Sacramento I was guided by my Yelp app into this shady looking little strip mall.  I didn't much like the looks of the parking lot, but I parked just outside the Cafe Europa's storefront and wandered in.  It was deserted so I was helped immediately.  I love Greek food, so it's often hard for me to settle on just one item to order.  The man working behind the counter was quite helpful and I finally settled on one of their gyro sandwiches.  I chose the Village Gyro which came with seasoned meat, tomatoes, onions, fried potatoes, and creamy taztziki sauce.  For the uninitiated, tzatziki sauce is a creamy tangy yogurt sauce flavored with cucumber, garlic, and mint.  It is the traditional topping for gyro sandwiches and is de-lish.  It's probably my favorite thing about Greek cuisine.The gentleman asked if I wanted fries with that (bad fast food flashback) and I said no.  He then proceeded to describe to me - in detail - the Greek fries.  They are french fries covered in feta, lemon juice, and oregano.  Could you have resisted?  Neither could I.  It didn't take them too long to get my takeout order ready and get me back on the road, and I whiled away the time sipping on a soda and watching the rain fall.I really meant to just try a few fries on the drive back to the hotel and eat the gyro there.  Really, I did, but it turns out that it is physically impossible to et just a few Greek fries.  Once you start dipping into that well, you can't stop till it runs dry.  Both the fries and the gyro (really tasty) were gone before I could reach the hotel and my tastebuds and tummy were both well pleased.  My only regret is that I didn't order any baklava to finish off my meal.Don't you make the same mistake."]], "M&M Pita Sandwiches": [], "Kabob & Gyro Grill": [["Nancy X.", "Food is okay here.  I only have been to place once.If it was a bit cleaner I would appreciate it a bit more.  The restroom are located past the food,  kind of weird.  The set up of the place is weird.  Other then that the food was okay It seems unclean."], ["Sandy R.", "Found this place on Yelp while driving to Sac.  What an awesome find!!  Great food, fast and friendly service.  The lamb/steak gyros were delicious,  and the tzatziki sauce so complimentary.  The salads were fresh with just the right amount of dressing.  Our youngest daughter who hasn't yet developed the appreciation for Mediterranean cuisine was thrilled with her cheeseburger and fries!   Another great Yelp find,  our bellies are full and happy!"], ["Omar Q.", "Guys working there are always nice and friendly. But what really makes this place my go to spot is the amazing food. I always get a gyro sandwich or plate."], ["Victoria V.", "This is the first time that I have had food from there. The food was great. We got in and out with time to eat our lunch before going back to work. I will definitely go back and try different foods. I ordered the Chicken Philly Cheese and was good"], ["Nando V.", "I'll fux with this all day omg is so good!!! I honestly dont know what to order but anything and everything u order is sure to be good only thing i cant seem to ever order is that greek drink, shit seems like it would be nasty but other than that this place is great!!! Get ur ass over there and try it tell em nando sent u, wait never mind dont do thar cuz they dont know who i am lol but seriously this place is great!!"], ["Nathan B.", "Family run and always good. I have a tough time deciding if it is a gyro or schwarma day (usually schwarma!) and which kind of meat. The lamb (ask for spicy) is pretty good!Tip: ask for a side of their hot sauce. It might cost you a quarter or so but it is worth it!"], ["Shawn R.", "I've gone twice and both times the food was grease.  There are better choice like the Kabob Palace ... yes it costs more than here but you get what you pay for."], ["Kristen K.", "Have to give 5 stars to this family operated restaurant. Their gyros are the best - not just in town, but anywhere! We get the mild chicken or veggie at least once a week. Their homemade baklava is wonderful too. The mom makes the salad the best too but the whole family is nice, although good luck trying to get through on the phone"], ["Jen Y.", "Food was tasty and came out in record time, but you don't get very much for the price. I ordered a combination plate with steak and chicken, but I had actually wanted to order a combination kabob. The woman at the front wasn't really helpful and wasn't friendly enough for me to comfortably ask her about the menu items. It was $8.99 for rice, a small amount of chicken, some beef, a small salad, tzatziki, hummus, and half of a pita bread. It sounds like a lot, but it was just a little of everything.Favorites were the chicken and the hummus, although who doesn't love tzatziki? Least favorite was the beef. Definitely worth another go, but maybe not when I'm starving."], ["Sherrine K.", "I love this place. Best meat ever. Waaaaay better than Petra's. Like you can actually crave this place, not just be like - \"Oh I'm drunk, what's open?\"Good meat, cheap prices, meal deal is worth buying.Just a tip: check your food before you go, just in case... Only been a couple times that I received the wrong meat, but hey, it's bomb enough that I don't care and will keep coming back."], ["Ashraf H.", "Very good tasting lamb Gyro. Very friendly staff. Will have to try the kebabs and shawarma some other time. Would be nice if they had fountain drinks instead of soda cans."], ["Debra A.", "I would never want to give an unfair review or not give management their due. The owner responded (which I appreciate)  and said I may have mistook the reuse of the bread when their religion says they can not toss bread away with regular trash. He said there is a separate trash pail for bread that is trash. I respect that and yes, I could have made a mistake as to which trash it had  gone into EXCEPT, I never saw it go into the trash - I saw it go onto another plate with food. MAYBE, just maybe the woman mistook the pita she was putting on the plate as bread that hadn't been offered to another customer. These things can happen, especially on a busy evening."], ["Erin H.", "I really enjoy the family atmosphere here, they are very down to earth and the food is amazing! Wonderful people and I always leave in a better mood!"], ["Mark L.", "@Debra Hello I am the owner of kabob and gyro grill and would like to reply to a comment made by Debra. I would just like to reassure anyone reading the comment about the procedures taken at kabob and gyro grill. At kabob and gyro grill we take the safety of our costumes very seriously and would never reuse any food that is sold at our restaurant. This goes against our morals and principles at this establishment and when we asked our staff members(close family) if they would ever do a thing they replied \"absolutely not\". The reason the staff member did not throw the bread in the trash with the rest is because it is against our religion to throw bread where other trash is in. This is why we try our best to not throw them away and have a separate  trash can under the register where we throw extra bread. We apologize for any confusion regarding this issue and hope to see you at kabob and gyro grill."], ["david c.", "Wow, I got the lamb and chicken combo kabob, the meat is super tender.  I didn't expect such high quality food from a local elk grove place."], ["Gianna D.", "Delicious! I only wish we had come here sooner. I ordered the combo plate and my boyfriend had the lamb gyro I think. We both really enjoyed the food. Medium wasn't that spicy and I would probably order spicy next time. Can't wait to come back!"], ["Del S.", "Oh, how I've missed their food.  They used to be located in Lodi, and I was sad when they moved to Elk Grove.  The restaurant is located in a more appealing geographic location.  The surroundings are simple, but clean.  As I always say, I'm not necessarily here to enjoy the surroundings.  It is all about the food (especially when I'm taking it to-go)Love, Love, Love their combination platter.    The platter came with the Chicken/Gyro meat combo over rice.  Tzatziki sauce and hummus are so good (I need to order extra for next time) along with salad and yummy pita.  Definitely not enough (I had tried their cheesesteak sandwich and wraps in past and both were tasty)  They make a delicious burger... yes that's right... they make a simple but awesome-flavored burger)  I will definitely order those next time.Thanks for satisfying the long-time craving, I will return."], ["Yvonne N.", "So I finally returned for their falafel since I had to eat vegetarian that day. Ordered the falafel wrap on its own (no meal) and a side of baba ganoush!  I was afraid I would be left hungry because the wrap was so tiny!  However, I was so full, I couldn't even finish the baba ganoush. Their falafel is very tasty! I would order it again even if I didn't have to eat vegetarian. What makes this place amazing IMO is, surprisingly, their tzatziki sauce. It's perfect in texture and taste, so good that I scooped it with a spoon and ate it like yogurt!  Luckily I had asked for extra. =]. The baba ganoush was just okay. I was enticed because it has eggplant in it but next time, I prefer hummus.  Solid 4 stars!"], ["Staywinning J.", "Very good, very fresh! He meat is wonderfully seasoned and tender and fries are really good as well. A definite must try in Sacramento!"], ["Cindy N.", "My family loves to grab dinner here! It's our go-to gyro spot in EG! My favorite is the chicken Mediterranean plate. I get it extra spicy because it's a lot more flavorful. Nice variety of protein, carbs and veggies on the plate. You don't have to feel guilty when you eat here - it's light on your stomach :)I've been coming here since they first opened, and I noticed the wait is a little longer but it's nothing too crazy. 20 minutes tops! Always great customer service whether I dine-in or out!"]], "Petra Greek": [["Jackie S.", "Located in midtown, parking here is pretty icky. It's free parking every weekday after 6pm if you can find one, but you'll be looping around for a bit for a parking space around this popular strip. Came here on a Friday night and they are seriously understaffed. There was one woman who was taking the orders, delivering the food to the tables, and checking up on the customers. However, you can see the kitchen from the front and it was kept very clean. This is one of those places where you order and pay up front before you go to your table. What I didn't like was that the menu on the boards didn't have descriptions; I had to rely on the takeout pamphlet to see what was included.  I got the veggie souvlaki because it sounded the most interesting with all these different veggies; the meat options seemed a little scarce on the greens. I was hoping this joint would be on par with Sam's from Davis, but it didn't quite impress me. The pita bread was grilled on the stove for a while making it soft and warm, but as a result it was way too hard to even hold up to eat as a wrap. I ended up eating it with a fork and breaking off the pita bread a bit at a time. Speaking of the contents inside, there were a lot of veggies, but it was pretty oily.. like there was a bit of a pool of grease. Their thick and slightly tangy yogurt sauce was on point, though!"], ["Debra A.", "Love Petra. Being a NYC girl, I am used to Greek diners at every corner. :) I really miss the food. Petra works for a quick meal. I enjoy going there for lunch. everything is good, fresh and hot when you get it.One suggestion, if you're ordering a sandwich wrap - check your receipt. They have changed me for \"plates\" several times. Other than that, it's a great little place."], ["Nick G.", "I've been here a hand full of times, as I live only a few blocks away, and I have to say, I'm still a little confused.  The very first time I went, everything was AMAZING.  I got my usual, a gyro, fries, and something extra on the side.  Meat was tender and juicy, just dripping with flavor.  The second time I went, everything was horrible, like I'm talking I threw it away after the halfway mark.  I would have complained but I got that one to-go.  Meat was dry, and burned in some sections, fries were nasty.  and every other time I've gone has been somewhere in the middle.  Overall the place isn't bad, but just way too inconsistent for me.  I never know if I'm gonna get something I'm happy with, or if I'm let down.  I still come here from time to time because I'm so close, but no, I can't really recommend it.  Go here at your own risk."], ["Anne W.", "Pork Souvlaki, Greek Salad, and Fiery Feta. The holy trinity of Petra's. My favorite thing to get there. It's super busy during lunch hour so call ahead or just go during happy hour. But, must try if you are in the downtown area with a craving for Greek food."], ["Steve G.", "This place rocks!  I am a huge lover of Greek and Mediterranean foods.  After working in a Mediterranean establishment for a year (Pita Q) I am shy to admit that I also love PETRA!!This restaurant is literally 1/2 block from my office and I go there often (my wallet says too much) LOL  Even if I call in an order, they recognize my voice (hint Steven, you might need to branch out...LOL)  NEVER!!The food is fresh, delicious and so satisfying.  I love their daily lunch specials...yep, I have gone every day to try them.  The souvlaki chicken is tender and tasty, the firey feta is, how do I describe this?, HOT and a treat!Keep up the good work guys!"], ["Kelsea M.", "Came at 2:20am and they were closed on a Thursday when their hours are posted till 3am Monday through Friday....."], ["Kevin J.", "This is currently my favorite greek place within minimal distance of midtown. I like the chicken, the beef/lamb, the pork is a bit fatty though. I tried the beefteki, but it came medium rare which is great for the beef in it, but not so great for the pork in it. The sausages look good as well. You can get beer on tap, tasty fries. Nothing to really dislike here except for the fact it can get packed fast."], ["Peter O.", "This place is located in Downtown Sac where all the other good foodie places are. Let me tell you. This place is awesome! We ordered everything off of the happy hour menu and we had so much leftovers. The three dip was delicious, especially the hummus and Tzatziki (cucumber yogurt sauce thing). Also ordered the chicken and pork kabob things, were nice and juicy. The flaming cheese!!! (Saganaki) was delicious and cheesy. And the feta fries were amazing! The fry sauce is equally amazing. I can't wait to go back. Everything was soo good here."], ["Dianna F.", "Don't like Greek or Mediterranean food - this place will forever change your mind.It's a busy part of downtown, right next to the Firestone Public House, so be prepared to hunt for a parking spot, even on a Monday night after 8 p.m.  We walked into the place, it's very nice and bright and happy.  The smells were amazing. I've eaten Gyro's before but it's been hit or miss.  I wasn't excited to go but Jeremy had mentioned us trying Greek so I said what the heck and the reviews were great and the menu sounded tasty so I decided to give it a try.We started with the Chicken souvlaki Plate for $12.99.  It is chicken skewered and seasoned with Greek spices, cooked over open flame, served with rice pilaf or french fries, Greek salad, tzatziki sauce or Greek yogurt and pita bread.  We ordered the fries. Which if you're new to Petra they also have Petra Fries which are french fries with feta cheese and oregano.  We wanted the Petra fries, they are not the ones that come with the \"plates\". But Jeremy upgraded our regular fries for Petra fries and only paid an additional 50 cents.  We also go the tzatziki sauce and not the Greek yogurt, I can have that anytime.  You get a good amount of food on the plate.  Two chicken skewers with about 5 big chunks of juicy spicy chicken meat, a nice size salad, a nice large bowl of tzatziki, good helping of fries, and then four pieces of pita bread.  The food was beyond amazing, we were not disappointed in anything we ate, and we ate a lot.  Everything was super fresh, the spices were amazing, the meat tender, the salad crisp, the tzatziki sauce (I'm officially in love), the fries and the pita were fantastic.  We shared a plate and I seriously could have eaten a whole plate myself. After the chicken souvlaki plate, Jeremy was still hungry and I wanted to try something sweet.  So Jeremy ordered the triple dip plate for $7.99.  This dish is big and could easily feed 3-4 people as an appetizer before a meal.  It consists of  tzatziki sauce which is cucumber and garlic, revithosalata, which is Greek hummus, and tyrokafteri which is spicy feta cheese; and lots of pita bread.  I absolutely cannot tell you how delicious this is.  Have you ever tasted spicy feta cheese? I had never tasted that. I'm in love and addicted. I want more of that food right now.I also had the chocolate baklava - it was fresh, buttery, nutty, and delicious.Please go, you won't be disappointed."], ["Jenn N.", "This place always seems to be packed. It's somewhat self serve, in that you order at the register, are handed your drinks, go find a table & wait for your name to be called. On the night I was there, they were bringing everyone their food. I ordered a gyro plate & it was delivered to me in what seemed to be less than 2 minutes. I couldn't believe how quickly they prepared it. It was so delicious. The meat was shaved thin and melt in your mouth soft. The pita bread is fresh. The yogurt sauce was very thick and oh so tasty. It lives perfectly in-between sour & rich. The hints of dill are not overpowering. The rice was cooked perfectly. The tomatoes, cucumber, olives (pits, watch out) and red onion are cold, fresh & crisp. They bath them in a layer of feta. Your biggest problem will be deciding what you want to add to each bite because your mouth isn't big enough to accommodate it all in one bite!Happy hour is nice: $1 beer & $4 wine."], ["MyShawn C.", "Yeah buddy.  My first Greek restaurant and I liked it.  Had a lamb plate with a great Greek salad and the sauce was so very good.  I ate myself into a coma.  No really, went home at 4pm, passed out and didn't wake up till the next day.I was full and satisfied."], ["Jen-Ann L.", "Came here on a weekday for lunch expecting it to be quite crowded. Lodged between two more expensive restaurants in the heart of downtown, this place had very high expectations. Yet, it not only met, but exceeded my expectations.We ordered two lamb gyros and Petra fries. Both were very well executed. The meat was very flavorful and the fries covered in spices and feta cheese.While the restaurant is quite narrow and long, there are a few tables to dine at and darker lighting. This place seems more casual than those around it, but did not fail to have an extensive wine list. The staff seem polite and hardworking; the food was ordered and brought out quickly.Although this place is a little pricier than your average Greek food, it makes up for it by having a prime location and quality food."], ["Carmen A.", "I come here every Friday for happy hour after work with friends. It's a really nice place and the food is awesome! I'm so sad that this is the only restaurant that sells Fix, but I guess that's how they have me keep on coming. During happy hour the beer is $2.50 and if you have never tried Fix before, highly recommend when you come here!Aside from the Fix beer, the Saganaki is hella delicious (nom nom nom). For $6.99, it comes with fresh pita bread. It will definitely fill you up even though the serving looks small. I have to get the Chocolate Baklava every time with the Fix beer. For me, it's a really good combination. If you don't like sweets, then don't get it because it can be very sweet, but the portion is small, so you'll be able to finish it without feeling sick. If you tried baklava, you know it is sweet. I really want to try the Petra fries because it looks so good. Guess i'll have to try that next week Friday. It's a smaller restaurant, so it can be very packed and loud, just like any bar or restaurant during happy hour. There is limited seating, so if you are coming with a party of 4 or more, come when happy hour starts or else it will be difficult to get seating."], ["Tiffany F.", "The food was hot and fresh. Rice cooked perfectly. The tzatziki sauce is out of this world!"], ["Antonio D. M.", "Beef Gyro!!!   It's good stuff! Late night after drinkin in midtown Sac..hit the spot. First time here. Good quick service."], ["Scott P.", "I have great memories of this place.  We have come here many a late night to satisfy our Greek cravings when we are in Sacto.  The more recent visit was a bit more disappointing.  The food remains good.  The chicken gyro and the beef/lamb gyro are fantastic.  The pita has a good grill/toasted flavor but is still soft.  The yogurt sauce has just enough seasoning and tanginess to it.  The tomatoes and onions are fresh.  In my opinion, I wish they would not put the fries in them but it does not subtract from the taste.  My nephews got the burger this time which we have not done in the past.  The patty needed more seasoning and just was ok, kind of like a frozen processed patty instead of fresh but the cheese and the bacon were very good.  The fries were crunchy and had just enough salt.The real reason I was disappointed was the service.  They were very slow at cleaning tables despite it being busy and people standing around for tables.  No smiles, no greetings.  I don't know if people were having a bad day or what but ths is not what I have experienced in the past.  I am hoping the service is better but I will still be back because I do crave their gyros."], ["tiffany m.", "Love Petra Greek! Their food is flavorful and I love the Greek salad that comes with the plates! I usually order the Chicken Souvlaki plate which goes for $13.75 +tax. I thought it was a bit pricey on my first visit, but after receiving my plate, it's well worth it! You get a side of your choice; rice pilaf or french fries, greek salad, pita bread and greek yogurt or sauce, along with whatever protein/vegan choice. It's definitely fulfilling! The service is alright. You place your order upon arrival at the counter, take a number and depending on who is working and/or how busy they are, they will call your name or bring you your food. It's usually busy in there when I go (late evenings- between 9-11pm) on any given day, but the wait is never long and I have never had a problem with seating. It's definitely worth a try. I love how they are open late, for night owls like myself :)"], ["Gary F.", "Amazing!  We crave this great Greek place.  Everything we have ever had was awesome.  Our only criticism is that the hours or operation are a little strange.  We wish they were open for lunch on the weekends.  We recommend everything!"], ["Darina H.", "Low key, informal and casual place for good Greek food.  Ordered the lamb gyro pita and it was amazing!  I love that they put fries in there too!  Make sure that when you go in, you grab a table since seating can be a bit tough.  The staff are friendly and you can find an assortment of beer on tap.  Bathrooms in the back. Portions are pretty big as well. Yummy, simple and the price is not too bad.  I've had cheaper Greek food elsewhere, but you are downtown so the prices will be a bit more."], ["Eileen L.", "I've been on the hunt for a delicious lamb gyro pita and Petra Greek satisfied my craving.The meat is thinly shaved and fries are wrapped in the gyro. Lamb meat was  flavorful. We did get the Petra fries on the side, which I really loved! I'd go for the fries alone. The yogurt sauce tasted fresh and yummy.Layout of the place is on the smaller scale and gets super packed around dinner time. You order, pay at the front and they bring you the food.I need to return and give other items on their menu a chance."]], "Ariana": [["Alexis J.", "Can i give 6stars? Food was so so good my first time here with the hubby and baby girl, service was good food was really fresh & servings are huge was not disappointed at all, i was even given a dessert to try ;) oh man i'm in love with it (chubby girl problem) hahah. Would recommend again and again will be back soon, and buying dessert next time. :)"], ["Yvonne N.", "I am so ecstatic about Ariana's recent opening in Elk Grove!!  I haven't quite found a good gyros in town yet and hate always having to drive to downtown to get my gyros fix.  I ordered the lamb gyros combo with garlic fries for lunch and was stuffed and completely satisfied by the time I was done. Their naan is soft and tasty, not chewy like some places.  More importantly IMO, their tzaziki sauce had the perfect texture, not too creamy nor too watery.  And even more importantly, their lamb was flavorful and tender. The only downside is that it was a bit oily but I'm not complaining!  As for the fries, they weren't crunchy and not the best fries I've ever had.  However, still edible enough for me to finish majority of it.Next time, I'll be ordering their tri tip kabob.  For those prices, I'll soon become a regular!"], ["Michele T.", "Big place & super clean (a must)! Their food is phenomenal! The best gyro I have ever had. Service was great, friendly staff, nice, and very attentive. I will be back."], ["Mrs Drc G.", "Bomb.comNuff said .... Been here twice yum! we've ordered every chicken combination and they have been delicious."], ["Fran T.", "I've been to Ariana several times, in fact going to hit it up tonight for dinner...decent prices and found the food to be consistently good.I'm partial to the burrani banjan, mantoo and bolani in that order. Fresh and made to order...my family has had the spicy lamb gyro as well as the regular gyro, and have never failed to enjoy the meal.  Everyone always leaves with a packed artery, er I mean tummy and a happy palate.It's a small restaurant in a strip storefront setting next to Osaka Sushi and 24-Hour gym.  We like to support the local economy, and although it's a bit longer drive than Chopan Kabob House or Kebab Palace, it's worth the drive for the delicious burrani banjan...it's no joke!"], ["Jack J.", "First time at this place and I have to say it was pretty nice. The place was spacious and clean. The service was excellent. The waiter came back to check on us if we needed anything else. That was a plus in customer service! The food was good, and the portion was good. Best part is waiting for our food...because you can smell the food cooking. And the wait for our food wasn't that long. Prices wasn't bad either! Go check it out! I know I will come back again!"], ["Tony L.", "This place is LEGIT!!!I cannot believe that as often as I go to the UA plaza, I miss this restaurant. It is literally a diamond in the rough. My gf  and I decided to settle for this restaurant because it was close to the movie theater and we had a showing time that limited us from driving elsewhere for food (best decision we made for the night besides the movie). My gf had gotten the Bolani and I had gotten the beef/ lamb gyro which were both amazing! The Bolani was huge, we will  most definitely order a half size in the future. The gyro was well stuffed and the meat was very good. This place  does not skip out on the portion. The entrees were fairly priced compare to most restaurants that serves this type of cuisine. This place is just like any other take out places with ample seating and cleanliness. Customer service was 3/5 but, the food most definitely compensated for that. Will return again."], ["Kiko Y.", "First time here don't know what to expect. But the food here is way better than what I had expected.  The staffs are very friendly. I just find my self another place to eat."], ["Mamie K.", "I've been here before for lunch with my co-workers. Food here is really good. Service here is great. They are very friendly.Brought the family this time for dinner.  We ordered the Beef/Lamb Gryo with garlic fries. Garlic is actually raw & is tossed in with the fries - nice strong kick!! Also ordered the Beef/Lamb Gryo bowl - SPICY!! Hubby really liked it. I tried something different called a bolani. It's like a quesadilla made with potatoes & green onions served with a cilantro lime sauce. A full order is HUGE! Very tasty vegetarian dish. Everything came out piping HOT!!  Food is very fresh & has great flavors.Will have to come back & try another dish. Saw an eggplant dish I will need to try on our next trip here. Kids luv the place. Will definitely be coming back."], ["Jeff S.", "Found this place accident and I'm impressed. 4 star quality and 1 star prices. I'll be back soon."], ["Stephanie T.", "The sign over the door says \"Ariana's,\" but the menu reads \"Hookaholics.\" Just in case anyone gets confused, like I did. I came here on a weekday for dinner with a group of 6 people. This place looks like an old diner, and is not aesthetically pleasing at all. A lot of people ordered the gyros, which everyone seemed to enjoy. I ordered the chicken kabobs with rice and the salad. It was really good. Service could have been a bit better. My friend ordered the eggplant dish with a side of rice. The server said it didn't come with rice, so she asked for it on the side. When the food came out, there was no extra rice for her, so I gave her some of mine. Overall, the food was decent, but not the best. I live 40 min away, so I probably won't be back here."], ["Keyyna W.", "We love this place!!! I love the eggplants, so good. There is a great selection of food choices. Try it out"], ["Tuan P.", "So today I went to this place because I always saw and heard of gyros on tv and all around sacramento and i really wanted to try one! So I went to this place and it was AMAZING. My first bite was beyond what I thought it would be... It was so delicious and fulfilling! Especially because I was super hungry and I just got off work. The garlic fries although make my breathe smell awful, it was totally worth it. They were perfect! Also had great customer service! As soon as I walked in the man cooking and the cashier asked how I was doing and what I had going on. Definitely one of my favorite for my first time and soon to be a regular!"], ["Vicki R.", "Not much flavor and wrap was chewy and old"], ["Levi C.", "This place is so slow. Dont come here if your in a rush or hungry! Ridiculous! 30 minute wait for gyro and not even busy!"], ["Ashwin S.", "The best gyros in town! Everyone should give this place a chance. They are really good and provide good customer service."], ["Derick F.", "TL;DR: 50 minute wait for a steamed Gyro and Fries. (togo)Service:Chris E. and Brian M. are directly on the target about the Wait. I ordered my food at 6:37 PM the guy said it would be a 25-30 Minute wait; I said that's OK and I went to quickly's to get some boba and popcorn chicken to take home from my brother. Fast forward 30 Minutes later I go back wait 10 minutes and I see the guy I ordered from leave with his family. I dont think he toldl the other people about my order because when I went to check back The guy ahead of me ordered the same thing and paid he got his food right away. So I think these guys gave my order to him. So I waited longer for the food...Food:Prices are really good $6.99 for a gyro, fries and drink. You can upgrade the fries for $1. The food was pretty good, but i suspect that the food would have been better if I ate in the restaurant. The gyro was tasty, had a good meat to veggie (tomato, cucumbers, lettuce, onions) ratio and the fries had a nice flavor. My only complaint is that they should cut vents on the Styrofoam container (like how Chinese restaurants do for fried food). Since there wasn't any ventilation the food steamed itself in the container and the crispy textures of the fries and pita became lost.Note: I will come back to eat here, but I will order on the phone and eat ouside where the patio is."], ["Ray Q.", "Came here for the first time the other day around 8 pm and it was pretty dead besides a few people and the front counter guy was really helpful since I've never eatin there before and recommended me the beef/lamb gyro because it was a favorite there so that's what I got, after placing my order he said there was a huge order before me but got my food out within 10 minutes so I tipped them! Food was really good , service was good seeing I was only getting it To go, I'll definitely recommend my friends to come here and try it and I'll definitely be back!"], ["Marc T.", "Customer service is awesome! Then again, went during a weekday and it wasn't busy (just how I like it) so there was only 1 server o_o whatever the case they're super friendly and insist on bringing everything to you haha. Their Gyros are awesome and I'm writing this review cause I'm craving for some more right now T.T for around $9 you get a huge Gyros and fries (garlic or chili cheese). The gyros itself is amazing. Fries are fries to me so whatever, awesome to have it added. Oh and it comes with a soft drink. Boom. Awesome deal for awesome food and a drink to wash it down. Definitely going to start coming here more often. Oh yeah! It also has a really nice diner setting :D"], ["Crys B.", "A smaller venue, but gives you the feeling like you're eating at someone's home. :) one server was serving everyone, but well worth the wait. Food Was authentic and cheap. It was even plated gorgeously! The gyro and fries may sound like a minimal portion but I was soooo overly stuffed! I was surprised to see there were many American dishes as well.. Great for kids! I'll definitely be back. I wanna try the hand made ice cream but was way too full!"]], "California Kabob Restaurant": [["Victoria K.", "The food is outstanding. Today is my second time having the chicken kabob. Both times it was juicy, flavorful, with just the right amount of charring from the grill. The place is spotless, and the staff is very genuinely warm and friendly. There is a pretty outdoor seating area. I give this place a huge thumbs up!"], ["Karen K.", "This is a review for an order to go. In fact I tried to order online but haha did I have the last laugh bc it didn't work for me?!!  I was told later that we can call it in. Duh?!!!  Remember we have phones in our hands?!!Well there was a bit of a wait for our one order though I tried to pass the time with hubby entertaining me! LolIt was our first time here. Just a very homey & casual place plus it was on the small side. At least we were able to park right in front of the Chinese restaurant next door. Single restrooms were decent.In front of this restaurant there was patio seating but we didn't stay to eat bc we were wiped out from all the Christmas shopping. I had done that earlier besides taking care of our family member's car for oil change, gas fillup, car wash plus new windshield wipers. So it was already a full day by the time we hit this business.Back to the review! We ordered just one entree to go which was the lamb, beef and chicken kabob combination. I thought while taking pics that the meat wasn't big at all. Loved the pita bread but where was our hummus??? It didn't dawn on me until we were home eating the bread. I was really looking forward to that but maybe it was a good thing after reading someone's tip of getting sick after being there the second time around. I'm usually the sensitive one of the family too!There was however plenty of salad & jasmine rice. But everything was mediocre so it's a tough choice whether we would be back due to being so close to another Greek, Mediterranean restaurant half a block away that we enjoyed much better!  So if you have that dilemma what would you do? Got my gist?!!!"], ["Huddie L.", "I've been back several times since my first visit under new ownership and each time they always remember me and welcome me warmly.  The owner always comes over to greet me and shake my hand; wonderful person and an excellent chef!Yesterday I asked the waitress what she recommended.   She got a menu and correctly identified everything I'd ordered from her in the past so she could recommend something new - incredible memory.  She suggested the combo rice.I started off with hummus & bread.  I love the way the warm bread smells when they bring it to the table.  I could make a meal of their bread and hummus alone.The combo rice was delicious.  One of the most pleasing aspects, to me, is the garlic cloves which have been steamed or sauted so that they are tender and flavorful but without the bite of raw garlic.  Seemingly a simple dish but perfectly executed.  Arabic coffee and baklava for desert.When I arrived, mid-afternoon, things were relatively quiet.  The owner mentioned they'd been very busy earlier in the day and a few more groups arrived before I left.  Since they weren't overly busy while I was there, we had time to talk a bit and I got to learn a little about the culture and customs of their home land."], ["Harold L.", "Beat kabobs in town never had better will be returning im recommending this place to anyone who enjoys kabobs or new kinds of food"], ["Frank R.", "My GF and I started out going to PitaQ which is right next door but they were closed. Yes I neglected to check in with yelp :) when we walked in my first impression was I don't think we are going to enjoy this much. 1) there were zero customers inside. 2) the interior was just plain drab. 3) the menus have pictures of the food. Yes I'm sorry I guess I'm just too much of a Gordon Ramsey fanatic that pics of food are a bit of a turn off. However, if you aren't familiar with this type of cuisine it probably helps. I'm here to say I was pleasantly surprised. My GF ordered the chicken plate and I ordered the chicken, lamb and beef combo. The cook brought us over some hummus and my fear of not going to be satisfied started there. Reason being, it was served on a styrofoam plate. But now the pleasant surprise started, the hummus was delicious! I asked if it was home made because you can honestly taste the difference from a store bought brand, it is home made. Then she brought over some hot sauce and cucumber yogurt. Again styrofoam plates but again delicious! Then the entrees, yup styrofoam plates again but again delicious! The lamb seasoned well and tender. The chicken just slightly dry and I do mean slightly maybe a minute less and we are talking perfection. The beef also seasoned well and quite tasty. The plates came with rice and a salad. Overall I can honestly say we were both quite taken aback and very satisfied. The only reason I didn't give this 5 stars is because of the styrofoam plates and they only have plastic utensils. That's ok for a hole in the wall who's business in 90% take out but they have a nice sized sit down dining area. Aside from that we will go back and I recommend it. I had a brief very friendly chat with the woman who cooked and served us. She asked if it was our first time, answered a couple of basic questions and bid fair well with a hope to see you again. Thanks for a wonderful late afternoon meal and experience."], ["Irshad A.", "Upside they have the best burgers with lots of flavor. Now for the bad, ever since this place sold to the new owners the service is bad. The lady never washed her hands and was on her phone talking and texting through out the whole time while cooking the food. Old owners were super fast and would get a burger done within 10 min. I had to wait 30 min for my burger."], ["Mike S.", "Really nice restaurant and it is very cleanI Like their customer service  and also their food it is delicious"], ["Yasmine P.", "Oh my goodness. This is my new favorite place in Sacramento. It's so clean. And the food was so good. I had the beed and my bf had the chicken and both were so delicious. The rice was really tasty too but my absolute favorite things were the salad and the hummus. Omg the salad is just the way I love it but better. I had never had a salad that thing. My mouth is watering right now just thinking about it. I could eat that salad every single day. I daydream about that salad. I can't wait to go back and have more. It's a good amount of food for the price and I cannot wait to back home and get some more. I'mSo glad I found this hole in the wall. I love that it's small and family owned. I could taste the passion in the food. Ahhhhhhhh I love that salad."], ["Victor H.", "OK! I tried this place; especially after reading the reviews. Look at the pic of my beef kabob. What is this? It had a weird texture. The casing on it was waxy. Then it hit me.  Chewing it was like chewing one of those round stick beef jerkys'. It had a weird taste like GRILLED BEEF JERKY! I'm not kidding. This was not fresh meat. This must have been in dry storage in the back somewhere. Is this what they normally serve here? I looked at other patrons pics and the beef kabobs looked like real beef in most of the pics. WTH man! On the bright side, the chicken kabob was really good, but the lamb was chewy, tuff, and full of gristle. I liked the rice, salad, complimentary hummus and bread. Since the main meat item (beef kabob) was the largest on the plate and I could not eat it, I gave the establishment three stars. The staff was nice also."], ["Haidee B.", "My friend and I  been wanting to try out this place because I've always wanting to try out something new. I can't believe that I've never bother to come to this place till' now. I like their customer service, the girl who served us was very very friendly. We waited for at least 10-15 minutes for our order. While waiting for our order, we were given some free hummus and bread. The hummus was so good. When we finally got our food, my mouth started drooling. I ordered #7- the kabob, lamb, and beef were so delicious ! Not only that, the salad that came with my order was soo good ! I'd definetly wan't to come back here again!"], ["Andrew M.", "I am so excited to have found this place. My family has been in the middle eastern restaurant business for a long time. Cruising home this evening I see this place and I tell my friend we should go in. At first I was greeted by the nicest gal, and she took our order and helped us through the menu a little bit. From the moment I walked in I could totally tell that the chef/owner knew what he was doing. I could see the passion in his food. My favorite kind of place! Make sure you try it, you wouldn't regret it. Later got into conversation about the place and how long he's been there, and he's such a nice person to talk too. Can't wait to be back! Don't go anywhere else you will love this food! Count on me! I am Lebanese I know good food!"], ["Paul F.", "Its coming up on noon on a Thursday, and the door is locked.  The woman inside seems to be trying to explain through the door that she can't find the key and can't open it.  Yet their open sign is displayed promptly.  Very bizarre.  How did this place work it's way up to four and a half stars?  Seems to me, they couldn't find their own d*cks if you gave them a map.  Yelp, you've failed me."], ["Anna Y.", "It was my first time here, I was greeted with such welcoming and friendly staff. Food was mouth watering good at such an affordable price! Definitely a must go!!"], ["Ahmed A.", "It's a great restaurant the food was very delicious and the place was so clean. great food and great customer service. Everything was perfect . Thanks guys for everything."], ["Ahmad O.", "i finally tried this restaurant and i was surprised.  The beef kabob was amazing with the rice plus the complementary appetizer till your oder is ready. The service was perfect , i ordered the wrong plate and they did not hesitate to change it and bring what i wanted. The lobby was clean and everything was perfect."], ["nish a.", "The chicken shawarma I got was very tasty and flavorful. Had the right amount of sauce which did not overwhelm the flavor of the other ingredients. Like the decor inside,with the blue surround ceiling  lights giving the place a lively feel. Was greeted warmly when entering and was even helped with the menu selection The price of the meal could include the drink but somehow has to pay additional for itThe place was spacious and good for kids/ family eat out Will definitely be back soon"], ["Eater X.", "I like supporting places like this.  Husband and wife owned and operated.  Clean and well kept.  Limited but solid menu.  Good portion size and fair prices.I had chicken kabob and Greek salad.  Chicken was perfectly cooked and flavorful, served hot off the grill.  Free pita and hummus accompaniment was tasty.Be sure to ask for side of hot sauce."], ["Jesse K.", "We stop at the River Bend park often, and now have our new lunch spot. A fantastic experience. Fresh ingredients, seasoned perfectly, friendly staff, clean restaurant.  They're doing a great job and deserve support."], ["Toni T.", "It's our third time here today so I  will write my review on this place. As we walked in the owner politely greet us with a smile. I was surprise that she even remember me. She said I haven't been here for about half a year. I told her how great the new remodeled floors new tables and chairs are looking. She gave us a fresh hummus and pita bread right away. She offered us lemon water since we don't drink soda. Our usual order combination place with consist of ground beef,chicken kabobs,2 pieces of lamb, rice, and salad. The flavor of the meat is superb. You can really taste all the spices they marinated the meat on. The chicken is never tough and I believe it has minimum of 10 species. It's grill pretty well. The portion is a lot compare to the other places. Maybe they can serve some  kind of sauce on the meat. But with exceptional service, cleanliness and great price its not even a big deal. So if your looking to eat some Armenian cuisine and kabob I highly recommend this place."], ["Grace M.", "Don't let the Styrofoam plates fool you. The food here is gourmet. The service is very friendly. The restaurant is clean - And I was pleased to hear music that matched the cuisine. My boyfriend and I have different food tastes, but when we tried each other's dishes we liked them both (lamb kabob & chicken kabob). The affordable price and good serving will have me returning. I'm glad this place is close by."]], "Extreme Hummus": [["Mike V.", "I don't understand who could give this less than a 5. It's REAL food and there's a drive through (sure, it takes a while because it's made right there, but some days you just don't want to get out of your car because SiriusXM is playing the whole Kodaline concert on Alt36)The falafel gyro and the lamb and beef gyro are the stuff of legend. we always get the three dip sampler too, usually with the Extreme Signature Hummus, the Spicy Red Pepper Hummus, and the Tzatziki Sauce. You may want to double up on the pita though. you will run out."], ["Amanda G.", "Not a fan....and staff wasnt very helpful to someone who had never eaten there. I wont be back."], ["Jateen J.", "Got the beef/lamb plate and Greek fries, both were amazing. Friendly staff and welcoming atmosphere!!! Glad we made this stop while passing through!"], ["Steve B.", "First time here at Extreme Hummas which was recommended by a friend. Wait staff was friendly and very helpful in selecting a menu item. Ordered the 3 meat gyro with Greek fries minus the feta cheese. Gyro was excellent and was a burst of middle eastern flavors and the Greek fries were very good. We will be coming back!"], ["Dennette S.", "Love the hummas, fresh and a variety of flavors. Everything is made fresh, good variety on the menu."], ["Claudia R.", "Customer Service is excellent! Went today for my first time and even in the drive thru they provided friendly and fast service! I got the chicken gyro and upgraded to a meal with the gyro fries! I wasn't sure what they were so he showed me and they looked delicious so I was excited to try! Both were amazing! I will definately go back again!"], ["Cary W.", "I had the beef and lamb wrap. OMG! It was excellant! I can't believe I hadn't heard of this place until today. I saw the sign for this place today on my way to coffee. While waiting for my coffee I saw a young man with an Extreme Hummus tshirt on. It must have been a sign. I asked him about the place and his response was \"I guess you'll have to come in and find out\". I headed there right away. A wonderful gem of a family run, (99.9% of food made on the premises) Greek restaurant. I also want to give a shout-out to those who I spoke to there, all were incredibly friendly. A special shout-out to the young woman behind the counter who helped me. A bright, cheerful, informative, beautiful young woman....thank you for helping me navigate the menu!"], ["Marina M.", "First time. Ordered to go. This place is like 5 minutes from our house!Fries was pretty goodFalafel was fresh and goodMy lamb and beef gyro meat inside was pretty good. But I expected the wrap to be also warm as well as meat so that kind of ruined the experience for me personally. But my husband didn't care that it was cold (he had beef gyro)"], ["Rachel T.", "OMG! I love Greek food and this place is just amazing. I had their chicken wrap the first night and it was HUGE I couldn't finish all of it. Saved for later. I also ordered their 3 sampler of hummus. I got the Spicy Cilantro, Garlic, and Extreme. The best hummus I ever tasted!! They even serve it with warm pita bread! I loved it so much I went back today for lunch and brought a coworker. I got the Greek fries and a Greek salad. Sooooo amazing! Have to try. By the way they have a drive thru! Whaaaaaaat?!?!?!"], ["Mary H.", "Great idea, nice customer service from Sam. The lamb wrap was jumbo large, loaded witha nice combo of beef/lamb meat. A little too salty for my taste. If you like hummus your in fora treat. These guys know how to season chick peas a lot of different ways. This is my second time to have take out from Extreme Hummus. Next time I might try something different."], ["Alix C.", "To add to all of the buzz about this place, I have to say it is pretty incredible. The falafel wrap was really good and the cilantro hummus was the best! We also tried the red pepper hummus and the garlic hummus. I only wish the falafel was a little bit more crunchy, but other than that, no complaints. This place deserves all five starts - YUM! Prices are very reasonable too."], ["Nick V.", "Unreasonably flavorful for the price. If you like things like \"Carne Asada fries\", get the Greek fries with the lamb+beef gyro. A surprisingly delicious take on the American-Mexican classic. The building is a bit of a hole in the wall but I find that sort of thing charming."], ["Bridget W.", "I should have taken pictures of the awesome food here but it smelled so good I ripped into it immediately and devoured it. Rolled through the drive thru on a slow Tuesday night... the best night to test out a new restaurant by the way because it tends to be the slowest and if you are a question-asker (like me) you won't be holding up anyone. So I decided to sample the chicken gyro (pronounced Euro for those of you new to Greek/Mediterranean food), the artichoke pesto hummus, and the baba ganoush. All satisfying, delicious, and freshly made. Pita bread was soft and warm. You can taste the quality in this place for sure.Service at the drive thru was friendly and informative. Looking forward to going back to try new things off the menu."], ["Jessica G.", "Great food and helpful staff! Extreme Hummus is one of the few good restaurants in Antelope. They are obviously passionate and excel at what they do! Falafel gyro is my favorite and consistently delicious!!"], ["K R.", "The first time I visited this place I was with my wife. She ordered the falafel gyro and I ordered the 3 meat gyro. When they brought us our our 'order' my wife was given a chicken gyro and I received the beef and lamb. Whatever, we're pretty low-stress people. We don't say anything (because we didn't really care) and dug in. Wow, the meat was terrific, the veggies were fresh, and the tazaki and hummus were amazing. We also ordered the Greek fries which were far-and-away the most delicious part of the meal. After about 5 minutes, the manager came out and apologized because he realized we received the incorrect order. Again, my wife and I are pretty easygoing so it really wasn't a big deal, but he continued to apologize and ended up giving us our correct orders to-go!I've been back here about 8 times since the first time and it is still amazing. They've even gotten better at wait time and order accuracy :-)"], ["Shawna J.", "We live about 30 minutes from here. Stopped here a couple of weeks ago when we were in town. We got the number 8. Really really good! We are back for round two. Definitely a favorite stop when traveling through."], ["Julia P.", "Very amazing food. Customer service is right on. Several different hummus options. The Red Spicy Red Pepper is out of this world. They make everything fresh, but the wait isn't bad at all. Small, but very clean. If I lived closer, I would eat here all the time. They always get my order correct and are super friendly."], ["Randy S.", "I WILL DEF BE BACKThis has been on my list of local restaurants to try, and I am very glad I did.I had the chicken kebab and it was great with some garlic hummus...added a little extra sumac...life was good.gonna try the lamb next.Staff was nice and friendly, decor is one step up from fast food, price was fair, and its convenient.whats not to like?5 stars - They rocked it."], ["Deepa T.", "Their hummus is amazing, chicken is flavorful...and service is wonderful! Will definitely be back! Got the combo plate and chicken gyro...yum!FYI there is a drive thru!"], ["Mike P.", "GREAT FOOD!!!!!I have only eaten here a handful of times. BUT!!!! EVERY TIME has been AWESOME!!!The leftovers are as good as the original hot food, and they will give you re-heating tips if you ask for them.VERY VERY VERY VERY VERY GOOOOOD HUMAS!!!!! The roasted tomato is my favorate!!!Try EXTREME HUMAS!!! YOU WILL NOT BE SORRY!!!! :)"], ["Nando V.", "Hands down one of the best mediterranean spots in sac! The gyros are so good the pita bread is fresh and warm the lamb and beef is so flavorful and delicious. The food you get for the price you pay is ridiculously CHEAP!! Like FR FR! They have a nice variety of  hummus which i will say the ones i tasted were great!! The service was excellent, im a take a shot in the dark but i think he was the owner, he had great customer service i will surely come back and try more of the food. The only thing i would say that i wish was better was that i wish they gave more pita bread in the combo plate one single slice of pita bread sucked specially since the bread was warm and so good. You could buy a whole pita bread for just a buck its not a bad deal considering how good it is. I will surely be back i loved it my old lady loved it and shes normally picky bout this type of food. I will strongly suggest you give this place a try. Oh one more thing. If you go here please dont make the mistake of not trying the pudding with saffron sauce OMG ITS SO GOOD, so aromatic and flavorful!! Trust me  its that good!!"], ["Christian D.", "I ordered two of their all meat Gyros and i have to say you are getting what you pay for!!! They provided very generous portions. they also have a convenience of a drive through! if you are in the area give this place a try! im happy to see something like this just downthe street form me!"], ["Alex T.", "i love this place! i think i fell in love with it for the first time! well i was around the area for a movie on greenback. i thought since i am here, i want to try some new place. so i found it on yelp last minute, saw many good reviews and awesome pics. i then called the place and ask what time they close, so they say in 5 mins. i asked if i can order it togo and pick it up, they said sure and just pull up to the drive thru. well here i make there by 9 10 pm and they were already close. when i was pulling up, it was kind of hard to see this place because of the lighting on the signage. as i drove closer i can see it finally lol. i then went straight to the drive thru and they already knew it was me. so i ordered the chicken gyro with artichoke pesto hummus and i requested spicy too. it came out to 7.55. i then pulled over to take a few bites, because you know when its hot, it tastes the best. now when i slowly unwrapped it, i did drooled a bit because i had to take a picture of it first. now after a few attempts on the picture i couldn't resist and had to take a bite. on my first bite i can taste the warm pita bread and the chargrilled flavor chicken in it. next i taste the pesto and i was in heaven! i am a huge fan of pesto! then in the middle of the gyro i finally got to the cabbage and the sauce! yes it was huge for 7.55! it had a lot of chicken meat and it was mainly breast white meat! overall the chicken gyro was bursting with flavors! it definitely was saucy good! i had an amazing time enjoying it! the service was friendly over the drive thru window. i will definitely be back for the plate on my next visit! yummy! i will never look at a pita bread the same after i tried this delicious soft and fluffy pita bread haha. thanks for reading and please go try! its amaze balls!"], ["Jenni T.", "Ok I usually don't write reviews out of order but I really felt like I had to spread the word on this one. To be frank, I was a little skeptical coming here for the first time. I mean, 95% of the reviews are five stars. Is it really that good?The answer is yes.It was my first time stopping by on a Wednesday night around 5:30pm, and there were two people eating inside the restaurant as well as two ordering at the counter. When I got to order the guy behind the counter was super super nice and helpful. He explained the difference between a Wrap and a Gyro (Answer: The bread. The Gyro comes with Pita Bread) and allowed me to sample several different types of Hummus. My favorites were the Extreme Hummus and the Original Hummus. The Sundried Tomato and Basil Hummus was surprisingly good as well, and the Spicy Red Pepper Hummus had quite the kick!I ended up ordering a Falafel Gyro which came with falafel, hummus, lettuce, tomato, onion, red cabbage, tzatziki sauce and creamy hot sauce in a pita. They made the sandwich within a few minutes right in front of me and I was on my way. My total was about $6.50 which isn't bad for the quality of the gyro and ingredients.Note: They make everything in house and it shows. Everything I tried was so good!The gyro itself was amazing! I loved the flavor of the falafel (nicey seasoned and cooked, not bland at all) paired with all the sauces which made it super moist and unique. Yummy! I was able to finish the whole gyro and only wished I got some fries to go with it!Will I be back? Definitely. A neighborhood gem."], ["Mohamed K.", "The lamb and beef gyro meat plate was great!The service is good, and the people are very friendly.  They have several kinds of Hummus, which adds a good variety as well."], ["Marisela M.", "I though I wasn't  a fan of hummus so I never was going to come here but I love baba ganush,so my husband ordered the beef and lamb w rice pita and baba ganush and he ordered me the chicken kabob with rice pita and baba ganush.both plates were delicious.now I will say I do not like lamb but this place made a liar out of me.i enjoyed the lamb.I will say this baba ganush was not my favorite  at all,but the sweet staff was understanding and let me have the cilantro hummus instead . it  was perfect.Now the best part.my husband ordered baklava, one of my favorite desserts and it had a sweet yellow saffron sauce with it.what a plus.Thank you we enjoyed our visit and we'll be coming again.please stay sweet and pleasant."], ["Stacie P.", "Good food, good selection. A little pricey but there aren't enough good restaurants around here so it's worth it, just can't come as often as we'd like."], ["Patti R.", "Off the hook TERRIFIC!!I came here on the recommendation of my son and I'm glad I did!I got the #7 Chicken gyro with harlic and white bean huumus. Wow! So flavorful! The portion size is good too...personally I think the portions are larger than normal--no complaints from me!Parking is lot style and there's plenty of ot. Bonus--they have a drive through too!This is the place to go for friendly staff and  terrific food!"], ["Elain L.", "rarely do you see a 5 star place with a decent amount of reviews- so when I saw this place I had to try it. Needless to say hubby and I were not disappointed. The staff was SUPER friendly even though we walked in 20 mins till closing. I had a chicken gyro hubby had a combination platter with garlic hummus- everything was SOOOOOO good. We definitely will be back!!!"], ["Lola M.", "My kids love this place and ask me to take them all the time.  The food is fresh and authentic  Their hummus kicks ass of every other Greek restaurant I have been to.  And so many flavors of yum!  The people who work there are super friendly and helpful."], ["Tracy M.", "Before trying this restaurant, I was shocked to see that they had so many reviews and a 5 star rating. After visiting Extreme Hummus, it was crystal clear why they have the rating that they do!This is another review where I must preface this with the fact that if there is hummus and/or feta cheese involved- I am probably going to be a fan. This place did NOT disappoint. Amazing Greek Food. I had the Greek salad, no onions (because ew), added Falafel and a side of the sun-dried tomato and pesto hummus. When you order the side of hummus, it is more than enough to be enjoyed by two or 3 there and  still take some home as it comes in a portable little tub with lid. My husband enjoyed the combo platter with the lamb/beef meat and chicken. I tried his chicken and,boy, was it good. He also had the artichoke and pesto hummus. It was almost spicy, but also savory- it was delightful.The food is highly recommended but the service here was awesome. The employees were friendly, helpful when it came to making choices from the menu, and said thank you many times during our visit. It's nice to go somewhere that your business is so appreciated!"], ["Jeff D.", "I have eaten here twice food is a little on the pricy side. I have had a gyro and a chicken Shwarma. The gyro was super salty with not a lot of meat. The Shwarma was mostly lettuce with dried out chicken. I just expected so much more from this place."], ["Jeff M.", "Blows Daphne's away.  I am so happy for another good place for lunch near us.  Slim pickens in Antelope.I ordered the lamb and beef.  Spiced better than any other place I have been to.  They have 8 different types of hummus.They make everything fresh on site.I have found my new lunch spot!"], ["Mario S.", "Best kabobs I've had since living in the Bay Area! Only thing that tops the customer service is the food. Great people, descent location, awesome food! The best thing going in Antelope!"], ["Maggie W.", "5 star ratings after 100+ reviews? I was a little skeptical but Extreme Hummus turned out to be an excellent lunch spot. It gives off a fast food vibe, with its drive-thru and super speedy service, but you can also opt to dine in. When they're not making gyros and kabob plates, the servers walk around to make sure you have enough napkins - great service!I ordered the chicken kabob plate, which comes with jasmine rice sprinkled with paprika, a side salad, a quarter slice of pita with your choice of hummus (the garlic roasted white bean hummus for me), and six pieces of juicy chicken. My friend ended up ordering a gyro with French fries as a topping (similar to a California burrito ... California gyro, I guess?). No complaints from either of us! Solid Mediterranean food with fast service at good prices."], ["Chris G.", "So...this. place. is. great!  Plan on dropping $11-13ea if you want this done right!  Outdoor dining is great.  INSAAANE 3 meat wrap (made like a huge burrito)...oh jeez.  Go and eat!  Super friendly owners/staff.  Good menu, good value even at $11+!!!"], ["Aaron H.", "Great food and great service. I ordered a chicken kabob plate and Greek fries, which were both quite good and had decent portions. The baklava dessert was delicious too.My only suggestion would be to add a spicier sauce; since I handle the heat pretty well, the hot sauce that they offered didn't seem very spicy for me. I may be wrong but it also seems there's a drive-through window that I might take advantage of when I visit again."], ["Nichole C.", "I love love love this place. Great atmosphere, good customer service and fantastic food.  I highly recommend this place to anyone who is in the area and hungry: )"], ["Kristina M.", "AWESOME!! Came here today after seeing them on Good Day Sacramento a few weeks back. It was delicious! Came with a couple friends from work and it was definitely worth the drive from West Sac. I got the Greek Fries and the Hummus Sampler (which came with plenty of pita bread and 3 different flavors of hummus) and it was soooo good! The three Hummus flavors I chose were Spicy Red Pepper, Garlic & Original. The Spicy Red Pepper was probably my favorite but they were all very good. One of my friends got the Falafel and said it was delicious as well. We told the guys working there that they need to expand to West Sac- I would go every day!!!"], ["Karl H.", "Excellent food!  I was eating it so fast my wife was looking at me like I was the Cookie Monster.  Everything tasted great and the service was fast and friendly."]], "Pita Kitchen Plus": [], "Crest Cafe": [], "FreshMed Mediterranean Cuisine": [["Dianna F.", "I'm being generous with my star rating so read and proceed at your own accord.Nice place in a bad neighborhood, tucked away behind Pizza Hut in the corner of a strip mall. It was hard to find the place but we managed. Look for Twisted and then move your eyes to the right to the corner of the L shaped complex. You'll find it there probably behind their catering van.The place had three tables occupied when we walked in. A couple very cozy sharing some pita nachos; another loud couple arguing about the fact one was out of town and never contacted the other; and another family of 4 or 5. So not one bit crowded. The service was so slow I told Jeremy the waiter must also be the cook. He laughed cause it sure felt that way. And not only was it slow, but the waiter, who had only 4 tables to wait on kept bringing people the wrong food. We almost got the table behind us nachos and sambosas. And 20 minutes after we placed our food order, he brought us our food, he gave us the wrong plates. He's either new or just simply a bad waiter. I can't imagine how the orders would be screwed up if the place had more customers.We ordered a bunch of food. I had the grilled chicken pita; the meat was very tasty but it was dry, even after I added the included taziki sauce and the taziki sauce left over from my sambosa.  Jeremy ordered the Taziki from the \"Starters\" section and that's all we got, no bread to go with it. What are you supposed to do with big bowl of taziki with nothing to dip in it.  For $5 you should get a few pieces of bread. We ordered from the starter menu the Sambosa, I had cheese and Jeremy had spinach. It's puff pastry with some ingredients added to the middle. Mostly puff pastry, very little stuffing til you get to the middle. I liked the flavor of the cheese and Jeremy liked the spinach, I did not care for the spinach.Jeremy ordered the falafel \"entree\". I came with 6 falafels, which was my favorite part of the meal, very tasty and nice spices, not dry. Also on the plate was rice that was nice and moist and tasted slightly of butter; a salad that consisted of romaine lettuce, a few pieces of tomato and cucumber. The salad was mostly lettuce, when I took a bite I didn't get any tomato or cucumber because there simply wasn't much to be found. It was seasoned with a nice fresh lemon type dressing. It also came with a small side of hummus. I did not like the hummus, it tasted like honey, kinda like medicine.Jeremy also ordered the eggplant pita, he said it was delicious, I choose not to try it.The food is fine, not the best Mediterranean food I've ever had. I prefer Extreme Hummus over in Carmichael way better.  Drive the extra 15 minutes to them and you'll be much happier."], ["Carol P.", "The medi nachos ($5 small) are the way to go!  So much flavor with each crunchy pita bite.  The deep fried pita triangles are covered with FreshMed's  lemony house sauce, Taziki,  feta, olives, parsley, tomatoes, and chicken shawarma (non-meat toppings available also).  It was like eating a deconstructed gyro.  It was my first time to try it so not sure if it was supposed to be served hot, room temp, or cold.  It clearly wasn't hot by the time I got home (I only live a few minutes away) but  most of the pita chips remained crunchy and the chicken was tender.  The falafel ($5) was one of the best I've had and was nice and hot when I bit into the well-seasoned disc.  You get 5 with 1 pita bread and a tiny cup of hummus.  I didn't care for the stale-tasting pita and the hummus was just ok.  I ordered takeout through the \"Yelp Eat 24\" ap because they offered a $2 off coupon.  It was ready in 10 minutes.  I walked into a near-empty, quiet restaurant.  A young gentlemen came out from the back to greet me and asked if I ordered online.  He came back with my bag that had 2 containers.  I assumed (my bad) the $2 cheese sambosa I also ordered was put in the same container with the falafel.   Didn't realize it was missing until I got home.  The nachos and falafel was plenty of food, so I didn't bother to call or go back to the restaurant.  But it did cancel out my $2 coupon!  Note to self:  always double check the order before leaving restaurant!  I'll be back for the nachos and get it with their delicious falafel instead of chicken.  Yes, that's an option!!!"], ["Audrey L.", "So apparently their Mediterranean Nachos are all the rage (and what most of the five stars on Yelp are for). We got a small order of the nachos on the house. They were pretty good, but the sauce was quite heavy, and we could've done with that on the side. The fried nachos were crunchy, but not super fresh; they tasted like they may have been fried earlier in the day.For the entree, I ordered the Chicken Sumac, which was very flavorful with a savory onion and garlic flavor. The rice was quite good, but the pita wasn't quite grilled enough and it tasted a bit dry. I was pretty disappointed that the salad came with ranch dressing...I don't remember ranch dressing being mediterranean. My friend got the lamb shank and while it was very tender and fall-off-the bone, the dish overall was not anything mind-blowing.As for service, I think they were still working out the kinks since they just opened not too long ago. Ordering hot water was a bit of a curve ball for them, and they didn't serve it until much later after we reminded them again. There were also some funny dark green / black pieces inside...I can only hope it was leftover tea leaves.Apparently they do a barbecue on the weekends where they bake the pita bread and grill the meats fresh outdoors. That sounds like it could be even better with the food fresh off the grill."], ["Nicole D.", "Yum!!! Was searching for somewhere new to eat in the area and stumbled across FreshMed. I purchased a $10 for $15 worth of food deal and the husband and I took off to check it out. We started with the hummus which was a generous portion, fair price and served with warm, fresh pita bread. It was delicious! My husband ordered the gyro plate, and I couldn't resist trying the nachos with falafel. We were both very pleased with the prompt, friendly service, generous portions and taste of food. The gyro meat was SUPER tender, and the nachos were full of flavor. We can't wait to return to test out more of their very large menu."], ["Elizabeth T.", "The nachos that everyone is raving about, really ARE that good. The sambosas are pretty big considering they are only $2.00, but I've noticed inconsistencies with the quality of flavor. Overall, you get a good value here."], ["Jennifer F.", "Typical Friday night date situation - we actually had planned on going to another Mediterranean restaurant down the street but they were closed for renovations. I quickly Yelped and found FreshMed and saw the great reviews so we gave it a shot. Upon first arrival there isn't anything fancy about the place, just a restaurant no bells and whistles pretty bland on that other than the pretty fabric on the ceiling.We figured whatever lets eat here it got good Yelp reviews so it has to be good. We were happily greated by the gal working the tables (we were the only people there) but she gave us a recommendation when we weren't sure what to get for our combo plate (we went with Chicken Kabobs and falafel's). Then we also asked if that was enough for two and thankfully she gave her honest opinion that yes it was plenty for two.  Indeed it was! We split the combo dinner and then a gyro too.  The combo dinner came with a greek salad, pita and hummus, rice and two sauces for the meats. It was SOOOOO GOOD - Spicy Garlic Sauce.. NOM NOM NOM...We will totally be coming back.  The bill was under $20 and we were perfectly stuffed and the service was great. Thanks for the good find Yelp! I was told it's been around for about 3 years so far :) It's totally our new Greek go to place!"], ["Steve W.", "This is the absolute best... Never mind the decor and dig in.. The Mediterranean Nachos are famous."], ["Jenni T.", "I came into FreshMed for lunch at work one day because I have only heard wonderful things about their Mediterranean Nachos so I obviously had to try them.I tried to call on my order to go, but both times I called no one picked up the phone so I decided to drive over there instead. Pro Tip: Do not believe Google Maps. It's right on Fulton, not right off Fulton in the middle of some houses as it would lead you to believe.The inside of the restaurant definitely needs a little work. It is in serious need of an update and teetering on the edge of disrepair. So much so that I wondered if my tummy would later regret eating here. Help! I also walked in and there was no one to greet me, or seat me, so I stood around awkwardly for few minutes before seating myself and waiting for the server. She finally came out of the back (I think there's one cook and one server only) and I was able to order my Falafel Nachos which only took a few minutes to come back out before I was on my way.The nachos were lovely. Fresh pita chips were topped with a lovely tzakiki (I know screw that up) sauce, falafel, spicy sauce and tomatoes. The falafel wasn't the best I've ever had, but it wasn't bad. I loved how everything went together so well and how it was something different than what I would normally order. For about $5 for a small order (which is plenty for one person) it's a good value too.I would come back."], ["Paul S.", "My family and I wanted to try something different. This place did not disappoint. Everything was good, from the gyros to the chicken. The waiter was very helpful amd service was great.."], ["Thomas W.", "Great food and service for a good price! What more can you ask!"], ["Isaac J.", "The food here is always fresh and tastes great.  Not too expensive, making it even more of a reason to go."], ["Andrea N.", "This place was a unexpected surprise. The restaurant itself is not very exciting but the food was fantastic and so was the price. I had the eggplant entree. .....the eggplant was so creamy, wow!!!!I will eat here once a week"], ["Juan R.", "This is hands down the absolutely best mediterranean restaurant in Sacramento. The food is deeeeeeelicious and the price is just too good to be true. Do yourself a favor and come to this place, whatever you order will blow your mind away."], ["Carol H.", "Guess I will give it an A--OK, cause everything was eatable.  Those nachos that yelp made me long for were well received by my table, I detected not ztiaki sauce but some other sauce, Iguess there so called house sauce poured all over the ingredients, which did not include olivesas advertised. I ate two pita chips with toppings, enough.  I am not one of the masses whoadore these nachos, however done right with traditional sauce and greek olives, it really would be outstanding.Tabouli was as it should be, hummus was missing a lot of lemon, garlic and tahini.  it had no taste at all, worst I've ever had.  Sambosa with spinach has a nice phillo crust but the glommyspinach inside has no seasoning and tastes only of frozen unseasoned spinach. One person ordered the lentil and rice dish, a ton of rice, very little lentils and no carmelized onions as indicated on the menu.  I love Kebbe, used to work in a Syrian restaurantwhen I was young, their kebbe could not be compared, once again, no mediterraen flavors.I guess I should be thankful that they had no grape leave rolls  today, because I am sureI would not like them either.  I am not trying to be turn anyone away, but most of the menuitems I ordered I have made myself, and it's not hard to have them taste really good.If you have never eaten this food before pay attention to other peoples reviews, and youmay like it. The restaurant is very clean, some might say austere but the décor is in goodtaste."], ["Julie S.", "Thank you Yelpers for the Mediterranean Nachos recommendation! It was so scrumptious! Went with my friend Alliver V. and we enjoyed the nachos, falafels and a 2 meat plate. Everything was really yummy. The falafels are a little different from others I've had. A much crispier skin like a panko crumb almost. For the meat, we got the lamb and chicken. Pita chips were crispy. Everything tasted super FRESH, hence the name. The only hiccup during our dine in was when they lady took our money and didn't thank us or let us know that she was done completing the transaction. I had used the Yelp $10 for $15 deal so we didn't know if it went though but she didn't come back to say anything so we left. Kinda awkward."], ["Jeeno M.", "I came here based solely off of the pictures of the Mediterranean nachos. I was not disappointed. Everything that I had to eat here really tasted fresh; hence the name of the restaurant. It's a small little place. Not much seating. There was no host stand, also. It made me feel like I walked into the living room of a person's house and they were in the kitchen cooking your food for you. It's not a bad thing, but I wish they had music or something playing in the background so it's not too quiet.Like I said, I came here due to all of the reviews and pictures of the mediterranean nachos. It was absolutely delicious. The ingredients were their house fried pita Chips, topped with Feta cheese, tomatoes, olives, Taziki and their house sauce on a bed of lettuce. Topped with your choice of Chicken Shawarma, Eggplant or Falafel. Our server didn't even ask us which one we wanted, but fortunately he automatically gave us the chicken, which is what we wanted. The pita chips were crunchy, the vegetables were crisp, the chicken was flavorful, and the sauces were just delightful. It all went perfectly well together like bacon and eggs, steak and potatoes, milk and cereal, peanut butter and jelly, cake and frosting, salt and pepper, you get what I mean.I also had the gyro pita. This is a simple, yet satisfying dish. For those who do not know what a gyro is, it is slow roasted meat, which I think was lamb, on a vertical rotisserie spit, traditional style with lettuce, tomatoes, and their special sauce, which tasted like a slight variation of the traditional tzatziki sauce. The prices are reasonable as well. The food served is of great quality and very fresh. I'd recommend this place to anyone. Its different from the usual burgers and fries, but could easily be anyone's comfort foods."], ["Strongbull G.", "So I typed in Middle Eastern food on yelp and this placed popped up. Mind you, I do have my favorite spot that I usually go to for my Middle Eastern fix, but I wanted to try a new place. I got the lamb gyro and small chicken schwarma nacho. The nacho was pretty good but the sauce to chip ratio was a bit off. It could have used a few more chips or a little less sauce. Taste was really good. The lamb gyro wasn't too great. The meat was nice and tender but the bread was old and tough and it totally ruined the sandwich. Please step up your bread game. Discard old bread instead of using old, because the competition out there has nice soft fresh bread and that's where I would rather spend my money. The waiter was nice and attentive and the place was clean. Overall, for what I paid, I was a bit dissapointed."], ["Shannen C.", "Came here for lunch two weeks ago and when we walked in there was only one table and no server in the front. We just grabbed a table. A lady came from the kitchen and quickly helped us. The pita chip nachos are very good. The falafel was very good and moist inside. Overall good experience. Have the wait for service for alittle bit but great food and decent service."], ["Olga G.", "I'm already looking forward to coming back! Delicious light food. Unfortunately they ran out of some dishes I wanted to try in the evening. Great veggie options! Yummy hummus and falafel that I'll be craving before long"], ["Tonya P.", "I just wanted to say how much I miss coming to this restaurant now that I have moved out of state. I'm so glad this place has good ratings, their food is soooo delicious!"], ["Sam B.", "Though I had one of the stranger dining experiences in some time here (it involved a party of some sort during lunch and some awkward stares), this place is really quite solid.Everyone seems to gravitate towards the Mediterranean nachos, and I totally understand why. The blend of flavors is just right. Good mix of textures with the crispy pita, the tang of the sauces, the flavor of fresh herbs and well-cooked chicken... it's a winner. I'm not sure if I was dealing with the owner or manager when I went last, but he not only welcomed my check-in offer... but he applied to the whole meal instead of just my appetizer. Pretty cool gesture!My only gripe here is that the rest of the food doesn't seem to have the creative flair of the nachos. It's still all good, but just not as exciting. Maybe I'll discover something new as I explore the menu, but I'll have a hard time distancing myself from the already beloved plate of nachos."], ["Chetna J.", "The food was good. Their mediterranean nachos are a must try."], ["Becky H.", "This place used to be a favorite. The Mediterranean nachos were so delicious and flavorful! But the service here is awful. I mean awful!! We ordered 5 dishes, we only ever received three of them. The other two never showed up. When our bill showed up, they were on there though! The bathroom here is beyond gross. The vinyl is peeling away from the wall and mold is growing between. If you decide to brave this place for the nachos, GET TAKE OUT. Do not eat in the place!!!!"], ["Latda V.", "I came here for the first time because I was in the neighborhood and I love it! It's a little hard to find since it's located in the far corner in a shopping complex on Fulton. Just look for the sign when you're driving!I ordered the Mediterranean nachos and a side of greek salad. It was so freakin good! The nachos were delish! Fried pita chips with chicken, lettuce, tomatoes with the yougurt sauce...so good! Perfect for sharing too. Staff is friendly too. He asked us if it's our first time and told us to if we have any questions to feel free and ask him. I likes :)This place is inexpensive and serves great food. Spent only $12 for the nachos and salad. I can't wait to go back! Sucks that I live so far but this place is so worth the drive! :)"], ["Rick M.", "Zero Stars.  Never eat here or get take out. My wife got food poisoning off of the Mediterranean nachos. Should've known something was up when I walked in to pick up the food that there was going to be an issue.  This place barely even resembles a restaurant as the dining room was unorganized with chairs littered about, there was no hostess, no silverware, no wait staff, no ambiance, no nothing.  Just a room with a empty tables and chairs. It looked more like a chow hall than a restaurant.  Ambience aside, they even screwed up the order and how easy is it to screw up nachos?"], ["River S.", "We ate there a couple weeks ago. The falafel, gyro meat wrap, and chicken Mediterranean nachos were very very good. The place itself is different. It was like visiting a different county which was kind of unique and nice, but where there are different decor and ambience standards. Also different style in customer service. We were a little nervous being the only 2 there, but overall it was good. I think their customer service could use the most work; I did for a minute feel like an ignorant American with too harsh of corrections. The best advice I can give is pretend your a traveler to the Mediterranean, Middleaest, or Palestine."], ["Brayden Scott Peng V.", "I'm a biggie on Meditteranean cuisine and this has got to be my best Mediterranean meal so far. My friend and I went here after our workout since I have wanted to try it and since I moved up here in Sacramento I wanted to find a good Mediterranean place to dine in. We walked in and was greeted and seated right away.  Great customer service!Food was delicious. I wanted to try everything on the menu because everything looked so delicious, but I ordered the Mujadara, Meditteranean Nachos (since that was the fuss about this place) and the tabouli and spinach pasta salad. Sadly they were out of the tabouli and the pasta salad, so the owner came to apologize. I was shocked because I'm very patient and I told the owner it wasn't necessary for her to apologize.I will be coming back to try MORE!!"], ["Karla Marie D.", "I can't believe this Fresh Medi is so close to my place. I love Mediterranean food!! I had Sam's Mediterranean Cuisine in Davis and I totally love it!!I had the Chicken Shwarma Entree ($8). It had salad and some sort of noodles, chopped into small pieces and chicken. Usually, I would have it with rice, but the alternative was equally delicious. The chicken was seasoned well. I mixed everything together and topped it with the Tahini sauce. The dish is a little spicy. The only thing I would change is the portion size. I wish they would give a little bit more.Overall, delicious! Next up: Mediterranean Nachos"], ["Akshya G.", "Awesome place.Fresh veggies in the sandwich.And the spicy sauce was mouth watering"], ["Brandon O.", "This place is the bomb! The nachos everyone is talking about were really good and the service was great also ill definetley be coming back to try their other food!"], ["Mariah L.", "I simply adore this place. More people definitely need to know about their simply amazing Mediterranean nachos. Its you basic hole-in-the wall restaurant, not pricy and very fulfilling. I've had their gyros on a number of occasions and loved how fresh and delicious it tasted. Their pita bread is really good also, I love dipping it in Tzaziki sauce."], ["Anisa T.", "Great, delicious, fresh food, that was really tasty. Nachos were surprisingly good. We wished we'd gotten a bigger size. Good affordable prices for the nice ambience they provide.  When we went, it was a little bit before closing on a Friday night but they accidentally had their open sign off and I assume that was the reason no one was in there. They were preparing to close but when I stated that they're supposed to be open for another hour, they were quick to seat us, even though we told them it was ok and we'd go somewhere else. The service was great, and I loved the cook's attitude. We got a chance to talk to him when he stepped out and he was the most pleasant, good-hearted man. Between the yummy, cost-effective food and the decor/ambience and hospitality, I was sold!"], ["Andy J.", "Good lordt, it was tasty.  Fast, friendly service.  Delicious fresh food that's super vegetarian friendly.  Great prices, and a Yelp deal to boot.  I will certainly be back!"], ["Aaron K.", "Mediterranean nachos with chicken were excellent!  All the ingredients on the nachos were fresh and a nice compliment to the pita chips. Chicken shawarma was moist and nicely flavored.Its a small place that's hidden in back by Pizza Hut. I've had the place three days in a row and still not tired of the nachos."], ["Mia C.", "Went there for lunch yesterday and the restaurant was almost empty. Maybe because of the rain. We seated ourselves since we didn't see anyone by the door. Food was relatively inexpensive, but there is not much of an ambience. Our server was a friendly young lady.I had the gyro plate which came with a good portion of gyros, rice, pita bread, spicy sauce and salad. Everything was good except for the salad which was wilted and not fresh. The chicken shawarma plate which my husband had was mediocre though. It didn't have the Mediterranean spicy taste, but again good portions."], ["Elizabeth C.", "I wanted to try out Cafe Europa but they were closed on Sunday, so I opted for this place instead and I am so happy that I did! The place was clean and simple with barely any decor.  The restaurant was very quiet. Our server was very attentive and friendly. I ordered the chicken kabob pita and my boyfriend ordered the ground beef pita. We both split a small order of the mediterranean nachos because I read so many reviews on yelp raving about them. We requested eggplant but they didn't have eggplant so we opted for the shawarma chicken instead. The nachos were delicious! This place has the BEST taziki sauce that I even asked for an extra side of it. The shawarma chicken was delicious, flavorful, and slightly spicy! My chicken pita was also really good but i would probably order the shawarma chicken pita next time just because it was more flavorful. My boyfriend seemed happy with his ground beef pita but I think he would probably order something else next time. The cost of these two pitas and a small nacho order for $20 bucks! What a deal!Only small complaint is that it did take a while for us to get our check. If i was in a hurry I would be more annoyed, but I was so happy and content with our food that I didn't let this ending ruin my experience. Overall, try this place! My boyfriend is a picky eater and doesn't usually like ethnic foods and he loved this place. And be sure to try the nachos! There's a reason why everyone raves about them on here! I will definitely be back to get a larger order of the nachos but since the restaurant environment is definitely lacking, my boyfriend and I agreed that we will probably opt for take-out rather than dine-in next time."], ["Bayan A.", "Food was great and the service was good. If your looking for authentic Mediterranean food this is where to go!"], ["Amy F.", "Delicious food and great service! I stopped in yesterday to try their Mediterranean Nachos with Chicken Shawarma. It was soooo good! Very different and a nice mix of flavors. My waitress also gave me a free dish of their chicken with garlic sauce to try which was also excellent! I think I will be back here often. So happy I found this place! Lots of yummy looking dishes to try."], ["Sarah T.", "YUMMY! I love FreshMed!! The owners are so sweet and the food is great! As many have mentioned before me, the Mediterranean Nachos are not to be missed. They are a unique treat and are absolutely delicious. They also make a great chicken kabob that is so tender and flavorful. Their homemade red vinegar salad dressing is another item you will definitely want to try. It is a small restaurant with a so-so ambiance but definitely a place worth visiting for delicious food!"], ["Kate L.", "Ah-mazing Mediterranean chicken shawarma nachos. Atmosphere isn't great but food and service made up for it. We'll be coming back :)"]], "Pita Pit": [["Melissa M.", "Pita pit has the most amazing staff and one of the sweetest owners. I'm completely obsessed with this place. Fork style pitas are my fave!"], ["Nicole A.", "I tried Pita Pit for the first time last night. I had the chicken souvlaki and pita chips with hummus and tzatziki and I will not be returning. The service was good and the people working were nice but the food was disgusting to say the least. I took one bite of my pita and the chicken tasted terrible almost a rubbery and hard texture. I ended up throwing it away after 1 bite. This place reminded me a lot of subway with all the topping you could put on your pita. The hummus did not have a good flavor and neither did the Tzatziki. If I want a pita i'll drive a few blocks over to Opa Opa and get something that resembles food for a few extra dollars."], ["Jazmine D.", "Extra healthy with a wonderful selection of fresh options. I found that the employees here were very friendly and helpful. The atmosphere is warm and inviting and I enjoy looking at all of the food art on the wall. The price is fairly affordable and this location does offer a discount for sac state students. This time I ordered the steak fajita pita. They let you top it with as many fresh vegies as you want. I found all the vegies to be fresh and the service is consistent. You can always ask for any vegies and cheese grilled too. They have food that can fit any dietary need, from vegan to paleo. I would rather eat here then subway if I am in a pinch, it just tastes that much better and more fresh."], ["Hu L.", "I would give this place a 3.5. Yummy food!! I got the Philly Steak Pita and it was delicious!  You get a choice of either White or Wheat Pita bread, choose your own toppings  (veggies, fruits) and can add sauces as you like! The service is quick and friendly too! The inside is similar to Subway in that it's quick dining but still dining friendly.  There is only one bathroom but it's clean. Parking is free and plentiful. If you're a CSUS student, you get a discount on food ;)If you're looking for lunch near CSUS, I'd say give The Pita Pit a shot, especially the Philly Steak :)"], ["Yasmin A.", "Food was okay. Just reminded me of a subway but with pita bread instead.Customer service was CRAP! Employees looked like they hated their job and just had a sassy face the whole time. BLEH."], ["Heidi H.", "I have never been to a Pita Pit before and was super hungry when coming by here to head to Starbucks so I decided to give it a try. I like that they have lots of vegetarian options and I didn't know you got to pretty much choose everything in your pita! Its kinda like a subway in that regard you pick the kind of pita you want then you can choose from tons of fillers to go in your pita and they make it right in from of you.  It was a lot larger that I thought it would be especially since I filled it up with most every veggie they had. They have a ton of sauces to choose from as well to put in there and they will put on the side for you as well if you want to try a few different ones but don't want to commit. Reasonably priced for a good portion of food."], ["Nicole B.", "I really enjoy coming here. The employees are generally helpful and the lines are never too long. The food is fresh and delicious. I come here often to visit s friend who lives in the upper east side lofts and every time the service is consistent, food is fresh and we enjoy the welcoming atmosphere while we have some good conversation. The food can be a bit pricy but the portions are huge. It does take a while to get the food because the meat is cooked to order but other that that the transaction goes by pretty fast. Overall, Pita Pit is a nice little lunch spot."], ["Nando V.", "Not bad at all this place is pretty koo it just sucks that it was my first time and the staff wasnt to helpful or opinionated to make suggestions. I finally decided to make a pita and the girl making my food broke it, while she was trying to wrap the whole thing. I felt like saying \"u beezy if u gonna work here u better be good at what u do\" but i was nice and said \"ahh is koo dont trip\" lol she was kinda sassy so i was slightly influenced to be nice :) lol over all the pita had good flavor and, well i kinda learned how to build a pita for when i go next time."], ["Matthew L.", "This place has some really good pita wraps, I really enjoyed the chicken Cesar and buffalo chicken wraps, also the prices are pretty reasonable for a place that delivers."], ["Jasmeen D.", "Absolutely love this place! 10x better than Subway and I used to be a huge Subway fan. I always order the Philly Steak Pita and I love it! Workers are always friendly and nice. The place is always clean and smells great! Overall, it's the healthiest \"fast-food\" option I've had yet."], ["Angel M.", "We are currently sitting here, waiting for our food. They have nice music,  not too loud, and the ambiance is nothing to brag out. Pretty much a to go kind of place.  The decor is a little weird....random sad or weird looking food. However,  the Pita's are really tasty and great!!! They're fresh, and seem to keep their ingredients innovative.  They have a lot of unlimited sauces to choose from,  I.e. Buffalo Ketchup,  Jalapeño Ranch, Tzatziki Dauce, and many more! I've been helped by Debbie twice now, and she is extremely helpful.  We didn't order drinks today, and without us asking, asked if we would like cups for water while we wait. She has an idea on how to do customer service. Give this place a try, you won't regret it! !"], ["Angela L.", "I remembered my first experience here to be positive, so came here for lunch today. I was less than impressed. There were no other customers, but the two ladies working were chilly and overall unenthusiastic. I ordered a Ceasar pita ($2 off a combo meal with your student ID) with chips and a drink. The process of picking my toppings had very little direction and was haphazard (borderline painful.. possibly too many options and I was not sure how much to fill my pita). The chicken on the grill was ready in about 5 minutes and once it was packed in the dismal looking pita, I was out the door, largely unexcited about my lunch prospects. The pitas themselves are mediocre, though passing, in taste but very difficult to eat as they fall apart toward the end. While I would like to support this business since they are serving healthy food, but  I think I will save my money for a wrapped meal at other locations."], ["Lillian Z.", "Aww, Pita Pit, I lava you! Pita Pit truly is the mediterranean version of Subway. Though on their menu they have a list of a bunch of different Pitas they can make, what actually goes in each pita (other than the meat) is really up to you.Customization here is KEY. I usually get the chicken souvlaki (trust me, it is divine), and add all the things to it. I definitely overstuff my pita full of veggie goodness (in addition to the grilled mushrooms and onions, I add spinach, cucumber, tomatoes, olives, feta cheese, and tzatziki sauce.) I also love that they have whole-wheat pitas (yay for attempting to be health conscious). The ingredients are fresh and make for a scrumptious pita-- definitely has become a go-to place for me when I'm too lazy to cook and just want to grab a quick bite to eat.I will say though, that I wish they listed what their \"recommended\" ingredients/toppings for each type of pita were. You can find them online, but it would be more convenient if they could find a way to squish that on the giant board where they list the types of pita. Even so, if you get stuck, just ask the person helping you what they would recommend you add for the type of pita you ordered-- they usually know what they're talking about.All the people who work at Pita Pit are super sweet and very student-friendly (show your student ID card for a discount on the combo!). A lot of the people who work here are also Sac State students, so that might have something to do with it...Again, with everything else in this plaza, I love the location. Recently I've been combining my Pita Pit trips with Starbucks runs and it's been lovely.tl;dr: Roommate can attest... I have become obsessed with this place. I sometimes dream of the pita that I will eat the next day. No joke."], ["Samantha C.", "Amazingly delicious Philly steak pita. Fresh veggies to go on all of that, too. And affordable. Well worth the price. I wish there was a Pita Pit close to my workplace because this would've been a much better option besides Subway."], ["Jennifer N.", "$2 off with your Sac State ID! Also, If you come here enough, give them your phone number and every 10 pitas you order, you get a free one! :) Food: There are endless ways to have your pita! It's really hard for me to choose which is my favorite because I change it up every time. You choose which pita you would like, there are many options including breakfast and vegetarian. This past visit I ordered the Chicken Cesar (chicken and bacon) in a wheat pita. They grill the meat in front of you and you choose from a huge selection of fresh produce. Like subway, you let them know which toppings and sauce you would like. I opted for lettuce, tomatoes, mushrooms, cucumbers, jalapeños, pepperoncini, and Swiss cheese with the Chipotle-BBQ sauce.  It was so good! Next time, I will ask them to cook the chicken into the sauce so it picks up more flavor. The pita comes out pretty big depending on your toppings. 4/5Service: Quick and friendly :) 4/5Final thoughts: I love Pita Pit! I used to come here once or twice a week when I was a student at Sac State. It's healthy and delicious! Can't wait for my next pita!"], ["Erin M.", "The food is good, the ingredients fresh, but they are disorganized at this location. They gave my meat to someone else - total wait time for ONE sandwich was 25 min. No joke. And not so much as a sorry. Everybody had came and went while I stayed standing there ever hopeful for my lunch. An apology would have went a long way."], ["Ricky N.", "Really friendly staff. Food is delicious, a little more expensive than it should be but I definitely devoured my meal.I got the cheesesteak with onions and mushrooms. Added some sweet onion sauce and chipotle sauce, my pita was fucking killer! I really can't wait to come back and get another!"], ["Phil B.", "Vegan food made to order, with a lot of vegetarian options. And it's inexpensive and quick. No wifi but you can use wifi from Starbucks next door. Students get a discount with ID. I wish they didn't cook veggies on the same grill as the meat."], ["Kimberly M.", "Not bad but not something I will leave craving. I got the Greek style meat fork style (salad). Flavor was great but not enough meat for the price in my opinion. They offer a lot of good add on options and I will go back but don't think I will be a regular."], ["Kara S.", "So pleasantly surprised to learn today from the sign in their window that they serve breakfast pitas too! I was waaaaay skeptical at first, but also super hungry. For about five bucks you can get a sausage, hash brown, green pepper grilled concoction. I added tomatoes, pepperchinis, and cheese with any of their tasty dressings to choose from. It took a bit long to make, I think because the hash browns, but it was gooey and huge and tasty. Despite my hunger, I couldn't finish the whole thing. I saw a couple construction worker type men in their also enjoying a late breakfast and they seemed satisfied with the serving size too. The lady was very helpful in suggesting toppings and flavor combos. It took me a while to figure out it's basically just a breakfast burrito. The best part is that they serve breakfast all day long!"], ["Charlie L.", "So I tried the gyro pita it was ok....kinda like a \"subway\" but middle eastern style..."], ["George Y.", "well i tried there Babganush Sandwich which as okay...I wasn't really impressed with the Gyro either.. It appears to be a the type of meat supplied  from servco and really doesn't do it for me..I was disappointed.. If you are looking for an alternative to Subway then this is your place! Looking for authentic flavors etc... for get it you will b disappointed unless you just wanna fill your gut with food...the price is fair but this unfortunately, as a dedicated foodie and i must be honest, just doesn't cut it for me in the flavor and style arena of foods to eat. I am sorry but I just need more for me to enjoy and this place fails for me...Clean and nice place and filing for your gt but fleave your taste buds at home  :("], ["The Critic 1.", "I would never think of ordering a salad from Pita Pit but I did it because I'm not a big fan of Pita and I am so glad I did.  I made my own mix with Chipotle dressing, meat, corn, black beans, sour cream, romaine lettuce, cheese, onions and it was the bomb!  It was a nice, healthy lunch and they delivered! Try it!"], ["Keisuke N.", "Good pitas.  I like their Chicken Souvlaki the best.  Great healthy lunch or dinner option."], ["Veronica O.", "Love this place!! Fresh veggies and meats! The staff here is always friendly and quick! Great place to go, to get in and out if you have a short lunch. My favorite wrap here is the turkey with spinach and chiptole sauce.. Sounds a bit off but it's an amazing combo!! Definetly will be back"], ["Janet H.", "Grrr... why did they have to close the one in Davis?!To solve our pita pit cravings, the housemates and I drove all the way to Sac to get our appetites fulfilled. I love how everything there taste fresh and the people working there were helpful and patient. It took me and my housemates forever to decide what to get, and despite our indecisiveness, they smiled and continued to serve us, happily.Overall, I would give Pita Pit a 3.5.Food's not bad, but kinda pricy for what you get... but still tasty and healthy, with lots of veggies! Dunno if I'll ever drive here again just for a gyro though."], ["Erik C.", "The place is pretty good better than opa opa by far, definalely one of the much better eating choices in tha area"], ["Elizabeth K.", "When you've spent an entire day studying and you're famished, you want something quick.  Not only was Pita Pit fast, it was delicious!  My advice is to make your own.  Pick your filling, pick your sauce and add every veggie possible.  You can also ask them to cook you some mushrooms, bell peppers and onions.  Follow this recipe and you'll end up with a very tasty and filling meal.  Another plus is that if you show your student ID, you get a discount!  Being close to Sac state, I can see that being done frequently.  We also made a small catering order with Pita Pit a while back.  What impressed me was how nice the staff was when we came to pick up our order!  They explained the sandwiches on the trays, what sauces they added, provided us with all the condiments, plates, and napkins we would ever need, and offered to help us to our car.  Did I mention this was all at 8:30am?  It may be more expensive than your standard pizza lunch, but it's always refreshing to provide a healthy and nutritious option for your group."], ["Christine A.", "I went here last night for dinner & ordered a gyro.  I love being able to pick and choose what goes into my pita.  I put spinach, sprouts, cucumbers, black olives, feta cheese & tzaiki (sp) in mine and it was great! I expected a little more meat for a $7 pita, but hey, it is what it is.About this location: there are no blinds or curtains so in the late evening, the sun is glaring at EVERY table.  The staff is really nice though. I wish there was a Midtown location."], ["Jason A.", "One of my new favorite lunch places. It's quick, inexpensive and the food is awesome. Kinda like a subway type of setup except the food is really good. I suggest the loaded buffalo chicken pita with tziki and chipotle sauce."], ["Stacy P.", "I used to go to the one in san luis obispo and loved it there. This place is just the same; very consistent to the rest of the chains, well grilled, and nice staff. Only thing missing from this location is avocado (which was not considered an extra in the SLO location). The only thing I wished was that I was a san state student so I could get $2 off.."], ["T M.", "I am a big fan of Pita Pit, however when you have a coupon that gives you a dollar off of a pita with no restrictions written on the coupon (I.e. I couldn't use the coupon because it was \" a breakfast sandwich and they are cheaper than lunch sandwiches\", then the coupon should indicate that.  Come on pita pit!"], ["Jason G.", "Sort of a \"fast food\" option for a healthy gyro."], ["Kathy N.", "Never ate a pita before..is that what its called? Anywho, it tasted kinda like a chalupa. Even with a discount, it was still extremely expensive, totaling 9 bucks for my pita, drink and a bag of chips -_-. Service was good though! It was my first time here and she did a good job of explaining to me what a pita was and how to eat it haha. I would come again, because it was goood :)"], ["Natalie C.", "I love this place. Great for healthy, fast food."], ["Shawn S.", "Recently, my journey's have taken me away to the far northern regions of Sacramento. I went to visit a very dear friend of mine for a couple days, and he had but one solid plan. No, it wasn't tours of the capitol, or boating down the river. It was to visit the Pita Pit. And it's a damn good thing for him that I enjoyed it.A damn good thing.It's set up is kind of but not really like a Subway, with a end result that looks like a Chipotle burrito. I thought they were just going to open the pocket bread and throw stuff inside, but this was not the case. You pick your pita from a selection of different choices. There was a club sandwich, and a Greek sounding one. My friend even ordered an Aloha one that wasn't even on the menu, 'cause he's a bit of fan of the place. I ordered the club, which consisted of turkey, ham, and bacon. Yes, bacon.So they take all the meats and they throw them on the grill and heat it up, and I thought to myself, \"Hell yes!\" Then I thought, it's a darn good thing we are the only ones in here, because had there been a line, this would have taken a really long time. So they throw the meat into the pita, and you add your typical produce, lettuce, tomatoes, olives, and some onions. There are a ton of sauces to choose from. I went with the tahini. Then they roll it up, and in the end it looks exactly like a Chipotle burrito. They saw that puppy in half and away you go! Chips and drink make a combo to which I said, \"YES!\" only because they had Cheddar and Sour Cream Ruffles and I was on vacation.The staff was very cool. I guess the lady that was helping us was the manager or owner or something. The other was this cute kinda surfer guy who was so nice. We were afraid was going to get mad because we came in late and thought maybe they were close to closing, but he was cool. I enjoyed that.I wish they had these in Long Beach, I would totally be there all the time, it's a way tasty alternative to the Subway across the street. Hopefully this will send out some awesome vibes."], ["Danny H.", "I just LOVE this place! The owners and staff are so nice and wonderful. I am now a regular there and they all know me and my family. The food is always good and you can really have it your way!"], ["Leah D.", "Tried this out for the first time to try and quench my gyro craving.  Surprisingly other pita places don't serve gyro meat. But Pita Pit does! Plus it was Wednesday so I even added double meat to my pita for only 99 cents. We were greeted immediately and the lady behind the counter asked if we'd ever been there before. We said no so she continued to explain how ordering worked. Basically its a subway for pitas. You start with your meat and they warm it up on their grill top. After your meat is ready they ask if you want wheat or white. Then you pick what veggies/toppings you want, which are unlimited.  You get 1 cheese option and sauces too. I would have given them 4 stars if I could order a side of fries. All they had were chips. The gyro pita I had was very good, but I wish I added cucumbers and had more tzatziki sauce. I could tell it was gyro meat from a package, but still decent. They offered good customer service. I would come back for another cheap gyro meat fix."], ["Ben B.", "The service was good and the place was clean. It's a little odd that it's basically a backwards Subway with pitas.  Not a bad place to go from time to time, though when you need a break from your usual food."], ["Mary L.", "First time here, and it was pretty good. It is a lot like a Subway just with pita bread. I love that you get a discount if your a CSUS student :) Overall pretty good for the price."]], "The Kabob House": [["Jess C.", "I think this place is my favorite Greek restaurant in Sacramento. Unlike most restaurants in Arden, the place is actually busy during lunch. Strange!The garlic chicken is super garlicy, and comes with a side of this delicious special garlic mayo sauce. Needless to say, after eating this, I would stay far far away from anyone. I felt like garlic was emanating from my body for the next 6 hours. The entree comes with a side of rice pilaf which is the most delicious rice pilaf I've ever had in my life. I think that instead of using broth or water to cook the rice in, they use pure butter. But who's complaining?The hummus is legit too. I just wish they were more generous with the pita!"], ["DD S.", "After my move from LA I have been looking for a great Greek restraurant. In which is very hard to find in comparison to the many choices I have always had in So Cal. Since I have been introduced to this little gem, I am a fan! The Hummus is to die for and the Grape leaves by far are the best I have ever had! The family puts lamb in them making them heavenly! I love going in having a glass of wine, chatting with the owners and eating from the appetizer menu. Yummy!The reason for the four star and not five is because I prefer the appetizer menu as opposed to the entres."], ["David S.", "Love this place, had for starters Babaganough, then main course combo succulent beef n lamb kabobs, finished off with a nicely done Baklava."], ["Prescila B.", "Good, not great Greek food. Homemade dolmas and tasty homemade pita bread."], ["Wendy P.", "Got the veggie kabob and wasn't impressed. It was $10 for just one skewer of vegetables that were cut way too big so that they were not cooked all the way through and were flavorless. It came on a bed of rice with a heavy dark brown sauce on it and a small Greek salad."], ["Ev C.", "I started coming here in 2009. It kind of doesn't look like a nice restaurant because of the location. But once you walk in you are seated by someone with a smile. As you wait you get a glimpse of what it really looks like in Greece. The owners are very personable. They remember your faces. And the food is great! I highly recommend the large gryo pita, it is delicious!"], ["Gabsters O.", "If you don't like the red sauce the kabobs come with, ask for the garlic mayo its delicious!"], ["Ben H L.", "My friend had her birthday here and it wasn't somewhere she chose randomly.  She had come here for lunch and wanted to try this place for dinner with the rest of us.  The only other Sac restaurant that I had Greek food before was Petra in Downtown.First thing of course, Petra is order at counter and this place is sit-down.  It isn't super big and not a lot of fancy decor touches.  The menu is very simplified which is good because I always order the gyro plate.  But, when I saw that could let me combo that with a lamb kabob, I decided to go with that instead.  The lamb was cooked decently, charred and not dry.  The red peppers and onions on the kabob were charred just the right amount.  The gyro meat was tasty and my fellow Greek tablemate also concurred with me as to the authenticity and quality.  They offered the so-called \"sauce\" in a bottle for my gyro meat.  I tasted it and it reminded me of Japanese katsu sauce with a bit more sourness.  No idea as to why it is showing up in a Greek restaurant but it tasted good with my rice!My other tablemate ordered a chicken salad and his salad ended up getting a bit too much dressing on his salad.  He tried to power through eating it but he couldn't and by the time he spoke to our server about it, most of us were already done eating.  The server was very apologetic and offered to bring alternatives but alas, the birthday cake was ready to be served...oh well!I also had a bottle of the Greek beer they stocked.  It was very light despite it being a red colored beer.  I'm told Greek beers are like that but looks can be deceiving.Kabob House is a decent option and a location where there isn't a lot of night business.  One can certainly do far worse at the chain restaurants down the street near Howe/Arden so I'd be  willing to come back if I'm ever back in the area."], ["John S.", "The only gripe i have is sometimes there a bit too much of the great sauce on everything. (They stopped doing that now, maybe they read my review :))The Gyros are to die for. The ambiance is fun. Greek music is nice. Funny bit is the greek aquarium decorations on the wall thingy. I've never had a bad dish here. My favorites are the dolamates and the Gyros. If you like greek food you will like it here. And it's fun to hear all the strange ways people pronounce Gyros. \"Gai-Rows\", \"Heros\", \"Jee-rows\", etc."], ["Sarina D.", "This place is yummy!! Garlic chicken and salad...pita was so soft!My mother is sooooo picky but LOVED this place. Definitely try it!!"], ["John C.", "GARLIC MAYONAISE....need I say more?  This place is awesome.  I enjoy the Garlic Chicken or the Gyro.  Someday I will try more stuff, but you can't go wrong with either of those two dishes.  One of these years the owner will put a lamb/beef burger on the menu lathered in their signature garlic mayo and some sort of cheese (I'd give feta a shot, but who knows how it will turn out on a burger).  Serve it with choice of heaping Greek salad or a mound of spicy aioli fries (similar to Jack's Urban Fries) for $9 or $10.  Just a thought."], ["Staci M.", "This Greek restaurant is my favorite in sacramento! We go here for lunch almost once a week... The garlic chicken is to die for. Just as long as you have mints or gum for after. The lunch or dinner plate comes with rice and salad. You can also get the garlic chicken on a salad which is how I prefer it. Big portions and comes with pita too! If you're in the area you def want to try this place! The owners are super friendly as well and if you call ahead at lunch they will get it ready for you so u don't have to wait as long!"], ["nick d.", "This was our first visit. The food was excellent. The staff was very courteous. We were very impressed with the food. We will definitely be going back again."], ["Mia C.", "This review is for a visit in early 2011 - came here for dinner with a groupon and really liked it. Was slightly on the pricier side and service was average. The gyros which I had was great"], ["Stone Cold R.", "Good food, ok prices...I would give them a 3 but the service we had was bad. Our busser did all the work while our server sat around. The few times she did come to the table she was super unfriendly.  The hummus and gyros were pretty good though. Maybe opt for takeout and skip the bad service?"], ["Ronda B.", "This is my favorite place to go for Greek food.  They have the best Hummus dip.  I love the garlic chicken pita sandwich.  Looks like I'll have to check out Cafe Europa though...it has a pretty good yelp rating!"], ["James M.", "I remember their food being much more flavorful.  Chicken Kabob with Garlic Sauce was good, service was excellent but I left disappointed because I remember the food being so much better."], ["Steeny E.", "Absolutely amazing food and fair prices. I love the kabob house. My favorite things are the beef kabob and the garlic chicken. The garlic mayo is beyond delicious, and the pita bread is warm and soft. Service has always been wonderful. I will continue to visit this restaurant :)"], ["Fancy N.", "The food is great. I'm not the biggest Mediterranean fan, but this place is great. Great variety to choose from. Great place for groups or just for you and another. Depending on what you get here, it can get pricey (if your taste is great)."], ["Nuriddin I.", "Overpriced,  bland food. I asked the server what she would recommend,  and said literally 'everything is good here,  just choose the meat'.  This turned out to be the understatement of the century. The meat was bland and the rice was sticky. I have not been back for seconds."]], "Anatolian Table Turkish Bistro": [["Melissa S.", "Love this place. The location is perfect. In the heart of downtown and walking distance of many other places to eat, browse, ect. It has tasty food and there is never waiting. We went here the other night because it was late, there was no wait, and the AC was amazing. Service was great. We were seated immediately and given tall glasses of ice water. It was such a relief. The menu has a huge selection and they have some really great lunch deals. I love the uniqueness of the food. It's very tasty and quite healthy. Dessert is delicious too. I love baklava.The place is very clean and airy. You are never going to sit too close to anyone. The kitchen is open and you can watch your dish being prepared. I really need to come here more often."], ["Steven P.", "Very good food here and excellent service. My wife and I came in, as this is one of the few places in Sacramento that has döner kebab, which was one of my favorite foods from my time in Germany. The place was very clean and we were greeted right away. Our server was very knowledgeable about the menu items and made some recommendations about our appetizers. We still weren't sure about the eggplant sauce but he offered up a small sample to try- it was great. Our hummus was also different than most hummus- best way I can describe it was that it was heartier than most hummus I've had. The Turkish beer was also good- not bitter but caramel taste in the brown ale. The döner was great- I was definitely stuffed and happy by the end."], ["Darina H.", "Loved all the delicious dinner options here. They were very accommodating when our party had someone who was gluten sensitive.  The waitress did wonderfully with our one year old toddler who was very active and throwing food around.  The lamb dinner I had was delicious and I had very particular requests (no pita bread) that they were able to cater to. My husband also loved his dinner (I forget what he ordered because I was so into what I was enjoying).Would definitely come back here again!"], ["Michelle S.", "We were just here tonight for dinner. The food was delicious. We ordered the mixed appetizer, which is basically a bunch of dips and bread. That sounds like not a lot of food, but the dips are different types of hummus, yogurts, and eggplant spreads. It's pretty substantial. I recommend the lamb. Delicious. The coffee was amazing, as well. Service was quick. Our server was very friendly. We would certainly go back."], ["Chris o.", "This place is sooooo good. Delicious !!! Me and the gf had the beyti kebap. Spicy lamb with rice and  a salad. Cooked perfectly and super juicy.  Our friend got the iskendar. It's like gyro lamb with the house tomato sauce and pita. Also awesome. And the Turkish beer is pretty good too.  Ohh we got the sigara boregi / it's a Turkish pastry , feta and mozzarella cheese in a rolled fillo dough fried.   Also great. Just needs some sauce or something.   Try thisPlace. It's nice on the inside and staff is helpful in ordering and friendly"], ["Rafael Á.", "Turkish bistro is centrally located in midtown and the restaurant is breathtaking and brings the feel of downtown Istanbul to Sacramento. Unfortunately, the front of the restaurant makes you feel like you'll be entering a dentists office of some sort. Now for the food. I was really excited to try out the Adana kabob that I had ordered. I was very pleased with the way it was presented and love the aroma coming off of it. The rice and the salad were terrific however the kabob was bland at best. Overall, I feel like I was let down. I will try this place out again and hopefully I'll have a better dish and experience. One last thing I'd to add was that the price on these dishes are really high. My meal was 15 dollars for just myself. They do have happy hour prices for food but they end pretty early at 4pm. I would say this place is worth one visit. Enjoy"], ["Alex F.", "The place is great! The food is delicious. I tried the beef kebap and it was pure heaven. My sister tried the lamb casserole and she absolutely loved it. I'd come back here anytime and I'd very much recommend it to other people."], ["Yixuan Z.", "Ordered shawarma and Beyti kebab. As a fan of kebab, I just want to try Beyti kebab. It is like a toasted kebab cake, bread outside  lamb kebab inside with spicy hummus. The lamb is a bit gamey but it is fine to me. Overall I really enjoyed my plate.My friend ordered shawarma which is good but a little bit dry.The Turkish coffee is very different. They don't filter the coffee bean remains and contains a little bit more acid."], ["Matt S.", "We tried Anatolian Ozel (special combo plate). It was very delicious. Every single item in the plate was very tasty: shawarma (doner), meatballs (kofte), beef kabob, chicken kabob, salad, rice, and yogurt sauce. Both the chef and the waiter were very nice and friendly. They have many other good dishes too. We highly recommend this place."], ["Jen W.", "Unfortunately, I've definitely experienced better Turkish food.  I really wanted to like this place to have a local go to turkish restaurant. The beyti kabob was bland and dry.  This is usually one of our favorite dishes but it just didn't work here.  We also ordered the kofte kabob.  Although the spices were good here...the dish was dry.  We had a yelp deal and utilized that for our meal.  We didn't end up ordering any dessert and left unsatisfied.  2 stars."], ["Mia C.", "We had an expired Groupon for this place. So decided to use it for Sunday lunch. When we got there, there was only 1 other couple. And after 30 mins, we were the only ones left at around 12:30pm. It didn't make any sense why this restaurant was so empty because their food is really awesome. The interior looks a little old though.We started off with Turkish tea [just 1.5$]. They serve this in a teeny-tiny though cute little glass. But we did get refills around 3 times or so. I had the tea with sugar and I liked it.For entrees we got the Adana Kebap plate [Spicy ground lamb] and Donner Kebap plate [Ground meat, sort of like Gyros]. Both plates came with a generous portion of well cooked rice, pickled cabbage and onions and fresh greens. Hubby preferred the Adana Kebap, which was fantastic. But I enjoyed both of them equally."], ["Eleight C.", "Ordered adana kabab, was too spicy you can't even taste what kind of meat it is ): rice is 1 out of 10"], ["Atee T.", "Adana Kabab was spicy, tender and just amazing. Beet kabab was really good as well. they need to work on their rice it was okay"], ["Connie C.", "I have only tried Turkish cuisine once and thought it was pretty good.  I saw Anatolian Table on Groupon and was excited to check it out.   Anatolian Table is located across from The Golden Bear/Rick's Dessert Diner on K Street.  Look for the yellow umbrella tables outside as the sign isn't easy to see in the dimly lit area.  The atmosphere is casual with a swanky twist with the dark interior, purple/yellow colors and lots of bench seating and tables.      I ordered the Apkar Hummus, which is made with olive oil, mozzarella and cheddar cheese and served hot.  It comes with a basket of warm pita bread.  Order this - you will not be disappointed.  It comes in a small dish, which initially made me sad because the portion seemed small.  Do not be fooled by this as the dish was so filling that I almost couldn't make room for my entrée.  I had a tough time deciding on what entrée to order.  For some reason, reading about \"beef cubes\" or \"chicken cubes\" just doesn't sound appealing.  Add that I'm not a fan of lamb, made the menu choices even more limited for me.  After reading some reviews that \"it doesn't even taste like lamb\" or \"you won't regret it\", I decided to be a little more adventurous and give lamb one last shot.  I ordered the lamb hunkar, which turned out to be pretty good.  It is cooked with smoked eggplant sauce, with rice that tasted like mushroom risotto, which I absolutely loved.  However, I should have trusted my instincts and yes, it did taste like lamb.  The Turkish coffee was pretty good as well.  It came in a tiny tea cup (think kid sized tea party cup) and tasted like chicory coffee.  You can only take about 6 sips at the most before you get to the slimy, thick, espresso film at the end.  I recommend not to drink this! Our server was friendly, patient and attentive.  We were the only ones in the restaurant initially but as people started coming in, he still checked on us.  The bill came in a pretty jeweled box.    Kid Friendly - I did not see any high chairs.  The 'kids cup' was ridiculously small and adorable at the same time.  The kiddo even looked at me like \"that's it?\"  There is no kids menu, but lots of appetizer choices.     Overall, I had a good experience here.  I would probably come back for appetizers, especially the hummus!"], ["Eazy E.", "Great local midtown place for kebabs and kofta. They also have traditional Turkish coffee."], ["Rachel P.", "I've been to this place twice, and I am always surprised there aren't more people inside. Their food is so good! My favourite dish is the lamb hunkar. It is so delicious! The eggplant is insane. If I could make eggplant like that, I'd eat it all the time."], ["Sleepless I.", "Driving around looking for a place for dinner, my family and I happened upon here a couple weeks ago and enjoyed it very much. We ladies each had the Beef Kebap (\"Tender cubes of marinated beef kebap with seasoning\") while my guy had Beyti Kebap (\"Spicy grounded lamb seasoned with garlic and parsley wrap in flat bread\"), which he said he liked very much. Our waiter was attentive but not hovering, and recommended the Turkish beer (Efes) which went well with my dish.I requested my steak cooked Medium Rare while Mom is a Medium kinda gal, and our kebaps were served as ordered. The dish comes with vegetable rice and salads of crisp red cabbage, marinated purple onions, and lettuce/tomato, along with a nice dipping sauce/dressing (\"House yogurt with cucumber and olive oil\"). We ordered extra of that as it was so good. We had some flatbread too which we all shared. Everything was very tasty.We all enjoyed our dinner very much and will be back soon. The restaurant was tidy, clean, and was nicely decorated but not fancypants."], ["Cat H.", "I've been here three times now and it's always been great service and great food.  Also, it's always been mostly empty when I've gone, which is probably not that great for the restaurant, but I really enjoy that lol Food:Most of their food is marked as spicy, and since I'm not a spicy food person (wamp), my choices are a bit limited (but they're all still good). My favorite dish so far is... I can't remember what it's called, but it's like a creamy eggplant dish with meat (ugh lamb is so good) on top. Excellent. Their lamb casserole was okay, but the eggplant dish was definitely A+ with extra credit.Service:Very friendlyParking:No lot and... well, it's midtown.Ambience:Casual, nice night out kind of sit-down place. Great for families and date nights."], ["ny w.", "The BEST lamb I've ever had, aside from my Granny's. Service was great. We arrived with a group of 8 and they had no problem breaking splitting the tab 3 ways. Very spacious and clean. The meat I believe is cooked to order not sitting under a heat lamp (I saw no heat lamp)."], ["MN W.", "Why is this place not packed every night?! Best Turkish food I've ever had. Every time we come, the food seems to get better. Try the doner kebab - perfectly flavored meat sliced thinly off the rotisserie, served over a bed of rice accompanied by a variety of salads. Lasts me a couple meals and is fan-freaking-tastic!"], ["Stew M.", "Good Doner Kebab baby!"], ["Huseyin A.", "I am Turkish-American and I can say that this place is amazing and authentic. Adana kebab plate is amazing and so was everything else. Both the baklava and rice pudding were amazing deserts. Both dark and light Efes beers are a must if you want to try it."], ["Nicholas C.", "Been here a handful of times. The food is great and service is excellent as well. Can't ask for more than that."], ["Julia D.", "The location in Stanford Ranch is one of my favorite restaurants OF ALL TIME. This location upholds that standard beautifully. Come here. It's impossibly delicious. Everything is. ORDER EVERYTHING."], ["Stella A.", "The chicken kebab was well prepared. The food was a bit  on the salty side and I would have liked to have seen basmati Rice on the plate instead of the short grain one they serve."], ["Ashraf H.", "Food was very good and the staff was friendly.  Definitely worth trying out if you live in Sacramento and want something new to try.  Priced a little higher than I would expect.  Wouldn't have date-night there as the ambience inside is lacking."], ["Yvonne L.", "After reading the review in the Bee, I really wanted to try Anatolian. I love Lebanese and Greek food but this is my first time to eat Turkish food. To me the taste is good but mild. We shared the babaganuc which is a appetizer dip made out of eggplant. I really think the warm pita bread hid the taste of the dip. Next time I want to try the  shepards salad. We also shared the lamb hunkar and the lamb kebap. I thought the hunkar was better. The lamb kebap had good flavor but I think it was just a tease. I was just disappointed since last week we had a 5 star experience at another restaurant. My Honey loved the lamb hunkar.  BTW, the service was excellent. I should have asked him for a recommendation on what to order."], ["Ken P.", "I love Mediteranean food. Greek, Lebanese, Jordanian, Israeli, etc.  We originally found this place when we intended to go to a hipper mid-town restaurant that was hopelessly busy.  This was our second visit.The food is tasty, if a bit difficult to figure out what you're going to get.  The server is knowledgable and friendly and is very helpful in describing the food and is eager to make suggestions.I can't remember the name of what I got, but it was really good.  All of us in our party was pleased."], ["chris s.", "A clean, well-lit place.  Decor a bit anodyne, but the food was just excellent, and the waitstaff was great.  For the price, great food."], ["Doug G.", "Got the meat sampler for one...all meats were good and nice qualityLentil soup was really under spiced. I highly recommend the chili spice to add in soup and on anything and everything. Baked garbanzos which was a hot humus with cheese pin nuts and paprika Baklava was very good and really sweetIn a nice part of midtownIt was really high priced and did not have a lunch menu so lost a point. really 4 star but price caused to be a 3"], ["Yvette G.", "When I reminisce about my dinner, I instantly want to tilt my head back Homer Simpson-stye with my tongue hanging out. The food here is sooo good.  I had the Beyti Yogurt Kebap.  This dinner consisted of  spicy ground lamb seasoned with garlic and parsley, wrapped in flat brad with spicy humus and yogurt.  The meat was perfectly seasoned.  The spicy humus and the yogurt complimented the dish well.For dessert I had the Kunefe which had shredded filo dough filled with unsalted cheese, topped with pistachio and house syrup (honey, I think). The chef brought out the Kunefe nice and warm.  Amazing is the only way to describe this dessert.  The service here was very good.  The server was not able to answer my questions, but immediately went to ask someone.  She admitted she was new and still learning the menu.  I don't mind if someone is new as long as they take the initiative to find out the information.  The chef came out during the meal to check to see if I was satisfied with the food.  He was very pleasant, and I could tell he was passionate about the food."], ["Beth U.", "Service was really great when my friends and I came here on a Saturday night for a friend's birthday.  The servers were very friendly and attentive, and even brought us extra pita bread.  Yay!  We ordered a plate of various yogurt sauces and hummus for an appetizer.  I especially liked the pita bread because it was soft and warm, unlike sometimes when pita can be tough.  I ordered the doner kebap plate, which was a large portion of meat and tasty.  Will plan on coming back sometime for lunch."], ["Rob R.", "We tried the three lamb dishes and we all thought the lamb hunkar was quite delicious - spicy lamb on a layer of roasted eggplant.  The calamari wasn't ready so the server offered us a complimentary hummus and pita bread app.  Service was amazing the night we went, and will totally go back to try some other dishes."], ["Rosa P.", "I would have written this review right after I was done eating, but I was still in awe of the amazingness of this place. Turkish food is amazeballs. My boyfriend is full Turkish and he loved the authenticity of the dishes. Apps, entrees, desserts, etc.... all of it...just...*throws self on floor*Oh...OH! Turkish coffee and turkish beer was also on point! I seriously can't wait to go back...."], ["Chris S.", "So far I've been here twice, once to eat in, and once for takeout. Both positive experiences.I'm not yet as familiar with Turkish cuisine as I am Lebanese, Greek, Persian, Afghan and Egyptian, but everything I've gotten from here has been pretty fantastic.First visit was with my wife and her mom. I got the Betyi Kebap. The meat was very flavorful and with just the right kick, and it was delicious with yogurt sauce drizzled over all. Would definitely order again.Second visit (takeout) was the chicken casserole. To me it's more of a chicken stew, but definitely order a side of rice because you'll want it to make sure you don't miss any of the delicious flavor of the sauce. I garnished this with both chile and yogurt sauces (both go well together), and scarfed it down. I need to try to make this one at home, it's really excellent.I would highly recommend this place. Try it, I think you'll be pleasantly surprised."], ["Jessica T.", "I really enjoyed the Sebze Hunkar (sauteed vegetables on eggplant sauce). The veggies were nicely seasoned and served on top of a very tasty eggplant sauce. The service, while friendly, was not very attentive. When we arrived on this blazing hot night, water was not offered and we had to request it. I was about ready to go into the bathroom and drink out of the sink. Some other service pitfalls included timing of the food, as well as not checking on the table as often as I would have liked. With that said, I'm absolutely going back because the food was great and I feel confident that the service will get ironed out once this location has been open a little while longer."], ["Svetlana K.", "Wow! This place is amazing!!! I've past by it many times without giving it a second thought. From the street, you don't really notice it because it seems to share the buildings with other businesses. You first see the words: Pizzazz! A K Street Collective on the side of the building. What does that even mean!?! I don't know but the delicious smells coming from this restaurant were too enticing to miss. We walked up the broad step that leads into this place and saw it was Turkish food restaurant and decided to give it a try.When you first walk into this place, you might think this is just a regular casual fast food type restaurant. The chairs and tables are clean and nice but nothing fancy. There are paper placemats on the tables and the menus are printed on a colored paper brochure. Which we were totally fine with and we started to head towards the front counter to order food when a kind man asked us to take a seat.From there I was totally blown away by the service. It felt like we were dining at an expensive restaurant, but we weren't! The prices are sooo reasonable. Our waiter was so kind and polite. He really helped us find just the right thing to order off the menu. It was a fascinating experience. And the food!!! Omg! It was sooo good. The chefs worked in an open kitchen with white uniforms. Everything was so professional and amazingly delicious. I highly recommend anyone to come check this place out. We feel like we just discovered a new favorite place to eat!"], ["Alex L.", "Came back again and the food was once again fantastic. Even better though, they are now serving alcohol judging from the wine at a neighboring table!"], ["Dana H.", "I am already hooked on this place after one lunch. I'll be going again next week, if not sooner! The place is cute. It's in a building that used to be an art collective of some sort (or may still be? Unclear), but they did a great job of converting the space. There's a large open kitchen, so you can watch them make your food if you want (or if you're finicky!). We went for an office lunch, and there were 6 of us. We did make a reservation, but it was totally pointless, as only two other tables were full (SO SAD -- this place needs some more business!!!!). We ate like complete pigs, and two of us had leftovers. We had appetizers, entrees and dessert -- for a total of $130 (before tip). Pretty damn good price!But the food -- the food! Yum. Highlights: - Babaganoush was phenomenal- Hummus was good, but not nearly as good as the babaganoush- Feta appetizer was delightful (I think they must make the feta or buy it fresh) - Salmon was good- All lamb looked awesome (I don't eat meat, but I was a little jealous at HOW yummy it looked) - VEGETABLE HUNKAR -- I cannot recommend this enough. I had never had this dish, but it's a creamy eggplant sauce with roasted veggies on top. The flavors were bursting, and it was so rich and delicious! Even the meat eaters at the table were a little jealous when they tried mine. They also have meat versions : ) GO!"], ["Pat H.", "Clean as a whistle.Very informative staff...willing to explain and recommend!Great tasty food.  We will be back."]], "The Press Bistro": [["Teddy L.", "Wow! I had the Hanger, and let me tell you the potato scallops were amazeballs. Steak was cooked to perfection and the Tapas were on point ( Arancini, meatballs and croquettes). I would literally pay 24 dollas for them scalloped potatoes!"], ["Keylo P.", "Came here with a few friends on Valentine's Day. We went with their Valentine menu which included a four course meal. Such as, appetizers, salad, steak & dessert. Loved the set up & feel of this place. Will definitely be back."], ["Jesse M.", "The Press is quickly becoming my favorite restaurant in Sacramento.  I've been here four times and every single time it has been spectacular.On the most recent visit, the service was excellent as usual, the house wine was affordable and delicious and the food? Oh lord...the food.The tapas need no explanation: they're all fantastic.  Get the fried meatballs and focaccia bread.  You really can't go wrong.The salad lyonaise was great; it's hard to find a good salad that reminds me of France the way this one does.  My only complaint is that i'd like to see meatier chunks of bacon in it.  Otherwise, it's perfect.For the main course I had the hangar steak.  It came perfectly cooked (medium rare), melted in my mouth with an excellent flavor and included a delicious potato gratin on the side.  I could not have been more pleased.Others in my party had the short rib, linguine with clams and chicken piccata.  Of those 3, which were all excellent, I think the chicken was the least loved (that's not to say it wasn't great, it just had marvelous competition). For dessert, I can tell you without any hyperbole that the Maple Nut Pie with bourbon ice cream is the BEST dessert I have EVER had.  It was utterly fantastic.  This alone would have yielded a five star review... it was that good.  Go.  Go now and get this if it sounds at all appealing to you.Can't wait to go back."], ["David W.", "The food was good but definitely not great. The service was just OK I don't think it was a bad restaurant it just didn't live up to the hype."], ["Marshall M.", "I went here for my friends birthday and it was great! The decor was cool and the patio was very nice on a beautiful night. We had the mixed green salad and arancini both were.perfect! For our main courses we had the hangar steak and swordfish. We loved both dishes and I would recommend both dishes to everyone going there. Also pay the $1 dollar for there fresh bread and intense but delish olive oil. The house zin is ok but for $6 a glass it's well priced. This is great place for a romantic dinner or for someone's birthday."], ["Lolailo Y.", "Let's get the facts on the table first: just because you choose to serve me something in a small plate, that doesn't give you the right to call it a tapa. That said, they had plenty of delicious dishes. We were particularly impressed with the grilled calamari. It melted in your mouth. The potato croquettes were boring, but everything else we tried (the piquillo peppers, the pappardelle, the meatballs, etc) was delicious. Cocktails were generous, and so was the sangria. We shall return!"], ["Zeynep A.", "I have been to this restaurant twice now and both times I loved what I ate. I actually want to give this place 4.5.  We had the steamed mussels, piquillo peppers, calamari, clam pasta and a hangar steak. Everything was absolutely delicious. My only negative feedback would be that the portion size could be a little bit bigger. They have a decent wine list. Lots of options if you want to just have a class. The patio space is nice with pretty lights above.  I am planning to be back."], ["John G.", "Mediocre over all. This service was good and the desert was very good ( banana crepe). Unfortunately, the main dishes were a disappointment and definitely not worth the higher price. The duck confit tasted like a bland chicken dish. We might return but mostly for the atmosphere and maybe a couple of drinks."], ["Elaine H.", "LOVE this restaurant! Only been once, but I'm already dying to go back. Their tapas menu is bomb. Even their bread is good.For my main, I got the mussels and our waiter forgot to bring me an extra dish for the shells. My friend casually commented to me about it and the head chef came by our table in a few minutes with the extra dish. Superb service."], ["Dominique M.", "Walking through the double doors of The Press Bistro you immediately feel the swanky urban vibe from the high wood beamed ceilings to the brick walls and open floor plan.  I have heard of this place and had wanted to check them out for some time but never made it in so when I saw them listed on the Vegan Chef Challenge, I knew this would be the best opportunity.The service was very much in line with what you would expect from a higher end dining experience, although, with a casual and welcoming demeanor.  The vegan menu was $30 pre fixe with four courses, each with unique character, style and flavor.First Course - Roasted beets, shaved fennel, pomegranate, watercress: What a great start.  The roasted beets were cooked just right with a slight hint of citrus freshness from the seasonal pomegranate.Second Course - Butternut squash soup, fried brussels sprouts, apples: The soup itself was the prefect temperature.  Not to hot, not too cold.  This mix of the salty and savory brussels sprouts and the tart of the apples was a nice compliment to the sweetness of the butternut squash.Third Course - Stuffed gypsy peppers, mushrooms, leeks, pine nuts, couscous, white bean puree, wilted beet greens: This was, by far, my favorite of the night.  The mushrooms over wilted beet greens was mouthwatering!  The stuffed peppers were cooked tender but not mushy stuffed with the blend of pine nuts, couscous and white bean puree blended very well together.  I want this recipe!Fourth Course - Port wine poached pear, pear sorbet, candied walnuts: I am not really a fan of sorbet, so that may sway my opinion of this dish.  I like the idea of paring (no pun intended) the seasonal pear with a lightness of a sorbet.  They went very well together, particularly with the added sweetness of the port wine.  For a sorbet dish, I was impressed. All in all, I very much enjoyed this menu.  It was obvious there was a lot of thought put into the seasonal items and each item of each course had elements to balance each other."], ["Shelley S.", "Made a phone reservation last night, when we got there 45 minutes early we told them we had a later reservation I would be happy to sit at the community table. They said they could not find our reservation but had plenty of empty tables and sat us. We were looking over our menus when the chef and owner decided to come to our table and let us know that we made our reservation in properly and made us feel we were very lucky to be sitting. Went back over to the reservation girls and gave us a very snide look. We felt his behavior was very rude and when we left he told us to have a nice day with a big smile. Our party of five went next-door and spent $500. I had friends from out of town and wanted to show them a nice experience I will never go to the press again."], ["Alan S.", "To put it simply, this place has pretty tasty food, but you pay for it.  The food was good, don't get me wrong, but for the price it sure better be!  I wasn't too impressed with the cocktails, trying both the Mid-hatten and the Sac-zerac (yeah, local takes on pretty famous drinks).  They were not bad, but there were not amazing, and for the price I was a little disappointed.  Between three people, each only having one drink, our bill was over $100 and we left satisfied but not amazed.  The tapas and the pasta were the highlights, the entree and desert was only average.  Had we skipped the entree and drinks it probably would have been a 4 given the quality and value of it all."], ["Rico R.", "My wife and I dropped in for a drink and a some tapas.We had the pork belly, arancini, stuffed pepper and meatballs. All were delicious. The meatballs were served plain so we kinda looked at them suspiciously when they arrived but we had a pleasant surprise when we bit into them. They were delicious!I wonder if they did that one purpose - sleeper meatballs!The house Pinot Grigio was very good although I forget  the brand.Service was good. Very friendly and courteous staff. And the place looks nice! Comfortable atmosphere.Nice place"], ["Stacy S.", "The place was hopping, yet the chef came out to find us a table and make us feel welcome. Service was personable and attentive and the food was delicious. Don't miss the pork belly, the arancini, and the short ribs."], ["Amanda K.", "Interesting little place! The Tapas were really yummy and the staff were attentive and pleasant. Only reason it gets 3 stars instead of four is because, the main dish was a little bland. I had the mushroom ravioli and there was little flavor coaxed into mushroom filling. The butter sauce didn't really even have a taste of butter...seemed oily. The pasta was thin, smooth and well cooked. I will give it another shot sometime, but I hope they add more flavor in the future, because mushroom ravioli is my favorite!"], ["Kim V.", "This place is awesome. I'll be honest I didn't even look at the prices, though I can imagine it was pretty expensive- my date ordered cocktails and a bunch of tapas from the menu and every single one was delicious. The bartender was friendly, and the service was excellent. We sat inside, which was nice -- but next time I would want to sit outside under the lights at night- it's beautiful. I am looking forward to another special night out :)"], ["Kathrin P.", "Our friends took us here to meet with a bigger group of friends for dinner. First Impressions: Busy for the weekend, but we were able to be sat because our friends had a table already. Love the atmosphere already. Style: Classy urban bar. Love the decor, brick walls, art pieces. Taste: Foodgasm. Tapas were all delicious from the marinated olives, roasted beets, fried meatballs, crostini, and arancini. Who knew I would love olives until now? Absolutely loved the grilled hanger steak in a savory sauce and mouthwatering potato gratin! The steak was full of flavor and cooked to perfection. We also had the pappardelle pasta and it was divine! Perfect portions, cheesy, and delicious. Loved the asparagus and mushrooms. How much?: Can it get any better than $24 for a hanger steak. And $9 for my pasta! Ridiculously awesome.Drumroll: Can you please open one near me? I have to come back just for these dishes. Great restaurant!"], ["Gurdeep D.", "Me and hubby scored a last minute date night before my MIL left us back to LA after three months with us. So....we were definitely hungering for eating out at a super satisfying place as it had been awhile. Glad hubby picked this place because it lived up to expectations of a couple who never gets out and really wanted a special night.We ordered the following:gin cocktail with grapefruit and other stuff....delicious and didn't realize how stronghouse red -- very tastythree tapas: celery and dates (the best), roasted garlic arancini (delicious), and beets (decent)then meals: me - mushroom ravioli -very different then I am used to but very tastyhubby - caviar papardelle with poached egg - a special - elegantly simple but deliciousChef English hovered around dining area in such an adorable way. we never felt so loved as customers. we didn't really get to talk with him but it was the coolest to have him around the dining area and so attentive. coming from LA and the bay, and amazing food, great to have good food in a homey atmosphere around now that we are settled in Sac!"], ["Steven M.", "The food was good once it finally showed up. An one hour wait for my meal and the place was dead. Not sure what the hold up was, but I left with a bad feeling about my experience. The staff offered to buy desert and wine which was commendable and appreciated, but getting the meals out in a timely matter is more important."], ["Lauren H.", "Pros: the atmosphere is fun for a date night or night out with friends. I enjoyed each of the tapas we got- they were all very tasty and different! Cons: the portions are ridiculously small for the price you pay. Count on spending over $60 if you intend to get full."], ["Ashley A.", "The Press is a 5/5 stars easy. Everything on the menu is phenomenal. I've loved everything I've ever tried, and the prices are so affordable! This is gourmet food for the price of a plate at Paesanos. Why would you even go anywhere else?I've tried the chicken piccata, the pork chop, and the hanger steak, all of which are mouth-watering. You really can't go wrong here! I also highly recommend trying the butternut squash ravioli and the endive salad. The Press is a must try spot and it is now a favorite of mine and all my friends!"], ["Eloise B.", "Went here on a Sunday night and they said they were booked completely unless we wanted to sit at the community table or out on the patio. It was nice out so we opted for the patio. I had a feeling this place was going to be amazing if they were booked on a Sunday evening.When you go here you need to try the tapas first. They do 3 for $10 with a nice selection. We ordered the goat cheese stuffed piquillo peppers (amazing), the fried meatballs with garlic yogurt sauce (also amazing) and the potato croquette (so-so - could have used some kind of sauce with it). I also ordered the caprese salad which was fresh and had a really flavorful balsamic vinegar on it. For my main course I was so stuffed full of tapas already that I decided to order the half order of the chicken cannelloni. I actually regret not ordering the full because it was a creamy, delicious treat and I would have loved to bring home leftovers!The wine selection is also great and they don't skimp when they pour you a glass. This would be a great place to bring a small group of friends to drink wine and enjoy tapas and pasta for the night! But make sure you make reservations!"], ["Barbara S.", "Great location to eat when in Sacramento. I was here from out of town.  There is an inside or outside for dinner  They won me over when I received new silverware and plates for each course.  I don't drink, but the wine list looked nice.  We started with three tapas plates for $10.00. They were a good size and delicious.  The roasted beets with goat geese was very tasty and fresh.  The mac & cheese and corn/arancini were good but too similar. The caprese salad was fresh and very tasty.  Good balsamic.The wild king salmon was made perfectly.  We asked for not raw, but not medium.  It was not dried out and served with the most delicious ratatouille which added to the salmon flavor.We were too full for dessert.  Our waiter was helpful.  The restaurant has any waiter serve so the food is served at its optimum perfection.Thanks so much."], ["Merrilee V.", "BRAVO!Who knew? So little press about The Press Bistro, simply fantastic in every respect. The Moscow Mule is the best I've found in Sac. Cecconi's West Hollywood, the best anywhere, mix is freshly pressed, but The Press's version is great.Tapas to die for! Meatballs, celery melange, arancini, and pequilla peppers with goat cheese, easy to make an entire meal on these, hating to leave them...Appetizers amazing! Mixed green salad, how good can that get, right?!  Surprise, it's full of tasty palate pleasures that leave you wondering what is this combination? It works!Grilled calamari with cherry tomato panzanella? Put your fork in a cloud, it's that tender. Never have I tasted calamari like this, heavenly. Topped with the panzanella you fight the choices all night, a bite of this or that...?Finally, chicken Parmesan with fresh tomato sauce, and basil on top of homemade fettuccine. The chicken, moist, not underdone, tender and firm with no overdone frayed edges (not easy to do), the noodles, alone they are delightful, light, tender, perfectly al denté, then tomatoes the way they should always be, light, naturally sweet, full of color and tenderly firm... Such a dish!!All on a Sunday night, usually not the best time. Service at the bar, the hostessing, and the wait staff exemplary.Kudos to you Mr. English and your Sou Chef, Mr. Johnson! So glad to have found you again Mr. English, missed you at Ella's."], ["Bridget C.", "I am vegan so I thought this place wasn't for me, but they participated in the vegan chef challenge so that was cool. I wanted to eat there during the challenge and never got to. Months later they were offering a 4-course dinner for two for $50 and I decided see if they could do a menu for a vegan with that special and they said they would do something for me. I came in with my vegan friend and the chef came up to our table to discuss food options with us. After knowing what we like, he got creative and created a bunch of small, original and incredibly delicious dishes for us. We were excited they kept coming! The chef also recommended a delicious bottle of wine for us and brought us 3 different sorbets for dessert. The experience was very personal and special and made us really want to go back for more. This place is a must go!"], ["Matthew James R.", "WOW!I was wined and dined by my General Manager...Don't tell HR because I really want to come back here.The Old Fashion was delicious!!!I had the Steak and my mouth is still watering just thinking about it.The waiter knew his wine list like the back of his hand.  I will return with or without my GM. :)"], ["Stella A.", "Very lovely here. I like the fact that there are an array of tapas to order so that you can try a few things for dinner without feeling overly stuffed. The food is very delicious and flavorful. I appreciated that the staff checked in on us and asked how things were. I also really liked their extensive wine menu. The Riesling was amazing! I would definitely come back again."], ["Jennifer B.", "Really enjoyed our meal at The Press. Went last Saturday for an early dinner before Music Circus. We had a reservation, just in case, and were seated immediately. Within the first 3 minutes, three separate waiters came by to ask our drink order. It's great that they were attentive, but give us a minute to check out the menu! Once we ordered drinks with one guy, he pretty much handled us for the remainder of our time which was perfect.We ordered 3 tapas - goat cheese stuffed peppers; celery, date, bleu cheese & almond salad & fried meatballs. All were delicious & perfect for the 2 of us to get enough of each one.Shortly there after we got our appetizer, gnocchi with truffle butter sauce & mushrooms. These were delicious, but maybe a little dry. Would have loved more sauce, it was delicious!We split an entree, the braised short rib over polenta. Delicious & so tender! Only needed a fork.We also each got 2 drinks. I opted for the sangria which I wasn't a huge fan of & boyfriend got a bourbon & ginger ale. For all of that, our bill was about $70. I thought that was pretty fair! Loved the feel of the restaurant too. Great tall ceilings, exposed beams, big front windows for a lot of natural light & mirrors for it to bounce off of. I'll definitely go back!"], ["Courtney F.", "Let me just say this place is amazing!!!  I work down the street and is truly a hidden gem. The food is great, service it's , atmosphere is present and open and not to mention the chef came by to check and see how our food and experience was. I am a huge fan of knowing who is preparing my food, want to shake your hand and tell you thank you for my dining experience. They also have a great selection of wine. I would highly recommend!"], ["Ashley L.", "Came here on my actual birthday.The decoration here reminds me of the Brick House in Old Elk Grove.  Overall, it has a nice and comfortable feel to it.Started out with the Steamed Mussels.  One of my friends raved about how good the mussels are here so I have to give it a try...was a little skeptical since I had some \"not-so-good\" mussels the night before.  I will have to say that the mussels here are way better than what I had the night before.  I didn't taste much of the white wine, but it was a little on the sour side....citrus-y I should say.  I had better elsewhere, but this mussels dish is rated pretty high on my list. It probable took me about 5 minutes to finish the whole dish....YUMMY!Grilled Swordfish - the fish was cook just right and went very well with the green garlic sauce.  The winter greens were a little on the saltier side, but overall the dish was yummy.Hanger Steak - the steak was cook to his liking and was pretty tender.  This dish is also pretty tasty. Both of us finished everything on our plates.  The portions were just perfect and we both walk out of there with a happy stomach."], ["Rebecca J.", "Very nice ambiance. Food is good with interesting flavors. In terms of price, you are getting what you're paying for so I have no complaints there."], ["Ashley R.", "Let me start by saying this was my first and will not be the last. We started with three tapas, they came out super quick was good. I wouldn't go crazy for them but nice for sharing with friends. I had the braised short ribs for dinner, they were so good both my friend and I wanted to lick the plate. Of course we didn't but would recommend to anyone! Wouldn't change a single thing about my main dish. However our water who  did his job well in clearing plates and stuff, he was not very chipper just seemed to do the job, and go through the motion, with minimal interaction. This is the reason I took a star I will joyfully come back one day In the future."], ["patrick w.", "If you want to skip to the end I think I can summarize this review in one line \"a mediocre restaurant that happens to serve really good steak\"I will preface this review by saying I did sit in the communal table as I have a life and I choose not to make reservations at restaurants on a Friday night. i'm sure if I was at an actual table the service might have been passable.First things first, The hostess was pretty rude. When we walked in she just looked up at us and said can I help you. This is kind of a offhand comment for someone who's standing in the very front of restaurant Who sole purpose for being at the restaurant is to meet and seat.  Normally a hostess would say something like \"hi how are you? two for dinner?\" It gave me the impression that she thought I had just wondered in there lost. She then gave the impression that waiting for a table was not an option,  then second handedly offered communal seating.  Unprofessional. As for the service. Here's my thought. servers basically have just a few things they need to do. Get your order right, ask if you need refills, Have personality or at bare minimum be polite, ask for feedback about what was ordered, and make suggestions.My server was polite he did not mess up my order and that was about it. For that service I gave a 20% tip that I immediately regretted when I walked out of the restaurant. For instance one of the many items that I ordered was a salad that was over sauced and could've really used some type of pepper which wasn't on the table or offered.I tried a variety of the food, the steak, was amazing and pretty much why I gave any stars. Everything else was sorta of bland or blah.  The pork was pretty good but needed some greens. I had some of the stuffed peppers - the presentation was sloppy but tasted decent.   The fried risotto was pretty gross - it had a decent batter but the innards were bland and blah."], ["Larry B.", "The Press consistently delivers the 'best food for the price' dinner in Sacramento. The quality is excellent and the pricing is very fair for the fresh, seasonal gourmet quality that David's team cooks up. The hangar steak with potato gratin (amazing) is a go-to, the seasonal fish and the commonly-accompanied risotto variations are always a treat. The desserts and tapas are also amazing. Not to mention, this place has visual appeal too. The exposed brick and wood-framed interior provide a clean rustic, relaxed decor. The atmosphere is one of the best unassuming vibes in midtown located next to the likes of other popular locations like Zocalo, 58 degrees and holding, and Paesanos. It's great for a date, dinner with friends, or family. The alcohol is also fairly priced here, try the house red blend, for $6 per glass you can't beat it!"], ["William V.", "We've been here a number of times and each visit was special .  The food and prices and service keep us coming back.  Tonight's black cod entrée and calamari appetizer were to die for.  Try the new early bird special   A great deal."], ["Ashley D.", "The Press Bistro has a good ambiance. The service was prompt, the menu has a good variety and the prices were reasonable. Overall I enjoyed my experience and would return again. We went on a Sunday evening, it was too packed so there was no wait but I'm sure it would be during typical dinner hours/days."], ["Tina C.", "I have been wanting to try this place since it looks cool and the menu sounded great.  It did not disappoint.  Got 3 tapas: octopus, watermelon salad, and arrancini.  They were all great.  We also shared the steak the au gratin potatoes and the short ribs and polenta- both were also great.  The polenta was too cheesy for me as I like it the traditional Italian was that's more grainy, but my husband loved it.  Had banana crepes for dessert, which were also great.  Can't wait to go again...."], ["Nicole S.", "But it is not group-friendly. We had 12 in our party and 1 check to figure out. With all the technology available (and it is available at most good restaurants) they could not give separate checks with the gratuity included on each check. What happened was we sat at the tables figuring the amounts, tying up the tables for a long time and no one could sit there, so if time is important and your guests are important, please offer separate checks. Or offer a check per table (4 guests) so it is easier to compute."], ["Ashley B.", "This is the perfect little date night spot, especially if you're local. I loved the interior- think the love child of industrial chic and cozy creamy goodness with sexy low-lighting. We started with a carafe of red, which was a blend of Zinfandel, Syrah, and Barbera; it honestly was pretty good for a house wine and a great alternative to a bottle.Next up were tapas. We chose the fried meatballs with garlic yogurt sauce. They were delicious and the portion was perfect for two. My entree was a half-portion of the pappardelle bolognese. The sauce could have had a bit more flavor, but it was enjoyable. My girlfriend ordered the swordfish and it was cooked to perfection. The spinach and roasted potatoes added substance to her meal and were pretty tasty as well. We ended the meal with the rest of our wine and espresso. I enjoyed the espresso so much that I would stop in just for that!The service was attentive without being overly intrusive. Overall, a lovely start to our Saturday night! We look forward to returning sooner than later."], ["Alex T.", "I like the vibe here for a nice date or a birthday celebration. came here for my friends bday for maybe 35 people here and I didnt really like the food because each person paid about 50 bucks including tip and we barely got food. everything was shared like family style and a bunch of side dishes and appetizers like olives or stuffed mushrooms and etc. the main dish we got was steak and we each only had 2 pcs and their was a ravioli dish which each person had one piece. over all I didnt have a good experience with a big group like that and the restaurant makes us order this special package and etc. anyways it was expensive 50 bucks for each person but we werent even full and needed to go get some food after we walked out. but I do give the nice vibe like a good spot to date."]]}