{"Lucca Restaurant & Bar": [], "The Press Bistro": [], "Pita Q": [], "FreshMed Mediterranean Cuisine": [["Sam B.", "Though I had one of the stranger dining experiences in some time here (it involved a party of some sort during lunch and some awkward stares), this place is really quite solid.Everyone seems to gravitate towards the Mediterranean nachos, and I totally understand why. The blend of flavors is just right. Good mix of textures with the crispy pita, the tang of the sauces, the flavor of fresh herbs and well-cooked chicken... it's a winner. I'm not sure if I was dealing with the owner or manager when I went last, but he not only welcomed my check-in offer... but he applied to the whole meal instead of just my appetizer. Pretty cool gesture!My only gripe here is that the rest of the food doesn't seem to have the creative flair of the nachos. It's still all good, but just not as exciting. Maybe I'll discover something new as I explore the menu, but I'll have a hard time distancing myself from the already beloved plate of nachos."], ["Chetna J.", "The food was good. Their mediterranean nachos are a must try."], ["Becky H.", "This place used to be a favorite. The Mediterranean nachos were so delicious and flavorful! But the service here is awful. I mean awful!! We ordered 5 dishes, we only ever received three of them. The other two never showed up. When our bill showed up, they were on there though! The bathroom here is beyond gross. The vinyl is peeling away from the wall and mold is growing between. If you decide to brave this place for the nachos, GET TAKE OUT. Do not eat in the place!!!!"], ["Latda V.", "I came here for the first time because I was in the neighborhood and I love it! It's a little hard to find since it's located in the far corner in a shopping complex on Fulton. Just look for the sign when you're driving!I ordered the Mediterranean nachos and a side of greek salad. It was so freakin good! The nachos were delish! Fried pita chips with chicken, lettuce, tomatoes with the yougurt sauce...so good! Perfect for sharing too. Staff is friendly too. He asked us if it's our first time and told us to if we have any questions to feel free and ask him. I likes :)This place is inexpensive and serves great food. Spent only $12 for the nachos and salad. I can't wait to go back! Sucks that I live so far but this place is so worth the drive! :)"], ["Rick M.", "Zero Stars.  Never eat here or get take out. My wife got food poisoning off of the Mediterranean nachos. Should've known something was up when I walked in to pick up the food that there was going to be an issue.  This place barely even resembles a restaurant as the dining room was unorganized with chairs littered about, there was no hostess, no silverware, no wait staff, no ambiance, no nothing.  Just a room with a empty tables and chairs. It looked more like a chow hall than a restaurant.  Ambience aside, they even screwed up the order and how easy is it to screw up nachos?"], ["River S.", "We ate there a couple weeks ago. The falafel, gyro meat wrap, and chicken Mediterranean nachos were very very good. The place itself is different. It was like visiting a different county which was kind of unique and nice, but where there are different decor and ambience standards. Also different style in customer service. We were a little nervous being the only 2 there, but overall it was good. I think their customer service could use the most work; I did for a minute feel like an ignorant American with too harsh of corrections. The best advice I can give is pretend your a traveler to the Mediterranean, Middleaest, or Palestine."], ["Brayden Scott Peng V.", "I'm a biggie on Meditteranean cuisine and this has got to be my best Mediterranean meal so far. My friend and I went here after our workout since I have wanted to try it and since I moved up here in Sacramento I wanted to find a good Mediterranean place to dine in. We walked in and was greeted and seated right away.  Great customer service!Food was delicious. I wanted to try everything on the menu because everything looked so delicious, but I ordered the Mujadara, Meditteranean Nachos (since that was the fuss about this place) and the tabouli and spinach pasta salad. Sadly they were out of the tabouli and the pasta salad, so the owner came to apologize. I was shocked because I'm very patient and I told the owner it wasn't necessary for her to apologize.I will be coming back to try MORE!!"], ["Karla Marie D.", "I can't believe this Fresh Medi is so close to my place. I love Mediterranean food!! I had Sam's Mediterranean Cuisine in Davis and I totally love it!!I had the Chicken Shwarma Entree ($8). It had salad and some sort of noodles, chopped into small pieces and chicken. Usually, I would have it with rice, but the alternative was equally delicious. The chicken was seasoned well. I mixed everything together and topped it with the Tahini sauce. The dish is a little spicy. The only thing I would change is the portion size. I wish they would give a little bit more.Overall, delicious! Next up: Mediterranean Nachos"], ["Akshya G.", "Awesome place.Fresh veggies in the sandwich.And the spicy sauce was mouth watering"], ["Brandon O.", "This place is the bomb! The nachos everyone is talking about were really good and the service was great also ill definetley be coming back to try their other food!"], ["Mariah L.", "I simply adore this place. More people definitely need to know about their simply amazing Mediterranean nachos. Its you basic hole-in-the wall restaurant, not pricy and very fulfilling. I've had their gyros on a number of occasions and loved how fresh and delicious it tasted. Their pita bread is really good also, I love dipping it in Tzaziki sauce."], ["Anisa T.", "Great, delicious, fresh food, that was really tasty. Nachos were surprisingly good. We wished we'd gotten a bigger size. Good affordable prices for the nice ambience they provide.  When we went, it was a little bit before closing on a Friday night but they accidentally had their open sign off and I assume that was the reason no one was in there. They were preparing to close but when I stated that they're supposed to be open for another hour, they were quick to seat us, even though we told them it was ok and we'd go somewhere else. The service was great, and I loved the cook's attitude. We got a chance to talk to him when he stepped out and he was the most pleasant, good-hearted man. Between the yummy, cost-effective food and the decor/ambience and hospitality, I was sold!"], ["Andy J.", "Good lordt, it was tasty.  Fast, friendly service.  Delicious fresh food that's super vegetarian friendly.  Great prices, and a Yelp deal to boot.  I will certainly be back!"], ["Aaron K.", "Mediterranean nachos with chicken were excellent!  All the ingredients on the nachos were fresh and a nice compliment to the pita chips. Chicken shawarma was moist and nicely flavored.Its a small place that's hidden in back by Pizza Hut. I've had the place three days in a row and still not tired of the nachos."], ["Mia C.", "Went there for lunch yesterday and the restaurant was almost empty. Maybe because of the rain. We seated ourselves since we didn't see anyone by the door. Food was relatively inexpensive, but there is not much of an ambience. Our server was a friendly young lady.I had the gyro plate which came with a good portion of gyros, rice, pita bread, spicy sauce and salad. Everything was good except for the salad which was wilted and not fresh. The chicken shawarma plate which my husband had was mediocre though. It didn't have the Mediterranean spicy taste, but again good portions."], ["Elizabeth C.", "I wanted to try out Cafe Europa but they were closed on Sunday, so I opted for this place instead and I am so happy that I did! The place was clean and simple with barely any decor.  The restaurant was very quiet. Our server was very attentive and friendly. I ordered the chicken kabob pita and my boyfriend ordered the ground beef pita. We both split a small order of the mediterranean nachos because I read so many reviews on yelp raving about them. We requested eggplant but they didn't have eggplant so we opted for the shawarma chicken instead. The nachos were delicious! This place has the BEST taziki sauce that I even asked for an extra side of it. The shawarma chicken was delicious, flavorful, and slightly spicy! My chicken pita was also really good but i would probably order the shawarma chicken pita next time just because it was more flavorful. My boyfriend seemed happy with his ground beef pita but I think he would probably order something else next time. The cost of these two pitas and a small nacho order for $20 bucks! What a deal!Only small complaint is that it did take a while for us to get our check. If i was in a hurry I would be more annoyed, but I was so happy and content with our food that I didn't let this ending ruin my experience. Overall, try this place! My boyfriend is a picky eater and doesn't usually like ethnic foods and he loved this place. And be sure to try the nachos! There's a reason why everyone raves about them on here! I will definitely be back to get a larger order of the nachos but since the restaurant environment is definitely lacking, my boyfriend and I agreed that we will probably opt for take-out rather than dine-in next time."], ["Bayan A.", "Food was great and the service was good. If your looking for authentic Mediterranean food this is where to go!"], ["Amy F.", "Delicious food and great service! I stopped in yesterday to try their Mediterranean Nachos with Chicken Shawarma. It was soooo good! Very different and a nice mix of flavors. My waitress also gave me a free dish of their chicken with garlic sauce to try which was also excellent! I think I will be back here often. So happy I found this place! Lots of yummy looking dishes to try."], ["Sarah T.", "YUMMY! I love FreshMed!! The owners are so sweet and the food is great! As many have mentioned before me, the Mediterranean Nachos are not to be missed. They are a unique treat and are absolutely delicious. They also make a great chicken kabob that is so tender and flavorful. Their homemade red vinegar salad dressing is another item you will definitely want to try. It is a small restaurant with a so-so ambiance but definitely a place worth visiting for delicious food!"], ["Kate L.", "Ah-mazing Mediterranean chicken shawarma nachos. Atmosphere isn't great but food and service made up for it. We'll be coming back :)"]], "Café Europa": [["Restaurant K.", "I hate to give this place 3 stars just because the people and service is excellent.. The hummus and pita not that great. The garlic fries ok! The chicken kabob sandwich good. I feel a little let down by yelp. Lol I know I haven't wrote a review for SAMs in Davis, Ca but they don't compare"], ["Jessica W.", "The owner Taky was awesome. He was at the counter when we placed the order. He made me feel very comfortable as if I was dining room in his own kitchen. I recommended this place to a coworker, and she said her family would eat there today. I can't wait to go back.......very nice people!"], ["Randall I.", "This is my favorite gyros place in town. The location is kinda out of the way and it lacks street signage. The food and service however are top notch. Its a pretty laid back place in service and presentation. Food comes out on paper plates, but who cares when the food is this good and a decent price."], ["Thom D.", "Really enjoyed this restaurant. Not fancy but that's good. Previous reviews had raved about the falafels so that's what I got. Quite good! Very friendly staff. Can't wait to bring my wife here as she loves falafels!"], ["Tashina B.", "Go here if you want a college-level gyro.Both chicken, lamb and gyro meat are done well, pretty tasty and moist, and the fries are good. Everything else, disappointing and likely from the store. The rice was bland, the dolma plain, the hummus and tahini lacking something. The falafel was plain horrible - definitely not homemade or fried onsite. There aren't any fresh vegetables on the menu besides a bagged \"Greek\" salad, with an even less characteristic salad dressing. Service however was good."], ["Scott W.", "The food is delicious and authentic. I found myself getting a little impatient with the service (especially when they were late with the fries on our order) but I'm not beyond recognizing that for good food you sometimes have to wait. I've tried a couple type of gyros, their fries, their lentil soup - all are delicious and a decent value.The setting isn't that fancy. This place is casual - come for the food, not the ambiance."], ["Moozhan T.", "I think every middle eastern, and mediterranean restaurant's nightmare, is to have middle eastern customers... We are picky. And each of us, has a different idea of what the food should taste like.  For me, if you say you're giving me greek salad, I want a lemon dressing with it, not a vinegar one.  That's just how I have always had it... but who knows? I've never been to greece itself. I've had it in Iran, and in Turkey.  so, I'm not basing my review on that.  This place is clean, and has a very friendly service. I like their greek fries which come with feta and lemon and parsley.  I really, really do like the fries.  They could be more golden and crusty, but really are quite fine just the way they are.  I also have tried their rice pilaf... not my thing.  It was cooked well, but I didn't really like the seasoning. The chicken kabob was a bit too dry for me, and I wouldn't order it again.  The lamb kabob was ok, but the pieces are small, and a little tough (over cooking lamb does that), but I would give the lamb another try.  I really did like the flavor on it, so I think next time, I'll just order lamb. The prices here are pretty fair. I guess having the terrible location (as mentioned in some of the other reviews), allows them to keep their prices low, so no complaints about the location here."], ["Kelly M.", "This is such a Sacramento gem!I absolutely loved this place. It is completely unassuming and in a shopping center near Nordstrom Rack, but the food was not disappointing.First off, the service was great.  The gentleman who took our order was so polite and responsive. A++I order the chicken kabob. It was nice overly dry and it was pretty delicious.  I am trying to be somewhat healthy, so I ordered a side salad to go with it.  Their vinaigrette dressing is pretty good, too.The SO liked his falafel pita and our friends' order of feta fries looked amazing. Overall, great place and awesome service."], ["Sara E.", "I wrote the following review of Cafe Europa for the Sacramento Epicureans dining club. We participated in a special brunch just for club members last Sunday. Upon arrival to this small but sparkling-clean restaurant just shy of the Howe-Bout-Arden center, guests were treated to heaping plates of pork sausage called Loukaniko topped with fresh herbs and lemon juice; fresh chickpea Hummus; yogurt and cucumber Tzatziki; warm Pita bread; rice-stuffed grape leaves called Dolmas; Calamata olives and Pepperoncinis. Many Epicureans commented that the Dolmas and Hummus were among the best they'd ever tasted. Owner Taky Cazanis provided diners with some background on Cafe Europa's history reaching back to 1981. Continuing the tradition started by his parents in Arden Fair Mall (when it was only one story), Taky opened the current location in 2010. Staffed by family and drawing from longstanding recipes, diners could sense and taste the pride as Taky concluded his history by saying \"Thank you for coming to my house.\"In short order, the buffet styled main courses were brought out- beef and lamb Gyro; white wine and lemon marinated grilled Chicken Breast, Green salad with olives, tomatoes and feta; Rice pilaf; savory green beans stewed in a tomato, olive oil and onion broth called Fasolakia and more warm Pita bread. The once lively conversation fell to a murmur as Epicureans thoroughly enjoyed the Greek cuisine. As conversation picked back up, Taky invited guests to come back for seconds, then passed around plates of decadent butter cookies topped with mountains of powdered sugar known as Kourambietha. After reviewing the chalkboard of daily lunch specials ranging from Greek Cheeseburgers to Pastrami and even Mizithra spaghetti, many Epicureans left Cafe Europa already planning their next visit.  The well-executed traditional Greek fare and family-friendly atmosphere make Cafe Europa truly delightful and worthy of the Sacramento Epicureans \"hidden secret\" status. OPA!"], ["Ty L.", "This is my fourth time here! I LOVE THE GYROS HERE!!! The portions are\"HUGE\" prices are pretty good too $7.50 for a Taky gyro which is like their house version gyro. Service is great! the owner/cook is very friendly and welcoming can't say really say anything bad about this place! You have to come try it for yourself!!! Don't forget the tip your servers!!! :)"], ["Stacy M.", "The gyros are packed with meat, the greek fries are delicious, the service was friendly, will come again."], ["Dominic A.", "When its mood for Gyro, I come in here to order a delicious lamb meat sprinkled fetas Gyro sandwich! I know this guy who work here, He been here for a long time. A great friendly and good integrating with customers."], ["HappyHippie Z.", "Meh? Very disappointed. They've obviously minimized portions on the menu. Ordered what I believe was a platter which came with gyro meat, salad or rice, and pita bread. Gyro meat portion was much smaller but very good, pita bread was dry, and the lettuce in the salad was not appetizing or edible. How much more can it be to use a little Romaine instead of hard, thick, chunky, white portions of iceberg lettuce. If you're going to do that at least shred the lettuce. I have to say the additions to the salad were fresh and very tasty though. Husband was also very disappointed in his gyro due to the dry pita bread, but he said the fries were good. As usual, the service is always excellent  and the owner is always super friendly."], ["Jenni T.", "I came here today for lunch because I was looking to try someplace new even though I already had a favorite Greek restaurant down the street.I was first surprised at how small the restaurant was! It is tucked into a corner in the shopping center next to Nordstrom Rack on Howe. I came in a little late for lunch around 1:15pm and there was two other tables full but I ordered mine to go. The guy behind the counter was super helpful and nice, he answered my questions and offered useful suggestions.I ordered the Falafel Pita Sandwich with an order of Greek Fries. Of course it was Tuesday and the lunch special on Wednesday was the falafel pita. Oh well. My food arrived quickly and I was on my way!The fries were OK, I thought they needed more of a sauce or something. There was a ton of oregano and cheese on top, but not too much lemon drizzle. I found them to be dry, and a little overwhelming. They left me wishing I had some ketchup.The falafel pita sandwich was good, it was pita bread filled with 6 pieces of falafel, lettuce and cucumber (I requested no tomatoes but it usually comes with it). The falafel were a little on the crispy side and could have used more flavor, but the tzatziki sauce was good and made it not so dry.I did enjoy my meal, and would come back again if I was in the area or other people wanted to go. I would just get the sandwich next time and hold off on the fries. But it unfortunately just didn't compare to my favorite spot."], ["Ricky M.", "This was my first time having Greek/Mediterranean food  and I pleased to say that I had a pleasant experience. My friends and I tried a few things from the menu to get a better feel for the food they offered and so the following is my rating for each item we tried.Baklava  -  ***** - This desert was great and it was served warm.Hummus with Pita - *** - The hummus wasn't as great as some other places but the pita bread was delicious.Loukaniko - *** - Tasted like regular sausage with some extra spices.Greek Fries - *** - Tasted like regular fries with some cheese on top.Dolmades - ** - This is just personal preference but I didn't care too much for these.Gyros - ***** - This was amazing!Lamb Kabob - ***** - This was my first time tasting lamb and it was amazing as well.Overall I would definitely recommend this place to friends and I foresee myself coming back here for the Gyros and the Kabob."], ["Greg G.", "We were passing through Sacramento and found this place on Yelp. Wow, was it ever worth it to get off the highway for this! Even though I grew up in Chicago, this was the best gyros sandwich ever, with feta and fries inside! Awesome greek salad too! Fair prices, good service. Very recommended!"], ["JohnDoe 7.", "I was really excited to try this place after Yelps almost 5 star review but I was left very underwhelmed. The Greek fries had a very light sprinkling of feta cheese on them and tasted very bland as did my lamb gyro. There are much more better options other than this place. But on the other side there service was good and the restaurant was nice and clean."], ["Steffani S.", "My favorite favorite place by far!!!! The food is amazing and the service is even better. That's what keeps me coming back. The owner Taki has the best service I have ever experienced at a restaurant and he remembers your order always!!! This is definitely a hidden gem!!!!"], ["Angela O.", "Thanks to fellow Yelpers we checked this place out and we were not disappointed. We went on a Saturday, at noon and the place was not busy. The guy at the register was friendly and answered any questions we had before ordering. Hubby ordered the gyro entree (lamb/beef gyro with drink and Greek salad). I ordered a lamb/beef gyro sandwich with Greek fries and a drink. The price was fair and the service fast. The food arrived hot and fresh and tasted outstanding. The veggies were crisp and fresh and the meat was tender and moist. I appreciated that theTzatziki sauce was on the side; this allowed me to choose how much I wanted on my sandwich. The tzatziki sauce, however, was delicious and was even worthy of dipping a few of my fries in.  Hubby's meal was also pleasing to the eyes and tastebuds. My only complaint is a little odd...The floor, throughout the establishment was unusually slick. I'm not sure if it's always this slippery, or if the floors were freshly cleaned but it was comparable to ice skating! This still wouldn't keep me from visiting again. I will definitely slide that way, soon!"], ["Terry B.", "The super gyro is amazing! I am a complete fan of it, and have had it now a handful of times since living in Sac for the last 6 months. I keep coming back, because this place keeps doing it right. I also have high praise for the staff, as they're always very friendly and smiling. It's not often you CONSTANTLY get greeted with a smile and polite gesture, but this place does that right.Time and time again, I'm greeted politely, served in a timely manner with delicious food.The decor is average, it's a small restaurant - do not expect it to be anything more. Although, it's also very clean and trendy in it's own right. It's a little hidden gem that deserves more exposure and visits.If you're fond of gyros and have not yet tried it, don't even hesitate to stop in. Also, their greek fries are delicious to boot."], ["Peter L.", "*  Welcome Experience-  Outstanding Just what you're looking for.  A prompt warm greeting.  Genuine interest in your experience.  Nicely done.  Thank you!The place was empty on a Tuesday night at 6pm.  *  Establishment-  OrdinaryFelt clean, spacious and organized.  Odd framed photos of hamburgers and salads on the wall.  *  Service-  EncouragingA younger bald guy tended our table. He was very courteous and seemed interested in our experience.  He did very well.  *  Food Quantity / Quality / Presentation-  DiscouragingMy table's order was a hummus, two gyros and a hamburger with Greek fries and a Spanikopita.  We weren't asked what our temperature preference was for the burger.  It was absolutely hammered.  Way overcooked, and my impression is that this is a bought-in frozen patty that's thawed and fried on the flat top.  Unspectacular overcooked patty. The French fries are ordinary frozen bought in fries heated in the deep fryer.  Plain and boring.  The Greek fries were the same boring fries with a small amount of feta, lemon juice and oregano.  Just wasn't impressed.  The beef/lamb gyro meat was well seasoned but was the very end of the spit.  (They removed and replaced the split after serving ours).  The meat was dry and hard wrapped in a very ordinary warm pita. Also unspectacular.  (I think they should have served fresh meat and not squeezed another two gyros out of the last spit...  My opinion!)The Spanikopita exterior was crispy and good but the inside looked and tasted old.  The hummus had too much citrus for my taste...Sorry Europa, I wanted to love you guys!  * Stuff that isn't important but I felt it was worth mentioningGreat napkins!  Big and sturdy!  But ketchup packets?  Really?  You can't serve it in a squeeze bottle?  Odd.  *  What I'll rememberNice greeting.  Staff that appears to care about your service experience.*  What I can't wait to forgetThe food was tired and unimpressive.  Quite ordinary bordering on bad in my opinion.Three stars because the service was fast and friendly and the food was a bit pricey,  ordinary and unimpressive but not BAD."], ["Tuan N.", "I came here on a quick dinner date because I was hungry and this place happened to have a pretty high rate on Yelp AND it was close to Total Wine, the place I needed to drop by afterwards (So to me it was sorta a win/win deal). The gentleman at the register was very kind to us, he made us feel very welcomed and waited patiently for us to decide on what we wanted to eat there. I was craving pita bread so I ordered their Taky's Gyro (the guy pronounced it as giro and I somehow always thought it would read as jairo LOL) and also had their Lamb kabob. ::Taky's Gyro::The sliced meat didn't look like any of the typical meat you see on sandwiches. I didn't get to ask what kind of meat it was, but it was seasoned well and tasty. The sandwich is also stuffed with lettuce, tomatoes, onions, potato FRIES, cheese and a side of Tzatziki sauce. Tzatziki is a Greek sauce that is yogurt base and mixed with some seasonings. It was served cold and I used it on both my sandwich and also  dipped my fries into them (it tastes good on everything..) I ended up having the server bring out two more sides of it. ::Lamb Kabob::The lamb here is quite good. Tender but lack a bit of seasoning. I too dipped this in the Tzatziki sauce and it helped with the flavor. It's served with rice and lettuce. The portion is big enough to feed two. I don't get many Greek food cravings but I just happened to wanted to try something different while in the area and found this place. Definitely a slight healthier choice than say burgers or greasy Asian food that I often dine at.."], ["Tej K.", "I was in the area and was hungry for lunch but couldn't figure out what to eat. I scrolled through my bookmarks on the Yelp app and decided on Cafe Europa. I didn't realize the place was super tiny and in a run downish strip mall. Don't let that fool you though. The customer service and food were both amazing! I ordered the chicken kabob sandwich (pita bread, lettuce, onion, tomato, pieces of chicken kabob and tzatziki sauce on the side) and the greek fries. The chicken kabob sandwich was so delicious. The chicken pieces were super juicy, not overdone and the sandwich as a whole was really delicious. I love tzatziki sauce and the one here did not disappoint. The greek fries were pretty yummy too - loaded with feta cheese, spices and lemon juice. The place itself is pretty tiny, but the customer service is wonderful and they never made me feel rushed. I can't wait to visit again!"], ["naomi b.", "We had a greek salad, falafel side and lamb gyros. All were delicious! This is a great place with super friendly staff."], ["Prescila B.", "I waited a while to post a review but am finally getting around to it. This place wasn't horrible, but a few things were off for me. First, the pita wasn't that good, dry. Sadly, that's my favorite part=/ Second, I asked for hot sauce thinking I'd get some cool Greek flavors..no. I got tapatio (Mexican hot sauce in a packet)..no bueno. Next we could tell the fries were previously frozen, not bad but I expected more I guess. The meat was good, I got a gyro and wasn't super impressed but it did get eaten. Overall, it was better than opa opa!"], ["Donovan H.", "For those of you who aren't familiar with Greek/Mediterranean food, look no further because Café Europa is one of the best hidden gems that Sacramento has to offer. Located on Howe Ave. in a smaller strip-mall (than neighboring \"Howe Bout Arden\"), this place can be a tad bit tricky to find unless you know exactly where it is. Fortunately the parking lot always has an abundance of empty spots so there is never a need to hunt down a spot to park.I've been to Café Europa at least a dozen times simply because of exceptional service, quality of food, and close proximity to my home. I've dined here alone, I've dined here with my lovely lady, and now I am dining here with fellow Yelp friends Todd G. (with his daughter) and Devo S. We all meet for lunch around 1:30pm as the dining area has a few tables occupied but overall it is not too busy at all. And as I mentioned how great the service is here, the owner actually remembered me from nearly a year ago! He was very polite and had a great positive attitude which already made this experience a very welcome one.For those of you that have dined here, the inside is very no-frills. There are basic tables for dining complete with wood paneling throughout the counter and walls. You will also find a small flat screen TV as well as a giant mirror in the dining area that gives you that illusion that the restaurant is bigger than it really is. But enough about me talking about the inside, let's get on with how their food is!As I've already tried their Kabob entrees, falafels, and Greek salads, I've actually never had their gyros. And I don't why I waited so long! After seeing many positive reviews on their gyros, I give in and order the \"Beef/Lamb Gyro\" (for $6.25). The gyro itself includes large seasoned slices of meat in a warm pita pocket and is completed with lettuce, tomatoes, onions and their signature Tzatziki sauce. And for only $2.99 more, I opt for a side of regular French fries and a pink lemonade.My meal comes out in less than 7 minutes and this thing is loaded with meat! The Tzatziki sauce comes on the side which is a nice touch. And the gyro, well let's just say that It is so big, I only wonder how am I going to pick it up and eat it without making too much of a mess? Well I successfully took my first bite and was literally in gyro-heaven. The portions and seasonings they use in the beef/lamb was tender and cooked to absolute perfection. The warm pita bread was absolutely heavenly while the lettuce and onions created a nice crunch to every savory bite.Overall, Café Europa is my #1 go-to spot for some amazing Greek food in the Sacramento area. The portions are generous, the food is amazing, and the prices are very reasonable. If you're looking for a no-frills restaurant that packs some amazing Mediterranean flavor, look no further because Café Europa is the place to come!"], ["Devo S.", "I was in the Arden-Arcade area, and decided I wanted to have dinner someplace I hadn't eaten before. Naturally, I turned to Yelp, because I'm not completely familiar with all the dining options in the area. Cafe Europa caught my eye because I had previously bookmarked this place, AND its average Yelp rating is 4.5 stars, which is amazing. So, I headed on over to the strip mall on Howe, where that mongolian bbq place that's been there FOREVER still is. For all the great reviews, I was surprised to see the place empty on a Saturday. I still forged ahead, and was greeted by the sweetest older gentleman. I perused the amazing menu, and settled on a beef/lamb gyro sandwich, to which I added a greek salad and diet coke. The older gentleman went into the back, I guess to make my order, and out came a just-as-nice younger gentleman, who was talking to the older gentleman in Greek. Pretty sure it was Greek. Which, honestly, made me anticipate my food was gonna be pretty damn authentic.Anyway, out came my salad and drink first. Nicely sized salad with all the right stuff, plus the dressing was on the side...nice touch!. The younger guy really wanted to make sure I was comfortable, and let me know that I could have the TV channel switched to whatever I liked, and if it was too cold he would shut the front door (no worries on that since it was still in the mid-70s at that time of the day, even though it was dark outside). Plus, which I found endearing, he called me \"dear\" and \"honey\" at the end of every conversation. So nice :)My gigantic, filled-to-the-gills gyro sandwich was brought out, and I was uber-impressed. It was just piled high with flavorful mounds of gyro meat, lettuce, and onions in a warm, soft pita bread. It was the biggest gyro sandwich I've ever seen, and it was DELICIOUS! I like that they put the tzatziki sauce on the side, too. I like Opa!Opa! and Greek Village Inn (side note: drove by there last night after shopping at Safeway and noticed it was closed...they're not out of business, are they?), but I have to say that Cafe Europa is probably going to be my go-to place for Greek food for a while. In fact, looking forward to coming back for lunch with Hubby on Veteran's Day so he can experience how good the food is here. Do yourself a favor and try this place, too! It very much deserves the high rating it has :) Yassou, my friends!"], ["Catherine G.", "The juiciest, most flavorful lamb beef gyro I've had in CA. Far superior to Petra's. The feta cheese they use must be laced with crack, because I inhale my salad, not eat it. The service is also on point. The owner takes an immense amount of pride and joy in his restaurant and this is seen in the high quality of food served here. What are you still doing here? GO GET SOME."], ["Y M.", "The gentleman (owner?) at the front counter is very friendly and attentive. He will offer the same great customer service whether you dine in or take out. He's open to offering suggestions if you are unsure or if it's your first time visiting.Regarding food- I can only speak to the veggie items,  YUMMY!  I highly recommend the Greek fries. :)"], ["B C.", "Café Europa is a solid place to pick up some great tasting gyro. It's not the most impressive restaurant, but it's clean and the food is great.So far, I visited twice. On both occasions the individual taking our order at the counter was courteous and extremely professional. One of my dining companions asked about the gyro meat. The gentleman gave us a lengthy and informative explanation as to why they use a 90/10 ratio of beef and lamb. He is also familiar with the other major Greek restaurants in the area, and gave us some suggestions on what to order if we visit them.The place itself is not fancy. You order at a counter and they bring the food to you once it's ready. The prices are reasonable.I've tried the Supreme Gyros and the Greek Salad.Supreme Gyros - Pita bread packed to the gills with thinly cut gyro, a few fries, various veggies, feta, and a side of Tzatziki sauce. I would say it's a tad overfilled, making it difficult to get a taste of everything in a single bite. The contents of the pita tend to fall out into the sandwich wrapper as you are eating. All the produce tasted fresh, and the gyro meat was delicious. I didn't think the fries really added any flavor or texture as there weren't that many of them stuffed inside. Giving the Tzatziki on the side is an extremely smart move. You can continually add it to the top of whatever part of the sandwich you're chowing into next, making sure you always get some creamy goodness in every mouthful.    Large Greek Salad (with added 4oz of gyro meat) - Your standard Greek salad combination with a vinaigrette on the side. I elected to add 4 ounces of their delicious gyro on top. I really enjoyed the salad. The cut of the vegetables were right on the money, and it had a healthy dose of feta to provide some creamy richness. There was a nice ratio of gyro meat to salad. I'll definitely be ordering this again.Ultimately, if you are craving some Mediterranean flavors and want to skip the crowds downtown, Café Europa is a great choice."], ["Javi H.", "My first time eating here and let  me tell the food  was actually good. Friendly Service. I definitely will be back."], ["Patrick F.", "I dropped in on my way to a Sacramento Republic game. The menu included both American (hamburgers) and Greek fare. I had the spaghetti with kyma (a red meat sauce) and it was excellent! My wifey had the lamb skewer (that what the menu said, rather than souvlaki) and a spanakopita. She loved it and wondered why I didn't take her there sooner. Thanks owner, Taky, for having a restaurant so good that I get in trouble for not going there sooner.We finished up with baklava. It was to die for. The service was good too. Very friendly staff. We are definitely going back to try the rest of the menu."], ["Jessica F.", "First time here and it's the most amazing food I've ever tasted. The service was excellent very attentive and friendly and fast the food is so delicious so fresh tasting. I would definitely recommend my friends to come and try If it's they're first time trying Greek food."], ["Lacey C.", "I always get the vegetarian pita with Feta cheese and Greek fries. I love this place. The owner is extremely friendly and the food is consistently good. The fries have lemon and feta on them. The veggie pita is a mix of assorted veggies like tomato, cucumber, onion, lettuce with tzatziki sauce and feta cheese. I definitely recommend coming here for lunch or dinner for some great food."], ["T E.", "FANTASTIC food and amazing service! I'm picky about my middle eastern food, and this is one of the best- the baklava is the best I've ever had (don't tell my aunts that!)"], ["Naol T.", "Had the beef/lamb entree with greek salad. Meat was greasy and salty on its own-it needed the sauce.Not as good as I thought with all the reviews for this cafe."], ["D G.", "I am so glad that I found this little gem. Fantastic food, great service and the guy who helped us was easy on the eyes. I had the beef/lamb gyro and the flavor was there. The house salad was well put together and the baklava was decent.Definitely worth going :)"], ["Micki M.", "While going through my searches on best rated eateries in the vicinity, I came across this place. Had to try it,  I read some of the reviews but I was more attracted to the high Yelp rating.We came here on a Tuesday night after 6pm, maybe it was the day, maybe the time, but we were the only patrons! No problem, we ordered the beef gyro $5.99 and if you add fries and a drink $3.99 more. also ordered the Greek spaghetti, I love my carbs! I also ordered a side Greek salad $3.99. I'm assuming the gentleman who rang us up,  was the owner, very friendly and polite, called me by, \"sweetheart!\" How sweet is that? Every time he wanted my attention, that was my name. We had quite a challenge deciding which table to sit in, as every table in here was institutionally clean. Nice!The side salad was delicious, the vinegarette was perfect. The vinegar and oil ratio was spot on. The salad was cold and clean to add the right amount of a fresh crunch after every bite. The beef gyro was okay, but I'm not sure if I'm much of a fan. We did have fries added to it, maybe I'm not that great at rating gyros? I will say that there was plenty of sliced beef. The greek fries was interesting, if I could re-do my order, I would  order it plain since it may have been a feta cheese overload for us. The Greek spaghetti wasn't anything to note. Sorry!I hate to be a bearer of bad news but all I can give is 3 stars because it is just that, \"A-OK!\""], ["Brooks G.", "Use to like this place until I just had a beetle come crawling out of the bag as I was grabbing my gyro."], ["Dylan N.", "This place is my go-to pre-movie food, since it's so close to the theater.  It's nestled in a nondescript strip mall, but don't let that fool you! The place has great Greek food and the staff is enormously friendly.  I typically order the lamb gyro and it's never disappointed.  Can't speak to some of the other items on the menu, but I'm sure it's all excellent!  Price is fair for what you get.  Give this place a shot if you're in the area or catching an evening showtime at the movie theater next door."]], "Petra Greek": [["Jackie S.", "Located in midtown, parking here is pretty icky. It's free parking every weekday after 6pm if you can find one, but you'll be looping around for a bit for a parking space around this popular strip. Came here on a Friday night and they are seriously understaffed. There was one woman who was taking the orders, delivering the food to the tables, and checking up on the customers. However, you can see the kitchen from the front and it was kept very clean. This is one of those places where you order and pay up front before you go to your table. What I didn't like was that the menu on the boards didn't have descriptions; I had to rely on the takeout pamphlet to see what was included.  I got the veggie souvlaki because it sounded the most interesting with all these different veggies; the meat options seemed a little scarce on the greens. I was hoping this joint would be on par with Sam's from Davis, but it didn't quite impress me. The pita bread was grilled on the stove for a while making it soft and warm, but as a result it was way too hard to even hold up to eat as a wrap. I ended up eating it with a fork and breaking off the pita bread a bit at a time. Speaking of the contents inside, there were a lot of veggies, but it was pretty oily.. like there was a bit of a pool of grease. Their thick and slightly tangy yogurt sauce was on point, though!"], ["Debra A.", "Love Petra. Being a NYC girl, I am used to Greek diners at every corner. :) I really miss the food. Petra works for a quick meal. I enjoy going there for lunch. everything is good, fresh and hot when you get it.One suggestion, if you're ordering a sandwich wrap - check your receipt. They have changed me for \"plates\" several times. Other than that, it's a great little place."], ["Nick G.", "I've been here a hand full of times, as I live only a few blocks away, and I have to say, I'm still a little confused.  The very first time I went, everything was AMAZING.  I got my usual, a gyro, fries, and something extra on the side.  Meat was tender and juicy, just dripping with flavor.  The second time I went, everything was horrible, like I'm talking I threw it away after the halfway mark.  I would have complained but I got that one to-go.  Meat was dry, and burned in some sections, fries were nasty.  and every other time I've gone has been somewhere in the middle.  Overall the place isn't bad, but just way too inconsistent for me.  I never know if I'm gonna get something I'm happy with, or if I'm let down.  I still come here from time to time because I'm so close, but no, I can't really recommend it.  Go here at your own risk."], ["Anne W.", "Pork Souvlaki, Greek Salad, and Fiery Feta. The holy trinity of Petra's. My favorite thing to get there. It's super busy during lunch hour so call ahead or just go during happy hour. But, must try if you are in the downtown area with a craving for Greek food."], ["Steve G.", "This place rocks!  I am a huge lover of Greek and Mediterranean foods.  After working in a Mediterranean establishment for a year (Pita Q) I am shy to admit that I also love PETRA!!This restaurant is literally 1/2 block from my office and I go there often (my wallet says too much) LOL  Even if I call in an order, they recognize my voice (hint Steven, you might need to branch out...LOL)  NEVER!!The food is fresh, delicious and so satisfying.  I love their daily lunch specials...yep, I have gone every day to try them.  The souvlaki chicken is tender and tasty, the firey feta is, how do I describe this?, HOT and a treat!Keep up the good work guys!"], ["Kelsea M.", "Came at 2:20am and they were closed on a Thursday when their hours are posted till 3am Monday through Friday....."], ["Kevin J.", "This is currently my favorite greek place within minimal distance of midtown. I like the chicken, the beef/lamb, the pork is a bit fatty though. I tried the beefteki, but it came medium rare which is great for the beef in it, but not so great for the pork in it. The sausages look good as well. You can get beer on tap, tasty fries. Nothing to really dislike here except for the fact it can get packed fast."], ["Peter O.", "This place is located in Downtown Sac where all the other good foodie places are. Let me tell you. This place is awesome! We ordered everything off of the happy hour menu and we had so much leftovers. The three dip was delicious, especially the hummus and Tzatziki (cucumber yogurt sauce thing). Also ordered the chicken and pork kabob things, were nice and juicy. The flaming cheese!!! (Saganaki) was delicious and cheesy. And the feta fries were amazing! The fry sauce is equally amazing. I can't wait to go back. Everything was soo good here."], ["Dianna F.", "Don't like Greek or Mediterranean food - this place will forever change your mind.It's a busy part of downtown, right next to the Firestone Public House, so be prepared to hunt for a parking spot, even on a Monday night after 8 p.m.  We walked into the place, it's very nice and bright and happy.  The smells were amazing. I've eaten Gyro's before but it's been hit or miss.  I wasn't excited to go but Jeremy had mentioned us trying Greek so I said what the heck and the reviews were great and the menu sounded tasty so I decided to give it a try.We started with the Chicken souvlaki Plate for $12.99.  It is chicken skewered and seasoned with Greek spices, cooked over open flame, served with rice pilaf or french fries, Greek salad, tzatziki sauce or Greek yogurt and pita bread.  We ordered the fries. Which if you're new to Petra they also have Petra Fries which are french fries with feta cheese and oregano.  We wanted the Petra fries, they are not the ones that come with the \"plates\". But Jeremy upgraded our regular fries for Petra fries and only paid an additional 50 cents.  We also go the tzatziki sauce and not the Greek yogurt, I can have that anytime.  You get a good amount of food on the plate.  Two chicken skewers with about 5 big chunks of juicy spicy chicken meat, a nice size salad, a nice large bowl of tzatziki, good helping of fries, and then four pieces of pita bread.  The food was beyond amazing, we were not disappointed in anything we ate, and we ate a lot.  Everything was super fresh, the spices were amazing, the meat tender, the salad crisp, the tzatziki sauce (I'm officially in love), the fries and the pita were fantastic.  We shared a plate and I seriously could have eaten a whole plate myself. After the chicken souvlaki plate, Jeremy was still hungry and I wanted to try something sweet.  So Jeremy ordered the triple dip plate for $7.99.  This dish is big and could easily feed 3-4 people as an appetizer before a meal.  It consists of  tzatziki sauce which is cucumber and garlic, revithosalata, which is Greek hummus, and tyrokafteri which is spicy feta cheese; and lots of pita bread.  I absolutely cannot tell you how delicious this is.  Have you ever tasted spicy feta cheese? I had never tasted that. I'm in love and addicted. I want more of that food right now.I also had the chocolate baklava - it was fresh, buttery, nutty, and delicious.Please go, you won't be disappointed."], ["Jenn N.", "This place always seems to be packed. It's somewhat self serve, in that you order at the register, are handed your drinks, go find a table & wait for your name to be called. On the night I was there, they were bringing everyone their food. I ordered a gyro plate & it was delivered to me in what seemed to be less than 2 minutes. I couldn't believe how quickly they prepared it. It was so delicious. The meat was shaved thin and melt in your mouth soft. The pita bread is fresh. The yogurt sauce was very thick and oh so tasty. It lives perfectly in-between sour & rich. The hints of dill are not overpowering. The rice was cooked perfectly. The tomatoes, cucumber, olives (pits, watch out) and red onion are cold, fresh & crisp. They bath them in a layer of feta. Your biggest problem will be deciding what you want to add to each bite because your mouth isn't big enough to accommodate it all in one bite!Happy hour is nice: $1 beer & $4 wine."], ["MyShawn C.", "Yeah buddy.  My first Greek restaurant and I liked it.  Had a lamb plate with a great Greek salad and the sauce was so very good.  I ate myself into a coma.  No really, went home at 4pm, passed out and didn't wake up till the next day.I was full and satisfied."], ["Jen-Ann L.", "Came here on a weekday for lunch expecting it to be quite crowded. Lodged between two more expensive restaurants in the heart of downtown, this place had very high expectations. Yet, it not only met, but exceeded my expectations.We ordered two lamb gyros and Petra fries. Both were very well executed. The meat was very flavorful and the fries covered in spices and feta cheese.While the restaurant is quite narrow and long, there are a few tables to dine at and darker lighting. This place seems more casual than those around it, but did not fail to have an extensive wine list. The staff seem polite and hardworking; the food was ordered and brought out quickly.Although this place is a little pricier than your average Greek food, it makes up for it by having a prime location and quality food."], ["Carmen A.", "I come here every Friday for happy hour after work with friends. It's a really nice place and the food is awesome! I'm so sad that this is the only restaurant that sells Fix, but I guess that's how they have me keep on coming. During happy hour the beer is $2.50 and if you have never tried Fix before, highly recommend when you come here!Aside from the Fix beer, the Saganaki is hella delicious (nom nom nom). For $6.99, it comes with fresh pita bread. It will definitely fill you up even though the serving looks small. I have to get the Chocolate Baklava every time with the Fix beer. For me, it's a really good combination. If you don't like sweets, then don't get it because it can be very sweet, but the portion is small, so you'll be able to finish it without feeling sick. If you tried baklava, you know it is sweet. I really want to try the Petra fries because it looks so good. Guess i'll have to try that next week Friday. It's a smaller restaurant, so it can be very packed and loud, just like any bar or restaurant during happy hour. There is limited seating, so if you are coming with a party of 4 or more, come when happy hour starts or else it will be difficult to get seating."], ["Tiffany F.", "The food was hot and fresh. Rice cooked perfectly. The tzatziki sauce is out of this world!"], ["Antonio D. M.", "Beef Gyro!!!   It's good stuff! Late night after drinkin in midtown Sac..hit the spot. First time here. Good quick service."], ["Scott P.", "I have great memories of this place.  We have come here many a late night to satisfy our Greek cravings when we are in Sacto.  The more recent visit was a bit more disappointing.  The food remains good.  The chicken gyro and the beef/lamb gyro are fantastic.  The pita has a good grill/toasted flavor but is still soft.  The yogurt sauce has just enough seasoning and tanginess to it.  The tomatoes and onions are fresh.  In my opinion, I wish they would not put the fries in them but it does not subtract from the taste.  My nephews got the burger this time which we have not done in the past.  The patty needed more seasoning and just was ok, kind of like a frozen processed patty instead of fresh but the cheese and the bacon were very good.  The fries were crunchy and had just enough salt.The real reason I was disappointed was the service.  They were very slow at cleaning tables despite it being busy and people standing around for tables.  No smiles, no greetings.  I don't know if people were having a bad day or what but ths is not what I have experienced in the past.  I am hoping the service is better but I will still be back because I do crave their gyros."], ["tiffany m.", "Love Petra Greek! Their food is flavorful and I love the Greek salad that comes with the plates! I usually order the Chicken Souvlaki plate which goes for $13.75 +tax. I thought it was a bit pricey on my first visit, but after receiving my plate, it's well worth it! You get a side of your choice; rice pilaf or french fries, greek salad, pita bread and greek yogurt or sauce, along with whatever protein/vegan choice. It's definitely fulfilling! The service is alright. You place your order upon arrival at the counter, take a number and depending on who is working and/or how busy they are, they will call your name or bring you your food. It's usually busy in there when I go (late evenings- between 9-11pm) on any given day, but the wait is never long and I have never had a problem with seating. It's definitely worth a try. I love how they are open late, for night owls like myself :)"], ["Gary F.", "Amazing!  We crave this great Greek place.  Everything we have ever had was awesome.  Our only criticism is that the hours or operation are a little strange.  We wish they were open for lunch on the weekends.  We recommend everything!"], ["Darina H.", "Low key, informal and casual place for good Greek food.  Ordered the lamb gyro pita and it was amazing!  I love that they put fries in there too!  Make sure that when you go in, you grab a table since seating can be a bit tough.  The staff are friendly and you can find an assortment of beer on tap.  Bathrooms in the back. Portions are pretty big as well. Yummy, simple and the price is not too bad.  I've had cheaper Greek food elsewhere, but you are downtown so the prices will be a bit more."], ["Eileen L.", "I've been on the hunt for a delicious lamb gyro pita and Petra Greek satisfied my craving.The meat is thinly shaved and fries are wrapped in the gyro. Lamb meat was  flavorful. We did get the Petra fries on the side, which I really loved! I'd go for the fries alone. The yogurt sauce tasted fresh and yummy.Layout of the place is on the smaller scale and gets super packed around dinner time. You order, pay at the front and they bring you the food.I need to return and give other items on their menu a chance."]], "Famous Kabob": [["Nuriddin I.", "The food is fantastic, and the service is fine. Their complimentary bread and butter with greens and cheese itself is a free appetizer. This place deserves a much higher rating than what yelp currently has"], ["Joshua G.", "The best persian food in the greater Sacramento area! Try the Ghormeh Sabzi and for desert try the Saffron Ice Cream with Baklava!"], ["Jenny H.", "The food was delicious but the service was mediocre. It was a busy night so I understand but one waiter was not very friendly and plopped our food down knocking a butter knife over. I had the chicken breast kabob, it was moist and the spices were divine. The flatbread was delicious with the accompanying cheese and veggies. The basmati rice was delicious but 4 stars because the service."], ["Mei L.", "I've been here twice and have had pleasant dining experiences both times. The eggplant appetizer, beef, and lamb are all really good."], ["Cristina S.", "As an Iranian, I am highly surprised by the service at this place! I've obviously had my share of persian food, so I checked yelp beforehand really only paying attention to comments about the quality of food, (didn't want to waste so much money on something that doesn't taste as good as the home-cooked meals my family makes) not so much the wait staff but I really should have listened to the reviews.A group of 12 of us came in earlier around 11:45 and were seated promptly, but when our waiter came out he literally walked around the table, (not stopping at anyone to actually ASK what we'd like) saying \"water, water, water\" so obviously we all just went with some water. He was mildly nice, but seemed irritated with our group size (which made sense, seeing as the tip was included so no extra help was necessary on his part.) He was incredibly rushed and any time he was near our table he spent a total of I want to say literally 30 seconds taking ALL 12 of our orders, and never came back around to ask how our food was, nothing. I can't vouch for the food really, I had ghormeh sabzee which I know not many people would order right off the bat, but a few of my coworkers tried it and loved it. (They themselves were mostly eating various kabobs, fish and rice) One coworker did mention that the shish kabob was bland but other than that I can't really judge the food one way or the other. My ghormeh sabzee was very good, along with the rose water ice cream which DOES CONTAIN NUTS, FYI. (they don't say much about the type of ice cream, they just call it ice cream then run out of the room)The waiter didn't bother me much until I went up to ask the front counter if there was a way to split the check. The man up front basically laughed at me and ignored me... I then added \"ok. so no?\" again, ignored me while he continued with whatever he was doing. Eventually I asked to see a menu so we could at least figure out how much each persons dishes were. He said okay and so I waited there, not realizing how incredibly annoyed with me he was until he finally shooed me away with his hands, told me to go sit down and they'd \"get it for me\" I have never seen been treated with such rudeness by any persian I've ever met! Definitely will not be back, solely because of the rudeness of the wait staff. Please find some ACTUAL Iranians with kind mannerisms and a good attitude to serve your food and give us a good name! This was EMBARRASSING."], ["Christy M.", "Known fondly in our circle as \"crazy scribble,\" (because of the sign on the storefront), this place has been on my list to try for years.  I'd heard wonderful things about it from a close friend, so we were excited to try it.  We finally came in last night, and I'm happy to report that it did not disappoint!We were the first customers in for dinner, and the service was perfect.  Attentive and friendly, but no hovering.  We were immediately brought a giant, fresh round of flat bread and condiments.  My husband said he was curious to try the \"Doog,\" a salty, minty yogurt drink.  The waiter said he would bring out a sample before we ordered any.  I was expecting a disposable shot glass or something, but he brought a nice glass with a good-sized portion for us to try!  He said, \"Taste it first, you have to get used to it.\"  He was right...it was very salty and not what most people would be used to.  I'm glad he offered a sample before we committed to buying it!The food was incredible.  I don't even know the names of what we ordered, but mine was braised chicken breast and thighs in tomato saffron sauce.  The tender, fall off the bone chicken with the sweet and savory sauce, and long grain saffron rice were tasty and high quality.  My friend's beef stew and husband's lamb skewers disappeared from their respective plates before I could ask them how their meals were!  The prices are fair for the quality (more than I would pay on most nights, but okay for an occasional meal).  We all left satisfied and happy!"], ["Shoaib M.", "Horrible horrible one of the worst I mean just terrible customer service ever. Would never ever come here.  4 plates, green tea over $80 and no customer service thank you"], ["Sarah J.", "Nice place and food ! Really really yummy The only thing I didn't like about it was the customer service ! It's plain bad ! They need to hire better waiters other than that the prices are too high but if you are a person that likes to eat at expensive restaurants than it's good but they need to change their wait staff !"], ["April G.", "Famous kebab has gone downhill since I've eaten there. It used to be one of my favorite places to eat Persian food but now that there's so many more selections and competition this place needs to step it up a little bit. The customer service is always been just okay with me and I tend to order takeout anyways so it's not a big issue.The Fortions of the food are huge and that's a plus but the kebabs are just not as flavorful work that great. They give a lot of rice and it's always very fluffy but for some strange reason this time it tasted a little off like soap water. I think that this placeis a little bit expensive for the quality of food gives but the bread is delicious and so are the mints with cheese and cilantro and beets."], ["Mike J.", "One of the best pieces of chicken that I've eaten. I've eaten here several times, prices are reasonable considering the quality of meat. Interestingly, usually a white meat eater, but the dark meat is amazing as well. yet it was very clean. Atmosphere is good.   Looking forward to going back."], ["Mike S.", "Great food and overall ambience. I thoroughly enjoyed the freshly baked pita with cheese and herbs to start off. The entrees were excellent. I would definitely go back here and refer to a friend"], ["ishtar a.", "Best place for kebabs in all of northern California! It's always busy but the food is super good. My dad's pretty hard to please when comes to middle eastern food and he loves it! Worth the drive from Modesto!"], ["Cindy S.", "For two years I've driven past Famous Kabab wanting to try their food and at the height of my curiosity they appeared on GroupOn! Last week I finally got the chance to drop in for dinner. For a Tuesday night they were pretty busy and I knew they had to be good judging by the ethnicity of the patrons. (I tend to believe if you don't see any Chinese people in that Chinese restaurant it must not be that good... and the same with other ethnic restaurants and their customers.)The menu consist of an array of kabobs, stews... I opt for the Shish Leek (lamb) because it looked delicious in the picture on GroupOn! While we waited for our entrees we were served a typed of flat bread with a plate of cheese, onion, cilantro, tomato and some other herb type vegetables. We also ordered a side of must-o-khiar. My boyfriend really liked the yogurt. The consistency seemed a little thin to me but you could really taste the cucumber which was good. The Shish Leek was served with a tomato and basmati rice. Everything looked and smelled really good. The lamb was tender and you could really taste the mix of spices in the marinade. The buttery flavor in the rice went perfectly with the lamb. I'm a total anti tomato person but believe it or not I ate the whole thing! I enjoyed every bit of my meal.I do recommend trying this place if you like kabobs ans grilled meat however their menu is a bit pricy. Poultry dishes start around $17 and any other meats around $19.99. Service was a little slow but maybe that was because it was a busy night. While their parking lot is small there is ample parking on the street and at 24 hour fitness across the street."], ["Arushi S.", "EVERY Persian food-lover needs to come to this restaurant if they are in the area and don't mind spending a little money. My entire family swears by great kabobs (it's a blood trait) and we just can't get enough of this place. We've been here for birthdays, Christmas, and brought family friends from around the country here, too.Appetizer: The little pita-cheese-onions-tomato-greens appetizer plates they serve for FREE is literally the best thing ever. I have not seen it in any other Persian restaurant I have been to and my family was so impressed our first time here, that we now serve this simple appetizer at our family dinner parties!! Famous Kabob, you are doing this right...don't get rid of it, ever.Entree: We always order the Beef Koobideh and Chicken Barg. Super, super juicy.  The Mahi Kabob (fish) is great too -- very crispy skin and flavorful fish. Beware: sometimes they run out of the beef, so call-ahead if you are wanting it. Fortunately, the chicken koobideh tastes just as delicious and juicy. What impresses me as the meats are not ever over-marinated or swarming with sauces + rubs. They are just seasoned in a proper way and then cooked to perfection. Probably consistently the best koobideh I have ever had. PROTIPS: 1) If you are VEGETARIAN, you should tell them beforehand and specify if you don't want meat to touch with non-meat.  In the past, they have served our veggie kabobs on the same large platter as our meat kabobs. 2) Keep a look-out for Famous Kabob coupons/deals on Restaurants.com. We once found one that allowed us to order lamb, chicken, AND fish at this place -- all under $50! For a restaurant that is on the pricier side, it was such a blessing to eat Famous Kabob's juicy, high quality meats/poultry/seafood for much less than what it would have costed otherwise."], ["Daniel H.", "As usually, Cindy K takes me to all the amazing places that I've come to fall in love with. Thanks wifey! This was the first time I ever tried this type of food before. I'll always come back because it's still one of the best kabob I've ever had! Don't be fooled by the shabby looking parking lot and outside structure. - Good service, manager stops by to make sure we enjoy our food- Delicious complimentary appetizer- Juicy flavorful meatIt's slightly pricey, but the quality is good. It's also a great place to take a date for a nice meal."], ["Justin H.", "Looks can be deceiving, so don't let the strip mall facade fool you because the inside is great. The starter bread with onion, cheese, & various other condiments is extremely good. The chicken kabobs are wonderful & juicy, and the rice is lite & fluffy with great flavor. Would recommend this place to anyone."], ["Mishka L.", "Amazing Persian food, pretty much my top 3 places to eat when im visiting home."], ["TRACY R.", "The fiance and I wanted to celebrate the end of his last final and his Law School \"adventure\" by trying a new restaurant.  Preferably with a type of food/cooking that we haven't had before.  Since we've both never had Persian/Iranian food we were excited to try this place out. The location isn't fancy at all, but when you walk into the restaurant the ambiance completely changed.  They have a large steel chandelier that hangs in the middle of the restaurant.  Red, cushiony, velvet booths and tables with linen cloth napkins.  From the outside, I didn't expect to be walking into something fancy.  Even the waiters looked sharp in their black pants and uniform white button down shirts.  We decided to order from the Dinner menu (it was lunch time) because we were craving lamb.  The lunch menu is definitely reasonably priced.  Dishes ranging anywhere from $10-12, but you don't get any lamb choices. The dinner menu had items listed at $19.What I ordered:1.  The Lamb chops and rice:  This dish originally came out medium rare.  I can't eat medium rare cooked lamb.  I had the waiter take it back to cook it more with no problems.  He was happy to do it!  After it came out the way I wanted I was able to enjoy my dish.  It was delicious.  The lamb was cooked to my liking and the rice was very good.  It's like they cooked it and slightly flash fried it.  It was buttery and a little crispy, but all in a good way.  2.  The fiance ordered the lamb kabob:  I think they got our order mixed up because he wanted his dish prepared medium rare, but it came out medium.  Since I had to return my dish for more cooking, we returned his as well.  Again, with no problems from the waiter or anything.  Very good customer service if I do say so myself.  Once his dish was returned to him he was able to enjoy it as well.  The kabob had grilled red onions and bell peppers that accompanied the lamb very well!Overall, we had a great experience!  The food was great, service was great, and parking/location wasn't an issue.Since I'm not familiar with Persian/Iranian food, I'm not sure what makes a particular dish \"Persian\" or \"Iranian\".  I only say that because I swear I ordered a dish similar to this at Petra Greek and a Kabob at an afghan restaurant that tasted similar.  So confused.  Will do more research on what makes a food Persian, Iranian, Greek, or even Afghan.  Their dishes are just so similar to me.  Pretty ignorant in this department, so if there are any yelpers out there who can school me it would be greatly appreciated!"], ["Anthony W.", "We made a mad dash to Famous Kabob because as usual, I had put off using a Groupon for months and months and it was about to expire. When I drove up to this humble little strip mall with a payday loan next door servicing the needs of the community, I kind of assumed it was a no frills fast foodish kinda place. But lo and behold I walked into a lavishly decorated little piece of Persia. Granite tables for all and ornate ceiling adornments galore. I found it amusing that most of the waiting staff were older Persian men, reminded me of Goodfellas. They were efficient and cordial, and were overall pleasant and attentive. First off let me say, the basmati rice blew me away! It was the fluffiest, most fragrant basmati rice I've ever had. Infused with saffron and most likely cooked in some kind of broth, I could eat it plain and be done with the meal. The rice alone deserves a 5 star review. However, the other elements, bring my rating down to an overall 3.5 star. I had the lamb shish kabob and the meat was tender but cooked well done, and not seasoned much at all. I had to sprinkle salt on it to taste and the waiter actually told us to load it up with the sumac seasoning. In my mind I was expecting something wonderfully seasoned in a way I could not do myself with my limited knowledge of kabobs. But alas, I think I could've grilled a tastier meat on my Weber at home. Now combine that with the $20 price tag and I'll have to knock it down a few stars.Overall, rice was fantastic and alone deserved 5 stars, but man does not live by rice alone."], ["Gara G.", "Everything taste truly delicious every time we go, best Persian restaurant in Sacramento !!!"]], "Babylon City Market": [["Carri S.", "Love this place. Great food, great pricing! My favorite option for take-home food! The chicken kebab meals are massive and only 7.99!  We get two and split between our family. The bread is to die for!"], ["Jenny P.", "Good freshly baked breads and baklava. 2.5 stars because service leaves a lot to be desired. While I was giving my order, the gentleman behind the counter kept yelling to the other side of the store and speaking to other staff in Arabic. I had to repeat my order twice. Also didn't appreciate the  discourteous attitude. I would really like to go back to this store but I will probably find somewhere else to get my Mediterranean fix.  Luckily Sacramento has lots of options."], ["Farrah A.", "Not impressed. Ordered a sandwich and the bread was hard as a rock. We took it back to the cashier and he didn't reimburse us or make s new one. Enough to keep me from going back. Plenty of other places I would rather go to. No customer service skills whatsoever. Eating area filthy dirty."], ["Bridgitte R.", "Without a doubt the best Falafel sandwich in Sacramento.  I grew up outside of Detroit, so I know Middle Eastern food.  This is the real deal - and such a deal!  3 dollars gets you freshly baked pita bread stuffed with hummus, pickled veggies, tomatoes tahini sauce and 3 perfect falafel patties - crispy and deeply brown on the outside, pillowey, soft  and richly flavored on the inside - and deeply roasted eggplant pieces.  Worth driving out to Carmichael from downtown for these sandwiches.It has been a while since I had their shwarmas and kabobs, but I remember they were excellent as well."], ["Anna C.", "Absolutely love this place! Great falafel sandwhich and fresh baked pita and flat bread!"], ["Sinan A.", "it was really amazing guys i like it too much."], ["Sonny H.", "Food is a solid 5 star,  pretty much everything I have tried is good or better. All the kabobs are cooked fresh when ordered. Plenty of selection of food with chicken pieces, beef kabob, biryani and burgers. Try the garlic sauce highly recommended. They make fresh bread in the back super good right out of the oven. Price is reasonable. Service is non existent and the cashiers tend to struggle with communication. Thus the 4 star or it would be 5."], ["Fred S.", "I always enjoy stopping in to Babylon Market. There's always something to pick up when you go down the aisles or in the back produce room. Their bread is absolutely amazing...always made fresh in their big oven. Their falafel sandwich is great...only $2.99 and very filling! I've had their hummus and baba ganoush also and both were very good. The prepared food is great, but I also suggest exploring the rest of the store for some unique and delicious items too. Very nice family owned and operated store with friendly service."], ["Im hungry L.", "This is a gem in the rough.  I was driving south on Watt and noticed this place right on Watt.  I pulled in and was immediately confused about the entrance and parking.  The store is the same - confusing but after you know the store it was nothing afterall.The store is broken into four separate areas of food:  A butcher and halal meats, a bakery, a deli, and a grocery store.  From the looks of the lines developing around noon, the deli was starting to get real busy.  One guy was squeezing fresh pomagranites, another assembling a pita sandwich, another guy on the register, and a bread guy bringing over fresh baked pita and other breads.The service is trying but worth the venture.  They have the goods..."], ["Simone S.", "It was my first time to have a Shawerma here. The chicken meat was like spikes... What happened to the tender meat :("], ["Chris E.", "Awesome sandwiches, fresh breads, and the best fresh hummus, all made daily. Shawarma is great, tikka is as well. Can't go wrong ordering anything on their menu."], ["Jennifer L.", "I found this little gem about two years back and it's become one of my favorite places for chicken shawarma sandwiches or lunch combos which comes with a generous amounts of rice, kabobs (diff meats to choose from), pickled veggies, hummus, fresh pita, and garlic dip for under $10...that's an AMAZING deal for me. The meat is cooked fresh to order and their pitas are made fresh daily there as well. This place also doubles as a small Mediterranean market as your can guess by their name, I have yet to buy groceries but I can vouch for their food. The reason its shy from a five star is that on numerous occasions there is a lady there who for some reason had a hard time getting my order down....I mean I'm simply reading off of the board they have up. She has a bit of a snippy attitude that I don't really appreciate but the other workers are really great and efficient. You might have to also ask for the garlic sauce with your kabob meal orders cause they don't always give it to you."], ["V F.", "This is a good mediteranean market , bakery and restaurant ate here numerous times and they are awesome the beed and lamb kabob is delicious and under ten dollars , you cant go wrong and the bread bakery smells amazing"], ["r k.", "Chicken shawarma sandwich was good especially with the bread right out of the oven. Too much garlic sauce but otherwise a good sandwich, with a big portion of tasty chicken cut fresh from the rotisserie  One of the best fast food deals around.  I'll be back."], ["Scott M.", "Got the beef shawarma sandwich, couldn't be happier with it, still have to try the chicken"], ["Katy J.", "Great place for delicious falafel sandwiches with freshly made bread. Hard to believe the $2.99 price! While you're there, you can pick up some other freshly baked breads to go. It has a little market with a good selection of basic foods. I love their tea selection!"], ["Gina C.", "This is a regular spot for me to buy a few groceries and lunch. So far, I've bought the fresh pita bread which is...incredible. Soft and chewy. And I loved the pickles they put in the falafel sandwich so much that I picked up a carton of those too. Which are on the right side in the fridge. The falafel sandwich is a wonderful, cheap, treat. As everyone has already said it's only $2.99, filling and fresh. I also got a plate too. Had rice, tomatoes, onions, lamb swarma. So good!"], ["Zac V.", "Alright the key to this place is going around lunch. The food is always awesome, but around lunch time it is at the peak of freshness and is delicious. I would recommend the Falafel, but the Shwarma is great as well."], ["Ashraf H.", "This is about as good as it gets for chicken and/or lamb shawarma sandwiches in the Sacramento area.  Staff were friendly and helpful as well."], ["Bradley C.", "This was our second visit to Babylon.  The first was when we were driving elsewhere and a decision was made that a return to the meat department was in order when we had the necessary coolers.Bought a slab of lamb chops.  These are the baby lamb chops that run at least 11 dollars when you can find them.  The cost at Babylon was  6.99/lb.  This was a steal in any terms and they looked GOOD!Also bought 3 lbs. of ground lamb.  It was beautifully ground on the course side which is perfect for many Mediterranean recipes.  Also bought a bunch of veal shanks and just writing about them makes my mouth water.Also bought one whole hand slaughtered chicken which makes Foster Farms look sick.  As a side note after the salmonella scare Foster Farms chicken can make you sick!The butcher wasn't overly friendly, but he was polite and willing to cut our order to our liking.  As a future note they sale whole lambs weighing in at 35 lbs.When we went up to the counter to pay it was impossible to resist ordering a shish kabobsandwich.  I guess the meat wasn't  ready because the order took over 15 minutes to arrive at our table, but it was delicious and filling.The only negative item was their upkeep of the restroom.  The toilet had overflowed but luckily I only used the RR to wash my hands.  The rest of the store was well kept."]], "Cafe Morocco": [["Dave M.", "Chicken Gyro for lunch! .. Excellent! Tina Rocks! If you want great food,  good service at cheap prices.. This is the joint! Be sure to keep your kids at home. This is NOT Burger King!"], ["Noelani R.", "Best cooked lamb I have ever had with the casablanca. Service was personable and everything was tasty. I came here after having my first ultrasound and seeing my baby for the first time and it hit my cravings perfectly."], ["Moein M.", "The guy with the beautiful hair is very hot and he has good service....oh and the food is good too...it's like I was dining in a abracombie and Fitch store"], ["Hannah F.", "Fresh ingredients, nice casual atmosphere. In short: YUM!"], ["Beth K.", "Chicken Sumac is fantastic. I've been going here for years, ever since I moved to Sacramento. The food is consistently delicious and the ambiance warm. I will always eat here when I have a taste for excellent middle eastern."], ["Michele N.", "Love this little hidden gem!  Used to bring the kid when he was small to watch the belly dancers on Friday and Saturday night.  Chicken Sumac is a personal favorite.  Just tried the Greek Baklava for the first time.  Super sweet and delicious!!"], ["Aly W.", "My husband and I have dined here a few times and we can't get enough! Just delicious! The chicken sumac is as good as everyone is saying it is and the service is always exceptional! The staff is very friendly and really goes out of their way to make you feel welcome. The rose water dessert was very different but we absolutely loved it! We will be ordering that again soon. I also recommend the hibiscus herbal tea! It is really yummy and the perfect beverage for these hot summer days!"], ["Trang N.", "i've been here several time now, and this place does not disappoint every time. Service is always wonderful here, I've never had a problem and the food is amazing. My favorite dish is the chicken sumac, it's amazingly flavorful and moist, it pairs well with the pita bread, hummus, and salad that comes with it. I always get rice along with it. Very generous portion, and my stomach always leaves happy. Of all the mediterranean places I've tried, Cafe Morocco is the one I come back too. It's a little tricky to find but it is definately worth a try. There is nothing that I've tried here that I did not like. Very outstanding restaurant with great food and service. Give it a try, u won't be disappointed. :)"], ["Ravindra S.", "Very friendly service and tasty food. Keep room for the dessert, Moroccan Baklava. The Aish Essaraya is to DIE FOR !!! Get your own plate cannot be shared, it's THAT GOOD"], ["Marium A.", "It was okay. Didn't wow me. But then again all I got was pita and hummus. Will go again soon to try gyros!"], ["Amanda S.", "I had the Casablanca lamb kabob with pita, hummus, and salad. My husband had the curry chicken with rice and the Hairira soup. To drink I had hibiscus iced tea and my husband had the Turkish coffee. All of it was excellent and well exceeded my expectations. The food was reasonably priced and portions were a good size. The service was excellent. The atmosphere is humble but the traditional decor was nice. I will definitely be eating here again."], ["Michael L.", "I have to say the food here is great.  One of the best in town but their customer service is way below average.  I've ate here multiple times and every time their service gets worse and worse.  So I've now boycott this place because of their customer service.  I mean, who wants to support a business that doesn't appreciate their customers?  The male waiter gives bad service every time.  Their price is on the pricy side.  I hope this business either change their waiter or have them take classes to provide better customer service. I give two stars because the cooks does an amazing job at making these wonderful dishes."], ["Siobhan G.", "I had been searching for good Mediterranean food and Cafe Morocco definitely hit the spot! I had the chicken sumac (per yelpers suggestion) and it held up to its reputation. My husband had the lamb kabob and his was also delicious. The only downside is that the service is a bit on the slow side, even when the restaurant isn't packed, but we will definitely return."], ["Lillian Z.", "\"Mediterranean.\" That was the only description I was given before dining here. Not that I was complaining since mediterranean food is always a go for me. I was overdue for some mediterranean/Moroccan deliciousness and this definitely hit the spot.On my friend's recommendation, I tried the Chicken Sumac, which was delicious. Chicken marinated for 24 hours and cooked with onions and a garlic sauce? Sign me up 100% of the time. The chicken (+ sauce) was served on top of pita bread with a side of hummus and a salad. If you are not a fan of parsley, this may not be the right salad for you, since it's pretty much a salad of parsley, but I thought it complimented the chicken well. The hummus was delicious and flavorful, as expected. My only complaint would be about the pita served UNDER the chicken. Yes, serving it this way added extra flavor from the chicken juices and sauce and made the pita more scrumptious, but it was also more awkward to eat since you had to dig it out from underneath all the chicken where it had become quite soggy (I know, that makes it sound super appetizing...). I should also mention that the Chicken Sumac comes with a soup as a starter, which was so-so-- it falls in that grey area of being not terrible, but nothing to write home about either.tl;dr: Definitely on my \"will come back again\" list for Sac. I am already missing the garlic amazingness of the Chicken Sumac. Sniffles."], ["Jennifer S.", "My friend and I came here because I had the Groupon.We arrived around 8pm on Saturday and were seated immediately. There were only two or three other parties.We ordered the Mezzah #1 appetizer, Casablanca chicken kabob, and wine. The appetizer came with dolma, falafel, hummus, baba ganooj, a couple of olives, pita braed, and a couple of dipping sauces. The falafal was kind of dry but still pretty good, especially with the cucumber yogurt dip. The baba ganooj was good, but maybe a little too interesting for me, and the hummus was okay. Not the best I've had, but not bad at all. I was personally not a fan of the dolma.The kabob was very decent. The chicken was just right, maybe slightly on the dry side but still moist. The bread, which I think must have been made on location, was very good, and the barbeque sauce, which is advertised as an original recipe, was also very good. The soup was one of the best soups I've had, and I'm not even a soup person. The cucumber salad was amazing. I probably would have been satisfied with just a big bowl of that, and nothing else.I had the rouge wine, which was advertised as \"similar to merlot,\" and that's exactly what I thought of it. It was very decent, and I would definitely order it again if I came back. This is a very small establishment with seating for maybe 30 people at most. The ambiance is alright but maybe kind of generic and repetitive. The bathroom was dingy and not very well-stocked. I would definitely suggest that as an area of improvement. The wait-staff were very friendly and helpful. The belly dancer was pretty good, and tried to get a few people involved. She asked my friend and I to shimmy with her but we were too shy. I felt bad for  her that there was an old man in the corner with a ridiculous smile taking numerous photos of her."], ["Lynn G.", "We had a great meal at Cafe Morocco. I was craving some homemade ethnic food, and wanted something close to home. We got the mezzeh #1 appetizer and vegetarian moussaka with an extra cup of soup. It was more than enough food for us! I loved the soup to start. It was flavorful but not overly rich. The mezzeh is such a good deal. Hummus, baba ganoush, dolmas, and felafels with pita. Everything tasted authentic, like someone's grandparents were in the kitchen cooking up a storm. My husband LOVED the moussaka. He considered ordering another to-go even though we already had leftovers. The service was attentive and friendly, but not overly in our face. We will be back!"], ["Alex B.", "Consistency. Every time I come here it is excellent so I wanted to update my review. I like to come when it isn't so busy so I can chat with the cook. Everything is always so fresh and they haven't relaxed on the food quality like so many other businesses do over time! Will continue coming if they keep up the amazing food!"], ["Kamini C.", "Amazingly delicious finger licking good food here. Service is exceptional and the desserts- superb. Love this place!"], ["Diana E.", "Chicken Sumac. Chicken Sumuc. Nom. Nom. Nom. That's all I have to say. I haven't tried anything else, but I can't stop eating the Chicken Sumac."], ["Maria O.", "Food: great! Service: great...  Family environment...  Clean...  I recommend it!I asked a lady that was coming out of it if it was worth it.. She said yes and she did not lie!!!It was a great experience!"]], "Mediterranean Bakery and Cuisine": [], "Pita Kitchen Plus": [["Jenni T.", "LOVE LOVE LOVE this place!!! If you love Greek food, or even like Greek food, or have never tried Greek food then you need to try Pita Kitchen Plus!Food- 5/5. They have the best falafel ever. Even my picky friend says so so if must be true! Haha but really it's super flavorful and is nice and crunchy on the outside but soft and moist on the inside. You have to try it. I get the Falafel Supreme Sandwich which has falafel, veggies, hummus, tahini sauce and super hot sauce stuffed in a pita. It's amazing! And has a ton of falafel inside for the price! Two thumbs up! My friend gets the Chicken Schwarma Sandwich which has marinated chicken, veggies, garlic sauce stuffed in a pita. She says it's awesome and loves it! Recommended as well! Baklava is good as well! Nice and flaky and moist and worth a try!Atmosphere- 3/5. Has a cool grocery section up front and some nice booths to sit in in the restaurant part of the restaurant, but there are some empty display cases and an empty counter up front and some empty tables in the restaurant part which are kind if weird.Service- 4/5. When I call on the phone to place a to go order the person who answers the phone is always friendly and helpful! When we eat at the restaurant the service is good, sometimes it can be a little slow though so prepare to wait sometimes.Vegetarian Friendliness- 5/5. In every category there is more than one option without meat so I always have a choice! And with the falafel being the best thing in the menu, I always win. Hooray!Overall- 5/5. My friend and I go here regularly, anytime we are craving Greek food we don't hesitate to go here and you shouldn't either because there is nothing else close that even compares. And it's cheap too!!!"], ["Jason M.", "Great food and friendly attentive staff. I recommend this place for sure and will be coming back soon."], ["Jessica K.", "This is a little treasure if you're okay with the lack of ambiance and alcohol. I had a favorite Pita place back home and something about the sign rung a familiar bell so of course I had to give it a try (after first checking out the other Yelp reviews of course.)I walked in around 4 p.m. and was immediately greeted by the one cashier, server and busser. I ordered the chicken shwarma sandwich, lentil soup and mint lemonade and perused the grocery section. I guess that's why you call themselves Pita Kitchen Plus, because the ready made frozen foods, baklava, and cookies add to the overall restaurant feel. Now the restaurant itself was dead and you could hear the one table carry on a conversation about work anywhere in the spacious restaurant. I think a bit of music could have gone a long way to mask that noise but who knows why it was off. I received my food in less than 10 minutes and took a seat outside on the sunny side of their patio. Oh my goodness, the sandwich was amazing! The chicken was thinly sliced, moist, and the sauce was good enough to lick off the wrapper. I was so stuffed after finishing it, I almost didn't have space for the lentil soup. The soup by the way, wasn't exactly what I thought it was going to be. It had a color similar to pea soup and a consistency similar to some Progresso vegetable soup. It was hot, the spices weren't overwhelming and it was 16 oz. of heaven. I wish I lived closer to this place, 'cause it could have well been my usual lunch spot. It doesn't look like much when you drive by, but it's definitely work the trip."], ["John H.", "I found this place because of a yelp review. I like the food very very much. The portions are perfect. I love everything I've eaten here with a half exception regarding the hummus, ( it's really bland but bettered with salt). The garlic sauce is exquisite.... My mouth is watering just thinking about it. I am in love with the shawarma. The groceries are great with frozen items at reasonable prices. Large selection of dry goods as well, I am addicted to the milk chocolate covered almonds. The service is hit and miss which is why they lose a star. I've even left wondering if I'd return after receiving poor service."], ["Alynah N.", "I only tried the chicken kabob sandwich and I have to say for the price and for how much little chicken they gave me in the pita bread it was a waste of my money!! Every time they stuffed the pita with salad and tomatoes  and put a table spoon of chicken, so this time my husband and I asked for extra chicken and they barely put another table spoon of chicken and charged us a total of $4. Ridiculous! Our total for two little pita sandwich's and water came out to $20. In all, I think this place is a rip off and over priced. I lived in the expensive Bay Area and went to numerous delicious halal restaurants and they didn't even charge as much as this place. Very disappointed they take advantage of selling halal for such high price."], ["Jennifer L.", "Great Lil gem! Healthier fare that is packed with fresh flavors. Must try it for yourself."], ["Melissa M.", "The pitas are delicious the chicken shawana pita is my favorite..I add the spicy sauce and then it's even better I highly recommend this spot"], ["Vincent P.", "My friend decided to drop by this place to try the falafel sandwhich which I had no idea what it was and quickly said no lets go to chipotle. After a few minutes I gave in and said sure why not lets try something new. Walked into the place and was greeted with a friendly staff and got seated. Ambiance was quiet and relaxing. The place had a homey/traditional looking feel to it.Going on to the food we both had the falafel supreme sandwhich. food came out and the proportion was pretty huge ! About the size of my hand and just a bit bigger. We both had the hot sauce on the side and let me just say that hot sauce is to die for and is what makes the falafel sandwhich AMAZING ! It was love at first bite. The falafel was very crispy and we both sat there literally for 10 minutes nonstop eating without talking. It was that good !!! Since then we came back here everytime my best friend came back from college far away. We also received free baklava and let me just say that little pastry is soooooo flavorful and delicious! Anyways we both always had a very great time eating here and have always gone here since then. Its THE PLACE to get the perfect falafel sandwhich :)"], ["Em L.", "Arden Arcade has a slew of fab Mediterranean & Middle Eastern restaurants, Pita Kitchen is definitely one where you should eat and repeat. This food is so incredibly delicious! There are meat, vegetarian and vegan options. My coworkers are in love with the pink garlic sauce. I admit, you could pretty much eat it daily and never get sick of it. The dishes range from 5-10 for lunch entrees."], ["Vickii K.", "4 for dinner. Great mixed appetizer plate ESP the falafel. Enjoyed lamb and yogurt sauce. Lemon chicken didn't have enough lemon taste. It was stewed. Not what was expected. Chicken kabob was pronounced just ok. Mixed plate of meats was enjoyed. Lentil soup amazingly good. Baklava seemed a bit dry as did pittas. Service was great."], ["Svetlana K.", "Interesting place. There's a mini store when you walk in with fresh hummus, yogurt, olives, sun dried tomatoes and other Mediterranean ingredients both refrigerated and dried.  Fresh pita bread daily. Just ask for a package they keep those in the back.The restaurant during the day was very quiet but I'm sure it must get busier in the evenings. Nice large booths as well as tables with chairs. They look like they could accommodate large groups for informal and more official get togethers. The waitresses were all very nice and looked like they all were of Mediterranean decent. Any questions I had about the menu or store were taken seriously and answered sincerely.The food was very good. I only had the appetizers for lunch, but I'm curious to come at dinner time to see what their food and ambience is like then."], ["Primrose L.", "Food is bland. Very bland, flavorless, dry (oh and it came with a free stone too on my salad!)."], ["Cynthia S.", "Love this place. The garlic sauce is to die for. Always great to run in & grab some hummus, pita bread, feta cheese for the mini store they have set up. The spicy hummus is a must"], ["M K.", "The price is reasonable for the quality. Very good food. You get what you pay for and definitely is worth every penny at this place."], ["Elisa R.", "Love being a repeat customer here! I'm picky about baba ganouhj (puree roasted eggplant) and this is one of my favorite places that makes it just perfect! The kabobs and shwarma sandwiches are full of flavor and juicy each time. I commend them for the consistency!    The best part is their little store when you come in... I take home the spicy sauce every time... its good on anything! Lastly super friendly service each time.. even when they get a busy rush."], ["Harry S.", "Ordered the lamb lunch special.  Delicious and reasonably priced.  Service was fast and friendly.  Recommend the garlic sauce."], ["Lisa H.", "My absolute favorite restaurant in sacramento!! Very reasonable prices and the food tastes authentic!!! The staff is very nice and the falafel supreme is to die for! I took a friend here who's never had this type of food before. She was nervous but absolutely loved the shawarma!!! We both go there a few times a month."], ["Alan J.", "Not impressed at all. Food is below average and the prices are high. Servers are nice and attentive. They need to improve the flavors to compete especially with middle eastern restaurants opening on every other corner."], ["Beth H.", "Only place I've found for gluten free falafel. Food is sooo good and fresh. Plus you can pick up their amazing hummus for home from their market. Service is very good."], ["Daniel G.", "Enjoyed dinner with friends here last night and HIGHLY RECOMMEND.  Wonderful family-owned restaurant with excellent service.  The food is incredible and made from fresh ingredients.  Awesome falafel, hummus, hot pita and all the other Mediterranean favorites.  5 STARS!!!"]], "Crest Cafe": [["Brice H.", "Chicken kebab plate is solid size and comes with high quality fresh foods.  Grilled chicken cubes, fresh salad, pita bread, and some really good garlic and chutney sauces.  I will be back.PS - their \"nachos,\" aka fries covered with garlic sauce and other items, are incredible if you are not concerned at all about eating healthy."], ["Bahar A.", "We had crest cafe cater for a family event and OMG they did a phenomenal job!!! I can't thank them enough for the wonderful service and delicious food they made for us. My family and I are really picky when it comes to food and hiring caters because we are in the wedding & event industry and have seen the best and worst. I can't say enough about how professional, clean, and tasty they made the food. I knew from the beginning that Crest Cafe would do a wonderful job, but the day-of they just EXCEEDED OUR EXPECTATIONS!!!Let these wonderful professionals cater your next event, and you will not regret it! Just tell them your priority and let them handle the rest because that is their expertise so let them be creative with the menu!  That is exactly what we did and we couldn't be any happier with the results! We LOVED everything! People still talk about the great food and delicious appetizers you all made! Thank you so much again!!!"], ["Matt M.", "I go here about every 3 weeks for an affordable, healthy, and delicious lunch. I've had the chicken sumac, eggplant, gyro, and falafel. All these are offered as wraps, which are good, but the pitas are even better. The pitas don't seem to be made in house, but when they are that good I don't really care where they come from, just don't change vendors! And if they are made in house, nicely done! Probably the best pita bread I've ever had.The staff is friendly and work very quickly, even with as crowded as it gets during a work week lunch hour. The food is consistently good and friendly to vegetarians, too. I would rather get something from here than anywhere else on K St."], ["Kali D.", "The Crest Café is just OK.  After visiting this busy place during lunch a few times my thoughts are; they have some good flavors but customer service and the size of the dishes are hit or miss.  A month ago I was doing the \"no carb\" diet pretty hard so my treat to myself was a wrap at the Crest.  I ran on over dreaming of the large wonderful looking wraps I had seen on yelp but when I opened my box I was pretty disappointed and was able to consume the whole thing!  I saw Clay's picture, I read his review. . .why was I able to eat the whole thing, and it is very unlike me to finish my meals. . .ARGH!  I will say the Garlic chicken was pretty tasty and moist.Onto today's visit, back to doing no carbs I settled on the Crest Greek Salad with added garlic chicken.  Maybe I should begin opening the boxes at the restaurant but they gave me one salad dressing which was not even full.  This was not a big dressing container, this was the small 1 oz. container. . .so basically they gave me an half of oz. of dressing.  The salad was good but I had to grab some Cesar I already had in the fridge at work to dress it.Will I go back? Maybe. . .but with some detailed instructions on how to make my food.  Cheers!"], ["Steve A.", "Took about 15 minutes to get our food. Seemed sort of long since the place was empty. Got the beef kabob with a salad. What's with things on sticks not coming on sticks anymore? Weird. The salad had a bit too much oil on it for my liking but was tasty. The beef was a bit salty and could have been seasoned better. A bit tough too but not too bad. Also ordered the Mediterranean fries with everything on the side. Yummy."], ["Brittani F.", "I went here tonight for an affordable quick bite to eat. Although I sat in, quick it was! My food was delivered to me within a matter of 5 minutes. With that being said, they were about an hour from closing and only one other group of people were there.  The place itself is in a neat location. Located on k street alley right across from the dive bar and pizza Rock, there's always a diverse crowd. Inside looked clean, yet there were a couple of flies that kept buzzing around and wouldn't let me eat my food without being bothered. Also, I noticed that the employees closed 30 mins before they were supposed to. What's with that? BUT with that aside, the food I had was really good! Tasted super fresh and hit the spot. With my experience, I rate this place a 3.5."], ["Kim C.", "We came after an event in midtown. We decided to try this place. It was really good. We had delicious Kofta and Falafel. Eveything was made to order and fresh and not a huge wait."], ["Brook Y.", "Crest Cafe is a well-priced and tasty lunch spot conveniently located to the Capitol. No beer or wine, just delicious and healthy options at a reasonable price.The Crest Greek salad is my new go-to lunch: a generous heap of lettuce (romaine, not iceberg, thankyouverymuch), a few thinly sliced cucumbers and tomatoes, a sprinkling of feta cheese crumbles and a light and tangy vinaigrette. Add garlic chicken or gyro meat and your total is just under $11, which is pretty good for the neighborhood, and it's usually enough to send me into a minor food coma afterwards (um, no small feat for a mere salad!) Please note, I'm kind of a super salad snob, so finding a place with a housemade dressing that doesn't use mayo or corn syrup to thicken it = major happy salad dance. The garlic chicken is also well-seasoned and the portion is more than satisfying. The lamb gyro on their pillowy soft pita bread = a perfect meaty-crunchy-chewy lunch that won't bust your gut or your wallet.Crest Cafe has a nice combo of Mediterranean fare like dolmathes, falafel, and babaganoush, mixed in with some Americanized faves: if you're not in the mood to be healthy, the Mediterranean fries are seriously to die for, topped with gobs of feta cheese and smothered with creamy tzaziki dressing. Straight up hangover fare.In terms of how this place compares to the other Greek spot downtown: it doesn't have the hip factor, but I would argue that Crest's food is better than Petra (do NOT get me started on how shady I think it is to add fries to a gyro, that is just a ploy to give me less meat!) Crest's interior is more like a cafeteria space, roomy with tiled floors and fluorescent lighting, although on a temperate day the partially-shaded patio is a small slice of serenity next to the clamor of lightrail and K Street bums. It could maybe benefit from some sprucing up, but as long as the prices stay low I'm not complaining."], ["Kim C.", "Flavorful and traditional Greek food tucked away on K Street.  The chicken gyros are delicious!  The restaurant atmosphere is nothing to write home about, but they have plenty of indoor and outdoor seating right next to the Crest Theater.  Great for a quick, affordable bite to eat!"], ["Charmaine S.", "I'm always iffy about Mediterranean food but this place does it right. For lunch the have a buffet but only one chicken dish among all the other dishes. I ordered a gyro in a wrap and it was uber yummy and light, it was a great suggestion from the workers there to put it on a wrap and not the pita. It was like a salad wrap. Very light and flavorful. I will definitely be back there in the future and may try out the buffet next time."], ["Colleen W.", "This place is yummy! I love the different choices although I dont know what half of them are. If you like Greek food you will like this fresh take on it. There is plenty of seating and the portions are generous. Im also addicted to the sauce that came with my food, not sure what it was but it was delicious!"], ["Elizabeth T.", "The food is fine. I mainly wanted to leave a review to warn yelpers about the hours not being accurate. I came here this evening a few minutes before 6 and they were closing. They let us in however, but they don't stay open until 7:00 as listed here on Yelp. Also, I don't recall any hours posted on their exterior windows, so I would suggest calling first to be sure."], ["Monique J.", "Really enjoyed the lunch buffet! A variety of choices to try Greek food and still have \"safe\" options on the menu - traditional Greek salads, hummus & pitas..."], ["Lejander L.", "Food quality: decent.Portions: pitifulPrice: MOOORE than it deserves. Ambience: sadCustomer service: very awkward I didn't enjoy my experience to say the least"], ["Kimberly B.", "This place is surprisingly really good! I came here with a couple co workers on our lunch hour. It was my first time at Creat Cafe. There was so convention with a whole bunch of high schoolers so everything in the vicinity was packed. The line here was out of the door and every seat was occupied. The long line moved fairly quickly. However, once I placed my order, the food came out super fast. I ordered the Chicken Shawarma Wrap. It came with tzatziki sauce on the side. The wrap was really good. Very filling, I couldn't even eat all of it. I would recommend this to everyone!"], ["California G.", "I tried the lunch buffet. I guess the day we went there was not much selection. Few of my co-workers go there every week. They love the buffet area and they suggested me to get their $10.99 deal (all you can eat) with comes with the drink. From the buffet area, I liked the eggplant, chicken curry only. Beside that there were no other good selections. My co-worker said, usually they have more dishes but they constantly change. So we must have gone on a wrong day. I'll try again."], ["Basir O.", "If I can give them no stars I would. My friend highly recommend this place and so when I did come in with her today at 3pm it was empty I assumed I would get prompt service. We decided to get the medaterrainian nachos which was really good. But I'm eating and I'm like hold where is our food???? I had to get up twice to ask where my food was. The excuse was it takes 15 mins to BBQ the chicken bullshit I'm a cook myself. I parked on the street thinking an hr is plenty time for lunch. I got up told them ur taking too long make it to go I have to move my car. Totally pissed n the food I got not worth it !!!"], ["Smia S.", "Had an excellent experience at Crest Cafe. We had a event at the restaurant for over 60 students and they were very accommodating. Had been in contact with Monira the few days prior about the number of attendees going up and they were very understanding. The food was so good, everyone at the event really enjoyed it and definitely went for second. The nachos and fries are to die for! Had done the same event the previous year with half the amount of people and they did just as an amazing job making arrangements both times. They were even nice enough to let us stay a little longer since we were having such a good time. Already confirmed them for our caterer for our upcoming banquet, don't think we can find anyone else to do a better job! Overall, great food, great service, and great atmosphere. Everyone was pleased with the event and we will without a doubt be back!"], ["Roni-Lyn K.", "best falafels and taziki i have ever had"], ["Kayla C.", "This place really deserves 4 stars in my book, but today was an off day, so I had to knock a star down. I might consider adding the star back later, but only if they are worthy of the extra star! First things first, today is 102 degrees so naturally I came went inside Crest Cafe feeling hot and sweaty and was hoping it would be cooler indoors. WRONG! There was neither AC nor fans blowing. This means one would get sweaty just standing in line to order (which I did). I admit that not having AC is a first world problem. I can forgive that it was too warm for people to be eating and ordering there. I waited for my number to be called. I grabbed my order thinking it was strange because the box seemed smaller than what I can remember. I was thinking \"all right... food is getting expensive so maybe they had to cut back on their portion size\" which is understandable if you want to keep the prices the same but have to cut back slightly. Well, I got back to my office hot, sweaty and hungry. When I opened my take out order, it dawned on me that the portion size didn't get smaller; I did not get what I ordered. I was thinking that maybe I picked up someone else's order, but that is not it because she called out my number and everyone else around me was dining in. My co-workers told me to go back or call and ask for a credit. At that point, I just didn't care because it was way too hot to go back. I ate the meal and it was filling and delicious. Unfortunately, I was slightly disappointed that I paid too much for my meal. What I ordered was more expensive in comparison to what I received.  Another reason a star got knocked down was the amount of oil that was at the bottom of the box. I know olive oil is healthy, but too much of something healthy becomes unhealthy. Oh well, better luck next time I guess!Tip: Check your meal before leaving to make sure that you are getting what you ordered!"], ["PJ J.", "Best lunch and dinner and hands down the best catering services. Very professional and on time service. Excellent customer service. Food is amazing. I recommend this place to everyone."], ["Cyndi S.", "I eat here from time to time for lunch and I'm never dissapointed, but then again I generally stick with a gyro...and really, how do you screw up a gyro? However, I recently had to get catering for a small office working lunch an was having a hard time finding anyone that catered to downtown for a small group that WASNT salad and sandwhiches. On a whim, I called Crest Cafe and they were helpful, accomodating, and incredibly nice.The day of, they were on time, and the food was some of the best catered food I've had. Not to mention it was a fantastic deal, and, of course, we had tons left over! Everyone was stuffed and happy and then the staff from the Crest Cafe came and cleaned up.Great experience, would definitely recomend them for any small event catering!"], ["Clay W.", "By the beard of Zeus! That Lamb Gyro Wrap was no joke. It was humongous, quite girthy. It's good that it was so big because, well, I'm a hungry man. About ten of my coworkers were there when I walked in. They were having a business luncheon to discuss how quarterly the last quarter was, or something like that, and I managed to go undetected = win. Yep, this place is good. I will return in approximately three weeks."], ["Sahiwal S.", "First time I went there, Mediterranean fries were awesome and fresh. Yesterday I went for just fries and was very disappointed."], ["Devo S.", "OK, you can't judge a book by its cover, right?  Well, don't be so quick to zip past Crest Cafe if you're walking down K St.  The food that the hubby and I had today was soooooo good, that we already plan on going back again.  I had the lamb gyro only, no rice, and it was so full of lamb and tzatziki sauce and on such a huge piece of pita bread, that it was MORE than filling.  It was great...Hubby had the chicken shawarma plate with the rice, and there was so much food on that plate (add in a nice-sized salad and several cut pieces of pita bread) that he couldn't finish.  It smelled delicious, and my one bite offering from the hubby was DELICIOUS!  Anyway, I was surprised that I liked Crest Cafe so much, because I admit I kinda had a preconception of place that was kinda \"meh\"...I'm glad they proved me wrong :)"], ["Darren N.", "I love their lunch buffet! All you can eat includes free soft drinks for a reasonable price! different selection on different days. I love going here for the lunch buffet and look forward to it every week."], ["Andrew B.", "Being on a bit of a falafel kick lately, I had lunch there this afternoon. Their website says a falafel sandwich in a pita is $4.99 and a falafel wrap is $6.99. But when I got there I found the actual prices were $6.99 and $7.99. I ordered the wrap, which was more food than I wanted, but I didn't feel $6.99 was a good value for the pita falafel. The falafel wrap was good, but I've had better. The wrap itself wasn't very tasty, a cheap flour tortilla, and the sandwich was pressed in a burrito maker. IMO, the falafel sandwich in a pita wrap at the N Street Cafe is far superior for less money. Another thing that annoyed me about the Crest is that 2 p.m. all the tables were dirty. They had not been wiped down after the lunch rush. Every single table had food particles from earlier meals and were wet from drinks. It did not feel very sanitary."], ["Adonis V.", "My Big Fat Greek Lunch was pretty damn good!  The lunch buffet here is very well good enough to be served in the halls of Mount Olympus and cheap enough to be afforded by mere mortals.   The buffet is a healthy fair, one that offers a week's worth of vegetable servings and being an eggplant fiend, I get my eggplant fix here often. The gyros may not qualify to be on Neptune's trident but the Caesar Salad certainly satisfies.  I've had better Greek food, but I base my assessment on the location and quality of competition and in that regards...It's one of the best place to have lunch in the area.  If their food is good enough for the gods then it's good enough for you mortals...Adonis said so."], ["Mike E.", "The lamb gyro is delicious. Their menu is diverse and has something for everyone. The staff is very courteous and helpful. I often call in my lunch order and it is always ready when I arrive. If you like spicy things I highly recommend the homemade spicy sauce."], ["Lauren M.", "We try coming here atleast once a week. Our go to plates are the chicken kabob plate, the Greek salad with chicken, and the falafels. The food is always on point, tasting fresh and delicious. It does take around 15 mins for your food to come up,depending on what you order, but it's always worth the wait,knowing it's made to order. The staff is friendly and have great customer service. If you're hungry and in the mood for great quality food, look no further. Well deserving of a 5 star rating!"], ["Jenn W.", "Falafel at a great price? I can't argue with that! Me and my friend came here for lunch the other day and had a lovely experience. Good food for great prices and not a long wait.I ordered the hummus pita. It came with lettuce, cucumbers, tomatoes, and olives. I enjoyed it but regretted not getting the falafel pita which was what my friend ordered. Hers was cheaper, came with everything that my order had, but hers had falafel too. so next time I'll order that.The staff was nice and when I told them I was vegan, they left off the feta cheese from my pita. YAY."], ["Jacquelin S.", "As we were heading out to lunch we had to decide to turn right or left from the building.  I suggested right to go to the Secretary of State Cafeteria for their Greek salad.  She suggested the Crest Cafe.  Since I'm always willing to try a place new to me, I let her win (plus the \"she\" here is my boss)What an exciting menu greeted me.  I love Mediterranean food.  I had the Chicken Sumac platter (now that's something you don't find every day)  For only $6.99 I had a generous serving of grilled chicken covered with caramelized onions, seasoned with sumac.  It was served with garlic sauce on the side, a small container of hummus, two halves of pita and fetoush salad (romaine lettuce, tomato, cucumber with a vinaigrette)  Everything was very tasty.My boss had the Lamb Gyros Ceasar Wrap.  It was humongous and great value at only $6.99.We both left with laden to-go boxes after eating our fill.  It's so nice to enjoy a meal and then look forward to the leftovers."], ["Dharia M.", "my favorite greek place in town. as a vegetarian i LOVE their grilled eggplant wrap and also the greek salad. My friends all gush about the garlic chicken. I also recommend you give the \"greek nachos\" a try. they are a new twist on nachos, and totally tasty."], ["Ann S.", "Great food. Love their nachos-very unusual. The only reason I didn't give them 5 stars is because of their hours of operation on the weekend."], ["Crimson D.", "Nice, clean restaurant with good food. The Shawarma is prepared well. Good food with reasonable prices."], ["Alex M.", "When i'm working from Sacramento and don't want some Mexican i'll be sporting this spot. I grab the beef Shawarma to go. It's a pretty big wrap with crunch lettuce, tomato, and onions. Pro tip - Grab the spicy sauce. Big serving, $8 meal in Sac-town. Definitely a solid lunch spot, not sure if I'd be there for dinner."], ["Blessed K.", "What happened to this place? Wow. I just paid $9.71 for a Beef Shawarma Wrap that was practically ALL lettuce inside. Had I eaten there I would have asked them to fix it, but I brought it back to my office. What a disappointment, when I kept biting into nothing but lettuce with small pieces of beef here and there. This place must be making a killing selling wraps with practically nothing inside but romaine lettuce. It will be a long, long, long time before I give this place another chance."], ["Carrie G.", "Wow...I love this place. I usually go around 11 for lunchPros: Great chicken or eggplant panini's. The combo plates are good too.Cons: The noon crowd can be brutal."], ["Kaelani L.", "DELISH! I have made many trips here for lunch. I am proud to say I am in love with Greek food. The food here is served fresh and fast! I love to order the Mediterranean Fries and the Cucumber Feta Chicken entree. I guarantee you will leave Crest Cafe happy and satisfied. Stop by now, what are you waiting for!"], ["Cindy K.", "Got the munchies after clubbin. This place is open late on Saturdays, super nice! However, the manager was not. So rude to me and twice in one night. He really wanted to 1. make sure we were ordering something before I could use the bathroom and 2. wanted us to finish eating soon as they were closing soon. Ok, the first I could forgive but the second time was just plane rude as there were 2 other full tables in the restaurant and NEW customers were coming in to order. JERK! Despite that horrible customer service, the food was delish. I don't know what they do to their lamb, but it is amazing! Loved the lamb pita. The good food almost made me forget what a horrible treatment we got."]], "Darna": [["Sarah S.", "Stopped into this little gem for lunch and was very pleased! Lunch Buffet was kept full, all the food tasted fresh and hot. Staff took used plate away quickly and though it cost about $15 per person it was well worth the price. I loved everything I had! Falafel was yummy and their chicken kabob was so flavorful. I also overheard some regular patrons asking if certain items were available. The waiter stated not today which excited me to know that when I return I will be able to experience different foods, and I assume those items to be good if patrons ask about it!Definitely stop in to experience Darna!"], ["Amal S.", "Very personable, hospitable, and kind staff. We were a family of 11, we had to wait for a while to be seated, with the restaurant being pretty empty. Food was very delicious, juicy, and perfectly seasoned. I loved the choices of different kabobs (kofta and chicken) we also enjoyed the roasted lamb. They had a live band that played oum Kulsum, Egyptian classical singer and a favorite of mine. Onto tea time and the Baklawa, which I have grown up loving and prepared frequently by my mother and my grandmother. This one by far THE BEST tasting baklava ever!!!! It tasted like an authentic original PALESTINIAN baklava, the filing was made from scratch using mascarpone type cream and corn starch (according to the owner's wife).The only thing, I think they're a bit on the high price. $25 for 12 and older. I think $20 is the perfect price. Regardless, I can't wait to come again in the near future."], ["jeremy t.", "This place is definitely worth the try if you are about to get into middle eastern food. You can try a lot of variety without incurring a huge cost. The hummus was pretty fresh and tasty. baba ganoush was also on offer as well as several kabobs, rice, Tabbouleh, lamb, chicken etc.On fridays they have bbq ribs. Buffet is around $14"], ["Alex T.", "Knock knock, Kabob Who?!!, AYCE KABOB VIBE I have always dreamed of kabob for all you can eat, man i can never get enough when i order elsewhere Ala carte and only receive 4 to 6 pieces only with lots of basmati rice. Yes when i saw ayce kabobs, i was suspicious wondering how the quality would be like, so one way to find out is to try. LAYOUT It is a pay first, before you sit down and eat, because of the neighborhood i guess. The entrance is greeted with some nice poles, and bright floors which reminds you of a greek environment. Nice waterfall wall along the buffet food area. Lots of seatings, for large and small parties. There is a soda machine, where you can help yourself when you purchase the all you can eat. The location is right in the corner of the light rail, on k street, next to insight and buds sandwiches. Parking would be hard, but there is parking garages nearby or park on j street with the meters. PRICE As of September 10, 2015, lunch buffet is $13.85 with tax included it comes out to $15 for lunch. Yes $15 for lunch buffet. I think it is worth it for kabobs, if your a meat lover! FOOD Chicken Kabob - juicy and tender, and just cooked well with a char grilled favor. I wouldn't have thought the quality for a buffet would be so good. Beef Kabob - You can definitely see herbs mixed in with the ground beef. The beef tasted like hamburger meat, and not much herbs flavor in it, but yes you see lots of green herbs mixed in though. I do prefer the chicken kabob any day. Eggplant - this is a greasy dish. The non spicy eggplant tasted like an italian flavor dressing. It was different and good, but just a bit too oily for me. Hummus - this was just an average hummus, can't go wrong with this. Nothing to special like in flavor or anything, but it is pretty good with the pita bread offered in the buffet :)Yellow Rice - This did have some flavor in it. Light and fluffy, kind of reminds me of a quick ten meal cook up kind of yellow rice. I didn't find it too authentic in  the flavor inside the yellow rice. Basmati rice - the presentation does look like its fluffy and mmm. I did find some hard or uncooked grains in some bites, might of been dried up or something. But i do like basmati rice, but finding some hard pieces was just ehh.... i like it fluffed.... Lentil soup - This was great. The soup was creamy with lots of lentil. The soup flavor was on the calm and bland side. Falafel - this was in a pretty good bite size. The outside is kind of hard on the outside and kind of dry in the inside, i didn't attempt the second round of plate.  spicy eggplant - Yes on the more oily side. The eggplant was not spicy, but more on the mild side. I did like to mix this dish with the 2 kinds of rice offered. cucumber salad - This was refreshing mixed, which is a great all around dish and perfect for the summer and spring. It had a light italian dressing mixed kind of flavor in it. roasted squash / Zucchini- This was my favorite. Yes i love my veggies roasted and yes it was perfect! so good and just on point with the chicken kabob and rice. SERVICEThe only service you get is when they come and fear the plates. They do ask if you need anything else or have any questions. They do like to interact with the customers and ask if it is their first time or not. Friendly staffs here. JUST A NOTE Don't go to a buffet before an interview or work, because food coma is real, lol... yes oh man was i stuffed and couldn't move. i needed someone to roll me out of there. I can feel my pants getting tight, and my button up shirt popping out. lol"], ["Aleeta P.", "Everything looked delicious and was very appetizing.  The workers were very friendly and the place was filled with customers.  The buffet had numerous dishes, both vegetarian and non-vegetarian. Lentil soup, spicy eggplant, falafel, chicken and goat kabobs, beef ribs, and 2 types of rice among other things.  Once I finished eating I needed to be rolled out of the restaurant (it was quite embarrassing).  Other than that, everything was wonderful and my Mediterranean buffer experience was very positive."], ["Brittney K.", "Darna definitely stays true to the reviews as a lunch spot...as when we came in for dinner on a Saturday night, it was close to completely deserted!We didn't let this bother us, however. Perusing the dinner menu, I noticed that most of the entrees were quite pricey and decided to go for the beef shawarma sandwich ($9) with fries (extra $2) instead. The sandwich came stuffed in a nice little pita pocket, which made it less messy to eat than if it were a traditional two-slices-of-bread deal. There was a hearty portion of beef and the flavor was quite tasty. The fries were thick, hot, and delicious. I almost wished there were a bit more but I was still left reasonably full afterwards.The shawarma sandwich seemed to be a way better deal for the price than the actual dinner entrees that a few members of my party ordered - the shish kabob and moussaka both came on nicely presented plates with rice but there didn't appear to be that much actual food for the amount that you were paying. For a similar price, one could come in at lunch time and eat way more at the buffet! Service was not bad, as we had our water refilled regularly and our waitress was friendly. Food came out quickly. The decor was interesting, with the glow of a green light over the buffet in back and a large television screen in front. Although we were fairly lonely with few other patrons, the space was large enough that it didn't feel too awkward. They also have a display case with yummy-looking desserts at the entrance...oooh so tempting!Overall, while very quiet around dinnertime, Darna is not a bad downtown option if you're in the mood for some shawarma and want to grab a drink on K Street afterwards!"], ["Alan X.", "Eh, I'm not really a fan. We came here to grab some food before going to watch a movie since it's not too far away. Arrived on a saturday at night and there was pretty much no one there. The food was pretty good, I got the beef kebab but it's just too expensive for what it is. Considering you can get a sandwich for $9 or a plate for $19 there's quite a disparity there. I would be much more inclined to go for their lunch buffet if I could that way I could sample more things. It just feels very disjointed. I can't tell if they're supposed to be a nicer sit down place, or more casual. From their website and everything it seems to play it up as more upscale, but my experience was anything but. The food was well seasoned and very flavorful though. Just wish the price was more consistent to reflect the overall experience."], ["Yixuan Z.", "This is a very nice Mideast restaurant. I went for its 15$ buffet. It has a variety of dishes. I enjoyed several classic Mideast salads, chicken kebab, and falafel. Most customers are the managers working around this area (u can tell from their shirts). The coffee is good, deep roasted beans but not much acid.If they heat up pitas a little bit would be better.If they provide lamb kebab would be perfect."], ["Jessica S.", "We got here at 11:15 and the door was locked. We waited and an older guy finally came and opened the door. While paying, my S.O. asked if they opened at 11 (we thought maybe it was later and we'd misread the website or their hours has changed or something). The guy was really curt and unfriendly and said, \"Yeah, 11\" like he was doing us a favor by letting us in. Not a good start. So, for 2 people, it was $30 which I think is absurdly expensive for a lunch buffet. Especially considering the selection is pretty limited. The baked chicken was pretty good, as was the labneh and the hummus. The pita bread was awful - clearly out of a bag, a little bit stale... The smaller pieces of chicken were really dry, and so was the falafel. Just, overall, it was mediocre for $30. I was pretty disappointed."], ["S B.", "Went there for lunch today. This place is AWESOME!!! A 5+ stars restaurants based straightly on their food ratings. All meats are super juicy ~ one of the best juicy kabob I have ever had!!! Chicken meat is very juicy also. They served beef ribs on Friday lunch ~ Oh my goodness!!! They are the bomb!!! Great meat, juicy and awesome bbq flavor. Very good hummus and eggplant dip, although their pita/naan is only ok, and too much dressing on their salad. With the amount of great and yummy food in that restaurant, it's definitely worth 5+ stars!!!Price wise - it's decent since I got beef ribs today. hahaha.EVERYTHING I had tried was so yummy in this restaurant. Highly recommended this place."], ["Vladimir G.", "Can I give this place 6 stars?Was planning to check this place out for a long time and finally the opportunity had arrived. So, our group of 6 co-workers headed to the spot. It was pretty busy during lunch on Friday, but we were seated in a timely manner. They have variety of plates from hummus, sour middle eastern salads, appetizers to BBQ halal beef ribs (served only on Fridays), chicken and beef kebabs. Everything was so delicious that at the end of my carnivorous feast I had a big happy bbq smile across my whole face due to those bbq beef ribs. Their chicken kebab is made of chicken breasts and I am usually hesitant and prefer thighs over breasts due to the fat and juicy factor, but their chicken breast kebabs were not dry at al, but instead - juicy and flavorful, and by far-the best chicken kebabs I have ever tried. Price includes buffet and a soda, and you have to pay for extras like desserts, etc...P.S. The service is very attentive and the empty plates were removed quickly. Definitely \"I'll be back.\""], ["Tammy S.", "I came here for lunch for the first time and for me, it was a mixed experience.ProsLots of delicious food options on the buffet - seriously, the food was great!Dining area was spacious and cleanThe people seemed quite friendlyConsMany dishes on the buffet were severely depleted - they were having a hard time keeping even the basics, like pita bread, hummus & falafel stocked. Empty pan syndrome!Beverages are included in the buffet, but their iced tea machine was broken. How hard it is it to brew some tea over ice and serve it in pitchers? My only choice was soda, which I don't drink$15 is a lot to pay for a buffet that they couldn't keep stocked and had limited beverage offerings. I waited for over 15 minutes for them to bring out more pita bread & hummus!Were it not for the actual AVAILABILITY of the delicious food, I'd love to be able to come back, but based on this experience, I have a hard time recommending it, not knowing if there will actually be any food available to eat. It's a bummer because I feel like this place has a lot of potential."], ["Moozhan T.", "We were going to have lunch at Bud's, but as it was a rainy, stormy day, Bud's was closed, so by complete chance we ended up at Darna.  Let me tell you, the food is 3.5-4 star quality, but I felt that $12.95 which comes to a little over $14 was a little too high for lunch buffet.  Otherwise, this place is totally worth a visit. I think you should order things off the itemized, ala carte menu to get a delicious value meal. I tried most of the items in the buffet, and almost everything was cooked perfectly, and was nicely seasoned.  I'm pretty sure I'll be back soon enough!"], ["Jim K.", "I had a wonderful buffet dinner at Darna last evening. The food was very tasty and well prepared. I spoke with one of the family that owns the restaurant and much of the food is Palestine based, but it also offers other middle-eastern style dishes. Lots of flavors and textures to try, which included lamb, beef, chicken, vegetarian dishes (including a cauliflower dish that was both a pleasure to look at and good), salads, hummus, pita bread, a yogurt dip, and more. They even had a dish that apparently consisted of bread with cheese on top (at least I think it was cheese). The ambiance is somewhat sterile, so this is not a good place (in my opinion) for a romantic dinner, but that was not off-putting in the least since the food more than made up for that. The staff answered by questions very professionally and offered some really good information. My only real issue is that their website lacked some key information, such as that on weekends they apparently only serve buffet style. But otherwise, it was a wonderful meal for a reasonable price. I will definitely go there again and recommend it to my friends."], ["Kristi B.", "I preface this with I set my falafel standards high. I spent a year abroad about 20 years ago at a university that edged Tahrir Square and I would eat falafel (Egyptians call it tamaya) almost daily,  at this barely there hole in the wall,  hot crispy patties, with a splash of tahina, topped with pickled vegetables. Within a handful of bites,  I would walk back to campus or my apartment in a happy falafel bliss.Today I was hungry at lunch,  the first three restaurants I visited were closed. The cashier invited me to check out buffet,  saying there were a few vegetarian options on it. I declined,  opting for a falafel sandwich to go, about $8. When I got back to my desk,  I was pleasantly surprised it came with french fries. While I loved the pickled vegetables and the yogurt cucumber dip and even the bread, the falafel fell flat. I  finished the french fries before I ate the second half of the sandwich. While I shouldn't judge a restaurant based on one sandwich, admittedly I am. On a positive note,  a few days ago I booked a flight to Cairo,  and while the most of the university moved to a new campus,  this visit to Darna reminded me that one of my goals is to see if I can find that temaya stand a few blocks away from Tahrir."], ["Kristian D.", "I am so glad that I finally tried Darna. These guys have transformed the former Farley's into a wonderful Middle Eastern restaurant and buffet. We had the lunch buffet with included a tremendous amount a good food for only $15 each including tax and soft drink.The restaurant is very clean and open with a nice modern Middle Eastern theme. There are lots of tables with open seating after you pre-pay your food near the entrance. The star is the buffet with lots of typical dishes - hummus, various salads, lentil soup, grilled meats, and fresh fruit. They have a standard menu as well for a la carte ordering.The food was fresh and plentiful, however some meats may take a while to refill since they are grilled fresh in the back. Everything was very tasty, and the whole group was thoroughly impressed. This is a great lunch spot for downtown workers and even before a night on the Kay."], ["Nina H.", "I stopped by here for a chicken shawarma sandwich one day and it was pretty good.  I didn't know it came with fries, but it did and those were good too.  I came back here a while back for the buffet.  The food in the buffet was pretty good quality for a buffet.  It was a bit pricey though.  But not bad."], ["Ron P.", "The Lunch buffet was amazing! It was totally worth it. Soda/tea included.  Everything looked house made and Halal! The quality of all the dishes were excellent. I pretty much tried everything.  I wanted to try the Lentil soup but I was way too stuffed. I had the hummus, babaghounoush, chicken kebab, kefta kebab(ground beef), falafel, they even had moussaka - isn't that greek? Their menu describes themselves as mediterranean, is that the same as middle eastern? Anyway, I digress...There were sauces/appetizers next to the fresh lettuce salads I had never tried before. Really good and flavorful without being too over spiced.  The dining area was very casual and clean. This place would be perfect for an office or family gathering.I will be back!"], ["Kevin M.", "Went here for dinner on Friday night. Had the buffet with water, and was served a dessert item. The food and service was good. I was shocked when I went to pay. $27.95 for one person. That's right. $27.95!!!! I still can't believe it. Won't come here again."], ["Shelby L.", "Amazing!!! Food is delicious!!! My friend and I wanted to try something new and we were impressed!!! Delicious flavors we will definitely be returning!!"], ["Fatima W.", "Ended up here after wandering around downtown for a place to eat with the hubby. We ordered the mixed appetizer and got a variety of delicious dips , spreads, and salads with a delicious fluffy pita bread.I got the mixed grill kabob plate and my hubby got the chicken sandwich - both were tasty and cooked to perfection.We also took home some truffles and baklava which did not disappoint."], ["Alex L.", "An update after a second visit a month later: I came in this time on a far less crowded day (the 5th of July...as if anyone wants to work after celebrating freedom in excess the night before) and found things were running much smoother than when they first opened. The buffet was full of wonderful goodies and quickly replenished  . The staff were attentive and helpful. The odd extreme sports compilation that was playing on loop on all the TVs last time was replaced with the George Zimmerman trial (I don't know if that's better but strangely more appropriate for a customer base that consists mostly of government employees).My only peeve was when I noticed they were out of Diet Coke and informed the employee, only to be assured that yes, they were out of Diet Coke. I wasn't telling you for reassurance. I was asking for you to replenish it."], ["Mahmut A.", "Today I invite my friend for lunch so we had a open buffet which I recommend everyone. It is one of the best open buffet in California it is good for all purpose"], ["Mustafa S.", "The best mediterranean restaurant I ever experienced in sac. The environment is awesome."], ["Michelle S.", "It was a lovely lunch buffett and very gracious hosts. I was hoping for real shwarma on the rotisserie but they hadn't got that far quite yet. The lunch buffett had a nice variety but I loved all of the different salads. Finished off with coffee and baklava."], ["Abir H.", "My mom love taking me here everytime I'm home. This is my third time here, and I cn say that it's just as good as always. We came here for lunch and got one to go plate for my dad, who was stuck in a meeting. You can't beat the quality of the food for the price, as someone who is middle eastern, I can say the food is very authentic. I got the baba ganoush, the labinah salad and the hummus. They were all very yummy, and after my failed attempts at middle eastern sides, it was nice to actually try one that tasted good.I also tried the tri-tip, the eggplant, veggies, and rice, all of which were delicious. My favorite was the tri-tip, it was cooked well and not too dry. They also have kabob chicken, kabob meat, falafel, and grilled veggies. A lot of options even though the buffet is small!I wish the dessert was included in the buffet price! In the buffet they just have some fruit. However, it was an overall good meal, with very friendly staff."], ["Ibrahim A.", "Wow is all I have to say! Being from the middle east, I have high expectations for restaurants claiming to have authentic mediterranean. Darna surpassed my every desire! The food, the atmosphere, and the staff were all exceptional! Went for their lunch buffet today which was also their grand opening. At 12.99 for all you can eat, and I mean all you can eat! It was great. Hummus, tabouli salad, falafel, chicken and beef kabob, and REAL shawerma on a rotating spit! Haven't had better tasting Mediterranean since being in the homeland! I highly recommend this place to all!"], ["Paloma P.", "They have a great lunch buffet that is pretty pricey but definitely worth it.$14 for buffet and a drink.They have lots to choose from. The area is very open with a nice atmosphere. I usually go around 1:00pm and its usually pretty empty.The saffron rice is my favorite!"], ["Dave S.", "Another great downtown lunch option, although a bit pricey.I went with the lunch buffet, which after tax comes out to $14, making it too expensive to become a regular stop.  The buffet is very diverse, with a wide variety of vegetarian and meat options.  Everything was very tasty.  I was a big fan of the noodle beef dish and the falafel, and I thought the baba ganoush was a little oily.  My only knock on the buffet is that you don't have access to the shwarma, which is spinning around tantalizingly close to the end of the buffet line.  My friend who got the shwarma (buffet isn't the only option) said it was very tasty though.The atmosphere was pleasant, and it was very crowded, but we were able to get seats immediately.  The service was quick and friendly.The food is very good, although the price is going to keep it from becoming frequent stop on the K street food circuit."], ["Jeremy E.", "Their buffet is a little pricey but so worth it. I didn't get a chance to try their desserts which looked pretty tasty.The buffet has a lot of different features, recommend the marinated tomatoes, falafel, slow cooked meat ( the rolled meat is so-so). Their hummus, saffron rice, and kabob chicken are seriously the best in sac. Pita is clearly not homemade but who cares when everything else is that good. Personally, I like their grilled veggies too."], ["Robert Q.", "The food on the buffet is very, very good. There wasn't one thing that I tried that I didn't like.  I had lunch with a Lebanese friend. She said that the food was authentic and also felt that it was very good.  I will definitely return."], ["Angelique H.", "Every time that I passed this place, I've been curious to try it. So finally, I got around to try it when I had lunch with a friend. We both had the lunch buffet and all I can say is awesomely yummy!"], ["Kt P.", "Chicken Shwarma is the best Ive had in Sac.  Only downside is their hours.  A good option after your Friday/Saturday K Street affairs though"], ["Jame G.", "I really wanted to try this place out. I'll cut it short. Came here on a Saturday night and it was not busy. We sat for a while till someone acknowledged us. The restaraunt is clean and we'll lit but that's all that's good about it. My friend ordered shish tawok and beef shawarma. It took an hour to get our food.Shish tawok was ok but the shawarma was disgusting.  I don't like wasting food but I couldn't finish it. The meat had no flavor and the fries were not fully cooked and hard.  I was disappointed and grossed out. Will never come here again."], ["Michael C.", "Was in downtown for a meeting and co-worker suggested this place for lunch. Was a pleasant find. Lunch buffet is 12.99 including drink which I think is reasonable for the quality and variety of food. Place was clean and nicely decorated.Food was fresh (especially Salad/vegetable) dishes. Everything tasted very good. I think this is the best Mediterranean type of buffet in town. The young cashier/waitress was very nice and friendly and even gave our group free baklava samples. The only negative to the food experience was the beef and chicken kabobs were little dry. Oh, and the coffee they served was very good. If you work in downtown area, definitely try out the lunch buffet."], ["Nathan U.", "Awesome food and a great buffet of items to choose from!"], ["Christine C.", "This review is for the buffet. I went in on a Friday afternoon and it wasn't too crowded. There was never a line at the buffet. You go in and pay up front and then you choose wherever you want to sit.$14.02 for a lunch buffet is a little too much for me. The only buffets that cost that much (or more) are places with a bunch of seafood or \"exotic\" meats, and Darna only had one dish that was seafood-some deep fried tilapia. Nothing special, just battered and deep fried tilapia fillets. Other meats included beef and chicken. I was really disappointed that the shawarma wasn't included in the buffet! Another thing I wish they had was dessert! They have a display case of it in the front and it all looks so good, but it's not included in the buffet. On the other hand, drinks are included. I didn't really care for that though, since I typically drink water anyway.It isn't a giant buffet either, maybe 20-30 dishes? I can't remember exactly. Half of it was cold food, such as hummus, tabouleh, baba ghanoush, salad, and other dips/spreads. The other half was hot food, such as kebabs, beef ribs, moussaka, spicy eggplant, and others. Everything was refilled quickly.The quality of the food was excellent! Sometimes buffets lower the quality of the food but not here. The hot dishes were hot and the cold dishes stayed cold. Everything was so flavorful and had significantly  and wasn't overly salted. The one that that I'll take away from here was the quality of the food and how fresh everything was. I was very surprised by it.A side note-the buffet is HOT, which means the tongs are hot. I wish they had longer tongs! They kept falling into the food instead of sticking out, which means other people's hands had to grab for it, meaning they could have touched the food......"], ["Sam H.", "Amazing food! Great service & hospitality. Fresh and healthy salads. Always ready to respond to any request. Great for large events and small groups as well. I was never disappointed!"], ["Alan W.", "My gf and I had an early dinner there on Saturday.  As others have mentioned, it wasn't crowded, and the smaller dinner (I had chicken schawarma) was enough food and inexpensive ($10 including a salad).  My gf had the combination kebab ($22).  We tasted each other's food and agreed that everything was really good.  Nothing was less than first rate.  One block from the Crest Theater and free street parking after 6, too.  Also good service and friendly.  We'll definitely want to go there again."], ["bahri d.", "Oh man I didn't know that they re making buffet with so many items. First I walked in with my friend cashier said there is a buffet. So we just simply grabbed our plates and got our foods. All the foods re halal and so clean and fresh. It's like all you can eat :) I'm so glad to find place like that in Sacramento."]], "International Market": [], "Mediterranean Market": [["Mark S.", "nice choices for items that you do not find at the regular store.  staff not very friendly at all.  never mind, i will go buy food from businesses that appreciate me as a buying customer."], ["Fifi Y.", "Still coming back regularly for the same things noted below - but I've also discovered a few new gems in recent months:- Danish blue cheese in their cheese case: ~$5.99 per pound, super creamy and delicious! I just made mine into a Blue Cheese-Tarragon vinaigrette.-Giardiniera (tasty pickled vegetables): much cheaper than you can get elsewhere! -Baba ganoush: freshly made and found in the deli case, although they don't always have it, it's really good, also inexpensive at $2.99 for a container."], ["Janey Y.", "I love this shop!!  The people who work there are very helpful and they offer a huge variety of foods from all over the world.  The babaganouj was homemade and delicious, and they have the best fresh Feta in Sacramento.  They even have Cadbury's Flake from England !!! (I shall have to indulge next time!)  The only room for improvement is more pictures on your Facebook page please!!"], ["Elif F.", "I've been coming to this store for about 10 years now. I first met this lovely market when they were just down the street in the Filco building. Ahh....it is a lovely place. This place as all of your needs if you are hankering for all things Middle Eastern. I don't know why M J didn't have any luck finding any thing Persian there. I find it all the time. Most of the times I go there I bump into a lot of Persians. I also like the fact that the owners remember who you are and what you like and are willing to special order things for you if they are out of it. For instance, there is a lovely Turkish Soda that I found there once...and it ran out very fast, they special ordered it for me and called me the next week to let me know I could come pick it up. Any spice, cheese, meat, utensil, olive, grape leave, even fresh produce you could ever think of it here. I recommend this place to anyone looking for new foods to try. I bring all of my friends here and they always end up finding something they like."], ["Danyelle H.", "Nice people & REALLY good food!!!"], ["DeAnna H.", "After driving past this place a million times on the way to work I decided to stop in on my lunch hour. Their Jerusalem bread is the best and the different types of hummus in the back fridge are pretty awesome too. They have a meat counter and everything you could possibly want in here. The prices are very reasonable and the little guy at the front counter is friendly as can be. Next time you are in the area ..stop by.. Pop in and check it out!"], ["Nushie N.", "This place is good, but not the best. What can I say? I'm used to the markets in SF or LA that have everything, and are huge. This market has a lot of items that are hard to find, and are truly authentic. I was there for an especially important mission to create my Persian New Year Hafseen. Although I couldn't find a couple of things I needed, they certainly had a great amount of things I didn't need but LOVED and hadn't had in a while. I just wish there was an authentic purely Iranian market so I could have bought everything I needed in one place."], ["Holly M.", "I was recommended this place by a friend one day because I was looking for turkish coffee.  I called the place and was told they had it and had the ibrik I was looking for.The guy inside was very helpful and recognized me voice from the phone call.  He showed me everything I needed, made sure I knew how to make it and regaled me with stories of how his family makes and drinks it.And what a gentleman.  I had seen the wall of shisha and asked what his favorite flavor was and he handed me a jar and said it had a funny name but he like it.  The name was \"Ater Sex\".  I'm in no way easily embarrassed or offended but how courteous....just in case.I haven't tried any of their hookah stuff yet but intend to when my current stash runs out."], ["Mr T M.", "WOW, This is the place to be for all your mediterranean food. What I like the most about this place is very clean,organized, and the best part is they carry fresh meat where you can ask the butcher and he cuts what ever you like infront of you and the price is much cheaper than COSTCO. I met the owners and they are very nice , ready to help you in any way, also I noticed that they have been selected the best store in sacramento for this year in News and Review Mag.If you like Hookah, they have the most selection that I ever seen and the price way much cheaper any where else, also they give you a warranty on their Hookah for 2 years WOW!!!  You must check them out, it is my Favariot store , you must see to beleive."], ["George G.", "My roommate and i go all the way from Chico (about an hour 30 north of sac) to shop there. They have a wide variety of mediterranean foods, tobacco and household items that are priced fairly. The employees are very friendly, and more than willing to order things for you that they do not necessarily carry. def. very happy with this place!"], ["Julia N.", "Came here to get stuff for a potluck for a history on the middle east class. Was gonna make dolma from scratch, but lucky me they had a can of already made ones that was popular among customers. Bought a bunch of other cool stuff too, really cool store. My boss used to buy feta cheese from here all the time, and it's reall really good! Probably the best prices too, and fresh. Definitely a place to check out."], ["Tammy A.", "I love this arabic market! My husband is arabic and we are from the bay area, originally, where there are many more of these types of stores and I have never been to one that is so clean and well-stocked and with such friendly staff.....even when you are not arabic, like myself. Everyone is so helpful and knowledgeable. They even have a great meat and cheese counter and nice produce area, all with great prices!"], ["Ginny K.", "My Mother and I went into the store yesterday, fantastic! They had exactly what we needed for the recipe we were working on and more. I also love the Baba ganoush....yummy. They stock and amazing assortment of fresh items, pitas are great, as is the cracker bread.   Priced right and friendly staff."], ["IsTallerInHeels ..", "I will for sure be back. I like the variety that they offer and  the fresh baklava is yummy! . I also love the cheese and meat deli."], ["W. L.", "Fabulous selection, fair to modest prices, and a curiously friendly staff make this my favorite market for culinary and hookah needs.... off the beaten path, but worth the adventure!"], ["Mr Bolo B.", "they also have a box lunch [hot food to go] they dont advertise or have a menu, I didnt even know until I asked if they had any cooked food to go? it's a Middle eastern combo meal in a foam box for only $5.49!the box meal includes: chicken shish kebob, beef shami kebob, Basmati rice, middle eastern salad, Hummus dip, Flat breadI was impressed by the quality and the portion they give for such a low price, I would definitely come back to try more foods.they also have a halal meat butcher shop and a nice variety of imported foods.I also bought a package of Nammora middle eastern cake made with farina & honey, it was a little old & dry and should have been taken off the shelf, be careful on the cookies & cakes, not sure how long they have been on the shelf."], ["Lan N.", "Totally convenient, and the people are friendly (especially if you are new to the spices and brands, like me). Come here for the extensive hookah gear, breads, spices, and frozen vegetables! Yeah, my mom and I even come here for the frozen okra to use in our Vietnamese soups. Tens times better than Trader Joes or Whole Foods when you need those obscure ingredients for that special recipe.they also have a great selection of dried lentils and grains by the pound.Also, load up on the tahini you'll need for all that hummus making."], ["Bobbie B.", "Best buy for the money.  Best nan bread, pita  in town. They have good custormer serviice. Good variety of miidle eastern  food stuff"], ["Nicole E.", "I've been a customer at the Mediterranean Market since I moved here two years ago because I still have not found a better place! I was originally looking for hookah coals and they sell the best square charcoals (96 to a box) for $8! You can't find that deal anywhere else! Believe me I've tried! Once I saw that they a great variety of foods as well, the market also became my one stop shop for tahini and lavash (which you can't find at Safeway or anywhere else)! They have a large variety of tobacco too and their prices are right. I've searched elsewhere and I couldn't find better nargile prices. And if you do find those prices, most likely it's at a cigar shop and the tobacco is super dried out! I used to live by the school but now I live in Rancho Cordova and I still drive to the market because I love it so much!"], ["M J.", "Very decent middle eastern grocery store. I'm sure if you are of arab back ground this place has all the necessary food/beverage items. I was looking for Persian food, which they have a small section. They have a decent selection of fresh feta, olives, and deli meat. I'm a big fan of Bulgarian feta and very happy to find it here for a good price. They don't really have a fresh veggie section. I was specifically looking for fresh Persian sabzi and bummed that none was available. They also have misc household items, hookas, textiles, music, etc. again all catering to the arab and not persians. In summary, more than adequate grocery store for all your middle eastern wants, but for all us Iranians out there....still searching."]], "California Kabob Restaurant": [["Erick N.", "Pricing at this place is good and fair. The food could have more flavor. I had gotten the chicken, beef, lamb combo which is think is the most popular item on the menu. The salad and rice were yummy. The chicken was cooked good but lacked flavor. The beef had some spicy marinade on it but still lacked flavor through out. The lamb had some flavor in it but it was dry. I came here on a limb cause I was hungry and while my stomach was disappointed I think I'd rather go elsewhere for Mediterranean food."], ["Sandi S.", "Five stars for dine in and four for take-out.  Up until today, I have always gotten my meal to-go.  But today I felt like sitting down, relaxing and enjoying my meal.  I always order the number three:  chicken breast kabob.  It comes with a lovely salad and basmati rice.  Yummy.The reason I give the dine-in five stars is because you get a little plate of hummus with freshly warmed up pita bread.  When you take your food to-go, the bread is kind of cold and hard, only because it needs to be eaten fresh off the grill. The chicken is very flavorful and tender.  The salad is lightly dressed and fresh tasting.  The hummus is delicious.  Sometimes I get a large order of it to go to eat at home.  The rice in the to-go orders is a bit excessive; I can never finish it.  And I really, really, really appreciate and like the ice cold lemon water they put out for their customers.  Thank you!"], ["Steve M.", "What a great new gem in our neighborhood!  Had a chance to try several offerings recently when we just 'didn't feel like cooking'. I tried the ground beef Kabob, while my wife had the chicken/steak combo.  Both were excellent, cooked perfectly and tender.  The rice and side dishes were tasty as well.  My daughter had wanted to try the shawarma wrap, but sadly they were out.  She ended up with the chicken Kabob and it was just as good as my wife's.  She was ok with that, to quote her \"just a reason to order again soon\".  We also got a few pieces of their baklava and it was YUMMY!  Great to have a new spot nearby for fast tasty food.  We will be back."], ["Echosaisis C.", "Both me and the owner, watched a bellydancer get unwanted feeling up by a table of customers. The owner never said a word to the customers and barely apologized to the dancer, in fact asking her to dance more for that same table. I have this on video, no one can deny it. I found out later that the owner felt up another bellydancer at another restaurant. The food is ordinary. I will never recommend this place."], ["Krisna R.", "The best kabob place we've been so far. Was craving for shawarma since i got pregnant. Tried other places but its not really what i hoped it would taste like compared from the shawarma places i used to go back home in the Philippines. We ordered shawarma, beef and chicken kabob and we were not disappointed cuz everything tasted really good! Must try also is their pita bread and hummus. Owner and staff were so nice and friendly. And last but not the least A+ for cleanliness! We will definitely be back SOON!"], ["Kimberly G.", "Delicious and very affordable, authentic cuisine. Marinades for the chicken and beef are outstanding. Friendly service, appears to be a family business, which I always love to support."], ["Bianca C.", "I was totally craving beef kebab (koobideh) after my training one day and I found this place on Yelp. It turned out to be a small-ish fast food type restaurant in a plaza with a pretty empty-looking drinks fridge and similarly empty tables. But whatever. The staff was friendly and quick to complete the order. The food - kebab with rice - was really good for an okay price. It was served at the right temperature and wasn't overcooked or dry or anything. The only thing I would have liked would have been if I could have half rice / half salad like I usually got at my usual Persian place. But again, whatever. This place hit the spot for my food craving :)"], ["Chris M.", "Family owned and operated. I live right around the corner and the family makes some authentic Armenian kabobs.  Been here several times and the portions are huge and the taste is uniquely delicious. My wife requested it when she was in labor at the hospital with twins! I actually told the family when I picked up the food and they gave me 2 pieces of baklava as good luck. They have me as a regular for life:) I see a lot of complaints about waiting. Yes, you wait because they make every order, the same as a fine dining restaurant. It's not a fast food joint. People need to relax if you want to enjoy good food. I say go to McDonald's if you want fast food."], ["Veronica C.", "Ate at CKR on July 19th 2015: Everyone was extremely friendly. I dinned in and had the chicken kabob combo. They brought pita and hummus while I was waiting and it was yummy. When my food came out it looked so good and tasted superb! The flavor was great! I was NOT disappointed one bit, the portions were generous as well. If I didn't have a long drive home I would have had left overs. When I was ordering I saw Baklava!!! Baklava are one of my favorite treats! I didn't order it when I ordered my food just incase I didn't have room (of course I made room for it I was just trying to have a little discipline) so when I was all done ordering I went and ordered my yummy treat! Then again I was not disappointed. Needless to say I will be back. Thank you for such a pleasant experience."], ["Bky S.", "Amazing food, service is good, prices are good. This is a family run restaurant. Friendly atmosphere-my new favorite place."], ["Sean S.", "I've been waiting for 30 min for my food and I still didn't get it and some people came in after me and they already got served their appetizers and entrees. Way too pricy and when I asked a question about an entree size the lady had know idea what she was talking about and all she kept saying is I don't know.. Smh... Never again!! Way overpriced and really bad service..."], ["Michelle K.", "I stumbled on this place through Yelp reviews, and I LOVED it.  The owners are wonderful people.  I ordered the chicken kabob plate.  The chicken was tender and tasty, and the hummus was fantastic!  I loved the mint yogurt drink too."], ["Stacia P.", "Came here for lunch. No line, not too full and friendly people...just how every great review starts NOT! The food was good however, it took 25 minutes to get. Remember,  no line! Then the man; maybe the owner was yelling at his employee in a dialect I didn't know but somehow understood it wasn't nice, then his wife said to me \" could you go sit down?\" Uhh no, If i wanted to sit i wouldn't have gotten my food to go, plus i need you to know i don't have 25 min to wait for lunch during the work week! Long and short,  don't be in a hurry and sit down to eat,  maybe you'll get your food quicker."], ["Brandon L.", "This last visit I ordered the chicken kabob which was the #3.  The chicken was in cubes and it was juicy.  It wasn't dry at all.  Comes with the same thing as the other meals.  Salad on the side that consists of cucumbers and bell peppers.  And of course you get a side of rice with it."], ["Tim M.", "This is a hidden gem in Rosemont neighborhood - very clean and well managed. delicious food and friendly staff!"], ["Wilson V.", "The food is decently priced and it's good. Definitely a go to place if you're looking to grab some eats on the go. I recommend calling ahead because the meats are cooked when order so the wait time can be anywhere from 10 to 20 mins depending on how busy they are. On Sundays they are opened between 1230 to 1pm so keep that in mind."], ["Ralph B.", "We ordered beef and chicken kabobs and Arabian coffee.The food was excellent and a great value.We'll return for sure."], ["Lisa M.", "Best Greek salad I've had in a long time and there humus is great! Repeat customer for a LONG time"], ["Mohammed H.", "Enjoy hearty lunch here. The food was amazing, the staff is very customer friendly. Service with a smile...Chicken kabob + ground lamb kabob was superb.Special cheese kabob cheese steak is worth trying.All the meat is halal."], ["Habofanoe M.", "The freshest and the best hummus I have had in a very long time. Ordered the chicken kabob with rice and vegetables. Staff is extremely friendly. Locally owned and the quality of food shows it"]], "Opa! Opa!": [], "The Kabob House": [["Lynette T.", "OMG! Great Greek Food. Good service. Nice casual atmosphere. Totally recommend! Gyros, salad, rice, baklava were all delicious!! Very reasonably priced. Satisfied all the way around."], ["Jackie B.", "This Kabob spot is as good as it gets, seriously.The garlic chicken is simply amazing and I will be back to get it ASAP. I asked for no rice, so they upgraded my salad and made it a large! No other place has done that before! I also got a side of gyros and it was soooo good! I will most definitely be back. This place is ideal for carnivores like myself."], ["Justin O.", "Service good. Food not so good.  Gyros tasted like steak 'ems meat. Combo dish had no flavor. Felt my car wasn't going to be safe in the parking lot."], ["M R.", "I love their food. Actually had it catered to our office and the rice, hummus and kabobs were the best ever! The chicken and steak kabobs are really big and have alot of flavor. Loved it."], ["Phil Y.", "I had high hopes for the Kabob House.  My coworker told me that I had eat there.   I arrived at about noon.  I was in a hurry.  The server was nice to me.  I ended up getting the ground lamb lunch entree.  The ground lamb lunch entree comes with a salad, a ground lamb skewer, rice and pita bread.  After waiting a few minutes, I panicked and told the server that I needed to get my food to go.  The server did as instructed and packed everything to go for me.  30 minutes later, I had a chance to sit down and eat.  The Greek salad was good.  It was nothing special.  It came with lettuce, tomatoes, olives and feta cheese.  I dumped it after eating half of it.  Pretty good for a non salad eating person. The Ground Lamb and the rice came in a foam container.  It was more rice than anything else.  The lunch special came with only 1 lamb skewer.  It would be nicer if it came with 2 pieces of lamb.  I was a little disappointed with the Ground Lamb.  I have had better lamb elsewhere.  The rice was not very good.  The pita bread was good and thick, but, I don't think they make their own.  It probably is not bad for Sacramento, but, I've been spoiled by the many Greek places in Southern California.  Perhaps their other dishes are better.  2 1/2 stars."], ["Sean M.", "The salad and chicken were decent but the rest tasted like dry hamburger and plain rice.  Also I feel compelled to rate it so low because this cost over $30. Be aware of the competition in the city for restaurant food and realize there is better food for less cost at many other venues."], ["Liban M.", "Great clean place, love the food, taste of Lebanon and Greece  makes you feel at home. Staff is friendly and owner always has a smile on his face. A+"], ["LEIGH-ANN T.", "Not the best neighborhood but great food! Must try the eggplant dip, filet kabob and pistachio ice cream!!!!  Delicious!!!"], ["Helen B.", "The best garlic chicken kabob I've ever tried with the sauce made it more delicious.   The price is really good for the food that you get.  We were there for dinner time and very busy but all the staffs that worked there were very good in customer service.  Awesome place and sure to be back.  Highly recommended"], ["Nessa Christine V.", "Garlic chicken is hellllaaaa good. The garlic mayo is great. The tzatziki is so noms. The chicken was tender and for lunch they give you a great amount of food. The salad is great and the pita is sooooo soft and fluffy. I love this place! The service is so great too! We were served very well and very promptly. What more can you ask for?"], ["Joy J.", "This was my first time here. The food was not authentic. I'd say the hummus was the only thing that was tasty. The beef kabob did not have seasoning. The chicken had some seasoning and was cooked just right. But the dip was all mayo! Which to me, was completely disgusting. The mayo was a substitute for the Greek yogurt dip / sauce,  I guess.  The rice was jasmine rice. And it tasted like Asian rice. This was a total fusion place.  I should have read the reviews first but since I was craving for some Greek food, and this place was the first one that popped up on yelp for me, decided to hop in. I'm glad I did though. Above all, the service was excellent, kind waiters and very accommodating. My beef kabobs weren't cooked right and so they made new ones for me without a fuss, which was very nice."], ["Crystal T.", "This was my first time dining here .  The service was very friendly and attentive . The food came out very fast and was fantastic . I would recommend this place to others that are looking for an authentic Greek spot ."], ["Philip C.", "Came here the other day with my family. Wasn't too fond of the parking structure but the food was great. Its a small hole in the wall type restaurant. The host was also our server. The food took a little longer than expected but our waiter made sure we were cared for. She was very considerate knowing we have kids and always attended to our needs. Will most likely return when my family and I crave for any mediterranean foods."], ["John L.", "I came into the restaurant today after patronizing this establishment for over 20 years. I placed a to go order and showed up a little early to pick it up. It was late afternoon and it wasn't that busy; there were only three tables in the restaurant. The service I received from the waitress on duty was rude and uncalled for. I politely asked for a glass of water while I waited as was told, \"you're gonna have to wait.\" Clearly this employee is not a suitable staff member to handle the restaurant on her own. If she can't treat the customers with courtesy while handling a small amount of tables, maybe she should seek employment in another industry. May I suggest the DMV?"], ["Steve H.", "This place is great.  The staff is very friendly and the food is fantastic.  I wish they had a greek roasted potato option to choose instead of only rice but they still deserve five stars.  I personally love their pastitsio but no matter what don't leave without the baklava, its awesome!"], ["Calvin M.", "I give it 5 stars for the taste and price. the beef kabob we liked better than the chicken one. i do look fwrd to eatting there again"], ["T M.", "I've been a customer going on 15 years. This is one of my favorite places in Sacramento. It's affordable and the portions are large (leftovers for lunch). I've tried five other Greek/Mediterranean places in Sacramento and none of them have all of the elements that I enjoy at The Kabob House. My usual dish at dinner time is:-Marinated Chicken or Garlic Chicken with Rice-Hummus Comes with Pita Bread-I always order extra Pita Bread as it is delicious here!-I always have them bring out the squeeze bottle of their house marinade sauce, which you can purchase by the bottle - I of course have one in my fridge.Some of the other yelpers have complained about the rice being bland or plain, I think this is intentional. The flavor of the marinade and the flavor of the garlic butter are meant to be served with other mild flavors, this way your palette is not out of control. Personally I cover my rice in the marinade and I could eat that by itself for a meal (and have done so, since I often have leftovers).Like I said, I've been a customer for well over a decade so there have been plenty of opportunities for mistakes which is the only reason I've given four stars instead of five. I've never been to any restaurant that had the very best food and service every single time."], ["LY L.", "Soft music and no TV! Yay we all can have decent conversations at dinner.Pita bread: soft, warm, and delicious. They keep bringing out extra bread too. I was stuffed from eating baba ganoush  and pita bread.Baba ganoush: I couldn't taste the eggplant which was a little let down for me. It definitely was not the best I've had in this life time.Salad: fresh salad but the dressing was too tart and sour for my taste, I left it alone after two bites.Beef kabob plate: the meat was cooked perfectly and very tender. Rice was a bit bland and I wish it were more buttery.Service: excellent! Hostess and waitress were very attentive and gracious.If this review is based solely on service, I would easily give Kabob House five stars. I probably will come back and try some other items on the menu."], ["Jewls A.", "That garlic chicken is delicious! My favorite meal to order is their garlic chicken pita/sandwich it's so good! Only complain is not sure what is the difference between the small and large size other than the price since they look pretty much the same. But nonetheless delicious"], ["Megan S.", "The best Greek food around. Great owners and always friendly staff. Never a bad experience in 10+ years of regularly eating here!"]], "Anatolian Table Turkish Bistro": [], "Formoli's Bistro": []}