{"Siam Restaurant": [], "Boon Boon Cafe": [], "Asian Cafe": [], "Thai Spoon": [["Angela C.", "I'm so happy to find a new thai place in natomas, and this one is almost walking distance from my house! Even better. We have been here a few times so let me start with my favorite. The Tom Yum is to die for. It has that flavor that keeps you digging in and it's so fresh the flavor explodes on your tongue. The drunken noodles were fantastic.  We got beef for the kids and they ate the whole serving.  On our first trip we tried the pumpkin curry. I think it was telling that we finished everything else we've ever eaten here but barely touched the pumpkin curry. It had chunks of undercooked squash and just lacked in flavor. Our second trip we stuck with the Tom yum and drunken noodle but decided on the spicy red curry. It was definitely spicy. Not in a bad way but it was definitely something that warmed me up. I rolled my sleeves up pretty quickly after digging in. My only complaint this time was they left us by the door. Third trip more Tom yum and pineapple curry this time. Yummy way to get ready for the game."], ["Jaimee N.", "I want to give this place four stars, but there is something that stops me from doing so. The last three times I have been here the same thing has happened, and for that I cannot totally just let it go.Being in the industry, I pay attention to service. My pet peeve with this place is that they DO NOT come back to check on your refills. When I come here I get the Panang curry, and for me its spicy. I drink a lot of water. I drink all of my water. The last time I was there I actually had to get up and go over to the front where they keep the water and almost grab my own new cup before the server told me she would be right over. My word of advice is just to check on your tables a little more.Other than that I really like the place. I absolutely love the Panang curry and get it just about every time. I like that they serve lime with their Pad Thai. ; ) I also think the pricing is fine, especially with their lunch menu. The restrooms are very clean and the atmosphere is generally pretty nice. Except for when you are playing loud rap music on your break and it has cursing in it that the whole restaurant can hear. Kind of out of place for a Thai restaurant, but hey I understand. Do what you will with your own place. I don't really care, but I could see how other customers might not like it."], ["Rebecca C.", "I came here on a Friday night with my fiancé, super excited about having Thai food. After a minute or two we were not greeted and thought \"they need a minute\" so we grabbed menus and started perusing. After a few minutes of not being acknowledged we thought \"better sit down, this may take awhile.\" Presently, another couple walks in. They were immediately greeted and the waitress scanned the room for a table. My fiancé, seeing what was taking place, immediately stood up and said \"excuse me, we were here first.\" The lady glanced at him briefly, then looked back at the other couple and curtly stated \"there's a wait.\" The other gentleman replied \"how long?\" The lady replied curtly \"10-15 minutes\" and stalked off into the kitchen. Another five minutes crawled by and a single lady walks in. She was greeted immediately and seated in a booth. My fiancé and I looked at each other silently asking, \"did that just happen?\" After another five minutes we were escorted abruptly to our table and made to endure the coldest service I've had in a long time. Our waitress (the same woman who ignored us and curtly greeted the couple behind us), avoided eye contact with us the entire time. It was very weird. Either she dislikes couples or was having a bad night. Either way it was incredibly unprofessional. Did the food make up for the scorn? No. The Pad Thai was rubbery, tasted slightly stale, and had very little egg, and no peanuts. The Pumpkin curry on the other hand was delicious--which is why there are 3 stars remaining."], ["Sue V.", "Still a fan! We grabbed lunch here after the baby sister's graduation ceremony. Just in case others had the same idea, I called in a reservation as we walked to our cars. Fifteen minutes later, we were seated and looking at menus.The good:Service continues to be smooth. My dad spilled his water everywhere, and even though it was busy, they brought us napkins before we even asked.The dishes are consistently good. I got the pineapple fried rice which still wowed me. The sriracha fried rice is better if you have a spicy tooth instead. I don't, but I still liked it and it wasn't too hot. The yellow curry is well seasoned and creamy. I recommend it with chicken. We also got Pad Thai, which tasted delicious. I do like my noodles a little more al dente, but that's another cuisine and no one else complained.Good to know:The one disappointment was the tilapia dish. We assumed it was a whole fish, but instead it was a stir fry. Oh well, that's why it was only $12.95.Would I recommend?Yes, I always do to anyone in the area looking for a place to eat."], ["Wendy C.", "The service was quick and the staffs were nice. I would recommend this place because the food is really good! The chicken wings are the best and so is the pineapple fried rice."], ["Garvy S.", "Good food! The staff is very attentive and very patient despite my boyfriend's demanding mother. My favorite dish is the spicy beef salad. It didn't come out spicy to me, but I added more crush red peppers to my liking. I think its best to do that so everyone can adjust to the level of spiciness how they want it. Food came out super fast! I wasn't able to get the other food pictures like the drunken noodles because everyone was digging into. Everything i ate i enjoyed. I would like to try the boat noodles next if we ever come back to visit my boyfriends family. Even though there toilet wasnt working I still enjoyed it anyways."], ["Erin H.", "Food is pretty good, prices are mediocre, service was a little lacking.Split BBQ chicken, pad see ew and papaya salad with the bf.  Everything was good but I was disappointed to see regular broccoli (instead of chinese broccoli) in the pad see ew.  The chicken was pretty standard.  The best and worst dish was the papaya salad.  I loved it so much but it was way too spicy (and we got it 3/5 in spiciness).  I would come back just for the salad but would definitely get it milder.Overall, there was no wow factor to this place for me.  I do recommend sitting outside though if you can because it gets really stuffy in here and you will go home smelling like Thai food."], ["Kelly M.", "The SO, my mom and I went here the other day to find a place close to home to get some quick eats.We ordered the chicken pad thai, drunken noodles and the egg plant with seafood. All the dishes were great, the prices were reasonable AND the portions were gigantic. Please note, it's probably best to share a main dish between 2-3 people. I have been eating left overs all week (which I'm not complaining.)I have to knock down a few stars though for the service. They are nice, but forgot our soda, I had to walk up to get the check (I think they forgot about us) and then had to go up again for boxes. I just think the wait staff needs to be conscious of people sitting in the back of the restaurant, especially when they're not that busy."], ["Ebony V.", "Pretty good Thai food for the area. Prices are not bad at all for the amount of food you get."], ["Gabriel C.", "This place is by far the best thai restaurant in sacramento. The yellow curry is the BEST! I've eaten in SF, LA, SD, SJ, and in other parts of California, but dang, the curry is good. The pad thai was too sweet, but the pad swe is great!"], ["Sam T.", "I can't even begin to explain how amazing this place is. I have been to numerous Thai restaurants in my home town of Detroit; but Thai Spoon puts them all to shame. I started with the Fresh Roll which was cool on the pallet with a warm basil peanut curry dipping sauce = yum. I then did something I never do... Ordered a soup... Actually I was anticipating a small cup of soup, in which then I was going to order the drunken noodles because of the other positive reviews I read about them. Instead, she brought out a behemoth of a bowl of soup. It was the Sukiyaki soup and the flavor was fantastic with a some heat which I liked. (Not too hot though, and I'm a medium to mild kind of heat guy)Having a bit more time to kill here in Sacramento, I decided to order a desert. That's when she recommended the fried banana and coconut ice cream. Omg was it good. Enough to share, but it was just me; so I took my time and wrote this review :-)If you're ever in the area and like Thai food - look no further!"], ["Erin W.", "Got the lunch special pad something. It was dish of veggies chicken and juice lots of it.  It was like a mish mash of veggies, chicken, and soy sauce based juice combined like chow mein.  Nothing special and won't go back.  Shame that they chose to serve an undelectable lunch and did not invest time and effort into it. If they choose to offer a mediocre dish b/c its the lunch special then how can I trust that they will serve quality entrees and are more costly.  No freaking way will I go back when there's the place on 12th and I or Sawaddee (sic) or the place on J St near Dickeys."], ["Jai C.", "Excellent! We decided last minute to do Thai and so happy we did.I ordered the Avocado curry with chicken. Delicious! It was served with flat bread. So yummy. We also ordered Pad See yu (sp), spicy eggplant, and garlic chicken. Every dish was great. The prices were reasonable too. We will be back."], ["Regina W.", "I came on a Monday night by myself around 7 p.m. and was able to sit on the patio and enjoy a nice cool breeze.When I opened the menu, I was super happy to find that the vegetarian part of the menu is 2 pages long! For my appetizer, I ordered the Vegetarian Fresh Rolls which had a delicious filling with tofu, rice noodles, lettuce, basil, and mint leaves. The peanut sauce that it came with was one of the best that I've ever had--thick and creamy with a smooth and savory flavor.For my main course, I ordered the Vegetarian Drunken Noodle which came as a generous portion. This dish comes medium spicy, which is great if you like a kick to your food. The fried tofu had a good consistency and was marinated well in the sauce. Aside from tofu, this dish comes with stir fried wide flat noodles, egg, Pad Thai sauce, and ground peanuts. So yummy!On the downside, the service was a little too slow, but maybe they were understaffed that night.I will definitely be back!"], ["Steven L.", "My GF and I are new to the Natomas area.  Being the good Yelpers that we are, we scoured Yelps listing for Thai and it lead us to this good restaurant.Avocado Curry:  5 StarsWhat yummy goodness did I just stumble upon? seriously... I've had many iterations of yellow curry and why is this the first time I've had it with avocado.  Not only do I have an infatuation with avocado but this yellow curry tasted second to none.  The spiciness of the curry was a perfect balance of heat and additional flavor.  Also, the dish has a big portion size.Chicken Pad See Ew: 3.5 StarsNot saying this in a bad way but the dish was just average compared against other Pad See Ew dishes.  There was nothing in the dish that made it spectacular or horrible.  The dish was good and sometimes thats what you want your food to be.I'll be coming back to try out more dishes.  :)"], ["Kamie G.", "Thai chili in Elk Grove has always been my favorite place to eat Thai food until today!! I have been to many Thai restaurants and quite frankly, they just never make the cut. This place however, is AMAZING. I would have to say their food has better flavor than Thai Chili. This will definitely be a new place I will frequent."], ["Nana L.", "Food is pretty decent and their price is alright too. Since it's close to me, it has become the go to spot for asian food since north Sacramento don't have much asian restaurant."], ["Kalina L.", "Came here for lunch and got the pumpkin curry. It was delicious but a little on the saltier side. Didn't bother me much since there was plain rice to eat with.The Thai tea here is good too if you're craving for some!"], ["Janet M.", "Excellent food and great waiters and waitresses. Food was super good especially the avocado curry. A must eat at Resturant."], ["Dianna F.", "Downgraded my review from 5 stars to 3.Today jeremy wanted to treat me to my favorite type of food thai.   We went to thai spoon because it's nearby and the first time we went it was excellent.   This time I wanted to try my favorite, the drunken noodles. I love the spicy flavor.  The thai spoon version had zero heat and very little flavor besides some soy sauce.We also ordered this spinach dish.  Told the lady no tofu.  The dish came with tofu.  We sent it back and it took about 25 minutes for the dish to  come back.  Again the flavor was off.  This dish was supposed to have spicy garlic and chili.  I swear it tasted like beef broth and oyster sauce.Last time the service was impeccable.  Tonight the people in the last booth behind us never saw a waitress for 30 minutes, no exaggeration. I told jeremy I never want to come back."], ["Sabrina I.", "Pretty good size portions as far as the Chicken Pad Thai. The pork in the pork broccoli with oyster sauce was too rough to eat. Ambience was a bit awkward. No customer service conversation until the end when I mentioned it was our first time there. Looks authentic inside & tastes pretty authentic. :)"], ["Pinder S.", "I live up the street from this little gem & therefore I find myself calling in take out at least 4 times a month, if not more!Food is always fresh, hot & delicious! I like my Thai food spicy & Thai Spoon never disappoints! (pass the milk please) :-) Best Thai food in Natomas in my honest opinion. Be sure to check them out!"], ["Sandy E.", "Spiciness factor wins! Many Thai places cook for the shy American palette but this place knows how to add enough chili to make your mouth a happy fire. The dishes we got were spicy eggplant, green curry, avocado curry, tom yum soup, and panang curry. Obviously we love curry, and Thai Spoon makes theirs with lots of different vegetables! They add bamboo shoots, basil, bellpeppers, carrots, onions, and tofu, so you won't feel jipped in the slightest.I actually came here for lunch and dinner (in the same day!)--it was just that amazing!!! I'm a little embarrassed but then again, not really, because the food options out here weren't the most multifaceted. So what works goes!"], ["Dominique F.", "Great customer service. I made a reservation for 7 and it was ready when we got there. Love the ambiance. Dimmed lights and good food. Duck Fried rice is great and pad thai!"], ["TRACY R.", "I'm completely heart broken that the moment I move back to Sacramento, I find out that Bangkok Garden is closed and I'm forced to eat at Thai Spoon.  My bro and his GF assures the hubs and I that they're fast, good, and give plenty of food.  I don't know what they're talking about but I didn't get \"fast, good, and plenty of food\".The hubs and I came on a Friday night after work and this place was packed.  We had to wait to be seated and then wait for water and to order.  That's fine, I get that it's Friday and most young couples, families, etc, like to eat out on Fridays.  Too bad the hubs missed lunch and was cranky.  I tried to keep the conversation light and flirty to keep his mood positive.  We order the Beef Padsewew and the Thai Spoon Prawns with a side of white rice.  Once we ordered the food it did come out relatively fast.  The Beef Pasdsewew was just ok.  The beef was chewy, not tender at all.  It was like a large hard  bubble gum consistency.  The noodles were flavored well, but that was it.  The amount was just ok, but not too much.  Definitely a dish for just two people, so keep that in mind when you're in a larger group.  The Thai Spoon Prawns were really yummy, but you only get 12 prawns.  Keep that in mind when you're ordering and you're hungry.  We should have ordered a curry to be cost effective as opposed to the prawns.  We were satisfied, but not full. This Thai food was more take out/cheap mall Thai food than Restaurant Quality.  I guess I've just had better.  I know because we've literally been living off Thai food because of the move back to Sacramento. The search for amazing Thai food continues in Natomas."], ["Rupal S.", "I actually love this place. I am vegetarian and they have a ton of options for me.  And if you tell them you want it spicy they will make it spicier for you."], ["Apryl G.", "Today was my first time visiting Thai Spoon and the food was AMAZING!!I ordered the Papaya Salad medium spicy. The flavors has been the best I've had in Sacramento. I also ordered Sticky Rice with Mango which was a HUGE portion. Definitely sharable. I will be back for sure."], ["Raquel V.", "Been here before, the food is good but you get a different server every couple of minutes asking the same thing. They need to designate one server per table or coordinate with each other so that they don't become so anoying. Also, very limited selection of beer and wine. So, if you just want good thai food. It's ok."], ["Nina K.", "My boyfriend and I come here once a week, we always get the same thing, I HIGHLY reccomend the fresh rolls as an appetizer, the tom yom soup and the PUMPKIN curry. AMAZZZING! We aren't vegetarians but get tofu in all of our meals instead of meat since we noticed that the chicken at thai places can taste a little rubberish (we only eat organic food). We have tried several thai restaurants in the Sacramento, including Bangkok Garden, which used to be our favorite, but have ditched for Thai Spoon now for the afromentioned feast."], ["Crystal R.", "Delicious Thai coconut soup is hard to find in Sacramento. The Thai restaurants downtown stew their soup throughout the day and taste as if it wasn't made to order. Today was my first time at Thai Spoon and their coconut soup was amazing. Fresh and the shrimp was cooked to perfection. The flavors of their coconut soup had depth and will leave you wanting more!"], ["Melinda V.", "This place is one of my favorite Thai restaurant. Good service, good food and good portions."], ["Dominique M.", "What's better than turning a pumpkin into a jack-o-lantern?  Pumpkin curry.Yes, the pumpkin curry is THAT good.  I have tried several other curry dishes offered here.  The panang, yellow and red curry are all good.  Pumpkin is always a favorite and it is by far the best that I have tried at Thai Spoon.  The location is easy to find and easily accessible.  The shared parking lot makes for plenty of options.  The restaurant itself is quant.  The size is small and it's décor is simple, yet sleek.  The service is prompt, whether it be take out or dining in.  Everyone seems to be very friendly and accommodating.As far as the food, yes, the curry is the way to go.  Don't get me wrong, I haven't been disappointed by anything here.  They have great spring rolls, both fresh and fried  with healthy portions of sauce for dipping.  The sticky rice is good and served as a decent portion size.  The noodle dishes are simple, yet tasty.  The curry is definitely where it's at.  The portion sizes are generous and they pack the goodies, especially the pumpkin curry.  The flavor has just the right amount of savory and sweet one would expect from a good curry.  They aren't shy about adding big chunks of perfectly simmered pumpkin, tofu and other veggies.  Just writing about this stuff is making me hungry!Thai Spoon is a great option if you find yourself in the Natomas area and craving some savory sweetness in your life, or at least, in your belly."], ["Jigar V.", "Awesome food and very quick service, I ordered togo for 15 peeps and it was ready in just 20mins with no compromise on taste!Will stop by again for dine in!My favs: Drunken noodles and red curry"], ["Natalie G.", "I cannot say enough great things about Thai Spoon! I'm not from the area and discovered TS via yelp for a togo order on my way home from the airport about a year ago. Not really knowing anything about the areas offerings or restaurant's menu, I gave it a go. SO happy I did! Food:The avocado curry (and that fried bread that comes with!) and pineapple fried rice are AMAZING! Especially when eaten together. The lettuce wraps are quite delicious, too. I highly recommend the pad see ew, too. Service:Nothing over the top (this is NOT fine dining), but the staff are always prompt, courteous, and willing to accommodate. Bathrooms are spotless. Food comes out quickly and hot. Overall:I think my opinion is pretty obvious. I love it! I wouldn't take a first date here (ambiance isn't very special) but what do you expect at a strip mall? I am always looking for an excuse to head out to Natomas so I can eat here. So if you need a ride to the airport..."], ["Amy F.", "Delicious food and superb service that's why I give this restaurant five stars. My boyfriend and I came here for the first time and we order quite a few things off their menu.  To start off we had their papaya salad Laos style and also their duck larb. We were pretty  skeptic ordering the papaya bc we didn't think it would be good however we were proved wrong. I love that they offer Thai style papaya or Laos style. Our Laos style came out to be the perfect spice, tartness and dark in color like how Laos style papaya should be. Entrée wise we order their spicy beef and eggplant stir fry and their pork and bamboo spicy dish.  The portions were absolutely huge and delicious. We barely put a dent on them.  What I also like was the option to have brown rice or white rice. I had the brown while my be had white and again the rice portions were huge as well.  I also ordered their Thai iced coffee.  I enjoyed it bc it was not too sweet and kinda of bitter you can definitely taste the coffee.  The ambience was really chill and relaxing. We had two sweet waitresses who served us.  I would definitely come back again!"], ["Marshelle B.", "My finacee and I ate here last Friday and the food was very good, the service was spot on, and we will be making this a regular spot to dine. Our appetizers were Thom Kha soup, and pot stickers. My fiancee had the sweet and sour with shrimp, I had the drunken noodles with shrimp, both very tasty! Would highly recommend. Reasonably priced too."], ["Serge L.", "Thank you Yelp!  You have yet to let me down in my travels.Thai Spoon was a dose of deliciously fresh and delightfully spicy Thai I've been craving.  I kicked off my quick dinner with an order of Golden Bags.  These fried pouches of chicken-shrimp-mushroom-and onion tastiness were awesome, and came with an addictive sweet and sour sauce.  For dinner my charming waitress recommended the Pad Prig Khing (Green bean, bell pepper in spicy chili paste)...I was quite happy she did.  Fresh, bright and just the right amount of zing made for a scrumptious and light meal.Why are the best Thai restaurants always tucked into these unassuming strip malls?   Will be back the next chance I get!"], ["Sleezy S.", "Ordered here for the first time ever today, and by god it's delicious! The Red Curry Chicken is absolutely phenomenal I can't get enough, perfect place for a quick lunch."], ["Kimchi G.", "Pumpkin curry is so delish!! I love pad Thai but it was way to sweet :( There stuffed chicken wings was not happening either"], ["Janel L.", "Warning for spice level. We love our food spicy and 3 was a perfect spice.  Overall great Thai food. Come enjoy $2 beers during their happy hour."]], "Sawasdee Thai Cuisine": [], "Tasty Thai": [], "Lao-Thai Cafe": [["Lia V.", "I am writing this according to my first experience here. I ordered their boat noodle and papaya salad Lao style medium. Their boat noodle was delicious and portion was great. Same with their papaya. Their papaya was pretty good. Totally recommend to anyone who wants to try boat noodle.4 stars since it's only my first visit."], ["mui d.", "Red curry, was ok. stuff chicken wings was made nicely but lacks flavor. Drunken noodles was a huge disappointment, noodles tastes old and hard, bland flavors.There could be other dishes that's good and what their known for. But afraid of disappointment"], ["Molly P.", "I wanted to wait until I tried more dishes before I left a review of this place. Before I go on listing all the delicious details, I must say this place aside from south area market really touches home for me. The employees look like they are all family, and are at least speaking Laos, maybe Thai. (I have a broken language, lol) ANYWAYS, that doesn't mean I didn't learn my homeland dishes and what home made actually tastes like. The ingredients are fresh! Veggies are crisp and all veggies are accounted for in each dish. Example- larb, some people skip the garnish cucumbers, or lemon grass, or even mint, NOPE not this place! It's got everything, veggies I can't even name. and if veggies aren't your thing? Well how about the condiments, I want to believe they make their own chili oil, cuz, BAM! It'll hit you like they roasted the pepper under your nose. Table side fish sauce, crush pepper, even roasted ground rice. And my last real jump of joy? Is the smelly flavors that come from the fermented soy beans in the kasoy, the crabby black sauce in the papaya, the bitterness of the larb, and the boiling insides of Mr. Cow. Dare I say more? Well, maybe, MILD = MEDIUM SPICY. be careful at this place. ;')So on my list now with my advice, - lao papaya *MEDIUM is best- shrimp in a blanket *eat fresh not to go- beef larb *medium rare, is basically rare- angel wings *cheaper then most, and better- pad Thai *ask for more peanuts- kaopiek *get your veggies on the side- kaosow *YUM! I asked for more black soy sauce- tom keung nai *all the insides you can imagine, more then just tripe and liver #bombDOTcom- chicken curry puff *a little Americanized but yummy none the less, especially with that dipping sauce. More to come soon enough. ENJOY!"], ["MiLady L.", "What's with all the rave about this place?!? Their boat noodle tasted like store bought asian package kung-fu ramen... not good at all. Beef larb  wasn't all that great either, it was loaded with  seasoning and came with bunch of lettuce on the bottom and topped with so little larb on top which I think a total rip off for the price. 2 stars for nice waitress. No thank you! Will not be returning."], ["Linda S.", "This place has improved since my first visit and I've been back many times after. The waitress recognizes and greets me whenever I come in and I always sit at the same table. Some of the south sac peeps may be familiar with Yee, she is now their cook. Their papaya is much improved and the waitress definitely knows how spicy I like it and how to address that to their cook. Kapoon was very coconut-ty today. But it was okay. I would give 5 stars for service, food about a 4."], ["Nga P.", "I was looking for a nearby Laos/Thai place. Even though there are plenty of choices, I wanted to maximize my lunch break as much as possible. After going through all the reviews on decent food but slow service, I tried this place anyways! It never hurts to try! When I first walked into this restaurant, it was empty. So slow service was not a problem, and my server had time to refill my water as well. I saw the cook, YEE standing on the side. If you do not know YEE, you have missed out. She used to cook from her house, but she kept moving, so I couldn't keep track of her. I was ecstatic, and right then I knew my meal would not be disappointing. We order ka soy, and papaya salad. The flavoring of the food was perfect, but I felt like the food wasn't ass fresh as it could be. The noodles in the ka soy and papaya salad were hard. Felt like it was old or leftovers from last night.  Overall, I would come back. The proximity is super close to my work area, and food was decent enough to scarf down in 30 minutes."], ["Lucky P.", "If you are craving authentic Lao foods, this is the best place for you!!!!!  We ordered: $7.95- Lao style papaya salad $6.95- Tom Yum soup$8.95- Beef Larb$ - - - Pad Egglpant2 Thai teas and a side of sticky riceWe asked for medium spicy papaya and it was perfect. The Lao papaya was balanced- spicy sweet and tasty. The green beans and noodles were a nice addition.  The beef larb was true Lao style, I didn't even mind the tripe that was included. They were not shy with limes, fresh herbs and rice powder. The most authentic and best Larb I've had in a long time! Don't miss out on the tom yum and eggplant either. Everything we had was delicious and full of flavor. Only con is that we wished we had more room to try the homemade curry puffs!"], ["Kathleen N.", "I'm usually always iffy on trying fusion food places where there isn't really a prime type of food that they serve. Since this place serves Laos and Thai food it's hard to tell which one is their expertise. My friends and I took a gamble and decided on going the Thai route to satisfy our cravings. There were so many options to choose from which made it 3x harder to decide on what we wanted. We decided to have a family dinner--pad Thai, pineapple fried rice, papaya salad, and red curry. Pad Thai: really disappoint because it tasted like flat noodles tossed with tomato and fish sauce.  Nothing really special about it. My taste buds were definitely not happy. Pineapple Fried Rice: the pineapple fried rice may not have been the best but it was by far the best out of the four dishes we ordered. The rice was slightly too over cooked and somewhat mushy. Laos Papaya salad: one of my other favorites! the papaya salad was definitely spicy with just two or three peppers? I liked how it was bursting with flavor a. The only downside is that it doesn't come with any mini crabs ( or is it called dungess crabs?) There was legit only a single claw of the crab. Now whassup with that? Red curry: it was sad and booboo. It was initially slightly too salty so my cousin told them and they brought about another red curry but it just felt like they added some Walter to dilute and lessen the saltiness. Overall this place was okay. I, myself, probably wouldn't come back here anytime soon..but the employees here were friendly and nice so that's a plus"], ["Ling S.", "Ordered papaya salad, kasoy, and boat noodle to -go...all mediocre. Probably will not return. Papaya salad: The noodles were bad (soggy and slimy)...had to throw out the noodles!! I ordered 2...one had bad noodles the other one was fine. The flavor was ok. Not enough heat. My husband ordered 6 peppers and it wasn't even spicy! Kasoy: Broth flavor was a bit burnt tasting (probably from the ground pork). The cilantro was brown and soggy. The bean sprouts were not fresh. It wasn't that good. Haven't tried the boat noodle yet (ordered it for someone else and was going to try some of theirs)...was a bit disappointed with the above items...not sure if I'll even eat the boat noodle."], ["Diana C.", "Small, Clean spot great service, generous portions. I also like how the menu has pictures of every item.I came here only for the Kapoon and I will say that it's pretty darn great it has a nice kick of spicy and coconutty plenty of chicken in it ( I got no pork blood in mine) flavor was yummy. I was so full and happy by the time I was done. I would for sure come back. I saw some other things like the fried chicken caught my eye I'm coming back.  I'm a Kapoon freak and Google everywhere in Sacramento I can get it this is by far one of the best among 1 other spot I love. I also had some of my man's dish he got the pineapple Fried rice and he said it was just as expected. I mean portion was generous took that baby home enjoyed it the next day flavorful and plenty of meat and veggies. Worth the try and enjoy good reasonable prices."], ["Spring W.", "I have been numerous times now and have not been disappointed with taste...however  only getting 3-4 shrimp in the pineapple fried price was not pleasing. To get extra shrimp 4 to be exact, cost an extra $2. I really feel that 6 shrimp is the right amount for the portion that is served...lack of shrimp won't deter me from going there though."], ["Nani V.", "Cozy little spot, I like that it's naturally bright inside. Upon entering my sister and I were greeted, service was excellent throughout our meal. I never had boat noodles, so I ordered that along with the papaya salad, 3 peppers. My sister ordered the Lao sausage, sticky rice, and chicken larb. We shared it all and everything was so good. The broth for the noodles reminded me of a stew, but still good. My favorite had to be the chicken larb, the flavors were on point. Another favorite was the papaya salad. I took most of it home and had leftovers tonight, tasted better than at the restaurant. I really want to try kapoon and kasoy next time."], ["Helen S.", "Food and service was great. The thai-lao dishes are all on point. They did forget one of our orders, however when I mentioned it, they made it right away. Overall, I would go back again and bring my parents."], ["Olivia E.", "Was originally planning on going to the restaurant next door, but decided to come here instead because I saw that it was new and wanted to give it a try.The papaya salad was perfect. They let you choose how spicy you want it. Service was quick and the owners are really nice.It's nice to see a place to get Thai & Lao food around Stockton where it's mostly Vietnamese food."], ["Nhu-Quynh N.", "I wanted to try this place out after all the raves.  South Area Market has always been my go to, but I wanted to support other locals if they deserve the credit as well.  Located in more of the busier plazas, but hidden on the far back side is a small Lao-Thai Cafe.  The ambiance was not too much of the culture, but it did have enough.  I would not compare the culture ambiance like I would some other Thai restaurants that I have gone to, but it was quite the typical.The customer service was superb, although our waitress was kind of more on the shy side; the manager was quite friendly.  Always ensured that you were provided with excellent service.  I like the fact that he came and tried to make small talk to get to know his customers.  Definitely on point with that.  That's what a lot of business lack, customer service. I ordered:1. Laos Tum Mak Hoong (Papaya Salad):  This papaya salad comes with the crab if any of you guys are interested in it like that.  I know it makes a different taste bud, my best friend loves her's with crab.  I actually prefer fermented fish all the way.  However, I must say, it was actually really delicious.  I still think South Area Market wins my heart on this one, but I wouldn't mind ordering it again here either. :)2. Laab Gai (Chicken Larb):  Ever since my old neighbor has made laab gai for me, I've been addicted, so I'm always looking for some good laab gai.  This one in particular was pretty good, a little more on the limey side, but I know some people actually prefer it that way.3. Meatballs (Boiled):  I'm totally a fan of meatball, just in general.  However, I never really understood why meatball was so special, because you can always get it from the supermarket frozen for your Pho.  I was told the meatballs were homemade, that's why they're special.  So I apologize for being so ignorant about it, but the meatballs were still delicious and definitely the way to go for a small appetizer. Overall the portions were huge!  The pricing wasn't bad either.  Pretty typical, but you are able to share.  However, the rice portion they give you for $3 kind of bums me out, but rice isn't that good for you anyways right?  No... I still would love me some sticky rice.  Other than that, I believe this place is a place worth trying.  Everyone's preference is different, so only you can be the judge of that."], ["Cilla C.", "First time here with my bf. Got the kaysoy noodle, klangfin, chicken larb, and meat balls + sticky rice. Kaysoy was blain didn't have much flavor in it. Klangfin was good texture just the pepper was not spicy at all had to put a lot of pepper. Chicken larb was really salty...salty. Meat ball is good like all other places. Anyways great service but didn't finish any of our food."], ["Phavandy S.", "The food was awesome. Taste very authentic!I ordered the papaya salad ( sweet & spicy ) came out perfect. Boat noodle is a must try, very comforting and rich in flavor. Also ordered the Pad Thai with Shrimp, it came loaded with shrimp and tasted delicious. Will come again and it's a must try if you love authentic Lao-Thai food."], ["Cece O.", "It was my first time trying boat noodles, or as my friend called it \"Laos pho\"...and boy let me tell you it did not disappoint.Boat noodles: -Broth: Packed with flavor! A little bit on the salty side but having the pork blood in there was a nice addition-Meats: My favorite thing was the meatballs. They were yummy..not the nasty cheap meatballs that you find at some other places. They also put pork rinds (yum!)-Vegetables: Everything was fresh and clean. I especially love that they put ang chai (I don't know the English word), which is one of my favorite veggies.Laos sausage: Yummy, but nothing you can't find elsewhere.Papaya Salad: Pretty good. There was a good balance of sweet, salty, and spicy. Overall the food was great. I'm only giving 4 stars because the service like others said was a little slow. They were very friendly and welcoming though."], ["Lila L.", "This was my first time here and I heard this restaurant was opened 5 months ago. The restaurant may be small but their food will make you forget about the size. I ordered papaya salad, red curry, boat noodle, and beef larb. And oh my everything was delicious!!! My best one was the beef larb. I can taste all the flavors and it's not bland like other Thai/Lao restaurants.  Also, I've tried so many kinds of papaya salads and from this restaurant, I can tell the papaya salad was made with care. Other restaurants would rush and you can tell by the taste of it. But the food over here is made with great quality!  The lady that serve me was very kind and she always filled up my cup. Every one should really try this restaurant. I would definitely come back again! The best Lao/Thai restaurant in Sac so far!"], ["Elle W.", "Originally we were going to a restaurant we frequent to order bun/pho. However the partner pointed out this new restaurants. After looking through Yelp reviews, we found out this restaurant was opened by Yee. Yee was one of my favorite places to orders Ka-Poon, Ka-Soy, and papaya salad. So I'm kind of bummed to not be giving it a 5 star rating.For food we ordered: papaya salad, Ka-Poon, Seafood Pad Thai, and Lao sausage.The papaya salad was not the same. Something about the flavor was lacking. Maybe it was the use or pepper flakes rather than the real Thai chili pepper that I am use to. In addition, there were these mini dried shrimps that were added. I like those little shrimps just not it papaya. Or maybe I have grown fond of papaya salad made at another unnamed location. The Ka-Poon was a little on the salty side. I did however like that it was not oily.The Partner wasn't too find of the seafood Pad Thai. I didn't try it with the exception of a piece of fried tofu which I found too chewy. The partner said it was lacking flavor. The Lao sausage was pretty good. I will have to come back and try again as the business just opened not too long ago. Maybe it was just an off day. I ran some friends and they mentioned it wasn't the same as before."]], "Lotus Thai Cuisine": [], "Bangkok @12 Thai Restaurant": [["David T.", "Grest service, friendly and attentive. Food met or exceeded expectations for good tasting thai food. Went for lunch, had dumplings and a spicy mushroom and beef with the brown rice. Portions are quite filling at a really good price."], ["Ashley C.", "From my understanding, the owners of Bangkok@12 also run Thai Chili in Elk Grove. I'm not sure if that's still the case, but if so, I have been wanting to try Bangkok@12 and compare them since Thai Chili is usually my go-to Thai restaurant. I ended up here with a friend for dinner after a nearby Thai restaurant was unexpectedly closed for the day. We were looking forward to unlimited Thai tea refills, which Bangkok@12 does not have. However, their cups were so large here that I could barely finish one. Upon entering I noticed about half the restaurant was filled, which seems average for a Tuesday night. However, service was slow on all aspects. It appeared there was only one server doing everything, from delivering drinks to taking orders. I spotted another girl but it looked like she wasn't doing too much up front. As a server myself, I automatically felt that lone server's stress and eased up on my critique of service. I wasn't too hungry so I went with the spring roll appetizer, which I've been craving for a while. They were delicious and fresh, although I didn't like the touch of mint. The peanut dipping sauce was one of the best I've had. I was able to taste my friend's panang curry, which was delicious! It was as good as the curry at Thai Chili. Normally I would give three stars for a place that was A-OK but wouldn't return to immediately. Their food was comparable to Thai Chili. However, I would come back only if I was in the area. Thai Chili remains my go-to location, simply because it's a closer drive. I'll definitely recommend either spot to anyone looking for tasty Thai cuisine."], ["Amy Y.", "Came here with the parents for dinner, I think it says 9pm closing time, but it's actually 9:30 just FYI. Ordered the pad thai, tom yum noodle, and the sukiyaki noodles.  They were all wonderfully delicious! Pad thai was on the sweeter side but still a good amount, the tom yum noodle has that spicy kick to it that I love, and the sukiyaki was actually quite delicious- almost like an egg drop soup type of feel with glass noodles- definitely getting that one next time!The pricing of everything was very very reasonable for the amount of food that you get, it is street parking but there's luckily no enforcement around the area after 5PM i believe so it wasn't too hard to find. Service was really good as well, they were attentive but didn't come around too often where it would be interrupting your conversations.  Overall a great place, decor is lovely, food is great, would suggest to others to try!"], ["Rachel M.", "We came here for a family dinner before going to see a movie at the IMAX.  I was in the market for a new restaurant to try and since this place was a 5 minute walk from the theater and had solid reviews, I decided to give it a shot.What I liked was that when I called to make a reservation, the person who answered was nice and attentive.  I made the reservation for 5pm on a Saturday, expecting that it would be busy and I should call ahead to make sure we get seated in time.  Well, when we got to the restaurant it was pretty much empty save for a couple of tables.  At first I was a little surprised but it actually made for an enjoyable dining experience since it was pretty quiet and we got priority service. We were seated at a cozy table close to the bar area.  We started with some appetizers (fried rolls and golden bag).  They came pretty quickly.  I've had both of these appetizers before at other Thai restaurants but these had their own twists and additions.  For example, the fried rolls had shrimp in them which was interesting but also very tasty and different.I went with my usual yellow curry for my entree but instead of adding chicken, I added shrimp.  The shrimp was really plump and juicy.  I've been to restaurants before where they'll skimp on the shrimp or it'll be tiny and flavorless.  There was plenty to go around and the ratio between the shrimp, potatoes, carrots, and onion was perfect. We all decided to order dessert as well (seriously, you can't go out for Thai and not get a dessert).  I got my usual - fried banana with coconut ice cream.  The banana was good although I was expecting more honey on top.  The ice cream was okay too but to be honest, I've had better.  I'm used to coconut ice cream that actually has shreds of coconut in it.  This one tasted very artificial and even had some sort of fruity aftertaste to it.  I wasn't to impressed with the dessert overall.  To sum it all up, this place has solid Thai food and a large menu with the staples as well as some new recipes.  I would come back again.  The service was awesome and the food came out hot and fast!"], ["Kyle O.", "Fantastic Thai food! Had the chicken pad thai and spicy red curry. This is about the best I've had. Great job!! I'll be back again."], ["Van W.", "I always get take out fresh rolls with Tofu, good lunch. People are really nice and quick service. Not a fan of their thai iced tea or thai iced coffee, way too sweet."], ["Qing S.", "Very bad service. The waitress was not nice， they just gave you a total price without details. Also the food was so salty! Won't come back again!"], ["Amanda C.", "Came here with a group of friends after we had our Tahoe trip and were on our way home. We stopped by for lunch and they were able to accommodate our 11 people party. I had the thai tea and it was delicious, but no free refills. I had the Tom Yum soup with noodles and it was perfectly flavored and the portion was pretty large for me. I was super full at the end. They gave a lot of noodles, so it was probably why I filled up quick. I also shared the appetizer of the angel wings with my friends, which were two stuffed chicken wings cut into pieces so we can share. I didn't think it was anything special, but the sauce helped a lot."], ["Anna H.", "Came here twice during SacAnime weekend since it was down the block from my hotel!The first time I got some dish that had fish with some stir-fried green beans and onions in it. I'm not too huge on onions but it worked so well with my meal. The sauce was extremely savory and it gave the green beans a nice taste to it. I just wish I remembered what the dish was called... :lThe second time I came here was with a really big group. I ordered the Duck Curry with a side of sticky rice. The curry was on point but I can't say the same for the duck. It was super chewy and tough. If the duck was on point, the meal would have amazing.Their menus are filled with tons of food in it. I wish I could order everything before I left Sacramento..."], ["Alyssa Mae C.", "Good portions and nice presentation!  We called ahead and ordered to-go, everything worked out perfectly.  The boat noodle soup and shrimp pad thai were both delicious, especially with the Thai iced tea!"], ["Elaine F.", "Always get the pumpkin curry. Always. By far the best thing on the menu!Been here a few times, usually get take out with T. Like I said, we always get the pumpkin curry. We've ordered the special salmon, drunken noodles and a few other dishes. Nothing lived up to the pumpkin curry. Until last time.We decided to eat in. Order the pumpkin curry as usual, and decided to try the Bangkok Bay seafood dish. Not only did we get more food then take out, each dish was spectacular! The seafood was spicy and had lots of vegetables. The curry was not too spicy but the coconut creaminess was stellar. A side of rice with these two specials cost less than $40 for an impromptu date night midweek.So glad that this place is right around the corner!"], ["Andrew P.", "I came here for a quick dinner after work. The food is very well prepared and the presentation is nice. I ordered pad thai noodles with chicken and a thai lemon iced tea. The only thing was the iced tea was very very sweet. Not sure if that is how it is. Overall a very good dining experience for a good price."], ["Jon Q.", "I enjoyed it here.  The dishes were a little bit different than other thai that I've had, which was good.  We had the pad thai, avocado curry, and the vegetable fried rice.  Pretty tasty.The pad thai was not overly sweet and had a nice tang to it.  The noodles were a little different than i'm used to -- very thin.  I liked it, but I think I prefer the thicker noodles.  The avocado curry was really good.  It was listed as mild, but had a litlte bit of heat to it. I enjoyed it and the people that don't usually do spicy definitely noticed the heat, but still enjoyed it.  the avocado was really different, but it was delicious.  The chicken and veggies in it were good as well. Over the brown rice, it was pretty damn good.The vegetable fried rice was just OK,  but it was enjoyable. It was pretty standard fried rice,  but a little on the bland side.  Everything was priced pretty fairly and the service was fast and courteous.  I would definitely go again."], ["Kay L.", "I travel to Sacramento for work a lot and got tired of hotel food so I decided to venture out and try Bangkok @ 12.  I ordered the Rad Nah with Tofu, walked to the restaurant, picked up my order and walked back to the hotel.  Finally opened up my togo package to eat dinner and realized that they forgot to give me noodles with my ordered noodle dish -_- so now I am stuck eating vegetables and tofu in gravy.  So minus a couple stars for the fact that I did not receive what I ordered.Taste was okay, not the best but decent.  If I had received my complete dish, I probably would have given this place 3 or 4 stars."], ["Molly P.", "I wish Americanized Thai restaurants would stop calling themselves Thai restaurants. Or at least rename the dish. That would be a lot easier. Do not order larb here. It's just steamed chicken tossed with minimal seasoning. You can't have larb with out cilantro, green onion, mint, pepper, and roasted rice. Who you trying to fool???!! So upset.Second, my pad Thai didn't have peanuts. That is seriously confusing to me. How do you not put peanuts. Unless someone else that night had an allergy attack for a messed up order. But I had 2 orders, both no peanuts. The nam toke smelled amazing, and it was medium rare. Thanks. But I asked for it spicy, it wasn't. And also it was way too salty. Too much fish sauce, and I love fish sauce. Also starting to realize, maybe they ran out of mint cuz it was inexistant here too. Then the tom ka gai, flavors and ingredients were there, but a little too salty. At least you had fresh mushrooms unlike other American Thai places. Also to note, I asked the waiter for pickled pepper to go, he gave me chili garlic paste. @_@ that's not the same. I should've kept the tip. Don't tip on to go orders unless they let you check the bags. Double knot = no tip. Anyways, I'm posting pictures.. you were warned."], ["Evelyn C.", "I stopped in here while attending a convention downtown and unfortunately, every table was full. However, I was quickly greeted and I was able to place an order to go. The waiter who helped me was friendly, answered my questions, and even offered me a glass of water while I waited. My food arrived after about 5 minutes and it was delicious! A word of warning, though, be careful when adding heat to a dish. I asked for medium heat added to my peanut sauce and it came out pretty spicy. I love spicy food, but if you don't then proceed with caution. Overall I was very happy with my experience and I can't wait to return when I have more time."], ["Lynn H.", "Get the fried ice cream! So good!Need I say more??? I loved this spot when it was Amarin Thai. So glad that they still have fried ice cream. I think I had ordered a specialty dish that was unique to Bangkok, but I wasn't particularly impressed. The red curry and the drunken noodles were standouts for me. Fried ice cream!! It was soooooooooooooooooooooo good! I really would love it more if it was vanilla instead of coconut ice cream, but it's still so good. They fry it with a nice crispy shell... The shell reminds me of funnel cake from the fair. Imagine that enveloping creamy, cold, and delicious ice cream. Your mouth watering yet??? Mine is!!!"], ["Victor L.", "Enjoyed the drunken noodles. A decent portion at a fair price. Food came pretty quickly too.I liked how the noodles were nice and soft like they were made that same day.  I think I saw a sign that says FREE WIFI on the window.  I'm not sure if there's a password or not."], ["Michee L.", "My favorite Thai Restaurant when I lived downtown. Best foods include papaya Salad and Grilled beef. They also have the best Tom Yum soup in Sacramento.  If you are there during weekday lunches, be sure to try their lunch special of the day! Pad thai is my favorite, which I believe is on Thursday. Plus they offer coupons.(Just thinking of the soup makes me want to buy some to help with my allergies tonight)"], ["Mei C.", "My favorite Thai place! We always get the curry puff and yellow curry, occasionally mango sticky rice for dessert. The curry is always flavorful that I end up eating more than I should have, but the portion is so generous i had never been able to finish the curry on my own! Even people who can't handle spicy food like me can enjoy their curry.Service is always nice and accommodating. I have been to a few other Thai places but always end up coming back to Bangkok when I crave Thai food!"]], "Thai House": [], "Thai Spice Restaurant": [], "A Bakery & Thai Food": [], "Thai Hut": [], "Thai Princess": [], "Sai Varee": [], "Bangkok Garden": [["Ida H.", "Every so often Joe and I will treat ourselves to a change of scenery, by getting out of the hood and driving to the other side of town to explore and shop.  But after fighting heavy traffic and rude drivers, we found ourselves placed with an unexpected amount of stressful shopping experiences to the point of being tired and hungry.  I was astonished at the many restaurant choices available beckoning to us!  We drove aimlessly around, trying to decide what we were in the mood for.  We finally pulled into a strip mall and narrowed things down to Chinese or Thai.  As we found a parking spot, CF Cheng's was the nearest place to walk to.  But when we entered, the place was packed and buzzing with so many people talking loudly, that I thought I would have an anxiety attack.  Joe and I realized that waiting for a table here would be another contributing stress related experience to add to our day.  We just wanted to have a calm, relaxing meal without having to speak loudly to each other in order to be heard. As we approached Bangkok Garden, I could feel the positive vibrations.  There wasn't that many patrons dining, but we were there for a late lunch and normally wouldn't expect a crowd at this off time of the day.  Our server May, was a breath of fresh air as she greeted us with a nice smile and pleasant personality.  Joe asked if she recommended anything on the menu (as he often does), and she immediately mentioned the smoked eggplant.  It sounded good, so we ordered that to share, along with yellow curry that contained onions & potatoes in coconut milk, fried Tilapia fillets and white rice.After a reasonable amount of waiting time, our food arrived!  My first bite of the smoked eggplant was just as delicious as May had described!  Even though the eggplant was topped with sauteed chicken, calamari and prawns in a chili sauce, there was still a crispness of ingredients which made it into a nice combination of flavors and textures that still managed to melt in your mouth!  The Tilapia and curry was just as flavorful!  Needless to say, our food was one of best meals I have had at a Thai restaurant!  I'm so glad we got to meet May and have a pleasant dining experience!  It made our impending and stressful drive back home a little easier to deal with.  Will we venture out to eat here again?  The answer is a resounding YES!  My compliments to our nice server and of course to the behind the scenes chef!"], ["Michelle L.", "Haven't been since it reopened in the Taste of Thai spot near TapEx, after closing its location near Bel Air (replaced by Thai Princess). Thai Spoon sufficed to satisfy my cravings during the interim. Was going to a Kings game with my officemates and when they deferred to me (Natomas resident, and resident elite Yelper) when it came to a good place to eat near the arena (that also accommodated vegetarian options), I immediately thought of Bangkok Garden! I was always a fan of their Bangkok Fried Rice (the curry and sausage are what put it over the top for me), and have yet to try their Crab Fried Rice (Boon Boon Thai's is still my fave in that category) but that'll have to wait until red tide is over. Their veggie pad thai is also one of my go-to dishes during Lenten season, and their seasonal curries are good too (pumpkin, mango)! We had reservations and were seated in the back near the aquarium. I like their setup now, instead of the awkward lack of seating area for to-go orders before, the counter is now near the entrance for convenient pickup without having to navigate between the tables of diners. Took awhile for the lady to bring us menus but after that was prompt with the drink orders. My observation is that the large size beer is quite large! Get the Singha. Wine by the glass isn't too pricey either, one person in my group tried the Chablis. I had the thai iced tea. I didn't get any refills so not sure if that would be free/bottomless or not. While the lady took our drink orders, the guy took our food orders. Since these were dinner orders and not lunch portions, a la carte I got the pad thai (chicken, tofu and shrimp). The rest of the table got the duck over spinach, duck curry, and the menu item called \"Spicy\" with vegetables/vegetarian option and steamed rice on the side. There was a little mixup with the last order (brought an eggplant dish with meat to our table by mistake) but it was quickly remedied without having to make a whole new dish, was just a plate brought to the wrong table, the veggie dish was done just not delivered properly. $10-$15 for each dinner entree depending on if you got a house/chef specialty or what. There were some newish items that caught my eye, like the curry pad thai. The entire back page of the menu is devoted to thanking Yelpers which was cute. Maybe because it had been awhile, maybe because the food was so good, but I killed that whole plate of pad thai. We were about ten minutes late to the Kings game but it was worth it! The Kings won too! Thanks Bangkok Garden for not suffering in food quality after the big move."], ["Stephanie T.", "I came here for lunch on a weekend and wanted a specific dish and they were out of it. :( My boyfriend and I ended up getting some other dishes that were good, but nothing remarkable. I was in the mood for soup and the full size Tom Kha with chicken was very satisfying and perfect for two people so start with.This isn't my usual Thai spot, so not sure if I'd come back here again for cravings. It was good, so it's worth a try if you're craving Thai in this area."], ["Jennifer N.", "FOOD- Yellow Curry Pad Thai: Pad Thai noodles with chicken, shrimp, fried tofu, and bean sprouts, topped with cilantro and green onions and served with a side of purple cabbage, raw bean sprouts, and carrots. The first bite was a little off putting. It tasted kind of sour and tangy, but it got better the more I ate it. 3/5- Basil Chicken: ground chicken sauteed with chili sauce and red and green bell peppers. This is one of my favorite Thai dishes. It's usually spicy and packed with flavors. To my surprise, there wasn't a hint a spice. It didn't taste like the basil chicken that I love. The overall flavor was good. I took it home and added peppers and it was perfect. 3/5- Shrimp & Pineapple Curry: literally just shrimp and pineapple in curry sauce. This dish would have been so much better if there were veggies and spice in it. The curry sauce was good. It was sweet and coconutty. It, too, was delicious after I took it home and threw in veggies and peppers. 3/5- Fried Banana Ice Cream: 2 pieces of fried bananas, drizzled with honey and confection sugar and 1 scoop of mango ice cream. Yummy in my tummy :) 4/5SERVICEThe staff were all friendly and attentive. 4/5FINAL THOUGHTSEverything I tried was decent. I would come back to try other things."], ["Joe K.", "FINALLY!  I got a chance to try this Natomas Landmark after drooling over reviews for at least five years.We had just endured the crowds and rude employees at Evangeline's Costume Mansion in Old Sac to buy Halloween costumes which was very stressful to say the least and we were on our way to another equally bad experience at Fry's Electronics when we decided to stop in Natomas for lunch.  I am not sure why but we attempted to go to CF Cheng's first only to find it completely overflowing with a crowd of people waiting for tables and the experience quickly began to escalate our already high stress levels even further.  Rather than settle for this uncomfortable situation, we decided to walk around the corner to Bangkok Gardens and we were extremely happy we did. The whole atmosphere was immediately calming (thank goodness).  The décor, the music, and not feeling like you were being stuffed into a cattle feeding lot (CF Cheng) were welcoming in such a huge way that I cannot even describe my feelings of relief with words.Then I started to browse the menu and remembered why I had not been to a Thai restaurant in years.  I am extremely sodium intolerant.  \"What in the world was I going to eat?\"   Luckily we had a wonderful waitress named May that was more than happy to help me with this horrible dilemma.  She pointed out dishes that they could reduce the sodium levels for difficult patrons like me.  We ended up having smoked eggplant and the tilapia fillets with the sauce served on the side so I could further regulate my sodium intake.  The tilapia was really good but the eggplant was heavenly.  I think I might have even heard harps while I was eating it.  Of course, that may have been some of the soothing sounds gently drifting from their speaker system.May was wonderful.  She made our day with her wonderful attitude and vibrant personality.  We cannot wait to return."], ["Jonathan A.", "This place is hella good! Decided to come here after my older cousin suggested it! The place is very traditionally decorated inside, reminds me of home.I got the panyang curry, Thai fried rice, and barbecue chicken. My favorite of the three choices had to be the curry. Holy smokes! This curry was so bomb. The coconut milk base is the best! I poured it over the fried rice and had a chicken beef blast. I personally wish the curry was spicier, but it was a great entree. The fried rice was good too. The barbecue chicken I wouldn't have gotten again, it's just ordinary chicken, but I put it in the curry and the skin was bomb dipped in all that sauce. Otherwise, I would have survived with just the curry and the rice. I had plenty of food leftover and was highly satisfied with the service. Definitely would come again!"], ["Mark Z.", "The food was 4 star but we had to wait to long. The explanation was that they had to serve a big table before us. I was hoping a manger to come and provide further explanation, that did not happen."], ["Jeff M.", "Love this restaurant! Amazing food! Great owners and staff! You always feel welcome when you are there. I have loved everything I've tried. I love the Beef Basil, Drunken Noodle! The Spicy Cat fish! I have been enjoying the food from Bangkok Garden since they were next to Bel Air and love the new location. Come in and you won't be disappointed."], ["Ilma D.", "The food is actually good ! Love their crab fried rice and spicy catfish..but the service was too slow. We had to wait almost 45 minutes and the main course spicy fish came before the Tom Yum soup that supposed to serve as appetizer. I hope they will give a better service next time."], ["Yao C.", "Best Thai food in Natomas!!! I want to say it's possibly one of the best in all of Sacramento but i need to experience more Thai food places!But hands down... Best in Natomas! We have been coming here for years and I finally got the chance to write a review!!! We experienced the old location and loved it because it was right next to bel air, Starbucks, and a yogurt place!! The new location is good... Next to tapioca express, get a cut, and CF Cheng! The staff here is awesome... Especially May, Chris, John, and May's father (the top chef)! They are a great crew and have excellent customer service! They are friendly, tell you what's good, and make you feel comfortable!!!! The food is hands down excellent!! Authentic, flavorful and a lot of selection on the menu!Our favorites: crispy chicken is awesome with white rice! The chicken is tender, juicy, and crispy!!! Yummy!! The garlic prawns is to die for.... Fresh prawns with the shell on with an amazing garlic sauce!! The prawns are so good you can eat the shell..... And the flavor is so garlicky it will stick with you for at least a day and a half!!We also like the spicy cat fish dish with mushrooms, bell peppers, and basil! It's the #48!The pad see ew is excellent! I get it with beef and no bean sprouts... Yummy!! The soft shell crab is excellent, the garlic fried rice is wonderful, and the mango sticky rice for dessert is great!!It's a must try!!!"], ["Rei H.", "My friend took me here a week ago and everything was delicious! We ordered papaya salad, garlic soft shell crab, yellow curry pad thai, crispy tofu, thai iced coffee and thai lemon iced tea.I was never a huge fan of thai food before primarily due to the lack of good thai restaurants where I lived, but coming here definitely changed my outlook! I will definitely come back to try more next time!"], ["Pam D.", "On a trip, and needed somewhere to eat before heading to SFO.  Panang Curry was good and fresh tasting, although I feel like peas and potatoes were a little out of place.  Came with a large bowl of white rice for the table.  \"Medium\" was the perfect level of spicy for this wimpy American girl.  Friends got green curry and drunken noodles that looked good.Service was a bit slow to take orders.  We were ready to order dinner when they came by for drink orders.  However, the food did seem to come out relatively quickly."], ["David C.", "Came here for the first time and was disappointed 1) Waitress was rushing us during ordering and was not being a good listener. 2) I always order \"Thai Spicy\", but when the food came it was extremely bland like baby food3) I asked for the spice level to be corrected and it was brought back to me with what appeared to be cayenne sprinkle over the topI thoroughly enjoy eating Thai food and know when it's of good quality. Unfortunately, I won't be coming back here again"], ["Oliver Y.", "Bangkok Garden is a staple of Natomas and is a solid choice any time you decide to go.  The owner is a local and you'll see him at the restaurant or at local Natomas places (like the gym). The food is delicious and if you're like me, you end up with the same tasty dishes every time:Crab fried rice.  Panang with Chicken.  Chicken Satay.  You can eat for a family of 4 under $30 with tip.There're still on Arena Blvd, but in a bigger venue by the Arena... not West of 80 in the Bel-Air shopping complex."], ["Nicholas D.", "There wasn't anything particularly wrong with the food we ate at Bangkok Garden tonight. It was fine. There just...wasn't anything particularly great about it, either. Take the tom yum soup, which we ordered with seafood. It certainly looked great when it arrived, with generous amounts of shrimp, calamari, and scallops. But the flavor was a big disappointment, totally lacking the sharp, pungent, spicy kick that defines a good tom yum. It was just a mild, vaguely tart broth with seafood, tomatoes, mushrooms, and onions. It didn't taste bad, but as tom yum goes, it was uninspired.We also tried the basil beef and the green curry with chicken. The basil beef was OK--heavy on the ground beef, with just a few token bell peppers tossed in--but the basil was more noticeable to the eye than to the palate, and I felt the beef was a bit saltier than it needed to be. The green curry was better, and it was also the most significant source of vegetables, with more zucchini and bamboo shoots than chicken. But although it was my favorite dish of the evening, it was far from what I'd call a great green curry.The service was very good. My water glass was never less than half full, and the food arrived quickly after we ordered. As a side note, none of these dishes was even remotely spicy. I probably should have specified when ordering that I do like spicy food--since I didn't do that, I'm not taking off any stars for lack of heat."], ["Crystal R.", "First time here. Restaurant setting is nice. Dined by myself. Service is horrible. Waited 10 minutes to place my order. Waitress asked me if I would like some water.... Still waiting for that. Took another 10 minutes to get my Thai tea this tastes great. Ordered an appetizer and drunken noodles, 20 minutes into my initial seating have yet to see either. When a patron comes into a business on a typical hour long lunch there is not much time to eat and get back to work on time without being late.........customers seated directly in front of me had to get their own to go boxes and their check because no one came to check on them.   Dirty tables all around me. Finally got my fried tofu it's average sauce is too sweet. I've got to be back to work in 20 mins.... Waitress just came up to me asked me if I still wanted my water?Lunch finally here and the drunken noodles with chicken is horrible... The chicken looks like ground hamburger meat... It's served on a bed if shredded lettuce  absolutely no flavor can't taste any basil jus horrible absolutely horrible flavor."], ["Julie W.", "We went here for din-din for the first time. It was not busy when we arrived and the gentleman who took our order (not Johnny*)was polite; however, being polite does not make your food appear. My gentleman's food came out first and half of my food came out approximately 10 minutes later. I had to fetch the other half of my din-din after unsuccessfully attempting to make eye contact with anyone who worked in the front of the house. I walked to the front to request the other half of my meal and wait staff walked by me without making eye contact (they weren't big on eye contact here). After getting someone's attention, Johnny was asked to bring me the rest of my food and he said my table hadn't been served yet. Au contraire, Johnny!!! My table had been served 2/3 of their food... 20 minutes prior. Glasses were emptied before we were asked if we would like refills and we had to ask for boxes multiple times. I highly recommend this place, if you have lots of time to kill and you like your food cold.* I feel as though I should clarify, Johnny was neither rude, nor was he polite. Johnny was just being Johnny."], ["Sheryll S.", "Place is cozy and i loved it, service is super slow, my husband and i waited for almost 30mins for the waiter to get our order and we waited for another 30mins for food to be served.The crew doesnt seem to know what they are doing, i couldnt say the food is superb and its worth the wait coz its totally not. Food was ok."], ["Jennifer D.", "BG is still slaying the food game. They are the nicest family and make such solid food."], ["Winnie T.", "Get the SHRIMP PINEAPPLE CURRY!They moved to this new location which is a bigger than their previous. It was my first time here when my local Natomas friends took us here for our early Christmas dinner. What a good choice!Here's a little background, they have been long time diners but it was also their first time at this new location. Not sure why but the owner had to move quite quickly. Glad they found a better and bigger location.They have lunch specials which I'm intrigued, maybe next time! We went around 7PM on a Sunday with a party of 6 and were seated right away in the back next to the fish tank. We definitely had our privacy as tables had a good amount of space between them.I got the Pad Ew Se with pork ~$9 as it's usually my default and it was good. But I regret not getting what my pescetarian friend got, the shrimp pineapple curry, it was SO GOOD!! Especially with the texture of brown rice. OMG, I want to go right now for it. My boyfriend tried the Pad Thai infused with green curry, literally pad thai with green curry. I don't like the texture of pad thai so, pass. I can't remember what my other friends got but everyone enjoyed their meals thoroughly.The only bad thing was, the waitresses didn't come check on us until the end, and I wanted water quite badly. Our orders did take a while to get to us, but I'm guessing it's because they just opened.The owner came out to greet and chat with my  friends, he was reallllly nice! Parking was easy as it's in a plaza. Would recommend, lots of diversity of customers."], ["daran o.", "Came here for lunch and the service was very slow and they were not that busy... Never brought my water and the table next to me also didn't get their drinks until they asked a second time.  The Pad Thai was just okay... Probably won't be returning"], ["Arlene L.", "Our favorite Thai restaurant in the area. Great food fast service nice place. Also if you call ahead of time they will prepare your food so when you get there it's a shorter wait"], ["Ann G.", "I chose this restaurant based on the great yelp reviews.  In the past we've had a lot of success doing this.  Sadly, we were wholly underwhelmed with both the food and service.  Our party ordered about 6 different dishes most of which were subpar in appearance, taste, and delivery.  The curries and some of the other items appear to be colored with artificial dyes and swimming in a pool of grease.  The soft shell crab was so greasy it was inedible.  The much raved about smoked eggplant is also fried first and very greasy without a lot of spice, despite it being rated as such.  The noodle wrapped shrimp were bland and the sauce on the side exceedingly sweet.  Service itself was adequate with only a few hiccoughs.  Our entrees took about 40 minutes to arrive with some taking up to 50 minutes which we attribute to some glitches in the kitchen.  They were pleasant enough about sorting out separate checks.  Unfortunately, that's not enough service to make up for the below average food."], ["Tiffany Y.", "After MONTHS of craving good Thai food they're back in business!! :D Same owner, same staff and same cook. Not sure the reasoning in moving but I like their new location. Parking is much easier compared to the previous location, although it wasn't a problem at the previous location, parking here is easy peasy. When you walk in, the area feels larger,  whether or not it seats more people, I want to say it does. When you walk in, the counter is basically in front. You no longer have to walk though to go to the back to pick-up your to-go order or to even place one. There is also a much larger counter space along with not having to worry about standing in the way of the staff. I also feel like the lighting in this location is brighter in the previous one. Service here is just as good as before. The food is on point. Keep in mind they don't have all the specials they use to just yet so be patient. So glad that they are back in business :D"], ["Cin S.", "The new location has plenty of tables. I'm impressed.  Also, there is no wait on a Saturday night at 5ish. I have to enjoy it before it gets busy. Around 6:30pm to 7pm, there is wait so it is better to come right when they open. Also, there are a lot of parking space.The service is quick. Waitresses and waiter are friendly, attentive, and sweet. Also, I see familiar faces from the old location.My significant and I decide to order tom kha, duck curry, and drunken noodles. The food is still good.  As for the decor, they have the same decoration as previously except in a bigger space. I do notice that they have more paintings. Overall, they still maintain a cozy environment when you dine in."], ["Fadwa A.", "Love this place. Food is good, staff pleasant and are actually happy to be there. Pan ke ew was very good. My favorite was the seafood soup which had a whole oyster in its shell in there along with pieces of fish, calamari and shrimp. I would go for the soup alone!!"], ["Nicole O.", "Love love love their fried rice especially the Thai Fried Rice. I also am a big fan of their Pad thai, tom yum, and red panang curry. I am always satisfied eating here!The waiters and waitresses are also very kind and polite. You really feel welcome eating there. A downside would be that one of our rice orders were late and also the dessert of fried banana ice cream but I think it was because the restaurant was busy. It was lunch on a Sunday afternoon. I work in food industry too so I know it can't be helped sometimes. Other than that, my family loves coming here! We might even choose this now over Thai Spoon since Bangkok Garden is much closer to our church."], ["Craig C.", "So my brother and I were waiting for a flight to arrive at the airport. We had some time to kill so we decided to get some food. He wanted Mel's (I of course didn't) so we settled on Bangkok Garden. First impressions were great, clean restaurant, nice atmosphere, and pleasant wait staff. I ordered the Pad Thai and he ordered Chicken Drunken Noodle. Both were excellent choices. Definitely some of the best Thai food I've had the pleasure of eating. I'm really glad I talked my brother into coming here. I don't live in the area but the next time I'm in the mood for Thai, I'm coming back."], ["Shelly T.", "Two words. Param Longsong. This is the best Thai dish I've had in quite some time. The food is so tasty here and the staff is incredibly nice. They show great care in what they do and it's reflected in their food. The place is small and the decor is nice. My only negative is that at lunch, service can be a little slow, so just plan for it. Otherwise.. tasty thai!"], ["Paul P.", "If you are thai food lover, this is the best restaurant in california. Must try and highly recommended.Food quality:- 10/10.Service:- 10/10.Location:- 10/10."], ["Joy C.", "Love this place! Never been disappointed. Favorite  dishes are crispy chicken and spicy catfish. I also enjoy the mango chicken curry. Basically everything is good here. Uba ice cream and fried banana is bomb too!"], ["Liz O.", "My favorite thai restaurant in Sacramento. Always great service and great food! I like everything ive ordered here, but my favorites are the green curry and the pad thai. I also love the tom kha soup here - best broth ive had!"], ["Janet L.", "Good thai food...Ordered 4 dinner style entrees between 3 people for lunch and ate it ALL....1. red curry - very good flavor.  ordered medium hot and it had the perfect amount of heat.2. fried catfish - supposed to be house special - i was expecting a whole fish, but it was little fillet pieces with some red peppers...our least fav, but still good.3. pad thai noodles - good amount of noodles with lots of fried tofu, chicken, sprouts.  Have a little bit of gripe for places that charge extra for rice.  Especially when we're not ordering off the lunch menu.  Dinner prices are more expensive, but looking around at other people's plates, it seemed like the portions were the same...the prices weren't - docked one star!"], ["Jenn R.", "Best decision of my life! I got the special spam fried rice (be sure to squeeze the lemon over it), drunken noodles (no meat, the cooked lettuce was weird but good), smoked eggplant (best dish ever!). Great service! And good thai teas too. Enjoy your meal, I know I did! :)"], ["Fe Y.", "I love this place!!! Food is great and tasty and the people are very nice. I brought my friends to eat here and they to agree that this was the best Thai food they ever had!!!"], ["noc f.", "We are soooo happy they are open again! The best thai food in Sacramento, hands down. Absolute best Panang curry, Pineapple fried rice (Bangkok fried rice) and Pad Thai u can find.I just hope that service would be a lot quicker this time around :) That's where the other star on this review is... Waiting to see if service is more efficient at this new location. Hopefully more servers to accommodate it's hungry customers. Happy grubbing!"], ["Shannon D.", "I LOVE thai curry.  I heard this place was the best in Natomas, but I have to disagree (so far).  I first went with the green curry, extra spicy.  It was good and they made it pretty spicy (ordered the \"extra spicy), but I've had much better green curry.  The flavor was slightly off...I can't figure out what it was.The service was good, the prices are fair and the staff was really friendly.I'll be back to try to panang curry...my second favorite. :)Update!  I came back to try the Panang.  It was delicious!"], ["Jon P.", "This is definitely my favorite Thai restaurant in Sacramento. Great food and excellent service. Chris always remembers me and my family, even what our favorite dishes are! Btw, I love the smoked eggplant, spicy catfish, and pad thai w/ yellow curry. If you've never been there, go now. I don't care if you already had dinner. Totally worth it."], ["rustykin s.", "Yeah, As usual, the food here. Service is a little slow, but only because they are pretty busy. There are 567 Thai food places in Davis where I live, but I still find it worth the drive to Natomas to eat here."], ["Penny B.", "Looked on Yelp when we were in Sacramento recently and Bangkok Garden came up. The food was fabulous and authentic. We ordered Tod Mun (fish cakes) a Duck Salad and a Seafood Dish with Calamari. All three dishes were excellent, the ingredients were very fresh and service was good as well.Looking forward to our next trip to Sacramento. Thanks!"]], "Thai Chef's House": [], "Chada Thai Cuisine": [["Max L.", "I have been going to Chada with family for over a decade, now my girlfriend and I go about once a week (give or take). The food is always exceedingly excellent, I have NEVER been disappointed by anything on the menu. A favorite of ours is the Red Curry with no meat and extra vegetables, but everything on the menu from coconut soup to eggplant to peanut sauce broccoli to mango curry is always delicious! The staff is incredibly kind, and have now started to recognize us and predict our order. They also are always very fast to take care of us, which I appreciate because we are often in a rush. I HIGHLY recommend this establishment and plan to continue my loyal patronage for many years to come."], ["Jennifer A.", "I have been to Chada tons of times. I typically order a green curry, and thai basil (extra spicy), and the fresh roles. I called this order in and picked it up last Thursday, and it was terrible. Both entrees were extremely mild. The Thai basil (which I had requested very hot) had almost no flavor at all. The curry was watery. Even the fresh roles seemed super bland. It was a MASSIVE disappointment when we got home ready to feast on mouth watering thai. Had we been sitting in the restaurant, we would have sent the food back. But who wants to drive back, when you have ordered takeout? Rather than write them off completely I called in the next day and told them that we were super disappointing in the food, and asked if they had a new chef on staff. The manager told me no. He said that if I still had the uneaten dishes he could remake the food. Of course I did not save the thai food. I was really hoping he would do something to correct it, offer a gift cert for the same amount, or something. He had record of my credit card transaction. Once he pulled up a record of what I ordered he just said, \"oh, it doesn't look like the person that took your order wrote down that you wanted anything spicy.\"Well I was bummed that I paid for such crappy food, but even more disappointed that the manager did make any effort to resolve things. Oh well. He just lost two loyal customers."], ["Diana X.", "I came here with a group of five around 7ish, it wasn't busy there and they had plenty of tables available but we some how had to wait over 30 minutes for our food to come out. After waiting 30 minutes for our food only two people got their food which the other 3 had to wait another 10 minutes while watching the other 2 eat. I was the lucky one who got my food early and by the time I was almost done with my food the other 3 got their's. I order a red curry with prawns and scallops which also had red bell peppers and pineapple in it with a side of brown rice. It was decent nothing I would come back for. My friends order Drunken Noodle with Chicken, Chicken Larb, Pad Thai with Pork and some Basil Stir Fry Veggie with Chicken I believe. I asked the waiter if the food was family style which he told me it was. The portion was definitely NOT family style. It was a decent portion if you came here NOT hungry. Some of us left the restaurant hungry. We could have order another dish to share but who would wanna wait another 45 minutes for a decent dish.The only person in our group who enjoy their food was the guy who order the Pad Thai with pork. I mean you can't really mess that dish up. We pretty much left unhappy, and confused with how this place got 4 stars. It was one of those moments that we had trusted yelp and we were let down! Nope, I don't think I would come back here anytime soon. My friend warned us about this place that she came years ago and it still haven't changed. We should have listen to her instead of yelp. Boo, I mean try this place if you like. But definitely don't come here hungry, unless you feel like getting hunger pain.. Two stars for the service, that's all.. The end."], ["Julin M.", "Fine but nothing special.Service was nice.  A menu of Thai standards.  Tom Kha Gai soup lacked dimension and under-seasoned."], ["Shane T.", "I've been to Chada many times over the years. For some reason I've never written a review. This past dinner convinced me to.They have always been very nice people here. Never have I had a bad experience and the food is always consistently good! Today I asked if they had a new cook. The food just had that extra zest and flavor to make me ask. The waiter said mama was cooking today and cooking is also done by another guy. I replied mama knows best and today the food is on point! I usually stay pretty basic when ordering, so red chicken curry and a couple appetizers does it for me.I would have easily given four stars without hesitation if the restroom was cleaner. That's the only thing that takes away from a nice meal in a fairly nice ambiance."], ["Yin I.", "Pretty dang awesome! I had the green curry and my friend had some type of stir fry (#4 on the lunch menu). They were both flavorful and bomb. I like how we were able to switch out meats for seafood or tofu. Same with white rice for brown rice! That's a pretty cool option. I love spicy food and median spicy was just right to burn my mouth but still edible. Above that would probably be torture so be warned. I usually don't eat Thai food often because I prefer other ethnic cuisines but this place has made me want to come back for more. It was delicious and definitely well worth the price. The waiter was very friendly too. The only downside is limited parking but that doesn't matter much when the food is actually good! Just park down the neighborhood and walk the calories off."], ["Kalina L.", "Came here for a quick lunch with a few co workers. Got the daily special, Mango Curry with tofu. The mango curry was good, and decent size for lunch. I'm glad they used a really ripe mango because that sweetness balanced out the curry. I would of liked the curry a little spicer but wasn't given the option to make it spicy and forgot to ask. Service was fast and there was no wait for the food since I came in after a group of 10 who I saw got all their food and I got mine just about the same time."], ["Ricky N.", "Not the best Thai food I've had but its up there! Pretty authentic, really great service, and affordable prices.Came in for lunch, the staff were very attentive and quick. Ordered the Pad See Ew w/ Chicken lunch special. They served it with a savory coconut soup, it was creamy but still very tasty. The noodles were really good and they didn't skimp on the veggies or meat.I would like to try their #1 basil stir fry next time, looks really good."], ["Kristen C.", "So odd that when I'm looking for places \"Nearby\" on my yelp app, Chada does not show up even when I'm standing right outside of it. A little frustrating that this glitch almost made me go next door to Taste of Thai instead!I put in a little extra effort to find Chada's reviews and I'm glad I did. They're rated higher than Taste of Thai but ToT was far busier than Chada. What a shame. I haven't been to ToT but Chada was so. good.I got the yellow curry, as recommended by my waitress, and the meal was preceded by a little bowl of some type of coconut soup. It was super tasty but a little on the cool side which was a bit of a turn off but the meal that came after was awesome.I think it's easy to look past the quality of rice because it's... just rice. But the white rice here was so fluffy and perfectly cooked that it made me hate every other white rice I've ever had. The curry had so many different flavors and a good amount of potatoes/chicken/carrots in it. I fell in love with the yellow curry here, please do yourself a favor and try it.I will try ToT someday and update this review with a comparison, but it will be hard going there when I know the most perfect yellow curry is right next door at Chada."], ["H R.", "This place is great. I use to live in Sac and this was always my go-to Thai place. Whenever I come back to visit I make it a point to come here. I am actually here as I write this review. Highly recommend the avocado curry. Not on the menu but always a special on the board. Just come eat it all ready!"], ["Ana F.", "Man, what happened here?  I was incredibly disappointed tonight and since it was my idea to go, I was also kind of embarrassed.  It had been years since I was last there and I couldn't help but wonder if ownership has changed.Even though it was on the dry erase board as a special, the Asparagus Chicken was nothing to write home about.  Standard sauce, veggies and dry pieces of chicken.  The chicken Pad Thai was also underwhelming but there was something that was off about it (reminded me of something that was about to spoil and good gawd that sounds horrible and I feel sad saying it).  The noodles were thinner than the pad thai noodles I am used to and they were incredibly slimy.  If you are wondering if I mean to describe them as oily, I don't.  Service wasn't as great as I remember it being and the place wasn't crawling with people either, so can't use that as an excuse.  HA!  As I type this, my other half is microwaving a burrito.  It's only been an hour and a half since we were there.  End scene."], ["richard s.", "My fifth stop in search of Iu Mien owned business. Arrived at 3pm, meeting friends from Portland for lunch. Pretty hot inside. Don't know if the AC was running, but it was uncomfortably warm.  Only one server, so service wasn't very fast, but not too slow either. Food was good. Ordered Tom Yum soup, duck basil, mango salad, yellow curry, and shrimp with asparagus."], ["Alonso R.", "Fast and friendly service. Food was great! Really good curry. Can't wait to go back and try their fried rice"], ["Lyndsay B.", "TOTALLY unimpressed. I'm shocked at how plain the food was because this place got such high reviews-maybe I got a bad order or something. I called ahead and ordered food to go, the guy told me it would be 20 minutes.. I got there about 25 minutes later and was told to wait.. I waited about 10 more minutes and my food was ready-kind of annoying to not have received an accurate time being that I'm 9 months pregnant--just be honest, if it's going to take 35 minutes that's fine.I ordered chicken pad thai, green curry with shrimp and mango with sticky rice. The pad thai was surprisingly bland-perhaps the worst pad thai I've ever had, actually. The green curry was average, at best, but expensive-$13 plus i had to pay $2 for rice. The Mango and sticky rice was average.I spent $27 on really crappy Thai food - I will never return."], ["Kelly M.", "I went here the other day starving and trying to find some to-go eats for my boyfriend and I.The staff was very nice and quickly greeted me to take my order. I did notice the place was pretty dead, but the place next door was busy.I ordered a bunch of different items - the vegetarian spring rolls, avocado curry with tofu, asparagus shrimp and steamed rice. The place was a bit pricy (Over $30 for the order.)  I brought the food home and we chowed down. The shrimp was not fresh and tasted fishy. The avocado curry was only so-so. I did not enjoy the spring rolls and all. They had minimal veggies inside and were just a lot of spring roll wrap, fried.I probably won't come back, even though the staff was great because the food just wasn't anything to rave about."], ["KeiKei B.", "DO NOT EVER EAT HERE IF YOU VALUE YOUR HEALTH.  I kid you not, there were ROACHES on our table and they were crawling under the glass.  This is not something I am kidding about and it was nasty.  The staff did not know what to do with us and although we did not make a scene this was not to be borne.  And these were not big roaches.  No, they were newly born roaches so this means that there were resident who'd been there a long time.  I am serious.  There were roaches on our table.  We were so disgusted and just shocked to stupefication.  Oh and we'd eaten an appetizer before we noticed the roaches.  MADE US GAG."], ["Kamni G.", "A little magic is lost... What more can I say. I looked forward to returning here for my fav dishes and was disappointed. The food isn't as good as before. The re model was overdue and its a perfect addition. This experience won't deter me though, I shall return and try my fav dishes there. The owner is super nice and recognize their regulars and do a nice job of building a relationship with you."], ["Thelma D.", "Worst spring rolls ever.  80% lettuce!  The other food here is OK.  But how do you screw up spring rolls??  They do.Go two doors down, and hit up Taste of Thai instead."], ["Marla D.", "Very large menu, lots of options for everyone.I had the hot and sour soup which was super delicious. Chicken red curry was good but I had better. The chicken pad Thai was okay, but lacking flavor. I will go again in the future to try other items."], ["Sac M.", "First time eating Thai food first time here not a good experience for my first time I coulda done without this place won't be back"], ["Elizabeth E.", "Chada's is easily my favorite Thai in Sacramento. I have gone to a lot of places here but Chada's is always my go to. The only down side is their hours, they are closed Mondays and some hours during the day. I have gone with big and small groups and no one leaves hungry or disappointed. I am a vegan but have also brought non vegans who love their food as much as I do. I would highly suggest coming here if you are in the area."], ["Liz S.", "Well, clearly I like Thai food because I come back so often and rewrite this review. Last night, we walked in for an early dinner, and we were the only people in the restaurant. We were tired, hungry, and thirsty! The woman gave us two menus and walked away. Did not ask if we wanted a drink or get us water. Nothing. Ten minutes went by (hubby says less, but it seemed like forever, and did I mention we were the only people there?), and a take-out customer walked in. I could see that they were going to help the take-out customer before giving us a drink.So we walked out. Went next door to Taste of Thai, not for the first time. Chada is uneven. It's a family run business and I think maybe some days the family is not functional! Last time I tried to go here, they were closed for a week for a family vacation. I'm not going to say I won't come back, because sometimes it's awesome, and I get that nobody's perfect. I just wish I could count on it being awesome all the time. And I think the service here is just relaxed, for good and bad.Chada's drinks are cheaper than Taste of Thai, if you can wait sometimes."], ["Josh L.", "After going back and fourth between the two thai restaurants (chada thai and taste of thai) I gave in the reviews and went to chada thai. I'm not sure how the other one is but I definitely made the right choice!! I love the simple and elegant decors of the restaurant. The waiters were so nice and helpful with recommendations. I ordered the eggplant dish with beef and drunken noodles with shrimp. The food came out super fresh and quick too!! The flavors of the vegetables and spices complimented each other. I would definitely recommend this place and I'll be coming back!Ps - I just made an account after eating here. They deserve more recognition!"], ["Danita N.", "One of my go-to spots between mid-town and Land Park. I usually get take-out, but my experience eating in the restaurant has always been good, too! There are lots of Thai options around town - including one right next door(!) - but I always come back to Chada Thai. The service is great. The staff is super friendly. And it seems like it's a family run spot, which makes me like it even more! I especially like that they are willing to vary the spice of dishes. I like mine on the spicy side, and they are always very accommodating of my requests to pump up the heat level!"], ["Trisha D.", "Absolutely love this place! They never disappoint and the service is always very quick and efficient."], ["Emily N.", "My husband and I are pretty picky about our Thai food and this place definitely fulfills all of our expectations. The waiter/waitresses are always friendly and I believe all the cooking is done by a mom in the back. I really appreciate how the always bring out the food hot. We usually order pad see ew and it always comes out perfect. Thank you!"], ["Doug G.", "First visit was very good!Tom Yum w/chicken was 5starsGreen curry chicken. 4 star2nd visit:Tom yum w/chicken greatAvocado Curry good3rdTom Yum -good chicken nice balanced flavor. Papaya Salad - nice and hot well balanced!!Sticky rice desert -- w mango is amAzing!! 5star!!!"], ["Emily M.", "Easily the best thai in Sacramento! The lunch special is a great deal and comes with delicious coconut soup!"], ["Lisa D.", "Chada Thai was amazing. Their service was fast and the food tasted great. We had the pumpkin curry special and the Chada Fried Rice (which includes pineapples, cashew nuts, and raisins) and both had such great and balanced flavor. I am excited to return."], ["Nando V.", "I was on broadway craving indian food so i yelped near by spots and this spot caught my attention i saw it had curry so i was like, screw it lets go there im starving. When we got there, there was 2 thai spots next to each other so i went to the one with more stars. The place looked nice inside the service was friendly, not as attentive as i would like but friendly enough to help with the menu since it was my first time there.The waitress helped out gave me her input on dishes to pick some stuff i picked like the curry some she suggested like thick noodles with shrimp.The food came out it was nice and hot but the food was missing something. I looked for my waitress but i couldnt find her my food was missing SOY SAUCE!!!We were almost full , the couple across from us got there food and their waiter had brought them a tray with soy sauce, fish sauce, garlic hot sauce etc. i was like why didnt we get that? I finally got a glimpse if my waitress i flagged her down and asked for that tray i was kinda up set that we didnt get that from the start thats where im deducting a star and deducting another one because the food was bland with out soy sauce. Once i put the sodium on the food then it was great but yea that sucked with out it. I would go again but next time i will ask for the sauce tray. Seems like the whole review im bitching bout a sauce tray, smh.Curry was great the spicy rice was good pretty spicy but i knew what i was getting my self into the thick noodle was also good the beef dish was my least favorite the beef was tough and dry other than that it was good and like the terminator, I'LL BE BACK!"], ["Cynthia M.", "The food here is great, but what stood out to me the most was the exceptional service. I had the pleasure of being served by Brady my first time here. He was very friendly, accommodating and recommended to me the red curry. If authentic and fresh Thai cuisine is what you're looking for, this is the place to go. The ingredients tasted fresh unlike most Thai restaurants that load up their dishes with artificial add ons or flavors enhancers. All in all, I would definitely come back for the great atmosphere, food, and experience."], ["Tiffany S.", "First time coming here and it's pretty good! I had their red curry, papaya salad, crab cake, and pad thai. Everything I had was really good! I would consider coming back here again when craving for Thai food."], ["Maya B.", "My family lives about two blocks away from the restaurant in Land Park and it is by far some of the best thai food I have had! The pad thai is excellent and the curries are really good (although taste pretty standard for most thai restaurants). The thai iced tea is also good and not too overpriced. Overall I would definitely recommend this place to any thai food enthusiast!"], ["Anne C.", "Great food, service and staff. Best yellow curry in town. Ask for the avocado green curry! It is delicious too."], ["David G.", "The best Thai in town plus super friendly staff!"], ["Elisa R.", "We prefer coming to this Thai restaurant because of its authenticity.  I've tried just about all their curry's and love each of them. In the winter we enjoy the Pumpkin Curry and during the warm months the Mango Tofu is delightful.  From the Pad Thai to the sauteed veggie dishes...never A disappointment. I've tired each of their specials written when you walk in at least once. Give this busy Broadway street restaurant a visit.... you won't be disappointed."], ["Dani P.", "My boyfriend and I come here at least once a week now that we live off of W St. They're always so friendly and welcoming and of course they have quick service. The food is amazing! We always get the vegetable red curry with no tofu as we are vegans who don't eat soy! They are always so accommodating and easy going! Best thai food I have ever had, and I'm a tough critic so that is saying a lot! If you're in search for an amazing and authentic thai food place look no further!"], ["Tracy T.", "This place is located in town where theres not much parking. The restaurant seem emptied but the food was great! Had the eggplant dish with rice and flat/wide noodles. They were super delicious! Customer service was great & our waters were always refilled! Definitely going again!"], ["Cindy S.", "Loved the chicken green curry and fried rice thai style i believe and the thai iced tea. very chill atmosphere. the service not so much as service but really? had to ask a waiter about three times to re fill our waters i would have just thought they'd come back around but nope. disappointed in the service but overall food was great. wouldn't come back tho. better to go to taste of thai or thai spice much better."], ["John W.", "I came here again because i loved it so much the first time. Oh em gee you have to try the avocado curry and mango curry!! Goes great over rice! My girlfriend had the mango and i the avocado. The curries were so creamy and delicious! You can definitely taste the coconut milk as well and it compliments the fruits so well. I thought it was odd at first -fruits in curry? But they go so well in their curry! Its like little bites of heaven when you get a combination of vegies with avocado and some rice.. Mmmmmm..!!"]], "Thai Canteen": [], "The Coconut Midtown": []}