{"Ming Dynasty Chinese Cuisine": [], "U Like Chinese Restaurant": [], "Everyday Restaurant Chinese Cuisine": [], "China Palace": [["Annette K.", "Place is run down and not located in the most elegant neighborhood-- but, a good Chinese-American option! Friendly service and yummy food. I asked for steamed veggies and sauce on side and they had no issues with special requests. When I entered there was a delightful and ancient-looking Chinese man enjoying soup at one of the tables ---which made me think he was either family or he knew where to get decent Chinese food at :-)I liked it much better than other Lansing \"chinese\" options."], ["Hayley D.", "Rude rude service in addition to gross food."], ["Melissa M.", "I've been coming here for years and it will always be my favorite."], ["Bill P.", "Awful customer service. I ordered at 6:00, its not 8:00 still no idea where my food is! I try to call the restaurant and it just gives a busy signal. The lady taking my order didn't seem to understand what I was ordering and I'm not sure if she even took down the right info.  Tried to call like 10x no answer!! This is the worst delivery and customer service I have ever gotten. Either dine in or go someplace else!"], ["Jamie R.", "I have been eating from here for several years and have never had anything to complain about. Except maybe the overall appearance of the place. It looks like a run down building in a not so good neighborhood, however this is the best Chinese take-out in the city of Lansing. I love love love their Lo Mein. Great General Tso. The star of the show however has to be the egg rolls . Now, I don't like egg rolls typically, but Here I order extra. I don't know what they put in them, but they are to die for. If you want quick, go in and order. Order in advance for delivery, as it is a bit slow. Usually takes about 40 min. It is worth the wait, though. Enjoy!"], ["Nick C.", "good american chinese"]], "Empire Szechuan": [], "The Kung Fu": [], "Fine China Restaurant": [], "Hong Kong Restaurant": [], "Asian Gourmet": [], "China Flavor": [], "China King": [], "Little Panda Chinese Restaurant": [["J R.", "The quality of the food and it's preparation have gone downhill in past couple of years. I keep giving them a chance but am ready to give up on them with the exception of one dish, the almond boneless chicken. Although this dish is a creation born in Detroit restaurants and not \"Chinese\" except that it's birthplace was in a Chinese restaurant, it's a dish I truly crave a few times a year. Battered boneless chicken breast served with a thick light brown gravy, any transplanted Detroiter that has ever had it knows that outside of Detroit it's next to impossible to find. So for this reason only I will keep Little Panda on my list for a few times a year. We had been eating at Little Panda for many years with no complaint but as I said things changed. The sauce on the table used to be so good and they stopped using it, I suspect kitchen staff changed as some of the other dishes became something very different than they had been. The vegetables are not as fresh or cooked as well, the chicken in dishes that are not battered and fried have sometimes not been completely cooked, or over cooked to dry toughness. Some of the dishes look the same but the seasoning is different; off, not the harmonious flavors of the past. The sweet dishes have gotten too sweet and several occasions the egg rolls tasted old; very cabbagy and tough instead of crisp. This having been our go-to Chinese restaurant for many years, it's disappointing to no longer be able to count it."], ["Natasha R.", "I wish this rating had more stars! I LOVE Little Panda and miss it so much. I have to note, though, that I have only been here for Dim Sum and not for lunch/dinner. So this review will be for Dim Sum.Dim Sum I believe is served on weekends until either 11 or 12pm. My friends from Florida came to visit and we all went there for DS and they were amazed by a) how good the food was and b) how inexpensive it was.Some of our favorites are: Green Onion Cakes, Taro (something purple and friend, cant remember the name), fried dumplings, sesame balls, ribs, spring rolls (my fav!) and shrimp or beef in rice noodle. There are so many things to chose from but I'm not much for seafood, so that might be something you'd like to try! I;ve never had anything I didn't like. The hot tea you are served is also very tasty and great on a cold day.Service is great, atmosphere is nice, sometimes can get pretty full but I don't recall ever having to wait for a table."], ["Nate L.", "This wasn't the first restaurant that came to our minds on Sunday, but was the only restaurant open at the time. Little Panda reminds me of a long-standing Chinese restaurant in my hometown. In fact, it reminds me a several Midwestern Chinese restaurants. I sense a theme.Since it was a Sunday, we were seated promptly and served with tea immediately. I didn't notice anything out of the ordinary with the tea, but it wasn't anything to crow about either. Since this establishment had a reputation for high food volume with a higher than expected price, a friend and I decided to split a dinner. Apparently, the lunch specials are more reasonable, but we missed it by a few hours. This proved to be a perfect move, as there was even too much for for two people. Our dish, the orange chicken, came out in an acceptable timeframe and was served with steamed rice. The first comment out of my mouth was about the sauce. It looked extremely thick and syrupy. It tasted like it, too. The meal was extremely sweet; it was almost so sweet it wasn't spicy, as the peppers were coated in sauce. Overall, this place is OK, but I can definitely find better Chinese elsewhere."], ["Mr. B.", "Sub-par at best.  I ordered the sweet and sour chicken dinner & paid the extra $1.75 for fried rice (total was $12.46 with no drink).  The portion was adequate, although I easily cleaned my plate and had no leftovers to take with me.  Quality was meh... Maybe I'm spoiled, but in metro Detroit I can easily find twice the quality & twice the quantity for half the price!  Service was not all that great, it was speedy but I was never even asked if I wanted something to drink other than water ...  I will not be returning."], ["Lorraine H.", "This is my favorite Chinese restaurant. Favorite dishes are cashew chicken and garlic chicken. Best eggrolls in the city. Seems to be family-owned. The young man at the desk is quiet and curt, but that's just his nature. Don't take it personal. Become a regular and he's really nice. I go there often with a book for a late lunch. Quick service, and they don't mind if you hang out for a while. Generous portions, tasty food, dinner prices are a little high but lunch is reasonable. I always get a \"doggie-bag.\" On the wheelchair-accessible issue: the restaurant itself is accessible, but getting in is another story. The foyer is extremely small and you have to make a sharp left to get in. If they would remove the potted plants and unused coat rack, there would be more room. The outer door has been repaired or replaced and now it is no longer heavy and difficult to open."], ["Moash S.", "I love this place. My husband and I used to go for lunch almost everyday when we worked together. The waitresses are super cool and the hunan dishes are excellent.  I always get the hunan shrimp extra spicy and my hubby gets the hunan beef.  Their hot and sour soup is great too! We aren't too adventurous, but I've tried the curry shrimp and it's pretty good too, as well as their sczechuan dishes!"], ["Matt R.", "Well now, this was a real diamond in the rough. By \"in the rough\" I mean tucked away in a crappy strip mall filled with check cashing joints & weight loss places. Don't be discouraged by the exterior appearance, the Little Panda is big on content! My first test of a good chinese joint is their crab rangoons...they have to be good. Little Panda passed test #1. The portion sizes were also excellent for the money. I think the whole check was $16 for 2 people. I will put this on the recommend list for sure"], ["Lisa B.", "Good prices, good portions, good food.  Not the best, but still fairly tasty.  Restaurant itself was plain, and I did not dine in.  For take-out orders avoid soupy dishes like the shrimp in lobster sauce, because the soup containers they come in are rather flimsy and can leave you with a huge mess."], ["Lisa V.", "Love this place! Great food,portions,price,and quality.this is the only chinese food i eat in the Lansing area"], ["Iris S.", "A little hole in the wall next to a check cashing joint, this Chinese restaurant has the best Moo Shoo Pork I have tasted in my entire life.  It is so delicious that I have entirely given up on the Chinese dining experience since my move to Minneapolis three years ago.  Everything that I have tried in the Twin Cities dulls in comparision and that is if you are lucky enough to even find Moo Shoo on the menu.  The ultimate difference here is the freshness.  The vegetables are crunchy and flavorful, indicating that they haven't been sitting in sauce all day.  The portions are an amazing value.  I always have about 1/2 of my meal to bring home as leftovers.  The staff is friendly and efficient.  Take out is a breeze, but they do not deliver."]], "P.F. Chang's": [["Ellen H.", "Like most all Pf Changs Ive been too, this one was fantastic. Great expereince at the bar witH Kat, had a wonderful meal, and all throughout the time there this  awesome bartender did not miss a beat. I love this brand, I love the food, and I love that all the employees here have tenure and emulate the mission proudly. Very excellent spot!"], ["Khuzema G.", "Well this is the first time I went there. I was with a friend and we ordered lobster roll and kung pao chicken.... The lady who served us .. She was nice and took us to our tables right away... And it took them less than 15 minutes to bring our food.However... My friend specifically asked not to put any peanuts and they missed that.. Also... The silverware was not cleaned well and had a lot of marks... Like when you wash and don't wash off the water....  She brought new one and that was also the same  ... The food was good.So. Good ambience... Good crowd..  Food is good... But no attention to detail.."], ["Matt S.", "Building is clean and looks quite nice however the food is expensive and quantities are small. We had lettuce wraps ($10) which are always good. I ordered Mongolian beef ($16) when I tried it the beef was tough and dry with very little flavor."], ["Richard H.", "We come here about once a year for the last 10 years...and the quality and service remains great. The restaurant is always busy which tells you people like the place.On this trip our group ordered Sake and imported beer, fried green beans and lettuce wraps to start..all great. Then soups- hot n sour and egg drop...great. Main course consisted of scallops, orange peel beef, cashew almond chicken...all delish. The deserts looked great but we were all stuffed. Our server was fun and knowlegable..and special requests were gladly fulfilled. Great service. Our total bill for 4 was aprox $120 which was more than fair given how happy we were with the meal.We really need to come here more often!"], ["Brandon M.", "Great service!!! These guys know how to make a great fine dining experience wonderful.  The cost is not bad for the type of food you are getting as well. My favorite is there is the wine. They have such a great selection and they are always great about giving their opinion about what wine is best with what meal I choose to have. Having knowledgeable staff that are friendly and good food at a reasonable price. What more could you ask for?"], ["Cecilia C.", "Enjoyed Jasmine tea on a cold rainy day, it has a nice spice to it. Had ginger chicken lunch special,  while I enjoyed the wonton soup that the server let me subsultitute I had to ask for a second plate as the ginger sauce overwhelmed the chicken and broccoli dish. Good service and would come back asking for them to go light on sauces."], ["Xtina G.", "The first time we tried to come here was 5:30pm on a Saturday, and it was a 1.5hr wait.  We learned and made a reservation for a Friday night this time.  Due to the popularity I had decent expectations.  I do like their ambiance, the Moscow Mule cocktail was refreshing, and the service is speedy, but only 1/3 of our order was good and the rest I'd be happy never to have again.We started with the Chicken Lettuce Wraps, a signature dish.  I liked the fried noodles, but it was pretty salty even though I used very little filling for the lettuce.  Steamed shrimp dumplings.  $10 for 6 pieces is pricey, but the skin was thick and tough, and black bean sauce too salty.  It also smelled fishy.  We shared the Hunan Hot Fish -awful, generous portion but had an identity crisis.  It was sweet, sour, but least of all spicy without any distinguished flavor.  The Red Wine Pepper Braised Beef special -Very good.  It was like a fancy beef with broccoli with lean tender pieces of beef.  There was good heat and flavor but wasn't salty.  A winner.  Singapore Noodles, which we've had at a dozen other places.  This might've been the worst.  We asked that it be spicy, and it was super salty and vinegary.  I suspect they poured hot sauce in it!!  A complete travesty.  Last, we had the Banana Spring Roll -one of the best ice creams I've ever had was the accompanying toasted coconut and pineapple ice cream.  I want to learn to make this, so I can eat it all the time.  It's super smooth and creamy with strong vanilla, coconut, and pineapple flavor but not too sweet.  The actual banana spring roll was too sweet to me because of all the honey poured on.Overall, I wouldn't go back because we just felt disgusting after all the salt and oil.  I wasn't expecting it to be authentic, but would've appreciated if it actually tasted good.  There was just no balance of flavors.  I could see it being popular for the drinks and ambiance, though.  Might be better just for happy hour."], ["Another M.", "Lettuce wraps, pork dumplings, kung pao chicken were perfect. Our waiter was so helpful. Dragon eye oolong tea. Nice experience.  We like it spicy."], ["Michael P.", "Excellent as most that I've encountered! All around good food, drink and service!"], ["Ruby Z.", "The food is pf changs food. Its usually good. (Untill they have used the same pan for 10 lettuce wraps in a row then you get the burnt chucks of crispy crap) Our server was sarah. Im a server in a high class dinning establishment so i kinda understand the job. I know thatyou dont rush your table! Thats for sure... So were meeting up for a birthday party. Friend number 1 calls to make a reservation and they arnt taking them that day... friend number 2 calls. Same thing. Then i call while on my way to let them know we have 8 people coming. They FINALLY take a name down and get our table ready. So we showed up early, as they wernt taking reservations. We were 30mins early. Tried to order some apps, Sarah kept walking past us finally we got her attention. I say we're going to order some apps becsuse were hungry and our friends are taking their time (jokingly but still side about the food) she says \"well is crunch time and there's a2 hour wait limit\" HA OK! Weve only been sitting for 10 mins at this point. Half of us are there. One more shows up and Sarah asks in a concerned voice \"do you know when the rest will be here?\" I told her they are supposed to be here at 6, she just walks away. Rude. We got there at 530 because they wernt taking reservations. We didnt want everyone to have to wait! And in less than 20 mins shes telling us we have a time limit. I know that our table and one other table was her only 2 tables because she said something about it which i overheard. So she was just trying to push us out as fast as possible to get another table in. On top of all of it. She didn't want to offer desert we had to ask for the menu and she knew there was a birthday girl there. Then we were walking out and saw her and she didnt give us fortune cookies so we asked and sarah rolls her eyes.... ill never come back to this location. Ive never had such a rude server in my life and im pretty easy going because i know how it is when your busy! Bitch wasnt even busy and we got horrible service. I forgot to mention that are drinks were empty more than they were full...."], ["Chrisey B.", "Called for take out- they did great job confirming order and checking to make sure available pick up time would accommodate me. Service was excellent. Highly recommend."], ["Heather T.", "Amazing food and drinks. Service is always good. They're pretty busy most nights but it's easy to get into the \"open\" seating area. Longest we've waited was 20 minutes."], ["Mike S.", "First time at P F Chang!!Wife decided to finally ask me to go, I can sometimes be picky!!Walked in the place was quiet unlike most places we go. The decor I think is really cool.My wife orders Lettuce Wraps for starters. Never had would normally not even try. I am extremely happy I decided to try. They were awesome. Crunchy lettuce with chicken, mushrooms, water chestnuts (usually picked out of everything else I have with them) and scallions. Very tasteful combination, my new love of the year.Main course was Broccoli and Beef. Had this at other places but this was by far the best I've had. Ginger was a new flavor with the dish but it was a good one.Marissa was absolutely awesome. During our chatting with her she mentioned her day started off horribly. In no way did this manifest itself as she waited on us!!!!"], ["Gary H.", "Anyone who knows how to cook a decent meal at home, and anyone with a sense of taste, is laughing at you for going here. Seeing this place busy makes anyone who appreciates authentic Chinese weep inside. Here's how to experience PF Chang's at home: Go to Meijer, buy a $6 freezer tray of Sweet and Sour Chicken, then at the checkout give a $10 bill to the person behind you in line, then go home and microwave your food while thinking really hard about how you spent $16 on this meal, so it better be good. Voila, the full PF Chang's experience."], ["Ruohong Z.", "Excellent environment. Satisfied services. But it is not CHINESE!!!!!! It is basically the luxury version of Panda Express. Recommend for people seeking for a nice place to eat. Not recommend for people who would like to taste and be amazed by real Chinese food."], ["Beth J.", "Nothing wrong with the food, but it's no more special than any other Chinese - American restaurant. Honestly, I think I get a better deal at my local carry out joint. It's big and noisy, not much in the way of atmosphere. I won't be returning for awhile."], ["Adam L.", "I'm a little confused as to why this place only has three and a half stars? I don't come here often but when I do I'm always happy. The ambiance is always amazing, the service is stellar, and the food is damn good. I can't ever go and not get the lettuce wraps. This time I tried the noodle soup for the first time and it was amazing. I also like the creative cocktails that they feature. Anyway this place is great and I would highly recommend it to anyone."], ["R. L.", "Way over priced for the quality of the meal! Years ago I loved this place, but lately it has been disappointing. The food is just weak of flavor and not what you would expect. Curry dishes are dull, fried rice is dull... Actually, Pei Wei is better in my opinion."], ["Drew P.", "A PF Chang's is generally a PF Chang's. As far as they go this one is pretty hit and miss. Sadly more misses than hits."], ["H t.", "I don't know what the PF Chang hype is all about or maybe it is just this particular one. I have been here 4-5 times and every time I am so disappointed. The food just plain sucks. The only good thing is the lettuce wraps. Save your money and buy the frozen PF Chang meal which tastes better than what they serve here"]], "XIAO China Grille & Lounge": [], "Chen's Restaurant": [["David F.", "For the price you pay this is by far the best chinese food in the Lansing area.  Lunches that run between $4 and $5 and its tough to break $10 for dinner.  If you like your food spicy make sure to ask for extra spicy!  I eat here twice a month or more and recommend Chens to everyone!"], ["Edward W.", "I stopped for lunch and was very pleasantly surprised. The building was round, and looks like it was built in the 50s, but the food was amazing. I had the garlic chicken lunch portion. I'd hate to see the dinner portion because it was huge!  Cheap too. I'm sure I'll be back."], ["Bobby B.", "Well, I thought I would give them another try.  This time I ate in, I'm glad I ate before I looked too closely at the walls.  They are just filthy and have what appear to be dried boogers on the walls.  I think the health dept needs a phone call!!!"], ["Nick C.", "Its good typical Chinese style food all sugar and grease but u know what to expect overtime the best sugar and grease"]], "Fortune House": [["Tehseen M.", "The best Chinese food I have eaten anywhere (and I have eaten a lot of Chinese food).No matter what you try here, the taste is awesome. We tried Kung Pao, General Tsao's and many more varieties. The portions are decent, the prices are ok, but the taste is just out of this world. Their spring rolls are not too good though. We have dined-in and taken out a bunch of times and were a satisfied customer every time. Heck, we like it so much that I even had my graduation lunch with family and friends here. We used to go there at least once a month when we lived in Lansing.We so missed something like this down here in Dallas,TX."], ["Catalin B.", "So I was pretty disappointed in this place when I came by for lunch. The service was good enough but the food was not very good . The Tom Yum soup was kind of bland and lacked the heat or unique aroma and flavor usually associated with the lemon grass, kaffir lime leaves and crushed chili pepper broth. The Crab Rangoon was just deep fried dough with very little filling. So, no one gets crab Rangoon to eat healthy, but if I'm taking a hit on my nutrition I'd at least expect some awesome flavor. The curry was pretty watery and lacked any real heat or depth of flavor. I'm not sure I'd give this place another try...."], ["Cassie I.", "This place is amazing! We just move to the area and tried several Chinese places in the delta township area and nothing is even slightly as good! The lady that always runs the cash register/answers the phone is soo sweet!  We have had over 15 things on the menu and there is nothing I would not recommend!! Great Chinese place!!"], ["Miss P.", "So it wasn't as big a hype as it was during my first visit.. Still the special fried rice was delicious and service super excellent. Will return if when in a bind. Otherwise I have to stick to Bamboo in GL .. Sorry :("], ["LeRue C.", "I am thoroughly shocked at the good reviews of this restaurant.  Truly shocked.The other week while traveling for work it was the only non chain place that looked remotely interesting in that area so I headed in.   The few reviews on yelp were good so I wanted to give this place a try. I ordered the green onion beef with spring rolls.  It was during lunch hours but it wasn't on the lunch menu and the waitress proceeded to tell me.  \"That is not on the lunch menu and its a different price.\" blink blink blink  I didn't see anything on the lunch menu I wanted and the price which was only 1 dollar more than lunch was clearly next to the menu item.  blink blink blink  The food arrived in about ten minutes piping hot.  Unfortunately, the Mongolian beef sauce was flavorless.  You might wonder how can a dish covered in yellow and green onions be flavorless. Somehow Fortune House accomplished the impossible.  The spring rolls were really mushy inside so I left them after I took one bite.  Total after tax was about 11.00. I probably won't have to go back to Lansing, MI for work anytime soon but if I have to I will  not be going back to Fortune House."], ["Erica D.", "Quoted 20 minutes for my carry out order. Waited over an hour. Asked what was going on, and found out they handed it to a customer who just happened to also be waiting longer than me for take out. Seriously?Beyond frustrated."], ["H t.", "Kung pai chicken was good but it was sliced not how it is supposed to be all diced. Got the pad Thai which was covered in brown generic Chinese sauce and had very thin noodles, one bite and we sent it back. Tried the chicken with garlic sauce and it was the most bland Chinese dish I have ever had. It looked disgusting with canned mushrooms and barely any other vegetables and tasted even worse. Would not go back here"], ["Darryl S.", "Ive been there many times. The spoint in remembering return customers. I have tried several of their plates, and of the many times the only disappointments i have had is when i forget to order something. Besides the the food being tasty the staff is always friendly and curtious.taff make it a more personal by trying to make a"], ["Adam W.", "Hands down, the best lunch special in town.  They always make sure you have food on the table and the price can't be beat.I go every time I'm in town."], ["Alex M.", "Really good little restaurant.  The menu covers both Thai and Chinese cuisine but we mostly get the Chinese.  Most everything we have received we would order again.  The tofu and vegetable soup for two is really nice as is the vegetable egg foo yung.  Don't miss this gem on the west side."], ["Nick R.", "Good Chinese food!  I had the Pad Thai.  It was delicious and they actually have a hot (spicy) level that satisfies me!  My girl had Thai Fried Rice.  That was also delicious!  Inexpensive, and the serving was pretty fast.  I grabbed a take out menu since I thought it would be a good, close, late night dinner for take out."], ["Lorraine H.", "Yummy! I love Fortune House because they remember you, no matter how long it is between visits. My favorite dish is the Kung Pao Chicken. But I have yet to try many, many others. This is a Chinese AND Thai restaurant, so there's really something for everybody. The rest room was painfully clean, and smelled clean, too. The service is friendly, prompt and accurate. Under six dollars for a huge lunch, fried or white rice, soup, and egg roll. Great flavor to the food, most excellent."], ["Mark H.", "Decent place for lunch = they have great specials."], ["Davia D.", "Really excellent Thai food and great prices too!"]], "Huapei Restaurant": [], "Panda Gourmet": [], "Wok & Roll": [], "Charlie Kang's": []}