{"Peanut Barrel": [], "Black Cat Bistro": [], "For Crepe Sake": [], "Beggar's Banquet": [], "Kelly's Downtown": [], "Front 43 Neighborhood Pub": [], "Claddagh Irish Pub": [], "Troppo": [], "Midtown Brewing Co.": [["Ethan A.", "It had been a while since being here and reading recent reviews I have been hesitant. After going yesterday for lunch I could understand why some (definitely not all tho) of the items were no modifications. They're not exactly tossing together a premade mcdouble and the place was busy for lunch rush. Our waitor was attentive and witty and making us laugh on our break, I asked him about a tattoo which had the table rolling. Definitely a great experience, my coworkers and I will be back!"], ["Coral Z.", "This is yet another example of a Lansing restaurant that has wonderful food and terrible service. I have lived downtown for 5 years and simply cannot understand how horrible wait service is the standard. And it has never changed.  If you want lunch at MBC you have to allot at least an hour and a half to get in and out. I'm not joking. But...I always go back. Because the food is so good. It really is. They must have a new-ish chef. Their menu has come a long way.However...what prompted me to write this review is ordering the buffalo chix sandwich and asking for it with no onions. The waiter said \"no mods.\" \"What?\" (I thought he said \"no mas.\") \"No mods.\" He repeated. \"I'm sorry, can you explain?\" \"NO MODIFICATIONS. But, you can pick the onion off.\" I was speechless for a few moments. It is 2015, you are paying $14 for a sandwich, and they refuse to serve it to you without putting onions on it.  I'm sorry, but no. That is completely unacceptable, in this day and age. Probably will be back, but not often."], ["Annemarie H.", "Dined at Midtown today with a group from work and truly could not wait to get back to the office to write this review - my first on Yelp. Our dining experience began with the waitress coming out and telling us that there were to be absolutely no modifications, per head chef's rules because the chef has put together offerings she believes taste good together and she's not going to have any lowly peasants f-ing up her creations. Oh...KAY! It's a new menu since the time I was there last and not an improvement, if you ask me. I ordered the buffalo chicken sandwich. When our food came out, I found that mine was inedible. Honestly, I think the sauce or the tomato (or something) had gone off. It just did not taste good. And, the fries were limp and luke-warm; same for my co-worker who asked to have hers well done (which they ignored, I guess that's a modification). At any rate, I flagged the waitress after trying a second bite of my sandwich, after scraping as much of the blue cheese sauce off as possible. I told her it did not taste good and that I didn't want to eat or pay for it. Not 2 minutes later, out marches the chef (all 22 years of her) - but she didn't come to apologize. No, no! She came to tell me that the tomatoes they serve are grown hydroponically and they pay almost $2 a piece for them so that can't possibly be the problem. Basically, she came out to tell me that I was wrong about my lunch, despite the fact I was the one trying to eat it. I eat out a fair amount and have been to a wide range of restaurants, and I have never had such an experience in my life. Someone needs to check her ego! Bottom line to me... this is yet another place that's trying too hard to be something it's not. It's a brew pub. It should have interesting, but still pretty middle of the road fare. And, if someone doesn't want a sunny side up egg on top of their crab cakes, that should be their prerogative! I didn't go to Midtown frequently in the past, but considered it a solid option for some types of circumstances. I will not return, under any circumstance. If I were the wait staff, I'd be pissed because there's no way this chef's attitude isn't affecting business and tips."], ["Erica D.", "Very cool surprise. Our bartender was amazing! He made us laugh, taught us a thing or two about their unique beer options, and made me the best non-alcoholic mojito-esque drink ever. It was so refreshing. MBC has a lot of alcoholic offerings I'd never heard of before. It's a great place to explore your booze palette.The food looked good too, although we weren't there to eat. I'll definitely be back to try it! Only turn off is the interior. Pretty plain/slightly rustic."], ["Tom H.", "I've been to Midtown twice in the last month and have been very pleased both times.  I found the beer selection as well as the food to be excellent.  Once was for a late lunch on a Saturday and the other was weekday dinner and I've really enjoyed the atmosphere throughout the restaurant.  The wait staff has also been very friendly & helpful so I have to say Midtown Brewing is an excellent addition to the Downtown Lansing food scene.  Great job!"], ["David S.", "Really awesome selection of beer on tap. Handles rotate regularly. Their own brews definitely need work though. Service is par for the course. The food is really quite a nice surprise. Although overpriced, the quality of the food is spot on."], ["Indalay D.", "Agree with Coral Z about the food, but I thought the service was good.  They recently revamped their menu and took off the selections that everybody loved and went there for (olive burger, turkey on pretzel bread for example). About the \"no mods\" - I couldn't get a burger (listed on the menu wih bacon, cheese and BBQ sauce) without the sauce and I couldn't ADD bacon to the cheeseburger.  I ended up with what I thought would be a french dip , NY Strip and even though the menu said it was \"smoked\"  I couldn't imagine how \"smoky\" it would taste.  Awful and bitter. From what I gathered the new chef is very rigid and pompous and perhaps doesn't understand the whole concept of pleasing the customer - that's what makes money, because the people will come back.  I won't. Though the beer was good! And as I said, so was the service."], ["Chanel O.", "One of the better places to eat in Downtown Lansing. They have a great selection of beers, and their olive burger is amazing. Service can be slow at times, but they are very friendly!"], ["Chris M.", "Because I lived less than four blocks away, MBC quickly became one of my haunts.  Two of the bartenders understood that I was a die-hard Oregon Ducks fan, and would reserve at least one television on Saturdays for football games.  When you consider that every tv in Lansing would be on whatever respective Michigan-based sports team was playing, and here is Spartans country, they went above and beyond in doing that for me.As for the business itself, great!  They always make sure to have plenty of beers on tap, dominated by regional and local brews.  Their food never let me down, and being a poor college student, the house-cut garlic fries were a steal, and delicious to boot.  Quite possibly the best fries in Lansing & East Lansing.There you go.  Give MBC a try.  They never let me down."], ["Tim M.", "My review here is the exact same one as for the \"Michigan Brewing Company\" because despite Yelp's bizarre insistence that the \"Michigan Brewing Company\" (this specific pub, that is; not the actual brewery in Williamston) is closed it is not... It just no longer brews it's own poor quality beer and now they sell other breweries good quality beers; so they changed their name to reflect that; thus dropping the word \"brewing\" from the name.---------------------Midtown Beer Company (MBC) used to be affiliated with MBC (the Michigan Brewing Company) an actual brewery that used to be located in Williamston. MBC's (the brewery) beer wasn't very good and apparently MBC (the brewery) wasn't very good at paying their rent so suffice it say: they folded and the Lansing pub changed its name and started carrying other Michigan crafts (which was a substantial step up in beer quality). MBC (the pub) offers the traditional selection of pub fare (Reuben's, burgers, chicken wings, etc...). None of it is extraordinary, it may in fact be a bit overpriced, but it's not bad by any means. The real issue with MBC is the venue. Located at the far south end of the downtown Lansing-Washington sq businesses, MBC is a large open space with high vaulted ceilings featuring poor acoustics. As a result it requires very few people to be present before the noise gets out of control. Which makes the decision to push the tables to the wall and feature local musicians a confusing one. Don't get me wrong - I love music and want to support local musicians but the acoustics are so shoddy and the lack of any real performing space really kills the experience. MBC would be a significantly better pub if they just installed some noise dampening foam or heavy fabric drapes. Additionally, MBC should consider reorienting it's furniture; as it is the layout is disjointed and doesn't lend itself to the performers well; every time musicians arrive the bar looses effective seating. As it is the noise makes the bar to uncomfortable for me to remain for more than one drink during peak hours. I'm sure I'm not the only one..."], ["Catalin B.", "I like this place. For me it's convenient because I live across the street and it's open late. So if I want a good brew or a nice meal, later in the evening, Midtown is a sure thing. The beer is good. It's a little heavy on the IPAs. They had a phenomenal Carmel Wheat and a great Coconut Stout that I enjoyed.  When it comes to beer, if you're a hophead this place is for you. The cocktails are still being refined. Of course it's a brewery, so expectation management is key. That being said, they have fresh herbs and the bartenders are smart and open-minded. They can make up just about anything and are always willing to experiment. The food is really creative for pub food. They have the great burgers and assortment of fried food normally found at a bar but they also have lobster grilled cheese sandwiches and a bistro streak salad layered with greens, hash, made to order steak and topped with an egg. The wings are also amazing if you're looking for jumbo sized, smoked wings with a near perfect amount of heat. The service is polite but it is slow. This is especially true around lunch time. This has to do with the volume of costumers. If catching a quick meal when you're on a tight clock is your plan, this isn't the place. This  is a cool brewery where you go if you have a little time to relax and enjoy the food and company of friends. Between the décor, the outdoor seating and live music, trivia and open mic nights Midtown has a great ambiance. I would definitely recommend this place to friends."], ["Cristy C.", "All of the food was really fantastic. The lobster pizza was rich, but tasty. The pulled pork on the nachos and Hog's Heaven was sooo good. Service was initially very slow, we probably sat for 15 mins before they recognized that we had fallen through the cracks. After that, things went smoothly. Looking forward to going back to try the crab cakes! All beer choices were good, but the cider was served a little warm."], ["Roberta M.", "After waiting 15 min with no waitstaff at our table, we went to the bar for service. Not cool, people. Good selection of wine and beer. 40 min. Still no waitstaff.  Now we don't have time to order food. WTF. Lots of interesting items on the menu, but glad we grabbed appetizers at Troppo first!"], ["Karlye P.", "Great spot! Usually when I order a flight of beer I only like a few lf them, but NOT the case at Midtown! Loved them all. Food was super duper awesome too. Staff was friendly and inviting. No wait at all on a Saturday. Will definitely be back. Oh, they also have a great selection of board games!"], ["McSaddle X.", "If there are bees in the Biergarten, let owner and proprietor Marc Wolbert know, he will ward them off with special bee telepathy. If you forgot your EpiPen, make sure you tip your server well. Also, they are brewing all sorts of new drafts these days, stop in if you haven't in a while."], ["Matt O.", "If you want to come to a restaurant where you make a reservation and then the manager gives it away right before you get there? This is the place for you. Apparently here, making a reservation means making a time where you beginning waiting for a table to clear. Hope you have a great meal"], ["Joann R.", "Went in for a low-key Friday late night dinner and ended up with a beautiful cozy live music filled night. The space was lovely and walking up to the restaurant saw the tiki torches in the front and people having a good time. We wanted to sit in the front and enjoy the nice breeze but then heard the live music and decided to stay inside. Wow, the music was fantastic and the perfect backdrop to enjoy Midtown's amazing in-house beers and their delicious entrees. I ordered the Bánh mí and while it wasn't close to the original it was a really nice rendition. My boyfriend ordered the Cubano and was slightly dissapointed but the garlic pub fries made up for it, we also ordered the mac & cheese and that was the highlight of the night besides the beers. Overall it was a great experience, the servers were attentive but not overbearing and the drinks were delicious. It would be nice to know when they have live music though because the crowd was pretty dismal for a Friday night."], ["Brandy R.", "I have always liked this place even when it used to be that other \"MBC\". The food and drinks are still excellent! They even make their own beer now which is pretty awesome, and I can't wait till that expands to a larger production! I love this place so much, that after my fiancé and I got engaged we came here right after for dinner and celebratory drinks! Wouldn't you know we also booked this place for a wonderful rehearsal dinner the day before our wedding! We had a large party of 40 people and they accommodated us with a special limited menu and drinks. The service was great as always and everyone had an amazing time! This place is highly recommended and I hope to celebrate many more anniversaries here! Thank you MBC for being the place I have enjoyed throughout various milestones throughout my life! You rock!"], ["Friedrich S.", "Haven't been here since it was the other MBC, and I'm glad I gave it a shot.  The bistro steak salad had enough protein to be a legit post workout meal, if you aren't VERY hungry, go for the half.  Service was a bit slow at first finished well, I'll be back for sure."], ["Qiana G.", "First time here. Service was great...very honest about what I had questions about. I got the lobster roll with totes and it was soooooooo good. I highly recommend."]], "Applebee's": [], "Trippers": [["Sarah H.", "Great food at a great price. I loved the comedy club and the different rooms which you can play poker,pool, arcade games in."], ["Mike L.", "Arrived there at 8:45 pm after a MSU home football game on a Saturday.  Was told they aren't seating people.  What does that mean?  There were MAYBE 5 tables occupied and probably 15 empty tables.  They said they were swamped.  How about you learn to manage and staff accordingly.  I mean come on, understaffed on a Saturday night after a MSU football game.  Someone needs to learn how to run a business.  A group of 8-10 people came in at the same time, same result.  Will never go there again.  Go to Renos, they don't turn people away and they are friendlier."], ["Ramon S.", "They are raciest.... Sat at a table and was told we had to sit in a corner because we didn't fit the racial mode of their prime seating. Very hurtful"], ["Robert T.", "Dining room is half full, line at the door. Manager refuses to talk to customers lined up for tables, instead forces the poor hostess to inform the crowd they will no longer seat anymore people when there is clearly a number of empty tables."], ["Brittiany R.", "Trippers always seemed to be a huge pool hall/gambling den so I didn't eat there for quite some time. Once I did, I was pleasantly surprised. They have a pretty large menu with staple bar food and a few surprises that means most guests will find something they like. Prices are a little on the higher side. Food was good and as expected from this type of venue. Everything was prepared well and came out hot and fresh. Service was friendly and the game was on. What more can you ask for? Although the lack of guests did make for a semi-depressing ambiance."], ["Elnora C.", "Walked in to see the bartender eating behind the bar, paused long enough to take our order then resumed his meal, gross bc food was in his beard. Salad had advocado slices that were spoiled... Soooo can't recommend this spot unless Gordon Ramsey comes in to save it"], ["Johnathan H.", "This is for the comedy club. The vibe is good and love the spot but they need better lighting, additional speakers and possibly a curtain to block off the comedic from the crowd.*Update* all issues have been addressed upon arriving on a second trip to the club. I spoke with the staff and a curtain is being worked on aside from that all issues were heard and addressed. I will be coming back to support Lansing only comedy spot."], ["R. L.", "Such an odd layout. I watched a game here in the room that is toward the front entrance. The TVs are so small and cannot be seen unless you're parked out right in front of them, and only half the room was filled with tables and chairs. Felt like a bingo hall and seemed like a huge waste of space... not to mention it just looked super goofy. Our waitress was really nice and speedy on a busy evening. The person who seated us was completely clueless and let another group of people take the table he had prepared for us. Food was alright. I don't see a reason why I would go back here. For a sports bar they should have more (larger) TVs. Interior could use updates and a good scrubbing."], ["Mike R.", "Great for watching sports.. Been here a few times.. One time I went in and ordered a bbq chicken sandwich.. The waitress brought me a bbq burger.. I was like \"umm.. no, I wanted the chicken sandwich..\" I was wildly hung over from tailgating so I ate the burger and she brought me a chicken sandwich that I was gonna take to go.. It was still the wrong sandwich, and I forgot it on the table anyway soo.. Overall a mediocre place, they have beer, decent enough food, and their kitchen is open late.. And golden tee they have golden tee!! Pool is the best deal around $5/hr"], ["Paul F.", "What a depressing place, dirty and old is about as nice as you can say about it. Huge poker room??? What ever I guess. I you had a big group it would be a decent place to meet but that's about it. One drink and I ran out the door quickly looking for hand sanitizer!!"], ["R Douglas D.", "Avoid this place at ALL COSTS.  We were in town to play msu and we looked this place up as a place for the team to go to have dinner and watch the Pittsburgh penguins game.  We called in the morning and we were told that they could accommodate us and we could watch the pens game.  When we arrived, they had a whole section waiting for us but were told (after we ordered) that they would not put the game on.We then found out that there was a full menu that we were not allowed to order from since \"we were a large group and it was easier on the kitchen\".  We had to order from the bar menu.  WOW......  Athletes who need to play a game in the morning and no healthier choices were provided.They just smiled and said that we could call the manager tomorrow.They want your money at all costs.....but don't deliver on anything.Our waitress was very nice and provided adequate service...the only reason it even got 1 star.And...by the way..... The room in the front of the restaurant reeked of marijuana smoke when we were leaving.Class act....NOT.DO NOT GO TO THIS PLACE!!!!!"], ["Rebekah B.", "I am a Lansing native and have been to Trippers throughout the years.  I remember when they owned the space next door and had a full arcade... and I also remember the years when they had comedy shows there. Hell, I even remember hosting my 21st bday there 14 years ago.  I moved out of Lansing 5 years ago and haven't been to this spot in years but today I decided to stop in with my dad to grab lunch.  BAD CHOICE.  Do yourself a favor folks and eat at Olga's next door if you are in the area and want some food.  The place was pretty dead with only a few patrons but it took over 30 minutes for us to get served a caesar salad and a burrito special.  Come on people.  I did however observe one of the staff people who was leaving take her baby to the kitchen and the woman who was working in the kitchen take time to coo and handle the baby right as she was about to start handling food again... so maybe that was part of the slow service.  Oh yeah and let me not forget to mention our server (who was very nice btw) grabbing food and putting it in his mouth in the kitchen before serving us, and having the other women who was working in the back grab a fry and put it in his mouth for him.  It just seemed like something was wrong with the entire picture and definitely not to code.  I saw them grab the food from the top where our food was placed so I am hoping this was not someones order but I am pretty sure it might have been.  This place needs to be BAR RESCUED asap!  As soon as we got in the car my dad said, \"Well, I will never go back there again\"... and my sentiments were the same."], ["Anne A.", "Over-priced jalapeno poppers appetizer at $7 and they were obviously frozen entrees from GFS or Costco.  Happy Hour $2.50 well drinks were served in tiny glasses with LOTS of ice.  Not even worth $2.50.  Two club sandwiches, appetizer and two happy hour drinks totaled $31.00.  Too pricey for the low quality."], ["Brian M.", "Ok food and ambience. If you're looking for a place to drink a few and eat some bar food in a strange town it's fine."], ["Erica D.", "This place is kind of a cluster-fork, but I always have a good time.The main dining/bar area is full of large and elongated tables, and you often end up sitting right next to a drunk international MSU student who you don't know or reconnecting with your current boyfriend's ex-girlfriend who can't find any where else to sit. Honestly, it kind of works! The service is actually good despite how busy and odd the seating is, but the place can get messy, and I've had the waitresses practically toss drinks at me because they have so much to balance at once and people hollering at them for more. The main draw for Tripper's is the HUGE poker room. It's a great spot for groups, but be sure you know how to play some kind of poker before taking a seat. It's not a written rule, but you'll be sitting with a bunch of drunk experienced players who don't want to wait for you to figure things out. Other than that, it's pretty neat-o. LADIES, PLEASE NOTE: the poker room is about 99% male every time I go... some times, it can be uncomfortable, so come with girlfriends.TIP: The teriyaki wings are out of this world. So craveable, and seriously recommended!"], ["Bar B.", "Seems like a buy life has left BBQ's to fend for themselves. I took advantage of the weekend to try a burger at a place that has been knocking for a while. Tripper's Sports Bar in Lansing has a good selection of burgs and beers.I have been here quite a few times and for some reason always gotten the nachos. Those are good to. Trippers is a big place with many large rooms kind of an open feeling but separate enough that there can be a plethora of activities happening without one spilling to another. It is a true sports bar around the bar proper with more TV's than a guy could pay attention to, my head was swiveling!A ton of beers on the menu, I went with the 'ol stand by Miller Lite 22oz for $.48 since I was the driver. Choosing the meal was tough. There were tons of options, some with pulled pork or jalapenos, and others that were more classic but loaded down. As is my unwritten rule I went with the egg anytime I can get an egg on my food I go for it. The Top 'o the Morning was for me. It is two patties, bacon 'Murican cheese, and a fried egg served up on some buttery Texas toast.Burger- 3Price- 3Service- 1.5Overall- 2.25All of the burgers can be made single, double, or triple. I just left mine the way it came as a double. At $10.39, it is a little costly but it did come with chips!Service on the other hand.... I frequent out A LOT, I don't really ask for much, keep the drink handy and just do regular things. For example, when you only have people t on table in our section, don't take a solid ten minutes to show up. If a guy orders a burger, don't make him have to ask for the condiments. We had a nice server, when she was there. Maybe these are just my little quirks when it comes to service, but hell, I have never worked that industry"], ["Erick P.", "Food is okay but over priced. The wait staff coukd be more attentive. The house chips were actually soggy with a few crispy ones. The entry is not inviting at all. Dirty in fact. Needs a good sweep and removal of the chewing gum. That's strike 3 for me. I'm outta here."], ["Andrew M.", "I've consistently experienced good service with an enjoyable meal. The prices for food and drinks are standard. The building is a large sports bar, so there are a variety of different ambiences to experience; whether you wish to be secluded or in the middle of the bar atmosphere."], ["Karen B.", "An average sports bar with ok food.  Service is slow but friendly.  It's a good place to watch a game with lots of tvs.  Hard to get a bad seat to see a big game."], ["Krystinah N.", "I've only been a handlful of times...each time I leave with a little buzz and a smile on my face. It's a good time at Trippers and I have met plenty of people from hanging out at this joint! There is TONS to do (billiards,darts, poker) and good bar food. I recommend the queso dip.  And with that, I say check it out! you always leave with a good memory to keep!"]], "Harrison Roadhouse": [], "Old Chicago": [], "Champps Restaurant & Bar": [], "Clara's Lansing Station": [], "Dusty's Cellar": [], "Corey's": [], "Houlihan's": [["Tracy P.", "Very nice. I was surprised it was a chain. The mushroom appetizer was killer! Service was some of the friendliest that I've ever experienced."], ["Catherine G.", "I really enjoy Houlihan's.  Even though it's a chain, it's still one of the only really original restaurants on the west-side. They do a great happy hour with drink and appetizer specials. Their menu is huge, but full of really interesting, well-made and great tasting food.  I love their Bruschetta with goat cheese .... mmmmm, so good!  The Chicken Lettuce Wraps are also amazing - great flavor, beautiful presentation.My boyfriend has been highly impressed with their French Dip.  Service can be hit or miss, but the atmosphere makes up for it.  I don't think it's boring at all ... it's much classier than Friday's."], ["Amy H.", "We go there and always get the Lavash and spinach dip, it is excellent!!  They also had a salad that had calamari and banana, sounds weird, but if you like calamari it is cooked perfectly not rubbery at all, great flavor combo.  We also have had the burgers on a great hand made bun, yum.  And the bar has excellent martini's.  Oh 1 more great thing, not sure if they still offer it, if not they need to bring it back,  dessert deconstructed smores. to die for!!!!  We have never had a bad thing yet."], ["Dori D.", "The food was good but service was horrible. It took about 6 minutes before some one noticed we needed to be seated. 10 minutes before someone took our food order. Just as my friend asked me if I wanted to go somewhere else the waitress finally came over.  And the best part is we were 1 of 4 tables so I will never go there again."], ["Lorilea Z.", "One of my favorite places in Lansing. They have the BEST happy hours (4-7 and 9-cl) and an amazing, affordable menu. I've never had a bad experience and always have a great time with my friends. Also, if you sign up on their website you'll receive special deals on Wednesdays!"], ["teresa g.", "Don't even think of getting a gift certificate here - you are banned from any specials if you try to use your GC and are better off dining without one.  Customer service is nil - we were forbidden to use our GC towards the Sun/Mon meal menu even though you didn't need any coupon to order the special - every other diner could order it off the menu (so why couldn't we use our GC towards it?).  Management would not budge, even in this economy and never followed up by phone, as promised.   We will never return and we will never get or give a gift certificate again.  Waitress gave minimal service since her tip was already guaranteed to be 18% per the GC.  The entire experience made the food taste bad - I'm not even sure if it was good food or not, but the experience surely left a \"bad taste\" in our mouths!"], ["Ania S.", "I have always loved this place, even though I shy away from chains. They never fail to deliver great food. The only suggestion I have for Houlihan's is for them to add some lower calorie menu options. Even the items on the menu that sound healthy aren't. There are not many meals here to be had for under a 1,000 calories."], ["Lindsey K.", "I went to Houlihan's today for the 1,035th  time for happy hour. They have tasty food and great happy hour specials. I really like their creative mixed drinks, today the hit was the basil strawberry lemonade. My main complaint is with their service. We had a large group coming, but since less than \"half\" of the group was there they would not allow us to have a large table. Then once the majority of the group arrived, we asked if we could move to a larger table. The waitress insinuated that we were trying to take the table next to us away from another customer (which we were not) and finally offered to move some other tables together. The waitress was very busy and did not check on our table as often as she should have. At the end when we asked for our bills, they had taken the liberty to write in the gratuity (by hand) on the checks. Funny, because I would have given more than they had written- but since they had already decided- fine.... I'll go with what they wrote in. Next time I might go somewhere that is a little friendlier."], ["Heather F.", "love love love!!!!!! Half off wine is the best and join the email list and you get the nightly specials sent to you and free meals on your birthday and many other bonuses.  Service is great too."], ["Matt R.", "Since I am \"Reppin the East Siiide\" as you can see on my profile, I don't get to the West Siiide too often. This was a nice surprise. I havent been to Houlihans in probably 10 years and forgot that it was a pretty cool place. If ya like TGI Fridays, ya might be disappointed with the inside of Houlihans, it is much more boring. The food is very good and they have a 15 minute lunch guarantee for the workin folks...I had some kind of southwest wrap, very decent and lightning fast on the delivery. In the words of Arnold S. \"I'll be baaacck\""], ["Shelli R.", "Half off cocktails and lettuce wraps. Mmm good.  Great place to grab a drink and snack with your buds.  Great server staff!"], ["Bruce S.", "i go there once a week for the last 2 years have never had a bad meal the service is always great."]], "HopCat": [["Angela M.", "Host was absolutely unpleasant. I don't know what her problem was but she was unbearably rude. She was in a long grey(or light green) oversized sweater thing and green shirt and was just mean. Our server was GREAT though, a cute little pumpkin.The food was good and so was our server. The host needs a rain check though. :)  8/26th/15"], ["Ashley S.", "The service has been inconsistent, causing me to have mixed feelings about this place.  My first experience at HopCat was great. Interesting selection of beer and the buffalo chicken rolls were AMAZING.  The fish& Chips, and crack fries were also pretty good. Second time around I had tried the pita chips and beerbar cheese. Ehh.. Big mistake. The pita chips tasted stale and the beerbar cheese is cold and chunky. It's like horseradish + cottage cheese. During my third visit is when I experienced the most problems. Our server seemed annoyed and didn't want to be there. She brought our beer in different glasses than listed on the menu. It's not a huge deal but it was a few ounces smaller. When we asked her about it she said sometimes the bartenders get confused but it's still the correct beer. We were still charged full price even though they were smaller. That night I also ordered the \"swiss, cheddar, feta, tomato and onion Grilled Cheese\". Sounds like an awesome grilled cheese! If only if were grilled... The cheese wasn't even melted.  I took my entire sandwich home and grilled it myself. (fully cooked it was actually really good). A huge sign that a customer isn't enjoying their food is when they don't even eat it. HopCat has the potential to be great but they seem to go downhill once they get busy."], ["Melissa D.", "Beer (even for craft brew) is overly pricey. Bar service was slow. On the plus side they have a large selection of beer and plenty of bar seating."], ["John K.", "I like Hop Cat I Grand Rapids and this one in East Lansing is ok but has a much different \"vibe\" and decor. Convenient from MSUs campus and has a parking garage pretty much next door so you can find a nearby parking spot pretty easily. It was busy on this visit but it was the other time I was here as well. Our waitress isn't that great, taking a LONG time between being seated and taking our drink order and then another long wait just to get the beer each of us ordered. Waiting on food but hasn't been that long...yet. So great place for lots of beer variety and a decent food menu, but today at least, not impressed with attentiveness or speed of service."], ["Tara L.", "3.5 starsWe had gone to the original location in Grand Rapids about a month ago, and had a fun time, so needless to say, we were stoked that they were going to open up a closer location in East Lansing near MSU.On the agenda was to actually eat something, as our first visit to the GRR location was just about trying out some drinks and hanging out. So, we along with two other friends met up at 11am on a Saturday to enjoy some grub.The location is convenient to the stadium at MSU, so if you're looking to tailgate, this is another place to consider. Parking is pretty affordable at the Grove St. parking garage, and right adjacent to the restaurant. Upon entering, you'll see the HopCat restaurant signage along a concrete building. I'm not sure if this is standard protocol, but on the day we went, they checked ID before you could even enter the restaurant. I'm guessing that it was only because there was a football game going on, but be prepared if this happens on a daily basis.Since we arrived earlier in the day, we didn't have to wait to be seated. Once seated, our friendly server came by with menus and we had a look. After much thought, Husband and I went with The Classic burger ($8.95), and the Dam Good Fish sandwich ($9.95). Each came with a side of crack fries, but you could add a cup of soup, side salad, or Mac and cheese for an additional $2.95.While we were waiting, we sampled some of their extensive beer options. I tried the raspberry ale, and Husband had a grapefruit ale. Both were great tasting on its own, but paired even better with the food. Since I'm not a big drinker, I had a half, and it was $3. (Size a little bigger than a shot) Husband had a full and it was $7 for 16 oz.Food came out about 15 minutes after we placed our orders, and it looked great. I loved my fish sandwich because of the spicy and smoky paprika they used to season the tilapia. The breading was super light, and the fish meat was very moist. I loved the housemade tartar sauce, as it provided the perfect pickled undertone needed with the fish. The red onion was crunchy and the lettuce tomato were crisp. The toasted brioche bun was light and fluffy, and slightly crunchy..liked it a lot. Great balance, and definitely worth ordering if you're a fan of fish sandwiches. Husbands burger looked great, and the portion was standard, and the burger patty was cooked perfectly at medium. Once we added some Tabasco to the pepper jack lettuce and tomato combo, the flavor was just right. Crack fries were just that, addicting!!! Salt, pepper, and sugar make it very irresistible. I can't imagine what it's like loaded.We'd come back if we were in the neck of the woods, but don't expect the decor and ambiance to be the same as the Grand Rapids location. This one is definitely tailored to the University crowd. But for bar food? It is pretty good."], ["Megan K.", "I've been to Hopcat twice now but the first time I only ordered an appetizer so I wanted to hold out for the review until I actually ate an entrée. Both times there was a short wait but the servers have always been friendly and prompt. The restaurant has a laidback vibe to it, I can't explain. It's not divey, it's not pretentious, but it's not overly rowdy either. Now, I don't even really like beer that much, but I like this place. There are so many beers on tap that even I can find something I like. The wheat beers and fruit beers are my favorite. The first time I went, my boyfriend and I shared the beerbar cheese. Yeah, skip that shit, it sucks. The menu says \"cheese with a zip\", I guess I was expecting a zesty, spicy cheese. Nope, it's horseradish with chunky, cold cheese. Not good. The second time, I got the beef sandwich. The meat is marinated in beer, caramelized, put on a bun with blue cheese peppercorn spread, and fried onions. It's pretty much the best thing ever. The fries were pretty good too."], ["Lindsey A.", "Work out your service kinks and I think we can be 5-star friends, Hop Cat, but yesterday, one of my tacos went ice-cold by the time my extra cheese sauce arrived, and, well, that's just no fun.I graduated from MSU in 2005 and there was nothing near Hop Cat in the city. Maybe Harper's, but that's a stretch as their beer selection pales in comparison to the Cat's. I mean, Short's Soft Parade ALWAYS on tap?! I'm sold.But the two times I've made a stop in EL whilst driving back to Chicago, the service has been lackluster... or just lacking. I know our waiter was SLAMMED yesterday - which, management, why is he busing his own tables? You should have busers just like you have food servers....... but, my food went damn near frozen while waiting for some extra cheese sauce. Then, despite it taking well over 10 minutes to get the sauce, he still charged me a dollar for it. Come on, knock the sauce off and maybe we'd see 4 stars up there.The food is great - fattening, delicious, hangover-sopping-up goodness. The beers are out of this world. The space is 'cool' and huge and the music on Sunday was spot-on.We weren't in a hurry, which I'm glad we weren't, but if you are.... maybe look elsewhere."], ["Tabitha M.", "First, it's a great space located right next to a parking garage.  I love the decor (think vintage fashion mags in the ladies room and playboy's in the mens).  Comfy high top seating (and since not all of my party was present when I arrived, the host asked if a high table would be okay).  We had brunch, which was delicious. 2 apps, 3 entrees and 2 1/2 beers for $65.  I'd go back again in a heartbeat."], ["Christopher N.", "Stellar selection of beer.  The menu showcases the local offerings for a traveler like me.  The olive burger, while not the healthiest fare, was delicious and cooked perfectly.  It was hard to get a seat as a \"party\" of one."], ["Bee S.", "Soooo jealous this wasn't here when I was at MSU. Went here before a football game recently with some friends and loved it. I had been to the one in Grand Rapids and liked it, but this one definitely has a different feel. More college-y and less hipster I guess. 2-stories, and all the windows on the lower level make it feel really open and spacious. The beer menu is fantastic. I love that it promotes tons of locally brewed beers in Michigan. The food was good too - I got the quesadilla and maybe it's the beer talking, but it was THE BEST QUESADILLA EVER. Seriously. The spicy black beans made it for me. Everyone else got a burger with the crack fries, and although I'm not a huge french fry person, those fries were indeed CRACK FRIES. Really peppery and yummy. The kitchen and waitresses were slammed due to the game, but our waitress was freaking awesome, running around and doing her absolute best. It may have taken a while to get our food, but honestly, it's not like we were in a hurry and I know the staff was all working hard, so gotta give credit where credit is due. Overall, great time. If I still lived in EL, this would be a regular spot for sure. Especially since it's within walking distance to everything and right in the niche of EL nightlife anyway."], ["Jamie P.", "Yes, go.  I've been twice.  The Damn Good Fish Sandwich is well...good.  The second visit I went out on a limb and got the Pork Sandwich that Knocks.  My waitress advised it was very large so I had it cut in half.  I'm glad I did.  I had only eaten 2 small pretzel nuggets and I could barely finish the 1st half. My mouth waters thinking about it.I'm not big on the crack fries, but they are not bad.  The pretzel bites are wonderful fresh out the oven.  The holiday beer/shake menu looked amazing.  Unfortunately I was here during work hours so I couldn't try any.  They have a special event they advertised for in January where the dessert is bacon wrapped chocolate stuffed dates.  OMG If you have a problem talk with management politely about it.  I would also suggest that if you are on a time limit to notify your server as soon as they arrive."], ["Bob J.", "The beer alone is 5-stars. They have lots of hard-to-find brews on tap. For instance, I had Dogfish Head's 120-minute IPA and their Raison d'Extra, both 18% ABV, in the same meal. Their fries and cheese sauce are also great, as is the friendly staff.However, there are many menu errors that make this not a 5-star place. The vegetarian chili came with sour cream (which my girlfriend hates), but that was not listed. The website also said the 120-minute was in a 10-oz snifter, but we were given the tiny 5-oz sampler glasses. Also tonight, my medium rare Cowboy burger was a bit overdone, cooked at a medium, with no detectable BBQ sauce.Overall we'll be returning many times. It's a great place, as long as it's not packed with college kids..."], ["Abigail L.", "I LOVE HopCat.  This place has only been around for a year, but it's just glorious. So much craft beer.  So much Michigan craft beer.  It rotates and they always have a selection of seasonal beers.  I can't get over how truly amazing this bar is.  And the food is always A+.  I recommend the loaded crack fries and the classic burger, but also the cheese ale soup if you're looking for something more to eat.I could talk about the service for ages, the waitstaff is busy but no matter what always manages to serve you in a reasonable amount of time.  I've always had very friendly service and due to the large (somewhat intimidating) beer menu, the servers are always very good for a recommendation.The music can be pretty loud at night and in the evening, but earlier in the day it's a bit softer.  The many televisions upstairs are great for watching games and honestly, so is the bar, but the nice thing about the second floor is you can arrange the tables (or have them arranged) to view the TV how you like when your game is on.There isn't very much by way of street parking but there is a parking lot and a parking garage close by, though you have to pay by the half hour to park there - Sunday is free parking though, just like the rest of East Lansing.  Another good thing to remember is that minors/anyone under the age of 21 needs to be accompanied by someone over the age of 21 before 10 pm and if you look old enough, you'll be carded to enter.  No cover, just to make things run smoothly."], ["E G.", "Outstanding variety of brews. Great food. Loaded sloppy Crack Fries...need I say more. Tasting dinners are FUN!  Great service during normal hours. Managers know how to recover from a service oops. We were VERY impressed!"], ["Lylian D.", "Hop Cat has an awesome selection of beers. I have only had the Crack fries here, but if the Crack fries are any indication of how good the food can be, then I will definitely be back to try other items on the menu. Hop Cat is a great place to go for a chill night of drinking over a basket of their addicting Crack Fries. My sister let me know that during the weekdays from 4-6 Hop Cat has a burger and beer deal for only $6! She said the burger is pretty good, but I am going to have to try it for myself."], ["Becky F.", "Great beer and food. Service is slow when it's really busy. Love the crack fries and fish tacos."], ["Matt C.", "Best burger deal in town from 4-6 PM M-F. Largest tap selection in town, but you pay the price. Happy hour is limited to the \"standard 20,\" and it has the worst hours (2-4, M-F). Most of the sandwiches are dry, but the stars are for the knowledgeable beer servers and excellent staff: Fast, efficient, and knowledgable. The Bloody Mary bar on Sunday is spectacular, especially with the infused tequilas. I know that sounds wrong, but it's awesome."], ["Josh G.", "This was a pleasant surprise. I ordered the Angry Bird and the chicken was grilled to perfection! The sauce had the perfect hint of spice and tang. The fries were also crispy, which I like and tasted great with the buffalo wing style sauce that came with the sandwich. Overall, a great dive with even greater food and drink. Definitely coming back again!"], ["Ashley Z.", "Absolutely love this place. The burgers and the crack fries are just unreal. So delish and yummy. I would def recommend to a friend"], ["Andy R.", "We're from out of town and looking for a late lunch. Two different people recommend HopCat. So why not? Bonus: M-F 2pm-4pm $3 beers from their top 20 list stocked with great selection of Michigan beer. Crack fries, meh, maybe I'm the only person who doesn't love them? The fries were OK, I must have gotten a soggy batch. The burger was the star attraction: Nach-Yo burger with avocado and pepper jack cheese is a nice pairing. Server was prompt with drinks and taking orders, but two small downers: the food did not all arrive at the same time and the beers were not topped off. Visited again the next night for more beer. Sat near the bar. Great server with good knowledge of the beer. Beer selections alone makes this an easy four stars."]], "Coach's All American Pub & Grill": []}