{"Ozzys Kabob": [["Matthew S.", "I don't know what to say.  The food is delicious. The young fellas waiting on you are passionate about the food and friendly to their customers.  The garlic sauce is delicious. The lunch buffet is delicious.I worked at Stillwater, the restaurant next door.  I used to eat at Ozzys all the time before and after work. Great food!"], ["Erik R.", "I had never been to this restaurant before. Went here one evening because I was craving a chicken shawarma and it was the closest location to my home. I ordered 2 chicken shawarma sandwiches and they were the most disgusting shawarmas I have ever had. Being from the Metro Detroit area, there are some very good spots back home (Dearborn,Southfield). The chicken had a burnt taste to it and the sandwich barely had any garlic spread on it. The lettuce tasted old as if it had been in the fridge for weeks. All in all, will NOT be returning to this location."], ["J H.", "Delicious lunch stop as we head N on vacation.Kabobs were succulent. Gyros were very flavorful. Lentil soup was just right - took off the hunger edge after some hours on the road.Service was prompt and friendly. Ahmad's very engaging. We'll make this a regular stop on our way through greater Lansing."], ["Quinn M.", "Best chicken schwarma wrap in town, oh and don't forget about the hummus. Not onlyis the food excellent, but the customer service is top notch. They want you to feel at home and they do a very good job of accomplishing this.If you're looking for an authentic, healthy substitute, this would be the destination point. Highly recommended!"], ["Takeya M.", "Was in town for a business trip and decided I didn't want fast food from a chain restaurant so gave Ozzy's a try. Really friendly service and great tasting food. I got the lamb kabob with veggies and the Lebanese salad. The food was well flavored but the veggies were kind of swimming in oil; so much that I had to drain my take out container before I could eat. That was my only minus. Overall, it was good tasting food and not too costly."], ["MaryBeth B.", "Great price for a quick Mediterranian lunch.  The chicken was delicious.  I suggest you avoid going at the traditional lunch hour or you will wait for refills.  They do small portions on the buffet so it doesn't go bad.  There is a deep fried egg plant which was out of this world.  It was cut like potato chip, but seasoned just right.  The hummus was really good."], ["Skip B.", "Best kept secret in Okemos.  In the strip mall right next to the Grand Traverse Pie Co. GREAT Mediterranean food and very reasonable prices.  Outstanding beef and lamb kabobs Relly good Gryo's (I get the platter not a true Gyro)Good Lamb Chops but I like the Kabobs better since the meat is cut up for you.Their chicken noodle soup is very flavorful and lots of actual chicken meat in it..big chunks.I travel to Okemos every week for business and eat here at least once and often twice a weekFast but not \"fast food\", always cooked to orderGreat at lunch or dinner.  I have not done the lunch buffet, I prefer to order from the menu.Tip: when you want real food not Soup, Sandwhich, Salad eat dinner at Ozzy's then bop next door for pie to eat in or take home"], ["Kevin W.", "Went back again yesterday.  Same review.  Great chow.  Hot and fresh.  The place is spotless clean too."], ["Rick L.", "A quick lunch at a \"kabob\" place.  A lamb kabob plate comes w/soup or salad, hummus, rice, and a skewer w/lamb, yellow pepper, and onion.  Had the lentil soup which was a little thin but flavorful. Kabob done to order w/light seasoning. Hummus very good w/a nice olive oil on top.  Rice was plentiful and okay.  Had a good tahini sauce on the side. A complimentary (small) piece of excellent, not too sweet, baklava topped it off. In and out in less than 30 minutes but never felt rushed.  At $11.64 (sans tip), a good deal all around!"], ["Terry P.", "Great food very fresh chicken kebab everything was so good service was so good definitely  come back again"], ["Iman B.", "It is a very good buffet and the food diversity is very good. I like the desert there. The servers are very nice. It is a very good place for groups. The quality is also good."], ["Crystal S.", "I could attest to the quality of the food, which in my opinion is the best of the Middle Eastern restaurants around.  I could mention how the attitude of the waitstaff and managers appears to be that of people who really care about the quality and reputation of the restaurant and seem to offer the guest an insight to the lost art of customer service.  Instead I will tell you a story of how they went out of their way to accommodate a desperate and hungry customer (me).     I live in Alaeidon Township (between Mason and Okemos) and am always out of everyone's delivery range by 1 mile, except a single pizza place.  We didn't have time to cook and REALLY didn't want pizza so I thought I'd disappoint myself and have one other company tell me they can't reach me.  I called Ozzy's.  They said to call their delivery company Mr. Delivery or Special Delivery, which I did.  Mr. Delivery couldn't find me and Special Delivery said I was out of range.  I called back Ozzy's to say neither of the two could get to me.  The gentleman on the line asked me for my number and said he could get one of them to deliver.  Sure enough about 10 minutes later he had managed to convince Special Delivery to travel the extra 3 minutes and deliver to my address.  I ordered my food and 45 minutes later had an amazing meal.  Thank you again to Ozzy's Kabob for making my night so much better.  And yes the delivery guy who went the extra mile (literally and figuratively) got the extra tip."], ["Jonathan R.", "Very nice surprise in Okemos. Ozzy's just made me a great first-visit dinner, even better than I'd hoped, and did it with carry out that got home as wonderful as if it was just served in the restaurant.   Char-grilled lamb tenderloin was tender, cooked exactly as ordered. Lamb tenderloin is not an every day dish around here, and I would go back just for this.  Another hit? Crispy eggplant.  Delicious, and got home crispy. Nothing gets home crispy, but hot and tender.  Again, Ozzy's did.  Fattoush was a crunchy, cold chopped salad, and seasoning a fresh treat.  Garlic sauce just right. Support a friendly, long-time local family owned business. Also, immaculate. You will enjoy it."], ["Lilyan T.", "Ozzy's is pretty great. I live a minute away so I frequent this place. If you have a free afternoon, stop in for their lunch buffet, it's amazing. They have different salads, hummus, four different soups, three different types of rice, three different types of chicken, three different types of sauces with veggies mixed in and always a diff dessert. It's only $9.99 for a lunch buffet, super affordable. I have also been in for dinner where the service is a littler slower. The only \"down side\" about this place is the strong mothball smell that overpowers when you first come in. It tends to dissipate as you dine but it is pretty weird."], ["Derrick C.", "Best Mediterranean restaurant around! Anything and everything I have tried had been more than outstanding. The chefs work as hard as they can to bring the food out as fast and as fresh as possible. I've never been given food that is not hot enough to burn my tongue. Prices are very reasonable and you could say it's easily a steal. The servers make you as welcome as possible and try to make sure your experience there is no worse than amazing. I recommend the Moe's Special with a Greek Salad as a side. The chicken is seasoned perfectly with their blend of spices and the Greek salad tastes crisp and fresh. If you're a vegetarian, no problem! Order the vegi grape leaves and I promise you won't be let down. The grape leaves go perfectly with their homemade hummus! Lastly, if you're looking for a sweet dessert, order their baklava! They make it fresh and its homemade unless you want the prepackaged baklava which isn't! I recommend the homemade baklava. At 75 cents each you can't go wrong with the crunch of the layer upon layers of crust and the sweet crunchy yet tender inside of nuts and sugar! Make sure if you're ever in the mood for Mediterranean go over to ozzy's because it always hits the spot!"], ["Raymond G.", "Had the falafel sammy (added hummus and tabouli) with side of hummus. Falafel was super fresh tasting and perfectly fried, and the tabouli was very fresh and flavorful. They even gave us 2 small pieces of baklava with our bill (also delicious)."], ["Becky L.", "Hidden Gem! Great food, awesome lunch buffet"], ["J C.", "This is a 3.5 stars for Ozzy's. But we all know that Yelp doesn't put up with the half star crap.Service is friendly and timely. The employees are nice and in the duration that I was there the people who were coming and going seemed like they all knew each other.. So that's always a good sign. The food was good. I just tried the wknd buffet and they have a decent spread. I guess for me it didn't really knock me out of the park. I love lentil soup but theirs was not lentil-y enough - so that's my only complaint on the buffet.The bottom line is, if someone picked this place and I had to go here you wouldn't have to twist my arm, but it wouldn't be my first choice."], ["Domenic C.", "I found Ozzy's as I was about to enter another restaurant and I'm delighted that I decided to dine here. The food is excellent!I had the salmon steak that was cooked perfectly as were the grilled veggies and rice. For starters I ordered the grape leave combo that was served with elegantly thin pita and a generous serving of hummus. Both were delicious! Also, the Lebanese salad and lentil soup that came with the entrée' were perfectly seasoned in a classic Mediterranean fashion. The experience was authentic, the facility immaculate and the servers had great knowledge of the menu and were wonderfully pleasant!!"], ["Frederick F.", "Okay, I'm serious:  they serve four soups here (chicken noodle, lentil, cabbage, and vegetable.  All four are among the best soups in the East Lansing, Okemos area.  The lunch buffet is an outstanding value and is loaded with great food.You will not be disappointed here.  It's delicious.  And there are no annoying TVs blaring on the walls."], ["Liz A.", "much like the insane tap lists here in michigan, i cannot get over the ridiculous number of awesome lebanese restaurants.  i really should not be surprised because a) i am lebanese and b) i know that detroit has the largest middle eastern population outside of the middle east.  but i am in shock in the best way possible, probably because i went so long being deprived of regular access to above mediocre hummus and non smushy falafel.we had a going away lunch a few days ago at work and went to a place i had never heard of called ozzy's kabob.  although my coworkers laughed at me for taking pictures of my food while regaling me with stories of getting hit on and/or proposed to by clients, i had to.  it was ridiculous!  i knew you guys needed to see this to believe it.ok so this place takes it a step further than just insanely amazing and comprehensive lebanese food (they had kusa!!!).  they have a $7.99 lunch buffet.  yes.  you read that right.  all you can eat competely off the hook baba ghannouj and shawarma (with garlic sauce!) and cucumber and tomato salad.  i mean come on!i tried to eat a lot but i could only get through two courses.  i need to go back.  unfortunately they don't have the buffet at dinner but i am sure i can make do.service was good and the price was clearly right.  go.  now."], ["Robert W.", "Second year in a row we stopped into this place for dinner on our trek 'up north'.  Food is fresh and good. Although we were hungry, we decided to only get the 'sandwiches' (back of the menu) in lieu of entrees and augment it with a large hummus appetizer. I went with the Lamb, my wife the chicken and a fatoosh salad. Kids went for the soups. Service was great and friendly. This restaurant was called something else when we popped in last year- enjoyed it then too.  All said, fed the family great/healthy food at reasonable price.  Nice break from the road!was great and friendly. Was called something else when we popped in last year.  All said, fed the family great/healthy food at reasonable price.  Nice break from the road trip."], ["Georgia W.", "I visited the first time today.  It was delicious and inexpensive.  The Falafel was fresh out of the fryer, crispy, and not too dry.  Salad was also very fresh and light.  Think my fav was the chargrilled chicken with sauce they had on the side.  The place was packed for the lunch buffet.  The staff was very friendly to everyone and kept it moving very efficiently.  Will definitely be back."], ["Robert K.", "Stopped here on a whim for lunch with some friends.The lunch buffet is reasonably priced at $7.99.I tried the felafel, boneless chicken, rice and the hummus.The felafel was fresh outta the frier and delicious...crispy and flavorful!Everything else was good.Nice variety of food and flavors available.I stuck with my go-to and was not disappointed.I will put this in the rotation based on the felafel alone!"], ["Sammi D.", "I usually go to their weekend buffet...a variety of choices and delicious baklava for dessert included! I highly recommend the buffet that way you can sample a variety of their foods!"], ["Alison G.", "I have been here a few times. We went last night.  We had their 9.99 dinner buffet. Kids ate it also for 4.99 or 5.99, can't remember. The buffet was delicious.  It was definitely the best dinner I've had in a while. We'll be back."], ["David M.", "I go here when I am In twin which is 2-3 a month.  I get take take out.  Always prepared the way I like it.  Lamb gyro and shank are outstanding.  Nice friendly staff."], ["Scott S.", "Uh, what's up with the good reviews? Buffet was small, no lamb or beef on it.  Gyro meat was dry, served in a Shawarma, not Pita, light on the meat and Tzatziki, heavy on lettuce.  Dang, We have better in TX, and I expected good in MI.Why come here? Gotta be better places nearby, if not head east my friend, head east..."], ["Chin-Jung L.", "This is a really nice restaurant. Nice staff. Good environment. I went for Lunch buffet for two days in a row. The felafel's are awesome. I like to dip them with their garlic sauce. I also like their boneless chicken. Their desserts is very good. I do not remember the name. I think it is walnut/peanut mixture covered with crispy sugar. It is flavorful, but not too sweet. Weekday lunch buffet is $7.99 plus tax and Weekend buffet is $9.99."], ["Margie P.", "This place is awesome!!! The chicken is out of this world better than Dearborn. I mean, everything is good!  And the buffet is ridiculously cheap!  Just go. Stop what you are doing and go. Now."], ["Judie B.", "AWFUL, AWFUL, AWFUL!. rice was tasteless and the chicken smelled bad!  Did I say it was awful awful awful ....nasty. Save your time and money. Go somewhere else."], ["Ahmad E.", "We have only been open for a few weeks and have great food we have a buffet fron 11 to 3 every day and an all day weekend buffet we also have a full menu all day every day come in and try us out"]], "Aladdin's Express": [["Tim T.", "Fresh,clean, fast, and friendly. Gyro was tasty. Authentic middle eastern food at a fair price. I would recommend for lunch moderate line but quick service."], ["Daniel S.", "Pretty good Middle Eastern on Washington Square. Quite tasty, but not the absolute greatest we have available here in Michigan. I love that there are so many vegetarian options. The dining room is very nicely decorated."], ["Chris M.", "I come from the West Coast, so in reality we don't have as much Middle Eastern food options like here in the East.  Which is a pity, because it's quite delicious, and Aladdin's is a great primer.  I have stopped pretty consistently at least once or twice a month, mainly for the shwarma, but also their various spicy meats and pita bread.  Love their rice and salads too.Great food at a great value, and the staff are always very friendly."], ["Kelly I.", "Nicely decorated restaurant, the indoor waterfall is a nice touch. I ordered lamb kabob over rice and a surfing dude smoothie... or so I thought. I've been craving lamb all day which brought me to this restaurant,  but when I received my dish,  I realized it was chicken a bite in. When I expressed my concern,  the girl at the cashier told me I had ordered chicken, and said it was too late for me to change it.  Yet a lady came in while I was waiting for food returning her food, because a mixup as well. Must happen often. I ate all of my food anyways, but was turned off by the customer service. The food was pretty good regardless (in Lansing terms I guess), and I probably would have generously given 4 stars, had it not been for the mix up situation."], ["Stephanie M.", "You know there's going to be issues when you show up at 1:30pm on a Friday to an empty restaurant.  And then when you ask for 2 orders of Chicken Kabobs and are told that they only have enough chicken for 1 order.  Really?  On a Friday?  At 1:30pm?"], ["Alessa T.", "Fabulous middle eastern food! Lots of vegetarian and vegan options, beautiful decor, fast and friendly service, and the cheapest smoothies in town! Everything is fresh and healthy. This is my favorite lunch spot for work days."], ["Rebecca G.", "By far the best middle eastern restaurant in downtown Lansing. The staff is friendly and always remembers a face. I don't venture too far on the menu because I'm one of these people that if I discover something I like, I stick with it. The chicken schawarma salad or chicken and rice are always my go to dishes. I recently discovered and fell in love with their lentil soup as well.  The lighting in the restaurant is a little on the dark side but along with the decor, it creates a bit more of an intimate atmosphere. I definitely recommend this place!"], ["Carrielle B.", "Let me start by saying that I am very picky when it comes to gyros. I am new to the area and there is a place back home I frequented that no other gyros have ever measured up to. I went to Aladdin's with low expectations.That being said, Aladdin's actually topped them! This was the best gyro I have ever had, hand's down. I work downtown so I walked in at lunchtime. I was so impressed with the service too. Fast and friendly. The gyro comes with a soup or salad and since they found out I was a new customer they gave me both at no extra charge! Way more food than I can eat but it was cool of them to do. They are Mediterranean/middle-eastern folks who run the place so you know you're getting authentic. I know this may be a silly thing to get excited about but the pita the gyro was on was grilled and that seemed like a nice touch. It really did make the gyro better!"], ["Ceci N.", "Great place for a lunch break!  My coworkers and I order from here regularly.  The staff is always friendly and while I might enjoy more options, this is express and they do get you in and out fast.  The hummus is great, and I'm addicted to the Shawarma.  They offer a frequent purchase program that gets you a free lunch as well."], ["Lorraine H.", "Went for beef shawarma but they were out. He recommended the lamb kabobs so I said yes - might as well try something new. Oh my, sorry to say they were disappointing. Tough and chewy, too much inedible grisly lines throughout. Only about half of it was edible.  However.  I still like it for everything else I've tried, and am willing to try new dishes to \"expand my palate.\"  One disappointing dish isn't enough to keep my away from Aladdin's."]], "Delhi Cafe": [], "Restaurant Mediteran": [], "Mancino's": [], "Coral Gables": [], "Woody's Oasis": [], "Olga's Kitchen": [], "Zeus Greecian Island": [["Andrea J.", "I was impressed with Zeus'! I called in 7 orders and picked them up (via the drive thru window!). Everything was ready quickly and piping hot. Every order was correct and I had some complicated orders!I couldn't get over the size of the salads. I ordered a medium greek salad with chicken (made with spinach instead of mixed greens). I had 6-7 large and well seasoned grilled chicken tenders, lots of feta cheese and chick peas. The dressing was flavorful and perfect for the salad as well as dipping pita bread into. This was a very delicious salad and I will be returning on my next visit to Lansing!"], ["Randy A.", "I am still a fan of this place...Sometimes i swing thru the drivethru and get a gyro supreme,,,, take home and savor everybite....its so fresh,,,and it costs less than i would spend at wendys!Or stop in and try out the friendly fast service....this place remains a great local eatery. ;-)"], ["Melinda P.", "Seriously disappointed. Bought two Coneys that were so hard and rubbery that it practically crunched and the chili was tasteless. Not worth it and won't be stopping in again"], ["Lauren C.", "So first the GREEK salad doesn't come with beets and they didn't put salad dressing in my carry out.  I call and they say are going to give me a free salad.  Fine.  But then they call back and have the nerve to leave me a voicemail and say I won't get a free salad.   ???????!!!!!!!!!!!"], ["Beau M.", "This is my favorite Coney Island period. My wife and I are originally from Michigan. We moved to Georgia several years back and now back to Michigan. During our stay in Georgia we would come home 3 times a year for almost a week at a time. During that week every time I would go to Zeus at least 4 to 7 times. This place is great. Can't get enough of it. As a matter of fact I'll go there today."], ["Cari S.", "This place is never less than half full. We have been here multiple times at different times of the day. And they're always busy. Their service is always prompt and friendly. Their food is anywhere from acceptable to fantastic, depending on what you order. I personally love this place. They're one of the few people who can cook salmon to perfection. I hate dry salmon and theirs is always fantastic."], ["Douglas S.", "Great addition to the Lansing area, well, far south Lansing.  Get a Coney and some fries!  Coneys are the Detroit Style, so get your forks and spoons out!  Very tasty and a large menu filled with both Greek and American fare, all served in a cosy, usually packed diner style restaurant."], ["Ken B.", "Typical Greek coney joint. I had the gyros and it was not the best but really hit the spot. Service was outstanding even though the place was jammed with customers.If I am ever in the area again it is on my list of places to stop."], ["Danno W.", "I always order fro the daily menu and always satisfied.  I ordered the chopped steak w/mash /gravy/veg, comes with fresh bread.  The food came out piping hot as well portioned, and was fantastic.  This place keeps me alive! Good Job."], ["Chuck T.", "Great philly cheesesteak. Also the slimjim ham sandwich is really good. Usually really great service and pretty fast, Super cheap breakfast combos and the sausage egg English muffin sandwich tastes like you made it at home. Lunch times can be packed, but def worth trying out."], ["Gary E.", "Very good food for the price. Good service too ask for Ashley the black waitress. I say that because there are 2 and 1 is white just the facts people."], ["Scott H.", "We arrived with high hopes, we love the greek coney islands in the Detroit area and hoped this would be as good.  The restaurant was a mess, the floors were dirty, the tables were not very clean.  Had a hard time finding a good chair to hang our coats on that would not be in the trash on the floor.Ordered the Gyro, the meat was ok but looked like it was not fresh cut, the cucumber sauce was watered down and they used white onions not red like the menu said.  For what we got this was way over priced.  We also ordered a loose meat coney dog, the ground beef was flavorless, watered down and cold.My soup the waitress failed to realize she slopped on one side and did not clean up the cup.  And speaking of the staff, there were 4 waitresses standing around talking and ignoring us when we were right in front of them with out menus down.  The bus boy was standing around wiped food onto the floor when cleaning a table but did not sweep up after himself."], ["Randy A.", "I love this place, Ive been going here for a while now. Friendly staff, I go with a few favorites......Philly steak,,yum,,gyro supreme,,saleds,...coney dogs...Great comfort food. Never disapointed."], ["Mike J.", "Seriously? You guys gave this place 4.5 stars? Have any of you ever actually been to a Greek restaurant? It's all Sysco crap. If Chef Boyardee made Moussaka, this is exactly what it would taste like. Also, spinach pie is not supposed to be made with Velveeta. I would give it no stars, but the water was cold and the service was good."], ["Bruce E.", "I've been here a couple of times and I love the food! Especially the breakfast. Although I saw a lemon rice soup picture on here that looked amazing and I got a little excited about it."], ["Joey R.", "Always go here when I visit up north.  Year after year the same great.  Coney's, breakfast, corned beef, Greek chicken, gyros...its all good. They make everything they serve.  Bread salad dressing rice.  Go!  Wish it were in Houston."], ["Kimberly B.", "Been here 3-4 times. Every time I've been I've had the coney's. I've tried them just as loose meat. Had no flavor it was just like eating browned hamburger no seasoning. I've tried the chilli sauce. It was blah. I've even had them put both loose meat & chilli sauce on them to give them flavor. No luck the coney's were still gross. I'm very picky about my coney's and I miss todoroffs in Jackson since they closed but would still rather waste the gas and drive to Jackson for coney's. Even though todoroffs is no longer there the coney's are still way better than the nasty ones these guys serve. Maybe the owners need to go to Jackson & see what a real coney island tastes like."], ["Debbie R.", "First impression was not great.  Staff was grumpy and not one of them even smiled at me.  Also, while I was waiting to be seated I noticed that the cashier, immediately after handling a money transaction at the register, went to the toast station, popped some toast out of the toaster, buttered it, put it on a plate and delivered it to a table.  She did NOT wash her hands between handling the cash and touching the toast and did not wear gloves.  I'm pretty sure this is some kind of code violation... not sure.  Anyway, I ordered a Greek omelet, which I did enjoy.  The hash browns that came with it were bland, overcooked on top and undercooked in the middle.  Unimpressed.  The toast was just toast.The restaurant itself is cute.  I liked the decor and the place was packed so I guess it's a popular breakfast/brunch spot.  If they can get their staff to kick up their customer service a notch, and put some gloves on before handling the food I would increase my star rating.  I'd also like to see them work on that hash brown recipe.  But I'll likely go back again sometime... hopefully I'll have a better experience next time."], ["Amanda O.", "This is your typical coney island, LOVE IT!The coney dogs here are the best I've had in the Lansing area. The sauce is good and the hot dogs have that crisp when you bite into them. The fries here are also great. Good ranch. Haven't eaten something here I didn't like. Good chicken fingers, good burgers, great sandwiches, good breakfast. The wait staff is attentive and will get you in and out as quick as you'd like."], ["Alex T.", "This is the most well-operated diner/family restaurant I have ever been to.  The food is excellent. It is always packed for breakfast.  I recommend the skillets.Whenever I am there, the owner is doing everything he can to help out.  He also almost always checks on every table to see how everything is going.  It is obvious that he wants nothing less than for every single customer to have a great experience."], ["Javier C.", "I wish I could give 3.5 stars.I tried the chicken hummus plate.Hummus was creamy and tasty but the chicken was dry.  The rice pilaf is what you'd expect.The Greek salad and dressing was above average.  The baklava is pretty good.I was disappointed that they didn't make feta fries but maybe that's a Chicago thing???  I was staying in a hotel down the road"], ["Robert K.", "Exactly what you would expect from a Greek diner.Good food at a reasonable price.The banana pancakes are bananas good."], ["Daniell B.", "This is a great little Coney island style diner on the south side of Lansing.  The food here is yummy.  I pretty much always get the gyro supreme. It is loaded with gyro meat (cooked perfectly!), lettuce, tomatoes, onion, tons of feta, and my favorite.. the cucumber sauce!  I just can't get enough of it!!  I usually hit the drive thru on my lunch break, as I only have 30 minutes, so I cannot really comment on the service inside.  The people at the window are always pleasant and the food is always fast and fresh.  I have been coming here for 3 years not and have not been disappointed yet.  I will continue to eat here as it is one of the best places on the south side in my opnion."], ["Drew P.", "Decent food but it will cost you. Nice diner like atmosphere. Decent gyro, quick service."], ["Alex M.", "Been going to Zeus for years.  The owners took a dark, dirty and drab KewPees restaurant and turned it into this little gem on the Southside of Lansing.  But remember, its a diner/coney island.Food here is really good and fresh, everything I have ever gotten.  Greek salads are nice.  The service is typically really good, with coffee refills flowing and food brought out in a tiemely manner.  They have a drive through that serves a delicious breakfast sandwich.  I like the ham, egg and cheese on bagel, and for years when I didnt eat meat they didnt make any fuss to substitute a tomato slice for the ham.   Now that I do eat meat again, damn, the double ham slice (which is really thick) is really tasty!"], ["Althea L.", "The first time I ate Zeus' food was when I went through the drive through about 3 years ago.  I brought a gyro home for lunch after a hard day at work,  and it was wonderful...We now go several times a month for breakfast, and dinner is great as well!  Best french fries in town, hands down."], ["Ken M.", "Consistent, very good service and food."], ["Vick A.", "Food always tastes good, especially the breakfast. Gyros are also tasty, but \"gyro sauce\" is a disgrace to all Greeks. It tastes very watered down, if you're into that. I used to be a frequent customer, but I have to say I will never go back unless I pick food up to go. The service is horrible, especially the \"host\" that chomped on her gum and didn't say anything to us as she brought us to our table. She then threw our menus down and walked away, saying nothing or even acknowledging that we thanked her for her \"great hospitality\". Last time we were there, about 2 weeks ago, the owner was overheard, in the middle of the restaurant, telling a waitress \"if they don't like it tell them to get the hell out.\" Overall, terrible service."], ["Chelsea M.", "Excellent Gyros and speedy service.  I can call ahead with my lunch order and pick it up from the drive thru.  I'm not usually much for drive thru anything but these gyros are worth it.I've also gone in for lunch.  The service was pleasant, restaurant clean, and the food was tasty.I typically order the Gyro Supreme with out lettuce.  Only without lettuce because I don't eat lettuce.  It comes with lamb, beef, tomatoes, onions, feta, and qyro sauce.  Yum!"], ["Chris B.", "I rated this place based on service. I went through the drive thru at 9:45pm only to be told that the kitchen was closed but here's the funny part they don't close til 10 wtf. Also rude workers!!"], ["John D.", "Just had a damn fine Zeus Burger! A little messy to eat but worth it. Can't wait to have it again."], ["Patrick S.", "You really can't go wrong here.  The waitresses are excellent, food is awesome and the price is perfect.  2 full dinners with soft drinks ran me about $21.  You will not leave here hungry."], ["Jennifer H.", "Sadly, I have to follow up my prior review and take away one star.  I don't know if the ownership has changed hands or what, but some of the food quality has gotten worse.  Portion sizes have shrunk (but are still ok), the new fries are just gross, and they only allow ONE refill on your drink."], ["Cindy B.", "Went to Zeus' for breakfast on final day of vacation (on our way home from  UP). Had the Gyro meat and eggs. Husband had Greek Omlette w/gyro meat. Service was outstanding. Food was great. Plentifull but not ridiculous portions. We will return during football season."], ["Jorda M.", "Never had a bad meal here. Which is saying a lot since it's the only place where my kids clear their plates. Cheap too!"], ["Corey V.", "I live right down the street and I like that we have an excellent \"Coney Island\"  style restaurant. Try everything, it's all good."], ["Mel T.", "This is one of those great American/Greek diners.  They have everything from good dogs & burgers to really nice Greek dinners and gyro's.  They serve the meals with nice fluffy pieces of bread that are really yummy when you spread lemon rice soup on it.This is a great place to stop into if you are seeing a movie at celebration.  The food is better and quicker than the couple of restaurants right at the theater.  Those place tend to be mediocre and the wait can be horrendous.    Just drive a couple of minutes down the road you'll be at a kid friendly restaurant with good food.Sometimes they close early if they haven't been busy.  So if you are going in around 9 they may be already closed."], ["Lindsey K.", "I went to Zeus' for lunch this time. We ordered a gyro that came with sweet potato fries and the lamb shank meal. Everything tasted great and really well prepared. They were busy, but the service was still fast and friendly. The best part was when the waitress lit the Saginaki- she told us to yell Opa! and my friend, confused, yelled OPRAH!"], ["Chad C.", "As far as coney island joints go, this one not only has good coneys, but tasty gyros to boot. Plus, it's clean and has quick service."], ["Holly N.", "My dad occasionally likes to take me here for breakfast. It's pretty good for the area and for the other options. Everything is very standard. Decent omelets, eggs (however you order them), homefries, and coffee that is above average and plentiful. Service is kind and prices are reasonable."]], "Sultans Place": [["Beth F.", "Excellent Shawarma.  Great customer service and beautiful decor.  Highly recommend! !"], ["Zoey D.", "I used to love this place!  The food is pretty good. The last time my husband and I stopped for lunch I got my usual. Few bites into my meal, I found hair in my rice. Black string of hair (definitely not mine since I don't have dark hair). Disgusting!  I made sure to show it to our waiter, who said \"Sorry\"...and that's where it ended.  He didn't offer to bring me a new meal but what's worse he ended up charging us the full price for my meal.  I didn't want to make a fuss but just wanted to leave. Why we paid the full price on my meal is beyond (my fault I didn't ask him to remove charges for my hairy meal). Lesson learned!  Won't be going back."], ["Laurie P.", "Excellent service, mediocre food. Was disappointed with the small menu; I must say that this is the first middle eastern restaurant that I've been to that didn't offer raw kibbe. Bread was good, but the garlic sauce was too grainy. The fattoush salad was tasty, just the right amount of dressing, and veggies were very fresh.However, the chicken shwarma was barely warm, and the chicken itself was dry. The worst part of the experience was that there were fruit flies flying everywhere - kind of takes away from the dining experience when you have to constantly swat at flies. Yuck! I have a feeling that there are better Mediterranean restaurants in East Lansing."], ["Jan C.", "This is a great place to eat! Love their food, staff, prices and atmosphere. I can always count on Sultans for a great meal."], ["Irene L.", "Way too expensive for food that other tastier restaurants in the area offer for much-reduced prices. The place has attentive service and a nice atmosphere, but I'd rather drive to Frandor for Aladdin's for fresh pita and falafel instead of the store-bought versions they have here."], ["Sadie S.", "Easily the best middle eastern restaurant in East Lansing! I always get the chicken kabob meal with rice, hummus, and fattouch salad when I go with just my husband. When with my whole family we usually get Sultan's feast which is a great way of trying a good portion of the menu. We love eating here and would definitely recommend it!"], ["Doug C.", "I have been a regular at Sultans and also enjoyed meals they have catered at special events.  However, my visit last night was a real disappointment.  The bread came to the table with no appetizer plates.  You'll need to use your napkin to avoid placing your food directly on the table.  I ordered the baba ghanouge which is suppose to be made from roasted eggplant.  In this case it tasted like it was made from burnt eggplant.  A subtle difference to the palate.  My main course was the Shish Kafta Plate.  The veggies were great.  The lamb was a cross between jerky and shoe leather.  It was just way over cooked with no juice or flavor.  My companion ordered a Greek salad that was fine.  I may or may not try again.  It feels like this location is suffering as they open other locations in the area."], ["Nomi K.", "The tabbouli tasted dirty and was turning brown :( The oil they use is low quality, definitely not extra virgin.  I don't want a pool of it in my hummus.  Will go to Zaytoon's next time!"], ["Dustin W.", "Great mediterranean food! Great prices. One of our local favorites."], ["Andrew G.", "Good middle eastern restaurant yet I've only had the swhorma which I highly recommend and overall good place."], ["Suzann P.", "Sultan's was the first (and sofar best) restaurant my family and I went to after moving to Lansing a few months ago. The first thing I noticed when I walked in was the beautiful decor and the cozy, friendly environment. After being seated you receive a complimentary basket of soft, aromatic freshly-baked bread.  I am usually a sandwich person, I hardly ever get rice platters; but when I had the Sultan's Feast with my family I got hooked on it! It's a feast for the eyes and stomach. When it first arrives to your table you want to just grab a little bit of everything all at once and it's hard to decide what to eat first because it all looks so good and is presented beautifully. All the meats were grilled perfectly, not a single dry piece of meat. The food was more than enough for four adults and a child, and we ended up bringing leftovers home.  The feast came with two salads as well: an incredibly flavorful fattoush salad (I'm picky about fattoush!) and tabbouleh. It also came with smooth, creamy hummus and smoky baba ghanouj, and pita bread of course!All in all, Sultan's has a great atmosphere, friendly waitstaff, and most importantly, delicious food!"], ["Alessa T.", "Great food and excellent service!! Lots of vegetarian options and their bread is to die for. Great fresh juices too. Love this place and highly recommend."], ["Amina K.", "Came here to get some takeout with family, we're 4 foodies so naturally we ordered the sultan's feast for 4- when we went to pick it up we received two bags full of food and another HUGE foil tray of food. It was around $60, so $15 per person was pretty good. So this feast contained 2 salads, tabbouleh, hummus, baba ganoush, pitas, rice, chicken shawarma, grape leaves, kibble, falafel, and lots of kebabs.My favorite was definitely the shawarma. It was great! Not too dry. The falafels were the best I've ever eaten! And the hummus, baba ganoush, and salad were also delicious. Amazing middle eastern food!!!"], ["Kristi R.", "While attending MSU, this was my favorite place in E.L to eat.  The service isn't the best which docks one star.  Let's talk about the food- the bread, hummus, chicken schwarma, garlic spread, rice and fattoush are very very good!! I haven't been to Sultan's since a visit home in 2/12 and I hope the food hasn't deteriorated because it would be a damn shame.  The decor is alright and the restaurant is pretty clean. The food is reasonably priced and the portions are plenty."], ["Alex K.", "Got the family style. Shwarma was the only decent dish, rest were meh. Baklava was a bit dry for my taste. Was unimpressed with the hummus."], ["P B.", "I went to Sultans after eating a few days before at Al Ameer in Dearborn, so I have something to compare Sultans to, and it's really sad.For about the same price at Al Ameer as I paid at Sultans, I got double the food, fresh pita, and exquisite food.At Sultans, the pita was grocery store origins, the grape leaves dry and tasteless, the rice not fully cooked, the taboule and hummus not made right, etc.The portion size was very small (three grape leaves, for example).My brother in law is from Lebanon and has often made me REAL Middle-Eastern food prepared with organic ingredients and skill, so I do know the difference, and Sultans is a fail.Sultans is good at marketing, and the employees are friendly, but they don't serve quality food!"], ["Bren C.", "Food was great, service was great, and they make some great smoothies. Seems likes they are dedicated to satisfy the customer in every way"], ["Sara E.", "One of my favorite restaurants ever. Fantastic middle eastern food. Try the Aleppo Kabab or one of the Gallayas. Really great hummus. And the fresh baked bread is to die for. I worked here in college and never got enough of the food. Every time I go back to the Lansing area, I stop here. Very authentic middle eastern restaurant with always-fresh, carefully prepared food."], ["Professor C.", "Fantastic \"Middle Eastern\" food (I assume there's probably a more precise label). The theme seems to be fresh, healthy and tasty. Entrees are not cheap but reasonable for what you get, and the \"sandwiches\" are actually a good deal.  Stuffed grape leaves, baba ganoush, and ground lamb patties are some of my favorites from the extensive menu. Best hummus in the area - creamy and tasty. If in a group you can order one or more \"platters\" that let everybody sample a variety of things. The made from scratch smoothies are great. The pita is baked there, in an oven close to the cashier, it is not from a store. I've always had good service here, and the atmosphere is very comfortable. Like most East Lansing area restaurants, though, you will look out onto a large parking lot."], ["Jerry S.", "I was part of a group of 18 people that had a reservation. I and everyone else at the table except for two people had the \"feast\". This is like a \"family style\" meal except they brought out 3 platters containing a sampling of their menu for all us to share and there were no refills on the platters. With the restaurant imposed 18% tip each person's bill came to just shy of $19. (not including drinks)The good: There was plenty of food. The server looked a bit overwhelmed but handled all of us ok including refilling drinks in a timely manner. Everything was clean and well decorated. I have eaten at quite a few Middle Eastern restaurants and this was right up there in the ambiance. The house salad, fattoush, hummus, baba ghanoush and tabbouleh were great.The bad: The stuffed grape leaves had a really weird taste. The spinach pockets had a different hot weird taste to them. Just not as bad as the grape leaves.I noticed from other reviews there were bread issues so I prepared myself. Yep, I experienced bread failure. If you have ever had FRESH pita bread you know what I mean. Fresh they're like little warm soft pillows of love. First basket he brought out was cold and tough to chew into. Next basket was piping hot but hard as a brick. But not burnt. That tells me they took some old stale ones and threw them in the microwave or oven. They knew about this reservation and the rest of the restaurant wasn't busy so there was no excuse not to have fresh bread.My advice is to stay away."]], "Sultans Express": [], "Spartan Hall of Fame Cafe": [["Don K.", "The rough reviews are probably wolverines. 9!seconds.  I can't speak to game nights but their nightly specials are cheap.while the burger was a preformed previously frozen preburger it tasted great for the price."], ["Johnny E.", "Coming from Minnesota I had to try a campus-feel sports bar for lunch to compare to my days on the U of Minnesota campus. I thoroughly enjoyed looking at all of the sports history that decorates the walls here. Good viewing for sports games as well. The food was about what you'd expect and the service was good. Recommend to people in from out of town for a game, for sure."], ["Bonita G.", "Obviously this place is gimmicky, which must be why so many people come here.Our server was awkward and seemed to dislike us for no reason.They were out of lobster bisque on a Sunday afternoon when they weren't busy, so that was disappointing.Fried calamari was slimy and came out cold. The marinara was basically ketchup, nothing special.The fried chicken salad (buffalo style) was also slimy, came out over-dressed (if I had known, I would have ordered dressing on the side), and the fried chicken breast was cold so it was soggy.Overall, disappointing. I'm not from East Lansing but there must be better restaurants to catch the game and enjoy a casual meal :)"], ["Brad M.", "I've only been during the week for lunch... but I love the SPARTAN memorabilia... and cannot wait to go see if they update the Rose Bowl banner with the latest win!The wait staff are cute, friendly and hard working.  The food was pretty decent.  This is definantly a locals place, so look around and see what everyone else is ordering.  The specials are hard to beat! After reading the reiews and looking around, I ordered the Chili Cheese Burger.  The patty was cooked to order, and I really enjoyed it.  The chili was okay... no complaints... and had lots of toppings.  I'm sure I will be back here a lot!3 Solid Stars!"], ["Brooke C.", "I went to MSU for my undergrad and failed to make it here. Well now I know why. The food is mediocre at best and the service is horrible. We waited for a waitress for about 15 minutes before ordering drinks and then ordered food another 10 minutes after that. I had the fish and chips which came out looking great, but after a few minutes they wilted down to slimy pieces of cod. The hush puppies were also undercooked. Refills took forever to get. I'm glad I went with good friends because the conversation made the time enjoyable. I would only return if I went with friends to watch an MSU game."], ["Kate F.", "We have been coming here since the restaurant opened. We have never had bad service once. The food is always good. There's items on the menu that I liked better than others, but never had a crappy meal. The beer selection is decent, and they have good specials during the week."], ["Mike R.", "I had the ultimate burger which was good. My only issue was that our drinks would come up and sit on the rail for like 5 minutes before they were brought to us.. The beer was still cold but I was worried.. Nothin to write home about seems like they get most of there shit from GFS.. Very standard almost coney islandy.. with alcohol though.."], ["Tim S.", "Great bar atmosphere for a game and cold beer.  Food - blah.  Mediocre.  Nothing special and generally overlooked.  Stick to the beer.  Service is also hit and miss.  Under staffed and under educated on how to be attentive."], ["J D.", "If it wasn't for the TVs, no one would ever be here. The food is absolutely horrible. There's no excuse for how bad it is. You guys should be ashamed. Quit warming up Sysco food. I wish I could post this with 0 stars"], ["Caity B.", "As much as I love the Spartan memorabilia decorating the restaurant's walls, I was underwhelmed by my experience.  Our server, while very sweet, seemed flustered when having to handle our table of 7.  She would also disappear for 10 to 15 minutes at a time.  Don't order the ultra-thin crust pizza.  It's just two tortilla shells, that I'm sure double as sandwich wraps, slapped together and called a crust.  Very, very greasy too.  While there's a good atmosphere, it's definitely not my first choice of places to eat."], ["Jacob H.", "I was here during the holidays with a large group. The service was fine for the size of the group and I was overall happy with everything until a few weeks later when I found that my credit card was overcharged. I called and spoke with a very helpful manager. She got the overcharge credited and offered to send me a gift card.Last night, after a movie, my wife and I stopped in for a late dinner to use the gift card. Once the hostess finally acknowledged us, she stated \"just so you know, we close in 20 minutes. If you know what you want and order quickly I can seat you.\" I was so shocked that I asked her if she was serious. My wife and I were very put off. We did not stay. I even took the liberty of informing multiple other customers that were on there way in not to bother. We went across the street to Applebee's, were greeted warmly and had a nice experience.I worked at a nice restaurant in Lansing while in college. Closing time was simply the point at which we stopped seating customers. We didn't actually close until the last customers were finished and they were ready to leave. Is this no longer the norm?"], ["Tom H.", "In short, steer clear. Went tonight for a Spartan basketball game and the place was nearly empty. By game's end we were the only customers left in the whole place. I teach in a middle school and would rather eat a burger from our cafeteria than the sad one I was served tonight. C'mon...it's a burger! That's like the easiest thing to cook, yet you go with a low quality frozen puck? Awful."], ["John E.", "My wife and I sat in the bar area and we really enjoyed the atmosphere. As a MSU alumni it was fun to be surrounded by all the Spartan memorabilia. Though the food seemed over priced for what you recieve. But I suppose that's the price you pay for the atmosphere. Our server, (I think her name was Shelby??) was a great girl. From the moment my wife and I sat down she never let our drinks go empty. She was very accommodating to my wife's allergies and really was the cherry on top of a great night in East Lansing."], ["Michael W.", "The food overall was decent. The service was awful. We talked about wanting to watch the wings game. After our food was delivered she wanted to clear us off the table. We wanted to keep drinking and watching the game. Only loosing money for her. Disgusting thing about this place was the unused appetizer plates are just left at the table even after us handing them to her to be bussed. Will not be returning to this establishment again."], ["Judy S.", "We recently hosted a wedding rehearsal dinner here.  Not being from the area, I made a trip into town with a friend to try the food and check things out.  The food we had that day was very good (great mac and cheese!) and I met the manager, Steve.  He gave me all the info for their banquet services, and the rest of our communication was by phone and e-mail.  Steve was great to work with.  Even with a last minute change, he graciously accommodated us.  The wait staff that night was efficient, yet stayed out of our way.  The food was very good.  We had a buffet that included pastas, chicken, pizza (the Margharita pizza-wow!) and two salads that were really amazing!  Now that the wedding is over, we're planning another trip back for dinner there so my son can have that mac and cheese!"], ["Gary A.", "if you need a nice restaurant, near campus, but far enough away that you can actually sit down and have a good meal, this place should be on the top of your list of places to go. Its a local place. It is also not a just a sports bar or a near-campus bar - which in East Lansing most other places can be \" a zoo-like atmosphere\".So its a little bit of drive off campus.  Plenty of seating and dining areas.  Places with TV screens, and other places good for groups.  Lots of Spartan memorabilia, including marching band stuff, which my family appreciates. They have a good menu, with many options, from burgers to salads to full main course entries, and daily specials.  A full bar, with beers of the month and drink specialist. I have never tailgated here, but I have gone here after a game and other events.Sunday Brunch was good."], ["Dave S.", "Great place to be if you're a Spartan.If you are the type of fan that likes to keep a distance from campus and all the mayhem that goes with the tailgate scene, this would be the place to be.  Spartan Hall of Fame Cafe has it all.  Plenty of seating, large flat screen HD TVS, Spartan photos and memorabilia.I came here on a Friday night and members of the band and cheerleading squad were there almost like a mini-pep rally.  It's a great atmosphere.  As far as the food goes it's what you would expect, decent food and beer specials.  They had a good lunch special with a bowl of soup and half grinder for $6 that some of my colleagues ordered.  I had tried the Chicken Tortilla soup which was a little thin or runny as compared to who I normally like it but the spice was good.  I went with the open faced Chili Cheese Burger.  Cooked to order and pretty delicious.  The chili was legit and it had all the topping you'd want on it...cheese, sour cream, onion and jalapenos."], ["Trevor G.", "Nothing special-- very average food.  Skip the chili-- it sent me to the toliet in a flash!"], ["Brad C.", "Ok food, very loud, so-so staff.  Kinda chainy."], ["Carla S.", "50 TVs? Check.  Spartan Decor. Check. The food here is pretty decent, but a little expensive for what you're getting.  No drink specials on a Saturday night, which I was a little surprised by, seeing as it's so far from campus.  Great place to take a family, or if you're not into the downtown tailgate bar-scene and still want to get in on all the Spartan action.Honestly, if I lived farther away from this place, I would never visit."], ["Kannan R.", "Service is nice, but nothing special, just a chain with a lot of nice TVs that you are paying for with your food. Feels pretty artificial.Reno's East and Jimmy's Pub are two nice locations I'd go to for a better game day experience than if you were on Grand River. Even Coral Gables."], ["Alexandra K.", "In terms of decor, Spartan Hall of Fame Cafe far surpasses tacky, but its Spartan Spirit is appreciated at the very least. The menu items seemed good, but as a vegetarian, I felt that for a cafe, my needs were underrepresented. There was not one single meat-free dish. I had ordered their cobb salad but had to order it without meat. It seemed fairly priced, and the portions were large. The staff was friendly and accommodating. Favorite part? When my water was refilled, the lemon wedge was replaced."], ["Kirsten G.", "The HOF Cafe is ok if you have no other options. The food was average but the prices suggest that you are eating far better fare. I might eat here about once a year because I could get the same quality for less money at an Applebee's. The only draw is the Spartan connection, but I could go to any pub in East Lansing for that."], ["Bruce S.", "This place is cool.  Our service was slooooooooow... but I am attributing that to a bad draw for who our waittress was as opposed to a systemic problem, because in observing everyone else's service they seemed to be good (on top of it).  Maybe it was an off day for ours, who knows.  The food was good. Their menu is expansive; they have many unique entrees on the menu and (thankfully!) are not following the trend that everywhere else seems to be doing with having the same (type of) shit on the menu everywhere you go...  they have jambalaya and many other unique dishes (finally an establishment that GETS it!).The decor is (obviously) MSU themed.  mad props to them for that.They have many specials, even though they are already very affordable.One thing worth mentioning, even though we didn't have any with us, was that we noticed many families there with kids - another area of oversight that many places falter on.  They seemed to be happy, and the little girl sitting behind us was so excited that she had a dirt cake dessert with gummy worms. haha.  If an establishment can keep the kids happy, then the parents are more likely to go there and spend more.  Well played HOFC.  Overall, I'd have to say 4 stars.  This is a good place with good people."], ["Matt R.", "This is one of my new spots....no doubt. This used to be boring Damon's, but it is totally remodeled. Not only is it covered in Spartan stuff, but it has flat screen tv's all over the place. Much better atmosphere. The food is good as well. Now, the specials are awesome. Everyday they have $2 beers (24 oz. I think) from 3-6. Not just Bud Light, they have many beers on tap including Sam Adams, etc. They also have $2 beers and half off pizza after 9 Pm. Great place to stop after work for a beer or watch the game."]], "Pita Pit": [], "Harry's Place": [["Betty G.", "We had seven people in our group and we had a Greek Hamburg, Turkey Reuben, Philly Cheese Sub and the Beef and Mashed Potato dinner. We all were very pleased with our meal. Our waitress was very friendly and efficient. We plan to meet there again next month. I would recommend Harry's."], ["Jim K.", "Awesome neighborhood bar with many specials..Have to get here early on Friday's.. Place fills up fast. Food and beer is pretty good, owner is very involved,and the staff very friendly."], ["Jason K.", "Food is great. People working here are so nice and so much fun. Beer, burgers, pizza, and fried food. What more could a person want!!!"], ["Robert S.", "Off the beaten track, but the pork chops and Greek roast chicken are worth finding this place."], ["Richard H.", "Cozy neighborhood bar... Sit and chat with locals and the friendly staff. Food ranges from Gyros to Burgers, salads and Mexican dishes. Reasonable prices."], ["Greg K.", "Harry's is a place where locals go. It is very much a diner but with a better level of food and service, a big menu and awesome pizza. Might also have the best bar food in town and they have craft brews on draft for those who enjoy those kinds of beers as well."], ["Lorraine H.", "So in my quest to find the best olive burger in Lansing, I had decided that Leo's Outpost on Jolly was Dah Shizz. Sorry, Leo's. Harry's Place also has an extremely yummy version, and they're 15 miles closer to my house and office. BOOM!I read in the City Pulse (02-13-13) that they were looking for good olive burgers and tried six places, ranking Harry's as the best. I was only vaguely acquainted with Harry's as the little bar across the street from where Fisher Body used to be, on Verlinden (near Sexton H.S.) I read that they have a Greek burger and requested olive \"sauce\" on it. So I tried it. OMG - Perfection. It was way more huge than I expected...and the bun held together nicely - did not turn into a messy, sticky pile of goo. The fries are okay, not spectacular. My order was to go and was placed by phone. They answered promptly and the man's voice was Smooooth! He was friendly and nice. The bar & grill is larger than it looks from outside. The bar's in the center with TVs mounted above it. There is a unique juke box against one wall, and lots of booths and tables surrounding the bar on all sides. It was very clean. The decor is plain, no theme or fanciness. There is a pleasant lack of advertising on the walls. One of the owners was very chatty in a friendly way, asked me if this was my first visit. He talked with me and made me feel comfortable. I have to admit, the men who work there are VERY good-looking! Harry's is a great place to relax and get a bite to eat for lunch or dinner without feeling out of place or intimidated. Definitely going back a lot! This will become my home-town bar, I've been looking for one and finally found it!"], ["the t.", "Greek burger w olive sauce is the bomb."], ["Paul T.", "We do take-out pizza from Harry's every other week, which is a lot for us. It definitely beats any delivery you can get in Lansing. Pretty much standard midwest style pizza with medium-thin crust, standard list of toppings. Reasonable prices. The crowd at Harry's Place varies wildly, both in size and in general tenor. Sometimes the place is jammed, noisy and rockin'; other times only a few boozy regulars haunt the bar. People seem to like the fish fry, but I've not tried it. I do order the burgers and largish orders of good but not particularly special fries. Full bar with pretty standard list of choices. All in all the place feels pretty down home. Service is friendly and I like Harry's a lot."], ["Mark W.", "New favorite lunch spot ... laid back atmosphere; outdoors seating; quality food & a great variety.  Going to have the Half-pound Greek burger on my next visit."], ["Douglas F.", "Reading the last review, I would have to say that that's pretty much accurate. Harry's Place is steeped with GM & Lansing history. I have very fond memories of Harry's place from smelling burning \"weeds\" in the parking lot when I was a snot nosed teenager attending Sexton High School, to being a patron of the bar years later. The business has dwindled a little since the closing of the \"Green Monster\" but the service sure hasn't. Ah, the stories you'll get to hear if you would just buy a regular a drink!! And the drinks are cheap too!! I had to stop drinking or I would still be a patron to this day. Get there in the mid afternoon for lunch and if the day time cook is still there, you'll be hard pressed to find a better dine for your dime. P.S. if you think that this is just a shop bar, well you're half rignt, it used to be, now it's pretty much a neighborhood bar so don't be afraid to poke your head in and check out the action! I give Harry's Place a 5 star rating and wish I could join you. Doug signing out."]], "Tabooli": [["Beau M.", "The food I'd damn good the prices are damn high. Two weeks ago I went here and my bowl was overflowing. Today it's almost empty. 14.00 for a bowl a side and a drink is not a good deal but it tastes nice. If ur trying to be cheap quit bitching and go to a buffet. If your trying to get good food at a fair price then this is your place. Cheap isn't good and good isn't cheap."], ["Chelsea S.", "I lunched at Tabooli while I was back in Michigan for the winter holidays.  I grew up in MIchigan and think I know good Middleeastern food and now live in Seattle where there is a definite lack of the cuisine.  Tabooli satisfies the cravings for Middleeastern but I would not frequent here if I lived in the area as there are definitely better Middeeastern restaurants for very similar prices.Pros are that it is fast, cheap, customizable and has food that is probably better suited for those not accustomed to the flavors of the Middle East."], ["Mary K.", "Eat here! Go now! Came here with our family because my husband has been here a few times and loved it. Both the beef and chicken schwarma are great. Beef stew is delicious. Our favorite is the ratatouille! Super friendly staff who offered us free samples of everything and even gave our kids a free dessert. We'll be back for sure!"], ["Jennifer K.", "We stopped by for dinner on the way to Sparrow hospital to visit my grandmother. My daughter was meeting us so we had about 20 minutes to kill. We ordered hummus and bread and drinks while we waited. The owner came to our table and chatted with us almost the whole time. He was very friendly and enthusiastic and brought us two different free samples to try - lentil soup and ratatouille - both were delicious. I tried something new for me - the Mediterranean burger and it was great and very flavorful. My husband and daughter both had bowls. They did both think that the chicken shwarma and tabouli were a little dry. However, the flavors were great and our overall experience was wonderful. We will definitely stop there again."], ["Hash P.", "The quality and the quantity of food has gone down significantly since they've opened last year.I got just a container of hummus today and the attendant gave me just 1 half roll of pita bread...I asked for more..and she gave me 1 more...thanks...The bowls used to be loaded up but now they put just a small scoop of the rice and chicken and you are limited to just 5 toppings. Of which, they are very stingy on.The food isn't terrible by any means but it also isn't a must have anymore..the poor service makes you go to some of the comparable alternatives."], ["James F.", "So, so food. Incompetent staff. Overpriced and not nearly as good as the soup spoon cafe across the street. Would not recommend to a friend nor will I return here again."], ["Cristy C.", "This is a new casual dining Mediterranean restaurant on the east side of Lansing. It has the set up of a Chipotle, with the choice between a wrap or a bowl. I chose the chicken shawarma bowl as my main course. The first person behind the counter scoops in the rice, the shawarma, and  (if you want) a little bit of potatoes. Then, the next person behind the counter adds toppings to your bowl or wrap. The choices for toppings include feta, onions, olives, pickles, turnips, hummus, tabouli, fattoush, other things that I couldn't identify, plus the amazing Mediterranean salsa. Everything was really great- everyone in my group was pleased. The owner seems to take an active and welcoming approach to running a restaurant, I hope they are around for a long time!A main dish plus a side gets you a free drink as part of the trio promotion. Most of these combos seemed to be right under $10. Dessert options are ladyfingers (rolled phyllo dough with nuts) 1 for .75 or 2 for $1 or some sort of pudding. The lady fingers were good. An interesting and tasty twist on traditional Mediterranean food.  (4 stars)I had leftover Mediterranean salsa and the owner gave me more chips on the house to eat with my leftovers. And their tip jar says \"for TARDIS repairs. (+ 1 extra star)."], ["McSaddle X.", "The staff here is great, tip them. The food is--let's agree that it is Mediterranean Fast Food and you get what you pay for. This is at least a departure and a healthier option than what you might otherwise consider. It is set-up like Subway, Chipotle, and Tamaki-- you begin with a base meal and add on whatever you want. It feels as though the flavors are slightly toned down to appeal to a broader spectrum of palates, but everything is fresh and the portions are generous. Go here. Try it. Go back, try something else. It's worth more than one visit."], ["Casey B.", "This is a new restaurant to the Lansing area. I decided to give it a try, I love Mediterranean food. I like that it is set up a \"chipotle style.\" You can choose a wrap or a bowl. today I decide to get a bowl, you can pick anywhere from chicken or beef shawarma,chicken kebabs, stew and so on.  Today I got beef shawarma bowl with tabouli, hummus, Mediterranean salsa and fattoush salad. The beef shawarma was pretty good no complaints. They have really good hummus and pita bread. The fattoush salad was delicious. It's probably my favorite, never had it like that before. This was my first time having mediterranean salsa it was absolutely delicious, I picked the olives out. I love tabouli, it's one of my favorite mediterranean dishes. However at this restaurant they add mint.  Yuck. I was so disappointed.  I'm not a fan a mint unless it's in my toothpaste, gum, or mojito. The garlic sauce, yuck!!!  Their recipe isn't didn't work for me. It's wasn't garlicky enough.Overall it's a pretty good restaurant. It is a little smoky in there because of the grills I wish that they would've opened a window or door and the manager was yelling at his employees in front of the customers I didn't think that was very professional."], ["Iman B.", "Its a very good place to go for Meditranian food. it is like subway style that you create your own bowl. you can eat a lot there and the food is awesome.I got their chicken shawarma and hummus which were great. The guy explained the foods very well."], ["Kimberly C.", "Very delicious and fast middle eastern cuisine.  I had the chicken schwarma rice bowl with potatoes, tabouli, and hummus.  Was very pleased with all the favors.  The schwarma was very tender & flavorful.  The potatoes were a nice edition to the bowl...added good flavor & hardiness.  We ordered a falafel to try and thought I was very good too.  They have a drive they too!"], ["Mallory H.", "I think for the price, variety, and convenience this place is great. I usually get the chicken ($6.99) or beef ($7.49) shawarma bowl and get literally everything on it. You have a choice of: onions, turnips, hummus, pickles cucumbers, tabooli, garlic goodness, tahini, baba ganoush, banana peppers, and olives. It also comes with pita and rice. There's drive thru and every staff member has always been friendly. It's rarely crowded when I go at night and the food has been consistently good."], ["Sammi D.", "I had the chicken kabob wrap and a side of potatoes, delicious!! They have lots of choices and you can choose as many toppings no additional charge...everything looks delish."], ["Lilyan T.", "Meh. Just meh. I had a $1 off coupon so I went to Tabooli for lunch. I have to preface, I am Middle Eastern and have tried some of the best middle eastern around. This place is definitely lower quality. I got there at around noon and the chicken kabobs were sold out. I got the chicken shawarma instead and it was dry. The tabooli I got as a topping was also VERY dry and the fattoush was made with iceberg lettuce and no dressing. It was kinda gross. Anways, for the price, $6.35, I really can't complain but this would never be my first choice and I would probably only go with a coupon. Also, when I was going to leave, the worker said, \"I hate when the pita is stale!\" Oh. Joy. Don't even change it, worker, just serve that stale bread all day."], ["J C.", "I don't regret going here, but it wouldn't have bummed me out to have missed it.I checked out Tabooli after seeing the adverts on the highway. The idea is good- it's set up like a Subway where you slide down the line and ask for exactly what you want.The food wasn't horrible but it wasn't great.The service was friendly, but slow.This replaced an old KFC so the interior isn't bad but it's just kind of existing.That combined with the price point, I don't think I'll ever go back.I'd much rather make the drive to Sultan's on the East side or Zaytoon's if you are on the west side."], ["Michael M.", "I ordered a shawarma sandwich and a side of fatoush salad through the drive through. The sandwich is filled with rice and some meat which was disappointing, if I wanted rice in my sandwich I would have gone to a borrito restaurant. The fattoush salad was an even bigger dissapointment with no baked or fried bread in the salad and maybe a dash of oil of some sort with no flavor. These two things with a small coke cost a good $11.11 and I'm still hungry. ...good attempt but horrible food"], ["Nichole R.", "I stop into Tabooli's once a week. The owner is hilarious and so are his employees. The food is amazing for the chipotle style restaurant that it is. It's affordable and the serving sizes are very generous. They even cater for events. We are preordering for our post thanksgiving wine and cheese party. Try this place out. You won't be sorry."], ["Becky S.", "Love the Chipotle-style take on Mediterranean food. Extremely friendly staff and good value for the cost. On my first visit, the owner spoke with my sister and I and asked for our honest feedback about the food and the experience, he even gave us complementary desserts! He seemed really earnest to make this place the best it can be, and it was clear from my interactions with all the employees that they are very customer-focused. A great addition to Lansing. I will definitely be returning in the future!"], ["Robble R.", "Delicious!  I've ordered the beef shawarma bowl as well as the falafel bowl.  I love the fact that it's set up as a type of \"cafeteria style\" so you can see all the toppings/sides and watch your meal being built before your eyes.  The set up is similar to Pancheros or Qdobas.  Still need to try the chicken and desserts too!  Thumbs up!"], ["R. L.", "Good quality food, clean restaurant, and fast service. This place is a great addition to the Lansing area. You can load up a wrap or bowl with anything...they operate like a Subway. Great options for vegetarians. I only wish they had some spicy sauce options because although the food is good, it lacks savory flavor... not very authentic. I'm a falafel person and for comparison I say they are better than Aladdin's but not as great as Jerusalem Bakery."], ["Beth B.", "I'm a vegetarian, so I find getting \"fast\" food to be a difficulty. A friend brought me to Tabooli and I was hooked. I get a wrap with falafel and add all of the toppings I want for the same price. (Hint: I am addicted to the garlic sauce... do NOT add that if you are here with a date.) The employees are always friendly and helpful. They'll answer any question about the food. If you want more pickles or olives or sauce, just ask. Also, the baklava lady fingers are delicious. Great, ultra filling meal for an excellent price."], ["John K.", "Another great meal at Tabooli Sat night.  The chicken wrap.. and those little deep fried patties... whatever they are... great and healthy food!!"], ["Raymond G.", "New \"Subway-style\" Mediterranean spot. Bowls, wraps, soups, salads and sides. Most \"combos\" (entree, side, drink) come in under $10. Fast, good, convenient Mediterranean food. Much better than the KFC that previously occupied this lot."], ["Kevin B.", "Great new Middle Eastern restaurant.  Food is very fresh, service is fast and the staff are great. Had the beef shawarma which was great"], ["Lesley P.", "I have dreams about the chicken schwarma panini. I recommend it with the Mediterranean salad and hummus on it, plus whatever else looks good to you. It all works together!"], ["Curtis C.", "A fan of Mediterranean food and have tried to recapture the food in the States from visiting months back. I was always wonder where and when this place would open. Huge billboards in Lansing and kept my eye open.Finally found this place and decided to give it a go. The setup is similar to a Subway and there was a full staff ready to take your order. I would say this felt more like a Qdoba then a Mediterranean establishment. Fast food feel was still there and while the choices sounded good, didn't get that fresh feeling. I decided to go with the stew with eggplant and a side tabouli salad. The stew was good and the side options tasted great. Eggplant was a little oily and just fell apart upon lifting it. The salad was a bit dry and could mostly just make out parsley. I'd probably return and try a different dish, but this is OK For their offering, but still would go to Aladdin's or Sultans as first choices."], ["Will K.", "guess how mush they charge for a little barrel of juice??? the one with the foil on top...that you got from the store as a kid for 25 cents....$.2.00!!!!!! blew my mind after i saw my receipt........will never come back ...food OK at best ....but that juice was the deal breaker believ it or not"], ["Parth G.", "Good food. Good ambience. Since it a new place they make really tasty food and do good service. However they were  out of fries when I visited but that's okay they made up for it by their tasty food."], ["Michelle G.", "Stale bread, no flavor and dry chicken.  Adding this to my do not eat at restaurants.  I am surprised there are so many good reviews for this restaurant.  I am wondering if anyone has ever had Mediterranean food before."]], "Lou & Harry's": []}