{"Swagath Indian Cuisine": [], "Persis Indian Grill": [["R S.", "The food was o.k. I wasn't impressed by the papar at the beginning, but that was complementary. The great thing about this place is it sticks to the true Indian flavors, rather than simply responding to White tastebuds. We were not impressed by their serving dishes. Not congruent to this type of cuisine. So now a days, I just go there for takeout!"], ["Mary L.", "OMG!  The food here is fantastic!  I was with a group and tried many different dishes throughout the menu.  I loved every single one.  I have to say, the goat curry was the absolute best I have ever had!  Also, the waitstaff were wonderful!  So helpful and friendly.  Totally recommend!"]], "Sree Chillas Indian Kitchen": [], "Indian Trails Motorcoach": [["Daniel L.", "Only take this if the train schedule doesn't work for you. I have taken this bus service several times to Chicago and back when Amtrak is not available. Each time I regret it. On a trip last two years ago the bus was over 3 hours late without any explanation. The bus also was sold out so when we got to Grand Rapids they had to turn away people because there wasn't enough seats. The last trip I took the bus driver left East Lansing early before the scheduled departure time of 3:00pm. I arrived at the station at 2:50pm but as soon as I got there the Greyhound driver told me that the Indian Trail bus had already left. I had to get a ride from my friend to the Lansing station. When we got to the Lansing station and I questioned the driver about leaving early started saying things like I should have arrived early and that I was  getting \"tissy\"with him.  He refused to give me his name so that I could complain about him. According to him several buses up north were delayed because of the snow. We ended up going back to East Lansing and the Lansing station in order to look for passengers.  When my wife was talking to me and was clearly upset  about the situation the bus driver  then asked her if she had a question  when she asked about the reason for the delay he proceeded to verbally challenge her while explaining that he just picked up five passengers. We ended leaving the Lansing area about an hour late. I don't have a problem with riding the bus I just have a problem with Indian Trails lousy customer service. Again only take this if you have no other options."]], "Sindhu Indian Cuisine": [["Tim M.", "Great chicken tikka masala. I have ctm at least once a month and this is the best I've had in a really long time."], ["Ed T.", "I was nervous about Sindhu:  it's a little Indian joint in a mini mall in a college town.  The decor is sparse and the service is remarkably bad.(No, really:  it's horrible.  A few totally disinterested young ladies, almost certainly the daughters of the owner -- only their parents would have refused to fire them.)But the food is really quite good.  All the typical fare you'd expect in an Indian restaurant:  masalas and vindaloos, naan and lassi, all very well made and flavorful.  Plus several days a week, they offer a Southern Indian menu."], ["David M.", "It was here that I discovered that I love Indian food, so Sindhu has a special place in my heart as well as my tummy.  Na'an is amazing, as are all of the dishes.  Anything with lamb in it from here makes me melt, and though it's pricey it's well worth the price.  And quite conducive to sharing, which is a huge plus in my book."], ["Hannah H.", "Okay, I'm so happy to be able to say that I've found my \"go to\" Indian place since moving from California!  This place is amazing, my hubby took me for the first time last night and absolutely loved both the chicken korma and lamb vindaloo!  And when we said we wanted spicy, they truly did bring on the heat.The garlic naan bread was okay (could've used a little more garlic in my opinion) but the basmati was very ample!I felt like the service was fast and attentive.  More importantly, the place was packed for a Saturday night (which is always a great sign)!"], ["Ed S.", "Sindhu's has great food, but it's not perfect.  You can order most dishes as mild, medium, or hot - beware that they're serious when they say \"hot.\"  The lunch buffet is limited, but tasty.  The dining area is a little claustrophobic, but nice.The prices are a bit much - expect to spend about $20 per person and not to have any leftovers.  I called once to make a reservation for a large group for a day that I expected to be very busy.  I called back on the day of to confirm the reservation and was told that, not only do they not have a reservation book, but they weren't even going to be open at the time I made my reservation..."], ["Jason B.", "I must admit, I'm a bit of an Indian food snob. I worked at an amazing Indian restaurant and was spoiled with the absolute best I've ever had. I haven't had Indian food even close to it....until I ate at Sindhu. Their restaurant decor and atmosphere is a little lacking, but the food is solid. I recommend the samosas. The malai kofta was a bit weird (sausage shaped and too doughy, but tasty still). The lamb vindaloo was great, if not a bit too spicy. I'm excited to try the rest of the menu. Reasonably priced....$38 for two with tip (including two appetizers, two entreés)."], ["Jenny G.", "This place was awesome! I had one of the lamb dishes (can't remember the name) and it was probably the best I've ever had. My only regret is wasting space on the naan, it was fine but wish I would have waited for the rice and lamb dish."], ["Misi P.", "Punjabi Remix!!!!I love Indian food, and Sindhu has a great daily lunch buffet for about $8.  All you can eat!  It's only available M-F, I think, so perfect for that midday-I'm starving-my-arse-off meal.  The only downside to it is that if you have to go back to work in the afternoon, you had better come prepared with the Febreze in the back seat.  Like I said, I love Indian, but I swear you will go back to work, fumigating your office with the scent of curry coming from your pores...well worth it though.  This is.....the remix!"], ["Lyndsay C.", "My first visit to Sindhu's actually began my love of Indian food....and since it is best Indian restaurant around for miles in East Lansing, I would have to say it is my favorite restaurant. HOWEVER, there are some things that should be noted:1) They do not serve dosa or other South Indian dishes from Thursday-Sunday (at least within the past year). I think they do that in order to have more guests during the weeknights, but...it's just not a good idea. If they are the best (and only good) Indian restaurant in town, they should make South Indian dishes everyday. Very sneaky...2) The service is not superb. Don't expect to feel like a welcomed guest most of the time...especially when they are about to close...therefore, don't go late....and that is pretty much the bad news. Good news: fabulous dishes (my favorites: Paneer Makhani, Veg Makhani, Chicken Tikka Masala, Mutter Paneer, tomato soup - not sure if you'd consider that rasam) ...I'm sure other restaurants+indian home cooking have more extravagant spices + flavors...but when I just want a tasty, rich dish...Sindhus can do no wrong!! (and definitely go to the buffet - SOMETIMES they have dosa :)"], ["Aaron W.", "Fantastic Indian food!  The buffet had a great mix of vegetables, curries, meats, rice and breads.  We went to the buffet on a Saturday and it cost around $9 a person.  Seems to have a steady stream of traffic, but the service was a bit lacking.  I think they were a bit surprised that we didn't just get up and help ourselves to the buffet; after ordering drinks, we didn't see anyone until we got the bill.  But this was quite forgivable, what with the great food for a good deal."], ["Su L.", "got an order of samosa & chicken vindaloo to go. the lady who took my order wasn't very inviting.. as if she was insulted that i was there. if the food cost $5, i would say it was pretty mediocre but for $15, i was expecting a lot more. the samosa was too doughy & the vindaloo was more sour than spicy. i wouldn't waste the trip..."], ["jc m.", "Sunday Brunch buffet was great! Take it from someone's who's indian-it's pretty good! The food was fresh and everything tasted great. Since it's a buffet on Sunday, I would suggest getting there early (12pm) if you want  the fresh dosas."]]}