{"Fazoli's": [], "Piazzano's": [], "Carrabba's": [["Jamie L.", "It is a typical but above average chain Italian restaurant. The food is good and there is lots of variety between steak, seafood, and pasta. I can eat a whole basket of the bread and the dipping oil and spices they give you for the bread is excellent.Service is always decent, and sometimes very good. No complaints about that at all.My only complaint is the prices. Even from a year ago prices have drastically increased while the serving sizes have shrunk greatly. My Mom got the lobster tail and steak combo, the lobster must have been a midget because the length of the tail was about the size of the *short* side of a dollar bill. My favorite, the Chicken Trio has shrunk from three whole breasts to three half breasts all while the price increased by about 1/3 from about a year ago. The salads are smaller than they used to be. The side dishes are more limited, you used to get a choice of spaghetti or cavatappi, (wasn't there even a 3rd no-charge pasta choice at one time?) or garlic mash potato. Now you get cavatappi or mashed potatoes. Total was $100 for four people, water to drink, and no appetizers. I used to eat here 1-2 times a month because I could not cook at home for what they charged. Now I can't afford to even eat there more than 1-2 times a year."], ["J. R.", "We loved this restaurant!  We didn't know it was a chain when we arrived because we hadn't heard of it before.  I was visiting from out of town and went with my kids (5 and 7), my husband and my parents.  We were seated at the pizza bar and got to watch the kitchen prepared the fire-roasted dishes, particularly pizzas!  (The ingredients looked great!)  The pizza-maker gave each kid a piece of dough with some flour to play with and they were entranced.  Service was slow to begin with and I was a little worried (everyone was hungry and a little grouchy), but once they got rolling everything was great.  We loved the warm bread with oil and spices.  The sausage and lentil soup was exceptional.  Spicy and flavorful.  I had the chicken Bryan, which was fabulous.  Tender with great flavor - I loved it.  The garlic mashed potatoes were a good side, although I wonder what else there was that may have been better.  My hubby had the manicotti which he described as \"awesome\", my mom had a chicken cobb salad which she enjoyed and my dad had a seafood pasta with mussels, scallops and shrimp that he loved.The kids' food came quickly, and my extremely picky son ate his entire pizza, which is unheard of.  My daughter just had plain spaghetti (with butter and cheese) but halfway through the meal when she complained that it was cold and we asked if it could be reheated, they gave her an entirely new serving!  Both children had the kids dessert (ice cream) and loved it.The pizza bar area had a cold draft, even though it was close to the fire, but that was a minor concern.My preference is for beer, which they didn't have an extensive menu for, but it's an Italian restaurant with an extensive wine list.  If we're back in the area I'd return."], ["Robert K.", "No wait on a Friday night!Tried the bacon and caramelized onion flat-bread...it was good.Tried the Rigatoni Martino pasta seconds special and the Chicken Trio...both dishes were flavorful.Service was excellent."], ["Gary U.", "Great food from steak to pizza. A favorite of mine for great service. Caesar salads and soups are all great."], ["Chelsea M.", "Let me start out by saying I am not usually a fan of chain restaurants. At the very least I won't repeat my visit to them often. But here in the world of Lansing, most restaurants are chains and the ones that are not don't always stick around long.This Carrabba's is a different story. I'll head here with the significant other to share a bottle of wine and nice fire grilled pizza on a semi regular basis. The staff/service is always excellent and they are extremely accommodating. My favorite pizza, four cheese, is not on the menu any more but they are always more than happy to make it. The wine list is pretty good and the server always makes a good recommendation.I think eating at Carrabba's is all about know what to order on the menu. If you're not sure what is good, ask the server. They should be able to point you in the right direction.**Try the sausage and lentil soup. It is AMAZING!**"], ["H M.", "Went to this restaurant for a birthday dinner and the service was terrible. Our server spent the entire time complaining about having to serve 18 people, which clearly set a very negative tone for the entire dinner. When a few extra people showed up we placed their names on the waiting list for the next available table, and after being seated, they were promptly harassed by another server. He demanded to know why they had been seated when there were others waiting for seats and when we tried to explain that we had placed our names on the waiting list and had NOT gotten the table ahead of anyone else, he continued arguing with us. We finally spoke to the hostess and cleared up the situation. After waiting 30 minutes for a someone to serve the table, we once again had to speak to the hostess, who assigned us another server.The food was great but the blatantly rude and insulting waiters will keep me from dining at this location ever again."], ["Miss P.", "Although it is a chain, I did expect a little more of an Italian experience than I have received. The ambiance and style is super dull. Not to sound repetitive but the service did exceed my expectations by far. As for the food & drink:- mixed drinks were the weakest i'd probably ever seen. - crab cakes delicious, excellent texture- canneloni's were not fresh and probably microwaved (as another mentioned about the lasagna!). - calamari was frozen too and seasoning was way too overpowering. Rather expensive for not such a great outcome. Only because of others' reviews i just MIGHT give it another shot."], ["Liza P.", "I'm a fan of Carrabba's, but this location is a hot mess. The waiter was adorable, if not completely lost. The entrees arrived minutes after our salads. Responsive? The salmon dish reeked and was clearly off. Ralph! The spaghetti managed to be overcooked and yet cold at the same time. Magical! The children's portions were half their usual size. Stil hungry! The place they seated us was freezing. We used a cloth napkin to block the breeze from the window. Fun!"], ["Destiny B.", "Went here with the BF on Saturday and LOVED it as usual! Chad is AMAZING! The shrimp scampi and filet marsala are my faves."], ["Allan K.", "I like this place as far as Italian chain restaurants goes. First tried a Carraba's in Orlando and liked it as I don't believe we have them on the west coast. Definitely better than Olive Garden/Macaroni Grill in my opinion. Good service and good bread :) Carbs with my carbs :D"], ["Max K.", "With a party of roughly eleven, I wasn't expecting the greatest service or the greatest food, especially from an Italian restaurant chain. But that didn't stop me from giving this place a try because I have friends who rave about their pizza and chicken.It was around eight o'clock when we arrived, but still relatively busy. If we didn't have reservations we would have waited about half an hour. The atmosphere is similar to any Italian chain, in fact, I'd put it at the same level as an Olive Garden by strictly aesthetic appeal. However, the food, is much better. At Carrabba's they bring out warm loaves of bread and a plate of garlic to mix with olive oil. Most entrees are served with a soup or salad. I opted for the Italian salad which was topped with the perfect amount of dressing and fresh tasting kalamata olives. My entree, the chicken marsala, comes as either a small or regular. A small is just half a chicken breast, so pay the two extra bucks and get the regular. Considering $16 gets you bread, salad, a side (spaghetti, vegetable, or mashed potatoes) it's an OK price. My marsala was absolutely delicious though. The mushrooms and sauce only complimented the flavor of the grilled chicken breast. The side green beans were cooked in olive oil and had a nice crunch to them, not at all soggy. Plus, our entire party even got free chocolate sundaes because we were celebrating a birthday. The service was excellent and the food was delicious- not bad for a chain."], ["Su S.", "My go-to pasta place. They will mix and match anything bc it's all fresh! I like ordering a pizza to share as an appetizer."], ["Tracy P.", "It's not a 5 star place but food has been consistently above average. Service is excellent."], ["Erich Z.", "There are lots of chain italian restaurants out there, and this one's the best. Carrabba's is from the people who bring you Outback Steakhouse and a few other small chains. It's certainly situated a solid rung or two above the Olive Garden on the \"Italian Chain Restaurant\" ladder, and it shows in every dish I've tried. The basics, like manicotti, spaghetti, and ravioli are excellent, and the signature dishes are even better. It's quiet enough to have a good conversation, and you feel relaxed where you do not have to hurry through your meal, unlike in other chains where you sit elbow-to-elbow with other tables, and the emphasis is on turnover, not dining.The only complaint I have is that on one occasion a meal was served too cold to a member of our party, but that was fixed and taken off our bill without any prompting on our part. So this location has great food, and the customer service is excellent as well.If I'm going to spend money on italian food it had better be decent, and Carrabba's does not disappoint. Plan on $11-17 per entree, and of course more if you are going to drink some wine, which you should."], ["Ed C.", "The service was fantastic. As there was a long wait, they even gave us some little pizza slices to nibble on while we waited.  However, the food was pretty disappointing, especially for the price. Even the house cabernet was weak."], ["matt r.", "Very friendly wait staff, food is very good for a chain, even a good place for kids"], ["Martha K.", "Sit at the pasta bar and enjoy the staff as you watch them prepare the food. It makes for an enjoyable meal and sometimes you may get a sample of an appetizer, main course, or dessert.The steak marsala is incredible and their pasta Carraba is a wonderful comfort food."]], "Pizza Hut": [], "Mancino's": [], "Tony M's": [], "Art's Bar": [["Erica C.", "Had the 12\" chicken pizza delivered to my hotel tonight. Quite delicious, still hot, and the cheese was still stringy! I was exceptionally impressed with the crust as well -- good flavor and texture. The order took under an hour and the delivery guy was pleasant."], ["Russ A.", "''Dive'' right into Art's! Cheap beers.   Pizza that is good to start with and only gets better the more you drink. Wait staff was friendly,  as we're most of the other customers.   Several TV's to watch for sporting events. It isn't all that pretty to look at but very fun and very casual.   Enjoy your visit in''pike position.''"], ["Mike R.", "I'd call it a dive bar.. But the waitress was too nice.. I want the true dive bar experience.. Where the waitress and other patrons shoot you glances that say, 'what are YOU doing here' ..I ordered the chicken fingers and my friend ordered a burger.. They did not ask him how he wanted it cooked.. He said it was sufficiently juicy though.. The fries are sub par.. Chicken fingers were fantastic.. 3 dollar enormous beers which is a redeeming factor.. I was in the bathroom at the urinal when a drunken patron stumbled in and bumped me while I was pissing.. This gave me stage freight and it took a couple minutes to regain my bearings.. Value is great, great environment.. Would return.."], ["Robble R.", "One of my favorite Lansing bars.  When I have visitors in from out of town we go for Schoops and a pie!  Thumbs up for Art's Bar!"], ["Dan S.", "One of the best pizza places in lansing no need for extra cheese as the ninja turtle slices are as cheezy as they get interesting selection in assorted pizzas like taco pizza think I ate in once and service was just ok or this would be 5 stars."], ["Rob M.", "Old school dive bar.  Giant beers, good pizza and burgers.  Kids even liked it.  Watched the Packers sneak out a game with the Cowboys."], ["John K.", "This place is my favorite dive in E.Lansing.Huge beers, good pizza, THE BEST wings in the state, cool people, and the only place in town that has free shuffleboard.What else could you possibly want?"], ["Ryan W.", "This is the kind of pizza where 1 or 2 slices gets you full. It tastes really good. The sauce is great and the crust is good. They also use quality toppings."], ["Gary H.", "Perfect dive bar. Order a \"shooper\"- a giant goblet of your favorite beer. Honestly yes, the pizza is lackluster, between here and DeLuca's it's clear Lansing people just don't know good pizza. But the food offerings are inexpensive and plentiful, the beer flows freely, and service tends to be a riot. I say tends because on some awful night social groups will block off a whole section and scream bloody murder at each other all night- that's not so fun. Most nights though, it's just a chill place to grab a (large) beer and a bite."], ["Matt C.", "A great dive bar. Townies, MSU fans, and Capitalistas (made that one up) all come here if they know what's best for them. Art's is a dive bar on the slightly unbeaten part of Kalamazoo. Its closest neighbors are second-hand furniture stores and abandoned buildings, but that doesn't stop Art's from being a great place to get a cheap beer, good food, and watch a game.As expected with a dive part, the draft beer selection is minimal (Bud, Bud Light, Miller Light, Labatt, and Dos Equis for an upcharge), but for a modest price ($3 on game days), a generous 32oz schooner glass full of it. Also with the purchase of beverage, our table got a monstrous colander of popcorn.  The local's will rave that the pizza is best in town, but I'd say its the best bar pizza in town. Art's additionally has a full menu comparable with other bars in the area. The curly fires a great, and the potato skins were quite good as well (albeit steak fries made from the skins of potatoes). From what I can tell, the kitchen is open relatively late.Overall, a great dive bar. Don't expect much class, but do expect to have a good time."], ["Robert K.", "I'm not sure why everyone is jocking this place.We finally ordered a pizza from here after hearing rave reviews.It was basically a baked wad of cheese.The sauce was ok, but there's no reason to get stoked about this pizza."], ["Lisa Z.", "Awww yeahhh arts bar. My dad used to go here after work when I was little and he can't believe I love to go there now. Huge schoopers of beer, along with phenomenal pizza. Staff is always super friendly. Blue collar dive, with a Michigan state theme. I love it."], ["Foodie L.", "This pizza was ok.  I don't get the hype. Way to much cheese."], ["Nancy K.", "Nothing beats a good dive bar.  I was at the Capitol on Thursday for a rally and a group of us decided to meet up for a beer after.  While I'm not from Lansing, nor do I spend any time there, I agreed to meet up at Art's Bar.  It's about a mile walk from the Capitol, easy to get to though I wouldn't recommend doing the walk at night.  Definitely not on the beaten path, and a little rough of an area.  But, during the day the walk was fine.  I have to say that the pizza is pretty good and everyone raved about their food (lots of sandiches).  The beer selection sucks, but whatever, it's a dive bar, not a gastro pub.I would have given Art's four stars except that I had kind of a weird experience that could have been avoided.  I ordered a seltzer and when it was delivered it was simply disgusting.  I thought it maybe had alcohol in it or something and when the waitress came back I told the waitress that and she said, \"Yeah, our seltzer is really gross, it's the line or something,\"Um, why not just tell me that befeore?  Weird.Despite the seltzer debacle, I definitely recommend Art's Bar for anyone looking for a fun time at a dive bar for lunch, after hours, or whever else."], ["Clay R.", "If you want classic Lansing watering hole, this is it! Awesome food, excellent hole-in-the-wall atmosphere, mostly original decor (complete with massive Magic-era MSU hoops murals), table shuffleboard and a long bar to belly-up to. And they actually have specials on decent beers! Warning: Don't ask for extra cheese on the pizza ;-)"], ["Staci S.", "My favorite place to get pizza, especially the half baked take home pizza. I love the goblets of beer. It doesn't look promising from the outside, or even when you walk in, as it's not the nicest of places, but you will be pleasantly surprised if you stay for some drinks and food."], ["Dietrich W.", "Oh Art's Bar.. I am a fan. This is my favorite dive bar in Lansing. You attract quite the odd crowd of folks, but never do you feel out of place. Your  beer shoopers are a steal at $3-4 for 30 ounces of beer.The good: Pizzas, burgers, cheap beer, service.The bad: It's a bar, it gets loud. If you want a quiet meal, here really isn't the place.Favorite dish: the BBQ chicken pizza!"], ["Blue B.", "I love Art's.  It is one of the few bars I enjoy going to in Lansing.  We've had good food, including the pizza and the appetizers, and the burgers are greasy and delicious, as you would hope they would be at such a dive.The shoopers are great, its never too loud to hear your friends, and we usually get Dori as our waitress on the weekends and she's fantastic.  Go to Arts!"], ["Brian S.", "Such a wide range of clientele but always friendly and super fun; Food is delicious; Drinks are cheap (especially beer, SHOOPERS!); Waitresses are great fun and will get to know you; Service can be a little bit slow on big game days, but it's worth it for the atmosphere!"], ["Chuck K.", "My Yelp Friend took me here this weekend. If you're into dive bars, this place is five stars for sure. Belly up to the bar and enjoy $3 fishbowls of draft beers (they call them Shoopers here). Friendly bartender and great popcorn to snack on while you play some keno and watch the game. Really smokey, but come May, that won't be an issue any longer. Definitely a nice local bar on the border of Lansing to give a whirl!"]], "Zano's Pizza": [], "Spagnuolo's": [], "Deluca's Restaurant": [], "Coral Gables": [], "Guerrazzi's": [], "Olive Garden Italian Restaurant": [], "Tannin": [], "BRAVO! Cucina Italiana": [], "Noodles & Company": [["Riley H.", "The Mac n' Cheese was excellent. It was pretty busy, but the service was quick. It had a pretty chill atmosphere, which made it very enjoyable to relax at. The manager seemed a little sketchy, as he looked like a normal person walking around asking people how things were. That still is a good thing though.The pop wasn't real good whatsoever. It had different tastes to it which made it seem like it wasn't the Coke that I had put into my cup. Overall, it's a cheap place to go if you are in a good mood and want to relax. I'm not big into Mac n' Cheese or anything, but this place makes me want to come back again."], ["Samantha S.", "They have pretty good customer service. If you have a question I'm sure they'll be able to answer them. Good atmosphere. They have different kinds of dishes. Me personally I was a little disappointed that they didn't have any bacon dishes but they're willing to make an old dish for you so it works out. I would definitely recommend this location. In terms of price. The dishes on average around 7-8 bucks. But it's enough food to on the plate so I don't complain afterwards. Enjoy!"], ["Jon P.", "I don't have a Noodles in my hometown so I have eaten at several around the country when I see them.  And the food has always been excellent, but it was not good at this location.  I had the pesto with shredded pork, and my daughter had Mac and Cheese with meatballs.  Both meals were dry and tasteless as if from the microwave."], ["Marcie B.", "Ugh. Food took just under 15 minutes and was delivered to the table cold. Mac and cheese was luke warm with hardly any sauce. Will not return here. Place was super busy and kitchen looked like a cluster.  My husband's food was good, but I'll leave him to tell you about that."], ["Lorraine H.", "The food was fast, the order was accurate. The staff was nice. The dining room looked like a tornado blew through. Wait - What? When I placed my to-go order and sat to wait, nobody else was in the dining room.  Three tables had dirty dishes on them.  80% of the tables had food crumbs/particles on them. The chairs were all askew, and there was stuff on the floor. The entire duration of my visit, nobody on staff noticed the dining room's condition. Not even the staff person who sat at the counter, talking on her cell phone, for 10 minutes. Tsk Tsk Tsk - what a shame."], ["Crystal M.", "Their Mac & Cheese is the best :D"], ["Lizzie P.", "I come here all the time, the staff is very friendly and efficient. They are very accommodating if you want to add different things to your dish. A great quick place for lunch or dinner."], ["Ann O.", "High prices for decent food"]], "Samuel Mancino's Italian Eatery": [], "Falsetta's Casa Nova": [["Jessica M.", "Above and BeyondAt the recommendation of a friend, I had my baby shower at Falsetta's a few days ago. We had a group of 17 women and everything was perfect! The food came out in a timely matter. Our Antipasto salads had tons of goodies on them. The cheesy breadsticks were hot, garlicky, and cheesy. Everything that you could want in good breadsticks. All of the pizzas were great, but the Spinach, Chicken, and Mushroom Pizza with white sauce stole the show. The food was great, the service was better. Andrea was extremely personable and efficient. No one waited for a drink and the food came out at a perfect pace. Andrea wouldn't let me lift a finger, including getting my pizza slices from the other side of the long table. She even cut and served the cake for us. When we left she gave me a big hug and congratulated me. I manage for a high volume restaurant in Northern Michigan, Andrea is everything that we look for in a server. Andrea, if you ever move up north please contact me, you have a job waiting for you."], ["Mitch W.", "Ok... The outside of this place is so dilapidated that it makes you think they've gone out of business. Once you spot the flashing OPEN sign you make your way in to the foyer that smells, umm, ...gamey. You're greeted by the hostess stand and two giant lotto vending machines that sit at the end of a dividing wall like guards prompting you to choose your fate: left to the dimly lit bar or right to the dimly lit dining area. We chose the right side where natural sunlight could be seen pouring in from a second dining room that has windows, which we made our way to. Shortly after a server arrived to take our order. She wasn't rude and I really don't have any complaints about her, but I wouldn't say she was cheery or friendly. We each got a pizza and split an onion ring basket. The rings came a short bit later and were pretty good with a nice light tempura like beer batter. Mildly oily, but quite good.  The pizzas came, and as another reviewer had mentioned it was moist. I wouldn't say soggy, but once you have a slice out you do have to tilt the pan to help it drain a bit. This isn't really an issue in my eyes as it sometimes happens with pizza on a pan. No biggie. I couldn't definitively tell whether the dough was homemade or not, but it was good dough regardless. But the toppings were the money shot. The bacon is the thick cut crispy, crumbly kind (yum!) and the Italian Sausage is real deal sausage links busted up and spread around. The pepperoni and cheese both seem to be of a good quality. A tasty pizza, indeed.  Not something I'm gonna drive 45 minutes out of my way for, but would definitely order again should the occasion arise. Even though the building is abysmally dismal, the food here shows promise and I wouldn't mind trying some of their other fare. The menu picture of the Manicotti looks super good. Might have to make a follow up trip soon."], ["Lacretha P.", "Worst Dining Experience EVER!!!!!!My husband and I went here for lunch before going to a movie. At first sight the place was dark and dank and empty,, with a smell of dirty mop water. There was no sign giving us direction on whether we were supposed to seat ourselves or wait to be seated. We found out from a waitress whizzing by. We seated ourselves, and waited 15 minutes to even be noticed by a waitress who'd been in and out of the room several times. She informed us that they were short staffed and took our drink order. I ordered a Merlot and my husband ordered a Bud Light, one of the few beers they had on tap. My wine tasted old. And I immediately noticed the pink lipstick mark on my dirty glass!!! My husbands glass had a never disappearing ring of grime which he kept wiping and making worse. Even after he took a napkin to it, it didn't go away. After cautiously sipping our drinks for another 20 minutes, someone finally came to take our food order, we ordered from the 8.99 lunch menu, I ordered the chicken parmesan, and my husband ordered the veal parmesan. Both came with one side. He ordered the chili, which he said he enjoyed, and I ordered the salad. My salad consisted of iceberg lettuce which was wet, two cherry tomatoes, and a few really hard croutons, the ranch was runny which resulted in a white cloudy puddle in the bottom of the bowl. And there were several large drops of Italian dressing running from the edge to the inside of my salad. I ordered ranch. After eating our chili and salad, we waited and waited and waited another 35 minutes passed and we had to ask the waitress what was the status of our order. She rushed off to go check, and came back to inform us that our order never went into the computer!!!!! We sat there for over an hour and never got to eat any real food!!!! My husband then asked to be cashed out, and she actually brought us a bill!!!! She apologized, and then rubbed my arm and said, \"Sorry hun, please come back to see us!\" I'm pretty sure she knows that will never happen. This was our first time going here and our last. I recommend that if you have other options choose them. Even a quick burger from a fast food drive through would be better than this place. Dine at your own risk..."], ["Will K.", "got there pizza and it was wet and soggy....brought it home and tried to rebake it ...didnt work out...had there food besides the pizza and is OK...wont be back ...to many other options"], ["Stephen P.", "I have 2 words to say.... TOTALLY AWESOMEBest ribs I have ever hadJohn and Brian were great hosts and lots of funI had the full rack of ribs and asked for half as bar b que and the other half as bourbonVery moist and fall off the boneFish was awesome and lots of it as wellSteak was good as well with a great sweet dipHighly recommend this place and will be returning....."], ["Alex M.", "Today was the second time I have been here, both times for lunch.  A friend from work needed to do something nearby so we thought we would give it a chance.  I don't think I will be back here again.  Neither the food nor the service is really up to par.  I ordered the $7.99 special of Chicken parmesean, comes with spaghetti and a side (salad).  It certainly was not fresh and pan fried as advertised.  I have a feeling it was cooked some time ago and reheated.  The portion was big, two breasts, but they were not even pounded thin like should be done with chicken cutlets so they cook evenly.  Beyond that, the sauce is no better than average, large chunks of tomatos, seemed like a can of crushed tomatos with a little spices.  My plate was practically covered in it after I had finished the spaghetti, which was cooked decently well.  I did not finish the chicken.  The salad was wet iceberg lettuce, some croutons and a wedge of tomato.  Very very runny ranch dressing.  Bleh.I am super curious about the positive reviews because it is hard to believe that the folks that served the food we got today could put together something beyond three stars."], ["Lindsey K.", "I have to say I avoided this place due to the Yelp comments. I stopped in recently out of necessity/convenience. Wow, I'm really shocked in the low yelp ratings. I guess it's all perspective. I have a couple of categories for eating out. #1- a place where you go for special occasions/have to get dressed up and #2 - a place that serves great food, is a clean/comfortable environment, and I can go in jeans and a hoodie. Personally I don't have that many special occasions and my going out preference is #2. The first time I went here it was so packed, we sat at a table in the bar. This worked out because we were right by the kitchen and watched plate after plate of awesome looking food coming out of the kitchen. They have a Friday night prime rib special, which looked really good.This place is definitely family friendly, with a good mix of age groups. The bar is a separate area and it seems to be busy all of the time. Sure the decor is a little outdated, but its clean. The food is excellent. Try the Fries. I think they are beer battered or something, whatever it is its awesome. Sandwiches are good and the Italian specialties are really tasty.  As far as my judgement of Italian food- I haven't traveled the countryside of Italy, but I don't say EYE-talian either. I'd say this stuff is good. Pastas, pizzas, meatballs etc. You get a lot of food and the meals come with sides. The only minor dislike is the bread basket they bring out. I do like the packaged breadsticks (dipped in butter of course), but there's some kind of weird plain toasted bread in the basket that just seems like its ready to be ground into bread crumbs. Everyone working was extremely friendly. I will be adding this spot to my #2 rotation if ya know what I mean. I think it's time to give this place another shot."], ["Jennifer H.", "Not sure why there are so many negative reviews!   The food is delicious and the portions are huge for a good price.  There is a lot of variety on the menu too!   The service can be a little slow on occasion.  On our most recent trip, it wasn't busy and the service was slower than you'd hope for but still attentive...   If that makes any sense.  Our drinks were kept full, etc but it did take awhile to get our meals.  The decor is somewhat...  70's-ish but not gaudy or anything.  It is clean which, to me, is what matters most."], ["Bonnie L.", "Used to be my favorite place to eat I have been out of town for awhile could not wait to eat there again however it will be awhile before I return service bad and also the food not what it used to be."], ["Mary D.", "It looks like its time for a newer review for this place. We were there last nite (Fri) with a group of 9.  Service was very good, we were served our drinks promptly and didn't have to wait long for our meals.  I got their $7.99 special that included a 6 oz. sirloin and 2 sides.  Salad was OK, but the baked potato was wonderful!  OVEN, not micro'd, and it didn't sit in a warmer.  It was hot, and had that great baked potato texture. My steak was grilled perfectly.  Hubby had the lasagne, which he said was just fair.  It didn't taste homemade - more canned.  2 in our group had a pizza that looked really yummy. 1 of us returned her steak that was well-done rather than med. rare.  A new was brought to her in 5 min., done perfectly. I was very pleasantly surprised and will be back."], ["Jenny C.", "I wanted a burger so stopped in for take out.  The burger was a bit subpar generally - no real flavor and over cooked.  I thought since it was takeout and the restaurant more an Italian place, I'd give it another chance.  I went it with some friends.  Service was friendly and just fine. I had some sort of dish with white sauce.  I could barely eat it due to the high salt level.  wow.  Took most of it home but it seemed even saltier upon being warmed up.  Luckily the dog wasn't so picky."], ["Catherine G.", "The food was awful. I can't believe there was a wait to get a table at this place! Service was fine, but fairly slow and certainly not spectacular.My boyfriend ordered the lasagna, which they advertised on their sign outside. It had pepperoni inside, which worried him, but he gave it a try. Not good.I sampled the onion rings, which I do have to give them credit for. They are really thick, beer-battered and really greasy, but good.  Their ranch is also \"good ranch.\"But my steak was horrible. Completely over-cooked (I asked for medium well and it was dried out and almost impossible to eat.) There was no sauce or juice of any kind. It came with broccoli, which was just boiled and thrown on the plate. No seasoning, they barely bothered to cut it into manageable pieces.They only have three beers on tap - Bud, Bud Light and Labbatt's, I think.  The place is dark and crowded and not a pleasant dining experience."], ["Steve T.", "In general, I think this place is trying to live on the reputation of what was \"Casa Nova\".  Years ago, the old Casa Nova had great pizza.  Lots of high quality cheese, etc.  The rest of their food was pretty tasty as well.  The name might be the same.  The food isn't."], ["Lorraine H.", "I thought the lasagna was Stouffer's frozen microwave. Really lousy. Cold in the middle. The pizza's okay. This place is not recommended by me."], ["Anne H.", "Awful. I guess they don't believe in bussing tables. Slow service and bland pre-packaged microwaved food."], ["Iris S.", "Actually, I don't think of this place as gourmet at all, but I do believe that for the price, you are getting a good deal.  The bf and I went a couple of times when we still lived in the area and it really isn't that bad.  The pizza is pretty tasty and he was brave enough to try the steak, but I didn't try it.  The service has always been friendly and the place crowded with diners.  It is what it is, as my mom says.  If you want classy, check out the Knight Cap, otherwise the value here for a light wallet is quite reasonable."]], "Marco's Pizza": []}