{"Sultan's Okemos": [], "Ozzys Kabob": [], "Zaytoon Mediterranean": [["Eric C.", "This place is a gem. It is independent. The owner is involved with the food.  The food is absolutely delicious. Among the very very best chicken shawarma sandwiches I have had. It is clear that the people cooking here really care about the quality of the food. We ordered take out and the food was ready promptly. The stuffed grape leaves way above average.Absolutely on my 'must return to' list."], ["Rebecca B.", "I am a food snob.  Coming from Detroit/Dearborn makes my Middle Eastern pallet refined, even if I can't spell half of the dishes.Walking in, little confused but it is a counter where you order, get a number and find a table.  They bring the food to you, you get your own pop and refills.Prices - super reasonable.  My whole meal was $10 and I got a pop.  Got a vegetarian combo which came with choice of soup/salad, tabouleh, falafel, and hoummus.  Two pieces of bread, pita and soft roll.The soup was good.  Actually everything was good, but needed more garlic.Good, cheap, fast.  Oh and super friendly.  But packed."], ["Bill B.", "Wow!  I love Middle-Eastern food and I've eaten it for years.  There are lots of good restaurants near me but this place in Lansing tops them all.  A few things stand out.  First, the food tastes home-made.  A lot of places say that but you can actually believe it here.  For example, I got veggie cabbage rolls.  Instead of the usual tomatoey recipe I'm used to, this relied on spices and aromatics.  Terrific!  The crushed lentil soup was warning and balanced rather than being a sea of cumin.Second, Zaytoon is mindful of gluten-free dinners (like my wife).  They have an entire gluten-free menu.  They also allow substituting rice without vermicelli (little wheat strands); this is almost unheard of at Middle-Eastern restaurants.  Last, it has great atmosphere.  You walk up to the register and order and they give you a number for your table.  You can then sit and absorb the room.  It's comfortable, convivial, casual.  On the day we visited, there was a sprinkling of college students, single Millenials  and families but we older people felt at home there, too.  I was totally impressed by Zaytoon.  If you like this kind of food and are anywhere in the area, you must go!"], ["Teresa C.", "Delicious dishes with really personable friendly service. We loved our meals here. The chocolate chip baklava was the best that we have had."], ["Sherry T.", "The food is excellent the service is excellent eat there 3 times a week I highly recommend this restaurant for lunch or dinner you can't go wrong healthy eating"], ["Tara J.", "I So wanted to give 3 stars, but the food was just too good for that (and let's all agree,  that's why we're here).  We arrived at 12:05pm today (Wednesday), waited in line for 20 minutes, ordered our food and it arrived 22 minutes later.  Normally.. I'd give stars for the wait.. And if I wasn't on my lunch break I wouldn't have cared as much. I digress. To what we really care about: the service was friendly. They were frazzled because of the high Flux of customers, they kept it together pretty well.  Today was my first time at this establishment and was confused about the layout when I came in.  You stand in line and place an order, then they bring it to your table or call your name for a takeout. No big. The food: fan-freaking-tastic. Decent priced. But freaking delicious. We both got the chicken shawarma combo plate. Hefty portions of perfectly juicy and flavored chicken. A very nice portion of amazing rice. And hummus to die for, and again, a nice portion. It came with the hummus and rice and you can choose soup or salad.  I upgraded my salad to the tobuli salad,  perfect. The food is incredible, filling, worth the wait. Make a carryout order ahead of time and skip the lines.  Highly recommended during off-busy times and when a call ahead is made.  You will not regret it. Delicious."], ["Kristin M.", "Had dinner with my fiancé and son. Ordered the Toon for two. PLENTY of food for four people! The fattoush was best I've had - and I've tried many different fattoush salads. The chicken and beef was so flavorful. The grape leaves were wonderful... I ate them and I normally don't like them. The waitress was very nice and even gave us baklava for free because it was our first time. My fiancé is from Dearborn, so he knows middle eastern food.... He was very impressed and said we will be back!"], ["Doyle H.", "Stopped in for lunch, and saw right away that the parking lot was fairly busy. Not too busy, but just enough to let you know that people like this place. A good sign! Being a first timer, I was a little confused, but a quick assessment of the interior workings identified it as a counter-service restaurant. The counter and ordering area even had a helpful list of definitions used, albeit on the opposite wall from the menu. Luckily, I already knew most of the definitions, and used it more as a self-assessing trivia game. =) I opted for the Shwarma \"box\", the standard of which is chicken. If you're not familiar with \"shwarma\", its a spit-grilled, spiced meat that's either shredded or shaved for serving. It can be just about any kind of meat; goat, lamb, beef, chicken, turkey, veal, etc. This shwarma is spiced, shredded, chicken. If you order this meal, it comes standard with a Mediterranean lettuce salad, the creamiest hummus I've ever had, and tasty rice. No substitutions with this particular order, but that's cool with me. I also ordered a side of falafel; always a good benchmark on which to judge Mediterranean restaurants. Each table gets a basket of taboon/pita/lafah (flat!) bread. The food is brought out to your table quickly, which is great if you're pressed for time on your lunch hour, or half-hour. After diving in, I quickly determined the entire meal, including the falafels, to be excellent. I was going to write, \"for counter service\", but this food is excellent by any standard. I think they would make a killing by opening up a Mediterranean fine dining establishment. Great food, excellent prices, outstanding service, all coupled with a bright, airy atmosphere. Makes me wish I lived in the area so I could visit more often."], ["Peter B.", "Outstanding food. The rice pilaf was awesome and that's not some people say often. Super cute and helpful staff. I'll be back when I'm in Lansing."], ["John D.", "Recently treated a birthday party to a fabulous Mediterranean dinner at Zaytoon. The manager went out of his way to make it special and fantastic. When he realized I was ordering for everybody he said, \"Don't worry I'll take care of you\" and boy did he ever!! I'm an adventure diner and eat out all over the U.S. and this food was on pare with great food anywhere. Prices were fair, servings were large and the waiters were very attentive - of course it didn't hurt I had five beautiful women with me. I'll be back soon and am getting hungry just thinking about it! Highly recommend."], ["Kent H.", "If you are looking for great food and great service this is your place to go for authentic Middle Eastern cuisine in Lansing this is your spot! Great charred meats, Lamb chops are to die for. Great kabobs, gyros, kabobs and more. The hummus is so so creamy too!"], ["Joanna F.", "Just had our first visit at Zaytoon's. Ordered the chicken shawarma combo and lamb gallaya. The shawarma was good and hubby said his gallaya was pretty good. He said next time he would order the kebab though. The orders came with pita, bread, lentil soup, salad, hummus and rice. They were all good, well seasoned and fresh. For dessert we had baklava and mango smoothie. We were so full after the meal. The prices were good and great service too.The only thing that I wished they had was lamb shawarma instead of chicken."], ["Miss P.", "Saturday late lunch and so busy in there. The mujadra, baba ghanouj, tabouli and falafel were amazing. Once you have those donw you can pretty much get away with not great tasting everything else. I mean the stuffed grape leaves, spinach pies, and lentil soup were good but not as mind blowing as the ghanouj or falafel. We got a vegetarian meal for two and it had everything and in generous quanities for like twenty five bucks and easily feeds 3 or 4. So good. Good job guys! What the Fattoush!!!"], ["J C.", "Oh zaytoons. Suppose I hadn't been here in awhile but I was pleasantly surprised on my last visit. They updated the order counter and it looks so nice and much more complete now. The food is still good and service is great. The weather was nice so I sat outside this time and it was great. The only thing I was confused on was I thought the garlic dip was included with the meal but they charged me a quarter a piece this time. Cmon, even most fast food places have stepped away from charging for condiments. I think that is pretty lame. Otherwise I still love this place and recommend it as a dining option for the west side."], ["Sunita K.", "Reading the reviews, went for dinner there!! The wait in line was short, were greeted with a smile and food came quickly!!but the food was not as tasty/flavorful as read in other reviews!!the waiters were friendly, thoughtful and quick!!"], ["Beau M.", "Oh my god this place is great. The kabobs are perfectly cooked. The lifts is amazing. Humus is great not too thick or too thin. Everything about this place is great. I think the cafeteria style ordering needs to go, but other than that it's great. Very friendly staff. You won't find better Mediterranean food this side of Dearborn."], ["Hannah E.", "The BEST Mediterranean food in Lansing. I've never had better lamb chops! And they also have the best staff, I had a private party there for my boyfriends 30th birthday and their display of food was amazing. So glad Zaytoon is on my side of town."], ["Tyra N.", "Dining here was home away from home, but there's no place like home. I have so many great options in the Detroit area that I don't think this place will get a fair chance with me. Metro Detroit is the mecca of american mediterranean food. (Hope that isn't too distasteful of a pun, I'm corny, deal.)I've had their vegetarian grape leaves which left me wanting my at home Detroit taste. They had chickpeas which was different but not quite great. They lack full robust flavor of brine and lemon. They weren't gross but they weren't anything else either. Also they were half empty. Pack in more rice and add tomatoes please!The second visit I dined in. I ordered a juice and schawarma (sp.). I'm so used to ordering a chicken schawarma (sp.) as a wrap that when served on a platter I almost felt foreign. The chicken was well flavored. Shredded and mixed with what looks like a stew of spices I sat back and enjoyed it. It was a little on the dry side but not lacking in flavor by far. I had the baklava twice and both experiences were insipid. No pistachios. :-/The hummus was also too mild for me. Turn the garlic up a notch.My juice was it. I've had two and both were made fresh, fast and had great flavor. This place should focus on serving these, this is what they do VERY well.I'll be back but mostly for juice."], ["Gary H.", "I came in for lunch and got a shish kafta combo. The hummus was a bit bland, but the shish kafta was absolutely top-notch, very nearly home-cooking-good, and I say this as someone whose had multiple chances to eat with Lebanese families. My only real complaint is that the only bread I got with my meal was one dinner roll and one small pita- come on, for a combo you need a bowl of pita. The authentic way to eat is to pinch the food with scraps of pita, and there wasn't enough pita to even get through my hummus. But that's my only complaint. Lansing is a city rife with good Mediterranean, and Zaytoon is a worthy addition. It's not the cheapest, but some of its food is in the running for the very best, so it's worth a try. Definitely recommended if you like the grilled meats- I can't wait to have that kafta again. If this place keeps refining its food, and if they get some flavor into that hummus, they'll be legendary."], ["Sammi D.", "I can't say enough about this place...the food was amazing and the staff was awesome! The portions are more than enough and the food is made fresh, including fresh hot bread right out of the oven! I was so spoiled by the staff...best service I've ever had in a restaurant! Highly recommend!"]], "Pizza House": [["Robert K.", "This was our second visit here and I really wanted to give the Chicago stuffed a second try after a disappointing first encounter.The Chicago stuffed is bland.It looks really good when it gets to your table, but it's all bark and no bite.It is outrageously overpriced for the quality.It's all bland, unflavored dough and gobs of cheese.I thought the first time was a dud because we ordered it with just mushrooms, but we ordered the House Special (pep, sausage, ham , green peppers, onions, mushrooms) this time around and it was just as blah.There were hardly any toppings.Some bites had some toppings, most were just cheese and dough.It literally has no flavor at all.We also tried the Spicy Mediterranean (thin crust) and the Feta Bread.Both were pretty good.Both were also way overpriced.Service was excellent.If the pizza were flavorful, this place would be a must, but it's just more of the same bland food you can get anywhere around here."], ["Justin W.", "Last night in town for this trip to our home state and celebrating a Spartan victory! Several great beers on tap and fantastic Chicago style pizza!! Several tv's in bar area make for a great place to watch your favorite sporting event as well as a more traditional restaurant area for a quieter dinner experience"], ["Su S.", "The worst place to order a pizza to be delivered home. Asked for a veggie pizza and got one stuffed with HAM!!! Damn and they don't even apologize. Hate this place"], ["Ronni G.", "Ok this is East Lansing, not Chicago. If you lower your expectations slightly, you'll get a good meal. Good, not great pizza. Michigan Cherry Chipati is a salad sandwich that's big enough to share. Excellent beer selection. Enough tvs to please any sports fan."], ["Tammy G.", "Lansing is my old stomping ground, but I haven't been back in awhile. Staying at a local hotel, I asked the desk clerk for the best pizza delivery around. She was not wrong, the Pizza House delivers on all levels. Wide variety of items over and above pizza, delivery was quick, and hot and 100% accurate. There was even a coupon on the website that saved me another $2. Delicious pizza, lots of other stuff I would try next time. Give it a try. You don't survive in a college town without being delicious!!"], ["Foodie L.", "I can't believe how expensive this place was.  The deep dish was very bland.  I just wasn't impressed.  Yes, we had a ton of leftovers but I had to freeze it because my husband wouldn't even eat the leftovers....it was all up to me.  I would rather have had a Jets pizza for 12.99."], ["Leah H.", "While the reviews on Yelp! vary, everyone I talked to who lived in Lansing/ East Lansing absolutely loved this place. We finally decided to try it after nearly two months living in Lansing. We went for the stuffed Chicago pizza- and while it wasn't Giordano's from Chicago, it was still pretty good. We looked at the menu online and put our order in as soon as we sat down, even before we ordered drinks. This ensured we got our drinks, then appetizer, then pizza all right after one another. Don't get me wrong- the pizza was really good, but the Firey spinach and artichoke dip we had as an appetizer was absolutely amazing- I ended up eating the last bite with a spoon, it was that good! We ate at Pizza House on a Friday night before a huge Big Ten game, and while the atmosphere was fun and there were lots of people there, it was not rowdy. I felt like I could eat my pizza in a fun atmosphere, not an uncomfortable one. Overall, Pizza House is a great place to go for pizza when you're looking for something a little different (and a little more expensive) than take out."], ["Ben H.", "Pizza House is a good spot for pizza and some of their salads and sandwiches are really good. A few years back I would have given them five stars but the quality of food and the service have slipped a bit. The brand new interior renovation is very nice and there is plenty of seating, no matter how large of a party you have.I ALWAYS get the calzone and never have been disappointed with their pizzas. Strangely enough, you'll want to avoid the chicken, the batter isn't very good and the meat tastes like it's been in their freezer a while.Oh, they are also open until 4am....in case your'e up late."], ["Lisa R.", "Pizza House, what can I say?Chicago Deep Dish, and even the regular Deep Dish, WOW. If you live here and you haven't been out to try this yet, you are really missing out. Pizza House probably has one of the best pizza's in town.Now don't get me wrong, all of their other pizza is really great as well! It really depends on how much time I'm willing to dedicate to pizza making and how quickly I want it. Obviously the deep dish will take much longer, usually around 25 minutes just to cook. If you're in a rush, they have other goodies to try, so no need to worry.What I also like is that when ordering for larger groups of people, they have delivery option for almost everything! So if you have someone in your group who doesn't care for pizza, they can order a burger. My final pro? Great food and delivered up to 4am. I used to work on campus in a job that was overnight. I would always get quick and hot service for them ordering up to 4am, it was great.My cons? I recently moved to Columbus, OH and I don't have pizza house here? Yeah, not a whole lot of \"negative\" to say on this one."], ["Matthew D.", "I regularly order from, and go to, Pizza House because of its great food, great customer service, and great atmosphere. During the day, it's a wonderful restaurant, great for parents. During the night, it's a good bar/restaurant, perfect for getting some food after drinking (or while drinking). Generally, it's a great place from which to order.Pizza House has great food of just about every kind (within the Italian/American genre): burgers, pizzas, Italian dishes -- you name it, they make it, and good. I'd highly suggest it.What really makes Pizza House stand out is its customer service, though. I've gotten orders wrong a couple times when getting food from there, and every time, they've worked with me to fix the situation. You can tell they're very committed to customer retention -- and they've certainly retained this customer."], ["Sarah P.", "I ordered in quite a bit from Pizza House when I lived on campus, and now it's the #1 go-to spot for a sit-down meal if I happen to be in the Lansing area.Service has always been good, and the meals are delicious.  I've never had their pizza, but I have tried a variety of the other available appetizers and dishes; they're always fantastic.  Burgers are juicy, sandwiches are well built, my friend loved the chipatis, and the steak fries are perfect.  Oh, and try their creamy shakes, too!"], ["Lyn P.", "Looking through local pizza reviews and chose Pizza House on the basis that there were lots of options and they did Chicago style pizza. Also wanted a beer and a sit down kinda place so off we went. It was deceptively quiet when we walked in and then they seated us in the main room where it was hopping, We ordered the bruschetta with portobellos while we tried to decide what pizza to order. After much debate, we decided on a hawaiian thin crust and an italian meats Chicago deep dish. Our bruschetta came out and it was not what we expected. The bread was cut thickly and was buttered and toasted and then the cheese/portobello mixture came out in a dish. We gamely placed some of the mixture on the bread - it tasted good but it was a bit skimpy on the portobellos.So pizza next. Wasn't expecting green olives on the Hawaiian - it added saltiness to the pizza that was okay, but I definitely could have done without it. The crust was fine, the other toppings were great - the ham was really good. On the Chicago style pizza, I found the crust to be a little doughy. Overall, our pizza and experience was just okay. We've had better and we've definitely had worse."], ["Alan W.", "Do NOT order online!! I waited an hour for my pizza, called to to check up and was told they didn't get my order. It was supposed to print somewhere and did not. The next day there was a charge for my pizza. I called and was told it is now the banks problem as it takes 72 hours to process the refund and that I need to watch my statement for a refund. Overall the customer service through this entire process has been terrible. Stay away!"], ["Scott S.", "number of visits ~ 8last visit 4/2013This is my favorite pizza place in East Lansing.  It's not the best pizza I have ever had, but it is quite good and the toppings/specialty pizza selection is excellent.  I've never really had any of the non-pizza menu items so I can't really comment on those.  The restaurant is large and is very good for big groups.  I've come with groups of 10+ several times.  While the pizza is good, I think it is somewhat overpriced too.  That's why I am only going with three stars instead of four.  If I could, I'd probably give it 3 1/2 stars.  I would recommend this place, especially for groups."], ["Bee S.", "Ok, I must write an update since dining here yesterday for a late lunch before tailgating for the football game (yea first game of the season!). After my first review, I received a sincere apology from the manager via yelp (which constitutes +1 more star in and of itself) and was convinced to give it another try. I went here with a couple friends and 4 of us split a stuffed pizza. The waiter was really nice and attentive! I was actually really impressed. It seems service has taken a 180 since that bad lunch experience with my family. The stuffed pizza was ok. I enjoyed it and I thought it was yummy. Almost just like eating at a giordano's in chicago. One of the 4 of us splitting the pizza is from chicago and he even said it was ok (although, of course, went off about all these other small local chicago pizza places instead). We got it stuffed with half meatball and ham, and half meatball, spinach, and basil. It was pretty tasty all the way through sans a random bite of all basil stalk. The restaurant inside looked clean and it seems as though they've cleaned up the service as well. It's still not the cheapest pizza you're going to get (our 12\" with the toppings ran around $24... but it's stuffed, so it's heavier than your usual slice of pizza!), but at least they have good drink specials during happy hour."], ["Christine T.", "I most enjoy the Chicago Deep Dish pizza.We enjoyed the House special:  Pepperoni, ham, mushrooms, onions, green peppers, and Italian sausage.For lunch, we shared the medium deep dish and it was more than enough for three people.  We had a couple of slices leftover."], ["Marisa M.", "Best food, drinks, prices, and service in all of East Lansing. There truly is something on the menu for everyone. And the pizza is superb, cheesy, warm, and awesome. Love, love, love Pizza House."], ["Eli H.", "I love the deep dish pizza here, it is great, but the pizza at this place is expensive."], ["Teresa P.", "Definitely a pricier place for pizza, which I was treated to, but their ability to accommodate a large group of us was great. An exception was the odd set up for food. A large group hovering around a small crowded table for food doesn't work very well....Their pizza was well made and savory, but the toppings seemed kind of scant. Breadsticks were a bit dry, but thank goodness their extra marinara sauce was great.An a-ok place and was totally satisfied, but unfortunately unimpressed. Come here for a higher-end sit-down pizza place, otherwise, just order from somewhere else and enjoy from your own cozy home!"], ["Julie H.", "Great selection of beer and yummy cocktails. They are slighty overpriced though :( My husband and I ordered a Chicago styled pizza (6 slices) and it was fantastic. Each topping is an additional $1.65. The pizza came out super cheesy and good. Yum!However, my waitress needed more training. She spilled my cocktail all over the table and did NOT even bother to get me a new one, so basically, I got charged full price for a drink that was half filled. When she came back to deliver the food, she sat the food down and then tipped over my glass of water. She was basically spilling everything all over.This place is huge and there are flat screens everywhere and the booths are so big and comfy. Can accomodate six comfortably."]], "Jerusalem Bakery": [], "Woody's Oasis": [], "Olga's Kitchen": [["Nicole B.", "We were picking up a puppy about a 1/2 hour away & I was not about to miss an opportunity to get Olga's. It's been a favorite of mine since I was a kid. Growing up in the St. Louis area we had them in our local malls. Now that I'm in Chicagoland I have to do without.  I called in advance to order since we had the dog in the car. She asked if they could bring it out to me. What? \"We have curbside,\" she responded. Perfect!!! We didn't even have to go in for pick-up. When we got there we were surprised to find that this wasn't a typical mall Olga's, but instead a stand alone restaurant within a strip mall. We pulled into the take-out parking spot & they promptly brought our order to the window. Awesome! Very friendly. The food was made as we ordered it & just as yummy as always.Very pleased!"], ["Dallas M.", "This is one of my favorite places, and always where I come when I come back to East Lansing. The snackers are amazing!! Original, with marina and cheese, or cinnamon sugar, the snackers are delicious. I loved the turkey club, and my friends usually get the original Olga. Zucchini fries are delicious here too. Great service usually, even when they are busy. I got a free dessert when I checked in on yelp! :-) highly recommend this place."], ["Alan K.", "Decided to take a trip down memory lane and have a quick dinner here while I was back in town to visit family/friends. I used to love Olga's back in my school days, but this experience was pretty terrible. It seems like every time I go back to one of my old college and/or childhood haunts, I come away severely disappointed. Either my tastes are becoming more refined as I age (not likely given how much I enjoy Chinese take-out and Taco Bell) or these places are getting worse.So, let's start off with the good: SNACKERS! The snackers--grilled and seasoned bits of Olga's pita bread--and cheese dip continue to be amazing. Olga's pita bread in any form is good, but snackers alone are reason enough to stop in here, even if you don't order anything else. Now onto the bad...for starters, Olga's kind of seems like what you'd get if Applebee's decided to open a chain of Greek cuisine themed restaurants. It's not authentic and I don't get the sense they are trying to be. But the whole pseudo-Greek vibe comes off as a little contrived/forced. I ordered an Original Olga sandwich, side salad, and of course snackers. The lettuce in the salad was limp and soggy, indicating that at best it had been pre-dressed and left in the fridge, and at worst was full of old lettuce on the verge of rotting. The Olga sandwich (also known as a gyro in any place not Olga's) was lukewarm and the meat seemed like it was frozen. To top it all off I got really sick to my stomach immediately after eating here. For fast food greek-diner type stuff you can do a lot better. I wish their bread sucked so I could fully hate this place and swear it off forever. But I'll be back for snackers and to contract a mild stomach bug."], ["Kate P.", "The food was amazing. The staff were very helpful and friendly. Atmosphere was calming and appropriate. I think this is one of my new favorite places. Club sandwich, salad and curly fries."], ["Nina M.", "Excellent service. Delicious food. Got the regular Olga sandwich and iced tea. Server friendly and efficient. She even offered to give us to go cups for our tea. Lovely restaurant. I wish there were more of them near where I live."], ["Nancy T.", "The food was wonderful but the womens bathroom floor was sticky and smelled really bad."], ["R. L.", "Every Olga's I've been to has made me feel sick. The food is bad. The place is dirty and sticky."], ["Dietrich W.", "Really my favorite lunch place in the East Lansing area.Plenty of choices, professional waitstaff, convenient location. And good value to boot."], ["Joe M.", "I got the original Olga with extra \"so much meat it won't close\", fries and spinach pie.So much meat I could have made 2 sandwiches. I'll eat the pie tomorrow..."], ["Emily Z.", "I can not enter the state of Michigan with out a trip to Olga's. I fell in love with Olga's Express in the Meridian Mall but this location has more options and a much nicer less food court-ie atmosphere. Olga's bread is amazing its sweet, soft, and warm, oh and squishy too. My usual is the ham and cheese olga, with snackers and broccoli cheddar soup. Today I tried the fried zucchini and even though the dipping sauce taste like it should be used for shrimp overall they were delicious.Great for a lunch or a casual diner, what ever you do don't leave without trying the snackers. I have also heard they have delicious smoothies though I can not speak of this from experience."], ["Lorraine H.", "Usually I like Olga's, but this Frandor location leaves something to be desired. It's always cold in there. Like, *Freezing* cold. It's February in Michigan, for God's sake, turn the heater past 63. My server today was a young man who was very courteous, polite and attentive. Perhaps a little inexperienced? Time management problem caused a delay in getting my bill paid, and the to-go pop refill had way too much ice in it (hardly any pop at all).  I did not really enjoy being seated in the back room when there were so many empty tables in the main room. The food was hot and good. I do enjoy Olga's menu. They have made new additions to the menu."], ["Chelsea M.", "This is a decent stop for a quick lunch. I think their sandwiches are fine, but I really like the unlimited soup, salad, and snackers combo. The snackers are good, and I think the cheese spread is delicious. I like Olga's for a lunch meeting. It isn't too loud and you can usually get seated quickly. Is the food they serve outstanding? Probably not, but it is what is and that's not bad."], ["Tracy F.", "Three cheese Olga, original Olga and the spinach pies are to die for!!! Love Olga's!!!"], ["Robby R.", "Not bad. Worth 4 stars ...for east lansing.Grilled Veggie wrap was a tad greasy.Yogurt sauce is no tadziki (sp?) - way too bland.Olga is a Russian name, not Greek!  But i guess this place isn't Greek. In jersey, many diners are faux greek, and this place is a faux diner."], ["Alexandra K.", "As I say in my original review, I've been eating at Olga's for years. My uncle knows her, and the original Olga's is a few miles from my hometown. The food has stayed the same, while the prices have suddenly far exceeded the worth. Why should I pay $7 for a tuna olga that used to be $5 a year ago? I think it is officially becoming over priced, but the quality is still high."], ["Ben H.", "Olga's is a good place for lunch, quick and always good- service is friendly too! They have a greek menu with also many other american choices as well. The soup, salad and snackers combo is the nest deal- can you say ALL YOU CAN EAT?!?!?! The iced tea is great too!"], ["Patrick H.", "Food is good and expensive for 'fast food' meals. It's a nice environment, but not worth the price."], ["Erich Z.", "Olga was an old Greek woman who started a restaurant from her kitchen. Legend has it that Olga was a long time sufferer of leaky gut syndrome. She endured gastrointestinal motility problems for many years, eventually coming to the conclusion that all of her problems were due to the food that she was forced to eat every day for nourishment.Finding such hatred for food, Olga sought revenge. She began a line of pseudo-Greek restaurants where the cooks were instructed to cut every corner in the preparation of dishes, and the menu writer was given free reign to price the meals as high as possible. The result is our modern Olga's Kitchen chain. An \"olga,\" made of imitation SPAM, is priced at $7, and comes with nothing. A side of fries are an extra $2, and cola another $2. The food is on par with a poorly run McDonald's, but diners are forced to wait for Waitresses to serve them, making Olga's the most inconvenient restaurant possible.Go there if you must, but you've been warned."], ["Louise W.", "Oh, I wish I'd read James C.'s review ahead of time. I went to the Olga's Kitchen in the Meridian Mall in Okemos. In my defense, I was waiting for a movie, I was hungry, and I didn't really want anything deep fried. Besides, I'd never heard of Olga's Kitchen and I admit I was intrigued. When the food came, I was completely bewildered. My vegetarian sandwich was a kind of pita pocket (sorry, \"Olga bread\") filled with tinned Asian vegetables such as water chestnuts, no sauce, and a side of.... yogurt. Undoubtedly one of the weirdest combinations I've ever had. And no - it wasn't very good."]], "Panera Bread": [], "Zeus Greecian Island": [["Javier C.", "I wish I could give 3.5 stars.I tried the chicken hummus plate.Hummus was creamy and tasty but the chicken was dry.  The rice pilaf is what you'd expect.The Greek salad and dressing was above average.  The baklava is pretty good.I was disappointed that they didn't make feta fries but maybe that's a Chicago thing???  I was staying in a hotel down the road"], ["Robert K.", "Exactly what you would expect from a Greek diner.Good food at a reasonable price.The banana pancakes are bananas good."], ["Daniell B.", "This is a great little Coney island style diner on the south side of Lansing.  The food here is yummy.  I pretty much always get the gyro supreme. It is loaded with gyro meat (cooked perfectly!), lettuce, tomatoes, onion, tons of feta, and my favorite.. the cucumber sauce!  I just can't get enough of it!!  I usually hit the drive thru on my lunch break, as I only have 30 minutes, so I cannot really comment on the service inside.  The people at the window are always pleasant and the food is always fast and fresh.  I have been coming here for 3 years not and have not been disappointed yet.  I will continue to eat here as it is one of the best places on the south side in my opnion."], ["Drew P.", "Decent food but it will cost you. Nice diner like atmosphere. Decent gyro, quick service."], ["Alex M.", "Been going to Zeus for years.  The owners took a dark, dirty and drab KewPees restaurant and turned it into this little gem on the Southside of Lansing.  But remember, its a diner/coney island.Food here is really good and fresh, everything I have ever gotten.  Greek salads are nice.  The service is typically really good, with coffee refills flowing and food brought out in a tiemely manner.  They have a drive through that serves a delicious breakfast sandwich.  I like the ham, egg and cheese on bagel, and for years when I didnt eat meat they didnt make any fuss to substitute a tomato slice for the ham.   Now that I do eat meat again, damn, the double ham slice (which is really thick) is really tasty!"], ["Althea L.", "The first time I ate Zeus' food was when I went through the drive through about 3 years ago.  I brought a gyro home for lunch after a hard day at work,  and it was wonderful...We now go several times a month for breakfast, and dinner is great as well!  Best french fries in town, hands down."], ["Ken M.", "Consistent, very good service and food."], ["Vick A.", "Food always tastes good, especially the breakfast. Gyros are also tasty, but \"gyro sauce\" is a disgrace to all Greeks. It tastes very watered down, if you're into that. I used to be a frequent customer, but I have to say I will never go back unless I pick food up to go. The service is horrible, especially the \"host\" that chomped on her gum and didn't say anything to us as she brought us to our table. She then threw our menus down and walked away, saying nothing or even acknowledging that we thanked her for her \"great hospitality\". Last time we were there, about 2 weeks ago, the owner was overheard, in the middle of the restaurant, telling a waitress \"if they don't like it tell them to get the hell out.\" Overall, terrible service."], ["Chelsea M.", "Excellent Gyros and speedy service.  I can call ahead with my lunch order and pick it up from the drive thru.  I'm not usually much for drive thru anything but these gyros are worth it.I've also gone in for lunch.  The service was pleasant, restaurant clean, and the food was tasty.I typically order the Gyro Supreme with out lettuce.  Only without lettuce because I don't eat lettuce.  It comes with lamb, beef, tomatoes, onions, feta, and qyro sauce.  Yum!"], ["Chris B.", "I rated this place based on service. I went through the drive thru at 9:45pm only to be told that the kitchen was closed but here's the funny part they don't close til 10 wtf. Also rude workers!!"], ["John D.", "Just had a damn fine Zeus Burger! A little messy to eat but worth it. Can't wait to have it again."], ["Patrick S.", "You really can't go wrong here.  The waitresses are excellent, food is awesome and the price is perfect.  2 full dinners with soft drinks ran me about $21.  You will not leave here hungry."], ["Jennifer H.", "Sadly, I have to follow up my prior review and take away one star.  I don't know if the ownership has changed hands or what, but some of the food quality has gotten worse.  Portion sizes have shrunk (but are still ok), the new fries are just gross, and they only allow ONE refill on your drink."], ["Cindy B.", "Went to Zeus' for breakfast on final day of vacation (on our way home from  UP). Had the Gyro meat and eggs. Husband had Greek Omlette w/gyro meat. Service was outstanding. Food was great. Plentifull but not ridiculous portions. We will return during football season."], ["Jorda M.", "Never had a bad meal here. Which is saying a lot since it's the only place where my kids clear their plates. Cheap too!"], ["Corey V.", "I live right down the street and I like that we have an excellent \"Coney Island\"  style restaurant. Try everything, it's all good."], ["Mel T.", "This is one of those great American/Greek diners.  They have everything from good dogs & burgers to really nice Greek dinners and gyro's.  They serve the meals with nice fluffy pieces of bread that are really yummy when you spread lemon rice soup on it.This is a great place to stop into if you are seeing a movie at celebration.  The food is better and quicker than the couple of restaurants right at the theater.  Those place tend to be mediocre and the wait can be horrendous.    Just drive a couple of minutes down the road you'll be at a kid friendly restaurant with good food.Sometimes they close early if they haven't been busy.  So if you are going in around 9 they may be already closed."], ["Lindsey K.", "I went to Zeus' for lunch this time. We ordered a gyro that came with sweet potato fries and the lamb shank meal. Everything tasted great and really well prepared. They were busy, but the service was still fast and friendly. The best part was when the waitress lit the Saginaki- she told us to yell Opa! and my friend, confused, yelled OPRAH!"], ["Chad C.", "As far as coney island joints go, this one not only has good coneys, but tasty gyros to boot. Plus, it's clean and has quick service."], ["Holly N.", "My dad occasionally likes to take me here for breakfast. It's pretty good for the area and for the other options. Everything is very standard. Decent omelets, eggs (however you order them), homefries, and coffee that is above average and plentiful. Service is kind and prices are reasonable."]], "Sultans Place": [], "Deluca's Restaurant": [], "Choupli Wood Fired Kabob": [], "Sultans Express": [], "Aladdin's Restaurant": [], "Capital Prime": [], "Restaurant Mediteran": [], "BRAVO! Cucina Italiana": [], "Tabooli": []}