{"Taco's E Mas": [], "Cancun Mexican Grill": [], "Aldaco Restaurant": [["Shawn Paul G.", "Every time we visit Lansing, we make it a point to check into this delicious little spot. The food is authentic and not overly complex. Part of the attraction for us is the all-you-can-eat buffet, which is chock full of well prepared Mexican favorites. The salsa is robust, the meats are flavorful, and the specialty dishes are all crafted to perfection. A Mexican buffet is a great way to nurse a hangover too!The space is slightly dated and the staff is occasionally too busy to keep up with your table, but overall it works."], ["Alicia W.", "Pretty decent food. I've never had the all you can eat Buffett but I've heard about it. I think that they are a bit overpriced for what you get."], ["Deb C.", "Being allergic to red and green bell pepper, may have ruined my experience here. I wanted the Roast Beef Wet Burrito, but it had green pepper in it - as did the rice, so I had to pass on that as well and got double refried beans as a replacement. Starting with the chips & salsa - chips were very hard & I could hardly eat them, but the salsa was good -- without green peppers. Ending up ordering the small ground beef wet burrito, the texture was good ( I'm a texture freak ), but almost flavorless as were the beans. I kept looking for the waitress so I could get some hot sauce, but ended up pouring the salsa over everything. Will I go back? Maybe -- IF I don't find any where better. Taco Bell tastes better, but I don't like the texture of their tacos, etc.."], ["Wayne J.", "Lunch buffet on a Saturday + small side of guac, no drink (I like water), including tip came to $16.  The food selection was rather bland, imho.  The hot sauce was at the buffet (not the table) and I'm PRETTY sure it's Frank's Red Hot).  The pork on the buffet was by far the best of the alternatives.  With Cancun as a \"similar product alternative\" with their lunch specials at half the cost, I probably won't be back.  Check out my other reviews; I'm generally very positive."], ["Danno W.", "When opened this place rocked, but since their success has gone to their head.  Bad quality, had to wait for tortillas to be made, my \"fresh\" tortilla shells were sticking together so the busboy was walking by and he grabbed the shells and separated them with his bare hands. I will go back in a year or so to  See if they reevaluate Themselves and their policies and practices"], ["Rachael L.", "Amazing Authentic Mexican food. My family and I have been going here for years and it has consistently been great food, simple ambiance, and always a stop on my list when I am visiting home."], ["Sammi D.", "Fajita Fridays is the best time to go! They have delicious shrimp and steak etc...on the buffet!"], ["Alex M.", "Why haven't there been more recent reviews, probably because no one comes here anymore.  With Los Tres up the street they are no longer the only game on the Southside.The food is really not that bad, but the combination of so so service, outdated decor and a dirty interior doesn't draw you in.  I always wonder if owners of failing restaurants like this ever watch Kitchen Nightmares or Restaurant Impossible for tips. It does not appear so.  If they did, they might decide to lose the prize games in the entrance or the tacky blowup chili peppers.  The hub of this restaurant is the buffet.  Not bad as Mexican buffets go, but the pricing scheme has always puzzled me, and no doubt turned some off.  There are different prices for nearly every night of the week.  Apparently this is due to different offerings, but it does nothing but cause confusion.  They should have a weekend price and a weekday price and be done with it.As another reviewer described, the salsa appears to be chopped stewed tomatoes with raw onion.  If there is a spice or piece of cilantro, it is hard to detect.  The \"hot\" has a little more to offer, and the best bet is to mix them.Its sad to say, but this place has really gone down hill.  Not sure I will be coming back."], ["Erin K.", "We walked in and immediately walked out. We went down the road to Los Tres. I wouldn't risk it at aldacos, looked terrible!"], ["Jennifer H.", "Got the buffet. Very good food.  Problem is they never refilled the nacho cheese the entire time we were there.   Then they ran out of shredded cheese and didn't replenish that.  Need to do a better job of attending to the buffet so things don't run out.   Kind of pricey too, IMO.  $10 for dinner buffet."], ["Christine C.", "Really disappointed. Used to love the food here, particularly the buffet.  Not tonight. The cheese enchiladas had no cheese!  Main problem was the ambiance. Not busy but had to wait for a waitress:  this was unusual. There were several--about 8--dirty tables.  Finally, after having been here 1/2 hour, staff started cleaning tables."], ["Kooky M.", "We were on vacation and looking for a place to eat. There were 3 mexican restaurants within a half mile. This place's parking lot was the most full of the 3, so we went here. Decor: Old & outdated. But, it was clean, and things were not in a state of disrepair.Service: meh. Our waitress was pleasant, I suppose. Our food took 25 minutes to get served to us.Food: The chips were G-R-E-A-S-Y! The \"salsa\" was canned stewed tomatoes, rough chopped, with some fresh onions, rough chopped and added in. I think a little dried oregeno was sprinkled in as well. That's truly it. Not good at all. When we finally got our meals, I wished they would have served it to us 15 minutes earlier, it might have tasted better. My husband got something basic like a taco and a tostada. The refried beans were dried out. I ordered a breakfast omelet with green peppers, cheese, and bacon. What I got was an omelet that was completely brown on the outside from overcooking, with cheese and green peppers - no bacon. In all fairness, we opted to sit down and order based on the quality of the mexican buffet we saw. It looked like it was absolutely better than Taco Bell. Apparently they put all their focus on the buffet, adn the rest of the food suffered. I will never go back."], ["Lindsey K.", "Two words: Mexican. Buffet. Aldaco's has buffet all the time and they also have a menu. On Sunday's they have an even mas grande buffet. They serve Menudo so if you have a hang over- head on in to Aldaco's. They make their own tortillas and everything is really fresh. It is a busy place, but large so they can accommodate the crowds. Head on over here when you are really hungry and fill up!"], ["Michael K.", "Food was...OK.  Lots of grease, not very much flavor and overall, just not as vibrant as their local competitors.  Decor was sad, especially for a Mexican place, and the staff was friendly, but service was haphazard.  I wouldn't recommend this place, especially when there are better choices in the Lansing area.  The chips and housemade tortillas were particularly good, however."], ["B S.", "Update 1/18/2014: This place used to have problems including a bad waitress, iffy food, and dumpy location. Since they have moved to their new location things have improved. The staff are better and the food is delicious. I really appreciate the lady who keeps the buffet clean. The waitresses/waiter are much more attentive and friendly. We are here often and am pleased with the service and food. Update 11/18/12: The bad waitress worked the cash register the evening of 11/17/12. She had been doing better until last night. There were 6 of us in the party. 4 got there first. She greeted them at the door and tried to take them into the room to the left of the door, and they asked to be seated on the other side. She agreed and walked them over there putting them in the back of the room. They wanted a table closer to the front. 5 of the 6 people were getting the buffet so they wanted to be a bit closer. Besides the room was nearly empty. So it was not an inconvenience except the employee didn't like our group challenging her placement of us. She said that they could put the tables together themselves and stormed off. So she left an older couple to push the two tables together because she was angry. That is very unprofessional behavior. The rest of the staff have been pretty good. All I expect is promptness and professionalism, and the one lady lacks both. I don't want to dread seeing her. Finally, the men's restroom smells terrible. The food is typically pretty good except sometimes it is old on the buffet. This could be a great restaurant with professional staff and clean bathrooms. I have to give service a rating of poor-fair since we seem to get the bad waitress more often than not.Update 10/9/12: We went back again, and this time we got the not-good waitress. We were worried, but she seemed to be on the ball this time. Food came promptly. Yea! I hope we got our good Aldacos back. If someone who works there reads this, please change your sign on your door that says, \"Smile. Your on camera.\" It is you're not your. Thanks.Update 10/5/12: I went back last week hesitantly and only because my dining companion wanted it. The food and service were much better. The food tasted good. The mild salsa had some spice to it. So that did change. I got a bite of it that sent me into a coughing fit. We also got one of the long-time waitresses, and she is much better at her job. I think her name is Jessica. The slow, rude one from last time was there, but thankfully we didn't get her. So I felt it fair to update the review. I guess it depends on the day you go and the waitress you get that can determine the quality of your dining experience. I'm sure we'll go back, and hope for the best.6/28/12I used to love this place. I would go to it at least once a week. My dining partner and I would get the buffet, taco special, and the chips/salsa. We loved it. Until we went at an odd time and had to ask the price of the buffet. They quoted us a price but when the check came, it was more. We asked them about it, and they said they told us wrong and refused to stand by their quoted price. Well they lost regular customers for several years. On 6/22/12 we decided to try it again. It was terrible. The food wasn't good anymore. I don't know what they did to the ground beef but it tasted terrible. I don't know if they dropped the grade/quality or are using \"beef\", but I couldn't eat all of my tacos because it tasted bad. The buffet quality was poor as well. The food seemed to be leftover and old, which didn't help the ground \"beef\" taste. The pico de gallo was old and slimy. None of the food was fresh. Food quality has gone down. The service has also gone way down. We got a waitress that ignored us most of the time. My tacos sat on the counter for awhile with our waitress walking by it multiple times, eating her own food, and chatting with coworkers in the other room before she finally brought it to me. I would have appreciated my food since I was hungry and like it hot. She dropped off the check while we were eating and didn't come back. Before she left she brought some more salsa but no chips. I guess I was supposed to slurp it up with the straw because she didn't refill our drinks and we needed something to drink. When I looked at the check it had an item on there that we didn't order. I had to eventually ask another waitress to send our waitress over. When I told her the problem, she went off in a huff to fix it acting like I had inconvenienced her. I'll never go back. The food and service are terrible. I don't understand why people still eat there."], ["Lisa W.", "I think most people who have commented on this place must not have had good authentic mexican food! Aldaco's is very greasy and in most cases the food on the buffet is NOT hot enough! I rated them 2 stars because there are a couple of good dishes on the menu. The wait staff really needs to learn some manners at this joint! They are NOT friendly in the least. They seem to spend most of their time visiting with one another. I asked for a refill of my coffee 3x and left never having got the second cup. I eat homemade tortilla's at home almost every day, don't pay for what they call homemade. They simply are not! No respecting mexican chef makes their tortillas so thin and with so much shortening. Any way, if you eat here order from the menu you will be much for satisfied than with the buffet!!"], ["Meredith J.", "I used to live in Southern California for a few years, and I was so sad because I could not find a place in Lansing that lived up to my favorite Mexican restaurants out west.  This place came ridiculously close.  The lunch buffet is worth the price, and it is very yummy!"], ["Jason L.", "FOOD (4 out of 5): Not too shabby...  The homemade tortillas are good, but can probably be on another level if they would just serve them fresh and hot.  It hurts me that there is so much unrealized potential there...  For those who are familiar, my point of reference is Nena's in Stockton, California.As for the authenticity and flavor, the only standout is the Caldo de Res (Mexican Beef Soup).  The use some good cuts of rib meat in the soup.As for real-deal, greasy food--  Hungry Man burrito fits the bill.  It is everything you could ever want for breakfast, rolled into a tortilla.The salsa is good and fresh, but not life-altering.DECOR (3 out of 5): Looks like this place used to be a Chinese buffet, but they've done their best to decorate the place.SERVICE (4 out of 5)This place gets busy during lunch, so it doesn't have the fastest service, but they definitely make it up in friendliness..."], ["Misi P.", "If you want no frills Mexican, here it is.  It's cheap, they've got a bangin' buffet,  and the food has just the amount of grease in it to qualify as real Mexican, but not enough to make you puke.  The only downside to Juve Aldaco's Mexican cusine haven is that you can't get a Dos Equis with your meal.  That's right, no EtOH for you drunkies.  But otherwise, the food is great and the service is basic, but good, nonetheless.I started frequenting Aldaco's about 6 years ago and every time I took someone else there to eat, they were hooked.  We call it \"crack tacos\" because we're convinced that they lace the refried beans with cocaine or something.  My recommended meal?  The chicken enchiladas or your plain ol' taco plate (#14).If you're feeling a little diet-ish, go with the taco mush and ixnay on the flour shell it's served in.  All in all, you'll leave Aldaco's stuffed and happy.  Ole."], ["Bonnie B.", "We went there because Asia's Finest was closed on Sundays (we forgot). What a great find! The buffet was fantastic. Lots to choose from. Fresh. Watched the guy making tortillas as we ate. The staff was warm and attentive. Affordable. Cannot say enough good things about them."]], "Panchero's Mexican Grill": [], "Los Tres Amigos": [], "Lafrontera Mexican Products": [], "Qdoba Mexican Grill": [], "Jalapeno's Mexican Restaurante": [["Kathryn R.", "Jalapeno's is probably my favorite thing about working downtown. Their food is fantastic, and the staff is always quick and efficient. And I love that I can make changes or adjustments to an order and they're always willing to accommodate. I love both their breakfast and their lunch. Only complaint - their lunch delivery service is limited, so you have to call and place your order super early to get a spot!"], ["Lori M.", "Awesome food! Wish they were open on weekends. :("], ["Matt P.", "Decent food. Some hot sauce that expired almost a year ago on the tables. Burrito special was a solid value. Luckily I arrived just after the lunch rush so the service was extremely fast."], ["Mark W.", "I am a fan of Jalepeno's and would echo the sentiments of all the reviews to-date; namely, the lines are long, but move quickly through the lunch hour & wish it was open later than 3 pm.That being said, I recommend going on Tuesday when the daily special is Tamales.  So good, generous portion, with beans, rice, and handful of chips.  Friendly staff that always seems to appreciate my business is another reason I like to spend my money here."], ["R. L.", "Finally gave this place a shot and grabbed a vegetarian breakfast burrito. Cheap and yummy. Standard quality ingredients, nothing to drool over. It was kind of busy this morning and the service was still super speedy. I appreciate this place's existence in downtown Lansing. Note that they are only open until 3pm M-F."], ["Will K.", "not many options for breakfast burritos since el sombero closed on MLK...it was OK nothing to bring me back...beans so runny that it was like having mashed potatoes in my burito"], ["Chelsea M.", "Yum! Fast, affordable, and delicious! I really enjoyed me enchiladas and the portion size was HUGE. More than enough there for two meals.I'm excited to head back and try a couple other things on the menu. There were more than a few options that looked good.I'd avoid heading in at peak lunch time. You might have a difficult time finding a seat."], ["Bruce T.", "Good food & satisfied my yearning for some Mexican fare. Not exactly California- or Texas- level stuff, but good nonetheless. Huge portions if you get the rice & beans option. Must be bulking these guys up for winter!"], ["Stephanie M.", "I have to start by saying I only go to Jalapenos for breakfast, but I go almost every day. And, because of that, I almost never eat lunch (only if I miss my morning run to Jalapeno's). As a non-egg eater, Jalapeno's is one of the few places that I don't feel cheated ordering an item that typically comes with eggs. Most places just leave off the eggs. A few places will let you order something in place of the eggs (but VERY few). This place loads up my breakfast burrio with everything else so that my tortilla is just as full of goodness as everyone else's. I'm a big fan of their hot salsa and the refillable cups, but I love the little bambino fruit pies for the days I want a little something sweet to counter the spicy hot salsa."], ["Lindsey K.", "This is my favorite lunch spot downtown. They are open during the week for breakfast and lunch. I wish they were open in the evening and on weekends. I haven't had their breakfast but I have heard it is really good. They do get busy at lunch, but if you go between 11 and 11:30 there is not really a wait. Even if you walk in and the line is all the way to the back, they are very efficient and you will wait much less than you think. The tables do fill up, but clear out quickly. In the summer they have tables on the sidewalk, or you can get it to go and eat on a bench on the street. My favorite dish is the chicken nachos. These are hands down the best I've had in the Lansing area. The half order is plenty for lunch and I'm not a skimpy eater. They are reasonably fast and the food is always fresh. The order taker girl is nice and so is the cashier, watch out for the girl manning the nacho oven- Frown Town USA!!!I miss this place since I don't work downtown anymore!!"], ["Nick C.", "Good the breakfast burritos are awesome and for a good price just watch out they have vertical street parking who ever decided that was a good idea probably doesn't have to back out into oncoming traffic blind"], ["Lorraine H.", "Jalapeno's is one of my favorites for lunch. But the breakfast burritos are delicious! I try to get there a little early (11:20-11:30) as the lunch line is long, but it does move fast. Seating is limited. My only negative comment is, it's always very cold in there. I know that old buildings with high ceilings are hard to heat, and restaurants use a psychological trick that if you're chilly, you tend to eat more, but I do like to be comfortable while I dine. I think I will go there today!"], ["Kay S.", "The breakfast burritos are hard to beat. They should serve them all day!"]], "Pablo's Panaderia": [], "El Burrito": [], "El Oasis": [], "El Azteco": [["Jessica P.", "I had fond memories of El Azteco and was excited to return.  However, I found the enchiladas bland and the service, even seated at the bar, lacking.  The patio is lovely, but on days when the weather is cooperating, expect it to be crowded and noisy.  I suggest El Azteco for the chips, salsa, and tequila -- a fine happy hour or snack -- then a more substantial meal somewhere else."], ["Joey R.", "It was better when it was in the basement and they're actually had cocroches that would scrape past your feet the food's alright I've had better"], ["John S.", "I wonder when one of the ten wait staff standing around the cash register will wait on us? Ah, here we go.  Cheese dip is divine. Salsa is spicy red paste with wonderful taste - not bogged down with fresh vegetables or the like - tomato paste and jalepeno. Delish. Margaita - yes - giddyup! My mixologist dining partner declares \"it tastes like tequila - light on lime.\" Score. Shredded chicken in my taco has a unique flavor. The only place where chicken doesnt taste like chicken... So this is a find.  Blue Corn enchilidas are the best ever encountered. The side rice is mildly spicy. XM set on \"Mexican Restaraunt.\"  Baxter you know I don't speak spanish. My mouth is on fire. This place is a dump. The service is awful.  The food is okay to good.   I'll be back next week... and the week aftet ... Spartans love El Az ... Just not sure why."], ["Tom A.", "Been a while since I've been back to \"El Az\".  I usually am dragged there occasionally kicking and screaming by a dedicated fan base of friends to the same dirty joint with indifferent service, followed by the revenge of the most notable of Aztecs......leaving food safety standards in question as well.I have to say that I was Blown away!! We walked in Sunday with a party of 14, and we were seated right away, and the cute and sharp blonde Yooper that waited on us had the chips and salsa out immediately, and the attention never waned. (I wished that I would have gotten her name as she was worthy of a special mention)Did I mention that the place was CLEAN?  O.M.G., and all the staff were on their toes, and eager to see that the patrons were well looked after.The food presentations were mostly typical to the American Mexican joint menu, but they do feature some house specialties such as Topopo Salad, and Blue Corn enchiladas.Everyone in the party were equally raving about the service, and noticed the improvement in the general condition of the place. Next time I'll be walking in without being dragged...."], ["Heather G.", "Supposedly years ago they used to be great. I went there and the service was terrible and the food. Gave me a stomach ache. I love Mexican but DO NOT go here"], ["Katie M.", "An East Lansing staple! El Az was the restaurant my mom and I ate at after she dropped me off during Welcome Weekend (sniff, sniff... memories!) oh so long ago. Even with all of the changes and big box stores and chains moving into East Lansing, El Az has remained a mainstay on the corner of MAC and Ann. The biggest draw to this place is not the food, but the rooftop! Yes, rooftop dining in East Lansing. My first experience with a rooftop deck when I was younger, was a nice change from the grungey and windowless bars that you'll find (and probably frequent) along Grand River. The food is not great, (I do really like their salsa!) but the margaritas are cheap and the portions are huge. Try the Tropopo salad. I would not recommend the guacamole - no flavor, tastes store made."], ["J L.", "The menu was old and their prices had changed. The food was as good as a microwaved TV dinner. If you are spending $10, go to Los Tres Amigos. Will never go back."], ["Susan D.", "I used to enjoy the really bad service, but it has improved in the past few years.  Best are the margaritas . ..especially in the summer on the roof!. . .and topopo salad.  Prices are very reasonable."], ["Steve B.", "I've lived around here for 30 years and given this place a try many times. Many I know swear by it for Mexican and always have to go here whenever they're in town. Why I don't know. I've tried ordering many different things and it's all bland and tastes the same. The service has always been fine but honestly, for Mexican, Los Tres or Cancun is just as good if not better. I think alot of people just say they love it out of tradition and as far as independent restaurants, the Lansing area is a wasteland. Most everything in Lansing is part of a chain so anything else gets alot of attention."], ["N P.", "Mediocre food, nay actually if you had real Mexican food you will find that this is seriously lacking that defining flavor. It's like you know how all Chinese food is the same no matter where in the country you eat it? Kinda like Taco Bell being called Mexican?! Yea, that's what you should expect. However if you want to go to a lively place and have a drink you've never seen before, than hands down these guys bring in some imagination into mixing known favorites into new ... well new favorites! Like the margarita with an upside down corona in the middle! Awesome!"], ["Keely K.", "My go-to Mexican restaurant in the Lansing area is Cancun Mexican Grill, but begin near campus we opted to check out El Azteco. Big Mistake.Their menu was limited, and what we did get was awful. The food took long, was overcooked and/or tasted like it'd been sitting under the heat lamp forever. mY boyfriend's chicken quesadilla was flat as can be, and didn't come with anything on the side (salsa, lettuce, etc, simply a plain plate with no garnishes. The rooftop is nice, but thats all this place has going for it."], ["Nick V.", "Their green sauce is one of the worst things I have ever tasted. It tasted like glue, plywood, ground together with some corn husks. Really, really bad - barely green, either."], ["Mary E.", "We stopped here with a group of 10 after the MSU  spring football game. Our pitchers of margaritas were awful and had to be remade. Two people at the table never got to order. The food arrived cold. The management told us on two occasions they were to busy to talk to us. We will all be too busy to return. Cheers, Spartan Alum."], ["Sarah C.", "Sat upstairs on the patio with a large group, which was awesome (hence the second star).  Service was good too.  The food and drinks were pretty terrible though.  Overly sweet margaritas that taste like chemical-y margarita mix, and the very worst of Americanized \"Mexican\" food that features large plates full of things that don't taste very good but are smothered in melted cheese."], ["Tiffany R.", "Top 5 favorite Mexican places to eat at, anywhere. It's an east Lansing tradition. Service isn't always the best but I overlook that based on my food. Best thing on the menu: blue corn enchiladas. Next best things: topopo salad and the cheese dip. Salsa and chips are great. If you can go when the rooftop is open SIT up there!"], ["Derek K.", "Service was good.As for the food, it was all right. Their menu was pretty small, which puts them at a disadvantage. However, I had no complaints about my chicken enchilada. Aesthetically, my only critique would be to make the chairs a little less cramped.This place won't blow you away. But it's not to be avoided either. Pretty good Mexican food."], ["Bd S.", "Love El Az.   Hot sauce varies day to day.  Came here when they lived in the basement.  Cheese dip without compare.   Good Nachos. Toppopo salad is a large MOUNTAIN of food. And yes - Margarita pitchers mmmmmmm. Some nights and for most game days this place is a MAD HOUSE."], ["Jim R.", "The luster of the is place has worn away for me as well.  We get what we deserve--the place is packed all the time, so why would they be motivated to change? A good Mexican eatery could come into the neighborhood and wipe this place out.  It lives on some aura of the past that it no longer deserves. El Az used to be located in a basement across the street, and that is where it gained its rep as a place to get great  Mexican food in a dark and off-kilter dungeon.  I now realize that the quirky nature of the former location was its greatest quality.  The bad service, so-so food and terribly sweet margaritas were forgivable given the experience of spending the half-drunken evening in the basement with buddies or Spanish department faculty.  Since it gentrified 20 years back (it is above ground, sunlight has found the place, you no longer need to duck as you walk, no more widow-maker staircase) it is judged on food and service as are most restaurants where the diners are not distracted by the surroundings.  It does not compare well with other Mexican restaurants for food quality. It still has some redeeming qualities: the fresh salsa, yummy cheese dip, topopo salad and the huevos rancheros are all good. Otherwise, meh.p.s. I will probably meet friends thereon football Saturdays out of habits for the rest of my days!"], ["John K.", "I feel like I have grown up with this place.Before I was even a student, if I remember correctly, it used to be in the basement of a storefront on Gr. River (Or was that TopDog? Or possibly both? I was perpetually and severely inebriated back then.)  Had big ass roaches, dark and nasty.Once it moved over to Ann St. same great food but absolutely the worst service ever.....all through the 90's.  It was just a given to expect the shittiest service from ElAz as well as Bilbo's(long defunct) just 2 doors down.  We just dealt with it cause the verde burritos were just so damn tight.So, now as an old man we hit up this place when we come in for games, etc and we still love it.  Except now, the service is actually really good (well our visit last week sure was).  I used to love their margarita's but now they serve them in stupid little marg glasses.....the rocks glasses worked so much better.  They seem to be pushing their expansive tequila list as well.....a little pretentious and trendy but who cares?  Just gimme the Cuervo. (I know it's not REAL tequila...who cares)  I wonder if they still have 1/2 off pitchers of that nectar of the Gods on Wednesdays anymore.  At any rate, nowadays it is clean, bright, nice, has a big ass patio upstairs and the same great food.  The cheese dip causes riots among my wife and her friends and they tend to wrap their arms around the app like they just got out of prison.  Sharing becomes a mortal sin.  The salsa is always fresh, everything is homemade, the burritos never disappoint and the topopo salad is ridiculously good."], ["Shawn Marie H.", "I've just had my last meal at \"El Az.\"  It used to be THE place to go for decent Mexican food around here but that was over twenty years ago. I've been away for awhile, and our recent visit was not a homecoming. Of course, I have always known that I wasn't getting authentic Mexican food, but it was still tasty. I still enjoy the cheese dip and the Topopo salad. But the beef burrito with spicy green chili sauce was like chewing on an old sock. The beef was flavorless, there was little cheese, and the sauce must have cooked out of it when they overcooked the meat because all I saw were a couple green flakes. It was so dry I choked.Aside from the food, which arrived 40 minutes after we ordered, we were invisible to our waitress. She brought us our water and the chips and cheese dip, then she disappeared  (just like my spicy green chili sauce). Twice I tried to find out if our order was placed because people who came in after us were being served. She finally came back to the table to say that she had a frustrating day and that the large table next to me was to blame for our food being late. She finally did bring the food, but no silverware or napkins. We had to get up to get both. She was very nice, but after I complained she said they were understaffed. If I ever do go back it will be for takeout only and it will only be for the cheese dip or the salad. I'll never order the old sock cum burrito again."], ["Erin L.", "This might be the worst Mexican food I've ever eaten. I'm pretty sure someone just barfed on my plate and served it to me. The \"queso\" was separated and gritty....like barf chunks would be."], ["Adam K.", "I was not very impressed with my meal, but the chips and salsa are very good"], ["M N.", "Love, love, love El Az.  Best bean and cheese burritos, salsa, and cheese dip anywhere.  All the negative reviewers need to remember this is a restaurant in a college town, not a Michelin rated restaurant.  Just have a Margarita and enjoy!"], ["K D.", "People, if your critique of this restaurant is that it isn't authentic enough because your fricking strawberry margarita didn't have enough tequila in it ... you need some help. There's a lot to love at El Az. The topopo salad, the cheese dip, the salsa, the bean burrito. All delicious, all great deal for the money.Seems like hating on El Az is some sort of ridiculous new cool kidz thing for undergrads. [eyeroll]"], ["Damon L.", "It pains me to say the El Azteco may just be an average / below average Mexican eatery as a whole - because they have one of the most unique and tasty dishes in the Topopo salad. I definitely recommend the Topopo - with a base layer of chips, beans, cheese, and the like - then piled high with a lettuce, pea, chicken, scallions, tomato and cheese combination. I recall a hint of something along the lines of a vinegar (very light) to add element to the taste. It is something you can attempt to recreate at home with practice - but it just isn't quite the same as getting it at El Az. This is one of the sole reasons I would still frequent the restaurant - or even recommend the place. I realize why the rest of the experience and menu is not absolutely embraced.The E.L. location has a nice roof bar and seating area that is great for drinks and food in the summertime. Their Saginaw St. location is much more of a dive / lacking standards. But - I would say both locations have never been exactly of high paradigm in environment, appeal, or overall spotlessness. I know I'm breaking rank on what I usually stand for in admitting that - but every once in a while a restaurant will get 1 thing right (the Topopo) that you have a hard time voiding yourself completely or forgetting the place.Over time I have had other dishes: combo's, tacos, etc. - they were neither thrilling - nor was I purging afterwards. More par for the course edible.The service has usually always been below average or bad. Simply because you get college kids running around with their heads off - trying to keep up - a bit haphazardly at times.I think the environment and lack of standards at times is what certainly puts people over the edge on El Az - which is sad because this place might be more if they simply tried a little."], ["Jen T.", "So bad! We waited an over 2 hours for a quesadilla and flauta. It never came! If we waited any longer we were sure it wouldn't taste good! Had to leave and won't be back."], ["Dave V.", "nice little joint. nothing amazing, but pretty good. Not authentic mexican but, again, pretty good. Prices weren't horrible. nice enough staff too. worth checking it out."], ["Douglas M.", "35 years an East Lansing staple. New owners have made some changes. I won't be back. The guac is no longer real. As in some sort of neon green mix. The toppopo which is so vaunted is no longer the same recipe. Different cheese, no dressing and the half order in the round plate is now the full order. No longer feeds 4 people. And it has that awful guac stuff on it. Significant price increases and the chips and salsa are no longer free. NOTHING was good. The food, the service, the cocktails. It took less than two years for them to destroy a place that thrived and was beloved for all those years. The one in downtown Lansing is under different ownership and the difference is night and day. Shame on these people for ruining this East Lansing tradition."], ["Professor C.", "Your typical heavy Mexican food made for American tastes (bland, large portions). Refried beans & rice with most everything, and most food covered with melted cheese. It's a local institution, maybe because there isn't much competition in E. Lansing. The rooftop patio is a pleasant place to have a beer & the food is not terrible. Service can be slow on busy days."], ["Chuck H.", "It got one star because I couldn't give NONE!Matt always loved El Azteco but his brother Chad who was with us tonight, not a fan of Mexican food but he was a good sport and stayed. We should have listened to Chad!I had the Nacho. The \"beef\" was a yellowish color, the jalapenos had no heat or flavor, I asked for onions with mine which also must have been prepped and sat because they too had lost all their heat and flavor.Matt's fajita no longer came with the peanut sauce it always came with and apparently, all the flavor in that dish was in that sauce. It's also the only fajita dish we've ever seen that didn't come with a side of peppers, guacamole, onions, a sizzling plate and some salsa.Lynn and Chad also felt their food was bland and flavorless.We spoke to the manager after the meal, not looking for a handout but after having drove from Detroit to Lansing, we felt she should know how our experience was. She wasn't really interested. Turns out that at El Azteco, salt and pepper with a little cumin is all they feel Mexican food requires as seasoning to be \"Mexican\". She flat out denied the food wasn't prepared fresh to order but Lynn peeked into the kitchen as we were leaving, (they have a wall cutout near the bathrooms that looks into the kitchen) and saw large quantities of foods wrapped in tortillas in plastic bins for the fridge. She also told us nothing was frozen but the sour cream that was brought to the table had ice in it and Lynn's flour tortilla shells were obviously at one time frozen.We will never again go to El Azteco to eat, not even if we are already in Lansing let alone making the longer than an hour drive from the Detroit area."], ["Erica D.", "Yeah, it's not good.The chicken tastes like tuna. The red sauce is not red sauce (it's more like salsa than enchilada sauce). That cheese dip that every one raves about looks and tastes like expired cottage cheese. The chips are hard as hell and super greasy. The location by the hospital in Lansing is even worse, because it's sticky and dirty.The second star I gave is solely because they have roof top dining in the summer! DAMN YOU ROOF TOP DINING IN THE SUMMER!"], ["Mandy T.", "Not really impressed... Guacamole was bland (pretty sure it was just avocado with lime juice), chips were thick and hard, I had the topopo salad since everyone said it was good and it was just nachos with a mountain of shredded lettuce. The cheese dip was just cottage cheese mixed with cream cheese... Not sure if anyone goes to El-az to eat. Think it's just the rooftop. The margaritas were pretty good... And you can get them by the pitcher!"], ["Kyle P.", "Even though I don't like the place too much, I always find myself coming back. The food is, meh, OK. It's better than Taco-Smell but not the best I've had.  It's priced quite high for my liking (I'm a college student, don't forget), but you at least get a healthy quantity.  So healthy that it is probably the most unhealthy thing for you. Before you jump to get the pitcher of Margaritas, think hard.  My friend I split one and had to choke it down, unfortunately not because too much of our friend Jose.  They were weak and just not good.   I am a fan of their house tortilla chips. So the roof is a great place to sit in the sun and enjoy a few brews during the summer time (they can't mess up beer, right?)"], ["J T.", "I've had meals at El Azteco many times over the years...no, make that decades. Maybe my nostalgia glasses have caused me to remember more fondly the experience. Perhaps same glasses cause my expectations to be too high.On this trip, the glasses were off and even rooftop dining in the soft light of a beautiful summer evening was not enough to overcome the complete banality of the food served. Burritos, rice and re-fried beans were below average. Service was ok. The Dos Equis with lime wedge were nice. All in all, there are a lot of better choices for food in East Lansing. However there are probably not lot of better choices for outdoor dining. Drink - go to the rooftop at El Az. Eat - go elsewhere."], ["Ava R.", "EW! yuck gross. i can't believe i used to love this place. i guess that was before i ever had real Mexican food.  just came here last week with a bunch of friends and everyone agreed that this place is beyond disgusting. i ordered the same thing i always did, the cheese enchiladas in green sauce. the description forgets to mention that it's covered in cream of mushroom soup. in fact, many of their nasty meals are. so gross!. the worst Margarita I've ever had!!! the salsa was so thick like tomato paste and my bf's mole enchiladas were like old 7 eleven toquitos re-deep fried and served. they were gritty and terrible."], ["Bess D.", "Wanted to get a big group together for a dinner before a childhood friend's wedding (it's one of her fave local spots) and while they do not take advance reservations,  I have to rave about how well Zack, Dani and the rest of the team on the roof accommodated our party of about 50."], ["Vic D.", "A pitiful shadow of what it once was. Food quality has really gone downhill. Service, while never a strong point, has gotten even worse the past couple of years. Chips are usually stale. Salsa is still great, but that's the only thing I can recommend anymore."], ["Surranjan K.", "One of the worst mexican food and service. Zero star is not possible so they get one. Ordered Burrito plate that is supposed to have chili verde and Colorado burrito, what I got was two extremely salted ground beef burrito with cheese. When I asked the waiter to get it right he came back \"manager says this how we make it and it has sauce in it. \" granted that coming from CA I had higher expectation for Mexican food but this place has an inedible food with crappy service. I don't know how anyone could go there twice."], ["Mandy S.", "If I could put zero stars, I would. This place apparently has a new owner who isn't Mexican, but instead is Greek. The selection is not what it was before (I haven't been here in 3+ years). I ordered a strawberry frozen margarita which came in a cocktail glass and I swear it had zero alcohol in it. No taste at all. The waitress said it had Cuervo, yea right. They don't have hot sauce available on the table or by request. They don't allow you to order chicken nachos (apparently the chicken is not nacho worthy). I ordered a side of Guacamole and it cost $3.00!!! Overall the price of the meal was cheap but it wasn't anything to brag about. I wish the old owner would come back. The Azteca we all know and love will not last long under this new ownership - which sucks because I loved it when I was a student at MSU."], ["Adam M.", "While you wouldn't catch me dead eating here over the winter, I'm giving this place 3 stars because it's the coolest place to be during summer nights in EL.  The roof is straightup the bomb, and the place to get bombed.The food is probably closer to 2 stars.  East Lansing is known for having bad food, and worse cops.  SO watch out after you have all those drinks on the roof.  You just may wind up with the runs in jail."]], "Maria's Cuisine Mexican Food": [], "Famous Taco": [], "La Senorita Mexican Restaurant": []}