{"Zarzuela": [], "Logan Restaurant": [["Blair R.", "I just had a delicious dinner at Logan! I heard so many great things about Logan, so I knew I had to go. I think the bar was set too high (I can't give Logan 5 stars) but it was a fantastic dinner and definitely among the best I have had in Ann Arbor. We skipped appetizers tonight and for me personally, none of the apps. are that tempting. However, the chef did bring out an awesome butternut squash soup with truffle oil. It was a great way to start dinner -- thick and rich but not too heavy.For my main I ordered the sustainable seafood selection which was Mahi Mahi over a bed of quinoa, tomato infused with ginger and a grapefruit reduction. Loved the sauce on this dish and it felt light, relatively healthy but satisfying. I would happily order it again. I also sampled the lamb and scallops, which were well done.Dinner is also served with warm biscuits, which are pretty addicting and flaky. The biscuits didn't come until well in the meal but that is probably why they are warm. It was my friend's b-day so Logan offered a complementary dessert which was meh. It was probably our fault since we chose the brownie with bacon and pistachio ice cream. I've never had bacon in my dessert before even though I see it all the time and now I know not to order it again. The bacon pretty much ruined the awesome ice cream. Logan is the kind of place I'll return to for celebrations or if I have special visitors aka my parents."], ["Matt R.", "We tried Logan on a whim, and were not disappointed.  Our server, Melissa, was very friendly and knowledgable. Her suggestions of the duck breast special, along with the vinsanto were spot on.  The owner came over several times to check on us, and to talk about the vinsanto.I got the wild boar bolognese, which was right on par with a similar dish I had years ago in Tuscany.  My girlfriend got the duck breast special, served over a bed of spaetzle, which was delicious.  The food was a definite 5 out of 5. The atmosphere was relaxed, but it was somewhat loud as other reviewers have said. The service was excellent on all levels.  I saw multiple reviewers commenting about this place being too expensive - this is an upscale restaurant, comparable to ones in downtown Chicago or New York.  You pay for what you get, and it was worth every penny. We will be back soon, and cannot wait!"], ["Chad W.", "I was incredibly happy with the food here. My wife and I came here for our anniversary and celebrated with the tasty cheese trio followed by the Perch Tempura for me and the cauliflower with taragon and pea sauce for my wife. The perch was probably the best seafoody entre I've ever had. It was a sweet sauce (maybe tamarind) and absolutely delicious. The service was great. I doc it a star for the in restaurant atmosphere (see other reviews) though if we had eaten outside it may have been a 5."], ["Amy M.", "The food at Logan is good, fine but not exceptional. It's the service that has me not planning to go back.Our party of 6 arrived a few minutes early for our 7:30 reservation. The group dining at our table lingered for a while so we waited at the bar. At 8:00, my friend (who is visibly pregnant, btw) asked about the table and was told they were waiting for the other diners to leave. We saw no attempt on the servers part to move the diners along, nor did they offer us complementary drinks or appetizers. They also didn't move things around and seat us elsewhere. We were finally seated around 8:20 and ordered our dinner at 8:30.I feel like the management at Logan had a great opportunity to provide excellent service by either comping an appetizer while we were waiting or offering one once we were seated. Neither happened. The server was nice enough, staff apologized for the delay but I expect more from a restaurant as expensive as Logan. First time there for most of us, probably the last."], ["Li C.", "The food is deeeee-lish! I had the Wild Boar pasta as an entree. If you double the \"course\" portion, it becomes an entree. Cornish hen was another hit! The house made biscuit was a perfect tool to wipe the plate clean. Like Natalia and others, I had a coupon. Mine was from restaurant.com. Glad I had it because the prices are pretty expensive, but Logan is a great treat for that special occasion or special someone."], ["Jaye K.", "Went for the first time last night and had a great experience. Walked in too casually dressed for my taste, but we were rained out of our planned event. Still, without a rez, we were taken to the prime window seat and my bf joked wait until they see the coupon!Waitress was really pleasant and the food was delicious. I had the perch and bf had the cauliflower. Enough to eat without feeling stuffed. Pretty spendy, but worth it for a Friday night out. Oh, and the waitress didn't even react when bf pointed out the coupon.Looking forward to another visit to sample different menu/drink items!"], ["Allen L.", "A great little restaurant that pays attention to the details.They have an expertly chosen wine selection and Kevin knows everything he puts on the list.  I have had some spectacular wines here and always something surprising.  They also serve well made cocktails with great ingredients that actually make sense.The menu changes just enough seasonally.  Some of the appetizers are inspired - the gruyere \"custard\", the baked mussels, the crab and avocado come to mind.  We have leaned more to pastas for entrees.  The clam linguine and boar bolognese were wonderfully light.  I'd avoid the gnocchi - way too heavy for me.Service has always been top notch.  Occasionally the kitchen seems to be slow when it's busy.  The price of success!Really nice dining room - linen table cloth, etc.  I do my best to bring down the dress curve."], ["Miri Kwon R.", "Good food, HORRIBLE service, and debatable priceTheir menu (as mentioned by others) is rather limited thought the wine/drink menu was pretty extensive. The space/ambiance is more minimal then romantic or beautiful. WARNING: their pasta portions are really small (almost like tapas dishes). We ordered- Crab & Avocado salad: surprisingly my favorite dish of the day. Refreshing, light, with an interesting mustard-y sauce- Bolognes Pasta: heard great things... but it was just okay. - Goat cheese truffles ravioli: Bit too pungent for me (personally not a huge fan of goat cheese... others may love it)- Thai scallops: Scallops and mashed potato dipped in thai curry sauce! Delish - Lamb dish(forget the name): Good flavor, though the lamb was a bit dryAgain, food was great. Albeit a bit pricy, I thought the dishes were all interesting, creative, and very delicious. Service is where I have real problem with. Our server was incredibly unresponsive, intrusive, and down right RUDE.One of the girls came late. It took him more than 10 minutes to come back to take the order for her after he's given her the menu. He had trouble explaining some of the sides, and tried to take away our dishes before we were done. But the final draw was when we tried to pay. We had a coupon (restaurant.com had a deal), four credit cards, and an opentable check (annoying, I know. But this is a highend restaurant!), and our server gave a loud exasperated sigh that was clearly audible to the entire table. It instantly damped our mood, and what could've been a perfectly lovely evening was ruined. Other people at the restaurant (our hostess, sommelier) were all really helpful and friendly, but the table service was horrible. I don't think we are ever going back to this restaurant again. If you want good food with great service, there are better alternatives on Main Street."], ["Suzanne P.", "First of all the guys at Logan are the nicest around. I would patronize them solely because of Ryan and Kevin.  I love the fennel salad and scallops."], ["Kat M.", "Long Logan's steak delicious"], ["Trevor M.", "Good as always"], ["Maya B.", "A Little Alliteration Wordplay #2--The  Letter L:Longingly laying in wait, lucid dreams leak from the kitchen's lair lovingly luring me closer to my luscious meal.  Can I linger just a little longer?Looking down Logan's oblong dining room, we slide into a back table by the bar, pleasantly pleased with the lovely lair we find ourselves lounging in.  The simple, unpretentious decor lapping at the exposed brick walls around us and soft lighting are a welcome respite from overly-stylized bistros and trendy here-today-gone-tomorrow dinner locales.The chef's menu--do we dare? Indeed we do.  Plate after plate of the lofty fare. A few highlights include: amuse bouche of creamy summer soup, cheese trio (the grilled halloumi is amazing!), crab and avocado (large portion),bacon and eggs salad (minus the bacon crouton is still superbly satisfying), ginger carrots (heavenly--there are no words to describe the supple sweetly glazed luminous beauties), Thai scallops.  Lovely space, lovely food, lovely night."], ["Mark T.", "I'd say I agree with most of the other posters on here. The food here is excellent. We had the crab and avocado appetizer, which was really good. We followed the advice of other reviewers and tried the boar pasta and the duck confit entrees which were both very tasty. Some of the dishes are pretty pricey, but that seems to be the norm in Ann Arbor. The decor here is definitely a bit strange. It's kind of cold and outdated. The service was pretty poor. Our server might have said two words to us during our entire meal. She didn't mess anything up, but she definitely didn't make us feel welcome either. Still, the food is excellent."], ["Bill C.", "I had not been to Logan in a while.  On a Wednesday night it was quite busy.  The carpaccio salad was excellent, as was my friend's asparagus tempura.  The main dishes were disappointing.  My short ribs were dry and the prep. had little flavor.  My friend's fried perch was fine, nothing extraordinary.  We got an amuse-bouche of chili, an odd choice, prior to the meal.  The chili was rather bland."], ["Nick R.", "When I went to Logan, I was greeted with kindness by the hostess and was taken to our table with excitement.  The amuse was nice (lentil salad).  Our table ordered the chef's tasting menu.  The salad, risotto, & scallops were really good but the portions were a bit small for the $60+ price tag.  Also, at a nice restaurant with excellent drinks and food quality, I don't mind a little snottiness from my server , but our server went a little overboard with that."], ["Sparkles H.", "Service was a fail!All was good at my dining experience here until my server brought us our bill. We had a gift certificate to dine here so gift balance was removed from our bill. When we looked at our bill, our sever had drawn a star next to the original total price on the original bill, then she wrote out the original price once again on the signing bill along with a written note of what 18% tip would be calculated down to the penny for us. Do you think we don't know how to tip? And since when do servers dictate how much tip they are entitled to? 18% minimum is required for a party of 6 or more at this restaurant, but there was no minimum requirement for a party of 2. For a restaurant that aims to \"higher end,\" I found this to be snarky, passive aggressive and very NOT classy as well as insulting. So much for enjoying our dinner here with a gift certificate. I'm sure not going to buy anyone else a gift certificate from here and this will probably be my first and last time here.Food wise - it was good. We had the avocado crab salad which was good to share between two people. We also shared the bolognese pasta (which is quite a large portion for an appie) and the duck. The duck was delicious, maybe slightly too salty, and I loved how it was accented by the grapes. We skipped out on sweets as we were already really full. The biscuits that come along with your dinner could be better - it lacked taste and flavor. It was also a bit dry and not buttery enough.But like I said, I go out to eat for an enjoyable and memorable time. With service like that, there are PLENTY of other options in a city like Ann Arbor that's known for it's array of good eats."], ["Kristen C.", "We celebrated our 13th anniversary at Logan. We both give the experience 5 stars. The food and the personal service is what made it truly outstanding. We had a wine pairing with each course and staff took the time to describe and note our taste profiles. The clientele was definitely in the higher incomes, but I am sure there are other people like us who are not of the higher incomes, but do like to spend a pretty penny on special occasions. Excellent food!"], ["Blaine T.", "SO great! This is one of those restaurants where you could order anything and it would taste amazing."], ["Natalia B.", "Ann Arbor is usually a treat for us being that we live outside the area.  We had a coupon to Logan and we are glad we bought it!   We had an awesome server....not sure what his name was but he was a Violin maker originally from Salt Lake City, Utah.  This was his other job.  He was very knowlegable in recommendations in every course.  We had Wild Boar Bolgnese as an appetizer.  You will see it as a pasta dish on the menu however he told us it truly was the size of an appetizer.  Delicious!!!!I ordered the Moroccan Hen and my boyfriend ordered the Thai Scallops.  Both dishes were amazing!!!  They had such great flavors in each one of them!  I can't wait to return to experience this again.  You must try Logan if you are a foodie!!"], ["Lee A.", "I really liked this place.  The service was really good.  We got both bread and a delicious tomato soup on the house.  The prices were typical of the area.  I got my protein fill with some mahi mahi on quinoa served with a grapefruit sauce.  It was amazing.  Would definitely go back again and that meal propelled Logan to one of my favorite in Ann Arbor."]], "Lena": [], "Sabor Latino": [["Beth H.", "Oh what a gem!!!  Sabor Latino will be my go to place on Thursdays, for the $1.50 quesadillas and $3 mojitos. There are specials on weekdays; check their website for the list.  I sat at the bar and ordered a mojito for a late lunch today.  Fresh lime, mint and real turbinado sugar; muddled with rum.  BEST MOJITO I HAVE EVER HAD (and I have had a lot of mojitos)Here's how to order on Thursday: The quesadillas are like small meat and cheese fajita size shells - order three if you have a healthy hunger.Order your sides - they come separate and are enough for 3-4 quesadillas.The cost adds up but so worth it! Outstanding carnitas. The bartender was super nice and quick to serve. Did I mention he makes an outstanding mojito?"], ["Brad K.", "I've been here several times.  Famous for their Taco Tuesdays.The bad part is, their tacos just aren't that authentic or tasty; they're pretty greasy.  Sabor Latino also skimps on salsa.  There's several really good Mexican restaurants in Ann Arbor, but sadly none of the good taco places are located downtown.I don't eat here anymore, a couple little things finally made me cut ties: 1) the waitress not knowing what \"al pastor\" was and pronouncing it as \"Pastor\", and 2) being one of the many people that had my credit card stolen from here."], ["Patrick G.", "This place is dirty, poor employees are so stressed out, and they steal your credit card. They have great food though, chips were stale. Cash only tho. They will steal your credit card info for sure."], ["Kristine K.", "My name is Kristine K, and I have a new addiction -- Sabor Latino. First, you do not come here for decor or service. And, as to abolish any preconceived notion, this is not your Americanized spicy \"Mexican\" food. Sabor Latino is DELICIOUSLY mild, yet complex dishes most typical of Venezuela and Cuba. So, if not familiar with this cuisine, what can you expect? Probably the most properly cooked rice that I have eaten since living in Costa Rica, and rich, slowly cooked shredded meats. The garnishes are simple - delicious beans, shredded lettuce, and tomato, usually supplemented with another regional starch. The food is truly a delightful and authentic departure from other restaurants in the area. Attend with an open mind and palate. You will be happily surprised!"], ["Janice L.", "I was hesitant to come here after reading bad reviews.  However, my friends convinced me to join them for Taco Tuesday.I absolutely LOVED my experience! On Tuesdays the tacos are only $1 each and they tasted pretty good. I would suggest getting hard shell because these come with more toppings. (I love the cilantro!) For choice of meat, i like pastor (marinated pork) and chicken. I didn't like fried pork that much. Overall, I would recommend the $1 tacos.The free chips and salsa was ok... nothing spectacular.I also explored other items in the menu. I tried pabellon criollo ($14). This dish comes with shredded beef, black beans,  rice,  and fried plantains with melted cheese. I did not like the beef--it was too salty. On the other hand,  the fried plaintains with melted cheese was absolutely DELICIOUS! The cheese balanced the sweetness of the plantains perfectly! I ended up ordering more of these.  The fried plantains with the melted cheese is not listed separately on the menu and is only served in the dish \"pabellon criollo.\" However, if you tell the server that you only want the fried plantains from the dish, they can do that for you. I also tried the plantains they sell on the menu. It was $3.50 and very mediocre. I only recommend the fried plantain with melted cheese from the pabellon criollo dish. The fried icecream and the churro were delicious! The churro was served warm and fresh. The downside was that it was very crowded and the service was VERY slow."], ["Alexandra Z.", "love this place! great food.. love their tacos. the service is authentic but good!"], ["Stephen K.", "AVOID THIS PLACE! Besides the crappy food, there's a larger reason to avoid this place that others here have mentioned.Someone here is stealing credit card numbers. I came here with a party of 10 people and literally 9 out of 10 received fraudulent charges within a week, all of them at similar locations. The 10th person cancelled her card before getting a fraudulent charge, to be safe. One person in our party had a card that he only used one time at this place, so there's no doubt in my mind that the cards were stolen here.We went to the management to let them know what was going on and they did not seem to care or take our concerns seriously. Either they don't care or they're in on it.Consider yourself warned. Superior Mexican alternatives in town that won't steal your credit cards (and that I've been to) include: Isalita, Chela's, and T-Maz."], ["Andrew B.", "I am glad that I waited to try this place several times before writing a review. After five visits ,with three of them being simply atrocious and two visits that bordered on the feeling of blah, I have come to the realization that this place is far better in theory than in practice. Focusing on the last visit of Tuesday, which resulted in a total waste of time and required my lunch-time nourishment to be sought elsewhere, I will never step foot into this place again no matter how many co-workers plead and no matter the price-inducing special they advertise. Lets begin the food review with the very simple, yet seemingly impossible task of ordering a beverage. I asked for a water with lemon and an iced tea. The water arrived with no ice and I was told they were out of lemons. About ten minutes later the iced tea arrived and was pretty much a glass of brown sludge with a sour taste and smell. When the waitress finally came back she stated \"I told them the tea was bad, sorry.\"After ordering the soft tacos with a side of rice and receiving three hard tacos with both rice and beans, I advised the food runner that I must have gotten someone else's order. A small debate ensued that resulted in my being told that I was wrong with what I though I ordered, and that I received the correct order.  HUH?!?!?!? Well, ok, if you insist.When our original server finally came back to the table she apologized and offered to have the correct order made, by then nearly forty-five minutes had gone by and I was needed in court. When the bills finally came, my bill was for full price. One bill was for the wrong amount, and another bill was oddly divided into three separate bills. Bizarre. When mixed with the other less than pleasing experiecnes I am confident in stating that I will never return here again. Never. The food is typically cold, orders often incorrect, and the owner/manager clearly could not seem to care any less about quality and customer satisfaction than s/he does now. There are too many fantastic places to eat in downtown Ann Arbor that deserve the business than to waste time and money eating here."], ["Sally F.", "Your credit card number will be stolen (high likelihood, anyway) and you'll get some nice fraud charges when you're alerted by your Visa customer service rep. Don't do it. Or pay cash.I know of quite a few people that have had the issue and Sabor needs to get this figured out. Really bad form, since it's been going on for months."], ["Rob D.", "Tonight I walked in, sat down and a tired waitress walked over and tossed a menu on the table. I waited ten minutes for her to return and take my order, then walked out. Won't be back. The place is kind of dumpy, too."], ["Karla S.", "I feel that the food is pricey for what it is. Also I don't like that on the weekends the menu is different. I wanted tacos and there is no option for tacos on the weekends :S. I ordered the Colombian empanadas, they were like OK, they need more flavor, something was so plain about them. If they had Argentinian empanadas, that would be amazing. I liked the flan, that I give it 5 stars it was good."], ["Jeff O.", "Why 2? Why not 1 star?  Good question.  Service is so slow that I left and went to another restaurant.  Place was dead.  I guess a good soccer match was on or something."], ["DNR F.", "This review is for Weekend Brunch only!They don't open very early.The decor does nothing for meThey have a skeleton crewbut...The coffee has cinnamon in it : )The Waiter/Waitresses have always been very nice.]It is never busy for BrunchThe Breakfast menu is Incredible(my opinion)Eggs done correctly, roasted pork, crunchy pork, fried plantains, black beans, Guacamole, rice, chips salsa, hot sauce, corn tortilla, horchata and plenty of stuff I have never heard of . I never knew they had a weekend Breakfast menu, now I will walk right past the broken egg to this spot for a lazy sunday breakfast."], ["Suzzette K.", "The food was moderate. The positive is that it did come out hot. My server and my perception of the service overall is that they have a lack of care for the restaurant. Never cleaned off tables, they all just hangout behind the bar. The shape of the restaurant and condition is very poor."], ["Caitlin B.", "Went here with my fiance, his mother, and my teenage brother.The restaurant was pretty empty, but the service was totally incompetent. We couldn't tell if our server was training, didn't care at all, or actually was Mr. MaGoo. He spilled water on the floor, ignored our requests for additional water, never came to check on us, and wasn't familiar with the menu. He did, however, do a lot of hanging out by the bar.One basket of chips and salsa is complimentary, regardless of how many people are at the table. For two hungry guys at a restaurant with slow service, that would be an issue if the chips were warm, salted, or more appealing. Since that wasn't the case, it wasn't an issue at all.I ordered nachos, which were pretty cold. The beans were not spiced at all, but the temperature was the main issue. The fiance got tostadas. He ordered them with no tomatoes, but of course it came with tomatoes. Since our waiter was completely MIA, he just picked around them. His mom ordered the chorizo and banana/plantain appetizer, which she found extremely spicy (this was the only item that had any spice at all). My brother ordered a burrito, also without tomatoes, but this was also not honored. The meat was completely cold, and the rest of the ingredients were tepid. It also fell apart as soon as he tried to pick it up.Unless something major changes, with both the menu and the service, I wouldn't return."], ["Kiki S.", "I used to love this place. I'm not sure if they got new cooks or what happened, but lately it has been really bland and gross. I'm not a picky eater at all and I ended up leaving half the food on my plate. I got fish tacos and the fish was tasteless and covered in flour, and the tortillas were bland and soggy. I was starving and in a hurry so I covered it in hot sauce, which made it edible but still not great.  This is the third time in a row I've had a bad experience with the food, which I guess is my fault for continuing to go back - but it used to be so good and I kept hoping the bland food was a fluke.Service is hit or miss - I've never had really great service here, but about half the time it's competent. The other half the time is horrible. I shouldn't have to repeatedly track my server down across the restaurant to ask for a refill on water, the bill, etc. after waiting 10+ minutes for him to come check on my table."], ["Monica G.", "The menu looked great, the food was such a disappointment. The chips and salsa were stale and bland. The Argentinian empanadas were good but the chimichurri sauce made it way better. That was the best part of the meal, that sauce. The shredded pork dish too salty. The pupusas were terrible. Stale, bad flavor, the toppings and fillings not authentic or even well prepared. The rice ok. The back beans old and dry. I should have checked out reviews before falling for the groupon offer. Don't make the same mistake we did. Our Waiter was very nice though."], ["Olivia K.", "I was severely disappointed by the mediocre meal I ate at this restaurant. I ordered what the menu called an Iced Mojito. Thinking I was getting a refreshing minty drink I instead received a blended green disaster. It looked like blended grass and the waiter even said upon setting it down in front of me that he had never had one like that before and laughed. Don't even get me started on the service. He was pretty worthless. He came to our table maybe twice, to take our order and give us our bill. Someone else delivered our food. The complimentary chips and salsa were also hilarious. A huge basket of chips and about 3 tablespoons of salsa and you have to pay $1.50 for more. I ordered the taco salad with steak, yuck. The steak was partially tough and partially mushy and incredibly over salted. And I love salt. I couldn't eat the entire bottom half. When we finished eating what we could of our food, our waiter didn't come for 20 minutes so we had to pull him away from chatting behind the bar to bring the bill. He brought the wrong bill which was double the amount of what we ordered.So once again, we had to go up to the bar to tell him it was the wrong bill. The set up in there is awful, the wait staff is inadequate, but luckily the prices are low like the quality of the food. It's safe to say I will not be returning here or recommending it to anyone. We did not leave a tip."], ["Michelle C.", "I've only been here on Taco Tuesday.$2 jose cuervo shots. $2.50 coronas. $1 tacos. You can get full & tipsy with tax & tip for less than $20! Don't be fooled- $1 tacos are bare minimum, so if you want to add basic taco toppings (i.e. tomatoes, lettuce, jalepenos, onions, etc), you need to pay $0.50 5o $1.50 extra.  Tip: chicken is a little dry. I love the beef tacos. Hard shell tacos come with more toppings than soft tacos."], ["M F.", "This is the Main St. location that used to be a Mole Mole.  This is my favorite Mexican place in the area. The tortilla soup, enchiladas, tacos , carne asado and mole mole chicken are delicious.  The pico de gallo is great but their guacamole isn't remarkable."]], "Vinology": [["Nancy R.", "This is a multi-faceted sort of score.  I would give them a 3.5 or 3.8, if I could.  Service was stellar, food was meh.I went here with several coworkers after work.  We had a table in the back reserved for us.  Our server (Mark? Tony? Stuart? I don't remember) was extremely attentive and friendly.  He gave us all the time we needed as we chatted and gave little thought to ordering.  The absolutely stellar part of the service is how well our server and the kitchen reacted to a sensitive situation.  One of our coworkers has both a gluten and dairy allergy.  As such, it's pretty difficult for her to eat anywhere.  After explaining this to the server, he went back to the kitchen and he explained that the chefs are completely prepared to make her something that would be wonderful and wouldn't make her sick.The rest of our table ordered flatbread pizzas, a blended Italian red wine, and our entrees.  First off, the flatbread pizzas were actually quite good.  There were several vegetarian ones (a margherita and actual veggie), and a spicy sausage and something else.  We had a veggie flatbread and one with pepperoni and sausage.  Both were very delicious.  I would happily order those again.The red wine was okay, but I know very little about wine, so my review isn't based on this at all.The \"meh\" part of the review is my entree.  There was no problem with it.  I ordered the spaghetti and meatballs.  I figured it'd be their take on a classic italian dish.  Sort of.  The meatballs were lamb in a gravy.  They were big, they weren't super dry, but they weren't super moist either.  They were pretty bleh.  I really didn't understand why they were coated in a brown meat gravy.  The spaghetti were these little cylinders of spaghetti that seemed to be baked in large cupcake tins and covered with breadcrumbs and cheese.  While the form was interesting, it made the spaghetti a touch over cooked and dry.  It had to have extra red sauce around it.  So there are these lamb meatballs in a gravy, right next to dry spaghetti and sauce.  It seemed terribly disjointed, like they weren't related.  Why coat the meatballs in gravy?  Why not the pasta sauce to link them to the spaghetti? It seemed like two halves of two dishes were on one plate.  Neither was executed terribly well.My coworker was served a grilled salmon with fingerlings and green beans.  It looked wonderful and she proclaimed it to be delicious.  It wasn't on the menu at all, but the kitchen reacted so wonderfully to her allergies and still made her a dish that was superb.  I was terribly impressed by this and very happy she could enjoy our dinner out.My other coworker's meals looked delicious, and I wished I had ordered something else.As a side note, the entrees have two prices on them in a \"28/42\" format.  The first number is a half order, good for tapas or for a smaller entree.  The larger, second number is a full entree.  Some of our diners ordered a half.  Some a full.  The full orders are very generous.  The halfs are probably the best size after having appetizers.  This isn't super obvious on the menu unless you read everything."], ["K C T.", "Great place, we came here after a horrible experience at The last Word ( don't go there)The staff was nice our waiter was great. We had an excellent time here."], ["Michele S.", "The food is okay.. ordered sea bass for dinner..all the ingredients are really fresh, but doesn't have much flavor to it (maybe it's way too healthy for me )..the wine selection is great, but i was not impressed by the wine that was recommended by the waitress (forgot what it was)..Overall experience was okay..and it is definitely on the pricey side. (paid about 40 bucks per person entree and a glass of wine)"], ["Christina H.", "I have been here about three times and will definitely keep coming!  This place never fails. The food here is absolutely amazing, and so creative with the different blends of taste. The first time we came we had our orders taken care of with Steve. He was very thorough on what each dish was like. We liked him so much that ever since then he's been our waiter every time my boyfriend and I go. Every dish he suggested was delectable. We always order the calamaris as appetizers, it's a must have!!"], ["Tabitha M.", "Restaurant Week lured me back after a 10 year lapse.  I've got to say, our service was really good!  Shout out to Scott for reading when my friend and I just wanted to visit and letting us have our space!   Food was hit and miss.  Beet and pistachio salad was GREAT!  Pork belly taco was alright (would have liked more than 2 pieces of pork belly).  Entrees (fried chicken and roast lamb) were good, but not great.  Sticky bun dessert was tough, but the cheesecake was deeeelicious.  I'd be willing to give it another go and see if we can't get up to four or five stars."], ["Jeffrey A.", "I recently found out that Vinology is discontinuing their lunch service, but they are of course still open for dinner, AND they will be serving brunch on the weekends!  I've always been happy with their service, food, and wine selection.  It's a really excellent venue."], ["N G.", "Had an amazing meal and even better service, if possible. I ordered a vegetarian dish and asked it to be topped up with chicken - and it was gorgeous! The mushrooms melt in your mouth and the potatoes were so good. The waiter recommended the wine which was a bit dry for my taste and he offered to replace it - and that's great service."], ["Ann W.", "Vinology is on the list of restaurants that I recommend to friends looking for a unique dining experience. I make this recommendation for a number of reasons:1. The meals complement the vast wine selection and vary from visit to visit. 2. The majority of the meals are different and much more creative than what you would find in other restaurants.3. For dinner, you have the option of selecting the smaller-sized portions, my license to try more creations.For lunch, I started with the Thai Salad (appetizer portion). This dish included large chunks of avocado, wrapped in thinly-sliced cucumbers, shredded cabbage with soy dressing, and fried rice noodles. It was incredibly good and a great start to the meal. For the entrée, I selected the Provencal Ahi Tuna, cooked medium rare. The meal included deliciously-roasted potatoes, green beans, and grilled baby romaine. Sherry vinaigrette added one of the dimensions of flavor to the meal. In addition to the tuna, there was egg salad atop a tomato. It was an odd but interesting combination.I enjoyed an incredible dessert - one of the best I had this year. The bougatsa was comprised of two distinct elements: an egg custard baked in phyllo dough and dusted with powder sugar. It tasted very similar to the Greek dessert, galaktoboureko, and was served with caramel sauce. The other element of the dessert was a two-layer coffee pudding served in an espresso cup, topped with whipped cream. This was a 5-star dessert.The restaurant is located in downtown Ann Arbor. On the street-level, the dining room is split in two between the bar and dining area. There are stairs leading to addition seating downstairs. The restaurant featured exposed brick walls and a tin ceiling. The light fixtures are enhanced with seashells. Sheers offer some privacy among diners.  All of this adds up to a unique but perfect setting for a delicious meal."], ["Jason B.", "Had a great meal here Saturday. Definitely doing some of the best food in town these days (although competition is a bit lackluster). Had a delicious cheese board to start and then shared the Pasticcio and the Scallop ala Nola dish. Both were great, but i think the Pasticcio was better."], ["John K.", "I'm here for a wedding, the bride and groom had their first date here and now got married here. The downstairs can be rented out for large groups and we have about 40 in ours. I can't comment on the upstairs regular bar/dining area but downstairs the waitstaff has been very attentive and the food was excellent. Our group had choices of lake trout, sirloin, gnocchi, and game hen and everyone enjoyed their entree."], ["Nancy K.", "It's official, my on again off again romance with Vinology is officially over. We should have learned a long time ago to stick to the inspired cheese plate and wine. Unfortunately when looking for a place for dinner this past weekend between work and not wanting to eat after 10, Vinology tempted us with a delicious sounding menu and perfect 8:45 time slot. We arrived at 8:41. We like to arrive a little earlier for dinner and have a glass of wine but a few obstacles popped up. We are those people who call if they will be late but were happy to park close enough and with enough time to make sure we could be there on time. Which was 8:45.The hostess working, who I'm sure is a nice enough person, must have been stressed by restaurant week. She asked our name, made a face and said, \"Um, it's going to be closer to 8:45?\" In that annoying voice. First, you are telling me, not asking me, so your inflection should go down. Secondly, I wasn't one of several annoying people who came VERY early for their reservation and asked to be seated early. I arrived on time. The bar was packed, there was no place to stand and the servers were annoyed. I don't blame them. What I do blame them for is the ridiculous amount of attitude they all had. Seriously? Where would you like me to stand when I am four minutes early and there is no place to go? TWO parties who arrived after us, both with 8:45 tables were seated ahead of us. But we stood and smiled and figured it would be worth the wait. We were seated at 9:20. We ordered a bottle of wine. It. Took. Forever. I get that it's Friday night and it's restaurant week and you are packed but considering that there wasn't even a \"wow, sorry about that crazy wait!\" (You know, MANNERS?!) or a, \"hey, we won't be able to seat you until about 9:15,\" my patience was running thin. But it's not the waiter's fault so I didn't say anything. The bottle took forever but it did finally arrive. We ordered an artisanal cheese plate and then I had the salad and steak and Kris got the soup and risotto. When the cheese plate came we couldn't tell if it was the salad or the cheese plate because it was put in front of me but there were no other plates. It's moments like this that I feel awkward and uneducated so I waited and when the waiter passed I asked, \"We're idiots, is this the salad or the cheese plate?\" And he said,  \"cheese plate\" and walked away. After two more times walking by with us not really caring and happily enjoying a glass of wine he came back and thumped down two small plates. Nice. And necessary because it was a trio of spreadable cheeses and without plates we would have had a hell of a time. It came with crostini spread with pesto which looked good. And then I bit down. Thank god I am terrified of dental mishaps and always take an easy bite at first because this bread was STALE. It was not crostini. It was bread from a few days ago that even though had been sliced thinly (a few days ago) would have served as a decent weapon had you a sock to put it in.We asked for some soft bread much to our waiter's apparent distaste and then I said, \"Well, the bread is stale. Not crostini. It probably shouldn't have left the kitchen,\" and while some people might find this rude I was kind of sick of the attitude and also the nightmare bread. Especially because I was starving and felt like that thirsty dude in hell... The one who leans down to drink and the water retreats but then when he sits back up the water comes back? I felt like him.After a while more the soup and salad came. Kris' soup was piping hot and phenomenal. My salad was delicious and exactly as described on the menu. We are leisurely diners and were happy that the courses were spaced (well! after the initial wait). When our main courses came I was warned that my plate was hot and it was. I was actually surprised at how hot because when I put my hand over my non-steaming food it was not emitting warmth of any sort. Kind of weird. I figured it would be pretty hot judging by the plate. I cut a small piece and no, it was not not. It was barely warm. I'm pretty sure they had put it in the microwave. You know how when you put things in the microwave sometimes the plate is crazy not but the food is not? Yeah... that.The gruyere pasta was tasty even room temperature and, quite honestly, I was at the end of my tether and felt I had used my one request with the bread so I ate about have of my meal and we ordered dessert. Dessert was fantastic. Vinology has beginnings and ends covered. After the bill came a managerial type came by and I bitched about the crostini. And old person or small child would have a lawsuit, I swear. And he comes back to say he comped it. Um, thanks? We weren't trying to get a free appetizer, we were letting you know that your quality control needs some quality control.Done. Never again."], ["Amy G.", "I really wanted to like Vinology, but I honestly did not hugely enjoy my meal there. I made a reservation for me and my friends during Restaurant Week. I had a coconut-based soup, risotto, and a brown sugar cake with a pear topping for dessert. I like the soup, and wished I had more than just a small cup. I couldn't eat much of the risotto dish--it just seemed like bland-ish mushy rice, kind of like the rice I make accidentally make when I put to much water in the cooker. The side of oily greens did not serve to cleanse the palate, and I just didn't understand the grapes component of the entree. I probably just made the wrong menu choices, as I tasted and liked my daring friend's carppacio appetizer. I have long been intrigued by carppacio but not brave enough to order it myself. The meat was cut super thin and seasoned heavily so it basically tasted like eating fancy salami rather than raw beef. Vinology is a dimly lit and dressier place, and accordingly I saw many multiple date nights happening there. I would probably give the restaurant another chance."], ["Ashley C.", "We went to Vinology for my birthday dinner. Loved, loved, loved! The service was fantastic. We were first seated at a high top near the bar, but asked to be moved to a table near the front. No problem at all. There was even a space heater next to the table so we were toasty during the whole meal. I ordered a flight of red wine. Great deal, $14 for three glasses. The boys had local beers. For dinner we had one of the flat bread pizzas, a lamb dish and a pork dish. The food was delicious and came very quickly. For dessert, I was able to choose a comped birthday treat (thanks!). We split the bread pudding with goat cheese ice cream. It was shamefully delicious. I didn't care for the ice cream, but the guys loved it. Overall, we had a wonderful time! There were a few things on the menu we were already eyeing for our next visit. Hopefully it's sooner rather than later!"], ["Colleen H.", "Two words - Roasted Tofu!  Unbelieveable.  A group of us from work met for lunch during restarant week.  I had worked out right before and when I saw the lunch menu I knew I wanted the roasted tofu but I was afraid it wasn't going to be enough food since I was starving.  I went with it!  Not only was is amazing, I was full!  The presentation was beautiful too.  Two more words - Happy Hour!  I thought this was just for restaurant week, but, NO!  Happy Hour everyday is 11 am to 6 pm.  I got a glass of Smoke Screen Chardonnay for $5.50!  YUM!  The lunch was amazing and I encourage you (even if you are not a vegetarian) to try the roasted tofu.  You will love it!"], ["Varun B.", "Yum. The entire time I was at UofM, I had never gone here, and it's quite unfortunate, but I'm glad I finally got to check it out.  They have quite a nice selection of wine, and a nice \"featured\" wine section.Decided to go all \"small plates\" for dinner because neither my wife nor I were super hungry to shoot for the entrees (not to say they didn't sound delicious). We got the duck wings, and man oh man, those babies are fantastic. Duck is one of my favorite meats. The wings have a delicious glaze and the meat is super tender. Not to mention, they're quite easy to eat. The sautéed calamari with the risotto is also excellent. The melon amoygue adds a nice touch. We did get the Day Boat Samosas with a shrimp/scallop patty on the inside. To be honest, the wrapper was quite greasy and not very crisp. I wasn't a huge fan of the shrimp/scallop patty on the inside either - a weird little taste. This was probably the low point of the meal. The last thing we got, the caribbean chicken flatbread, was pretty good though. The braised pineapple on it was great and the chicken was tender.  I would really like to come back at some point and shoot for the entrees."], ["Bridget N.", "I had brunch here with two of my friends on a Sunday morning. Brunch was delicious! I got the shakshuka and I loved it-very different from other brunch offerings. The eggs were cooked well-the tomato sauce was well flavored and the pitas were the right texture of crispy but not too hard. My friend got an omelette (she loved it) and another got shrimp/grits (she liked the flavor, but eggs were cooked soft and she didn't like that). Portions were very generous. We also got the pastry basket. I do wish they offered half a basket (it's ALOT of stuff) but  it was a great starter. The sangria is also my favorite in Ann Arbor so far-I think it's the brandy they use. It's not too sweet and a bit strong-in a good way. I would definitly come back here for brunch."], ["Erin M.", "Had the most amazing time here last night. Melissa, our server, was knowledgeable and cool. We had a table of people with special dietary needs (vegan, gluten-free, etc.). I can't even tell you how incredible it was that I was able to have a three-course vegan meal -- from appetizer to dessert -- at a beautiful restaurant that doesn't even advertise itself as being vegan. Serious hats off to the chef for treating vegans and gluten-free individuals as guests who are just as important as anyone else. I will definitely be back."], ["Kate S.", "Am very conflicted with this review. I've been here a few times now and have had some 5 star experiences. But I've had some average experiences too. I am knocking this down to 3 stars based on the inconsistency.The best experiences I've had here have been at the bar. Order wine by the glass, enjoy the knowledgeable bartenders, and order some small plates. While not as intimate, it has led to a few fantastic evenings this way. When I've had dinner, I've had some amazing dishes (a cucumber gazpacho they served during restaurant week this summer was out of this world), but I've also had under-seasoned meat, waiters who weren't able to answer questions about the wine list, and bar orders that never get filled. I will be back, and I really look forward to being able to knock this review up to the 4-5 star establishment I think this place can be!"], ["Jessica M.", "We've had a few great meals here and continue to recommend it to our visitors from out of town. We especially love the 1/2 sized plates as for my husband who is a big eater he can actually get 2 1/2 sized entrees instead of having to choose just one.The wine list is extensive and wonderful and we've always had good service. During the warmer months we love sitting out on their small patio and people watching."], ["Sou M.", "I went  to Vinology for a first date and loved my experience! I'm a foodie, food artist, and expert in bakery. BUT I hardly write a review about a restaurant. Only when it strikes me as a wonderful or lousy one! most restaurants, though, fit in the range of 3/3.5 star for me.Now my review on Vinology:Service: We had an amazing server, Jannet (or similar). She was super sweet, friendly, and helpful. Wine: I'm NOT an expert in wine but my date was, and he was very satisfied with the wine selection and recommendation. So I vote for him ;)Food: I ordered Chicken under the Brick. It was slow roasted chicken over a bed of mashed potato and roasted veggies. It was very tasty, and beautifully decorated. I ordered half portion and could just finish half of it.Ambience: We checked in, on a Thursday night, snowing and cold outside. It was quiet and relaxing inside. not crowded at all. Dim lighting and beautiful décor was a plus for a date night. Overall, I loved it and I will definitely go back to try other dished, and desserts."]], "Redwood Steakhouse & Brewery": [["Brian F.", "Favorite place to eat on a regular basis! Food is fantastic since Luis is back in the kitchen.  Wine tasting and martini tasting nights are so much fun and very reasonably priced.  Beers are great, favorite is the Cream Stout."], ["Margaret V.", "I have passed the Redwood Lodge/Steakhouse multiple times on my way to Flint and finally ate at this restaurant last week.  The ambiance is really neat.  It is like an upscale wooden lodge.  While the menu is extensive, but it also very expensive.  My friend and I both ordered their redwood lodge salad with chicken and while it was large and tasty, it was also $16!  The salad itself wasn't too bad, but to add a piece of chicken was $6.  Pretty pricey for a small chicken breast.  We also shared an appetizer of the spinach artichoke dip, which was excellent.  They had a very extensive wine and beer list. While our waiter was a very nice young man I must say the service of the other staff left something to be desired.  My friend had to leave early as her son was getting fussy, so I finished my dinner by myself and ordered another glass of wine since I was in no rush to leave.  The restaurant was not overly busy that evening (I would have hurried to finish if they needed the table) but a woman (who I am going to assume is the owner/manager) took away the chair my friend was sitting at without asking if she could have it or if my friend would be back.  I found this to be pretty rude.After I paid, two young girls who were standing at the host area muttered under their breath (thanks for coming).  They looked more like they would be interested in a root canal than return service to this establishment.I wouldn't go back."], ["Tim H.", "I would give 4 and a half stars if I could. We started with the oysters Rockefeller and on the half shell which were both amazing. I had the clam chowder next which was also very good. My entree was the cedar plank salmon. It was good, I have certainly had better though. I probably wouldn't recommend it, but they are a steak house and everyone that ordered beef commented on how amazing it was. They are also a brewery and in my opinion, an excellent one. If you are a fan of craft beer I would recommend a flight. They are reasonably priced and a great way to sample the many great beers they have available."], ["Tom A.", "My wife and I have been here a couple of times and have enjoyed it.  The menu is a bit pricey but the food is good.  I love their beer as well."], ["Mikee R.", "OK... My first review was spot on.Here is my follow up a few months later.Tonight I got pretty much the same thing as last time with the exception of asparigas.My steak was perfect. The Soup was perfect.I got a hazel nut chocolate cake which was extremely yummy.Why didn't they get five stars?Our server would disappear for extended periods of time.We had to beg for refills. He couldn't even cash out the bill in a timely mannor.But those guys in the kitchen had it going on."], ["Tom N.", "Tough review. The place is nice and service was good. I saw a nacho plate that was very large! My family ordered burgers as the menu is pretty expensive. They were only ok  certainly nothing special at all for the cost. I do not think I will be going back. Nice to try once but it's too expensive for me to make it a regular place especially for the prices."], ["Cori K.", "The French Onion Soup is delicious.  Hands down, my favorite in the area.  The waiter was super friendly and prompt.  Really a great dining experience.  The atmosphere is relaxed and fun."], ["Scott F.", "Got the Redwood Nachos with BBQ Pulled Pork...Excellent. Kids got the chicken strips they were very good and huge! Didn't have sandwiches on the menu but what they did have was good."], ["Rajan B.", "This is a neat restaurant by Grand Blanc hidden and I noticed it when I was on the freeway. I thought I give it a try and it's a cozy lodge like restaurant ( more like an upscale version of Montana's) and their staff are very friendly and nice. Food is tasty and they even have sushi and it's not bad at all. I had the pepper crusted steak which is one of their chef's choices and it was delicious, especially the sauce. The bread ain't their speciality nor the clam chowder! Clam chowder has to taste like Barbara's in Half Moon Bay, CA! One thing that made so annoyed is the place is full of fruit flies and they don't let you eat peacefully. Keep flying around into the food! I would go again only if they find a way to get rid of those fruit flies, makes me wonder whether their kitchen is clean or not."], ["Gary D.", "Others reviewing this restaurant are spot on. A really good place that seems to be consistent, but nothing really outstanding. We went for the in house beer, and found that to be more than adequate. The menu is extensive, but then again that sometimes is not a good thing. No one is good at everything. It is also kind of pricy for the area.I had a crab cake \"burger\", glad I asked for the cole slaw on the side. Woulda been a disaster on it! With just red onion and lettuce on a pretzel bun, it was delicious. Why would you bury that good crab cake under a mound of gooey slaw? I also had the chili, and it was worth the $3.99 for a cup. My wife had a Greek salad and did not \"bite\" for the $6 chicken breast. She enjoyed it.Service was reliable and food came quickly. I might stop in for a beer next time I'm in the area, but not that often for a $50 lunch for two."], ["Liz W.", "We ate here on the way home tonight.This place is huge. It looked packed to the gills but shockingly we were seated right away. The downside of this is we were crowded into an awkward area near to the bar where it felt like we were in every member of the staff's way, some of the patrons too. The table set up was definitely a negative.The food here is solid. Really delicious mains and salads are accompanied by mostly forgettable sides though so I cannot declare it totally fabu. I will say it has definite happy highlights. Steaks run a bit spendy but they have some menu items at all price points and the portions are hearty.The house salad was a happy hit with both of us. Gorgonzola, dried cherries, walnuts and onions atop mixed greens. I had mine with delicious balsamic and James went with the nicely thin ranch. The bread came in odd half loaves but was tasty dipped into the olive oil, pepper and seasoning mix the have handily at the table. They also have balsamic for a little jazzing up.I had the bbq half chicken served with a mustard barbecue sauce that can only be described as tangily addictive. Perfectly roasted on the bone and torn off in juicy flavorful strips easily with a fork. The garlic mashers that came with were not my particular thing, next time I will swap out for something more interesting. I also expected something totally different when reading roasted root vegetables, I merely got overcooked, tasteless carrots and celery, ick. My husband went with the Redwood Special Porter fish and chips. Three nice pieces of flaky and perfectly coated fish. It was served with a huge portion of decent, coated type fries and some meh steamed mixed veggies which he immediately put on his bread plate and shoved towards me.They have a variety of house brewed beers. My husband was happy with the selection of pale ales. Beer samplers (minimum order of 3) are 1.25 each, cask conditioned samplers are 2.00. You can get pints for mostly 5 and under. The girly drink menu has some interesting picks on it which always makes me happy. They have wine, scotch and tequila flights available and run very nice happy hour specials in their Sequoia Lounge next door from 3-6 weekdays.Waitstaff was friendly but not always super timely. The place just seems a bit chaotic. Overall though I was happy. Its about a three and a half star place on the whole.We will be back when we drive up next."], ["David P.", "A good place for dinner and/or a drink or two (great brewery)...not necessarily the best place to bring a large (40+) group.  Kind of convoluted, and while the back, private room does indeed have its own bar, there's a divider (half-wall) between it and the rest of the room that makes it problematic for events taking place."], ["Carmen V.", "Ate here while staying at the Residence Inn just around the corner.  Top notch place. Ambiance is great but you don't have to be all dressed up to enjoy.  However if you choose the crowd is a melting pot of customers.  We're took our 2yr old granddaughter and she too enjoyed herself. I had the Shrimp & Scallop pasta and my husband had the Risotto. Excellent choices on both our parts. We both had just wished the cracked pepper and parm cheese were properly offered when we were served our food. Our waiter was very very attentive and food was served in a timely manner! Great place for all choices of food. A bit on the spendy side for entrees but the sandwich/burger menu is priced nicely."], ["Billy A.", "Service was outstanding. Scallops were perfectly cooked. Ribs fell off the bone. Delmonico was below average. IPA was excellent. Great atmosphere. Busy but still timely. We will be back."], ["Chastity D.", "Pizza is great, sushi is good and ribs were pretty good.  The waitress was a little impatient, didn't seem like she was in the mood to be there."], ["Monica D.", "I enjoy this restaurant because there is no way anybody couldn't find something on the menu to their liking. From sushi to sliders. I've had the ahi tuna, the fish & chips, the blackened salmon and the nachos and every dish was really good.The place is extremely large and the high ceilings means that it can sometimes get a bit noisy, but it's great for a night out with friends. It's also a bit more pricey than a regular casual dining restaurant.The only problem is narrowing down which beer to sample next."], ["Dan W.", "Solid service and a full if not on the pricey menu are just two of the thing that make this establishment a 4 1/2 star yelp. From being seated immediately to final bill, it was a pleasurable and belly satisfying experience. I had their beef pot roast that literally melted in my mouth. Unlike another reviewers palette, I thought the garlic mashed and root vegetables to be a good compliment to my meal. I'm not big into salads but the dinner salad was excellent as well. My wife's aunt had their macaroni and cheese dish and kept stating how she would have to try to make it at home. My wife had a salad dish that she also said was very good. Finally I had one of their seasonal beers ( bier in German). A German dunkel that was light yet fully flavored and really set off the meal. Would we go again? We will definitely be back."], ["Debra V.", "The food was good but was not great I had the ribs they were good tender but just average ribs, the atmosphere was nice place is beautiful. But I think it's a little overpriced, I brought my whole family there because I was told that it was a great   restaurant. so this was my second time. same  thing food was good atmospheres nice, but it was just good food but not great"], ["Amanda T.", "I was torn between 3 and 4 stars for this review, but decided to lend them the extra for being one of the nicest restaurants I've visited in Michigan.We went here for a birthday dinner with my in-laws and pulled the full apps-beer-dinner-dessert experience. Prices were a little high, but the food was very good. We sampled an excellent flatbread appetizer, a little small, but lots of flavor. The husband and I both went for the safe steak, mine was a filet oscar (I'm a sucker for this dish). Both were cooked to a nice medium-rare, perhaps a little closer to the medium side. Portion sizes on the entrees were respectable; I was full but not stuffed (well, until dessert).It was a little odd to me the way they treated their ahi tuna. My father-in-law ordered up the 8oz. herb-crusted ahi on the side but you could barely taste the tuna for all the rosemary they slapped on it. I wouldn't recommend it for big tuna fans.Their microbrews were decent, too. My favorite was the pilsner but I was less than impressed with their amber ale. On the alcohol note; for a nice restaurant, their wine menu was lacking. I ended up having a glass of Ravenswood zin which is kind of a joke at nearly $7 a glass. I didn't check the brand on my mother-in-law's white zinfandel, but I'd be willing to bet money it was the old Beringer fall-back, that's just the kind of selection they had.As for atmosphere, that was where I was tempted to dock a star. It's a lodge, yes; but it's also a bar. The music was a little too loud and a little to eclectic (country, pop, R&B), menus were paper, and there were a lot of ads for gimmicky \"nights.\" I'd also like to agree with another reviewer who mentioned the tables were poorly arranged. They're WAY too close together. There was no one at the table behind us and the staff still had to shimmy uncomfortably close to get between me & the empty chair. And, as is becoming evident in my good 'ol home state: 5-star service is hard to find. Our waiter (Kevin) was very nice and very knowledgeable, but unorganized and trying way too hard. He was by the table every 5 minutes asking if everything was OK, and he repeatedly served the wrong food to the wrong patron. I like to end on a good note, so let me say the dessert was wonderful. Not too fancy, just good quality sweet stuff. Try the peanut butter pie, for sure. I'd say it's a great place for a nice dinner out, as long as you have a little patience and a sense of humor."], ["Melinda M.", "My husband and I go about once a week. Husband says the oyster's are great ( I will take his word for it) , and he is from Florida. I always get the sashimi tuna appetizer. I am just crazy about the spicy seaweed. We always just get appetizers, service is fast. Happy hour in the bar starts at 3 pm with 2 $ beer. Raw bar opens at 4pm. Forgot to add hubby found a real nice pearl in a oyster."], ["Chris A.", "Can't believe this place is in flint. Come here get the salmon oscar and be extremely happy! The red meat awesome too!"], ["M K.", "This place went down hill for awhile but I recently returned with a large group and I was impressed enough to return for lunch a few times lately because I work nearby..The wood fired pizzas (godfather) are probably the best thin crust in the county as far as I'm concerned and the Beer and onion soup, lodge French dip sandwich and redwood nachos are also great choices for lunch; haven't done much dinner yet. As far as beers I tried the Munich and it was excellent! Herb encrusted tuna used to be on the entree menu and was the best thing on the menu five years ago ++ but now is under appetizers at $15.99!!!' Haven't tried recently but will update soon.."], ["Mark T.", "We stopped in here for lunch without knowing anything about the place. It's in an office park area, which seems a little weird at first, but the inside of the restaurant is cool. It's a mix between a hunting lodge and a brewery. They make a bunch of beers which are pretty good. I got their version of a french dip sandwich and it was great. If I'm ever nearby again, I'd certainly go here."], ["John G.", "I take the family to Redwood once a month. They have really good food, but not many options if your trying to watch your calorie intake. Lots of people are reporting that Redwood is expensive, but that's not entirely true. Redwood has two menus and they always give you their main menu, which has a lot of expensive dinners on it. You have to ask for the Pub menu to get more economical, and still very good, options. Our favorites are the pizza, olive burger, and Lasagna. All their beers are very good, especially the Hefeweizen thats brewed in the fall."], ["Paul D.", "Cleanliness...4Food...2Service...4Price...4Atmosphere...3Beer...4Beer was good...The place is loud...Raw oyster were awesome but I hate it when you order Tuna and they serve you a piece of thawed fish!!!   Sides sucked!!!"], ["Jeremy G.", "As many others have stated, this place is nothing special and pricey for what it is.  The steak was not worth the price but the prime rib was excellent.  Be sure to get some beer samplers, they are actually reasonably priced compared to the food."], ["Nick R.", "Great food, amazing beer. The pulled pork nachos or pot roast cassidia is a must to start with. Steaks are great, pizzas are great and pretty much everything else I've had. Nice place to relax with friends and watch a game in the sequoia lounge."], ["Antonio R.", "This steakhouse is by far one of my favorite. i went here in late feb and i was impressed by the selection and quality of the food! there are two menus to choose from. a lunch and dinner menu. the price is a little bit high but totally worth it.. in fact thats the only negative thing about the place. there was a wedding going on when i was there and the clinking of forks against glasses was a little annoying but an all around great place to have a great steak!!"], ["David G.", "Sorry the worst steak I have had-:( order the Delmonico at 28.00 dollars no good. I did not send back or complain because the bartender was very nice and good service."], ["Roy R.", "Another successful beer appreciation society meeting. Food was fantastic, beer was great!"], ["Justin A.", "Great beer and great food.  Definitely lives up to the reputation of \"#1 Small Brewery in America 2009\"!A must is the Brown Porter - phenomenal.Good food as well - - recently changed their menu (new ownership?) - a little more expensive than before and not so much like typical pup-food!  A nice change.Love it..frequent it!"], ["David C.", "This is probably a special occasion place for a lot of people. The prices are above average, but not outrageous for the food being served. I had Australian lamb and it was very good. Our waitress was very willing to check on details for us and was well informed.Good place to eat and worth the extra money."], ["Rob R.", "High priced but good food and good service. Nice happy hour."], ["Ellen M.", "Great place to stop if you have time before your flight @ Bishop Airport.  Dark inside, but the menu is good with apps, sandwiches, salads and entrees.  I had the pot roast quesadilla!  Good portion for an app and I couldn't eat it all.  They made a nice grilled cheese for our son.Quick service.  A large selection of beers that are made there too!"], ["Glenn M.", "Very over priced."], ["Brian H.", "I travel for work and look forward to getting to Flint to enjoy Redwood Lodge.  I've never had a meal that wasn't fantastic and while I don't drink beer, everyone I take with me raves about them!  The restaurant is a steakhouse dressed up as a brewhouse so bring an appetite and get ready for some high quality red meat.  Portions are large and the food is tasty.  The service is always solid and the wait staff is well versed in the menu.  If you're in Flint and you need a good meal, get yourself to Redwood Lodge and dig in!"], ["Todd B.", "I've been here several times. I've had the duck, the lamb chops and several different steaks. I've never had a bad meal. $5 for a pop is a bit over the top. Beer selection is great. Dessert is a must have. Always have had great service."], ["Anne C.", "We just had possibly our worse dining experience ever.  We wanted a special lunch to celebrate selling our house and were mistaken in thinking this was an upscale restaurant.  No one greeted us when we walked in because the waitress was actually sitting upstairs in the closed but very visible section of the dining room, eating!  Several other employees were lounging in the area as well.  Finally the waitress got up from her meal, wiped off her mouth and came to take our drink order.  She went back to eating several times in-between waiting on us!!  She even came to our table with food around her mouth and talked to us with food coming out of her mouth!  Unreal!  She brought us chili instead of the soup we ordered and then the upcharge was actually on bill when we asked for it!  The tuna was prepared well but had no sauce - just dry tuna served with dry rice, even though I'd asked for a vegetable substitute.  When I asked to speak with a manager before paying my bill, I was told \"there are four sitting over there\".  None of them had the decency to even get up and come talk to me.  One finally did and when I told her the issue started when we walked in and saw the waitress eating was the same one serving us and that she talked to us with food in her mouth, her answer was, \"well, they work very long hours.\"  The management is pathetic, the service is disgusting and the food is lackluster."], ["Cee B.", "Great appetizers. Try cajun lobster app and boursin cheese app. God father pizza was deliciously meaty with a sweet and spicy sauce. great for groups and great beer selections!"], ["Chad C.", "I am rating this a 5 more for the beer than the food.  While the Redwood Salad and tortellini were great, the cream stout was top notch!  Our server and the roomy lodge feel were wonderful as well.  Well worth being THE place to stop in on the way or from coming back from up north."]], "Frita Batidos": [], "Mediterrano": [["Young S.", "Food is good.  Atmosphere is great.  Service is good.  Prices leave something to be desired.  However I see where they are trying to go with the restaurant and make it into an upper class \"white tablecloth\" restaurant but in my opinion it falls just short of the mark.  Just.  Good place to impress a date.  Be prepared to spend at least $50 for a couple plus booze.I like the menu mix of Greek, Italian, French, and Spanish but it think it gives the menu a bit of a ADD feel and perhaps lack a truly \"must try\" item.Overall Mediterrano is lacking a wow factor and that's what lowers it's rating in my book."], ["Mary F.", "A humdrum and tedious dining experience.  Nothing innocuous about the bill, however.  The problem is, I can never remember a single meal I've eaten at Mediterrano;  and we've dined here often enough.  The salads are O.K. and the food is tolerable but not one single dish stands out in memory.  It's a more professional option that the nearby Olive Garden restaurant - but NOT by terribly much. Service is lackadasical and slow (except when time comes for the bill and then it gets very brisk!), and the mixed drinks have so much ice you can barely taste the base ingredients:  my garden-variety Bacardi & Coke (yes, some of us still drink this!) tasted like water misted with rum and a little cola.  The food is forgettable and as I write this, I cannot recall one delicious bite that would have me going back.I find the restaurant and its food as Mediterranean as English Stilton.Of course, the decor is Decorating Den's take on chez` 'Med.  It's obvious several decorators - qualified and 'friends of', have had a crack at it and the present mish mash of styles is the result.  Let's hope this wasn't designed by a professional restaurant designer or the good folks at M.S.V. should demand a refund!  (The one visual plus are the triple topiaries flanking the front door).Decor aside, all lapses in taste are forgiven if the food is good and Mediterrano's food has been dull & uninspiring.  I'm tired of being told the bread's good:  if a restaurant with Mediterranean leanings can't get the 'bread & spreads' right, what's the point?I dine at Mediterrano with clients when we have business on that side of town and that's that."], ["Matt K.", "Very tasty lunch, but not cheap.  I enjoyed the soup I had as well as the gnocchi.  Interesting menu options.  I went as a recommendation of a nearby hotel clerk and it's definitely better than the same old chains surrounding this area."], ["Min H.", "Came here for my roommate's birthday dinner last weekend with a group of 8 or so people. I liked the open atmosphere and layout of the restaurant but it can definitely get loud. If you're looking for a quiet dinner, check and see if there will be any large groups coming in since from what I could see there wasn't a side room for private parties.  The place is also tricky to find since its in the back of the building and there are misleading signs.  About half of the dinner party got lost and confused trying to find the place.  I wouldn't recommend trying to find it for the first time in the dark as most likely you just won't see it.I split the Sea & Mountain Paella with another person and it was amazing. Plenty of food, loved the chicken especially. The birthday deal is fairly standard (total cost of meal split by total number of people minus the birthday girl) but I liked the free desert. Unfortunately for desert-lovers out there its jut for the birthday person, but with the amount of food we all ate, no one would have been able to finish it all anyways. Service was great. Our orders were taken promptly and the food arrived in good time. The waiter came by enough to refill drinks/take away plates without being intrusive."], ["Emily D.", "I have been here twice, and the food was good both times.  The first time we went I had chicken with avacado (it had a fancy name but I can't remember it) and the hummous, both of which were delicious!  The bread is awesome - you can tell it's freshly baked.  The potato spread that they give you with the bread is also amazing.  I just went for the second time yesterday, and once again had the bread and the hummous.  For my main course I had the grilled chicken ceasar salad...amazing! They make all of their dressing from scratch and they are very obviously fresh.  Thier wine list is pretty decent, too.The decor is cheezy, I'll give you that, but I think the food is priced well for the quality and you can't beat the bread.  I will definitely go back next time I'm in the area.  It's different, and that is what I like about it."], ["Peter A.", "This review is strictly about the bar experience, not the dining room.My partner and I went to Mediterrano after reading about how they hired new bartenders and were trying to create a happy hour that would attract a local crowd with craft cocktails.  Being fans of craft cocktails, this sounded great.  There's a growing scene here in Ann Arbor for that, and we thought this might end up being a hidden gem at an unlikely place.I'm sad to say we were sorely disappointed.  The bartender didn't offer us a cocktail menu, so we finally asked for one.  The menu offered promise: the cocktails are, indeed, craft-oriented and very creative on paper.Sadly, what we got was very mediocre.  Watching the bartender pull a jug of orange juice out of the cooler while there's a juicer RIGHT THERE on the counter was not a good sign.  If you're advertising craft cocktails, I'm sorry to say that's not good enough.  We did order an appetizer that was tasty, even if it took forever to get it, to the point that we were just about to cancel it before it arrived.Finally, the half-off prices that are advertised online during happy hour were apparently not in effect, since we were charged full price without explanation.We won't be returning.  If you're a craft cocktail lover, don't bother going here.  It's nothing special."], ["Kevin S.", "Graduation Day!  Okay, crew listen up: let's make sure we have the best staff, and plenty of them, so we can serve up the BEST possible meals!  The bestest, biggest tip day of the YEAR!Ahem.  Late lunch, party of twenty.  Reservations for MONTHS.  Food, for the record, was really great, complex flavors, very fresh.  NO complaints.  Could I just get that in a to-go carton?   Okay, okay, I'll sit through the service.  But it won't be pretty.Two orders, the Tuna Nicoise Salad and the Pene al Pomodoro e Fresco Basilico, both just delightful, nicely prepared, full-flavored, absolutely nothing but wonderful.  (I also sample the Butternut Squash Ravioli, and would love to try a heaping helping of that delight sometime.)Okay, I know that with a big party service can get dicey.  But hey, if you want a reservation months in advance, I expect the service to be ready and able.  It just wasn't.  No teamwork.  No logic.  No timing.  I heard TWO servers say, \"We're just bringing everything out as it comes, so it stays hot.\"  Really.  That's just like saying, \"Why don't you all just come back in the kitchen and grab your meals.  We've given up.\"I see other reviews have noted the \"decor.\"  Okay, so you're in a strip mall.  That doesn't get you off the hook for at least trying to match the atmosphere to the price-point.  WAY off.  Olive Garden looks nicer, is cleaner, and is a closer match with their customer and menu level.    I've said before, if you're striving to be a \"destination restaurant,\" you'd better meet ALL levels of excellence.  The food did, but that's it.  Two and a half stars.  (And the bathrooms, out the door, across the hallway, through the little anteroom?  You wanna charge top dollar and we share a bathroom with the Sylvan Learning Center and Bob's Pretty Good Gunshop and Possum BBQ?)"], ["Jeanette B.", "Really enjoyed the the Eggplant Parmesan. Other restaurants make this into cheesy tomato smothered goo. This dish had distinct flavors and textures. Yummy! Service was good too."], ["mike w.", "I went here for NYE '10.The restaurant is nice inside and a nice change of pace from the downtown scene. The crackers with salmon cream cheese spread is awesome. They don't have draft beer, BOO!!!! The food is decent, and some dishes are exotic. I ordered the Venison pot pie and it was very dry. I would stick to the more traditional dishes because they are executed better. It is a good place to go for a new dining experience!"], ["Rebecca W.", "Mmmmm, yes.  DEFINITELY get your parents to take you here.  Along with your roommates.  We came here Sunday to celebrate birthdays, graduations, etc.  Glorious.-We went at lunch...the place was basically empty.  I hope this doesn't mean the restaurant is struggling!-\"Victorian\" lemonade, apparently invented by our server (it's flavored with hibiscus and lavender syrup and muddled with mint leaves apparently from the garden of ANOTHER server).  Yum. Tastes like a virgin mojito, basically.  Very refreshing.-Calimari appetizer!  I was nervous that it was going to be a couple of artfully arranged pieces, but the $9 appetizer was PLENTY generous...there were 6 of us and we each got plenty--even seconds!  The breading was really light and flavorful. -We ran the gamut of foods....butternut squash ravioli, lamb, chicken, shrimp, and the shrimp cakes (tortillitas de camarones) and everyone was really happy.  I was surprised at how BIG and yummy the shrimp were.  I'm sometimes tentative of very large shrimp, since the texture tends to get mushier and the flavor, fishier.  But no such thing here!  Succulent might be the right word. -Also it was my birthday so my entree was free....but be sure to bring your ID--they check it and even take it to show the manager!This would be a five-star review, no contest, except for the tiramisu.  I come from a family of tiramisu experts.  We've eaten it from coast to coast (and in Italy) and definitely have our favorites.  And, unfortunately, this tiramisu was really lame.  The lady fingers were kind of dry and crusty, and the cream was not that creamy or fluffy.  The double chocolate cheesecake (YUM) ensured that our sweet tooths (erm, teeth) were satisfied, but I have to say the tiramisu was a disappointment . (To be fair, when our server heard us debating the tiramisu, she recommended that we try the cappuccino cake, made with liqueurs and chocolate mousse, instead.  So maybe we should have listened.  Or maybe they should just make better tiramisu.)"], ["Andrea J.", "Great food and awesome service. A family favorite. Go there!"], ["George C.", "Just had the black pepper roasted pear salad. Excellent!"], ["Michael S.", "Always seems far too expensive for what you get."], ["Brad T.", "I hesitate to give any restaurant a 5 star review, but Mediterrano is certainly deserving of that rating. Since as long as I can remember, I've gone here and received excellent service, I've never had a long wait, and the food is just awesome. That being said, the flavors are distinctly from the Mediterranean and you won't find any basic pastas with red sauce or other Olive Garden-style food here, so sometimes people have the exact opposite opinion of the food because they can't just get lasagna or spaghetti. I understand that complaint, but I just don't share it, I love unique restaurants and Mediterrano is very unique. I highly recommend the Chicken Jerusalem (chicken with a tart cream sauce) , the Turkish burec (a philo-dough vegetarian pie), and the butternut squash ravioli (exactly what it sounds like).Pricey? Yes. My wife and I took my parents out to eat just the other night and we went over $100 with a very minimal dinner. However, when you compare that with most of the restaurants on Main Street, Mediterrano is actually a pretty good deal. As a side note, we had our rehearsal dinner for our wedding here a few years ago and it was very fairly priced and they did an excellent job with the presentation and timing. The only complaint I'm surprised about from other reviewers is that the staff was pretentious. I find the servers here to be far more down to Earth than just about any other high-end restaurant in Ann Arbor. This restaurant tends to draw a line in the sand between people who like it and people who hate it. The people I know who don't like this place feel passionate about their hatred. Please keep that in mind when you read the positive reviews, because I know some very trust worthy foodies that just do not like the food here. That being said, I love this place and think that it's at least worth a lunch visit to see if you can get into it."], ["Samir R.", "Excellent service. Our waiter was spot on with his recommendations on wine and the lamb dish. Food was good. If you are in the southern part of A2, worth checking out."], ["Ted S.", "This past weekend I had the tomato pasta dish the noodles on the bottom were in a clump. Not a very tasty dish but with the price I needed to finish the dish.  My guest's dishes were also not as tasty they said. Would not return."], ["victor m.", "Mediocre food, tacky decor, questionable service. Overall: not worth the price.I'm rarely impressed with \"Mediterranean\" cuisine. That said, the food was ok. Not terribly disappointing but unimpressive, especially considering the price.The ambience is kitschy. The chintzy decorations and faux stucco would be laughable if the restaurant didn't take itself so seriously in the form of its prices. I felt like the pieces were collected from years of trips to TJ Maxx. It was pretty offensive.The server proved competent but was haughty. Not that we necessarily wanted more bread, but he didn't fill the bread basket or offer to fill it. After the meal, after we settled the bill (credit card) and wrote down the tip, we just wanted to finish our wine and talk. The server actually came by to interrupt our conversation to collect the tip. So just like the decor and furnishings, the server's behavior was rather unrefined.Will never go back there. Such a let-down."], ["Kay B.", "I'm bumping this place up a star for stepping up their gluten free game.  This time when I made reservations they already knew I was gluten free... they must have a caller id system that they keep your information in which is a little creepy, but also nice that they will always know when I make a res to hand me that gf menu.That said, they now have a legit GF menu!  Or at least have gluten free items clearly marked on the regular menu.  The only part not marked was the daily specials which need to be asked about.My boyfriend and I decided to split some appetizers and a salad which really seems to be the way to go here.  The Nicoise salad was good a fresh tasting but pretty bland.  We also had the salmon carpaccio (GF without the bread) which was pretty good -- the sauces were the best part.  The best thing we got was the roasted moedjool dates.  They're stuffed with chorizo sausage and wrapped in smoked bacon and they were the perfect balance of salty, smoky, sweet and savory.  Yummmmm!  My boyfriend and I each took a bite and decided we should have just ordered three plates of dates.  We almost came to blows over how to divide the third date into two equal portions.  We finished with some coffee, which was disappointing but we were in too good of a mood from the dates (seriously good!) to care too much.  There are only 3 espresso drinks on the menu but when we ordered (an espresso and a latte) our waitress said she was new at making them so we should tell her if she did them wrong.  She brought my latte and it was cold -- pretty sure she had just dumped espresso into cold milk.  When I mentioned this to her, she was apologetic and said that was exactly what she did.  She took it away but was back in about 90 seconds and I am 80% sure that she just microwaved my cup.  I guess the lesson is wait to get your coffee somewhere else and just get piles of dates."], ["Sarah R.", "I've only been to Mediterrano when someone else is paying, and I can say they do a nice job catering to large groups. It was a nice place to have a company Christmas party, and I think it'd be very nice for other large groups, such as a wedding rehearsal dinner.It's not cheap, but the atmosphere is lovely and the quality of the food is good, from the appetizers to the after-dinner coffee. For an appetizer, I can recommend their delicious spanakopita. It's flakey and flavorful. The hummus is also a step or two above the average supermarket hummus. It's savory and a bit lumpy (which I like), and it's served with seasoned pita chips.As for entrees, the butternut squash ravioli is a good value. I've paid more for less pasta that was lower in quality. At $13.95, you'll get a reasonable amount of flavorful ravioli in a cream sauce with carmelized onions and pecans. This was one of my favorites.The salmon ala grecque was also good. The fish is nicely done, and it comes with a relish that is reminiscent of salsa but with more of a Mediterranean twist. It's also served with lemon roasted potatoes on the side."], ["Vinit R.", "Good place for lunch... (and may be dinner too, but I haven't been here for dinner) ... their menu is very interesting and different... and they come up with varieties of hummus every now and then... I always get GRILLED LAMB SOUVLAKI which, obviously, is my most favorite... Unlike average Mediterranean restaurants, they have a lot of seafood entrees making them very unlike mediterranean... speaking of entrees, I would probably include a link to their menu as it fascinates me very much with 'different' foods...  mediterrano.com/menu .. do check it out !"]], "Brighton Bar and Grill": [["Valentina L.", "Carrot Cake like WHOA!"], ["Andrea M.", "Pleasantly SurprisedWhy you say? 1. Having never eaten in downtown Brighton I had no idea what to expect. 2. it having \"bar & grill\" in the name threw me off that it was more a bar and burger place perhaps. 3. It was a tad classier than expected. HOSTESS HIGH-5!Kudos to the VERY smart hostess who sat my date and I in a private space without us even hinting or asking.  She either thought we were going to talk business or have private adult chat.  Either way, BIG thanks to her intuitiveness. MENUThe menu had a great selection, be sure to turn it over since it's on BOTH sides.  We gave ourselves a chuckle when we discovered it was not just a one-sided menu.  In the end, there is a price point for dinner for everyone.  If you want some nice soup and salad, it's attainable.  You can have burgers like we did, or you can go full entree, which I intend to do next time I go there.  Yes, there will be a next time. I did love the burgers.  They were kind of perfectly done and the bun was very good without someone telling me it was from a place ending in \"ingermans\", thankfully. Great alternative to so many of the chain-restaurant catch-all places that serve lots of choices, but are so horrible you'd never want to eat any of it.  This is a straight up, American mix of menu choices.  Didn't have dessert, sorry- maybe next time!ATMOSPHEREThe decor is well-suited to a date, a business meeting, or a girl's night out as well.  The crowd was mixed in that some people were dressed up while others had jeans on. It was relatively relaxed and we had a good server who was very friendly and attentive in the right ways. I would agree with others who noted that this is a place not really for kids. I did see one family there, but honestly it is much more geared towards a business meeting or date, and if you bring a small child you might just annoy the current clientele who for the most part- do not bring kids here, at least for dinner [maybe lunch is a good family time option?].  (Just sayin' *wink*.)Overall- good food, good service, if you're in Brighton it's a must-stop-and-eat place. You won't be disappointed."], ["Kristine R.", "Phenom, phenom, phenom. Martini's are generously poured.  Mussel special app was not over saturated in sauce, could actually taste the muscles, perfection!  I had the mahi mahi and the flavor was out-of-this world. Each bite burst with flavor.  My husband had the salmon, which offered the same experience.  Tiramisu tasted homemade."], ["Bullwinkle R.", "Definitely one of Brighton's better places to eat."], ["Kraig S.", "Once might be an anomaly, twice is a trend.  After enjoying Brighton Bar & Grill many, many times over the years, I have been a loyal patron and enthusiastic supporter of BBG. Until now....stopping in recently for a lunch of their once good gumbo left me underwhelmed. What should be a layered, nuanced dish struck me more as a bland chowder. No roux, no spice and not a gumbo. Today my wife and I stopped on for lunch and had Cubano Sandwiches with were accompanied by \"addictive\" potato chips. Previously a very, very good sandwich today was a pile of meat haphazardly tossed onto soggy bread with chips which not only were not addictive, did not appear to be salted. On the plus side, our server was excellent. Very attentive and welcoming of our feedback of the meals shortcomings. We will come back but with two strikes and more and more options, we need to see a return to the good old days."], ["Mac H.", "We usually dine at Brighton Bar and Grill once or twice a month and are always impressed by the great service and the consistency of the food. It is great every time we dine here. My favorite dish is the Drunken Salmon which I highly recommend. All of the components of the dish are tasty and perfectly prepared. The bourbon glaze on the salmon is incredible and the stir fried veggies are delicious. Our server was Natalie and she is always great."], ["Mike M.", "We go here all the time. Great place!  Would highly recommend"], ["Jennifer S.", "I just went to BB&G for lunch the other day with my mother in law and my two year old son.  We had a great meal with great service!  I totally disagree that it says this place is not kid friendly...they had a kids menu...any place that has a kids menu is welcome to kids!As for food, my son got the mac and cheese off the kids menu which was really an adult size portion of mac and cheese.  He wasn't too interested in it, but it made great leftovers :).  I got the asian chicken salad.  I wasn't a fan of the dressing but honestly the chicken was pretty flavorful (even though it was a bit dry) and I didn't even really need the dressing.  My MIL got the spinach, tomato, mozzarella sandwich and also really liked it.  The portions were huge and we got several meals out of the leftovers which is always great.  Our service was also great.  Our waitress, Sue I think, was super attentive and really good with my son.  We'll definitely be back, it'll probably be our go-to neighborhood spot!"], ["Daniel W.", "I can't get enough of this place. It's super clean, I've even looked in the kitchen...spotless!  It's a great place for a romantic date, to catch up with family or have fun with friends. The menu has a nice variety, but the steaks are my favorite. Steaks are cooked properly, well seasoned and of high quality. The staff is always friendly and the owners or management makes their way around the restaurant in a natural and casual way. It's just a real enjoyable place to eat great food and is my favorite restaurant in Brighton.  The desserts are also crazy good."], ["N C.", "Hmmm.... I'll give it another chance in a few months"], ["Tom C.", "Very good restaurant.  Service is great.  The food is very good!  The menu has been the same for years it seems, starting to get a little tired of the same old choices."], ["Elizabeth K.", "When you live in Ann Arbor, the closest Costco is about 20 minutes away in Brighton. My husband and I slipped in right as it was about to close and we were already pretty hungry. If we'd had more time or been a little more desprate, dinner could have been the $1.50 hot dog special. But we were oh so glad things turned out differently. I remembered the BB+G from a former coworker who worked on some aspect of the design of the place. Knowing virtually nothing else about it, we decided to check it out since we assumed it had to have, at minimum, some beer and some food. Man, oh man, was our dinner the surprise of the year! First of all, the atmosphere is really nice, they strike a nice balance between it being a little casual with the TVs behind the bar and a little nice/romantic with cloth napkins, candles on the table and jazz playing. I got a nice glass of red and my husband got a local beer from Dark Horse. We ordered the chicken chopped salad and pot roast (from the aptly-named \"very comforting\" section of the menu). We casually mentioned to our server (who was also serving as the bartender - it was 9:00pm on a Monday) that we would be splitting the food. As I said, we were really hungry, and Gary had promised us hot rolls. Well, they must have baked them especially for us, since the rolls came out nice and hot along with the rest of the food - already split into two beautifully portioned plates, each. And can I just say - daaayyum - the kitchen must be super professionally run, because every mouthful was truly fantastic. The salad was delicious, everything in there perfectly fresh and well-balanced, the dressing homemade. The pot roast was out of this world - moist, tender, and bathed in the most delicious gravy. It came with a side of freshly sauteed veggies and delicious homemade mashed potatoes. Too bad we didn't have room for dessert, because the offerings sounded great. Why can't there be a Brighton Bar and Grill in Ann Arbor????May I suggest to the owners that you open one here right away!My only complaint - the delicious hot rolls came with whipped margarine. I'd take real butter any day.We'll be back!"], ["Ed D.", "This is one of our go to places the food is excellent we especially like the black and blue salad the meat is unbelievable tender and seasoned perfect everything we have tried has been very good even the hamburger the service is always good and the atmosphere friendly and welcoming"], ["S J.", "The decor is nice, service is good, but the food is mediocre and a bit overpriced."], ["Billy M.", "Recently went here on a trip back to Ann Arbor to visit family and absolutely loved it! We decided to splurge and have dessert and we were glad that we did. I had the tiramisu and my wife tried the Berry Crisp, both were incredible!! This is going to be a new must stop for us anytime we are home just so we can try more of their amazing desserts. Keep up the good work!"], ["S F.", "We came here due to the reviews here on Yelp and our fellow Yelpers have failed us!  We are still searching for \"that spot\" here in Brighton since we've moved here but every place so far has failed us...We came during a festival day...on Sunday, so this place was somewhat busy. I ordered a soup and got something different from what i ordered and was told that it was switched up during the day. A nonchalant apology was given by the manager and the soup was taken off our bill at least.  The chicken chowder (instead of the clam chowder I ordered) was okay...a bit salty and watery.  The French onion soup was salty as well and mediocre in taste.  Everything else was meh and not worth the prices they were asking for the food.  I had a salmon salad that was okay...expected better looking lettuce for the $14 price...not somewhat browned chopped romaine I was served. In all fairness, my DH's chicken sandwich was tasty, but was arguably pink...I'm possibly being unfair with my 2 star review, but for the prices, not sure why this place is always packed...perhaps my expectations were too high and this pissed me off... If you care about good food, skip this place..."], ["Patrick W.", "Absolutely fantastic flat bread appetizer, great service, and the Mac and Cheese was superb. Great spot in Brighton!"], ["Holly K.", "This place has been here forever for a reason ...good inventive food.   Calamari is always wonderful, great lunch specials, great in quality atmosphere and service but not so much in price...always spend a bit more that I think I should here, but not grossly overpriced...very consistent and always really good"], ["Joanne P.", "We eat here rarely only to meet friends in the area. Food is average and very few options for vegetarians/vegans. Just a few options would be so nice."], ["Leslie B.", "We had a great birthday dinner at BB&G the only disappointing thing was that we were never brought out any bread. The dinner was great but would have been better with the hot bread. Our server seemed a little less than attentive."]], "HopCat": [["Brian J.", "I heard many great things about this place so I knew I had to give it a try. I went on a Thursday night and the wait was relatively short. They have a huge collection of beers to try  and their food is very good. You must try the crack fries! It's a salty/peppery/garlicy seasoning that is quite addictive (hence the name). One caveat I have is the service, the two times I went, I had rude waitresses who were very impatient and seemed annoyed when we were not ready to order.Aside from the service, the food tastes good, they have lots of beers, and the ambiance is great!"], ["Kathy T.", "You have not had a taste of Ann Arbor until you have eaten Crack Fries from HopCat! They are so delicious my friends and I could not stop! The service is fast-paced and high-energy, almost every worker had a smile on their face, and every table surrounding me was full of laughter and a comfortable atmosphere! I brought my husband here a few nights ago and he loved it as well! I'm so glad HopCat came to Ann Arbor!!"], ["Stef G.", "Great beer selection! I didn't have any food but they've got over 50 beers available from various craft brewers domestic and imported. Nice pub vibe but very clean and welcoming. Friendly and attentive staff."], ["M K.", "Super fun place, even with a young kid (kids can go up to 9pm I think). I like that we can always find a table and it feels spacious. The wait-staff makes great recommendations for those who don't know too much about beer. Wonderful selection for my taste. Plus the food is incredible! I don't usually expect much from the food at a bar but they do an excellent job. Of course the fries are amazing, but even simple things like the quesadilla is unique and delicious. I love going here!"], ["William W.", "Not as good as other locations. The waiting area is very small and the front door gets congested super quick as it is a single door. The step up upon entering is a trip hazard and not marked with yellow paint. The food was as good and the FRIES FRIES FRIES you must order. The service was decent, but not amazing. The menu is also really large and confusing as beer and food look exactly the same with not much distinction. The servers always recommend the expensive beers which is somewhat off-putting."], ["Matthew S.", "Great beer selection and delicious food. A popular food item are the crack fries, and they live up to the title. Beers are served in different glassware depending on style.Be advised when ordering an appetizer because it may arrive at the same time as your meal, I guess there's some kind of glitch in their tickets that make it a hit or miss. They were good to knock it off my bill because of the inconvenience."], ["Kyle K.", "Came in for a quick bite while waiting for some friends, and it was a great choice. It's a laid-back atmosphere with some good food, but an even better beer menu. Best I've seen in a while in fact. Music isn't too bad but it's a solid place to grab a beer and some delicious chicken tacos."], ["Scott M.", "Great beer selection.  They also have a very nice selection of food.  Can get a little crazy on the weekends at night, but is very chill most other times.  Seating is very open and there is a lot of it.  They focus on the local brews which is really nice."], ["Linnea B.", "Waited in line for 3 hours at 7:45am and it was worth it to get free crack fries for a year. This place has amazing craft beers, a fantastic atmosphere, and friendly service. Although I wouldn't go on a first date, cause you will eat as many fries as humanly possible. They are truly crackalicious. And try the CBS or KBS beers if available!"], ["Ray S.", "My first visit to Hop Cat was one of disappointment.  The beer and overall environment was outstanding.  Tons of potential to be a great place to go \"before the show\" and such.  My problem is this, Ann Arbor has many brew pups and micro brew specialists that anyone new to the market must prove themselves.  Starting with outstanding food would be a great place.  I ordered the Cowboy Burger, which on paper sounded simply amazing.  I asked my waiter very specifically to make sure my burger was cooked medium.  I even told him when ordering that I do not like burgers well done.  Unfortunately it was served well done, and very tasteless.  I ate 1/4 of the burger before calling it quits.  Rightfully, I was not charged for the burger.So my first impression was a bad one in the food category.   Again, the overall environment was excellent, and beer selection quite dreamy.   I'll give them another try some other day, but for now, I'm not rushing to get back there anytime soon."], ["Andrea W.", "This gets 4 stars for sure b/c of vegetarian options!  Thanks for joining the 21st C!!  The selection of beer is outstanding, however, as a newbie to understanding beer, it would be nice if there were a tad more descriptors under each offering.  But I flew by the seat of my pants and was not disappointed.  The food menu is definitely varied, but a note of caution, our waiter was charming as ever, but not sure if he was suffering from what I now term millenial deafness due to persistent use of earplugs, as the music was not loud at all inside, but he mucked up my order.  Not sure how \"black bean burGER with munster\" comes out sounding like burrito, but oh well, the burrito was yummy as well.  As for the crack fries, I have a sneaking suspicion they use Lawrey's season salt on them.  Just my .02."], ["Billy L.", "I was excited for the opening of HopCat in Ann Arbor after hearing so much about the other locations, which for the most part are out of range for a trip.The selection of beers is a bit overwhelming. I did some research on their website before going, but when I got there, I was like a kid in a candy store and that went out the window.The beers I had were good, but I won't review them since that's better left to a site for beer reviews. There's something for everybody on their menu.I had pretzel nugzz and pizza rolls as an appetizer, and they weren't too bad. Maybe a little expensive for what you get, but that's typical of just about any appetizer. My burger, however, was disappointing. I had a classic with cheese, and it was nothing to write home about. The crack fries are what they really champion here for snacks, and I found those to be no better than fries that I've had at other establishments. Also nothing to write home about.The place is too cramped... if you don't appreciate being right on top of the people at the next table over and having to move every time a waitress comes through, you might want to avoid HopCat, especially at busy times.Another thing I like is that after putting in your name for a table, they'll text you when it's available. You don't have to sit there in their lobby or wait outside. That was a nice touch."], ["Jen Z.", "The quality of service is higher than most places in Ann Arbor, including $$$ restaurants!  Also: delish food, multiple tvs, fun decor, and super-comfy booths.  Love it!I've been here two times with very different groups of friends (one group was quiet, the other was rowdy), and I had the same waiter both times.  He meshed well with the energy of both groups!  He was really helpful and patient with a couple friends who needed beer recommendations."], ["Anansa T.", "It was my first time visiting Ann Arbor, so a friend suggested we visit HopCat since he said it was \"new, always crowded, and had a wild beer selection.\" The HopCat did not disappoint. I am fairly new to the beer scene and literally hate every beer I try. Not at the HopCat! They have beer even I thoroughly enjoyed. Our service was wonderful and so was our waiter.If you're not into beer, then that's no problem because the food didn't disappoint either. I had two servings of the Loaded Crack Fries which were absolutely delicious. My boyfriend had the Uber Burger, which he has not stopped talking about. My friend did not enjoy his meal but alerted the waiter who removed it from his bill.Overall, the beer and food selection is extensive enough to satisfy even the pickiest of eaters (and drinkers!) The service was great, albeit we went during the early afternoon on a Thursday. I will definitely be returning when I am in town again."], ["Suzanne P.", "Sure the beer selection is great but the food is pretty bad by Ann Arbor pub food standards. You can't call them crack fries when you are less than a mile from jolly pumpkins' truffle fries."], ["Victor T.", "I guess what you should take away from the other reviews is: Don't go opening week.I did and felt the same as many others, it was overcrowded and the wait was one I would usually give up on.  The texting when your table is ready still has some bugs to work out.  Check it out for lunch, the place is almost empty.I've been a couple of times since then and have found the staff to be wonderful. Both the servers and the bartenders have been accommodating, knowledgeable and even funny.I'm still not sold on the food.  The crack fries (their signature offering) would be worth it if you got them free for a year but I've had better (i.e. Jolly Pumpkin and The Last Word).  So far my favorite dish is the Mac and Cheese.  One of the really good deals is the $2 five and a half ounce pours of the beers on the local 30 list.  I'm working my through it  5.5 oz. at a  time."], ["Yaniv S.", "Beers on tap were great! Fantastic selection. The food was mediocre at best. We had fish and chips and the cowboy burger. Fish was fresh but very batter heavy. The fries, which are supposed to be a house specialty, were super salty and peppery. The burger was passable, but nothing special. If not for the beer selection, this place doesn't even get three stars."], ["Nick W.", "If your time is valuable don't stop here!  It took nearly ten minutes for anyone to acknowledge me sitting at the bar.  Then when I finally got menus it took another ten minutes to come back and get a beer order... Low and behold the beer I ordered the keg had to be changed. Had I realized it would take 15 min to change a keg I would have ordered something else. So more than 30 min after sitting there I finally got a beer. They do have lots of selections so if craft beer is your thing this is a good place. Had a burger it was ok... Way over priced the fries are delicious though!  Now I'm sitting here food gone beer empty for over 15 min just wanting to cash out and go because I've been here 1.5 hours!!!!  Definitely not coming back any time soon!"], ["Evan H.", "Really solid place for beer and burgers.  The crack fries are very tasty. Not a place to go if you are looking for healthy stuff.  Great portions! The food is a bit salty and messy. Happy hour special is great... beer and burger for a great decent price... i think is was 7 bucks."], ["Jim P.", "Came for the free crack fries that everyone writes about.  They are good - BUT - the Burgers are the BOMB.  Got the cowboy burger - bit into it - it was delicious - and HOT.  I even mentioned to our waitress that the burger was HOT - she thought I was complaining - I said no - it is SO GOOD i had to mention it.  Almost all Ann Arbor area restaurants sell lukewarm burgers - they sit too long cooked waiting to be delivered - but not HopCat.  This place needs to be on top of anyones list for burgers.  The meat was juicy, flavorful and just plain WOW - Great job HopCat!"]], "Bar Louie": [["Shelby A.", "I've been coming to this place for a long time and never have I experienced anything less than a fantastic time. They have great live music, the atmosphere here is upbeat, the outdoor seating is comfortable. The waiters and waitresses know the menu very well, the management is on top of things and the customer is the most important person every time. You can't have a bad experience here. I don't think it's possible at all.Try the chicken nachos - seriously some of the best nachos I've had in a long time. Perfect combo."], ["Nicole S.", "We ended up at Bar Louie this weekend when we took a bus to Ann Arbor for the Michigan vs. Michigan State game.  The people who organized the bus suggested we go here since they would pick us up at this bar.  However, be warned that it's not a sports bar (I had never been to a Bar Louie location in my life).  There's not that many TVs, so it's hard to find a lot of seats with a good view.Anyway, I'm not knocking them stars on this, just a fair warning to anyone who might be looking for a place to watch a game.  However, if you are a bar with TVs in a college town, you should expect for people to come in to watch a game.  They were not prepared in the least bit.  For the entire bar, there were 4 servers and 3 bartenders.  Before the game it wasn't too terrible, just a little slow.  But once the game started and the entire place was packed, all hell broke loose in this place.We ordered drinks that never came.  We sat there for 45 minutes before I finally flagged down another server who sent ours over since we hadn't seen her since we ordered the drinks.  When she came over she was empty handed and told us that she put our drink orders in right when we ordered them and that she had 40 drink orders that still haven't come up.  FORTY?  I know it's not her fault, and I'm not rating for her service because she was doing the best she could.  But seriously.  No one should have to wait an hour for a drink because the bartenders are that slammed that they can't turn them around.  The bar is losing money at that point because I probably could have drank another beer in the time I waited.The worst part of the experience - right before halftime, every single toilet in the restaurant overflowed.  So for the rest of the game, every person had to use the urinals in the men's room in order to go to the bathroom.  Or hold it for 2 hours.  I really thought that maybe this place was brand new and they just weren't prepared for a big game day since they haven't had one yet.  But there are reviews since 2009 for this place.  Clearly there have been dozens of huge games that likely attracted a big crowd here.  They needed to be more prepared because the experience was terrible, and I don't know how they thought that four servers and three bartenders would be enough staff for how big this place is.I gave two stars because the server did try her best and wasn't flustered even in this ridiculous storm.  Also, we all ate before the game (thankfully because I heard the kitchen was obviously backed up as well), and the food was pretty decent."], ["Alex K.", "Pretty awful place. Went here during the Ann Arbor Art Fair a few weeks ago to avoid a storm that was supposedly going to hit. The place was packed -- we were lucky enough to find a table and get some drink orders in. We got water right away, which was served in dirty glasses... floaters galore! The waiter quickly brought back some new waters, but they should have never been that disgusting in the first place.After 15-20 minutes, we finally got our drink orders, and thankfully we didn't order food. People who were there before us got their food as we were leaving 80-or-so minutes later. Yes, the place was packed, but that's all pretty inexcusable... couple that with the fact that the drinks were a bit more expensive than they ought to have been.I've avoided Bar Louie for years, and after that visit, I could see why. While some of the food sounded good, there was no way we were ordering any when they were that busy. Oh well, maybe next time."], ["James L.", "SETTING:Cool place to hangout with friends. Outside dining area right in front of restaurant. Inside dining area as well. Can't make up your mind? There is a hybrid spot: inside area with ceiling covering (but open on the sides). If you can't find a place to sit down, you are probably too picky!FOOD:Dollar burger Tuesday? Seemed too good to be true, but I'm always game for great deals. I went in with the mindset that I would end up with having spent more than $1. I was correct...and add $14 to it. Not worth the deal in my opinion. The burger was only cooked one way--just like what Mom told me after I got an A on an exam: \"well done\". Because of this, the burger was on the drier side and quite lacking in taste.  Just to break it down for you all so there are no cost surprises, let's go through my order. First reason why it turned out to be $14 was because you must order a drink for the $1 burger. A beer costs about $7.50. Then, of course, the more \"add-on's\" on the burger the higher the price. Each item is about 50 cents. If you want cheese, grilled onions, tomatoes, a sauce that sets you at $2 more. The burger was the size of your typical McDonald's burger (aka small), so we shared some tots (~$4.25). And just like that, $1 burger no more :(SERVICE:Waiter did come by to check in on us a few times, but he just didn't seem to be having a great time. He didn't smile at all! Maybe he was having a rough day, but I felt it rubbed off, and it just made the service a bit of a debbie downer.IMPRESSIONS:Don't think I will be back. If the burger could be cooked to your liking (ie: medium well), I think that would have made a big difference in taste. Honestly the add-on's aren't expensive, and although I got a beer, I'm sure pop would be cheaper. So, really, there are ways to make it less expensive. Unfortunately, the burger just was not tasty. It was also small in size. This is why I had to get tots--I was still hungry!"], ["Karissa K.", "I've come here a few times, usually when my parents are in town. The atmosphere is rather dark and dim in the evening, but in a cozy and comfortable way. The food is really good as well - I have yet to be disappointed. They have indoor and outdoor seating, though it can get busy during the weekend, so if you can avoid the rushes."], ["Christina C.", "Come for Happy Hour! Most of the appetizers are 1/2 off. My three friends and I ordered Bruschetta, Spinach Artichoke Dip, Buffalo Wings, Cheese Quesadilla, and a non-appetizer (Bacon Egg Sandwich) and it came out to $10 each, which is awesome.I came on a Friday around 5:30pm. I didn't care for the live music... They were odd. I couldn't hear myself talk, so my friends and I didn't end up talking to each other, which was unfortunate. Our waiter was super empathetic in regards to the crappy music, so we were grateful for that."], ["Jenn H.", "Hanging out with friends here for finger food & drinks. We sat outside as the evening was nice. Great atmosphere & our waitress was attentive. We had the nachos & it was a great complement for our drinks."], ["Kevin T.", "Stopped in for their late nite menu, but stayed for the great music of ...Nibbled on some pot stickerd. Nice presentation,  tasty...but way too sweet with the glaze.  Kind of hungered for something salmon, so picked the Chop Chop salad with the optional salmon filet on top. A nice plus is when tbe waitress asks \"how well do yoi want your salmon cooked?\". Medium.I ordered the chop chop minus the sweet vinaigrette it comes tossed in. Unfortunately,  it arrived swimming in the sauce.  Well, at least the salmon was good spared,  so just skipped the greens.Lots of other eating choices here close by, but Louie's 1/2 off Happy Hour appetizers somewhat attractive and there's usually a decent beer special."], ["Amy G.", "Even though some people feel cheated that the \"$1 burger\" on Tuesdays includes just the patty, bun, and lettuce and all other toppings are extra, it is still a really cheap meal, especially if you don't order alcohol or sides. In any case, it's a discounted deal! I'm not sure how the seating works regularly, but on Tuesdays it is super casual: just seat yourself and a waitress will come by. In fact, I don't think we were addressed more than once by the same waitress, as different workers will walk by and ask if you've ordered or if you need anything. I got the portobello burger with additional toppings of tomato, grilled onions, and guacamole. Carbs are my favorite and the bun was soft, warm and possibly buttered for bonus tastiness. We also shared a side of fries for $4. I liked their fries a lot, I don't know if they pre-season them, but they seemed to be extra crispy and delicious. I want to try their tater tots in the future. Their drink menu is a bit curious in that there are only names of beers, no prices or descriptions, but we asked and the beers are $4-6 which is kind of pricey so we passed on that. All in all, $10 for a filling dinner for two people is a win. It was comfortable dining outside on a warm summery night and I would come again while the weather is nice!"], ["Johanna M.", "My friends and I met up here for a buddy's bachelor party. I have never been to this restaurant, but it appears to be part of a chain. Either way, we visited this spot on a late Friday night and it was Latin night. Who knew? Not any of my white friends...hahaha.  It was pretty funny.  I was having a grand old time, but we eventually left as the boys wanted to smoke cigars and get drinks elsewhere.The vibe was alright. There lots of people there dancing and having a great time. If I lived in Michigan, I might visit this place for Latin night. The drinks were fairly priced and there was plenty of seating for people watching. It was an okay bar. Nothing special, but I'm not sure how it rates next to other Michigan bars. This isn't a college dive bar, or what you think of when you visit Michigan. Either way, it was just alright. I'd say come on over if you want to try some sangria and beer to start your evening. I wouldn't stay here all night. Both were pretty good. We didn't get any food because we went really late at night."], ["Tony R.", "I'm going to echo many of the other reviewers here. They have a huge \"service\" problem. I met some friends here on a Tuesday night. I arrived about 30 minutes late and one friend was still waiting on his drink that he ordered when they first arrived. We talked for about 10 minutes before our server finally came back to the table to take my order. I decided to order something quick, a chicken sandwich and fries, because I felt anything else I'd probably have to ask for a to go box. My meal came rather quickly, delivered by someone other than our server of course. My other friend asked for a to go box and it took 20 minutes for that to ever arrive. However, he was very quick to come collect our check jackets, both once we put our cards in and after we signed - go figure!  In all, no matter how good the food may be, bad service can ruin an experience and your perception of a place. I won't rush back here anytime soon."], ["Laura C.", "I like Bar Louie a lot, especially since I am from Chicago and enjoyed their branches there.  They have a tasty pita/hummus/cucumber app that is really yummy and healthy.  Another really important part of this place is that they always have Blue Moon, which is far from a given in most restaurants in Ann Arbor.  We went on Tuesday $1 burger nights a few weeks ago, and it was a good deal, especially if you don't mind plain food (every extra little thing, including mayo costs extra) or paying more for it.  The cool thing is that you can get a $1 turkey burger, black bean burger, or CHCKEN breast!  Surprise!  All for $1??!  Great deal!  You can pay extra for a side order of fries or their excellent tater tots!They also have a huge patio, which is a huge plus in good weather!"], ["Alan S.", "This is probably one of those hit-or-miss bars that can be found in any college town.  I went with a large group and since they all hit the bar at the same time, they all had slow service.  Also since they all had IDs from different states and countries it seemed to take the bar tender forever to decide if they were legit or not.  Ah well...I don't know how expensive the drinks are since I didn't pay for my own and they don't put prices in the menu.  Which is something that bugs me.  There was a live cover band who seemed to be playing lots of slower depressing songs, not really want people want on a Saturday night.  And they were playing WAY to loud.  Despite being on the other side of the bar we had to yell to talk to each other.I wouldn't waste my time going here again, but it wasn't horrible."], ["Patrick O.", "Would have liked to add more stars but the waitstaff/waitress let me down. During the entire meal, never asked how we were doing, but asked the single gentleman behind us three times. Empty beer glass at the edge of the table was ignored by three different wait staff including our waitress. Now on the other hand, the food was perfect! Great beer selection."], ["Jola B.", "Went out for happy hour with some grad students yesterday evening. We reserved a couple tables from 4-6. Good happy hour prices on beer, wine, martinis (!) and select appetizers. I'm from Cali so the quesadilla ($3.62) and guacamole was just okay to me. But I'm a cocktail girl and I enjoyed their martinis. I had the Tickled Pink ($5.25) and the Smores ($5.25) The tickled pink was good and the Smores was *delicious.* Interesting crowd - students, professionals and older folks. But I had a good time and will definitely be coming back. I hear they do pretty legit salsa dancing too."], ["Ari G.", "Atmosphere and food is very \"American Fare'. Absolutely great staff. Caitlin has been our server a few times now and she is a total rockstar!"], ["Juliana M.", "Service is absolutely abysmal. Took 30 minutes to get the wrong drink, another 15 to replace it. Another hour to get burgers to the table with the wrong toppings.I've been here almost every week this semester, and the service has been consistently horrible.Drinks are overpriced for what the place is. I don't recommend coming here if it isn't happy hour. Menu doesn't even have drink prices listed, and server gets annoyed when you ask."], ["Andrea F.", "Service is mediocre. Food is excellent. Beer list is great...but $10 for a tiny sangria that barely has any alcohol in it NO THANKS"], ["Susan S.", "Overpriced, in my opinion. 11.95 for a sandwich? Not sure how college kids can afford that. happy hour half off flat breads (orig. $11.95) were decent, had I paid full price I would have been disappointed, might I mention the fLatbread is crisp, pizza style, not sandwich style like I expected.. Not much of a personal experience, considering the bar was packed on a Tuesday. Our server was polite when she had time but I dealt with like three people sitting at the bar, customer service whiplash, who am I leaving the tip for? I'm Assuming they split.. On the bright side, I was impressed with the draft selection, the chalkboard art was really awesome. The atmosphere was modern and nice. I'm rating four, generously. I was not blown away by my visit. More than likely wouldn't return although Info not regret stopping in, simply because the town has so much more to offer."], ["Naveen N.", "Relatively expensive for Ann Arbor.  Drinks and food weren't particularly better than any other place you could go to eat at.  Likely won't be back."]], "Guy Hollerin's": [], "Aventura": [["Shannon T.", "This is my favorite tapas restaurant in AA. They have unique, delicious Spanish-style tapas, amazing cocktails and sangria, as well as a great brunch option on weekends. Any of the cheese options makes for a great starter. The patatas (fries with an over easy egg) are perfect if you want some grease. The menu changes a bit, but the various seafood and vegetable tapas are always on point. Servers are adept at giving recommendations should you need them. As for drinks, I would go for their house made tonics with gin, a custom bourbon/whiskey creation, or red sangria. Never had dessert, but they sure look good :)"], ["Kate W.", "THE SERVICE HERE IS AWFUL!! I went to dinner here with my boyfriend tonight and not only were our main dishes extremely late in coming out, mine never came out at all. Had the waiter come to check on us even once he would have known that my meal never made it to the table. Once the waiter became aware of this situation he offered to take my dish off the bill. Like you're doing me a favor by taking the dish off the bill that I NEVER GOT?! Then, we asked to speak to a manager to settle the bill. The manager offered to take off a measly 25% and offered me a gift card to come back and try the dish that I never received. No, we don't want a gift card for $10 to come back, we want you to TRY and salvage our awful experience that we are having NOW.  To no avail, we ended up having to pay nearly $40 for a meal that was ruined in every way. We even explained to the manager that it would be in good service to settle our bill.  She would not budge and patronizingly said \"I'm sorry you feel that way\". For a restaurant that offers expensive prices and small plates, service is everything. I would highly recommend staying away from this place.  You can do better."], ["Kosta S.", "The service here is always pretty good.  So are the drinks and the churros.  However, most recently, the rest of the food took a turn for the worse.  I've been here a few times this past year and always had a great experience.  The last time I was here a couple weeks ago it was obvious from the get go that the kitchen has stopped paying attention.  The first indication was the fennel salad, which was made with very old fennel and was inedible. When we sent it back the server let us know that the chef had changed. Everything else we ordered was also prepared weirdly and without finesse. There seemed to be a scoop of flavorless goat cheese on everything, regardless of whether it belonged there. Once a staple restaurant for us, I don't think we will be back any time soon."], ["Kathy P.", "This place is really cool.  Their fenced in patio in the back (where we sat) is picturesque.  What I could see of the inside seating of the restaurant is also nice.  The hostesses were friendly and accommodating, and our server was helpful in explaining the menu.  My boyfriend still talks about this as being one of his favorite meals.  I really enjoyed it, too, but as someone who's had great authentic Spanish food, I was a little less sold on the not-so-authentic takes on some of the dishes.  Good nonetheless!"], ["Duong V.", "I was excited to eat here for Restaurant Week because of the raving reviews, but it fell short of my expectations. First off, the lighting was so dim it was hard to see what was served in front of me. The atmosphere was nice for the bar, but for fine dining it wasn't my cup of tea. To be honest the food was not all that great, I paid $30 for myself and another $40 for my girlfriend with tip. For what I paid, the food was not worth it. I don't know if it's just me, but I just did not like the cold appetizers that were served. The Esqueixada de Bacalao was undercooked cod on a little piece of bread with bell peppers. It was disgusting and very fishy. As for the rest of the course, I was just not satisfied with any of it. Maybe the food at this restaurant is not for my taste, but it was just a bad experience. The only thing that was good was the water I was drinking and the Croqueta de Manchego... The churros were okay, but they were a little too soft for me. I really wished the food tasted better, but maybe the food tastes better tipsy or drunk lol"], ["Alexandra S.", "As someone who eats out nearly every singe meal (guilty as charged, no judgment zone here!) I have to honestly say that Aventura is my favorite restaurant in Ann Arbor. Let me first start out by mentioning the atmosphere. Easily the most beautiful and visually pleasing restaurant in Ann Arbor, every single aspect of the restaurant, architecture wise, is impeccable. You are temporarily taken out of the Midwest and teleported to hip New York City or even maybe the heart of beautiful Barcelona. From the gorgeous tile, to the unique artwork, to the detailed ceilings, to the slick bar, and to the the exposed brick archways that surround the restaurant, this place will have you \"ooh-Ing and ahh-ing\" from the moment you walk through the double doors. Now onto the food. This is one of those restaurants that you could go to 50 times in a row and STILL never have the same meal twice. With a large menu primarily made up of tapas, paella, cheeses, salads, soups, and cocas (Spanish style pizzas.....oh my god), your options are seriously limitless. The best Brussels sprouts I have ever had served warm with Granny Smith apples, pistachios, creme fraiche and drizzled with honey makes me feel like I'm in heaven. Please also try the cannellini beans and of course the bacon wrapped dates!! (A MUST) to name only a few!Onto the bar. The gorgeous and spacious bar makes it comfortable to not only drink and socialize but also have a full on meal in case the restaurant is too busy to get a table and if you are like me many of the times, and are reservation-less., All of the bartenders are incredibly knowledgeable and so very friendly that you could stay there for hours. One of the bartenders last names is SWEETS. Are you kidding me? Too good to be true. (p.s. Please try one of their many popular gin and tonics (raspberry and lime is my go to!) and of course the red sangria.) Safe to say I could easily talk about this place for hours. I love every second of my time there and would recommend Aventura to every single person. Best restaurant in town!"], ["Ana N.", "I've been here at least ten times and aventuras never disappoints - prefer dinner and drinks at the bar to brunch but still delicious and good service. Get the sangria and the Patatas Bravas is standout!"], ["Ceal P.", "4 solid stars for brunch!Came here as party of a baby shower for brunch, held in the wine cellar room.  Very nice restaurant and the cellar room is right off the kitchen and a very lovely space for a private event.  The service was great!The food was remarkably fresh made to order, even though our party was 20 ladies deep!  I was very impressed.  Potatos bravas were great, perfect original spanish flavors.  Also tried the flatbread with truffle oil, mushrooms and arugula, all very delicious.  Would def want to come back to try dinner!  Lovely space for a private party in the cellar room."], ["Naz M.", "This place seems to be the talk of the town, where the chic and trendy spend their weekdays and the classy and fashionable spend their weekend nights for dinner. I was a part of the latter group, enjoying a nice dinner for a friend's birthday. Because there were more than 10 of us, we were seated, along with another group downstairs, by the kitchen and where the wines were kept. I was worried we would be forgotten down there, but Amos, our server who shares the name with one of my fave uncles made sure to NOT allow us the feeling of loneliness. We started with some wine, I had the red because I was feeling brave and knew that THIS time I was going to stay awake, (I did). Shortly after we proceeded to the tapas, which is why I had to give at least 3 stars, because they were delicious. Innovative, great portions of not too much, but definitely not TOO little and priced JUST right. Between the hubs and I, we split Croquetas de pollo, Albondigas, something that resembled Flautas, all equally delicious.The same cannot be said for the Paella del Mar. I had the great fortune of being from a town with a significant Iberian population, and with them came their delicious food and variety of tastes given whatever provinces they were from. So when it comes to paella, I have pretty high standards. Keep in mind there are two other kinds that I am not opposed to trying them either, as I am so homesick and miss this kind of food.Also, I have yet to truly get a feel for the upstairs - I just saw what resembled a restaurant in Midtown with well dressed folks, trendy music, mood lighting - definitely a place where the cool kids play. I am willing to give another go, possibly having more luck with the Paella del Jueves and the upstairs ambiance will give me a more favorable view of this gem with great potential.UPDATE: So I went BACK, on a not so busy night for happy hour and had what seemed to be a never-ending glass of sangria and some croquetas de jamon, delicious AS USUAL - I love their Croquetas. I made the mistake of ordering the Costillas de Res y Papas. It was so salty, I could feel my blood pressure going up, but Saúl was quick to make it all better. By far my favorite person there, he quickly took it back, cleared it off the bill and offered me other options. I got my old reliable Albóndigas and sat at the bar as happy as a clam. The ambiance upstairs is nice, the decor, GREAT. You had the fresh cut fruit RIGHT IN FRONT OF YOU, just waiting to soak in the wine and offer its infusion once you are done with the liquid. Needless to say the sangria was DELICIOUS and I like it a little better now."], ["Cristina A.", "My boyfriend and I came here for our anniversary. The drinks were incredible! Great service and excellent food. Saul was very friendly, knowledgable and went above and beyond to make sure we enjoyed our experience. I would definitely come back again!"], ["Shweta A.", "Great tapas place in Ann Arbor! The staff here are very friendly and great! Try the patatas bravas! Their red sangria is good and they have outdoor seating in the summer. Also if Saul is working, ask for the \"Alexa!\""], ["Jessica R.", "Aventura is beautiful--brick walls, open spaces, immaculate tiling, and warmth (some plush seats, a cheese station, etc.). I could barely recognize the space from its Mahek days.We were seated by the kitchen, which contributed to a flurriness that was both exciting and grating. The staff was constantly going in and out, often stopping to ask how our food/service/evening was. We felt SO well attended to, and everyone seemed genuine. But I've never seen so much back-and-forth. I wonder if the small plates play into that? Perhaps there are more plates going out per table, so there's more back-and-forth. We were also seated next to the eight-person table. One party was finishing their meal during the first half of ours, another party sat down to start their meal as we ate our second half. Groups this larger are very loud, so between the groups and the buzzing kitchen, we had to yell-talk the whole meal. I ended up with a headache, something I get maybe once a year. So sit elsewhere in the restaurant!The menu has lots of sections with prices ranging from $2 for a one-bit snack, to $14 for 3 lamb sliders, to $45 for a huge paella. We got a little of everything.To start, the pintxos. These are the one-bite snacks. More like four or five bites, but definitely meant for one person. We had the short rib (SOLOMILLO Y CREMA), cheese and peppers (PIMIENTOS ROJOS), and cheese and pineapple (ALMENDRAS Y PIÑA). The last was my favorite, and they were all fine. When I think about spending $4 on four bites of pineapple and cheese it doesn't feel great, but when you're there, in the restaurant, I guess it makes sense?Next was the coca, explained on the menu as cake or bread? I'm not sure because while we ordered one (MAHÓN Y MIEL), we realized--upon driving away, of course--that we never got it! And we definitely paid for it.We were surprised to see the tuna salad (ENSALADA RUSA) come out as a creamy salad. Each bite had texture--the chopped pieces were crunchy and the tuna was soft. I was initially put off by this not being a \"salad\" (as in lettuce), but it grew on me.One of my favorite parts of Aventura was the cheese and meat plate! You order per cheese and meat, and they make you a board. We got three cheeses: MAHÓN (very innocuous, served with a thick guava paste), VALDEÓN (absolutely delicious, drizzled with honey), and CABRALES (super strong, served with pickled figs--I loved it, my fiance didn't). We also got the CHORIZO DE ESPAÑA from the charcuterie side, and it was fine. Again, when I think of the prices per portion here, it doesn't feel great, but in the context of the restaurant I guess it made sense. I guess.Finally, we got four tapas: DÁTILES CON CHORIZO (4 dates wrapped in bacon. A bit too cooked to taste much of anything, but a good texture), ALBÓNDIGAS (6 lamb meatballs. Immensely pleasant at first--very soft and creamy--but we later talked about how a browned and crisped outside would have been much better), CANELÓN DE ESPINACAS (3 cannelloni filled with creamed spinach. These were soft and hot; that was my main impression.), and HAMBURGUESA DE CORDERO (3 little lamb burgers. Pleasant.). Also dessert! We went for the spiced cake. This arrived plated boldly, and was interesting to eat. It's filled with something hard--almonds?--and has this glossy chocolatey outside. There is a little bit of heat to it, but I do mean a LITTLE. The first few bites were fascinating, then I kind of forgot I was eating it! Eek!We did not get drinks. The total (w/ tax and tip) was a little over $100.Going to pay, we used a gift card. There was some confusion--through no fault of the restaurant--and I want to mention this because we thought they handled this well--patiently and compassionately.IN SUM. The food came out one plate after another, and I really liked that aspect of the meal. It felt like a nonstop feast with different tastes. Ultimately, though, the food was low on just that--taste. Leaving, that was our main feeling. The building was nice, the service was sweet, but the food was just okay. We've both said that we don't know if we'll want to come back again. And that seems like a shame!What could solve this? More flavor. The food LOOKS so flavorful, but then doesn't pack much punch. The bacon-wrapped dates, for example, sit in this beautiful orange sauce. We ate the sauce by itself and actually couldn't discern ANY taste. Other dishes had some flavor, but not much... like those lamb meatballs that stood out because of their texture (as I wrote: \"very soft and creamy\"), but didn't taste like much. Having been to Spain and having explored different food scenes there, I was surprised by the dullness. I trust they'll find their groove with the flavor level."], ["Yaakov H.", "The best brunch in town! Get the shrimp and polenta bowl! Everything is really great, but skip their bloody Marys."], ["Kathy T.", "Absolutely delicious Huevo Y Chorizo! I am amazed with how unique and tasty their dishes are! My friends and I split a Pintxo Platter and it was very filing!"], ["Katie K.", "Went in for a quick drink with a friend I haven't seen in three years. Really nice place, good atmosphere, and the perfect place for catching up. It's not too busy and because it's tapas you can just has little bites throughout while enjoying some great sangria. I got the blanca, my friend got the tinto. We both really enjoyed them. The tinto especially had a nice little hint of cinnamon. My boyfriend got one of their gin + tonics and really liked his.I'm looking forward to going there to actually eat and not just get drinks!"], ["Allison B.", "I come here often for dinner, with my boyfriend or with big groups its perfect either way.  the sangria is amazing, but small pitcher, we usually get the red. Small plate style is my favorite, you get to try so much. the names are in Spanish so i don't recall the best things we order bc we try new things every time but prepare to read the menue. the servers are all very informed and helpful."], ["Melissa S.", "If Ann Arbor didn't have so many restaurants, I would spend the rest of my life going here.  Take a couple and share all of your entrees to make it more fun and you get to try so many different things.  GET the cheese tray and bacon wrapped dates."], ["Holly F.", "Went here for a late Sunday brunch. The blood Mary and mimosa were good. I loved that the bloody come in a wine glass, trés chic!! The food was amazing. As a side we got is there French fries ( I don't remember the name as I think it was in Spanish) but they put this amazing sauce on it that makes you want to lick the bowl clean. Our waitress went above and beyond for us.  She was the sweetest young lady, Im sorry I don't remember her name! We asked about the upstairs and downstairs areas. Before we left she asked to give us a tour. Mind you we were only asking out of curiosity, we never mentioned wanting to host a party there. Although having seen the other seating areas I would consider it if I lived closer. I will be returning for the tapas!"], ["Barb M.", "I went back during restaurant week because a friend wanted to try it and was again, underwhelmed.The food was less than stellar and this time my drink was not even any good.To top it off, the waitstaff was very unhelpful.I just didn't enjoy it at all."], ["Roger G.", "Fantastic experience from the warm personal greeting when I arrived to the expertly crafted tapas. An overall excellent experience. My server took the time to explain the menu and all the options, as we'll as make some deft recommendations, and it was nothing short of fabulous. I started with the iberico jamon and manchego, beautiful cutting board presentation. I also had the puplo confit, and the fried artichoke hearts, both perfectly presented. I finished with the coconut milk rice pudding and a nice 10 yo port.All in all an outstanding experience, perfect for asking your boss for a raise or impressing that special someone."]], "Schuler's Restaurant & Pub": [["Josh B.", "Market sentiment suggested the prime rib, but sometimes I'm not blown away by prime rib the way one is supposed to be, so I opted against spending $32 for the presumed best item in favor of diversification.The burger was giant and juicy. The fries were nothing special. The \"famous\" barbecue meatballs are basically meatballs in barbecue sauce. You won't regret trying them but it's not mandatory. I would, however, steer you toward the Swiss onion soup, a flavor powerhouse topped with gruyere and parmesan. The free cheese spread gets a jolt from horseradish. The setting is an early-20th-century knockout and the service was efficient and intuitive."], ["Christina G.", "Wow we really had a nice time. Debated between 4 and 5 stars.  They get 5 stars. Wonderful service from Dawn. She was very friendly with great suggestions. Prime rib is excellent!! Get it at least once. Ill ask for end cut next time to try some extra seasoning. Horseradish sauce needs a little more zip. Swiss onion soup is very good.  Thick and rich. It has deep deep flavor probably from long hours cooking with prime rib leftovers. Seafood chowder is good. Flavorful. Shulers salad is pretty good. Shredded cheese, blue cheese, creamy garlic dressing, tomatoes, olives. Baked Alaska desert is excellent. Will definitely get it again."], ["Susan W.", "This is a restaurant and pub that's been around  well over a hundred years and is a must stop for The Hubster and I, whenever we have a road trip into or out of \"Pure Michigan\"! Way back in December 1969 we dined their with both our parents after our wedding ceremony as we were having the reception a week later. (hubby had been drafted and returned from basic traing....)-anyway it's a major memory and the atmosphere  and food is a big part of that. Their bar cheese is absolutely fabulous and they utilize a lot of their homemade breads to make their own chip like devices to dip in the spread.  It's an appetizer that is a must have for us.   The other appetizer that we can't do without is their meatballs in their special sauce . The meatballs are comprised of at least a couple different meats and the combination is unique and very tasty, and then there's the sauce,  i've never been able to replicate it! We always end up taking at least a quart to go as well as devouring a serving ourselves while there.They have a full bar and lots of reasonably priced wine choices.After all those appetizers we usually share an entrée and we have tried many of them through the years. We have never had a bad meal. Too many to list since we try to go at least annually all these years but some of the highlights are the whitefish the prime rib the tenderloin the walleye and the lobster mac & cheese. Leave room for dessert and share it as they don't do skimpy servings! One of my favorites is the cherry crumble made with Michigan cherries and topped with a scoop of vanilla ice cream. All those years ago they had an ice cream that they made into a ball and rolled in coconut and my mom took the idea and made that every year for my sisters whose birthday was Christmas Eve as it was festive and  looked great with the candle inserted in the top. It's still on the menu!I always like to talk about the customer service and it is very good at Win Schuler's. They have had some of the same waitstaff for years and with some it's family  tradition.  Our server this year let us know that both her parents had been waitstaff during their college years long ago. It really adds to the feeling of comfort when you dine there.  We will continue to stop at least every year and I encourage you to consider it if your ever in or near Marshall, Michigan."], ["Jo S.", "It's always nice to stop here if we're passing by Marshal, MI.  Over the many years we've noticed the menu keeping up with contemporary ingredients and techniques while keeping comfortable favorites."], ["Chris K.", "Came to town from Grand Rapids on business with a fellow employee. He suggested we try this place because of the cheese. I was not disappointed at all! We choose to eat in the pub, the prices of the restaurant were a little too step for me ($$$ range).For an appetizer we had the Cheese and cracker platter. The cheese spread had lite hint of horse radish and was delicious. The platter itself came with bread, crackers, celery, and sweet potatoe slices. A side of ranch dressing and butter also accompanied it.For the entree We both went with the Two napkin beef brisket. The brisket was sliced nice and thin and was topped with a very liberal drenching of barbecue sauce. What initially struck me as odd was the sweet pickle on it, but in contrast with the in house baked jalapeño bread, it was a perfect blend of flavored.Our server was super nice and quick to refill our drinks. It was an overall dining experience that I would love to repeat again some time."], ["Dianne R.", "Lunch in the pub was excellent--The Schuler's specialties appetizer selection, which I ordered along with the soup of the day (turkey vegetable) as my lunch was easily enough for 4 as an appetizer.  Included lots of meatballs, chicken \"drummies\", their specialty cheese spread and homemade crackers, and crispy Brussels sprouts.  Yum!  Dining partner's grilled 3-cheese, spinach, tomato sandwich and tomato basil soup also great.  Had dinner here a couple times years ago--still a nice place."], ["Betty H.", "Love the old school atmosphere, but charging $36 for an appetizer platter us a bit expensive for just wings, meatballs,  stuffed mushroom and cocktail shrimp."], ["David C.", "Maybe I was so smitten with the reviews about this place that my expectations were just too high.  Everyone raves about the prime rib, so my sons and I ordered it and it was good but not great. And the creamy horseradish is weak, weak weak! The restaurant's extra-large dining room is impressive, in a semi-medieval Bavarian/Swabian Alps way, with large-type \"inspirational\" quotes painted throughout the place.  A little weird for sure, but what's a well-lived life without weirdness...The pre-dinner breads were ok, the sides were ok, and the prime rib was ok.  No single flavor or presentation stood out as exemplary, unfortunately. At the price point Schuler's demands, the value is questionable.  Underwhelmed to be sure, aside from the unique dining room and its king-kong sized quotations in bright yellow against all the dark Bavarian wood, which is a bit overwhelming.  The service however, was absolutely stellar.  However, I'd rather have great food and good service, rather than good food and great service.I'm not sure I'd plan a return dinner trip here, but glad I was able to stop in with the kids after a long ski trip. We enjoyed it but no raves from my side."], ["Ron Q.", "We love Schuler's Pub. Great food and service.  Try the prime rib sandwich, one of my favourite entres. We were greeted by Mike Schragg, a great host. The food and service are great. Try the homemade bread, crackers, Bar-cheese, carrots and celery appetizer. Also, the great meatballs. The French onion soup is wonderful. Enjoy."], ["Vittoria K.", "I would come back here in a minute. Staff and management know what they are doing. Great anniversary thanks to the crew."], ["Taylor A.", "Haven't tried out the pub. My mom and I don't live in Michigan and they were kind of brisk and sudden in ushering us to our table and we didn't realize it was a kind of fancy setting (only ones in casual wear) but that was just an unexpected thing for our experience. Not a huge menu but I ordered the salmon - comes with delicious asparagus, crunchy but not too crunchy and mashed potatoes - those were very creamy. The salmon was amazing and soaked in butter. My mom got the Walleye fish with the same sides but she didn't find the fish as good. I'd have to say a good restaurant and to get the salmon!"], ["Loretta M.", "I expected much more with all the great reviews. The atmosphere is nice, service was great but food was average.  For the price I would expect great food. The seafood chowder was warm not hot and kind of gelatinous, not what I expected. Lots of seafood in it but not a great base. The prime rib was good not great. The short ribs were dry and hard to chew. The wine sauce the  ribs were in was good.  The bread was very dry like it had been sitting out for awhile. The side dishes were good not great. Drinks were ok. Just not a great dinner for the price. Just visiting the area and was told by the hotel this was the place to go. It was pricey for what we ate in our opinion."], ["David S.", "This is a very old establishment in South Central Michigan, located in Michigan's first Capital. It was in decline but seems to be in a resurgence of sorts. The Wife and I ate in Winston's, the Bar. After some preliminary libations, cranberry-apple margaritas, we ordered sandwiches. The soup for both was a French onion. The Wife had a 3 cheese and I had a turkey rueben on cranberry-walnut bread. We finished with with an adult dessert beverage called pumpkin pie. Our waitress was helpful,efficient, and most important had an exceptional smile. The bar was not crowded. I hope this is not an indication of a resurgence that has come to a standstill and will no longer be the premier restaurant of this region. Give this place a try."], ["Adam G.", "Everything was excellent from the service to the food. I would recommend the Pub unless you want to have a higher end night out. Truly a gem in the very charming downtown Marshall. Don't think about it any longer, just go here. You won't be disappointed."], ["Milie F.", "The food was awesome, the sangria was also good. Not quite Spanish food, but still good pub food none the less.  What got me and my family was the lack of service. We went on a Saturday around 6pm. We didn't have much of a wait for a table but the wait for our food approached 3 hours. No one told us that the kitchen was running behind or that there would be any wait. And when our food did come, it came with 20 minutes between each of our respective meals. Had they communicated with us or offered some compensation for the wait it wouldn't have been bad but none was offered. I would recommend coming on a week night when no one is around if you really feel the desire to try it."], ["Maria C.", "What a great find! Thanks for the wifi! The food was just what we needed after a long drive. The burgers were perfect. We also had a couple of salads and they were delicious as well. Our waiter was friendly, attentive and made us feel welcomed. I totally recommend this restaurant! It's worth it."], ["Ryan E.", "Schuler's was great! Drove in from Ann Arbor. Love the old-fashioned atmosphere, the antique environment, and of course the food."], ["Jacob D.", "Delicious food, quiet atmosphere, and pretty good service. It's well decorated too. It's just a touch on the expensive side, cost me more than 20 for a lunch entree with water, tax, and tip."], ["Erin L.", "Great place with a nice Easter brunch! Everything is very clean and organized.  We had the buffet, it had everything!  We will be back to try the regular menu:)"], ["Nicole D.", "I live in Detroit now, but for two years I lived in Battle Creek which is not quite the culinary capital of the Midwest. When people came to visit I knew I had two choices to show them great food: Kalamazoo or Marshall. While Kalamazoo has a few really great options like Rustica and Food Dance, Marshall has one: Schuler's. Now that I live on the east side of the state, I look forward to stopping at Schuler's any time I find myself on 94 headed to/from Chicago or the lakeshore. Here's what I like:Food - always on point, whether eating in the more casual pub or the fancier restaurant. Fresh, tasty and a good variety for any kind of eater. While the pub has good bar food and lighter fare, the restaurant has really interesting and slightly European food. Also: if you have someone in your party who likes prime rib, these folks make a really good one.Wine - the wine list at Schuler's is always strong and interesting. Sometimes they have wine dinners, too. Really enjoyable!Ambiance - I love looking at the pictures from Schuler's past and present. The whole establishment has a family feel. You feel important as a customer and you know they have a long tradition of taking good care of their guests.Impress Mom quotient - high, very high. This is where I brought my mother when she came to visit me from Washington, D.C."], ["Kelly B.", "Been to Schuler's a few times over the years, but have never been blown away. The decor is lovely, very dark and \"pub\"ish. The cheese is of course the highlight - so much better than the processed stuff from the grocery. But the actual food has never left me wanting to head back anytime soon. Most recently we stopped in for lunch on the way back from Chicago, I had thought my mom had never been there, but I was mistaken - it had just been a long time. Honestly, if I had known that we probably would have kept going. I had the prime rib po' boy - it had all the right components to be good, but it was very dry. The meat was very well done and there was not enough moisture from anywhere else in the sandwich to help it out. Mom had the seafood cakes, and never found the \"seafood\" part. Aunt had the fish & chips, which was cooked well but had a LOT of batter. Every item on the lunch menu was at least 12.95, so I felt it was a bit overpriced for the quality.The 3 stars are mostly due to the atmosphere and the fact that everyone from Michigan should go at least once and experience some local history. It's not awful, but expect to pay for the nostalgia."], ["Mary E.", "Our frequent dining trips to restaurants throughout Florida, Michigan, Virginia, and Arizona during the past 14 years provided us with a variety of up-scale experiences. For sheer enjoyment of culinary artistry, gustatory pleasure, professional/personable service, and hospitable environment Schuler's Restuarant achieved our 5 star level of joy."], ["Sam K.", "My parents lived in Marshall for 12 years.  It is a quaint little town.  Shuler's is certainly one of the big attractions there, if not the biggest.  In addition, it is (apparently) state-wide famous--people always ask you about Shuler's when you tell them you're from Marshall.  The food here is perfectly good bar-type food.  It is not novel, it won't win any awards for presentation, but if you want good basic menu items, salads, appetizers, steaks, etc., it won't disappoint.  If you happen to find yourself in Marshall and you don't know what to do, there are far worse things than eating at Shuler's."], ["Robert C.", "Schuler's is an old, well established tavern in Marshall, Michigan. The environment is upscale rustic. I like the restaurant facilities and location but the food is bland, boring and overpriced. I think Schuler's is relying on past reputation and the fact that they are the only fine dining in town."], ["Holly G.", "I have been eating here, against my will, since the fifties.  I have never had a memorable meal."], ["Xaxa H.", "eehhhh, it was ok.  I took my staff here for lunch.  We agreed on Schuler's after I posed the question \"where is the most expensive place in town??\"  I was told in unison, \"Schuler's!\"  I was excited, but with Marshall being a small town, I didn't expect much.  The place is very cute, kinda throw-back old timey German pub feel, with a decent menu.  The avocado bruschetta was weird.  Nice try to be a bit avant-garde or forward-thinking in a small town, but seemed out of place on the menu.  My salmon was marginal, at best.  The sauce was a nice beurre blanc, but the fish itself tasted of brown sugar??  It had an odd sweet taste that was so off-putting, I only managed a few bites.  That flavor profile belongs on pork, not fish.  Gak.  I'm thinking my fish may have been prepared on a surface shared by another menu item.  The bread \"sticks\" are hand-made (also for sale in the lobby) were very good.  The pastry area in the lobby was nice and a great place for tourists to stock up on interesting bakery items.  As for the food, stick to the staples."], ["Lori H.", "Too expensive for what you get, which was average at best.  Their signature appetizers-lovers salad and meatballs were bad. Seven people got the salad and everyone agreed it was nothing special and not enough dressing.  Meatballs were cold.  The entrees were average but the price is not!  On the positive side our waiter was good and the atmosphere is still nice.  They really need to take a critical look at their food and improve it  and drop the prices."], ["Don C.", "Great lunch menu. Whitefish was excellent with sweetpoatoe fries. Peppermint chocolate pie was awesome. Wait staff was good."], ["Wolf H.", "Attended my aunt's (big Schuler's fan) birthday dinner at this bustling restaurant this past Monday evening. Word of mouth is that this 100 yr old restaurant is one of the key attractions in Michigan, but I have mixed reviews. Located amongst a nest of nearby beautiful churches, you get the feel of entering the home of a hobbit when you walk into the dining room with its exposed wood beams, Gothic written pearls of wisdom scribed over the walls, and dim light. Atmosphere is that of a loud, rustic, busy, open feel. Service was excellent by the host and our server. The long waits between seating, drinks, appetizers, main course, and dessert was evenly spaced, therefore plenty of time for conversation within our group. We started off with an appetizer of tangy meatballs served in pewter mugs.  I suppose an attempt to connect to their pub past. I chose a caesar salad which was disappointing. It looked as if the kitchen staff went down to the local grocery produce section, picked out a head of lettuce and chopped it in half and laid it on the plate. I am not a connoisseur of lettuce, but it didn't look at all like romaine. Pretty hard to screw-up a salad, but they did.  And the house dressing tasted oddly similar to the cheese that we used to dip our crackers in. For the main course I had the pecan crusted stuffed with spinach chicken. Sound good? I thought so. There was so much butter in this dish overpowering the flavor I thought the Land of Lakes butter girl was going to bust through the kitchen door. You have to dig to find the spinach (*please don't be frozen box spinach), but it was there. But as the saying goes, I saved the best for last....dessert. I had the peppermint ribbon pie which every bite tasted like a refreshing cool wind on a wintry day...de-lic-ious!  Definitely get the peppermint ribbon pie so you can leave Schuler's with a smile and lighter wallet.All in all, the food was lacking for the price and for such an upscale restaurant, but a terrific atmosphere to take a group for a couple hours."], ["Mit O.", "The prices of the menu only match the architecture of the building, and not the quality of their food though it isn't bad, it's just not great.  Good presentation though."], ["Bill M.", "Quaint, for sure, a bit musty. Someowhat like a ye-olde-knights-of-the-roundtable-haunt for C-list gladiators. Meatballs were not bad, swimming in bbq sauce. I don't remember too many meatballs I've met that I didn't like, so I may be too much of a meatball whore to be completely reliable or unbiased. The orange cheese stuff in ramekins that accompanied the meatballs--everybody else was devoring the stuff, but I cannot stand horseradish, and it permeated through this appetizer. I had the French dip, which the waitress raved about. I give it a 4 on a 1-10 scale. Not all that tender. After lunch, they brought a tray of cookies, big-ass cookies full of nuts and regular choc chips, white choc chips. I'm trying to do low carb whenever possible, but the cookie was calling out to me. Man was it good. I was filled with self-loathing for at least an hour."], ["Michael D.", "Schuler's is one of those Southwest Michigan experiences that you cannot miss in terms of dining.  Always a great place to go for a business meeting with a colleague for lunch.  It is also where I took my wife for our anniversary dinner recently.  They have great booths, and cozy alcoves so you can have a quiet conversation and enjoy the company of whomever you are dining with.  The place has great German hardwood, and details from history around the region.  Schulers celebrated their 100th anniversary recently!  The food is very nice, and there is a good variety on the menu which makes it a great dining experience for just about anyone's taste.They also have very nice event rooms for larger gatherings.  I would not recommend a late night group dinner, as they will usher you out at closing time, so start earlier in the evening if you have a long event planned.  Other than that, it is a perfect place, and I would highly recommend it to anyone coming through the area looking for a great Michigan dining experience."], ["Marilyn J.", "Love the atmosphere and service but food is lacking.  We had a fish chowder that was served luke warm and lacked much flavor.  Our daughters had fish and chips and chicken strips which they did not think was very good.  My husband had walleye which he said was very bland.   I had fried chicken which has corn flake coating.  I have never had it this way before but I did not care for it at all.  It was fried nicely, crunchy on outside and moist inside but did not care for the taste.   I guess they are using corn flakes because of Kelloggs close by. Mashed potatoes were again lacking much flavor.    I think using some salt and pepper would do a world of good.  The green beans  and cole slaw were good.    We don't live in the area and stopped because we had heard so much about it.  I don't think we would go again because it is too expensive to not have really good food."], ["Anthony M.", "Great Roadside Find: You are on a road trip and you see a sign off of the interstate that tells you to go to a restaurant that has been standing since 1909...you have to get off the road and go there. I was only let down to find out that the restaurant was not a traditional German Restaurant...but the food was excellent and creative. There were two dinning rooms to choose from. The Restaurant which was very over priced but the food looked very good. And the Pub which was a cozy little bar and reasonable prices. We choose the Pub side. My wife had the French Dip...it was really good. I had the iron skillet steak sandwich with roasted red peppers, puree of onion and blue cheese...what a delicious combination of flavors!!! I could hardly believe I was finding such a yummy meal on the road and all because I followed a road sign. You must also try onion rings too. They also have there own brewed beer here...it was really good...I had to have the beer because I found out I could only get the beer in two places in town...now that is a beer I must have. The waitress we had was very nice and friendly. She was a great person to hang out with but a terrible waitress when it came to selling the food on the menu. She could hardly recommend anything to me on the menu. When I asked her about the iron skillet steak, she said that is was tough and that alot of people set it back. I was kind of shocked by that comment because the best thing about an iron skillet steak is that if done right it is so tender. I didnt trust her judgement and still tried the steak and it was very tasty. The waitress said that she was a chicken finger kind of girl and could recommend the chicken fingers as being really good...at that point...I could have went to any fast food joint off of the road. I am glad I did not trust her judgement in food. I would highly recommend you stop here and have a great meal in a cozy warm spot. (Dined here 2/11/07)"], ["Annah D.", "I love this place!  Especially the pub."], ["Casey S.", "I had to pass through this relatively small city once on the way to a client site.  I took the opportunity to visit the famous \"Win Schuler's.\"  I had to go for the prime rib and it did not disappoint."], ["David M.", "this review is specific to the Easter Sunday Brunch.  what a huge disappointment.  since shuler's primary demographic is the nostalgic senior citizen, you would think that they would specifically cater to that person.  they should offer some menu selections so that people with walkers, canes, wheelchairs can order from their table.  there was no menu.  all these families who brought elderly parents for easter brunch had to navigate them to the food line - past two sets of one-step stairs, no handicap accessibility or ramp indicated.  the buffet line was crammed into the main dining area, with a lengthy line.  many items were out when we got to them.  our 84 year old mother was almost knocked over by people cutting in line.  the food, what was available when we got there, was okay. roast beef, but no ham.  whoever heard of a traditional easter dinner with no ham.  to top it off, our waitress was absolutely unseen, making me wonder how much of a tip do you leave when you serve yourself and you're coffee is ice cold when you return to the table with no warm up.  inexcusably bad planning and complete disregard for the customer.  they get two stars because i'm generous.  i would probably give two stars to the country buffet as well, just to be nice.  we expect so much more out of a place like Shulers."]], "Grange Kitchen & Bar": [["David S.", "Place was half empty.   Seated quickly.  15 minutes until we saw our waiter.   An hour later we saw our ok appetizers.  45 minutes later dinner comes.   4 of the 6 entrées were cold.   20 minutes later it's hot and only ok at best.   Manager comped dinner and gave us free ice cream which was not very good.  Nice gesture but didn't make up for the evenings ruination.  No more chances.  Never going back.  Sad."], ["Eric G.", "This place is absolutley amaazing..Everything is fresh, farm to fork and all that jazz.. You can really taste a higher quality product here as well.My personal favorite here are all of their small plate offerings.. Fried pigs head, duck confit poutine (amazing), duck fat fries and so on..They always have great beers on tap and great cocktails.. Def make sure you check this place out when you are in the area or have a craving for something new and different."], ["Shawna S.", "I really wanted to like this place....  Because I love to support local.  The food....  Not so great.  Went during restaurant week.  The first course was this thing that was brought out on a plate that looked like I stole the kitty food from the neighbor...  Disgusting.  The second course was a small...and I mean small.... Salad.  Nothing fancy, but hey, edible.  The main course is why this place got a 3 and not a 2.  The beef was tender and delicious.  The turnip mash under the meat was also very tasty.  The ambiance is nice in this place.  It is kind of fun to look at the chalk board and see all the local farms/sources for the meal.  Not sure I would go back (especially knowing how pricey the place is), or if I did, I would try in the summer when more local produce is available."], ["Ben D.", "On a cold Monday night in March, Grange was very quiet. We had an amazing dinner.Our server was friendly and informative, and quick and confident with recommendations. We had a three course meal with cocktails and wine, and everything was excellent. The food was full of innovative ideas.Perhaps it was the combination of the restaurant being quiet and our interest in the food - our server brought us a few tasters from the kitchen during the evening, generally of things we'd discussed but not ordered.We love the farm to table philosophy, and would recommend you visit Grange."], ["Laura Z.", "One of my favorite restaurant in AA, everything is delicate, love the chorizo with dates"], ["Becky P.", "Great food. The ambiance is OKAY--the restaurant is a bit outdated and not the coolest place to go to in Ann Arbor. However, the quality of the food more than compensates."], ["Lisa T.", "Went for a biz dinner on a weekday night. Good food/service/selections. Place had an older vibe than I would have expected for the menu - very quiet, weird decor, tablecloths made the place feel a bit stuff.Loved the menu and locally sourced food. If they cooled it up a little, this place would be a bigger win."], ["Jackie B.", "I had heard good things about the food at Grange, so when I saw a Living Social voucher for brunch, I bought it.  However, I had an extremely bad experience and will not go back.First, Grange DOES NOT TAKE RESERVATIONS for fewer than 5 people.  Second, the Grange website says brunch is served until 3pm, ONLY once a week on Sunday, but when I went at 2pm, I was refused service and told that I would have had to get there by 1pm and wait TWO HOURS in order to be allowed to be served.  The hostess was haughty and rude and indicated that somehow this was all my fault.I have also bought a $55 voucher for dinner at Grange.  I have asked for a refund for both and never plan to go back.  There are numerous very good restaurants in Ann Arbor where the staff is nice and the food excellent.  I will not wait two hours to have the \"privilege\" of being served, and I will not put up with rudeness.  And, thankfully, in Ann Arbor, I do not have to.  If I want to spend big bucks on a nice meal, there are other places to do it."], ["Rick ..", "Been twice and each time food was great. Pricier than most but i feel like its all high quality. I know they try to keep it local. They have good specialty icecreams and other interesting stuff like that. Duck fries are the bomb. And they have lots of cocktails to try. Would eat there more if it was cheaper but i don't think thats what they're going for."], ["Meeta B.", "Grange has become one of my after hours go to places for drinks. Now, I should preface this with, yes I have been here for food and I have always liked what I've gotten here. The pan roasted chicken is by far one of my favorite dishes here. However, my friends and I usually bypass the food and go straight up to the bar for inventive cocktails and we enjoy the quiet atmosphere of the bar. Plus, sometimes during their late night happy hour you can get the drinks for cheaper. My favorites at the bar are the French 75 and the GGGinger. The bar tenders/mixologists/ geniuses--whatever you may want to call them, always make a great drink and after a few, I'm ready to stumble over to Eastern Flame or Fleetwood to get some food in my belleh."], ["Dave O.", "Great food  cool staff. Worth going out of the way for. Farm fresh in season. Love it. Need to have a better menu delivery system for new customers. We were seated outside and missed the best stuff. would have liked to experienced those things not on the paper menu we were given. Looking forward to try agin soon."], ["Julie H.", "Ummmm...We came here to snack and get some girl talk in.  The outdoor patio was relaxing and the opportunity to people watch provided topics of conversation.  Seated near us was a cute baby and dog and produced a great deal of oohs and ahhs from everyone around us.  Our waitress was quite distracted - possibly because of the cute baby and dog - totally understand when she got our order wrong and neglected us for a bit.  We had the chickpeas and duck confit fries - all must!  I tried coming back just a few days later with my dog.  They tell me - we don't allow dogs in our outdoor patio.  Ummmm hello - you just did a few days ago!!  Did not like how policies like that could vary between customers.  I'll definitely have to rethink coming here again."], ["Katie M.", "Love that they source local produce and meats! We need more businesses like this to support local farmers. Lemon pancakes were a dream come true, with a local syrup.. Seriously, if I were pregnant I would have, and could have, eaten two complete helpings. Bloody Mary made with mcclure's... One of the best I've had recently. However, service was only ok and waiter was hesitant to let us sample the wines before ordering glasses of which we were unfamiliar with. Overall, I would love to return for dinner. I think the ravens club has a better brunch selection."], ["Cristina L.", "From the drinks and fried chickpeas to the duck fat fries and pan roasted chicken, everything was absolutely delicious. I even enjoyed the bread and butter! Our server was a joy and the ambience was great without being too pretentious. Can't wait to go back!"], ["Amber E.", "I'm debating whether or not to give Grange 4 stars ... They seemed to be out of everything we planned to order! They ran out of peaches (essential to the cocktail I wanted), they didn't have shrimp (which was in the pasta entree my mother wanted to order), the server couldn't tell my dad which cut of steak the special was, \"just that it was juicy and looked really good,\" and they didn't have the bottle of wine we wanted. Considering our reservation wasn't very late (730pm) I was surprised by the shortages.Apart from the sluggish service & being out of a large portion of food... I WOULD go back.Why? When the waitress told us the wine we wanted was out of stock, the chef happily gave us a different bottle -- double the price -- for what the original bottle cost. That gesture alone will guarantee a return visit.We didn't expect that at all and were prepared to order invidual drinks (as the remainder of wine on the menu was $$$$) so we were quite impressed.The food we did eat was very yummy, but I'd recommend an earlier reservation to avoid them running out of food."], ["Olivia M.", "I had an absolutely lovely birthday brunch at this charming new restaurant in Ann Arbor. My parents surprised me and had wanted to go to our favorite spot in Ann Arbor, Real Seafood Co, but since it was last minute and a busy weekend, we couldn't get reservations. Instead, they took me to brunch at Grange and I couldn't have been happier to try something new.The service was excellent, the menu was small yet scrumptious, and the atmosphere was charming and rustic. I would recommend brunch at this restaurant to all who enjoy healthy local meals that surpass traditional breakfast fare.  I'll definitely be returning for dinner soon."], ["Adam H.", "Great experience. Had the Chorizo/fig appetizer, the duck, and finished with a fantastic dessert- bacon flavored popcorn with buttermilk ice cream and butterscotch pudding. Highly recommend!"], ["Lily K.", "Previously gave this place three stars, but after returning several more times, I am changing my opinion! I appreciate that the ingredients are top quality and locally sourced, you can taste the quality in the food. Many of the flavors leave me pleasantly surprised! Lemon pancakes with maple syrup? Raspberry rose sorbet? Yum. I like the simple, intimate atmosphere of the restaurant. My first brunch experience there was frustrating, but ended resolved. My second however was great and since we arrived at 10 just as GKB was opening, there was no wait. My only complaint is that the service at each brunch was fairly slow.My experience having the chef's tasting menu was a definite 5 stars! I highly recommend it. Chef Brandon is the master of charcuterie!"], ["AloisSchicklgruber H.", "I will confess upfront that my 2-star rating is predicated on my cheap-bastardliness, and is not a condemnation of the quality of food at \"GKB\".The two of us had - A glass of OJ ($4 or $4.84 nett after 15% tip and 6% tax)- A bourbon with bubbles ($9 or $10.89 nett)- A GKB Burger each ($14 each or $16.94 nett).The OJ was indeed freshly squeezed, just as it states on the menu. I could however have made much the same in 2 minutes with my blender and 50 cents worth of oranges. However this is a fancy restaurant, so yea sure, fine. Go ahead and charge me nearly $5 for it.The bourbon with bubbles was also very excellent. But wow wow nearly $11 for a drink. Probably the most expensive drink I've ever ordered in my life.The GKB Burger was decent. There was an egg in it. Bits of pork that were strongly reminiscent of the char siew you find in a char siew pau. Fries were so-so, nothing special. I could however have gotten a bigger, tastier burger, and much better fries, at a little more than half the price, at say Great Plains along Plymouth Rd.Sure the ingredients are supposedly local and all that. But I don't give a hoot about that.I should have taken a picture. A glass of OJ, a bourbon, two not-very-big plates with our GKB burgers and fries. All for $50. Rather underwhelming. Especially when the quality of the food was merely \"not-bad-at-all\", rather than \"ooh-la-la-exquisite\"."], ["Irina B.", "Great  food, great atmosphere!"]], "Beggar's Banquet": [["Brett C.", "This place has the potential to be better than it is, but because it's in a college town, it just gives up.First, the layout leaves the restaurant much more cramped than it needs to be.  It's divided up by a series of small rooms, and packed to the brim with as many tables and chairs as they can cram in there. So be prepared to be bumped several times by people trying to squeeze by.The servers were pretty clueless.  The server who brought out our food dropped a plate and didn't apologize, although the manager came out and did.Could easily be a more vegan friendly place, but chooses not to be. But their portobello dishes came stuffed with cheese of which they told me they couldn't take out because it was already baked inside. So my only choices were a salad and a hummus appetizer.Thankfully my food was actually really good. The garden salad was extremely fresh tasting, and had a great tangy taste, and my hummus was very flavorful. Was not expecting that.Too bad for place called the beggars banquet, the dishes weren't exactly cheap.  Slightly deceiving name.I could go without this place."], ["Alexandra K.", "I cannot believe that I waited until my final semester at MSU to visit Beggar's. I met a group here for a meeting, and was both parched and starving before coming. For under $10, I enjoyed a cocktail (Stoli & cranberry juice) and a half-size pasta dish, that could easily be considered a normal-sized entree. When I told the waitress that I am a vegetarian, she was incredibly helpful in trying to create a filling, well-balanced dish. I would definitely return if in town for a weekend."], ["Leanna G.", "I used to eat here fairly often when I lived in Lansing. I moved away about four years ago. I ended up back here for dinner, and either the food has gone downhill or my standards have gone up. I can't really say which. The london broil stroganoff-style was pretty good, but it was overpriced. Beer menu is great though."], ["Miss P.", "The best Bloody Mary's ever. No wonder they use Zyng Zang and they pickle the jalapenos in their vodka. Can't go wrong! The eggs benedict is yummy and so is the spinach feta. Awesome sunday treat!"], ["Stephanie B.", "This is one of my favorite places to go to in East Lansing. I spent quite a bit of time here while pursuing my BA at Michigan State. On Wednesday's, they feature 50% off select wine bottles and appetizers. It is usually pretty busy, so it would be best to get there early. They also have some delicious brunch. So, not only is this a place to visit to a relaxing, chill atmosphere for nightlife, but it is also one of the best brunch spots in this college town. Enjoy!"], ["Maurice G.", "Man, do I ever love this bar.  As a EL rook visiting my fiancee's family in Lansing for the Holidays, she took me to some of her favorite spots and this had to be the best.The owner -- or maybe he was the bar manager -- doesn't matter.  Total badass.  Pleasant demeanor, eager to serve us, and offered up a few shots on the house that he was experimenting with.  Never more than a nod away, and had plenty of stories the way a proper bartender should when you cozy up to the bar on a snowy afternoon.Their craft brew selection was spectacular, and if we didn't have prior dinner plans that required sobriety in front of family members, my fiancee and I would have closed this place down on nothing but the local beers and free shots.This is what people down south imagine a midwestern bar in a blustery town to look and feel like.  I surely left satiated with that experience."], ["Brad C.", "I was really happy to set foot in this place again recently after 20+ years.It's probably the nicest bar in the Grand River scene, which isn't all that much of a compliment.The beer selection is tremendous, and much has been said about the wine here.Yeah, I sorta agree with Brett that the food just kind of gives up.  It could be excellent, but falls short. The coquille has about 4x the amount of cream necessary.  Not at lot of attention to detail.But, really what other options are there around here for non-chain ambiance close to campus.It is what is it is.  And that's a dang fine bar in EL."], ["Kannan R.", "This is the \"grown up\" place to go on the main East Lansing strip. Not much in the way of drink specials, but definitely good drinks. Fancier foods, great wine selection, and a little bit more expensive than the rest. The ambience is wonderful, a lot of MSU professors here as well as students, and I've even enjoyed their large group/room reservation service in the back at a departmental dinner.Surprisingly, you wouldn't expect that kind of place to be a great game watching spot, but it is!"], ["Ronni G.", "Great breakfast value for area. Awesome breakfast sandwich. Pass up ho-hum potato pancakes for home fries made with several varieties of potatoes including sweet potatoes."], ["Nathan T.", "This place was okay - I'm not a wine person so the deal didn't appeal to me. Had the Greek salad, which is pretty hard to screw up. There were only two banana peppers in the salad which was a bit of a fail, but at least they weren't too heavy-handed with the oil. All in all it was fine, but nothing to write home about."], ["Brian C.", "Seriously overrated. The food is only sometimes special, an the deals on half-price wine night aren't anything terrific. The crowd can be good occasionally, though, and there's shuffleboard."], ["B G.", "Been going since the 70's.  Had a Groupon \"coupon\" to use and went in for a nice dinner.  London Broil Stroganoff was cool and cut incorrectly so it was TOUGH.  Tried to get our waitress, but she walked by talking with another staffer.  Obtained knife from another waiter.  Waitress sat up front talking to host, only came back to BERATE us for asking someone else for service.Manager came to apologize and took off the entree.  It obviously wasn't the first time this waitress had caused problems.Not anxious to return, Groupon or no.  She also gave us TOO MUCH change.  We left the overage, but she probably thought it was a tip.  Wrong.Not like the days of Adler, Thelander and Richard."], ["Erin S.", "Wednesdays.Half priced bottles of wine.Half price appetizers.Only good night to go really.But a BLAST!"], ["Lisa W.", "My hubby took me here for dinner. I had the Fish and Chips ---  Fish was awesome --- fried to perfection. The fish they used was cod ---  fatty type --- awesome! Perfectly paired with beer! Also had the Caprese Salad --- not my favorite. There was a little too much balsamic vinegar --- totally overwhelmed the salad. My hubby had the Stuffed Eggplant --- kinda gross. There was way too much cheese and marinara sauce --- to the point that the eggplant was lost in the cheese and sauce! Definitely check it out !"], ["Karen B.", "Another institution across from Michigan State University.  I'm not sure how long it's been around, but it seems like forever--kind of looks like forever too--ignore that.  The food is good and the specials are often inventive.  The wine is great, of course.  If you don't like inhaling lots and lots of secondhand smoke, this is not the place for you.  The building is old and the air doesn't circulate at all so the smoke just hangs everywhere.  I suggest brunch when there is a little less smoke."], ["K P.", "Beggars is a not so attractive establishment  with pretty good food and a decent wine selection.  The best day to go is Wednesdays for half off wine bottles. By 7 pm the place gets packed and  a long wait can ensue if you don't make a reservation.I do like to go on Wednesdays for breakfast. I'm just bummed that breakfast is only served from 11 am to 2 pm.Service can be hit or miss.  They have some awesome servers and some not so awesome servers.Also on Sundays, they have half off glasses of wine.  The only other downer is that you can no longer go through the back door.  You have to park in the pay lot and then walk around to the front of the building.  You can leave through the back door though."], ["amy g.", "I like this place. I kind of wish I had went more as an undergrad. I remember one time we just happened to pick Beggar's on a Sunday night. The atmosphere was awesome, as well as our server, and they had awesome specials. $3 bloody mary's I think? And our server brought us all a really yummy shot on the house. I guess just cause we were good customers and it wasn't all that busy (also my friend's shirt was practically falling off...We didn't alert her to this). But annnyway, free stuff! And our waiter was super attentive. And the drinks were AWESOME. I wasn't all that thrilled about the food but it is definitely a good place for wine if that's your deal =)"], ["Chad F.", "Great beer. Great servers. Excellent setting. Ok meal.  Have been here before with better food."], ["Jill V.", "I love the atmosphere here and it is a great place to take company. The food selection is always great - big variety and delicious. The only minus is that the prices are a bit high."], ["Tom R.", "Sautéed chicken is truly excellent. The yellowtail tuna arrived somewhat less than 100% fresh.  Room  temp is less than ideal for tuna. Everything else is really really good. Atmosphere is pretty much ideal."]], "El Harissa Market Cafe": [["A H.", "I love this little place! When I went in, Susan was at the counter. She was super friendly and very helpful when I told her I was not familiar with the cuisine. I told her I wanted to try the meatballs, and she helped me choose 2 side dishes to go with it. Everything was amazing -- the flavors of the dishes were so bold and complimented each other so well. I asked Susan what type of food they mainly served, and I remember that she mentioned Tunisian a few times, and said that one of their employees is from Morocco. On their website, it lists their food as authentic dishes of \"Maghred, Adalusia, and Sicily\". I'm not an expert in these cuisines, but I can say that their food is delicious and definitely makes me feel like I'm eating someone's \"home cooking\". The gelato is also amazing. So many flavors. My favorite so far is chocolate-hazelnut, but next time I'll try some of the more unique flavors. Oh, and you can taste-test them all :)"], ["Jenna H.", "Awesomely tangy familiar middle Eastern dishes and some I'd never had before, alongside really good gelato. Friendly owners. Family business. Ample parking. Cafeteria/deli counter ambiance, for casual and quick meals alone or with friends, and great for takeout. Very clean and welcoming.I am a vegetarian and my husband is not, so we really appreciated ample vegetarian and vegan options at a place that also does meat.The food:Mammoul - 4 stars for all flavors. Competitive with the best I've had from shatila and exotic cuisine. Delicate pastry that melts in your mouth is perfectly balanced with the right amount of sweet but not too sweet date filling. The one with almonds on the outside was out favorite. These are bite sized.Lentil soup - 4 stars. Plenty of acid and the right amount of salt. Vegetarian broth.Grape leaves - 4 stars. Subtle and delicate flavors. On the small side. Vegetarian.Hummus - 2.5 stars. Edible for sure, bit not their strong point and no match for Zamaan Cafe in Ann Arbor or any number of places in Dearborn, etc. Don't bother and instead save room for the good stuff.Spinach tagine - 4 stars. Yum. Vegetarian. Full of egg. Lots of vegetables and a perfectly crisp crust on top of a creamy middle.Olives and lemon peel - 5 stars. Never had anything like it. Sweet and tender. Don't know what seasonings were in the rub, but they were magic.Feta with smashed kalamata olives - 3 stars. Good, especially when it comes to room temperature.House ice tea - 5 stars. Unsweetened. Spiced. Refreshing and light.Gelato - 6/5. Amazing. Especially the chipotle chocolate with raspberry which was better than iorio's awesome sriracha chocolate."], ["Sunny L.", "Fantastic fantastic fantastic food. And Sue and Khaled are the sweetest. We really enjoy eating here and are hoping to use them for catering soon!"], ["Anima K.", "While looking for restaurants near our hotel (I used the Yelp mobile app's monocle feature) I found this gem, and when my companions heard the word 'gelato' they insisted we try it.  The staff were wonderful, polite and obviously excited about their food.  I had the meatballs, fennel vegetables and jeweled rice.  It was the very end of their day so I forgive the rice for being a bit dry.  The meatballs were packed with flavor, served with a sauce that complemented them well.  The vegetables were an interesting and colorful medley, mostly root vegetables like sweet potatoes and carrots with onions.  Complimentary pita bread with a spicy sauce was provided.  You choose your dishes from the display case/counter, and when you're finished eating they'll calculate what you owe.The gelato/sorbetto was incredible.  I had the honeycrisp apple flavor, and it was like eating an iced, sweetened apple, the flavor was so unadulterated and wonderful.  Occasional shreds of peel, bright red, reinforced how close to the fruit itself this dessert seems.  Tastes were provided not just willingly, but PROUDLY, and everything I tasted made me wish I could come back every day for the next two weeks.  They also sell a small number of grocery items like tahani, caper berries, olive oil (both infused and plain) as well as some middle eastern desserts and soup packaged to go."], ["J N.", "Visited El Harissa today with my baby. The cook/owner and his wife were wonderful. They both came and talked with us. The meatballs and humus were delicious and I can't wait to go back and try their other dishes."], ["Shiv I.", "This place is outstanding. What a find. I live in Chicago and was driving to Detroit from Battle Creek and was looking for a good food option. I was absolutely amazed at the food and the owners are exceptionally hospitable. Will be back for sure."], ["Debora G.", "Ate here a month ago with friends. Service was great. Food was awesome. Prices...well, you don't know how much anything is. You tell the person serving you what items you'd like, and approximately how much, but you have no idea how much anything will cost until they ring up your bill. I had small amounts of several things - as in one spoonful of 4 items, a meatball, and 6 olives- and gelato. My bill with tip was $20.00 for lunch. I am not a big person - 125 lbs., and I was not full after the meal. Food is charged by weight, but it's not clear to me whether they also weigh your plates! TRANSPARENCY in pricing would make me more comfortable about eating here again."], ["T T.", "I finally tried this place after living walking distance from it for a little over a year! I am middle eastern, and I was so excited to try their hummus and dolma, both were incredible! I also tried the vegetable rice which was amazing. Wonderful service, friendly owner, will be back for sure!!!"], ["Martin S.", "Interesting flavors and prepared nicely however everything is priced by weight, so be careful ordering heavy items such as lasagne. It will be expensive."], ["Tina T.", "We stopped by while visiting Ann Arbor. Everything we had was wonderful...Carthage salad, whipped feta Rosso, berber terrine du Poulet, merguez meatballs, and lavender honey gelato. Wonderful owners. Great iced tea with fresh lemon and mint. We will be back."], ["Melissa M.", "Everything that we tried was just awesome! The owners were as nice as can be and the place was casual, warm, and inviting.  We are not used to this style of cuisine, and really appreciated the fact that we could order a \"little of everything\""], ["Nicole L.", "What a delicious addition to the west side! A great value, huge variety, and friendly owners. Over 20 vegetarian and vegan options! I could eat here every day.  Looking forward to the upcoming products, too."], ["Tony L.", "Food is pre-prepared and set out for display, deli-style. It's not made-to-order, but the presentation is nice and everything I've had seemed fresh. The North African spin differentiates the food from other Mediterranean/Middle Eastern eateries. Everything I've sampled has been delicious, with complex flavors, although the chicken couscous, parsnip dip, and Moroccan lentil soup were especially memorable.Gelato is amazing. Personally did not like the lavender honey that seems popular with many (not a fan of lavender-flavored stuff in general), but the spiced hazelnut fig, roasted pistacchio, and toasted coconut were fantastic. The staff is very generous in letting you sample flavors before making a purchase, and even for a small (4 oz) they really pack the cup to overflowing.As a couple others have noted, the one aspect I didn't like was the uncertainty in portions/prices for a dine-in meal. It seems you just tell them what you want, and they measure out arbitrary amounts. Although the amount turned out alright, it was a bit unnerving not knowing or having full control over how much I was getting/paying. Would be nice if they could establish a more transparent system."], ["Scott S.", "Wonderful environment, clean, extremely friendly, inviting and most importantly exceptional food. The taste of each dish was incredible, I enjoyed the meatballs with Harissa sauce, the mushroom dish, and the chicken with the yellow coconut curry sauce. After I had the lavender honey gelato. The gelato is made from an Italian family that is a small Michigan based operation. The owner greeted us and chatted and told us about his wonderful restaurant and hand made food. Definitely coming back."], ["Marty S.", "This restaurant deserved my creating a yelp account just for the purpose of giving positive remarks.  Our party of four sampled almost everything and we enjoyed all of it.  We will be back.   We have been telling our friends to visit.   The owners were so friendly."], ["Jenn C.", "The food is excellent - fresh, colorful, beautiful, and full of flavor. We loved all of the salad dishes - and had fresh dates for the first time! They even brought us a few fresh dates still on the stem when they learned we had never seen/tried a fresh date before! I loved that there are many vegetarian options and they make their dishes from scratch. The ambience is clean, inviting, and spacious. Beautiful handwoven baskets, ceramic dishes, olive oils and other market goods are fun to browse while the food is being prepared. The gelato is incredible! Best gelato I've ever had in Ann Arbor!The family and staff are so welcoming and sincere! By the time we walked out the door, we felt like we were old friends with the owners, chef and support staff! El Harissa is a delicious, fun and healthy family-owned business, we will definitely be returning!"], ["Amitava C.", "3 of us went to El Harissa today and ordered a sampler plate of the various dips, the majadara, goat shank and chicken with khus khus. All the dishes were cooked exceptionally well and the service was prompt. The dishes are priced by weight and its very reasonable. The owners are very friendly and offered us to try various dishes before ordering. Finally we had the gelato and that too was awesome. Overall, we are glad that we found this place and we would definitely comeback, hungry for more! We HIGHLY RECOMMEND this place to everyone!"], ["Aaron H.", "Hands down the best hummus outside of Israel! You can see and taste all the food before you order. Don't underestimate the appearance. This place is a family run, Labor of Love. Owners are very sweet and generous. We'll definitely be back."], ["Carl E.", "Excellent food, fantastically friendly employees, good prices. I was a bit overwhelmed by the food choices, but they were perfectly happy to put together a plate for me and it was fantastic. I talked to the owner for a whole, and he was very friendly and happy to have me there. The gelato was amazing as well and I couldn't leave without a cup of the tiramisu gelato. Pretty awesome place. I'll be back next time I'm in town for sure!"], ["Peggy F.", "Great gelato is amazing flavors! Nice dips, olives & meatballs! Small market but very fresh. Owner operated & very friendly, will be back :)"], ["Mary-Catherine H.", "I am so excited about this restaurant.  The food is amazing--delicious and affordable.  All of the spreads were phenomenal.  In addition to the hummous we tried the white bean, parsnip, carrot, and harissa spreads--I would recommend every one.  The meatballs have intense, rich flavor in an incredible tomato sauce.  The salads and green beans were fresh and flavorful.  The menu is ideal for take out (most things are sold by the pound).  The atmosphere in the cafe is low-key and charming--the owners are lovely.  The restaurant is in its early days--service is leisurely and the market is still largely unstocked.  But if tonight is any indication El Harissa will be a west side gem.I would be negligent if I didn't mention that El Harissa has the best gelato in town, hands down.  We tasted 6, committed to 2, and bought the 8 ounce size thinking we would have some left over.  Not a chance!  Flavors include lavender honey, blood orange, Tunisian vanilla, toasted coconut, pomegranate, as well as more standard fare done exceptionally well."], ["Rory H.", "All positives except one key:  no hot, fresh-made sandwiches!  I've been told this is coming but I've yet to see it.  Honestly, after a long day of work that would bring me in several times a week; as it stands, my belly is not always up for food that I have to take home and reheat.  Really hoping they get a grill going soon!"], ["Abi B.", "Just ate here for the first time yesterday. The service was very friendly and prompt. The food was great: dips, salads, and a few meat and soup selections. They are still getting settled in, as most of the shelves were bare in the market, but it was a comfortable and open atmosphere nonetheless.  I was pleasantly surprised to find that they serve gelato supplied by the same company that makes it for Iorios...YUM!The only reason I did not give it 5 stars was because they use a \"by the pound\" model for ordering food. This always makes me nervous b/c I never know how much I will end up spending. I prefer more structured menus. Because I was dining in, I ended up asking for a spoonful of several items, all of which were delicious, served with a side of warm pita.I look forward to returning again soon!"], ["Jason B.", "This review is based on only one visit, and i do plan to go back and give it another try as i want this place to do well and be good. We tried the Hummus which was a little different and very good. However, everything else tasted underseasoned and a bit boring. Jeweled rice was interesting (think rice pilaf with dried fruit instead of pilaf) but one-note and the moroccan olives were underwhelming. for the amount of spice paste on the cured black olives, there wasn't much taste. The Merguez meatballs were soft and accompanied with an orange-red sauce that was tasty, but it didn't have any spiciness at all. The Lentel soup with swiss chard was quite good. The service was great but quite slow. This place is also direly lacking a sandwich option. Where's the schwarma or falafel or any type of sandwich? The food here pales in comparison to the Mediterranean food you can get a little ways east of here. All of this said, I'll go back one more time to give it another try."], ["Tomo I.", "My second time here for lunch.  They let you sample from the deli, which is great.  More importantly, everything tastes amazing!  I like the rice with Caramelized onions the best."], ["John T.", "The flavors are some of the most complex and delicious I have had in Ann Arbor--which is saying something!  This is fine North African/Tunisian/Magrebi homestyle cooking, which is  different from its Middle Eastern cousins in terms of the layers of flavor.  The mujaddara is very different from the Lebanese style that you usually get.  The Harissa sauce is not overly spicy but adds nuance to the meatballs.  The atmosphere is casual and welcoming but with warmth and kind service.  The owners want you to try their food and enjoy spending time speaking and getting to know you.  I strongly recommend eating here for an experience like no other in the area.  While it's true that they use the by-the-pound method, a full plate and a smaller plate with about 4 dips with bread will run you about 13-15 dollars.  I find their pricing quite reasonable by local standards as well.   The gelato is excellent with flavors you will have trouble finding elsewhere, but for me, the North African style food makes all the difference.  Don't get me wrong, I love kibbeh and shawarma, but this is homestyle cooking with carefully nuanced flavor profiles that you really won't find anywhere else close by."], ["Lucinda S.", "I am glad to see a greater variety of Middle Eastern food coming to Ann Arbor and SE Michigan. Most Middle Eastern food in the area is Lebanese--which is delicious don't get me wrong--but, I would like to see more variety. The food in El-Harissa is healthy, fresh, and the prices are reasonable. I enjoyed their lablabi, jeweled rice (rice with almonds and dried fruit), and their quinoa tabbouli. Their stuffed grape leaves are also good. For dessert, they sell gelato with some very unique flavors including lavender and Turkish coffee. I had the lavender gelato and it was a lovely finish to my meal. The owners came and talked to us and were extremely charming and warm. They also have wifi and when I came around 11:30 on Tuesday it was quiet and seemed like a good place to sit, read, and enjoy a hot meal."], ["Merlin O.", "Excellent food, great prizes and the tiramisu gelato was amazing. Come for the spiced chickpeas and the parsnip puree, stay for the desserts."], ["Sahil R.", "The restaurant is a wonderful addition to the neighborhood. They have a large variety of vegetarian and non-vegetarian tasty dishes. The owners are very welcoming and friendly. They draw their inspiration from North African, primarily, although there are some other Mediterranean influences as well. We intend to visit this place again very soon."]], "Brick Street Bar & Grill": [["Lynn B.", "Today was the first time my wife and I visited Brick Street Bar & Grill.  We thought the food was awesome, the decorations were elegant, the place had a warm and friendly atmosphere.   We like to give special thanks to the Manager (who worked around 11:00AM) and our wonderful waiter Aidan C.  Brick Street Bar & Grill is our new favorite restaurant!!!"], ["Brittany L.", "On our way up north we stopped in at Brick Street Bar and Grill and I had the Thai Lettuce Wraps. The menu description: Create your own Thai lettuce roll. Cumin chicken strips, carrots, bean sprouts, curry noodles and lettuce leaves with three delicious sauces, red chili soy, orange ginger and jalapeno sauce.They were delicious. I also had a Ceasar salad which was somewhat pricey for romaine lettuce leaves with Parmesan cheese. I'd definitely recommend getting the lettuce wraps. The only downside was that our server didn't come by after the food was dropped off to explain what I was eating.. as a previous server, I found that to be a major fail."], ["Meagan B.", "We had a reservation for 14 people to celebrate my aunt and uncle's 25th wedding anniversary.  When making the reservation we requested 2 servers based on a previous experience here, but they refused... Needless to say the service was awful.  I had to ask for drinks at least twice before being were served.  It took 30 minutes between the first and last person receiving their meal.  We brought a cake and the server didn't even hand out new silverware and stood by watching while I handed it out.  The food was mediocre at best.  My medium filet was more well done, the steamed veggies were mush, and the mashed potatoes were dry and cold.  As for the restaurant itself we were freezing the entire time, so they gave us a tiny electric heater.  You had to stand inches from it to feel any heat.  Meanwhile, just up 2 steps was a gas fireplace with no guests around that would have accommodated our group.  Poor planning by these people all around.  Stay away."], ["William K.", "Worst service I have ever received in a restaurant. Took long for me to get helped initially, took long for me to get a table, took long for me to get a menu. My server was friendly when he actually got around, but once I received my sandwich, there was a broken toothpick inside of it (separate from the standard toothpick used to hold the sandwich together). The manager offered me a 10% discount, which I thought was way too low after all of the waits *and* the toothpick issue. Never going there again. Never."], ["Rob M.", "Great place to meet with friends for lunch or dinner. We have had many good experiences here over the years.  Love the setting next to the fireplaces and the patio is awesome in the summer."], ["Mollie A.", "Ordered two butterball steaks, asked med and med well.. Somebody clearly forgot about the meat on the grill because both were very well done, I make a better steak at home. Mashed potatoes were okay but a small portion. Hot bacon salad is good but not hot?.... Won't be back."], ["K B.", "Dinner on the patio with my husband and 3 young kids. Everyone enjoyed their meal. The ribs were delicious. 2 kids had the flatbread and loved it! And even being off the kids menu the 2 boys (5 and 7) could have shared one flatbread, as they were huge!"], ["Jason W.", "I was EXTREMELY disappointed in my meal. I ordered the chicken piccata and didn't realize what a terrible dish it was. The chicken was bland, it was like eating a piece of cardboard. If I didn't know any better, I would think they microwaved it. The angel hair pasta had no sauce whatsoever. It was simply a heap of noodles next to a microwaved piece of chicken. The dessert delicious. A melt-in-your-mouth tiramisu. It was fantastic. The outdoor seating was enjoyable and mellow. Very relaxing.Our waiter Jason, was slow......dirt slow. He was terrible at refilling my water glass, forgot the bread, and wasn't a great listener (he asked about who gets the check for the appetizer when we CLEARLY told him beforehand) it also took FOREVER to get our bills.Guys, I'm just telling you straight up, tonight's meal wasn't that good. Take a chance if you want, I'm just telling you my experience."], ["Larry M.", "This place sucks the steaks are awful prime rib is too.   sent both back didn't have anything... Will never will go back And the prices are way to much. I can't believe they are open But it's grand blanc!!!People there think anything in G B is Great   BUT ITS NOT!!!!"], ["Josh S.", "The filet mignon with Portobello was top notch. I'm picky with filet, but I'd say this is one of the best in Genesee County. The Demi glaze was also excellent.  It was so good I forgot to take a picture. The tiramisu was the best I've had. The outdoor patio with live music was a great touch for a beautiful summer night... Best outdoor seating in the area. I do not recommend the mashed potatoes, they were the only thing I'd change."], ["Shannon P.", "Best service when we sat at the bar!! The bartender with the long blonde hair was amazing! The fish and chips were the best I've ever had. They also have a live musician and phenomenal drinks. Highly recommended place to eat/drink."], ["Crystal R.", "I went here yesterday as a part of 7. They had advertised on their message board that they'd be open Labor Day.We chose to sit on their very large patio. It was a nice day, so why not? There were already a few tables out there anyhow.It appeared that they may have only had 2 servers working when we arrived. There were at least 4-5 tables outside, and who knows how many on the inside. The server mentioned to us that they had cut a lot of their staff off of the floor thinking they'd be slow, but alas they were not. That was a bit surprising to me, as you normally don't cut the floor down before the lunch rush, but alas, I gave her a pass.They had quite a few options for food. Appetizers, pastas, burgers, salads, pizza, and a pretty extensive menu of dessert options. My husband and I split the portabello mushroom pizza, which was delicious. Two people at our table had errors with their order (wrong sandwich sent, no dressing with the salad, etc) We didn't get to try any dessert as our meal had taken a long time as it was, and we had somewhere we needed to be.I thought that this was in isolated incident as the waitress had mentioned the lack of staff on the holiday, but seeing the other Yelp reviews, I'm guessing that this place has a service issue overall. Hopefuly management sees these reviews and makes some changes- because the food was good."], ["Rosalyn M.", "This place has excellent food. My husband and I have been here at least 6 times and we've never been disappointed with the food. From the seafood to the steak to the ribs cooked to perfection. The only downside is that their carry out service is not the greatest. The first time we ordered carry out I sat at the bar without being helped for at least 5 minutes. My food wasn't ready when I arrived and then when I finally received my food I had to wait 10 minutes for them to take my credit card. Initially I chalked this up to them being busy but two days later we ordered from them again and had an equally unpleasant experience. The waiting was a similar problem but this time they topped it off with having given our order to someone else. I would definitively avoid this place for carryout but dining in is great!"], ["Laura M.", "Best dinner I've ever ate in my life. True story. If you're not near Grand Blanc, make the drive. It's worth it. New favorite restaurant, hands down. THEE best food I've ever had.I had Spanish coffee... Amazing.Appetizers we had were coconut shrimp and stuffed portobellos... Phenomenal.Dinner was the Italian Cannelloni for him and Chicken Picante for me. Both of us agree it was the the best meal we've ever ate. Fantastic restaurant! We are lifers now!!"], ["Emily S.", "We are traveling and decided to find a local place to eat. Awesome patio, dark seating inside making it hard to read the menus, poor beer selection, mediocre service. the menu does have a lot to offer. Fish & Chips are a must....delicious! the rest of our table got the Bourbon Onion Chicken sandwich which was ok but not served on the pretzel bun as stated in the menu due to them \"going bad\" according to our server(told us after we got our food). I would try somewhere new if I am ever in the area again"], ["Cindy W.", "I love this place for so many reasons. The atmosphere and extra care by the staff made this the perfect place for my dad's wedding reception. I've organized staff luncheons for the outdoor patio the last 2 summers  summers. They have excellent service, and I highly recommend the Lobster Bricks, my favorite dish there."], ["Nancy B.", "Just had a lovely  dinner here. I had the chicken Marsala.  It was delicious and the serving was huge.  I have enough for dinner tomorrow.  My friend had the meat loaf special and he ate every bit!  Our waiter was very attentive without being intrusive. The fireplace was nice and cozy and the Christmas decorations were exceptionally festive."], ["Kay S.", "I'm always happy with the service here but never happy with the food. Every time the meat items are dry and everything is over-salted. Salads have been ok so if I have to attend another event here I'd opt for one of those. That said, the staff is fairly friendly and the place is nicely decorated. Still, it's a place we only visit when with a group."], ["Stu J.", "This is one of my favorite restaurants.  Good food, varied menu and reasonable prices.  I would definitely recommend this establishment."], ["Cheryl S.", "Went for Easter dinner with my family and usually for a holiday meal it is very good.  But this one was the worst meal I have ever had there.  Had the Tuscan beef tips marsala and it was bad,  beef was tough and the dish had no flavor. ... Hard to believe they used marsala wine because you could not taste it. ..3 of us at the table ordered the dish and we all were disappointed. ... The only redeeming thing of the dinner was being with family. ..our waiter Chris is the best waiter there,  we always request him. Briskstreet does do Thanksgiving and Christmas dinner very well. ..."]]}