{"Ukai Hibachi Grill and Sushi Bar": [["Josh S.", "Ukai is my favorite place to eat in Lansing. I have eaten sushi here, lunch and dinner, more times than I can count.My favorite rolls are the Champagne and Salmon. The champagne roll is salmon, tuna, and yellowtail tuna, surrounded by rice, then seaweed, which is then tempura-battered and fried. Sauces are drizzled on it. It comes warm, crispy, and delicious.My favorite way to eat sushi here is with chopsticks, put some wasabi on each roll right before I  dip them in soy sauce for a second or two. The wasabi is nice and strong. Ginger is good, the miso soup is provided when you eat in and is quite good.Overall, my favorite sushi dining experience anywhere."], ["Rebecca B.", "I hate to redo my prior rating, but I have to...I came twice during my last visit.  Scott, the bartender, was up to his usual level of multitasking which is an amazing skill to witness.  If you come here alone, sit at the bar.The food was not as good as I recall.  The miso soup has dried fish paste in it so that's out (thanks for giving me the heads up, Scott!).  But the sushi was a bit crumbly - like the rice hung out in the cooker too long.  Maybe it was my mood after 8 hours in a risk management conference but I went twice and it was just a bit of a bummer.The wine is cheap, so i will be back."], ["Todd C.", "Pleasant surprise !!! As I was leaving the hotel the front desk asked me if this is where I was going and I told her yes and she told me I would LOVE it. Quality was good price was good. Very friendly bartender and service staff - busy for a Thursday night. Yellowtail Hamachi was stupendous, crunch roll was really good - ordered up Drunken Tiger to try it out, I'm sure it will rock. Some fruit flies about the bar area, but I understand that, they are a pain, I will bring my customer back here for lunch when we are in the mood for Sushi Hai !!!"], ["Amber B.", "This is so my favorite place. It's like $25ish a person for dinner and totally worth it.The food is amazing and the experience is almost always awesome (depends on the chef) I always get the hibachi steak and it's always on point"], ["Nancy K.", "Solid sushi joint. Very large rolls. I could stand less rice but that's personal preference. Flavor combinations you won't find elsewhere. Good cocktails and good service."], ["Tyra N.", "Ok the food is good. Really good but...Well most of the rolls are tempura and while I know I'm always eating in an American Sushi restaurant no matter where I go this place verges on appropriation with the menu names and frying everything!Many of the speciality rolls are fried tempura and too heavy for me. They taste ok but some of the rolls I would prefer without the batter, grease and heat. Their Bento boxes while again mostly fried (veggies, rolls, noodles) and heavy with sauce are delicious. The menu is insensitive in my opinion. They have items like the Godzirra roll, the Atomic Bomb, Eating Nemo (cute), Crabby Patty (cute), and Kamikaze roll. I feel like this can be taken offensively.I have not had any sake or drinks but the decor is nice and the service is fast and friendly. I'll be back but that menu has me feelin some type of way."], ["Bruce B.", "Great Sushi bar with Tepanyaki grill. Full assortment of fish and rolls. Close to airport and hotels.  Friendly chef Jay prepares beautiful sashimi. Nice assortment of sake as well."], ["Rishi R.", "Everything, and I mean everything here is incredible. The prices are unrealistically low and quality is phenomenally good. Had their spicy salmon roll today. It was so good I think I cried."], ["Karen X.", "The hibachi here is very good, but I would not recommend the sushi if you are a sushi lover and like authentic sushi. While I don't have too many complaints about the freshness and quality of the fish, it's really more in the craftsmanship. The sushi has a lot of rice and just doesn't seem to use the freshest and best ingredients.I had the rainbow roll and the spicy tuna roll which are pretty standard at sushi restaurants but this just wasn't the best sushi I've ever had. All in all, if you're going to ukai, go for the hibachi and skip the sushi!"], ["Tara S.", "We had tickets to a show, so my family and I stopped here for a bite to eat and a drink before heading over to the Wharton Center. We opted to sit on the patio, as the weather was beautiful. The waitress took our order and we each got a specialty cocktail, plus 4 sushi rolls to split. We advised her that we were in a bit of a hurry, and she offered to bring the check with the meal. Perfect.The drinks were good. Not too alcoholic, could have probably used a bit more of a punch, it tasted like you were drinking a juice. The sushi was amazing. Fresh, tasty, and it all came out on one tray for us to put in the middle of the table and eat from. Then they have small dishes that you can hold in your hands as you grab sushi and dip in your soy sauce (also on the plate). It's sometimes difficult to eat outside on a patio, but their setup made it very efficient and worth it.The waitress forgot to bring the bill with the meal, but it wasn't too long in coming out and when she did eventually remember, we were still eating and not in such a rush to leave still."], ["John C.", "I had the Spicy Crab Crunch roll & it was amazing!I posted a photo from the menu because I didn't waste any time devouring the Spicy Crab Crunch roll."], ["Andy D.", "I have stopped here a few times since it was very close to the hotel I would stay at.  I never tried the hibachi - only the sushi.  Average at best.  However, I found the staff to be always accommodating."], ["Marie S.", "I actually ate their twice yesterday -- once for lunch/takeout and then hibachi for dinner.Lunch: the kids' meal was fantastic, a lot of chicken.  The bento box I ordered was HUGE, filling two square takeout containers.  The meat was dry, soy sauce almost sweet, ginger dressing not very ginger-y and tempura veggies were wet/soggy.  But a lot of food that was very tasty.Dinner: Maybe the second to worst hibachi I've ever had.  The fried rice had ZERO flavor, the miso soup was separated, the yum yum sauce tasted metallic and bitter. The meat was tasty but the shrimp appetizer was very fishy tasting.  We didn't get a single drink refill until after the chef had served all of our food.The chefs were entertaining and the meat portion of my dinner was very tender and flavorful.I also witnessed the server for the grill next to us be very rude and argumentative with a patron, to the point where we nearly left."], ["Erica D.", "Yes, my rating is low, but this restaurant isn't all that bad. In fact, the sushi chefs alone are notably talented and fun, and there are definitely unique sushi options. It's also the only hibachi in Lansing, to my knowledge. Our Ukai experience, however, left my husband feeling ill.When we arrived, the place was virtually empty, but there was a wait. The hostess had a weird thing going on where she would not look us in the eye! It came off as arrogant, like she was annoyed to... I don't know... walk us to a table? We were seated at an empty Hibachi table waiting for a chef. We waited for fifteen minutes, by ourselves, without being acknowledged. The corner we were seated at was by a covered window (I believe) and I'm sure it was a combination of the hibachi grill heat and the temperature outside but we were feeling extremely muggy, stifled, and began feeling under the wather. Another couple celebrating their anniversary was seated next to my husband. After a few minutes, he asked if I would mind just eating in the sushi non-hibachi room instead, and before I could decided, he was insisting we not remain in the hibachi room. It ended up being because he was feeling so warm he was lightheaded and also the lady who sat next to him smelled like \"an old person's house\". I suppose that's the risk you take when you dine with strangers. We never saw a hibachi chef and did not feel invited. It was disappointing.The sushi room had appropriate room temperature, thank goodness, and we were greeted promptly. Our waitress was sweet and helpful with my custom questions. I went with the Tyson roll, which has fried chicken among other things inside! I had it tempura fried. The roll was huge, and very good at first - but after a bite or two I realized how overwhelmingly cream cheesy they were. I had to take half the cream cheese out of each circle. My husband ordered two rolls (names forgotton). He didn't really like either - he said the shredded shrimp topping on one mixed with the spicy mayonnaise tasted way too decadent and the other roll was bland. He ended up having an allergic reaction to the crab, which I think actually is good thing - meaning the crab they use is real and fresh. He said he just felt fluish the entire time we were there, and couldn't wait to go. During our visit, I had asked for a fork for some gyoza we ordered. Since they aren't readily available and the only utensils at the tables are chopsticks, I'm fully aware of the expection to know how to use chopsticks at sushi restaurants. But... I'm American. Sorry. I find a fork easier to use, naturally, since I use one every day. I asked for one, and the reaction I got was the equivalent of an \"you uncultured swine\" joke. Rubbed me the wrong way. Left overs were inedible, so half our meal went wasted. Ukai has a reputation for being a nicer, more expensive Lansing area option, but I honestly thought the prices were very affordable, especially their sushi bar happy hour specials that include rolls and appetizers. You can easily get out of there affordably. Hibachi is more expensive, but you get multiple courses with whatever hibachi item you pick.I think for us, we had a weird experience overall and did not feel like we had a \"nice dinner out\". I'd give them another try but my expectations won't be so high."], ["Ronnie W.", "always wanted to go to a Hibachi Grill, now I have. They didn't dissapoint, so I am told. I couldn't believe how much food they actually cook for you, The chef was entertaining and did a great job cooking for us."], ["Nicole H.", "I love this place! I've eaten sushi all over the country and this is good sushi. The staff is friendly and the sushi chefs are speedy. The bar is excellent with many custom cocktails.  The hibachi grill is a lot of fun and it is kid friendly. The lunch menu is an excellent value. Definitely check this place out."], ["Claire M.", "Hostess and bar tender were miserable people. We were ready to walk out and should have. But it was raining. When the chef came and we were seated everything changed - very friendly - entertaining - and great food!!  (Please get happy people in front of the house - that is the only reason for four stars)."], ["Shannon H.", "My favorite place to have sushi with friends!!! Scott is sooooo attentive! Amy is amazing! So is Lisa but she doesnt work much anymore! I have never had a bad meal here! Every food item is to die for!!"], ["Shanelle H.", "Went there last night. I love the soup and salad you get before you dinner is prepared right in fount of you. The cooks are amazing. Very kind and friendly. And make a good show. The food is amazing and you get what you pay for. Great food, show, and excellent service. One of my favorite restaurants!"], ["Stephen K.", "The food was okay and being there alone didn't bother me as everyone at the grill/table was so nice. The food though...  It was a great price but I like my fried rice to have a little more grill time and the chef seemed very preoccupied. All in all I'd call it an okay experience."], ["Steve A.", "I've been here several times when I'm in Lansing and the sushi is consistently very good. Sit at the sushi bar and visit with the sushi chefs. One of them is from Korea (sorry can't remember his name). Great guy to talk with. I always learn something and also find out if they have anything special that's not on the menu. You'd be surprised how often I get to try something new or that the chef says is especially good. Only down side is the beer and wine selection is weak but I don't go to sushi restaurants to drink. You need to try this place next time you're in west Lansing."], ["Graydon P.", "Came here tonight for my wifes 50th birthday dinner, I had the shogun special and my wife had the seafood platter, both dishes were cooked to perfection by the hibatchi chef. we will be back next time we are in town."], ["Taryn H.", "Good food, but our chef was terrible.. Dropping his utensils and the eggs. The other waiters seemed entertaining but ours made it an unpleasant experience."], ["Erin K.", "Your average hibachi show, we didn't get the shrimp tossed at us which is the only reason the kids wanted to go. The chef was quite dull, seemed bored and made an onion volcano and that's it. The hibachi food was just ok, the sushi was really good. It's completely random if you are going to get a good server in the sushi bar or not. More likely not. The hibachi servers were friendly though."], ["Kristin C.", "I come to Ukai at least once a month to take advantage of their wonderful happy hour (prices slashed on certain drinks, appetizers, and rolls Sun-Thurs, 4-10 pm).  I've sat at the sushi bar, at the regular bar, and in the general dining area before.  Note: I haven't tried the hibachi back room, as I can't tear myself away from the delicious rolls.If you are sitting at the sushi bar or the regular bar, you will likely be waited on by the bartender.  The two main bartenders at Ukai are Scott and Lisa, and they are both wonderful people.  They both are warm and talkative, act fast, can remember way too many orders at once, and make a mean cocktail.  Major thumbs up for them.When I'm by myself, I always get the rainbow roll here (it's one of the things on sale at happy hour, at $7).  These rolls are no joke.  They're nice and large, and one rainbow roll plus the complimentary miso soup fills me up for dinner.  The generosity isn't isolated to that one roll, either.  Everything is large here, and you get lots of tasty food for your buck.If you're at the sushi bar, the sushi chefs might talk to you a bit, and you might even get a little treat.  I always tip the sushi chefs in their jar because they do a great job.  Heck, I just tip well anyway, because I get a delicious sushi dinner for under 9 bucks total.  You can't go wrong with Ukai."], ["Lorraine H.", "Went here for my 50th birthday with five friends. The reservation was made in advance and they had us listed there. The greeting area is small and there are only two chairs, so it gets congested with people waiting to be seated. We waited about 10 minutes. The restaurant was clean and crowded with happy customers. We sat at a grill table and the service provided was friendly. I would say the entire experience was very good, and the food was certainly delicious. Only three little gripes: the restaurant was very chilly, my daughter was freezing. The noodles and rice were cooked first, so they went cold by the time the rest of the food was prepared. Finally, the first two beers I requested were \"out\" or \"discontinued.\" I ended up with my third choice. The chef was nice, not talkative. It was fun, we had a good time."], ["Jamie T.", "Great hibachi grill. Food is delicious and our service has always been good. I love watching them cook in front of you, it's entertaining. We'll definitely go back."], ["Bradley R.", "This place gets 3 stars primarily for the hibachi experience. Decor, staff and quality of food were good, I can't wrap (pardon the pun) my head around the sushi. I am just not a fan of Americanized sushi, which, is the bulk of what Ukai serves. For families with kids I can see the appeal, but if you want authentic sushi I would go to Sansu or similar places in East Lansing."], ["Miss P.", "Excellent chefs, service great (Jackie is the best waitress if ur bringing kids shes SO sweet). It's very pricey though u get what u pay for. Kids meals are a bargain. Great, clean atmosphere. Opens for dinner at 4pm on Saturdays, not sure about the other timings :)"], ["Jon T.", "Lovely service, great sushi! A touch dark inside, but that can make for a nice mood :-). I've never done the hibachi side of things, but it looks like fun - someday!"], ["Theresa H.", "I had to go out that way and wanted to get dinner while I was there. I have been to a lot of sushi/hibachi places and this was the least tasty. Their ginger dressing was all wrong, it had too much onion or something. Their soup was SALTY. The specialty roll was delicious and perfect. The hibachi was not what I expected, my shrimp were way over cooked and chewy, my scallops were good but the vegetables were pretty much onions and mushrooms with a sprinkling of bean shoots that tasted like dirt. I was expecting broccoli which is my favorite part of hibachi.  Their dipping sauces were also weak and their soy sauce was also super salty. My waitress was a rock star so at least that was one plus. My meal also came with an after dinner drink or ice cream and I don't drink so I entertained the idea of ice cream and they had ordinary flavors, no green tea or red bean so I declined. I definitely wouldn't go back and would do somewhere else."], ["Carol S.", "Have never had a meal that caused me this much stress. Too much food too quickly. No time to appreciate any one thing. We made the mistake of ordering appetizer. Then all the rest came immediately. No where for all the plates to go.  No one to pick them up. I felt as tho' I was in a race!  We were nearly breathless! Not something I wish to experience again any time soon. Way too rushed; therefore, not worth the $$."], ["Jeff H.", "Was in Lansing for work on a cold and rainy October evening and set out looking for a place to grab a bite.  Seems like almost every chain restaurant in the country can be found at this highway exit and so had to look a bit harder to find something non-chain before we found this one.Nice casual atmosphere with hibachi on one side of the dining room and sushi on the other.  We went for the sushi and all in all a good experience.  We ordered WAY too much but I seem to always do that with sushi, especially when I get into the rolls. And they had a wide variety of rolls.  Only thing I didn't like about the roll options is that so many of them were lacking in raw fish.  Lots of tempura and avocado and sauces, but very little raw fish involved in the rolls.Service was pretty quick and efficient despite the fact that it seemed that our waitress was the only one for a pretty full dining room AND she was also tending bar.  She was pretty impressive.  And cost of everything was reasonable.  2 people had a couple beers, edamame and way too many rolls along with some sushi for $70.  We left at least one full roll on the plate, so could have gotten away with $60.If you are looking for someplace at this exit of the highway that is not a chain, think this is one of your only real options and it works well!"], ["Angela E.", "Ukai is one of my favorite places to go!  The hibachi is amazing!  The filet and shrimp are the best.  Huge portions at the hibachi table.  Very entertaining!  We usually just belly up at the bar though for sushi and drinks!  Scott is a great bartender!  He sometimes has some interesting concoctions he made that he'll let you try (his cucumber cosmo is great!).  All the sushi is very good, haven't had anything that was disappointing.  You can tell it is a well-run business!"], ["Fred K.", "Very nice sushi bar and grill.  There are two dining areas where one the entrance side you have standard tables with a counter and stools section to watch as the sushi's made.  On the other side there's hibachi and talented chefs preparing your selection right in front of you.Very entertaining."], ["Stacy L.", "Always a pleasure to come here.  Always love to get the chicken and scallops.  It is always more fun the more people you have at the table.  A favorite for birthdays and anniversary dinners."], ["Lindsey K.", "This is my 3rd time visiting Ukai. I have been to this location once before and the Okemos location once. This location is newer and has a more open, brighter atmosphere. We sat in the Hibachi Grill area, not the Sushi Bar. The hibachi chef is always entertaining, lighting things on fire and flipping eggshells into his hat. The highlight was when he asked if anyone wanted to catch a shrimp in their mouth. Of course my friend volunteered. Although it was a large target, I'm still impressed the chef flipped the shrimp into his mouth. I had the hibachi chicken dinner which comes with soup, salad, shrimp appetizer, rice and the chicken. My friend had the Asahi special which was lobster tail, steak and he added shrimp. I felt the amount of food and quality was a very good value for the cost. The waitress was fun and attentive and made some nice recommendations for wine. I will definitely go back. It is a fun place to go as a group, but also fun to go with just 2 people and interact with others at the table you share."], ["Gerrie M.", "This was my second visit here.  First time was with a group for a birthday celebration.  We all enjoyed it very much.  Very entertaining way to have a very nice dinner!Second visit was just last week.  We stopped in for sushi (which is not my husband's favorite thing).  The atmosphere was just so-so.  A combination sports bar/sushi bar filled with a mixed age group.  We could do without the TV's.  The sushi was good, but the size of the roll was a little hard to manage with the chop sticks.  More man sized. Made me feel like I was stuffing my mouth!  Staff did not offer any explanation of the sushi choices or offer any recommendations.  Picture menu was helpful and the descriptions were good, so we made some choices and hoped for the best.  It was nice that they offered the one with the chicken (yes, chicken).  My husband at least found this one acceptable.  With one server in the sushi bar area, the service was quite slow.  We were never offered refills on our beverages either.  Overall, I have had better experiences and better sushi elsewhere."], ["Rachel P.", "My husband and I had dinner here and it was great. They were running behind, so we had about a half hour wait even though we had reservations. I had the atomic bomb sushi and he had hibachi. Both very good."], ["Tracy P.", "I love this place for it's food and service. I've never been disappointed with any of the speciality rolls, sashimi, nigiri, maki or temaki sushi. Everything is very fresh. The rolls themselves are quite inventive and fun to try. I mean come on, life is too short to eat yellow tail all the time. If there are two of you, the sushi/sashimi combo is almost more than 2 can eat  - but it's fun trying and a rarity in the sushi world. This is one of the 2 top sushi bars in Lansing (the other is in East Lansing).  I would have given this a 5 star rating but I reserve those ratings for the \"blow me away\" places.  . P.S. there is a hibachi grill but I've never been on that side."]], "Midori Sushi": [], "Omi Sushi": [], "Tamaki Custom Sushi & Wraps": [], "Maru Sushi": [], "Akagi Japanese Restaurant": [], "Sushi Moto": [], "Korea House": [], "Maru Sushi & Grill": [], "Sushi Go": [], "Udon Sushi Restaurant": [["Tyra N.", "This is a new favorite.Authenticity. I don't know the history but it's evident the owner loves and lives here. The crowd is like being in a foreign place and I love it. Unlike being in a small town American diner, I'm not stared at as an outsider. First the eclecticism of the decor, pictures of patrons, the owner and his progression/aging, his wife and family, toilet barseats, a punching dummy, a kissing wall! The menu is on the ceiling with a camera pointed right at you for entertainment and security value I suppose. Theres a large imposing TV playing pop korean (i think) hits that mirror commercial music here.I went for sushi because this is the only place I could find who serves sushi after 9 pm in all of Lansing. Most of the people, all of the people, had udon bowls so I will be back.The sushi menu is limited but I loved my simple and plain sushi roll that included  things I believe were bamboo shoots and others I cannot name. What draws me in, what fills my love is their wasabi. OhEmGee! This place must have an inside man on the wasabi market. This was not just green horseradish, this was sweet and warm heat. The heat radiated from the roof of my mouth not my tongue, amazingly. My sinus cavities were open but I kept eating it long after my sushi was gone.They had a library of bubble teas and flavors. Get this I order my tea to go and it was sealed for safe travel! Dope!The hours are late for the student crowd and I like that.Criticism: Cash only but I'm good with that.Can't wait to go back."], ["Robin K.", "Good prices and very authentic. Kimchi was under \"cooked\" and couldn't tell what exactly was on the menu. Very very small space"], ["Karen G.", "This is hands down my favorite restaurant for a good bowl of beef noodle soup.  The soup is spicy and delicious, and I've never had a better bowl ANYWHERE. That they have bubble tea is an additional bonus.  We drive over an hour to come eat here... it is THAT good.    If ratings were based solely on food, I'd give them something like a 10 out of 5 stars.  (-:Udon is definitely a hole in the wall type of place though.  Maybe not the best choice for a 1st date. Unless you think they might be into siting on toilet seats to eat. It's interesting... for sure.  Maybe not the cleanest or most tastefully decorated.  But, it sure is memorable!"], ["Lylian D.", "This place may be small and a bit grimy, but the food is nothing like this. When you first walk in, you may walk straight up to the counter to order and pay for your food. Where is the menu you ask? Just look up to the ceiling and see the yummy foods you can order. I have been here about four times now and it has been consistently delicious. I have to admit that many of the times I was a tad tipsy while eating their food, but it's still good when I'm sober. My dining companions and I have had the following dishes:Potato Salad, Bean Sprouts, & Kimichi: It's all free and in the clear mini fridge for you to take. Everything is wonderfully seasoned. I don't like potato salad, but theirs is wonderful. Spicy wings: So yummy! Flavorful sauce and tender wings! Love them!Beef Noodle Soup: Tasted like Taiwanese Beef Noodle Soup and was delicious. Beef is so tender, noodles are soft, sliced glutinous rice balls are chewy, and broth is aromatic. I added a bit more soy sauce and spice in my soup, but I tend to like more saltier and spicier broth.Seafood pancake: This is the BEST thing they have here. I LOVE this dish. It comes with a light soy sauce infused with green onion and it's perfect with the seafood pancake. They do not skimp on the seafood here. Be warned: sometimes they don't de-vein the shrimp, but I don't care. It's still good to me. Some might cringe at the price, $12 for this dish, but I think it's well worth it since it is a huge portion with tons of seafood and most importantly, it's freaking delicious! We've also tried the honeydew and taro bubbleteas, and they were decent. Maybe I'll try other different flavors another day.This place is definitely a bit off-beaten and odd, to say the least. That's apart of it's charm. Yes, it might be weird having to sit on toilet seats, but once the food comes out and you begin eating, you kind of forget you are sitting on toilet seats."], ["Scott S.", "Extremely dirty, also the owner likes to flirt and get very uncomfortable with female customers. He even has an Asian pin up calendar that verges on porn for all to see. This place is not kept clean, and I hesitate to think about what goes into my food. Sure, it's cute, but the face they only accept cash makes me believe they aren't even registered."], ["R. L.", "I love this place and I can't even eat any of the food (vegetarian), but the boba tea is awesome and unlike anything else in the area. It's also a cool place to just hang out with friends."], ["Dan S.", "I love this place the atmosphere the style the owner is awesome every dish I have eaton here has been full of flavor!!!! Recommend this place to anyone wanting great food at a great place."], ["Matt C.", "i.e. Udon Sushi BakeryFirst and foremost: It's not a sushi bar, it's not a bakery, it's primarily for noodle soup. I've been coming here for over a decade. It is my favorite late night noodle soup stop.The owner has lived and traveled the regions his food reflects. That's why there's a little Japanese, a little Korean, and a little Chinese. The food has been consistently great for the entire time I've gone, although the menu doesn't change much. There's a large selection of noodle and dumpling soups to choose from, my personal favorites are the Chinese Beef Noodle and Seafood Noodle soups. For those not in a soup mood, there are Korean potato pancakes, kalbi (not everyday), teriyaki chicken, dumplings, and generic sushi rolls (California roll, Inari sushi, eel roll). But the best part of ordering dinner, are the sides offered in the mini fridge --- seafood potato salad, kimchee, and sesame sprouts, they are free with a food purchase.In addition to food, there is a large assortment of Bubble Teas. Whether you want the normal sounding flavors (coke, apple, pineapple, etc) or exotic (milk tea, taro, red bean, etc), they have several to choose from.Also, there isn't much seating, so you may find yourself dining rather close to your neighbor. But no worries, everyone is usually pretty friendly.CASH ONLY!!!"], ["Mairin C.", "The ambience - One of those \"you've just gotta experience it\" type places. Can't figure out where to sit? Ah, the choices. You've got your toilets (not a joke), your worn leather couches, and your traditional tables. The big screen TV blasts a stream of Chinese talk shows and music videos, and an ample number of Shake Weights and Perplexuses fill your time while you wait for food. The food - Some dishes are great, some not so good. On my last trip I got the plain ole' Udon assuming Udon from Udon Sushi Bakery *had* to be good. Not so good. Very bland. But the free potato salad is phenomenal. Hint: You help yourself to it. It may look a little sketchy, but YUM!The drink - Bubble tea. Cheap. Delicious. Best in the area. Get it."], ["Mark W.", "Fun little place that is extremely unique. More of a udon noodles shop than a sushi restaurant. Prices are on the high side but the food is tasty and the ambiance and customers make the experience. It's best to try a few times before passing judgment. Japanese, Korean and Chinese foods with a wide options of add ons. Staff are friendly and accommodating. The Udon, miso and Kimchi noodles are delicious. Try a bubble tea with a meal!"], ["Binh N.", "Awesome little joint for a late night snack.  The udon is really tasty and so is their pig feet and rice."], ["Alan S.", "A year ago, I would've given them 4-5 stars. But now I'm done. I had a long scathing review written in my head, but I'll keep it simple.Great bubble teas (though long wait sometimes). Only one flavor of tapioca though?Concept, entrees, free sides - all awesome in theory. Of late, just nasty! Let's just say I don't even know if that was really beef in my hot pot. If so, it was not a \"traditional\" cut - nor was it what I have gotten for the past year. Service is always poor, but I can deal with that for great food. Cooler with sides is often empty or dirty (thanks previous customers for leaving the tongs directly enslaved in the kimchi). Now, it offers nothing worth coming back for. Two stars only for the memories."], ["Alan P.", "Don't let the look of the inside fool you; as gritty as it may look, Udon has some of the most addicting Asian food in the East Lansing area.*note: the sign may say Udon Sushi Bakery....but please don't get the sushi/they don't have any baked goods. Sorry!I've been a regular to Udon since I was 8 and I still can't get enough.  I'm a student in Ann Arbor now and every time I come home, I make sure Udon is a spot I hit up with my friends.  They are open at weird hours (5 pm - 3 am), but that is because the owners work late every night.  This works perfectly for students who are looking for a late night place to go after a party or just want to hang out late with friends (aka me).As you walk in, you're greeted with an automated machine that says hello in Japanese.  Don't be scared by the things that are in this restaurant.  The walls are surrounded by a bunch of flattering (or not so much) pictures of his customers.  There is even a wall of people kissing!  The place recently bought new tables that have cabinet spacing.  Inside each cabinet you'll find games and toys to play around with while you wait for your food, so feel free to go right on in and play!Also worthy of noting is that if you're expecting up-scale dining, this isn't the place.  This place is for good eats you can't get anywhere else in the area and having fun. The menu is on the ceiling, so look up!  You get a free side of potato salad, kimchee and beansprouts with every dish, so definitely eat up.  I believe the unlimited amount of side dishes you get is a main reason why everything is slightly overpriced. My favorites are hotpot, seafood pancake, spicy oxtail, or spicy tofu soup.  The seafood pancake is a little overpriced, but well worth the money if you're craving.  It's basically an oversized pajeon.  The pancake is about a .5 to a full inch thick in length and fills up a whole plate, so it's definitely filling. The hotpot is also huge!  It easily can be split between two people.  However, it is not really a \"hotpot.\"  It is basically a noodle dish that has been cooked in a hotpot format and then served to you on a plate.  It is served with ramen, rice cakes, imitation crab,  and fish strips.  Udon also has a large selection of bubble tea.  It's not overly good, but it is SO ADDICTING.  It's made with powder, but for some reason you won't be able to stop drinking it.  Add in the fact that it's for a measly 3 dollars while bubble island charges nearly 4, and you'll be coming back every week.  My favorites are regular, chinese green, TARO (by far the best), yogurt, and melon.It's cash only, so be prepared!"], ["Gabriela G.", "Rice porridge was deliciousSticky riceFree potato salad, soy beans in salt water and kimchi for customers ordering food. I didn't try the potato salad, but the soy beans in salt water were delicious and the kimchi, though a bit on the oily side, had a good kick to it.Menu is located on the ceiling as you enter. So walk inside and look up!You sit on either large and super comfy leather couches or on really uncomfortable wooden short stools, whatever is available since this restaurant is crowded!Extra large tv takes up almost half the restaurant, awkwardly placed around the inside of the bar playing loud Korean version of American Idol!Kitchen is around the back. Woman makes food in large pots and canteens like one might see in a hole in the wall restaurant in Soeul, Korea. Tile floors and large metal pots really make you wonder if you are still in the US? or if you were transported into a foreign place and time!Service wasn't great though it may have been cultural or maybe I just looked a bit out of place. Guy wasn't overly friendly and people who arrived after me got their plates 10mins before I got mine. Maybe group after me ordered something more common than the rice porridge. The ramen seems to be the most ordered dish here,  and mine seemed a little more authentic, obscure and less likely to be ordered by hungry ramen-chowing college students.I ordered my porridge without chicken, just seafood and they were very generous with the amount of shrimp and crab meat that swam around in my cup. Prices are super cheap for the quality and deliciousness of the food and portion sizes.They sell all kinds of boba drinks.Udon Sushi is a cultural gem tucked away near a Domino's pizza and a Jimmy Johns off of a main street in Lansing. It's an authentic dive with exquisite food. It's got personality and character and more importantly, great tasting fresh food.i would absolutely come here again!This is the kind of restaurant you want to take your friends and brag about being the one who introduced them to the new \"it\" spot that not many people know about!"], ["Daniel F.", "Everything about this place is fantastic. The food, the bubble teas, the ambiance. It's one of the few places in East Lansing that feels like it has a soul."], ["Drew P.", "This is one of my favorite late night places. Very Asian in food and style and a heck of a lot of fun."], ["Michael D.", "It's too bad it says they're open till 3 am when at 11:37 pm it's not open.   The elusive late night sushi place is still yet a myth."], ["Matt C.", "I love the food here and I love the goofy atmosphere.  I often find myself wishing there was more seating, but I guess that's part of the experience."], ["Aj D.", "Absolutely disgusting! Food is only good when you're drunk. The only decent thing here is their pricing but it speaks for the quality if their tasteless food. The owner also fails in his attempt to create a very humorous and fun ambiance by decorating the whole place with random garbage. A TOILET BOWL FOR SEATS? Disgusting!"], ["Victor U.", "The comic value of the interior is matched only by the quality of the bubble tea. You name it, they'll have it as a flavor. Pineapple to Grass, it exists, and is delicious. Come in, sit down in the massage chair or the fantastic bar stools (trust me), and have a blast. Also, let me know if you take down my score on Tekken."]], "Anqi Sushi Express": [], "Sansu": [], "Asian Buffet": [], "Ai Fusion Sushi & Grill": [], "Mikado Sushi & Grill": [], "Ukai Japanese Steak House": [], "XIAO China Grille & Lounge": [["Erica D.", "I walked into Xiao (pronounced shee-oww) and immediately thought I would be giving them a five star rating... but there are some definite tweeks that left me with more to be desired.Unlike Sean (fellow yelper), I thought the kimono-esque outfits the white hostesses wore were cute, and frankly, kind of hot. I'd rock that for sure. It may be borderline cheesy, but I doubt the owner (who is Asian, by the way) was trying to offend.The interior is fantastic. I was so happy a place in Lansing actually put some thought and design into their restaurant, rather than sticking a bunch of signed posters and Spartan memorabilia every where. The colors of the restaurant are chic, the dark wood gives the place a more upscale feel, and the giant Buddha is worth a picture. I did not utilize the ladies' room, but I hear it is worth a pee.Our waitress was sweet, efficient, and fairly speedy with her service. She did every thing right, and was happy to help when we changed our minds on two things during our stay (a to-go box on one of our meals and yes to dessert after we said no).The menu is expansive and has a few items I have never seen on an Asian fusion menu before. I love duck, and have no idea how to cook it well myself, so my table started out with the duck sliders as an appetizer. These started off the night right. I recommend this choice as your appetizer, and suggest topping them with plum sauce.The entrees come with a small (perfectly sized!) plain salad, which consist of iceburg-like lettuce and was topped with the chef's pinneapple vinaigrette. The dressing was fantastic and unlike anything I've had before, but there were odd pieces of \"salad\" in the mix (like those twiggy, spiky white pieces you find in bagged salad at the grocery store) that I would never present to a customer if I owned a restaurant.For our entrees (and this is where the restaurant fell short), he ordered the General Tso and I ordered the Mandarin chicken. The General Tso was really, really good. Spicy without regret, crispy and tender, and full of flavor. The Mandarin chicken was seriously terrible. There was absolutely no flavor. The \"brown sauce\" might as well have been liquid air. So basically, I ate luke-warm grilled chicken (which went cold way suspiciously quickly), and corn and pea pods. I didn't even want to take it home for seconds (which is my favorite part about eating chinese food). I was so jealous of my man's dinner. The brown rice was delicious, though... I am thankful it was there. I will not be trying the Mandarin chicken again (salt, pepper, soy sauce - none of these could save the dish) and would come back to try the porkloin or salmon entrees that sound promising.For dessert, we had the chocolate banana cake (known by another name which I forget). It was okay, but fell short again. It kind of tasted like a ho-ho with banana cream instead of white sugar cream.I would come back Xiao in a heartbeat, despite my bad entree. I really do appreciate what this place brings to Lansing, the owner obviously put a lot of thought into it, and the sliders and General Tso were amazing. I think the brown sauce just needs to be considered, improved upon, or nixed. I happened to pick the wrong thing on the menu.Check Xiao out (I think you'll like it), support this new business, and don't order the Mandarin chicken. I hope on my next visit, I can give them the five stars I want to."], ["Fred C.", "I've only had the lunch buffet, so I can't comment on the menu or sushi bar.I was genuinely surprised by the food here. As some of the other reviews note, the buffet was a bit small, but the dishes were very well prepared. The General Tso's chicken was really good. The Kalbi was ok, but a bit salty for my taste. Overall very good. The decor is a bit more stylish than many typical Chinese restaurants if that's of any concern."], ["Yina S.", "Overpriced Chinese food. I paid almost 6 dollars for crab cheese.Sushi was ok; It is not the best sushi I've had, but I would be find with that.My friend had sushi combo which came with soup and salad. As he was eating salad, he bit something like a rock and found some black stuff from the salad.One of his sushi also had black stuff (like black ashes)...Service was horrible. I saw my server's face twice the whole time I was there and the restaurant was NOT busy when we dined in.I wouldn't recommend going there."], ["Janette C.", "Great selection of choices....servers give great recommendations. Wonderful flavor ! :)"], ["Nate C.", "I'll admit, I was skeptical. It's a sushi place next to a donut chain in the parking lot of a pharmacy. I didn't expect much. Turns out, this place is actually pretty great, even without the lowered expectations that come with Lansing-area dining. We split a couple rolls, had some plum wine, enjoyed great service, and were surprised by the cool atmosphere when you walk in the door. This may be my favorite sushi place in town. Don't miss the kampyo roll, especially if you're a vegetarian. It was my favorite of the numerous veg options."], ["Ashley N.", "Better off going and buying the frozen stuff. That's exactly what it is. Rice was super dry and brittle. Service was rude and short. Made it obvious they were annoyed when questions were asked. Drinks sucked. Decor was clean, but typical."], ["Lesley H.", "I've been to Xiao three times now and have had a good experience each time.  As for the food and drink, the udon noodles and pho are excellent.  I myself haven't tried the sushi, but my dining companions have and reported that it was tasty and fresh.  They have a full bar and the house cocktails are creative.The decor in this place is really cool, and I appreciate the effort that the owners put into the details.  It's trendy and minimalistic w/ a chic ambiance.  I live in the Detroit-area, and this place reminds me of some of the independent places down in this area.  The owners did it up right.The service has been fast and friendly each time I've been here.  The hostess the last time I was in appeared to possibly be an owner or manager and was very attentive to what was going on in the restaurant.I hope that the people of Lansing appreciate this place and show it by patronizing it.  Lansing is so over-saturated with run-of-the-mill chain restaurants, and sadly, these are the places that always seem busiest.  Show some love to your locally-owned restaurants!"], ["Jack L.", "This restaurant is deceptively large!  The outside makes you think it's going to be a tiny little place inside but it does have some high ceilings and the restaurant goes back further than expected.I went in for a late lunch so the place wasn't all that full.  The servers were cleaning up from what looked like a very busy lunch crowd.  The service was more focused on cleaning after customers who have paid and gone than actually waiting on customers sitting in the place.  I ordered a couple of appetizers and a side of white rice.  The duck sliders ($8) were tasty and artfully presented.  There were 2 of them in an order.  I don't think they were quite worth $4 per sandwich, but it was different.  A slice of crispy duck, in a brown sauce and some cucumber sticks and green onions in a small white bread bun.I also had the potstickers.  Meh.  Nothing exceptional.  Very small, not all that tasty.  Thankfully, I wasn't charged extra for the half scoop of white rice that I requested.  So, the lunch I pieced together wasn't as awesome as I had hoped.  The decor is pretty nice.  There's a full bar and a pretty decent wine list with a few selections by the glass.  I might give them another shot by ordering an actual entree - but the appetizers I chose weren't great for what I ended up paying.  And the service could use some work."], ["Jacqueline D.", "I would give this place a 1 but I feel bad.  My girlfriends and I decided to have a nice valentine's dinner together (since either we were single or bfs were out of state) so we decided to come here.  There was a prix fixe menu, which was fine.  My friend and I opted for the more expensive one while the other girls got the least expensive choice.  My meal was ok and so were the girls, nothing special and definitely not worth our money!  We had beef and it was dry.  Also, I told the waiter that our sushi was really fishy and he replied \"isn't it suppose to taste like that.\"  Then he was like actually I don't really eat that.  OK, for the amount I was paying for that day and meal, that sushi should have been sent back.  It left the taste of sea in my mouth, it was disgusting."], ["Chelsea M.", "I have to say Xaio misses the mark just a little bit. I'm not saying the food is bad, I'm just saying for food is unimpressive. I've tried several dinner entrees, a couple sushi rolls, and stopped in for lunch. At no point did I think \"oh man, I have to come back!\"One thing I do really like is the decor. It is unique and fun. The ambiance was good for a lunch meeting and a enjoyable evening out."], ["Sonia V.", "The service is the only quality part of this restaurant. Their lunch buffet is old! The sushi is old, and everything else looks like perhaps it was made sometime last week. There is much potential for improvement."], ["Benny V.", "The boyfriend (who is a degreed and experienced chef), his brother and I decided to give this place a shot.The decor was nice. It was warm and welcoming but classy. The hostess and waitstaff were nice and full of smiles. Our waitress, however, was either inexperienced or just plain rude. She seemed to only have our table and one other, but was constantly in a hurry to get away from our table. She didn't come back to check on us until well after we had already finished what we were eating of our dinner, and even then she didn't seem to actually care.As an appetizer we ordered the Peking Duck sliders. I was honestly excited about ordering something with this name at a chinese grille. I was hoping for some ingenuity and creativity. Instead we got a bland duck-sausage on a roll. The vegetables were fresh and the sauce was decent, but overall this dish was absolutely mediocre.My boyfriend ordered the Peppercorn Crusted Jumbo Prawns. His prawns (which were not actually Jumbo Prawns but were actually Jumbo Shrimp) was perfectly cooked and delicious, but there were 6 of them, for $16. The bed of veggies they came on was tossed in a sauce that was tasty, and the vegetables were well cooked and seasoned. The brown rice was bland and under cooked.My boyfriend's brother ordered the Original General Tso's Chicken, which was marked as both spicy and a house specialty. The chicken was nicely cooked, but the sauce was not remarkable. He also received a side of the same brown rice, which was bland and under cooked.I ordered the Singapore Chow Mei Fun. The noodles were perfectly cooked, and the dish was seasoned well overall (though I did have to add salt to really bring out the taste of the curry to my liking). The shrimp were cooked correctly, but had absolutely no taste to them (as though they were cooked separately without seasoning, and added to the dish later). The chicken was absolutely inedible. It was unseasoned and significantly overcooked. It tasted as though it was cut into bits, pre-cooked, and then re-heated to be added to my dish.I so wanted this place to be awesome. I wanted it to be as good as the advertising made it seem like it would be. I wanted it to be worth the prices we paid. Sadly, it wasn't.If they can fix the problems they are having with the food and clean up the waitstaff a bit, then it might be a place I'd regularly visit."], ["Lindsey K.", "Xiao is a modern spin on Americanized Chinese food. Sort of like a local PF Changs. The restaurant has high ceilings and a huge buddha statue. The bar has a couple of TVs in it. I did not have a drink, but it looked like they had a full bar. We ordered Salmon and Orange Chicken. The salmon was ok. I felt like it was something I could make at home. Salmon w/ an Asian-y sauce on rice /w asparagus.  The rice was really good, and I'm not usually an empty white carb eater, but it had good flavor and was fluffy. The Orange Chicken was average.The service was good. The server was attentive and checked on us frequently. The manager also stopped by the table to check on us. Overall the place was OK, nothing awesome. I don't know if I'll go back."], ["Jessie W.", "I like XIAO for a number of reasons. First, their atmosphere is very relaxing and overall, a great place to hang out and eat with friends. Second, the fact that I can get drinks AND sushi. Awesome. Depending on what you order, it can get pretty pricey but they have specials pretty often. Service wasn't terrible but also not very memorable."], ["Rob Y.", "We stopped in on a whim the other night and really enjoyed the place.  The decor was terrific and the setting couldn't have been nicer.  We had a terrific server and it was a nice cozy setting.   We held out for a booth as the table that we were offered wasn't going to do it for me.   Our new thing is to either split meals or just have appetizers, which is what we did.  We had the lettuce wraps which were decent.. I agree with another person who said they were sort of bland.  But the portion size was good and I suppose had I tossed a bit of soy sauce on them, they would have been fine. We also had a shrimp avocado egg roll that was very nice!!!  It was paired with a dipping sauce that didn't really add or subtract from the egg roll. I had a yellow tail roll that was a slender filet of fish served atop a small pile of rice.  The fish was very fresh and the rice complimented it perfectly.  But the star of that dish was a very tasty adornment of some sort of sauce.  It was just the perfect little zing to set off the roll.    We met the owner and he couldn't have been more gracious.  All in all.. the food was pretty good but the service and the setting were as good as you'll hope to find in Lansing.    We'll go back and soon.  they have some happy hour specials and late evening specials also.  We might endeavor to find those and take advantage next time."], ["Debbie L.", "Their lunch buffet may seem small, but the food is very fresh. The price was perfect for lunch too. When I visit EL again, XIAO is on my list to visit agian too!"], ["Krystinah N.", "I was excited to try XIAO, we had received $5 off coupons from Commonground and decided to give it a go. I found nothing memorable about the food. We had the duck sliders-which tasted bland, and the chicken lettuce wraps.... also bland. The only thing I liked about our experience was the waiter and the decor. I was hoping to walk away raving about the place, but was pretty disappointed. Give it a whirl if you are willing too, but I wouldn't recommend it. I hope they focus more on flavoring and even just basic seasoning."], ["T R.", "I really had high hopes for this place. The sushi is just meh... It's overpriced for what you get and is just average in flavor. Kind of a let down."], ["Nichole W.", "I went here on a date friday night it was lovely. love the decor love the food drinks were amazing and prices were lower than i expected. I had wonton soup and general tso chicken it tasted great. The waitress were a little slow so if you are looking for a fast meal this is not the place. But its great for leisurely dining. Make sure you get a booth and not a table the chairs are super uncomfortable. Oh and they had live entertainment"], ["Kathy L.", "I like to try new places, and went here with my daughter and friends.  I was not impressed with the prices, definitely.  High prices for just so-so food.  I had chicken and broccoli, and the brown sauce it was drenched in was not very tasty.  And way salty.  I ordered the chicken and broccoli, and it came with about 1/2 cup of brown rice and 1/2 cup of lettuce with ginger dressing, and my bill came to $16.  Maybe those prices fly in Chicago or New York, but in Lansing??  I will not be going back."]], "P.F. Chang's": [], "Sushi Ya": [["Erich Z.", "I still love Sushi Ya, and its new location is nice, although to be totally honest I liked the old location a bit better. I don't know why, it just seemed to be a great part of the neighborhood, very friendly and fun, and now it's gone quite a bit upscale, with nice new booths and décor. It's almost a bit too, well, commercial. Don't get me wrong, it still has the friendly guys behind the counter, the smiles, hellos, and goodbyes that made you feel at home. But I miss the old place, with its skimpy decorations, crappy tables, and homey atmosphere."], ["Amy A.", "This has to be my favorite restaurant in all of Lansing. Every time I go back, I make sure to eat there. Delicious!!! Their hours are a bit odd, but man, are they worth it!"], ["Alexandra K.", "I live right across from Sushi Ya! and I have a friend who resides in the apartment above it, so to not venture to this establishment would have reflected negatively on my behalf. Do not let its size fool you, Sushi Ya! offers some of the best sushi in East Lansing. It is a bit pricey, but the price includes soup (miso) and salad (ginger salad). The presentation is a great preface to the absolutely delectable options the restaurant prepares. They feature many mainstream rolls (from Kampyo to California) while also featuring some local specials like the MSU roll. Although East Lansing has many sushi restaurants like Omi and Q Sushi (another personal favorite), Sushi Ya! out-ranks them all with its friendly waitstaff, extensive menu, and hole-in-the-wall location."], ["Annemarie B.", "In gerneral, this place is good.  The sushi is pretty tasty and a miso soup and salad with tasty ginger dressing are included with every meal... A few rolls are MSU themed, which I always thought was cute."], ["James N.", "Sushi is decent it would be better if it wasn't so expensive! The one in Kalamazoo is better if you want great sushi at this expensive price!"], ["Suzy Q.", "Sushi Ya has great food, fun atmosphere and delicious sushi that will make your mouth water.  I personally love the MSU roll, Octopus and White tuna roll.  The sushi chefs are fun and make it a welcoming place."], ["heidi s.", "I am a fan of the food, but not the service.With so many \"unique\" rolls I was dissapointed you could not try a sampling of them.  How do I know if I will like one roll enough to spent $12 on it?  I would like to try a varitiy.  Maybe if you go with a group it would be better. The spicy tuna roll was spicy, but by the end it started getting a little salty.  The tempura shrimp roll was good, however had minimal shrimp.The waitress gave me my bill halfway through my meal, I still had half a plate full of sushi!  I guess I was not allowed to order more!  Again, maybe the resturant is not solo diner friendly, but the food was good."], ["Charles B.", "After believing that Sushi Ya closed, I was very surprised to learn that they simply relocated to a nearby location. The new building is a much needed update compared to the old location. Overall, I would recommend Sushi Ya to those looking for a casual sit-down, with good affordable sushi. The waitstaff, along with the chefs hold a pleasing and welcoming attitude to customers. The menu has been expanded, and will have you looking over it for several minutes due to the amount of content, which will leave you content with whatever you choose. The wait time is fairly short compared to some of the nearby sushi restaurants. Something that sets Sushi Ya apart from its competition is free salad and miso soups. Also, they will serve you a small fried banana with chocolate for free after your meal. Overall, I would recommend Sushi Ya, and will continue to dine there."], ["Matt R.", "This place was pretty cool. Small, but nice on the inside. Parking is non-existent, but not the end of the world as we know it. The sushi was really good and the service was very very friendly. Props to the spicy tuna roll here, it is even better than SanSu. Price is pretty comparable to other places. Overall, it is a good choice and I'll be back!"], ["Jimmy M.", "I really liked the old Sushi Ya but this new one doesn't cut it for me. The service is fast and friendly, but the prices seem a bit high. I've gotten sushi at most places in EL and I feel Sushi Ya costs the most. Granted you get free miso soup and salad but most places besides Omi do that too. The new one seems a bit crowded even though its actually  bigger. The food wasn't bad."], ["Rachel S.", "I had the absolute worst experience at sushiya. I have never in my life been treated the way I was EVER at any restaurant, which is disappointing because this was my go to place for sushi. I have been eating here for years. It was a Thursday night a little after 9, I ordered takeout and like always would be ready in 10-15 minutes. I got there around 9:30, my friend and I decided we wanted to eat in and asked while we were paying if it were okay that we stay and eat our take out. The waitress said of course and asked if we wanted anything to drink. About 5 minutes into us eating our salads, another waitress who had just got done putting food down on a table behind us, said that we can't stay and eat because the dining area is closed. WTF??? I said \"Why? the dining area is obviously open, you just served these people and you don't close until 10pm.\" She argued with me and my friend to leave. This is a major no-no in the restaurant industry. Why on earth would you ask someone to leave in the middle of their meal. It was just outright absurd, and I have yet to contact the manager. Im just majorly disappointed. I have had awful service a few times before, but this tops all. To be honest, I wanted to smack the girl for her rudeness and stupidity. Beware of B*TCH waitresses!"], ["andrew l.", "affordable sushi, good service. as far as i can tell, this is a win-win situation."]]}