{"Thai Village Restaurant": [["shara A.", "She asked me how spicy I wanted it.  I asked her \"whatcha got\"... when she came back with \"Mild, Medium, and High\" I couldn't help but giggle... I've had \"hot\" in my life, but never \"high\".  To be safe I ordered the medium... LOL.  Turns out her description of the spice levels was pretty accurate.  No more laughing.  Twas pretty darn good if you ask me.  Going back!!"], ["Megan K.", "A few friends and I were thinking of Thai for dinner so we checked out Thai Village since it seems like Bangkok House will not reopen anytime soon. I got the spring rolls and chicken pad ped medium. There was only one waitress which was okay because it wasn't busy at all. She was initially attentive but then it seemed like she no longer cared once she took our order. Usually spring rolls come out quickly because they are flash fried. It took probably 20 minutes for our food to arrive and it arrived one at a time, she didn't bring all of our food out together so it was really awkward. We were also the only patrons in the restaurant at that time, I can't imagine how long it would take to get food if they were actually busy, probably an hour or so. The spring rolls were pretty bad. They were all rice noodles, there was one tiny piece of carrot and that's about it. The sauce wasn't the typical sweet vinegar sauce, it was like an orange duck sauce which wasn't particularly appealing. My curry was decent but they use the cheapest cuts of meat and there was some globs of fat I had to pick out. The flavor was good, I just wish they would have used good meat instead of really crappy stuff. I would not eat the seafood here based on the quality of chicken they gave me. It was super cheap, though. For three entrées and an order of spring rolls it was $25."], ["Benjamin C.", "I've been here twice now and the food was incredible both times. I really like this place. I've had the sweet and spicy chicken and the drunken noodles with chicken, both were excellent. My friend got the pepper steak and said that she really enjoyed hers as well. The crab rangoon is some of the best I've ever had, and the plum sauce they give you is perfect for dunking them. Soup came with both my meals. My choices were egg drop or something spicy, I can't recall the name, I went with egg drop and it was phenomenal. Maybe the best I've ever had. I am really picky about my egg drop because more often then not it tastes too strongly of egg. This had a subtle egg flavoring but the soup was more of a broth. It had cabbage and green onion in it which is what really put it over the top for me. Lots of menu options for vegetarians. Both my meals came with lots very well prepared veggies.The service is good. No problems at all. With a place like this you come here to stuff your face with incredible food, not to worry about great customer service. The server was polite, prompt and even cracked a few jokes with me. I'd come get their food even if they insulted me every time I walked in the door.I only wish I lived closer. I would visit this restaurant on a frequent basis."], ["Jessy B.", "Tried this place a few more times and it was just never authentic.  It's like they use bottled sauce or something.  Nothing ever seemed fresh and it turned into a congealed glob pretty quickly once it cooled down......I've had my fair share of delicious Thai so maybe I'm just picky.....but yeah this isn't my go-to place...."], ["Samantha S.", "Food came out pretty quick and was delicious! Definitely could get two meals out of one dish. Prices were pretty good too"], ["Ryan B.", "Their prices are pretty reasonable, and their food is delicious! I really like the Pad Thai with Chicken. They do a good job of spicing the food at the level you request."], ["Katie K.", "Siam Rolls were amazing.  The rest of the food we ordered wasn't what we were used to...but it was ok. I expect Spring Rolls not to be fried, rather to be fresh...but I know they come both ways.  Oh well.  I expect Pad See Eew to have really soft, very broad noodles...this pad see eew had thin noodles, I guess I also expected to have more broccoli in it...The Spicy Pad Thai was ok, needed more sauce though.  In retrospect, I should've read the reviews to help me in ordering the best things off the menu...because the reviews were spot on with the Siam Rolls."], ["Jason F.", "The food is great.  Siam Rolls, Pad Almond.  P28, and  Sweet & Spicy Chicken are among my favorites.   Ask for your food extra spicy and you'll have a moment of bliss.The service is lousy though.   Fast, but lousy.   I don't often feel guilty for giving a 20%, but here, it almost feels like I'm rewarding them for punching me in the face.  Seriously, it's that bad.Overall, however, the quality of service doesn't matter.  I keep coming back over and over and over..."], ["Alf O.", "Tasty Thia.  Friendlyish service.  The interior could use a little splashing up, but is comfortable nonetheless."], ["Diedra S.", "I'm here. Right now. With a big plate of yellow curry and a bowl of tom kha. My tummy is so happy I've been compelled to jump on here and leave this review."], ["Apollo L.", "Without question, this is the worst Thai food I've ever had in my life. I did give it one star because the food was very inexpensive, and it was prepared very quickly. PSYCH! I gave it one star because Yelp won't let me give it zero. A couple of points to start off with here:(a) Thai cuisine is one of my favorites, and I eat it often(b) I haven't gotten on to write a review in quite some time, but the horrendous food prepared by this restaurant inspired me to do soIf there was a choice between never eating Thai food again for the rest of my life and eating one more time at Thai village, I'd be willing to completely forego Thai food forever. I ordered the \"Drunken Noodles.\" I'm not sure if the noodles were intoxicated, but they can't have been prepared by a sober person. They were flavorless and overcooked. I don't know this for a fact, but I'm relatively certain that these noodles were cooked in crude oil. (You could get better Thai food from one of those prepared packets in the Asian section of the grocery store.  If this is the best Thai food in Lansing...wow.)I don't usually like to waste food, but I paid for my meal and left after two bites. I had to go to a freakishly fast sandwich shop nearby so that I could manage to get lunch during my break.On the upside, if Thai Village would consider cutting down their oil consumption, it's entirely possible that we can reduce our dependence on foreign oil without having to resort to fracking."], ["Rebecca G.", "Love love love this place. The Siam rolls are simply awesome! The homemade soups are fab especially the Gai Tom Kha. As for entrees, my go to is the P2-Pad Ped Beef (onions, bell peppers, mushrooms, and eggplant). So good!!! Keep in mind, this place gets packed at lunchtime and seating is limited. People begin arriving around 11am and the lunch hour lasts til about 1:30p."], ["R. L.", "Absolutely no. Food poisoning. Rotten-tasting food. Loud TVs."], ["Amanda D.", "When my husband and I stopped in for a quick dinner, we experienced so-so food with pretty bad service. This was especially surprising considering we were one of two couples in the entire restaurant.It took over 20 minutes for our appetizer to arrive (Siam Rolls...these were actually pretty good). My entree was delivered first with no comment from the waitress about when my husband's would arrive. In fact, she didn't speak much to us at all after she took our orders. When my husband's meal was finally delivered to the table, we were very short on time and he asked for the check and a couple of boxes. The waitress soon returned with both, wordlessly tossing the check at him. Had she been bustling around serving several tables this behavior would have been slightly more understandable, but she was spending her time sitting alone behind the front counter.We didn't eat much of our meals, but what we did eat was just okay. Definitely no where near good enough to overlook the poor customer service. We wound up throwing out our leftovers later that night.If you're looking for good Thai food, I recommend Taste of Thai in EL or Thai Princess in Okemos. We keep hoping to find good Thai food closer to our home on the west side, but so far that just hasn't panned out."], ["Keith L.", "I can't get enough of P18 (Peanut Curry) and P19 (yellow curry)! Its so good. Great location with pretty good service. It gets really busy during lunch but I know when to beat the crowds so I always have a good time. I generally ask for my check soon after I get my meal if I am having a quick lunch because I know it will take a while before they come around again."], ["Neil V.", "Thai village next to the cooley library is a good option for students studying in the library, not wanting to waist a lot of time eating before getting back to work. other then that, i'd never eat there. the masuman curry is watery- not like the thick flavorful curries i get just down the street in east lansing. i've never had the crab rangoons or anything other then the curries, but i leave it to chen's to get my rangoon fix."], ["Lorraine H.", "The new dish, Sweet & Spicy Chicken, is TO DIE FOR. If you don't eat here, you are missing out on life's great pleasures.Try the Tom Yum soup, spicy-HOT! I love Thai Village, it is my favorite restaurrant."], ["Shanna H.", "Food was delicuous!! The portions were huge! We got soup with our meal and never had it before, glad we tried it. The food was so fresh and delicious! Good service too."], ["Smitha V.", "We have ordered twice from Thai village for catering for my sons birthday.both times they were prompt,right on time and the food  was excellent.the owners r very friendly .the lady helped us to find the correct menu we need for our party that fits our budget and then they delivered it correctly on time.the food was hot and extremely delicious.all our friends loved it and kept on asking where we got the food from.this is not the first time this happened .the last time we ordered which was two years back too the food was delicious too.this place is a gem in downtown lansing.when you order Thai food always ask for help unless u r from Thailand .they are always willing to help you out to choose a dish which suits your taste .try their chicken satay ,Penang chicken,sweet and spicy chicken and fried rice.without doubt this is the BEST Thai restaurant out there with excellent service.i m giving it the highest rating and review  because they helped make my party a smashing success!"], ["Sam A.", "Great food for relatively low prices compared with a lot of Thai restaurants. We went for dinner at 8:00 on a Monday night and got a spot right outside the door.Dinner here includes hot and sour soup which you almost never get anymore. It was very good and definitely had a little kick to it. We ordered the crab rangoons and the veggie spring rolls to start. The rangoons (5) were delicious, fresh with a great flavor and the sauce was extra citrusy. Spring rolls (2) were pretty standard (and very hot). For our entree we got the Pad See Ew which I am always hesitant to do at new places since I'm pretty picky about the dish, but we were very pleased! We ordered it medium with tofu. It was just the right heat, the broccoli was fresh and perfectly cooked, and there was lots of gravy which is key! Total bill for two apps, two soups and one entree was $13.50. What?! Awesome. Couldn't even finish all the food between two of us, so looking forward to some very good leftovers later tonight. Between the low prices, nice service, and delicious food, this place was a winner. We'll be back.EDIT: Changed from five to four stars after a couple more visits with friends. We've had two distinct dishes included the Pad Thai here that taste fine but have a VERY strong smell...I won't get into specifics but definitely something you don't want your food smelling like :P  We've been sticking with the Pad Se-eew since then and still love it."]], "Thai Princess": [], "Thailand": [], "Fortune House": [], "Taste of Thai": [], "New Thai Kitchen": [], "No Thai!": [], "Bangkok House": [["Brad F.", "Easily the best Thai food in the area. Very quick take out, excellent dine in experience. Wait staff are always extremely courteous. Food is served piping hot. Can't beat the pad thai, or the fried rice."], ["Tyra N.", "Low key - This place slipped my radar several times as I pass by the joint regularly when I visit my friend who lives less than a quarter mile east. The dining area reminds me of typical economy asian restaurants/diners. A slew of tables with not many people around. The service seemed like family owned. Very casual and heavily accented. Very friendly as well.The menu was grand and someone like me, who wants to try everything, was overwhelmed but I settled on something that my tastebuds could handle. The intro was a broth soup with onions and a dumpling or two. I apologize for not knowing the name. The soup could have been my meal, it was perfect and soothing. I'll be back here mid winter. My main course was medium heat. Of course I don't remember the name of the dish, but I do remember the heat and flavor. Thai food, GOOD thai food has both. I had to take it slow and steady. My friend had the well known pad thai at low heat. The taste was a sweet spice and I spent more time digging my fork into his plate than my own. I used his dish to settle the heat. Servings were plentiful, I took my dish home, this was recommended because my host noted the heat would simmer after reheating and the flavors blending. It did but it was still fire. The rice wasn't my favorite, I like a stickier variety but it did the job.Oh and their Thai Tea one of the best out there, I've only had about 4 but this one takes number 1."], ["Casey B.", "Absolutely one of my favorite Thai restaurants in Lansing. I love coming here for lunch.  The waitress is so funny and friendly. It blows my mind that she can remember exactly how you want your food. I usually get medium, till one day my lips, gums, and teeth were burning. I told the waitress it was too hot and she said the peppers were at their peak and she made me a new dish, no problems. One of my favorite things to get here is the spring rolls with this amazing sauce that comes with it. I'm not sure what they put in this sauce but it's A1!  Also make sure you try the cucumber soup. It's so simple and refreshing."], ["Megan K.", "I hate to write this review because I truly believe that Bangkok House is the best Thai restaurant in the Greater Lansing Area, however there have been some issues as of late with their service. They renovated the restaurant a little while back so it is much more aesthetically pleasing. I still get takeout, typically, so the décor didn't matter much to me. Bangkok House is a family business and they typically only have one worker on the floor, she takes orders in the restaurant and via telephone, delivers food to tables, rings people up and even helps in the kitchen at times. They really need to hire more staff.Two months ago, I called ahead for takeout and was told it would be 30 minutes. I arrived on time and there was a line nearly out the door. We were all waiting for our orders and the poor worker was running around like crazy since the dining room was full too. I waited another 30 minutes in the restaurant for my order. An hour for takeout is pretty obscene. Then just this week, I ordered takeout again. I ordered spring rolls and chicken gang ped, hot. The lady repeated the order back to me on the phone and told me it would be 10 minutes. I showed up, she repeated the order to me again, handed me the bag, and I paid. There was no one in the restaurant at the time I picked up my food. I got home and I had an order of spring rolls and beef masaman curry. It was good but it wasn't what I wanted/ordered. I guess from now on, I'll be checking my bag before I leave."], ["Liz F.", "Unfortunately, they are closed due to fire damage. According to LSJ they had an electrical fire in June and are closed for repairs. I hope they reopen very soon!"], ["Kevin P.", "Mehhhhhh. This place isn't anything special. The service sucked, and the shrimp tasted a little fishy. It's in no way awful, but i'm probably not going to go there again."], ["Laurie D.", "Went today at 12:15. Place was closed. Wood across door. Anyone know if it will open again? There was wood across the front door too. Not sure what to think."], ["Cathy W.", "Best thai food I've ever had. I always intend to explore the menu more but I have to get pad thai every time I go, because it's that good."], ["Tim M.", "The Bankok House is your typical Thai cuisine restaurant with better than average food and just the right pricing. The food is always spicy and well cooked. We've never had a complaint, it's always exactly what we expect for the money.Best Thai takeout in Lansing. I wish I had more to say about it..."], ["Erin K.", "Best Thai I've ever had, especially in the Lansing area. I can't believe this place is so unknown, it was empty when we there for dinner. The decor is a little outdated but it was clean, the food made up for everything. They obviously use fresh authentic ingredients. We got soup with our meal that we didn't even expect, it had a wonderful flavor. Everything was a little spicy. I ordered the Pad Thai mild and was extremely pleased. My husband had the Pad Ped medium and it was extremely spicy but had amazing curry and coconut flavor. We also ordered the chicken wing appetizer which was also good, crispy fried chicken with a sweet dipping sauce, we probably won't get it next time. We will definitely be back!"], ["Nick B.", "The Pad Thai with pork was very good. Most inspired thing to order at a Thai restaurant? No.  However, I like the dish and it makes comparing Thai places easy. The medium wasn't hot enough for me, but a dish of chili sauce was produced when asked. Other food: The deep fried spring rolls were excellent and seemed to be made in house.  The chicken wings were fried perfectly, but needed the sweet chili provided. Spouse's Pad Khing was very flavorful, unfortunately light on the beef, and the snack cupboard was raided later in the evening. Table service is OK and very friendly. Servers are also responsible for handling the take out orders and may be hung up at the counter for a bit.We'll be back and willing to experiment."], ["Mari C.", "My favorite restaurant in the city. I normally order the  Pa Nang and Pad Kee Mao. I get them both with tofu. They are absolutely amazing. The sauces they make are incredible. Also a great place to get a cheap drink with your dinner. They've recently updated the restaurant. Truly is a hidden gem in Lansing."], ["Michael C.", "This is a very low key and unpretentious place in downtown Lansing, but it was my introduction to Thai food when I lived there and it's always what I end up comparing everything else to."], ["Mallory H.", "Not only was this bad Thai food, this was the worst food I've EVER eaten at a restaurant. We ordered pad se ewe and chicken panang curry. The pad se ewe was almost black and tasted like soy sauce and  sugar dumped over noodles. It was so sweet that it was inedible. The curry was thin like a broth with no veggies except peas and was extremely salty. I did like the soup that came with the meal however it was extremely salty as well. The service was fast and the waitress was nice until she saw that we obviously didn't like the food and then proceeded to ignore us for the remainder of the meal. Will never come back here again."], ["Troy B.", "A very tasty meal, I had to go with my 'no fail dish' Pad Thai.  Ordered Hot and it could have had more bite.  I recommend getting the spice rack so you can kick it up.Dinner came with Sweet & Sour soup.  Ordered an appetizer, Giew Tod, minced chicken in a won-ton wrapper then deep fried."], ["R. L.", "Delicious and flavorful food! Good prices, big menu, and very nice (although busy at times) staff. Get mild if you want a little kick, medium if you like heat and spice, and hot if you want to sweat. Please try this place! It's fairly run-down and kind of dingy but the food..oh the food.. it is the best Thai I have had in Michigan. I love you Bangkok House, and I truly appreciate all your hard work!"], ["Andy B.", "I've eaten at just about every Thai restaurant in Lansing and many more throughout the country, and this place is definitely in my top 3. Their interior and exteriors are newly remodels and the dining area is clean. The Pad Thai, Pad Kee Mao and the red curries are fantastic and the prices can't be beat. Most dinners run about $8.00 (a couple more dollars for seafood).  The spring rolls are also a favorite of mine, and they run a couple dollars for two. If you like hot at most Thai restaurants, go for the extra hot here."], ["Ana P.", "It was by far the worst Thai food I have ever had. I've ordered pad see ew at numerous other Thai restaurants and I have never seen it that disgusting. The food was inedible because it was pure sugar mixed with soy sauce. Their food is either salty or sweet. I was literally sick to my stomach that night. Will never go back and will not recommend. We had a couple of bites and asked for our check. The waitress asked if we wanted a box for the food that was hardly touched. When we said no, she didn't even ask how the food was and immediately brought our check. Horrible!"], ["Gary H.", "Every dish is Thai hot, if you're one of those \"not too spicy\" people just stay out. The Tom Yum is so delicious. This is the most consistent food in Lansing, I've never had a single item served any different from any other trip. Love it. This is the place I always take a friend to see how good the food is in the Greater Lansing area"], ["McSaddle X.", "I was crestfallen when I came for an early dinner at 3:00 PM and found them to be closed. Finally, I tried one of their curries, ordered extra spicy, and was not disappointed. Often my caucasianess leads restaurant owners to deny me real heat in my Eastern Cuisine, but not here.  This is the best Thai I have had in the Lansing Area. You are a fool if you live here and fail to give it a try."]]}