{"Fung Chinese Restaurant": [], "China Garden": [], "Chengdu": [["Marc C.", "Chengdu really has 3 quite different services. There's an eat-in restaurant, a popular take-out option and a slightly rowdy bar.To get your take-out fix, Chengdu is a decent, if expensive, option. The food is reliably good and the portions are generous, although slightly costly. They are quick to prepare your order, so you'll often be able to get your food 15 or 20 minutes after calling-in an order. The scallion pancakes are highly recommended!The bar is surprisingly busy and has a 'local' kind of vibe. That's not to say that you won't be welcome if you stop in for a drink, but it will be loud with plenty of conversations between regulars. If that sounds appealing, then this is your place."], ["Rosanna M.", "On my last internship day, we decided to come to Chengdu since they have donated food for one event we sponsored in April.I've only been here once before, but it's been so long that I didn't remember if I liked the food or not.  The parking lot is very small, only enough spaces for maybe five or six cars, but they did have a sign indicating additional parking elsewhere that was within walking distance.Service was exceptional.  Our server left a pitcher of water at the table for us, and the complimentary fried noodles with mustard and duck sauce was a nice pre-meal treat.  I ordered the firecracker chicken lunch with egg drop soup and brown rice, while the other people in my party ordered General Tso's and sesame chicken lunches.  The firecracker chicken came as thin chicken strips, breaded, fried and tossed in a sauce that wasn't as spicy as I would like, but still very good.  The only thing about the restaurant was the faint smell of \"clean sewage\" (if that made any sense) coming from the back of the restaurant where the bathrooms were, which made me lose my appetite when we came into the restaurant from the back entrance.Overall good service and good food.  They just need to do something about the sewage smell and then I would go back."], ["Joe B.", "I had high hopes for this place! I wasn't to impressed. The Benefits of Chengdu that I found were:- They are open late (11pm Monday-Thursday) and later on the weekends- The venue is nice! Large dining area, substantial barThe pitfalls on the other hand:- Small one way parking lot- I waited an extra 10 minutes in the lobby for takeout after I was told 15 minutes- Sweet and sour chicken was soggy by the time I got home- Chicken and broccoli was served in a flavorless soup- No combos for dinner! I had to order everything ala-carte (a little more expensive)The steamed pork dumplings were the best part, I could eat 100 of these lightly wrapped poppable beasts (with water chestnuts and spices). I may give it another shot, but if I do I'll go for lunch or sit inside for dinner!"], ["Sanh A.", "I was turned off by Chinese food after purchasing fried chicken and dim sum here one Saturday. I waited for the place to open all Saturday morning. When I opened my box of fried chicken I literally wanted to break down into tears! The chicken must have been fried in three week old oil or they  gave me chicken from two days ago! The texture was off! How can you have fried chicken that isn't crunchy?  The chicken reeked of Chinese five spice! I wanted to gag, I wanted to vomit everything out! Now the rice that accompanied the chicken must have been bad as well bc it smelled musty! I wasn't ordering off the lunch special I was paying full price! I expect edible mediocre grade rice, I knew I wasn't getting Korean grade rice but goodness the pile of **** served to me was pure disappointment! My dim sum was okay but I could have had a better batch if I went to Five Star Farm Market! I won't ever be back even if I'm starving after 10pm!"], ["Kathryn C.", "Excellent scallion pancakes and boneless spare ribs! I visit this place every time I'm in town."], ["Chenna V.", "My review is completely based on food since I haven't dined there, I had takeout.I tried chicken corn soup and chengdu chicken.The soup was good but chengdu chicken seemed like an americanized version (sweet and saucy). Maybe, I'll try dining here sometime soon and update my review soon."], ["Keith B.", "I must revise my earlier review as I went to dinner there on March 6, 2015. It's as if it was a different restuarant from my prior lunch experience two weeks prior. Soup was cold and had to be sent back. We ordered the same dish that I raved about from lunch it bore little resemblance in both appearance and presentation. It wasn't very good at all. Boneless ribs were okay but it's hard to ruin them. Only the egg roll was as good. Oh well, there are better places for good Chinese food only a bit farther away."], ["Janelle S.", "I came in here around 8pm on a Friday night.  We sat at the bar, which was fairly crowded.  It seemed unnecessarily dark in there to me and there was some strange smell I couldn't quite place.  In any event, I ordered a drink and the bartender was very attentive.  After that, we decided to order a few apps - edamame and dumplings.  They were both okay, but not amazing."], ["Erin E.", "Loved the fire cracker chicken. Prices seemed steep but you get a ton of food. The chicken dish could easily be three meals. Cocktails are delish and very reasonably priced. Highly recommend for a nicer chinese experience than takeout."], ["Byron D.", "I have visited Chengdu for evening meals, the food and service have always been fine.  I have camped out in the lounge and watched a couple baseball games as well.   I did not realize they had a lunch special.  I noticed that Josh S. Mentioned this in his review.   I uploaded an image of the lunch special menu.  The pricing here is lunch special pricing.  That said, for $1. more  (plus tax and  tip) you can have soup, great service and sit down dining.  I was seated by a host, and almost immediately I placed order with a server.  General Tso's Chicken with Brown Rice and Won-ton Soup.  I was served complimentary water and fried noodles, while my order was being prepared.  My soup was served ahead of the entree, after the entree was served, a waiter checked in to see if everything was OK.  As I finished eating, I was offered tea.  I was surprised to see this high level of service.  There were 40 High School students there on a Chinese New Year class trip!!  The staff still attended to me and a few other diners while this was going on.I took a picture of the General  Tso's Chicken, I hope it is uploaded.  It really was wonderful.  A truly huge portion of well prepared delicious food.  Lots of Broccoli and the rice was very good as well.  All in all, I have to say... even though I was recently impressed by a local take out restaurant.  This place is an exceptional value.I spent $10.50 including tax and tip.  If I just wanted to order take out, the total would be $6.95 plus tax.  Look at the food!!!  Wow.  Very nicely prepared, a great value and the service was really a nice change of pace for lunch."], ["Stephen T.", "I will say I really enjoyed my meal at Chengdu this past week.I have become more and more unimpressed with the local Chineese restaurants by way of there offerings and how I do not feel good after eating from them.I enjoy general Tao chicken and have found that places like Green Tea, Butterfly and Chengdu all like to use fillers with the chicken. It's deep fried and then sauced so u have no idea how much is filler and how much is chicken.So, with that being said, I already knew how the Chendu General Tao was prepared, I ordered the sesame chicken (all white chicken strips) and asked for the General Tao sauce. This was fantastic!!!!It had a awesome crunch, was tasty and had the heat of the Tao sauce. I highly recommend it if you also do not like the filler ( see picture).The hot and sour soup was definitely the best I have tried in the area.Everything else that the three of us ordered was very good.So far, Chengdu and Saigon Kitchen is the best Chinese I have experienced in our area for not feeling like garbage an blotted after eating.I am craving to go back!"], ["Fiona M.", "A proud institution that is starting to show its age, both in terms of food quality and service.This area was never really rich with good Chinese food, so Chengdu used to be pretty well-loved.  (I'm sure it still is, in some quarters.)  As others here have noted, however, it's something of a shade of its glory days.  While the food has snappy names like Firecracker Chicken and Rock 'N Roll Beef (seriously!), the quality has deteriorated to generic take-out level, albeit with prices closer to sit-down range.The service is generally chipper and the take-out guy is unfailingly charming.The bar at Chengdu's is often  hopping, which makes me wonder if that's where most of the attention goes these days.  (Who cares about entrees when you can make a few bucks a pop on high-end booze?)  It's undoubtedly a fine place to knock back a few and munch on teriyaki.Now that the area is booming and getting filled with good eateries in Chengdu's price range, we'll see if the old girl tries to step it up a bit to complete.  It beat the hopeless Lemon Grass easily enough, but these new guys are frisky."], ["Peggy N.", "Very disappointing. Our experience: We made a reservation, but we had to wait more than 20 minutes for a table. Ok... It was Xmas and busy but the service was slow. Slow to get our drinks. Appetizers (egg roll, egg drop soup and hot and sour soups) were not tasty. My husband's meal was delivered long after everyone else had their main dishes. The waiter never came back to check on us. My dinner, vegetable chow fun had too few vegetables. Very salty. The waiter never came back to fill water glasses, so I flagged the hostess and asked her for water. Overall, meh!! We won't go there again!"], ["David M.", "Stopped in for an early lunch and was not disappointed. Decent wonton soup, great eggroll, good fried rice and very nice Shrimp in Lobster sauce. These were real prawns . . . like it's supposed to be. It was a bit odd that the place was empty on a Thursday at 12:30, but they had plenty of take-out orders. Very nice ladies at the front of the House. They made it fun.Nicely appointed with tablecloths, easy rear parking and a clean restroom"], ["Josh S.", "I've been here dozens of times and had nothing but good experiences.. until today. I've had chinese food hundreds of times in my life. As a Jew, I decided to go here for Christmas lunch. Not only did they not allow me to order from the lunch menu at 1PM.. These people drowned my food with MSG. It's been 4 hours since I ate the food and I still have a horrible headache from the MSG they poured into my food. My last post on 11/11/11, I gave these guys 4 stars. I'm going to have to bump that rating down to 2 stars after my experience today. Hey, Cheng-Don't! Chill out with the MSG!"], ["Anuj T.", "Really cheap drinks, that are strong and taste good! Food was also fantastic, didn't taste like a run of the mill Chinese food place. I went there with my girlfriend and we enjoyed a few dishes, the noodles(the chow fun in particular) and fried rices were above our expectations. The bar had sports and music playing, and a lot of room to sit. The restaurant area was quieter and good for a family meal, date, or large group."], ["Shane G.", "I wanted to give this a four, but the smell of the urinal pucks they use in the bathroom permeates all the way to the dining area. They smoke out back too, but must leave the door open because it also reeked of cigarettes. The service was iffy; we received a warmer goodbye than greeting.Parking was tight... I have no helpful advice. Make your sacrifice to the parking gods before you leave and hope it's not busy.Their pan fried dumplings were awesome. The sauce they serve them with tastes like soy sauce, vinegar and cherries. I tried to ask what it was but the waiter didn't really understand what I was asking. This was the highlight of our meal here.The Rock-n-Roll beef was watery and not so Rock-n-Roll. The fried rice was a little bitter and tasted like it was fried in a dirty pan. The General Tso's chicken was crispy, and by all rights should have been really good, but something was lacking and I couldn't quite bring myself to be excited about it. There were also a lot of flies flitting about."], ["Mike C.", "THE KEY PROBLEM W/ THE PLACE is how the advertising is slim if not nonexistent.  You see, back in the day, there was a Cheng Du Chinese Restaurant in West Hartford Center, same brand, similar menu, possibly new ownership.The former Cheng Du had clean, simple block lettering bearing the restaurant's name on the exterior, always crowded inside, people loved it.  The new Cheng Du is in a grittier part of town, and the exterior looks sort of tacky now w/ big, bright cursive print almost like a night club, so maybe that's why THIS place, every time I've eaten there, is virtually empty.  People might not even realize that it's the same restaurant in terms of food.As far as food, it's pretty good.  They have great chicken dishes, the Thai Basil Chicken and the Jade Chicken are my favorites, tender, spicy, and lots of veggies accompanying it.  The dim sum platter, however, tasted really weird, to the point where the meat was unidentifiable.The interior is nice and clean, too, and the help is, well, the help is there, that's about it.Parking is pretty bad, though.  Whether for take-out or to dine-in, this place is worth a try."], ["Libby W.", "only good Chinese I've had in West Hartford.  it is my go to place"], ["Alden G.", "Tea right away; always a good sign. General Tsao Tofu is excellent."]], "Pho Boston": [["Valerie S.", "It could very seriously be pushing 90 degrees outside and I would still seek out a bowl of their piping hot chicken pho. Every time I go I order a #27 extra large bowl, assuming that I will eat half and take the rest home. And, without fail, every time what I have left over is such a dismal amount that I'm forced to order another just to take home. For the massive portions of pho that you receive, their prices are extremely reasonable. Their spring rolls, both cold with peanut sauce and crispy with soy/fish sauce are delicious. As always I recommend the wonton soup, a classic. The shaken beef, small cubes of fully cooked meat mixed thoroughly with seasoning, is incredibly flavorful. And the strange yet equally exciting dish of shaved, very rare beef, swimming in lime juice, onions, thai basil, and chili paste is a family favorite.My only criticism being the setting...a very open layout which sort of makes you feel like you're very exposed on all sides and everyone can hear what you're saying, tacky neon lighting, and dated booths. But all of these can be overlooked for the food."], ["Leah M.", "Was first introduced to this place when going to the a dong Asian market it the same plaza. We saw it was packed and knew we had to give it a shot. We have been back countless times since. They have and extensive pho and noodle menu. I have tired many different kinds and have not been disappointed. The only thing I don't love is the beef balls that you can add to the pho. I love that they have all sorts of sauces at the table that you can add to all the dishes. Their spring rolls are so fresh and served with a perfect peanut sauce. The satays are delicious and always well cooked. The food comes out very fast so you can eat here quickly if needed!  Miss living down the street from this place!"], ["Romeo y.", "Please check your bill, recently they automatic add 15% tip to the bill, even table of 1 or 2!"], ["Valentine O.", "Went to pho Boston for lunch with several coworkers and it exceeded my every expectations. The workers were extremely friendly and receptive. The food was delicious and did not take long. The tea was amazing considering it was 25 degrees outside. I had the curry chicken, and despite being a person who grew up on Caribbean food, it was clearly the best curry chicken I've ever had. Great job Pho   :-)"], ["Chloe Q.", "The best pho I've ever had. I particularly like Pho Tai, which is just thin slices of rare beef. I've only done take out and they provide you with everything you need in huge take out containers. I love that I never need to ask for extras. The chicken peanut skewers were good too, though didn't come with peanut sauce FYI. If I didn't love the Pho Tai so much I'd probably have room to try more!"], ["Karen S.", "Pros:SpaciousGood amount of items to choose from on the menu.Cha gio was pretty goodIced coffee was nice and strong :)Not-so-pros:After food comes out, service is pretty slow. Almost like you're not there. And there were only four table taken.Lemongrass beef was too thick. I prefer thinly sliced. These were kind of chunky.Instead of wanting to go back, I want to try somewhere else."], ["Joe B.", "\"Soups on\" ask for Tony or Cumsoon, they'll take take of anything you need. Spectacular service, always starting you off with a pot of hot tea. You could spend a solid hour searching the menu, but stick to the favorites : spring rolls, wonton soup, and roasted quails for apps, chicken or beef pho (all fixed up with lime, cilantro, been sprouts and chilis) pork clay pot, and don't forget the lychee on ice....just to top you off.  Also definitely worth grabbing a bubble tea to go for the ride home, just sayin'"], ["Jordan S.", "My girlfriend and I come here religiously every weekend it seems. I always opt for the Duck Leg Soup. Don't forget the bubble tea on the way out - I recommend the Taro smoothie. Very flavorful food. Don't let the ominously foggy windows turn you away from this amazing place."], ["North S.", "BEWARE OF YOU BILL!! PLEASE2 CHECK ITEM BY ITEM. We were rushing and just pay without looking at the charges and after I got home looked at the bill we were OVERCHARGED ALOT. I checked this against menu online. Pho tai 8.95, add meatball 1.50=10.45, charge: 12.95. Same thing to go but upgrade to extra large (which shouldve been additional 2) became 14.70 and then added tax!!!!!!!!!!The food is okay, of you want good pho, go to pho 501. Pho boston's broth is a little too sweet for our palate. The waiter we had was really nice, for our to go he asked if we're gonna eat tonight or tomorrow because he'd prepare the noodle differently. But the place need updating, carpet looks like it's been there 50 years and place is dark and smells funny, bathroom is not clean. Looks like hygiene and honesty is not the owner's priority. Looking at the menu, if we would have been charged correctly, price point is actually decent.I never really pay attention to the bill til today (I know it's my fault, but thats just very sneaky and not how you should do business) and weve been going here for years and the ONLY reasons we go here is because of the variety in the menu. Pho 501 doesnt have pho sate that I sometimes enjoy & grilled curry chicken on rice. They charge 4 bucks to turn white rice into very bland fried rice, they just added little scrambled egg and some frozen peas and carrots thats it!! so not worth 4 bucks, portion is huge tho, always enjoy the leftover. Some other places in queens would at least make it taste like fried rice and only charge 2 bucks extra, but then again it's queens not CT. Their mi ga is okay too.For pho broth in CT, we've compared (each place more than once) the following places:-Pho 501, east hartford (the best so far)-Pho hong thom, bridgeport (#2, but their seafood noodle and mi ga is to die for and the family who runs this place is very nice including wilson the waiter. We never get a chance to compare this with 501 because everytime we go, they always ran out and now our chance is slimmer that we move from avon to ridgefield so it's a hike to get there on sunday morning, but it's in the agenda)-pho saigon, bridgeport (ok, not impressed, but their crispy noodle w/seafood is good, make sure u ask for the thin one, not thick one)-pho mai, bridgeport (ok, not impressed)-pho vietnam, danbury (ok, broth is clean but taste is ok not impressed, overpriced just like everything else on the menu but they have no competition in the area, very stingy with meat and the cut of meat is off, but their greasy fried rice with crispy tofu is very delicious, but portion is incosistent. Vietnamese pad thai for $17, I actually tried this and I dont think id buy it again for 9 bucks)"], ["Alex R.", "Stopped by for a family lunch and parked closest to Pho Boston. Upon entering the open floor seating area, we were greeted by a very pleasant host who promptly sat us table 19. ( each table is numbered as I think this helps with paying... There is no bill delivered, instead you walk to the cash register and they \"know\" what you had and will gladly show you the bill before paying... But who wants to talk about paying ... It was the food that made this place special. After asking many questions about the menu including some seasonal $25+ options, we tried the soft spring roll which was excellent with the peanut sauce. Additionally the crispy spring roll was average but my daughters preferred it. We all tried and enjoyed the jellyfish and shrimp salad. Finally we all split a large bowl seafood noodle soup that included fish, squid, shrimp and a spicy pepper. I added some chili sauce (provided with a selection of two or three sauces at the table) to give it more heat. A side of bean sprouts, lime and basil was added to broaden the range of flavors and textures which is definitely an Asian dining trait. My wife and I enjoyed the Export 33 and the kids had water.Overall a fun dining experience with an extremely friendly and helpful staff."], ["Tricia Z.", "Well I am going to admit the service has not changed which makes me not want to give it 5 stars but, as far as Vietnamese food goes in Connecticut it does not get any better. The Pho is fantastic you can tell there is some real TLC put into the broth. You can't go wrong with the prices.This is not meant to be a restaurant you go on a first date for its a great place to grab a quick cheap bite that tastes delicious and doesn't leave you feeling guilty after. Food is very quick when they are busy too. If I lived closer I would be a regular here although I would probably do take out."], ["K L.", "4.5/5 Great authentic pho. Love the peppers, bean sprouts, and lime on the side. Speedy service. Spacious. Decor is outdated, if that matters for you. Conveniently located near A Dong Asian Supermarket. Still the best pho I've had in Connecticut."], ["Jerry K.", "MMMMMMMMMMMMMMMMMMMM!Good Vietnamese food is a tough find in the middle of Berlin CT. But this place is very authentic and very cheap!They serve common dishes like pork chops, and classic Pho as well as spring rolls and grilled chicken.To be honest I didnt think I'd find a place like this around this area but it is a jem of a find.And they have bubble tea!"], ["Anthony T.", "Disappointed after reading the reviews. Pho #19: small for a \"large bowel\". Lots of broth but only about 2 slices of each type of beef. Broth is decent but I've had much better. Amount is also on the small side. Salty lemonade: came out lukewarm w normal lemonade and salt sediments on the buttom. Seriously?!! One of the worst I've had. Service: okay. Asked me what I want 10 seconds after I sat down. Then came back twice within 3 min. Would not visit again."], ["Steven T.", "I'm a fan of this dive.  Yes, its a dive, but its a fantastic dive.  This is a good place for a date or to meet up with friends.  I had a large bowl of Pho Boston noodle soup.  It's a special spicy sate with rare steak, peanuts, sliced tomato and cucumber. It was so flavorful, especially after I added a little chili spice.  We of course started out our meal with the beef teriyaki sticks....these were amazing and well prepared.Pros: -Fresh food with a diverse menu. -Low to moderate prices. -Great service.-Plenty of parking."], ["Amy T.", "We went here after we noticed that our favorite pho restaurant in Middletown was closed.  It was good.  I always love a big huge bowl of pho when I am sick and can't breathe, and that's what I got here.  No jalapenos though, and I was a little afraid of the chili they gave us on our plate of bean sprouts.  Pretty yummy place!"], ["Rachel M.", "My fiancé and I are obsessed with pho Boston. He has been eating there for about 15 years. We usually get pineapple smoothies, Thai iced tea or Vietnamese iced coffee to drink. We share the teriyaki beef app which is served wrapped in lettuce with pickled carrots. I get #25 pho which is a large beef bowl. He gets #18 which is tripe, tendons and flank. Both delicious. We is the lime, basil and sprouts they give on the side and also had a healthy squeeze of plum sauce and sriracha. Great any day but especially if you are under the weather, it is a guarantee to make you feel better! Only reason I didn't give 5 stars is because I hate the bathroom."], ["Richard 1.", "I saw the positive reviews on Yelp and decided to try out Pho Boston yesterday since I was near by anyway. I'm glad I did.I ordered the house specialty Satay Pho (extra large).  I enjoyed it but cannot compare the dish to what you would get in other restaurants in the area, NYC, SF, etc. since I tend not to order this dish in those places.  Also, as the satay sauce is already mixed in I cannot easily tell how good the base beef broth is and therefore can't easily compare Pho Boston to other Pho restaurants nearby (I tend to frequent the ones in Springfield because they are nearer) on the quality of their food. It's right up there though I should think and I had a generally positive lunch experience.The restaurant itself is rather spacious, should accommodate families and children well, and even has a couple of large round tables set aside for banquets just as you would in a good-sized Chinese restaurant, for example. The service is fine but a little impersonal and chaotic because the same waiters who are serving people are constantly greeting turning around to greet new customers. You pay your final bill at the bar/counter by telling them your table number which is on the utensil container.I would probably visit again on my next shopping trip to A Dong (which is in the same strip mall a few doors down) if only to test the beef broth by ordering the regular Pho."], ["Brooke P.", "Best pho in the Hartford area. The broth is amazing. I highly recommend the spring rolls. Food comes out fast, hot and delicious. You will not leave hungry or dissatisfied."], ["Keli R.", "I guess I was disappointed... I guess I expected more.Meh...just Meh.Maybe I'm spoiled from Toki underground in Washington DC (go, try, savor, devour)Their savory, unctuous broth speckled with salty umami pork goodies....keeps me wanting more.... this....this was not that.I found myself having to doctor the broth.....1, 2, 3 times to make it just right.  But here's just the thing...you shouldn't have to doctor up a thing. I also love the plate on the side of chilis and herbs...well, my chilis were not cut and there was so cilantro :(. bah humbug.I was hopeful with the flow of Vietnamese people trickling into this place minute after minute and also with the helpful quick service....but the food....was not so great.One plus?  I tried tripe and tendon for the first time!!the tripe was nummy...then tendon, although the taste was there...the look and texture didn't do it for me.It's quick and cheap...that I'll give it...but it's not where I'll go if I have a hankering for delicious soup.I may just make that 6 hour drive to DC..and u will too..promise."]], "Beijing Garden Restaurant": [], "Black Bamboo Chinese Restaurant": [], "Shu Restaurant": [], "Peony Chinese Food Truck": [], "China Kitchen": [], "Saigon Kitchen": [["Biota H.", "I was finishing up a meeting over at One Constitution Plaza and stumbled on this place via Yelp. I made it in right before they closed and placed my order for tofu and broccoli (a brown sauce) with white rice. As I ordered standing at the counter, I realized I could see into the entire kitchen, and I was surprised to find how clean and orderly everything seemed. They even have the menus displayed on screens so you can see what's offered while you stand in line. Finally, I think they've done a great job with the branding of the place - the logo is professional, the menus are well-done, and I could totally see myself taking a seat at one of the tables and people-watching during my meal.This place is a local small business that makes great Chinese American food and is owned by a wife-husband duo. It took less than 10 min for my food to be done, and while I waited, I chatted with the wife and watched her husband cook the food. She said they moved from mainland China 36 years ago and the restaurant has been open for 30 of those years. They're open six days a week, and they take a week off in the winter and a week in the summer for vacation and close down the restaurant while they're gone. Obviously they're doing something right if they've stayed open for this long! To address the brusque service that many other Yelpers seemed to complain about, I echo what Jon L. said, \"She knows she has to hustle to serve all of her customers and she knows that her regulars need to get their food fast and get back to work. The way she operates allows that to happen.\" I have not personally witnessed this lunch rush, but the friendly way she treated me led me to believe that she was actually trying to be courteous of everyone's time through the efficient way she runs the place, even if it was interpreted as rudeness.I docked a star because they don't offer free water (only purchased drinks), they use the environmental terror that is styrofoam for their takeout containers, and I wish they had a minimum spend requirement to use debit/credit--instead it's cash only. But for the $7 and some change I paid, the money was well spent for the hot, freshly made food.EDIT: I came back a couple days later and tried their sesame tofu, which strangely has a bright red sauce that tasted a little like sweet and sour sauce. I wasn't a huge fan of this entree and would probably stick with the tofu and broccoli with brown sauce I ordered last time instead. The owners were just as friendly as last time, and the wife asked my last name so she could address me by \"Miss.\" I noticed that regulars were recognized and their orders memorized, and even newcomers were greeted with, \"What would you like, friend?\" This restaurant is really a joy to come to!"], ["Lauren H.", "Great ambience, quiet restaurant and quick service. We weren't fans of cash only payment method. We also didn't like the texture of the meat on our spicy beef and sesame chicken."], ["James B.", "The food is real good but the lady has a real attitude  issue. Being a cash only establishment make sure you count your change, she will rip you off . I gave her $30 and she swore I only gave her $25. She has done thisMultiple times. Besides the attitude and poor cashier skills it's an ok place ."], ["TheFoodInspector 1.", "This one will be my easiest review I have ever done. Love this place! Absolutely the best chinese/Vietnamese food you will ever have. I have been here a number of times and will come as often as I can. #1 dish is there signature hot & spicy chicken. Its always fresh and amazing. Everything here is A+ just dont take the owner personal, she can be a bit over the top but she is efficient. Must Go!"], ["Emily J.", "First timer today.   Instead of calling ahead, we chose from the buffet.   I got the hot & spicy chicken, and the chicken with broccoli.  Very tasty and good!   Very convenient working two minutes away.  Only 10 bucks for a LOT of chicken! Yum.  I can't wait to try their other items."], ["Jon L.", "You are in the Heart Beat/New England's Rising Star/The Insurance Capital of the World and need a cheap but filling lunch.  Something that allows you to come back to the office without feeling completely gross but won't break the bank.  Look no further than Saigon Kitchen.  Reasonable prices and large portions are the standard here.  Bring cash and KNOW WHAT YOU WANT WHEN YOU STEP UP TO ORDER!  Them's the rules!  Saigon Kitchen is all about efficiency and so don't be \"that guy.\"  Respect the process.As for the food, delicious Chinese take out served fast.  I am a fan of the boneless spare ribs and pork fried rice.  Try it and you won't be sorry.The tables and floors are cleaned with a fervor rarely seen in the take out industry.  You can also see into the kitchen itself, which appears clean and organized (can you say that about YOUR favorite Chinese take out joint?).As for the staff, some Yelpers have complained about the woman at the front counter.  Listen, she knows she has to hustle to serve all of her customers and she knows that her regulars need to get their food fast and get back to work.  The way she operates allows that to happen.  There is a reason people keep coming back to Saigon Kitchen, why people can't wait for the mid-week bourbon chicken, and why Saigon Kitchen has been around while others have come and gone.  She is the reason.  So, in short, bring cash, know what you want when you step up to the plate, and keep the line moving people!  And, if you can follow those simple rules, you'll eventually be a regular."], ["Shellene O.", "This is one of those fast for lunch places not far from where I work.  It seems like a LOT of people like this place, it's almost always crazy busy in there.  Personally I guess I'm just not a fan, the fried rice has some weird flavors that I just find unappealing (greasy, flat tasting) and the seseame chicken was ok but still not on my top 10 (or top 20) for Chinese food.   I probably won't be going back if I can avoid it."], ["Jeannette B.", "Cash only....really in the year 2015?? The place is clean and busy but the lines move fast. The food is just ok. You get quit a bit for what you pay for but the flavors just aren't there in comparison to other fast food chinese places."], ["Horton L.", "Fatty American Chinese food, tastes good but you know you are going to get high blood pressure somewhere down the road if you keep eating here everyday. Food tastes good bc it's so fat, however the Vietnamese lady tho  she's got the worst attitude in the world! I don't know why people keep coming back I guess it's because of the location and the food. She's the type you would only see in cartoon I have never knew this type of lady existed in real life. I suggest coming back with your headphones on so she can't yell at you. Or just stop by just to check out her attitude, she should have her own reality tv show bc the way she treats her customers are like she treats someone who had just killed her entire family. I think she should sign up to go to jerry springer or something she would win!"], ["Kelly Y.", "This lady is so crazy and mean, it's hard to come here anymore.One more bad experience, and I will vow never to return.She is so mean to her staff.  I feel bad for them, and it's uncomfortable.She yells at people to stand here, move to the side, do this, which I get to an extent.Also, when you call in an order, you can get the guy, who is very accommodating and nice, or she answers, yells she can't do certain things (like sauce on the side. which is no problem for the guy), and says shes too busy, call again later.The food is good, the cafe is clean.  I'll give it one more shot, but if she is still on fire, I'm never going back."], ["Emily C.", "Mmm...Chinese comfort food at its finest. This tucked away family run business has become my new downtown favorite for a quick, casual bite. I'd passed it so many times walking from the Market Street Marriott (my secret go to for public parking these days - shhh) to City Steam but only recently stopped in for lunch.Seriously solid Chinese-American food. Give me a heaping dish of perfectly spiced General Tso's, savory pork fried rice and chicken & broccoli (ok, throw in some crispy, delectable crab wontons while you're at it) and I'm the happiest gal alive. It's a casual, no frills atmosphere but it works. Oh, and the nearly out the door lunch line goes FAST, so don't fear! Since my first visit, I've been talking it up to my boyfriend who finally went last week before covering a show at the XL center. He's a new SK convert so I'm confident that we'll be eating there more often going forward. BIG WIN on my end. There don't seem to be a ton of local Chinese places conducive to eating in (other than Butterfly, Chengdu and those white tablecloth type places) so this is a much appreciated find."], ["Jacqui B.", "This restaurant is pretty good.  The food is tasty and it is reasonably priced.  It feels a little mall-ish to me (like food court style), so I don't love that.  My main issue is that some of the staff is a bit difficult.  The lady who works there and answers the phones is not interested in being accommodating at all if you call ahead and ask for something special.  I like my food steamed, and she always yells at me.  I don't like to be yelled at when I'm at lunch, I get that enough everywhere else.It's the only Chinese place in town, so I go there and the food is good enough, but if there was a different Chinese restaurant close by I would switch."], ["Slaine F.", "Just started working in Hartford and one of my coworkers recommended we get some lunch from Saigon Kitchen.  While the menu was kind of limited, there still was more than enough to find several items I'd want.  Indeed, the simplest fare -- Pork Lo Mein -- was excellent.  It was smokey, a little salty, and very oily, but otherwise had a great flavor and I'll definitely order it again.  Now I'm curious how their General Tso's Chicken will stack up."], ["Wilther M.", "Downtown Hartford's best option for greasy American Chinese food!I do like to be a fatty every now and then though.. so I've indulged and was not blown away, but I wasn't disappointed either. If you find yourself in the mood for some American Chinese food, consider Saigon Kitchen! If nothing else but the lack of other (American style) Chinese restaurants! :)"], ["Greg M.", "Super friendly. Very fast. A bit pricey for what it is --- standard, run-of-the-mill Chinese takeout. Nothing special, but good for what it is."], ["Kerri P.", "The salty, smoky veg lo mein really hit the spot! For about  $6.50 I was able to get about three meals' worth of food here. The line at lunch was to the door, but they have a well-oiled machine. This moves quickly, and I have to admit that even though the cash only policy is a little inconvenient for me, it definitely speeds things along. Fast, good, inexpensive, and a decent vegetarian menu."], ["Neesha B.", "I really like this place. The prices are very reasonable and the hot and spicy chicken is delicious. Yes, the woman who runs the register is very loud and abrupt, but she has been friendly to me..... In her own way"], ["Mike A.", "You know what? When I worked in Hartford, this was my fave for lunch.It is \"real Chinese\"?  Nope.It is yummy and the portions generous? Yes.And as for the tiger lady, she loves me.  So there!And her husband, he loves me too."], ["Collin S.", "For me, Saigon Kitchen has been a victim of location.  Situated on Temple Street, it has been surrounded by some of my favorite quick lunch options.  First there was Roscoe's, with their delicious hot dogs.  Now there is DD's, with their gyro platters.  Finally, though, I decided to try Saigon Kitchen.There are a number of Chinese takeout options, and Saigon is a step above most of them.  The General Tso's is good, with just the right amount of sweetness and crunch.  The fried rice isn't too greasy or overpowering.  The staff is friendly and efficient, even during high traffic lunch hours.I have only been for lunch but I hear the dinner quality is even better.Given that it is on Temple Street, parking can be difficult if not impossible.  However, it is worth the effort if you're looking for a good, quick lunch option downtown."], ["Stephen T.", "Stopped in for the lunch special. For like $6.50 you get a choice of fried rice or lo main with two meats with choice of boneless ribs, general Tao , sweet and spicy and or sesame chicken. The portion size is just right to have you leaving satisfied and the food was great. CASH ONLY!I will return"]], "Peking Garden": [], "Hartford # 1 Chinese Restaurant": [], "Great Wall Chinese Restaurant": [["Tatianna P.", "This place is not the greatest looking spot. But very visible on the plaza corner and has a \"B\" rating for sanitary. I have to say I have been to many places and this is by far the best chinese take out in town. Definitely recommend the seafood lo mein and pupu platter... their fried rice is also very good. Making my way down the menu will share more as I go."]], "Wang's Kitchen": [], "China King": [], "Butterfly Restaurant": [], "China Jade": [], "Wang Palace": [], "China House": []}