{"The Capital Grille": [["Len J.", "Just exceptional. The food was perfect, the service was friendly, efficient and knowledgable. My wife and I were celebrating an anniversary. I let them know that when I reserved. Our table had rose petals on it as well as a note thanking us for coming. The prosciutto wrapped mozzarella appetizer was very good. It was very lightly grilled and finished with balsamic vinegar. Order it. Do it. I'll sit here and wait while you do. The steaks were great. The sides were more than two of us could share. We had what was probably the best cheese cake I've ever had for dessert. The only complaint I had was the valet parking. It was an absolute mess when we arrived for a 6:30 dinner. Cars on the sidewalk, in the street. No way to tell where to drop the car, or whether we should. But the point if this place is after you park. Our experience was impeccable."], ["Amanda P.", "Delicious food and good service. My friend and I split the lobster macaroni and it was delicious. A decent amount of lobster and the pasta was fresh and tasty. We also shared the generous portion of friend calamari, which was melt in your mouth delicious. My one complaint about the calamari is that they don't serve it with any type of sauce.The service was kind of weird. The waitress was attentive at first, although she didn't provide us with a bar menu and we were sitting in the bar area.  She gave her honest opinion of the dishes, which is appreciated and helpful when ordering. However, at the end of our meal, I ordered coffee and would have loved a refill on it but by then, the waitress had disappeared. I asked another waitress for a second cup of coffee, which she brought, and then my friend asked for a hot tea. Twenty minutes later, the waitress brought the tea and said \"oh, I kept forgetting to bring this to you because I'm not really your waitress.\"We were a little taken aback by that comment. I completely understand that the waitstaff needs to be attentive to their own tables, but the only reason we asked her for assistance is because our waitress was nowhere to be found. In general, the waitstaff seemed stressed and frazzled - no one was smiling. Perhaps they were understaffed for the night.  Overall though, it was excellent and I will definitely go back."], ["Binly S.", "I have enjoyed this place very much! The staff was great, maybe the best all around in the Hartford area. I came here with a group of 3 total and among us we had three starters, three cocktails, a bottle of wine, three steak entrees, two sides and two desserts. The setting and vibe was just right. Good music playing in the background and ambient lighting. It was very nice and romantic to say the least, except none of us had our dates. Ha!I myself had the Caesar Salad which I wasn't too fond of since the dressing was a bit too salty for my taste. To even that out the 24oz Dry Aged Porterhouse was absolutely delicious! The creme brulee for dessert was also very good to finish it off. The cocktail I had was the Adults only Arnold Palmer and I feel like it could've been better. Maybe a little sweeter? That's my opinion though.I will be coming back! But this time it will be with my lovely lady. I am looking forward to it."], ["Jena G.", "I came here for an anniversary dinner and this placed delivered. Per usual, I'll start with ambience. We came on a Thursday around 8:30 and the place was surprisingly tame. A few couples were interspersed throughout the main room. I didn't mind because everything was so quiet and romantic I could hear the flutters of my boyfriend's heart (could've been due to the bill, however). I've gotta say, coming from a girl who loves a good glass of vino, this place is pretty genius for making their entryway a glorified wine cellar. I mean come on. Who doesn't love entering an upscale restaurant that greets you with its hefty collection of wine? This place basically had me at hello.Since I came here for a special occasion, my boyfriend and I planned to go all out. We ordered a bottle of red claret which our server came out with promptly. He was helpful in guiding us in the right direction but hands off enough to let us pick a wine of our choice. There was nothing pushy about him; he didn't exude that clandestine message that some waiters do...you know...the \"try this $100 bottle you'll love it.\" We started with the spicy calamari (one of my personal favorites). Every piece was so tender and juicy I swear I still have dreams about that plate. Loved the tempura peppers to accent the calamari too. We also had a balsamic drizzled caprese salad which was fine...but I've lived in Italy so I'm a bit of a snob when it comes to mozzarella. For entrées my boyfriend had a 22 oz bone-in rib eye which he finished in record timing. Seriously the Capital Grille should've timed him and put it up as an advertisement or something. He's had his fair share of red meat and this is the only thing he looked at with a more loving gaze than me all night. I ordered the french onion soup and lobster mac and cheese for a main course. The soup was fantastic and the LM&C was so. darn. rich. Just how it should be. I think my boyfriend is still recovering from the dent that the bill made but I repeat, this dinner was for a special occasion. I've been to a few upscale restaurants on par with this one but I only reserve my 5 star reviews for downright TREMENDOUS and PERFECT places. This place is darn near it. But the price tag is hefty."], ["Dan R.", "Valerie R. was right on the money, and I do mean money! This is an expensive restaurant where a drink, an appy or salad, and an entree will set you back no less than a C-Note easy, so it's definitely a special event kind of place.This was our first visit here, and we only went because I had a generous gift card left over from last year's birthday. The level of service was incredible- from the valet parking to the hostess station personnel to the servers. Everyone was amazing- so helpful and polite and courteous and ultra professional.They have a very cool iPad gizmo that serves as their wine list, so you can scroll and sort away to find the exact style or bottle or glass that suits your taste and budget. Most of the wines are north of ten dollars a glass.The bread basket was way above average- a real cornucopia of styles - rolls, dark sweet bread, and thin cracker like slices served with a big slab of butter.The three of us decided to split one of the salads -a $13 beauty of a dish with Fresh Mozzarella, Tomato, Basil with 15-Year Aged Balsamic. A normal serving has two mozzarella-tomato towers, and we were very pleased to see that they reconfigured the dish into three towers. The salad was so good- fresh tomatoes, incredible mozzarella (made on site) and the balsamic was wonderful.I had a Gorgonzola and Truffle Crusted Dry Aged NY Strip for $48. It was 14 oz of deliciousness served with a black truffle and gorgonzola butter, and cherry cabernet reduction. The meat was perfect (medium rare). The gorgonzola crust was so flavorful and tasted great.My dining partners also had a filet ($44) and the Pan-Seared Sea Scallops with Wild Mushroom Risotto (also $44).We shared two of the sides - Roasted Brussels Sprouts with Smoked Bacon ($12) and the Roasted Fingerling Potatoes ($11). Both were pretty generous portions and were perfect for sharing.Was the food amazing? Yes it was.Was the level of service top notch? Yes we were pampered like royalty all evening. Check this out- at the end of our meal, the hostess asked if we had valet parked. When we said yes, she asked for our ticket, and carried out our \"to go\" bags to the car for us, so when we walked out the door, our car was waiting for us with our bags in the car. I'll leave it to you to decide if this level of quality and pricing structure is something you're interested in.  I will say that we were totally impressed with every facet of our dining experience.  For a special event, it's hard to top the Capital Grille."], ["Shellene O.", "The only thing I'm not terribly fond of at Capital is their prices!   I've had nothing but excellent service in both the bar and the restaurant.  I've been with large parties and for one to one lunches.  The food is always excellent and the steaks are always perfectly cooked.    This is the kind of places that makes me wish I had a bottomless stomach so I could try everything!  I almost never make it to dessert because I'm just too full.   Any opportunity I get to have a vendor take me here I don't pass it up! =)"], ["Claire K.", "Amazing! I came here with my boyfriend last night, and we shared an amazing dinner. We shared the Crab Cocktail(perfect), 1 cup of Clam Chowder, The  Bibb Stack Salad with Pear(nice light salad), The Citrus Glazed Salmon(perfect), and an amazing Flourless Espresso Cake. Worth every cent!Whenever we're in Hartford, we will definitely considering going back to The Capital Grille."], ["Lydell A.", "I was hooked on my first visit. I stopped by here for a restaurant week deal before I knew what I was getting myself into. I didn't realize that it was a larger chain know for it's relatively uncommon dry-aged steak. I feel like dining here caused me to actually learn and was a turning point to as a foodie.  When a place can do that, you know have to give them no less than 5 stars. Where do I start? I do know what to rave about first, but I think I'm going to go with the service. The level of service here, from the free valet, to the maitré d, to the waiter, was eye-opening. I can tell they put a heavy emphasis on making the experience as perfect as possible. My reservations (and I suggest reservations) were promises kept every time and I was seated promptly after every arrival. Smiles and manners are common almost anywhere but the level of attentiveness and customization make their service shine. When my cup was less than half way full someone came to fill it before I could request it. My napkins were color matched to my pants to (camouflage  better?!). They swept the table free of crumbs between each course. Service gets 6 starsThe food. Oh the food. I pretty much always get steak from a steakhouse so that's what I've had at most of my visits here. Last time I had a NY Strip and it was cooked absolutely flawlessly and the flavor is what I want every steak I ever eat to taste like. I've never had a filet as tender as Ruth Chris but I've never had any ny strip as flavorful as Capital Grill.  The sides were pretty good but nothing notable for me. What shone from the dessert menu for me is the flourless chocolate espresso cake. It's not a huge portion size but it is rich, surprisingly filling, and a party for your tastebuds.  Also, I had a Gorgonzola and black truffle burger from here once for lunch with fries. The fries were decent, but the burger was easily the best I've ever had.This place isn't cheap but that's kind of the point. Come with your stomach empty but your wallet/purse full.  ;)"], ["Kristin B.", "I love coming to this restaurant. The atmosphere is just amazing. They take your coat. Their wine bottles are on display as decor. There's a waiter with one of those waxed mustaches (or at least there used to be). They offer you hot towels at the end of the meal, and bring you a doggie bag (is it too classy to call it that here?) with a personal note from the chef. Yes!The food is so delicious.  It is well worth the price.  They are far too generous with the desserts I will say. Bring someone to share with.  Last summer I called ahead and told them I was bringing my partner for his birthday and they made sure to have a surprise cake ready with his name on it. They also sprinkled little glittery stars on the table next to a hand written card wishing him happy birthday upon our arrival. Quality."], ["Mark N.", "I've been to several Capital Grille's (NYC, Stamford & Atlanta) but not in my backyard of Hartford, CT before.  It was a 1st date and I wanted to impress so this was the spot I chose as she lives in Harford so it was ultra convenient.  Valet parking was smooth - pulled up and the valet was waiting for us, handed off the keys and we walked in.We were given a table and asked for a booth but was told none available (even though I saw a few).  No big deal.  Service and food were all very good.  We shared lobster & crab cakes appy, both had lobster bisque, she had filet minion specially prepared and I had a  South African lobster tail.  We shared twice baked potatoes and Crème brulee for desert.  She had 2 drinks and I had 1 and the bill was $245 with tip.  I gave it 4 stars versus 5 because it was very good but priced \"great\".  Nothing to complain about whatsoever but I need something exceptional to give 5 stars to a dinner at this price for 2."], ["Fred M.", "I've been to two Capital Grille's - Hartford, CT and Palm Beach Gardens FL. The service, food and ambience were excellent in both, although the two locations have very different ambience. The steaks and salmons I've had were superb. They beef is aged and though  they don't advertise how old, we were given a tour of their facilities and the kitchen and drying refrigerator are impeccably clean and up to date. The servers are very knowledgeable, the list of wines long, and they offer iPads so you can peruse both wines or bourbons at your leisure.  The appetizers are truly special and even though I hate ordering apps if I know the meal will be large, you'll want to splurge and try them. They have a version of fried mozzarella that is a first for me - it's wrapped in prosciutto and it's crispy. The calamari is fried with hot green sliced peppers. The lobster tails are split and easy to eat, ice cold and delicious. They had a special 16 oz fillet, bone in, served with a light butter sauce. It is possibly the best beef I've ever had and certainly ties with anything at Peter Luga (I actually preferred to Peter Luga's) and the best Ruth's Chris I've been to (West Palm Beach FL).  Okay, I'll stop here. The restaurant is great, the service is not overbearing but perfect instead. The price, well, if you have to ask . . . that's the clincher. Even though it is expensive, it's a great place to come with a large group because you'll really enjoy yourself. Valet parking. Easy Piezy !"], ["Nichole G.", "The place is gorgeous .. Excellent greetings ... The staff is amazing. Now the food was amazing I had the filet mignon  with lobster tails . The steak was cooked to perfection. The dessert was also mouth watering we had the chocolate warm cake. The wines we paired was perfect. Overall it was one of the most excellent restaurants I've been too!"], ["Lindsay J.", "We ate here during Hartford's Restaurant Week. Let me start by saying, I am hesistant to eat anywhere in Hartford. Location is a big deal but parking is an even bigger one. Capital Grille has killer valet parking and couldn't be easier. We were seated in a nice quiet corner of the restaurant and the service was simply impeccable. We had salad (fresh, delicious and large portions) for our appetizer. My boyfriend had the rib eye and I had the porcini tenderloi. Both were scrumptious and done very well. The sides were green beans and the best mashed potatoes I have ever eaten in a restaurant. They reminded me so much of what my Italian grandmother would make when I was a kid. Dessert was Creme Brulee with a fresh fruit topping. Out of this world!Everything from service to food was worth it. The prices on their menu are outrageous but, you get what you pay for. I can't see going here more than once or twice a year for special occasions but I know if we were to visit again, we wouldn't be disappointed."], ["Valerie R.", "You have to get in the right frame of mind in order to dine at Capital Grille.  If you are not there for a special event, then you need to tell yourself that you are going to spend $100 per person, or even more if you are drinking.  Even if you are there for a special event (Restaurant week, etc) if you tack on the extras, it will be costly. But it will be great food!The first time we went, it was for a Restaurant Week in August 2014.  They were nice about it, they encouraged you to eat from that menu and still provided excellent service, unlike some of their competitors (cough, cough...Morton's).  Martha was our server and she was amazing.  They also had their Generous Pour event going on. This was 7 tastings of wine throughout the meal for $25.  The wines were fabulous and you were able to get more of any of the wines you liked.  Seeing as normally you would spend $25+ for a single glass of wine at Capital Grille, I thought this was a phenomenal deal and definitely left with quite a buzz.  It is a must try for everyone who enjoys wine, apparently they do this every summer and can save you some bucks on the alcohol part of the bill.The second time we went was on 5/2/15, right at the end of the Wagyu and Wine event.  For $25 they offered one of four featured wagyu burgers with fries, along with a glass of wine with a choice of two red wines.  This might not sound cheap to the average person, but again, a glass of wine generally runs more than this at Capital Grille, so this is a great deal.  We had to sit in the lounge to get this deal, though when we called earlier in the day they were very accommodating, saying that they would allow us to have the special in the dining room if the lounge was full when we came in.  It was not, and we grabbed a nice table by a window.  I had the featured gorgonzola and black truffle burger with a glass of  2011 Beringer Quantum Cabernet Sauvignon Blend.  My husband picked the burger with havarti, a fried egg and crispy onions, with a glass of 2012 Etude Carneros Pinot Noir.  We both loved our own wines better than the other, and both loved our burgers.  I liked his burger a little more because you could taste the meat and it was good - I liked mine too but gorgonzola tends to overshadow the flavor of anything else.We also added on apps (french onion soup and Caesar salad) and desserts (coconut cream pie and creme brulee) and pre-dinner drinks (mojito and cosmo) and it was well over $100 at the end of the night.  But the food and drinks were great!  The mojito was the best I've tasted since being in Puerto Rico, the burgers and wine were fabulous and the coconut cream pie portion size was ridiculous.  They even let me upgrade to parmesan truffle fries at no extra cost.  We brought half of our burgers home and had a great night overall.After I've said all of that, I still have to say I prefer J. Gilbert's, because the quality of the food is comparable, and we can get a full meal with a bottle of wine there for half the price of Capital Grille.  I'm still giving Capital Grille a 5, because if it's a special occasion or it's in the budget, you will have a good experience here.  Definitely sit in the dining room over the lounge, as you will get more of the experience that is worthy of the price tag."], ["Justin C.", "My god that was an experience. Vowed to never go here unless everything was on someone else's dime (since it's crazy expensive). Sure enough, I finally got lucky.  PRO:Fantastic food. Everything I ate was amazing. Big Kona steak was cooked perfectly and the sauce was killer. Mash potatoes, brussel sprouts cooked in bacon came out great. Hot, flavorful. Appetizers were phenomenal. Oysters and shrimp were incredibly fresh. Calamari was cooked perfectly too. Even got a great surprise at the end when everyone at the table was given a gift card on the house. CON:Expensive. Every entree is going to run you $40, and that probably wont include anything (sides, salad, etc.). Basically everything is a la carte.  You want mash potatoes? Get ready to pay for it. I'm not a huge fan of that serving style in general... Some other folks at the table had issues. Lamb was apparently chewy, and someone sent their steak back 3 times for being too rare."], ["Jonah Y.", "This in my eyes is the 5 star experience that everyone strives for. I have been eating here for about eight years and have never once had a bad or mediocre experience. I have visited them in Boston, NYC, Pitsburgh, Vegas, and Hartford and have had the same exceptional service and food in every location. This is my go to business dinner location.The drink and wine selection is impressive and the wait staff is always very well versed in all. If you want to impress your customers or a loved one who likes seafood, I recommend the seafood tower. It's nothing short of amazing. Blue crab, lobster, oysters, and shrimp round out this three tier tower of chilled seafood. The fried calamari is always perfectly cooked and the fresh mozzarella wrapped in prosciutto is a very unique and delicious selection.For the entree there is only one selection in my opinion and its the bone in ribeye.The Kona crusted with shallot butter is my rub of choice and have never been disappointed...ever. I should diversify my Capital Grill experience and try something else one time but when the monent of truth arrives I stick to my rock. I did just try the porchini rubbed The sides also make the dining experience. I have two words, Lobster Mac!! The sides are big enough to share with another person but not the lobster mac and cheese!! The aparagus, mushrooms, and scalloped potatoes are also very good.All in all definately one of the best overall dining experiences a person can have, regardless of location.Go there...you won't regret it."], ["Sarah W.", "I enjoyed an excellent dinner here with a girlfriend.  My steak with gorgonzola crust was amazing.  The chocolate espresso cake was incredible!  THe service was very good. I liked the atmosphere.  I wish side dishes were included-  it's definitely pricey."], ["R F.", "Over rated at my last visit; steak just was not up to par at all; service was good; atmosphere as expected crisp! Overall experience C+"], ["C M.", "This was my first visit and I was very impressed. I have been to several high-end steakhouses and this was my far my favorite meal. The N.Y. Strip was like butter melting in your mouth! The sides of potatoes and haricot verts put the final touches on an exquisite meal. My only wish was that the flourless chocolate cake came with ice cream, but it was delicious nonetheless. Top notch service. If you're looking to spend a pretty penny, you can't go wrong here."], ["David E.", "Restaurant Week 8/1/15Great evening again, Jason our server, very nice job last night. Customer service from the valet parking, to the front desk team, to our server. That's why you go to Capital Grill. Food is always solid. The team is knowledgeable and super professional."], ["Jessica O.", "Having been to this restaurant once before, I decided to go there for my birthday...Big mistake!Our server took forever to get our orders, despite the fact that the restaurant was almost empty.  I ordered the scallops, and my husband and one of our friends ordered one of the steaks. The scallops didn't have a pleasant taste, I was definitely expecting more; as for the steaks, we were surprised to see, that both of them were very different in size, even though, they've asked for the exact same dish, and when I say, different sizes, I really mean it, the discrepancy was very noticeable.To top it all off, I wasn't even offered a dessert for being my birthday, which even the cheapest of restaurants would have done.All in all, I'm very unimpressed, I thought my second experience at this place, was going to be as nice as the first one, but unfortunately, that wasn't the case. Next time I will stick to Flemimg's or Max Oyster."], ["Erica K.", "I went there for restaurant week, 3Courses for 30 dollars. I started with the clam chowder and it was good, could have been a little warmer. My companion ordered the wedge salad, it was a little small. For our main courses, I ordered the filet mignon. It was perfectly cooked, delicious and cut like butter. My companion got the tenderloin and enjoyed it immensely. It was cooked to perfection (medium rare) and delicious. Our sides were mashed potatoes and green beans.  For 30 dollars a piece, you really can't go wrong. Our bartender, Tyler, was polite and kind.  When I didn't know where the bathroom was, the host personally escorted me. I thought that was a nice touch. Overall, we had a great experience. I would love to go back and sit in the dining room!! I can't wait to go back!"], ["Katie F.", "Sad to say that I didn't have the best experience at The Capital Grille when I went there. I stopped in on a whim for a fancy date night and dined outside. The weather and atmosphere was nice but then it started to go downhill from there.Because this was spontaneous, we were not super dressed up but by no means were we severely under-dressed. No telling if this was the case or not, but it took forever for the wait staff to come take our drink orders. It always felt like a task to track them down throughout the evening. I would be more understanding of this service at a lower budget place but I expect exceptional service from any upscale restaurant. I ordered a small lobster for dinner and this order was delivered grilled instead of my requested steamed. Not only that, but the lobster was already cracked and separated for me after I had joked with the waiter that \"cracking the lobster for myself is the best part\" and that I would like to do it myself. I'm not sure if they couldn't let me do that because of the ambiance or if it was an honest mistake. In hindsight, I should have brought this up to get a replacement but I have a hard time throwing out a perfectly good lobster. My date ordered a filet mignon and had no complaints... but also did not have rave reviews like he had for other restaurants. Overall I am unlikely to return. I can spend a lot less money elsewhere and get a better lobster and experience."], ["George M.", "I have now been here three times. I have spent hundreds of dollars each time. There is NOTHING remarkable about this restaurant EXCEPT how UNremarkable it is. The beef is NO better than choice. In fact if you want choice steaks you will do MUCH better at half the price at J Gilbert's in Glastonbury. If you want a truly GREAT prime steak experience then go to Flemmings in West Hartford. I have been there a dozen times and ALWAYS get an outstanding steak (only outdone by Peter Luggar's in Brooklyn).SKIP the Capital GrillAlso, I read a lot of reviews and I believe people give away stars because they just have low standards . I also think people trash restaurants for the wrong reason, such as one bad server. I try to amaze at least a three visit experience before I commit"], ["Lisa M.", "Amazing dinner!Matthew and I came here during Hartford Restaurant Week and got a great deal on a stellar dinner. To start, we were brought a bread basket that had a few different varieties, then I had the caesar salad and Matthew had the field greens. I went with the Filet Mignon with Grilled Jumbo Shrimp and herb butter--steak cooked to perfection and the shrimp were large and flavorful. Matthew had the bone-in dry aged sirloin steak--nice flavor and also cooked as ordered. We split the mashed potatoes and the french green beans with shallots and heirloom tomatoes--both were excellent. To top off an excelllent meal, we shared desserts of flourless chocolate espresso cake and cheesecake with fresh strawberry puree--we couldn't pick a favorite!Overall, service was professional but dry, our meals were nicely presented and portioned, and we left feeling completely satisfied. A place to have a lovely romantic date night, so dress nice and enjoy the experience! It is definitely pricey and I'd love to come back--with a deal like restaurant week, I'd be sure to return."], ["Victor D.", "This was my first experience at the Capital Grille, and I was very anxious to try it out since Morton's Steakhouse closed. Made reservation for two at 7:15 and arrived there a couple of minutes early. We sat at a bar table and had a couple cocktails as our table was not ready, they said they are behind. 40 minutes later (FAIL 1) our table was finally ready and we sat down ready to eat. The manager came and apologized for the the delay, and insisted to buy us drinks or an appetizer, and made us feel very welcome and appreciated. I thought that was very nice and moved on to ordering.We ordered the Fried Calamari to share as an appetizer, with the scallops for my wife and the bone in Kona Sirloin for me as our main dishes. In the meantime we had some rolls with a herbal oil and we asked for more oil, that was never brought back (FAIL 2).I don't care much for fried calamari but my wife said the same dish was much better at Max Amore.When we received the entrées I couldn't wait to try my steak as at this point I was really hungry (around 8:30) and....FAIL 3 happens. Not only it was cold, but it was VERY well done. I had ordered medium well as I like just a little pink in the middle, and no blod. This steak was completely burnt, dark gray inside and cold. I called the waitress and asked her to touch it, so she can feel how cold it was, and she agreed. However, the truffle oil fries were really good. I was amazed that in literally 5 minutes (or less) they had a brand new steak for me, and it was amazing. Really good.When we left, the manager was at the door and asked us if we had a good meal, and I told him about our experience. I was surprised he was not aware of FAIL 1 and FAIL 2. He apologized many times and was extremely surprised and disappointed to hear about our experience. He gave us three $50 certificates, and insisted we should come back. We will give it another chance in hope for an updated 5 star review."], ["Marilee C.", "Had a great date night meal here. Food was good, cocktails were good, and the service was excellent. The only reason my review isn't five stars is because at this price point, which is high, everything needs to be perfect for a five-star review. I would highly recommend the filet with Gorgonzola and truffle. It came out well-cooked (not well-done). So you know, medium-rare here is a warm, red center and medium is a hot pink center. I know that's how it should be, but I find this varies by restaurant; so I ask. The truffle fries and the mushrooms were good, but I'd probably keep searching for amazing ones. Make a reservation. They are on opentable. Even with a reservation, we still needed to wait about ten to fifteen minutes (and the bar was full so that wasn't great). Also, I think they should up their game with the bread basket. They give lots of variety, but nothing is warm or particularly great. Also, not having oil with focaccia seems wrong to me. I'll definitely try this place again, and would highly recommend it for a great business lunch if you're trying to impress someone."], ["Babak A.", "Free valet parking if you are eating planning on dining hereEverything as expected for a top chain chop house, great service, perfectly cooked steaks. If you are a French opinion soup fan, try it here you will love itMy tenderloin was cooked perfect, and as expected the quality of the meat was prime ."], ["Stephanie A.", "You really can't go wrong with The Capital Grille. This location is great. It's a bit more laid back and less crazy than the other locations I have been in Manhattan or Boston. When I visited this location I got the Gorgonzola & truffle crusted dry aged NY Strip (cooked black and blue - yummmmy). It was absolutely delicious. Cooked perfectly - I am very picky on how my steak is cooked and the chef pleasantly surprised me. The table split some sides as well - all were delicious. For dessert I tried the coconut cream pie. It was actually one of the best desserts I have had ever. It was SO good. Ahh I want moreee!!! Definitely recommend this for people who save room for a little sugar after the main course :)! Lets see - what have I not touched upon? OH - right, the drinks!! duh. So the drinks are all amazing (from what I have tried). There is a great wine list so there is 100% something there for everyone. If I'm ever back in Hartford, I will stop by here for a meal again."], ["Christine M.", "Have been to the Capital Grille twice now and both visits have been very pleasurable.  Went for \"happy hour\" (there are no drink specials) but the bar tenders were very friendly and attentive. Had some sort of grapefruit drink (can't remember the name now) and it was delicious! The second time I went was with 8 other people for lunch and our waitress Nicole did an excellent job.  I ordered the \"capital grille salad\"- which is the traditional Cobb salad with sirloin steak.  It was very good! One of the gals I was with received cold fries, but other than that everyone enjoyed their meal.  For desert I ordered the flourless chocolate espresso cake. HIGHLY recommended!! The exact recipe  is available online, I am saving that one for the recipe book!"], ["Eileen S.", "Steakhouses are fairly predictable.  What makes them stand out is their approach to service.  We popped in here as we were driving through Hartford and were delighted.  Two major standouts: - it was raining - pouring - and we had to dash from the unattached parking garage to the front door - as we did, his glasses popped out of his pocket - rather than have him go out to find them himself, the hostess went out - in the pouring rain - and got them - so above and beyond, and just sweet - our server, Marisa, was unobtrusive but helpful and her suggestions were spot on - and she was just delightful all evening My only ding was that the valet guys - who had enormous umbrellas - ignored us as we ran towards the door - that would have been nice, even though we didn't use the valet service.  Food is great, ambience is lovely, but the people here are the stars.  Will go back."], ["Nancy F.", "Well, what can I say:  after the valet parking, it was all down hill.  The food seems to be in a decline and really pricey for what you get.  You get the feeling that close attention is no longer being paid in the kitchen.  I found the service to be falsely obsequious, and the waiter's patter seemed to be canned.  And I really don't like being addressed as \"miss\" in an expensive restaurant.  Especially since my BF was addressed as \"sir\" and \"Mr. X.\"  Enough said. We won't be returning for quite a while."], ["Tom R.", "We have been there 4 times in the last year. Every time was perfect. Starts off with Valet parking, no headaches no stress parking. The whole staff seems to be top notch. Pleasant, bright and well versed on the menu. The food is great. Every app, every entree, every desert was great. Champagne toasts and personalized hand written special occasion cards at the table  -For apps. we have fell in love with the fresh mozzarella (hand pulled every 2 hrs.) wrapped in Prosciutto and drizzled with 15yr old Balsamic vinegar. Gezzz we love that. All the steaks we have had were great. Some of the best we have ever had. Done perfectly and seasoned just right. When the waiter asks for your valet card to have your car ready and warmed up, that caps it all for a wonderful dinning experience. But your wallet will tell the difference. We spend at least $100 each, to $125 each. You get what you pay for."], ["Sofia H.", "Lets try this again since my first review was removed.With opening day being Monday.... I was a little scared of the growing pains but I was willing to take the risk for Tuesday's business lunch. There was eight of us in their Boardroom.The menu is pretty standard for a restaurant of this caliber... think Morton's, Ruth Chris, The Grill on the Alley.They also offer dry aged steaks which is always an excellent option. After dining today and Tuesday, I can say The Capital Grille provides solid options and it is great addition for downtown Hartford.On both days I opted for the prix fixe lunch.   I started with the Porcini Bisque on both days and today I had the Scallops and the Lobster Roll on Tuesday.  Both were great selections.  I would recommend the Scallops over the Lobster Roll if asked.Cat was our server on Tuesday and she took wonderful care of us.  We were able to conduct our lunch meeting efficiently and perfectly on time.  Today was the more of the same.  Marissa was attentive without hovering around the table.  She asked if we had any time constrains, which we did not, and we enjoyed another wonderful lunch.Today our group was too full to enjoy desserts but thankfully Tuesday that was not the case.  We were delighted by the Chocolate Hazelnut Cake and Crème Brûlée.  The berries on the Crème brûlée were magnificent.  It was a nice refreshing touch.  Overall, The Capital Grille is an excellent new addition and provides an upscale lunch option while its competitor Morton's does not.Kudos team!"], ["Kitti O.", "So exciting to have Capital Grill open up in Hartford so I don't have to drive to providence anymore for Stoli Dolis. :)I missed lunch time and at 3:30 we were still too early for the 5pm dinner. When I made the reservation the hostess suggested we try out the bar and grab some appetizers and drinks prior to dinner. First impression, absolutely beautiful decor, dark wood some leather detailed chairs, a wall of wine, low intimate lighting. Top shelf liquor and home made chips to share. Our bartender was friendly and right away offered us a bar-bites menu and asked if we wanted sparkling or regular water, we asked for regular and he actually gave us Fiji water not plain tab, at no charge which is nice. He made a few great suggestions for appetizers we can share.Started with a calamari and chilled shrimp. The calamari was nice and light in a spicy batter and peppers. The shrimp was Jumbo shrimp with cocktail sauce. Taste excellent.We hung out here until dinner. The atmosphere was cozy, the Friday happy hour rush just started to come in, there was additional seating outside mainly drawing people who just got out of work and wanted to enjoy some sunshine. We were the very first table as dinner time started. Our waitress was very informative about the menu and made some really great recommendations also. We choose to share the Chilean Sea Bass and the basic Filet mignon to not overpower the taste of the fish with a porterhouse steak. There is plenty of sides to choose from, I stayed with the basic good old mashed potatoes. My husband tried a flavorful Cabernet similar to the Sorcerer blend offered at Morton's when they have the Bone-In-Filet.A really nice dessert selection from creme brûlée to flour less chocolate cake, coconut cream pie and so on. I choose the big hazelnut chocolate cake I was eyeing already being devoured at the bar. Big enough for 2-3 people to share. The Restaurant offers 3 different rooms you can bring a group of friends from a table of six to about 25 for meetings or private events. The kitchen is visible and separated by glass, the chairs are as comfortable as the booth seating. The bathrooms is clean and nice... Wouldn't expect anything less from a place this caliber.There is a parking garage if you prefer but they do offer free valet parking during dinner. I came too early so I used the garage, the restaurants do not validate this and it cost 7$ but no biggie next time ill come on time and use the valet instead. Slightly more expensive then Morton's, right up there with On20 up the road. Our dinner for the two of us cost 180$ plus tip. That's 2 cocktails, a glass of wine, 2 appetizers, 2 dishes and dessert. Not somewhere i'd come every weekend but worth the $$$$.Located next to the new movie theater and across from the Marriott. Right off the highway. Cheers :)"], ["Ian K.", "We ate at CG tonight and it was one of the best meals I have ever had. It was our daughter's birthday. Nicole was our waitress and she was terrific.  Made us feel vey special.  We ate off the taste of Hartford menu and the entrees, salads and desserts were great.  The generous pour wine tasting menu was a great value and a lot of fun."], ["Nancy S.", "Over over over priced!Poor food prep: cheap ingredient. It's a fraud. Incredibly small wine selection by the glass. Not everybody wants to drive with the open bottle!!!!"], ["Shawn D.", "Definitely one of the best overall dining experiences in central Connecticut. I have been frequenting Capital Grille restaurants across the country for the last several years and this one does not disappoint. This restaurant is situated across from the Marriott/CT Convention Center and next to the Spotlight movie theater. There are also a few other restaurants and bars very close by. Complimentary valet parking is available if you are eating at Capital. If you prefer, you can also park in the parking garage located behind the restaurant.  The atmosphere in the dining area is fairly formal and the bar area is a bit more business casual. There are also a couple of tv's in the bar.   As for the food, you will not be disappointed with anything that you order. They have a great selection of steaks. I typically like the filet, most recently I tried the special Bone-in Kona Sirloin. It was very good, but I still love the filet that melts like butter when you cut it. Since I was here to take advantage of \"Restaurant Week\", my steak was paired with mashed potatoes and green beans. Each had its own twist and was very tasty. I shouldn't forget that I had my choice of a wedge salad, caesar salad, or clam chowder. I had the caesar. It was very good. Add the creme brulee or chocolate flourless cake.. What more do you want?!?  Finally, the service is also fantastic as always. The servers are extremely professional, attentive, and knowledgable (Especially about the extensive wine list!)... I highly recommend this place for lunch, dinner, or even the homemade pineapple infused vodka."], ["Matt S.", "Visited the CG for Hartford restaurant week. Server provided sub-par service, slow and did not check with us regarding food. Lots of servers wearing less than formal attire for a restaurant that usually will run $60-80 pp with drinks for dinner. Food was mediocre, and disappointing (although most ordered from special menu so it has to be taken in consideration). Overall, wouldn't go back. I have dined at the Stamford CG a hand full of times and it is much nicer with both food and service. All servers would crumb your table, and would tend to your table in above average time. The Hartford CG isn't worth it. Maxs is much better for the same price point and won't make you wait 15-20 minutes for drink orders to come to table. Note* valet service was very fast."], ["Kurt S.", "Had the opportunity to go to Capital Grille for the first time this past week for a work lunch.  I got the french onion soup to start, it was excellent, probably only beat by J Timothy's.  For my meal I got the Sliced Filet Mignon with Cipollini Onions and Wild Mushrooms.  For my side I got the truffle fries.  The filet was tasty, although I was left wanting the gorgonzola fondue that others had on their mini filet sandwiches.  The fries were perfect, not too truffley.  It's worth mentioning that the homemade grapefruit soda is awesome, I was expecting it to be too sweet, but it was nice and light.  This place blows Morton's away and is on par with meals I get at Ruth Chris'.  Next time I come here I'll get the calamari and a couple drinks and this could very well become a 5 star rating."]], "Agave Grill": [["Katie H.", "I came here for the first time a couple of weeks ago with a large group for a Tuesday lunch, and we had the pleasure of being able to try a large number of their entrees. I wasn't expecting much, since Mexican food isn't my thing, but I was blown away. Every dish we had was delicious. We started off with chips and salsa. The salsa was really tasty, and the tableside guacamole we ordered to go along with it was some of the best guacamole I've ever had. We also got Santa Fe salads (which were huge) and Ceviche de Atun. It was my first time having ceviche, so I don't have a lot to compare it to, but I really enjoyed it. There was a lot of fresh mango, so it was on the sweet side, but I like sweet, and the ahi tuna was super tender. My side of the table demolished our ceviche within minutes. For entrees, we got a sampler platter of four different types of enchiladas (pork, beef, chicken, and vegetable). I tried a pork one, and it was yummy albeit not super memorable. We also ordered chicken quesadillas, which were surprisingly flavorful and addictive (never thought I'd say that about a quesadilla), and the Agave Street Tacos, which were my favorite of the day. The pork was so tender and wrapped up in blue corn tortillas; it was the perfect bite. I also had a bite of someone else's steak and yucca fries, and it was also well-prepared. The prices here seem to run higher than your average Mexican restaurant, but the quality of the food is also excellent. The restaurant itself was clean and stylishly decorated. The bar area looked great, and I plan on coming back on a Friday night to enjoy some drinks along with their fabulous food!"], ["Jim N.", "I have been coming here for years.  If you expecting spice hot tex mex then look elsewhere.  If First the bad .  The house margaritas as in most restaurants are forgettable . Sour mix is not an ingredient to a margarita.  Now for the good .My favorite here is the the National Margarita . Up.  Tonnight I had the tuna ceviche app.  Mango, tuna, some red onion . Excellent but perhaps a little sweet for me. I had the Mexican paella was excellent. Perhaps closer to a soup but very tasty. A dozen nah half muscles , half dozen shrimp, a claw and half of lobster, little necks and wonderfully savory subtle flavored broth over rice.  Bib and spoon required.  The wife had the cheese and the chicken adobe enchiladas . Yummy . Once again expertly seasoned . Not hot and spicy but yum!  If you like spicy enchilada , get the chorizo one."], ["Justin S.", "Great place. Best avocado dip ever . Would recommend this place. Will come early after not crowded"], ["Christine G.", "Went late on a Friday. It was not crowded but there were people there.... The service was okay, a little slow - it was a bit hard to get chip and water refills.  I thought the food was pretty good. The table side guac was spot on although overly pricey (but then again, guac seems to be running $13-15 a pop nowadays)?? I had a salad actually because I was needing something healthy - I had the sugar cane shrimp salad which was actually very good. It had a latin style dressing which gave it a lot of flavor. There could have been more shrimp. It was a filling salad. My husband had veggie enchiladas which he thought was fine. I can't decide whether to give 3 or 4 stars so I go with 3 until I visit again."], ["Meg S.", "We came with a gift card and were excited with the sign that said \"voted best tacos in CT\". The table side guacamole was on point and I would definitely recommend that. We ordered the famous blue corn tacos and they were good--not sure if I would consider them the *best* though."], ["Ryan D.", "just stopped in for a drink. place was packed but we were able to snag a table. everyone was having a great time."], ["Erica K.", "Agave is a good mexican spot in Hartford. Chicken tacos are delicious, love the rice and fresh veggies and of course the guac is the perfect way to start your meal. My margarita was too sweet, but probably my own fault for ordering a strawberry margarita with a sugar rim."], ["Jay O.", "I went there pretty late at night and it was relatively dead.  The ambiance was nice and the service was friendly.  I didn't sample a large variety of food, only the margaritas, chips and salsa, and chimichangas.  Everything was just ok...perfectly edible but if I had my eyes closed, you could have told me I was at Margaritas or On the Border.  I enjoy the food at both of those places but they are obviously inexpensive chains and the expectations are lower.  They had a variety of interesting things on the menu that looked worth trying. I'd give it another shot but I definitely wasn't blown away by my first experience here."], ["Greg D.", "An interesting stance on a New American taco with the organic blue corn tortillas - a non GMO heirloom native American seed in fact.  The tacos here at the restaurant were exactly the same as on the truck and from the food stand outside.   Pretty impressive that they can nail a perfect taco from three points of prep and sale.   5 stars for a perfect taco.  The Taco Monster of Brazos Valley, Texas"], ["J P.", "Fresh Mexican and delicious!  We've  gone  to this place  twice  s poo far and it's  very good. The pork is seasoned  perfect  so be sure  to try it.  Either  with  a taco or burrito, it's  succulent. Chicken  is really  tasty  too, great  flavor. Note: it's  kind  of close  quarters on the seating.  Pricing  is reasonable. Chips  n salsa  are complimentary.yum!"], ["Kait F.", "I've been here a few times, and the food is good, but my favorite is to come and sit at the bar for happy hour. $5 house margaritas come in big pint glasses, paired with the house guacamole which is bold and flavorful."], ["Susan K.", "Wow! This place was amazing! The decor was very nice. The atmosphere was very festive and lively. The service was spectacular! Everyone was so nice and attentive. The food, well that was an even better experience! My friend had the lobster tostada. It had huge chunks of lobster and he said it was great! I had the special taste of Hartford.  The salad had probably one of the best dressings ever! The scallops were nicely cooked and dessert was pretty and tasty! We will be back!"], ["Brigit C.", "If you want outstanding service, and fantastic and delicious food, go to Agave Grill!!  I would go to Agave every day, if I was able to.  I have visited Agave many times, with family and friends, and have yet to be disappointed.The food is so delicious and cooked well.  There is an excellent selection of food and liquor, and you can order to your tastes.  My absolute favorite is the mango chicken skewers--excellent!!  The combination of spices they grill the chicken in is so tasty, and the mango sauce the drizzle over it complements the chicken perfectly.  The six good-sized pieces of chicken on skewers is also served with a special corn salsa that has a special Mexican vegetable with a sweet taste that makes it truly delicious and unique-tasting.  I dream about the mango chicken skewers!!  The pico de gallo at Agave is also fantastic tasting, with a slight kick that leaves you wanting more!!The staff is also excellent!!  The servers are efficient, hardworking, and friendly.  The managers are kind and really care about their patrons.  On numerous visits, the manager on duty has come to our table and asked how everything was and if we needed anything.  My family and I had a particularly great experience at lunch on Mother's Day this year.  We went to a restaurant in West Hartford Center, but discovered we had little selection for a meal after it failed to clarify we were required to order off of the special price-fixed brunch menu or choose a picked over buffet.  We called Agave, as we had such great experiences and meals there before.  I spoke with the manager on duty, Nikki.  Nikki was supremely kind and checked to see if there was a table available when we spoke on the phone.  She came back on the line after about 30 seconds and said there would be a table for us, and asked how long it would be until we were there.  She was spectacular!!  Also spectacular was our server, Melissa.  She was very attentive and efficient; she ensured each of our orders was correct, and got whatever we asked for immediately.  Each of our meals was so, so great and delicious, and the service we received was just outstanding.  Needless to say, we made a wise decision in picking Agave for a special lunch.Agave Grill is simply superb.  For the best service and the best Mexican-based food around, visit Agave--and soon!!"], ["Giang-Tien M.", "Decent Mexican food in Hartford, the food portion was a little bit small, great service...."], ["Kirsten B.", "I have been here multiple times, and as a huge Mexican fan Agave Grill is great. I always have a house margarita. The tableside guac is fresh and delicious.Both the pulled pork street tacos and tacos alambres are amazing choices. Highly recommend!"], ["Raj S.", "Don't bother with the tamales the agave beer was great and I had high expectations going into my food. Out of the three choices I got one was inedible and the other barely tolerable. Hungry and tired I thought this place would be great but I was left feeling very disappointed"], ["Julie F.", "Came here with friends on a Thursday night and got a table no problem! Wait staff was very nice and brought us our drinks/food in a very timely basis.  We ordered the guacamole which was made for us fresh at our table.  We also all ordered margaritas and were all happy with our selections.  I had the frozen mango margarita and was very happy with my selection.  For my entree, I ordered the spicy shrimp quesadillas and they were delicious! I will definitely be coming here again while I am in Hartford!"], ["Edward W.", "Good selection of agave tequila and related drinks. Full bar available. Food was very enjoyable. Guacamole made fresh at the table."], ["Darcy W.", "Disappointing...Have heard good things about Agave, so we all thought we should give it a try. The drinks were solid and the bar service was good. Ok that's the end of positive... Ordered table side guacamole and they finally made it to our table about 2 seconds before our meal. Bland and blah... Our dinners were about the same. The service was awful too. My suggestion would be stop in for a cocktail and find another place to eat."], ["Ryan F.", "Agave Grill is a cool little spot in Downtown Hartford, within walking distance to the XL Center and a handful of bars.  My compadre and I took a quick dinner/drink rest stop here before starting our 4-day ski trip up in VT and enjoyed every last bit of it!We shared two entrees (spicy shrimp quesadilla and lobster enchilada) and washed both down with a round of margaritas (house, and habanero mango).  The quesadilla (pic: yelp.com/biz_photos/agav…) shrimp were spicy as promised, accompanied with a nice black bean & corn salsa, and generously crammed inside a tasty fire-grilled wrapper.  My friend's lobster enchilada (yelp.com/biz_photos/agav…) was loaded with chunks of lobster, and garnished with black beans and seasoned rice to offset the small-ish enchilada portion.  Food was great for the price, and the habanero mango margarita was delicious with just the right amount of kick!The atmosphere here is really cool - textured walls and knotty wood built-ins were neatly decorated with southwestern artifacts (sombreros, skulls, paintings, etc.).  Lit candles spaced throughout complimented the dimly-lit lighting and enhanced the warmth of the space.  Our server was great, although he seemed a little rushed/overwhelmed at first.  If you're around the Downtown area in search of a tasty Mexican meal and a cool scene, Agave Grill is worth a visit."]], "McKinnons Irish Pub": [], "Nolita Ristorante": [["Tiffany G.", "After reading the reviews and hearing how great their burgers were, I can't even fully express how disappointed I was with this one and only experience I will likely ever have at this establishment. We waited at least an hour for our meals, granted we were a party of 8, but we were told there was some sort of issue with the printer so that the whole order didn't print out to get to the cooks in a timely manner, or something to that effect. After going back and reading other reviews about how long food takes in this place, or for delivery, I'd be inclined to believe this is an ongoing issue they should really work hard to resolve! I ordered Grassfed Beef Tips from the specials menu. It tasted like over-priced beef stroganoff. It did have plenty of mushrooms and a few roasted onions, but I never did see the roasted peppers that were supposed to be in it. Let me tell you about the beef, I literally spit out the first bite; it didn't seem there was any actual meet in it, it was more like tough gristle that just wouldn't even break down to a point that would make sense to swallow. I didn't get a steak knife with the meal, so I tried to cut into a different steak tip and the butter knife wouldn't even cut through it, so it wasn't just one bad piece I cut into. This was enough for me to send the dish back, there didn't seem to be any edible bites of steak in the dish. Next, I ordered a salad, also from the specials menu. The salad looked great at first glance, it had spinach, strawberries and goat cheese along with a piece of salmon (I added the salmon to the salad). It was SOOOOOOO disappointing to have another and completely different dish that I couldn't even finish. The salmon was the only thing dry on the plate, yes because it was overcooked, and oh so salty. The salad was drowning in dressing. I didn't even care for the goat cheese. I had my friend try the goat cheese, as I know she eats goat cheese more than I do, so I wanted to be sure I wasn't just being overly critical at this point, and she said it tasted like the powdered cheese on smartfood popcorn. I also tried a bar bite that had friend chicken in it, and it was just okay, nothing special, I wouldn't order that again either! There were some chicken quesadillas on the special menu that were better than anything else there that I tried. I'm pretty sure I will never go back. It's one thing to get a bad meal once, but if you can't even perfect the make-up meal to win me over? That's enough of a chance IMO. When I go to Briccos, Chowder Pot or even Bertuccis and get a salmon salad, I don't leave a bite on the plate, however I couldn't even eat half of the salad I was served here. Highly disappointing, I tried. The second star is really only because I didn't have to pay for either of these meals. Oh, there was a whole fish on the menu that two people ordered, why would you only serve fish with basil mashed potatoes and no vegetables or salad to start? Most places serve a starch and veggie with fish, I don't even understand. Two of the three of us that tried the basil mashed potatoes thought there was way too much basil, I love basil, but there was no way that I could have eaten a whole serving of those potatoes with as much basil as there was in them (It was over-powering). Oh, don't let me forget to mention the cucumber jello that came with the Watermelon Salad, three people at the table tried the cucumber jello and hated it, why would anyone think that's a good idea? The jello was actually harder than jello, I heard it was more of a tofu/jello consistency. Meh, good luck! Maybe stick to italian or burgers if you go, but there's really nothing at all positive I can say about the specials menu."], ["Karla S.", "Outstanding! This is a hidden gem everything was delicious from the sandwiches to the pizza.  The homemade tater tots are a must and their fresh made pasta is spot on. Prices for what what you get is well worth it. Highly recommend."], ["Ally H.", "I came on a Saturday night to this restaurant and the restaurant was empty. There was no music playing and the heat wasn't even turned on! Then it took 45 min to cook a pepperoni pizza and ravioli. When I ate my ravioli it was cold. Despite the time it took to bring the food out, the food was really good."], ["Ronnie R.", "Absolutely delicious! We stayed at the Hampton Inn around the corner and ordered boneless wings, the Nolita burger and the southern chicken wrap. Food came fast, warm and nothing was missing. Very fresh ingredients and unique taste HIGHLY recommended"], ["Ita R.", "We had reservations for 7:30 pm for a party of 15 women and were seated ummediately. However, our entrees weren't served until two hours later. While we were waiting,  our waitress came to tell us she was being sent home because she wasn't doing her job fast enough. Turns out there was a problem with the order printer which delayed our orders and had nothing to do with our waitress. We asked to speak to the manager, but he sent out the bartender to talk to us. He poceeded to tell us what happened with the printer and that our waitress was going to stay on. When our orders were finally served, the presentation was beautiful and the food was tasty.  I waa not very impressed with the shrimp ravioli since I only had perhaps 2 shrimp and it wasn't in the ravioli. The manager never came out to speak to b us. We did get dessert and drinks on the house which was the very least they could. Our waitress Kali went above and beyond to make sure we were all taken care of.  We had come the night before and were practically pushed out the door by a very rude waitress saying they ing they had multiple reservations and we could not be accommodated even though the restaurant was empty at the time.  We were in town for a conference, and will probably be back next year, bit I don\"t think we'll be coming back here."], ["Anthony M.", "Well, Andrew was great and no pickle problem at the bar! Spicy Italian sandwich was awesome spinach dip excellent."], ["Stevie O.", "Went here for dinner last night and then back again today for lunch. Dinner was great; I sat at the bar. There was some amazing live music and a local brewery was there for a tap takeover. Cool vibe, excellent food. I ordered the chicken pesto tortellini and a few pints. Lunch wasn't as much fun but the food was still on point. I got the cheddar sliders with black truffle fries and a beer. Good eats all around. Will definitely come back here again in the future. Shop small!"], ["Andy C.", "Orders are always messed up, I've ordered take out on many occasions and have had to back as well many times bc my order is missing something. Same goes with ordering delivery, from home and my job. So many times something was missing.- Also $5 delivery fee for down the street!?The waitress staff is horrible, on two occasions they completely ignored my table with my friends. Meanwhile they chatted, the busy bartenders were able to take our orders. - The guys bartending are super cool and do a great job.Wait times for food can be unbearable as well.- Only reason i give 3 stars is because the food is very good aside from the crappy service."], ["Janette M.", "Never been before went on veterans day with co workers had extended break food was ok server was a bit rude"], ["Hema M.", "Their beer list is great and worth going to experience.  If you check in on Yelp, you can get a free draft.  Their food menu was extensive and their fairway salad was very good.  I also had the fried risotto and the rose pasta, all of which was tasty except the sausage in the rose pasta had some tough pieces in it and I probably would not get again for that reason.  Overall, it has a great atmosphere and a very big lounge/bar area."], ["Steve R.", "Thank you Vishal for the follow up.  I stopped in for a second shot this past Monday for dinner and had a much nicer experience.  It was a quiet night, the service was extremely friendly, and the food was excellent.  I wish I could remember the name of the meal I ordered but I had a hard enough time pronouncing it I was never going to remember what it was called.  It was essentially chicken with potatoes, sausage, and a creamy sauce.  It was delicious.  My only minor complaint is what appeared to be fruit flies flying around the dining room.  There weren't a ton, but enough to be noticeable.Overall, I'd love to come back.  Given the vicinity to work, I likely will in the near future."], ["Ayesheh N.", "I have yet to be dissapointed by this place. Granted I've only gone there for happy hours, my expectations are always beyond met. The staff there is very knowledgeable on their broad selection of delicious craft beers and are very pleasant people. The beer selection is unbelievable pleasing to anyone who enjoys a good brew. Definitely a place to check out if you enjoy good beer and exceptional food."], ["Lisa L.", "Happy hour 7 days a week - another thing that makes this place a \"go to\".  Love supporting a locally owner as opposed to a chain.  Tonight had the mott street panini and some wings and both were great.  The calamari and the aroncini appetizer could have been a little hotter."], ["Rachel M.", "Dined here last night after reading many great reviews. We wanted to watch the NCAA final game so we chose to sit in the bar. Lots of large TVs which was perfect. Great craft beer and cocktail list. An impressive 24 draft beers. I opted for a cocktail off the specialty menu, a lavender lemon drop and I also tried the strawberry basil tini. Both were great. We shared wings and did half mild buffalo and half bourbon bbq. Wings were good - we both liked the buffalo flavor over the bbq and wished we had gotten all that flavor. For dinner I got the pasta rose which was homemade fettuccine, sausage, chicken, spinach, and sundried tomatoes. It was tasty - a little salty for me but otherwise really good. My fiancé got the shrimp scampi. It was really good and had a touch of cream in the sauce which was good and different. Only disappointment was they didn't have any dessert options. I would have tried something."], ["William E.", "Great beer selection. Overall experience was good....they seem to be just getting everything to flow in this new establishment. I ordered a porterhouse cooked medium-rare which came out more medium-well. Despite the cooking issue, the steak was good quality and I still enjoyed it. I was too hungry to send it back. I'd go back here without hesitation the next time I'm in the area."], ["Jim B.", "We had heard a lot of good things about Nolita and finally were able to check it out. Here's what we found:o The food is very good and the portions are quite largeo They have an extensive beer selection with many on tapo The side Caesar salad isn't worth $5o There is a big happy hour business and it is quite noisyo The space itself is kind of weird. There's a dining area, a partially enclosed bar, an aisle with more tables, and an enclosed area in the middle with restrooms. The room itself isn't very warm and inviting and has a commercial, plastic feel to ito There is a wall explaining the Nolita name that is extremely tackyo The restaurant is attached to the adjacent hotel, and it just seemed to us to have a \"hotel smell\"With all that said, keep in mind that the food is quite good. But if you're looking for a quiet romantic evening, you won't find it here."], ["Maranda W.", "The service was pretty slow considering I ordered a salad and wings.  The salad shouldn't have taken that long to come out.  There was one other table of two at the restaurant and it was lunch time."], ["Jason K.", "Basing this on delivery service through GrubHub...Moved to the area from Queens about a year ago and miss the 150+ restaurants that used to deliver to my apartment. Found Nolita on GrubHub and decided to give it a try while not really expecting much because other delivery/take-out hasn't impressed so far. I was PLEASANTLY surprised. Food (Nonna's spaghetti and meatballs and the italian wrap) was really, really good. Fries were very flavorful as well although not super crispy because of the delivery time but I can't really fault the restaurant for that. Delivery itself was relatively speedy so no issues there.Overall would definitely recommend and I look forward to checking out the actual restaurant in the near future!"], ["Sonja J.", "Nolitas Restauraunt was a pleasant surprise for us! After reading some of the mixed reviews, we decided to give it a try anyways since most people seemed to express mostly positive experience here. The first point in their favor was the environment itself. It was very clean, and you could tell that daily upkeep was something which was important to them and happened at least a few times a day. All the carpets looked vacuumed, the tables and bar counter were clean, and I would describe the genera l décor as something which would suit most contemporary tastes. The dishes were also clean, and in fact you could tell some had just come out of the dish sanitizer because they were still a little warm to the touch. I have eaten at other restauraunts where even though the dishes appear to have been put through a cycle they still have specks of food or liquid on them. Gross!! However, Nolitas was very clean all around so that was a big plus.Next, I would say the food really was better than I had expected based only on reading the reviews. Some reviews criticzed the food as being somewhat stale or dry. We did not experience that however. My cobb salad was exactly as I had expected it to be: fresh and crisp lettuce, ripe tomatoes and crispy bacon. The only thing which maybe could have made it a little better was the flavoring. I'm not totally sure, but I think they might have added in something which tasted like watercress which just has to much of a bitter taste for my liking. To be fair though, I did not let them know beforehand so I cannot really say it is their fault if they didn't know. All said though, I do think it was a great salad and I would still recommend it. As for my husbands lasagna which I tried, I thought the ratio of meat:cheese was just right. He can write his own review though... lol. The draft beers were a little pricey, in fact most everything on that page was kind of pricy. Everything else though was moderately priced and I thought it was a good value considering the portion sizes were pretty large. They also had a good selection of menu items to choose from. I'm sure most people would probably find at least a few things here which would 'suit their tastes.' (Pun intended, lol)"], ["Ms. G.", "I had the bone in pork chop with polenta and spinach. OMG it was fantastic! It's on the regular menu. Husband had a special that was lamb sausage and pasta. He said he hasn't seen lamb sausage on a menu since he's been in Italy. He loved it. The waitress is new but she was very good and sweet. I would certainly come back again!"]], "Sidewalk Cafe": [], "Besito Mexican Restaurant": [["Shani S.", "This was my third time dining at Besito and officially my last. I was able to be seated before my party arrived, so that's a positive. I love the decor. The waiter never introduced himself and was  less than attentive. He immediately started his spiel about the cocktail of evening. The tortillas were fresh and hot! The salsa was perfect with the right amount of cilantro. The restaurant really wasn't that busy for a Friday night. The waiter never voluntarily checked in with my table. We had to wave him down whenever we needed anything.  I decided to try the Ensalada Mexicana. Romaine lettuce, topped with chicken , crispy tortillas strips, tomatoes, cheese, black beans with a chipotle dressing. Terrible choice. For $19, it was the driest salad I've ever tasted.  Dole makes clear a way better southwestern salad, and it comes in bag. I asked the waiter for the available dressing they offered, as the chipotle dressing was a little too spicy. The waiter could not have cared less. Basically, he told me they didn't have any other options. I didn't even touch the salad so I packed the salad to go. The salad was thrown out. You can find a better Mexican meal elsewhere. Thank goodness for good company!"], ["Manny S.", "This review has been long over due.  The food is good and I know a lot about real authentic Mexican food.  The price is a little high and I think everyone knows that.We went to the restaurant on a Halloween that fell on a weeknight without reservations.  The restaurant was almost empty.  There was no on in the bar and less than a 1/4 of the tables were occupied.  \"Do you have reservations?\" No, but is that fine? \"That's fine\" We were then seated in the very last booth in the back corner of a completely empty bar.  More than half of the dining area was empty, but we get pushed to the back of the bar.  It felt very seregated.  We are not a 'bar' family and we are short so we felt a little awkward eating our meal as our feet dangled in the air as we sat on the tall stools.  By the time we left, the restaurant was just as empty as when we came in, so it seemed like there were not many reservations and plenty of available seating in the dining area.   Our family has been debating what transpired for a while and we regret not saying anything when we left.  We have been to many 'fancy' places where we were accommodated without a reservation if seating was available.  Is this the normal practice or were we treated this way because of how we were dressed or our skin color?"], ["K And A.", "We arrived early to a bustling bar area. We ordered two traditional margaritas which seemed to be especially sour and light on the tequila, however we were still optimistic.While waiting we took in the decor and really enjoyed the overall ambience of the restaurant.We were seated promptly at the time of our reservation and the service was incredible right off the bat. Our waiter brought us water right away, chips and salsa followed soon after. The fresh chips were the best I ever had and A liked the salsa. I had a mango margarita which was tasty and better than the previous one and A had a Don and Ginger.We started with the queso which was verrrrrryyyyy good. We dipped our tortilla chips in it in addition to using the soft tortillas that were served with it. For meals I had the tacos de pollo which were fabulous and filling. A had the mixtas enchiladas which were fresh, well sized, and very good. The beans and rice were tasty as well and I loved the platanos con crema.Come ready to pay but the food and service are well worth it. Upon departure we enjoyed the complimentary churros and I was happy to take home our worry dolls.-K"], ["Ashley N.", "Upscale Mexican restaurant that leaves a hollowness in your heart...maybe I'm being dramatic! The ambiance is super cool and it makes me feel like I'm in a fancy restaurant in Spain and the service is very professional. Definitely order the guacamole which they make right in front if you and try the margaritas - worth the $10!! As for the meals, I've had a variety of dishes from tacos to enchiladas to mole and I've never been in love with my dish. The food isn't that authentic and they try to make the dish more plate appealing than taste appealing. Now don't get me wrong, the food is not terrible just not the place I want to go for Mexican food unless it's restaurant week. I do like the churro they give you at the end of your meal and the small guy/girl to put under your pillow. Very unique concept and definitely makes me remember them. Happy hour specials are good if you can get there early enough!!"], ["Jay O.", "Definitely a few positives but overall, this place was very disappointing.  FIrst, the good: great location/ambiance, extremely well-made margaritas with a creative cocktail menu, and attentive service.  The food though, was ok at best and extremely disappointing for the price.  The fresh guacamole was fine but you can get the same or better at a variety of places these days.  The empanadas were small, overpriced, and just not very good.  The mixtos taco dish was basically a plate full of melted cheese with very few pieces of meat mixed in.  Don't get me wrong, I like melted cheese as much as (if not more than) the next guy but for $22, this was just not at all worth the price.  It was basically greasy cheese that you can spread onto mediocre soft taco shells.  The accompanying salsa/rice/beans were all pretty tasteless.  The enchiladas were ok but I've had better at at Mexican chain restaurants.  The pastor tacos were the low point...the pork was flavorless and not all that tender and there was nothing on the plate to make the tacos more interesting.  The standout was the short rib dish...really, the only thing worth the price tag.  One last issue...outdoor seating is always great but the table was WAY too small for four people.  We could not fit our food/drinks on the table which made the experience very uncomfortable.  So my advice, grab a tasty margarita and chips and salsa at the  bar and then go eat elsewhere.  Otherwise you will leave wondering what you paid so much money for."], ["Miss L.", "Food was delicious and the deserts too, so far my best Mexican Restaurant in Connecticut."], ["Pat F.", "Very disappointed tonight. This has long been our go to best restaurant but cfter tonight that has changed.  Waiter was a robot with no personality or happy to have a new customer. Basically he did a drop of drinks. ( watermelon margaretti terrible ) and we had to ask someone to get him.  Then the food was cold. Again no waiter. Not the food or service we hVe come to expect. The sauce for the beef wasn't even cooked"], ["Robert C.", "Attended a large business dinner mid October.  My Family is Hispanic so Mexican dishes every week. At home and eating out. Was the first experience here and there must be better choices in west Hartford.  Chips were nothing special. Definitely not made in restaurant.   Salsa although fresh, was bland and without flavor or spice or heat.   Guacamole was good.   Entrées were lacking flavor or substance.  Ordered mixed steak and chorizo enchiladas.  Two small enchiladas smothered in a full cup of bland tomato sauce.  Nothing else.  No chopped tomatoes,onion,peppers or anything?  Really?Steak was ok but chorizo was awful.  Hard semi circles cut from links with casing.  Not crumbled fresh chorizo as you would expect. Very bland.    Highlight of the meal was a side order of grilled corn.  A little pepper in it .....charred just right .....and a smattering of chihuahua cheese.   It was quite good.    Altogether, You can do better at most any other Mexican restaurant I am sure."], ["Bridget D.", "Drinks:  The margaritas were sub-par. Nothing to write home about.  I tried the Mango (super sweet), Jalapeno and Pineapple juice (not spicy) and House (very bland).   Food:  the food was very good and waiter was great about giving recommendation.   Though price for the food was little more than what it should be. Service:  I felt very very rushed the whole time I was there.  I ate 1/2 of meal and they are trying to take my plates away.  I don't get it.  It wasn't busy but they wanted people out."], ["Bill W.", "Love the concept and table side Guac is always fun but the prices are a little steep.  Had a Patron Margarita for 14 bucks.. and not much of a pour.  Overall, on my two visits, food was very good but a little to much for my pocketbook.  If prices were 25% less it would get a five star."], ["Shaunita J.", "I used to live in CT, and have been here before, but I hadn't been here in a few years, so I thought I'd write a review.Now, if you're looking for that gritty, hole-in-wall-but-dayum-it's-good Mexican experience, this might be it.  If you're looking for a place to get a drink and impress that cute girl from Accounting, this might be the spot.  The decor is romantic--the lighting is dim and it's got tall ceilings and a cute patio.  And pictures of horses on the wall (not sure the meaning of that?).  I made a reservation online, but it proved to be unnecessary--on a Monday evening, there were probably four other groups in there.  It was largely empty.  Anyhoo, the food we got was good, the star goes off for the service.  Remember I said it was really empty?  After all three of us arrived at the table, and chips were placed there, the server came by to take our order, and we weren't ready.  Well, I guess \"a couple of minutes\" means something different on Besito time, because it took what felt like forever for the guy to come back (maybe he was counting minutes using dog years?).So, we devoured the chips at the table, waiting for the guy.  After we ordered and waited even more, it took a few times to ask the server for more chips and salsa before he remembered it.  Apparently the soda fountain was messed up and the person who asked for a ginger ale didn't get it until she was nearly done.  Not the server's fault the machine was broken, but he walked past our table (without talking to us) a number of times and never stopped to explain the delay.Someone at the table had Suizas enchiladas and loved it--said the chicken tasted tender and good.  The fish tacos were good, not too wet, just right.  And the platanos were a great filling side dish, not too sweet.  Great food, good vibe, meh on the service.  I'll go again, just not when I'm in a rush."], ["Sammy S.", "2nd time eating at this place not the greatest food  but it's a nice atmosphere and the service on point"], ["Lauren S.", "This place was awesome! It's kind of pricey, but not unexpected for the area I guess. The service was great, the margaritas, guacamole, and entrees were all exceptional. I got the tacos mixtos and the sandia margarita (which was really strong! careful!). They gave us churros to go after we paid the bill, and even though we were so full we ate them anyway and they were fantastic."], ["Tammy G.", "Stopped in to Besito as it was recommended by a friend.  I wasn't disappointed.  My shredded chicken taco was refreshing and light.  The chips and salsa were delicious!  The menu is a little fancier than most Mexican restaurants.  That being said, my husbands chicken quesadilla was a bit disappointing so avoid that if your looking for something new and fun!    My only gripe would be it's a little pricey.  The drinks are small for what you pay, although my margarita was very tasty!   I would go back, we sat outside but the interior of the restaurant reminds me of something you find at a nice all inclusive resort!"], ["Liz B.", "I really want to love Besito, and don't get me wrong - I've had some good food there - but I just don't think it lives up to the hype it often gets.  The tableside guacamole is quite wonderful and, in my opinion, worth the price.  The other sides I've tried and really enjoyed are the tamale and the corn (elotes de la calle), both of which were really very good.  The plantains are good, too, but very sweet.Of the entrees I've tried, I'd recommend you skip the pescado con pipian y atole (mahi mahi filet crusted in crabmeat then seared and served with interesting sauces) - so so overcooked it was almost inedible.  The flavor of the sauces was good, but what's the point if the fish tastes like and has the texture of cardboard?  I did enjoy the enchiladas mole poblano - the mole sauce was rich and flavorful, though the chicken was a bit dry.The drinks are also pretty good, but nothing that blew me away.  I do really enjoy the spicy margarita and my friends all have enjoyed the house margarita.  The churros at the end of the meal are a nice touch.Again, I really want to love this place, but for the price I just feel like it should be better.  I'd certainly eat there again, but there are plenty of other places I'd choose first."], ["Amy D.", "The service at Besito is nothing less than stellar. From the hostess, to our server, and the manager - everyone went above and beyond to give us a great experience. The atmosphere is also outstanding. The table side guacamole is worth every penny. Our entrees were good, but for the price I think you could find better options elsewhere in the center. That being said, I will continue to return and try a few more dishes for the excellent customer service."], ["Mara S.", "Amazing experience at Besito. Went with the family including my small children. Were seated in a lovely big booth. The staff were so friendly and accommodating to my kids. The food was delicious. The drinks were fabulous. We had a lovely time. I can't stop thinking about the corn - just like the Mexican corn that I love but off the cob. All the food was superb. Highly recommend!"], ["Nicole C.", "My husband and I came for a late dinner on Saturday night. We both enjoyed our drinks and the chips and salsa. But we were shocked that our dinners arrived exactly 5 minutes after we ordered them. Obviously this means their food is all pre made and just reheated when people order it. ...making Besito just very overpriced fast food."], ["Joe B.", "Love this place, right outside of Blue Back Sq. -- puts Dos Amigos and Puerto Vallerta in the dust.  We were seated immediately both time we have gone both inside and out. Modern atmosphere and large selection of specialty drinks from the Agave bar (a little $$)  Go early if you want to sit outside so you can enjoy West Hartford center from the patio.Get the tableside guacamole! Mild, med, hot , made right in front of you , and the chicken tacos (small soft tortillas, pico de gallo, pleanty of melted cheese, rice & beans) are great to share , and you can make them how you want! That being said....you wont leave hungry - enjoy!Also one of the only places that serves Jarritos! traditional spanish soda, and please, don't forget, the churros are complimentary!"], ["Autumn H.", "I had a business dinner at Besitos this evening. Delightful experience. I was not impressed by the food (guacamole then their mole poblano followed by the tres leches). It was tasty but didn't leave an impression but the service was very nice. Our server was very knowledgable, kind, and genuine. He gave us the specials and really sold them and when we asked questions about each dish while making our decision, he was appropriately honest about the dishes he thought we would enjoy. I've served before and I appreciate honesty over \"being sold\" Would definitely come back to this establishment but I'll probably order a different entree :)"]], "Fleming's Prime Steakhouse & Wine Bar": [["Yuchen Z.", "I was really impressed by the decorations inside and the atmosphere the place provided. It didn't feel like WH Center once you stepped inside! Very fancy and comfortable. 2 Words: Wine Pad. WHAT? The wine list they give you is an IPAD! You can have them choose wines for you based on what you order, you can ask for favorites, you can browse the entire list, and there's SO much more. It's SO cool. You can even send your wine selection to your friends through email right from the Wine Pad. SO cool. Never seen anything like it.Food:+ Appetizers: crab cake- good slightly salty. Mozzarella and tomatoe salad is delicious and light and the balsamic is so refreshingly flavorful.+ Entrees: Filet minion is the tenderest and the best steak choice, hands down. (They come in 11 oz, 9 oz, or 6 oz). I say the bigger the better! Creamed corn went very well as a side. Slightly spicy because it has jalapenos in it. Peppercorn Steak, lots of peppers on top. Good, not great. We got a Lobster tail on the side (a whopping $25 extra) was great and delicious. They even shell the lobster tail for you-so fancy.+ Dessert: Chocolate lava cake was the best. It came with 2 scoops of vanilla ice cream & homemade chantille cream. Cake was a decent sized single serving cake. It takes 20 mins to prep so they ask you before hand if you want it for dessert.Service was very nice. We asked a lot of questions and our server was very patient and nice to us. Overall the experience was really great. It's definitely one of the pricey-er places in WH but I say it was worth the experience. =)"], ["Pat G.", "Perfect! Yes you heard me! Service 5/5 food 5/5 atmosphere 5/5. Kelly was a great waitress! Every appetizer we ordered especially the calamari was cooked perfect and flavorful! Also the best ny strip I have eaten! All the sides were good also especially there homemade scalloped potatoes! Big shout out to the chefs!..Came here with a bunch of friends for Fat Tuesday and had such a good time. Management bought our first round of drinks to!"], ["Carlos A.", "The happy hour burger is one of the best deals in town. I love sitting on their patio on a nice day."], ["bob s.", "Went there for Mothers Day. Extremely dark inside. Good service. I don't like how they try to up sell everything. They offer you bottled water instead of West Hartford s tap water. Way too expensive for quality of food.  There was a living bug in my salad. Kinda gross considering I can see it in the dark lighting. Makes you wonder what else could be there.  I would not recommend or go again. Way too many other choices in the area."], ["Kevin L.", "I have typically had very good experiences at Flemings in West Hartford.  However, our Mother's Day dinner yesterday was an exception.  I will chalk it up to a very busy evening but I think they should have been more prepared.  Although everyone was very friendly (as usual) the service was painfully slow, they brought me the wrong size wine, they were out of the Lava Cake dessert (keep in mind, we had a 6:45pm reservation - shouldn't have been an issue), and the crème brulee was among the worst I've had.  It had clearly just been pulled out of the refrigerator.  The top was not freshly \"bruleed\", and the texture was just heavy.  It's too bad they couldn't pull off this Mother's Day - there are plenty of options out there these days (i.e., Capitol Grille) and I'd probably lean that way next time."], ["Jaime H.", "The food is very good. But the problem I have with this restaurant and many others is the fact that the establishment doesn't get that people go out to eat so they can enjoy the food and spend time with the people they chose to come and dine with. They do NOT want to be chatty or overly familiar with the waitstaff or the management for that matter. The waiter introduces themselves and someone is constantly over there \"checking\" on your. Even the manager comes over to \"check\" on you. These are called interuptions. Good service involves the employees to keep a watchful eye on you from a distance. If you need something, they should be close enough to your table to come over if you raise your hand. I think a lot of it is arrogance and laziness on the part of the waitstaff. They all want to disappear and spend time texting and cannot be bothered with standing nearby and watching over the tables. They figure if they can come over when THEY choose to it is easier for THEM."], ["Ken K.", "I look for reasons to go to Fleming's. We celebrate events here like birthdays, and I keep an eye out for their specials. Their recent burger plus glass of Caymus for $25 was fantastic! You could go to Morton's downtown or Ruth's Chris, but Fleming's is better. Max downtown is comparable with just a different vibe... If anyone even mentions Capital Grille then I ignore them forever... Not even in the same vicinity of quality. I personally like seeing the kitchen... That's a good operating philosophy for a restaurant."], ["John L.", "I've been to a few Fleming's across the USA and I recommended this one to my family for a Sunday afternoon outing with my son who is attending college in the area. The room is well appointed, comfortable, and typical of higher end steak houses; the reception staff friendly and helpful. I ordered the iceberg wedge and their dry aged NY strip special. The wedge had a nice house made blue cheese dressing but the bacon strips tasted rancid (I've had 2 day old cooked bacon that didn't taste this bad!). The $67 dry age NY strip was fair to good, but the presentation and overall flavor was no match for Ruth's Chris, Capital Grille, or nonetheless Peter Luger's; there was no sizzling plate, no copious steak juices, or more importantly no well developed steak \"crust.\" I was disappointed. My wife's shrimp in her shrimp cocktail were a nice size, but mealy and lacking freshness and sound preparation. My son's calamari were well prepared and very good. Both of their filet mignons were well prepared, but mediocre by competitive standards (see the list above - RC's has the best filet in my opinion). Now the wine list... We a variety of individual tastes and usually order by the glass. Warning!! the wine by the glass prices are for 6 oz. pours. They will offer a 9 oz. pour and if you are too busy socializing with your group to ask the price you'll find the 9 oz. does not provide a volume discount! My wife's high end red at $21 a glass, became $31 a glass. Definitely do not repeat my mistake!Suffice it say, the Fleming's in Newport Beach, CA remains my favorite of this chain, but in the general area, the Capital Grille or Ruth's Chris (even though I'm not fond of this RC location's room/ambiance) are far better choices."], ["Bill B.", "My calamari was to greasy, a step down from past experiences here.  I also had an ahi tuna appetizer which was excellent. My wife ordered a salad that never arrived, here fish entree was average"], ["Paula N.", "The \"Taste of Summer\" special was so delicious!  I would recommend it to anyone looking for a great meal and nice atmosphere.  If you decide to try it, ask for Zach to wait on you.  He was so nice and provided great service. Planing to return in a couple of weeks."], ["Melissa A.", "The service was top notch and its a nice place for some tasty steak. However it is very expensive but a good steak will cost you a pretty penny. It is a nice place for a nice dinner for a special occassion or date.  I personally would not go here every time I want a steak just because its high in price, but besides the price the food was good and the servers were professional and timely."], ["Nadia F.", "I've been to Flemings for dinner, happy hour and special events and have never been disappointed.  The food is amazing and always a step or two up from its competitors.  Even their mac and cheese is somehow gourmet.  Happy hour is a great deal with amazing food/drink options at special pricing.  We love to stop in while shopping in Blue Back Square for happy hour.  Also made reservations to attend a special pinot noir tasting of various wines around the world.  We were introduced to some great picks which we ordered by the case at our favorite M&R location after this event.  Make it special by going to Flemings."], ["Staci R.", "Came here for a business presentation and Wow! We had a set menu that started with the New Salad: Wedge salad with bacon, carmelized onions, sunflower seeds, blue cheese dressing and slice of blue cheese. I am not a fan of blue cheese, but I wish I did b/c it looked aaaaamazing. I asked for the lemon balsamic vinaigrette, which was pretty good. Our dinner options were filet mignon or salmon with a side of mashed potatoes and green beans. I asked for my filet to be cooked medium and it was cooked to perfection-a warm pink center Mmmmm. The mashed potatoes were some of the best I've ever had. The green beans crunchy and tasty.  For dessert we had the carrot cake and it was the BEST I've ever had (shhh don't tell my future mother-in-law). It was very rich, but super delicious. Luckily I came for a business presentation so dinner was on them, but honestly it was delicious."], ["Anton R.", "Service is always phenomenal as well as the food Just went back for dinner and the steaks were cooked to perfection ! The potatoes are amazing ! I continue to invite friends and clients and they all walk away impressed !! Highly recommend for quality steak !"], ["Sammy S.", "I went for the happy hour with some freinds and the bacon burger was good for the price. But I think they need to have more options on there  happy hour menu but pretty much great resturant! Better than capital grille"], ["Candace W.", "Four of us headed to Flemings Steakhouse and Wine Bar on a Saturday night.  The restaurant was very busy but our reservation had a table waiting right when we arrived.  The ambiance is very nice, sort of a cozy but a cool feeling to it.  Once seated they ask whether you would prefer a black napkin or white to match/not leave fuzz on your pants. There was some eye-rolling at our table over this. The wine menu is not only written out on the menu, but also available on a tablet with more in depth information about the wines.  No one at our table is that knowledgeable about wines so it was helpful when guessing what to order (with the waiters help, we did well).The food was delicious.  I started out with the French Onion soup as did someone else at our table.  The other two people had the Heirloom Tomato and Burrata Salad.  Although it is a steak house my main course was the New Bedford Scallops.  It was wonderful, light and sweet.  My husband had the petite Filet Mignon, and it was also delicious, we shared our meals.  Another diner at our table really enjoyed the Salmon and the fourth the Porcini Rubbed Filet Mignon.  We shared sides of the mushrooms as well as Whipped Potatoes.  Everyone loved the food.  For dessert we decided to get one Walnut Turtle Pie.  We all loved it but agreed it was very rich and sharing it was the way to go.The biggest drawback to Flemings is that it is located in West Hartford with New York Steakhouse prices.  I  knew it was going to be pricey when the menu on line did not show the prices for the food.  We were all a little shocked at the prices.  We will definitely be back to Flemings but will remember that when we leave while our stomachs will be full, our wallets will be empty."], ["Marleena C.", "YEAH!! Another place I found that has the option for small plates of JOY! My husband and I went here this past Saturday and sat at the bar. Our waitress/bar tender Danielle was delightful. We started off with cocktails, I got the skinny version of some strawberry girly martini, only 99 calories! Then we shared the following: Ahi tuna, seared scallops and calamari...ALL SCRUMPTIOUS! I polished it all off with a dirty martini with blue cheese stuffed olives. I will be back for more since it filled my belly with glee!!!"], ["Myra C.", "Came here on a whim... Husband wanted to take me out and we were able to get a reservation on open table within 30 mins. Service was excellent! My husband had the rib eye (boneless) and it melted in your mouth. I had the heirloom tomato and house made burrata salad... So fresh and yummy! You definitely get what you pay for. Ambience was very romantic and it was just refreshing to have a nice quiet dinner."], ["Nancy B.", "We had never been here before and thought we would check out the Happy Hour. The interior is a darkly lit, calm and comfortable space. We entered the bar area and were immediately greeted by Patrick who seated us at a booth in the bar area as the no seats were available at the bar - a good move. Patrick took very good care of us. We thoroughly enjoyed the drinks and food offered as part of the Happy Hour. One little criticism would be with the Salt and Pepper shrimp as the shrimp tasted old to us. The Sweet Chili Calamari were very good and the sweet chili sauce on them was very nice. When leaving, I spied a gorgeous grilled medium rare steak on a diner's plate. We will be back to see if the steaks taste as good as they look. Bon Appetite."], ["Mark R.", "Overall experience was excellent, but a few points. It was a little too dark with the lighting. Lack of interesting side vegetable dishes is odd, even if consistent with 'classic' steakhouse mentality. Our waiter did an excellent job of pairing wine with our courses.Most importantly is that while the steak was excellent, many restaurants nowadays do steak very well - without me having to pay $45 just for the steak. I am happy we went and do feel its a good restaurant, but I won't feel the need to go back there just to have superb steak that has nothing to really compliment in on the plate. For about half that price I can have steak that is just as superbly cooked, and comes with seasonal and sublimely prepared vegetables and starch. Thanks to all the staff who were pleasant during our entire stay, and even gave me a gift box of truffles as a birthday gift as we leftM"]], "Arch Street Tavern": [["Gary S.", "Came for lunch. What you would expect. Good selection of beers, decent pub food, reasonable prices for a place of this type.  My waitress (Anissa) was very friendly and  sweet."], ["Stephanie P.", "I thought id give AST one more try- called for takeout and was put on hold TWICE before I was able to place an order. I'm giving up on you, Arch St Tavern. There are plenty of new restaurants in the area that will get my business instead."], ["J M.", "In Hartford visiting the convention center and looking for a good place to eat.... Found it!  Pastrami ruben was awesome, wife had the fish and chips that I will get next time!  Great atmosphere here, nice selection of American style food, burgers look good and they are on the list!!"], ["Kerry M.", "VERY DISAPPOINTED!!!  I was in town from Boston for a concert and wanted a simple order of nachos.  I was floored when it was delivered to me.  They were round corn chips with a small scoop of chili, layer of cheese on top, a few tomatoes and a bunch of scallions.  I was even more disappointed when I ate the top layer and that was it!  More than 3/4 of the plate was plain round corn chips which were stale.  I was still starving.  I asked to see the menu again but then it set in, if they can't get nachos right why give them another shot.  I wanted to say something about it but the bartender never came back to check on how I was doing.  By the time he came back I just wanted to get out of there."], ["Holly C.", "Older crowd (40's+) with a handful of late 20's in the mix. There was a convention going on apparently, so I'll give them the benefit of the doubt. Cheap draft beer; good decent selection of drafts; food sounded promising. I say that it sounded promising because they had a very shortened menu due to the convention... so we missed out on the wings. The bartenders were nice and kept making sure we were okay though."], ["Mrhapp Y.", "Happy Hour! Free food! Free GOOD food.Happy Hour! The service was great. The atmosphere is really cool inside. Im surprised Hartford has such a nice place."], ["Lisa M.", "Came here for lunch with my clinical group to celebrate the last day of school EVER! I've never been here before but it was relatively easy to find with on and off street free parking (in Hartford? awesome!). Walking in, one of my classmates commented that it smelled like church--I wouldn't know, but it definitely has a worn and broken in feel to it--according to the website, the building was originally the Hartford Brick Carriage Factory, built in 1895, so yeah, it has some years on it. We sat at a big long wooden table in the middle of the restaurant and drinks all around were ordered--the Cabana for me--as we toasted to our final semester coming to an end.The menu is a limited, no fuss, bar menu with the usual suspects--burgers, salads, sandwiches and wings. I went with the chicken caesar wrap--the waitress mentioned that it came with potato chips but for an additional $1.75, I could swap to french fries. For me, this was kinda off-putting, but I went with the fries so I could share with a classmate (they were nothing exciting, save your money and stick with the chips!). The wrap itself was good, especially because I asked to have mine with the cajun chicken to give it a little extra kick. Karolina had the buffalo chicken salad--at first glance, she was disappointed that the chicken just had a bit of buffalo sauce poured on it instead of the chicken being coated in it, but after a few bites, she said it was enjoyable. A cup of house chili, an apple gorgonzola salad and a burger were among some of the dishes ordered at the rest of our table, with no major complaints noted.Overall, it was a nice lunch with the girls, but considering the other choices that Hartford has to offer, and the fact that the food here just isn't that exciting, I'd go somewhere else first. This is more of a place to hang out at the bar after work and drink or to go hear some live music on the weekends, and there's nothing wrong with that."], ["Rolf L.", "Service is fine, but I'd go here for the drinks and the atmosphere. Going here for the food is for the people who think Chili's is fine dining and red lobster is where you take a date. I gave the place three stars becuase I have nothing bad to say about this place besides the food.  It's a happy hour, after work sort of place in an interesting space. Done with work and you want to tie one on? Go here."], ["David M.", "Cool spot, plenty of free parking nearby, nice atmosphere inside, nice outdoor seating area, great beer selection as well. Great place to see a band, i saw The Hold Steady last year, and Dinosaur Jr. back in June,  2 great bookings for a venue this size!  If the stage was raised maybe 2 feet higher than it is, so that you can actually SEE the band perform, I would have given it 5 stars."], ["Freesia S.", "I first heard about Arch Street Tavern when Beach Fossils came around and I really wanted to go but couldn't make it. Fast forward nearly two years, and while Arch Street brought in more live music I wanted to see, I never made it out until last week for The Hold Steady and Fang Island. I was fully impressed. Located right off the highway on its own little corner of Arch Street, this place is much bigger - and way cooler - than I expected. Open layout with high ceilings, stage area in the back with lots of space in front, tables behind the open space, bar to the left, and an outdoor area to the right when you walk in. The whole place is very conducive to a great concert experience. There were lots of beers on tap, including the more interesting, and there were some good $4 specials (Brooklyn Summer and Anchor Steam!), which we stuck to. While there was a crowd, we got our beers pretty quickly. The ladies' room was clean, and while I didn't have to wait too long, there was a pretty nice waiting area inside, which I can appreciate. Parking was a little tough since Arch Street's own lot was full by the time we got there, but we were able to park on the street around the corner for free after 6. I'm sure we'll be back for another show or just to hang out at the bar if we're in the Hartford area."], ["Cliff H.", "Slow service. Decent eats. Great beer. So-so desserts. Great atmosphere. High ceilings. Mon nights features Harford Jazz Orchestra, some of the best big-band live music you find from Hartford to NYC. Must see. Stop in Fri/Sat if you like your music live and loud. Outdoor patio is a great place to enjoy a drink on a hot summer day. Ample parking. 2 min walk from Convention Center / riverfront."], ["Linda L.", "OMG...are you kidding me .25 cents for on the rocks, after paying $8.50 for a Grey Goose they charge you .25 cents for the ice are the times in Hartford that bad that they stoop to charge for ice. Burgers were OK nothing to write home about.  Saturday night and only 12 people in the dining area, 6 at the bar, maybe the weekend is not the time to try the Arch Street.Will say Rochelle was a great waitress.We will not be back, better place for a R$9.95 burger and no ice charge..."], ["Nicole D.", "Been here a couple times, only when my husband's band has played here...luckily they're not doing bar shows anymore so we won't have to go back. The service is pretty terrible and the people there are so rude. We had a table on the patio outside receiving table service for drinks. We got there after everyone else so my husband went inside to order food. He went to the bar and when he asked for a food menu, the bartender rolled his eyes. Nice. Then my husband orders and explained we were sitting at a table on he patio and was wondering if someone was going to bring it out when it was ready. The bartender rudely replied, \"well I'M not bringing it out...\" Rather than put up a stink my husband just politely asked when he should come back in to get it himself... What a you-know-what. Then the \"music manager\" saw us eating and said we didn't have to pay for the food since my husband was performing that night. Hmm... he seemed nice enough, but there was a serious disconnect between the \"music manager\" and the snotty servers. Another turnoff, which I realize doesn't pertain to non-performers, was that the music dude said we were supposed to arrive at 7pm...ummm my husband didn't go on until 11:30pm, so to ask us to arrive at 7pm is beyond ridiculous. We have other things going on in our life and it's unreasonable to expect us to sit around your crummy bar for almost 5 hours. No thanks. We arrived at 9 which is more than enough time to unload and chill out for a bit. (Even when they play at big music festivals such as Utica they are only expected to be there 2 hours before performance time, so I don't know why Arch Street thinks they're so special!) Glad he's not playing there again! Also, the food was blah at best. Nothing special at all there. The bathroom was pretty gross and dirty. The crowd was weird to say the least. The only thing this place has going for it is that it's not pigs eye."], ["Timothy K.", "It's four stars for good music and nice atmosphere. The food is a bit underwhelming. Don't bother with the coldslaw not worth it, veggie burger really not worth it.  Reuben pretty good. 4 stars for the whole bar, not the food."], ["Vanessa T.", "Here - the food is good, the bands are plenty but if you come hungry, prepare to starve. The service is okay but I swear there's one cook in the kitchen at all times. You'll get fed eventually and it is good, not worth the amount, but only if you're willing to wait."], ["Douglas P.", "Wow, where to start?  Horrible service, decent food.  Went to Arch street on a Friday night and it was dead!  Most of Hartford is dead at those times as well.  Walked in, sign said wait to be seated.....waited....waited....waited.....just went to the bar.  Bartender came over, barely said two words to us.  Asked what we wanted to drink, we said menus first....she left, came back without menus and asked what we wanted to drink.  We told her, she had to come back because she forgot, STILL no menus.  Bartenders lacked personality and lacked attention to guests (there might have been 10 people at the bar all together).  Food came, was okay, nothing that would make up for the bad service.  I remember all the talk about this place, and thought it was going to be good, was horribly disappointed.A return is not in the cards on this one :("], ["Maureen L.", "I've had lunch here several times and I find the food to be a bit above average.  It is not my favorite lunch spot in Hartford, but I don't mind eating here."], ["Edward O.", "Perfectly serviceable pub proximal to the downtown Hartford area with the added plus of its own parking.  Service was affable and prompt and the food more or less what one would expect.  Decent selection of taps and the usual pub staples."], ["Colleen L.", "Food was good,  Service was crappy ... Chicken wings tasted good but were the smallest wings I have ever seen in my life !! Went on a Monday night  , The band was pretty good ."], ["Chris C.", "My one regret from working in Hartford was that I wasn't staying in the area, and wasn't able to spend an evening at the Arch Street Tavern.  That means my only experience here is for lunch.  That means no sampling from their beer selection (which seemed pretty good).  It meant only having sandwiches, and not something more significant.  It meant sitting at the bar and having a glass of water while I waited for my meal, only to wolf it down as fast as possible while the bartender processed my bill so I could leave before anyone asked how it was.  And sometimes I would try to finish up because the food was less than stellar.  I can say that the staff was friendly and accommodating.  Unfortunately, this is all I have to base my review on."]], "Plan B Burger Bar": [], "Rizzuto's Restaurant & Bar": [], "Arugula": [], "NIXS Hartford": [["Andrey K.", "Me and My friend Armen (owner Armeny Jewerly West Hartford )  very happy here with food, drinks, atmosphere in general. Our Beautiful bartender Ewelina made it all happened.  Come on down with small or big party and they will take care of you VIP STYLE!!!"], ["Anthony P.", "1.) Just to warm you up:Great reviews, awesome photo posts and Front Street all lured me into stopping here on a Thursday night. Glad I did.2.) What your eyes may see:Front street. What an upscale looking street, let alone the area. This place is a great attraction, and I thank the city of Hartford for including this additional theme into the mix.When you're inside NIX, you get the feeling of a cabaret in New York City.  I love how spacious NIX is with high ceilings. A nicely furnished place, plush leather couches and TVs. A live DJ was playing that night.3.) Food:I ordered the candied bacon on deviled eggs, crab cakes, Mac and cheese, Bad wolfe cocktail (bourbon drink with OJ), and Fried oyster slider with sangria drop shot with apple. The fried oyster and shot came from their \"snack bite\" menu which is updated very often and is something the chef of the house makes up. The crab cakes were scrumptious, but I believe the sauce where the cakes rested was what made the dish. The deviled egg was great with the sauce as well, the candied bacon was Yums McGhee. Honestly everything was yummy yummy yummy. They definitely know how to make a cocktail drink.4.) Staff:A lot of smiles, sweetness, politeness, attentiveness, although my waitress got a little snippy when I told her about my table having a certain allergy. 5.) Impressions:Very nice spot. Hip, classy, good food and cocktails."], ["Courtney R.", "I really want to love this place since it is so close to work. I have tried this about four times since my first review and I felt I needed to update. Also, for the most part the staff is really friendly. I stop in for happy hour ever once in awhile on different nights, every time I go in they are out of their signature cocktails. I'm beginning to believe they don't have signature cocktails and need to update their menus. I would really be interested in someone who has actually gotten to experience their signature cocktails. At first Nix's offered happy hour food specials, now they just offer nachos and buck a shuck. The nachos reminded me of day old Chinese noodles and cheese. With everything else on their menu I was really hoping for a better form of nachos. My last happy hour there, they ran out of the house wine.... how does this happen? When the waitress informed our table I was a bit harsh because of the past experience with the signature beverages, however after a little bit she offered a Merlot that she could charge us for at happy hour price."], ["Chris G.", "We love trying new places and the best time to venture out and try a new restaurant (for me) is during restaurant week. The menu was full of options, but we chose to pick our dinner from the \"best of Hartford\". I believe that you should put your best forward when restaurant week arrives,  it usually means new customers. To put this plain and simple, overall the food was average.  I order the smoke mac and cheese and that was kinda plain and it didn't have a hint of smokey taste to it. The sword fish was good and the skirt steak was ok.  The only other thing that seemed to stand out was the peice of the drinks. ..A bit pricy, so we stuck to beer.  I will check out again though, just to see if it will stay on the\"average\" side."], ["Bill B.", "New ground up building remarkable mood lighting, very chic relaxing decor & comfortable furnishings surrounded in creative architecture to create Hartford's best upscale lounge space. Service is still spotty at times however they will work this out and provide over-the-top service here in the near future. Each service mis-step was corrected by management in a swift manner with first class flair. Tuna tacos are truly amazing some of the best ever.  I ordered the filet, which was tender, tasty & well seasoned with fresh crisp steamed veggies. Restrooms were clean and neat. Pricing was above average. Bar scene is quite lively as the evening progresses. Bar seating is plentiful with flatscreen televisions"], ["Emily C.", "In a nutshell, NIXS is everything I've been wanting in Hartford. A lovely, low-lit lounge area with fabulous cocktails and a completely inviting ambiance. I've only been here a few times (most recently this evening for a few drinks) and unfortunately can't comment on the food yet (must come back to try!) but I'm all about the vibe here and can't stop lusting over those damn gorgeous light fixtures. I attended NIXS soft opening a while back and was able to sample a few cocktails but recently have been stuck on the Bazzle Dazzle with gin, peach stirrings, muddles basil, simple syrup and meyer lemon juice. They've also got a selection of housemade bottled cocktails! All in all, a perfect addition to Front Street, and I can't wait to come back for a full meal!"], ["Meghan F.", "After several more trips to Nix's, it is clear that they have worked out a lot of the kinks.  Also, get them clam chowder.  It may be the best in Downtown."], ["Justine J.", "Food was amazing ! Mimosas Amazing ! Service by Eric Was Also Amazing ! Will Definitely Come Back When I'm In Town"], ["Jean P.", "Delicious food and good selection of drinks. I highly recommend it"], ["Sally P.", "Love Nixs! New hartford hotspot! I give 5 stars for the customer service and food combined.I've been here twice, staff have been great second time; above and beyond (thank you, Chris!). Food comes next, first time here we tried the raw bar platter shared nicely with 5 people. Pork sliders are definitely the ones to try here, it was my favorite app that was ordered from the whole group. This is a newly opened restaurant, potential lounge (;)) and I've heard from other friends/patrons who had different experiences, I guess it's a hit or miss but don't knock it till you try it"], ["Wendy L.", "We love the atmosphere at NIXs Hartford. We tried out so many things in the menu and we really loved the Pork Belly, the crab Tater tots, the smoked Mac and cheese.The cocktails were amazing. My favorite was the Bazzle Dazzle. It was so good that so ordered another one.NIXS specializes in small plates and has food late night until 12:30."], ["Millie C.", "Service here is great. They are knowledge and everything they suggested was on point. Thanks Brett! Moscow mistress was super tasty and I'm not a hard-alcohol drinker. My hubby had New England coffee. Yum!!! If you come here you must have the Zeppoles. How can something so ordinary be so amazing, you ask? Well... Add some cinnamon and vanilla custard and you get this Zeppoles delight!"], ["Kristin B.", "Love the tacos. I'm not the biggest fan of the layout, but the waitstaff is pleasant and the ambiance overall is good. It's a good location if you're thinking about catching a movie downtown or if you're staying at the Marriott across the street.  I prefer the lunch atmosphere because the evening atmosphere is more of a lounge - particularly the volume of the place. Great if you're looking for a lounge. Not great if you want to have dinner and hear your dinner companion. That's just a personal preference."], ["Patrick D.", "Just had lunch here, in the up-and-coming Front Street district. NIXS has a cool, dare-I-say hip vibe that's more NYC than CT -- ask them about the origins of their name for a good pirate story. The food was very good...in fact, the clam chowder may be the best I've had (lots of bacon). Only downside was that, as happens at so many restaurants, it kind of fell apart at the dessert/check phase of the meal...that's when the server always disappears for extended periods and things inexplicably sloooooooowww down. All in all, though, a good experience."], ["Jackie B.", "Extremely off putted by the customer service. My group were forced to wait outside in 10 degree weather and when we said something they called US rude. Never will I step foot in here. Disgusted."], ["Sam H.", "Expensive...but the drinks are amazing, bartender was really cool, and the food was delicious as well. Wouldn't go for the nightclub but definitely worth dinner or drinks."], ["Marlene P.", "The response that I've just gotten from you is the same response I received that night by the manager...dismissive"], ["Vilija M.", "A great place for amazing food, atmosphere and turns into a dance club after 10pm. Service is top notch, thank you for coming to Hartford!!"], ["Dave G.", "Really good fish tacos and local beers on tap! Really nice bartender and food came out quickly. The interior is really cool too, very modern. Also try the black truffle fries."], ["Sonja J.", "Happy New Year! May 2015 be a safe and blessed year for everyone. We had an enjoyable time here. The cocktails were reasonably priced especially for New Year's eve. My favorite was the bazzle-dazzle... Favorite 3 times in one night to be exact! I ordered the honey Dijon wings and a chicken taco which turned out to be a great food choice for me since it was made just right, and was not to dry like some which I've had before. In fact,. all the food was prepared pretty good and to high standards. Except maybe the crabcakes which were just ok and not really as flaky as maybe they could have been. But overall we thought the food was good and the only minor complaint I had was that I had wanted to try the lobster bisque but they were out of it at the time. So it must apparently be a popular food choice for many.  I also really liked how the DJ played a variety of music for ALL age groups especially for us 'seasoned' people. Other plaes I've gone have played ONLY rap or hip-hop or other music which is typically geared for a much younger age group. But the DJ played music which would be enjoyed by everyone of all age groups and backgrounds. He even squeezed in our personal request for what else, but Celebration by Kool & the Gang to ring in 2015! (Not at exactly midnight which would have certainly been ideal , but close enough anyways to still make it count."]], "Max Downtown": [["Larry S.", "I am big fan of this restaurant.  One of a few in this restaurant group - Max Downtown is my favorite.This is a posh place with excellent service, fantastic food and its is special. One of my favorites for my wife and I to really treat ourselves. When my son joined us the restaurant staff, manager and chefs all made sure he meal was prepared in a safe way- he has a peanut allergy.I just hosted a dinner party for work here - 17 guests. Outstanding."], ["John R.", "If I was rating this place by looks it be 5 stars! The service was ok, the waitress messed up a simple order twice the food was ok not worth the price the staff tried to give 5 star service with 3 star experience. Not worth the money."], ["Kimberly K.", "We ate at Max Downtown as part of a large party.  The atmosphere, cocktails, and service were wonderful.  I ordered the sea scallops entree and my husband had the special, a bone-in strip steak with a green salad as a side.  The scallops were perfectly cooked and seasoned.  The cauliflower cous cous was delicious but there was certainly was not enough of it.  It was more like an accompanying sauce rather that a side which is what I initially thought when I read cauliflower cous cous and kale satsuma tangerine.  Had I known this was more of a sauce, I would have had an appetizer or a veggie on the side.  All the flavors were there but only as an accent to the scallops.  Really perfect.  My husband felt that his steak was perfect on the inside but a bit charred on the outside.  He was on the fence on whether or not this was truly a $50 steak.  In the future, I will probably stick to the chophouse menu when eating at Max.  I can't wait to try the raw bar! We were in a private room as part of a party.  The service was great.  The only advice to the staff is to not get in a hurry.  I did not like that they tried to push through taking orders and serving desert while the guest of honor was speaking.  I realize it was a Tuesday and it was late but it seemed rude to speak while someone was speaking.  This is why I didn't order desert or coffee.  Maybe just offer coffee at this point.  Otherwise, the staff was friendly and on top of the service."], ["Jacqui B.", "This place is delicious!  I went there for lunch and the prices weren't too bad either.  I've heard it gets a little more expensive at nighttime, but no more so than whatever else is around in the area.  They give you delicious little breads with some fancy butter!  It is great.  I also had the short rib grilled cheese and it was delightful.  Enough food so that I was able to only eat 1/2 and still be full.  The waiter was very professional and we didn't have to wait for our food for TOO long (a little long) but it was very crowded in there.Nice ambiance as well...I would recommend it!"], ["Anthony P.", "1.) Just to warm you up:I read the mixed reviews, and was always iffy on coming here. I believe a couple reviews noted this place for being bland and not so creative with their cooking. I can be honest, I sometimes like to feed into the hype. But that day I decided to be my own source of truth and reason, and let my taste buds do the critiquing. 2.) What your eyes may see:Upscale. Conservative. A place where ties, suits and brief cases come to for lunch and dinners. A place that people who are more established  would be able to eat (aka, middle aged and higher). Outside there's a valet parking guy, who is dressed up for business. This area right here almost reminds me of Manhattan, NY. A business professional type of atmosphere. At the host stand I was greeted by two smiling middle aged men with suits. Perhaps the Maitre'D? Perhaps the managers? No pin pointing it because it was lunch time. What your eyes may see is always what your hears may hear, a somewhat pretentious bunch. When you are there, I guess you should do as the romans do there, if you feel your lungs are vulnerable to the toxic air of snobbery. Grab a friend, family member or know one of the staff there and you will be set.3.) Food:The first thing I had was a small bread with butter and sea salt. The bread was soft and butter milky, and the butter was very rich and creamy. I had the veal and meatball panini. It was juicy, it was tasty. It came with parmesan cheese and spinach. Served with a side of parmesan fries, they cooked it to the way Anthony P. likes it which is crispy. I had a Pino Noir. I don't even remember the name.4.) Service:I sat at the bar side. My bartender's name was Scott. He was a very good guy. It was like he was a one man band, being able to gracefully serve food and drinks to the 10 patrons sitting at bar side and for the rest of the restaurant.5.) Impressions:I am coming back here to have some drinks, share some laughs. I'd like to check out more of the lunch menu and explore the dinner menu. I recommend dressing up a little, even if it's lunch time. If you have the look of pretention, I believe you will fit right in. ;) Either way, I believe one should try this place at least once, especially since the food is yummy!*puts nose to the air*"], ["Joshua L.", "Do you like to get all dressed up, Fancy Pants?  With your chic sports jacket and your button down shirts and your cufflinks?Well then, you probably already hang out at Max Downtown anyway, but if you don't, I think I just found a good place for you to spend a lot of money really quickly.  And as a bonus, the food is actually quite delectable.I came here for Taste of Hartford because, despite my impressive life choices, I do not currently engage in the Scrooge McDuck fantasy of swimming around in piles of money.  Nonetheless, I do appreciate that they treated me like a bona fide guest who really mattered.My date and I both had a lovely time.  The service was excellent, the food exquisite, the atmosphere classy without being entirely too stuffy, and overall the experience was very good.We both started with the veal and ricotta meatballs.  I admit I am a little reluctant to admit that I'm a terrible person who ordered veal, but hey, here we are.  I'm probably going to Hell anyway.  And it was worth it.From there I had the Organic Loch Duart Salmon which was well-cooked and rather impressively enormous, if not a little on the bland side.  I tried my date's Butternut Gnocci, which was flavorful and interesting.  Both dishes were pretty well-sized, which is nice, given that many high-end restaurants tend to err on the side of \"tiny but pretty.\"Finally I had the Tiramisu Parfait, which was amazing.  I'm not a big dessert kinda guy, but that thing vanished into my body without a trace.  Man oh man.Overall I enjoyed my experience here, though I'd be a bit reluctant to come and order off of the regular menu except during (very) special occasions.  The quality is very high -- don't get me wrong -- but I do think, to some extent, you're paying for the snooty experience and I'm not really one to embrace this sort of thing in general.From time to time, though, it's nice to put on your fancy clothes and pretend to be a rich dude.  Until the credit card bill shows up, at least.  But hey, if we were worried about long-term financial choices, we wouldn't be American."], ["Melissa A.", "Great food, Great service. Can quickly rack up a bill though! This is more of a place to go to celebrate something big or for a once and a while romantic dinner."], ["Nicole W.", "I really appreciate a fine dining experience but it seems to be quite rare these days to find the right combination of good food, professional service and pleasant atmosphere without feeling like you've been held-up at knife-point. A lot of reviews for Max DT mentioned the price, which is worth mentioning on a travel site, but I found it to be a good trade. The staff was very attentive without leaving us feeling that they'd like to rush you through your meal to turn over the table. The food was excellent; a nice selection of entrees (various high-end meats and seafoods) in complimentary combinations with interesting ingredients.  The atmosphere was condusive to a leisurely, special meal with my two old colleagues who we don't get to see much. Great Martini !"], ["Chad S.", "While traveling around New England, a culinary highlight was to have dinner at Max Downtown - a classy chophouse in downtown Hartford.The atmosphere is classic steakhouse, bar on one side and dining room on the other side. Service was slow, as was the kitchen. The kitchen was so slow that our server kindly provided us with complimentary bowls of leek soup. When our entrees at last arrived, two of our three steaks came out overcooked. I stuck with my steak and just coupled it with lots of horseradish. My mother sent hers back.I was ready to write a loathing review but the management saved Max Downtown by visiting our table and then providing us with two extra side dishes (a value of $15) and a big dessert plate with three different desserts. Job well done."], ["Ashika B.", "Had a wonderful birthday dinner here. Our server was a delightful older gentleman named Bruce who described the Filet Mignon Oscar in such vivid detail that my husband and I both had to have it! Bruce was not exaggerating. My steak was cooked perfectly. The wine selection, shrimp and oysters from the raw bar and chocolate chip ice cream cake did not disappoint either. There are few things better than good food and great company. Max Downtown is quite the treat!"], ["Kurt S.", "Came here with my wife to use a gift card we had.  We got a glass of wine, dirty martini, calamari appetizer, two filet's and the mushroom/onion and brussel sprouts sides.  The calamari was really good and the rolls were nice and warm.  The filets were HUGE, 10oz+ for sure, very flavorful.  She got the oscar topping, I got the peppercorn cream.  The mushroom/onion side was good, the brussel sprouts were boring.  Treva's brussel sprouts blow these out of the water.  Our waiter was awesome, he made the meal for sure.  I was expecting 200+ for the bill so it was nice when it only came to $150 + tip.  Can't afford those kind of prices normally but definitely my favorite in the Max chain."], ["Jason K.", "Excellent food and service, First-class all the way. Great Hartbeat spot for a special occasion or business outing."], ["T U.", "Last saturday night You guys served me medium well done lamb chops ...at $42.50 a pop.  I know you knew they were overdone and your staff wanted to see if I said anything.  I didnlt and now I am mad I sat there and gnawed on them.  The blend of broccoli rabe, bans brussel sprouts looked old and dried out...rest of meal...agnoletti...very good, steak tartar very good, all the other syteaks were fine.wine list...overpriced.  Bel Glos Meomi is wholesale to you at less than twenty dollars...it was the only reasonable pinot on the list...your cabs are way over priced...all of them.Sevice as good but no one as helping the waitress...she as a little enthusiastic for my taste...poured half a glass of wine for my wife...then said she was going out to get a decanter (for a 2010 pinot?)...and she never came back.Just not what we expectected but you guys were the only place in town where we could get a reservation...might be saying something."], ["Bill R.", "A great place to schedule a business lunch or dinner. Max's Downtown has great ambiance, a nice clientele and impeccable service. However, the food is lacking. I've been there many times and have never been impressed and, at times, have left quite disappointed. The cobb salad is a mess, the turkey sandwich for lunch had way too much meat and too little anything else (greens, sauce, bread). the burger is fine but nothing special (same for the lobster roll). In all, great place to meet clients or co-workers for a business purpose but I would not recommend it as a place to enjoy a night out of good food."], ["Josh G.", "Very fancy, and good service. Food was pretty good but not the greatest for the price. Nice variety of food and drinks."], ["Steven H.", "Kona crusted Ribeye crazy good better than capital grill. Been to capital grill the last 2 times in Hartford and it was good but the steak is better here, no freaking joke . Sommelier Justin is really good as well. Better value than capital grill ...expense account or not , bartender Mary is awesomeJust had the same steak again , crazy good officially best steak in town period .."], ["Melody R.", "Had a delicious dinner with colleagues  while in town for business. Made our choice based on Yelp reviews and were very pleased. We enjoyed the scallops, short ribs and hanger steak as well as the beet salad. Absolutely loved the rolls with butter, olive oil and Hawaiian salt."], ["Rick K.", "Have been in many times before for business but my first time taking the family.   Great night all around - excellent service and the food was outstanding.  Our server was engaging, pleasant and very attentive.  We started with a small custom platter of shrimp and crab claws which was extremely fresh and delicious.  A few salads (wedge for me) and soups for the table.  The wedge was very good - healthy dose of bacon and blue cheese; and the fried onion straws are a very nice add.   I tried the coconut soup (both boys ordered it) which had flat noodles and pieces of duck (among other things) - it was very unique and very flavorful.  All beef for the mains - 3 lobster crusted filet oscar, 2 NY strips and 1 barrel filet.   All cooked to perfection and just delicious.  The filet oscar was outstanding - I am a big fan of Max's filet to start and this was a great twist on an already great filet.   Their taken on oscar is lobster meat on top and bacon wrapped asparagus on the side -  a real treat.   I really think their steaks are way ahead of Mortons and Capital Grille (and I honestly don't know how Morton's Hartford stays in business).   I mentioned all cooked to perfection including my youngest who likes medium-well; which the meat snobs seem to always have a problem with.  Not here - happily prepared for her without making her feel bad for ordering something the way she likes it.  All the rest perfect medium and medium rare (seems simple enough but those of you who also like quality steakhouses know few actually get it right).   Three sides for the table - truffle tater tots which were the second best I ever had (next to the duck fat fried tots at Merchants in Nashville; \"all crust\" gratin potatoes which were excellent (the name says it all); and bacon roasted Brussels sprouts which just didn't work for me.  Nothing to do with the dish - I don't like Brussels sprouts and not even bacon could same them for me.  Two thumbs up though from my wife who does like Brussels sprouts (thus explaining why we ordered) and thoroughly enjoyed.  5 different deserts (all but me) - and the winner there per the desert fans were the Boston cream donuts.  As I mentioned service was excellent - we were comfortable the entire time and the food came out at just the right pace.  They of course happily wrapped our leftovers and we left happy and very satisfied with both the food and our overall dining experience.  Well done and looking forward to celebrating another special occasion there."], ["kelly m.", "GREAT place for couples to be romantic.  Nice ambiance and beautiful setting.  Guys, if you want to impress your wife, girlfriend, or a date then this is the place to go.  They literally have a piano bar singer that's out of the way and the music isn't loud.  The lights are dim and beautifully set and the staff are UH-mazing.  So my husband and I went here for a date night while in CT one weekend and we were sooo impressed.  This was the only place I read about that didn't have anything badly written about it.  Coming from NYC you take reviews seriously lol.  Anyway, we came here and found that it had an A rating - very good, then we were seated in this lovely and comfortable booth.  Our server was sooooo sweet.  The host(s) and managers were well dressed and utterly professional and concerned that your evening went well.  They had a genuine interest that you enjoyed your food.  I ordered the filet mignon and accidentally ordered it medium rare.  Well, that's what I got. lol My fault. I should have ordered medium well.  It was okay though bc they took it bad apologetically like it was their fault even though it wasn't and brought it back PERFECT.  My husband got the NY strip steak medium rare and LOVED IT.  I got my steak with a side of foie gras butter - OMG. it went very well with my filet mignon. We also ordered the creamed spinach and this amazing mushroom mix with onions they have that I adored!!  We ordered a bottle of wine of Pinot Grigio and it was also perfect.  To top it off we ordered coffee which was just perfect.  I can't say enough amazing things about this place.  Recommendation: guys come dressed in slacks and shoes, no jeans please.  Please impress your lady by taking the time to iron your clothes and take her to this restaurant.  Ladies - show your guy you can not only dress the part but enjoy the food as well.  and trust me...you will.Perfect ambiance, perfect setting, perfect food, perfect wine, perfect staff = perfect restaurant.  If I could give them a high five and a somersault - I would...hahaha.  Enjoy!!"], ["Maki S.", "I went there with a foodie friend of mine last night for Taste of Hartford Week. Their specials were $20.10 for a three-course dinner. Appetizers: I had a sweet corn bisque (and loved it), and he got shrimp tempura. Hands down the best dish of the night for him. It was delicious and I highly recommend it.Main Course: I got the smoked salmon and garden veggies, he got chicken parm. The salmon was slightly overcooked so it wasn't as moist, but the sides were really good.Dessert: He got a chocolate mousse tart, and I got strawberry shortcake. Both were equally good.The restaurant is what most would call upscale..lots of snobs judging themselves and each other HOWEVER you could get away with business casual. I wore a nice blouse and dress pants with flats and fit right in.In fact, you would wear a spaghetti strap mini dress and get away with it, but I really don't advise it -.-Anyway, I've got nothing but good things to say about this place. Try it."]], "Republic": [["Sara L.", "First time at Republic. Very crowded at 6pm on Friday, but still a great atmosphere. Strongly recommend reservations as even seating in bar is hard to get. Food and drinks were excellent! This is my favorite place in the Mill Restaurant Group. Bartenders know their stuff- he asked me light or full when I ordered a Pinot Noir. We had bacon wrapped figs, calamari, margarita flat bread and Thai wings- all very well done. The calamari was quite exceptional. I'll eat calamari, but generally don't really enjoy it. This calamari was superb. Great place!"], ["Jessica H.", "pros - creative fun menu, beautiful atmosphere, good servicecons - sometimes they run out of parking and you have to park across the street"], ["Lesley M.", "I went here back in January on a business lunch, so I unfortunately never had the chance to review the beer and alcoholic drinks.  : (However, I did enjoy my pulled pork and pineapple salsa sandwich.  I appreciate that I could swap out the fries for a fresh salad with a tasty vinaigrette dressing.  The ambience was updated and cool.  For lunchtime on a Friday, it was bustling with both casual and business-type crowds."], ["Carolyn K.", "This place is surprisingly trendy for being located in a suburban CT town. I went here for my birthday with my mother. It was a little nondescript; I actually missed it and parked in the medical office building next door. The interior of the restaurant is super cute. It has two floors with an open balcony. Very classy. It also has a nice bar area. The ambiance is sophisticated, but casual at the same time. It's a classy place you don't have to dress up for. I'm all about lazy sophistication, so the atmosphere was perfect for me. From the inside, it would be hard to differentiate this place from a bar in Boston. Service was fast and polite.I ordered a flatbread with gorgonzola, fontina, brie & pear. It was amazing. Although it's somewhat trivial, the presentation was very nice. On first look it appeared to have too much arugula, but it turned out to be the right amount to compliment the cheese. I could only finish 3 or 4 slices and took the rest home. My mother got the truffle mac and cheese which she also really liked. I took off one star because their dessert menu is pretty bad. The only one I really wanted wasn't even available because apparently the freezer was broken (???). So if I was able to have the desert and it was good this could possibly be 5 stars. I think it's a truly hidden (maybe not hidden, i'm not sure. It was hidden to me!) gem in Bloomfield, CT."], ["Eddie C.", "I'm a man of a few words. This place is simply amazing. The ambience is great, cozy feel, appropriate lighting, proper music in the background. Simply put, you have to experience this for yourself."], ["Anthony A.", "I found this place on Yelp while commuting back to New Haven from BDL. Traffic was heavy on I-95 and I wanted to find a place for a quick bite...I fell in love with this place INSTANTLY! The bartenders were all kind and introduced themselves to me and sparked conversation. I was served immediately and felt right at home. As I watched other patrons get served I quickly learned that they treat everyone who comes in like family. They remember the favorite drinks of their regulars and practically have it ready as they sit down.The beer selection is solid, and the whiskey selection is superb!!! The menu had a tapestry of items fitting of a fantastic gastropub at very reasonable prices! I started with the truffle Parmesan popcorn which was AMAZING! It's easy to overdo it with truffle oil, but there's was perfect! Free that I got mussels with frites. The white wine sauce for the mussels was perfect, and the fries were solid and came with their own mini bottle of ketchup. My shells were disposed regularly (almost so fast that I didn't see it happen).This place is a gem, and I would go out of my way to have a drink and a bite at this place! Very well ran establishment!"], ["Rose L.", "On a business trip and broke from the norm. Usually I travel with a group - a large one- and I usually have to settle for classic American nothing to funky. So this trip I am alone. It's almost blissful to be honest So hubby sends me republic via yelp to check out. So our meeting ended very late and off I go for my little adventure. I arrive the parking lot is beyond packed. But luckily it being past 6 the bank next door has closed and has ample parking. I easily obtained a table for 1 in the dining room. The bar was a little busy. There is multiple dining spaces. The bar, bar high tops, upstairs dining room and a side dining room.  I was upstairs and next to a window. I ordered two items. First - The truffle onion soup. This arrives with cubed perfectly sautéed onions in a pristine white bowl. Where the cream based truffle mushroom cream is delicately poured over the onion.  Truly delicious. My what I was expecting at all.  Very very rich, sensuous and heavy. Second - steak tartare. I gotta say am I sucker for this when I see it on a menu. It was a nice amount maybe 3 ounces. Spicy goodness of delicious steak. Served with a quail egg for dipping, a frisée salad with quite interesting radish and perfectly lightly toasted baguette points.  I didn't dip into the quail egg the tartare was on point although I usually prefer it with more texture (more chopped than this one was) it was a very tasty concoction and I will get over texture. I had no room for desert after all that. Nor capacity for a drink. So off to the hotel I went and enjoying my drink writing this review."], ["Susie K.", "This place was solid, but not up to the hype. We did a double date night here last Friday. The place was jamming so we had to sit outside, which wasn't too bad because it was a nice summer evening.The food was good, just kind if randomly priced. Some items were reasonable, like the burgers (my buddy paid $13.50 for a delicious patty melt), but some items were just expensive, like some of the sides and appetizers and my \"big\" plate of gnocchi, which was $17, without the chicken (not a big plate at all, btw). We got the mole nachos for an appetizer, which was enough for the 4 of us. The mix of sweet and spicy was pretty amazing. The cocktails were nice. I had a thyme and nectarine sweet tea and my friend had a Dial L for Lavender. The boys had beer, which Republic had a decent selection of and is pretty difficult to mess up. Overall, not bad. But it didn't blow my skirt up either. If I come back, it'll be for the happy hour, which looks pretty awesome."], ["Jess L.", "Definitely the best bar I've come to in a while. I love the rustic, classy feel. There's light, trendy music in the background but not enough to stifle a conversation. While there are a couple of large tables, most of the tables are set-up for smaller parties. Sitting on the 2nd floor lends a fun, bird's eye view of the majority of the crowd.The wine menu is smaller than the beer menu, but the wines are carefully selected. I had a Matchbook Cab that was stellar ($10/glass).I also was blown away by my salmon burger, which included a miso glaze and kimchi. Loved the flavor, and the fish was succulent. It was probably one of the best salmon burgers/sandwiches I've ever had.Parking in the back is limited, so opt for parking in the Wells Fargo parking lot."], ["Anita C.", "Went for a company happy hour on Wednesday 5-6:30 p. They're happy hour ends at 6 pm so get there before then if you want a discounted price on drinks! It's typical to see professionals dressed in suits and ties as its a nice place to have a group dinner or gathering, especially since it's close to windsor and simsbury where some of the companies are located. It was awesome to have a tall glass of beer for less than $4! Amazing deal! They even had appetizers for half price which we didn't try but definitely looked worth it! They own a few other locations and all seem to be pretty successful. I will definitely go back sometime to try their food! I've heard good things about this place and got a small flavor of it at happy hour but will definitely go back! Private parking lot is always a plus!"], ["Mari K.", "I had a nice happy hour (OK, 3 hours) here. The happy hour menu is great, and includes basic well drinks. My server was friendly and nice enough to allow me to count a \"vodka and ginger beer\" as a basic happy hour drink item, and threw in a little lime there for good measure :) It was a really delicious moscow mule :) We tried a few of the food items and were impressed overall. The fancy adult version of the pigs in a blanket are awesome and bring back warm and fuzzy childhood memories! I'd love to check out the dinner menu sometimes, and will likely be back for another happy hour."], ["Christine M.", "This is my favorite spot for date night or drinks with the pals! I love all the nibbles (especially the \"chicken coop\" of deviled eggs) and the meals are to die for. The atmosphere is beautiful and unassuming as well as trendy which makes it a great place for business meetings and when I need to meet with clients. They also have a patio which is great for the warm weather. The bartenders are awesome and make some killer old fashioned libations (which i love!). Servers are great and they always go out of their way to make you happy. Great music too, none of that elevator music! A must try, once you do you will be hooked!"], ["Don P.", "It was my first visit, I only went in for a quick beer but found the service to be warm and quite friendly. I really like the wood panel interior bar layout very much, there is additional seating which can accommodate a rather sizable crowd and there is even a long table for a party of 8 or more. There are a number of small cafe tables in that area too for couples or for a couple of friends. The bottle and draft beer selection is very nice and the tap system, I must say, provided an unusually cold beer,  indicative of a clean very well maintained beer system with no off flavor notes due to residual chemical cleaners. At some point, I will return to sample the food but from what I saw leaving the kitchen, my instinct tells me it should be a 4 star experience."], ["Trisha R.", "Industrial, modern vibe to this place- I dig it. Fun, open bar/ lounge area- great for happy hours. I have gone to both the lounge area for drinks and sat down to dine, and enjoyed both experiences. The food is delicious and the presentation is visually appetizing. I'll definitely be back again soon."], ["Emily C.", "I've been to Republic a handful of times since they opened and have found their service and food to be consistently solid. Whether visiting for lunch, dinner, or happy hour, their offerings are creative, reasonably priced, and well presented. The restaurant is also gorgeous in that rustic-industrial-chic kinda way. On my last visit, my friend and I basically ordered the entire happy hour menu (it was after a hike and we were hungry in a bad decisions kind of way); highlights included the truffle parmesan popcorn (only $2 as popcorn should be), margherita flatbread, deviled eggs, mole poblano nachos, and good ol' fashioned pigs in a blanket. $5 glasses of house wines were also a treat (naturally). Nice cocktail selection as well!"], ["Mel R.", "Went for a business lunch. It was fantastic. Nicely decorated with a rustic feel. Nice selection of beers. I got the Back East Pumpkin. For entree I ordered the salmon burger with a miso dressing and side salad. It was a good sign when they asked me how I'd like it to be cooked.  It was the best salmon burger I've ever had. Fresh fish with a nice light dressing served on a Kaiser roll. The salad had the same miso dressing. Yummy. We all ordered something different. Shrimp salad had really big shrimps and a nice blend of greens. The pulled pork sand which and Cuban sandwich were also very good. I'll definitely go back another time for dinner."], ["Maggie L.", "Republic is my second favorite place in Bloomfield behind Carbone's Kitchen (and it's much more casual than CK). Great place for lunch, dinner, and happy hour. Some of the menu highlights are: bacon wrapped dates, the giant BLTA, and the flatbread pizzas. I've never had bad food or bad service. Always fast, always professional, and the food is always on point. I've also been here twice with giant groups of ten or more people. We always call ahead and they have our table ready when we get there. Overall, a very pleasant place to eat. Friendly people, good food and fun atmosphere."], ["Jim K.", "We went here last Saturday for dinner for the first time, after having stopped in once earlier this summer for drinks. We tried the truffle popcorn and mole pablano nachos appetizers, and both were very good - nice twists on the \"typical.\" Everyone in our party enjoyed their entrees, which included caeser salad, Peruvian roasted chicken, and Cuban sandwich. I had the latter, which, like the appetizers, was prepared and presented a little uniquely, making it that much better than most I've had elsewhere. The beer and bourbon selection was very good. I'd highly recommend Republic, and we'll definitely take the drive from MA to go there again soon."], ["A R.", "After spending $40 on a cab to get to Re-Public I was warmly greeted by the cooks while seated at the chef bar. (best spot in the house...its where all the action happens!) The food did not fall short.... Holy gazpacho salad!!! SO much flavor. They almost forgot my grilled chicken add on.... But with a (literal) wink of the eye one of the chefs brought it out half way through my eating rampage. The loud bartender ...(again this is literal...she talked so loud to the people sitting at the bar I wasn't sure if she knew they were hard of hearing or if she wanted her manager to know people listened to her!) ...had asked if I wanted the check... I quickly told her I could not leave without dessert. And with that one of the line cooks offered me a scoop of their specialty ice cream. It doesn't matter what it was...it only matters that whatever the special ice cream is of the day...it MUST be ordered. Heaaaaavenly flavor. If I ever find myself at the Bradley airport again... I will pay $40 one way to find this joint again. Well worth it!"], ["Theresa R.", "Oh, Mill Restaurant Group, you've done it again.A standout spot in this area and easily my favorite spot in Bloomfield! I love the modern industrial vibe here and the open kitchen set up. The menu is what can be described as \"upscale pub food\" - you've got your classics like the beer battered fish & chips, burgers and truffle mac & cheese alongside unique stuff like Salmon Succotash and Steak Au Poivre with a cognac cream sauce. My favorite thing about Republic is definitely their bar menu! A great selection of craft cocktails, wines and local craft beers, and an AWESOME happy hour (Mon-Fri 3-6pm). I'm currently obsessed with their barrel aged manhattan - orange & cherry infused 4 roses bourbon, carpano antica formula, angostura bitters and a luxardo maraschino cherry. Oh, and the molé, HOLY MOLÉ! So. Freakin'. Good. Happy hour, lunch, dinner, drinks and apps - you name it, if you're in this area and looking for a great place to nosh, come here. You won't regret it!"], ["Lisa L.", "Continue to be pleased every time we come here - the Philly cheesesteak is the best one in the Hartford area hands down.  Combine that with the beer selection and the Brussel sprouts and the night is complete :)"], ["Peter K.", "The chef is really great.  Nice to know that someone out there really cares about quality food. Also the bartender is a real hard worker and got me drinks promptly and even anticipated my refill.  Seems like a mid to late 30's crowd. I recommend making reservations."], ["Meghan F.", "Republic is one of our favorites.  It takes a lot for us to leave Downtown Hartford to eat, but we will do it for Republic!  (We can't wait for them to open their second location Downtown in 2015.)I love how Republic combines formal and casual -- both in its menu and it's design.  for example, my wife's go-to order is the steak tartare (which she would put against anybody's) and mine is the 50s style patty melt.  Republic's patty melt, in my opinion, is reason enough to go there.   Flying in the face of the current thick, thick thick trend in high end burgers, the hamburger patty in a Republic's patty melt is thin and crispy on edges, filling the fresh rye from edge to edge.  Ohmygoshdelicious.  This is one of the rare restaurants that has nailed both the front of the house and back of the house."], ["Dee B.", "What an absolute gem! First time here and we will be back! Came on a Sunday night after movies just for drinks and it was wonderful. Staff, ambiance & recommendations absolutely wonderful. We will be back! Great job. Definitely a gem!!  Maja is THE BEST!"], ["Michael D.", "Republic is great, but not perfect...The Good: The food. Oh my, what a menu. Creative, tasty. The Blue Cheese burger was a standout. We also had the Pork Tankatsu. Also excellent. They have a great selection of Scotch and Bourbon. We didn't try it, but the Heart Attack Burger sounds like a dream.The Sub-optimal: 2 Pear Ciders on the menu, but no Apple. As a cider drinker, I was hoping a place like this would have some fine ciders on Tap. But alas, was not meant to be. Disappointing.The Bad: Do you like Noise? Do you want to take a date out for a nice dinner, but want to avoid talking to her? Are you and your dining companions deaf? Then this is your place. We were there on a Friday, and the noise level from the bar was deafening.All in all, Republic passes most of the test. May I suggest going on a slow night?"], ["Marieke S.", "Love this place! I've been here now 3 times over a year and every time has been great. I love that the menu has a little bit of everything, especially the appetizers. Their nachos are delicious!!! I don't know what sauce is on them but it's almost sweet. Last time our group ordered dates wrapped in bacon, very good, and both the flatbreads are delicious although I liked the pear one a little more. Always a good drink selection as well. We asked for a bottle that they didn't have, but our waiter told us next time we come they will have it in stock... I'm sure we will test him on that before the year is over :)"], ["Ron C.", "This is my go to place if I'm in the mood for a gourmet mac n' cheese. It's rich, creamy and filing. I come here for lunch with my coworkers and enjoy their trio combo lunch specials.It comes with a salad/side dish, entree and dessert. I never had a bad meal here.  Decor is nice. You can sit by the kitchen and watch your food being prepared. It has a second floor that overlooks the bar. For pictures and full review, ronsfifty-fifty.com/repu…"], ["Stefanie J.", "The food here was damn good, the drink list was extensive, the hostess was super nice, the service was solid, and the decor is really lovely, but MAN is it LOUDDD in this place. This is essentially why I'm giving Republic three instead of four stars - the noise was that distracting. I don't know why the acoustics here are so out of whack, but on a Friday night even sitting at a table in a corner, my dinnermates and I were practically hollering at one another in order to have a conversation. Maybe it's not so bad at a less busy time of day ... I'll just have to try again."], ["Erin S.", "Came here for dinner and drinks again. Our group of 4 split the cheese plate (excellent variety). I had the toad in the hole with salmon again. So good and so tasty. Service was exceptional,as usual. Nice wine selection and cozy, friendly atmosphere."], ["Byron D.", "Blat?  Bacon - Lettuce - Avocado - TomatoI really like the meal presentation.  They utilized a wooden slab covered with butcher paper as the primary conveyance.  The sandwich was actually two, set atop on another and held together by a sharp steak knife jammed through the sandwiches into the board.  The fries were contained in a steel bottomless sleeve lined with paper.  Bob mentioned the little ketchup bottles in his review..  I like them too.  Very cool.The bread was good quality the sandwich was toasted.  I chose sweet potatoes fries for $2. More -  our server was on our game and.... huge kudos for keeping our water glasses full!"], ["Ashwin S.", "LOVE this place!! Was here for the Happy Hour. My first time here and I thought the ambience was very neat. The rustic factory look, I was very impressed. The happy hour menu was small and simple. They don't have a fancy cocktail menu, in fact it was just a mix of vodka with any juice mix. Not a big deal, the beer varieties were good.The choices of appetizers from the happy hour menu were rightly priced and a good quantity. We had a plate of guacamole n chips, dates wrapped in Bacon, and the flat bread pizza. OMG the dates wrapped in Bacon, two orders of it was not sufficient for me. I could eat that on and on, it was that delicious.I will be back here many more times and the next time will be for dinner or lunch to try the elaborate menu."], ["Janelle S.", "Republic is great as a happy hour location.  The bar area is a bit cramped, but I always seem to luck out and find at least 1-2 stools at a table/bar somewhere to congregate as a group.  They have a bunch of discounts to choose from for happy hour, which includes a decent selection of wine and beer.  Their happy hour food menu is DELICIOUS!  The bacon wrapped dates are the most amazing thing that I have ever eaten.  I could easily eat like 10 helpings of these things in a single sitting.  Sooooooo gooooood! The truffle popcorn and hummus appetizers are also pretty tasty.  I've also been lucky enough to always have great servers which improves the whole experience even more!  It's great to have someone helping you who always seems to appear exactly as you need them!  On a side note, the parking lot does seem to fill up fast during happy hours regardless of what day I am here, so be sure to try and get to Republic around 5pm so that you can get a spot in their parking lot.  If not, you may have to find parking elsewhere!  Also, if you are planning on eating a full dinner, I would recommend trying to make a reservation - the dining room seems to fill up very, very quickly!"], ["Kris P.", "One of the best parts about traveling around the state for business is finding restaurants just like Republic.  I am a burger/craft beer junkie and this place fulfilled all of my requirements and then some.Service at the bar was spot on.  Not rushed, but quick.  Tap selections were a mix of beers I've had before and some that I had wanted to try on tap.  Back East Porter was perfect for a Monday lunch.The Au Poivre burger left absolutely nothing to be desired.  It had incredible flavor and was cooked as ordered (med-rare).  The accompanying sauce also blew me away.  That's the kind of love you put in to food.  The other part of the meal that may be missed by others was the cole slaw with two little jalepeno slices on top.  The slaw itself was really well done and that slight addition of heat really set it apart.  I always appreciate a little thought in to the sides instead of just throwing a scoop of generic slaw on the side.I will be in the area and will absolutely stop back in for another round and explore the menu further."], ["damian s.", "Food is great, bar is very inviting, very cool. Good beer selection - they have Goose Island Matilda on tap!However, if you go when the two girls are bar tending it is supremely frustrating - they studiously avoid eye contact and you spend half your night trying to get their attention to get your second beer. I thought maybe they were having a bad night but I went back for a work happy hour last week and it was the same.Pity because it's a great pub otherwise - where else are deviled eggs on the menu?So food and drink is 4 star. Service 2 star - brings it to 3"], ["Kevin W.", "One of my goto places when I am in the Hartford area. Great beer selection and even better food."], ["K C.", "Love going here. Definitely gets packed so I recommend reservations esp Friday and Saturday nights. I like their pre fixe on Sundays.  Favorites are bacon wrapped dates salmon burger blue cheese burger and roasted brussel sprouts."], ["Shawnee M.", "You can ALWAYS count on the food to NEVER disappoint! I love this place!"], ["Patrice J.", "Great food. Good service. Nice environment. The food is very flavorful. I am not an adventurous person when it comes to food and this place takes you out of your normal boundaries with no regrets!"], ["Laura F.", "Went to Republic for happy hour after hearing recommendations from a few people.  Was happy to see local beers featured as specials (City Steam, Hooker, Ten Penny, as well as Narragansett), and local Cato Farms cheeses used for their cheese plates (not a happy hour special).  What really puzzled me though, was the choice to serve toasted raisin bread with the cheese plate.  It really interfered with the flavor of the cheeses; some plain naan would have been great.Anyway, I really dug the interior and open kitchen, and the service was adequate.  I'd be interested in coming back to try the hummus plate or guacamole during happy hour."], ["Sharon M.", "I loved the food and atmosphere here. Very cool interior and design details. The Au Poivre Burger(caramelized onions, swiss cheese, crushed black peppercorns, cognac cream sauce & grain mustard) was one of the most delicious burgers I've had in a long time. We will definitely go back, I'm ready to explore the happy hour menu as soon as possible!"]], "Cavey's Of Manchester": [["Kyle S.", "Downstairs.  French. Best dinner and experience in recent memory. Thanks to all--Steve, Kate, Tom, Angie, et al. Cannot fault a single thing."], ["N D.", "The food is exceptional and consistent in the Italian  section...I have only been to the French once....Sunday is 1/2 priced bottles of wine, helping with that bill.   There is often a piano player in the bar.  This would be 5 stars if the place wasn't really in need of a face lift in the bar, bathrooms and the exterior (needs paint); and if the hours were not as limited. It seems a little more effort in this arena might bring in a younger (30's - 40's) crowd to the bar area and create some new loyalty (aka sustainability). A compliant that I hope the owner reads:   A fixed menu only for holidays, like Mother's Day.  Offer a few bites in the bar...instead of staying and dropping $100, we turned around and left because we wanted a small bight and wine, not a 3 course prix fix."], ["Jess L.", "I came here for my husband's and my anniversary one spring Friday. We chose the French room, and there were only 3 other tables dining at that time.I definitely need to give it up to Cavey's for having delicious, authentic French dishes. We had seared scallops, which had a beautiful presentation of pea puree, carrots, and pistachios. We also had the beef two ways, which included a delectable beef tenderloin. We split the duck rillette to start, and I also had some tasty, creamy cauliflower soup. Ended with a delectable hazelnut and chocolate torte. The presentation on each of these was exquisite.I had to dock one star for our initial, very uncomfortable conversation over wine. Our waitress and another person said to specialize in wine were helping us pick a bottle, but they spoke loudly about our price point and how their 2000+ list of bottles of wine could not accommodate the price point (of mid $50s - this should be reasonable). This challenge seemed bizarre given the number of wines they list. Plus, they did not seem particularly sophisticated in wine; they could only tell us that one section was bigger bodied while others were lighter bodied - information we already knew. We ended up going with the bottle we originally, relatively blindly selected - with no help and mostly awkwardness over the whole incident.I'll definitely come back to Cavey's for another special meal but would choose the Italian room next time."], ["Jen A.", "This review is for the fancy shmancy French restaurant (downstairs).Came here with a group of 6 after cocktails for my birthday last month.  The setting is romantic and intimate, and in retrospect, probably more appropriate for an anniversary or something like that.  Though the atmosphere was slightly stuffy, everything was top notch and authentic.  Seared scallops were great, as you would expect from 5 star french cuisine.  Staff was professional and wine list was extensive. Go here to propose to your girlfriend."], ["Monya V.", "What an adorable place - I can't say this enough - this restaurant is everything you would think of when you imagine a cute Connecticut trattoria.       The downtown location invites you to enter, sit & stay for a while.  Seasonal fruits, colorful vegetables and flowers decorate the establishment while candlelight & soft music set a comforting and relaxing mood.        Two coworkers and I broke from our five hour commute for a late dinner.  We had the option of sitting at their bar or in one of several dining rooms.  The service was beyond friendly, I don't think there was a single person who didn't stop by to check on us or attend to our needs.     We ordered a few glasses of wine which arrived with a basket of complementary bread - there were two varieties - and their home infused olive oil was lovely.  We tore through the basket and our server offered us another basket which we declined.  Honestly, a girl needs to watch her carb intake.       We placed our order and enjoyed the ambiance until the food arrived.  I had the cavatelli with vegetables - my pasta was homemade, delicate and so flavorful.  The chopped vegetables included kale, a multitude of mushrooms and others in a delicious broth.  Fresh parmigiana was grated in front of me to add even more flavor to an already delicious dish.My coworkers each enjoyed their dish and when I say we finished very last bite I mean we cleaned out plates.  I could have sat there for another three hours sipping coffee and partaking of their desserts, sadly, we had had another 3 and a half hours ahead of us so we hit the road.I wish the staff well, they were lovely in every way.  If you're in town, this restaurant deserves a visit from you, let me know if you try the dessert, I didn't and it's my one regret."], ["Leah M.", "The best restaurant bread in the world.  They make it fresh daily in house, it's so crusty and delicious.  Anyway, we went to the upstairs Italian restaurant this week and had an enjoyable meal.  The pasta I had was expertly created into thin, delicate strips.  The bolognese my grandmother had was ok and served with penne which is not my preference of pasta for a thick and hearty meat sauce. My husband really enjoyed his chicken and sausage.  The mussels were quite good, but on the small side.  The caesar salad was delicious, just the right amount of dressing, so flavorful.  Our waitress was very pleasant!"], ["T U.", "Whoever is cooking the chicken is fabulous...crispy skin, perfectly cooked...moist and tender...on top of  galic potaties, tomatos, spinach with fontina cheese ...great Caesar salad...fabulous. New GM is a nice guy...stopped to talk......stll one of our favorites...stopp giving us so much bread i can;t control it...with olive oil and salt..."], ["Linda E.", "Dining downstairs last night for Restaurant Week was simply ordinary. I'm not sure why Cavey's continues with their French 'dining experience' when it is their Italian restaurant that shines. The seating, (chairs so low that we all would have liked a phone book), dried on food was stuck onto the back of my chair, wine glasses did not 'sparkle', some flatware needed to be returned due to staining, and decor was just plain 'tired'. Although our waiter was friendly enough, his knowledge of the offerings was pretty sad. That said, our first course (pate etc. was quite good, although not at all unusual, the second course offerings were just okay....cassoulet was not really a cassoulet....Beans were over-cooked, duck was dry... Ehh, the 2nd offering of seafood sausage, shrimp and tempura-like medallion of cod was bland and forgettable. For dessert, all of us ordered the Plum galette with Roquefort. Sounded wonderful, yet the roquefort totally dominated the dish. Overall, a disappointment.The $30.14 prix fixe with options of $20.14 and $30.14 bottles of wine seemed like a good value. Alas, it was not."], ["John G.", "Five for food, one for service for tonight's French restaurant meal.  Three hours for a three course meal too long.  Starting with service of an amuse with no explanation/introduction set the tone of a very uneven service evening.  Felt like a kitchen problem but waitstaff seemed to disappear for long stretches.  Food was excellent when it arrived. Service contrasted sharply from a superb meal last week upstairs at the Italian room."], ["Krystle B.", "I've been to both the Italian and French sections of Cavey's. Hello deliciousness---my palette is unsure how to deal with such decadence!  I'm no food critic, my palette is by no means sophisticated. All too often my reviews on amazingly delicious food are heavily influenced by the discounted mini mountain like portions I receive. Prices not to be considered, Cavey's is just great, simply great.The French section was by far my favorite. The prices alone tell the consumer about the quality of the products they use---but what pushes this from just Fancy to Fantastic is the preparation of the food. Hats off to Chef de Cuisine Jordan Patrick, who even came out to speak with our table, for his prefect preparation of pork belly, ahi appetizer, and duck confit. My mouth melts reliving the cuisine carousel that went round and round. Amazing. The Italian section feels a little less upscale than the French section, but the food is also quite great. So thankful I am for prix fixe menus. I was able to try the mussels as an appetizer, and as is the standard in the fancy food industry, portions are minimal---but not with these mussels! I was given over 20 in shell mussels sitting in a tasty sauce, and even required two separate dishes to discard my shells! A truly great dining experience all around. Put on your fancy pants and prepare for a lesson in gastronomy."], ["Linley S.", "I am so glad I was finally able to try Cavey's.  I've heard so many great things, so when my mom suggested that she wanted to go to Cavey's for her birthday dinner, I jumped and made reservations immediately!   We dined on a Thursday evening, greeted warmly by the host (I presume she was the manager as well), offered coat check, and seated promptly in the atrium in the Italian section.  We had a team of excellent servers, Jerry and a young lady I believe named Carly.  They were very accommodating to my mother's dietary issues, checking with the chef to see what she could and couldn't have- and they both put up with my dad's ridiculous questions and comments in good humor.We decided on a bottle of Chianti that we selected from Cavey's extensive wine list- our servers were present with recommendations if necessary.Bread was served with delicious olive oil and vinegar.  Amaaaazing bread.I started with the mushroom flatbread, my brother had the meatball flatbread, and dad had the parsnip bisque.  We were all pleasantly surprised with the portion sizes of these dishes.  The flatbreads could be a meal in itself! The mushroom flatbread was excellent, with fontina cheese and truffle oil- what's not to love!For our salad course, my brother and I each had the tricolore salad, which was very simple- greens, parmigianno regianno, and simple dressing.  Mom had the golden beets and citrus salad, which was beautifully presented and she said was delicious.  Dad had the classic Caesar.Next up- dad was the only one who had a pasta course- he had the tagliatelle.For our main courses, brother had the chicken dish, which was served with house made sausage, and potatoes.  He said it was wonderful and he cleaned his plate.  Dad had the special of the night which was a fish, I'm blanking on the name- but it was a pink fish similar to salmon but flakier.  He raved about it.  For my mother the chef prepared a vegetable dish consisting of white beans, broccoli rabe, kohlrabi (a root vegetable new to all of us!), and perhaps a few other items.  She said it was spot on and really appreciated the chef whipping something up from off the menu.  I had the tagliatelle pasta dish (same one dad had as a pasta course).  It was amazing.  The pasta was so fresh, the eggplant sauce that was over the pasta was perfect.  For dessert, my mother had sorbet- a mango passionfruit and raspberry.  I had the apple crostada served with vanilla gelato.  I loved the portion size of this.  Perfect for one person who doesn't like to share desserts!Overall, this was a great place to celebrate mom's birthday.  She loved it, our servers were excellent, the price was not outrageous considering how satiated we were upon leaving.  There was excellent live music being played by a young gentleman with a wonderful voice.  The only thing that I did not truly care for was the decor.  I felt like with such upscale service and cuisine, the decor seemed a little outdated.  The bar area and restrooms also felt like they could use a spruce-up!"], ["Mitch M.", "I spent a lovely Saturday evening at Cavey's, A restaurant I have been looking forward to for a long time. They certainly did not disappoint as both food and service were on point. We started with the flatbread,composed of meatballs sausage and fresh mozzarella. We kept rolling with grandmothers ravioli, a perennial favoriteand a Caesar salad, both of which were fabulous. Our entrées included penne, With an authentic Bolognese and a beautifully grilled ribeye steak complemented with mascarpone polenta and broccoli rabe. We capped off our dining experience with Keylime semi Freddo and a fun twist on tiramisu infused with passionfruit. Our server, Colleen, was friendly, knowledgeable, and made us feel right at home.we look forward to a return visit. Thank you for a most memorable evening."], ["Diego M.", "Everything was perfect about this place. I wanted to take my girlfriend to an elegant and romantic place and this fits the description of the restaurant perfectly. We ate at the Italian dinner option which is the upstairs, and the food was exceptional, portions were just right and cooked perfectly. Staff was courteous, helpful, very welcoming, and went the extra mile to really make us feel the need to return. I would definitely recommend anyone to this place looking for a elegant evening out."], ["Adrian W.", "First of all, I realize it's been AGES since I wrote a Yelp review. So, that should be a tip off on how amazing my experience was, given how little time the 4 children leave me for fun stuff like Yelping. I planned a surprise dinner for my husband as his Father's Day gift. Being the researcher that I am, prior to visiting I scoured the internet for information about the restaurant. I have had this place bookmarked in Yelp for about 4-5 years, and the other yelp reviews are spot on. I also stumbled upon the culinary blog of one of the chef's a Cavey's. Reading his blog gave me hope for the CT food scene, as his passion is on par with what you only hear about in NYC or out West. All I can say is, swing in NOW before he moves onto something bigger...because it is damn near inevitable with the level of quality he sends out of the kitchen. On to the Food! I had requested the Chef's tasting when making our reservation and here is a list of what we had. While we were seated in the Italian section, our food was not Italian per se. It can best be classified as New American, with a strong emphasis on local and seasonal ingredients:Amuse Bouche: Seared local sea scallop, with brown butter and wilted arugulaFirst Course: Salmon riette (both cooked and raw), with carrot and kohlrabi slawSecond Course: Arugula salad with pink peppercorn dressing, large slices of raw kohlrabi and lardons (yummy!)Third course: black bass with roasted figs, arugula salad and roasted fennelFourth course: thumbnail sized, chicken liver pate filled, tortellini in concentrated stock sauce (amazing)Fifth course: pork tenderloin with potato puree and roasted fennel slices, fig glazeDessert Course: strawberry semi-freddo with miniature pavlova, fresh apricot, fresh strawberries and a little brownie the size of a Hershey's kiss. Overall, the staff were amazing, Our waiter was a pleasure (Jerry), as well as was his assistant (I'm sorry but can only remember his face, which does you Yelpers no good). Jerry had a very laid back approach to serving and made us feel really at ease immediately. He also helped up pick a wine that went with pretty much every course we enjoyed. We had an amazing dinner out together, which is so hard for us anymore. Ambiance: romantic, classical tastefulMeal: Surprisingly filling and very high level of quality and ingenuityPricing: Very reasonable, considering! Service: Attentive, kind and overall OutstandingIt's a treat and we will certainly be back. Thank you everyone!"], ["Dennis G.", "We have been attending the Tuesday wine tastings that always have a theme like Italian, French, Spanish.  An importer describes not only the wines but also the area around the vineyard.  None of then wines are very expensive ranging from $10 to $19 usually. The 5 small plates are made to compliment the taste of the wine. Only an ounce or two of wine is poured.  The food demonstrates the exceptional skills of the restaurant where farm to chef has been in place since it opened over 75 years ago. The only criticism would be the time between courses which can be a while when having to serve the wine tasting and other dining rooms. Warning: order the bread basket because the small plates are only a bite or two."], ["Tony M.", "had a decent dinner here the other night. the food was pretty good and the prices ok for what they give you. however i had issues with the long waiting times to take our order, then how long it took for the food to arrive. way too long and not good enough to wait that long for it in my opinion."], ["Gisele S.", "Probably the best restaurant in CT I've tried.  Been both to the French and Italian side and both have been fantastic.  Each time a different experience, all very good.  Service there is lovely.  Very welcoming and respectful.  Food is served on time.  Definitely would recommend this place.  Though expensive, the quality of the food is definitely worth it's value."], ["Keith C.", "Best meal we've ever had.  The service is friendly and impeccable.   The cheese plate is amazing with the wine.  Feels nice to actually meet the staff and have a conversation during your meal.  Not only is the wine list the best in CT but for the price of two mediocre meals you can have one of the best meals you've ever had before in your life.  Go downstairs and get any seafood dishes they have on the menu."], ["Sam B.", "This is the only restaurant that I've walked out from and this is the only one that i will NOT go back to ever again. I picked this restaurant for Valentine's based on all the good reviews.  I made the reservation on the restaurant's website for the French section at 9PM, I even called during the day to confirm my reservation.  I was told that my reservation was moved to 9:15 from 9;00, but that was  no big deal cause my date and I wanted to enjoy the night out.  The confirmation/reference number for this reservation is QFQZM28K, in case the management thinks I'm making this up.  We arrived at 9:10, and was told we will be seated within few minutes.  Seeing that there are three more couples waiting to be seated, and its Valentine's Day so its no biggie. There were 3 more couples waiting, but were quickly seated one by one.  Another couple walked in at about 9:45, got seated before we did, so I was thinking maybe they're waiting upstairs at the bar.  After few mins another couple walked in and sat next to us waiting to be seated and they were seated before us.  At around 10:15, one of the hostess came over telling the couple next to us that their table is ready.  They were seated before us? Now it became clear to us that we were just waiting for nothing. My date and I have been sitting there for the past hour, and she didn't even bother to ask who were there first or even looked at us.  Did she think that we can't afford to eat there? or we won't be eating/drinking much cause we are a young couple or because we are Asians?  I don't want to speculate whether its age discrimination or race discrimination. Either way this kind of service is very unprofessional and not acceptable at all. We sat there in plain site right in front of the hostess for 1 hour and 10 minutes, never bothered to ask us for a drink of water. After I asked about the table, the waitress did come over to apologize after saying she sat the wrong party, but we have been waiting for an hr and did she not notice us.  Also a simple \"sorry, it was my fault\" can not compensate for the fact that we had a reservation and waited a hour and 10 minutes and had to leave hungry. At last, for the management, I just hope no one else's evening got completely ruined because of the unprofessional service.  Too bad, we never got to taste the food, so I can't really comment anything on it, and it is something that we will never know."], ["Kacey L.", "Went here for a work dinner. Very nice staff and amazing food! Different meals, but very tasty. Can't wait to go again!"]], "Vinted Wine Bar & Kitchen": [], "Le Petit Chef": [["G E.", "At lunch in downtown Hartford this is a great place to go.  You can get sandwiches or salads, or \"home-style\" lunches including carved turky or chicken, chicken cordon bleu, and 2 sides (mashed, mac, vegetables, etc) all for about $8."], ["Stacey B.", "The bread. It's all about the bread. This place has the best french baguette in town. All the food is good, but the service is sketchy. The old man gets grouchy sometimes, but he is really a nice guy. Too bad he doesn't trust anyone with his cash register. He'd do more business if he could get a faster cashier. BTW - don;t go in if there are more than 3 people in line and you are in a hurry."], ["Mickey Z.", "I walked in at almost 230 and the place was totally cleaned up but the owner (i think) said come in i could order. Thank god! He explained he makes his own bread fresh every day with flour shipped in from Europe. There is a nice selection of sandwiches and salads posted on the white board so I chose the first one which was black forest ham, swiss, lettuce and tomato for 5.95. I wanted whole wheat but he was out so I opted for six grain. I got a side of veggies and he gave me a slice of french to try too. The bread itself was very dense, the french was perfect though. The ham was a real ham, not deli ham. There was one not ripe tomato slice and one piece of lettuce on the sandwich. It was OK overall - I would prob go back to give it another shot but I wasnt that impressed with the sandwich overall."], ["Ellen C.", "This was my favorite lunch spot in downtown hartford. Really tasty sandwiches. Homemade roast chicken. Big portions. Great bread. The owner is really nice too. I forgot they only take cash and didn't have enough money for an extra loaf of bread with my lunch to take home and the owner/cashier told me to just pay him back next time."]], "Metro Bis": [], "Treva Restaurant & Bar": [], "Laetus Restaurant And Lounge": [["Scott J.", "Laetus has the friendliest staff you could possibly imagine. Seriously they are the nicest people alive.Mandy and the other staff members go out of their way to greet you, introduce themselves and make you feel at home. They immediately make sure you are cozy, offer just about anything they can to you, and it's really a great experience.The selection of drinks is excellent, and what really sets out Laetus from the rest is the bartender. He is literally a chemist back there, mixing different concoctions, and inventing all sorts of signature Laetus drinks.Definitely try the \"Laetus Long Island Paradise,\"Laetus also has trivia Wednesdays, which is fun, entertaining, and the woman who hosts it is absolutely great. All in all, this is definitely a must go place in Hartford, and I envision it becoming more and more popular."], ["Emily C.", "Laetus hasn't been open all that long (what, two years?) but I'm already hoping they make a comeback. My fiance and I stopped in on Wednesday night and the restaurant was completely empty! Still, the food and cocktails were extremely good despite the menu being terribly limited (only about half a page compared to the dozens of items in their online menu). I started with a French martini and we shared the steamed buns, tempura bacon with sriracha honey, shu mai, and banh mi. All pretty solid and our service was friendly. I'm not sure if I'd go out of my way to come back at this point but I still hope they start to draw more of a crowd!"], ["Lesley M.", "A 3.5 star review rounded down to a 3 star...The Restaurant.com deal with Laetus prompted my husband and me to try this place.  Though it was a new restaurant (opened in 2013), I saw both some growing pains (one of the staff's young child hanging out) and potential (expansive Asian-fusion tapas menu).  Since the dining area was not the warmest (both literally and figuratively), we sat and ate at the bar.  Luckily for us, Nikki was our bartender/waitress and she was very easy to talk to.  Having her there was definitely a plus!The menu was very expansive with tapas, pho, and entrees.  We ordered tempura bacon, steamed buns, spicy beef pho, and an entrée.  I agreed with my husband that the tempura bacon needed a sauce, like some sort of a maple-flavored dip.  The steamed buns stuffed with egg and Chinese sausage was very novel and satisfying.  The gem of the meal was the spicy beef pho, which my hubby and I shared a large bowl.  The broth had a lot of flavor and there was a lot going on in the soup; spices, meat, noodles, and herbs.  In fact, it was one of the best phos I have had in the Hartford area.The pit of the meal was the mashed plantains with shrimp and avocado puree.  It was on the borderline of pathetic; the bananas looked rotten; the avocado puree was more liked watered down avocado mix; the shrimp was cheap and we only got five.  I also would avoid the margarita too.My advice is to order up on the tapas and soup and to skip on the entrees and mixed signature drinks.Bring your Restaurant.com certificate!"], ["Jason M.", "I am on board with the general consensus that Laetus is good, with room for improvement.Nikki took great care of us at the bar... I just wanted to make that very clear first. She's a very nice bartender who takes her job seriously. Makes a mean drink, makes small talk, suggests beverages you may like. I had a \"Black & Red,\" Guinness floated on top of hard cider. Whoda thunk that'd be any good?There were some food flubs. The Tempura Bacon was very good, but would have been better with the sauces it was supposed to come with... a fact we learned after finishing it. Also, the Mangu was a very plain dish. To me, it appeared like little more than a mound of mashed plantains, some thinned out guacamole, and plain shrimp. Which is probably what it was.They're trying to be creative, and for that they deserve applause. Our Steamed Buns (which were cleverly stuffed), and the Spicy Beef Pho were both very good. Their signature drink menu is rife with interesting options. The prices are more than fair; Pho is $7 for a small, $10 for a large, and the entrees are $15 and under.A little more professionalism is what's needed here above all else. There was a small kid in the dining room for a good portion of the evening, perhaps the managers' child. Sorry, hardworking parents of the world, but that's just not appropriate for an adult lounge. The menu's gotta improve some too.We'll see how they do. They're in a great location, so at least they've got the foot traffic."], ["Julia W.", "I visited Laetus late night after a recent Yelp event in Hartford. I'd never heard of it, but it was the one place open that was both open, and served vegetarian options. Sold. My friend and I walked in to a semi-chaotic scene. No one was at the front desk and there was a man who was so under the influence of something that he was literally just kind of floating in the front reception area, and no one was doing anything about him. When we were finally seated, we were then greeted by a server who seemed pretty lost. She took our drink order, and then our appetizer order. She was unable to answer about portion size or ingredients. Our two drinks came out separately. Followed quite awhile later by the appetizer. We ordered the veggie summer rolls, and they were absolutely excellent. We were also served a complimentary trio of sauces with chips. Had the chips not been of the bottom of the bag crushed variety, this also would have been exceptionally good, as the sauces were fantastic. Our food order was taken, and by the time it came out, after checking with our server twice on its whereabouts, we didn't even want it anymore. However, I was with a friend who is not big on complaining so we took a few bites then got containers to take it home. We ordered the fried rice, which was forgettable and flavorless at best, and a salad that was advertised as caprese, but ended up being a garden salad drenched in dressing, with some mozzarella thrown in. Edible, but definitely not good. We ended up giving our leftovers away to hungry friends at a party because we didn't even want them. Our server was so discombobulated that she didn't understand how to even split our bill, and I had to request that she ask someone else for help, after she came back twice to our table, trying to do math in her head. Ridiculous. The one thing I loved about Laetus was the live jazz they had going when we walked in. I would definitely go back for drinks, summer rolls, and jazz. But really, that's all this place has going for it."], ["Rachael F.", "I bought a Restaurant.com gift certificate for Laetus and went with my  mom for dinner at around 6pm on a Thursday evening. It is billed as both a restaurant and lounge, but I was surprised to walk in at 6pm to find the lights very low with loud music. It's certainly not my ideal setting for dinner, but hey...yolo. There was what looked like an office Christmas happy hour going on at the same time. They had lots of tables reserved with platters of apps and crudite. Other than that, it was empty.Our server was so friendly, welcoming, and helpful. She was such a sweetheart and gave me a complimentary sample of mafongo, a mashed plantain side dish. She explained the menu to us and told us a bit about how the restaurant changed up its overall concept since opening last year.My mom ordered a glass of wine and was not impressed with the pour for $7. For an appetizer, we had the chicken satay with peanut sauce. The chicken was juicy and the sauce had such great flavor. For our meals, I ordered the traditional pho and my mom ordered the Asian stir fry. Hers was slightly bland, but I was quite happy with mine. The sliced brisket was a little tough, but the broth was tasty and the portion was HUGE. $10 gets you a massive bowl of soup that both of us together couldn't finish. The vermicelli was delicious. Our waitress suggested that I try the spicy beef and sausage soup in the future, as it was her favorite. I would absolutely return for some yummy soup on a cold day."], ["Aaron L.", "I went to the restaurant at 5 o'clock on a Sunday to get some pho. I eat pho more frequently than any other food, ranging from 5 times a week to once, so I know when a place is good. The pho or beef noodle soup here was not. The broth was white from not rinsing off the rice noodles. The noodles were overcooked and couldn't be picked up by chopsticks. There was about 3 oz of cooked beef or 3 slices. The beef was marinated in what tasted like Korean barbeque or Vietnamese seasoning, whereas typically the beef served in pho is raw and unseasoned. The size large was smaller than all of the larges I've ordered in the past.The place was nice, but empty. This resonated when presumably the owner came to talk to me about my ethnicity and if I spoke her native tongue. The owners daughter asked me if I played Nintendo 64 and suggested I bring friends to do so. Then she preceded to show me the sound system by turning it up while I eat, hoping I would like it and tell my friends. After I paid and was leaving she said to bring some friends and that she would see me soon. Tldr:Small portion of meat/phoImproperly made phoDesperate and nosey owners"], ["Sanh A.", "Laetus has so much potential!  The hours are amazing and Hartford needs a pho place that's clean and open late. The staff was amazing! In fact they were out of this world attentive. I went for the pho and nothing more.The pho was okay but I was a tad disappointed with the sides. Iceberg lettuce for garnishing?  The place was definitely clean. Laetus is a place you take friends who want to try pho for the first time and who you know will be turned off if you bring them to a place with Mitch-match chairs.  It's a good introduction to pho but it wouldn't be a place I would run to when I'm craving pho. I didn't leave thinking the pho was all that great, I left with a belly full of noodles. If I was downtown more I would stop by but to go exclusive for the pho, probably not."], ["Sarah M.", "Yikes. Found this place on resteraunt .com when i was in town for a meeting. I was the only one in there. Completely alone. The bartender was nice. I think he was the owner? Only reason this is getting two stars. Ordered a bunch of food. Mozz sticks. Burned. How do you mess that up? Plantains. Un-edible.  French fries. Odd seasoning but I ate them. I almost felt bad for the company and still paid. Little elderly lady severed us. She was nice. Seriously service is the the only 2 stars I'm giving them. I wouldn't go. Good music. Maybe? No one in there!"], ["Bo Ae L.", "Arrived Saturday night and We had a long day. There was a dj which was pretty cool. I came in well knowing this is an Asian fusion restaurant and not a legit Vietnamese/Chinese/Taiwanese restaurant so comparing them to the ones back in my hometown New York would be unfair. My high review is mostly because our waitress Briana was great. She was attentive and sweet and very patient. And the dj was pretty cool too. The food was decent. My group of five ordered the chicken soup, skewers, the pho and the banh Mi. The pho's broth wasn't the delicate savory type of normal Vietnamese restaurants but even the small was filling. Some of the dishes are either massive or tiny. The banhmi was smaller than average and could use some more filling especially the meat and pickled veggies to give it that memorable punch as was the skewers but the large soups were HUGE. The chicken soup my friend had was really quite nice And the free table side sweet potato chips and dips were Wonderful.Another issue was the restaurant tends to have a lot of things sold out but Our waitress apologized so often and was so willing to accommodate/checked us regularly I happily chose other thing off the menu. It's a shame I wasn't in a drinking mood but the money I would have spent I gave as a tip because she really earned it. Thank you briana!"], ["Kerri P.", "Yep, totally a fan. From the SATC reference on the menu to the complimentary bowls of taro chips to the refreshing Flirtinis, I couldn't be much happier. My partner and I split sweet potato fries and summer rolls. He was hungry, I was just noshing to not seem irresponsible while having a few martinis. They will soon be adding some Latin-inspired dishes to the Asian-fusion menu. This is going to be my new place to schedule meetings, no lie. (Though I was a fan of the previous tenants, pizza places, the decor is much tidier and improved now)"], ["Alexander D.", "Stopped by for lunch with a friend. We heard they serve pho and it was a cold, rainy day. Laetus isn't known as a lunch place, so this was an experiment.Laetus was a pleasant surprise. My friend had traditional Vietnamese pho, while I had beef noodle. Both were made to order, fresh. Prices were very reasonable for lunch. Will go back again.Only 3 stars since the atmosphere was Spartan and the service was a tad slow. Good place; check it out."], ["Dan S.", "Came here for lunch during their \"soft opening\". They expect to have their grand opening soon so I'll reserve full judgment (and the extra star) unil then and won't be too hyper-critical because this place has all the makings of a keeper in downtown Hartford.Had the spicy beef noodle soup and it didn't disappoint. It definitely had the spice factor going on. Love when places aren't afraid to kick things up a notch. It'll clear the sinuses and had a nice rich beef flavor to the brother. Wish it had another piece of beef or two in there for the price. ($9.99 for a large bowl).  But with fresh sprouts (and the usual additions to Pho) on the side, it worked quite nicely.Friend at the pho and also really enjoyed it too. Good deep flavor on the broth, which makes the whole dish.We also tried the banh mi chicken sandwich to start. Well done dish with a fresh baguette. So important.  So, what are the minor quibbles? The iced tea was good, but refills were charged another $2.50. That seems a little petty for iced tea that can't cost nearly that much.  And the overall prices are on the higher end of the spectrum. $6.50 for banh mi, for example.  Not outrageous at all (and fairly in line with what Tamarind does for Thai food a few blocks away) but at that price point, you've got to nail things.   And offering water with the meal should be a given.  But service was friendly and moved well.  Again, it's still in soft opening and those minor trifles shouldn't dissuade the downtown crowd from giving this place a try.  Finally, Vietnamese food in Downtown."], ["Dan R.", "So how do I rate this? First of all - the food was freaking great !! Shu Mai and egg roll appetizers were outstanding. The dumplings were velvety, delicate and had great flavor and texture. The egg rolls were stellar- crisp but not oily and very flavorful with nice hunks of shrimp. Our entrées both revolved around grilled chicken. We had the Vermicelli w/ Grilled Chicken (Bun Thit Nuong) served w/ crushed roasted peanuts, cucumbers, lettuce, bean sprouts, basil leaves, & mint, and the Grilled Chicken (Com Ga) marinated grilled tender dark meat w/ rice & mixed vegetables.  The grilled chicken in these dishes was incredible- bursting with flavor and perfectly grilled. The accompanying vermicelli, rice, veggies and sauce perfectly complemented the chicken. Our Taste of Hartford dinner included a dessert. All they had were a slice of carrot cake or Oreo Mousse cake. We tried both, and preferred the carrot cake.So the food was excellent, now for the rest. Our table overlooked the front windows - so we had a great view of a vagrant sifting through the restaurant's ash tray looking for cigarette butts. We had a great view of some random and sketchy guys sitting in the storefront chairs to check their cell phones. The internal atmosphere was weird too. We were there at 7:00 on a Saturday, and the dining room was empty except for an obnoxiously loud table of 12. They seemed to tie up the wait staff, and I use the term loosely because there was one server and although she was sweet as could be and cute as a button, she really seemed lost out there on the dining room floor. Long periods of inattention and unusually long waits for drinks. What's weird is that she did show us some very thoughtful moments- like asking us if we wanted small plates to share our appetizers, and offering to bring us extra sauce when we ran out. But she did have her deficiencies, and her interminable schmoozing with the bartender instead of checking on us was a problem in my eyes.  I get it that Laetus seems to be more of a lounge or bar that serves great food.  Sorry, that's not my bag. Maybe a take-out bag would be my best option."], ["Paige N.", "Asian fusion DJ dance parties complete with neon glowing and blinking party cube decorations, here I come! Let's all get off our butts, get downtown and pretend we live in Manhattan. I came for the Taste of Hartford menu, and the portion sizes a little too small for my liking, but this is typical of the \"taste\" menus of this week of restaurant promotions. No complaints really- $20.13 is a good price for three courses. I had the shrimp shumai (served in little bamboo steamer bowls), bahn mi and hazelnut mousse cake and carrot cake (we split dessert). This year has been a discovery of the glory that is Vietnamese food. Forever I will remember 2013---job changes, new apartment, Yelp, pho, bahn mi. Banh Mi- WHERE in the world have you been all my life? Yes, Vietnam, but you've also been right in my backyard. Pho Boston, A Dong, Pho Saigon. So many wonderful places full of delectable culinary treasures. Bahn mi honestly might be the best damn sandwich I've ever had. Seriously. I know I'm an effusive person, but really. Pickled daikon radishes and carrots, mayo, teriyaki chicken (or beef or pork), fresh cilantro (ON A SANDWICH not a taco!), jalapenos, and a crusty french baguette. A mixture of cultures and history all wrapped up into one amazing freakin' sandwich. I've wanted to try bahn mi for so long and for some reason it took me until now. So, lucky Laetus will forever be held in high regard due to my unforgettable bahn mi experience. I've had shumai before, and this was wonderful shumai. Dessert was average, I would have preferred something Asian and funky, something I never tried before, so I could have another culinary revelation and \"what the hell have I been eating all my life?\" moment. So, inspired by Laetus, I headed over to A Dong, Whole Foods and Trader Joes to grab all of the essential ingredients necessary (and then some!) for making my own bahn mi (learning later that you can get all of it just at A Dong- including pickled daikon/carrot mixture pre-made). I'm going to eat bahn mi (spicy tofu from A Dong and chicken marinated in teriyaki sauce) all damn week long and enjoy it. I mostly love restaurants because they inspire me to be a more creative cook. Thanks, Laetus. I'll be back....your ambiance made for some impromptu dance parties, (rockin' to old school rap while relishing in carrot cake [plate garnished beautifully with shaved carrots, might I add] and dreaming about my devoured bahn mi)."], ["Sandra L.", "Tried to go here for dinner on either June 20 or 21st after reading the promising review in the Courant. There was road construction in front and on the side.  The front door to the restaurant was not locked, so we opened it. No one was inside, most of the lights were off and the tables were not set up. Is this place open for business or not?"], ["Ariana W.", "Terrible service! We paid a $5 cover for each of us (5) ordered twice and never got drinks."], ["Kate G.", "This restaurant gets one star - and that's because at least the food was good. My boyfriend frequented this restaurant's bar and wanted to try the food. We thought the restaurant.com certificate was a good opportunity to give it a try. WRONG.We were the only people in the restaurant aside from another couple at the bar for the duration of this experience. The service was on the slower side, but the most annoying part was that there was one woman who was clearly doing everything (cooking and communicating with us) and the older woman usually needed to call on her by screaming for her down some hole in the wall which must have led to the basement. The food we ordered was pretty decent... no dealbreaking complaints until the bill.It took them about ten minutes, together, behind the bar, to get our bill together. They told us they wouldn't accept our resturaunt.com certificate because we didn't print it out and I argued that the agreement with restaurant.com does not require the voucher to be printed (they made a mobile app for a reason! get with the times!)... after much back and forth she agrees to let my boyfriend upload it onto their computer. She then accused him of not showing her HIS voucher, though he was logged into his own account. In the midst of all of this she tells us that she'll do us this \"favor,\" but when we come back we need to print the voucher AND show it to them ahead of time. After being given such a hard time and dealing with their service, I responded that I didn't think we would be coming back. She then threw her hands up and said that if I wasn't coming back to Laetus, that she wasn't going to do me \"a favor\" by printing the certificate. She literally stomped off behind the bar and I felt like I was dealing with a nine year old child. After about 5-10 minutes of this argument including offering to call the police, we told her that we were paying our bill (less the restaurant.com coupon) in cash and leaving. Then she finally agreed to take a picture of the voucher...Needless to say, my boyfriend I won't be back to eat, and he and his friends won't be hitting up Laetus for drinks anymore! Moral of the story - these people need to learn about how to do business because they clearly don't know how to handle issues professionally."], ["Lauren B.", "A friend and I were extremely excited to try this restaurant for the first time tonight, however, we left really disappointed.We put in our order and they were out of 2 of the 5 things we ordered. I was really excited to try the pork buns and the Hong Kong wonton soup, but they were out of both. Very disappointing.We ordered the shumai and summer rolls, which were just okay. The tempura bacon lacked flavor. The pho wasn't terrible, but I've had way better. The place was practically empty and the service was so-so.This restaurant has a prime location in Hartford and it's a shame that the food isn't top notch. I think it is poor form to be \"out\" of menu items when the place is a ghost town. This place needs to shape up! Won't be back for the foreseeable future."], ["Shane G.", "If there were a place near Ann St that reminded me of exactly how sad downtown Hartford is, this place would be a gutsy competitor for first place. The Whalers made the right decision to leave, if you ask me.Sparkly bar, more flat screen TVs than folks who would want to watch them, mediocre mixed drinks and questionable food prep. The place reminds me more of an undersized wanna-be night club than a restaurant. This place is exactly the reason people don't want to live downtown; douchey, half-hearted restaurants who can't even commit to their own hours. The edamame was like rock candy but with soy beans instead of wooden sticks and salt instead of sugar. The spring rolls were weirdly wet with a funky, this-shrimp-may-be-past-its-prime filling and a peanut sauce that tasted like it had old, flat beer mixed in. The bahn mi was anorexic, dripping with honey and starving for filling while still sticky enough to make me want to wash my hands half way through consuming.The one waitress (bartender) working there told us to ask her for our entrees when we were done with our appetizers (mostly because she was ignoring us cutting fruit for the next day). When we finished our apps she immediately brought the rest of the food, meaning it had been sitting there the whole time. If you get a drink with citrus in it, I would say the likelihood that citrus was cut that day is slim to none.As we left, at 5:00pm, there was another couple trying to come in and meeting a set of curiously locked doors. The bartender laughed, chuckling that she closed up already. As we walked out the door, perfectly timed, they asked us if the restaurant was open or not. It's not really my responsibility to disappoint your customers for you, but somehow we were left with the confusing responsibility of doing just that. Lame."], ["Trung N.", "This review is strictly for the crowd that comes out after 10pm.What place offers good music, a full bar and Vietnamese food after 10pm in Hartford?Laetus!In our only night out in Hartford, we came to Laetus because our friend was set on taking me somewhere that played hip-hop.  She also briefly mentioned that they served Vietnamese food as well, which I was pretty weary of.  To my surprise, however, it was a great spot.MUSIC:They played a blend of hip-hop and EDM. Nice open space for dancing as well.BAR:Nice selection of liquor.  They even serve my favorite Vodka - Tito's.  Drinks were relatively cheap. I think my tab came out to be around $80 and we drank our share.FOOD:Surprisingly good.  The Pho was a generous portion - lots of noodles.  The hoanh thanh [wanton] was really good according to my girlfriend.  She's a self annointed hoanh thanh expert so I believe her.  The goi cuon [spring rolls] were pretty good as well.All in all, this place is great. I am a bit biased though since it combines three of my favorite things - good music, liquor and Vietnamese food.  If you like 1 out the 3, I'd recommend coming here."], ["Eric F.", "Six of us here. Everyone had lukewarm soups. Spiders falling down from the ceiling.  Tempura batter mediocre.  Will not be back. Would not suggest to even try.  Not sure how this place stays open we ate lunch and they maybe had us with 2 additional guest. Service trying the best with the tools their given which isn't much."], ["Nick A.", "This was a really disappointing experience. I love supporting Hartford and local businesses so we decided to go here on Valentine's Day. We are big fans of Asian fusion restaurants so we were excited to give this place a try. The first indication of a poor customer experience was the attempt to make reservations. It appears that the owners weren't too concerned about providing an experience for their patrons, we called three times and kept getting voicemail. Finally a woman called back and asked why we called. We made the reservations anyway and that evening headed to the restaurant. The restaurant had zero atmosphere and the staff was more focused on hanging out than helping us. When we were finally greeted we were told to sit wherever we wanted, but there wasn't many options. Most of the chairs were missing and the settings that were there were awkwardly placed throughout the restaurant. We sat next to the window, big mistake. There was a speaker blasting dated R&B music, which normally would have been fun had it not been for the entertainment tuning their piano and singing horribly into the microphone. We waited for about 20 mins with no menu or greeting. Finally a waitress came by to give us menus, it was clear the poor girl was the only one on the floor so we really sympathized with her. She immediately brought us water and then disappeared, never taking our drink order or anything. We finally got fed up with waiting and listening to the band tune up to seemingly annoy us. We decided to just leave and check out the new Front Street district. If the service is any indication of how the food is, this place won't be around for long, skip it."], ["Lola M.", "I live downtown and there aren't any Vietnamese places in close proximity, so I love this place. The prices are reasonable and whether I order take out, dine in, or grab drinks I'm always satisfied. Must try:- the wings! They have a great sweet and tangy flavor, perfect crunch and are very fresh. They come with a side of creamy avocado dipping sauce.- Bahn Mi sandwich with pork, although they run out of the pork a lot. Something I wish they would work on.- Pho soup. I'm constantly craving pho, and yes I've had much better elsewhere, but the broth is amazing and the portion of beef is substantial.I think they should change the noodles they use, they seem cheap and too thin and get mushy very fast. Either way, it still gives me that \"drunk on pho\" feeling that makes me want to take a nap! (Which is a good thing)I look forward to trying more of their entrees next time. The service is always pleasant and attentive. Is a nice place to go right after work with a friend or by yourself."], ["Anthony P.", "Came here for a Hartford Young Professionals Event. Nice medium open spot. Bartenders are good at what they do."], ["Katie C.", "Ask for the Cucumber margarita. Trust me.  Kitchen is open until midnight!"], ["Kitty M.", "this place is very disappointing . I used to like the soup there but they either mess up the order or took a very long time to get the order ready ( lunch time and barely had any customers there). half of the time the soup tasted weird with some weird meat in it ( they said it's beef but nothing taste like that). Onetime i ordered the wonton soup and the meat in the wonton was sour and I threw up right away."], ["Calaura S.", "I went here last Friday for their soft opening and had a few drinks.  The service was friendly and their menu was primarily Vietnamese.  There is ample space and a nice calm ambiance and right in the middle of downtown so they have a great location.  I will be going here again."], ["Lisa H.", "Great food, great service, great prices!Outstanding summer rolls, sweet potato tater tots, and perfectly cooked edamame.  Bahn mi chicken sandwich was tasty and filling.  Will definitely go back."], ["Terry L.", "Nice atmosphere and really very tasty food.  We shared egg rolls and dumplings along with a chicken banh mi and vermicelli.....all delicious.  They just opened a month or so ago and are in the process of getting their tap system so there were only a few beers on tap, but a nice selection of imports.  I recommend for good Vietnamese food in a nice lounge setting."], ["Jason Z.", "Always great food and people! Extremely fresh. Will live up to your discerning pho palate!"], ["Tim R.", "My coworkers and I went for lunch today.  The staff was very friendly and attentive.  The place was very clean and inviting.  The food was decent although the menu is limited.  I had the spicy beef noodle bowl, which was not as spicy as I thought it would be.  Overall, it was a good experience - check it out if you are into Vietnamese food."], ["Mickey Z.", "It was empty at lunch time on a weekday which is scary in Hartford. We got the pork egg rolls - juicy and delicious. We each got soups, one pho and one hot and sour I think. They were excellent. Would return."], ["Alex A.", "Not really a review, so much as a comment. After looking at the pics of the food on Yelp!, I took my gf to Laetus for dinner around 10:30 (we're from Manhattan. We don't eat dinner at 6pm) this past Friday night. Unfortunately, it was very much in\"lounge\" mode at that point. The music was way oo loud to sit inside for dinne and it was too cold to sit outsid. Also, the menu seemed very limited in options compared to what's shown in the pics on Yelp! Too bad, because Hartford area REALLY needs some dining options that stay open later than 10pm. As someone else said here, too bad because it has great potential as a restaurant."]]}