{"Sam's Gyro": [], "Gyro House": [], "Yannis Pizza Restaurant": [], "Tangiers International": [], "Pine Loft Pizzeria & Cafe": [], "Tapas": [["Jeff L.", "Greek Salad. Enormous and the most unbelievable dressing!"], ["Danielle M.", "This little gem is one of the best kept secrets in the area.  If it were located in West Hartford Center or Bishops Corner, there would be a line out the door.  Since it's located a little bit off the beaten path (about 5-10 minutes outside of West Hartford) you can walk right in without a reservation.My favorite time to go is on Sundays for brunch.  The brunch menu is delicious and the live jazz provides fantastic ambiance."], ["Ethan B.", "Food is always pretty decent -- especially their special greek dressing -- food I would rate at around 3 or so.  This review is focusing in particular on the online ordering experience.In short -- DON'T WASTE YOUR TIME!Twice, I've ordered something through the website for pickup, only to find out they never got the order.  As it turns out, online orders generate an email, which is printed on a printer in the back, no where near the front station where orders need to be entered.  The orders don't automatically enter their system, so it's on the people at the desk to monitor the printer, which I can tell you from experience, they don't.  My intent on a short lunch is to save time and have my food ready -- pretty much defeats the purpose if I have to reiterate the order and wait 25 minutes when I get there!  Even worse this past time, the printer was malfunctioning and you couldn't even read my order easily.  Not a big deal for a small order, but if I had been picking up an order for the office, it would have been a disaster.Another point of concern regarding the ordering is that payment is not handled automatically either.  If you were foolish enough to enter in payment details on the site, expecting this to be handled automatically -- jokes on you! They get printed in plain text on the email -- in an area where anyone could just swipe the paper.  NO SECURITY WHATSOEVER!Moral is avoid the useless online ordering system and call it in..."], ["Max Z.", "Great boneless chicken wings and great carrot cake"], ["Erin C.", "I wouldn't return if I was paying for it.  I'm not really a fan of Greek food, so I was fooled by the name Tapas as I expected it to be Spanish.  Silly me LOL!!!"], ["Mike B.", "Got the steak muffaletta, very good! Menu is nice, lots of variety. However, the waitress seemed aggravated when we asked her to split the check. There were 5 of us, don't you think she would have done it anyway?"], ["Mike C.", "If your in the mood for 100% authentic greek cuisine, tapas is probably not your number one destination...however if your in the mood for awesome, fresh greek inspired food, give tapas a try. When ever i step into the location on cottage grove, i always am greeted by wonderful staff who show off genuine manners and stunning personality. The food may be a bit americanized, but who cares when it's so delicious. From their gyro to baklava, tapas delivers taste at a very reasonable price. Not to mention that their house made tatziki can be eaten with a spoon, it's just that good. I go here often for a quick lunch or dinner because i won't be disappointed..."], ["Teddy W.", "The service behind the bar is terrible, this is not a tapas Spanish Restaraunt, don't know why it's named that. Inconsistent food and a less than welcoming attitude. The service is worse than bad, it's terrible."], ["Thomas I.", "The menu was very limited for my taste.  Fortunately, they had a sea bass special that I found very good.  The fish was cooked to perfection and perfectly seasoned.  The problem I had with the place was that the risotto was bad and the meal was pretty pricy.  My friend raved about the place and I noticed why, I just probably have different tastes in food and how much I like to spend than him."], ["Mercedes R.", "Yummy!!!!   I was in town visiting the parents, and they took me to this place for lunch.  They have a nice wine selection, and all of the menu looks good.  I ordered the Baby Moon & Mushroom Tapas, and was sufficiently filled.  I'd definitely go back again when I'm next in town. Now if only I was able to get my dad to correctly pronounce \"gyro\"..."], ["Lisa J.", "We are vegetarians and LOVE the food!!!!  The mediteranean platter is the absolute best!  So much variety, hummus, tabouleh, feta, mouseka, bulgar, grape leaves.  I don't know how to spell these delicious foods, but trust me....so worth a visit to the Bloomfield location.  The West Hartford location is just too small and tight for me, but Bloomfield seems much roomier.  Oh and grab some mints for afterwards, they aren't shy with the garlic in the hummus.  Soooo good!!!"], ["Zoe L.", "THIS IS NOT A SPANISH RESTAURANT.  when i first heard of this place, i expected spanish tapas.  then we arrived and i saw \"mediterranean cafe\" on the side outside, which made me very confused.  basically, it's neither specifically spanish nor mediterranean food, but it tastes good!  there are some gyro, kebab, and souvlaki entrees, but there's also a section of the menu called \"tapas\", which i'm still not sure how to describe.  one person in our party ordered a cajun chicken tapas, which came out looking like a small pizza (no cheese), with broccoli + chicken on a puffy round flat bread (which was called a tortilla in the menu, but was not like the typical pancake flat tortillas i've had).  every day features a couple of \"blue plate specials\", and i ordered today's mac + cheese, which had cheddar + parm + gruyere topped w/buttered bread crumbs.  i was happy.  my other friend ordered the cajun chicken quesadilla, and he seemed quite happy with that.  so even though i'm still not sure how to classify this restaurant, i'll definitely come back!"], ["Erica P.", "This is one of my favorite lunch places in the greater Hartford area.  The specials, which change daily, are plentiful and delicious, and their signature \"Almost Famous\" salad dressing is wonderful.  Also, try the vegetarian chili.  Service and atmosphere are great too."]], "Bombay Olive": [], "Trinity Restaurant": [["Leigh M.", "I loved this small, family owned restaurant! You could tell it was a family operation, as the server mentioned something about her grandmother doing the cooking and also roaming around cleaning things up. I had a vodka sauce with chicken and it was extremely comforting and perfectly made. My partner had the lamb and it was fork-tender. The physical space is lovely inside but a bit difficult to find. It is in what appears to be a residential area. Trust your GPS and you'll be OK!"], ["Jena G.", "Trin Restaurant is consistently good. I've been coming here for four years now and have actually never, ever been disappointed. They're really making a name for themselves too- the New York Times recently blessed them with a raving review...a nice nod for a neighborhood eatery. The most charming and redeeming quality about Trin Rest is the fact that it's family run and owned. They'll always make you feel welcome and at home.Trinity Restaurant is also a small establishment. It can't hold more than 100 people at a time and if you come on the weekend without a reservation, you gotta be willing to wait. Once you are seated, however, prepare to be wowed. Their bread knots are warmed to perfection and soft enough to make your cashmere sweater jealous. A few stars on the menu are:-Butternut Squash Ravioli-Artichokes with Goat Cheese-Spaghetti Pesto-Pizza MargheritaI wish I could love Trinity Restaurant's calamari. I really do. But sadly, it has never impressed me. In fact, it's the reason I'm knocking off a star. It seriously is the ONLY lackluster item on the menu. It's chewy and bland...kind of tastes like it's been frozen. So unfortunate, but you guys know how I feel about my calamari.All in all, however, Trinity Restaurant is a super solid, scrumptious, satisfying place to take your friends, family, or bae. A double thumbs up!"], ["Tim M.", "This was one of the strangest restaurants that I have been to in Hartford. Although there was technically free parking across the street, the parking spaces were tiny meaning your car was halfway into the road (didn't seem safe but car was fine).  I drove by the restaurant twice (it was easy to miss) and the surrounding neighborhood wasn't great. Inside, it was filled with Trinity college students enjoying the BYOB (even though they had a wine menu). The college students were going all out- beer, wine, hard liquor, mixers,etc. At least the corkage fee was cheap ($3)Even though it claims to be Italian, Greek and Mediterranean, the menu was 100% Italian. which was dissapointing. The calamari were just OK, nothing special. The bread was very good. I have to admit that the butternut squash ravioli was REALLY good, however I never seen SO MUCH brown butter sauce on a dish.  I didn't end up ordering much else since I had expected a much more diverse menu."], ["Kelly T.", "Great food, horrible service.  Waitress seemed scattered, kept forgetting us.  Waited on people who came in a good 5 minutes after us before acknowledging us (a party of 6 is kind of hard to miss).  Not sure we would go back."], ["Mari K.", "I had found this place in my search for local BYOBs and decided to give it a try. It's located right next to Trinity, but we had a little trouble finding it as there's no sign that I could see with the name of the restaurant. There is some street parking right out front. As we approached the establishment we were greeting by a friendly man, and we were seated quickly once inside.  We visited on a Monday night and it was very quiet; I think there was only one other group there during the entire duration of our meal. However, the space is pretty nice (I added a few pictures of the interior), and has room for a good number of people to sit  comfortably. The server, who I believe may have been one of the owners, was really sweet. It seemed she was the only one there so it wasn't super fast service, but we were not in a hurry and the family feel was nice.  If there had been more patrons, they definitely would have needed more help to keep things moving quickly enough, and I'm assuming they bring in more help during busier times of the year. We had brought our own wine since Trinity Restaurant's Facebook and Yelp pages say that they are a BYOB, but I noticed they did have a pretty good wine list. I asked the waitress, and she said they do both (my favorite answer). She brought us two wine glasses. I order the arugula and spinach salad (it had another name that's escaping me). It had a huge piling of fresh greens with a very tasty dressing and four thin slices of cheese (see picture). I always enjoy fresh greens, especially the slightly spicy kick of arugula, so I was pleased. We did have a smidge of bad luck with entrees, initially ordering 2 that were not available at the time (the scallops dish, which looked great in the picture on the wall, and the osso buco, which sounded amazing). She clearly felt bad and apologized for not having them, and explained that the osso buco is always available in the fall, but in the off-season (I'm assuming it's off-season because college is out, and Trinity students and families likely make up a good portion of their clientele), they can't make huge batches of it, as it takes a long time to make, and they would end up with large quantities being wasted. She said that regulars will call ahead of time to order the osso buco, which I thought was a great tip. I totally understand the reasoning and agree that this should be more of a seasonal item (but I do think it would be helpful for them to indicate this on the menu).I ended up ordering the garlic shrimp linguine (it may have been called something slightly different) and my date ordered the seafood paella. The paella was fantastic (it does come with a lot of peas, just fyi); the seafood was cooked just right and the broth was really good. The shrimp linguine was good as well. My favorite part of the whole experience, though, was unexpected. We had already paid and were ready to leave when the waitress brought out a creme brûlée for us to share, on the house.  We had told her it was our first visit, and I think she wanted to make a good first impression. It worked! I would not have ordered the creme brûlée (I was really full from all of the salad and pasta!), but I am so glad I had the chance to try it. It was fantastic! The custard was rich and creamy, the perfect texture and sweetness with a hint of vanilla. The top was torched just right- it shattered like thin glass under the spoon and had a delicious, sweet caramelized taste. After thinking about it, it makes sense that a place called Trinity Restaurant, situated next to Trinity College, would have a great Creme Brûlée... since it's rumored that the first creme brûlée originated at a Trinity College in Cambridge, England!No matter the reason, the food and overall experience were good, but I would go back there just for the creme brûlée."], ["Rabbi L.", "OMG, I love this place so much. I live 2 hours away but make sure to come here when I pass through Hartford.The atmosphere is simple but elegant, European style, very clean, welcoming. The servers are always nice and attentive. They are around when you want them, but they make you feel comfortable to  linger over your meal and conversation. That's another lovely Mediterranean cultural touch. The Albanian owner is warm, hospitable, and soulful.Ok, let's start with the coffee. Perfect.Today's appetizer: baked marinated artichoke hearts with goat cheese. Maybe a little touch of kashkaval or cheddar as well. OMG, hot, delicious, perfectly balanced vegetable-ness with cheese-ness. Good amount for two.Today's shared pasta: spinach manicotti. Wonderful fresh marinara sauce, lots of tender spinach, homemade fluffy ricotta, seasoned with black pepper and something aromatic. Tender flavorful pasta.Today's shared salad: mustard salmon salad. Generous piece of salmon perfectly charred on the edge. OMG! Lovely assortment of roasted vegetables as well as tasty tomatoes, purple olives, cucumbers. Hard boiled egg was more food than I could handle, eating this with all the other offerings. The salad was perfectly dressed with a freshly made lemon vinaigrette.Guess I forgot to mention the bread knots. Chewy, fresh, just so homey, served with herbed olive oil. But don't get distracted by this.Two hungry people left completely satisfied for $41 including two coffees.I love this place. When I finally do get to come here, I worry that I have built it up in my mind. But then the food comes and I am delirious with pleasure."], ["Shawn L.", "This is one other Hartford gem. People should FLOCK here!! Amazing food. Good service. Good prices.  It's a tucked away place on Zion behind the rocks, and should be PACKED every night. Q"], ["Sally M.", "Our family of four visiting Hartford from Northern California enjoyed such a lovely meal at Trinity Restaurant.  Sweet neighborhood spot, warm and friendly service and delicious food. The mussels in garlicky tomato sauce, fresh caprese salad and cannoli were our favorites."], ["Barbara W.", "Trinity Restaurant is really a hidden treasure! I have been two times recently with my boyfriend who has a friend that highly recommended it. It's tucked away neatly on Zion street, across from Trinity College. While the outside is modest with a small outdoor seating area, the inside is quaint and clean with a warm friendly staff. The food is incredible from the appetizers to the desserts! You will not be disappointed! PS - you can BYOB (wine or beer)!"], ["Robert B.", "As a former regular at Timothy's restaurant, I was happy to see that the space was occupied by a new restaurant, and after hearing a couple good things from other food lovers, my wife and I made the trip to what is admittedly NOT Hartford's nicest neighborhood with high hopes for a great dinner. Sorry, Trinity restaurant- I had every intention of loving you but I just couldn't do it.  First of all, our server must have NEVER worked in a restaurant before. She served our appetizers and entrees simultaneously, and brought our check without even asking if we wanted dessert or coffee.  Parts of each entree that were advertised on the menu were conspicuously missing, and brought over on separate plates as an afterthought when we pointed out their absence. My bolognese was ok, my wife's swordfish a little better, but still thin and slightly too well done.  We did like the Tuscan bean soup. Our 9 year old had a cheese pizza which I thought was on the quality level of a frozen box pizza.  The space is nice, and maybe this was just a bad night, but I left missing Timothy's even more than I did before. It takes something better than average to lure us into this part of the city, and \"better than average\" wasn't happening at Trinity that night."], ["Diana L.", "$17.01 including tax for 1 dinner entree, butternut squash ravioli.What I got:- 7 ravioli, one without filling, covered in so much oil it was seeping through the paper bag within the 5 minutes it took me to drive home, 5 mini rolls, slice of lemon.For that price you better believe I ate the lemon too.Honestly at a whopping 17$ I would have expected to have enough food to have leftovers for the next day, but no.I would skip unless I were being treated."], ["Henry C.", "This restaurant has the worst customer service I have ever experienced. We came as a group as 18, and they couldn't give us separate checks so they charged us EACH about $28 extra. The food was terrible; I got chicken parm and there was only sauce on half of it. They do not even have a menu item that costs approximately the amount the said that we owed. Additionally, when we challenged the amount due, we were met with adamant opposition, even following adding up the value of every item and presenting a corrected bill. This has happened to multiple member of the party before this, and even credit card statements that showed how this happened and they wouldn't give us a refund. Giving a rating of one star is generous given our experience, and I'd like to petition Yelp to add a rating system that can properly illustrate that the time I've wasted here can never be given back."], ["B L M.", "This will be a definite come-back to restaurant.  They were accomodating to give an appetizer as the entree WITHOUT an extra charge (hate that!).  Had the mussels and the arugula/spinach salad.  The salad was outstanding - crispy arugula/spinach  mix with delicate sheets of parmesano cheese and ribbons of fennel - delicious.  The mussels were bathed in a red sauce and the perfect combination.  Rolls were right out of the oven, flaky and tasty.  My DH had the chicken parm which was gone before I could ask how he liked it = good and gone!  Will come back to try other dishes, but will certainly have that salad!   An unexpected ending - as we were ready to pay up and leave, we were treated to a decadent chocolate dessert - compliments of the house.   Send your guests home happy, for sure."], ["Nicholas I.", "I went to school at Trinity College nearby and I loved this little restaurant then and I love it now. Every time I come back to the school I make sure to visit this place and get the spicy chicken Gorgonzola. Amazing."], ["Ryan B.", "Just when I was just starting to think I had discovered all there is to find in this section of Hartford, I was pleasantly surprised to end up here. This. Place. Is. Awesome. Here's the bottom line: We enjoyed our experience here so much on Friday night that I went back Saturday night and brought two additional friends. If anything, the second meal was even better. How many places are that impressionable? Now, stop reading and go get dinner!Top 5 Reasons to Go Here1) The staff are so friendly and work hard to make sure everything is perfect. Honestly, the family-run atmosphere is the best part of this place.2) Food is amazing! My party and I have now tried a dozen things on the menu and each was delicious. The pacing between courses was perfect too, which is always a bonus.3) Recently remodeled after the name change, this place has the feel of a cozy home but is also spacious to fit big parties. A really unique atmosphere.4) BYOB. Enough said.5) A diamond in the rough. The neighborhood leaves a lot to be desired, but this place is the gem it needs. I appreciate it that much more for being a fun, delicious place despite the area. I'm a local and having a go-to place near by is a real treat. Obviously, most of the diners are from Trinity College, so brace yourself for some youthful banter."], ["Eliza D.", "I went here with a group of friends on a busy Saturday night. Yes, it was the night of the blizzard. However, this is no excuse for overbooking a restaurant that has two waitresses to the point where our table of 8 sat for TWO HOURS before we got WATER, and that was only after we requested it. I will never be going back to Trinity Restaurant."], ["c l.", "Have returned many times since first review.  Lots of upgrades to the atmosphere, which wasn't so bad to start with.  Recently went on a summer Saturday night with party of 10 or so and they knocked it out of the park.  Everyone loved the food and the charm of the family run establishment."], ["Alex B.", "I love this place.  My recommendation: the arugula salad with grilled chicken."], ["Raymond L.", "Been here twice and have already fallen for it. Great pizza with fresh authentic ingredients, super-nice owners, and awesome ambiance. I'm going to become a regular."], ["Greg M.", "For years, I had been a regular at this restaurant's predecessor, Timothy's, whenever I would be in town.  (Full disclosure: As a Trinity graduate, I have always been partial to a homey, hip, no-nonsense restaurant succeeding in this neighborhood.) Timothy's was great, but like any place, it had its faults.  I recall the bread was to die for and the dishes were generally pretty good, but most people went to Timothy's more for the vibe and the experience than for the overall menu.  Recently, I went to Trinity Restaurant after a several-year absence from Hartford, not knowing what to expect.  I was floored: This restaurant managed to preserve the \"vibe\" of the old Timothy's, while elevating the cuisine to a whole new level... I would characterize the menu as gourmet Mediterranean, but without any strong ethnic coloration, like Greek or Italian.  (I believe the owners are Albanian, which explains the reason).  There are some very solid meat and fish dishes on the menu. I sampled several; all were gourmet-quality, well-presented, and reasonably priced.  I even tried the pizza, which was excellent! The kicker: the place is BYOB, making the experience a real tour-de-force.If you can get past my minor bias of being a Trinity alum, take my advice and go for it!"]], "Rivers Edge Bistro": [["Michael G.", "Had my lunch for the first time three days ago. Was delighted with my choice, the Chicken Gyro. I will be back on a weekend for their breakfast!"], ["Bruce E.", "Try the Sunday brunch to sample all the wonderful flavors of Mediterranean food expertly prepared. The couple running this restaurant are delights and add to an already great dining experience."], ["Jim B.", "This was our first  Time at this restaurant. The lamb mousaka was incredible and served in a large portion.  Everything we had was delicious including the falafel, hummus and pita bread, as well as the baklava for desert.  Service was prompt, attentive and very friendly.  Will definitely make this a regular dining spot in the future."], ["Evan C.", "Amazing food, excellent service. One of my favorite restaurants in the area and some of the best Mediterranean in the Hartford area. The chicken shawarma is incredible and my favorite on the menu but everything is good. The couple that owns it is also very sweet and welcoming."], ["Becky K.", "First time diners. We had a Greek salad to start that was very good with unique spices and delicious feta. Lamb Hummus was good but a little bland for my husband. I had a chicken entree that we both thought was excellent. Both entrees served with nice pita bread. All dishes seemed very authentic and the server was super friendly. BYOB!  We'll go back and try their Sunday brunch."], ["Tony S.", "I decided after 2 years I would give this another try but was equally disappointed. We ordered 1 lamb gyro and 1 chicken gyro. The were quite bland and the lamb had pickles in which I was not expecting or not listed in the menu. I was very hopeful but with other choices nearby that are not as expensive ( $9.95), and better quality, I am afraid I won't be back soon."], ["Kym B.", "Went to rive s edge for first time tonight. Food was amazing, so fresh and wonderful . Went with another couple we all had what we agreed was the best meal out ever. Service amazing. No cork fee as its bob. Desserts were beyond amazing. It is truly union volleys hidden gem. Going back this weekend as there are so many dishes we want to try."], ["Syma M.", "We love this place and take our all out of town guests here too. Delicious and healthy food. Also very clean and Prices are quite reasonable."], ["Maggie S.", "This place is a gem! Really delicious, authentic Mediterranean cuisine. It's not a fancy upscale place but the food is great; tastes super homemade and fresh.  Very friendly staff that is extremely accommodating and eager to please. My chicken gyros was awesome. Overall a great first impression! Will go again."], ["Daniel H.", "Place is extremely authentic.  If you like gyros, lamb, etc, this is your place.  I also got talked into eating a desert - some shredded dough that had orange zest and pistachios.  I was not very excited for it but when she brought it over it was unreal. Also, the place is BYOB, which makes all the difference.  Even though the food is a little pricey (15-25$ for a plate), not having to pay for beer or wine definitely makes up for it."], ["Prince V.", "THIS PLACE IS NOT A GEM! Service is TERRIBLE! Very Very Very Expensive and they dont give enough food. I was starving after eating $22 dollars MIXED GRILL PLATTER. Food didnt even taste good. They dont replenish water. They forgot to serve water until the food came to the table. Lady Boss SHE has an attitude. She thinks she can talk to customer and make them feel as home... BUT SHE TRIES TOO HARD. She should try to make changes to receipes and make it more edible before serving back good again. Food is expensive."], ["Carrie H.", "Overpriced and small portions, yet I went back because I had a group, $18 to spend for lunch.  Checked out the website and saw only one menu with entrees and sandwiches.  But no separate menus for lunch and dinner.  Ordered two sandwiches at $9.99 each (didn't appear to come with anything, and fries were $3.99 extra).  Arrived and presented groupon to which I was told there was a special lunch menu.  I looked at the menu and most items were in the 9.99 and up range.  There were 4 sandwiches offered (vs at least 10 on the regular menu) and were 7.99 and 8.99.  I said that the sandwiches I got were in the same price range, to which the owner responded that the sandwiches were 12.99 each; they raised their prices and never bothered updating their website.  I don't like to tell the restaurant I have a coupon because I'm afraid the merchant will definitely substitute a smaller portion when they shouldn't).  Long story longer, I asked what my options were and she said to pay cash for the sandwiches ($25, I don't think so!) and use the groupon later or not take them.  I chose not to take them, and called groupon for my money back since I will not being going back there ever.  They now serve breakfast and the prices are ridiculous.  Most items were well over $10 ($13.99 from what I recall).  I can go to liberty diner or bolo bakery and get way more food, just as good if not better, and at a lower price!  Its too bad because the food is good, but not worth the outrageous amounts they charge."], ["Paul R.", "Very disappointed that they would not honor the Groupon voucher we had. We certainly would have spent a lot more than the amount of the face value of the voucher. There was only one other table occupied.  We were directed to look at their website to see that vouchers are not honored on Friday or Saturday nights.  Left without ordering and don't plan to return.  They could have had a new regular customer and others we would share our experience with.  Instead they chose this path."], ["PF L.", "Terrific spot for Mediterranean food.   Everything is fresh and homemade.  Visited for lunch.  Soups are top notch and the falafel pita and lamb shawarma were very good.  Service was personal and attentive.   They no longer serve breakfast - now a lunch and dinner menu with plenty of tables.  Very clean.  So previous reviews of the breakfast no longer apply.   They also offer delivery service.   Will be both returning and having them deliver!"], ["Marissa M.", "This place is excellent!  Fresh and delicious Mediterranean food!  Our Greek salad was so good, including the other entrées and appetizers we shared.  Try the sweet cheese and pistachio dessert.  It's also BYOB.  Grab a bottle of wine and go eat here.  A new favorite!"], ["Pete S.", "P.S. I went back.  Was very good.  Service was timely.  Food was still very good and service was friendly and uncharacteristically (as compared to most restaurants) welcoming.  The family nature of this restaurant is very evident, and favorably so."], ["Allie B.", "Falafel sandwich = mediocre, tahini sauce = tasty but not enough of it on the falafel sandwich, homemade balsamic vinagerette = delicious and that's considering the fact that I normally do not like balsamic vinegarette, salad = good and fresh. I thought the menu was a little overpriced but the staff was pleasant and friendly. I suppose I would go back and try a different menu item, maybe order a big salad since I enjoyed my little side salad so much but I would not get the falafel sandwich again unless it was drowned in tahini."], ["jess R.", "Excellent fresh food... Unique and diverse menu. Nice people and friendly service! Would definitely recommend! Also a kids menu- bonus!"], ["Flo S.", "BYOB. fair ambiance. pleasant service. the food is very, very good. best mousaka i've had. fresh and large portion. as was the house mousaki."], ["Stephen T.", "OK, in a nut shell, you order at the counter, wait to hear your number called and pick up food back at counter. No waitresses. The food is way over priced. French toast for $6.99... two large pieces, but still! Across the board, the pricing is too high for what you get. I guess you could say that you are not paying tip, but I will not be a regular because of the pricing. But over all, the food was very good. No one in our 6 person party complained that the food was not good, because it was, so if you dont mind paying a little more, you will enjoy what is offered."]], "Aladdin Halal Restaurant": [["Sam K.", "Don't let the looks of the restaurant fool you. Their food is amazing! The kabobs are perfect. The hummus is very fresh and topped off with olive oil. Their pita bread basket is filled with warm fresh pitas. The baklavas taste homemade. Their prices are extremely reasonable. Staff is friendly."], ["Namita S.", "Amazing persian food at very reasonable rate. The guy at the counter was very sweet too. Any of the combo platter are great choice because u get to try 3-4 items. Would visit again!"], ["Kerri P.", "Given the proximity to the nightclubs, I have to admit that I was not expecting anything. You really can get away with crappy, greasy food if there is a steady drunk population to consume it. The fairly stark interior of Aladdin doesn't hint that this will be anything more than another place to grab late night food for the college crowd. Aladdin is actually really decent. I've been there mainly before 10 p.m. to avoid being around annoying drunks. Each time, the food has been reliable and good. The pizza is not overloaded with sauce or cheese, and a slice is reasonably priced for its size. The falafel is not as good as that from Tangiers, but the price is right and it is decent. I think a main difference here is that Aladdin uses less tahini than Tangiers. The falafel isn't dry...just less tangy. The service has always been fast and friendly."], ["Tony C.", "I come here on my lunch break every now and then. Its not the best pizza, but its not bad either. I guess its also a good sign that 2 other pizza places were there eating too. Both cars were parked out front. 2 different pizza places (local).  They have lots to choose from but i just go with the slices cause its quick.2 slices of cheese, small bag of doritos and a bottle is water, $7."], ["Steve S.", "Absolutely fabulous food, huge portions, low prices and a friendly staff. I would go here any time."], ["Alexandra S.", "We went as a group (my cousins who get middle eastern food consistently - my brother and I (of middle eastern descent but never really learned to make it) and my boyfriend who grew up with blander food).Since we were the only ones in there and were a little disorganized in ordering - the service wasn't spectacular. My boyfriend ordered a pizza first and the others all ordered Shawarma (they raved about it) I got the veg combo - very good. but the pizza came out after we were all basically done and was burnt on one side pretty badly. Not the best. (all the meals came out separated by 3-8 minutes).Also most dangerous car crashes was on very loud. That appealed to my relatives, however.Anyway, we will come back for another taste."], ["Daniel G.", "Amazing! If you like really hot hot sauce ask the man serving you,l. Also this place is mad cheap bruh. Promise well worth it. Perfect end to a drunk'n night."], ["Spike P.", "Food is real good and fast.  Place was clean and staff were real nice.  I would definitely recommend this restaurant."], ["Travis G.", "By far the best middle eastern food in Hartford. Good food. Consistent. Cheap. Chicken kebab or chawarma always great. I was also shocked how good their pizza is. Very interesting and amusing character if you try it late night. Late night it is one the very few places in Hartford that will still serve food past midnight."], ["Mitchell R.", "A favorite, like a comfortable pair of jeans. Not fancy, just good. Behind the XL Center in an area of bars and dance clubs, and quiet during the day, this restaurant has the best Middle Eastern food in Hartford. They sell pizza, too, by the slice. I'll drive out of my way for the hummus and warm pita bread. Presented on a simple oval plate with perfect olive oil. Excellent. Their spinach pie( don't know how to spell their word) is also good. Order at the counter, sit down, relax...they'll bring you your food. Office workers and mixed crowd during the day..."], ["Katie C.", "I've been a fan of this place for years.  The pizza is good, but the Mediterranean food is what it's  all about.  The veggie platter is my favorite because it offers a great variety of items.  The babaganoush is incredible, the falafel's are crispy and delicious and the dolma with yogurt sauce is great, and these are just a few of my favorite dishes. Also the portions are generous.   It's definitely worth a visit!"], ["Michele R.", "Wanted to introduce my kids to Middle Eastern food, so we tried some take out from Aladdin Halal.  I drove in to the city and picked up some food while they were at soccer and it worked out great!  They loved the shawarma and the chicken kebabs.  Additionally, I thought the falafel and the tabbouleh were out of this world.   Looking forward to trying some other menu items. The only small problem was finding parking.  I ended up paying $5 to park in the adjacent lot after finding no street parking.  It was a small price to pay however for the great food.  Prices were pretty good - about $30 got us enough for three people for dinner, with a generous amount of leftovers."], ["Anthar D.", "I grow up in the Middle East and moved to CT three years ago. I was so pleased to find this place they have the best Shawerma in the area! Aladdin has a low key atmosphere and the guys working there are very friendly. Its  good for a quick lunch or a late night craving."], ["Peter R.", "I travel a lot for work, a the two things I always look for in a new city are a great deli and a great Halal / Mediterranean restaurant. Aladdin definitely filled my quota for great Halal food, with a few gripes.I had a Chicken Shawarma pita and a side salad. The salad wasn't anything special, as expected and advertised, consisting of romaine lettuce, tomatoes, cucumbers, red onion, olives and a \"house\" dressing. The salad dressing was advertised as a homemade Greek vinaigrette, however I would be willing to bet my next pay check that it was Kraft Zesty Italian dressing - a little disappointing for sure.The chicken Shawarma pita came next, and was absolutely spectacular. The chicken was moist, flavorful, and well cooked, and the wrap itself had the perfect amount of lettuce, red onion, tomato, garlic and tahini sauces. It was almost perfect, but I will admit that I was expecting it to be a little bigger; I guess I didn't read into the $4.99 price tag enough.Which leads me to my final minor complaint, which is that I wish they had a more flexible menu. It is very extensive, more extensive than most Halal restaurants I've visited, however the configurations are not that accommodating for solo or pair diner(s). For example, I asked if I could order a \"side\" of hummus, instead of the $4.99 appetizer portion (too much for one person staying in a hotel with no way to store leftovers) - they said they didn't offer a \"side\" size, that was the only way to get it. After my meal, since I was still a little hungry, I asked if I could order a single falafel, they said no, I could only buy the appetizer portion of 4. You get the point. In my experience, these are entirely reasonable requests, especially at a place like this. I would gladly pay $2.00 for a single falafel (vs. $4.99 for four), or $7.50 for a larger pita sandwich with more meat. It's a somewhat difficult place to eat for one, you're likely to either leave a little hungry or with a big container with leftovers - not an option for the road warriors living in hotels.All in all, a very respectable Halal spot with great food, just wish they'd reconsider their menu or be more flexible with their offerings. I will most certainly be a repeat customer."], ["Shameem A.", "my go-to place for late-night delivery; they do mess up orders for me with some regularity when it comes to small details. but usually not huge deals and it still tastes awesome. love their fries, shawarma/shawarfin sandwiches. the halal pepperoni pizza is not my favorite; i'd stick with their middle eastern stuff. i LOVE the baba ganoush and hummus here. the lamb kofta is also great. the fattoush is awesome as well."], ["Adam N.", "Terrible customer service. Ordered for delivery, was told 45 minutes. I called after 1.25 hours and was promised food would arrive \"any minute.\" 30 minutes later, I called again. The manager Yusuf was abrasive, saying they were bery busy and he had no idea when the food would arrive. He claimed not to have the phone number of his own drivers. To top it off, I was hung up on, with a parting line of \"if you don't want your food, tell the driver.\"  Just terrible. I will be letting my hotel know to make sure they no longer carry this company's menu in their delivery list."], ["Judy L.", "I was pleasantly surprised with the food offered besides pizza. We went as a group of five this afternoon. I love the Aladdin combo with lamb and two sides. Shokran!!!"], ["Katie W.", "Seriously delicious vegetarian combo. And consistently good. Hummus is creamy and tahini-y. Wicked parsley in the tabouli, like it should be. Grape leaves have great spice. And the falafel melts in your mouth. Not like Tangiers, which are dried out rocks.I love middle eastern food. And Aladdin, notwithstanding the late night pizza joint feel, has some real top notch food. My husband, despite his middle eastern ancestry, always tends to go for pizza or grinders here. And he has been disappointed. That is why they only get 4 stars. Go for the middle eastern food. Its scrumptious."], ["Incresco M.", "Wish I could give this place a 3.5. They had Very good food. The tabbouleh was the best I've ever had. Got the vegetarian platter. Loaded with flavor!The surprising flavor and quality of the food offsets the atmosphere of the place, which leaves a bit to be desired. I had the feeling when I asked the staff at the counter to add a bottle of water to my order at the last minute, that I was inconveniencing him with the request. It was subtle, but there.The restaurant itself was surprisingly beautiful for a fast food falafel / pizza place. But I did not necessarily wish to enjoy the latest episode of Dancing with the Stars along with my veggie platter, though it was pretty much unavoidable at that volume and proximatey to the televisions.All in all an overall good experience, though I think I've had my fill of reality TV for the next three years..."], ["Kevin D.", "Not a bad place to get a late night slice of pie."]], "Pizza Express": [], "Tapas Restaurant West Hartford": [["Stephanie B.", "We've been on and off regulars for years. It's a very casual atmosphere where you can watch the chefs cook. No freezer or microwave so you know it's fresh! This is a popular place for takeout too.I recommend the hummus platter or the kabobs (salmon is my favorite). And the clam chowder is the best in the area! The vegetarian chili is sooo good. If you get fries, go for the madd Greek sauce for dipping. The specials menu is always enticing but I prefer to stick to the menu.And desserts... Yes please! When they have the banana chocolate chip bread get it!"], ["Kait F.", "This place is great! They make excellent and fresh Greek food at affordable prices. They have an $11 hummus plate appetizer that I had a DREAM about the night after I ate here for the first time. That's how good it is. Their small size Greek salad is enough to feed one for dinner with leftovers, and is served with deliciously seasoned and piping hot grilled chicken on the top. But seriously, the hummus plate. Don't forget about that. It may be the most important item they serve. The decor is a little bit shabby, and kind of cramped inside, but I wouldn't even think twice about that before visiting again. But, of that bugs you, Tapas does take out!"], ["Tom N.", "Been awhile since I was here but sadly it is not as good as in the past. The inside needs a good dose of upgrading from the chairs and tables to the bathroom where you need to be a gymnast to navigate the toilet and door. The food is OK but does not standout in a town where there are much better options. Our server was good, but unfortunately the food and ambience was just average."], ["Angie N.", "After hearing wonderful things from Tiffany G. for so long, I finally stopped by this place for dinner after the gym the other night. They have rotating specials every night, and that night in particular they had salmon, swordfish, and steak- with those options, how could we not go?We arrived shortly after 8 and there were only a couple other diners there. We sat with Tiffany's favorite waitress (unfortunately I did not catch her name, but I can see why she's a favorite!) at a table in full view of the chef and his process. We had a Groupon that entitled two people to an entree each and either a glass of wine or a glass of sangria each. You can choose any entree and any glass of wine- it was a pleasant surprise that choices weren't limited to a designated house red or white. They no longer serve their white peach sangria at this location, which is too bad because I've heard it's amazing, but we got the red instead- full of fruit, nice and strong!I got their Greek salad with my entree (minus olives), and it was delicious. So fresh, and their signature salad dressing was amazing! I'm not sure what was in it, but it packed a ton of flavor. It was served on the salad but they also supplied a bottle in case you wanted to add more (and they sell it there).For my entree, I chose the Grilled Swordfish off the specialty board. Didn't even look at the menu (I tend to like getting specials since they aren't available all the time). It was served beneath picatta sauce with broccoli and rice. However, the mashed potatoes offered with another entree sounded so good that we asked if we could trade out the rice for those mashed potatoes. The chef graciously accommodated. The swordfish was grilled to perfection and the mashed potatoes were the right choice- perfect amount of garlic!Ended up getting another glass of sangria and because it was so strong, I elected to soak up some of the alcohol in my stomach with a dessert. The Chocolate Lava Cake was served with whipped cream. We asked about ice cream and were told they don't have a freezer to accommodate ice cream- proof that everything you have here is going to be fresh! The Lava Cake was pretty good, not the best I've ever had but I never say no to chocolate.Overall, I had a wonderful experience here. The Groupon is a great deal, so if available, I encourage you to pick one up. I understand it's generally pretty busy and it's a pretty small restaurant so calling ahead would generally be recommended (we got lucky the other night)!"], ["Tiffany G.", "I used to be a regular until I moved a little further away. I was disappointed to learn this location no longer carries the white peach sangria. I ordered the Everything Salmon and everything tasted great, but the salmon was a bit dry and overdone. I have never experienced this at this location before so I'll assume it was just an off night. I love the greek salad and I know it's their dressing that makes it. I will try again as I've had dozens of great meals here. I always go for the specials vs the traditional items on the menu. The hummus is phenomenal! I was shocked to see Tapa's was selling Groupons, so I bought two! I don't recall them ever doing that before.Went back on 3/10/15 and got the swordfish special which was cooked to perfection: moist and tasty. I will try to get back here more often, the waitress remembered I used to go there about every other week, I miss it. And did I mention how much I love their greek salad and \"almost famous\" dressing? And, that the sangria is strong enough that 2 glasses are all I can handle? :)What I know I haven't mentioned and must is that I asked if the lava cake came with ice cream and was told it doesn't, get this, because they \"still don't have a freezer\"! Fresh food all the time, just as it should be!"], ["Elizabeth B.", "I'll start with the bad. Service was bad. It's not that busy for a Saturday and instead of checking on their tables while waiting for the food to come out, the waitresses sat around talking with their fingers up their butts. Our waitress didn't even get our drinks right. Food here on the other hand is good if you have the time to stop by and are prepared to wait. Definitely would come here again but not all the time."], ["Anne C.", "Dear Tapas -I have loved eating at your restaurant for many years. From your gyro's to your hummus to your Greek salad covered in your \"almost famous\" salad dressing, my meals at your restaurant have always left me feeling full and happy.  So much so that I never had a problem recommending you to my friends and family when they were looking for a place to eat in the West Hartford area.  Looking for affordable and tasty food - then Tapas is the place to go!However after my last meal several weeks ago, I might have to reconsider my recommendations.  What has happened?  Have you gotten so complacent in your \"name\" that you have forgotten what made your restaurant special - it was definitely not limp iceberg lettuce drowning in salad dressing with an over cooked and dry chicken breast that was put before me.  It was certainly not the waitress whom was more attentive to the kitchen staff and her fellow co workers then she was to making sure myself, my dining companion and the several other late lunch goers were taken care of. And it was not the frigid dining area that made me wish I was eating outside even though the temperature was in the high 80s.I hope that what I experienced was a blip, that it was and off day.  I hope that  if and when I return, the restaurant that  I enjoyed in my past is not a distant memory and that I can again confidently recommend you to my friends and family."], ["Kristen B.", "Horrible take out. Forgot the pita for our Mediterranean platter. When I called about the omission the woman who answered the phone was very rude. Refused to even credit my credit card back the cost of a side of pita. I asked to talk to a manager and was told one wasn't available until the next day. Food is only ok and service being so bad, go else where!"], ["Jennifer H.", "I would love to review the rice pudding, but I did not receive it, so I am unable to do so.  They messed up our dessert order, but wouldn't bring the correct dessert without charging for two. We also never got a salad that we ordered. The food (mufaletta) we did get was delicious! The service was subpar. It was not super busy and it took over 15 minutes to get a drink order taken. Then instead of checking on tables, they stood around talking. The food gave it the 3 stars - the service would get one."], ["Anna E.", "Others have said it and i concur...the service is pretty awful.  I've been here a few times for takeout my most recent visit this afternoon.  I came in at a non-busy time and a waitress was taking the order of the only other patron in the entire place.  She looked right at me, finished taking the guys order, and then turned around and stepped away without a simple \"I'll be right with you\" or \"Can I help you with something?\"   I figured she was busy so I browsed the menu for a few minutes.  There were about three waitresses and three cooks all standing around.  Not a single person acknowledged me so I walked up to the group of waitresses...and waited....and did the whole, \"I'm going to count to (arbitrary number) ... and if by then no one says anything I will leave.\"  But I was already there, and I wanted a salad.  Finally, frustrated, I just interrupted one of the meaningless conversations that seemed to be more important than serving a customer, and asked if I could just place an order.  The waitress who finally helped me was nice enough.I ordered the Greek salad with a few strips of beef gyro.  I found the self-proclaimed \"almost award winning\" salad dressing to be too oily (granted, it is an oil-based dressing infused with herbs, but I've had oil based dressing where it was much better balanced in terms of ingredients).  The salad greens were bottom of the barrel iceberg.  Romaine or an arugula blend would have been better and certainly  more nutritious.  Other components of the salad included diced tomatoes, exactly two banana peppers, three olives, and feta cheese.  It was ok but I don't think I'd get it again.  The Tapas in Bloomfield is better."], ["Sophie S.", "Really good salads, pretty good entrees, and horrible seating policy. The restaurant should take names of waiting parties. Not doing so puts guests in a very uncomfortable position"], ["Steven T.", "Yes, I am a loyal fan.  I was there this past Friday evening again with friends.  The three of us had the classic Greek salads with the Tapas dressing.  This time around I started with the crab bisque.  It stands out because it was real crab meat and the soup was thick with it.  I want this again.  The flavors are always fresh, amazing and delicious. Pros: -Great food and a good variety of items to choose from.  The menu can be found online.-The service is great and friendly. -This is a good place to meet up with friends or for a date. -Prices are reasonable.  Its moderate to high.Cons: -Parking can be problematic because its a popular little spot.  I'm not a hater, I'm an eater!!!"], ["Tuong Vi P.", "I met up a friend from high school after over 8 years of not seeing each other here for lunch a few weeks ago. Coincidentally, my mom was co-owner of the hair salon that was next door years ago (she left in mid-2000s, so anything that has been there since has nothing to do with our family) and I always knew about Tapas, but had never eaten there. After having sampled the steak kebob platter, I regret having let all those years pass without eating here.Our server was really nice and seated me/got me water as soon as I arrived (about 10 minute before said friend). When my friend got there, we ended up chatting it up and our server patiently waited for us to make up our minds. My bud highly recommended the kebob platter, which completely foiled my plan to eat healthy... But it was absolutely worth it!The steak was perfectly cooked (about medium to medium well, which is exactly how I like mine) and the rice pilaf was light in both texture and flavor and perfectly complemented the meat. The tomato-onion relish and tzatziki sauce enhanced everything on my plate and cleaned up my plate with the soft pita. I ate every last grain of rice. Delicious food that leaves you feeling like you really nourished your body well.Don't let the average 3.5 star rating deter you from trying this gem."], ["Jason D.", "Modern greek diner spin. 70's and 80's pop rock playing and many choices of red and white wines. Had the lamb patties in a Pita it was great. Rich flavor, fresh meat and delicious greek salad. Tzaziki was one of the best I've had."], ["Marleena C.", "I am loving this place!!! INDEED! I usually get take out and there are never any mistakes and the food portions are fabulous! I espcially love their Greek salad and vegetarian chili and of course the chicken souvlaki with rice pilaf..but my absolute favorite thing here is the Mama's and the Tappa's wich is pita bread topped with baked apples, marscapone cheese, cheddar cheese and glory. DECADENT!"], ["Joe B.", "Must try! Tapas is a hidden mediterranian gem in West Hartford.  If you're looking for a good, healty lundh or dinner, this can be a quick meal, or something you can enjoy with family and friends.  Perfect portions and you leave feeling great.  This quaint place could be a little bigger, but it just adds to the experience.  The staff is very frienly and wont hesitate to reccomend something great.  Try the Souvlaki! or even the cajun chicken poket, you wont be dissapointed!  Will be here again soon"], ["Chuck D.", "We've been eating here for somewhere near 20 years. I remember the days of fighting for one of ten or so tables to get some of Ted Vetter's finest. Through the years it has grown and the menu has varied slightly but the premise is still the same; good food in a good atmosphere for a reasonable price. One of my favorite places to be is at a table for two with my wife."], ["Allison H.", "West Hartford is a town blessed with restaurants featuring nearly every cuisine in the world, and out of them all, Tapas is my favorite. I am addicted to their Greek salad, particularly their \"almost famous\" dressing (which they sell). It's worth coming here for a salad alone, which is high praise for any restaurant. On the menu you'll find flat bread pizzas and platters (including gyros, souvlaki, falafel, spanakopita, muffaletta, and other Greek classics). Their flatbread \"pizzas\" are loaded with tantalizing toppings; my favorite is the Basque tapas (sausage, mushrooms, ricotta, brie, and sundried tomatoes). Their pita bread gyros are also excellent and you can choose either their Madd Greek or Tzatziki sauce. I much prefer the tzatziki over the Madd Greek, which really doesn't seem Greek at all. There's such a friendly, cozy, and welcoming atmosphere here. You will immediately feel \"at home.\" Not to mention, the very reasonable prices have made me visit Tapas multiple times!"], ["Westie W.", "On our last visit 3 years ago my wife and I were disappointed by the Greek sampler plate so we did not feel compelled to return until recently when a Groupon was offered. Ours was nearing the expiration date so we arrived on a Wednesday at around 6:30PM. Parking is very limited and signs in nearby parking lots warn that parking is restricted to their customers. After waiting for awhile, we finally secured a spot. We seated ourselves in the narrow section of the restaurant to the right of the main dining room. The noise level was painfully loud as it seemed everyone was competing to be heard. Adding to our discomfort was the air conditioning which seemed to be blowing on our table. The online menu does not warn that the sampler plate is offered only on Monday & Tuesdays (see my prior review), but undeterred we effectively created our own sampler plate by sharing each others entrees. I chose the lamb kabob platter which included a single skewer of lamb, rice pilaf, pita, tomato onion relish, a Greek salad and tzatzki sauce. My wife chose the spanikopita plate which included a copious amount of rice pilaf while adding a Greek salad for an additional $2.99. Once again the Greek salad was tasty, but the inclusion of iceberg lettuce proved to be a turnoff. Given the price points, we both felt the portion size of the lamb and spanikopita were small and neither scaled any culinary heights. On the plus side, each of the 2 servers in our section were in process of training new personnel so we enjoyed very good service throughout. It likely will be another 3 years before we will return."], ["Dave B.", "As a kid/teen I hated salad.  My mom was unsuccessful at forcing me to eat any at all, but then I ended up at Tapas one weekend and their greek salad won me over.  The menu is fresh and changes every day.  Each time I have been here I have enjoyed it more.  If you find yourself in Hartford, eat here!"], ["Wilfer Z.", "8/29/14- I recently ordered and ate at both Tapas restaurant's...I have to say, I will not be going to either restaurant ever again. The Tapa's at the Bloomfield location has a nice atmosphere but we waited 15 minutes before we were approached. We were served by a clueless server who over charged us on a special request for a kids meal (close to $14.00). We decided to try the one at New Britain Ave and this location was not better. The food was mediocre at best, very small portions (I ordered the beef kabob- they give you one kabob and the neat was tough, rice was hard and tasteless) priced at $15.00. You are eating lunch portions at dinner prices."], ["Amie C.", "Parking here can be hard. They do have a small lot. That aside the food was pretty good.We started with the side greek salad. It was good but I prefer nice chunks of feta over crumbles on my greek salad. Next we had the half Mediterranean salad platter. The presentation was not pretty, everything was mushed together on one plate and it was hard to tell what the different items were. They were good. We shared an entree. The gyro pizza is a unique and delicious entree. Plus big enough to share."], ["Joe W.", "This was my second try at Tapas West Hartford. It will be my last. Voted in Advocate's \"Best of Hartford Edition Readers Poll\", the best Greek and Mediterranean from 2009-2013. Thats 5 years! What tasteless clowns are voting in this \"Advocate\"?  l ordered pickup by phone 2 nights ago. I arrive and Im waiting to claim my food basically in the kitchen. I mean I was standing where the waitress takes away hot plates. I asked strangely, \"is this where I pick up food?\" Yup Hun. Whats your name?  My food was bagged and ready for the 3 min drive home (15 min walk). I drove. I know as a NYer, I can sometimes expect a lot. However, when each gyro, both with 2 sauces on the side are plated, everything is perfect, except theyre bone dry, sauces nowhere to be found, way on the side, back at the dump of a restaurant. Ummm does that deco say anything mediterranean?  Not to me. Feels like a cramped miniature cafeteriaI call hoping that being 3 blocks away the restaurant will correct their error and have someone run sauces by. Nope. No deliveries so no one a available to come. I was not getting back in the car. They werent coming. The girl made one last crap gesture to be accountable by telling me how to make the \"mad greek\" special sauce using ketchup. I ate it dry. Plus the falafel sucks. $30 dollars later I felt violated. Stay away if you want authentic quality mediterranean."], ["Lenny O.", "I was pleasantly surprised by the portion, the quality and the price.  No high end wines here but some drinkable wine for a reasonable price.  If you're looking for a casual dinner for a reasonable price give it a try."], ["Bill M.", "The chicken kebob's are juicy and full of flavor. It's not often you get a bill for 26.00 for 3 people in a full service restraunt.  I've been back 3 times and will revisit soon."], ["Meagan P.", "I NEVER write reviews but felt this was absolutely necessary. I have been here twice before and each time the food was fantastic and the service...excellent! Today I came with a family member and the waitress, was terribly rude. She hardly said a word to us... When we would ask for things she did not respond and had an annoyed/angry face on the entire time. I also observed her behave this way with other customers. Perhaps a wise choice would be to seriously re-evaluate the true value this employee brings to your establishment. I hope that I never have her as a waitress... It's too bad because I really love this place."], ["Computer J.", "Went a few days ago for dinner.Let me start by saying it's Greek \"Tapas\"Layout:  Incredibly odd.  Two separate doors to enter either side of the restaurant. If you want to use the bathroom you have to enter through the section on your right.  The signage and vibe wasn't awful.  Details were certainly lacking.  The Specials board wasn't very legible, and the empty fridge unit with bottles of red wine looked lazy.  Turn it on and fill it with desserts, at least.Service :  For a \"Wait to be Seated\", it was sit wherever.  Waitress was nice, but not overly attentive.  3/5 on that.  Not helpful but not offensive.Menu:  Bleh.  It seemed confused.  Main dishes were certainly Greek, tapa-portions had odd things like American soups, nachos, cheese fries. They offered kebabs, pizzas, and burgers as well.  Food:  Tasted entirely store-bought and half-assed.  The Sherry New England Clam Chowder was what you'd get if you opened a can of progresso.  Watery, little substance.  The Nachos were also pitiful.  Store-quality chips with cold, unmelted cheese underneath the chips, with a sprinkling of Feta and some other random Greek touches.  A really underwhelming and again, half-assed, plate of Nachos.   Finished with Lamb Kabobs.  Incredibly dry, for being marinated in their \"Almost Famous\" sauce.  Definitely needed the tzatziki sauce. The rice pilaf... I've had better taste from instant mixes.   Pitas and salad were absolutely nothing special.There's a lot of decent Tapas places to go, and this place really needs to raise it's standards to the rest of West Hartford restaurants.  Greek food is not incredibly complex, so it should be easy to please patrons but everything was just soulless."], ["Jessica B.", "beer and wine. delicious Mediterranean food. unrivaled greek salad. decent service.  the specials looked amazing. the space was comfortable but not over the top. as far as i'm concerned if you've a hankering for some solid greek food, this is the place."], ["Liz B.", "Tapas is a solid place to go if you're in the mood for Mediterranean cuisine.  (Side note: Will people please stop complaining \"How can a restaurant called 'Tapas' not serve tapas? How dare they!\"  The place is named after a Mediterranean pizza-style dish, which at this place, are really all quite delicious.  But no, it doesn't serve traditional Spanish small plates.  Get over it.)The restaurant itself is a bit dated and shabby, but the food is delicious.  As many have noted, the place is known for its Greek salad.  The dressing is amazing, and they certainly don't skimp on the feta.  Also, its namesake tapas are pretty good.  I prefer the thinner 7\" flatbreads, as they tend to get crispier, though I think it's just a matter of taste.I have to say, though, my favorites are the appetizer samplers.  The hummus is some of the best I've had - fresh, creamy, tangy.  I highly recommend the hummus platter, which comes with the delicious hummus, slabs of salty feta, freshly rolled doma, capers, tomatoes, etc.  Another favorite is the Mediterranean salad appetizer, which is also wonderful for those who don't eat meat - especially the bulgar-based dish and the vegetarian moussaka (unlike the heavy Greek dish, this one is delightfully fresh with chickpeas, eggplant, tomato, and fruity olive oil).  The best part about these dishes is they come with wedges of light-as-air, fluffy, warm pita bread, perfect for sopping up every last bite of your meal.  Other hits are the soups - the sherried clam chowder is a unique, rich take on the New England classic, and you'd never miss the meat in the vegetarian chili.Raves aside, I have tasted some misses on the menu.  The lamb is dry, and I've had better falafel.  The gyro is decent, but in my opinion can be overwhelmed by the sauce.  (Though, like the tapas, that's just a matter of preference.)  The rice that comes with platters is pretty average, though the kebabs - particularly the chicken, which can often be overcooked and dry - are seasoned nicely.That said, this place offers unique, flavorful dishes that no other restaurant in the Hartford area can rival.  I highly recommend it.P.S.  Do NOT miss out on the carrot cake if they have it - YUM!"], ["Emily Lane K.", "Parking was good, it the restaurant layout was a bit odd. It is small and has windows inside leading to an attached deck. The service was prompt and alright. The prices are higher than I would have liked, it was about 40 bucks for 2 entrées, and we decided to just drink water because of that. I am a vegan and had a veggie chili burrito sans the cheddar cheese (they didn't knock down the price for skipping the cheese). It wasn't what I was expecting, the description said it had beer cooked beans and fresh veggies, but it tasted like canned veggie chili, very salty, very mushy, and there was not fresh anything. I was shocked and surprised to find a meat substitute (which was not in the description), and I for a few minutes thought I had received beef chunks. The waitress was unsure what it was exactly, some kind of tofu, not a reassuring as I would have liked.  My boyfriend had the chicken Muffuletta. He has lower standards than I, and is way less picky. He had a really great looking Greek salad. However the Muffuletta was didn't have any sauce, and was a bit bland and dry for him. We may or may not return, most likely not, there are many better restaurants in the area."], ["Emily J.", "I LOVE Tapas in Bloomfield, but I won't be back to the West Hartford location. Service was poor, the food came out wrong (request for no cheese due to a lactose allergy in my party was not fulfilled, and the server was rude when we called attention to it), and staff just behaved unprofessionally. The two servers (they switched in the middle if the meal) were unfriendly, seemed as though we were putting them out by expecting them to do their jobs, and took frequent smoking breaks. They also engaged in loud banter with the employees in the kitchen about sexual exploits and drug use, practically shouting while standing in the same dining room we were seated in. Never again, there are too many good restaurants in the area."], ["Veronica M.", "Nice ambience and service. The restaurant seems older but it's taken care of. Seems like it would be good for lunch or dinner. It's not a huge place, so I'd think twice about bringing in a group of more than 4 or so. The food was prepared quickly, and it was average Mediterranean, but it hit the spot as I was craving this type of food. I'd come back and try it again."], ["Maki S.", "Wow K.C. is exaggerating. I'd consider checking out other (better) reviews for a more accurate description of this place. Anyway, It's my fault for expecting a place called Tapas to feature tapas foods. This is Greek though, and was a wonderful replacement for my poorly calculated expectations. The dolmas are great, so was the falafel. We ordered lamb and beef Gyros. The sauce was \"yogurty\", as described by the waitress and delicious. The meat was slightly dry but the seasoning was perfection, and the veggies were fresh. Definitely check this place out for good Greek food.Again, definitely NOT a tapas restaurant, haha."], ["Ed M.", "There is almost nothing worse then remembering the rest.  You had dinner ya then by the grease smell on your clothes !!! It smelled from the parking lot, having spent years in kitchens I knew it was a poorly installed hood or change your fry oil, it was smoking. And why put cold ricotta on a \" tapas\" !!! Waitress was awesome!!!! Too many rest. For a second chance on rookie mistakes .."], ["Tricia Z.", "Best Gyro ever. That said, do not bother with the plate. I got my order to go and was so excited to see waffle fries except they were soggy. I'm not a fan of greek salad so cannot comment on that either. The inside of this place was unimpressive and really cramped, they could absolutely use a better location (parking is awful as well). Regardless it was the best Gyro I ever had and would get it again and again. We also noticed the excellent wine list on our visit in. For take out, (call ahead) this place is AWESOME."], ["Tapas N.", "I am so disappointed with the dinner experience I just had. I considered Tapas one of my favorite restaurants for years, and I do not think I will ever go back. To start with, we did not have a waitress welcome us for 10 minutes. We waited forever to receive our salads. Our appetizer sat waiting for the waitress to deliver for over 5 minutes while a useless hostess stood with her arms crossed looking at us!!! When I mentioned this to the waitress and suggested she train her hostess to run food if she sees it and she is not busy she explained that it was too complicated for her to do because she may deliver the wrong food to the wrong table???!!!! Really??? How hard can this be!!???? I then told her that I was disappointed in our service and that Tapas was always one of my favorite choices . I asked if it was under new management and she told me no, she was the GM and it was her family business. She then left us with dirty plates and empty drinks, brought our food which was incorrect!!!!!!! (My son ordered ravioli with just sauce and this is not what he go) Then, proceeded to never return!! She sent her coworkers over. We sat for a while for the check, and I was hopeful she would have comped something, or offered a free dessert (even just to my son) Nothing!!!!!! She was the most passive aggressive person!!! I do not understand how she can be a manager in the hospitality business with such a chip on her shoulder!!!!!!Soooo bummed!! I have a big mouth and recommended Tapas to friends often. I will be sure to steer people away!!!!Sadly we do not have many choices by where we live and this was a regular. It si now off our list!!Do Not Go!!!!!!!!!The place looked filthy as well!!!! UGH!!!!"], ["c l.", "Three stars was too high.  Returned the other night and, again, had poor service and food was okay at best.  Place is kind of grungy, too."], ["dorothy r.", "We've had some pretty good meals over the years here, and it's always on our radar for when we want something close to home and that won't break the bank.  Not every dish is a winner though.  I generally do vegetarian, but I just don't care for their vegetarian chili.  It has an odd aftertaste.  The falafel is usually OK, but last week I found it rather dry.  It needed a bit more sauce, that I should have asked for but didn't.  My husband is a carnivore and he loved his special of the strip steak with mash.  Of course the salad is what brings us back time and time again.  While it's not a classic Greek salad, it is so tasty and generous, it's easy to make a meal of just that.  The hummus platter is yummy, as are many of the flat bread pizzas.  It certainly isn't elegant and its look is a bit run down now, but we continue to enjoy our meals there and will continue to in the future."], ["Caitlin A.", "The food here is great, and if I was rating on food alone it would be 5+ stars. Unfortunately, the service is spotty. Before we moved away 2 years ago, we actually stopped dining at Tapas completely because we consistently felt ignored. Once we ordered something and when they brought out the wrong item we were told by the waiter (who I have not seen there recently, maybe he's gone) that we had \"ordered wrong.\" Actually...nope. Anyway, food is great as long as you don't mind taking a gamble as to whether your server can be bothered to actually serve you."], ["Elliot S.", "MuffalettA. Yummy"]], "MM's Gyros and Spuds": [], "Elmwood Kabob": [], "Cavos Tavern & Pizzaria": [], "Ambrosia": [["Anthony C.", "My friends and I had plans for breakfast on Sunday morning.  We had a bit of a late start and the 2 places we had in mind were packed. We went on Yelp and found this place. We decided to take a chance as the 7 reviews at the time we're positive.  Wow. We lucked out. We were drawn to the crepes. I had gyro platter. The pork was well seasoned, the French fries were tasty and the salad of tomatoes,onions, and feta cheese was fresh with a great dressing. One friend had an egg sandwich followed by a sweet banana and Nutella crepe and the other a savory crepe of brie with spinach and the apple and walnut crepe. The crepes are excellent with a good consistency.  The fillings were very tasty. The food was very good. The crepes were very sweet, but I think the Nutella added to the extra sweetness.I would definitely recommend this place. The other positive point is that this place is a family owned small business."], ["Eric P.", "Coming from out of town I wanted something to eat other than Pizza and chain food so I found Ambrosia on Yelp... Appearance is very well suited for the size and cleanliness was also a plus. When you walk in the hearty aroma of fresh cooked meats and breads filled the air.   Now to the food, i expected a traditional lamb gyro on a homemade pita but got one of pork on pita bread out of the bag.  My expectations were very high and was slightly let down when told the lamb was frozen.  I went for the pork, which had a great flavor but fries in a gyro for me was \"interesting\" at best.  The cucumber sauce had above average taste but was thick compared to expectations."], ["Deb S.", "This restaurant opened and we like to support Cromwell businesses.  It's small, clean and friendly.  Wasn't sure what to expect, we were pleasantly surprised the food was wonderful,  Everything was cooked perfectly, can't wait to go back and try something different.  The place was quiet, I hope the word gets out and more people visit this new restaurqant."], ["Anthony M.", "This place is serious. Had my first crepe, gyro meat mushrooms tomatoes onions sliced Kalamata olives. The bomb. Nice people very clean this place has staying power!"], ["Mike L.", "Great little place, just opened.  Definitely worth a try.  Gyro's and crepes.  Clean and friendly, takeout or a eat in.  The Greek salad is fantastic, very fresh, with a nice block of Feta.Second entryStop by for breakfast.  The breakfast crepes are fantastic.  A must try.  Coffee is very good to."], ["Paul B.", "I waited until after my 2nd visit to review. I've had both the pork and chicken gyro wraps as well as a crepe. Excellent food, simple menu and always hot and cooked to order. Chicken has a bit more seasoning which I prefer. A bit unusual for a U.S. Gyro, fries inside not on the side I've had it this way in other European cities."], ["Mathuzalem D.", "The people are great and food is excellent, once you go there try the crepe with bacon."], ["Mark O.", "Stopped in here on the way through Cromwell based on a great rating on Yelp and a desire to have something other than fast food. I had the Grinder Gyro. Loved the freshly cut ingredients and toasty, tasty bun. I took my time and ate the whole thing, although it was large enough to take half home. The two gals running the place were friendly and served with a smile. Give Ambrosia a try!"], ["Nicole B.", "Delicious food, cool ambiance & really nice owners.  Anyone who loves Mediterranean should go here!"], ["F D.", "Don't let the small menu fool you! These people really know what they're doing! The gyros and crepes are fresh and extremely delicious. The Greek salad was a huge plate of green olives, tomato, onion, green pepper, and drizzled with oil and vinegar. So delicious and healthy! A must try!"]], "Chip's Family Restaurant": [["Tom M.", "Par with other diners, tho the wait is longer than I've ever seen at a half an hour. Food and drinks came out quickly. Table next to us had their plates dropped in the back and never received their food. They left upset, and sitting next to them was a bit uncomfortable while there considering they looked at our food a majority of the time. They have tv's in the dining area, which was great, except their channel selection, which was playing T25 advertisements the whole time. Why not sports or family tv considering its a family restaurant?"], ["Johnny P.", "After seeing the Circus at the XL Center in Hartford the family was hungry, so while driving on the highway we saw a billboard for a Denny's in Wethersfiled.  As we drove up to Denny's we saw a Chip's across the street, we've seen a few Chip's around the state so we gave Chip's a try.I love IHOP and since the Chip's sign says they 40 types of pancakes, I thought I was entering  Pancake Nirvana.  Sadly my buttermilk pancakes were just average and not as good as IHOP.  My other family members said their waffle and apple pancakes were good, but not sure if they were just being nice. My food wasn't great and I think their menu is overpriced, by a dollar or two per item.  I wish we had gone to Denny's across the street for better food and prices.  I almost feel like my meal was a ripoff and won't be back."], ["Katie H.", "Good things: kind wait staff, truly wanted to make sure we were taken care of. Excellent manager helped us when there was an issue with one item. Not-so-good things:Super busyLoudCrowdedFood, mehI think it's just not my kinda place."], ["Nicole D.", "Came here to try the pancakes and was impressed with their menu. They have a wide variety of pancakes to choose from, as well as other breakfast items. The pancakes were good, though overpriced for pancakes. It's actually very similar to IHOP."], ["Cj H.", "Hands down best pancakes ( other than my Popa's homemade)!!There omlett a are also excellent, they never skip on fillings and try them fluffy My favorite pancakes are the cinnamon and the coconut almond!!"], ["Donna S.", "Thought we would give Chips a second chance, they  do a good job with poached eggs bacon and sauage. Didn't care for the waffles no flavor and became soggy real fast, but they were very light. They should add a little ground oatmeal gives a waffle a wonderful nutty flavor.   The staff were very friendly and attentive and wanted to make every thing right I have to give them good marks for effort."], ["Charles K.", "Well the food was good, hot, and portions generous didn't have breakfast had dinner although the place is known for their pancakes. One thing is they should cut back on the service went in on a Monday night for dinner and like I said nothing wrong with the food it was a good meal. I couldn't relax and enjoy the food cause every 3 minutes some one came up and asked \"how is it\" or \"do you need anything\" or \"if you need something I'll be right over here\"......  Seriously guys your food is good if I need something I'll flag you down let me eat in peace."], ["Raymond W.", "Chips is a great place to go out and eat for breakfast. It's kind of like I hop or Denny's. They have a great variety of different pancakes which is great. The reason why I give it 4 stars are because I got the California Benedict the toast it was under wasn't that great and kind of hard. The pancakes were great though I can't repeat that enough my sister had the German apple pancakes which were great. I will go again and try one there omelette next time"], ["James M.", "I had breakfast here while staying in the area.  The building is nice - apparently new, since it doesn't yet appear in Google Maps' satellite view.  I was there early on a Sunday and service was great, but there were probably less than six other tables occupied when I got there.  The food that I ordered was good but basic - nothing that couldn't be found in numerous other diners and family restaurants.  It was a little over-priced also.There's nothing about Chips that would keep me from going back, but nothing that makes me wish that I could go there today either."], ["Rebecca C.", "The menu is so creative here, and the food is very good. We came on Mother's Day, so naturally the wait was crazy, probably about 45 minutes- it was still shorter than IHOP! By like 2 hours. The food was great and my boy friend's mom was very happy with the choice, as it was our backup plan. We had omelettes with chorizo and s'mores pancakes  and everyone enjoyed Chips!"], ["Dez A.", "Good Variety of food, so much to choose from. Food taste \"okay\". Expect to have just about everything brought to you on different plates..."], ["Alfred R.", "First and maybe the last visit for dinner. May be brave enough to try breakfast some day. The place is large, clean, and bright. The staff was friendly and prompt. The fish and chips were of the frozen variety; kind of expected better for $14. The braised rib special was okay... 2.5 out of 5 stars. The portion was barely adequate, the flavor was okay, it came with 6 stalks of the skinniest asparagus ever, served over soupy mashed potatoes. The two of us have had much better meals for $34 than this one. While leaving we noticed 5 other groups having breakfast items (at 6 pm). Maybe that's the secret."], ["Alanna M.", "The husband and I decided to eat at Chips because we heard mixed reviews about the place and figured we would try it for ourselves. I had the \"two eggies\" with added birthday pancakes and he got the steak and eggs with home fries and bacon pancakes..yes..bacon pancakes! The food was okay but the portions for the price it was, was pretty sad. His steak looked like something from a frozen box at Walmart and the pancakes were nothing compared to the raves we heard about them. I would call them \"doughy.\"Things that you would see automatically added to a meal at other restaurants ( bacon, eggs, toast, homefries, etc.) were an additional outrageous charge. Needless to say, our mediocre meal came to over $40.. Next time we are craving breakfast for dinner, we will go to the cracker barrel where quality meets quantity, and surely meets the price."], ["Cameron C.", "Yeah! Finally a local fam. restaurant that serves breakfast all day! The fluffy omelets are their specialty and pancakes are outstanding."], ["Janice M.", "If you've ever been to the original Chip's in Orange, you know about their lines. When we found out they were opening a new location (Wethersfield), we jumped at the chance to check it out.Unfortunately, we were greeted with an expected 15-20 minute wait. It turned out to be more like 30 minutes. We were seated and a waitress promptly took our orders. I ordered an omelet, but was not informed of the two ways they prepare them. Had I been told, I probably would've gone with the other style. I've said this before, I don't do brown (burnt) eggs. It took 15 minutes to get 3 (1 was forgotten) waters and 1 coffee. Our meals came out about 15 minutes later. More things were missing from this delivery, but enough was there, that we were able to start eating. Omelets (Hash & Hoagie) were good, pancakes (Blueberry & Buttermilk) fluffy and the hash was decent.  We had only 2 complaints from the table; burnt eggs and funky blueberries (fruit cup).Since they have only been open a short time, I will be revisiting. Maybe the lines wouldn't be so long, if the tables didn't have to wait for their tabs. We'll see how things improve."], ["annie k.", "Finally was able to try Chips and see if Denny's had anything to worry about. Well, after breakfast at Chips with my daughter and my two grandkids I'm happy to report that we will still be Denny's customers. Yes, the pancakes were fine, no sides came with it. So we ordered the home fries which were flavorless, with no onions, peppers or seasoning of any kind. Bacon was nothing special-typically thin and rubbery like lots of places. All were pricey. But the very worst thing was the price of the children's meals! Two small pancakes, very small serving of scrambled eggs(1egg) and four apple slices in a tiny cup-$7.99!!  A great deal-for them!  Service was fair at best. I expected prices overall would be higher, but that the food would be better. Not so for us. We'll stick to Denny's and their generous coupons."], ["LaPenta A.", "Best pancakes I've had in quite awhile. Excellent menu with multiple choices and varieties of pancakes. Also large choices of omelettes. I also added scrambled egg whites to my order. The have a wide variety of healthy choices too. You won't be disappointed!"], ["Nicolea W.", "I came here this past Saturday for the first time, and I must admit, I was very impressed. The pancakes are great, and the omelette was absolutely delicious. Even the orange was pretty large, and I'm so used to places serving very small cups. The portion sizes are very satisfying, so I would say to come with an empty stomach. The staff was friendly and the the environment was pretty laid back. I would definitely make another visit if I can."], ["Brian B.", "Pancakes were really good. I got the Cinnabon ones. The short stack would have definitely been enough. Eggs were ok. I know it's a family restaurant, but more people would prob go if they had a liquor license. Wasn't really busy at all on a Saturday night and it's in a location that gets a lot of traffic."], ["Jascian G.", "I just went to try this place this afternoon and all I have to say is I've had better. The service was great my waitress was very nice and she was very attentive but when it came to the food that's where it all boils down to. I had the Chip's Favorite Omelet which is Sausage, Apples, and Cheddar Cheese and I had it diner style. As I am not a frequent eater at diners I forgot what diner style actually was and maybe I should have gotten my omelet fluffy. The sausage kind of tasted like it was those Jimmy Dean frozen sausage patties cut up into an omelet. I am going to give this place one more chance to wow me in the future and I'll definitely get something different off the menu next time."], ["Tarringo B.", "Was there on 3/1 for the first time.  Long wait.  Once we were seated, we received drinks quick and was excited about the omelets we ordered.  Almost 2 hrs later we were still waiting for those omelets.  Waitress kept coming by complaining about the kitchen not having our food ready, but never actually took the time to find out why.  She talked to the manager who didn't even bother to come over.  Can't comment on the food because we never got it!!!"], ["Aj S.", "Food was ok. Bacon pancakes.... who ever thought that was a good idea was right! But. The food is not worth the price. $40 for the lady and I. It's pretty over priced. Portions were not quite what I was hoping for. Waitress was great but the girl behind the counter could use a lesson in customer service."], ["Amy H.", "We love this place! Best pancakes in the state! Wait staff is friendly and efficient!"], ["Naushaba A.", "Yuck.  Went for first time with family of 6.  Food cold, omelette smelly and coffee cold too.  Staff took away my smelly omelette but took my potatoes and fork with it as well.  Replacement egg just as bad and given with no replacement fork or potatoes.  Pancakes so so perhaps a bit fluffier than ihop.Waitress was friendly enough but overall waitstaff seemed scatter brained.Given no utensils until we asked for them and when the person came to give it to us, the person had his big hands wrapped all around the utensils.  Another yuck.Anyhow left feeling queasy.  My friend had told me it was good but the overall experience has left me feeling too queasy to even give it a second chance."], ["Brian O.", "Visiting for the holidays.  I had the Hoagie omelet. Was with a party of 8. The omelets, home fries and pancakes were delicious!  Our server was Amy, and she was great. Quick, helpful, with a dose of humor!  Wish we lived closer!"], ["Paul K.", "I did not enjoy my cheeseburger platter.  I felt the food was not a good value for the price point.  My kids rated the pancakes as 'OK', not as good as their local haunts.  Good service with friendly staff."], ["Aida N.", "The breakfast here at Chips was nothing short of Fabulous! I love pancakes but haven't found a place that makes the soooo good I wish I could eat them all day - Ta Da!!! I found one! The Cinnabon ones were fab. The blueberries were so very good I wish I could eat them everyday! The service was good but a bit slow (I am from the city - rush, rush) and accommodating. It was clean and welcoming. This is definitely a permanent stop next time I am in Connecticut."], ["John L.", "Quick service, we only waited maybe 15 minutes on a busy Saturday morning. Portions were generous, but I thought my chorizo, peppers and onion omelette lacked flavor and was a bit overdone (browned). Pancakes were very good, just wished there was a better quality syrup to go with them. Good coffee!"], ["Chris D.", "The best pancakes in the state is the truth! They move the wait line quickly and you're in and out quickly."], ["Sandra N.", "Long wait.  Once the food came everything was overcooked.  The sausage tasted like freezer burn.  The bacon was tough.  The eggs were just eggs.  And the pancakes were small flat and overcooked.  The home fries had no flavor.  A waste of time and money.   Do not recommend in the least.  Definitely NOT one of CT's best."], ["Jessica C.", "The line is always really long to get a table here. Today we waited for 15 minutes which wasn't bad- it seemed to move quickly. Once we were seated drinks were offered I a reasonable amount of time. Service on the food was quite slow. The quality of breakfast was great. Our table had: challah French toast, Portuguese scramble and the kids chocolate chip pancakes. Overall the price wasn't bad at just over $30 for everything."], ["Lady M.", "Quick, friendly service. Although it was a bit of a wait to get a table, it was on a Sunday morning, and for the amount of people that were there, it was not bad. As soon as we sat down we had someone take our drink order and shortly after, our food order. Our food came out pretty quickly and it was tasty! I had the waffle Benedict and it was awesome! Nice twist on the regular egg Benedict. I'll be going back :)"], ["M P.", "We expected to wait on a Sunday morning, and the wait was 15 minutes, just as we were told. We were lucky enough to get a booth, even though there were only 2 of us ( tables are pretty tightly packed). Coffee was hot and surprisingly good.  Wait staff was friendly and helpful, our waiter was probably new, but his co-workers had his back with coffee refills and such. Ordered a fluffy omelet, which was good, maybe a tad bland. I could only eat half, it was quite large. I ordered 3 apple pancakes (again, took half home), as my side with real maple syrup (both are up charges), making my meal $15, which was a bit of a surprise. Butter for the pancakes is served on the side, very nice. Real maple syrup $1.29, well worth it. The apple pancakes were amazing, I would definitely order them again. Not too sweet, just right.Santa made an appearance for the kids, he even had a real beard!! Overall, worth the 15 minute wait for the pancakes, but be prepared for the price. I wouldn't re-order the omelet (\"condor omelet\", price not listed on the menu), I'd just get the apple pancakes."], ["Miss R.", "Recently went in on a Saturday morning for brunch. Was quoted a 20 minute wait time for a party of five, but was seated much sooner. Food was served hot and fresh and the pancakes truly are fantastic. Our server was absolutely attentive and wonderful and a very kind lady. Would definitely return again."], ["Henry V.", "Great place will not be disappointed! Wide variety of choices. And super friendly service!"], ["Sean M.", "Good breakfast food all day. Been here 2x but they have yet to deliver the toast w breakfast without waiting"], ["Juan E.", "Best pancakes 6 years in a row is overrated. The German Apple pancakes were mediocre at best. The omelettes were over cooked and dry. Definitely left disappointed."], ["Kal L.", "There was much \"hype\" before Chips opened in Wethersfield.  I was excited waiting for it to open. SO as soon as it opened, I was there for Breakfast. I ordered my usual, an egg white cheese omelet but with three speciality pancake (an additional $3.20) instead of potatoes and toast,  The omelet seemed small and the pancakes were good, but not great. And the price was a couple dollars more than what I usually  pay.So I thought the next time I go to CHIPS for an omelet, I would not replace the potatoes and toast with pancakes.  SO that is what I did.  But the omelet was still small and the serving of potatoes was not generous . I tasted better omelets which are bigger and the price more reasonable at several local breakfast.So I debated between three  or four stars and decided on THREE STARS.Service is good and there are plenty of servers.  It is just the size of the omelet and the price which kept me giving it four stars.The restaurant does promote over 40 different kinds of pancakes.TRAVEL KAL"], ["Ed L.", "Server was terrible, not very friendly or knowledgeable.  Messed our order up twice. Pancakes were ok, the sausages were over cooked and dry. Would not recommend."], ["Al M.", "My wife and I had our first, and definitely not last, breakfast at Chips today. We shared their plain waffle which was very light and tasty. They offer real maple syrup as an inexpensive option which I recommend (I'm from New Hampshire so the real stuff is a must!). We also ordered their Bacon, Mushroom, Avocado, and Cheddar Cheese Omelet. It was delicious with excellent ingredients. There are multiple options for sides with the omelet and, wanting to try their pancakes, we ordered 3 blueberry pancakes (blueberry was a small additional charge). They were the highlight of a wonderful meal. Light and flavorful with lots of berries inside and a generous spoonful of fresh berries on top. Our server, Mayleen, was efficient and had a friendly sense of humor. I have no hesitation giving Chips 5 stars!"]], "Shish Kebab House of Afghanistan": [], "Villa Pizza & Deli": [], "Town Line Diner": [["David T.", "Solid effort. Came here and ate at 1230 at night. We were starving after 12 hours of flying and lay overs.  The waitress, (Violeta) was very nice and sweet.  Very eager to help us ASAP.  We ordered a Grecia Hamburger which is just feta cheese and the taco salad. The hamburger was good. Solid little burger. We ordered the big pieces of lettuce so we are gluten free. The taco salad was surprisingly good as well. Solid little effort from the diner. No dessert for us. Got a wedding this weekend."], ["Jennifer C.", "We stopped here late night after our flight. We ordered the Mediterranean taco salad and the Grecian burger. I have to say it was delicious all the way around. Not sure how and why this place got 3 stars but I felt the food was quite delicious for it being a diner. Violete was our server. She was sweet and helpful. We will definitely be back when we fly in next time."], ["Gabriel S.", "Overall the food was good up until the owner started yelling and cursing at a customer for accidentally knocking over the back to one of the booths.  The owner then proceeded to yell at the waitress for letting the customer lean on the loose booth.  The yelling and cursing made myself and my wife very uncomfortable.  I will not be coming back because of this incident."], ["Molly G.", "Havnt even eaten my food yet.... We ordered almost an hour ago.... Wish I had some food I'm starving... Never coming here again. We ordered breakfast... Eggs... That doesn't take an hour.... The waitress didn't even come to the table and attempt to apologize for the long long wait.... It wasn't even that busy. Unacceptable!"], ["Ariana M.", "After re-reading my last review, I felt that it's high time for an update. Some things from my last review still stand, like the food being hit or miss, but I will say that the wait staff has improved a lot. There's one new waitress (her name is something along the lines of Athena, I'll edit the review if I see her again) whom is very attentive and good, and if she sticks around long enough, she'll probably grow to be as cherished and worth her weight in gold as the waitress we call Mom. They also hired a new waiter (I think his name is Chris) whom was also very good about not pressuring people to order if they weren't hungry or just coming to socialize. I also found myself in the area and stopped in for a late night nosh a few months back. It was bizarre seeing the diner on a regular night, but my friends and I were delighted to have Mom as our waitress. She was as thorough and kind as ever! So, the bottom line is that this place, while it's not the be all and end all, has its charm and has decent food. If you don't want fast food and want to go somewhere close to I-91, the Town Line Diner is a great option!"], ["Tom D.", "Dropped in for lunch today.  We were in the area and very hungry, had no plans to stop at the Town Line Diner, but figured, how bad could diner food be ?Well, the food was borderline OK.  I ordered a Ruben sandwich w/ fries (my standard diner fare), my fiancee went with the Ultimate Grilled Cheese sandwich.The pastrami in my ruben was a bit tough, chewy.  Also, they burnt the rye bread somewhat (see my pic).  Coleslaw and fries were alright.  My fiancee's Ultimate Grilled Cheese (which is ham, bacon, tomato, American & Swiss cheese) was better, but honestly, I thought it wasn't worth 10 bucks.  She did like the Chocolate milkshake she had with her meal, was very good.Service was good, didn't get the name of our waitress, but she was nice & attentive.  That's about it, can't really ever see coming back for sub-par to average tasty food that costs more than it should.An extremely weak 3 Star rating."], ["Kariann R.", "Wasn't the best of food. Ordered an omelette and it just didn't do it for me. Staff is great. Food not so much. Over priced as well. Wouldn't come back. Sorry."], ["Michelle P.", "I used to work there years ago and let me tell you I literally work there for a day and a half if you saw what goes on in the kitchen you would not believe it before the wait staff brings out their food they think its funny to sample what you're going to eat gross .....but who's knows maby it's changed since then?"], ["Sebastian B.", "On my way north on a biz trip I decided it was time to stop for breakfast. I don't eat fast food and will not eat in my car so I spotted the diner close to the highway I was on made the exit and had a nice meal. The service was terrific and the atmosphere was welcoming. The locals make you feel comfortable. If I am passing by at the right time I would definitely stop in again."], ["Alanna M.", "Great local diner. They're open 24 hours to accomodate the late night workers and also the drunken kids. But beyond that, the food is very good for diner food.I want to say the diner is family run. They have the younger kids working there sometimes, and you always see the same friendly faces. The restaurant is also kept very clean and organized at all times. Surprisingly, the reubans are amazing. I say surprisingly because you usually only get great reubans at places who are known for them, Jewish delis, or Irish restaurants. Needless to say, the reubans are a must try. The eggs are amazing, the hash is awesome, the ultimate waffles are a must! I know, i know. A belgian waffle with icecream?? Yes. Just yes. Try it. You're welcome. The pancakes are great, the steak and eggs is good, and the eggs benedict is to die for. You get eggs, bacon, sausage, your choice of toast and jelly for one price. It's everything you want and expect from a diner.It's definitely a must try if you're from the area."], ["David D.", "It's OK and everything here is just OK."], ["Shelly S.", "Great lil place. Glad they redid it. The food was good and the staff was awesome. And I love the variety of choices."], ["Erick F.", "I love love love town line diner, everyone is so friendly and the food is quick and always so consistent. The late night visits, or the early morning breakfasts, they never fail to keep me satisfied and I have been going for a while!"], ["Heather W.", "It's open 24 hours, which is a huge plus. Standard diner food-- I had a delicious waffle, my husband had pot roast. The waitress was very friendly and attentive, and service was quick. We will definitely return when we are in need of high-calorie comfort food."], ["Kevin C.", "It pains me to give a one star review because the staff seems nice and I'm a fan of small businesses, but in this case a wake up call is desperately needed.  Waitress and host were nice, but that's about the end of the positive.  My wife and I did the Friday night special which comes with a soup or salad, \"vegetable\" , main potato and dessert.  The reason vegetable is in quotes is because the choices included macaroni salad, and applesauce...   Even though this seems like a deal, it's not when the quality was so low. My wife got roasted chicken that came with stuffing.  It was just a very dry chunk of dark meat chicken that came with the center carcass still attached. The stuffing was inedible.  I got the shrimp casserole that was marginally better but still not good.  Then the sides we choose were also poor. Spinach and rice tasted like a spoon full of Rosemary and salt.  The sweet potato was bright orange and covered with some jello consistency \"sauce\" on top of it.   It looked unsafe for human consumption as no sweet potato is that color inside and out.  I uploaded a picture. I truly hope that improvements are made here to keep this place alive. We had nice hopes when we stumbled upon this on our road trip, and will be sure to avoid next pass by."], ["Jay F.", "Food is absolutely terrible. The worst I've ever had. Service was great and that's the reason for the star.. My God- you couldn't destroy food so bad if you scrapped it off the road. Move on."], ["Vildana H.", "Absolutely best place to eat in the area. Very clean, amazing staff food is awesome. My favorite place to take my family."], ["Tony C.", "I have been coming here for years.  Used to come when I was younger every Friday and Saturday night after the bars closed.  I came in last night with 2 other friends for a quick breakfast.  The place has been updated and looks good.  I never had any complaints with the food or the service but then again I have only had breakfast here.  Not a bad choice here"], ["Bill P.", "Great experience for a diner! I went the other day for brunch and split eggs Benedict and Greek eggs Benedict and could not be happier! Also had an order of the thick French toast (made with challah break I think) which was absolutely amazing. I remember going here quite a bit in high school and for some reason the restaurant lost its appeal for several years, but now that I've gone back I know I'll be frequenting it more often!"], ["Bill H.", "We go there a few times a year when our usual places are packed or during inclement weather since they're almost always open and you can usually get in. Service has been ok. Every meal I've had there tastes like it has one ingredient too many that gives it an odd taste that is not like you'd expect, especially anything with a sauce or a gravy. Breakfast, lunch or dinner. Home fries are hardly fried, more like mushy chunks of overcooked potato with a light browning. Stick to pancakes and deli-type sandwiches with standard condiments and you're probably ok."]]}