{"Avon Indian Grill": [], "India Kitchen": [], "Priya Indian Cuisine": [["H S.", "I just left the restaurant and couldnt wait to rate my experience here....... horrible :-(The Chilli Bajji was tasteless and non spicy. My family just couldn't even able to eat half of their dosas because they were either dry or hard and cold.  We got mendu vada when we ordered Dahi vada... really...??Lastly, service was also horrible where we waited 20 minutes to get our check. This said, we are never coming back at this restaurant."], ["Mike R.", "The food is excellent, we ordered spicy and were not disappointed. Take out was sealed in tight plastic containers, no leaks. That aluparatha was great, cosa came with very good sambar. Wonderful addition to Manchester cuisine!"], ["R S.", "Terrible! Waitstaff was slow and rude! The food was worse! We left hungry after spending $50.00 for Dinner. We would have been better off going to Mc Donalds!"], ["Jon P.", "Excellent lunch buffet! Authentic southern India cuisine - and great service! Accommodated a large party (9) well and gave us some free appetizers!! We'll be back!"]], "Indigo Indian Bistro": [["Jeremiah L.", "this is an excellent place. Great service and fabulous food.they serve lunch buffet  however dinner is A la carte. The food is very well made at this place. I have tried many dishes there. it is amazing how well they can do sea food, especially shrimp, which I think is a rarity amongst Indian restaurants. the taste and texture of the food are excellent - never dry, but juicy and flavorful. the spice is just right not overpowering and you can taste the natural flavor of the main ingredient. My favorite is the shrimp Byriani. The interplay of saffron and shrimp is just wonderful. I grew up in HK and I know how top notch seafood should be prepared. the chef at this place does a great job with this shrimp dish. The other great dish is the Gobi  Manchuria (deep fried cauliflower in a spicy sweet and sour sauce modeled after a Cantonese dish made from pork). I also like very much the dosa - light and tasty. the tangy fermented dough made into a very thin crust with mild filling hits the spot every time.Lunch time buffet is also excellent with a great variety of well prepared dishes at a very competitive price.the service is also great, the staff and owner are very friendly. the place is also sparklingly clean and the atmosphere is very pleasant."], ["Kb R.", "Come here!! You won't be disappointed, the apps,  the naan, the  shrimp curry. Amazing, delicate, spicing. Small but we'll chosen wine and beer list. Recommend highly!"], ["Bianca M.", "Great Vegan Food!! Even the lunch buffet had plenty of vegan options and everything was labeled both on the food description and on the menu as what is Vegan and what is not. The staff was knowledgeable about vegan and other food allergies and very helpful. The food was delicious!!! So happy I was in the area and stopped by. I can't wait to go again!"], ["Regulr G.", "Excellent food, excellent service. Very clean, and superb ambiance--you can actually carry on a conversation with others at your table, which is becoming increasingly rare in the restaurant world."], ["Don P.", "This is one of my favorite Indian buffet stops when I am in CT. I have known the owner for years since his days in Vernon, CT and his penchant for quality is unparallelled in my experience. I find the food to be unusually good, the chutneys are exceptional especially the onion chutney. Perhaps it's just me but the naan at Indigo is one of the very best; I believe it is because it is thinner than most and develops a nice char flavor in the tandoor. There are many dishes served at Indigo Bistro that don't seem to be on other menu's elsewhere which makes this stop always a pleasant surprise."], ["Biota H.", "It's been awhile since I've been back to this place, and sadly, they've done away with my favorite--the dinner buffet. But they still offer a lunch buffet for $9.99 on weekdays and $12.99 on weekends.I stopped in this plaza for takeout and groceries. Deciding it'd be most efficient to place my order before I picked up the couple things next door at ShopRite, I went in and ordered aloo gobi (comes with basmati rice) for $12.49 and chappati for $2.99. I was amazed when they told me it would be 10-12 minutes.I ended up coming back after about 25 minutes, and indeed my food was ready. Based on the receipt that they had already printed, it looked like they had actually gotten my takeout ready in 10 minutes. Very impressive.This was my first time ordering off the menu and not just eating at the buffet, but their food doesn't disappoint. I've been a vegetarian for awhile and recently have started transitioning into vegan, so I really appreciate that they mark entrees containing dairy. For those with a gluten intolerance, they also mark gluten-free options.I'm a huge fan of spicy food and asked them to make the aloo gobi between medium and spicy. I felt like that level of spiciness was actually between mild and medium, so next time I'll just ask for them to make it spicy.I also appreciated that the chappati was put in a paper bag with an aluminum lining to preserve the warmth.Good portion sizes (see picture with my computer mouse in it for size reference).Random Sidenote: The one huge pet peeve I have with this restaurant is their website probably belongs on this list: topdesignmag.com/20-exam…. All of the info that you need is there, but having to look through the site is a little like shopping at Walmart. Fortunately, their poor website design isn't at all indicative of their delicious food.Being back here after so long has reminded me that I need more IndiGo food in my life!"], ["K W.", "We ate at Indigo last night for the first time and the food was excellent!  We ordered the Chicken Tikka Masala, Vegetable Biryani, Vegetable Samosa and Garlic Naan.  All were fantastic.  The Biryani is like nothing I've seen before - it's placed in a large crock with a piece of naan bread baked over the top.  Everything was delicious.  Eager to go back on a colder day and try their Chai tea."], ["Barbara B.", "All the food was very tasty.  People were friendly and attentive.  Luncheon buffet had many choices.  Would recommend."], ["George D.", "This is the only restaurant that has never disappointed me. Not once.The food, service, and atmosphere are all beyond a 5 star rating. After frequenting it for more than 2 years I can safely say I have NEVER had something I didn't like, have less than excellent service, or have any questions of the quality of food or cleanliness. That is a rarity these days."], ["Quincy V.", "An okay place for Indian with vegetarian options. The first time I came here, I had high expectations. The reviews were fairly good, my brother recommended it and the place itself looked pretty classy. I ordered the Vegetable Vindaloo and it really wasn't very good. I don't know how else to put it. The spice was fine, but the vegetables had next to no flavor. The dish wasn't worth 13 bucks. It was very liquidy too. You can get a vindaloo meal that's much fresher, half the price and infinitely better at Tikkaway. The bread and dipping sauces were OK at best.The service was okay. There also seems to be some discrepancies on the hours of operation, plus the buffet or lack thereof. I have a feeling this changes depending on the day and week. (Some reviews state buffet only, but both times we came here for dinner there was no buffet in sight) *Note: The hours on Yelp now appear to be more accurate and specific about lunch vs. dinner*Since the menu clearly labels what's vegetarian and what has dairy, I'll give them 3-stars. I would be willing to come here to try the buffet...that is, IF I can figure out when it's offered. Oh yeah. Their website is just awful. Don't go to it unless you want to get lost in cyberspace or have a seizure."], ["Boo S.", "Would really like to give this place 4.5 stars!  Found this on our way to Boston on I-84. Not too far off of the road, and certainly a step up from road food. We got the lunch buffet- good, hot and plentiful choices. Garlic naan and thin crepe-like pancakes were served to table. Service was attentive and friendly.  A nice stop!"], ["Ronald S.", "Jeezz... IndiGo, I loved you once. We have been here maybe a dozen times, started when they still had menus and now it is just a buffet and take out. We recently went in for lunch and there were still a decent amount of vegetarian options but unfortunately before we had even finished eating we had to indi-go to the restrooms quickly. everything was super oily and killed by the steam table. A sad day. the dosa and bread were OK but we ate that oily stuff and it flew through our gastrointestinal tract like grease lightning - all it needs is some overhead lifters and some four barrel quads, oh yeah."], ["Vivy V.", "The Food was delicious! My boyfriend and I went here for dinner and got chicken tikka masala, tikka quesadilla, and garlic naan. The quesadilla was a great twist on their fusion menu :) the employees were really nice too"], ["Tanya C.", "Took my mom here for Mother's Day last month. The buffet selection was pretty good - many of the popular traditional Indian dishes. While eating there, I felt fine and enjoyed my meal, though within ten minutes of finishing, oh boy. I'm not sure if there was a lot of oil in the food or what it was, but just as another reviewer mentioned - the food did a number on my stomach. In summary, the food was delicious, the service was good, the price for the weekend buffet is a bit high ($16-18 I believe). If you even minor sensitives, be careful."], ["Stefanie J.", "Super friendly service and really quality food. I often order so much, I end up leaving with a complimentary dessert or entree, which is always a plus :D"], ["Ashwin S.", "Exceptional Indian food!!! Sheen, the owner of IndiGo Indian Bistro, has such high creativity with the dishes and he makes sure the authentic flavors are still not missed.So many authentic food from the state of Kerala, I don't miss staying away from home. Great food and I will always look towards Indigo for very good Indian food. Not to forget is the creative desserts exclusively by Sheen; if you ever dine in, ask for the desserts from the menu. So delicious!!A place that I will go eat anyday."], ["Melissa C.", "The food was excellent, the atmosphere was perfect, and the service was great. Unlike other Indian restaurants, the naan was hot and delicious. The food was spiced just right. I'll definitely be back."], ["Lan K.", "I'm a huge fan of Indian food and I eat pretty much anything. However, I have a staple dish, Chicken Tikka Masala, that must be good for me to return to an Indian restaurant. Now, IndiGO is a buffet and it has a decent variety of items, from goat, to chicken, to vegetarian, and vegan options. They post on their website and on Facebook some of the main dishes they will be having that day at the buffet. Sadly, Chicken Tikka Masala is only available on Friday nights (at least from my observations of following them). So the first time I went there it was some random weekday for lunch and there was no Chicken Tikka Masala. There is no doubt that the food is fresh and the dishes were all pretty good. However, I made a point to come on a Friday night the next time and the Chicken Tikka Masala was not great. The chicken appeared to have been cooked in a way that had some blackened charring on it and the sauce was too tomato-y and not very creamy or spicy. Although the food was good that I tried, and it is very authentic, I think it would be hard for me to keep track of the new dishes I tried and liked and make sure I get it again at the next buffet. Therefore, I think you have to be fairly adventurous or have an excellent memory + follow what they make. Sadly, as much as I like to try other dishes, I must also have my Tikka Masala! and IndiGo just doesn't satisfy that craving. Another favorite of mine is the green chutney and Indigo's version of it was not as flavorful as I've had it or as spicy.The waitstaff was courteous and attentive though. Place was very clean."], ["Hollie M.", "I am not big on spice food, but this place was really good. They do have food that isn't as spice, but all the food was fresh and very flavorful.  Would definitely recommend coming at lunch time as they have a buffet for lunch.."], ["Khaeris G.", "Amazing. Tonight was my third time here, and it still surprises me. The lunch buffet is awesome for beginners , you get to try a little bit of everything and see what you like. During dinner hours it's menu style, not buffet. I recommend the chicken tandoori. It's my favorite so far :-) The waitstaff are quiet but very friendly. I seriously have no complaints. Came home very full and with some left overs :-)"]], "Bombay Olive": [["Janelle S.", "I recently ordered take out from Bombay Olive.  The menu was very easy to find and read online on their website.  When I called, someone quickly answerd the phone and took my order, asking how spicy I wanted my food, which was nice.  I ordered Chicken Curry and Chicken Tikka Masala and was told that it would take 30 minutes to prepare.  30 minutes later, I made my way to the restaurant, and my food was ready upon walking in.  There was a nice man waiting at the hostess stand and he helped me with my order - very friendly.  He also sent me off with some coupons for future visits.  Upon returning home, I opened up the food and all was exactly as I had ordered and all was delicious.  A good takeout experience!"], ["Sanh A.", "I've always been a fan of Bombay Olive and can't say I found a decent replacement.  I'm no expert in food from that region but after many many trips to Bombay Olive I think I can add them to my consistency great meals list based on the notion that I always leave satisfied. I took my cousin there on Tuesday for a late dinner. Since it was my cousin's first time having East Asian food we picked items from the Indian side of the menu. I usually prefer their Persian dishes but their Indian selection never fails to disappoint. I recommend the tandoori mixed grill because that comes with a variety of items for you to try. You are guaranteed to find something you will enjoy. The dish is served in a hot heavy dish so the food arrives to your table steaming like a parade of flavors that exhibit interesting aromas. Apparently we were supposed to get two pieces of shrimp but the chef must have been distracted because we got way more, I'm not complaining in fact it made my evening. You can't go wrong with the mixed tandoori. You can't have a proper Indian dinner without adding Masala. We went with the Chicken Tikka Masala because my cousin was afraid of lamb. I asked for the dish to be prepared \"Asian spicy\" and that was a great choice. My lips burned but a sip of ice cold water comforted me with each spoonful of rice. I thought the dish was prepared well, I'm appreciated the fact that the dish wasn't polluted with too much spices.  Some restaurants make their chicken masala so thick and overwhelming that I smell extra herbious the following day at work.  I enjoy good food but prefer to keep it to myself, I can't stand it when I stink the following day after consuming dishes that are prepared with too many spices. To wrap up the evening the waiter offered us Gulab Jabun.  I would have given the place a good rating anyways but the Gulab Jabun makes me confident about bringing others to Bombay Olive.  One minor complaint was that I had to flag down the wait staff for some more rice. It could have partially been my fault; I was hungry and devoured the rice too fast.  Regardless the wait staff didn't make a big stink about bringing me more rice nor was I charged for extra rice."], ["Casey T.", "The Best Chicken or Goat Curry and soft moist Garlic Naan in the area! The restaurant is small and still looks like an old Ihop but it's very worth trying."], ["Carlos A.", "I really enjoyed the chicken tikka masala and sag paneer. Their naan was also very tasty. Food was a bit on the spicy side for my taste but otherwise I thought it was very good."], ["Maki S.", "The hostess/server had to of been the nicest in Connecticut I've ever met. Let me make myself clear: I don't usually like service in this state. This woman had the most personable presence and bright smile. She ushered us to our table quickly and gave us two helpings of the chips and sauce.I ordered lamb masala, and as I've mentioned in other reviews like food that I expect to be spicy to have a nice kick, and this dish didn't disappoint! I highly recommend it.There was a minor emergency, which I involved the waitress and a server who responded quickly and she was so polite and apologetic that I had to leave before finishing my meal, even after I assured her the food was delicious and that something came up. I can't say anything about the buffet, since I ordered from the menu, but I recommend this place for it's ambiance (romantic, intimate, and casual), it's servers (attentive, efficient, and FRIENDLY), as well as it's food (fresh ingredients, nothing overcooked or under-spiced)."], ["Angela G.", "I have gotten takeout from here a few times - I've always really, really enjoyed the food, and all the staff I had interacted with has always been really nice...but after my meal last night, I woke up at 3 AM with horrible food poisoning. I've been miserable all day. I'm so heartbroken because I really loved this place, but I won't be returning."], ["Sofia H.", "My fiancé and I met up with a friend for dinner here and I was pleasantly surprised with how good the food was.I had the sag paneer and garlic naan and it was very filling for me.Service was a little slow but it was worth the wait."], ["Shannon F.", "Bombay Olive has delicious north indian cuisine. Their menu has great variety! On Saturdays and Sundays they offer a lunch buffet which is perfect for the individual who is new to Indian cuisine. The ambiance is warm and inviting, making it a perfect spot for date night. The service is at times a tiny bit overwhelming but over all friendly."], ["Patrick D.", "This review is for their takeout/delivery only...I could not tell you what the inside of Bombay Olive looks like. But some Indian American friends swore to us that this was the best Indian food in the Hartford area, so on a somewhat nasty, snowy night, we got a few things delivered, and it was all delicious. Delivery was pretty quick, too. A warning: If you challenge the chefs to make it hot (Indian hot, not American hot), they will accept your challenge...and you will pay."], ["Lynn R.", "Had dinner here last night on the fly. Delicious Persian lamb kebab and spicy eggplant.  Cozy atmosphere. Friendly professional service. Will go back soon to try more menu items. HIghly recommend."], ["Anthony P.", "Decided to come back and try the food. I ordered Mango Lassi, regular Naan, Pistachio chicken Korma, my friend ordered Chicken Byrani and we got Galub Jamun for dessert. My friend and I were the only ones seated there so things were pretty good for service. I liked that the glass for my mango lassi was cold and the drink tasted pretty good. The regular naan was buttered, it tasted good to me too with its flaky crispiness. I asked for them to make my Pistachio Chicken Korma above medium (so it was supposed to be on the level of \"Hot\") so they did a good job on that. I thought my chicken Korma to be pretty good. Spicy, flavorful, tender chicken and rice with no clumps. I tried the Chicken Byrani. It was bland. It was my first time having Galub Jamun, a cheese ball dumpling laying in dry sweet milk. Yum Yum Yum. I'm not going to say it's better than my favorite place, Priya, but I can't complain. it satisfied me well."], ["Alexandra S.", "Here's what I always say about bombay olive: they have my two favorite kinds of food: indian and persian but they aren't the best I've had of either.and we went for the second time recently - my sentiments hold true.I had some indian the first time we went (2 years ago) and some persian.let me start with the good:THE VEGGIE KABOBS (option with persian rice dishes) ARE OUT OF THIS WORLD AMAZINGThe Naan is spectacular and it comes with EVERYTHING. (they don't skimp - you order 4 entrees you get 4x as much naan!)Shereen Polo is delicious - but the orange peels are sometimes pretty long!We got the mizra polo without egg - pretty good.The baghali polo (traditionally this is dill rice with lima or fava - they do fava here) is good.....but the dill is basically absent from the dish. it made me so sad. (not that the menu said dill on it.....but I grew up with this dish!)I would like to say that the weekend buffet is pretty cheap and I keep meaning to get over there for it!"], ["Jason M.", "I think Bombay Olive deserves a fair, well-earned update here. Just had the lunch buffet today, and it was really quite good. The Chicken Tikka Masala was tender, the dal (lentil) dish was very creamy and tasty, and the overall variety of options was very nice, including Tandoori Chicken, salad bar, and multiple vegetarian dishes...Even when there was a minor slip-up, i.e. running out of naan, a server came around the restaurant with a fresh batch and served everyone personally. A nice gesture during an otherwise chaotic time.The only beef (excuse me, lamb) this time around was one of the servers, who was a bit snippy. Our party of five was accidentally given two bills for the same meal. When my father very calmly and kindly alerted the server that there was an error, the server's mouth immediately exploded with a barrage of \"OkayOkayOkayOkayOkayOkayOkayIt'sNoProblem,\" as if he was being mortally accused of fraud...Dude, we had to say something about it, don't take it personally. Good buffet though. You can expect to spend $15 a person, tip included, non-alcoholic beverages included."], ["Staci R.", "Heard some great things about this place from Indian coworkers, so decided to give it a try,  Saw that there was a weekend lunch buffet, so a coworker and I decided to stop by. For about $12.95 you get a choice of several vegetarian and meat entrees, desserts, appetizers, soups, soft drinks, coffee, and tea. Noticed some veggie samosas (my fav) so grabbed a few long with some vegetable soup, tandori chicken, curried lamb, basmati rice, dal, matter paneer, and several other dishes LolThe soup was pretty good. The samosas were not. I was pretty disappointed in that since they are my fav. The rest of the food was pretty good;seasoned well, not too spicy not too bland. My coworker had been there before and said although the buffet options were Ok the entrees are 10x better. Will be going back, but not for the buffet."], ["Katie M.", "Really good food selection! Real authentic Indian cuisine, definitely order a mango lassi to wash down the (spicy) but delicious meal! The buffet is the best for your $$$. Also very good rice pudding!! Will be going back!!!"], ["Dhruva B.", "Great service, nice waiters. The food is so tasty and they maintain that consistency. Atmosphere is also pleasant.Their soups are delicious in addition to their appetizers and entrees. They have pretty decent variety."], ["John D.", "Bombay Olive is our favorite Indian spot. Best in West Hartford! Chicken curry. Yum! Palek paneer, naan & lamb rogan josh. All fantastic!"], ["Seana S.", "We come here occasionally for the lunch buffet.  It is great.  We have come here several times after a night of drinking, and nothing cures my hangover better than a mango lassi and pigging out at this buffet.  They have delicious lassis, soft and buttery naan, and a nice variety of buffet options.  For dinner I have had the Navrattan  Korma, which is wonderful.  Consistently good quality, friendly staff, and a lovely atmosphere.  I am always up for coming here to eat."], ["Terry L.", "My husband and I enjoyed our dinner here.  It was a Monday night, rather late, so there weren't many customers.  But the service was attentive and we didn't feel rushed.  The food was really tasty and the portions generous.....we brought quite a bit home and the leftovers were delicious!"], ["Joe B.", "We have lived in CT for about 6 years now and continue to try Indian restaurants we haven't eaten at yet. Finally made it to Bombay Olive for lunch. The staff was very nice and the restaurant was nice. Everything else was not good. Every dish was dried out and over cooked. We have tried a lot of places and have to say this was by far the worst we have had."], ["Binly S.", "First time eating Indian. Heavy cultural influence upon entering but still very friendly to whomever hasn't tried it yet. I'll be back again"], ["Lydia L.", "One of the bestest things about yelp has been for me the opportunity to meet new people I would not have most likely crossed paths with in my day to day life. We all \"meet\" many people on yelp but it is unusual to make a connection with someone we have never actually met. One such person who has been along time yelp friend has been brian s. With his well crafted and interesting yelp reviews to his photographs to his unique style in many ways he has been a yelp mentor to me. So when The L. and I had the geographic opportunity to have lunch with brian and his wife, C., we did just that.Going to the South Shore we go by way of Hartford so when I saw that brian had reviewed Bombay Olive I bookmarked it for the future. I had not realized that WH was really far, after all The L and I could have gone through Providence which would have been closer for them, but we were very appreciative that they went out of their way and took a chance that we would be fit to dine with. ;)))Distance aside, the B.O. was a good choice. It is housed in a former IHOP which gave it that sense of historicity that  makes it remarkable and frankly, I love Indian food when done right. Bombay Olive's buffet with its many veggie and some vegan choices suited me fine. I particularly liked one of the dishes made with black eyed peas which is something I do not see every day at Indian restaurants.And I appreciated that the waiter pointed out the naan was made with eggs and dairy and brought me roti instead. Who does that? While the food was fine it was the company that was 5 star that day. :)))"], ["Prince V.", "Service was good. Didnt like Chicken VIndaloo. Too much tomato puree... But Lamb Kabobs was very good. Very flavorful and tasty. Garlic Naan Bread was tasty. Entrees are approx 15 bucks per entree. Will go back again."], ["Brian S.", "From pancakes to paneer The Bombay Olive restaurant is in the building that stood in this location for years as an IHOP. Of course the building still sort of looks like an IHOP, with the steep roof and distinctive shaped front, but the pancakes are long gone. Bombay Olive is a Indian and Persian restaurant, with a few Nepalese things throw in. Quite an interesting menu with lots of things I've never seen in a regular Indian restaurants. I've been here many times and I'm still exploring the menu. I haven't gotten around to the Persian food yet, but the rest is sure good. All the veggie dishes I've tried such as mushroom shabnam, navratana kroma, malai kofta, palak paneer and aalu chutney were superb, with each flavor standing out and obvious. The masala are known as royal dishes and the chicken tikka masala is fantastic with just the right amount of creamy sauce. I often judge Indian restaurants by their breads and the naan here is great, without any of the toughness found in other naan. One naan in particular, called peshawari naan is filled with nuts and delicious. The Poori is extremely fluffy and light, almost seems like it will float away and is a joy to eat. Between the hours of 11:30 and 3:00 Bombay Olive offers a lunch boofay. I love boofay's, especially Indian boofays and this one is great. Of course you don't get the personalized service and the wide variety of dishes you get during the regular hours but you sure get a whole lot of good Indian food. Bombay Olive isn't the place to go if you are looking for fancy ambiance and snooty decorations. After all it's still looks like a IHOP. But for great Indian food, a very cool and different menu and nice boofay, it's hard to beat."], ["Ashley P.", "The food here is delicious. My favorite is either the lamb korma or the sahi paneer. Spice control is always on point, meat is always tender, paneer is always fresh. Atmosphere is quiet, cozy and quite intimate. Staff is not over bearing; they are very quick and quiet without being overly fake and smile-y (which I can't stand), while still remaining attentive. They always have great coupons that make it very, very worth it!  And the naan..... So freakin good!!"], ["Ryan M.", "Bombay Olive did not woo me on curb appeal, nor did the disorganized service one consistently receives here. That said, the food is served with consistent excellence, the service, even if not perfect, is always friendly and helpful, and the atmosphere is actually exactly what you want from a casual restaurant, whether for a date night, group of friends, or just a quick bite. I think I have eaten almost all the mains including tikka, saag, jalfrezie, and an assortment of vegetarian dishes. Notably, the navratan korma, an assortment of veggies, was staggeringly good. The paneer here is also delicious in every dish I've tried. They check all the boxes for me: service, food, atmoshphere, and the overall experience. Bombay Olive is not the most or least expensive of the area's Indian restaurants, but it is probably the least fussy of the good ones. I highly recommend it."], ["Frankie Goodness Y.", "Ordered takeout for lunch at around 2pm on a saturday having never eaten there before. They delivered in 30 minutes.Order:Puri (1 order, 2 pieces) Nepali chicken lollipops (1order, 6 pieces)Lamb vindaloo, extra spicy (comes with basmati rice)Papad (i didn't order it... I don't know if they messed up and threw it in by accident, or if it comes with every order. It says its $2 on the menu, but i wasn't charged.)Disclaimer: I am Oriya. You should understand that my opinions and preferences may not necessarily reflect an average American's taste or expectations of indian food.Puri: Ehh, a bit heavy. But that tends to happen when they sit for a few minutes. They wrapped it in wax paper and aluminum foil to keep it warm and hey seemed to have steamed themselves in the packaging. Puri needs to be eaten within 2-3 minutes of coming out of the fryer, when it is still fluffy and inflated, in order to be enjoyed plain. Pretty good for grabbing the vindaloo though. 100% authentic, and better than some puri I've had in India. Bigger too.Nepali Chicken Lollipops: The lollipop preparation was beautiful to look at, but its kind of gimmicky and i personally could care less about presentation. Lollipops tend to push the cartilage and tendons down into the muscle; which is fine if you're hindu, cuz you'll eat that shit, but it might be annoying if you don't like those parts. With that being said, I fucking love these things. They looked like tandoori chicken, and i suspect they were cooked in the tandoori oven, but they had a very unique flavor. They're bright red and look spicy as hell, but they're really not; not at all. I will definitely order these again, and i suggest you do too. They're perfect for people eating indian food for the first time. Lamb Vindaloo: When i ordered this, the guy on the phone asked me how spicy i wanted it. I Lol'd and told him (in hindi) that i wanted it Desi spicy. This dish should never be served anything other than extra spicy. The flavors won't jive right. Plus, the spiciness serves a very real purpose historically. This dish was created extra spicy to cause the person eating it to sweat. The sweat then cools the person and causes their core body temperature to decrease. Believe it or not, hot foods will cool you down on a hot summer day. So as for the flavor itself, there was a bit too much vinegar. It reminded me of achara. The (boneless) lamb was good, but there weren't enough potatoes. It was also very oily... i am used to it, because this is the way you get it in India, but i was not expecting it. Its probably just the lamb fat that was rendered in the gravy, but still. I dont think most americans would like it that greasy. I think it would have been better with bone-in mutton and twice as much potato. Basmati rice: Amazing 10/10. I wish i could have rice like this every day. Very fluffy, very light, and a slight hint of butter, although im pretty sure they didn't add any. This was the best white rice i have ever had at any restaurant on this side of the world. Period.Papad: i didnt realize this was even in the bag until i was about to throw it away. It stayed crispy for at least 4 hours and was great with the onion chutney. Im pretty sure this is the same brand my dad buys at the indian store. It was a nice bonus. Reminded me of the stuff i used to have when i was little. Also, it was free. In short, order the nepali chicken lollipops and make sure you get basmati rice with whatever you order. The lollipops, rice, and free papad bumped this place from a 3star to a 4. Because the vindaloo wasn't that great."], ["Keith B.", "With so many other great choices for Indian food, I just can't suggest Bombay Olive.  The lunch buffet is cheap but the food is not good so you get what you pay for.The chicken curries are dry and overcooked.  The naan is bland. The tandori chicken isn't special.  There is vegi lomein if you are randomly looking for chinese food. This place was much better when it first opened but over time it has become watered down to cater to the masses."], ["Mark F.", "Excellent service.   Very friendly staff.  All the naan options are very tasty.  Tandoori mixed grill was huge, enough for two.  All portions are very generous. All dishes are well seasoned and you can request they turn up the heat on most dishes."], ["Jeff F.", "If you need quick food off of 84, this $12 buffet will do the trick. Solid option."], ["Peter N.", "I am from Southern California, hone to the first Little India and the largest Indian population in the U.S., so I know the cuisine well.FOOD:  the garlic naan bread and mango lassie were very good and the goat curry had a rich, tasty flavor.SERVICE:  was friendly and attentive.LOCATION/AMBIANCE:  the interior is well laid out and fairly roomy.  It was also fairly clean.VALUE:  it was a little on the expensive side, but many Indian places are for dinner.  I'm certain their lunch buffet is a good value."], ["Caitlin A.", "Our favorite Indian restaurant in CT! Actually, anywhere. Sahi paneer is amazing and they have THE BEST garlic naan I've ever had (and I've had a lot of garlic naan in my life). service is always great, they recognize us and welcome us back. Last time we were there they brought me a free mango lassi. Love it here!"], ["Anon Y.", "I have a favorite Pakistani restaurant in Albany (Aashiana's). I compare everything else to it, which perhaps is a bit unfair since noone can compare. I'll try to ignore it for the purposes of this review!We arrived at 3:15, the buffet ends at 4. Around 3:45 they started asking us (twice) if we planned to get anything else from the buffet, particularly the salad and dessert area of it. Felt rushed. They should at least wait until 4 to do this.Aside from that, I like the cool little metal cups and all the vegetarian options. They told me the goat is halal, so I had some and it was good. There was unfortunately no plain rice option on the buffet. Our waiter did ask us if we wanted some, to which we responsed yes, but he forgot to bring it.Everything does seem seasoned with the same seasoning mixture and to the same degree. I hoped for a bit more variation.But the place seemed clean, the food good, and the gulab jamun (chickpea flour dessert balls in syrup) was served warm and seemed softer and tastier than those I've had elsewhere. The waiters were warm and attentive, even if they did seem a bit pressured to close down the buffet.I agree with others that a water refill didn't happen for me."], ["Ronald S.", "this is another one of those places, you read the reviews and a lot of people say it wasn't very good.. so i guess that is why we had avoided it for so long. we were in the neighborhood and hungry, so Bombay Olive was on our radar even with the few bad reviews we decided to check it out for ourselves and guess what - it was pretty good! the menu isn't your plain Indian fare, it has that nepalese bit in there for good measure and variety. Samosa Chaat was good, larger portion than most places, not too spicy but still delicious. My Paneer Tawa Masala was good, i asked for spicy and it wasnt very spicy (again). but still good, rich creamy pepper-tomato-cheesyness.  Naan was good too. Worth checking out if you are looking for decent Indian food and maybe want to try the Nepalese options.."], ["R. N.", "Been there for the lunch buffet and was happy with the selection.  Also swung by late at night close to closing time to get food for take-out and they were really friendly about it.  I'd go more often if it was more affordable, but will still be back again.  =)"], ["Luc V.", "This was my second time trying Indian food. The service was great and they always make sure your drinks are full. Try the chicken madras and you can't go wrong with the chicken vindaloo."], ["Francis M.", "Food was slightly above average .service was terrible do not go on busy Saturday . Or do take out seems like they were keeping up with that.1:00 to get served"], ["Linda F.", "What a disappointment....sorry I went to this restaurant. I ordered fish madris and it was very bland, no coconut or spice taste whatsoever.  The menu offered fish vindaloo but not fish madris, the server said it would be no problem to order the madris with fish.... but failed to tell me that I would be charged far more than the menu stated because they call fish,  \"shrimp\" on the bill....this is how the overcharge was explained  and it did not make any sense.  What I did get was maybe five small pieces of white fish in a very bland dark red sauce.  The place has a nice atmosphere with nice soft music and friendly service but they definately need a new chef!  I know what madris taste like and this definately was not good!"], ["William M.", "Bombay Olive is decent, Nothing spectacular - Convenient at bestFirst off - They deliver (which is always a plus) - I rarely go to Bombay olive to eat in or eat at the buffet (although I have done both in the past), I normally order for either takeout or delivery which is normally pretty quick. The food quality of takeout vs eating in is about the same, nothing really special about either but if you are craving some quick Indian food and live near West Hartford it's in a convenient location. Now for the bad.... The last 3 or 4 times I've ordered from Bombay Olive I've felt like they were blatantly trying to rip me off... I call and order delivery from this place about twice a month - Their website states that they have a $20 delivery minimum - About 2 months ago I called to place an order (my regular comes to about $21 after tax) I was quickly told that minimum for delivery was $25 and they have never delivered for under that.... Keep in mind that I've ordered from this place 2-4 times a month for nearly a year prior to this order. I argued a bit with the attendant on the phone and decided to order from somewhere else that night.On another occasion I was told the same thing, that the minimum was $25 and that they wouldn't deliver for anything less, Craving Indian food I agreed to order the Naan basket - I told the person on the phone that I was going to pay with my card and that I wanted to use a coupon, he said ok - The person took my information and I reminded him about the coupon, His response was \"No coupon, I already charged the card\"................................................... When my food came (rather slow ~45 mins that night) I signed the receipt without giving a tip and handed it back to the driver, He immediately took it and questioned me \"No Tip?!\" I responded that not only is the delivery supposed to be free but the other man who took my information refused my coupon and overcharged me. To top it all off the Naan was totally under cooked and inedibleI will probably not order from Bombay Olive again, at least for delivery - The food is decent, the service is meh"], ["Sayya A.", "At my sister's recommendation I tried this place out. I left wondering if we ate at the same restaurant. But reflecting back I know we have different taste so I understood why I didn't care for this place. I'm not a fan of Middle Eastern/ Indian food. I never know what to order and I can never decide if I like it or not. I did like how the restaurant was decorated but since I wasn't visiting a museum I can't say I will return to look at the restaurant design. Wait:They take reservations but I didn't have one. No wait at all. I went for dinner and was in and out in no time. Food:I had the chicken tandoori and chicken masala. I thought the food was on the dry side. Ordered a side of roti. It tasted like the ones you find at the Indian grocery store and heat up yourself. I'm sure that is what they used. I didn't like the food and I don't remember much of the experience. The food wasn't that great so I won't go back. Price:The atmosphere was nice and the price was right. Since I didn't like the food I'm not willing to pay their asking price. Service:Drinks filled when needed and the server asked us how our food was at least twice. Parking:Private lot."]], "Rasham Restaurant": [], "Desi Zaiqa": [], "Taste of India": [], "Naatiya Indian Restaurant": [], "Little India": [], "Bollywood Grill": [], "MMumbai Spice Restaurant": [["Gilad P.", "Very spacious restaurant, with a pleasant authentic atmosphere. Even the signs on the restrooms were pictures of Indians in ethnic clothing. Restaurant is 2.5 years old, the actual tables and chairs area is only 2 weeks. Food was delicious, yet slightly expensive. Plenty of great options, for vegetarians too. Yet quite a unique place - we had a pav appetizer which was like a mini vegi Indian hamburger with a unique coconut Garlic spice on top. Clean and spacious and owner was very eager to make sure we enjoyed the meal . Main dishes were vegetarian - moderately spiced as they promised  . Would highly recommend this place !"], ["Jennifer H.", "So to sum it up, by far my favorite Indian restaurant around.  I love when we head to Rocky Hill for dinner!  The owner is so welcoming and truly shows his passion for cooking.  The food is phenomenal - you have to try the vada pav.  Quick tip:  the butter chicken and the chicken tikka masala are almost exactly the same.  The difference is that the butter chicken is smaller strips, while the tikka masala are larger chunks - both are equally as awesome though so you can't go wrong.  They have the BEST breads, so no matter which one you select you will not be let down. The place is a quaint take-out restaurant with a couple of tables for those who prefer to eat in, or traveled too far to take it back home (like us).  They serve your food on disposable plates with disposable silverware as expected with a take-out restaurant.  That said, while it sounds odd, they use quality disposable utensils which is always a plus.Overall, the food is great, the owner is very warm and caring, and you will surely feel satiated when you part for the evening.  The prices are reasonable, and you may even walk out with left-overs for lunch the next day.  Anyway you put it, you have to try this place.  I am confident you will thank me later!"], ["Carrie E.", "Delicious Indian food! Tikal masala is the best I've ever tasted. The chicken is moist and has soo much flavor. I gave it 4 stars because portions are on the smaller side. It fills me up, but my husband is usually still hungry. A great go to takeout choice."], ["Firdous F.", "They do not serve Halal meat, be aware they don't have certificate also, Only good,for,vegetarian selection."], ["Lance R.", "We were driving home from a weekend in the Boston area when we yelped on the highway for a good place to eat.  Mmumbai came up and we actually went an exit too far and came back for it.  Well, we were not disappointed.There are only 3 tables, so obviously this is a takeout place.  Nevertheless, we took up one of the tables and had a fabulous meal.  We had Alu Gobhi, Baigan Bharta, Shrimp Biryani, Garlic Naan (that I can still smell), Lamb Vindalu, and Butter Chicken.  Everything was perfectly spiced and cooked.  The flavors were distinct and terrific.I would go out of my way to eat here."], ["Jimmy B.", "Gross terrible food. Came in once, they were staring at me the whole time. Mostly because I'm white and the other people were Indian."], ["Ashok G.", "A decent Indian restaurant with several options to choose from. In my recent to-go order i was searching for typical Indian flavors which was totally missing. The dish (chole & bhaji) was very bland and not up to my expectations. Wish it was more authentic and tasty !"], ["Maggie K.", "Was in the area last sunday so happened to pick up some food. We ordered Veggie kati rolls n vegetable manchurian. Both were disappointing. The kati roll was so small n priced 6$ odd, it was not stomach filling and the dipping sauce was a huge disappointment. The sauce was bitter. The filling inside the rolls were just cottage cheese n nothing else.The manchurian was burnt on the sides n had loads of salt, just could'n eat. Guess this place has gone down the hill....."], ["Michael A.", "This place is about a mile and half from me, and my girlfriend and I tried it once, and now order from here twice a month.It's basically take-out only, although there is a very small eating area in the place. We've tried some of their Indo-Chinese, and the Egg Fried Rice is awesome.  Fresher tasting and much less greasy compared to your average fried rice take-out from a Chinese restaurant.  The Chicken Curry and Chicken Tikka Masala are our favorites, but we've also tried the Chicken Vindalu, Chicken Manchurian, and just about every bread they offer.    Everything is good and of high quality.  The Samosas are a good appetizer as well. The chicken is real white meat chicken, and they can adjust the spiciness of the dishes at your request.It's a little overpriced for the portion size, but again the quality is there.  I would recommend you ask if your dish comes with rice, as not all of the dishes come with it.  Out of eating here maybe ten times, we've only had one experience where the food wasn't up to it's normal quality and was mostly sauce with little chicken.We will definitely continue to order from here."], ["Sucheta D.", "If you are looking for the best tasting Indian food in the vicinity and far and the true Indian hospitality, then this restaurant is in its quintessence!I would definitely recommend the ones that we have tried and like :)Veg: Dal tadka,dal makhni,Veg Jhalfrezie, palak paneer, paneer makhni, samosa chat,vada pav, and (veg Manchurian, paneer chilli- IndoChinese)Non veg:  chicken  sixty five, spicy chicken wings,pahadi kabab, murgh malai kabab, butter chicken,chicken tikka, chicken,goat Malvani,Kerala pepper chicken and(chicken fried rice,chilli chicken, chicken Manchurian-IndoChinese)The secret,not many customers probably know is  you will find the Best IndoChinese food here ;both veg and Non veg!!!And off course , the three level of tolerance to the spices they ask for , makes it perfect for a group/ Family dining!Congratulations and Best wishes on the  beautiful new dining  restaurant that makes  our visit to MMumbai Spice complete!And yes, we didn't eat all that food at once:) , it's over a period of time, on numerous occasions ...Well... Now we don't even wait for occasions, we just GO there !!!  Bon appétit!"], ["Michael C.", "First of all, Mmumbai Spice is the only place to get vada pav and pav bhaji EVERY DAY in this area. There is a veg south Indian restaurant in Middletown that serves these dishes on weekends, but not during the week. That being said, anyone who enjoys these Maharashtrian delicacies must stop by Mmumbai Spice asap. The owner, Shekhar, is a Mumbaiker himself and was surprised that a white guy knew what vada pav is.I am veg so I haven't tried the non-veg food here, but I can say that the veg food is lovely. For the size of the portions, I'd say it's reasonably priced. The fact that it's open until 10PM is great as well, since many other restaurants in the area close earlier. Good stuff, yeah. Ekdum top class."], ["Holly N.", "We found this place while visiting from Denver. Great food at even better prices- the depth of flavor in the tikka masala and fish curries was incredible! Please support this new local business- great food, excellent atmosphere, and friendly service."], ["Michael D.", "Solid Indian food, it's Western friendly so not too spicy.  My girlfriend and I first went here because we had a Groupon-type deal.  She has never had Indian food, so I think her thumbs up means more than mine.  Also, they neglected to include the naan we had ordered.  We called to inquire, and they offered to deliver it to me.  When the delivery guy showed up, he gave us a free desert.  I thought this was a really nice gesture."], ["Saravana R.", "Awesome restaurant with diverse menu for both vegetarians and non - vegetarians. Liked thier vada pav and lamb briyani very much. Even though they opened recently in Jan 2014, the staff were very friendly and professional. May cost around $30-50 for a couple."], ["Paula P.", "A tiny little hole in the wall restaurant in the side corner of a strip mall, you wouldn't think much. This isn't a white tablecloth restaurant, but there are a few tables if you prefer to eat there instead of picking your food up. Most important and simply put, the food is absolutely fantastic. The ingredients are of excellent quality; tender chicken, rice done just right, and spices added so they enhance rather than dominate the dish. Everything is made to order and extremely fresh. Recommend highly!"], ["Mickey Z.", "The website is very easy to use and informative and apparently you can get delivery thru a third party site as well. I ordered take out and it was ready on time. The food was great and the inside of the shop was very clean. Lamb saag, chicken tikka masala, the long peppers app and the lamb samosa app and poori, the whole wheat fried bread- all were great. Entrees came with basmati rice. Only negative is they don't offer brown rice. Overall awesome and will definitely be back."], ["Saadiah F.", "Surprisingly delicious Indian food in a somewhat random strip mall location.  I happened upon this place when driving between NY and VT recently and boy was I glad to discover it.  If you are passing through, it is right off 91 so very convenient (although if you're picking up takeout, you may want to call 20 minutes ahead to give them time to get your food ready).  Eating in is also an option, the place is small and quite basic, but pleasant and clean and the owner is very friendly.  Everything I've tried from here has been tasty but the tandoori menu items, particularly the Achari Tikka, are particularly good.  Large servings too!"], ["Chris L.", "Happened on this place while on our way to see the US soccer team get demolished by Spain. Feeling peckish we stopped off at this little hole in the wall joint. Excellent value for money - very clean. Hyper attentive owner - but best of all.. the food. Samosa Chaat - among the best we have had - nice and tangy! I had Lamb Saag - great tender chunks of lamb in a nicely seasoned sauce with fresh ginger and tomatoes. My vegetarian son had the Palak Paneer - though was spoilt for choice looking at the very extensive menu. There are a couple of tables for eating in (10 people max) but mainly they cater for the take-out crowd. Food already placed in takeout containers even if you stay to eat. Portions are larger than average - definitely have extra to go.Highly recommended!!!"], ["Bryan G.", "This is such a gift to the area!!! Decadent \"Curry-in-a-hurry\"!!!  Amazing!"], ["Nathan P.", "Great, inexpensive takeout. Had a phenomenally garlicky naan, and great chicken tikka."]], "Cosmos International": [], "Ronak Restaurant": [], "Royal Masala Restaurant & Bar": [["Basanta T.", "This Resturant has the best indian food  that I know.. U have to try  chicken madras and chicken tikka masala.."], ["Barbara B.", "We just had a lovely Christmas Eve dinner,Our waiter was very sweet and we had no problem using our Groupon. We shared the lamb vindaloo chicken Tikka Masala and Saag. All dishes were fresh and tasty. The naan was perfect. A little expensive and the servings were not huge but we would recommend this restaurant."], ["Jonah C.", "I went there for lunch with my co-workers. They have lunch buffet at a good price ($9.95). The food and the service were good for this price. I would probably come here again."], ["PK P.", "Ohhh Quantity was so small,  you need 4  or 5 curry's for 2 to 3 people, its  very small,There are many good one in Rocky hill and this one is bad"], ["C T.", "Went there this past weekend and the food was amazing! Where i live we have several great indian resturants but this one was awesome. the service was great although, we were the only people in the resturant at the time. at any rate i highly suggest this place along with ANYTHING on their chef's specialty menu. you wont be disappointed."], ["Penny M.", "O.K. The restaurant is under new ownership and it is a definite GO TO again....so I retract my review of 2007, which was, sadly, rather scathing.  My friend Brenda and I dined here prior to attending the Symphony at the Bushnell in late November (I am very much remiss in my posting.)  Sadly, the place was rather empty.  But we were impeccably attended to by the owner.  We asked him for recommendations (the menu is rather expansive) and we took his lead and were not disappointed!  Everything was fresh, tasty and downright Yummy!  The Garlic Naan (also recommended by the owner) was particularly spectacular.  I sent my husband here about two weeks after we went and he was equally impressed.  This is a definite go to!  Add it to your list!"], ["Sanh A.", "I ate here once awhile ago. I personally was not impressed. The inside looks dated.  The parking sucks. I had the lunch buffet and was not impressed with the offering. I generally like Indian buffets because I'm not an expert in ordering something besides Biryani rice.  I went in hoping that the food would be filling I let disappointed. I didn't like that they didn't have much out and the presentation was not pleasing to the eyes. I guess for $10 what can you say besides I'm keeping my $10 and going elsewhere."], ["Cliff H.", "Under new management. New interior decor. Jazz nights every couple weeks. Food still a bit pricier than it could be but overall a great restaurant that is frequently overlooked due to its proximity to the more upscale and pricier Peppercorns. Masala remains a great, more affordable alternative for folks looking for a decent dinner before a Bushnell show or Charter Oak Center performance. Valet parking is also now available on weekend nights, though parking anywhere near here on Main, Capitol, or Buckingham is perfectly safe and of little concern for most."], ["Lauren H.", "The service here is terrible. The first time we came they wouldn't take our Groupon because we only reached the total when alcohol was included. The waitress (short woman with black hair and an accent) was extremely rude and wouldn't even charge is a few dollars extra to give us the Groupon. We came back 2 weeks later and spent the full amount and the same rude waitress claimed the Groupon had already been used and wouldn't give it to us. We had to cause a huge scene for her to honor the Groupon. Although the food and atmosphere are decent, don't waste your time and money with high prices and bad service."], ["Bob S.", "Stopped for lunch to try the buffet and found out that they are not doing that anymore. The owner listed several reasons when people asked where the buffet was. I was hungry, place smelled awesome, was super clean so I sat down. Got the vegetable pakora to start. Looked and tasted 5 star. All of the lunch specials come with free rice and naan, bonus. I went the boring route and ordered curry chicken (hot). Again, food looked and tasted great. Only wish the spice level was hot instead of medium. Got waited on by the owner since the girl he hired was late. I am a fan and would recommend this place to friends."], ["Anna C.", "Clearly, the menu and management recently changed, but Masala is better than ever. Went with a group of seven, and the experience was flawless. Everyone loved his/her meal, and the waitstaff treated us more like family than customers. The palak paneer, panner korma, and Goan fish curry were also some of the best I have had in CT. Can't wait to go back and have more of that new and improved tikka masala!"], ["Maggie K.", "Oh my where is the old management?????? Loved the food when the old owners managed it. Dropped in one of these nights for dinner. I liked only the panner tikka masala (Appetizer). They have to push there bottoms a lot up!!!!!Time management has to improve and also the service.Disappointment!!!!!!!!"], ["David V.", "My wife and I were very happy with our buffet lunch here on a recent Sunday afternoon.  The lunch buffet is only $9.99 per person and you will not leave hungry.  There are not as many food choices as I have seen in other Indian buffets, but there is plenty.  The food quality is good, not outstanding, but good.  All of the food was fresh and tasty.  The service here is amazing and the staff greeted us and served us with a smile!  I highly recommend this place!"], ["Dave B.", "Quick and to the point --Food - very good.Service - polite but a little inattentive.Overall - recommended."], ["Jas C.", "I'm not one to critique Indian food because I am not too familiar with the food and whether one dish is better at x compared to y, but the staff, especially the owner, was amazing. I was able to have a small get together at a reasonable rate (around $20 something per person) and he went out of his way to make sure everyone was accommodated and went above and beyond to make sure everyone was catered to. The attention he gives to his customers demonstrates his commitment to providing a good quality meal."], ["Michael M.", "Honestly, I have to agree with everything the former reviewer said before her retraction. The food at Masala the freshest, and most flavorful Indian food in the Hartford area. They have a wonderful lunch buffet (great for the indecisive, experimental Indian food newbie), and excellent service to back it up.Give Masala a shot the next time you're in Hartford."], ["Stella H.", "I usually never bother writing reviews, but would like to get the rating of Masala where it deserves to be. I'm here on a project and am a resident of NY. I'd been missing Indian food until I found Taste of India in West Hartford, which is a fantastic restaurant; however, when I found Masala, I was even more happy. Their food is flavorful and doesn't rely on butter, cream, and oil, like some other Indian restaurants to get their food delicious. Their spices are just right and the food has kept me coming back - and in some weeks, multiple times during the work week!Try the Masaldar Papdi Chat (app), Dal Makhanwala (veg entree), and Hariyali Kofta (veg entree - - though the color is a bit off-putting)."], ["Marcie G.", "This place has gone DOWNHILL. What a shame. No tastings offered with those yummy spicy sauces that you ALWAYS get at Indian restaurants, Cosmo was awful, menu choices have been reduced, portions have shrunken and prices were raised. I didn't even get the dish I ordered but didn't complain as we were going to the theater afterwards and couldn't wait. Don't think they'll be around much longer. Too bad."], ["s b.", "We were here on a weeknight and the place was completely empty.  They only had one dessert option and were out of certain menu items we asked for.  The breads were well made, but honestly was under impressed with everything else.  Dishes were overly oily and they appeared to have used the same masalas for each of our entrees.  Not impressed with the food and although the restaurant appeared to be nice looking, it was clear that it was not very well maintained (cobwebs in corners and downstairs restrooms were damp and had a musty odor)."], ["Jason B.", "The 1-star reviews, I feel, are not deserved for this place.  We went on a weekday night, so we were the only two in the restaurant.  The service was friendly, quick and attentive.  They have some interesting drinks on the menu, like a mango caipirinha - as well as a good selection of beers (including Kingfisher and Taj Mahal if you want Indian brews.)We had appetizers - and the samosas were REALLY good.  The spice tray was neat and clean, and the spices were really fresh.  We both ordered Marg (Chicken) Tikki Masala and the sauce was really flavorful.  You can order things mild, medium, spicy, or Indian spicy.  I went with spicy, though if I return, I'll order it Indian spicy.We didn't have dessert.  The prices are pretty steep for Hartford (and for Indian food) but the atmosphere was very well set and the background Indian music was cool.We were really hesitant to try this place because of the low reviews, but now I am glad I did.  I would return - the food quality was worth it, even if it was pricey.  I'd really like to try their buffet for lunch sometime."]], "Taste Of India": [["Melissa G.", "I have never had any problems here.  The food is great, the service is great, and I bring people here all the time.  Their Chicken Tikka Masala is awesome and spiced perfectly."], ["Jason M.", "If you like indian food you will like this restaurant. Nice atmosphere too. Service was decent, just be sure to speak up about getting water/soda refills. Price was good too."], ["Julie V.", "I thought the food was just ok.  However, I paid for it in the middle of the night as I got really sick from it.  Not sure which dish it was from.  I suspect it was from a curry that wasn't made fresh that day, though I really don't know.  Of course, I'll never go back."], ["Umar Z.", "I have been many times for the lunch buffet and it is always great. I love the samosas and the onion chutney. They have a fair number of vegetarian options which they seem to change pretty regularly so it isn't always the same dishes on the buffet. The food is not very spicy but I assume if I ordered off the menu they would spice it more but the buffet always just seems like the best option to get a variety of things at a good price."], ["Bruce P.", "Our family loves Indian food. When we gathered in Windsor for Thanksgiving we were happy to see that there was a well ratted Indian restaurant here. We went to lunch at \"taste of India\" and were very disappointed. The food was not fully re-heated and was held slightly above room temperature in the buffet line. Certainly by one in the afternoon it should have been at a safe serving temperature. Several of us had digestive issues the following day. The food's flavor was only so-so and many dishes were bland and flavorless. Service, too, was lacking. There were three food servers at the restaurant and only two tables of diners so service should have been great. It was lackluster. The were unprepared to supply a menu let alone cook something from it. All in all a disappointment- the area must have better Indian food than this. We had several good meals from other restaurants here, in East Hartford and in Enfield."]], "Utsav Indian Cuisine": [], "Paradise Biryani Pointe": []}