{"Ficara's Restaurant": [], "Alfresco Restaurant": [["Lan K.", "This place is amazing!!! What a gem, especially in East Hartford. Who would have known. I never would have tried it but for Yelp (thank you thank you previous posters). Ok, now let me stop swooning over this place and get to the details...Tried two items off their specials menu - the Rhode Island Fried Calamari and the Crab Ravioli with Shrimp. They were both AMAZING. The calamari was incredibly unique - not the usual fried calamari with marinara sauce. It was also huge. The Crab Ravioli was stuffed with delicious crab, but even better, the sauce it was in was AMAZING. It was cream based which is usually too heavy for me but the flavor made it perfect. It also came with some steamed broccoli which was a nice touch. This was ten times better than any Olive Garden variety of this dish. It was one of the best cream sauces I've ever had. My husband had the steak and cheese grinder which he enjoyed. I had a bite and thought it was very good. Nothing extraordinary but it is certainly not a dish you'd try if you want extraordinary anywhere. He exclaimed in particular how much he liked the melted the cheese though. The service was great too. Seemed like the waitress was running the whole place herself and was doing an excellent job keeping up with my husband's endless soda habit. They also serve complimentary bread and oil. The oil had roasted garlic - amazeballs! Looks very nondescript outside and not in the nicest area but go inside - it looks great and clean. Now GO!"], ["Trish L.", "Horrible service. I ordered calimari, soup, fries and potato skins for delivery. They said it would be 45 minuets not a big deal. About half an hour later I get a call from them asking my address I give it to them, they tell me next time to give them a different street, guess I don't know my own address, and the guy then says do you see my car? No! I'm not outzide, no one rang my door bell, you didn't even say you were here, just confirmed the address. So I say ok IL be right out. I go outside the guy isn't at the door so I wait, I then see that he's still sitting in his car. The guy wouldn't even come to the door. I wouldn't have cared if he wasn't so rude. I gave him a 20% tip and he just huffed at me. I go insid3 and realize, they forgot half my order I call back tell them they say that they are backed up and that they can give me ceedit. I tell them no I want m order. So they say ok in a pissy tone and hang up. So now it's ten minuets before they close I just called then asking about my food. Said it's on the way it's really not that far from my house. So rude. I just wanted my food. That's all. Horrible service. Oh yea the food we did get was soggy."], ["Edzis U.", "Went there first time for lunch 3 weeks ago and came back 4 times since!!! Homemade ravioli is out of this world, I already tried chicken and mozzarella; duck; salmon; and caramellis that look like candy :) prices are very reasonable for homemade food. All entrees come with soup or salad and the soups are amazing. The original owner just took over the place again and they are remodeling a little bit and the place is becoming nicer and nicer every time we go there. This is one of the best Italian restaurants I've been to in a long time. Will be coming back a lot!"], ["Courtney P.", "We've been coming here for years - but since we're out of the area we only come when we're passing through. Bottom line - consistently delicious Italian comfort food at super affordable prices. Tonight - Fried mozzarella, chicken Parm, cheese ravioli and a meatball for my 6 year old. Nice house wine, fresh bread and a sweet and attentive server. Also apparently under original ownership again but same staff and chef. Al Frescos is a total gem!"], ["Ajay B.", "Excellent quality food! Pizza, grinders, fries are all top notch! Your regular everyday Italian dishes (lasagna, spaghetti, etc.) are amazing.But on top of all that, what impresses me the most about this place (and I've probably been here 50 times, literally), is that outside of their regular menu, they have a chef's specials menu which change up every few days and anything (and I mean ANYTHING) I've ordered off of this menu has been DELICIOUS!! You're getting the same quality entrees off the chef's specials menu that you would be getting at a well known restaurant in a big city... but at half (if not less even) the price! Atmosphere is so-so but the quality of the food is some of the best in the Greater Hartford area, maybe even the state.  Unfortunately not in the best location so not much traffic so I don't think the place is really that known... I think the majority of its business is from locals in the East Hartford Burnside area getting take-out.  That's too bad considering how great the food is here."], ["James D.", "Great food, great service.  Went with the wife and kids.  I got the scallop ravioli, my wife got the linguini with clam sauce, son got veil parm, daughter got chicken Alfredo.  All of these dishes were great.  Very generous portions.  We brought a lot home."], ["Andre D.", "Food was just \"OK\", not a place that I'll frequent."], ["Nickolas P.", "Standard italian grub, but its a great little/friendly family owned establishment.  The food is good, the service is great, and you feel good being here."], ["tony s.", "A lot has changed. Things used to be much better before. Pasta came out over cooked and dry, soup was lacking flavor. I've been coming here for years and it seems like they changed the whole staff overnight. Not a happy camper."]], "Hot Tomato's": [["Tim S.", "One of the best meals I've ever had was at Hot Tomatoes. We stayed in Hartford on the way back from Boston and figured we'd try dinner here (short drive from the hotel). I had the Chilean sea bass, and was hands down the best I've ever had. Cooked perfectly and the sauce could have been served to me in a cup I'd drink it. My girlfriend claimed her dinner there was one of the best she's had, so I know it's not just me. Have been trying to figure out a way to get back to Hartford just to eat there again."], ["Carisa S.", "So I took the food to go cause it took forever and a day to get. It was ok really didn't get to enjoy it maybe have to give it another try."], ["Towanda M.", "**Hot Tomato**~ bad management = bad reviews~Don't ever go to Hot Tomato with a $50 gift card, they will only let you use $10 of it and expect you to pay the remaining balance making you use the remaining $40 ~ 4 different times... I'm sorry I thought the whole point of a gift card was the fact that its a \"gift\" already paid for, why in the hell would I want to pay for a $60 meal in cash when I have $50 on a prepaid gift card! Such a great meal on my anniversary ruined by awful management {the service was good n very efficient}... I don't think I have ever been so outraged by the way management spoke to us as if we were an old couple hard of hearing, it was as if she had to have the entire block hear her \"try\" to degrade us... luckily for us my big mouth along with my husband's told that loud mouth little twerp off in such a way, I surprised myself in the end when she was beyond baffled and told us to just forget the whole thing and we were all set! Well thank you very much lady I guess calling the owner was a much bigger problem for you! Haven't you heard the customer is always right!"], ["Mikey H.", "We made the mistake of sitting by the bar. It was really noisy, but they have another dining area which is more quiet and more elegant. We started with the garlic bread, which lived up to the hype. It was delicious. Pasta was very good, especially with seafood.  Good service but double check the bill as they made a mistake on ours and others who had been."], ["Doug E.", "My wife and friends dined here last evening.  We arrived and were promptly taken to our table.  It was so cold!  I noticed that persons at the bar and even one of the staff was wearing a coat.  Fortunately the moved us - that's about where the good evening ended, we should have left.The waitress might as well been at McDonalds, no conversation, just get the job done.  We ordered an appetizer, eh, not interesting and lacked taste, and it came to the table too quickly - about 2 minutes.  Then we ordered our meals.  All but one of us left our dishes unfinished.  All of the meals were poorly presented.  I should have gone with my first instinct and not even touched the fish I had.  I'm still regretting it.  And I didn't even eat half of it.  Fortunately we did not order desert and left.  It's not the Hot Tomato's I remember from years ago.  The food was sub-standard, the services was on par, and there was no vibe.  It felt as if they were days from going out of business.  And admittedly , if they keep up they will be.  This dinner was a shame.  We wish the old Hot Tomato's would come back.  There are so many wonderful restaurants in the area.  It's too bad Hot Tomato's is no longer among them."], ["Andy Z.", "Not so much. It started with a flat, stale beer at the bar. I gave up at the dinner table when the \"must have\" garlic bread was cold. Over it."], ["Cridick G.", "This place is great. I had the chicken giovanni. The gorgonzola cream sauce was very thick and everything tasted fresh. I was very pleased. My friend ordered the chicken parm sandwich and that bad boy was like 16 inches long. Decent, but not great beer selection. I would recommend this joint to anyone."], ["Rachel A.", "My husband and I went to Hot Tomato's on a whim for lunch. GET THE EGGPLANT CAPRESE TOWER. It should be illegal for an appetizer to taste so good. His rigatoni bolognese was delightful, and my spasta pesto was delicate and delicious, although perhaps a tad more oily than expected. We will definitely be back to try different items as well, but we will ALWAYS get the eggplant caprese tower."], ["Arthur A.", "Avoid at all Costs. Three months ago I spent a long 24 hours in the hospital visiting a family member, we needed a break outside of the building and made a reservation at Hot Tomatos. We enjoyed a reasonable dinner, but because I gave them a phone number for the reservation, I now get endless constant SMS SPAM.99000: HOT TOMATO'S: Make your week HOT with dinner at Hot Tomatos! Show this text to your waiter for 1/2 OFF one appetizer! Available until 3/2899000: HOT TOMATO'S: Don't forget, MOTHER'S DAY is Sunday, May 12! We will be offering SPECIALS in honor of Mom. CALL NOW for reservations. 860-249-5100 4:12 PM I don't live nearby, I never gave them permission to use sell my information to a marketing company.  Business must be terrible if the are resorting to the same marketing tactics as male enhancement pills, and cheap Viagra.There are plenty of classier establishments to give you business too, that treat their customers with basic respect."], ["Raj M.", "My wife and I dined here for a weekday lunch recently.  We were seated in the quieter upper level in a booth.  I ordered the vegetarian (tree hugger) Panini, which was excellent but just the right size for lunch, which came with superb skin-on fries.  My wife ordered the pesto spaghetti squash, which was a huge portion.  Carried out the raspberry cheesecake for dessert.  I especially appreciated the special designation of a vegetarian section on the menu, and being told (without having to ask) that the soups were not vegetarian.Service was friendly & attentive.  Very pleasant outing overall, and impressed with the quality of ingredients & preparation.  Will definitely return."], ["Carrie K.", "The food is excellent. Don't hesitate, just go. Everything that I've had in the menu is enjoyable."], ["Rolf L.", "Went thewre for the first time the other day (June 2011) THe inside is completely different from what you'd think.  Large, long room.  We sat in the way back on the upper level.  Bar looked decent, but we were there for food.  I'll be back for you ever so soon bar.  Be prepared.  Ordered the meatballs which were tastey and served with a scoop of fresh ricotta cheese.  The only complaint I have is the same as any place serving Italian food, the sause and past can always be better.  But this place was good enough for a second visit for dinner.  Good in my book!"], ["C. H.", "Giant portions, good quality food. Chicken parm could feed a family!"], ["Ed A.", "I was in the CT area and I met up with a friend who lives up that way. We had dinner here, and I left pretty content. I had the chicken pesto with gnocchi - it was very tasty and filling. It was about $20, which was a little steep; however, the taste and the portions (surprisingly) made it worth it. Both dishes that we ordered came with very generous portions of pasta AND meat.Beers were pretty cheap too - $4 import bottles and $3 domestic bottles. They have outdoor seating so take advantage of it if the weather is nice. Only downside besides price is lack of parking in the area. There is a paid lot across the street for $8 if you don't feel like circling the block looking for a spot."], ["Evan G.", "I have been to Hot Tomato's easily two dozen times over my 7+ years living in the Hartford area.  After my first time in there, the manager, Jim, knew me by name.  Every time I walk in, I am greeted like he is my best friend, and always makes me feel welcomed.The most important thing you must do at Hot Tomato's is eat their garlic bread, it is a MUST.  I have been known to go in with my date and us each get our own loaf because it is so good.  When I go in for lunch, I typically get some sort of a burger or chicken sandwich, which are both under 10 dollars, fairly reasonable for the quality.  Their lunch time french fries are the best around (I request them instead of the steak fries you get with dinner), they are good a very crunch like I like them.If I go in for dinner I often will get a steak.  It is always cooked to perfection, and for the quality the pricing is great!  Whenever I do not get a steak I have been known to get a pasta dish, and whatever I get I have never been disappointed in.Although they do not require a reservation I always recommend it.  Even for lunch, they get you in much quicker with one.If you ask your waiter after dinner (not lunch, unless you had an issue), they will also give you 2 loafs of the garlic bread to go FOR FREE.  They come with easy heating instructions for the oven when you get home."], ["Yinghui D.", "Service was OKAY... The waitress looked tired and impatient, however to our surprise, she voluntarily helped us split our entree to share into two plates, which was a very sweet gesture. Rather extensive wine list. Trendy appearance from outside. Food-wise, the last appetizer on dinner menu \"antipasto\" was good; the entree of pork chop was totally, totally a disaster. I don't know what to say about the grilled pork chop. It was way too lean that I couldn't even cut through using steak knife. Tasted awful."], ["Meagan H.", "Our server was very friendly, although once the plates were on the table, he basically forgot about us.I ordered the Ragu, which was a dish described as pasta dressed with homemade marinara and ricotta cheese. There was maybe a tablespoon of ricotta in the giant bowl placed in front of me, and the marinara was mediocre at best.I was part of a large party celebrating the birthday of a friend. He had cheesecake for dessert, which we all sampled. I have never tasted a more unpleasant dessert. It tasted as though there was a full cup of salt in the recipe, the texture was crumbly, and the aftertaste was revolting.One of the members in our party ordered a lemon drop martini from the bar, which tasted like Pine Sol.All in all, it was a terrible experience and I will definitely not return."], ["Babak A.", "Great fresh moz here! my tuna steak was perfect. and the outside seating was a plus"], ["Su R.", "This is a very nice Italian restaurant situated right next to the bus/train station in Hartford. I had lunch here once which was very nice, and I'd love to try them for dinner if i lived in the area. A bit fancy in my opinion to be so close to the train station."], ["Amanda S.", "Good Blue Cheese Garlic Bread. Apple Walnut Chicken Salad was bland. Manager was very nice, server was so-so."]], "J Restaurant/Bar": [["Marleena C.", "Went here this past weekend for Taste of Hartford and is was SURPRISINGLY fabulous!! We were a group of 4, two of us did the Taste and the other two ordered off the regular menu. My husband and the rest of the crew said the calamari app was the best they ever had, I had the pear and gorgonzola salad, out of this world. The shrimp scampi dish I had was succulent. I polished it off with lemon sorbet and fresh berries, I wanted to flip the table over and scissors kick the rest of the people there it was so good. Service is AWESOME, very fast, attentive and they kept the drinks coming. The others at my table had an old fashioned as their after dinner drink and they were all very pleased. It was a great way to start a very fun night."], ["Kate W.", "This place is friendly, accommodating, and delicious. It's great for a quick work-day lunch, happy hour at the bar after work with food and drink specials, leisurely dinner in town instead of facing rush hour commute, ordering pizza or meal delivery, or before play/musical/symphony dining. Fancy enough you don't feel weird in your going-out attire, but casual enough that you can roll in still in your scrubs after work. Everyone is super friendly, service is fast and pleasant. They will work with any dietary restrictions without batting an eyelash.  Delivery is usually very fast, and on the one time my delivery was delayed, they included cookies and some other goodies to make up for it. And to top it off, there's ample free off-street parking."], ["Walter M.", "Really tasty food and nice staff.  I go whenever I can."], ["JoAnn R.", "Ahi Tuna salad....Little pockets of deliciousness in every bite!!!"], ["Mo P.", "We went to dinner last night, a party of seven, and had the most wonderful dining experience! The parking was very convenient next door. The hostess was very attentive for the couple of minutes that we had to wait. The layout of the restaurant was exquisite ­we sat in the upper dining level and the acoustics were perfect ­ unlike some other places we've been lately. We all ate off the Taste of Hartford menu ­ a full 3 course meal. The salad was especially light and delicious AND just the right size. Although I'm a light eater, the shrimp and pasta that I had was so tasty, I finished the whole thing. The Baklava was a perfect ending to a wonderful evening. I would highly recommend J Restaurant!!"], ["Bryan R.", "Removed from the downtown of Hartford, with lot and ample street parking J's offers an alternative to most downtown locations.  We went based on reviews and things that we had heard.  The atmosphere is nice you are greeted by the fountain as soon as you walk in.  The lobby faces an open bar are and the dining area is tucked away on the side.  The layout could have been done differently but isn't terribly bad.  There are not a ton of TV's at the bar area but they are fairly visible throughout the bar and dining area.  The fascatta bread is  on point, almost a thick flat bread toasted with olive oil cracked pepper and salt.  The appetizers to main dish ratios are not appropriate.  The appetizers are bigger than the main courses in some instances.  We got the spicy calamari which really wasn't spicy and if not for the side dipping sauce would have missed the mark.  At $12 for this appetizer it dwarfed two of the three meals we received.  We got the sweet and spicy sausage with penne, this was in a  red wine vinegar and red sauce that stuck with minutes after you ate it, although it was impressionable, the amount of sausage in it was not and you basically end up paying $25 for 1/4 box of penne.  Like wise the penne and shrimp in vodka sauce contained 2-3 prefrozen over cooked and recooked shrimp at $26 both meals would cost about $5 to make and almost anyone could do them better with some effort.  The final dish we got was a meddly of clams, muscles, fish and shrimp, like the other shrimp dish, the shrimp was over cooked and under supplied.  The clams were so small they were no worth scraping off the shell and the muscles had little to no flavor.  The bread in the dish and fish was amazing, the fish was the perfect texture and flavor outside and inside but wasn't enough to totally save the meal.  The flavors and flavor layering are decent but the portions and prices are not very good.  They have some potential but more of a disappointment at the price and protein quantities."], ["Alberto A.", "but they are in restaurant.com. Owner told us that it was a mistake that someone put them there. Call restaurant.com & they are in active user.  Feel like they just want to get people in the door with that scam"], ["Rae Lynne K.", "Only the nicest things to say about J's. Always have had a good pleasant experience! They deliver too! Prices are for the most part reasonable. Good for lunch or dinner, or happy hour after work for a glass of wine. Decent wine list, and the pizza hasn't disappointed!!"], ["Toy L.", "My boyfriend and I ventured to J Restaurant and Bar on Saturday afternoon.  This was the first time either of us have been to the establishment since being formerly known as Pizza Plus.  I do have to admit that there has been a dramatic change for the better.  The restaurant is modern and bright.  It also now has a nice bar area with a large screen television.  I was glad to notice that they kept the small back room private dining area.  There is also a patio where you can choose to dine,  however your view is either that of the hospital across the street or the car wash next door.  The only down side was that they only had one waitress on duty, and once the lunch crowd started pouring in, I went slightly thirsty for a fairly long time waiting for my refill.As for the food itself, I was not entire impressed.  The food was subpar and expensive.  We ordered the calamari and coconut shrip appetizers, figuring that as a basic appetizer, you couldnt really mess that up.  The calamari came smothered in a sweet sauce that tasted almost like General Tso.  It was accompanied with a dipping sauce that looked (and tasted) like duck sauce.The shrimp looked just like shrimp tempura.  But was delicious (on its own).  The cocanut sauce that came with it was way too sweet.The linguini with clam sauce came with fresh clams in their shells, which was refeshing.  The pasta itself was a little al dente.  I didnt realize until it was too late that all of the actual flavor and seasoning was on the bottom of the dish, instead of incorporated throughout. My boyfriend ordered the penne arribiata in which he stated would have been fine other than it seemed like they used way too much oil.In the end we wished that we jushed ordered a grinder like the people on the patio.  Those looked delicious."], ["David E.", "First time at J Restaurant / Bar, theater on 4/12, Lot's of Good here, 1.25 hours for a leisurely dining experience and off to the Bushnell, no service or kitchen glitches here, great execution all round. Malcolm server excellent, just the right amount of being there, great recommendations.The Tuna was done just right, crostini  just a bit over med rare, greens were very fresh indeed.Nice fresh feel to the place.Nice job over all"], ["Eric A.", "I only get here once or twice a year, but when I do it's a treat. It's just about a block from the Academy of the Arts, and very handy for a pre-show dinner. The staff is invariably friendly and welcoming, and the food is very good, with a nice range for a party with varied tastes."], ["Mrhapp Y.", "OMG! The Blue back burger was the best. even better than Plan B or Catsup and Mustard.I will be going here again. Only problem is its $20 for a Burger and a beer."], ["Adria P.", "Lovely restaurant with attentive service, nice atmosphere, great menu and excellent food. Couldn't ask for more!!"], ["Rick B.", "Easy to drive to and adequate parking..  Food very good and varied selection.  Best crab cakes ever,  J is on hand and assures quality service.  Rick Newington"], ["T S.", "Recently had lunch there with people from work. Not going back! Personal pizzas tasted like they had been under a heat lamp sitting for somebody to order one, doughy, tough, not hot. Got the J salad, lettuce was on way out, maybe 3 pecans and 4 cranberries, a crumble of gorgonzola, dressing, \" sweet basalmic\" was oil and vinegar, nothing special.  Burger was unseasoned, barely warm, roll hard.  Really wanted to like this place...overpriced for the value.  Wouldn't recommend to anyone."], ["Jon G.", "What a great place!  I can't believe we hadn't thought to go sooner.  We had dinner here at the bar before show at the Bushnell last month.  Excellent, professional and friendly service from the bartender (I hate to admit I've forgotten his name).  Terrific food as well.  Love the atmosphere too.  We'll certainly be back."], ["s c.", "Visiting friend in Hartford - this is a nice airy casual restaurant and bar.  We had: fried moz sticks, grilled salmon, escarole/eggplant pasta, spag/meatballs. All entrees very good, but the pasta portions not large. Desserts: flan looked v good, but choc fudge cake not as good. Like restaurant - if we're in Hartford, we'd go back there."], ["David S.", "went here for taste of hartford, food was great, service even better and the martini the best!"], ["Shani O.", "I'll be honest, the only reason I came here was because my friend just got hired as a bartender, so I wanted to give her some moral support. It's in a weird spot, off the beaten path from downtown, right across from the children's hospital.  I don't think most people even know it exists and that's a shame.  They have done a beautiful renovation, the food is awesome, the wine list is even better, and they have a parking lot.  I'm thinking they should do some advertising but until then word of mouth will have to do.  Go try out J Bar (and say hi to Monika), you won't be disappointed."], ["Teddy W.", "Fun, exciting atmosphere. Good food to match, they are updating the wine list, good martinis."], ["Dee M.", "I just left J bar very unhappy with the food and service. We ordered the mussels to start and they were laden in some thick, oily, tomato-like sauce with very little flavor.I ordered a Greek salad with salmon added to it, it was a small piece of salmon that was very mushy. The menu said the salad came with Bibb lettuce and instead it was mostly iceberg, there was only one cucumber, maybe two olives, and one cherry tomato. All of that for a whopping 18$! It was a tiny appetizer portion salad, I strongly recommend against ordering this. My boyfriend ordered the Salmon BLT, it looked like something you could get at a diner. Everything was cold, and the fries looked and tasted like they were from last night. Honestly, it was a sloppy mess of a plate that tasted terrible. Not once did our server ask how everything was.I surely will not be rushing back to J bar. It's too bad because they have a great patio and interior, but the food and service is just not worth the price!"], ["Gigi X.", "A lovely setting, attentive service, and portions worth your money. We dined upon fruits of the sea; ahi tuna and seafood linguine, all fresh and well prepared. Dessert=freshly jerked espresso=a rare treat in Hartford=yum! This spot was perfect for dinner before a show at the Webster Hall."], ["Mickey Z.", "Only tried crab cake app and it was delish. Martinis were excellent. Service is dicey it took way too long for everything"], ["Sam T.", "The food here is really good, but not worth the prices. There is nothing on their menu that warrents the mark up. The fried calamari Asian style as I call it is very good, but leaves a horrible after taste. My friend and I used to come here all the time. The service is always good. I'm still on the fence whether the drastic change from a pizza place to J was the best iddea. A lot of employees from the hospital would order from here along with They do run specials such as reduced priced apps on certain days, so It's nice to meet after work for a drink or two."]], "LaRosa MarketPlace": [], "Trinity Restaurant": [], "Vito's By The Park": [], "Francesco's Ristorante": [["Lexii M.", "I'm happy I came for Easter dinner here even though i was by myselfEverybody was so nice gave me drinks (Salute) very family orientedThe chicken picata was everythingThere wine selection is wonderful and top shelf so is there whiskey collection I will happily come here again the penne al vodka is everything I'm very satisfied!!!! Thanks to you all!! It made me forget I was in Hartford."], ["Barbara B.", "I made TWO appointments with the manager to discuss having my daughter's medical school graduation for 50 people.  The first time I received a call to reschedule.  The second time, I called to check that we were on and was told it was a go. My daughter and I arrived on time and the cleaning staff had no idea the manager was expected.  Twenty minutes after he was due to meet us, I was finally able to reach him by phone and he told me he couldn't make it.  That's unacceptable.  I don't care how good the food is.  This manager's irresponsible behavior was enough to have me cross this restaurant on my list permanently."], ["Rachael S.", "Went there after work with friends, drinks and foods are okay but the service is just horrible. We waited so long for our food. With that price it's not worth the food and service. Would not recommend this place."], ["Sandy D.", "WOW!!!....Simply outstanding Italian food here!!!  Hands down the #1 Italian restaurant in Hartford CT!!! We went to Francisco's yet again, for another memorable meal!!!I got the special, Haddock with a Puttanesca Sauce. Delicious! Fish was cooked PERFECTLY! Juicy, flaky, and \"perfectly cooked\".  And that it not an easy feat in restaurants today. Most usually overcook the fish, and the finished product is a disappointment.No disappointment's here. Right down from the delicious bread that starts the meal, it was a pleasure. They will accommodate any special requests, as everything is cooked to order.Mario, our server, was attentive, accommodating, and friendly. We have had him several times and every time has been the same."], ["B M.", "I have been here before but the way the owner treated the group I was with made me never want to come again. Not a family friendly place. The owner was down right rude and disrespectful. To top it all off the food they served for Taste of Hartford was extremely disappointing. The calamari was like rubber and the desserts were the smallest I have ever seen. And dont get me started on how every time I go, it takes the kitchen almost an hour to get us food. The staff is slow and so are the cooks.The only reason I stayed was for the singer, Al. He was great.Not coming back again."], ["Ko M.", "Stopped by Mozzicato's for cookies, and we were referred here for a nice red sauce.  It was a great tip.I had the veal chop / prosciutto / gorgonzola.  It was the special of the night, and a great choice.  I can't recommend this dish highly enough.  Vegetables perfectly matched. We also tried the chicken Siciliano, clams & calamari fra diavolo, and tortellini.  My wife & kids (13,11) loved it.  The chicken was light and savory.Fra Diavolo, spicy but not too hot.  my 13yo recommends highly.Prices match excellent food.Sit outside on the patio, and enjoy the end of summer on Franklin Ave."], ["Arthur B.", "Stopped by this Italian restaurant during a business trip in Hartford, wechose to go to this place because of the good reviews. We sat outside, it was nice weather. The staff was really helpful and always cheked up on us and brought our food fast. The food was delicious, we tried the chicken, the penne, the veal, everything was good, the calamari was the best we've tried (and i've tried alot of italian restaurants!). Owner was nice enough to come and talk to us too, even brought a free drink at the end of the meal. Overall we had a great time and I would rate it nothing less than a 5 star location.Inside - walked around inside, looked like they have live music (prolly on weekends, we went on Thursday night), great full bar, nice seating area, have a bigger spacious area for larger parties as well on the side room."], ["Jamie S.", "Whenever I want Italian food in Hartford, this is where I go.  'Ive been here several times and have not been disappointed.  I like the linguine with clams, but I tried several dishes and everything is always satisfying.  The quality of  the food is consistent and the bread is hmm hmm good...always served warm.The food is moderately priced and commensurate with the entree size/portion.Good wine choices!  The staff is nice and remembers who you are!  They have live performances on certain nights.  Check it out!!!P.S. check out for restaurants.com for a good deal!"], ["Eric L.", "Had lunch the other day Decor was very nice Chicken parmigiana was good pasta wasn't fresh though for the price kind of expect fresh pasta. Calimari was ok, and I love Calimari. They were all rings which makes me think they were trying to substitute pig intestines for the squid. Salmon tasted like it was frozen not fresh. Took a while to get the food Wrap was very big and tasted goodBolognese was  good also.Maybe my view is skewed because I traditionally eat at Arthur Ave in the Bronx, but we were a little disappointed"], ["M I.", "The food here is decent. Some items are hits like the salmon but others are disgusting (shrimp - hard as a rock).Food wise this place is about 3-stars. Service wise this place is a negative 500. I have been here maybe 3 times but I always get the same rude server. He's a middle aged Italian guy who is very rude. If your food tastes off or weird, don't expect them to change it or try to fix the problem. They just tell you \"it's how we make it here\". So if you get bad seafood, they will 1) yell in your face and 2) expect you to eat it and pay the bill. I hope the servers here know that a tip is proportionate to the service. We got chased down into the parking lot for giving a 15% tip instead of a 18% tip! The server came after us! The owner is a sleezebag and tells people not to come back. They are really rude and I do not reccommend this place to anyone. There are so many restaurants with much better food and service aka Carbone's."], ["Don N.", "This is not the place to have dinner if you have somewhere to be afterwards.  Fortunately, we were just meeting friends to talk and eat, but the service was awful, slow and confused.  We were abandoned for long periods of time, though we were tag-teamed by two different waiters.  They did not communicate with each other.  It's not cheap ($100/person with tip); I expect dependable service at that price level.There were a couple of parties there, but the booths were mostly empty, so the staff should not have been overwhelmed.  While the head waiter was amusing, there was a lot of blaming going on with the finger pointed at the other waiter and the cook.  At one point, when we had finished our salads and had waited at least 20 minutes for the entrees, he said that, for the cook in the kitchen, we would just have to \"take a number.\"  This is the same guy who, upon bringing our cocktails, said, \"Drink them fast so you can have another round.\"Some of our meal was quite good.  We shared calamari and it was excellent. We all enjoyed our main dishes when they finally arrived.  The Veal Florentine and Chicken Princess were both delicious.The \"Buts\" -Bread was brought, but we had to ask for butter.  Used cutlery was removed between courses, but not replaced.   I ordered their special appetizer, which was 3 shrimp with some bread crumbs on top and set on mixed greens.  It was tasty, but a serrated knife was required to saw through the tough shrimp.  The $9 Caesar salads were a huge disappointment - your basic, Olive Garden salad.    One of the 3 bus people that came to our table had B.O. that could knock a buzzard off a deadwagon.  Before we got to dessert, the disco music and karaoke from the bar side started blasting and it was pretty annoying.  We walked through on the way out and the young professional crowd seemed to be having a good time.We were there for 3 hours and at least a full hour of that time was spent waiting in frustration and hunger."], ["Jason M.", "I can't say I disagree with past reviewers who found the service to be a bit suspect. The service we received this evening was by no means unacceptable, but there were some minor issues. First of all, our waiter was, for lack of a better word, weird... Not mean or inattentive, but quirky and unrefined for such a nice restaurant. Also, our meals arrived a bit late. There was a table that was seated well after us, and had their meals served well before us.Again, not huge issues here. Just little hiccups here and there which are quite frankly the major reason Francesco's isn't getting that coveted fifth star.Let's focus on the good things... The food was very, very good. We had a fried mozzarella appetizer, and two really well-prepared pasta dishes. Unique and fresh. Not to mention, plenty of warm bread and olive oil for dipping on the side. The decor is top notch too... a very pleasant environment to have a nice meal, both in the bar and in the dining room.Now without further ado, this review would simply not be complete without mention of the quality evening entertainment! Little did we know, just minutes after we sat down for dinner in the bar, we would be treated to the melodic rhythms of a lounge singer with an electric piano!!!I'm not even kidding. If you go on a Thursday-Saturday night, and sit in the bar, you get the lounge singer at 8PM, followed by dancing at 10PM...I mean hey, the guy was really nice, and came over several times to \"serenade\" my girlfriend and I at our table... But holy heck was this whole thing kitchy! I'm still laughing about it even as I write this... Yeah, we loved every second of it, but I'm 100% sure the owners of the restaurant don't appreciate the cognitive dissonance of this self-inflicted dog-and pony show like we did.Fortunately, you can opt out of this hot mess and just sit in the dining room. But why would you want to?! Oh sure, you came in for a quiet and romantic meal, but you never knew you wanted an off-key rendition of \"Strangers in the Night\" for dessert!Wild stuff... we'll surely go back soon."], ["Thea Z.", "My family and I chose this restaurant as it seemed like a nice option for the Taste of Hartford for 2010 judging by the menu and the reputation. We first had difficulty with the reservations as we called several times and no one picked up. This should have been our first clue. We arrived at 7:30 for our reservation which was at that time and did expect to wait a little bit due to it being the taste of hartford. After finally finding the person to check in with we waited 40 minutes to be seated. Not terrible, but a little frustrating. We waited 20 minutes for our waiter to come over and take our orders and he promptly dashed off after taking them leaving our menus on our table.  Shortly after that, someone brought us bread. Almost 40 minutes later, without seeing our waiter at all, our appetizers finally arrived. Since our water had run out, we ended up going over to the waiter stand and starting pouring our own water. Other customers took note and took the pepper grinder and did their own pepper because they hadnt seen their waiter either. Fortunately the food had good flavor and gave us hope that dinner would be great. We even ended up busing our own tables and stacked our dishes and were about to bring them to the waiter stand when someone actually took them from us. At this point we had been there over 2 hours and were starving. Many people were complaining and the staff just seemed to run around without a clue and our waiter avoided us at all costs. Some staff would walk into our room in the restaurant with one plate, look around confused, and then turn back, By 9:55pm (2 and a half hours into dinner) we were so frustrated that we calculated how much we thought the appetizers would have cost based on the menu, left that on the table and got up and left. As we were leaving we flagged our waiter down who was wandering around and he seemed surprised and said, oh your dinner is sitting on the window. We all thought to ourselves, if you knew it was done why wouldnt you have brought it over?!?! Too bad we never got to taste our dinner, and will never find out what the food is like there. TERRIBLE SERVICE."], ["Marc M.", "Franklin Avenue was once the hub of Italian-American life in Hartford. The restaurants and bakeries remain but much else has changed. One constant is Francesco's. The appetizer of escarole and beans is timeless and classic.   Try the swordfish with the pasta and the pasta with broccoli and oil. Both great and not high cal either."], ["Kathryn L.", "I was curious given the mixed reviews - but I loved this place from the moment I called for a reservation. The man on the phone was cheerful and appreciative of our business. The by the glass wine list was great. The staff was attentive and knowledgeable - when I ordered a spicy dish they told me this batch of peppers was extremely spicy - I ended up changing to the the Capellini which was perfectly al dente and seasoned. My husband had the the veal parm which came with a side of penne ala vodka - all great! No side salads with the dish but the bread is so delicious you won't need one. After dinner we had a cocktail at the lounge with an adorable singer - it was all around a great date night! We will be going back."], ["Robert H.", "Kindly refer to my last visit.Was brought here by a business associate one more time. Service either improved or we got the right server. He was funny and courteous. The bus staff still needs to get the water re-fill drill right.Mozzarella with tomatoes was particularly good -- the cheese was creamy and nicely-textured, and the tomatoes were delectably ripe.We had a special pork roast that was actually quite good. The rest of the meal was run-of-the-mill.Red sauce had too much tomato paste in it. It was bitter, cloying and over-cooked, just mildly seasoned with garlic -- and oregano (no, no, no!) -- instead of plenty of basil, parsley and onion. Can't you do better than this for the price?A pasta in cream sauce was over-cooked and pasty, as if the cream sauce had been thickened with flour. The mushrooms were either canned or very, very small, and over-cooked as well.They cheerfully replaced a by-the-glass wine that had gone bad with a *fresh* glass of the same wine.The coffee had an oil slick on it.Hey, I gave 'em a second chance..."], ["Adriano M.", "I have dined at Francesco's a few times for lunch and I have not been disappointed yet..  Great food, great service and from what I understand dinner time is even more rewarding with live lounge entertainment. I will try dinner here soon.  Started with Italian wedding soup, very fresh tasty and comforting. Then followed with the Francesco salad with grilled shrimp. Nice portion, delicious favors in the dressing. I have also tried their veal and chicken dishes and all are very high quality. The prices are not cheap but once you taste the food you will understand why they charge a little more.  If you are looking for real Italian cuisine in the heart of Hartford's Little Italy. Francesco's is a great choice. They also have outdoor patio dining in the summer."], ["Vinnie S.", "My wife and I met 2 other couples at Francesco's for dinner on 12/12/12. We got there early so we sat at the bar and had a drink. The restaurant is clean but in need of a face lift. We both ordered martinis and they were both good. The bartender had extra martini he made me left in the shaker. Instead of giving it to me he poured it into a shot glass and drank it. This to me is very unprofessional and if it were my business it would not be tolerated. Anyway, the service was very good throughout. The prices here are on the more expensive side. I had a Cesar's salad, Italian wedding soup, and chicken scarpiello. Everything was good, hot, and tasted freshly made. I was disappointed to see that they didn't have at least one fresh pasta dish. If you're going to pay $18 for pasta at least give me a fresh pasta option. Everyone else at the table seemed to like their food as well. Overall, it was good but I wouldn't go out of my way to eat here."], ["Cliff H.", "If you consider service, wine, and menu selection at all important this is one of the best restaurants in all Hartford. My first time here the owners offered free wine and dessert and took the time to personally check in on satisfaction with the dinner. I have been back again and again and cannot speak highly enough about the great food, great wine, and tip-notch service and attention to detail, all at prices far more reasonable than other Italian restaurants in this area, or West Hartford as well. Cannot recommend enough. One of my fav restaurants in Hartford."], ["Mickey Z.", "always great food and drinks and the outside patio is great in warm months. They also have bands at night sometimes. parking lot helps in this area"]], "Cugino's": [], "Maple Giant Grinder & Pizza": [], "Vivo": [], "Peppercorn's Grill": [], "Carbone's Ristorante": [["A B.", "A friend and I went here for a special lunch.  My soup was tepid and the chicken in it was dry.  The prices would not be unreasonable for excellent food; for pedestrian food that was not well-prepared, they were too high.  Also, the service we received was awful.  When both a waitress and an assistant are assigned to your table, it is not unreasonable to expect that they will check, at least once, to see if you might like more water or would like your iced tea refilled.  Other parties were seated after we were and received their drinks quickly; their food arrived before ours did; they had numerous visits from the wait staff.  We did note that the speed of service was rapid when it was time to pick up the credit card.  We will not return."], ["Cj H.", "After hearing that this was one of Connecticut's best Italian restaurants my companion and I were deeply disappointed.My pasta was undercooked and his veal over salted. Quite frankly we have had better Italian meals at Bertucci's."], ["Pete L.", "Love this place! I have been coming here for over 30 years, never disappointed ! For being in this spot for so long they manage to be consistent and relevant!!!' Always great service! Let's keep establishments like this alive in the Capital City, or we will all be enjoying dinner at Olive Garden!"], ["Ronald L.", "Favorite restaurant in Hartford.  Great food, great staff & great old school atmosphere."], ["Dane E.", "Excellent ambiance and atmosphere...superb service. The linguini with clams is to die for. Where your napkin like a bib though, the plentiful, buttery garlic sauce will find it's way to your shirt and tie without a bib, no matter how daintily you try to eat."], ["Bryan R.", "We were treated like old friends here on Wednesday night.  Missed our reservation, no big deal we can still seat you.  Food was great as usually, my father and wife had so many questions and the staff was very courteous and polite which really sealed the deal for me as being one of the top restaurants I have ever experienced."], ["Alex P.", "I ate here with my family to celebrate my parents 25th wedding anniversary. The service and food was top notch. The only thing I can complain about is the lack of parking, when we ate here we had to park our car across the street at some other business. If their prices were not so high I would probably go back on my own or with friends."], ["Linley S.", "I'm not entirely sure how I've never written a review about Carbone's.  I've been coming here since I moved here in middle school.  It first started as a special occasion place for my family, celebrating birthdays and other milestones.  Now I find myself at the bar at least once a month. The staff provides service that is unlike any other, you feel like you're family while you're there.  The food is amazing, especially the dishes that are prepared table side- Caesar salad! Yum!  There are rotating \"chalkboard specials\" in the bar and lounge, one of the most memorable was the Blood Orange Manhattan.  There are also several rooms that can be used for private events.  Several years ago my dad, brother and I threw my mom and sister a large combined going away and birthday party (60-75 people) in one of the rooms, and it was magical.  My mother has severe dietary restrictions, and they were able to create several things for her to enjoy.  The Carbone's take great care in ensuring that everyone has a great experience.Lately- I've been heading in Saturday nights for a cocktail and some Truffle Arancini- you must try these!!While the actual lot is a bit small, there is plenty of on street parking and a lot across the street.  There is a parking attendant on the weekends to ensure safety while parking/entering the restaurant.Carbone's also caters events... any size.  Small gatherings all the way to the Traveler's Championship."], ["Jenna D.", "I went here with some coworkers for dinner, and we really enjoyed ourselves. Perhaps not the prices, but definitely the food.I had a Caprese salad (very little mozzarella, and only two tomatoes on a bed of greens), but everyone else had a house salad (typical). For dinner, I had gnocchi in a cream sauce with peas (against my better judgement - I don't typically like gnocchi and am not a huge fan of cream sauces).  Due to the lack of a steak option in the prix fixe menu, several people opted for the veal piccata. My gnocchi, while good, just wasn't exactly what I wanted, but they might as well have scraped the dish clean. The only thing to illicit even a small complaint was a weird cheesy polenta for a side. Dessert for me was a tiny biscuit with a few berries and whipped cream, and anyone who got the chocolate option got screwed - they had the thinnest sliver of chocolate torte that you could possibly imagine, though both were delicious. They have a pretty excellent selection of wines, though the markup is ridiculous. I ordered a dirty martini - very average, but at least it was big. I had a catered lunch from here last year, and there was a remarkable salmon dish that my friend and I still talk about. That was far better than the dinner I had, but overall, it's quite good, the atmosphere was cozy, and the service was decent. Just be prepared to spend your entire paycheck."], ["Ronnie M.", "We went here last weekend for the \"Taste of Hartford\" deal, and it did not disappoint.  I remember my first visit here about a decade ago being a bit underwhelming, which accounts for the fact that we didn't make it back here until now.  I have to admit I was skeptical, but figured the recent good reviews had to mean something.  Well, I was pleasantly surprised, because Carbone's exceeded my expectations in just about every way.  The blood orange martini is truly outstanding.  The juice tastes fresh squeezed on the spot.  We were able to upgrade our salads to the tableside Caesar preparation for only $5, which wasn't a bad deal.  10 years ago we didn't know about the Caesar salad preparation until it was too late to order it, so as we left we vowed to come back and have it.  Well, if you can believe that, it that never happened until now!  I was really hopeful that it would be as good as I imagined it to be.  Well, again, it was absolutely spectacular.  Our preparer was friendly, funny and knew what he was doing. I know how to make a Caesar salad, and I can attest that this is the authentic way to do it.  The only thing I might have done differently is shred the cheese instead of finely grate it, but that's just because I'm used to that way of doing it.  It did not compromise the taste of the salad to use a more finely grated cheese.We both had the Veal Rollatini, which really benefitted from the smoky, porky lardons in the sauce.  The mushroom sauce was very good, too.  The veal itself was melt in your mouth.  I can see why they have a reputation for veal.I had the pannetone bread pudding, which was everything it should be and more.  I have made it myself and I liked theirs even more than my own, which says a lot!I have to say that I am very happy to see that Carbone's is going strong on its third generation in the family. It did our hearts good to see it doing so well. Restaurants with such a history should be treasured by a community and it would hurt to see it in a state of decline.   Some people complain about the outdated decor, but in my opinion they just don't get it.  Some restaurants should be a bit outdated to preserve the flavor of their history.  It's not just about the food, it's about the entire experience and how it relates to their past.  You have to have an appreciation for history, especially culinary history to get it.  From the attended coat room, to the wood mouldings, to the tableside preparation, to the style of the bar, this place is history and should be appreciated as such.  Hartford has too few restaurants in this category, so it is somewhat of an endangered species.  I think they have done a good job keeping it relevant for today while preserving the attractive aspects of its past.  We will definitely come back in FAR less time than a decade!"], ["Lauren V.", "This place did not meet my expectations. I went here for dinner with coworkers from out of town and was very excited to try it. I was let down when it was just OK and not great. The service was extremely slow, and at first everyone was a little rude to us. There was no reason for the service to be slow because it was a Monday night and there was barely anyone there.  I ordered the Caesar Salad, which is prepared table side. Watching them prepare it in front of you was a nice touch, but the salad just tasted OK, it wasn't anything to rave about. For an entree I had the Lobster & Butternut Risotto. The size of the portion was pretty small and again it just tasted OK, nothing to rave about. I ate enough for dinner, but did not leave feeling full nor satisfied."], ["Matt I.", "Everything was excellent.  Started with the calamari.  House made bread was a nice touch.  Meals were veal parm and veal picatta--I know this place is famous for their veal, but I just haven't ever had veal this tender or flavorful.  Sauce was perfectly simple.  Chocalate hazelnut ganache--Torta Di Angelo--was also amazing.  I look forward to going back."], ["Leslie H.", "I'm almost happy to see a lot of not-so-great reviews, because I'd rather keep this place to myself!I agree with others that the service can be a bit \"off\", and I also think the wines are WAYYYY overpriced (like a good 300-400% markup), BUT, that said, the arancini app and the Veal Cuscineto entree are 2 of the best things I've ever eaten in my life."], ["Lucas K.", "Excellent food, 75 years in business with a 3rd generation chef! They offer variety of new flavors last night I had a fig and goat cheese flat bread, incredible, this was among the chef Vinny's  suggested dishes all equally fantastic.  I can tell you don't pass up the opportunity to eat at Carbone's Ristorante"], ["Jessica B.", "I have eaten here several times, all for special occasions such as birthdays or anniversaries.  It has always been a wonderful experience.  I especially enjoy the table-side Caesar salad.  There were very accommodating of my gluten-free diet as well."], ["Michael B.", "Very surprised to find this Italian gem in the middle of Hartford.  After spending over a year frequenting Boston's North End my expectations weren't overly, however this place was outstanding.As far as food... for appetizers we had:Fried Chicken Lacava - Unique appetizer, while the chicken was a little dry, it was a nice comob with the hot pepper and bacon.  Definitely enjoyed these.. Fried Cheese Spiedini - Interesting once again.  Not your typical fried cheese app.  It had a real nice flavor and the panko bread crumbs added a layer of complexity to the dish.  Fried Calamari - Your standard fried calamari with an entire bowl of sauce to accompany it.  It was well prepared, nicely fried and tender.Tomato, Mozzarella & Prosciutto Bruschetta - Considering that everything else we had was fried, this was a nice compliment to the other dishes.  Very fresh and tasty app on a hard cracker but the softness of the buffalo mozzarella, freshness of the tomato and saltiness of the prosciutto really went nicely with it..I was pretty much stuffed after the appetizers but for my entree I had the veal and eggplant napoleon.  Very unique dish.  Came out piping hot.  I loved the sauce and the veal was very well prepared.  Definitely would like to have it again when I can actually eat more than two bites of it.  I also tried the Fettuccine Carbonara and it was DELICIOUS!  Heavy on the bacon, sausage and prosciutto like it's supposed to be.  We were the last patrons in the restaurant and the service was good.  The ambiance is also very nice, relaxing atmosphere, kind of a homey living room/library type feel - well done.Really enjoyed the restaurant and highly recommend it."], ["T S.", "Carbone's food keeps getting better and better for traditional Italian dishes. Have eaten here many times over many years and we have enjoyed dinners recently more than at some times in the past. I think it isn't just for old folks. We have not had a problem with slow food or bad service. Servers are pleasant as well. Table side preparations are not done much anymore, so its kind of fun that Carbone's does it for salads and dessert."], ["Gerald B.", "More of a status restaurant. Don't expect much for your dollar. Don't wear jeans and sneakers or you'll get ugly looks from the well-to-do regulars."], ["Robert H.", "We really wanted to love this Hartford institution, and commend them for hanging in there while the neighborhood's undergoing some changes.If there's a theme for this review, it's \"inconsistency.\"At these price points, the meal should be pleasant, service should be unobtrusive, and the quality of the food should be consistent. This is based on three visits; one \"okay\" visit a year or so ago, one spectacular visit six months ago, and one very recently.The food quality, overall, is just barely worth the money. There were some high points. Most memorable was a luncheon mixed grill with steak and sausages that was perfectly cooked, perfectly seasoned, and absolutely delicious. The dinner steak is not the most expensive in Hartford ($32) but wasn't the greatest piece of meat. The gorgonzola covering it had been over-cooked under a broiler (or a heat lamp). The doneness was perfect medium-medium-rare.Very surprisingly, the tomato sauce \"Pomodoro\" is a bit too acidic, too thin and redolent of burnt garlic. Pasta, however, was good-quality and cooked perfectly.Veal piccata was tender, tasty and served in abundance. A vegetable side (broccoli rabe with beans) was done perfectly and delightfully seasoned.Desserts were a throw-away and over-priced. Coffee was very, very good. First-date people will want to opt for the crepes that are flambeed at table-side. I seem to recall that dish set us back about $18 but by then I had a heck of a wine buzz so don't quote me.Wines were serviceable but expensive. Cocktails were \"meh\" and over-priced. When I want ice water with my meal, please, please don't do the New York thing and push bottled water nor sparkling water, thank you very much.The room is handsome and impeccably clean. Table appointments are of very high quality, in keeping with this level of dining.The bar was uber-crowded with local swells and minor celebrities and we've found the atmosphere somewhat off-putting. No, I don't want to be a member of Hartford's \"inner-circle.\"The most peculiar thing to us is the way we were served, from greeting to farewell, all three times -- each in a different fashion. The first visit, after which we intended to return (someday), the greeting was crisp; we were parked in the bar for 45 minutes, then the service was attentive and pleasant.The second time we went was with a guy who's a friend, and who's a minor entertainment celebrity in Hartford and gets quite a bit of media exposure. Before we even got our drinks at the bar, the owner's wife came careening out of a hallway and greeted us effusively (we've seen her around and she's not like this at all). When our host introduced me to her, she responded \"oh, I know Bob.\" She doesn't. The meal that followed was filled with little extras (some free; some were actually charged - I paid the bill, without complaint, 'cause we either ate it or took it home).The evening continued with a server and a runner committed to our table. This made us a little self-conscious because we perceived that service for some other tables was being compromised. We couldn't talk in confidence 'cause there were all these people hovering around us. The other guy with us is painfully shy and it actually made him extremely uncomfortable, to the point that I nearly got up to suggest that the staff leave us alone.The most recent time we visited was on a sleepy week-day lunch. The effusive greeting wasn't there. The staff was just going through the motions. A soiled knife had been set on the table and was replaced without apology. The kitchen failed to clean-up a plate rim that'd been splattered with sauce. This is just nit-picking and didn't lessen my experience, but all together it showed that they just didn't care.Your mileage may vary. I encourage anyone who's not been here to try them at least once. A restaurant with such incredible longevity must have something going for it. But it just didn't excite us."], ["Chris W.", "My husband and I went here for a special dinner and it was excellent one of the best Italian restaurants I've been to lately. The server was attentive and friendly and the food was amazing! I can't wait for another special occasion to go back!"]], "Sorella": [], "Treva Restaurant & Bar": [["Nathan L.", "Watch out for the \"freebies\". Decent food. Overrated for the price. Be prepared to be charged $20 for bringing your own cake."], ["Ellee R.", "Kudos for becoming a W.Hartford destination, particularly for family groups. Its not a huge bistro but they are often busy in their back dining room and dining garden. The best thing about TREVA without a doubt is the fresh bread which comes with the meal. You will not have tasted anything like it anywhere in CT. Light, airy and perfectly crusted, the bread is reason to go!  I visited Treva for two lunches; one in May, the other in June. I had looked forward to what I had experienced before. Rather let down. When I ordered the fish luncheon plate. I specifically asked how it was prepared & if the fish was fresh. I mentioned I did not like fried fish. The waiter said the fish was fresh and would be pan-seared. It came to my table with a light batter, a 'fry' taste and was too salty. Very disappointed. On the next occasion, I ordered my tried-and-true happy hanger steak. [During the winter, I returned weekly for Treva's fabulous sliced steak plate. I often dined with no one in the backroom and just a few straggler diners & their pcs at the small tables located in the bar]. This last visit, my plate had 1/3 the steak, and slices were sinewy, almost un-chewable. Oh, the vegetables are always yums; the service is kind and generous; and the wines are lovely without being prohibitive in cost. However, if a bistro raises the price of luncheon specials, and then does not deliver the same quality and the same quantity, its not as it was. I hope to try it again soon."], ["Andrew P.", "I HAVE to give this place five stars! The bar, which I enjoy, is one of the finer bars in West Hartford. The reason is simple; knowledgable bartenders, great food, great service and an awesome menu! Trevá is a little on the expensive side for my taste but, it is definitely worth the price! My boyfriend and I started with a salad and then shared some breaded meal (the name escapes me, sorry)!"], ["Bread Man S.", "Great place. Good service and great food.Its a very cool place, hip and exciting, I only been there once, as I am from out of town. Must check the place out, had a super nice lunch there with friends and colleagues.Its a must visit while in the area. B"], ["Kathy M.", "Ate here before a concert.  We had a great meal and have recommended it to friends already.   We did have reservations, which I suggest.  The menu had a really nice variety, we tried a good sampling of the items and shared some appetizers. You will not be disappointed!"], ["Stephanie S.", "I lived in WeHa for 3 years and Treva was my go-to place for consistently yummy dinner and wine with friends. Happy hour is great. Pro tip: order the burrata- and the meat selection is criminally underrated. Lamb chops are delicious."], ["Andrey K.", "I love it. Met my beautiful wife here 11 years ago when it was a Puerto Vallarta. Being Single, now Im coming here for a great home atmosphere and excellent  food alone, hopping to meet my wife here again."], ["Jeremy W.", "It's so great when you consult Yelp for a meal in an unfamiliar place and the experience exceeds the most positive of reviews.Drinks?  Negroni was well made, solid list of wines by the glass.  The antipasto martini was one of the most incredible drinks I've ever seen; it's like a meal in a drink.To start?  Buratta with tomato and caesar salad were fresh and delicious.To continue?  Tonarelli cacio e pepe, papardelle with veal, mushrooms, and asparagus, rigatoni bolognese all home runs, all one better than the next (in the order I have listed).  Excellent fresh pastas, each perfectly selected for its delicious dressing.The service?  Friendly yet clearly our server was a professional, everything done by the book, specials read clearly, and able to answer every question about the menu, kitchen or bar.  I was impressed."], ["N S.", "Came here for lunch. It was quite nice. The ambiance and the way the place was decorated was very attractive and fullfilling making me feel like I was somewhere other than West Hartford CT. We ordered the mussels as an appetizer...totally awesome. The watermelon cocktail was one of the best drinks Ive ever had. Then the entre was trout with lentils on the side. I gotta say that piece of fish was totally great, and hadnt had it that good in awhile. Dessert was good too, having the chocolate cheese cake. Service was ok. The guy did his job. But for the overall food experience I gotta say...one of the best places Ive ever eaten around the Hartford area. Im going back soon!"], ["Kristin K.", "Hands down one of my favorite restaurants. Everything is so fresh, great service, and pasta is made in house. I have been here at least a dozen times and my experience last night was no different. My boyfriend and I went out for a midweek date night. We made a 6 o'clock reservation and were seated right away and our waiter came over to us immediately. We started off with a bottle of chianti Classico. We found out from the menu we could have byob with a $20 corkage fee. Our bottle of wine was $50 so that's a good option for the future. Wine was delicious and thanks to our server my glass was never empty. We started with a meat and cheese plate (a must) and picked 4 items for $14. Prosciutto and soppressata for our meats and taleggio (semi soft like a Brie) and Cacio di Tartuffo (a new to me cheese that was made from sheeps milk and truffles, amazing!). The plate comes with pickled carrots and an assortment of olives as well. Warm bread and olive oil were also brought to the table in advance of the meat and cheese. For our meals, I always go with the fresh pasta and I always special order something that's no longer on the menu. However this is what I love about Treva, the Gorgonzola gnocchi hasn't been on the menu for a few years now but they still always agree to make it for me, no questions asked. It is the most delicious pillowy fresh gnocchi with this creamy Gorgonzola sauce with radicchio drizzled on top. SOO GOOD everytime!!! My boyfriend went with the ravioli of the day, stuffed with ricotta, asparagus, and prosciutto covered in a butter sauce. His plate included 6 very good sized ravioli that were so stuffed with filling they looked like they were going to pop right open! I of course tried a bite (or 3) and they were incredible. He is not one to give dishes high ratings unless they're top notch, so when I asked how his meal was and he said, \"very very good\", I knew he wasn't kidding. Needless to say after all that food we did not have room for dessert. Although I have had the ricotta cheesecake before and would definitely recommend it again. All in all it was a great night and an amazing meal/amazing service and I will be back again. Treva if you're reading this, please never get rid of that Gorgonzola gnocchi."], ["Sammy S.", "Came here for some happy hour with some freinds the happy hour menu has a great selection the martini was strong everything is $2 -$5 on the menu this place gets packed so be sure to arrive on time 4-6pm sharp great place totally recommend it"], ["Noelle S.", "Last night two friends and I went to Treva for dinner, and we had an amazing meal. If you haven't been yet, go, TONIGHT.For my before dinner drink I ordered a Bellini, and my friends ordered a glass of Malbec and a Back East draft. Not a big beer selection at all so don't come here for beer. They have a huge wine list, and great cocktail list. My friend said the Malbec our server chose was fantastic. They also serve Nobilo sauvignon blanc which is my favorite.For apps we ordered the calamari, which was breaded and lightly fried with pieces of hot cherry peppers and thin pieces of zucchini also tossed in there, served with a side of marinara sauce.Of course, we had to do the meat & cheese plate. The menu lists 8 cheeses (a variation of hard and soft) and 8 cured meats, and we did the $24 meat and cheese plate where you pick 4 meats and 4 cheeses. For meats we had the prosciutto, speck prosciutto, mortadella, and borsellino. For the cheeses I had our server pick his favorite 4. He chose the parmigiano reggiano, Gorgonzola dolce, robiola, and cambozola. He gave us 2 hard cheeses and balanced it out with 2 soft ones. Perfect. The plate was served with a little bowl of olives and the house bread with olive oil. Yum. We really enjoyed getting to try a little of everything.For our entrees, two of us ordered the Pettine scallops. They were big half-dollar sized scallops cooked perfectly. They were served on top of polenta and wild mushrooms with shaved asparagus. I would order this again even though I want to try everything on the menu.. I'd highly suggest this plate! My boyfriend ordered the rigatoni bolognese pasta dish. The sauce was made with fennel sausage and beef. He said the sauce was really good, but the pasta was too al dente to his liking. We will definitely be back!!"], ["Yuchen Z.", "BRUNCH Update. I previously came to Treva for lunch and I had a 4 star experience. Delicious food, great atmosphere, great service. Today, I went back for brunch and it was way less satisfying... =/ They have a small brunch menu with classic breakfast dishes like eggs benedicts, omelets, fritattas, etc. Small does not mean bad though, they could have all been solid dishes.... However, they were not. We had the eggs benedict with martadella and one with spinach and we also had the fritatta. I think overall, the dishes were just *bland* - which really is the worst thing a dish can be. Everything about all the dishes were under seasoned and one note flavored. The \"home fries\" were like 10 potatoe pieces which were unevenly cooked or rather overcooked. The fruit cup were made with not fresh fruit-or at least it didn't seem like it. The one good thing was their juices were freshly squeezed... but they service it with ice (without asking us) and so it seems we get a lot less than with ice. Service was fine, we had about 3 people serving us, I don't know why really. But they were all nice and friendly. I do like the Treva atmosphere and I do like the lighting and it is classy and all that. Don't get me wrong, I am still a very big fan of Treva's lunch and dinner menus and those dishes are quite delicious. However, I definitely had a 2 star brunch experience this time. I have had MUCH better brunches for a lower prices in the area."], ["Mark H.", "Treva is very fun and feels more upscale than the rest of the locations in WeHa Center.  The staff is very friendly and I've always had great service there.  It feels like it's more expensive than other similar places in the area for HH but it's still a great choice.  My only qualm is that I have often felt that the HH food menu appears boring... in that I have never had the experience that I didn't know what to pick because everything sounded too good.  That being said, the burger is awesome.  They also have this fun ice compressor thing that they use to make these spheres for cocktail rocks.  Neat stuff."], ["Mais S.", "Our experience was amazing! The food was delicious and our server was super nice their polenta was one of the best I have ever had."], ["Michael P.", "Treva is neither pretentious fine dining nor the bastardized cuisine of your local red sauce joint. it is pure, authentic Italian food in its finest form, where flavors are derived not from the addition of unnecessary spices and accompaniments, but from the chef's deft manipulation of simple, fresh ingredients. Had the seared cod with escarole and beans in a light tomato sauce and a side of sautéed mushrooms on my last trip. Not the most exotic or extravagant components, but altogether it was incredible, both in taste and texture. And I could eat the mushrooms for breakfast, lunch & dinner. Highly recommend some sliced prosciutto or sopressata as well.Service is on par with the food, have yet to have anything less than an excellent experience. In my opinion, the best of West Hartford, and probably one of the better spots in CT. Hear the happy hour isn't bad either."], ["Al T.", "Restaurant owner called the day after original posting apologizing for the incident. If called ahead, promised assistance to enter restaurant thru main entrance. Greatly appreciated."], ["Deb T.", "We have walked by many times so decided to give it a try.Not too busy was seated by a pleasant young lady immediately .  It took a few minutes for our waitress to come.  Here comes why the three stars .  Service was slowwww! It took forever to get out pasta dishes in a restaurant that was not busy.  We also did not receive a salad we ordered.  And sitting at the front we observed another hostess be incredibly rude to two people , one an older gentleman.With that said except for the bruschetta that was half cold and half hot, our pasta dishes were excellent and they have a nice wine selection.Maybe we will try one more time to see if the service improves"], ["Dan R.", "Had a very nice brunch here today. Made 1:30 rezzies via Open Table and we were glad we did because Treva was fairly crowded. The interior is beautifuly decorated with light yellow painted walls, artwork and minimalist hanging lights.The Brunch menu runs $12-$14 for a nice selection of french toast and egg dishes -all served with fruit and home fries. We had a Pannetone French toast (with marscapone and bananas) and a Bistecca Panini (steak, fried eggs, mushroom, arugula). Pre-meal cocktails were a terrific Bloody Mary ($10) and a Blood Orange Bellini (with Prosecco for $9).The food was very good. My panini was \"last meal\" worthy. Service started off great and nose-dived after the food was served. No ketchup served or offered for the fries, no check back during the meal, no refills on the coffees we had with the food.Even though they have a vestibule between the inner and outer doors, it didnt work too well as a shot of Arctic air came roaring at us every time someone exited or entered.Bottom line? The food was an A. The atmosphere was an A. The service was a C+. We'll be back, but maybe in the Summer so we don't have to wear our coats during the meal like we did today."], ["Michelle R.", "Beautiful atmosphere, fantastic happy hour, handmade pasta - what's not to love? One of our favorite places in West Hartford center. Come for the friendly staff, stay for the top notch food!"]], "Allegro Cafe": [["Bob K.", "Hartford's best breakfast and equally great lunches! John is a master on the grill and Sylvia's Italian specialties are superb. They use their home garden for great peppers, eggplants and tomatoes. Bad place for dieters."], ["Amanda N.", "This place is truly a hidden gem of Hartford. I've been going to Allegro for years. Everything I have ever gotten has been delicious. The home fries are awesome and so are the omelettes. Pretty fast service and very reasonable pricing. I'll spend 8 bucks for an entire breakfast and still go home with leftovers. The portions are generous. Remember to bring cash because they don't accept anything else."], ["Ashley N.", "Hidden gem for an amazing breakfast. Now, let's be real, don't go in expecting to be served with white gloves. This is a family run business and you can tell the people who work there know the regulars and they don't go out of their way to ask how everything tastes. Service can be a little slow but seriously, so worth it!!! I always order the same thing which is the #1 - omelette with sausage, peppers, onions, maybe something else. Omg, my mouth is watering just typing this review. The dish also comes with Italian bread toast and one of my favorite places for home fries. I'm not doing it justice but I love this place so much!!!!! Tip: cash only, so come prepared. And after you stuff your face, walk on over to the Italian bakery for some delicious treats. The place fills up quickly so you may have to wait a bit."], ["Dawn O.", "This is a great local hangout for breakfast.  They serve fresh baked and sliced Italian bread with there food.  Stuffed omelettes,  perfectly cooked eggs.  Love the breakfast sandwiches, hubby and I pick them up to go for a quick breakfast.  Simple but tasty home fries.  Lot of local regulars from the area.  This is just a simple and homey place to grab some tasty breakfast."], ["David S.", "Went for breakfast at around 11. Took 40 minutes for food to arrive. Staff was very friendly and coffee was refilled right away. As arriving our table smelled like bleach. A lot of cleaning is needed here. The kitchen was out in the open and visible. The cook didn't wear gloves and was using the cash register as well. money is pretty dirty and shouldn't be handled when cooking. Not a good thing. Overall the food was your typical diner breakfast. I did to enjoy the fresh bread that came with my omelette.  Home fries was good as well."], ["Beth H.", "I waited 25 minutes for a breakfast sandwich and hashbrowns, only to get undercooked bacon. During my wait I watched the cook touch raw bacon and eggs with his hands, not wash them, and then handle people's toast and cooked food with his germ-covered bare hands. I saw this at least 6 different times during my stay. They also used a visibly dirty rag to wipe down surfaces and tables. That is just not good business. I will not be back and I advise anyone against coming here until they can clean up their act."], ["Joselyn Y.", "This place. THIS PLACE!!! This seemingly, dim, small, sort of odd looking joint is SERIOUSLY underrated! I went here with my sister after First and Last told us that they stopped serving Breakfast. The person at the register actually recommended this place to us which was awesome and my God was it a great choice! They make their own Italian bread and serve it with pretty much everything they make there. Breakfast is served all day and I do believe that they close fairly early.Also, this place is a total local hangout, you have the standard Hartford peeps, blue collared hanging out here and minding their own buisness (awesome for two young women who clearly aren't locals) and the little Italy crowd who also come in. Everyone seemed to know the people who ran the place so it gave off a great homey-vibe :).I ordered the brocolli and cheese omellete with homefries and YUM! It was cooked with light salt which I always love because then you can just add on your own. Homefries were crispy in all the right places and while we waited we could see the chef/cook making our food. My sister also really loved her meal and we were floored by the price. So if you want great breakfast thats cheap and quick, Allegro's is the place to go :)."], ["Kim D.", "I am shocked and appalled at the review from Missy. S. Perhaps she doesn't understand what \"Italian American\" food is and that italian sausage is what you get when you go to breakfast at an Italian American restaurant. Or maybe she doesn't know what good ingredients are. Or her rating the prices of food when she hasn't ordered appetizers of massive portions of deliciousness is not the brightest move. Or maybe she got take out and let it sit and was a poor excuse for an eater. Any of these options are possible. I've been going to the Allegro since I was a child. As a kid, my sister and I would order ravioli and fruit punch for breakfast. It is the greatest ravioli and sauce in the world! Not to mention the bread is fantastic and great for sopping up the sauce. Now, I'm a eggs, bacon and potatoes girl when it comes to breakfast as an adult. Everything is large portions and delicious - get outta here with that no flavor potatoes talk! The french toast is amazing and made with Italian bread so it's thick and great for glopping on the syrup - sorry you couldn't get some Mrs. Buttersworth sugar. My older brother always got the breakfast sangwiches and they're made on Italian bread and stacked with goodness. Grinders are just as good as everything else! Load up the meat, peppers, and condiments, please! And if you're able to get the lemon chicken as a meal, go for it! Best stuff on earth!I proudly stand up for the Allegro and can claim allegiance for 25 years and going! I only wish there was a way I could ship the food up to Boston every weekend! I make sure to go to the Allegro every chance I'm home visiting my parents!"], ["Missy S.", "Will do in a pinch......or if ur not super picky about a place having the best ingredients (ie....if Denny's quality is your thing) then u will love this place. Hubby only noticed it the other day....we thought it was new, but turns out they have ben there 35 years! Very surprising! LOL But they obviously must be doing something right, or it could be the fact that there is no other breakfast place on Franklin ave... I will try something again sometime im sure....maybe the omelets are better....Their lunches might be great....lots of Pastas and Italian stuff, I didn't even notice any burgers, sandwiches or that kind of thing on the lunch menu....just mostly 'dinner' sounding items...and i noticed the appetizers were 8 and 9 bucks, which seems high for a diner-ish place.....They do use incredibly fresh Italian bread for the Sammy's if u want, so hubby's sausage egg and cheese was on that. I had a bite, but i do not like ITALIAN sausage with my eggs.....would have been pretty perfect if it was breakfast sausage......One egg seems to get lost in the breading, both with the Italian bread and the 'hard roll' used on my sammy. Again, the middle got list in the big bread....one egg, and the bacon was crisy as i asked, but had no flavor and parts of it were just still white...it was almost like it was 'burned, undercooked bacon'' Ya know what i mean? I ate most of the sammy before pitching the rest.....Oh it also needed lots of back pepper for flavor.We got a side order of their potatoes....hoping they would be like Mo's cuz they grill them like that....but they were sadly naked and crying for spice! I added some pepper and a touch of sea salt but they definitely would have been much better with some garlic, onion and paprika, etc!We also got an order of French toast.....Now THAT was pretty great....I had to add some cinnamon at home, and use my own syrup (instead of the low quality packets they give u....total 'NO name' ...not even smuckers or kraft, which is the lowest grade i will accept. I grew up in Northern New England and true Maple syrup is the only way to go!) but the huge pieces of italian bread were soft and yummy with a chewy crust. Would def get this again......Will definitely update u next time we try something else from here....as i said to hubby, next time i should try the ham, egg and cheese and see how that is...and will definitely get a 2nd egg, and maybe double cheese and ham (since the cheese was pretty much invisible).....and with those fat pieces of Italian toast...u really need to have something substantial in the sammy!The people were pretty friendly....prices were decent too, at least for breakfast, i didnt notice the 'lunch' prices other than the appetizers....but for all that food: 2 breakfast sandwiches, a huge side order of potatoes (not sure if it was only one order or maybe he thought we wanted a double order and gave us two in the box...) and one order of french toast (3 huge pieces)and the total came to 15.00 and change.....that amount of food at most other places would be almost twice that!I will definitely try it again, sometime, and will update as needed! :O)"], ["Lucas A.", "This place is great for breakfast.  Whenever I am back in Hartford I go to allegro's.  Tasty omelettes and pancakes make this a great breakfast place with a friendly atmosphere."], ["Rocco B.", "I was introduced to Allegro Cafe about two years ago by my Fiancee's family, and I have gone almost every weekend since for breakfast.  in the heart of Hartford's little Italy they do everything to perfection.  The French toast is UNREAL, and the syrup does not come in packets.   it melts in your mouth.The use of fresh Italian ingredients including the bread peppers and sausage makes the breakfast meals to die for... the potatoes are seasoned incredibly well and always cooked to perfection.  the waitstaff has my drink ready as soon as I sit down, they are on top of it.  And there really is no need for a menu, because they will make any breakfast food that you would like... if you haven't tried it yet please go to Allegro Cafe in Hartford!!"]], "Restaurant Bricco": [["Phil A.", "I am very discerning and will slam a place if they deserve it, and I gotta tell anyone I know that Bricco is primetime player Italian restaurant.  The appetizer with prosciutto, mozzarella di bufalo and mini-arugula was aweseme.  The service was outstanding, the ambiance great with my client and the entree of penne, vodka cream sauce and grilled chicken was awesome.  This place stomps a mudhole in chains like Puka di Beppo or Carappa's.  Outstanding job, and I will be returning with my client, guaranteed."], ["Jasmine M.", "I can only review the penne ala vodka because once I had it for it for the first time I have never deviated. My fiancé and I love coming to Bricco for a date night. Service is ok but it's the quality of the food that stands out."], ["Deanna M.", "I checked this place out after reading the reviews its a nice place but there was this weird odor coming from the side of the building I guess which kind of ruined it when your eating outdoors I`m not sure if it was just that day? But the food is good and they give good portions and the drinks are great here to. The service here is also good I would deff come back again ....."], ["Kara W.", "We've had multiple wonderful experiences here. The great food and atmosphere make for the perfect date night. On a busy holiday (valentines day), the staff was courteous and even gave us a free appetizer for having to wait maybe fifteen minutes past our reservation. We expected the wait, so that was a nice gesture. The food and drinks are always delicious. Would highly recommend!"], ["Josh S.", "The menu is simple and eclectic. Items like a. Pear and goat cheese salad was simple but done well. I had tuna with shaved fennel that was cooked perfectly and presented with care and style. The homemade gnocchi also was highly praised by one of our group."], ["Carlos A.", "\"HOUSEMADE LINGUINI local golden cherry tomato, Deercrest Farms zucchini, speck prosciutto, garlic, & EVO $17\"PERFECTION. That's all I can say. I've had Italian food in LA, SF, NY, Chicago etc and the linguini was AMAZING. Who would have guessed? I certainly wouldn't have having just moved here from San Francisco.I am completely impressed and definitely going back soon."], ["Jake S.", "Great food, great atmosphere. Have been here a few times over the past year and will definitely be back"], ["Katrina Y.", "My first trip to Bricco's left a terrible taste in my mouth. And it wasn't because of the food- because we didn't actually get to have any. We were told it would be a 15-20 minute wait. Numerous couples arrived after us, and after 45 minutes they were all seated and we weren't. When we questioned the hostess, there was no apology for the oversight. Instead, she told us we were wrong and that those couples had arrived before us. So we left. And there won't be a second trip."], ["Bryant R.", "Went for dinner earlier this week. The calamari appetizer was pretty terrible: flavorless and indelicate. The scallop special entree didn't have much of the prosciutto they hade mentioned and was also essentially flavorless."], ["Steve S.", "I dined at Bricco's for the first time on July 8th.  I would strongly recommend this restaurant.  We were greeted with a smile and a genuine 'thank you for deciding to dine with us' comment as we were seated.  The service was the best I've experienced in a long long time.  Our server was very pleasant and attentive.  The support staff were exceptional as well.  As an example, one of our party wanted to use the rest room so we started to look around for it and within 30 seconds, one of the staff came over and asked if he could help us with anything.  This staff is very well trained. When we began to order, we had some questions and our server answered everything.  The food was excellent.  The time we spent together dining as a family was so enjoyable and relaxing, we can't wait to go back.  If the objective of Bricco's is to delight their customers, they did it for us."], ["Pat M.", "Hands down, best restaurant in the center.Consistently awesome food, great happy hour, and a personal family favorite (I'm a townie, born and raised).Meals:1) penne vodka with chicken2) baked rigatoni 3) pasta Bolognese Apps:1) antipasto2) aunt's meatballsDessert:1) Nutella PieMy mother swore by the scallops!  It was her favorite."], ["Chanhda L.", "The food here is awesome. I went on a crowded Saturday. We had to wait for a table but it was well worth it.  Black Spaghetti!! I can eat it for days. The portions are well worth the price and the service was on point. Only reason it wasn't 5 stars... our table was really tiny; Hard to maneuver when sharing."], ["Steven L.", "I went here for happy hour for the second time today and it was terrific. The bianco pizza is to die for and you can't beat the quality for the price. My sometimes picky sister inhaled the meatballs and margherita pizza. Also, the service was even better the second time. Not that the first time was bad, it was just average. Today's service was really good. Highly recommend happy hour; the prices are great. Haven't been for lunch or dinner, but highly recommend trying Bricco."], ["andrew l.", "We've eaten a lot of great Italian food around the country and in Italy (we go back often) so I always like to try new Italian restaurants. Unfortunately, we found the food pretty average, at best. I had the salumi and cheese plate to start which was no better than what I've picked up at the average deli counter. My wife had the fried calamari which was decent but nothing special.My wife's main was the carbonara which was bad. The sauce had no real flavor and was just thick. The pancetta, like my salumi, was just OK. My pizza was fine but nothing to get enthused about (unlike Harry's).Net, if you like authentic Italian, I'd try Treva."], ["Amy T.", "Excellent food!! I've tried the ricotta gnocchi and the wood fired rigatoni.  I loved the Brussels spout salad and the fried calamari.  Probably the best fried calamari I have ever had in my life.  Service is hit or miss, our first visit the service was excellent, but the second, service  was rushed and short.  Overall though, this is my favorite restaurant I have ever been to.  I highly recommend you come to this place at least once!!"], ["Sofia H.", "The homemade linguini blew me away!  It was out of this world!  I would highly recommend ordering it!  We also tried the mushroom pizza and it was really good too.  We will be back!"], ["Lisa M.", "We arrived early on a Friday night to beat the majority of the dinner crowd and got a table no problem. Our waitress was attentive and charming and not afraid to give her opinion when asked--I love that. Warm bread with a sweet potato butter was brought over, which I admit I was skeptical about but was delicious! We started with the meatball appetizer--2 large meatballs on a bed of arugula--very moist and flavorful. I had the Rigatoni Bolognese for my entree--nice portion size and an overall decent dish. However, Tom's choice was the pick of the night--the Bistecca Florentine pizza, topped with steak, spinach and roasted garlic, I wished I ordered this one. Another good experience!"], ["Rosemary M.", "I've never tasted or tried anything here that I absolutely did not enjoy ! Their portions are awesome and their prices are very reasonable. The service is outstanding . I love their pene vodka and their baked rigatoni. The salmon is a popular dish and delicious . The bread with sweet potato butter is super yummy ! This will always be one of my favorite restaurants"], ["Taryn M.", "Bricco was pretty good, but definitely not out of this world as far as I am concerned.It took quite a while for our server to greet us, certainly longer than you would expect for a restaurant of this caliber. After she did, our water glasses were filled and bread was brought over. The bread came out with some kind of butternut squash spread, which seemed like a strange substitution for butter.I ordered the bolognese dish and substituted whole wheat pasta for the regular rigatoni (points for offering both ww and gluten-free options). Unfortunately, I found the sauce to be on the bland side. I tried a bite of my boyfriend's pesto orechiette dish, which was also lackluster. The chicken sausage in his dish was the only thing that really stood out.Altogether, I wasn't wowed, especially considering the relatively high price tag (two pasta entrees + just water to drink = ~$40). There are other (better) Italian places in and around West Hartford where I would rather eat."], ["Jack M.", "My wife and I had a terrific birthday lunch with my son. Yummy wine list - the Pinot Gris went very well with the warm pistachio and goat cheese salad. Flat bread pizza and mamas meatballs were delicious. On a nice day sit out on sidewalk although the bar area is super also."], ["Nicole C.", "I've eaten at Bricco's several times before and have always had a good experience. Unfortunately, the service was terrible when I went last weekend for an early dinner. We got there at 4:45 thinking we'd beat the dinner rush but the menus weren't printed yet so we had to wait to sit until they were done. Our waitress didn't tell us the specials but we heard her telling tables around us. Our appetizers never came so all we had to eat was a salad and a pizza to split. We had to flag the waitress down when we needed things because she never came to check on us on her own. The service was ridiculously slow. It was such a disappointment since it had been 6 mos since my husband and I last were able to get a babysitter and get out without the kids."], ["Sarah L.", "I had my birthday lunch here today with my husband. I wish I could remember our server's name, because she was terrific. My husband got the baked rigatoni and I got the carbonara. They were both amazing. The calamari appetizer was one of the best we've ever had, and we eat a LOT of calamari. The ambiance is lovely--warm, cozy, and inviting. I got the apple crisp with vanilla ice cream and my husband had the creme brulee. The latter is another one of those things we ALWAYS get, and he said it was phenomenal (although the accompanying chocolate-chip cookie is an odd, if delicious, choice).We'll definitely be back! It's not a place for kids, but I think it would be a great place for a date night or a meal with friends. Thanks for helping to make my birthday special. :)"], ["Doug E.", "Surprisingly, my wife and I got in to Bricco the other evening.  Usually, we are talked down to by the \"welcome\" staff as we are told we'll need to wait and in a way that makes us feel so foolish for even having tried to come in.  Once seated, we were finally greeted by a very busy waiter.  After finally getting our drinks, I asked if all of the evening's selections were on the menu, to which the waiter replied, \"yes\".  Note, after we ordered my wife overheard that the table behind us was provided a verbal list of additions to the menu by their waiter.I ordered an old favorite, Fennel & Black Pepper Crusted Tuna.  I say old, as it seems that little changes on their menu.  Have you seen Dustin Hoffman in \"Chef\"?  While I guess to Billy Grant's credit he did change up this old favorite, but really.  Argh!  There were these slimy potatoes under the tuna.  The tuna was well prepared but the sauce, usually a nice combination of sweet and savory - it might have come out of some obscure bottle they bought at the local 7-11.  My wife ordered her old favorite as well, a gluten free Penne Ala Vodka, which she declared as \"delicious\".  Their GF pasta is our primary reason for dining at Bricco.Overall, West Hartford Center is a great place to walk around.  Bricco, like many of the other restaurants is difficult to get in to, has rude staff, and okay and sometime good food.  Add to that difficult and pricy parking, and we'll be looking to head out of the Center for dining.  Or, we might just order the GF pasta to go."], ["James V.", "Solid to excellent pasta plates.Friendly, not overbearing service.Monday night 1/2 price wine is great deal.Salads are interesting and delicious."], ["J D.", "Never had a bad meal here, or bad service. Upscale atmosphere, yet casual at the same time. Great happy hour with inexpensive and STRONG cocktails. They also have happy hour bites. Outdoor seating during the summertime is nice."], ["Jeannette D.", "I have only amazing things to say about this restaurant. We refer to it as the only place that we are consistenly happy with our meal...more than happy actually. The meatballs are amazing, the salmon always delicious and the penne ala vodka...my husband can not get away from. Bar sceen is great too! Can't wait to go back."], ["Queen A.", "I was invited to a birthday dinner and I ordered the FRIED CALAMARI withlemon caper aioli & spicy tomato sauce and my friend ordered the MARGHERITA San Marzano tomatoes, fresh  mozzarella & basil. It was so good I went the following week on Saturday for lunch.  I ordered the same appetizer. This time I ordered a glass of  Chateau St. Michelle Saint M.. The food was great and It was a  friendly atmosphere and the staff welcomed everyone ."], ["Anthony P.", "I love this place. The food is great. I still can't forget that savory sweet potato butter spread. I haven't been to a place that had a spread like that. Their pasta dishes, as well as their pumpkin ravioli is so yum. There is an air of snobbery, but that's what you get when you go to such a high class establishment."], ["Stephan C.", "We had the opportunity to try Briccos during our lunch. Had a wonderful waitress named Samantha. I would ask for her again. She was very friendly, courteous and helpful and knew all the items on the menu.  We ordered the Calamari and their salad with a pistachio encrusted goat cheese ball. Both were very good.  Samantha told us the calamari was prepared to order.  Very fresh and not chewy. Perfect coating. We also ordered one of their gourmet pizzas.  Another good selection but the competition for pizza in this area is tough. Next time we will order something from their plated section. The menu shows some outstanding dinner selections.  And they have Guinness on tap.  When we left our table, the restaurant was full with people waiting.  That's always a great sign. Especially when this area supports some of Connecticut's great restaurants.  Although we didn't need reservations, it's probably a good idea to call ahead."], ["Kristen C.", "This is one of the best and most consistent restaurants in West Hartford. I have been here probably 1/2 dozen times for both lunch and dinner and have never been disappointed. The food is fresh and flavorful, and the menu has a LOT of choices. Kind of a casual romantic atmosphere too."], ["Amanda D.", "This is one of the best restaurants in the center!  Its nice while not being stuffy,I have been here multiple times for both lunch and dinner, and the food and service is always great!  Each item on the menu has some uniqueness that makes it stand out and although I have not tried everything on the menu, I've never been there with someone who wasn't happy with their dish.  The calamari and home made pasta are always a solid choice, and you HAVE to get dessert.  The nutella pie is awesome, and the tiramisu is amazing (I'm not even a huge tiramisu fan, but I could eat this every day).  Great place for a celebration or just because, and typical prices for West Hartford."], ["Holly K.", "I really like Bricco. Their kale salad is delish, the meatballs are ridiculously good, and the spaghetti carbonara is sinful. I just wish they had a bigger bar, since it's hard to find a spot there, especially during happy hour and dinner. Look forward to trying more dishes!"], ["Nancy Z.", "I love this restaurant. The food never fails to wow me. The gnocchi are homemade and come in lovely sauces. The bread and squash dip that precede the meal are to die for. The chocolate torte is heaven... so chocolaty and minimally sweet. On a recent visit, my husband ordered salmon and said it was the best he had ever had. The atmosphere is romantic, but there are kids here and there. The waitstaff is knowledgeable and attentive. It's a little pricey, but it's worth every penny. Grants, Billy Grant's other restaurant around the corner, is wonderful as well."], ["Irene B.", "I can't believe I never went to Bricco until now. Whenever we pass by on a Friday or Saturday, it always looks so mobbed inside the restaurant. Luckily, it was less busy on a Sunday night. The dining room was full when we arrived, so we had a choice of waiting 15 minutes or just eat at a high top table in the bar area. We choose the bar since we were starving.I ordered the flirtini but wasn't a huge fan. My husband ordered a Cabernet which I think he enjoyed.They gave us some nice crusty bread with a really good butternut squash spread, very yummy.You really can't get any better than a place that makes their own pasta. I had a Bibb salad to start and my husband had a Brussels sprouts and pork belly salad. Both were really tasty salads. For entrees, I had the wood fire baked rigatoni and my husband got the chicken gnocchi. Both dishes were cooked well and I have no complaints. Can't wait to try some new dishes next time. Maybe the eggplant parm that they ran out of by 6pm. It must've been good.Might have to bump the rating up next time after we try some more dishes."], ["Kayla C.", "On a beautiful Tuesday night, I met my parent's here for dinner after a meeting I had in the area. For a Tuesday night, the place was packed!! They have a wonderful patio for enjoying the amazing weather, unfortunately, we were starving and it was ~45 min wait to sit outside, so we sat inside. They immediately placed a basket of fresh, warm bread in front of us with their sweet potato butter. The butter itself was good, however, I probably would have enjoyed it more had it have been more sweet, less savory with ?nutmeg etc. instead of garlic? However, that's just a personal preference- the butter itself was a nice alternative to typical butter, I, for one, stuck to the olive oil for dipping.We started with the warm pistachio goat cheese salad. I was a little disappointed as the salad was pretty bland--there was pistachio crusted goat cheese on the side, then the salad with some apples on top. It was good, it just wasn't as good as it sounded. I struggled in deciding whether or not to go with a pasta dish vs an artisinal pie and finally settled on pizza after asking the waitress what kind of oven the pizza was made in(wood-burning oven= done deal). I went with the fig pie--it was DELICIOUS-- fresh mozzarella, gorgonzola, fig(I was glad there weren't chunks of fig, but it was evenly spread jam-like over the pizza),  prosciutto, and topped with arugula. The combined toppings blended so well, with the sweetness being perfectly balanced with the peppery/zesty flavor of the arugula. The crust, however, was far too floury/bland with way too much bite, thicker than a neopolitan but still on the thinner side(I prefer a thinner crust-with some crispiness on first bite then soft,chewy flavorful dough- as opposed to just rough/tough to bite through, again a personal preference). I took a taste of each of the other meals-- penne ala vodka(standard, but fresh), jumbo shrimp scampi(delicious!!), margherita pizza(meh, okay, but pales in comparison to my favorite pizza places). Overall, the wait staff were all friendly and accommodating, all of the food was fresh and I definitely will be coming back!"], ["H. D.", "I thought this place was real nice. Very accommodating, waitstaff is friendly and knowledgeable of the menu. Clean comfortable, cozy atmosphere. Food tasted great!"], ["Staci R.", "Came here for lunch with my coworkers and it was absolutely delicious! We shared the apple and goat cheese salad as well as the calamari appetizers. Both were scrumptious! I had the Penne a la Vodka with shrimp while they had the BLT, Salmon and green bean mini plate, and the Lobster grilled cheese sandwich. Everyone was very pleased with their meals. The server was attentive and courteous and the prices were great for the quality of food we got. Can't wait to go back and try the pizza!"], ["L K.", "My wife and I love the food here. It is one of the few restaurants that consistently serves quality food and a superb dining experience. Our party of six last Friday night had an awesome experience. I had the tuna rare last night and it was very tasty right down to the trimmings."], ["Kurt S.", "Bricco is my favorite Italian restaurant in the area.  I used to always get \"My Mom's Spaghetti Carbonara\" and now have switched to the \"Wood Oven Baked Rigatoni\".  Best baked rigatoni ever."], ["Lauren B.", "I decided that I wanted to have my birthday dinner at Bricco. I tried to make a reservation, but they only take reservations for parties of 6 or more (HATE THIS but I'll save that discussion for another day). We showed up on Tuesday night, hoping we would be able to get right in, but the place was packed. We had maybe a 25 minute wait and then were seated. We ordered the calamari for an app, which was great. Salads were good too. I ordered the linguine with clams because it is my favorite dish ever, but I didn't really love it. It just didn't have the taste I was hoping for. Everyone else in our party's meals just seemed to be \"okay\".  We had the nutella cake for dessert which was pretty good. All in all, I wasn't totally blown away by Bricco. I would go back to try something else but I wouldn't go out of my way to go there."]], "Nolita Ristorante": [["Lan L.", "Very good. Dine in Service is a bit to slow for my taste, deliver speed is a hit or miss. But the food is always fresh. The shrimp dissarano is delicious. The parm truffle fries are my favorite. I've gotten lasagna, wings, countless Burgers, pizza (chicken Pesto, phenomenal!), braised short ribs... I could go on and on. Granted there were a few time my wings were under done and my special request weren't fulfilled, as in me asking them to add or remove things out of or on my dishes. I can't help but to give them four stars. It's a great place non the less and I would recommended this place to anyone."], ["Mechelle T.", "I have been to Nolitas 2-3 times dining in and also for take out. Great food and good service. But tonight's takeout order of Asian lettuce wraps were to die for even without peanut sauce (order came with peanut sauce, i did not use it) they were superb. Nice quantity and bold flavor."], ["Cherie G.", "I visited Nolita for the first time a few months ago with my boyfriend.  What a great find!  We came here blindly based of a few good reviews we saw when searching for a new spot to check out. I loved the atmosphere, very modern and clean.  Definitely a wide variety of incredible craft beer.  Mixed drink menu was also unique.  The food we ordered was amazing and the service just a good.  Our food order was running behind which we really didn't mind because we were enjoying ourselves (and the drinks) and the manager came over to apologize and offered us a free dessert!  I can't wait to come back here!"], ["Maryann L.", "During a group business trip, we decided to go to Nolita and it was the best decision we made.  The absolute BEST Italian food we ever had.  Presentation and fresh taste was perfect.  We highly recommend this fantastic Italian restaurant....and the taramasu. .......do NOT pass on dessert.  You will regret it!"], ["Jan L.", "Stopped in for lunch. The bartender had to double as our waitress and she was pretty nice. I got a porta burger and it was pretty good. My friend got the dinner lasagna and that was a lot of food! Not too many dine ins during lunch time but the decor is decent. I would go back and try other items and maybe see the ambiance at dinner time.Three stars since I didn't think it was outstanding amongst Italian places."], ["Peter A.", "The hotel we were staying at said they had the best italian in the area, so we decided to check it out. Luckily our hotel wasn't lying. The atmosphere was relaxing which paired well with their waitstaff who was very friendly and able to joke around with everyone at our table. Expecting to only dine here one night ended in three nights of full bellies! All I can say is that you have to try the Pesto Chicken Tortellini, it's magnifico!"], ["Daryl P.", "I've come here a few times and I have always been surprised by the local beers they have on draft! The bartender, Andy is always up for a conversation about the local beers and steers you into finding one that is good for you.The seating here is spacious and allows me and my party to do our thing without bothering others but the atmosphere allows those in the bar area to strike up a conversation easily and just have a good time."], ["Kristin A.", "I ordered delivery last week - took a little longer than an hour but the food was delicious. I've driven past the restaurant and keep making mental notes to go dine in. I'm hoping they have a best bar area and menu. I was very pleased with the food and will be ordering/going back!"], ["Rebecca H.", "first time here, came because of the reviews and was far from impressed with the food considering the higher prices. Service however was very nice but the karaoke at the bar during dinner was extremely tacky."], ["Monique B.", "Super good. Love that they are open late and super tasty. I had an awesome drink and scrumptious burger. My husband had the shrimp ravioli which rocked his world. Will be here again. Fo sho"], ["Todd Z.", "Had to update to five stars from 4! Came in this time around and met one of the owners. AWESOME guy talked to us for a while as we waited for take out. Give this place a try!"], ["Sohail C.", "Modern, comfortable ambience and good customer service.  The food is also very satisfying.  Definitely a proper joint."], ["Ashley F.", "Ordered over 2hrs ago through GrubHub. Our food was expected to ship within 1hr which is why we chose this place. After an hour, I called to check on the order. They said it was ready but they were waiting for their delivery driver to get back. That was an hour ago! This restaurant is 3 miles away! I can't tell you how the food is yet but use caution when delivering."], ["Chris D.", "Good burger and good fries.  $12 with bacon, cheese and fries.  I will be back to try some other stuff for sure.  Another patron had  roasted on the bone that looked awesome.  I wanted to eat that too.  Next time."], ["Missy K.", "My husband and father had dinner here tonight and it was the best! The bread was amazing and kept us full. The restaurant was beautiful. I had the chicken Alfredo meal which was very creamy . The salad was refreshing."], ["Lydell A.", "Thought I had reviewed this place before. (Strange/suspicious ) Guess not. Anyway, this place is cool. I was able to catch breakfast from here before they stop serving it. Very decent portions but definitely overpriced for my omelet and waffles. I guess it doesn't matter anymore because they no longer offer breakfast. Now tthey focus on lunch and dinner and they do a significantly better job with that. I've had the pizza, the wings, and a couple calzones from here. By all means, always get the calzone. This place has some of the best calzones I've ever had anywhere. Pizza was good but not anything special really. Same thing goes for the wings. I love the fact that they deliver. The waitstaff is OK. They can be a bit slow sometimes and attentive at other times. My experience has varied greatly. Most of the time the food takes a while to get out. Whenever I've eaten there it has taken way too long to get my food. When I've ordered for pick-up the food is always hot and ready when I got there. My suggestion? Call ahead and get a calzone for take-out...  Enjoy ;)"], ["Taikwon D.", "Well, I usually get the grilled chicken wrap. I love it! I work in Hartford and when I call in my order they say 30 to 45 minutes, but they are usually there sooner. When I open the box the wrap is sliced. The fries are a little soggy (to be reasonable they are being delivered, and the steam is trapped in the box) but they are still good."], ["Susan W.", "I highly recommend you only get take out from here and don't dine in. I live really close by and it's convenient and delicious for take out. Recently, though, I had an experience that left me perplexed and far less willing to regularly eat at nolita's. It pains me to write this terrible review because the food is great; however, the service is bar none, some of the worst I've seen. I've recommended friends and coworkers try this restaurant before, and they always come back with the same reaction: great food! Terrible service! A few friends were visiting and I had raved about Nolita's food, so i decided to take them there. I had never eaten in and always get take out. Our party was only 5 people, and they told us they couldn't seat us for 20 minutes even though half the restaurant was empty. We proceeded to ask why we couldn't be seated immediately and they said it was because a large party was coming in 30 minutes because they didn't want to overwhelm the kitchen, and now the wait would actually be 45 minutes. Apparently they weren't going to tell us that the wait was increasing until we asked why we couldn't be seated.We were in a bit of a time crunch, so we asked them if we could order take out. To which they said of course, it will be ready in 15 minutes! Clearly, they were not concerned about overloading the kitchen if they could prepare take out in 15 minutes. 15-20 minutes pass and we return for our food, and the hostess tells us that we need to wait an additional 20 minutes. At this point, there is still no large party in sight that was supposedly coming in 30 minutes from our arrival. We asked to talk to the manager, because at this point we were waiting for almost 45 minutes just to figure out what the heck was going on. While waiting for the manager, my boyfriend noticed on the hostess stand that the large party was scheduled to come in at 930pm; we arrived at Lolita's around 730pm....They claimed that the party changed their reservation to far later. I can't tell you whether they were lying or not, but either way, they repeatedly used that as their excuse even after they aware the party was arriving far later.Finally, we receive our food, and the manager tells us she put \"extra bread\" in for us. Well, thanks, i guess 45+ minutes of 5 peoples time is worth some extra bread... She proceeded to explain that Nolita's i not usually that busy and they were struggling to keep up. I'm not a restaurant expert, but if you can't handle a half filled restaurant on a Saturday night, then you're in trouble. I'm taking the time to write this review, because I really want Nolita to succeed; the food is superb, but a restaurant needs the whole package to succeed. They need to get a new manager and a new staff, or at least train their current staff, because the level of unprofessionalism and confusion from the staff completely detracts from food and experience. Nolita's not only needs to improve their actual service, but how they respond to poor service. \"Extra bread\" does not suffice, a real apology with some sort of compensation would have. As of now, Nolitas is only good for takeout. I didn't believe my coworkers about there service, but now I see exactly what they meant."], ["Jeff S.", "You may not think much of hotel restaurants, but this place may change your mind. I visited here on a chilly Monday night. It was very quiet, but there's a reason for that: the speakers in the dining area hadn't been connected yet. The hostess explained the restaurant hadn't officially opened yet, and that this was their \"soft opening.\" I'd say they're off to a great start!  The decor was simple but well done, and the tables looked really cool. Linens were real cloth and flatware was solid (that's important to me)There were two menus, one for dinners and one just for pizza. Of course I had to try one of the stone oven pizzas!  To go with it, I chose a homemade Italian-style raspberry soda. The soda was a rare treat. I'm a big fan of soda, though I find myself less and less attracted to the sugary canned stuff. Topped with whipped cream, the raspberry soda was delicately flavored, not too sweet, and not too fizzy. I'd drink this stuff every day if I could. While I waited, the waitress brought out some tasty bread with marinara sauce to nibble on. The bread \"nuggets\" were freshly toasted with garlic butter, the sauce was warmed and seemed homemade. Now, for the pizza!  Delish. I like spicy food, so I ordered the \"Fra Diavolo\" - spicy sausage and hot peppers. The sausage chunks were just the right size for a pizza, not too big or small. The peppers were whole rings including seeds, so in other words, full power. Yep, this pizza had some kick. The crust was well done. Thin, but not greasy or soggy anywhere. Good flavor. I didn't have a chance to try any dessert, though I would have been satisfied with another soda, I think!The waitstaff was friendly and attentive, and eager to please. Well, it worked. I left happy!  Thanks for the great dinner."], ["Dorthy D.", "Tried nolita for the first time today and it was amazing!! I had the white sangria which was good but I wished I had ordered the coco locomotion it was delicious. Then I had the truffle fries and nolita sampler. It was so delicious. My husband had the ricotta and pea ravioli and loved it. I had a caprese salad. Everything tasted so good. The server Sue was very friendly and amazing. We will definitely be back"]], "Salute": [], "Rizzuto's Restaurant & Bar": [["Mari K.", "Overall, I'm a fan. They have a pretty good happy hour, with different appetizer specials (including personal pizzas) and $5 drinks. The sliders are great! The dinner menu is a little pricey but some of the items are just delicious. I've now been here twice for brunch as well, and was less impressed with brunch than dinner both times. However, the Hot Mary (a spicy bloody Mary) is very good, and the home fries are some of the best I've ever had. The salmon benedict is also very good. I expected to be blown away by the breakfast pizza, but it was just OK. Overall, I think this place is better than OK because of the great service, the fun decor, the happy hour, and the food items they serve that are truly delicious. I'm plan on continuing to work my way through the menu to find my favorites!"], ["Kelly C.", "Happened upon Rizzuto's as we were debating where to have our post-Celebrate West Hartford lunch. Some in our group were leaning towards the Celebrate food tents, some were pushing to go to Max Burger or something else in the Center, and as we were discussing we walked by Rizzuto's and decided to peek in. They had an open table, a brunch/lunch menu, and air conditioning, so we were set.Our waiter was a little absent-minded (refilling the waters for everyone except the one who had asked for a refill) but he was very funny and personable. He chatted with us just enough to make an impression without overstaying his welcome. He also gave us great recommendations.We had a large-ish group for a walk-in (6 people) so I was impressed with how accomodating they were and how quickly we were waited on and served. We were convinced to have cocktails after initially balking at the price ($8 I think) and then realizing they offered $4 refills. YUM. I had the peach bellini, which was even better than I had expected. The others at my table had the South Beach mimosa and the Maui mimosa, which both got positive reviews as well.The food itself was decent - not amazing, but not bad. A few people in our group ordered from the brunch menu and got mixed results; the cast iron frittata especially got a thumbs down. I think that the waiter and the drinks are really what made our experience positive, whereas the food was just plain acceptable. I've heard a lot of positive mumblings about Rizzuto's so I was glad to finally try it out - I would revisit for another brunch or Happy Hour, but would not have high expectations for the food."], ["Ashley L.", "Drinks were good, wait staff was good, calamari was ok (if a bit chewy), food was good, all in all it was just \"good\" Nothing blew me out of the water but it wasn't a bad meal. A bit overpriced I would say for the food we received. 2 people, 3 drinks, one app, 2 dinners, and one dessert for $100+I much preferred the food and ambiance at other places around blue back."], ["Erica K.", "Excellent service and food here! I went for Happy Hour with a few friends and it was fantastic. Jose was an excellent waiter, nice, professional and personal.HH is one of the best in WeHa. So many great options. We ordered meatball sliders, shrimp and butternut squash arrancini, sourdough bread, grilled cheese with pesto and a few other dishes that we ate so quickly I didn't even have time to take a picture. HH is 4-7 at the bar area and it is inexpensive, high quality and delicious! Great service!"], ["Sarah C.", "Those of you who know me, know that I value customer service and experience almost as highly as food quality when dining out. I was recently re-introduced to Rizzuto's during a yelp elite event after about a 3 year hiatus. Somehow, even as a West Hartford resident, it fell off my radar. I will have to apologize to them for this because when I went back with my husband after the (spectacular) yelp event, they blew me out of the water in both of those areas. Ive come to expect a pretty high level of service and good food from almost all restaurants in and around Blue Back Square, but Rizzuto's really stood out. I'll start with food and preface this by saying the only reason i didnt give them \"5-stars\" yet, is because I want to go back for a full meal. We only did happy hour drinks and small plates. My husband got the sliders - two mini-burgers that were perfectly cooked and seasoned. For such litle burgers, they packed a lot of juicy flavor, came with onion stick fries, and a deli pickle. I got the flatbread with a sweet a spicy fig-bbq sauce. It has chicken, caramelized onions, and some cherry peppers. Spicy, but not too hot, and really delicious. The fig adds a nice element to what otherwise might be a standard BBQ sauce. Both were a great size for $5. It also came with home-made semolina bread and marinara for dipping--- delish.Now service: this is where they really got me. Our waitor, Taufiqul, was outstanding (he also worked the yelp event i had been to prior). Polite, warm, friendly, well-spoken, knowledgable... he was all of that. You got the feeling that he genuinely cared about your dining experiene and would have gone out of his way to make sure it was the very best. What impressed us most, was actually over hearing him talk to the table next to us. They were new in town (had just moved) and this was their first time at Rizzuto's. Taufiqul thanked them for choosing the resturant, welcomed them to town, gave recommendations, and really set an amazing tone. After he left the table, the couple looked at each other, commenting on his professional and friendly personality. I feel like diners really appreciate that, i know we do.Thanks to our wonderful happy hour experience, we cant wait to go back for a full meal!"], ["Maria M.", "I came here not too long ago and honestly I cannot remember what I had.  Which in and of itself says something about my experience / the food.  What I do remember, however, is that we were seated right near the food pick up line which made for a noisy evening."], ["Theresa R.", "Solid, classic Italian food with an awesome selection of small plates/antipasti! So great in fact that I have sat at the bar and had a bunch of delicious apps as dinner many times. I'm bummed that they put an end to their awesome happy hour - free salad/app bar with purchase of drink - but it's because people abused it (you know who you are, shame on you!), although the new one is still good. Oh, and brunch is FABULOUS! The organic kale and grilled tomato benedict topped with pumpkin seed pesto, perfectly creamy and savory hollandaise over toasted english muffins was to die for - all for an affordable $13! I'd bet that dish would go for at least $16-20 anywhere else in WeHa center. The wine list is naturally Italian focused but not novel length and has reasonable price ranges. I love that they infuse their own liquor for their cocktail menu - really makes a big difference in quality and taste! The only aspect that has been inconsistent for me is the service. I've never had a horrible experience, but I've never had a great one either, and sometimes the bar service can be really slow. Regardless, I really like Rizzuto's! I can't wait to check out their other locations!"], ["Marina B.", "Ridiculously awesome desserts. While the food is really good and full of flavor. However,one of the best kept secrets happens to be their incredible desserts. Creative, seasonal and so many different flavors going on. Key lime torts, Tiramisu truffles, ricotta cheese cake- all top notch.All I can say is always save room for these deserts."], ["Kristen M.", "We have experienced truly outstanding service here.The good: - The ambiance - large, high ceilings, brick oven smells. Very warm and inviting.- Food is great. Italian American dishes. My fave is penne ala vodka and I ask them to add veggies. - We had our rehearsal dinner here. Staff was very accommodating. Prix fix options were affordable and good was great.- also great happy hourThe bad:- nothing bad. Food is good- nothing new and different per se. Overall: great casual place to go with friends for food and drink."], ["Becky C.", "Have been here a few times and the staff is great, especially Henry (an excellent waiter and you can tell he loves his job)!  They do need to have another dollar sign added for the pricing though. Usually very pleased with the food, although the tuna this time was not up to expectations. I do love that they use local farmers! Overall a great place, just need to anticipate spending a little more than we had expected on entrées."], ["Amanda L.", "Came here a long time ago during lunch hours and I was very impressed by the modern decor. Our waiter apparently recognized me but silly me embarrassingly did not recognize him. He was very accommodating though! We ordered the Prosciutto Arugula pizza (mozzarella, EVOO, fig-infused balsamic). This was back then when I was a young college student and didn't know any better and had expensive taste and discovered that I was indeed, not a fan of prosciutto. Personal preference, but I'm sure a real prosciutto lover would love to delve into this pizza. Although, I did not have the greatest first experience here I wouldn't mind coming back and trying a different dish. They have got some fancy Italian cuisine here!"], ["Katie H.", "Came here with a large group a few days ago for their happy hour drinks and food, so I can't comment on the regular food. Although I don't have a whole lot of Blue Back happy hours under my belt, this was my favorite one so far. We each ordered a special cocktail on the happy hour menu and were pretty pleased with our drinks. I got a lemon drop martini, which was nice and strong. Overall, great selection of drinks, and the beers are decently priced too.  With our drinks happily settling in our bellies, we decided to order a bunch of happy hour bites to share. We got the bruschetta, grilled chicken wings, truffle fries, fried calamari, meatballs, Italian mac and cheese, and one of each of their three pizzas. Portions are small, so if you're here for a full meal, plan on ordering at least 3, maybe 2 if you're a light eater. The truffle fries were great--crispy and aromatic with what was likely truffle oil, though they were mysteriously missing the housemade ketchup it was said to come with. The fried calamari was also well-received. Tender, lightly fried, and with both marinara and aioli for dipping (which I appreciated, since most places just give marinara). The biggest surprise for me was the Italian mac and cheese. I'm not a huge fan of mac and cheese, but this was so creamy and flavorful, and the pasta still had the right amount of bite. That was my favorite, and my friends at the table were saying that's the one they always order as well. The meatballs were soft and flavorful, and both the margherita and prosciutto/arugula pizzas were enjoyed, despite their small size. The chicken wings were no better or worse than your average bar wings, and I didn't get to try the bruschetta.The service was fantastic. Both bartenders were friendly and fast, and our waiter was extremely polite and attentive. The prices are a little high for the portions of the food (most happy hour dishes are $5-6), but the quality was on point, and I would gladly come back for more happy hours."], ["kelly m.", "Indecision took hold looking at both the drink menu and the food menu. The server was very patient and helpful. Ordered the margarita and osso bucco and my friend ordered pinot noir and pasta. Everything was top notch."], ["Abby B.", "The food at Rizzuto's is excellent, but you never know what to expect when it comes to service. I've had excellent servers who go above and beyond, but I've also had bartenders roll their eyes and get an attitude for simple drink orders. I think they hate their own happy hour crowd... Love the patio. They seem to be well connected to local food and can certainly cook. Worth a try for sure."], ["Justin S.", "Steph was our waitress and she was amazing. Great food, excellent selection of wine and amazing customer service skills. Food was timed perfectly throughout our meal. A nice place to bring someone in a date, looking forward to my return."], ["Elena Z.", "Service in bar area is horrible. Totally quiet empty and the bar tender/waitress is seriously neglecting her tables. If it was crowded is get it- but it's not. I could go elsewhere...."], ["Chris F.", "Just came from Rizzuto's for lunch - had the lunch sized Cavatelli which as very tasty and good,  but was a little disappointed with the portion size for $14. It would be nice if there was a roll or piece of bread if you don't want to change the portion size. I also noticed stains on the ceiling tiles. I understand the Winter was very difficult this year for all of us but get those fixed or painted, it's almost May :-)I understand BlueBack Square can't be cheap for rent - but I was expecting a bit more in terms of value. The Cavatelli was great though, very nice and chicken was tender. Our waiter (Ian) was also super nice and attentive."], ["Audrey J.", "Came here for lunch after graduation, did not expect the place to be as empty as it was. But although there were barely three or four average-sized groups in the place the entire time we were there, the waier/waitresses still took their sweet little time. I don't usually get mad, just annoyed, but this place was genuinely frustrating. It took a ridiculous amount of time for our waitress to come after we were seated. And she left without even giving us a menu. She took forever to come back, at which point we had to ask for the menus to be given to us. Then she gave us both the lunch and dinner menus, which we figured out a good ten minutes later...and when we (confusedly) pointed out that we had two completely menus (unmarked whether one is lunch or dinner) the waitress brushed it off saying that \"the menus just get mixed up sometimes.\" um excuse me isn't it your job to keep them straight? Even the food took forever to come out. The calamari and jumbo shrimp appetizers were delectable, very much on point. The daily special pesto pine nut tomato pizza was decent. a bit soggy from all the oil, the crust was crisp and chewy. the daily special turkey burger was disappointing. it was a sad picture of bun, limp onions, and patty, and the side salad looked unwashed and stiff. the chicken cava-something (pesto cream) was pretty good, but it needed something fresh and crisp and spicy --- so basically kimchi."], ["Ashley N.", "Stopped in for a drink after eating at the Celebrate West Hartford festival. It was so nice walking into air conditioning after blazing in sun, though I'm not complaining...this has been the longest winter and that says a lot coming from a girl who grew up in Wisconsin! I had the summer shandy which they had on tap for about $6.25 (overpriced). The bartender was quiet but friendly...though we were watching some car race and my bf was clearly into it and she switched the channel to a baseball game. Now, that would have been fine if it was a game people were interested in, but no one was. I do look forward to coming back to their happy hour which seems to have gotten an upgrade. Their happy hour used to have a free buffet but from the looks of the chalkboard above the bar, they have changed that to a few items on special. From past experience, their pizza/flatbreads are pretty good but don't want to review too much on the food since I haven't eaten here in awhile. Update will be coming soon!"], ["Larry S.", "It official - we love coming here. We were so surprised to figure out it has been six months since we are hear last.  We tell friends al the time we like to sit at the bar, enjoy a glass of wine and have an appetizer ( hey,  shopping is hard work so we need sustenance!). What made it super was the same very nice, very efficient and very  customer focused bartender. We were glad to see \"S\" again. After a few minutes conversation she remembered us as we did her. Now the food, Loved the meatballs! Love the sauce! Tried the ArugulaSalad - great!! Bread choices were ok...did this change? Still good, especially when allowed to soak in the sauce ( ok thats decadent).We promise to back sooner than months - and we will bring friends. Meet you there mid Sunday afternoon. Quiet and pleasant."], ["Brigit C.", "My family and I visited Rizzuto's for the first time today (Mother's Day).  We wanted to try something new, and saw Rizzuto's has a very good [regular] brunch/lunch/dinner menu and has been given high praise.  We were seated and learned shortly after that we could only choose from the short Mother's Day [price fixed] brunch menu, which had about five meals and a long list of cocktails, or choose the buffet.  We scanned the menu and saw little selection, then scanned the buffet which had food that was picked over (despite that it was 11:30AM) and limited as well.  When I asked the waiter if we could order off the menu because a member of my family has a food allergy, he stated we could not.We decided to leave and went to a favorite restaurant instead.  Rizzuto's did not make it clear that patrons had to choose from meals on the Mother's Day [price fixed] brunch menu.  Other restaurants allow you the option to order off of the special price fixed menu or the regular menu.  If we did not have a restaurant that would accommodate us, the special day would have been ruined.  It should have been made clear by Rizzuto's that there was a limited menu, and the chefs/servers should have been more flexible.Though I am not pleased with the experience that I had today, I will hesitantly try Rizzuto's again--on a regular, non-special day--in hopes that I will have a better selection for a meal."], ["Paul F.", "Excellent foodAnd the service from all staff was very accommodating - even sweet. Highly recommended."], ["Adam L.", "Been a fan of this place for several years now. Often come around the holidays during holiday shopping with my wife. What brings us back time and again is the cheese and meat plate. Always above and beyond any in the area with locally sourced cheeses and exceptional meats. A few glasses of Italian wine and you don't need much else. Service was great tonight even though the were swamped as usual on a Friday night. Went for the Osso Bucco tonight with goat cheese polenta-light on the polenta which was nice as I did not leave stuffed and the veal was tasty along with sautéed greens most likely kale. Wife had 40 clove chicken - yep there were 40 - still good. My daughter had the penne alla vodka with chicken and it was exceptional. Looking forward to the next visit - going deep on the cheese and meat platter for sure!"], ["M W.", "Came here for dinner with a group of 6 at around 8pm. We called ahead just to make sure we got seated. We ordered the muscles for an app, some of them were a little sandy, so the rest of the group didn't eat them but I did! I was in the mood for a carbonara but they don't offer it, so I was able to improvise. I ordered a pappardelle with Alfredo sauce, chicken and prosciutto, totally hit the spot!!! I love when a kitchen has the ability to be creative for a customer. All of our entrees were satisfying a bit pricey but had a great experience. Would come back again!"], ["Mandy N.", "Their lavender cosmo is the lavender drink all other lavender drinks aspire to be."], ["Cridick G.", "I have been here twice and I have not been disappointed. It is a great place to go for lunch or dinner if you are in the area. They have a decent selection of beer on tap and their ravioli was (insert positive adjective here). It had a baby spinach and mascarpone filling with asparagus, mushrooms, wood-roasted cauliflower, garlic butter, evoo and parmigiano reggiano. I am looking forward to going back and trying more of what they have to offer."], ["Patrick D.", "Rizzuto's is severely underappreciated in trendy West Hartford, with its ADHD-like attention on whatever restaurants have opened in the past month or two. Somewhat quietly (if that's possible in Blue Back Square), it keeps putting out great food, drinks and dining experiences year after year. I've gone here several times, and it's only gotten better and better. It's a great atmosphere, too...very modern but warm. Looking forward to going back to check out their happy hour specials."], ["Janelle S.", "I stopped in to Rizzuto's with some friends for Happy Hour yesterday (Tuesday) and I was excited to check it out, since I saw so many tasty looking options on my last visit to Rizzuto's. There were still a few tables in the bar area when we arrived, so we huddled around a table.  We saw people who came in after us and found tables themselves in the bar area, get served drinks way before anyone even acknowledged us.  After another few minutes of sitting there with no service, we were able to flag someone down for help in ordering drinks.  After that, every time we needed something, we would once again have to flag someone down.  Maybe it was because we were a younger group of people, the staff felt that we wouldn't tip well or didn't belong there, but I did not like the vibe.  After sampling a few of the happy hour apps (which were on the small side - but reasonably priced), we decided that we were still hungry for dinner, so we migrated to a dinner table.  Unfortunately, the service did not improve in the dining area.  While we got our food in a timely manner, and it was on the tasty side, it took forever to get our bill and then pay our bill, because our waitress disappeared.  So, once again, this left us having to search around for someone to help us settle up so that we could leave.  This was very off-putting to me and I likely won't be back here anytime soon.  Not impressed at all."], ["Slash I.", "I have been a WH local for a long time and this place is one of my go-to's. Happy Hour is great, and the newer hh menus are delicous. Some of the items need to be added to the regular menu. Love the variety of cocktails and craft beers here, always something to choose from. Bar staff is excellent, always willing to suggest a new concoction they have going. I'm a pretty picky person when it comes to drinks, and this place really has it down. Service is great and bar manager Jen is always at the top of her game. Many happy hours under my belt around West Hartford, but the bar staff and selections make this place my go-to. If you haven't tried this place out yet, you are missing out. Have recommended it many times to personal friends, but felt that this would be a great way to recommend this place to those I don't know."], ["Marisha V.", "Overrated restaurant with hit or miss service. The food is just on par and the menu lacks creativity for dinner services. They have 1 hot meat app, and the rest were fish. The wood fired clams were the most creative that differed from the bruschetta or typical calamari. But, the menu described bacon and shallots with clams; instead,  it was overwhelmed with carrots and celery. We have been before during happy hour- which is clearly their bread and butter. I recommend going for happy hour- but, that's it."], ["Justin F.", "Good atmosphere, cool layout.  We really wanted this place to be great because of previous recommendations, but it was average at best.  The waitor let our drinks run empty (my biggest pet peave) and they messed up our appetizer.  The dinners were pretty good just a bit overpriced."], ["Rachel F.", "Great food, mediocre service. For me food and service are equally important. Unfortunately for this place, the food far surpasses the service. Do yourself a favor and sit at the bar, order all of your food at once and enjoy the food. Don't come here expecting to be treated like royalty, but expect to eat like it. Get the antipasto and the meatballs!!!"], ["John B.", "We love Rizzuto's.  The ambience is really good and our server last night, Henry, is awesome.  He's attentive and professional, and our 3-year-old daughter loved him.  Along with Jose they are two of the best servers in the Hartford area.My wife's pasta bolognese was perfect, my pasta with meatballs, sausage and mushrooms, made to order because I'm lactose intolerant, was awesome.The kids' menu is large and fairly-priced.This is one of our favorite places to hang out, either at the bar, which is large and fun, or at a table, and last night confimed it.Rizzuto's does it right."], ["Dan R.", "This review only applies to their amazing Happy Hour.Is $5 more than you would expect to pay for a draft beer or glass of wine in fashionable West Hartford? Nope, not at all. Well, let's sweeten the pot, how about $5 for that cocktail PLUS a fabulously free buffet. Hell, yes, Bubba!! Between 5:00 and 7:00 from Monday through Friday this is the amazing deal that you will find at Rizzuto's.  We arrived a teense before 5:00 on Monday, were served by a truly delightful young lady named Katie, and ordered two of the $5 beers. I couldn't resist trying a Naughty Nurse - it was reddish and reminded me a lot of Killian's -very good indeed. The free buffet included vegetarian egg rolls,  pickled vegetables, broccoli in a blue cheese sauce, cole slaw, roast potatoes drizzled with cheese, a pasta salad, an antipasto plate with salami, olives, and hot peppers, and a nice green salad, FOR FREE !!We've been to Rizzutos a few times for dinner, but this was our first stab at the Happy Hour. It really was a terrific deal. The bar is gorgeous and spacious- not too crowded on a Monday. Katie told us that as the week moves on toward Thursday and Friday, the food gets a lot better (how about freebie pizza?) but the bar predictably fills up a lot earlier, sometimes would be Happy Hour participants are stalking for empty seats at 4:30. We had a fabulous time and plan on reprising the evening in the near future."], ["Susan P.", "Enjoyed a good meal on a Saturday night. Made reservations through open table for 7:15. Was initially seated at a booth by windows, was asked to move shortly thereafter as someone reserved that exact table? Strange. Service was good. Fried calamari and bruschetta appetizers. Entrees were pappardelle and linguine with clam sauce. Both were tasty. My daughter ordered a cocktail which the waiter forgot to get after he gave us a 3 minute spiel how great the pink lemonade drink was. He indicated it would be free of charge, but failed to have it removed from the bill. Restaurant was noisy and lively, hard to have a conversation."], ["Eva B.", "We come here a lot and it's always hit or miss. Meat and cheese plate is always great. The wine list and cocktails are also very good. The simple pasta dishes and pizzas are tasty and well prepared. However, more complex dishes are below average. Osso bucco should be tender enough to eat with a fork but I found it to be tough and dry. Some of the pasta sauces are much too oily leaving an oil slick at the bottom of your dish. Meats and fish tend to be either undercooked or overcooked. Difficult for the chef to get it \"medium.\" That said stick to simple dishes - salads, meat & cheese plate, pizzas and you can't go wrong. The waitstaff is always friendly and efficient. I would give them 5 stars!"], ["Patrick G.", "Great meat and cheese!"], ["Sandilynn K.", "What a surprise! The patio is busy on a beautiful sunny day and one server is getting his butt kicked. The meat and cheese plate was good, we first got delivered the wrong selection as it was mixed up with another tables, which was realized about 2 mins after I started eating the olives, which I told them, so hopefully they got rid of them though I feel they should have left the Olives if they were going to toss them anyway. The minestrone was cold, which grossed me out so it was sent back. The Caesar salad was good, I ordered it with shrimp which to did not come out with,so I guess they didn't want my $11. Margherita pizza was good as well, thought the crust was under salted, and the edge was burnt. If I want burnt pizza, I'll go to New Haven, thank you. Our server was nice, but clearly not concerned with us since we weren't complaining to a manager. It was a little frustrating to wait so long for our main meal and then sit there for several minutes with dirty plates in front of us, while the management fawned over one table who complained about getting the wrong cheese plate 2 times. After I sit looking at dirty plates for 20 mins or so, no, server, I don't want a dessert menu after the table sitting less time then is already has coffees and a dessert menu in front of them. Everyone deserves equal attention high maintenance or not. I guess I need to be a jerk to get good service, who knew?"], ["Rosemary M.", "I was actually pretty disappointed. I came for happy hour where you buy a drink and have a free \"buffet\". However the buffet consisted of 4 plates of food that was not heated and just sitting out there. There was a pasta dish, cheeseburgers, and potato salad. I then ordered from the menu. The bruschetta was pretty good and the arugula salad was delicious . However my ravioli was horrible ! It was a huge flat noodle with a tiny tiny center stuffed with barely anything ! Super salty and oily as well. Super disappointed, especially since I paid $20 for it! My roommate ordered the sweet  potato tortellini and it was nothing special . Our waiter Henry was nice and attentive . The dark chocolate s'mores dessert was good but the portion was small . The cranberry orange margarita was great and the only reason for the 2 star. I do not think I will be coming here again ."], ["Steven T.", "Monifa and I walked into Rizzuto's restaurant this past Saturday for a sweet dinner.  We were welcomed with a smile and no wait list.  It was fantastic! I must say that the service, food and experience was a delight and on point. We shared a starter salad with presunto (prosciutto), arugula, artichokes and shaved grana padeno.  Along with the salad we had the mussels steamed in tomato.  We agreed that the salad was just ok, but the appetizer of mussels was large and in charge....we loved it!  It felt like a meal in itself.   My entree was the Funghi pizza.  This had mushrooms, garlic, pancetta, arugula, evoo and I had chicken added to the mix.  At an additional cost of $2.00 I opted for the whole wheat bread crust.  This was perfect because I was craving pizza all night.  It was cooked perfectly and the crust was crisp.  I would have this again and again.  Monifa had the Veal piccata.  It had a lovely presentation and she said it was flavorful and fresh.  Her meal came  with a side of tomato pasta.  I'm not much of a pasta fan, but I was tempted to snag some. We didn't have the best seat in the place, but you know what...it was alright.  The place was clean, respectable and the atmosphere was comfortable.  Come down for a drink and enjoy the West Hartford center.Con: Parking is not free. Meters operate Monday - Saturday, 9AM to 10PM."]]}