{"The Capital Grille": [["Len J.", "Just exceptional. The food was perfect, the service was friendly, efficient and knowledgable. My wife and I were celebrating an anniversary. I let them know that when I reserved. Our table had rose petals on it as well as a note thanking us for coming. The prosciutto wrapped mozzarella appetizer was very good. It was very lightly grilled and finished with balsamic vinegar. Order it. Do it. I'll sit here and wait while you do. The steaks were great. The sides were more than two of us could share. We had what was probably the best cheese cake I've ever had for dessert. The only complaint I had was the valet parking. It was an absolute mess when we arrived for a 6:30 dinner. Cars on the sidewalk, in the street. No way to tell where to drop the car, or whether we should. But the point if this place is after you park. Our experience was impeccable."], ["Amanda P.", "Delicious food and good service. My friend and I split the lobster macaroni and it was delicious. A decent amount of lobster and the pasta was fresh and tasty. We also shared the generous portion of friend calamari, which was melt in your mouth delicious. My one complaint about the calamari is that they don't serve it with any type of sauce.The service was kind of weird. The waitress was attentive at first, although she didn't provide us with a bar menu and we were sitting in the bar area.  She gave her honest opinion of the dishes, which is appreciated and helpful when ordering. However, at the end of our meal, I ordered coffee and would have loved a refill on it but by then, the waitress had disappeared. I asked another waitress for a second cup of coffee, which she brought, and then my friend asked for a hot tea. Twenty minutes later, the waitress brought the tea and said \"oh, I kept forgetting to bring this to you because I'm not really your waitress.\"We were a little taken aback by that comment. I completely understand that the waitstaff needs to be attentive to their own tables, but the only reason we asked her for assistance is because our waitress was nowhere to be found. In general, the waitstaff seemed stressed and frazzled - no one was smiling. Perhaps they were understaffed for the night.  Overall though, it was excellent and I will definitely go back."], ["Binly S.", "I have enjoyed this place very much! The staff was great, maybe the best all around in the Hartford area. I came here with a group of 3 total and among us we had three starters, three cocktails, a bottle of wine, three steak entrees, two sides and two desserts. The setting and vibe was just right. Good music playing in the background and ambient lighting. It was very nice and romantic to say the least, except none of us had our dates. Ha!I myself had the Caesar Salad which I wasn't too fond of since the dressing was a bit too salty for my taste. To even that out the 24oz Dry Aged Porterhouse was absolutely delicious! The creme brulee for dessert was also very good to finish it off. The cocktail I had was the Adults only Arnold Palmer and I feel like it could've been better. Maybe a little sweeter? That's my opinion though.I will be coming back! But this time it will be with my lovely lady. I am looking forward to it."], ["Jena G.", "I came here for an anniversary dinner and this placed delivered. Per usual, I'll start with ambience. We came on a Thursday around 8:30 and the place was surprisingly tame. A few couples were interspersed throughout the main room. I didn't mind because everything was so quiet and romantic I could hear the flutters of my boyfriend's heart (could've been due to the bill, however). I've gotta say, coming from a girl who loves a good glass of vino, this place is pretty genius for making their entryway a glorified wine cellar. I mean come on. Who doesn't love entering an upscale restaurant that greets you with its hefty collection of wine? This place basically had me at hello.Since I came here for a special occasion, my boyfriend and I planned to go all out. We ordered a bottle of red claret which our server came out with promptly. He was helpful in guiding us in the right direction but hands off enough to let us pick a wine of our choice. There was nothing pushy about him; he didn't exude that clandestine message that some waiters do...you know...the \"try this $100 bottle you'll love it.\" We started with the spicy calamari (one of my personal favorites). Every piece was so tender and juicy I swear I still have dreams about that plate. Loved the tempura peppers to accent the calamari too. We also had a balsamic drizzled caprese salad which was fine...but I've lived in Italy so I'm a bit of a snob when it comes to mozzarella. For entrées my boyfriend had a 22 oz bone-in rib eye which he finished in record timing. Seriously the Capital Grille should've timed him and put it up as an advertisement or something. He's had his fair share of red meat and this is the only thing he looked at with a more loving gaze than me all night. I ordered the french onion soup and lobster mac and cheese for a main course. The soup was fantastic and the LM&C was so. darn. rich. Just how it should be. I think my boyfriend is still recovering from the dent that the bill made but I repeat, this dinner was for a special occasion. I've been to a few upscale restaurants on par with this one but I only reserve my 5 star reviews for downright TREMENDOUS and PERFECT places. This place is darn near it. But the price tag is hefty."], ["Dan R.", "Valerie R. was right on the money, and I do mean money! This is an expensive restaurant where a drink, an appy or salad, and an entree will set you back no less than a C-Note easy, so it's definitely a special event kind of place.This was our first visit here, and we only went because I had a generous gift card left over from last year's birthday. The level of service was incredible- from the valet parking to the hostess station personnel to the servers. Everyone was amazing- so helpful and polite and courteous and ultra professional.They have a very cool iPad gizmo that serves as their wine list, so you can scroll and sort away to find the exact style or bottle or glass that suits your taste and budget. Most of the wines are north of ten dollars a glass.The bread basket was way above average- a real cornucopia of styles - rolls, dark sweet bread, and thin cracker like slices served with a big slab of butter.The three of us decided to split one of the salads -a $13 beauty of a dish with Fresh Mozzarella, Tomato, Basil with 15-Year Aged Balsamic. A normal serving has two mozzarella-tomato towers, and we were very pleased to see that they reconfigured the dish into three towers. The salad was so good- fresh tomatoes, incredible mozzarella (made on site) and the balsamic was wonderful.I had a Gorgonzola and Truffle Crusted Dry Aged NY Strip for $48. It was 14 oz of deliciousness served with a black truffle and gorgonzola butter, and cherry cabernet reduction. The meat was perfect (medium rare). The gorgonzola crust was so flavorful and tasted great.My dining partners also had a filet ($44) and the Pan-Seared Sea Scallops with Wild Mushroom Risotto (also $44).We shared two of the sides - Roasted Brussels Sprouts with Smoked Bacon ($12) and the Roasted Fingerling Potatoes ($11). Both were pretty generous portions and were perfect for sharing.Was the food amazing? Yes it was.Was the level of service top notch? Yes we were pampered like royalty all evening. Check this out- at the end of our meal, the hostess asked if we had valet parked. When we said yes, she asked for our ticket, and carried out our \"to go\" bags to the car for us, so when we walked out the door, our car was waiting for us with our bags in the car. I'll leave it to you to decide if this level of quality and pricing structure is something you're interested in.  I will say that we were totally impressed with every facet of our dining experience.  For a special event, it's hard to top the Capital Grille."], ["Shellene O.", "The only thing I'm not terribly fond of at Capital is their prices!   I've had nothing but excellent service in both the bar and the restaurant.  I've been with large parties and for one to one lunches.  The food is always excellent and the steaks are always perfectly cooked.    This is the kind of places that makes me wish I had a bottomless stomach so I could try everything!  I almost never make it to dessert because I'm just too full.   Any opportunity I get to have a vendor take me here I don't pass it up! =)"], ["Claire K.", "Amazing! I came here with my boyfriend last night, and we shared an amazing dinner. We shared the Crab Cocktail(perfect), 1 cup of Clam Chowder, The  Bibb Stack Salad with Pear(nice light salad), The Citrus Glazed Salmon(perfect), and an amazing Flourless Espresso Cake. Worth every cent!Whenever we're in Hartford, we will definitely considering going back to The Capital Grille."], ["Lydell A.", "I was hooked on my first visit. I stopped by here for a restaurant week deal before I knew what I was getting myself into. I didn't realize that it was a larger chain know for it's relatively uncommon dry-aged steak. I feel like dining here caused me to actually learn and was a turning point to as a foodie.  When a place can do that, you know have to give them no less than 5 stars. Where do I start? I do know what to rave about first, but I think I'm going to go with the service. The level of service here, from the free valet, to the maitré d, to the waiter, was eye-opening. I can tell they put a heavy emphasis on making the experience as perfect as possible. My reservations (and I suggest reservations) were promises kept every time and I was seated promptly after every arrival. Smiles and manners are common almost anywhere but the level of attentiveness and customization make their service shine. When my cup was less than half way full someone came to fill it before I could request it. My napkins were color matched to my pants to (camouflage  better?!). They swept the table free of crumbs between each course. Service gets 6 starsThe food. Oh the food. I pretty much always get steak from a steakhouse so that's what I've had at most of my visits here. Last time I had a NY Strip and it was cooked absolutely flawlessly and the flavor is what I want every steak I ever eat to taste like. I've never had a filet as tender as Ruth Chris but I've never had any ny strip as flavorful as Capital Grill.  The sides were pretty good but nothing notable for me. What shone from the dessert menu for me is the flourless chocolate espresso cake. It's not a huge portion size but it is rich, surprisingly filling, and a party for your tastebuds.  Also, I had a Gorgonzola and black truffle burger from here once for lunch with fries. The fries were decent, but the burger was easily the best I've ever had.This place isn't cheap but that's kind of the point. Come with your stomach empty but your wallet/purse full.  ;)"], ["Kristin B.", "I love coming to this restaurant. The atmosphere is just amazing. They take your coat. Their wine bottles are on display as decor. There's a waiter with one of those waxed mustaches (or at least there used to be). They offer you hot towels at the end of the meal, and bring you a doggie bag (is it too classy to call it that here?) with a personal note from the chef. Yes!The food is so delicious.  It is well worth the price.  They are far too generous with the desserts I will say. Bring someone to share with.  Last summer I called ahead and told them I was bringing my partner for his birthday and they made sure to have a surprise cake ready with his name on it. They also sprinkled little glittery stars on the table next to a hand written card wishing him happy birthday upon our arrival. Quality."], ["Mark N.", "I've been to several Capital Grille's (NYC, Stamford & Atlanta) but not in my backyard of Hartford, CT before.  It was a 1st date and I wanted to impress so this was the spot I chose as she lives in Harford so it was ultra convenient.  Valet parking was smooth - pulled up and the valet was waiting for us, handed off the keys and we walked in.We were given a table and asked for a booth but was told none available (even though I saw a few).  No big deal.  Service and food were all very good.  We shared lobster & crab cakes appy, both had lobster bisque, she had filet minion specially prepared and I had a  South African lobster tail.  We shared twice baked potatoes and Crème brulee for desert.  She had 2 drinks and I had 1 and the bill was $245 with tip.  I gave it 4 stars versus 5 because it was very good but priced \"great\".  Nothing to complain about whatsoever but I need something exceptional to give 5 stars to a dinner at this price for 2."], ["Fred M.", "I've been to two Capital Grille's - Hartford, CT and Palm Beach Gardens FL. The service, food and ambience were excellent in both, although the two locations have very different ambience. The steaks and salmons I've had were superb. They beef is aged and though  they don't advertise how old, we were given a tour of their facilities and the kitchen and drying refrigerator are impeccably clean and up to date. The servers are very knowledgeable, the list of wines long, and they offer iPads so you can peruse both wines or bourbons at your leisure.  The appetizers are truly special and even though I hate ordering apps if I know the meal will be large, you'll want to splurge and try them. They have a version of fried mozzarella that is a first for me - it's wrapped in prosciutto and it's crispy. The calamari is fried with hot green sliced peppers. The lobster tails are split and easy to eat, ice cold and delicious. They had a special 16 oz fillet, bone in, served with a light butter sauce. It is possibly the best beef I've ever had and certainly ties with anything at Peter Luga (I actually preferred to Peter Luga's) and the best Ruth's Chris I've been to (West Palm Beach FL).  Okay, I'll stop here. The restaurant is great, the service is not overbearing but perfect instead. The price, well, if you have to ask . . . that's the clincher. Even though it is expensive, it's a great place to come with a large group because you'll really enjoy yourself. Valet parking. Easy Piezy !"], ["Nichole G.", "The place is gorgeous .. Excellent greetings ... The staff is amazing. Now the food was amazing I had the filet mignon  with lobster tails . The steak was cooked to perfection. The dessert was also mouth watering we had the chocolate warm cake. The wines we paired was perfect. Overall it was one of the most excellent restaurants I've been too!"], ["Lindsay J.", "We ate here during Hartford's Restaurant Week. Let me start by saying, I am hesistant to eat anywhere in Hartford. Location is a big deal but parking is an even bigger one. Capital Grille has killer valet parking and couldn't be easier. We were seated in a nice quiet corner of the restaurant and the service was simply impeccable. We had salad (fresh, delicious and large portions) for our appetizer. My boyfriend had the rib eye and I had the porcini tenderloi. Both were scrumptious and done very well. The sides were green beans and the best mashed potatoes I have ever eaten in a restaurant. They reminded me so much of what my Italian grandmother would make when I was a kid. Dessert was Creme Brulee with a fresh fruit topping. Out of this world!Everything from service to food was worth it. The prices on their menu are outrageous but, you get what you pay for. I can't see going here more than once or twice a year for special occasions but I know if we were to visit again, we wouldn't be disappointed."], ["Valerie R.", "You have to get in the right frame of mind in order to dine at Capital Grille.  If you are not there for a special event, then you need to tell yourself that you are going to spend $100 per person, or even more if you are drinking.  Even if you are there for a special event (Restaurant week, etc) if you tack on the extras, it will be costly. But it will be great food!The first time we went, it was for a Restaurant Week in August 2014.  They were nice about it, they encouraged you to eat from that menu and still provided excellent service, unlike some of their competitors (cough, cough...Morton's).  Martha was our server and she was amazing.  They also had their Generous Pour event going on. This was 7 tastings of wine throughout the meal for $25.  The wines were fabulous and you were able to get more of any of the wines you liked.  Seeing as normally you would spend $25+ for a single glass of wine at Capital Grille, I thought this was a phenomenal deal and definitely left with quite a buzz.  It is a must try for everyone who enjoys wine, apparently they do this every summer and can save you some bucks on the alcohol part of the bill.The second time we went was on 5/2/15, right at the end of the Wagyu and Wine event.  For $25 they offered one of four featured wagyu burgers with fries, along with a glass of wine with a choice of two red wines.  This might not sound cheap to the average person, but again, a glass of wine generally runs more than this at Capital Grille, so this is a great deal.  We had to sit in the lounge to get this deal, though when we called earlier in the day they were very accommodating, saying that they would allow us to have the special in the dining room if the lounge was full when we came in.  It was not, and we grabbed a nice table by a window.  I had the featured gorgonzola and black truffle burger with a glass of  2011 Beringer Quantum Cabernet Sauvignon Blend.  My husband picked the burger with havarti, a fried egg and crispy onions, with a glass of 2012 Etude Carneros Pinot Noir.  We both loved our own wines better than the other, and both loved our burgers.  I liked his burger a little more because you could taste the meat and it was good - I liked mine too but gorgonzola tends to overshadow the flavor of anything else.We also added on apps (french onion soup and Caesar salad) and desserts (coconut cream pie and creme brulee) and pre-dinner drinks (mojito and cosmo) and it was well over $100 at the end of the night.  But the food and drinks were great!  The mojito was the best I've tasted since being in Puerto Rico, the burgers and wine were fabulous and the coconut cream pie portion size was ridiculous.  They even let me upgrade to parmesan truffle fries at no extra cost.  We brought half of our burgers home and had a great night overall.After I've said all of that, I still have to say I prefer J. Gilbert's, because the quality of the food is comparable, and we can get a full meal with a bottle of wine there for half the price of Capital Grille.  I'm still giving Capital Grille a 5, because if it's a special occasion or it's in the budget, you will have a good experience here.  Definitely sit in the dining room over the lounge, as you will get more of the experience that is worthy of the price tag."], ["Justin C.", "My god that was an experience. Vowed to never go here unless everything was on someone else's dime (since it's crazy expensive). Sure enough, I finally got lucky.  PRO:Fantastic food. Everything I ate was amazing. Big Kona steak was cooked perfectly and the sauce was killer. Mash potatoes, brussel sprouts cooked in bacon came out great. Hot, flavorful. Appetizers were phenomenal. Oysters and shrimp were incredibly fresh. Calamari was cooked perfectly too. Even got a great surprise at the end when everyone at the table was given a gift card on the house. CON:Expensive. Every entree is going to run you $40, and that probably wont include anything (sides, salad, etc.). Basically everything is a la carte.  You want mash potatoes? Get ready to pay for it. I'm not a huge fan of that serving style in general... Some other folks at the table had issues. Lamb was apparently chewy, and someone sent their steak back 3 times for being too rare."], ["Jonah Y.", "This in my eyes is the 5 star experience that everyone strives for. I have been eating here for about eight years and have never once had a bad or mediocre experience. I have visited them in Boston, NYC, Pitsburgh, Vegas, and Hartford and have had the same exceptional service and food in every location. This is my go to business dinner location.The drink and wine selection is impressive and the wait staff is always very well versed in all. If you want to impress your customers or a loved one who likes seafood, I recommend the seafood tower. It's nothing short of amazing. Blue crab, lobster, oysters, and shrimp round out this three tier tower of chilled seafood. The fried calamari is always perfectly cooked and the fresh mozzarella wrapped in prosciutto is a very unique and delicious selection.For the entree there is only one selection in my opinion and its the bone in ribeye.The Kona crusted with shallot butter is my rub of choice and have never been disappointed...ever. I should diversify my Capital Grill experience and try something else one time but when the monent of truth arrives I stick to my rock. I did just try the porchini rubbed The sides also make the dining experience. I have two words, Lobster Mac!! The sides are big enough to share with another person but not the lobster mac and cheese!! The aparagus, mushrooms, and scalloped potatoes are also very good.All in all definately one of the best overall dining experiences a person can have, regardless of location.Go there...you won't regret it."], ["Sarah W.", "I enjoyed an excellent dinner here with a girlfriend.  My steak with gorgonzola crust was amazing.  The chocolate espresso cake was incredible!  THe service was very good. I liked the atmosphere.  I wish side dishes were included-  it's definitely pricey."], ["R F.", "Over rated at my last visit; steak just was not up to par at all; service was good; atmosphere as expected crisp! Overall experience C+"], ["C M.", "This was my first visit and I was very impressed. I have been to several high-end steakhouses and this was my far my favorite meal. The N.Y. Strip was like butter melting in your mouth! The sides of potatoes and haricot verts put the final touches on an exquisite meal. My only wish was that the flourless chocolate cake came with ice cream, but it was delicious nonetheless. Top notch service. If you're looking to spend a pretty penny, you can't go wrong here."], ["David E.", "Restaurant Week 8/1/15Great evening again, Jason our server, very nice job last night. Customer service from the valet parking, to the front desk team, to our server. That's why you go to Capital Grill. Food is always solid. The team is knowledgeable and super professional."]], "Cugino's": [], "Ajamo": [], "Costa del Sol": [], "M & M Bistro": [["K B.", "My boyfriend and I just ate here for the Taste of Hartford, there was no host when we first walked in and almost left due to lack of atmosphere. It's very much a hotel restaurant, with a Panera sort of vibe.What M&M lacked in atmosphere and initial greeting was more than made up for with our food and great service from Holly. All four courses were delicious, the only small downside was the lobster over my filet (overcooked). More importantly, our MR filets were done perfectly and was so juicy. Everything from apps through dessert really was top notch. We were so thrilled with how our meal went, we wanted to write a review immediately."], ["Vanilla G.", "As a frequent guest of hilton hotels in different cities and countries, I have tried almost all of their restaurants, M&M bistro so far is the worst. We came here after a show in xl center near by, craving for some red wine and dessert. However the lady who serves us ruin all the nice intention. She twists and turns in 2 tables, didn't have the mind to wait for us to finish our order. You may think because the place was packed? No,  it wasn't busy at all. We came first and the other table came later. She didn't wait for us to finish our order, she dropped the hot water pot down heavily and that's it, nothing, no serving, no talking , very rude. She's not showing bad mood but she don't have the welcome attitude. We are not the toughest guests, but this kind of service in A Hilton hotel is so disappointed. We don't wait for dessert. Just tea and a red wine ( just because we already ordered)"], ["Christina P.", "I've been to some crappy hotel lobby restaurants and folks, this is not bad at all. I have to say I'm really shocked by all of the one-stars in there, though they seem pretty old so maybe they've made big strides in recent months. The first time, I went with a very indulgent butternut squash, caramelized onion, and bleu cheese omelet. It was wonderful in every way, except maybe a bit heavy on the bleu cheese for someone who only likes it in small doses (my fault, I should have asked them to go light).On my second trip to Hartford I took advantage of their breakfast buffet not once but twice. At $16 it's about the standard hotel breakfast rate, but this one offers a custom omelet or eggs made to order in addition to the expected items like pancakes, bacon, oatmeal, and cereal. I was really impressed by their fresh fruit selection and I think I probably ate about $16 worth of berries anyway. I'm usually not the type to have a hotel breakfast multiple days in a row as I much prefer to explore, but when it's three degrees out, I'm very grateful when my hotel offers a pretty decent selection. Above all, I was really impressed with the friendly and attentive service. I was expecting to pretty much be ignored once I chose the buffet, but their waitstaff checked on my constantly to make sure I had enough juice, coffee, and tea, and just see if I wanted anything. I was highly impressed. So whether you're a menu reader or a continental kind of person, I recommend M&M!"], ["Leonard L.", "M&M BistroConnecticut Hartford5pm Sunday 25th May 2015Three StarsLocated in the Hilton Hotel by the XL Center, m&m bistro is a quite decent place to eat.  It has upscale food with moderate portions at a reason price.  The service was a bit slow but it could because the XLC hosted a three day Crossfit Event which probably ran them ragged.  The Cobb Salad ($13) hit the spot.  They replaced the standard iceberg with crisp romaine.  The lettuce was coated thoroughly with the Chipotle Ranch.  The toppings covered the entire plate. The avocado was good by East Coast Standards. The Baby Tomatoes were sweet.  The Shaved Carrots were fine.  The Cabernet-Pickled onions were a pleasant crunchy surprise.  The Bacon, Egg, and Bleu Cheese was plentiful and delicious."], ["Emily C.", "Sure, hotel dining is on the pricey side, but I will say the breakfast here is outstanding! I ordered the southwest benedict, which came with avocado and tomato on perfectly poached eggs (and delicious hollandaise) atop english muffins.Strong, aromatic coffee was the ideal start to the meal for a caffeine junkie like me, especially when the carafe remained on the table!My dining companion's meal was STELLAR - an omelet filled with caramelized onions, butternut squash, and bleu cheese. Truly an excellent winter breakfast. Our service was prompt and cordial, and the restaurant has a cozy vibe which is sometimes hard to find in a hotel chain.I'll definitely be back for breakfast - the menu is super creative!"], ["Erica K.", "M&M Bistro is good --- however it so dead and quiet in there. I don't mind that. I have always had good experiences when going, but have never really seen anyone there but my companion and I.I like the extensive menu they have, and I kind of like how quiet it is. Cheeseburger is always classic, simple and easy. Side salad is fresh. That's all I have ever ordered and would be willing to go back.I would go back again and if you want good fresh food, and a quiet atmosphere go!"], ["Cali C.", "My party of 5 came to M & M Bistro after the Hartford Breast Cancer Walk. The restaurant was busy as expected for breakfast hours. We were greeted by a hostess named James who was pleasant upfront. Slight wait. Our party was seated in a cramped booth. 2 menu were placed on the table. We asked for 3 more and the hostess had a attitude as if we disturbed him. We were later greeted by our server Lorraine, who was very nice, placed our orders. Seemed like we waited forever for our food. Other guest who came in after us were served their food. Finally our food arrived (burnt toast, uncooked turkey bacon, despicable French toast). Took forever for our check. I have been here before and had a wonderful experience hints why I came back. After this visit I will never recommend this restaurant. I definitely want my money back."], ["James C.", "The good - the decor was nice, bright and upbeat, the staff was friendly.The bad - the 8oz NY strip was supposed to be rare, it was solid grey with no hint of pink.  The steamed vegetables were fantastic, but the portion was tiny and left me wanting more.  The price left me wanting less.  At $22 for this meal, it was overpriced significantly.  Even if the steak wasn't done well instead of rare, a fair price would have been $18 at the absolute most.I will not be going back.  Picture of my \"rare\" steak to follow."], ["Terra M.", "We've been staying at the Hilton where this bistro is located. So far we've had both breakfast and dinner here. The food is mediocre at best. My draft beer tasted like soap and was undrinkable. With that being said, the service is absolutely horrendous!!  The worst service ( for both meals) that I've experienced in a while. We had to wait over 5 minutes to be seated, closer to 10 minutes until anyone greeted us at our table. The waitress finally flew by our table and asked for our order. (Btw-it looked like she hadn't slept in a few days..yikes) Our waters were never refilled throughout the meal. The strange thing is that the staff at the hotel was extremely friendly and welcoming. Last thing- I ordered a double mocha at the cafe and was charged $8.00. Holy cow! I was charged for 2 cappuccinos. Although I would def stay at the hotel again, I would never ever recommend eating at M&M 'bistro.'"], ["Kristin B.", "This place was not great. Nothing about it was stand out. It was just a standard hotel restaurant. Although the decor is nice and the staff is pleasant, the food quality is more like high end deli with minimal flavor. It was pretty though. I'll give you that. I just wasn't impressed.  The price for the food quality was just not justified.  I've only been here for dinner, so it's possible they're much better for other meals."], ["Ian Y.", "It's slim pickings when it comes to choosing a place in downtown Hartford to have a sit-down breakfast -- especially on weekend days.  So when my friend told me that she had an hour and a half to kill on a Saturday morning before her bus took off from Union Station, M&M Bistro was really the only option.Luckily for me, my fellow Yelpers came through and fully prepared me for what the eating experience would be like.  I'll echo what my colleagues have said, including:(1)  PricesGREATLY overpriced.  $16 for the breakfast buffet?  No way!   A bit more variety than what you'd typically find at a mid-range hotel's free breakfast bar (including a healthy selection of fresh fruit -- yum!), but definitely not worth the price.  Luckily, there's still an entire menu to order off of.(2)  The $6 breakfast sandwichAs Chadd M. states, the breakfast sandwich is probably the best deal you can get for breakfast.  The serving size of my friend's breakfast sandwich was only a bit smaller than that of my (underwhelming) $11 egg white and salmon fritatta.(3)  The availability of a Restaurant.com gift certificateThank you, Erica T., for pointing out the presence of a Restaurant.com deal for this place.  It certainly made our breakfast more affordable!(4)  The unenthusiastic and underperforming waitstaffMy experience mirrored that of other Yelpers.  While the sign up front said, \"Wait to be Seated\", it took a while for someone to even notice us standing there.  When my friend and I had a bit of a debacle when it came to deciding where to sit, the waitress rudely asked, \"Where do you want to sit?!  Booth or table?!\"  Our server (who wasn't the waitress) had to be waived down over and over again to take our order and get us our check.  He also seemed generally uninterested in being a stellar server (that is, until he **urged** us to fill out the feedback card that came with our check).  Furthermore, our server couldn't figure out how to redeem the Restaurant.com gift certificate, whether it be fumbling with the Restaurant.com smartphone app or taking forever to find the manager to approve the discount.  The manager was the only redeeming part of this restaurant's service, the only one genuinely interested in making sure we were satisfied as customers.(5)  Free WiFiYep, hotel wifi was well and present in the restaurant!3-stars simply because the Restaurant.com gift certificate slashed my breakfast price in half.  2-stars otherwise."], ["Ron A.", "Fantastic food! The salads are wonderful and the corn beef hash Benedict is a favorite. Well worth a visit. Really nice Hilton breakfast buffet as well."], ["Chadd M.", "Yeah, it's a hotel restaurant, and like any hotel restaurant, they are overpriced.....EXCEPT FOR THE BREAKFAST SANDWICH!  For $6, you can get an extremely tasty breakfast  sandwich with your choice of meat (only sausage belongs in breakfast sandwiches; so the choice is irrelevant), cheese, and bun.  Cheese options are cheddar, swiss, and, and american. Bread options are english muffin, croissant, and something else.  It comes overstuffed with eggs, and the english muffing is nicely toasted and buttered.The coffee is overpriced at $3 a mug, plus you can get it free immediately outside the restaurant, but it is good.  And if you are expensing this to your client, why not? ;)Also, the two times I went, the staff are very friendly, and if business is slow they might strike up a conversation with you.How are they for lunch, dinner, and drinks? No clue.  But their breakfast sandwich is awesome!"], ["Lisa K.", "Breakfast was quite nice. My daughter was happy with her tomato & avocado eggs Benedict and I had eggs served on grilled naan which was also pretty good. Coffee was okay and although I didn't order it, I love that they have mango lassi."], ["Julie F.", "I ordered from here while staying in the hilton. I had the filet and it was delish. Cooked perfectly. I also ordered the chicken parm and it was alright. Not authentic Italian chicken parm. The apple crisp was also very good. I came for brunch as well one morning and did the buffet and was very happy. They had eggs, bacon, sausage, yogurt, potatoes, pancakes, French toast, fruit, muffins, and toast."], ["Eric P.", "RIDICULOUSLY OVERPRICEDCan't order an omelette on the side. So even though I wanted no toast, no potatoes I'm charged full price. Omelette (no sides) coffee, tip = $23"], ["Shelly F.", "This place is a hidden gem!  I used to walk by on my way to work and the breakfast alwasy smelled amazing, but who goes to eat at a hotel resaurant unless you're staying there...  Well, you should!  Today I went for lunch.  The signature burger (without pesky vegatables - greens and tomato) was amazing!  The burger was cooked perfectly (medium), bacon was crispy, the mushroom sauce was fantastic, bun was not soggy.  My friend ordered the classic burger and was also quite pleased. I got sweet potato fries, my friend got onion rings and we shared both.  They were fantastic!  Onion rings were crispy without being bready, sweet potato fries were thick cut, but still crispy - and had some kind of sugar or honey on them for a nice sweet taste.  We also split the chocolate flourless torte.  It is VERY rich.  The ice cream that comes with it has little veins of caramel and some little crunchy treats in it.  Overall my only regret is that I've worked accross the street for 2 years and waited until now to try it!"], ["Olia Y.", "Be careful here! We had dinner here on Saturday and I planned to rate it 3 stars because the food wasn't bad but then I found out that in addition to our food bill, Hilton Hotel, which is where this restaurant is located, billed our credit card an additional $75. When my husband called them about it, they said it would take a few hours to sort out. No one has called back or done anything. Weirdly, it's not like the credit card was run twice or anything, it's billed slightly differently, as if it was applied to someone's room service bill or something. As I said beware.If you're paying in cash, the food is pretty good. The flatbread served with the artichoke spinach dip was delish and I love the build your own pasta. Mmm scallops."], ["T N.", "Breakfast Review - I recommend the MM Bistro Breakfast Buffet.  It has so many fresh options: blueberries, strawberries, pineapple, melons, sausage, bacon, eggs, potatoes, oatmeal with all the fixings including sliced almonds and flaxseeds, yogurt, etc! Fatheha was my waitress and she provided great customer service!  The restaurant is bright and open with many windows. 5 stars for breakfast!"], ["Chad E.", "When you stay in a hotel, sometimes their restaurant is the first stop - often because they include breakfast with your stay. In the case of the Hilton, they don't typically include breakfast (or any other meal), but once in a while, you can score a voucher.Unfortunately, the breakfast bar isn't that great. Most Hamptons will probably beat it senseless. Luckily, they are open to letting you use the value of your voucher towards anything off the menu, which is where it comes in really useful - that way you can get whatever you want, instead of a few lesser-interesting items.As to the service? Definitely friendly, and worth a stop if you don't feel like exploring the downtown area."]], "Tapas Restaurant West Hartford": [["K R.", "i have eaten here many, many times over the past 15 years and have had very few (if any) meals that I didn't enjoy. The Greek salad is something I dream about. Service is usually pretty good. I try to get there at least once a year. If I didn't live in Boston, I would come all the time!"], ["Steven K.", "Went for dinner last night.   Small place, with two sides that have what i thought was distinct atmosphere.  larger side was brighter and less intimate, smaller side a bit more intimate.   We order the lamp kabob platter and gyro platter.  Lamp platter came with lamb kabob, rice pilaf, onion relish, taztizki sauce (spelling?) and pita.   Gyro came with a large platter of french fries.  Both came with a Greek salad.  The food was excellent, although i thought the amount of meat on the lamb platter was small.  the dressing o the Greek salad was the best dressing i have every tasted.  when i realized they sell it, i bought a bottle.      Both had the strawberry shortcake for desert...homemade shortcake had great flavor.   Prices reasonable, very very casual atmosphere, server was friendly1 suggestion if anyone who works there reads this...the advertising on the table.. I refer to them as table tents (i think one was advertising the sangria)  those needs to be cleaned on a daily basis, and the one on my table clearly had not been cleaned in a very long time.  next time i go, i am going to try the lamb pattie platter...looking forward to it."], ["stacey n.", "Hello all...Speaking as a West Hartford resident, I can honestly say that this is one of the best around. Although the place is tiny, you can get around this if you call ahead and order to go. Best salad dressing I've ever had....and the service is excellent--- even if you are going for a pick up order.....they treat you like gold. Service aside, all food is fresh and excellent."], ["Andrea T.", "Best Greek salad within 30 miles. But the real reason to go to Tapas is for the blackboard specials. They don't have a freezer as everything is fresh and for that day only. The menu is good mediterranean food but if I'm going it's for a special!"], ["Paul C.", "Good value for pretty good food.  It is not fine dining. For connecticut and even san diego it should get 4 stars for value.  I think I walked away full but not inspired.  Again good prices for above average food but lacks the ability to really inspire.Atmosphere is also kind of week.  The place is small and kind of has the feel of a high class pizza shop.Areas to improve on: fresher higher quality organic vegitables.  Less salt and more natural flavor.  Let the food speak for itself.Tapas it definitely worth visiting even if it gets over hyped by those that love it."], ["Brent L.", "I've never really been to a Greek Restaurant before, this was the perfect place for lunch. Get the Hummus Platter for the appetizer, you won't be dissapointed...unless you don't like Hummus.  Our waiter was a little more concerned with writing the specials on the blackboard than refilling our drinks, but the food was outstanding."], ["Lauren S.", "Friendly service but quality of food lacking.  Had falafels-  insides too soft and lacked flavor; guessing these are not made in house. Famous dressing on Greek salad was very strong & way too much dressing.  Decent chicken kebob."], ["Andrea H.", "My favorite restaurant in CT! Why? Best deal in town for seafood entrees, specials and of course, the Greek salad! The staff is awesome and friendly. The chef makes the best salmon dishes. Gyros are yummy, you can't go wrong with the hummus platter and the rice pudding is top notch. This is the only restaurant I truly miss because I moved and it will be the first place I visit on trips back to CT."], ["Andrea B.", "Ok, but I expected more after reading the reviews.  Gyro was good,but not much tzatziki sauce and they charge for extra.  Atmosphere was sort of like McDonalds. Staff were exceptionaly nice."], ["Ken M.", "I've heard great things about Tapas from everyone, so I just had to go there. I was prepared to love it because it is Greek and Mediterranean food, especially a great Greek menu. At least that's what I've heard from all of the Tapas lovers. OK, I walked in and there is a sign on both doors: \"Please wait to be seated.\" I waited over five minutes for some one to come over and tell me to take any seat near the window: seatings for two. I could have done that by myself. I saw some peeps that I knew there, and was talking with them. The waitress asked about my drink order, and I said: \"Sorry I haven't looked at the menu yet.\" I, then, looked and decided on a Rolling Rock and an \"ultimate\" Gyro. The waitress walked by me a few times without looking at me, so I tried to stop her and order. She said: \"Just a moment please.\" Was she a little snippy or am I being too sensitive? Anyway, she finally came back and I ordered a Rolling Rock and an \"ultimate\" gyro. She asked me what kind of meat I wanted: chicken or beef. I said, \"Neither, I want a traditional gyro with a blend of beef and lamb.\" She informed me that they don't have that, adding that they have it as a roadside special during the week. Whatever that means? I told her that I would pick something else. I couldn't believe it. I was hoping that I would get a great gyro here and wouldn't have to wait for one of my trips to NYC. Ugh!  I decided on a large Mediterranean Salad with pita slices. It had everything on it: tons of olives, stuffed grape leaves, hummus, salad with no dressing, etc. It was filling but not particularly tasty. I had to ask for dressing for the salad. They had another thing on the wall that sounded good, but it is only offered on Monday and Tuesday night. Greek Seafood Sampler for $12.95. I used to date a lovely Greek girl and I remembered a great dessert that I used to have when I would go to dinner at her house. I described it to the waitress and  nobody there ever heard of it. I used my iPhone safari and found out that it is called Kataïfi. One guy in the kitchen remembered it from when he first started working there. Oh Well. So much for the Greek experience in West Hartford. I will not revisit."], ["chris w.", "the food is mostly great but the service has the potential to make you feel like you are in prison. i never knew a waiter could make me feel so uncomfortable. 10% chief."], ["Zoe L.", "i am extremely confused by this restaurant.  it's called \"tapas\", but it doesn't serve small spanish plates.  it doesn't serve small plates at all- portions are huge, and there's no spanish food in sight, mostly mainstream conceptions of greek food.  no complaints about the food, i just don't understand why the place is called \"tapas\"."], ["Melanie M.", "I could eat at Tapas 7 days a week!  I have never  been disappointed with the food!  I love the Greek Salad, Chicken Mykonos, Chicken Souvlaki and the Apple Bread Pudding!!  It is a bit cramped, but the food is too good to complain!"], ["Thomas S.", "Great Greek food.  Chicken mykanos is amazing.  The gyro platters are great too.   Only drawback is the cramped quarters."]], "Pietro's Pizza": [["Brian M.", "Even though I like the pizza here, I find myself coming here less and less. I stop in on my lunch breaks, but I have three main complaints about this place. 1) The television. Every time I'm in here, some stupid judge show glorifying the decay of western society is on. I would really like to eat lunch and not have to stare at/listen to a couple of screwups stand in front of a judge on a reality show. Put local news or something on. 2) All the tables wobble. While small, this one drives me insane. There is nothing more irritating than sitting at a table when one leg is a half inch higher than the other. This is a ten second fix. The inability for management to address a problem as simple as this makes me question what goes on in the areas that customers aren't able to see. 3) There is a purchase minimum $10 to use a credit card. It's 2015. I very rarely have cash on me these days. The establishment advertises they accept Visa and other CC companies. Stating that there is a minimum amount that needs to be spent is technically illegal and could result in a hefty fine if someone chooses to report it."], ["Paul N.", "This is the WORST PIZZA I have ever had in my live. If the guy I spoke to on the phone is the owner, then he's an IDIOT. 1 Star is to good for them. Ordered a large pizza with Pepperoni and Olives. 1) Was out of Olives. Really2) Had to go down stairs after delivery guy called my room. I have NEVER had to hunt a delivery person down at any hotel in any city. They had my room number.3) Pizza was in a bed of GREASE.4) Was the WORST PIZZA I have ever eaten.5) It was midnight so we had to eat as much as we could and toss away half the pizza in the trash.6) They sent no paper towels so we used hotel towels. NOW FOR THE BAD PART:1) A large pizza is $14.002) Each additional topping is $2.003) My order ends up a Large Pepperoni pizza. Remember, they don't have olives. 4) They charge a $2.00 delivery fee. (The drive does not get that)My math says the order will be $18.00 plus tax and tip. When the pizza arrives I handed the delivery guy enough cash to cover it all. He cashes me to the elevated showing me that I hadn't paid him enough. I gave him another $5.00 because that was the lowest bill I had and told him to keep any extra. Then I noticed that they charged me $19.00 for a $16.00 pizza along with the tax, tip, and delivery fee. The total was $22.21. $3.00 dollars to much. I called the pizza parlor and ask why the amount was $3.00 higher and the guy on the phone tells me that he forgot to take off the olives ($2.00) that BTW he told me as soon as I asked for them that they were out of olives. But somehow he had no problem not only charging me the $2.00's that he just went ahead and made it $3.00. This means that I paid extra tax on $3.00 too. So why the rant over $3.00 and some pocket change. Because when I told the guy to just send some bread sticks over and we'd be fine, he told me no because the bread sticks cost more than the $3.00 and change he owed me. Instead he offered me a discount on a pizza tomorrow. WHAT IS UP WITH THAT. Where is the customer service. There is none there. What's the cost on a few bread sticks to him? $0.50 maybe. I'm in town with The Fireball Run Adventurally. This town has bent over backwards to welcome us with open arms. We will start filming Season 9 here in Hartford, CT. and I can say that this is not Hartford. This is a cheap little pizza parlor that doesn't care about anything other than rapping their customers. They shouldn't be allowed a business license. I will never eat there again. I just wished I'd come to YELP first. It would appear that they are a magnet to the 1 Star Review. It's sad when a company cares so little about its customers. They don't seem to care about YELP Reviews either. Next time I'll learn. GO TO YELP FIRST. People don't take the time to write on YELP for their health. They write here when they feel something. Whether it's a good feeling or a bad feeling. They log their thoughts to let others know how they felt that day and at that time.  Please use your power as a customer and boycott this place. I bet that if their sells dropped 50% they'd start caring. Thanks for reading, Doc"], ["Kristen M.", "We were staying at the Hilton Hartford for a wedding. After the wedding we ordered Pietro s as they were close and delivered. The pizza came so fast which seemed a little too good to be true. And it was.Basically they took a used pizza that had been old and sitting out for who knows how long (was yellow) and threw patches of shredded mozzarella on top. Then prob heated up for a few minutes. So when we opened the box we had a yellow tainted pizza with spots of white cheese sitting on a card board crust. Just terrible."], ["Rob W.", "The worst delivery food and service I have ever had. Delivery guy called me to come to his car to retrieve the food. The pizza was burnt and stale. the fries were clearly from the freezer section of the grocery think Ore-Ida and worse they didn't finish cooking them some were still frozen. We threw more than 1/2 the order away. Grub hub shouldn't allow this resturaunt to be listed at a option."], ["Yanilca R.", "Place is terrible never eat the chicken had a friend of mine that use to work there and I asked how was it and he said stay away from the chicken its left out for weeks n a sauce that looks old in surprise they haven't got fined or closed down for it serves is the worst when I finally went just rude all around i would not recommend this place to my worst enemy even the slices of pizzas r left out from 11am when they open till 2am when they close boycott Pietro"], ["Chris L.", "I went here very late at night. I don't remember much of my experience,  but I slightly remember hating it and throwing it out."], ["Joe C.", "Wow I had not truly known what bad pizza was until I paid a visit to Pietro's Pizza. With an Italian name like Pietro you'd figure the pizza would be pretty good. But if you thought that then you'd be wrong. The truth is this establishment gives all Italian named pizza makers a bad name. In fact Pietro's gives all pizza makers a bad name.It's sort of obvious where this place gets most of its business. There's a community college on one side, a hotel upstairs, and a brew pub on the other side. All those three places crave cheap/easy convenience and my guess is Pierto's fills that need.I'm guessing the couple of slices I purchased were likely made some time during the Paleolithic age. Sure they reheat slices. But somebody should draw the line between what's acceptable to reheat and what's considered downright insulting to give to a customer. From the looks of it they don't throw anything out at Pietro's because what should have been thrown out many weeks ago ended up on my paper plate one late Saturday night."], ["Anthony A.", "Slimy middle eastern guys who rip you off and have an attitude. Quality of food is hardly stellar and real overpriced"], ["Steven G.", "I was staying in Hartford for a convention with some friends. It was late at night, we were all in the hotel, and we all wanted something quick and easy. The hotel had a few menu's and pietro's seemed the best quality with a good selection. I ordered over the phone for delivery, and the man I talked to was rude and didn't tell me the expected cost or delivery time. The pizza took over an hour and a half to arrive in the lobby, and the price was about $35 dollars more than what I estimated from using prices listed on the menu we had (I had included tax and delivery fees in my estimate). The delivery driver also forgot the breadsticks we ordered, but he was nice enough to drive back and get them for us.As for the quality of the food... it was nauseating. My Hawaiian pizza's toppings had all shifted toward the left side of the pizza box. The cheese pizza looked like cardboard. Two bites into the pizza, and I felt the urge to vomit. The pineapple tasted stale and the pizza was doughy and undercooked. The rest of the order was just as bad, according to my roomates. None of us could finish any of our meals, they were so bad. I'd rather starve than get anything from this awful excuse for a pizza place again."], ["Kerri P.", "Perfectly average pizza. That's not a slam. I am a snob about pizza and find most pizza places in the area to be intolerable. There are definitely a few local joints that rank ahead of Pietro's, but if I'm feeling a craving for pizza, particularly late at night, I know I can easily get a slice from here. They did a nice remodel in what had been the Dunkin Donuts of the Damned. There are several tables indoors and a few outside. The giant tv and flashing sign inside are tacky as all get out, but I'm cool with standing on the sidewalk while eating my slice."], ["June S.", "If you want pizza..... You're better off starving yourself. The pizza is not that good and the service is mediocre.  Sometimes the owner can be rude. You're better off just going somewhere else to eat. The prices are also higher than most pizza places."], ["Susan P.", "Got take out and rushed back to work. Wrong again. I ordered a small Greek salad with chicken but got a Cesar salad with chicken. Yuck."], ["Jennifer H.", "I used to frequent this joint with a friend of mine and I never really enjoyed their food, though it was an affordable joint where we could loiter. I especially enjoyed drinking wine with pizza. However, the food was not worth the price. I know DAMN well they would reheat pizza. Also, the older I got, the more annoying it was to eat there once the high school let out."], ["Megan P.", "order a pizza for delivery didnt expect much butone word... Disgusting !Dominos or papa johns would have been better"], ["Chelsea M.", "First off if you MUST eat then go for it.  I mean literally if you are starving and the owner is giving free slices and you will die if you have nothing to eat right then and there.  The pizza is HORRIBLE.....chewy under cooked dough....soggy spinach.....questionable meatballs....I could go on. Do yourself a favor and never order from here if you have a choice.  Also the delivery guy just yelled at us....Don't ask me about what because I literally have no idea.   We gave him more than a 10% tip and for some reason he felt the need to bash CT and slam his fist on my table.  Weirdest experience ever.  Actually now that I think about it, our building has a key code to get in.....no one ever buzzed him in he just kind of showed up...... Needless to say I actually feel sick after one piece of pizza and writing this review.STAY AWAY!!!!!  I BEG YOU."], ["Jeff N.", "I only go to Pietros because it is located across the street from my apartment.  I rarely order anything beyond the cheese slices but occasionally I've ventured into the stuffed pizzas (which are really expensive at $5.75 I think for a stuffed meat slice).  The fare here is pricy for what it is.  Dominos will be a better value.  As a pizza, the slices are normal in size, not too big but bordering on being too small.  Here is the deal breaker!  The tomato sauce is one of the worst I have ever had.  It isn't zesty (like it should be) and is more sweet and liquidy...which grosses me out.  Reminds me of a watered down ketchup that isn't quite salty enough to be ketchup.  They sometimes give you a side of tomato sauce for the stuffed slices and I would just toss it out but the stuffed pizzas are so dry that you have to use the sauce to moisten it.  Overall:  Again, I only go here because I live across the street and it opens late.  Both reasons for which I give it two stars.  The owner is nice and always greets me with, \"What would you like boss?\"  Otherwise this place makes pretty bad pizza and charges quite a bit for what it is.  If it were like the .99 pizza places in NYC then this place might get 3-4 stars.  But as it stands, their quality had either improve or their prices needs to go down.  I recommend Lena's, Lunas, Naples, CPK, or Dominos over this place."], ["Kent H.", "A large selection of pizza which you can go by the various sizes.  This place also offers other italian dishes and sandwiches.  I wasn't too intrigued for pizza and it was late, so there weren't too many other places to turn to.  The person at the register was fairly energetic and friendly.  A few other guests came in and he offered them some free sample slices of pizza  to try out.I ended up ordering a hawaiian chicken sandwich.  It consisted of whole chicken breast patties, lettuce, tomatos, and pineapples.  On the side was 1/4 of a pickle and french fries.  The sandwich was just something good enough to make me full, nothing too special.  A friend ordered the meatball sandwich and it looked a little more appetizing and appealing.  Almost like a pizza stuck between some french bread."], ["Noelle M.", "As a student at Capital Community College next door, Pietros is a welcome dining option on Friday evenings when the food stands inside 960 Main have closed up shop. I stopped in for a roast beef grinder before class and wasn't disappointed. Small, casual, maybe a little tacky with the crazy blinking signs, but the girl who took my order was very nice and the grinder was huge. You're not gonna take a girl here to impress her on your first date, but it's definitely worth a stop if you just want a good bite. They'll have my business again next semester, I'm sure."], ["Mauricio P.", "Good food, good delivery service.I ordered the Eggplant Parm sandwich and a Greek Salad. The salad was green, not iceberg yellow or white, which was GREAT! Feta was fresh, tomatoes were ok, olives were good.The Parm was fantastic. Melt in your mouth, from bread to cheese to eggplant. Not too much sauce, just enough cheese.Delivery was timely, friendly, and runs til late!"], ["David G.", "Mediocre pizza and beware! If you go in and the owner thinks you're drunk he will over charge you - Ive seen this happen several times."]], "The Russell": [], "Tapas": [], "Trinity Restaurant": [["Leigh M.", "I loved this small, family owned restaurant! You could tell it was a family operation, as the server mentioned something about her grandmother doing the cooking and also roaming around cleaning things up. I had a vodka sauce with chicken and it was extremely comforting and perfectly made. My partner had the lamb and it was fork-tender. The physical space is lovely inside but a bit difficult to find. It is in what appears to be a residential area. Trust your GPS and you'll be OK!"], ["Jena G.", "Trin Restaurant is consistently good. I've been coming here for four years now and have actually never, ever been disappointed. They're really making a name for themselves too- the New York Times recently blessed them with a raving review...a nice nod for a neighborhood eatery. The most charming and redeeming quality about Trin Rest is the fact that it's family run and owned. They'll always make you feel welcome and at home.Trinity Restaurant is also a small establishment. It can't hold more than 100 people at a time and if you come on the weekend without a reservation, you gotta be willing to wait. Once you are seated, however, prepare to be wowed. Their bread knots are warmed to perfection and soft enough to make your cashmere sweater jealous. A few stars on the menu are:-Butternut Squash Ravioli-Artichokes with Goat Cheese-Spaghetti Pesto-Pizza MargheritaI wish I could love Trinity Restaurant's calamari. I really do. But sadly, it has never impressed me. In fact, it's the reason I'm knocking off a star. It seriously is the ONLY lackluster item on the menu. It's chewy and bland...kind of tastes like it's been frozen. So unfortunate, but you guys know how I feel about my calamari.All in all, however, Trinity Restaurant is a super solid, scrumptious, satisfying place to take your friends, family, or bae. A double thumbs up!"], ["Tim M.", "This was one of the strangest restaurants that I have been to in Hartford. Although there was technically free parking across the street, the parking spaces were tiny meaning your car was halfway into the road (didn't seem safe but car was fine).  I drove by the restaurant twice (it was easy to miss) and the surrounding neighborhood wasn't great. Inside, it was filled with Trinity college students enjoying the BYOB (even though they had a wine menu). The college students were going all out- beer, wine, hard liquor, mixers,etc. At least the corkage fee was cheap ($3)Even though it claims to be Italian, Greek and Mediterranean, the menu was 100% Italian. which was dissapointing. The calamari were just OK, nothing special. The bread was very good. I have to admit that the butternut squash ravioli was REALLY good, however I never seen SO MUCH brown butter sauce on a dish.  I didn't end up ordering much else since I had expected a much more diverse menu."], ["Kelly T.", "Great food, horrible service.  Waitress seemed scattered, kept forgetting us.  Waited on people who came in a good 5 minutes after us before acknowledging us (a party of 6 is kind of hard to miss).  Not sure we would go back."], ["Mari K.", "I had found this place in my search for local BYOBs and decided to give it a try. It's located right next to Trinity, but we had a little trouble finding it as there's no sign that I could see with the name of the restaurant. There is some street parking right out front. As we approached the establishment we were greeting by a friendly man, and we were seated quickly once inside.  We visited on a Monday night and it was very quiet; I think there was only one other group there during the entire duration of our meal. However, the space is pretty nice (I added a few pictures of the interior), and has room for a good number of people to sit  comfortably. The server, who I believe may have been one of the owners, was really sweet. It seemed she was the only one there so it wasn't super fast service, but we were not in a hurry and the family feel was nice.  If there had been more patrons, they definitely would have needed more help to keep things moving quickly enough, and I'm assuming they bring in more help during busier times of the year. We had brought our own wine since Trinity Restaurant's Facebook and Yelp pages say that they are a BYOB, but I noticed they did have a pretty good wine list. I asked the waitress, and she said they do both (my favorite answer). She brought us two wine glasses. I order the arugula and spinach salad (it had another name that's escaping me). It had a huge piling of fresh greens with a very tasty dressing and four thin slices of cheese (see picture). I always enjoy fresh greens, especially the slightly spicy kick of arugula, so I was pleased. We did have a smidge of bad luck with entrees, initially ordering 2 that were not available at the time (the scallops dish, which looked great in the picture on the wall, and the osso buco, which sounded amazing). She clearly felt bad and apologized for not having them, and explained that the osso buco is always available in the fall, but in the off-season (I'm assuming it's off-season because college is out, and Trinity students and families likely make up a good portion of their clientele), they can't make huge batches of it, as it takes a long time to make, and they would end up with large quantities being wasted. She said that regulars will call ahead of time to order the osso buco, which I thought was a great tip. I totally understand the reasoning and agree that this should be more of a seasonal item (but I do think it would be helpful for them to indicate this on the menu).I ended up ordering the garlic shrimp linguine (it may have been called something slightly different) and my date ordered the seafood paella. The paella was fantastic (it does come with a lot of peas, just fyi); the seafood was cooked just right and the broth was really good. The shrimp linguine was good as well. My favorite part of the whole experience, though, was unexpected. We had already paid and were ready to leave when the waitress brought out a creme brûlée for us to share, on the house.  We had told her it was our first visit, and I think she wanted to make a good first impression. It worked! I would not have ordered the creme brûlée (I was really full from all of the salad and pasta!), but I am so glad I had the chance to try it. It was fantastic! The custard was rich and creamy, the perfect texture and sweetness with a hint of vanilla. The top was torched just right- it shattered like thin glass under the spoon and had a delicious, sweet caramelized taste. After thinking about it, it makes sense that a place called Trinity Restaurant, situated next to Trinity College, would have a great Creme Brûlée... since it's rumored that the first creme brûlée originated at a Trinity College in Cambridge, England!No matter the reason, the food and overall experience were good, but I would go back there just for the creme brûlée."], ["Rabbi L.", "OMG, I love this place so much. I live 2 hours away but make sure to come here when I pass through Hartford.The atmosphere is simple but elegant, European style, very clean, welcoming. The servers are always nice and attentive. They are around when you want them, but they make you feel comfortable to  linger over your meal and conversation. That's another lovely Mediterranean cultural touch. The Albanian owner is warm, hospitable, and soulful.Ok, let's start with the coffee. Perfect.Today's appetizer: baked marinated artichoke hearts with goat cheese. Maybe a little touch of kashkaval or cheddar as well. OMG, hot, delicious, perfectly balanced vegetable-ness with cheese-ness. Good amount for two.Today's shared pasta: spinach manicotti. Wonderful fresh marinara sauce, lots of tender spinach, homemade fluffy ricotta, seasoned with black pepper and something aromatic. Tender flavorful pasta.Today's shared salad: mustard salmon salad. Generous piece of salmon perfectly charred on the edge. OMG! Lovely assortment of roasted vegetables as well as tasty tomatoes, purple olives, cucumbers. Hard boiled egg was more food than I could handle, eating this with all the other offerings. The salad was perfectly dressed with a freshly made lemon vinaigrette.Guess I forgot to mention the bread knots. Chewy, fresh, just so homey, served with herbed olive oil. But don't get distracted by this.Two hungry people left completely satisfied for $41 including two coffees.I love this place. When I finally do get to come here, I worry that I have built it up in my mind. But then the food comes and I am delirious with pleasure."], ["Shawn L.", "This is one other Hartford gem. People should FLOCK here!! Amazing food. Good service. Good prices.  It's a tucked away place on Zion behind the rocks, and should be PACKED every night. Q"], ["Sally M.", "Our family of four visiting Hartford from Northern California enjoyed such a lovely meal at Trinity Restaurant.  Sweet neighborhood spot, warm and friendly service and delicious food. The mussels in garlicky tomato sauce, fresh caprese salad and cannoli were our favorites."], ["Barbara W.", "Trinity Restaurant is really a hidden treasure! I have been two times recently with my boyfriend who has a friend that highly recommended it. It's tucked away neatly on Zion street, across from Trinity College. While the outside is modest with a small outdoor seating area, the inside is quaint and clean with a warm friendly staff. The food is incredible from the appetizers to the desserts! You will not be disappointed! PS - you can BYOB (wine or beer)!"], ["Robert B.", "As a former regular at Timothy's restaurant, I was happy to see that the space was occupied by a new restaurant, and after hearing a couple good things from other food lovers, my wife and I made the trip to what is admittedly NOT Hartford's nicest neighborhood with high hopes for a great dinner. Sorry, Trinity restaurant- I had every intention of loving you but I just couldn't do it.  First of all, our server must have NEVER worked in a restaurant before. She served our appetizers and entrees simultaneously, and brought our check without even asking if we wanted dessert or coffee.  Parts of each entree that were advertised on the menu were conspicuously missing, and brought over on separate plates as an afterthought when we pointed out their absence. My bolognese was ok, my wife's swordfish a little better, but still thin and slightly too well done.  We did like the Tuscan bean soup. Our 9 year old had a cheese pizza which I thought was on the quality level of a frozen box pizza.  The space is nice, and maybe this was just a bad night, but I left missing Timothy's even more than I did before. It takes something better than average to lure us into this part of the city, and \"better than average\" wasn't happening at Trinity that night."], ["Diana L.", "$17.01 including tax for 1 dinner entree, butternut squash ravioli.What I got:- 7 ravioli, one without filling, covered in so much oil it was seeping through the paper bag within the 5 minutes it took me to drive home, 5 mini rolls, slice of lemon.For that price you better believe I ate the lemon too.Honestly at a whopping 17$ I would have expected to have enough food to have leftovers for the next day, but no.I would skip unless I were being treated."], ["Henry C.", "This restaurant has the worst customer service I have ever experienced. We came as a group as 18, and they couldn't give us separate checks so they charged us EACH about $28 extra. The food was terrible; I got chicken parm and there was only sauce on half of it. They do not even have a menu item that costs approximately the amount the said that we owed. Additionally, when we challenged the amount due, we were met with adamant opposition, even following adding up the value of every item and presenting a corrected bill. This has happened to multiple member of the party before this, and even credit card statements that showed how this happened and they wouldn't give us a refund. Giving a rating of one star is generous given our experience, and I'd like to petition Yelp to add a rating system that can properly illustrate that the time I've wasted here can never be given back."], ["B L M.", "This will be a definite come-back to restaurant.  They were accomodating to give an appetizer as the entree WITHOUT an extra charge (hate that!).  Had the mussels and the arugula/spinach salad.  The salad was outstanding - crispy arugula/spinach  mix with delicate sheets of parmesano cheese and ribbons of fennel - delicious.  The mussels were bathed in a red sauce and the perfect combination.  Rolls were right out of the oven, flaky and tasty.  My DH had the chicken parm which was gone before I could ask how he liked it = good and gone!  Will come back to try other dishes, but will certainly have that salad!   An unexpected ending - as we were ready to pay up and leave, we were treated to a decadent chocolate dessert - compliments of the house.   Send your guests home happy, for sure."], ["Nicholas I.", "I went to school at Trinity College nearby and I loved this little restaurant then and I love it now. Every time I come back to the school I make sure to visit this place and get the spicy chicken Gorgonzola. Amazing."], ["Ryan B.", "Just when I was just starting to think I had discovered all there is to find in this section of Hartford, I was pleasantly surprised to end up here. This. Place. Is. Awesome. Here's the bottom line: We enjoyed our experience here so much on Friday night that I went back Saturday night and brought two additional friends. If anything, the second meal was even better. How many places are that impressionable? Now, stop reading and go get dinner!Top 5 Reasons to Go Here1) The staff are so friendly and work hard to make sure everything is perfect. Honestly, the family-run atmosphere is the best part of this place.2) Food is amazing! My party and I have now tried a dozen things on the menu and each was delicious. The pacing between courses was perfect too, which is always a bonus.3) Recently remodeled after the name change, this place has the feel of a cozy home but is also spacious to fit big parties. A really unique atmosphere.4) BYOB. Enough said.5) A diamond in the rough. The neighborhood leaves a lot to be desired, but this place is the gem it needs. I appreciate it that much more for being a fun, delicious place despite the area. I'm a local and having a go-to place near by is a real treat. Obviously, most of the diners are from Trinity College, so brace yourself for some youthful banter."], ["Eliza D.", "I went here with a group of friends on a busy Saturday night. Yes, it was the night of the blizzard. However, this is no excuse for overbooking a restaurant that has two waitresses to the point where our table of 8 sat for TWO HOURS before we got WATER, and that was only after we requested it. I will never be going back to Trinity Restaurant."], ["c l.", "Have returned many times since first review.  Lots of upgrades to the atmosphere, which wasn't so bad to start with.  Recently went on a summer Saturday night with party of 10 or so and they knocked it out of the park.  Everyone loved the food and the charm of the family run establishment."], ["Alex B.", "I love this place.  My recommendation: the arugula salad with grilled chicken."], ["Raymond L.", "Been here twice and have already fallen for it. Great pizza with fresh authentic ingredients, super-nice owners, and awesome ambiance. I'm going to become a regular."], ["Greg M.", "For years, I had been a regular at this restaurant's predecessor, Timothy's, whenever I would be in town.  (Full disclosure: As a Trinity graduate, I have always been partial to a homey, hip, no-nonsense restaurant succeeding in this neighborhood.) Timothy's was great, but like any place, it had its faults.  I recall the bread was to die for and the dishes were generally pretty good, but most people went to Timothy's more for the vibe and the experience than for the overall menu.  Recently, I went to Trinity Restaurant after a several-year absence from Hartford, not knowing what to expect.  I was floored: This restaurant managed to preserve the \"vibe\" of the old Timothy's, while elevating the cuisine to a whole new level... I would characterize the menu as gourmet Mediterranean, but without any strong ethnic coloration, like Greek or Italian.  (I believe the owners are Albanian, which explains the reason).  There are some very solid meat and fish dishes on the menu. I sampled several; all were gourmet-quality, well-presented, and reasonably priced.  I even tried the pizza, which was excellent! The kicker: the place is BYOB, making the experience a real tour-de-force.If you can get past my minor bias of being a Trinity alum, take my advice and go for it!"]], "Aladdin Halal Restaurant": [["Yush K.", "GREAT TASTING MEAT!I am addicted to this place. There CHicken Kabab pita sandwich is incredible! I also get grinder once in while! It is truely remarkable!Food is healthy, clean and perfect for college students. They delivier... please dont be shy to try their Arab menue options because they really know what they are doing!My friend had the shawrma it is worth it! Best in Hartford Area!"], ["Ronald S.", "slow. slow. slow. and i swear the 3 times i was in somehow i ended up with some sort of unknown meat on my vegetarian falafel. wtf?!? its sucks when you either have to pick apart your meal to make it edible, or throw it out.never had the pizza, but it looked OK."], ["J R.", "This place is fantastic, one of the few places in the Hartford area where you can have Middle Eastern food and unconventional proteins (the lamb and liver are great) without paying for the overpriced fine dining which constitutes most of the Hartford restaurant scene. There is a bit of a language barrier with the night time staff, and orders do get screwed up if you're not careful, but it's reckless and unfair for anyone to be accusing the owners of being dishonest. My friend was mistakenly charged for a Steak & Cheese when he orders a \"Slice of cheese\", and as we left the owner chased us down and gave him the difference in cash. The story posted below by Kerim A is totally inconsistent with my experience, and I guarantee that the problem would have been resolved if they'd addressed it to the staff instead of passive-aggressively lashing out over the internet."], ["Victor D.", "The only place to get a Shwarma around Hartford that I know of. Wish the pita bread was less dry. Staff is friendly, and restaurant pretty quiet. Overall okay if you like Middle Eastern fast food. Never tried their pizzas."], ["Mike C.", "I like the falafel and the grape leaves.  The pizza is good at the end of the night after having a bunch of drinks, but by no means is it my go-to spot for pizza.I've used their delivery service, too, as they deliver to Hartford and surrounding suburbs, and the middle-aged guy who makes most of the deliveries is great, friendly, and respectful.Then there's a younger guy who makes deliveries, and he just sits in his car and rolls down the window for the customer to take their food.  The other week, I ordered, and he called my phone for me to come out of my house, as he sat in his car, smoking cigarettes over my food, then handed me the bag.  I mean, come on, dude, I'm not expecting someone to come into my house and lay down a tablecloth, but at the very least, get out of the car and hand me the food, that's customer service, that's why people tip you...this guy's one step away from just launching the food out the window like he's delivering newspaper."], ["Silvia K.", "Delicious!  Don't mind the lack of atmosphere or the fact that the places also doubles up as a pizza parlor.  The Middle Eastern food is really great.  The hummus has a wonderful chickpea and tahini taste (not killed by lemon juice), and I also loved the moujaddara, which is really fresh and served warm, as well as the babaganoush.  The spicy eggplant, which I tried as a side dish, is properly spiced and very tasty.  Overall, really fresh food that tastes homemade."], ["Daniela R.", "We used Aladdin Halal's catering service for a function at school, we got  A LOT for our money, the food was delivered on time and beautifully arranged, and an entire room of faculty, students, and staff were very pleased with the quality and taste, including more than one person who was happy to be able to eat because it was halal.  (We had a speaker give a lecture on the Middle East, so we wanted to serve authentic Middle Eastern food, and we got what we paid for!)Two days later, my husband and I went to restaurant for dinner. Two days before, I was unable to stay for the entire lecture because I had to teach a class, so I never got to try the food, but it looked so good, and people were raving about it the next day, so we made the trip to the actual restaurant (easy to find parking, though you need to look for the name under the building's awning or you might miss it.) He and I  were completely satisfied with our meals--I had the vegetarian combo, which was so plentifully arranged I could not finish it all (not typical for me), and he got a meal that came with lamb and ate every bite.  We also had the best dolmas (grape leaves) with a very unique spice and we shared a kibbeh which was excellent.  I asked to speak to the manager to thank him for the great catering job from two days before, and he was so nice he brought us some free dessert, which was very good, especially the herrisa (like a coconut square) which I liked better than the baklava, which was a tad dry, but I can't complain about a freebie.  Everyone I dealt with, from the first phone call to the servers to the manager were super nice.  It seems to me that the other reviews I read here on Yelp may have been written by people from the drunken-college bar crowd who walk into a place at 2am with a sense of entitlement, perhaps?  Falafel needs to be made fresh to be good, so either they don't make it after a certain time for that reason (when most kids will be ordering pizza, I suppose), or if it takes longer than expected, then just deal with it, for heaven's sake. You're getting a late night nosh after drinking, I don't think anyone should really expect tablecloth service in that context, do you?As for the person who claims to have been cheated on his bill, since I wasn't there, I can't say that you were or weren't, but when our school had its food delivered I made a mistake with the money, and the driver had to return to get the balance of what I owed him, and he was very nice about the whole thing. I just did not get the sense from any of the staff I encountered that they would be dishonest.  And a few people here complained about the restaurant being misleading about its nature, but there is nothing about the name, decor, or menu that says \"Indian\" to me, and Naan is an Indian bread, Aladdin serves Pita bread (albeit a bit dry because of how they warm it.)  And coming from New Haven before Hartford, I can tell you that a combination Middle Eastern food and Pizza joint is not abnormal or inauthentic--there's a similar combo on College St. in the Elm City, though Aladdin's quality is superior to that place.Don't let some of the lukewarm reviews for Aladdin here on Yelp dissuade you from giving it a try.  After our school's good experience with Aladdin's catering and my good experience at the restaurant, we will be visiting and ordering from there again to be sure.  And while I'm not Middle Eastern or an expert on food from that region, I'd have to say that this is the best I've had in CT, including the overrated Mamoun's in New Haven and Tangier's in West Hartford."], ["Kevin J.", "Aladdin's is your primary option around the Union station for take-out. Their front door sign doesn't appear to be permanent yet and the interior is modern and well designed, so I can speculate that the place may be newly renovated. I was really impressed with their variety of quick sandwich and dessert options. Had one of their Aladdin house specialties which is turkey and roast beef with greens on a 12\"+ fresh roll with lite oil, wrapped up in foil to go for $6.99. Nice interior for a cafe/deli style restaurant, this establishment is 4 stars overall and I hope to return someday."], ["Courtney C.", "I'm far from an expert on Middle Eastern food, but I was eating three people who are and we all agreed it was delicious. I was hesitant to try a restaurant that serves Middle Eastern and Pizza....just doesn't seem like a normal combination to me, but it was raining and a short walk from our hotel. After going over their huge menu, I decided on the Mixed Grill with my two sides as the garden salad and the hummus. The hummus looks homemade and not some pre packaged stuff you get at most places. It was thick, flavorful and delicious. My salad was surprisingly good, but the dressing had been sitting for a while and was nothing but oil, pretty gross. They put it on the side, so I just used the hummus instead. The naan/flatbread they give you comes out warm, but was lacking. I've had much better. As for the meat, perfect! Tender, juicy and full of flavor! Lamb, Chicken and Beef. I was in carnivore heaven for a little bit. The service is slow because its all made to order. I would rather wait than have some dry meat that's been sitting under a warmer. The lamb is cooked just like they do in the Middle East (slow cooked rotisserie style) and you can watch as they cut it off for your meal. While we waited, we also saw them hand make and toss their pizza dough. It looked and smelled delicious! If you're in the area, give this place a shot! Its not a $5 dinner or fast, but its worth the price and the wait."], ["Jamey M.", "A very authentic middle eastern deli.  Had the lamb shish kebab with hummus and baba ganoush and I have never had better.  The baba ganoush was rich and smoky with excellent olive oil.  It was wonderful.  The rest of my party got pizza made in a brick oven.  Beautifully crispy with high quality ingredients. Open late.  Don't miss this when in Hartford."], ["B. W. P.", "We ate here tonight... the food was very good, we thought, but the wait was too long, we were the only ones in the place, and it still took about 15 minutes to get a slice of Pizza, a Falafel and a Shawarma...  reasonably priced.  Perhaps it would be better picking up an already prepared order.  Given the fact that we were the only customers, it shouldn't taken as long as it did.  The food did seem fresh.  I'd give them another try in the future. I think their product is way better than Tangier's, which is on the corner of Prospect & Farmington. It would be nice if there was more Middle Eastern food in the Hartford area."], ["Heather J.", "I love this place!  I've been in Hartford twice for business.  Loved it the first time and came back on my second trip.  Food is plentiful, delicious and reasonably priced.  The family combo was more than three of us could eat.  Yum yum yum!! And the owners remembered us 5 months later and greeted us like regulars!  Will come back again for sure."], ["Kerim A.", "Unfortunately, the owners and employees of this restaurant are extremely dishonest. The food is actually quite good, but pay attention to your bill especially late at night. During lunch hours, they are legit.As the day progresses into night and bargoers start to populate the restaurant, the establishment will try to overcharge you, you will not easily find menus or prices clearly posted. If you go out of your way and ask about prices, they will size you up and then give you a price. I've seen this happen very many times.Always look at the menu, and always add up the numbers in your head if you go here. I've caught them many many times."], ["Dawn P.", "The description is misleading. It's really middle eastern rather than Indian. On top of that, they serve pizza. The food was mediocre at best. The lamb was so tough we could barely cut it. The falafel was great, was was the hummus. Not worth the drive, but probably good for late night hunger pangs."], ["Mauricio P.", "Delicious falafel pita and lentil soup. Authentic and well priced. Ordered delivery and got here in solid time, and hot."], ["Jessica H.", "I love this place, their food is great.  I love their chicken schwarma.  I used to come here with my friends from Saudi Arabia and UAE...  they swore by their food. Their pizza is ok, nothing to write home about, but I got it every time I was out for a late night in Hartford.  It is reasonably priced.  It is small and has seating.  You place the order, they make it and bring it to you."], ["Anthony P.", "Good place to get pizza, too!"], ["Anon Y.", "The food was good. I had rice and kebab. The chicken orzo soup is very good, if a bit too salty. Ambiance and cleanliness could be slightly better."], ["d. b.", "I live and work in Hartford and have had Aladdin probably 20 times.  Always pick-up.  I've never dined in or taken delivery.Positives:- Brick oven pizzas are made with fresh ingredients and good dough.- Sometimes I order 9 falafels for $3 and that's my dinner - they are great.- The meats are fresh and on display.  Cooked perfectly.- They give a time for pick up and stick to it.- Fresh ingredients.Negatives:- Pita bread tasts like grocery store stuff.  They put it in the brick oven to warm it up which dries it further.  Fortunately their hummos can salvage it.- To-go salad orders tend to get soggy unless you get after them immediately.- It depends who's working.  Some guys are great and cheerful, others are not.  Don't take it personally, let the food do the talking.Overall: a consisent, affordable, and different restaurant."], ["Erik P.", "Went here late one night after a Wolfpack game. The pizza is great, the falafel is so so and can I just say the man at the counter was kind of a douche about us ordering falafel because they didn't have any prepared as they do with pizza by the slice. It wasn't even close to closing time but for some reason he had a bug up his ass about people ordering falafel at 1am. Upside of the whole night is the guy in front of me paid for my meal. Thanks bro, I'll get you on the next one hoss. If I ever go back that is."]], "Posh Tomato": [["Jess L.", "Joe B, Thien N, and I got to Posh just before it was about to close. Mad props for letting us hang out a bit and devour your delicious pizzas.The people who work here were pretty chill and into joking around with us. But more importantly, they helped us choose some great additional toppings on some of their listed pizzas. (The toppings weren't necessary, but I like how they helped us get creative.) The pizzas were done in a jiffy. They're super thin but not thin on the toppings, letting the flavors and combinations shine.Definitely a cool spot with some solid pizza. I'd definitely come back."], ["Joe C.", "First of all I don't know why these counter style (aka: Subway-Chipotle-style) pizza joints are becoming a trend. One called Red Tomado opened up in New Haven this past year and shortly afterwards this place opened up.Second, can I have my money back? Their menu claims \"you are five minutes away from the best pizza of your life.\" It wasn't. So can I have my money back for false advertising?But seriously, was somebody not getting toppings they requested, which prompted these counter style assembly line pizza joints to sprout up? Plus, what's the obsession with getting a speedy pizza? Pizza just takes a few minutes to cook in an oven anyway. It is already one of the fastest food items you can make.Their pizza is a great concept :: rolls eyes :: .......charge full price for a full pie and use only the amount of dough normally supplied for 1.5 slices. That's a terrific concept for their bottom line, but it sucks for customers like you and me who are hungry. So their their pizza crusts ends up being thinner than a potato chip. Yup it's the thinnest crust I've ever experienced in my life. It resembles a matza more than a pizza. However it doesn't surprise me that this pizza chain originated in Brooklyn. Some of the worst food I've ever eaten has come from Brooklyn.I ended up paying $13 for a lunch and still had to grab some food later on at Whole Foods because I walked away hungry from this place.So I really don't know what is so posh about Posh Tomato. You'll have to purchase two pizzas to equal a normal pizza at any other regular pizza place. That ain't called posh. That's called stupid."], ["Julie H.", "The Gorgonzola pizza is absolutely delicious. Though I was hesitant to \"roll\" the quarter sized slice and \"eat it like a taco\", I took advantage of the opportunity to experience the perfectly prepared pizza the way it was intended. Thank goodness I did. The crust served as the yummy crunch to salad toppings and seemed to tie it all together! Every last bite was delicious! My children also raved about the cheese and pepperoni pizzas and continue to request Posh pizza..."], ["Kurt S.", "I was excited to try this place since it's franchised by the owners of Goldberg's bagels who can do no wrong in my book.  Unfortunately I'm going to have to agree with Joe C below, it's not good.  I called in an order (from WOB across the street) on a Thursday night for a pie with pepperoni, mushrooms and onions.  They only had red onions, so I left those off.  I was told 15 minutes..not really the 2.5 minutes they claim.  The pepperoni is diced, ruining any chances for glorious grease cups.  The crust is beyond thin.  Like the thinnest cracker you've ever had, but not crunchy.  I do enjoy a good NY slice but this is not that.  I can think of a hundred other pizzas I'd rather have than this.  Would take 75 personal pizzas from this place to fill me up.  Don't think I'll be back :("], ["Jon S.", "Just finishing my first pizza here and I'm really eager to write this review. I've seen the \"coming soon\" signs for a few weeks and I've been very excited to try these pizzas. The pizzas are extremely thin crust and \"personal sized\", about 10\" across. The thin crust is perfect and highlights the really fresh toppings. I split a portobello pizza with a friend, and everything tastes great. You can tell the cheese, mushroom, and basil were fresh. On the menu are also dessert pizzas which looked quite amazing. The location is perfect in Blueback. Pizzas take about 5 minutes, which is great for both eating in and taking away. In the inner months I can see myself ordering a pizza and eating it in one of the sitting areas in the center. That being said, there's not too many seats if you do want to eat in. I'd definitely recommend this to anyone visiting the center. It's a great mid-shopping food spot."], ["Rana P.", "Overall very impressed with this place! The pizza is delicious and the vibe is cool. It's very reminiscent of a pizza version of chipotle. The concept made me nervous because I thought it would take a long time, but the pizza came out in less than 5 minutes. But let me emphasize: the pizza is delicious. I got the portobello pizza and it was better than expected. The price is very reasonable. Around $10 for a personal pie. The only downside is that there isn't much seating, and I would imagine that it would get crowded during busy hours."], ["Lesley M.", "Now I know why this place is called Posh Tomato...The pizza is alarmingly thin, just like Victoria Beckham, a.k.a. Posh Spice.This new concept of the quick pizza sounds cool, but the result is a glorified Easy Bake pizza.  I would not even called it pizza, I would call it glorified cracker.  You need three pizzas to be full.In short, there are better places to have pizza within walking distance like Rizzutos or Harry's.However, the employees are very nice.FYI:  They are opened until 11 on Fridays and Saturdays."], ["Leah M.", "WOW!  Paper thin (not exaggerating, like might be thinner than paper), hot, fresh, top-notch ingredients, and most importantly, delicious!  When you walk in you step up to counter and they roll your pizza dough and top it right in front of you.  It took less than 5 minutes for them to cook the pizza due to the paper thin crust.  I'm digging this fast casual pizza concept.  Fun and unique!  We ordered the Charcuterie and Fromage and the Arugula.  The white sauce in the charcuterie pizza was sooo delicious.  The arugula was extremely fresh and refreshing on top of the pizza.  They also have a bunch of different salad pizzas that I can't wait to try.  So glad this place popped up in Blue Back Square!"], ["Danie L.", "The food was delicious. Fresh. They give you a choice between whole wheat or white. I got whole wheat with their signature meatball pizza and it was really good. You get to watch them putting the pizza together. It's a hidden gem between the tea shop and the book store. Love the environment. Very friendly people. I will be coming back for more."], ["Stephanie B.", "So many great toppings! Both the refill and the wheat crusts are excellent. This is the perfect choice if you're crazing thin and crisp pizza, or need a really quick bite somewhere. They are working on serving wine and beer soon."], ["Ashley N.", "It has been way too long since I've written a review and this restaurant is the perfect way to start up my review juices. Stopped by the old pink berry to check out the new restaurant in town and also have a legit excuse to stuff my face with pizza. Think of this place as a cool, trendy, fast-food joint where you can select from a few favorites or build your own. Originally I was going to order a \"salad\" and the salmon pie because it sounded somewhat healthy and unique. I soon learned the \"salad\" was a pizza salad and the guy behind me told me his fave was the Caesar salad pizza. I ended up ordering just the Caesar pizza and Wow, so happy I switched my order! The crust is paper thin and so easy to roll up and devour in a hot second. The salad toppings were fresh and plentiful but a tad messy when eating on a slice of pizza. The price is what you can expect for a gourmet style pizza located in We Ha. The atmosphere is really relaxing though there are not a lot of seats. Also, expect to wait for a good 5 minutes for your pie but I'm telling you, it will be worth it! Ps. Go all out and order that chocolate dessert pizza too (I will next time)....you know you want too."], ["Diane T.", "Not the best pizza but not totally bad either. As other reviewers said, the crust is really, really thin (thinner than New York style), perfect for anyone on a low carb diet, though not my thing personally. Their slices are basically bite-sized and I can finish a slice in 3 bites, which is saying a lot for me. All of that aside, the ingredients are fresh and the pizza is decent."], ["Breana M.", "I've never experienced pizza like this before!! Super fresh delicious ingredients, that they put on the thinnest pier of dough I've ever seen!  It's not your normal pizza place, but trust me that's a good thing!  You'll have to try it to see how good it really is .  Also try their Caesar salad pizza (it's cut into only 4 slices which you then fold to eat) and their dessert pizza in addition to anything else you get!  Trust me, they're worth it!"], ["Ava G.", "Love this little place.... They have pizza ready for you in 3 minutes. Imagine a really yummy pizza, with the best ingredients like mozzarella sliced, portobello mushrooms, and basil on a whole wheat thin crust.  They have great outdoor seating and if they served wine & beer it would be the best. When you go you have to try the desert pizza and tell Chad that Ava sent you."], ["Erica L.", "Loved the pizza!  The owner and servers were super nice and let us try a desert pizza on the house. Awesome!  Will be back."], ["Samantha M.", "Not a fan with all the greAt pizza options around .. I got the southern and just didn't taste like much .. Head to another place for pizza there are a bunch of good options not to far. Joeys or Harry's, backstage just to name a few"], ["Zoila V.", "Nice place! Perfect quick dinner on a Wednesday night in blue back. Cool concept of very thin crust personal pizzas all done in 5 minutes. There's plenty of different combinations, all of which sound amazing. The owner suggested that the \" best pizza on the menu\" was the ceasar salad pizza, with chicken and mushrooms. Definitely one of the best salads I've had! The pizza crust is so crispy and crunchy and the garlic and cheese and ceasar dressing really make this. It was a great pick for going to a pizza place and trying to stick with a more healthy choice. My fiancé even said that he would eat salad only if it was on a pizza from now on. The atmosphere here on Wednesday was awesome! We took our pizzas outside and enjoyed a concert of a drum group. Owner even came out to ask how the pizza was, nice touch. We will definitely be back here!"], ["Mike D.", "The staff is friendly, and the options are plenty. I ordered a Portobello pizza, and it was delicious. If you like thin crust pizza, you'll enjoy this place!"], ["Eric N.", "Great personalized size thin pizza.  We lucked out and a band was playing next store at the plaza in BlueBack.  We will miss PinkBerry, but what a great add."], ["Larissa S.", "Excellent concept and great food! This place is a lot of fun, and I can see this becoming a popular place.  Fresh ingredients on super thin pie crust. Very creative menu.My softball team had met at World of Beers across the plaza, and wanted to go somewhere else for dinner.  Pizza & beer is usually our style, and by coincidence it was the soft opening of the new restaurant.  Things were a little hectic, but it all worked out and we were recieved with excellent customer service and delicious pizza. Would definitely go back and recommend to friends."]], "Arugula": [["Steven H.", "Everything was very good, but just too much food! The charcuterie and cheese plates were amazing, some of the best selections I've had. Those two plates alone would be worth 5 stars, the reason for the downgrade was the salad (it was wilty) and service. We were a larger group, but even so, it took nearly 2.5 hours to get through the meal.The flatbreads are larger than you would expect, don't plan on having one by yourself if you're getting anything else as an app or salad - you'll never finish it."], ["Emily C.", "Besides my visit yesterday, I hadn't been to Arugula in years. My roommates and I used to go for each of our birthday meals - I don't know why I ever stopped! And thankfully now I live so much closer.Arugula is a delight. AWESOME cheese selection and housemade charcuterie plate, gorgeous flatbreads (the duck confit is a favorite), and lovely desserts (think housemade donut bites dusted with cardamom cinnamon sugar served with white/dark chocolate ganache). Yesterday, I stopped in with two friends for a late lunch. It was a BEAUTIFUL sunny day in West Hartford center and they'd never been to Arugula. While we'd have loved to have outdoor seating, the food was enough of a draw.I ordered a glass of chardonnay and a chicken shwarma wrap. Our server was efficient, pleasant, and attractive as hell (that certainly doesn't hurt) and the entire meal was just a joy. One friend enjoyed her Mediterranean cobb and the other LOVED the curried eggplant flatbread. All in all, a fantastic experience. Granted, yes, the restaurant wasn't very busy at 3pm on a Saturday (kinda an off time) but I've always had good luck with the restaurant service. My only gripe is that there's no glass of wine option for less than $9. At least it's tasty wine!"], ["Minh C.", "We must have ordered the wrong dishes, because after 10+ plates, we couldn't find anything much to like at Arugula.  The flavors were all around bland, simply non-existent, or over the top.  Of all the plates that we tried, a couple comes to mind - The falafel was lackluster while the supporting pita was extremely over seasoned - to the point where I felt like I was going to either choke or spit it out across the table onto one of my mates.   The couscous wasn't any better, but at least it provided an alternative to eating something that tasted like straight oregano.The salad was okay, and the \"squeaky cheese\" was good - but how can something that squeaks in your mouth go wrong?  The flank steak was good, but the fries drew no distinction from those found at a McDonald's near you.Not everything at Arugula was bad though.  We liked our waitress, who was upbeat and friendly.  We also enjoyed the Croque Madam, but really, a fried egg will make anything taste good.  The soap in the bathroom is apparently \"nice\" as the Lady of the Table put it, but we weren't at a Bed Bath and Beyond.We felt terrible for having ordered so much food, only to have the waitress take it away.  What a waste of quality ingredients.Thanks to SotN and LotT for providing their comments to this review."], ["Zak H.", "This place is crap... Everything we ordered tasting bad and was expensive... Even when I asked the waitor what's good he couldn't name anything worth ordering, should have left right then"], ["Lana M.", "If I was rating this place based on just the food I would give it five stars. The lasagna was AMAZING! The service however is a different story. The waitress was very stiff and frankly seemed extremely annoyed we were sitting at her table."], ["Joel J.", "We made a 9pm reservation for Arugula due to my girlfriend's late arrival to the Hartford area on a Friday night, knowing that their 10:30pm closing time would be tight for us. Arugula is a relatively small space. You can see everyone in the restaurant from our table at the back corner, near the kitchen.We were greeted quickly and seated quickly, but were a little surprised by how empty it already was at just about 9pm. We ordered wine from their moderately sized wine list and got the Rosemary Polenta to start. Fresh warm bread came to the table after about 5 minutes, and there was oil and pepper to dip in. We ordered the filet of tuna and the pumpkin and ricotta ravioli. Both were generous portions and were very good. The polenta was also excellent. It was honestly a struggle to decide whether to keep eating the bread/polenta, or the main course.The ambience was generally very relaxed, quiet, and comfortable. Not too upscale, but not an Applebees, for sure. Our server was helpful when asked questions about the wine and the entrees, and made us feel at home.My one complaint would be that as it got close to closing time, the staff began to clear silverware off other tables, clean the floors, etc. And when we got up to leave, the door to the restaurant was already locked, so we had to get someone to let us out. Not a big demerit, but certainly odd."], ["Sandra C.", "Foodies of Central CT unite. The mother ship has been found! :))Best food in West Hartford I ever had. Will most definitely be coming back.Friday and Saturday nights are so in demand at this place that you can only reserve for a maximum of four people. I went with a small group of friends and immediately loved the decor inside. It was so cozy and intimate. We watched quite a few couples with no reservations come and have to come back later. It appears that this is a very romantic place for people.The food was outstanding. I got the moules et frites and my friends got the tuna filet mignon. All entrees were superlative. I had never tried tuna before and had a bite...I was very impressed. My friends who ordered the tuna said that the staff knew what they were doing because they asked did they want their tuna rare or medium rare. Salads were large and delicious and the two deserts we got to share were delicious also. Overall an excellent dining experience and this is where I would go to impress someone special or go just to have a really really good meal.And I cannot close out this review without mentioning the staff. We didn't have to pay extra for the comic relief of Mike our server. He's co-founder (shhhhh - he never let's on) and he was cracking jokes left and right. We were rolling in our seats holding our sides from hooting with laughter.Want a convivial Cheers-like atmosphere with some darn good food and drinks? Check out Arugula. Maybe I'll be seeing you at the next table over. Bon appetit!*** If you want to try restaurants on par with this fine establishment, try River Tavern in Chester, CT. I'm more than happy to recommend it here because they are no where near Arugula geographically but the food and service are top-notch. Again, bon appetit! ***"], ["Anuj S.", "Great experience today at Arugula.  This place is really well-done in terms of decor.  Looks really artistically pleasing as soon as you walk in.Food was great.  The falafel appetizer was good.  The falafel themselves were good and the salad and olives they come with.  There's this paste that comes with the pita bread which was an interesting taste.  It was a bit too salty for me, but as I understand it that's how it's supposed to be.  The entire plate is presented beautifully.The most common item on the menu are the flatbreads.  There are some great options and fortunately for me there were many many vegetarian options.  The curried eggplant flatbread was great.  The arugula was really great.  I also tried the asparagus one with blue cheese or goat cheese (whichever that was) and I just thought the cheese was a bit too strong.'You know what, I'm always up for taste, though.  I tend to dislike bland food, so I appreciate that the food here was very flavorful.Service was also good, so nothing to complain about there.I would go back to Arugula.  I wish they had something like a falafel sandwich/plate type of entree.  Maybe it's something I could request next time."], ["M B.", "Food was off.the.hook. The bread was awesome - the ambiance was great and cozy - went as a group of friends and was met with wonderful service. I loved the seafood here. Good date spot, also nice bottled beers here."], ["Ian T.", "I wanted to really like this restaurant. It is good and I am going back, but has its flaws. The place is small and intimate. The staff is attentive and professional. They do a great job and are helpful. The ambiance is fabulous and transports you to someplace in Europe not West Hartford.  I just get the feeling that they try too hard to make their food exotic with too many ingredients and as a result it is confused. I had the couscous  dish which had olives eggplant curry chicken in it. The flavors did not really go well together and there were too many strong things in there. My wife ordered clam pasta and again too strongly spiced. We also had the arugula flatbread and again too many odd flavors from exotic ingredients put together that should not be together. Everything is just too weird. I think they would do better keeping things simple."], ["Shawn L.", "I don't know how it took us one hour to wait for our dishes. When I tried to ask the waiters, no one replied to me! The only thing they did fast enough was they had started to took dishes when my friend still working on them. After the meal, I tried to complain to their manager, but she got mad before I did, even more, she chased me out of the restaurant and yelled at me! What an awful place. Try somewhere else if you don't want to be disappointed and angry."], ["K K.", "Literally one of the best places I've ever eaten. Bread is always on the table, the food is light but flavorful, and although pricy, the portion sizes can easily be split up. A flatbread is the size of a pizza. So much good food!"], ["Danielle B.", "A perfect date night place or a spot to sit and chat with friends. The wine list is long and the food exquisite!  They always have specials and the service has yet to disappoint me.  I always get the falafel appetizer, the sea same pita bread is a little overwhelming, but the veggies, olives, and falafel are awesome!  This trip I got the halibut that was on special - so delicious!  I normally get the tuna which is equally as good.  My friend and I sat and chatted for awhile and there was no pressure to hurry and leave.  I will definitely be back!!  The only bad part is parking - but that's a given problem throughout that West Hartford strip!"], ["Alison H.", "The food was tasty and it was something different for us to enjoy. The price isn't great, but the ambiance is lovely for a date night. The best thing we ordered was the halloumi salad. I recommend it to all vegetarians. The halloumi has yummy spices and is the consistency such that it actually tastes like chicken. My husband tried it and was concerned they might have screwed up the order and put chicken in it. Nope! Just some delicious cheese...I would definitely return. The italian pomegranate soda is a nice novelty item too. The waitress told me the most popular flavor is peach."], ["Mel B.", "I've been to Arugula many times over the years and have come to the conclusion it's one of my favorite restaurants in CT.  It is always consistently good and I have yet to have a bad meal here. They start you off with warm, fresh loaves of bread and olive oil which is my idea of a perfect start to a meal.  The best things to order:Starters:Mussels- in a curry sauce, served with sweet potato friesFattoush salad- I always get this when I go for lunch, or a lot of times for a dinner when I know I'm going to enjoy a lot of appetizers.  It is so flavorful and light and one of the only salads I legitimately crave.Flatbreads- MUST HAVES. Get as main meal or split as an appetizer.  My favorite is the duck confit one.  The Italian sausage & roasted eggplant one is good too, as is the baby shrimp, and fig & asparagus with bleu cheese.  You really can't go wrong though and there's one for whatever you're craving.Entrees: Seared tuna- fantasticMeat LasagnaRoasted mushroom rosemary lasagnaPumpkin ravioliOkay so it basically seems like I've listed the entire menu, which I sort of have.  But that speaks to how good this place is; you really can't go wrong. And don't skip out on dessert!  Chocolate voodoo cake or the bread pudding are solid bets."], ["Anthony P.", "(Continuation from first review. Thanks to the limitation on word count).Before having my tuna, I asked the waitress what wine would pair well with the tuna, in which she responded \"well, what do you like, red or white?\" I said, \"in that case, what would you recommend for a red?\" she responded, \"i'd say a Shiraz.\" She brought me a glass of Shiraz, she didn't tell me what kind, but all I could say was that the pairing of that specific Shiraz did not go well with that tuna. My girlfriend ordered a Merlot. Once again we had no clue what type of Merlot. She never informed us or even allowed us to take a sample, but I initially trusted her confidence in the pairings. I preferred my girlfriend's Merlot over mine. I think it should have been the other way around, the duck with that specific Shiraz, and my tuna with that Merlot. Heading to the bathroom you can see the whole kitchen. It looked small and actually reminded me of a typical fancy restaurant in New York City. It almost brought me back to the times where my naive Connecticut friends and I aimlessly walked around in New York City searching for a fine dining restaurant, only to be swayed in thinking that just because we were in a popular section meant that we would be getting excellent quality food. Yeah, we were just dumb tourists, and after dining at Arugula I kind of got that vibe. After experiencing the service, seeing the kitchen, and having those three courses, I was definitely smacked upside the head with a memory of my tourist trips to New York City. It all came together. And reflecting back, we ordered 4 glasses of wine, the escargot, duck confit and filet mignon of tuna dishes, and dessert. I believe this was a pretty nice check, not to mention that I always tip 20%. So given the price with the dining experience, I believe that there is an uneven balance to this scale of weighing the pros and cons, where the cons kind of outweigh the pros.From this Mediterranean restaurant, my girlfriend and I had a very French type of dining experience. This fine dining restaurant gets an A-OK in my book. Maybe I will come back, but I believe for me it's maybe on to the next restaurant.;)"], ["Melody B.", "Very small and cozy with an imaginative menu. I ordered the wild mushroom and rosemary lasagna and my daughter ordered the pumpkin and ricotta ravioli. Excellent! The bread arrived fresh from the oven. Service was accommodating as we arrived without a reservation."], ["Jon G.", "Believe it or not, there are some restaurants in this world that truly have earned the right to treat their customers like total crap.  Arugula is not one of those places.Do you remember Seinfeld's Soup N*zi for example?  For those of you don't - the Soup N*zi made soup so amazingly delicious that he had a line out the door every day.  One little slip-up in protocol while waiting in line, however, and the Soup N*zi would banish the offending customer for a certain amount of time based on the \"severity\" of the offense.  \"No soup for you, two weeks!\", for example.There are real-life restaurants that have earned the right to completely ignore customer service just because they can.  Ever been to the Michelangelo at the Bellagio in Vegas, for example?  It is one of the best restaurants on the planet, but it is pretty well known that one would never dare complain or attempt to send something back.  They would simply ask you to leave and not to return.Sorry for the digression - the point is that as hard as Arugula may try to emulate the Soup N*zi, they are miles away from being good enough.As long as everything goes according to their little plan, you can actually have a very good meal here.  Any deviation, however, and watch out.  Ten minutes late for your reservation? \"Tough luck - your table's been given away.\"Feel like changing your reservation time or the number of people in your party on short notice?  \"Guess again\".Don't like a particular ingredient and ask it be left out?  \"Order something else.  The recipes are written for a reason and can't be altered.\"Got an allergy?  OK, then they'll leave it out, but get ready for a bunch of eye rolling and sighing followed by a LOUD vocalization of your particular affliction to the kitchen.  \"TABLE 10 IS ALLERGIC TO NUTS!!!!!!\" in a tone that really says, \"The annoying freak at table 10 doesn't like nuts and is feigning an allergy!\"Want to get something to go?  \"Only if the chef feels like it\" at the time. Dare you complain about the slightest thing?  No matter what it is, \"it's your fault\".It's almost like they get off on mistreating people only to watch them walk out the door with their tails between their legs.  Whatever the psychology behind it, we're certainly done paying actual money for that kind of mistreatment.  Sorry, Arugula - \"No soup for you!\""], ["Ava D.", "Been here twice and the food here is amazing. I'm not huge fan of mussels, but the curry that it comes in is soooo good. I also really liked the flat breads. We come here with large work groups so we end up ordering a lot of food and I tend to get filled up on apps. Nearly everything I've had here is good. The service is great too. Arugula is not open on Mondays though - so keep that in mind!"], ["Anthony D.", "Mixed bag at Arugula.The service is great, really helpful staff and they seem knowledgeable The food is just OK.  The Calamari starter is very good, grilled instead of fried, always a great option.  Had the Duck entree and unfortunately it wasn't great to say the least.  Overall pretty greasy and unappealing.The pricing is fair, but it adds up.  Expect to pay around $100 or more for two guests and I think you can find some better values in the area."]], "Tangiers International": [], "Elmwood Kabob": [], "Cavos Tavern & Pizzaria": [["BJ C.", "Best Greek food I've had in CT. Everything is made in the restaurant by people who know what they're doing. We often do takeout and will usually get a bunch of sides. What I'd recommend:Lamb meatballs- not too gamey and full of flavor!Hummus- traditional, flavorful and clearly homemade Chicken souvlaki- tender, juicy and cooked to perfectionFeta and olives- you probably ask yourself \"how can one Feta be better than any Feta I've had before\" to which I would respond with \"try it here and then let me know!\"Moussaka- warm, layered and delicious- a great winter meal!I was there recently doing take-out for a picnic at Gouveau Vineyards in Wallingford (review coming soon, but its great!) and saw they were building an outdoor bar.I'd recommend as a great dinner and drinking hole, nice night out with your \"other\" or a family spot!"], ["Farrah M.", "Service was great!Food was good too. We had the meat platter for $28. It had a chicken, pork and lamb skewers with a couple of shrimp, it was over rice and had little pita bread with it. It came with a salad.parking: in the plazawait: I came at dinner time during a week night so it wasn't busy at all.Attire: casual"], ["Jodi L.", "This is the best Greek food at a restaurant  in CT I have found.   Gyros meat is authentic from  the spit.   Kasseri cheese was amazing although was a little hard by the time it was delivered to the table.   Ill drive to it, for thats the best we have here in mid CT"], ["Daniel H.", "the best Greek restaurant in the Hartford area bar none.  Very friendly staff.  Quick service.  Everything is delicious.   We've had the smelt appetizer, steak kebab, seafood with shells and others.  The meat has a nice crust on it.  The portions are generous.  They even give you nice chunks of feta on the salad.  The waiter gave us a free dessert last time we went."], ["Patrick D.", "I'm counting this as a \"find.\" Somewhat tucked away on the Berlin Turnpike, Cavos is fairly nondescript on the outside, but that ends when you step inside (or outside, since they've got patio seating as well). Our service, provided by the owner's daughter, was exceptional...very friendly and helpful in explaining some of the lesser known Greek specialties. She even brought a plate of Gyro meat for my daughter to try before she ordered. The food was great, too, and came in copious quantities, meaning we'll be enjoying it for dinner tonight as well. The only problem with that? We were so stuffed we couldn't enjoy any of their desserts -- the baklava looked especially delicious. But that just means we'll have to go back, which will certainly happen."], ["Prince V.", "Service is exceptional. Food does taste very good. Feels like a home cooked meal. Got the Gyro plate on a weeknight. LOT OF FOOD. Lemon Chicken with Orzo was good too. Food is tasty. You should definitely go."], ["Marty L.", "My first time here with my kids and we filled up with delicious food!  Fried calamari was fresh and delicious - also plentiful for sharing. Appetizer with hummus, yogurt and garlic potato spread and olive-feta was delicious but had to hold off to make room for the meat platter. Souvlaki and donor with grilled shrimp. Filled ourselves silly and saved all the left over for another meal at home."], ["Jola M.", "First the good. The staff is very attentive and friendly, the food is very good and served in very generous portions. The only disappointment was the fact that we had hoped to be seated in the outdoor section but unfortunately we were seated inside due to the rain and the indoor decor leaves much to be desired.I will be back to try their pizza."], ["Kara H.", "A lot of people are quick to dismiss a Greek restaurant that serves pizza. I blame this on too many less than average experiences with over extended menus, watery tomato sauce and deep fried frozen appetizers. My first experience at Cavos proved that a focus on Greek food with the added convenience of serving pizza could actually work. There's not much to speak of decor-wise (ripped booth seats, random pictures of roosters, slightly exposed kitchen and antique looking sconces) but they do have a patio in front sporting a full bar, which I'm sure is fun in the summer. We started with the cold platter (Skordalia, hummus, get and olives and tzatziki. The skordalia was slightly creamy and incredibly garlicky, but could have used a pinch of salt to uplift the boiled potato. The hummus was amazing- incredibly light with an almost whipped texture, garlicky and smooth. The pita bread they served was slightly crisped in places (possibly heated on flat top), fluffy and chewy. The same pita and tzatziki made up my chicken svoulaki sandwich. The chicken and lamb skewers were both nicely tender and had some char from the grill. For me the chicken was undersalted (seasoned) but my boyfriend loved the lamb (served on skewers with rice, pita and tzatziki). Overall, if you're feeling let down by pizza places with Greek options, try a Greek place with a pizza option!"], ["Lisa L.", "Enjoyed everything we have had here until tonight.  I found the ratio of cheese to sauce on the pizza not right- way too much cheese.  I had to cut pieces of cheese off.  Love the meatball topping but didn't think the bacon on top of the pizza was cooked enough so I probably wouldn't order that again.  I agree with others that the hummus and the chicken lemon soup are out of this world and cold really make a meal out of those two things and be happy.  I will try the pizza again and just request less cheese and more sauce and see how it turns out !"], ["Angie Nicole S.", "Amazing food, excellent service and a great wine selection.  It's the best food on the Berlin turnpike.  I recommend this place to everyone."], ["Jon G.", "I hate to say it, but we went to Cavo's for lunch when it first opened a few years ago.  I'll be completely blunt - it totally sucked.However, some our our good friends told us that Cavo's had vastly improved since then.  I was surprised to discover that they were, in fact, completely correct.  The Gyro Plate was terrific and the service was top-notch.  I've almost completely forgotten about our experience way back when.  Very nice patio as well!"], ["Lauren V.", "My coworkers and I stopped here on a whim while out for lunch. None of us had ever been and I have to admit it looked a little sketchy when we pulled up, but we went based on the good reviews on yelp and were pleasantly surprised with the food. I asked the waitress for a recommendation and she suggested the Grilled Loukaniko and it was very tasty!  They allowed me to order it with grilled vegetables instead of fries and the vegetables were really good. The service was great, the waitstaff was super friendly. I will definitely recommend this place and go back if ever in the area again."], ["Lesley B.", "I have only had a takeout  for lunch but OmG best gyro I've ever had. Our new favorite lunch place and we will keep going back :)"], ["Jason M.", "Outstanding food, great service and nice ambience. The lamb gyro's almost melted in my mouth and the hummus was delicious. Will go again, great place."], ["Andrew B.", "We are Greek and have had difficulty finding a good Greek restaurant in the area.   Recently, we visited  Cavos (twice) and were very impressed.  Everything was very authentic and as good (or better) than the homemade stuff our family prepares on holidays.The Moussaka, Spanikopita, Grape Leaves, Lamp Chops and  Hummus are all very good and highly recommended."], ["Joe P.", "Friend and I just returned from dinner here. We both had a Gyros. For any displaced Chicago or Midwestern folks, this is as close to a Chicago Greektown Gyro as I have found, in Connecticut. They have an actual rotating spit and the meat is sliced off fresh. The meat isn't quite as spicy as the Chicago version, but it is still pretty close. They were served on fresh pita with onions, tomato and a great tzatziki sauce. We were so desperate for a Chicago style Gyro that we were actually considering just buying a spit. Realizing that it probably wasn't the best solution to buy our own spit, we started searching for a place. Finally found Cavos which satisfied the craving.We will definitely return!"], ["Tara B.", "This place is phenomenal! We had greek style pizza (that was awesome), but we are definitely coming back to try the traditional meals!"], ["Steven H.", "Delicious Greek food, a tad pricey given the location and decor. Decent selections of wine."], ["Jim C.", "Excellent gyros! The gyro plate feeds two people no problem."]], "Front Street Bistro": [], "Majorca": [], "Sisson Avenue Pizza House": [["Anthony P.", "I do not care what you say, I LOVE this pizza! Why, do you ask? Maybe it's because it's across the street from a bar, and sometimes late night food is great to have after a night of sipping on brews. I have no issues with the quality of this pizza. I am originally from around the boroughs of New York, so any pizza that's thin crust is at least A-OK with me! I like oil dripping from my pizza. I love the sauce and the melted cheese. Maybe you think it's low quality? Maybe I think it's superb! One man's trash is another man's treasure! The guys who work there may not be Italian (which has been for awhile typical of any of those take-out/sell-by-slice places. God bless these guys. Their pizza place is in an area where individuals walk around late nights zoned out on substances. Here is a low down I got from one of the workers from the Half Door, the bar which is across the street from this place. Buy 4 slices, it's 1/4 sized BIGGER than a large pie (that's a whole pizza in New York talk). On top of those 4 slices being BIGGER than a large pie, you pay $4 LESS than you would for a large pie. So you choose, $12 for 4 slices that is bigger than a whole large pizza, or $16 for a large pizza that is 1/4 smaller than 4 slices? Up to you on how you want it. I guess the con about those slices is it's not as fresh as ordering up a whole large pizza. I could care less, I carry the New York mentality with my pizza. As long as the pizza cheese is melted, the tomato sauce is good and the oil is dripping down the pizza..........i'm fan! I come here a lot, so obviously my brain and body loves this place. So I gave it 4 stars."], ["Byron D.", "I called in order for pizzas and chicken wings. We had people working at our home and needed to feed the workers. I was pleasantly surprised to find that the entire order was delivered 1/2 hour later. The pizza was fine the chicken wings were good.  The owners through in a complimentary 2 liter bottle of soda as well. I would recommend Sisson Pizza anytime you need a delivery."], ["Slinky s.", "Wow... So mean there. I am sorry yelpers I've Been raving about their late night hours & menu for selection for so long... Never would've imagined they could be so mean when they mess up your order & ironicLly they gave me more than I pd for... I called & told them my order was wrong - guy on phone said I had to come in In person to voice complaint - so I did & waited do patiently &tried not to let other patrons hear my problem - owner told me to leave!!! $2 my order would cost him - great job ... Been going there once a wk for at least 4yrs spending min$20 so glad you think not remedying my $2 mistake is good service. So mean"], ["Anthony A.", "Run by a bunch of very rude Middle Eastern dudes who could care less about customer loyalty. The pizza is truly mediocre as are the gyros and sandwiches. Don't bother."], ["Kevin C.", "Sisson Ave Pizza pretty much has a monopoly on late night (after 1am) delivery in West Hartford. I couldn't imagine ordering from here on a normal night when their are plenty of other spots. Since they are known as a \"pizza house\" we always seem to order the pizza. It's pretty gross. Very greasy and I always think the sauce tastes like ketchup. I just about gave up on this place until I tried other things on the menu. I was pleasantly surprised at their grinders and pitas. Word to the wise, if you're home from the bar- skip the pizza and get yourself something else on the menu. You're going to order no matter what, right?"], ["Laura F.", "Its not the tastiest pizza in the world, but I'd say its the tastiest pizza in the neighborhood.   I do like it.  I've had Sisson Pizza deliver to my house many times, but its really good at being a late night snack.  The restaurant is usually busy with the post-bar crowd between 2-3am, so you may get some free entertainment with that slice."], ["Joe R.", "The longest that I've ever waited for a pizza. Its not like their pizza is anything to rave about either. I'll never order from sisson ave pizza again."], ["Sara L.", "A divinely suitable amount of grease/chees/sauce for post Half Door beer induced cravings of the pizza variety.  Walk across the street and get yourself some. Go now."], ["J P.", "Too bad I can't rate Sisson Ave pizza zero stars. A couple friends & drunkenly ordered pizza to our Hartford hotel room at 2am. It hadn't come by 2:30 so we called again and were told it was on its way. Long story short, they never came. Assholes! Whatever, we probably didn't need pizza at 3am, but that's not the point!"], ["Michael C.", "Full menu open late, so great stop after drinks. They sell by the slice so always good for a quick bite aswell. Prices a touch on the high side."], ["B. W. P.", "Solid Pizza for the price. Thin dough with a nice, medium crust.  Just the right balance of cheese.  They sell slices.  Check this place out and decide for yourself.  Just moved to the area (Hartford - West End), and this has been our favorite place thus far."], ["Aleesi W.", "From previous reviews, it looks like the dine-in experience isn't that great, but sometimes, that's just how an establishment works (trust me, I know a pizza place back home with the shittiest service-check my reviews-the dining area is always empty but they're constantly delivering because the pizza is amazing).  So this review is for their delivery service, which I utilized on allmenus.com and their food.Delivery: I ordered it for a future delivery time of 10:30pm instead of ASAP and got a knock on my door at exactly 10:30pm. Great, because I was starving and they came right on time (I usually find most deliveries to be late, even if slightly).Food: I'm usually very wary about ordering fries for delivery because fries tend to end up being luke-warm and soggy...but I was VERY impressed when I opened up the Styrofoam to-go box, finding my fries hot, crisp, and barely greasy. LOVE. I had ordered the double bacon cheeseburger deluxe which comes with fries and cole slaw. Didn't try the cole slaw, and the burger pretty standard...meaning good, but nothing spectacular. Seeing this is a place for pizza, I'm just happy they have lots of other foods to choose from since I didn't want pizza-I was really making bedroom eyes at the grilled cheese...but was craving meat therefore going with the burger. Also, I ordered the chocolate cake...absolutely delicious. Might be too sweet for some but I'm a big sugar junkie so it was perfect. A good-size single slab of thick, melt-in-your-mouth chocolate cake with chocolate chips and frosting. Overall, the delivery is prompt, the prices are good, and the quality of food that I ordered was excellent. I do plan to order again and try other things on their menu."], ["Julian W.", "I have never eaten there but I had them deliver me food probably over 100 times last school year when I still attended the University of Hartford (luckily I escaped).  Not sure why the people are saying the customer service was bad, maybe because they weren't getting it delivered to a University and the delivery people didn't know where they were going.  All I know is that my food was always on time, sometimes earlier than expected and the people would be patient if they got their early and wait for me to run across campus to meet them.  Everyone at school loved Sisson's because they had the \"best food for the drunchies and the munchies,\" and that's someone else's quote not mine.   Though the pizza was great, it's the calzone to blows everything away.  The large one is crazy big and can feed many people or one person for a few days.  If you are a university student don't hesitate on getting food delivered!"], ["Ben K.", "Solid pizza, and one of the few places where you can pick up a slice in the area. At $2.50 its a pricey slice, but the fact that its about the size of a German Shepard offsets any complaints. Food is fresh, simple (pizza doesn't need too much make up), not overly greasy and comes at an honest price. I have never had any reason to complain about service, though apparently this has been a problem for others. I live around the corner and usually call an order in to pick up or just pop in for a slice, so my experiences may be different than yours. Sisson Ave Pizza is right across the street from a Subway Sandwich shop and makes the $5 foot long all but obsolete."], ["Ali K.", "You know what Sisson ave was always there for me in college, after a late night of partying, a road trip, or if I needed some food to keep me going for finals. It was normally the first place I turned to call. I would usually get one of the pizza specials with wings and then my favorite the chicken fingers with fries platter. Also a hidden gem that they have, get the fried dough madddd good, I normally order delivery from them, I've been there once late night when I was bored and it was a little bit of a troop. They deliver until like 3:45 am and they close at 4. Soooo sick!"], ["Rolf L.", "Service is always good, delivery is quick, and the pizza is decent. Usually cooked just right. The party size is freakin' huge. Great for late night post drinks. If you live in downtown Hartford, you must have there menu in your drawer.  they deliver! Not nessasarily a place to seek out if not in the area, but a local staple none the less!"], ["Brynn C.", "Not bad pizza.  Right on the corner from me, so convenient.  We got it with feta and bacon, so it was a little salty, but the crust was delicious.  It really didn't stand out as fantastic, but it was good solid pizza.  Will probably go again :)"], ["Jeff D.", "This is like the first 1 star rating I have ever given. This place was horrible service .I was staying with Star Power Dance Talent Competition for the Hartford Show at the hilton and they had the brochure for the menu for this place. So we thought about giving it a try. The steak and cheese sub was decent, but not awesome! The main problem came the next  night when my roommate ordered a cheeseburger with NO MAYO. on it. The delivery took quite a while to get up to the hotel and not only that they put Mayo all over the bun when he had specifically asked for them not to. He also said the fries weren't that good. Anyway he called the manager up to tell them about their mistake and ask for his money back and/or another sandwich to be made and delivered and the guy who claimed to be the manager yelled and cursed at him using four letter words and such and claimed that it was CHEEESE on the bun and not MAYO. That was a load of Crap, we could smell the mayo on it and it was definitely NOT CHEESE. Anyway he kept hanging up on him and wouldn't offer to make a new sandwich or give his money back which most legitimate pizza shops would do if the customer calls and has a complaint about the food. I called back and tried to help by asking him why he runs his business like this and why he can't give the money back and or make a new sandwich? He cursed at me as well screaming like a maniac . I can only imagine what customers in his shop were thinking hearing him scream at me like that over the telephone like a crazy man.Anyway I will never try this place again. I tried Pietros pizza the next night and had no problems Food was great and they had lots of choices, fast efficient service and delivery Whatever you do, STAY AWAY FROM SISSONS."], ["Candice L.", "I don't even want to rate this place the customer service is horrible, I just had voice experience because I couldn't even believe what was going on, and I'm from SE WASHINGTON DC. I have had better service from a hole in the wall. Last week I was in Hartford on a CHRUCH convention staying at the Hilton. The service let out late and we were serving so the front desk recommend this awful place where the man over the phone taking my order was so rude and on top of that my came up to $44.95. And man got my order all wrong. I ask for cheese on the steak and cheese No cheese. I asked for a Tuna Club and I got a Turkey Club and the Pizza was soggy just nasty!!!!!!!!!!!!!!!!!!! So when i called back to speak with a manager it the same guy who by the way kept calling baby and I told him to stop don't! posed as the  manager but he wasn't. Still with the same crappy attitude want me to give the turkey in exchange for the tuna!!! I told the front desk and throw away all the circulars. Oh after all that they did sent d the Tuna like I but who want to eat food from such NASTY, RUDE and DISAGREEABLE PEOPLE. Unbelievable I'm going to better business bureau on them."], ["Michael L.", "Horrible, unreliable, crap for customer service. This is a Wednesday night, weather is fine. They do not even answer the phone - it is 1AM and they are open (as they state on website and brochures) until 3am.  Yet despite my 7 phone calls, no answer other than a voicemail that apologizes for not being open beyond 3am.  Talk about a lack of reliability and service."]], "Algarve Bar & Grill": []}