{"Rosita's Restaurant": [], "Agave Grill": [], "El Mercado": [], "La Plaza Del Mercado": [], "Monte Alban Restaurant": [], "Bartaco - West Hartford": [], "Crazy Chicken Grill": [], "Besito Mexican Restaurant": [], "Taco Bell": [], "Moe's Southwest Grill": [], "Lucky Taco Truck": [], "Agave's Taqueria": [], "Antojitos Colombianos": [], "Cisco's American Breakfast & Mexican Cuisine": [], "Los Sarapes": [], "Los Adobes": [], "Coyote Flaco Mexican Food": [], "El Sarape Restaurant": [], "Margaritas Mexican Restaurant": [["Saya K.", "We like to stop by for happy hour. Margarita is always good! Food is not bad but I wouldn't say great. Their parking lot is good size but it gets filled quickly. Very popular place."], ["Faith M.", "My family and friends went today after the Color Me Rad run, it took 2 hours for our food to come out and it WAS NOT that busy.  Our to go order came out an hour before our food did. When the food finally came  it was sub par. The table across from us also complained amd when I went to make a comment the manager tried to act like he didn't hear me. I got his attention but felt as though i was getting the \"ok hun\" act. Then of all things the fire alarm went off. Thank God for small blessings.  We tipped the waitress as it was not her fault and left. We, 4 adults, will NEVER be back! I picked one star because i have to."], ["Roger D.", "As a Mexican from Texas, here are my thoughts: 2 stars for the cold weird food, 3 for the margaritas, but 10 for the music. I'm jammin'! It's like a club with tacos."], ["Kelly H.", "Literally the worst restaurant experience I've ever had. A group of 6 of us came in after a Color me rad race at renschler field. They were clearly not prepared for the volume that an event would bring in. Anyway, it took almost 2 hours for is to get our food. Everyone around us were complaining too. It was horrible. I will never go back."], ["Steve R.", "First off, if you are not a Pratt employee, then you are going to be outnumbered at this restaurant.  Due to its vicinity to Pratt, this is where all of the office parties, team lunches, and group happy hours inevitably end up.With that said, there are better Mexican restaurants in the area.  This place looks and feels like a chain because it is one.  The food quality is below average, and the service is generally slow, overworked, and makes the customer feel rushed.The only reason I'm giving this place three stars is because I like the beer selection (it's a small selection, but I like the options), and the tortilla chips are free and unlimited.  I'll happily stop in after work with a group of people to munch on sine chips and grab a beer, but otherwise I'll be very unlikely to stop in here on my own."], ["Corey W.", "First and foremost, this is not a shot at Margaritas, but at their present Manger Kris ( Spelling I'm guessing)All of my dealing with Margaritas have been well above par(except for the one waitress, Tara).So I'm in the bar area with my girlfriend, ordering beer with our food, when I noticed, the beer was kinda off.Ask anyone, I know my beers.All of these had a sea water after-taste. And I'm from Jersey! So I returned about (3) of my favorite beers, until I finally settled for the Budlight, which was spot on. (Go figure)Then comes the Manger On Duty, Kris.Conversation goes as such:Kris: (hunches over the table with both fist, in an ominous manner) What's the problem?Me: The beers were a little off, so I ordered a few others to get something that tasted right.Kris: Well, I tasted the beers myself, and they all tasted fine. But, maybe it's MY tastebuds.--Must've been tasting alot of beers to come to a table in that manner--Me: Ok, well, I'm fine with the beer I have n..--(interrupted by Kris)Kris: I will comp (3) drinks but not the other.(Rather nice of him)Me: My aim was not to get free drinks. I didn't even ask for a comp, but thanks.Girlfriend: ( to be funny) Yea the beers tasted kinda like Manchester's tap water. You ever--(interrupted by Kris AGAIN)Kris: That doesn't matter. Tap water has nothing to do with it.Kris: I've comp'd your drinks.Me: Yup!(Annoyed and just want to get rid of him at this point)Kris: I hope you have a good night.Me Yup!Kris: Anything else?Me. Yup!Kris: Ok.--The End--I guess he thought I was there to get free drinks, but regardless, you don't treat paying customers like that. My floor for service is 20%, unless it's egregious. Disgusted with his presence, and is a sore in your, otherwise, great restaurant."], ["Jeff S.", "There are no proper sit-down Mexican restaurants where I live, so I jumped at the chance to try this place. I visited solo on a Sunday night; it wasn't very busy. I was seated almost right away in a cozy little booth surrounded by Mexican themed decorations. Overall I found the decor to be quite attractive and well done, with light levels just right and themed music at a good volume for conversation. The waitress was very friendly, and promptly delivered a plate of tortillas and salsa with my drink. Mmmm, great salsa, by the way. Just enough kick for me, though people with lower tolerance might reach for their drink a bit more often. I ordered the Mexican Flag enchiladas; three enchiladas each with a different sauce (red, white, green) along with refried beans and rice. It arrived quickly (delivered by the manager, I think!) and piping hot. All was delicious. The enchiladas were filled with nice big chunks of meat, and all of the sauces were tasty. It wasn't quite as spicy as the free salsa, but still flavorful. Normally I can eat quite a bit, but this meal filled me up. That's unfortunate, because I would have liked to try the fried ice cream. I don't really have anything negative to say. I'd come back any time (and maybe leave room for some ice cream)."], ["Erica W.", "My family comes here all the time, we love the food though the wait staff leaves something to be desired. They are often slow and take forever to come to the table, today for instance we sat in the bar area for close to 20 mins with no one coming up to us ( we're the only customers). They just seem more interested in chatting amongst themselves. We got up to leave and only then did someone come up to us. More often than not our food comes out wrong and has to be fixed but the food is always good and the drinks are the best!"], ["Andrew G.", "Hot tasty cuisine, cold margaritas, bartender excellent, manager attentive and present. Chef Greene would recommend."], ["Monica M.", "im 100% mexican and let me tell you this is the worst i everrrrr eveeerrrr had!!! it has no flavor is to plain the restauran infront of them is 100% better than this one!  ESTA ASQUEROSO! Luego no te ponen atencion en lo absoluto! Nada de mexicano tiene este restaurante y si acaso tenia pues se le quito! ES LO PEOR QUE EH COMIDO! PENA AGENA ME DA ESTE RESTAURANTE!!!!!!!! Nos estan poniendo en mal a nosotros con esa comida asquerosa conjelada mal echan sin sabor!!! Jajajaj es enserio! No se los recomiendo!!! Lo unico mexicano que tienen es la soda enbotellada jarritos! Y un pesiiiimooo servicio!"], ["Todd Z.", "Food was really good! Had the new ahi tuna bites. Very fresh delicious fish prepare perfectly. I got the fajitas trio (steak chicken shrimp), it came with black beans and rice, guacamole sour cream and cheese. They were very good. Steak was nice and red in the middle but charred on out side. Fiance had chicken quesadilla which came with guac and lettuce as garnish. Over all food was great. Server wasn't really personable at all but did a great job of keeping our cups full. So good job just not over the top. Got the chocolate cake to go :)"], ["Sweet N.", "This is the worst \"mexican\" food  I ever had. The only thing  mexican about this place was the music. The tacos I make at home are way better.  I think Taco Bell is more authentic than this place."], ["Kurt S.", "I've been to Margaritas numerous times over the years, but this time was the worst.  Or maybe I was just never really paying enough attention before.  We came for a work lunch and I got a meal and two margaritas.  The \"Naked Margarita\" should have been passable, since it's just lime juice, triple sec and tequila, but something was off.  The $5 house margarita that they server during happy hour was disgustingly sweet.  Margaritas are pretty hard to mess up..they only need three things..FRESH lime juice, 100% agave tequila and Cointreau.  Now to the food.  I didn't go in expecting real Mexican food, I knew they served Tex Mex.  But this wasn't even half decent tex mex.  I got the skillet baked enchiladas.  At $14.79 it's gotta be one of the most expensive things on the menu.  It was just plain bad.  The tomatillo salsa (something I make at home all the time) had to be what ruined it.  The dish tasted like straight lime juice.  The one positive about Margaritas is their homemade \"fuego\" hot sauce.  Also of note, my buddy got the unlimited tacos and was only brought out 5 in 3 hours.  Don't make the mistake of going here unless you absolutely have to."], ["Jess H.", "Its too bad that this restaurants beautiful interior doesnt deliver in the food department.  To start, the chips are thin and greasy. The salsa is waaaay to salty. The food just isnt tasty...the way you expect from a mexican restaurant! My sons quesadilla was barely warm and didnt come with any toppings. My skinny margarita was the best thing of the night. It tasted like fresh limeade with a twist. They didnt have a highchair available (they were all taken?) and I have two kids ages 2 and 1.  Service wasnt terrible, but dinner did take some time coming out (and it was 5:00 on a Thursday)."], ["Laura F.", "You know, I gotta hand it to Margarita's.  I've had nothing but good experiences there and because of the huge, inexpensive entrees, tasty drinks and consistently good service, I officially love this place.Yes, it's a chain, no it's not authentic Mexican, and for these reasons, this is a restaurant I'd normally pay no attention to.  But over the summer, I felt like having a happy hour margarita and wound up staying for dinner, which was great.  I had the Ahi Tuna tacos, a fantastic seasonal dish that has actually been added to the regular menu.  Hooray!The margaritas are the kind of drinks where you sip and think to yourself, \"Lame, they make the drinks really weak here!\", and then you get to the bottom of the glass, and realize, oh no they don't.The servers are always friendly and efficient, and I notice that the manager often checks in on patrons and makes sure everything is running smoothly.  For what it is, Margarita's is a great spot."], ["Ashley C.", "Came here for the first time for an employee dinner meeting with my colleagues. We were all seated a little ways away from the bar, seated on the high tables and chairs. The first thing I noticed was that there weren't a whole lot of people near us. Was that because the place wasn't very busy (even on a Saturday night) or just not a lot of people in that section? I have no idea. We were a rather large group, and only one waitress was appointed to take our drink and meal orders. Weird! Most of my ordered margaritas; however, I opted for a virgin dacquiri since at the time I was on antibiotics and I didn't want the unpleasant dizziness and nausea that follows after drinking while taking them. The dacquiri was okay: sweet and rather sour. Not my best one. But since I was thirsty as all heck, I drank it. Oh, and one of my colleagues sitting right next to me ordered a Coke. She had to tell the waitress THREE times that she did. It took her over an HOUR to receive it. And this blew my mind, since the place did not look busy at all (at least from where we were sitting) and it doesn't take a long time to get a bloody soda from a machine!It also took forever to get our food. I'm willing to give the place the benefit of the doubt for this one, since we were a rather large group of people. I ordered the steak and shrimp fajitas. THIS made me happy: the food was excellent! The steak was cooked to perfection, the spicy shrimp were just fantastic, and the rice was great, too (I didn't order the beans and rice, only plain rice since beans don't agree with me). I only wish the portions of steak and shrimp were a tad larger. Everyone else enjoyed their entrees as well. For dessert, I ordered the fried ice cream. It was pretty good, but I've had better. Another colleague near me ordered the fried cheesecake; that looked tastier. One more thing worth mentioning: while walking to and from my table, I noticed a rather foul odor from one specific place. Couldn't put a finger on where it was coming from (not the bathrooms, though, I knew that), but it was definitely gross and off-putting.I guess the whole point of this review was that the only positive thing about this place for me was the food. I would certainly get carry-out from them, but I don't think I would want to sit down in here again."], ["Carol B.", "Arrived close to 5pm on a Wednesday. They definitely paid more attention to the bar business.  Waited at the hostess station for 5min.  Finally was seated in a booth very loud. Placed a drink order 2 tall drafts.  Waited close another few minutes,  they might have been in a frosted glass but by the time they arrived there was no telling. Food order Shrimp fajita $16.99 scale 1-10 (6)Vegetable fajitas $10.99 (6)Total price $43.00End of story we went and it is checked off our bucket list !"], ["Steven T.", "I visited last night and I just coudn't get enough of the fish tacos.....I had six.  The shrimp tacos were good and stood out, but the fish tacos were goooooooood! I mean, real gooooooooooooooooood!"], ["Caitlin P.", "If you go here to enjoy it alcohol is a must.  Food was cool not hot, service was slow and seemed like it was their first time serving. The waiter lost my credit card only to find out it fell out at the table and was under my friends seat(butt). While they were frantically looking for my card the manager was never apologetic or very concerned even though the waitress was both. When we left the manager didn't comment on the situation at all just said have a good day."], ["Anthony P.", "What a huge spot.And if you're coming here for Happy Hour? It is good times! It can get busy, but you figure $1 dollar Taquito's and $3 beef nachos and $2.50 20 ounce bud lights? I can't complain too much about the quality unless you added $10 bucks more. My friend and I also ordered wings with this awesome blue cheese dip that was in a cup made out of nachos.I'd say the bartenders were pretty good, attentive and nice. Good times."]], "Puerto Vallarta - Newington": []}