{"Rosita's Restaurant": [], "El Mercado": [], "Guavate Cafe": [], "Majorca": [["Leslie B.", "From the moment we walked in the door, we had great service since the host took time to talk us into the patio--a great choice.  The server was very good too. The food was excellent, as were the drinks. My only caveat is that the tapas are very large portions for tapas. We ordered 4 for two people and it was way too much food.I had the jalapeno mango margaritas and my husband had the strawberry rhubarb margaritas (a special). Both were delicious and seemed like a decent portion.  For tapas, we had the fries (a huge portion!), the fried calamari, the spicy pork ribs over Moroccan couscous, and the mussels with chorizo in a tomato broth. All were excellent but the ribs especially stand out as amazing!"], ["Julie M.", "I have been to Majorca a couple of times and have not been impressed. When they first opened I had coworkers rave about how great it was. Based upon what I had been hearing, I decided to give it a try. I went both times during happy hour. The first visit was a disappointment to say the least. I sat at the bar and the entire time I had to listen to the owners girlfriend bitch about everything and anything. She made it clear she was apart of the staff while she was in the process of their conversation. She happened to be gossiping with one of their distributor friends. Mind you, I have no connection to these people and I was able to pick all of this up during my time at the bar. It was very unprofessional and obnoxious. My cocktail...was okay, at best. I ordered a couple of the different happy hour tapas. The meat and cheese plate was decent. The tapas I enjoyed most was an eggplant rollatini with goat cheese and hazelnuts. But I didn't have anything that made me want to return because it was notably delicious. The atmosphere of the restaurant was nice. The decor was clean and modern. The service was decent and it wasn't the worst experience I've had. But I wouldn't go out of my way to go back."], ["Audrey K.", "So Tapas are a \"no-grey-area\" type of food for me.  It must be absolutely done right.  I don't expect elaborate garnishment or colorful arrays of plating (which would be nice).  I do expect small plates, cooked-to-tender meat/seafood, and a good balance of sweet and savory.  Majorca's tapas are a bit too much - too much sweet on the bacon wrapped dates, too much savory on the grilled pork ribs, too much dry on the spicy pork meatballs, and lastly, too much of everything on size.  It was nice to sit outside on a warm summer evening, but the outdoor seating area is right by a busy street.  There were cars blasting loud music - strangely parked right across the street, sometimes right in front of the restaurant - and some people yelling profane words across the street to each other.  It was all too entertaining that all heads were turned streetside with plates left to turn cold (Ok, now I'm exaggerating a bit).   I feel horrible giving a fairly new restaurant only 2 stars, especially since the staff seemed really nice, but I have to rate with all things in mind.  And the quality of food is pretty heavy on this scale.  I'm forced to give Majorca another chance with a $20 for $30 deal I purchased on the fly and forgot to redeem.  Maybe I'll try it out for lunch and sit inside this time."], ["Westie W.", "It was Sunday night over Labor Day weekend so in retrospect I have to wonder if the chef had taken the night off.  My wife and I arrived at about 5:30PM and proceeded to the bar for happy hour.  On entering we noticed a sign over the bar indicating the happy hour was limited to weekdays.  Not a problem, but the restaurant's website does not make note of this.We were soon presented with a list of specials plus the regular menus while ordering Mojitos.  Our drinks soon arrived and I knew we were in trouble as each contained but a single sprig of mint as garnish with no evidence it had been muddled.  I did not witness our drink being made by our server, there being no dedicated bartender this evening, prepare our drinks, but I believe it is reasonable to conclude a mix heavy in club soda was used.  I had reviewed the online menu plus diner reviews beforehand so I ordered our entire meal upfront asking to have it delivered in order of preparation.  First was La Playsita, a salad of baby spinach, artichokes, roasted garlic, tomato confit, shaved fennel, orange segments and sherry vinaigrette.  The portion size was generous, but it was over dressed and the individual ingredients did not come together well so much of it was left uneaten.   Next were two tapas plates - Datiles Rellenos - dates stuffed with chevre and almonds, wrapped in bacon and Berenjenas Rellenas con Queso - goat cheese stuffed inside slices of baked eggplant that were topped with hazelnuts and a roasted pepper sauce.  Once again the portion size was generous, but the flavor of the latter dish was inexplicably of one note while the dates proved to be highlight of our meal. Our last dish was Caldo Andaluz - rice slow cooked with mussels, clams, chicken and chorizo in a smoky paprika broth.  This dish again featured a generous portion of protein, but the broth was under seasoned, the chicken dry and the chorizo bland.  Based on this admittedly single experience, I came away believing this chef is way too conservative in his blending of ingredients and spices."], ["Erica K.", "Majorca is amazing. The food is fresh, delicious and fun. My best friend and I came for dinner -- we were craving sangria! The white orchid sangria is delicious. It is made with peach purée and pineapple and it comes with a pretty orchid flower. Such a beautiful touch.We weren't super hungry so small plates was perfect for us! The striped bass with spicy rice was phenomenal. I haven't had spicy in a while and I am so glad we got this!  We also got the chicken empanadas swimming in delicious goat cheese, and the shrimp in garlic. All were delicious.The best part about Majorca (besides the food and drink) is the owner Rich. He is super friendly and nice and makes you feel comfortable. I really enjoyed his company and love how he makes you feel welcome.Can't wait to come back!"], ["Ashika B.", "Majorca is located where the old O'Porto Restaurant used to be. The decor still leaves a little bit to be desired but the tapas are outstanding! This is easily my new favorite Spanish restaurant in Connecticut. Their Pato Con Lentejas (Duck Leg Confit), Gambettas Con Ajo (Shrimp) and Mejillones Salteados (Mussels) are my favorite tapas. The tapas portions are quite generous. Everything is savory and delicious, with all the authentic flavors of the Mediterranean. The service is always great also and from what I can tell there are several social events hosted here as well. I would definitely consider hosting a birthday or other celebration here."], ["Sebastian C.", "Wow... What can I say.This place is bloody marvelous .  We found a coupon on the Local Flavor website and decided to try.From the moment we  were greeted at the door, to the moment we left, the staff were very polite and nothing was too much trouble for them.We had a couple of Margaritas when we sat down, and then 4 tapas dishes which when they came out was enough to feed 6 people.The best was the pork ribs and the mussels and chorizo in a tomaroe broth .Left here totally stuffed and extremely happy.5 star rating all the way.  Well done guys."], ["Peter L.", "Because this place is newly opened and my fellow yelpers had been praising this place lately, my friend and I stopped by this place for a late lunch.We got there around 1:30 pm during a Friday in a fine weather, it matches perfectly with the old school Mediterranean/European style interior. The dinning area is cozy and open, only 5 or 6 other tables were filled. We were quickly seated and the waitress was friendly enough to recommend some of their signature dishes (Tapas) to my friend and I (completely new to this place and style and had no clue what to order :D )Neither my friend nor I really had the appetite for a big meal, so have asked for something light.We decided to have the shrimp tapa and the ribs tapa right off the bat and we have also decided to have the entree that had seafood and tomatoes sterfried with rice.In addition to these three dishes, we were fortunate enough to have some of the scallops prepped for tonight's service with the chef coming to the table and explaining the texture and the seasoning of the dish to us (it was originally served with eggplant and I hated it so the chef came out to walk us through the possible substitutes; very friendly and consumer oriented.)The shrimp and the ribs were served first. While the ribs wasn't anything special besides tendered, the shrimp was excellent. It was fresh, well seasoned, and cooked perfectly (great texture)!The scallops was even better - fresh, juicy and heated perfectly. The sourness of the cucumbers and onions fits perfectly with the scallops. It wasn't overlooked, burnt, or overwhelmed with alcohol, unlike some other restaurants in the Hartford area. 10/10!The seafood entree, however, was a little disappointing. It was still well prepared, unfortunately, it was slightly too sour and too heavy seasoned in my opinion. Not something that I personally like but I am sure some diners certainly would enjoy it.Up to this point the meal was great and we have decided to have some desert.The cheese cake, like it was described by the waitress, rich, cheesy and smooth. It's definitely one of the best in the area!The mango tart that I had, however, was barely on par with today's meal. The tart itself was too hard and thick, which makes part of it hard to chew. The sorbet on top along with the mango in the tart was nice though.Overall: 4.5/5Highly recommended and definitely would visit again :)"], ["Marcie G.", "We had a fabulous dinner here.  Shared 6 tapas (actually took 2 home as they were very generous in size) and enjoyed all of them.  Our server (Michael?) was so attentive and did not seemed bothered by all of our questions and special requests due to allergies.  We will definitely return."], ["Zoila V.", "Went here for dinner before a play at The Playhouse. I was really excited to try it based on other reviews and the hype built up around it. The actual decor and set up was very much like the previous restaurant there, o'porto so I didn't feel like I was in a new trendy place. The drink selection was interesting. Especially the cocktails, I ended up with a glass of Rioja wine, first time trying it! We ordered entrees instead of tapas because we were all hungry and I was going to order a salad to keep it healthy. The food was \"ok\", there was nothing that really wowed me though. The service was a little bit slow when we were ready to pay and had to bring the check up to the be to pay. Overall I think this restaurant was just ok, perhaps I had higher expectations then I should have or will need to try the tapas since it's their specialty."], ["Dan S.", "Are the raves true?That's what I wondered. Came here With a large group and can answer unequivocally yes. It is true. One of the best new places in the Hartford area. Come here for tapas. About 3 for every 2 people. So many good dishes to choose from with big portions. Biggest hits were the calamari, the ribs (beware though they are spicy), the meatballs and the fries. Though my dining companions loved the mussels (great for dipping bread into the broth) and shrimp too. They had several spring specials while there. We tried the veal sweatbreads with fiddle heads and ramps. Excellent. Service was great and great drinks to boot. We will be back and this is definitely a restaurant not to be missed in the area. Yay!"], ["Jordan S.", "The food was very good, albeit a little pricey. Make sure to pick up the coupon from yelp and also for an additional discount, check in to yelp while paying your bill. This place is pretty classy, so prepare your cocktail attire or make the same mistake I did and wear a pink t-shirt and get strange looks from the other customers. I would definitely go back again as soon as my wallet recuperates."], ["Kristin B.", "This is hands down the best restaurant that I have been to in Hartford County. Until my partner and I went here a few weeks ago, we didn't think that there was food this good available for dinner in the area.  The service was excellent. The owner was standing at the front greeting us and we chatted with him while we waited for a table. Our waitress was lovely (even if she was flirting with my partner a bit, ha!) and she took great care of us. We ordered some wine and about six tapas many of which were specials that night and I was pleasantly surprised by the quality of all of the food. Dessert was great, probably my favorite part. There are a couple of seats that are less than great spots along one side of the dining room, but I imagine they are trying to make the most of the space. Overall we had a lovely evening and I've been recommending this place to everyone."], ["Jess L.", "I came here with the ever amusing Joe B. and Thien N. and had a solid, foodie extravaganza.Happy hour only includes 3 wines. The sauvignon blanc was ok ($5). The food deals are small, but they are bound to be tasty. Dinner was quite good and very memorable. Interestingly, the specials they had were the most memorable to me: an asparagus and prosciutto starter and chorizo bread with greens on top. Delicious. The shrimp ceviche was ok; if you want something fishy, the anchovies were surprisingly delicious - simple, elegant, and succulent. Skip the short rib; it was ok, but I think the biggest bang for your buck is in the tapas. Their version of an Old Fashioned was a little disappointing. Our waitress, Zoe, was super cute and friendly. She made the experience quite delightful.Ambiance is simple, not particularly Spanish but fits the essence and classiness nicely. I can't wait to come back and try something new!"], ["Jason M.", "Watch out Barcelona, you've got serious competition.Dispose of your Central Connecticut insurance industry wealth here. Reservations recommended - I'm glad they work with Open Table. It's a beautiful and fun atmosphere, complete with banquet rooms and private seating for the more ambitious.I always like simple menus. There's about 20 tapas total, as well as some similarly priced salads, and a handful of actual entrees. This structure makes me feel like I'm having the full experience.Everything was great. Personal favorites included the ribs, the meatballs, and the exquisitely simple papas fritas, with truffle oil and Manchego cheese. These ain't your Mamá's French fries.Only suggestion would have been to make that salad a little bigger. I expect small portions for tapas in the $6-12 range, but I think you can make a slightly bigger $9 salad and not see it appreciably affect your profit margin.We got a wonderful bottle of Spanish wine (The Las Rocas El Renegado Red Blend), which was $30... sadly typical for a restaurant bottle. Our server was really nice too. Of course she was... they don't hire grumpy people to work in high class dining.A near perfect dining experience. Hard to pull off these days."], ["Thien N.", "Majorca has opened in the former O'Porto space in Hartford, serving a mix of tapas and entrees with Spanish and Mediterranean influences. My friends and I have been eagerly waiting to pay a visit since it's grand opening in January. I'm bummed we didn't go earlier because it's worth all the hype. Impeccable service, a delightfully new and authentic cuisine, and the beautiful space in between make Majorca a cool spot locals from Hartford should really check out. To start, we decided to come early for the happy hour. From 3-6pm, you can snag mojitos, margaritas, featured wines, and local artisan craft beers for $5 while coronas and estrella drafts are $4. Come early because while the cozy bar area has a handful of tables, there are only a number of seats at the bar so it can get crowded, quick! When we were finally seated for dinner, we all got a round of the old-fashioned, spicy cucumber margarita, and white sangria from the specials menu (good stuff!). For tapas we had the Cape Cod mussels with chorizo, littleneck clams in garlic and white wine with salsa verde, and the grilled octopus with butter beans and Spanish olives. Everything was beautifully arranged, innovative, fresh, and delicately prepared. I was feeling bold and decided to order off of the \"Bocatas y Platos Mas Grande\". Went with the \"carne con huevos\": grilled and spice rubbed hangar steak with roasted potato and prosciutto and topped with a fried egg and saffron basil sauce, it was melt-in-your-mouth delicious!With Latin jazz every Sunday (3-6pm), paint night every Tuesday and free salsa group lessons on Wednesdays, Majorca is definitely happening right now. With plenty of parking options (on-street, private lot), parking isn't an issue. These guys are on point thus far, I had a great time here and am already looking forward to my next return- so come check them out!"], ["Brian F.", "I took my whole team here today and the food was delicious!!! They handled 30 people with no problem."], ["Diana L.", "Another *just okay* restaurant has come to Hartford! Woooohooooo...I went with my dad around 6:30 on a Tuesday. There were a good amount of tables filled for a Tuesday night, I was impressed! I never went to O'Porto when it was open, although I heard it wasn't great, but I really liked the exposed brick and pretty light fixtures inside Majorca. So my first impression was very positive based on the interior and how popular it was (especially midweek).Ordered a drink (I got the white sangria with peaches and pineapple and my dad had a glass of wine) and got 4 tapas for the two of us:- Sardines- Grilled octopus & beans (pulpo y frijoles)- Pork meatballs (albondigas)- Poached artichokes with vinegar on themThe sardines were fantastic, but the portion was reeeeally tiny, the artichokes were 1 large artichoke heart cut into 4 pieces served cold with vinegar and a little bed of arugula, the grilled octopus was probably my favorite, but the pork meatballs were small and there were only 3. After eating the 4 dishes we ordered 2 more, the Pan Catalan and the Shrimp.The garlicky shrimp were good (and there were 6 in a serving, more reasonable for the price I thought) but the bread in the Pan Catalan was stale French baguette...unimpressed...the manchego was good and the tomatoes were too but the bread threw it off for me.The service was extremely slow throughout, although the waitress was extremely nice and helpful when she came to our table. Also the only tapa dish that I saw coming out of the kitchen that was not extremely small was the heaping plate of glorified French fries. Lame!After going I don't really see what the five star biz is all about because I could have made all this stuff in my kitchen in like a half hour with better ingredients for less $. Such is eating out, I guess."], ["Q T.", "Majorca promotes itself as \"Hartford's newest and hottest Mediterranean and tapas restaurant, bar, and private event location.\" Since the opening it's doors January 2015 the affordable and trendy Majorca has built quite a buzz and is quickly becoming a noted competitor for the popular restaurants in downtown Hartford. The Majorca team has created an ambient tone like that of a hip lounge in Ibiza, Spain. The Mediterranean cuisine is offers central Connecticut with something different, and is masterly designed and prepared by the renowned chef and CT native Chef Bernie Gorski.Price is a major competitive force for Majorca. The tapas, despite using fresh, local, and imported artisanal ingredients, are priced at an average of $10.00 per plate. Premium drinks are masterly prepared for $5.00 during their happy hour, and their lunch menu is quick and affordable yet authentic to Majorca's Mediterranean theme. Though inexpensive Majorca is far from cheap, but is more elegant and modern.Majorca has quickly developed a popular reputation. In the short nine months that it has been open, Majorca has already been recognized as one of the top Portuguese and Spanish restaurants by CTNow's \"Best of Hartford Readers Poll 2015\". Salsa dance lessons, paint night, and Latin jazz are just a few of the crowd attracting events that Majorca has to offer on a weekly basis. This popularity serves to improve the culture of Hartford in a major way."], ["Dhara S.", "We had the outdoor patio to ourselves when we went on Friday for birthday drinks and tapas. Our sever was sweet and friendly. My mango chili margarita was delicious, as were the tapas. We had the pan Catalan, goat cheese stuffed eggplant, papas fritas and something with shrimp. The papas fritas were more along the lines of poutine than papas fritas. I would have also liked to see a more expanded menu, but overall it's a great addition to the Hartford restaurant scene."], ["E R.", "We had the place to ourselves for a late Friday lunch at 2We ordered 9 plates from shrimp, pork meatballs, eggplant, ribs, olives, muscles, clams and moreEverything was delicious.  Very flavorful but not heavy. The waitress was very friendly, helpful and attentiveI wish I lived closer (we met half way between nyc and boston) but I will definitely come back if in the area."], ["Kerri P.", "They only opened a few weeks ago, but they seem to understand service already. Now, Majorca, please go teach that to the other restauranteurs who struggle with that concept. I was there for a friend's party which meant basically a ton of people in a small room. If the waiter had forgotten a drink, it would have been totally forgivable, but as far as we could see, everything went perfectly. I had not planned to eat there, just have a glass of sangria and chat. My partner ordered the Alcachofas Marinadas and Papas Fritas, and I ended up poaching from his plates. Both were good, but the fries with garlic, truffle oil, and manchego cheese were the favorite. My glass of red sangria arrived wearing an orchid! I love that they did not totally gut the former O'Porto space. Too many restaurants waste money doing this when the interior was perfectly fine already. Super pleased about this new addition to Parkville!"], ["Bill B.", "Went to Majorca for a early dinner and the place was empty. They have half priced wine bottles for happy hour in the bar area but the waitress offered this deal in the dining area. My guest and I ordered a bottle of white wine. The waitress returned and said they were out of that particular wine. I asked about another one and they were out of that as well. So I settled for something else. Strange they are out of so much when they just opened. Ordered several Tapas items, 3 per person and they had a nice presentation and were very good. They need more variety on the menu and to check their pricing on some items. Overall it's a nice spot, food was good and I'll be back. I put 3 stars just because they have some room for improvement and out of stock on some items."], ["Peter H.", "Been twice.   Great joint.    Excellent food, fresh and well prepared.     They specialize in small plates and suggest that 3 per person is good.    It is good but gets expensive as these little plates average $10 each.      Open for dinner only."], ["Catherine A.", "My favorites: Pan Catalan which has olives roasted with tomatoes, manchego cheese... Great start to the night. The eggplant dish they had tonight really helped to highlight eggplant in the dish and not lose the flavor. Always a good Pinot noir wine glass pour every time I've been in - tonight it's sterling. The best part is the famous cheesecake which is chef Bruce's specialty. Mascarpone cheesecake-Chocolate crumb crust, raspberry sauce and fresh fruit (mango, strawberries and blackberries) Great vibe in the bar- they have two tvs and also a large dining room. I hear there's a banquet room off to the side of the bar that is opening soon, too.  Check them out for lunch, dinner or happy hour soon! I'll def be back."], ["Irene B.", "I was a little skeptical since the restaurant is not in the nicest of neighborhoods but I was very impressed. It's really convenient to have parking behind the restaurant too.My husband and I got there around 6 and were seated right away. I ordered a white sangria and my husband got a red wine called Los Rocas. The sangria was really pretty when it came out, flowers as a garnish is a nice touch.For tapas, we ordered the braised pork ribs, grilled bread with tomatoes and olives, truffle fries and clams. EVERYTHING was delicious and plated very nice. Portions were actually larger than I expected. Compared to Barcelona, you get double the amount of food per dish.  Service was great and they were always ready to help with suggestions. I thought the plates were tiny, they are the size of a bread plate at any other restaurant. Also, they should have given a clean plate after we had a couple tapas. Overall, I'm glad we found this place. Price is reasonable and I'm excited to come back another time to try some more dishes. Yelp had a great $20 for $30 voucher which is worthwhile."], ["Deepti P.", "Because my husband read very good things about this restaurant in Hartford magazine and pretty good reviews on yelp we decided to join them for dinner on Friday night. It was cold and rainy outside, but the moment we walked in this placed embraced us with the warmth. The owner was right there to greet us, we recognized him from the pictures in Hartford magazine again. Very warm welcome and we get very good table in the dining area. The service was good, prompt and friendly. Decor! I would give 4/5. There were few spots for e.g. the entrance of the restrooms can be made little more cozy/private.And they can be cleaner. Now the main part, FOOD. the whole reason we are there. Let me tell you clams, octopus was not available on the menu that day and that's something we would usually order. But that's fine we ordered grilled squid (Chipirones Plancha) 5/5 - well done , go easy on jalapeno and garnish though. chorizo - Croquetas de Arroz 4/5 Costillitas con Cous Cous and a few more. From the specials we ordered zucchini fritters - i didn't like it s much, My husband loved it. I thought it was too salty and yes I understand because of Gorgonzola cheese but then give something else  with it to take a note down. I will agree with rest of the reviews on how the plates are too big for tapas. And too much emphasize on the garnish many times.I hope they change the menu seasonally which will bring me back here or I might go back to clams and octopus. :)still a good spot away from usual west Hartford center restaurant scene, don't have to worry too much about parking and a laid back."], ["Tom T.", "Overall food and service was good. Only issue was the naming of the dishes was confusing as when the tapas came out the server mentioned the dish names but we already forgot the ingredients associated with them. Good place for a date."], ["Anum I.", "Loved the food there.We ordered gambettas con ajos (grilled shrimps). They were delicious to say the least. The salad served with it was tasty and fresh. The green chatni with the shrimps was a nice touch too.The pan Catalan was good too. Quite delicious. The vegetable were fresh. And nicely done. Neither over nor under. Papas Frita were delicious and ncjelyndone done and crisp.We ordered the octopus too, which was not chewy but was not as amazing as the shrimps but not bad at all. The ambience was good too. Service as well"], ["Mike K.", "Really poor service. They messed up our order and took a long time to bring out the food. We came on a Saturday night and there looked like there was one waitress for the whole restaurant. Price didn't match the quality of the food. It might be a good place to go on a quiet afternoon but I would stay away on weekend nights."], ["Mai F.", "The staff were very friendly and helpful in recommending what to order, and the order came really fast which we were very surprised. We had four tapas - duck confit, shrimp with pesto sauce, pork ribs with couscous and smoked salmon (special of the day). They filled us up (my boyfriend and I) to the point where we were not too stuffed. We felt content after eating a quality meal which is not only pleasant to the palate but also to the eye. Definitely use the deals and coupons that come with Yelp!"], ["Chris G.", "I can say I really like what you're doing here, they are definitely gonna give Barcelona run for their money, I really truly feel that way. The appetizers were delicious.  the food that we ordered came out fast and they were creative. The size of the appetizers fro (tapas )were bigger than Barcelona, so that was a plus."], ["Stephanie B.", "Get the house infused jalapeño tequila margarita with mango puree. This place is great- huge portions for tapas. If chorizo is on be specials menu, be sure to get it. I love the bar and patio for happy hour or A late night drink too!"], ["Itz J.", "From the moment I walked in the customer service was bad. Guy in the front greeting guest didn't speak English and didn't understand that I was part of a reservation of four. Sat us in a room for twenty people. Then when questioned I was told to pick my own table. After I picked my own table he brought over Luke warm water with no ice & bread with no butter or oil. Gets better.... I ordered the carne con huevos... Asked for my steak medium well. My steak was ice cold and VERY WELL DONE. Two steak orders were taken off bill because even after complaining they were cold. The tapas that we did have (fries, meatballs & croquetas) were great but not enough to make me come back.Majorca is no O'porto"], ["Dave G.", "Really good experience. The place was very clean and the service was very friendly and we were seated immediately upon arrival. The server was really knowlegable about the menu and had good reccomendations. We decided on sharing tapas: Pan Catalan, Datilles Rellenos, Pato con lentejas and Calamares Fritos. All amazing. I'd have to say the Calamari and Datilles Rellenos were the two that stand out. Local beers on tap with a nice variety of mix drinks. The prices are really fair as well and currently there is an Amazon Local deal: $25 for $50 for food and drinks. I really hope this place sticks around, I can see myself here every week."], ["Sandy N.", "I had a great experience. I was there for paint nite and ordered a couple of drinks and dishes, all of which I enjoyed.  The drinks I ordered were the white sangria and red sangria which was very tasty and nicely presented with an orchid.  Dishes I had were the shrimp, calamari, and truffle fries.  I highly recommend the shrimp and calamari dish, the fries was a little on the saltier side but with a drink or beer it'd be perfect."], ["Karyssa P.", "The food is decent, although the typical tapas style potato dish is in spicy tomato and this one was with fries (??) which was weird but flavored well.Unfortunately, the service was incredibly slow. 5pm on Friday with a near empty restaurant and plenty of staff on hand (talking about last nights hangover)."], ["Kait F.", "Pro tip: if you're looking for a filling and healthy alternative, Majorca does take out. I shared the papas fritas, the pollo asado, and the La Casita salad with a friend after calling and placing a pickup order. We are. So. Full. The order of papas fritas was HUGE and I couldn't stop picking at them even when I was totally full. They don't skimp on the cheese and they are SO delicious. The La Casita was a great, light salad with a really flavorful dressing. The pollo asado was seasoned really well and came with white beans, spinach, and tomatoes as a base. For two people, this was the perfect amount of food and it left us both stuffed. I'm so excited that Majorca is in my neighborhood and want to go back and dine al fresco!"], ["JB R.", "This place is wonderful.  Very delicious tapas with mediterranian spins with a wide variety.  They are NOT small portions.  2 tapas will easily feed if not overfeed one person.  I had several of the daily specials and they were all terrific. The only reason they do not get 5 stars is very little glitches with the service.  My wife and I ordered a bottle of wine and we got 2 very different glasses.  When the tapas were delivered, they did not tell us which ones were which until I asked. And a dessert was delivered to our table, but it was not ours.  The wait staff is very young, and I am sure they will work out these very minor issues.  100% I will be back."], ["Rachel G.", "I was underwhelmed here and found it severely lacking in authenticity and quality, especially for the price! Came for dinner with two friends and we first ordered the pan Catalan and papas fritas to share. The bread was ok, grilled and topped with roasted veggies, but nothing special, and the size was shockingly small. The papas fritas were just regular skinny frozen french fries tossed with garlic and truffle oil. I was expecting actual potatoes, roasted til crispy on the outside and creamy on the inside, as I have had at other tapas restaurants - throwing french fries into fancy oils does not make it a nice dish. I've had these exact same fries at Capital Grille... an American restaurant, which is where they belong.Still starving, we each ordered salads that, when arrived, were nothing more than a small bed of spinach topped with what appeared to be canned artichokes, fennel and a few messy fruit segments, tossed with a dressing so vinegary it was hard to finish. There were so few vegetarian options that we couldn't really order much else, not that we wanted to.After that and two glasses of wine each, our bill came to almost  $120 and we were all still hungry. The service and atmosphere was fine, and our server was kind, but the wine was probably the only enjoyable thing about the meal. If this place paid more attention to quality and authenticity, I'd happily pay for a great meal, but at this point I won't be back."]], "On20": [["Mari K.", "I finally made it to On20! I'd been meaning to come here for so long, and finally did it this past round of Taste of Hartford. I will definitely be back, and will update my review to include a non-Restaurant-Week experience. I was pleasantly surprised at how easy it was to park, since I hadn't realized you could use the lot beneath the building and have the parking validated by On20. We did this, then took at elevator up a few floors to the lobby and a second elevator up to the 20th floor. I'll admit, it wasn't until I hit the elevator button for the 20th floor that the Restaurant name made sense :) We walked in, and were immediately greeted by friendly hostesses and a sophisticated, sexy atmosphere.The dark grey walls and artwork with the rich wood tones were instantly welcoming. There's a coat rack when you first enter, and the restrooms are to the immediate left. Direct ahead is the bar area, which is smaller than I had envisioned, but with a really nice open feel. If you sit near the windows, you get a marvelous view of the city of Hartford. The waiters are super attentive, and there is a knowledgeable wine sommelier, which I always appreciate. We opted for an older rioja, which was reasonably priced and seemed interesting. The sommelier was really attentive, and when he noticed some dish soap spots on my glass he immediately replaced it with a sparkling one. The food was great. We started with the lamb meatballs and the roasted root vegetable salad, both delicious. For entrees we had the prime rib shepherds pie and the skate. I thought the shepherds pie was good, but the skate dish was the real winner- the flavors worked perfectly together for an overall great experience. For dessert I opted for the lime mini doughnuts, and they exceeded expectations (and what a perfectly-sized dessert portion!). I peeked at the bar menu, and would love to come try happy hour and a few items off of that menu. Of course, I also look forward to future delicious dinners here."], ["James S.", "We came here on Sept. 12 for my mother's birthday dinner because this restaurant has received a lot of good buzz. Perhaps some folks would view On20 as one of the best restaurants in the Hartford area, but my experience did not live up to the hype. Any restaurant that touts its status as \"The only Connecticut restaurant with a 29 Zagat Rating for service\" better deliver, but this place fell pretty short of that mark. Here are my issues:--server took a long time to acknowledge our presence after we were seated by the hostess--cocktails took a long time to arrive--bread was cold--amuse bouche of julienned tomato with green hummus was kind of pathetic--when asked how the porcelet entree was prepared, the server was totally clueless--when clearing our table, the bus staff touched the rim of my father's drink in order to move the glass; this is improper technique; glasses should be moved by the base or the side so that the rim of the glass remains sanitary for drinking--when the bus staff cleared our first course, they mistakenly removed a fork without replacing it; then when the entrees came out, the server departed too quickly before we could raise the issue regarding the silverware; it took me a while to flag someone else down to get us a new fork; in the meantime, our food got cold--water glasses were never re-filledIt wasn't all bad, though. On the positive side, my father really enjoyed his porcelet entree even though he kind of took a leap of faith when he ordered it. And the drink menu was varied, with the cocktails made well. But what I'll take away from this experience was how much of a discrepancy there was between the service level expected and the service level received. Not even a mention of \"happy birthday\" or anything like that, despite the fact that it was mentioned in the OpenTable reservation. And there was an automatic 20% service charge included in the bill, which was difficult to swallow. Better options elsewhere."], ["John S.", "This place is kind of like a roulette wheel, some of their offerings are good, some aren't and for what you pay it leads me to believe I won't be back here. We went here for Hartford's restaurant week and we ordered a couple extra items. Their appetizers; Terrine, Chowder and Agnollotti. The Terrine was good, the Chowder ok and the Anollotti was ok too. The sauce for the Agnollotti just didn't really pack that much flavor and the chowder was rather flat as well. For dinner we had the Ribeye and the Chicken. The Chicken dish was very solid, and the Ribeye was cooked perfectly, but there were 2 sauces on the Ribeye plate (one was  probably an au-jus and the other was probably pureed squash). I say probably because both of them were tasteless so I couldn't really tell and added nothing to the dish. Finally for dessert we had the blueberry crumble and the Caramel Peach. The crumble was fine, but the peaches were rock hard and totally lacked any sweetness. The sauce that accompanied the peaches was tasty, but since the peaches are the star of the dish they should have been prepared better. Pro tip, if you had cooked the peaches IN the sauce I guarantee the peaches would have softened right up and been fantastic (as opposed to putting the peaches on the plate raw and having them detract from the dessert).The service was good, the manager made the rounds and talked with all of his guests. I think this place has alot of potential so I may be back again, but it can be improved upon."], ["Tanisha C.", "When I dine in the Hartford area, I manage my expectations.  There have only been a handful of restaurants over the years that have been standouts (e.g. Acqua, Glas (both closed)).  I personally have never been blown away and it's rare that a restaurant in the area offers something innovative. So when I dined at On20, I was pleasantly surprised.I took my mom to On20 for a pre-Mother's day/early birthday dinner.  First, getting into the restaurant was a little confusing (we entered at the Columbus Ave entrance) and entrance was initially locked.  Some signage indicating exactly where to find the restaurant would be helpful.  As soon as you enter the restaurant, you're captivated by the view.  After living in New York for eight years, very few skylines are remarkable.  But the view at On20 is so excellent, that you can forgive the fact that it's Hartford.  The restaurant was dim, creating an intimate atmosphere, and a great juxtaposition to the expansive view.The service was great.  Our waitress was friendly, knowledgeable and attentive.  The general manager (I think) checked on us frequently and made polite conversation.  When our main course was taking a bit long, he offered to comp a glass of wine.  Now the food . . . everything was tasty.  The portions were fair, and not overly filling.  The flavors were subtle and the curious coupling of flavors and textures were like a never-ending happy dance in my mouth.We had: (1) the Peekytoe Crab; (2) the Swiss Chard salad; (3) Duo of Pork; (4) Muscovy Duck; (5) Orange Creamsicle; and (6) the Banana Bread.The Peekytoe Crab was refreshing and the melon was a nice accompaniment.  The Swiss Chard salad was surprisingly good -- I honestly hadn't had raw swiss chard before this dinner.The Duo of Pork was the low point of the meal for me.  I love pork . . . deeply, but there was something weird about the pork shoulder.  I can't put my finger on it, but the texture was more like a pate and certainly not what I expected.  The Duck, on the other hand, was amazing.  And I would highly recommend it.We started out with my mom having the Banana Bread and I having the Orange Creamsicle (I'm on sure of the exact names), both were effectively deconstructed versions of their titles.  The Creamsicle was light and refreshing, but once I tasted the Banana Bread, I had to order another for myself.  Overall, an amazing experience and I highly recommend On20."], ["Lindsay S.", "It is with great sadness that I right this review. Many years ago, this place was one of the best restaurants I had ever been to in CT. The service was impeccable and the cuisine was innovative and delicious. Those days are behind us. We had been wanting to go here for quite sometime, because it was such an experience the last time we came here. We finally picked a day to go, and dressed up in our sunday best and had hungry stomachs in preparation. We were greeted by a very kind hostess, who sat us near the window so we could look out over Hartford. As soon as we sat down, the Maître d came over and took our cocktail order. 30 minutes later, we had our cocktails. I understand there are a lot of other patrons in the restaurant, but 30 minutes is a bit of a stretch. But I wasn't going to let that deter me. As the appetizers and main courses came and went, I realized they were not as memorable as some other expensive meals I have had, and a wave of disappointment  came over me. While they were good, they weren't something I would order again. While the cocktails and meals were commendable but forgettable, the service and the desserts are probably what made this a two-star experience.  The waitress was unresponsive, slow, and kept making mistakes that could have easily been avoided. My husband ordered a $17 glass of wine, and when she came over to pour him the glass, I noticed the bottle said \"Estancia\" on it. Most people know this brand, and that it's about $10 at the liquor store. When I questioned her, she admitted it and said they did not have the bottle of wine he requested. First off, this is a BIG NO NO. You need to come over and tell the customer that particular wine was not available and give them some other suggestions.  Next, the desserts came. My husband ordered a cheese plate with honey, and you could just about carve a knife into the honey it was so hard. I asked for hot chocolate; the result was a water glass filed with what tasted like chocolate milk with whipped cream on top. When you go to an expensive restaurant like this, you expect a certain level of service and execution in the cuisine, and it was definitely missing throughout this evening. Even the Maître d admitted the service could have been better. I will not be going back anytime soon, unless they do some drastic changes to their menu and service."], ["Emily C.", "I've been to ON20 countless times since my first visit and can confidently say that you receive the same exceptional level of service whether opting for a ten course tasting menu with wine pairings or a simple drink and bite at the bar.The restaurant has seen many changes over the last several years, including Jeffrey Lizotte taking the well deserved lead as Executive Chef. By adding a happy hour and carefully crafted bar menu (the best kept secret in Hartford), in addition to an affordable bistro-style lunch, ON20 now seems more accessible to people who thought they'd have to drop a few hundred on a meal. Happy hour cocktails (sazerac, blood & sand - nice classics) are $6 and house wines and beers are just $3 each. The bar menu is both simple and exceptional with $6 duck confit bbq sliders, truffled risotto balls, burgers and a Waldorf salad, to name a few selections.ON20 has also started hosting events here and there including a high-end BBQ on the night of Hartford's riverfront fireworks and an upcoming event centered around prohibition-era drinks. Oh, and they validate garage parking!"], ["Lan K.", "This is the perfect place for a very special evening. I came here during Restaurant Week so I got a bit of a steal on the prices but the service and food was still top notch. This is the kind of place where they take your coat, push in your chair for you, place the napkin on your lap, etc. The manager also came by during our meal to check in with us and chat which was very nice of him to do. It helped me feel welcome, in such a fancy place that is usually out of our comfort zone. The normal prices here are quite high but you get great service, a great view, and great presentation in return. They do have parking in a garage right beneath it. You have to get a ticket but they will validate so that it is free. Certainly makes it easier to deal with parking downtown. We ordered a number of things, including the pork belly appetizer and tuna tartare appetizer. Both of them were delicious with the pork belly being very savory and decadent with that caramelized fat. The tuna  on the other hand was very fresh and light. I got the salmon for my meal and it was delicious and filling. My husband got the lamb, done two ways, which neither of us were huge fans of but admittedly don't eat lamb very often. I also was not a huge fan of my dessert, which was a shortbread cookie kind of dessert. It was very dry. My husband's chocolate cake dessert was very good though. The presentation for all of the dishes was lovely. All in all, a really nice experience and I'd come back for a very special event."], ["Jess L.", "Let me preface this by saying I will likely come back here and plan to re-review, as I have a feeling they were just not on their game.I came for a large, private party, and the bar was totally overwhelmed. There were bartenders going in and out, and I believe some of the upper management staff also were trying to cover the area.However, it took me over 20 minutes to get a glass of wine. There seemed to be only one register, which was the bulk of the bottleneck, but also making the cocktail menu available just slowed everyone down. They also did a subpar job keeping track of who was next in line, as they prioritized other people standing next to me for half the time more than twice.Otherwise, the space is classy, and the view is unique. The other Yelp reviews make it a must that I come back. Nonetheless, I was pretty disappointed and haven't had that much trouble at the bar in a long time."], ["Marisa R.", "I'll start by saying that I'm interested in returning to On20 to get a better idea of their overall menu and service. I went to On20 yesterday with my boyfriend. They called to confirm my reservation and told me they were offering their Restaurant Week menu (awesome, right?). We come to find out when we get to the restaurant that they were ONLY offering the limited menu. Nothing on the limited menu really stuck out to me, I was looking forward to having the venison that was featured on the al a carte menu. All the offerings seemed very earthy and, after having them, very rich. I look forward to spring and summer features at On20 to try some of the lighter and fresher fare that comes with the seasons. At first, service was amazing. The server answered all of our questions and we were very pleased. By the end of our time at On20 we were never offered another round of cocktails or coffee with our dessert. We waited about 20 minutes for our check only to find out that a 20% gratuity was added as a \"service charge.\"  In my experience in food service, 20% is for exceptional service which I didn't feel I was offered. I'm hoping this is just a fluke that happens during Restaurant Week. All in all, I'm hoping to return in the summer with some higher expectations."], ["Addison P.", "Service was great! Very nice. They charged my iPhone for me. The pictures should do the talking. I had the \"beef.\" It was a pretty hanger steak. They didn't ask how I wanted it which I thought was strange. I tasted the pork. Very tasty. I had the green bean salad. Pretty good when you ate all the bits.Had a lot of the desserts and the cheese platter."], ["Eric H.", "Sigh. Double sigh. I had such high expectations for ON20 after they received glowing 5 star Yelp reviews from my respected Yelp friends Anthony P, Anna E, and the Queen Bee herself our Community Manager Emily C.  But in doing some additional foodie stalking via the interwebs, I see that their famed celebrity chef Noel Jones had stepped down as executive chef back in Aug 2012. Not to discredit the service side of ON20 in any respect, but the award-winning Jones has been internationally acclaimed for his culinary creativity, vision, and expert technique at executing haute French cuisine and it's the food that brought them to the level of competing for the title \"Best Restaurant in CT.\" And this is not to say that his successor, Jeffrey Lizotte, isn't up to the challenge because the food actually was quite good and executed at a high-level. Based on my personal experience, the night just missed the mark time and time again, mostly on the service front. And to justify a mandatory 20% service charge on every bill, you really expect to be cared for in an exceptional way that should surpass every other restaurants where gratuity is earned and not guaranteed. I overheard numerous tables complain about that mandatory service charge, and in my opinion should be something disclosed to every diner so it doesn't come as an unpleasant surprise to end your meal. To me they seemed understaffed, because the service experience here was extremely lacking especially from a place where people throw out the words \"Michelin star worthy.\" Here is how my birthday dinner at ON20 played out. My father in law was in town and we arrived early at 7:40pm for our 8pm reservation. The very sweet hostess informed us that our table wasn't ready yet, as expected being that it was Friday night and they only serve dinner two nights a week, and graciously offered us to have a drink and wait at the bar. We sat down, the server/bartender acknowledged us and dropped off a drink menu, and then went back to mixing cocktails behind the bar. 10 minutes go by and I still see him furiously running around behind the bar. Another 5 minutes go by and he still hasn't come back to take a drink order from us. Now I get inpatient being that the bar is less than 5 feet away so I get up and order two Manhattans and a round of water from the other bartender. Another 5 minutes go by as she mixes up the drinks and it wasn't until 20 minutes after we sat down that we got our waters and cocktails all brought out at the same time. 20 minutes for water seems a little ridiculous to me, especially at a fine dining establishment that prides itself on service. We proceeded to wait...and wait...and wait. I did appreciate that the hostess did acknowledge us and was apologetic for the long wait, but we didn't sit down at our table until 8:40pm. Not a great start.We knew coming in that the three of us wanted to go the tasting menu for this special occasion dinner, so we put that order in pretty quickly and clarified my 9 months pregnant wife had dietary restrictions (no raw food, unpasteurized cheeses, etc.). The amuse bouche of raw oysters came out and one was brought to my wife, thus we had to remind the staff to take this back while we waited for a new dish to be prepared. Another frustrating misstep that shouldn't happen when you're paying $100+ per person and tacking on an automatic 20% service charge.Speaking specifically to the cuisine, each plate was artistically plated but the salad starters were quite forgettable. The one standout before the savory courses was the tapioca and salmon roe dish, that had a unique bubble bursting texture with each flavorful bite. Creative presentation in a well-balanced flavor package. The skate and pork belly were also quite delicious and well prepared, although the portion size wasn't more than a couple small bites. Quite the tease. Honestly, the rest of the dishes were pretty forgettable. I'm struggling to remember the flavors, textures, and ingredients even though I had the meal less than a week ago, whereas I can rattle off each dish and individual ingredients from my tasting menu birthday dinner at Millwrights last year. ON20 just didn't give me that memorable, emotional dining experience that makes eating out so special for me. I'm an admitted food snob and eating well means much more to me than the average American. As with all Yelp reviews, take this one with a grain of salt. I'm the biggest advocate to forming your own opinion in life, but after having recently eaten at so many great CT restaurants (Le Farm, The Whelk, Bar Bouchee, Chamard Bistro, Millwrights) my thinking is that ON20's best days are behind them."], ["Jesse M.", "I've heard great things about ON20. Consistently this venue has been the subject of various 'best of' reviews for Connecticut. I was able to find a Friday evening reservation available for my wife and I.First off, the views are nice, however I have worked in tall office buildings for years, so I was sadly jaded. This did however let me see the decor for what it is, minimal and rather dated.The service was professional and cordial, no doubt a carryover from the restaurants club days for the Miners Association. However the tasting menu we were told was 'tailored per table', this was not the case, each table around us doing the tasting menu received the same set of meals. We even suggested our distaste for foie gras, but still received a foie gras dish!Now the food, by far the shining star. Even though the tasting menu was a sham, the food delivered was small plate haute cuisine. Seven plates with a variety of French and Spanish inspirations. All well prepared and of high quality. The cocktails were on spot, my request for Anejo and Stormy's were carried through and refined even though the bartender was unfamiliar, he took great pleasure in refining the cocktail and even produced homemade ginger beer.In summary, good food, good service, good views. I would recommend this place for anyone in Hartford seeking a formal romantic classic dining establishment. My tips would be to save some money and order individual plates to avoid the chef or tasting menu."], ["V C.", "An awese experience.  I had a tasting menu and had so much food.  The experience was worth it, the presentation and food was amazing."], ["Naomi R.", "I would totally go back. The food truly is THAT good. HOWEVER.... there are a lot of things to take into consideration to be prepared for...1. The cost. Yes, it's pricey. And honestly, for the price, the decor and staff could use some improvement. 2. The decor. Yes, it's in an office building, but it still looks like it's in an office building. Very drab, outdated, and I'm 99% sure my grandma has the same curtains hanging up. 3. The staff. Very nice, but very slow. They had no problem taking our plates before we were finished or replacing our cocktails to have our bill become larger, but the time between each course (we did the tasting menu) was insane. After ordering, it took almost 45 minutes for the first course- and it was a salad!4. Getting seated. Hostess looked like she rolled out of bed, with the quality of the meals, they should be actually dressed and stylish. Once seated, it took almost 20 minutes for someone to greet us. Frustrating.5. The view. It's downtown Hartford. Really. And when you're next to the Travelers building... ugh. The food is phenomenal. But, to be perfectly honest, the tasting menu is $80. The tasting menu at Milwright's in Simsbury is $75 and substantially better, with an incredible staff and an atmosphere like no other."], ["Freedom M.", "I had such a great time here.  The service was top-notch!  We were treated like celebrities.   There were at least 6 people waiting on us, all with character and charisma.   The bartender made personalized drinks.  The wine selection was great- mmm... Sancerre!  The chef kept surprising us with little treats, starting with the most delicious soup in an espresso cup.  The presentation was creative and artistic.  The night time view of Hartford- exciting! From starters to finish- perfection!"], ["Ashika B.", "On20 is an elegant and intimate restaurant, hidden in plain sight in downtown Hartford. The service is outstanding and the food is exquisitely prepared. On my first visit I had the creamy clam and celery root chowder to start and the duck confit hash with duck egg as my main course. I finished my meal with the carrot cake. Perfection! I plan to return again."], ["Katherine G.", "I was recently taken here as a graduation celebration.  I didn't give this place a full five stars because it is kind of a weird atmosphere there. The views are awesome and the staff is friendly enough but I've received better service elsewhere. However, I enjoyed every part of my meal from the seemingly simple Green appetizer which had a very enjoyable combination of flavors and the Muscovy Duck which was cooked perfectly. They had a dessert that night that was  a take on a creamsicle which was very tasty but I thought the dessert menu in general was a little bit lacking in creativity compared to the rest of the menu. I do plan on going back here at some point and I would highly recommend others give it a try. I did not make the reservations but the others in my party told me they had to book a table over a month in advance for a Saturday night."], ["Anna E.", "Excellent.Met a friend here for lunch yesterday for the Taste of Hartford restaurant week menu.  It was the first time for both of us and we were impressed with every aspect of our experience.  Other reviews have noted the incredible views of the city from this restaurant that is on the 20th floor of the Hartford Steam Boiler Building.  The dining room is elegant with patrons and staff to match.  An amuse bouche of chanterelle mushroom, parmesan cream, truffle, wrapped in a thin crisp so light it practically melts in your mouth arrived before our first course.   Appetizer:  White Gazpacho with Marcona Almonds, Verjus Grapes, Compressed Cucumbers, Anise Hyssop.  If light, refreshing, and creamy can all be used to describe a dish, this would be it.Main:  House Made Berkshire Pork Sausage with Summer Squash Succotash and Lemon Verbena Pesto.  Wonderful play of textures and flavors. Dessert:  ON20 S'more, Graham Cracker Croquant, Chocolate Marquise , Smoked Caramel.  A blowtorch was brought to the table!Everything was presented beautifully.  The service was the most attentive I think I have ever received at a restaurant - almost a little too much, but appreciated.  Parking and finding the restaurant was not as difficult as I had anticipated.  Followed the instructions on the site:  parked on Level 3 of of the garage, walked to the lobby, found the set of elevators next to the On20 sign, took the elevator to the 20th floor, and entered through the glass doors to one of the most memorable lunches I would have in a long time."], ["Rachel T.", "I'm sad to say that this place was in a word disgusting. I will say the space they have is quite lovely and beautiful that is where it ends. I've been wanting to try this place for some time and what a disappointment. Our res was at 630 / we got there about 6 and had appetizers and drinks before we went to our table. We had the duck sliders which were fine but certainly nothing to write home about. We also had the cheese plate (hard to screw up) and the crab app. None of these would be what I consider outside of mediocre. We moved to our dinner table. My husband and dad both got salads. My husbands celery root was not seasoned, nor was it tasty. I didn't try my dads but it didn't look or sound all that special. Our meals were atrocious. My husbands plate literally looked like a fish shit a big slimy white undercooked log on his plate. Mine had three bites of rabbit and cold spetzle. This place is focused way to hard on making the food look s certain way and trying to achieve something they can't. Your left with fussy and truly gross food. With a bottle of wine and 1 round each it was over $500.00. Oh and I almost forgot the amuse bouche - it was a chestnut potage (must be French for thick salty phlegm) YUK! It did however provide us with lots of entertainment though. We watched people's facial expressions when the tried to drink it - which was pretty funny. Do yourself a favor and stay away!YUK"], ["Michelle C.", "Had a wonderful New Years price fix here.  Seven courses all fun and exciting. The best part is when the chef actually came out and said hello to every table!  Nice man, great food!"]], "Negrita's Restaurant": [], "Tapas": [["Antonia A.", "I work right next door and I eat here often. I love those waffle fries (especially with that madd Greek sauce) it's a spicy ketchup. The ultimate gyro is awesome. They were even proud of me for pronouncing gyro correctly. The clam chowder is awesome. It has bacon in it, who doesn't love bacon? They have a good beer selection and the tapatizer happy hour is pretty sweet. The staff are very friendly and are good at holding up conversation. How could I forget! The chicken caesar salad is amazing! I always get extra croutons and they are generous with the chicken. Love the Greek salad. They make and sell their own dressing. So amazing."], ["Marleena C.", "GOOD LORD! This place is awesome!  I love their chicken gyro's, hummus platter and Greek salad....but my favorites are the apple cheddar flat bread (divine) and their vegetarian chili served with pita triangles...OH MY! This place is just very yummy all around, I often get it for take out...it is so good once it hits your lips."], ["Staci R.", "Came here for dinner with my fiancé on a random Tues night. Heard great things about this location in particular so decided to give it a try. From the outside it looks like a Chipotle or another semi-eat in restaurant. Inside its actually quite nice and the smell of delicious Greek eats hits you before your bottom hits your seat.There were some very decently priced specials on the large blackboard against the wall, but we weren't in the mood for a platter so decided to stick to the menu. I heard the sangria ($5.95 a glass. $14.95 a pitcher) is yumm so I asked the waitress if the red or white peach is most popular. She said the white is sweet and the red is whiney but they're equally popular. I ordered a pitcher of the white. The waitress came pack a few mins later with the news that they no longer have the peach, but she did bring a sample of he white ginger sangria. Too much kick for me but it was nice of her to bring a sample. I settled on a glass of the red. I like my sangria strong. I figure hey if your gonna waste the calories on a drink, mind as well make it count! This one wasn't strong at all but it was tasty nonetheless. I ordered the gyro ($7.99) and my fiancé the falafel (7.99) . I wanted a Greek salad and he wanted fries so the waitress suggest we just make his a plater ($6 extra for fries and salad) to save a few bucks. The food was tasty! The waitress was even kind enough to bring us 3 different sauces on the side.All in all a good dining experience. We would definitely go back!"], ["Alfred F.", "Tapas has had a fine reputation for as long as I can remember. The original is situated in the Elmwood section of West Hartford, while it's baby sister lives in a small strip of businesses on the Northwest corner of Bloomfield Avenue and Cottage Grove Road in Bloomfield.Before I go further, and people start accusing me of playing up the home-town favorites, I want to point out that I had not previously reviewed Tapas because I think that the several reviwers before me had given it justice. the reason I write today is because of the later-evening experience I had this past week. After performing an evening service and concert at our nearby synagogue, my wife and I decided to get a bite to eat. It was already past 9:30pm when we drove up to Tapas. The dining room was dim, and we could only see one other couple in the window as we walked in. We were greeted in a friendly manner by the hostess, who seated us and handed us a set of menus, including daily specials. Our waitress again warmly greeted us and took drink orders. Once she returned, she took our food orders. Both of us opted for a couple of appetizers in lieu of a full meal, considering the time of night. Our waitress - I wish I got her name - took our orders cheerfully, even suggesting chopped bacon for the Tapas Cheez Fries, a large mound of waffle-fries, topped with melted cheddar, and feta cheese, accompanied with \"MADD\" sauce, their spicy redition of ketchup. It was a great suggestion because it added a lot to the dish. I also had their Sherried Clam Chowder, which came with both the expected packet of oyster crackers, and an unexpected handful of pita wedges...and not just any pre-bagged pita. You could tell from the first bite that these were premium. The chowder was a bit different than a typical New England style, with the addition of sherry, and a different combination of spices. Still it was quite tasty, and I did manage to finish it to the last pita-swipe.My wife ordered a side if falafel, and two mini Spanekopeta. The falafel plate had three orbs of yummy garbanzo goodness, smartly spiced without being overpowering. It was accompanied by several pita wedges, fresh made tahini, and Lots of chopped vegetables. The spanekopetas were two perfectly browned triangular pastries of spinach and feta.The two things that struck me about the experience were the fact that, not only was the entire menu available at that late hour, but that the kitchen still put out the effort to make sure everything we ordered was cooked and presented as well as if it were in the middle of dinner. Also, our waitress - the one with the name I can't remember - was so bright and cheerful, yet professional enough not to hover or rush our late dinner and let us enjoy every bite. I did not expect to be treated like such a guest, especially that late (we didn't wind up leaving until about a quarter to eleven). Thank you Tapas, for inviting us and letting us appreciate what you do."], ["Lucy T.", "We went here for my boyfriend's birthday dinner. VERY disappointing, right from the start we should have known. The parking lot was PACKED and the restaurant was pretty much dead. We realized later everyone was at Ruby Tuesday's. Now, that alone wouldn't normally deter us, our favorite sushi place is usually dead. We started off with drinks, one red and one white sangria, those were okay. We thought okay, maybe this place won't be so bad. Next we ordered our apps and entrees. Again, we should have known. When the waitress (who was actually AWESOME btw) described the 'madd greek sauce' as \"kind of like a ketchup but with a kick\". We ordered the Mediterranean salad platter and falafel for apps. The falafel were okay- very plain, the tahini was probably the highlight of the night, the pita was borderline, mostly soggy but I was starving.The tabouli salad was okay but we've made better at home, the same with the hummus. The hummus had a decent taste but was very watery. The sorta red tabouli looking salad platter item- it tasted like bulgur with BBQ sauce, absolutely disgusting, same with what ever the eggplant chunky salad was. Gross. Another reviewer referred the the mad greek sauce as ketchup and duck sauce but this salad thing was the weird Chinese sweet n' sour sauce...Next were the salads, I don't even know how to say it, the 'almost famous' dressing, nasty. It was basically olive oil and oregano. I'm sorry, according to the bottle that we read while we were waiting for our table to be ready said it was made with canola oil... yikes.After that were the entrées, I ordered souvlaki and he ordered the platter which had a little bit of everything. Here is where the dinner got REALLY BAD. His chicken skewer was RAW- like completely pink chicken. They took the plate back to the kitchen and brought it back without the chicken skewer- same plate. Mind you my bf had spit out the raw chicken onto his plate. So anyway, then he tried the gyro meat, it was sliced too thick and had a completely slimy texture. The lamb patties were okay, just bland. My dinner, the souvlaki was basically bad Chinese food. It came out looking like a greek stir-fry. I've had chicken souvlaki before (not here), it was a pita with chicken, lettuce, red onion, tomatoes, tzatziki sauce, that's IT!!!! NO BROCCOLI!! NO GREEN PEPPERS!!! Keep in mind I get really sick when I eat green peppers so if I had known it had green peppers I would not have ordered it. So all in all, this place was awful and I wouldn't recommend it to anyone. The only reason I gave this place one star was because as I said before, our waitress was so sweet. I just wish she worked somewhere we actually liked because we'd go just to see her.And as a side note/rant, cheddar cheese, seriously. What greek food has cheddar cheese on or in it?"], ["Christopher S.", "I've been here many times and I never leave disappointed!  A great atmosphere for a casual to semi formal dining. A great selection of local and imported drafts in tap at the bar.Last time here, our service was just wonderful. Our waitress was happy to accommodate special orders and was very knowledgable about the menu and food preparation.You simply MUST try some of their appetizers. No, nachos and cheese fries are not genuine Greek food, but Tapas puts there own twist on these dishes to make them unique and outstanding!  The cheese fries are waffle fries covered with cheddar jack and, yes, feta cheeses, as well as scallions.  Dipped into their self titled \"Mad Greek Sauce\", (spicy ketchup) this appetizer is something I look forward to every time I visit.I almost always order the ultimate gyro.  This comes with either the taziki sauce or the mad Greek sauce or a combination of the two.  They also offer a choice of meats.  I always elect for both meats.Great atmosphere, great service, great food at a very reasonable price!"], ["Laura P.", "Great spot for lunch on a recent visit. I had the flat bread cheese pizza which was delicious and the service was quick and helpful. My friend had the veggie burrito and says she gets it all the time and loves it. Wanted to try the chicken souvlaki and Greek salad but had a meeting to go to and didn't want to have all that garlic and onions. Will have to try another day when I don't have to worry about that."], ["J. L.", "Yum! Yum! and Yum!We mostly dine in around lunch time. Almost always the same table by the window, and we enjoy our little spot. The Gyros are good, Tapas Flatbread pizzas great as well. We usually try one of the amazing Blackboard Specials. You can also get these specials take out. I once called in an ordered for takeout during the dinner BB Special and literally picked at random. It was hands down the best Kabob with veggies I've ever eaten. Food here is consistent, as is the service.  Our young daughter is in tow with us everywhere we go so for a lunch date with my Husband this is great as she eats strips of the gyro meat with her pocket bread. We enjoy the wonderful Sangria and a few Blackboard Specials and call it a great day!!!Tapas has a bar but we've yet to sit on that side. It looks like a great place, and last visit about a week ago we saw they are serving brunch on the weekend. I'd call ahead to check on the day and if it is a buffet or not.Avg. wait for food:15 minutes+/- for kids:no known kids menu, but great small inexpensive sides that your child will enjoyAmbiance:Although casual, upscale feel. Not pretentious at all. Very comfortable.Parking: Private Lot, tight spaces."], ["Susan H.", "This use to be my go to place when I visited from New York. Not sure if new owner or new chef but other than the Greek salad my gyro was bland and had no flavor. I red red the chicken one which I have had many times and it was awful Chicken didn't did not taste nor look like chicken. So sad"], ["Ila S.", "I went here for the first time the other night was was pleasantly surprised. I never even heard of it before. We had no reservations and were seated right away on a Saturday night. There were so many things I would've tried on the menu. I wished I was with a big group so we could order lots and share. I ended up with the falafel platter because it was there. There aren't many places I can get falafel. It came with a generous Greek salad to start and rice on the side. It was quite tasty- nice tahini sauce. More food than I could eat in one setting. And since there were other things of interest, I will go back."], ["Kimber P.", "Came here for dinner tonight.  The space is open, airy, and modern - much more comfortable than the West Hartford Tapas.The only disappointment I had was the service.  Our waitress was attentive when we first came in - but never came back to check on us throughout our whole meal.  I had to flag her down to get some more water, and then it also took a while for her to pick up our check at the end of the meal.  From start to finish, our visit took two hours due to the slow service, which is slightly long in my opinion.I ordered the nachos - which were plentiful and delicious, although a bit spicy for me.  We also ordered \"The Mamas and the Tapas\" for dessert (a pizza with apples, amaretto, Vermont cheddar, whipped cream, and almonds) - which was an interesting combination.  It sounded like dessert, but was on the dinner menu - and that's kind of what it was like.....a combination of dinner and dessert.  It was fairly good, but the strange thing was that they appear to use the same crust for this as for the other tapas, and the crust had herbs in it that didn't really go with a \"dessert pizza.\"Overall, the food was yummy, and  I liked the atmosphere.  I would definitely come back."], ["Laura L.", "Great food but \"grumpy\" bartender.  Have been going for years and the food is consistently good. However the bar staff has been a contentious and caused me to re-evaluate going back.  I know people have tough days but I don't want to receive the negative energy when I go to dinner or for drinks."], ["Christopher G.", "Where can I start. . .Wow.First - This isn't a Spanish place. . .its more of a odd selection of Mediterranean food (more greek than anything else). The sandwiches are served with a mixed lettuce salad bag - if that is indication on the quality of the restaurant.What is worse, is the service. I haven't had such a bad service experience in a long time.  The place has a callout for sandwiches (add fries for $2.50).  So we got the fries.  We get the bill and the server told us that we didn't say platter (neither did the menu platter isn't mentioned it just says \"No Rice? Add Fries - $2.50\") so we get charged an extra $1.50 per person. I said that is wrong, we ordered the fries. The server said tough. We asked for the manager, the server refused (or the manager refused to come out).  So we said, hey you screwed up here we will only pay what we owe. He threatened us and told us he would call the cops over $3.00.Obviously this place didn't care about us, our service, or the fact that we just ordered over $40 worth of food and he wouldn't to nickel and dime us for $1.50. . .which we didn't owe.  Stay away. Go some place that values you as a customer and won't attempt to look for ways to confuse you and dime you for a $1.50.** update 6/12/2010 the waiter was acting without the knowledge/approval of the restaurant. The Restaurant has attempted to make it good (and will refund us the meal).  So with that in mind I'm going to 3 stars - average food place. . .just skip the bald big waiter."], ["Jeannette B.", "The greek salad and the sangria.Huge, fresh and very filling greek salad. I get it almost every time I come. The sangria is also fresh and excellent."], ["David S.", "Nice for a light meal, great hamburger, great gyros and salads!"], ["J H.", "I have been a huge fan of Tapas since it opened in West Hartford and then in Bloomfield. The food is always tasty and the staff friendly and helpful.  The bar is a local watering hole for fans in the area. However, the menu has now changed and its very distressing. Gone are the days when  you could order a platter and receive copious amounts of mouthwatering fare. Now everything is a la carte.  No more yummy platters, where salads and fries are included, no more Gyros with rice and salad.  No More, No More, No More, What a shame."], ["Arthur M.", "Yes, this is one of my favorite lunch places. Delicious Greek dishes. Great people. Excellent location in Bloomfield."], ["Amber O.", "The food is really tasty here, you can't go wrong. My one gripe would be the lack of menu items (sides, extra choices, etc). The Madd Greek sauce is delicious, spicy ketchup goodness. The falafel is good but not the best I've had. I would have to say the best part of this place is the sauce they use. They kick it up a notch with fancy style and this really does play well to the dishes they offer."], ["Melodee M.", "I came for a greek salad. I added grilled shrimp which takes this wonderful salad up ten notches. I never get to eat in here , but it's cute place. The foof is consistently awesome anf there's always enough"], ["Kara T.", "Good apps, really fresh good food.  Get the Spanikopita or the soup of the day.  The salad is also good too.  Great for lunch or a light dinner.  Ambiance is okay, very casual and somewhat hip.  I feel like it is just missing something.  Perhaps some additional dramatic decor or something to add some charm would make it feel less like a panera bread.  The restaurant feels like it can't decide what its personality is.  I would also nixe the cooler at the receptionist stand.  It screams grab n' go/takeout and takes away from touches like the beautiful bar.  However, I would absolutely recommend and return. I must add that I would give the Spinach pie 5 stars on its own.  This experience was good as well, but not the same!  Our 1 app, 1 pizza, 2 beers and one cocktail brought the total cost up to $50...no sure I would consider this reasonably priced and it was just okay."], ["Jeff L.", "Greek Salad. Enormous and the most unbelievable dressing!"], ["Danielle M.", "This little gem is one of the best kept secrets in the area.  If it were located in West Hartford Center or Bishops Corner, there would be a line out the door.  Since it's located a little bit off the beaten path (about 5-10 minutes outside of West Hartford) you can walk right in without a reservation.My favorite time to go is on Sundays for brunch.  The brunch menu is delicious and the live jazz provides fantastic ambiance."], ["Ethan B.", "Food is always pretty decent -- especially their special greek dressing -- food I would rate at around 3 or so.  This review is focusing in particular on the online ordering experience.In short -- DON'T WASTE YOUR TIME!Twice, I've ordered something through the website for pickup, only to find out they never got the order.  As it turns out, online orders generate an email, which is printed on a printer in the back, no where near the front station where orders need to be entered.  The orders don't automatically enter their system, so it's on the people at the desk to monitor the printer, which I can tell you from experience, they don't.  My intent on a short lunch is to save time and have my food ready -- pretty much defeats the purpose if I have to reiterate the order and wait 25 minutes when I get there!  Even worse this past time, the printer was malfunctioning and you couldn't even read my order easily.  Not a big deal for a small order, but if I had been picking up an order for the office, it would have been a disaster.Another point of concern regarding the ordering is that payment is not handled automatically either.  If you were foolish enough to enter in payment details on the site, expecting this to be handled automatically -- jokes on you! They get printed in plain text on the email -- in an area where anyone could just swipe the paper.  NO SECURITY WHATSOEVER!Moral is avoid the useless online ordering system and call it in..."], ["Max Z.", "Great boneless chicken wings and great carrot cake"], ["Erin C.", "I wouldn't return if I was paying for it.  I'm not really a fan of Greek food, so I was fooled by the name Tapas as I expected it to be Spanish.  Silly me LOL!!!"], ["Mike B.", "Got the steak muffaletta, very good! Menu is nice, lots of variety. However, the waitress seemed aggravated when we asked her to split the check. There were 5 of us, don't you think she would have done it anyway?"], ["Mike C.", "If your in the mood for 100% authentic greek cuisine, tapas is probably not your number one destination...however if your in the mood for awesome, fresh greek inspired food, give tapas a try. When ever i step into the location on cottage grove, i always am greeted by wonderful staff who show off genuine manners and stunning personality. The food may be a bit americanized, but who cares when it's so delicious. From their gyro to baklava, tapas delivers taste at a very reasonable price. Not to mention that their house made tatziki can be eaten with a spoon, it's just that good. I go here often for a quick lunch or dinner because i won't be disappointed..."], ["Teddy W.", "The service behind the bar is terrible, this is not a tapas Spanish Restaraunt, don't know why it's named that. Inconsistent food and a less than welcoming attitude. The service is worse than bad, it's terrible."], ["Thomas I.", "The menu was very limited for my taste.  Fortunately, they had a sea bass special that I found very good.  The fish was cooked to perfection and perfectly seasoned.  The problem I had with the place was that the risotto was bad and the meal was pretty pricy.  My friend raved about the place and I noticed why, I just probably have different tastes in food and how much I like to spend than him."], ["Mercedes R.", "Yummy!!!!   I was in town visiting the parents, and they took me to this place for lunch.  They have a nice wine selection, and all of the menu looks good.  I ordered the Baby Moon & Mushroom Tapas, and was sufficiently filled.  I'd definitely go back again when I'm next in town. Now if only I was able to get my dad to correctly pronounce \"gyro\"..."], ["Lisa J.", "We are vegetarians and LOVE the food!!!!  The mediteranean platter is the absolute best!  So much variety, hummus, tabouleh, feta, mouseka, bulgar, grape leaves.  I don't know how to spell these delicious foods, but trust me....so worth a visit to the Bloomfield location.  The West Hartford location is just too small and tight for me, but Bloomfield seems much roomier.  Oh and grab some mints for afterwards, they aren't shy with the garlic in the hummus.  Soooo good!!!"], ["Zoe L.", "THIS IS NOT A SPANISH RESTAURANT.  when i first heard of this place, i expected spanish tapas.  then we arrived and i saw \"mediterranean cafe\" on the side outside, which made me very confused.  basically, it's neither specifically spanish nor mediterranean food, but it tastes good!  there are some gyro, kebab, and souvlaki entrees, but there's also a section of the menu called \"tapas\", which i'm still not sure how to describe.  one person in our party ordered a cajun chicken tapas, which came out looking like a small pizza (no cheese), with broccoli + chicken on a puffy round flat bread (which was called a tortilla in the menu, but was not like the typical pancake flat tortillas i've had).  every day features a couple of \"blue plate specials\", and i ordered today's mac + cheese, which had cheddar + parm + gruyere topped w/buttered bread crumbs.  i was happy.  my other friend ordered the cajun chicken quesadilla, and he seemed quite happy with that.  so even though i'm still not sure how to classify this restaurant, i'll definitely come back!"], ["Erica P.", "This is one of my favorite lunch places in the greater Hartford area.  The specials, which change daily, are plentiful and delicious, and their signature \"Almost Famous\" salad dressing is wonderful.  Also, try the vegetarian chili.  Service and atmosphere are great too."]], "Milagros Spanish Restaurant of Wethersfield": [["Liz F.", "This place was so good, I created a yelp profile just so I could add and review them :) Was driving on my way to work and I saw this place, so my husband and I stopped in for dinner. Oh my. I was in HEAVEN. authentic, delicious, flavourful food. I cant reccomend it enough. Everything I had was amazing! I had the beef stew with rice, some potato salad and plaintains. It doesnt get much better than this!"], ["Mickey Z.", "seemed like it was going to be better than it was. one woman working. i called in the order, got there 10 minutes later and she said it would be 10 minutes. OK so I waited and realized she hadnt even started making anything. I was the only person in there the whole time i was there. alcapurrias did not have as much flavor as they usually do and they were a darker color and very greasy. bacaoloita was a lot for $1 and used real fish, it was salty though. Tried the small cuban sandwich and it was huge. the roast pork was really hard and there was ham in it too, which isnt advertised as such"]], "Milagro's Spanish Restaurant": [], "Piolin Restaurant": [["Eric B.", "Absolutely fantastic food.  Quality was superb, portions were very generous, prices were very reasonable.  We had the ceviche and chaufa de pollo.  Only criticisms are 1) its not in the most alluring neighborhood, and 2) The server didn't check up on us as often as we thought she should.  Regardless, a fantastic hole-in-the-wall place!"]], "El Pulpo Restaurant & Tapas Bar": [["Marsha G.", "I can't believe this place is so good and it just opened in May. It's listed as Mediterranean food but I'd say it's Spanish- Mediterranean. They had a special menu called \"A Taste of the Suburbs,\" that paired an appetizer with an entrée. I chose a tossed arugula and beet salad as my starter and spaghetti with lobster sauce with shrimp and (I can't remember which type) white fish. It was buttery and heavy and cheesy-delciousness. My fiancé got lamb empanadas as his app and seafood paella. The paella had shrimp, muscles and a cheesy type of rice. Everything was delicious. It was one of those rare moment in the Connecticut year where the weather was warm enough at night but not hot either. We sat on their deck drinking a bottle of sauvigon blanc and listened to Spanish music. The waitstaff was attentive and filled out water up frequently. I can't wait to try their food out some other time!"], ["Jason S.", "El Pulpo is a bustling great Tapas restaurant! The food was delicious and the service was very good but a bit on the slow side. They were very busy when we arrived and we didn't have reservations but they were able to get us seated within 20 minutes.The food was delicious and each course was like a mini art presentation! The flavors delighted the palate while the presentation dazzled the eyes. Textures and colors and flavors and varieties of food tantalized the senses! My girlfriend and I loved our first visit here and we will be back!"], ["Jason M.", "Completely blew away my expectations. Queen Street in Southington, a bastion for sports bars, cheap fried food joints, and chain restaurants, has somehow rendered out a stunningly exquisite tapas restaurant, every bit as good as the two big ones in West Hartford [Barcelona and Majorca]. Service on par to boot.One thing that may set El Pulpo apart from the rest is the wine list. There's some pricey ones, but there are also many selections, red and white, for $20-25. A great price for bottle service in the US, though they'd probably cost half as much in Spain :).Melissa was our waitress, and despite having half the restaurant on her watch, she worked admirably. They were short-staffed, but never did we feel like we were being ignored, or left wondering where our food was. Everything was done in a timely fashion.The pear salad and the salmon with goat cheese, not to be missed. If you're doing a full tapas night, order them! We decided to have them as appetizers, and share a wonderful seafood paella as the main course. For once, a paella that has just as much seafood as it has rice! Delicious, worth $25, and absolutely enough for 2 if you order some tapas.A really nice orange flan completed the meal. Three courses and 2 wines cost us $62, which is not cheap, but absolutely reasonable for a Saturday night fancy dinner. Great date restaurant, romantic restaurant, business meeting restaurant. In Southington, no less![Cheap shot at Southington not intended... well, maybe a little :p]"], ["Jessica M.", "Delicious! My husband and I tried this restaurant last night for my birthday. I've never had Mediterranean food before and I am so happy I tried El Pulpo! We had a stuffed mushroom appetizer, scallops over risotto and paella for dinner. Everything was incredible. The plating was beautiful and the portions were just right. We both cleaned our plates! Our waitress was wonderful, very sweet and attentive. At the end of the meal we received a complimentary after dinner drink. It was an excellent meal with great service. We will definitely be returning!"], ["Erica K.", "I came here for my parents 33rd wedding anniversary and I wasn't sure what to expect. The one in Middletown is awesome so I was excited to see how this one would pan out. I was hoping to see empanadas on the tapas menu but it was actually quite small. Not as much as I have seen in other tapas places. We ordered the cheese plate and cod coquettes for our tapas. The ham on the cheese plate was wonderful. The cod coquettes were delicious, fried perfectly and came with a creamy yummy sauce. We shared the seafood paella and steaK. The rib eye was cooked perfectly medium and was huge!! More than enough for 3 people. The paella was delicious. It only came with 2 shrimp, 2 clam, 2 mussels so not everyone (me) got to have all of the seafood. But I know paella is typically shared with just 2 people so it was all good. Overall I would recommend this place. It got super super busy by the time we were leaving, so service got slower. But I would recommend and come back!"], ["M W.", "I'll make it short and sweet, mainly because I don't feel like typing right now. Wow, you can't go wrong. I was shocked this place puts out food this awesome!! Just look at the photos I took! That should say it all....And it was rated Very Good by The New York Time!"], ["Lauren D.", "I want to start off by saying our waitress, stephanie, deserves 5 stars! She was great and very patient and accommodating. Now for the restaurant...So I have to say I was expecting a lot more based on all the reviews I read. Yelp you have steered me wrong twice in 2 weeks now!! Overall we left unimpressed- it was good but not sure if we will return. So first we ordered a pitcher of the white sangria. My boyfriend and I get this regularly at many restaurants and what we got was not what we were expecting. It was very fruity- and by that i mean fruit juice. It was orange in color and very peachy. I'm not a huge fan of peach so I really didn't like it. Stephanie very kindly took it back and off the bill. We opted for martinis after that. I got the cucumber cosmo and my bf got the passion fruit martini ($8 each). Both very good. For appetizer we got the mussels- these were very good. And the bread they give you is also very good its like a baguette, however wish they brought a basket because it was a little awkward having to ask for more bread eAch time. Entrees- the options weren't that appealing. My bf actually said this was the first time he didn't really want anything on the menu. He opted for some chicken and pasta dish because it was the cheapest ($15). He did like it but said it was just good, not great. I of course picked one of the more expensive dishes and a special at that - grilled Bronzino over spinach with mashed potatoes. It also came out with 2 fried stuffed shrimp. The shrimp seemed like an odd accompaniment and i think it was how they justified the $25 price. The fish was good, like really good, but Bronzino is very thin and small. I almost wish they gave 2 pieces and did away with the fried shrimp. I actually gave one of my shrimps to my bf (im not a big fan of battered shrimp- if it was grilled he wouldn't of gotten it) and he tried to give it back after a bite...We also had my bf's daughter who is picky but loves salad so we got her a salad. Stephanie was awesome and ran out like 3 different dressings when the first were not to her taste. Again she deserves 5 stars.Lastly dessert, we got the flan. I didn't like it at all. It definitely didn't taste fresh and the flavor was blah. My bf on the other hand thought it was good, but not the best. Stephanie did bring out complimentary ice cream for my bf's daughter. Again shes awesome.Overall, not bad experience but just ok. After 100 bucks I want to be wowed and I just wasn't. There were some tapas that looked good and since our mussels were the best thing we had we may return to just have some tapas and a martini."], ["Jason G S.", "Great place, Katrina was great, had the Filet, good stuff, properly cooked, nice wine selection, pretty busy for a Wednesday night - impressed.  Location/sign is different but who cares, cozy hidden gem"], ["Russell W.", "Good place for dinner? Sure. 5-stars? Not my experience yet.  Maybe I'm missing something, but given the over-abundance of 5-star reviews, the awesome looking pictures, and the above average price point, I was a bit disappointed.  My meal was pretty good, but my date's Brussels sprout salad (special) was somewhat comical in both appearance and flavor.  Given the ingredients, we assumed some type of creative dish incorporating Brussels sprouts into a salad in some creative way, but it was more like fancy cole slaw, which came piled in a traffic cone shape on top of a square of fried paella (I think).  The combined flavor reminded me of a McD's Filet-o-Fish. The lobster bisque also missed the mark. The flavor was OK, but it was a bit too watery and appeared to have mussels in it but zero lobster.  The waitress also forgot our bread, despite there being only 2-3 other tables seated at the time."], ["Em R.", "I had a really good dinner there.Even though the paella was delicious, the highlight of the evening were the tapas. All were delicious, from the grilled summer vegetables on the escalivada to the garlicky escargot and scallops.The service was incredibly attentive and kind."], ["Westie W.", "We were so impressed by our first meal at El Pulpo that we decided a return engagement on the following Wednesday was in order.  Parking was still a bit of a problem even though the restaurant was not full at 6:30PM, but I did observe two parties parking across the street later in the evening. We were seated at a table for 2 and received menus with the Taste of the Suburbs (TOTS) menu included. My wife ordered a glass of wine while I chose red sangria - my wife was pretty happy until she tasted my sangria which was very good.  A server stopped and served us warm bread that we dipped in Spanish olive oil from a cruet sitting on our table.  My wife again chose the beet salad which turned out be very good though not as nicely plated as on our prior visit. I opted for the casserole - a generous and delicious serving of chickpeas, Spanish sausage, quail egg, mild peppers and spinach.As a main course, my wife chose the wild salmon nestling on an unusual take on Spanish rice, grilled vegetables in a tasty wine and basil sauce. I selected the short ribs entree which were boneless and melt in your mouth tender. Accompaniments included broccoli rabe along with a boring mashed potato puree.For dessert, my wife again opted for the orange flan which tasted fresher this evening. My profiterole was served with vanilla ice cream and a warm chocolate drizzle.Portion size and quality of all the ingredients were excellent considering the modest prices. Service throughout was very good and the noise level, though somewhat elevated, was not a distraction as it was on the preceding Friday evening."], ["kelly m.", "Been meaning to try this restaurant because I would continuously drive by it.  I finally got to sit in their outdoor area and see how the food was. Ordered a glass of wine and the waitress tried to up-sell us to a bottle. Totally unnecessary since they really fill the glass. We ordered the mussels app and split the standard paella. Then, our waitress brought out bread and marinated olives which were a nice touch. We asked for more bread to accompany our mussels because they were amazing! The sauce was great for dipping. When the paella came out, it made me kick myself for not coming here sooner."], ["Samantha M.", "Oh, it's so disappointing when Yelpers steer me wrong!Went here with a great attitude that dinner with the hubby before he left town for business was going to be an amazingly delicious and romantic meal.Granted, it was Wednesday...but the restaurant was busy the first hour we were there...when we first pulled in the parking lot we were both like \"ehhhhh...\" but with such awesome Yelp reviews we looked past the empty lot and decided to go for it regardless.We walked in and the restaurant seemed clean with tons of seating, almost to a fault b/c if the restaurant was crowded it would def be hard to get around...and since we had the place to ourselves we got to choose wherever we wanted to sit.  Probably the only pro of the night.Since we saw that Yelpers were raving about both the tapas and the entrees, we decided to get a couple of each to try out.  We ordered the pork tenderloin on the bread tapa and the Mediterranean \"salad\", and then for our entrees we got the penne with chix and chorizo and the scallop with lobster over risotto dishes.The pork tenderloin was ok.  Meat was tender, but the bread was too much...would've been much better on a fancier choice and more like a cracker or something...this was just a hunk of bread.  Nothing to write home about.The Mediterranean \"salad\" my hubby ordered and I actually didn't want b/c I wasn't feeling a salad.  They put it down and sure enough, it wasn't a salad at all.  It was a mold of veggies with some chunks of feta on top with flower petals around it.  The presentation was very beautiful, the dish...well considering there was a hair in it he hardly touched it.Entrees...I had the the scallop one...it was wayyyyy too rich for me.  When I order seafood I expect light dishes and light sauces...this sauce was so sweet and like a gravy.  Are they sure thy used champagne and not sherry in the sauce?  And it was fishier than I would've liked...which made me nervous that the meal wasn't super fresh.  Soooo the absolute kicker...within 30 minutes of leaving the restaurant my belly started to cramp and gurgle and...well, the meal didn't agree with me...let's just leave it at that!My husband's penne with chicken and chorizo was such a let down!  The penne was overcooked, the chorizo seemed like a cheap kind (barely any flavor) and the chix was grisly dark meat...with like fat and nastiness hanging off of it.  And it was mostly pasta and no meat!  My husband picked a little here and there and then again left a ton of it.  i felt terrible b/c he is the least picky eater...he'll eat just about anything and believes in \"eating to survive\" more than eating to enjoy his meal...so for him to leave so much food is a really bad sign.They do have really yummy bread though...really yummy...too bad they brought us only 1 piece each and never came around while we were eating to offer another one let alone be around for us to flag down for another one.  Needless to say, we didn't order dessert and certainly for $70 with no drinks I think the food is way overpriced...since it sucked!Service wise...there were 2 ladies and one man working.  One lady seated us but then was stationed behind the bar.  She was alright.  The lady that dropped off our dishes and picked them up was friendly and we thought she was pleasant.  The guy (our waiter) sucked.  Being the only people in the place for most of the meal I'd think we'd see him more than once to order tapas and once to order meals...he didn't even come by to check on how the meal was!  And he did start to come out more once there were two other couples toward the end of our meal...and even saw we were done eating but went to a different table instead and didn't come over to us afterwards.  Just crazy!Last little bit, if this wasn't bad enough already, were the bathrooms.  We drove 45 minutes out to the place so we both decided to use the restroom before getting on the road to drive home, and once we were in the car we found out 1. The women's bathroom had a spider web with a spider in it just chilling over by the toilet...yuck!  and 2. The men's bathroom had a poop stain in it when my husband went in there!  Double, triple, and quadruple yuck!  We, of course by this completely negative review, will not be dining there...ever again."], ["Stephanie M.", "I would give the food a 5, flavors were delicious .... drinks a 4, best red berry cosmo ever.  and the service I would give a 3.  While the staff was very friendly , they  all seemed confused and waited too long for drinks, dishes,  etc .  Also, the descriptions in the menu could be little clearer."], ["Tanisha I.", "My 1st time at El Pulpo Restaurant & Tapas Bar with a group of new friends. It's a quiet little place with plenty of seating for our group. We were able to talk and laugh and not disturb others and they didn't disturb us. No shouting necessary. Not a lot of parking.The food is mainly seafood, one one or two dishes don't have seafood. I had two apps, the Spanish sausage with beans and fig and the shrimp in garlic sauce. The Spanish sausage impressed me because I had never had it before and the sweetness of the fig sauce balanced perfectly with the sausage. I really liked it even though some of the beans were under-cooked.  The shrimp in garlic sauce was ok. Large shrimp and a bit of a kick to the sauce but just ok. I had the chocolate creme brûlée for dessert. I have never had creme brûlée before. I like the crust on top, sweet, the chocolate mousse inside was a bit much but if you love chocolate you'll love it.The service was excellent but I wish they had asked at the beginning if it was going to be separate checks. We were a group of 7 and it would've made it easier at the end.We all agreed we liked it and would come back. That's all, ta."], ["Charles M.", "Don't let the outside fool you! Great dinner and desserts were fantastic.  One of the best meals in the valley. Service a little slow but who cares with friends and drinks, well worth it!"], ["Jon M.", "Delightful tapas place. A good value, great menu, excellent service. Will be back next time I'm in Connecticut."], ["Dan S.", "Loved this place in so many ways.  Not the least of which is that it was entirely unexpected. I mean, it's across from a  Tattoo Parlor! But seek this place out.  And get a reservation too. It was packed on a Friday night and we had to sit at the bar.  No matter, service was great. We ordered 5 apps and they came out in pairs (or solo). Perfect - and without asking.The standout tapa was a special portobello mushroom, white asparagus, tomato and brie dish. \"Tastes like spring\" said my dining companion.  Yep.  The dish could've fallen apart, but with A+ quality ingredients, the chef let the veggies standout.  We also really enjoyed the stuffed piquillo peppers, the artichokes, and, oh, we enjoyed everything.  Now we need to come back for the main dishes.  Seriously, this place is so unique, it deserves a long run here. Great place."], ["Cari M.", "The food was phenomenal and service amazing! I couldn't stop ordering. I should just ask for one of each item haha! The artichoke tapas was my favorite, definitely coming back soon!"], ["Jeff M.", "First time at El Pulpo tonight. A little nervous when we walked in. The exterior and lack of parking leave a lot to be desired, and only two other tables when we walked in. Always makes me nervous when a place is empty on a Friday night. We were a little early though (5:45p), and the place quickly filled up and overflowed. Also, the restaurant interior made up for the auto repair exterior. It was quaint and rustic.Overall, the meal was quite good. The only miss for us was the crab cake, which was a little mushy and bland. The scallop over a risotto cake was spectacular! Scallops were huge and perfectly cooked. The risotto cake was delicious and offered a wonderful textural contrast."], ["Chelsea O.", "I went here for dinner and overall it was very good. I particularly loved the grilled squid tapas, but the chorizo and fig tapas and paradilla were very good as well. Definitely somewhere I would come back to and would love to try more of the tapas."], ["Merideth A.", "Consistently great quality food and service in a nice package. We are never disappointed after coming here; favorite CT restaur for fine dining, hands-down."], ["Desiree D.", "I cannot WAIT to go back to El Pulpo. I was amazed by the simplicity of the dishes, yet they all were bursting with such flavor. I started with the Spanish Sausage soup (amazing) and the pork tenderloin tapas were delicious. They serve you a small dish of olives and EVOO and hot, fresh bread that you can dip. After that, they serve the lunch which I ordered Penne con Pollo y chirizo and it was beyond good. My mother ordered the lamb inside of red peppers and said it was also amazing. The service was great, very polite and they always checked on us to make sure we were having a good experience. After hearing so many people rant and rave about El Pulpo, we had to try it ourselves!!!!!! I cannot wait to go back for dinner!!! Also, the Flan and Crema de Catalina for dessert were both so nicely prepared (visually) and were creamy and light. Do not miss this place!!! ***Additional note: It is a small place, and would be quite easy to drive by, it is directly across from \"Saints\" the hotdog place!!!****A++++++++++++++++"], ["Ray M.", "We've been coming here since they opened.  Never disappointed. Fresh innovative Spanish with a continental flair. Love this place."], ["Adriano M.", "Decided to try El Pulpo even though I must have driven past this place a million time but never thought it would be so good. Let's clear things up this is not a 5 star restaurant and not because of the food because the food is VERY good.  But when you give out 5 stars you need to have the whole package food, service, ambience and location. This place lacks a couple of these requirements.  Let's start from the beginning the bread is warm crusty with soft center and the olive oil on the table is high quality Spanish extra virgin, let me say when restaurants offer good bread and olive oil you know your in for a treat. The tapas... Tried the baked goat cheese in marinara sauce excellent!...then the grilled baby squid even better. Then on to the entrees, tried the wild salmon with squid inked rice and fresh veggies... Outstanding! Then penne chorizo and chicken in a cream red sauce very good. I honestly did not have room for desert but they looked delicious.  I will say this...you will like the food even more when you get the bill, I can't imagine the prices will remain this reasonable for this quality food so you better call for a table quick.  If you are looking for a romantic night out with your better half go to West Hartford center and pay double the price because you will likely not appreciate this place but if you are into enjoying a fun night out with friends and have a nice meal you will not be disappointed. I will be back soon to try the many other Spanish dishes..."], ["Bobby V.", "Bottom line is the service, creativeness, quality, taste are exceptional....The interior is comfortable, but it isn't a smoke and mirror NYC post modern eatery, just an enjoyable , quaint establishment to enjoy a fine meal...."], ["Mentael M.", "Not sure what night all these people went but I wasn't as pleased. The food looks a lot better than it taste but on the plus side the bartender made a great concoction"], ["Denise N.", "What an absolute treat.Stopped in here tonight with the mamadukes.  I've wanted to come for a long time, after reading so many positive reviews, and i'm now happy to add mine to the mix.The decor is simple elegance.  Earth tones and neutrals are well-utilized, along with soft lighting.  We were seated at a table set for two that, in another restaurant, would have been set for four.  I was really pleased with that.  Considering the food here is meant to be shared, and is generally served more than one dish at a time, i appreciated that there was ample room for everything.  Not once did we feel cramped.  I'd also like to add that our plates (and silverware, if necessary) were replaced with each round of dishes.  Now, i'm not picky or fancy- i would never ask for that, but the fact that it came standard definitely impressed me.  On to the food:Om nom.  Everything was delish.  The tables are decked with their own vessel of olive oil (soooo good) perfect for sopping with the warm bread that is offered.  This is served by the piece, as you're seated, and then throughout the meal.  It might be more efficient to just serve a bread basket, but i can understand their wanting to provide the bread on an as-needed basis.  You're definitely welcome to as much as you'd like, i just hate to have to ask.  That's just a personal thing on my part, not a dig on the restaurant. I suggest you keep asking, because every dish we had had yummy sauces and juices that i just didn't want to leave behind.Service was wonderfully polite and attentive, though never once was intrusive.  I haven't felt this well taken care of in a long time.  I also get the feeling that, if this was your very first time eating tapas ever, the staff would go out of their way to patiently explain everything, ensure you understood, and then made for certain you had an exceptional experience.  I can't emphasize enough the amount of care and attention to detail.I'll spare you my butchering of the Spanish names of the dishes we had and, instead, just describe what we ate.1) Considering the name of the restaurant, i was determined to order squid.  I was torn between a special that was stuffed with shrimp, sole, and squid ink sauce, or the classic grilled variety on the regular menu.  I chose the mainstay, and it arrived at our table sizzling, roughly 2 minutes after it was ordered- literally.  This is some of the best i've ever had.  It wasn't actually grilled, but the meat was tender, delicate, and juicy.  I would come back for this alone.  It was also a good portion: 3 baby squids along with 3 bodies.  I was very pleased.2) Chorizo with figs and beans.  While this was yummy, it wasn't particularly great.  I'd certainly eat it again, but the sauce was so sweet and tangy that it overpowered the flavor of the chorizo.  To be honest, i was reminded of hot dogs while eating it.  And the figs and beans were not quite... present.  Perhaps they were pureed to make the sauce?  Like i said, i'd eat it again, but it wasn't the most successful dish of the night.3) Baked goat cheese.  Holy moses this was fantastic.  It's served with some herbed toast and, when that was gone, i literally ate the rest with a spoon.  The cheese was herbed and baked in a pool of tomato sauce, both of which possessed enormous flavor.  Truly divine.4) Artichoke hearts.  These were lovely.  They're billed as 'fried' on the menu, but were really just sauteed in a rich (without being heavy) lemon sauce, studded with sauteed peppers, onions, garlic, and capers.  This dish was light, bright, and a wonderful example of how satisfying vegetables can be.5) While the pace of the first two courses was perfect, we did wait, quite a bit, for the third.  Not sure what happened, but it was seriously delicious when it arrived.  We had pork loin medallions served on crostini, with melty tetilla cheese and pequillo peppers.  These were perfectly cooked and garnished with balsamic, as well as some herb oils.  I personally would have liked some heat in this dish, but for the general population, it's perfect as is.For 5 dishes plus 1 glass of sangria and 2 glasses of wine, the bill was a little more than $60 ($75 with tax and tip).  So, this is not a place for a cheap night out.  You're going to need a little cash to get the full experience, but it is absolutely worth it.In addition to tapas, they do have large plates, but they run in the $16 to $20-something range.  That's not affordable for me right now, but i think this place is probably best experienced through its tapas, anyway.  Service was superb, and i will definitely be back.  In addition to the dining room, there is also a small bar area with a bartop, as well as some high top tables.  The place was comfortably busy when we went, and was host to some who were clearly regular patrons.I wish this place the best.  They have delicious food, wonderful atmosphere, and deserve the following they already seem to already have."], ["Anuj S.", "Look, the place looks very impressive and the service was also fine.  Things started out fine with nice warm rolls and so forth.For an appetizer we ordered some goat cheese with tomato sauce and bread.  It was good.  I think they should kind of offer more bread with it.  Even for the dinner rolls, they bring out like one per person.  Maybe I'm just spoiled, but I would just expect them to bring out a small basket with a few rolls in it.Now for the main entree, I was pleased that they offered to make me a veggie paella, even though there was pretty much nothing vegetarian on the menu.  I don't know why people avoid vegetarian menu items.  Anyway so I ordered that and it was pretty meh... I'd never had paella before, but according to my friend the rice was supposed to be kind of crispy at the bottom?  I don't know if that would be crispy or burnt rice, but either way, this paella was just OK.  Not too flavorful.  Pretty much bland.I thought what really made it strange was we shared this molten lava cake, and it wasn't even like cake.  It was like this plasticy shell with chocolate syrup inside.  Kind of weird to each it that way.  Definitely not what it's supposed to be.  They did bring out a complimentary apple-something salad.  It was just OK."], ["N J.", "After many years of visiting family in this area and eating so many \"so so\" meals in Southington, we decided it was time to consult Yelp! I'm so glad we did. My family drives past this place all the time and they have never noticed this place...believe me...you wouldn't either. Amongst the car repair shops, sits this little gem. It is very reasonably priced, especially a glass of wine. We didn't have any apps, though I'm sure they are amazing. Our entrees included scallops, paella, skirt steak and a duck dish. Everyone was amazed with their meals. Flavorful, satisfying and perfect proportions. We finished with a few desserts, which we equally delicious. This place is an absolute must go! My aunt has plans to bring friends here next week!!!"], ["Stefanie J.", "WOW. A total hidden gem, people. We had a fabulous feast of really great tapas - one dish after another was awesome. Heading back here for my bday! :D"], ["Katherine L.", "We have been driving by this restaurant watching the renovations with anticipation! We stopped by today and it was everything that we hoped for and more. The food was incredible. I had the most exquisite seafood risotto and my friend had the Steak a la Parrilla-we were both in heaven! The owner brought out a delicious complimentary appetizer, Lomo de Serdo, medallions of roasted pork tenderloin with Tetilla cheese and Piquillo pepper. Loving the food so much, we tried dessert. The orange flan I had was delicious.Both the owner and the waitress were extremely pleasant and attentive and the decor was inviting. The restaurant has applied for a liquor license, but in the meantime you can bring your own bottle.All in all, this was a first class experience. We would love to see El Pulpo become established! Try it, it is well worth it!"], ["Maria M.", "Great from start to finish.  We were greeted and given ice cold water.  Also, we got a little mini bowl of olives.  Then we ordered the goat cheese with marinara sauce as an appetizer as well as one of their special appetizers of the day; duck confit with cranberry sauce and sweet potato.  The duck was exceptional!  For entrees; I had a fettucine mariscos and it was great.  My boyfriend had the scallop dish (i forget the name) but there is an uploaded picture of it with a photo.  Then we had dessert! CREME BRULEE!!! AHHH! it was amazing.  love this place."], ["Kelly S.", "WOW! El Pulpo is phenomenal! The outer appearance is deceiving but once you step inside, you will be blown away. The decor is beautiful and the service is friendly and attentive. My table shared a bunch of tapas, entrees, and desserts. Everything was extremely flavorful and beautifully plated. We were completely satisfied with every item.  The manager was even kind enough to offer us a complimentary appetizer as well as shots of sambuca for the table!El Pulpo is a hidden gem and we will return VERY SOON!"], ["Tom M.", "You gotta try this place!  The food is nothing like I've tasted in restaurants in the area and I will definitely be back to try other dishes. The inside of the restaurant is beautiful compared to the bakery that was there before.  Like some of the other reviews said, the staff and the owner are great!  I received a complementary catfish croquettes (I think thats what they were) and they were awesome!  For my next app I had the baked goat cheese with marinara - yummy!!  Then for my meal I had the seafood risotto special (don't remember the name) - it was great!  I just had to have desert after the owner brought out the desert plate, even though I was stuffed, so I tried the orange flan.There was very little advertisement of the restaurant - I was hoping to see a website pop up online or even some articles in the local paper.  In the meantime - they'll get some great word of mouth advertisement from me!EDIT: One thing I forgot - presentation of the food was top notch - they did a great job showing it off!"], ["Trisha R.", "Channeling back to my Spanish II course in college, I saw \"El Pulpo\" and immediately got excited! While my husband is a huge octopus lover, I usually pass on the chewy rubber sashimi in the sushi joints, but THIS is the type of octopus i get excited about. Freshly grilled/charred and tender and mild, and El Pulpo delivered just that! Go with any of their octopus dishes and I am sure you wont be dissapointed.We ordered a couple tapas and shared a seafood paella. Before any of them came out we were greeted with a very warm crusty roll and olive oil, as well as a small olive salad to pick at. One of the tapas was the octopus salad, and yes I would order the octopus by bucket if i could. We also ordered toasted bread with pork tenderloin, piquillo peppers and cheese which was delicious. Even on toasty bread we could eat these in a civilized manner with a knife and fork because everything was nice and tender. We also received a bonus dish on the house (i think since we expressed a love for chorizo) which was some squid ink rice with chorizo and calamari. My husband laughed at me for about 5 minutes because somehow I aquired a squid ink mustache... messy but tasty :)Entree size of the paella was perfect for us sharing after our tapas samplings. Very generous for a single portion to boot, and for $20-25 it is quite reasonable considering ours came with a half lobster and lots of seafood. I was also quite happy the shrimp came with their heads still in tact (since they add a lot of flavor) You can tell this place is kinda paving its own way in the Southington area as there is not much to compare it to. The owner/staff are very attentive to the needs of the customers and seem to be open to adapt to the clientele which is nice.I get really happy when i find gems like this close to home, and I try to do everything I can to make sure everyone else knows so our community doesn't miss out on a great find! My one little bit of criticism... no fresh cracked black pepper on the table, anddd  the logo outside the restaurant. It totally does not lend itself to the vibe they seemed to work so hard to create. I am more than happy to design a new one if it helps to insure Southington will no longer ever go without fresh grilled octopus :)"], ["L L.", "Honestly I was crestfallen after my experience at El Pulpo.  The reviews have hyped this place up so much that the anticipation was high.  We went on a Saturday, around 6:30.  We were seated at a table near the bar, which was fine.  Our server was the bartender, who was wonderful, and mixes a damn fine cocktail.  Where the evening falls is the food.  We ordered several plates of tapas.  They were all served at once.  This is not our first rodeo with tapas, every other place we have ever had them serves one or two plates at a time.  Our table was small, many plates at once did not work so well. None of the dishes were hot, warm but not hot.  Our biggest disappointments:Queso de Cabra - basically goat cheese in tomato sauce with 4 pieces of toast.  Too much cheese for the amount of toast.  And the flavor was just lacking, we expected something a little more complex.  Chorizo Espanol - we picked this thinking - Chorizo:good, Figs:Good, Port Wine:Good, how can it go wrong.  It did.  This dish is crazy sweet, it tastes like a pot luck dish that I make called Candied Kielbasa.  But this version has less kick.  We also had the Lomo de serdo, Calamares a la Plancha and a special that featured scallops, those were all fine.  Not amazing, but fine with the special being the best.  In the end we went in hopeful, came out deflated.  Perhaps we caught them on an off night but I'm not sure we would give it another go to find out."], ["Christopher V.", "I'd put El Pulpo in the top 5 of my favorite restaurants right now.  Their food is delightful and their service is amazing.  The owner is ALWAYS there making sure everything is running properly.  Try anything on the menu and prepare to be wowed with flavor and presentation that is unsurpassed in the area. I'd recommend a few tapas of your choice, a ceviche if possible, the lamb chops, a few sangrias and then the creme brûlée if you have room.  Enjoy!"], ["sunshine l.", "On the way back from hiking we found this restaurant on yelp with good review so we figure we will stop by and try the food. It turns out we love the food very much...not only I love how every dish plated but also the food taste delicious and have to mention the great service!!! Thanks for the great experience and we will definite come back to try different dishes :)"], ["Ben B.", "This is the best restaurant in and around Southington, CT.  Period.  The staff are polite and courteous, the atmosphere (inside) is inviting, and the food is absolutely out of this world!  My fiancee and I were hooked after our first experience.  We've been there three times since.  Trip number 5 comes in two weeks.  I'm not only looking forward to that trip, but to the other countless trips we'll make after it as well.  Putting it simply, we'd live there, if we could.  It's that good.We've found we prefer the tapas plates more.  There have been one or two dishes which we liked less than others.  For example, the rabbit stuffed peppers are prepared well, but didn't do anything for us.  However, the kitchen staff is so talented, they can take more average, basic ingredients and make magic happen.  The oyster appetizer we had on our last visit consisted of your standard restaurant oyster on the half shell.  The treatment of the oysters though made all the difference.  Plainly stated:  the single best oyster plate I've ever had... no contest!  Even with the plates we didn't like as much as others, nothing we've had has ever even approached leaving a sour taste in our mouths (no pun intended).If you go with one other person, I suggest eating to the bar.  More than three, get a table (to be courteous to other diners... bar space is limited).  if you do want a table, make sure to get a reservation.  As new as they are, word has gotten out.Rightfully so.Overall rating:  A+.  This is one of the best restaurant experiences I've ever had.Noteworthy insight:  the menu is full of seafood, particularly shellfish.  My fiancee and I love this, but it's not for everyone.  We have close friends who are Jewish and abide by the dietary code.  As much as we want to share this place with them, the menu can be limited in this regard.However... if that's the only \"knock\" on a restaurant, it's doing just fine!"], ["Angelo P.", "We ordered takeout after a long Friday before labor day. We had family over and decided to order a little bit of everything on the menu. Everything was fantastic!! The rice in the paella was perfectly cooked. The fish, clams, muscles, and lobster were high quality. I rank this restaurants food among the best seafood restaurants in the area. Thank you for making our night!"], ["Catherine G.", "This restaurant is truly a gem. My boyfriend and I went here for a date night and had a delicious meal. Unfortunately, because there were limited non-seafood choices, and he is allergic,  he doesn't want to go back. Can you say \"girls night?\" I got a glass of red sangria, which was the best I've ever had. The waitress gave us a little dish of marinated olives, which complimented the drink. We ordered a baked herbed cheese tapa to start, which was covered in a a light tomato sauce. On the fresh bread provided, it was amazing, just bursting with flavor. I ordered the paella, which did not have the signature crust on the bottom, but was still spiced and cooked well. For dessert, we got the orange flan, which was a wonderful treat. I was satisfied and felt amazing, a sign that a meal isn't just nourishment but a \"spiritual\" experience that I think only the Mediterranean cultures can pull off so perfectly. My only complaint was that the waitress waited forever to bring us our bill. The manager/owner came to check on us, and I think he could tell I was annoyed because I was immediately like \"Everything is great. Can we get the bill though?\" Our waitress came back looking like he might have yelled at her a bit. Sorry to get you in trouble, sweetie, but we'd been waiting for the check for almost half an hour. Not sure why we were forgotten, but not even that could taint the experience because of how amazing the food was.Also, if you want a multi-course meal, with booze, be prepared to spend some money. Our bill, with tip, was about $75. A little more than I'd planned on spending, but the food was worth it. I will be back."], ["Katy L.", "I brought my boyfriend here a couple of weeks ago. I drive by the place amost every day.  It was so worth the wait. It was absoluately amazing food.  Enjoyed the freshness of the menu and ingredent as well atmosphere. The place is a little small so sitting is a little hard if  you brought a bigger group.  However a great place for 2 or 4 in a group, possible 6!"], ["Kristen M.", "I have been hearing amazing things about this little place which is tucked into a nondescript and kind of ugly strip mall on the Plainville/Southington line across from Saints. Had I been just driving by it is likely I would never think about stopping in, but after such good reviews on Yelp and from colleagues I figured I better give it a try. My friend and I, both lovers of Spanish food and wine came in on a Friday night around 645pm. It was busy, but we were seated right away at a cozy table. This place is small and when it is busy it can feel cramped, but in a good and lively way. The tiny bar was fully seated and by the time we ordered a bottle of wine (a really decent pinot noir for $21.) the restaurant was totally full. First, let me say that the service is superb, attentive, and friendly. We were almost immediately presented with a little bowl of delicious Spanish olives in a decadent oil and herb mixture. Shortly after that a waiter came by with a large piece of bread which was easily cut into tree pieces for each of us. The bread was hot and fresh and out of this world! My friend and I decided on five small plates to share. We had the shrimp on a savory chickpea mash, the chorizo and figs (omg), the octopus for which the restaurant is named, a glorious baked goat cheese, and the mussels in a sauce that required asking for a bit more bread because it would have been shameful not to sop it all up! The food was beautifully and thoughtfully served and presented and let me just say it was incredible. Fresh, light, and delicious. My guest and I have both traveled in Spain and felt this restaurant to be one of the most authentic tapas places we have tried in the States. And by the way, all this food, including the bottle of wine came to just over $70.00 to split! We were too stuffed for dessert, but the tray the waitress brought over had a beautiful variety of sweet treats! I cannot wait to take my husband and other friends here. Cheers to a great little spot in a weird little plaza!"], ["Rachel W.", "El Pulpo is a treasure hidden in the rough of Southington's Queen Street area.  The food is fresh, vibrant and obviously made with passion and great attention to detail. While El Pulpo has mostly seafood tapas and entrees to offer you, there are also wonderful options for the non-seafood eaters like me.  The roasted, free-range chicken with sauteed spinach and white rice, which is placed gently on a plate with a delicate wine sauce and white beans, is so good that I am a wee bit obsessed with it.  Maybe more than a wee bit.The service is excellent, the atmosphere inside the restaurant is romantic, the drinks are delicious (surprisingly, one of the best margaritas that I've ever had I had there) and there are a number of Spanish/Argentinian/Chilean/etc. bottles of wine to pair with your meal.If only I were there right now..."], ["Dom P.", "Great place ha diamond in the ruff can't wait to go back real food authentic Spanish food (Spain)"], ["Haili P.", "I had originally liked this restaurant. While the service was pretty slow, the food was delicious.However, I recently tried to go here again. As we entered the restaurant, it was completely empty. I asked for a table and was denied. The hostess didn't even look at her books or try to accomodate us in ANY way (including not offering the bar). I'm not sure what the problem was since there was absolutely no one in the restaurant.I won't go back because I feel mistreated. I don't know if they didn't like the \"looks\" of us or why or money wasn't good enough for them. Too bad, thought it was going to be one of my frequented spots around town..."], ["Yi Ting C.", "AMAZING and fresh food! Who would've thought that this little inconspicuous restaurant would be so inviting and elegant inside? The service was impeccable and the wait staff were very attentive. We were provided with warm, toasty bread and a complimentary shrimp appetizer that was delicious. I tried the seafood paella, which was good. I had the special beet salad tapa and the warm octopus tapa and they were both fresh and delicious. I don't know what else is around the area but I definitely want to come back to try other dishes and drinks."], ["Stephanie C.", "This place is doing everything right.  The food is absolutely outstanding.  The service is impeccable, and the wine list is really diverse.  I have been twice.  Once for the traditional menu and once for a wine dinner that a local shop was hosting.  I would recommend sharing a number of the great tapas to start.  Take your time with the menu.  This is the type of place that you can sit in for a couple hours and you would not get bored.  Sure the location is random but so is Somewhere in Bangkok.  Clearly Southington has a knack for hosting really great restaurants in really obscure places.  Do not let that cloud your expectations or experience.  Just go for the food - you will not be disappointed."], ["Taryn M.", "Never judge a book by its cover. Case in point: El Pulpo. The restaurant is smack dab in the middle of a half abandoned strip mall and looks unimpressive, but walk inside and be surprised.It's really obvious that a lot of time and love was invested into opening this restaurant. The interior looks completely brand new and the dining room is very elegantly decorated. The owner of the restaurant himself waited on us, and he really went above and beyond. He was pleasant and humble, and generously offered a free octopus salad appetizer and two glasses of red wine, compliments of the house. The octopus salad was delicious, easily the best dish of the night.We ordered a baked goat cheese appetizer, melty chevre swimming in marinara sauce, with toast for dipping. We devoured it in minutes flat. My boyfriend loved his seafood stew entree, and I ordered a penne dish that was pretty good, but after the delicious salad, I did regret not ordering the octopus special that the owner had seemed really excited about.Southington is quickly becoming a hotbed of culture, and El Pulpo proves to be a very welcome addition!"], ["Audrey F.", "Wanted delicious tapas again. Hmmm, what is close? Nothing besides El Pulpo. So we were pleasantly surprised when we arrived to see a parking lot full of cars on a Friday night. And about a month into service, that is a super sign!We were brought to our seats by the same waitress as last time. I didn't get a hint that she remembered us even though we were one of their first customers. That was over a month ago so I didn't expect her to.Luckily, now they have their liquor license and credit card machine.This time we stuck to one app. We ordered the chorizo with figs sauce. I wanted to try it. It came in a sizzling clay dish. Very good but a bit on the sweet side for my hubby.Ah the waitress came back and recognized us this time. We exchanged some pleasantries.Here is the surprise: the owner came by and greeted us. He put down a complementary app and said he hoped that this time the octopus salad is made to my liking. How did he know I didn't care for it last time?! I didn't say anything to him or the waitress....oh wait, \"YOU READ MY REVIEW ON YELP!\" I exclaimed. He excused that the sous chef cooked it incorrectly last time because the head chef stepped outside.This time there was no mistake the octopus was \"a la plancha\"! Grilled nicely with some char marks and looked liked grilled slabs of cheese (except with rows of tentacles). It tasted tender (as tender as octopus meat goes), not rubbery at all. Close to the dish I had in Barcelona, Spain. My poor hubby was eyeing my plate. He has fish, cephalopod, and bivalves allergies. Not most shellfish, oddly enough. He spared me the lecture this time on the intelligence of the octopus and I felt his eyes glued on my dish. Uh I thought he had an allergy to squid and he loved octopi too much to eat them. Well, maybe they looked so much like cheese, this cheese lover had to have one to make sure it wasn't a piece of cheese. I gave him the smallest piece, and thank goodness he didnt have a throat closing moment. Last thing I wanted to do was go to the hospital during my favorite meal. After a couple of minutes, I saw a fork come across the table to nab the last whole chunk of octopus. Needless to say he had a slight itchy throat and tongue, but no epipen tales that night. He survived to enjoy the risotto cakes in his scallops entree and I really enjoyed my seafood broth. Something in his sauce made his the winning dish. Our two large profiteroles with vanilla ice cream were good. How generous for only $5!They always say never as good as the first time. Never say never. Hope we become regular diners because their food and service is the best!"], ["Kristin N.", "I wasn't going to review this place because some time has passed since we dined here, and I can't remember exactly what we all ordered.  But stumbling upon these reviews again, I needed to give my opinion - it's not THAT amazing.  People should not get their hopes up before they come here for the first time.  Yes, it is unassuming from the outside, and nicely decorated on the inside.  However, the chipped paint on the wall by our table gave some indication that it already needed upkeep.  And yes, the plates are presented well.  However, you shouldn't equate presentation with actual taste.  As far as actual taste went for us, we all left saying \"well, I guess that was pretty good.\"  We ordered both tapas and main dishes, and all were tasty, but not the \"omg this literally the best thing i have ever experienced in my life\" type of dishes I was expecting.  Most of dishes were creative, but it was like they were trying too hard instead of working with the natural flavors of different food to make them come together.Overall, it was a fine experience.  We came on a Saturday night around 9pm, and after the one other table left, it was awkwardly quiet in that big space.  For being the only ordering table, the food came out relatively slowly, and the wait staff was slow to refill our glasses of water; not so much that it was unbearable, but we certainly did not receive the first class treatment that other reviewers seemed to experience.  It almost felt like we were crashing someone's party, and everyone was staring at us, waiting for us to leave.  I won't rush back to eat here, but I wouldn't mind returning."], ["John R.", "My husband and I had the good fortune to live in Spain for four years and the even better fortune to discover El Pulpo Restaurant & Tapas Bar in our very own town.  It is a charming restaurant in the most unlikely of locations in a small commercial strip along Route 10 on the Southington/Plainville line.  It is reasonably priced, has a varied menu, and to date, servers who are warm, friendly, and try their best to please. At busy times, you may need to be patient as good food takes time to prepare.  While we can't yet say we have tried everything on the menu, we can state that after five visits, and a desire to always try something new, we have sampled many soups, salads, tapas, entrees, desserts, cafe con leche, and of course sangria, both red and white.  All of our choices have been consistently delicious and presented in a very artful way. One of our most favorite paellas, the paella negra (black paella made with squid ink, seafood, rice, and a small bit of sherry giving the dish just the right hint of sweetness) is available at lunch only.  When we had it today, it did not disappoint and for a brief moment we both felt transported to our former home in Salamanca, north of Madrid. What a treat and how lucky are we to experience this great dish along with many others without ever having to board an airplane! El Pulpo's chef trained in Madrid for five years and it shows.Fortunately for us we made our visits before reading any other reviews.  Most were very complimentary but a few were really very unfair and in some cases, false.  One reviewer complained that on a busy Friday night without a reservation she was put out that no one explained the menu.  Each menu entry is clearly translated to English, and one has to wonder why she didn't feel like she could ask her busy server for further clarification if needed.  Likewise this same person also complained that a member of her party ordered a dish containing fish (as stated in English on the menu)  and when it was discovered the dish contained salmon, the diner stated they had an allergy to salmon.  Isn't salmon considered fish? Another person complained that they only received one roll instead of a whole basketful.  I know in America we are accustomed to certain niceties (like baskets full of rolls and bread), but this is not typical in Spain.  In addition, why don't patrons ask for more rolls if they would like more?  Lastly, someone complained about noticing some chipped paint on the wall of the dining room where the chair was being pulled in and out.  Honestly, we never noticed!  The dining room is clean, cozy, and much like one you would find in Spain.  We have been too busy enjoying the great food to notice anything else.If you want really great authentic Spanish tapas and meals we highly recommend El Pulpo.  You won't be disappointed!  Buen Provecho.John and Wendy R."], ["Nisha S.", "I would like to start off by saying I was really looking forward to this restaurant. After reading the reviews, perhaps my expectations were too high.Upon walking in on a Friday evening we were greeted by...no one. There seemed to be no hostess, only a waitress that completely ignored us. Yes, the restaurant was busy but it takes a second to acknowledge a patron and she walked by 3 times, even bumped into me. I finally walked into the bar to request a table. After being seated we waited another 20 minutes to place an order. Again it was busy, so that excuses the wait but there was no explanation of dishes,no charisma when they finally did take our order and a clear sign of disappointment when we declined to get alcohol.  It would have been nice to have suggestions as it was our first time there and the menu is a bit overwhelming. Now for the food. Being a foodie I expected to be satisfied at least with the cuisine as the pictures looked amazing. We started with the Croquetas de Bacalo (cod fish fritters). The presentation was excellent and the Croquetas were tasty. We were also served an assortment of olives which were fantastic and bread which was cold and crusty. Instead of ordering a variety of tapas we decided to order 3 main dishes. Vieiras al la Plancha- Pictured on their website and reviews this dish consisted of fontina cheese risotto topped with seared scallops and lobster in a champagne sauce. It did not live up to its image. The scallops were plentiful and seared to perfection. The lobster was very minuscule and 1 out of the 3 \"chunks\" of lobster meat was terribly over cooked. The risotto was the biggest disappointment; there was no creamy consistency or trace of champagne sauce. The top \"layer\" of the risotto was actually burnt and crusty and it essentially was a serving of cheesy sticky rice which had no flavor consistency and was too over cooked to be helped by the heaping of sauce on the plate. If anyone would have bothered to check in on us I would have sent it back. Cazuela de Mariscos- This dish was a Mediterranean seafood stew with fish, scallops, squid, and mussels over roasted potatoes in a seafood sauce. Unfortunately, the fish was salmon and the person who ordered it is very allergic to salmon. Now if the waiter took anytime to explain the dish this mistake could have been avoided; since it was not, an additional wait to our meal was created. Once served, the dish was certainly not a stew but filled with well cooked seafood in a mildly flavored seafood tomato broth.Fettuccine de Mariscos- Fettuccine with lobster, baby scallops, shrimps, mussels, garlic shallots, and sun dried tomato sauce. For a place that totes culinary excellence it was expected to have fresh fettuccine. The portion was decent and the amount of seafood adequate. This dish had no faults except there was nothing impressive about it.Cut to the chase: The service: amazingly unexceptional. The food: the artful, creative, technique taken in presentation does not carry to the cuisine itself. I would have been inclined to come again to try the food if the service had not been so poor."], ["Gloria B.", "Heard 2 good reviews, so we decided to try it.  Sat at the bar, and ordered 3 tapas and 2 El Patron margaritas.  Pleasantly surprised.  The food was delicious and the drinks even better.  We will be back with family next.  Wish they had a better location in downtown Southington.  Great job.  Wish them well!"], ["Karen T.", "So, we returned and again had a fabulous experience...this time, however, instead of being the only ones in the restaurant it was completely packed...which is wonderful and so well-deserved for the owner! They now have their liquor license as well.Food is just amazing...period. We had the lamb ravioli special which was tender and melt in your mouth, along with the codfish croquetes which were complemented with an amazing aioli. I wanted to try this touted octopus salad, but my husband couldn't be convinced (next time!)  For the entree, we split the viernes a las planchas which was packedwith seafood over a creamy risotto...we were mistakenly brought the salmon initially, and for this they ended up having us enjoy on the house. The orange flan was a perfect end to the meal. I am the type of person who loves trying new restaurants; however, this is the one place that I could return to again and again and be very happy!"], ["Stacey M.", "I was dining by myself and the waitress, owner, and chef stopped by to talk to me. I tried a few different things with the intention of having leftovers for my family to enjoy. I tried an octopus and potato dish recommended by the owner that wasn't on the menu and was very surprised. The texture of the octopus was very tender and the flavor was amazing. The Paella was so tasty and colorful and the shrimp and chickpea puree complemented each other perfectly. My family loved the leftovers and I will be back with the entire family."], ["AJ C.", "Totally dig the whole tapas thing, wanna start off by saying the food was very good, well prepared, and fresh, all in all a good experience. I will definately be coming back.                We ordered just about everything on their tapas menu, and a few specials.The dishes were of proper proportion which is always a good thing, but most important they were all delicious. My favorite was the lobster spring roll it was out of this world. The roll was hot and crispy with chunks of lobster, and all sorts of other goodies, I also thoroughly enjoyed the artichoke plate ( I guess I really enjoyed everything on their menu).              My only minor complaint Is the small bar, and no beers on tap. I can't tell you how awesome this place would be with a few traditional Spanish beers/ microbrews on tap. It would also be nice to get some people at bar to enjoy this wonderful fare. It just seems so like the stuff you wanna enjoy with a bustling crowd of good people and conversation.       The restaurant isn't very much to look at from the road, however once inside you will totally forget where you are. Extremely nice decor, an inviting view of the kitchen and a smiling staff are what awaits you on the inside....very good My new favorite local spot!!!!!"], ["Richard P.", "Got tired of the hotel as wife worked in town so I ventured. Decor is good enough but not fancy, servers were nice, but not 5 star. Make no doubt it, the Food is excellent!!!! You can be assured the food will make you happy. Seafood done right people.... If your looking for the ritz this is not it. Looking for good food- welcome. Just a fella passing through from nyc."], ["Liaa C.", "Wow! Couldn't find a thing to complain about! We tried the pulpo (octopus) salad, mussels, artichokes, and goat cheese tapas plus the lava cake for dessert. Everything was amazing! Plus the wine was great, staff pleasant, unobtrusive and attentive. Even the coffee was great! We WILL be back... Like tomorrow!"]], "Criollisimo Restaurant": [["Katie H.", "I would never have known about this mostly-takeout restaurant if not for my friend and her Puerto Rican boyfriend. They swear by this place, so I knew I had to try it. Our first trip was a little disappointing. We went at 6:30PM, and they had run out of most of the entrees, while the food that they did have was cold from having sat out all day. My fried pork chop was overfried to the point where the meat was chewy and tough. Still, what I tasted had a lot of potential flavor-wise,  and my friend said that they were much better for lunch, so I knew I had to give them another chance. I went back last Thursday around 11:30AM, and what a difference it made! This time they were fully stocked, and I had no trouble ordering my pernil y arroz con gandules. The pernil was wonderful. It's tender, flavorful, and has just the right amount of heavenly crispy skin mixed in. The arroz con gandules was also delicious. I go nuts for arroz con gandules, and this did not disappoint. For $8, I got a takeout box packed with pork and rice. It didn't look like a lot at first, but I was full after eating half a box, and it easily made 2 meals.  Just a few complaints: The food is really greasy. Yes, no one expects Puerto Rican food to be diet food, but both times I ate here, my food was sitting in a pool of oil and my lips were coated with grease. Second, I wish they did a real dinner service instead of just selling leftover food from lunch. The food I had the first time wasn't awful; it just needed to be fresher or at least warm. Third, make more pernil! It was my favorite item there, and they sold out so quickly. All that aside, the next time I have a craving for Puerto Rican food, I will definitely be back."], ["Florencio A.", "The best pernil and arroz con gandules you can have. Everything from there potatoe balls to there empanadas are delicious. Just like homemade. The restaurant is very clean and well maintained."], ["Nyokabi W.", "Got takeout- the chicken was really good, moist and the ribs are banging, meaty and well seasoned. The rice was also really good but the Spanish people I was with said it was okay. I would lean more towards  their opinion over mine."], ["Foodietiando F.", "Great puerto rican food, awesome rice and beans, ribs, everything that I ate was excellent! De seguro regreso!"], ["Jessie H.", "Service was really bad. I felt like the woman behind the counter didn't want to speak to me at all. She looked like it was a big deal that I wanted two meals to go. The good wasn't even that great. Not better than anything in hartford."], ["Geoff R.", "Best Spanish food in town. When ever I'm in new Britian I do everything I can to get over here. The portions are HUGE!!! If you get lunch here you have dinner too! My son will wait for the empanadas if there are none ready. If you like good spainsh good and you are in the area a stop here is required."], ["Armando S.", "Good Latin food"], ["Louise B.", "I am going to give this place another shot."], ["Mario M.", "Solid Puerto Rican. Best rice and pigeon peas. Fall-off-the-bone ribs. Clean establishment. Fresh food. Twenty years says a lot."], ["A D.", "They sell average puertorrican food and the customer service was awful.  The restaurant was open, but the food was almost sold out and they were not willing to prepare anything else for us, not even  fry a beef patty."], ["Thomas L.", "Nice place to stop for lunch. There seems to be a interesting history to the place. Food can be hit or miss sometimes."], ["To T.", "Love this place. Go here all the time."]], "Barcelona West Hartford": [["Julie M.", "Barcelona is one of the first places I visited when I started going out in West Hartford center years ago. It has continued to be one of my favorites. The interior is decorated perfectly and has such a great vibe. I've spent many a nights there for dinner, dancing, or speciality group dinners. Every visit is beyond my expectations and I leave happy. I went to a wine dinner a couple of years ago and loved it. I have always wanted to take a cooking or cocktail class that is offered on a regular basis. A standard gem in the Center."], ["Ziyan Z.", "Their food is very greasy and salty. Drinks are also too overpriced. The waitress forced us to take their \"35$ per person tapas deal\", even though we said we wanted to do individual orders. When checking out, we got charged for more people than who actually were in the group deal. It ended up costing me 60+$ instead of 20$ if I did my individual order. Never going back there again."], ["Jena G.", "Woooooooow!! Is Barcelona something to rave about. I came here on a double date on a Saturday night around 9:00. We had a reservation for 8:30 but one of us was running late so we called ahead of time and they were perfectly accommodating. Once we got here we were seated immediately. An impressive feat seeing as the foyer was crowded with a dozen people just hoping to find a table. Once seated, our server took our drink orders. I started with a glass of cava which was inexpensive but good. (Pretty hard to find a bad bubbly, amiright?) It took a long time to be served, however, and we had to remind our server that we put a drink order in. It also took about 25 minutes just to have her take our order. Let me reiterate the fact that this place was bumpin' and filled to max capacity. To start, we ordered the calamari which was incredible. It's so ridiculously tender and likely the best calamari I've ever encountered. I'm also the octopus queen and have travelled far and wide to find a decent calamari, so that's that. We also had the sobrasada which was interesting and not like a typical sopressata I'm used to. It was extremely soft and spreadable,  and orange in color but still good. We paired it with a mild cows milk cheese which was decent. We also had the patatas bravas which were cooked to a crisp perfection but wayyy too over-seasoned with paprika. We couldn't touch some of those delicious wedges as they were suffocated in spices. Since this place was super busy, our food took forever to come out. I'll admit it, we were all a little antsy. Just as I was starting to formulate a bad opinion about this place for their inefficiency our server brought out our food with some complimentary brussel sprouts and cheesy croquettes. Both were savory but I've gotta show some love for those brussel sprouts. I could go on for DAYSSS about 'em. They were so good I even ordered them again. Meaning, out of choice. They're roasted and crisped in some sort of oil and tossed in salt. It's such a simple dish but they are absolutely delicious. Even if you've loathed brussel sprouts since your mom force fed them to you as a kid (hello) you're gonna love these babies. Take it from me. Since we were still hungry I put in another  order for a drink while everyone else dined. I have a thing for exotic and inventive drinks so I went out on a limb and got a Pimm-enton. It's got Pimm's, gin, cucumber, mint, lime, and ginger beer. There was also some diced red veggie in it that I can't quite place. Like I said, the drink was potent. ;) Absolutely refreshing and so sooooo yummy. A raving success! I usually discuss ambience first but this place was so on point I've gotta save best for last. Not only is Barcelona an unreal dinner spot, it's also got A+ ambience. The art on the wall is interesting and the mirrors throughout give it a very nuance speakeasy feel. The music was so trendy and trance-y; it wasn't overbearing but it was noticeable enough that after our second drink all four of us were moving and grooving. Since Barcelona had its own DJ and is open until 2 am it embodies this cool trendy New York vibe after 10:30ish. The main dining room gets totally packed and I found it hard to leave after just having dinner. A definite redo!!"], ["Nicholas I.", "I'm a huge fan of tapas after spending a week in the ~actual~ Barcelona, Spain last year. ~This~ Barcelona comes very close in terms of tapas options, and all of the selections I had were fantastic!It took me longer than it should have to visit Barcelona. Typically, I wouldn't think about the place until I was already going to Bartaco. Barcelona is sort of tucked away, hidden behind Bartaco in the same building. It could be sort of difficult to notice the place unless you're actually looking for it, and perhaps that's a good thing.The inside decor is very intimate and somewhat upscale; I almost felt under-dressed in there because I had worn shorts with a nicer button down shirt.All of the tapas were fabulous and I look forward to going back again!"], ["Brian E.", "Probably the best all around meal I've had in the area since moving to CT this year. The service was excellent and the food was unforgettable. Below is a list of the tapas we enjoyed:Beef and Chicken Empanadas: super savory with a perfect flaky and doughy taste. The chicken came with this amazing guacamole and the beef empanadas came with a really good red sauce. Best empanadas I've ever had. Calamari: tender and crispy with a mild yet flavorful breading. The sauce and spritz of lemon elevated them even further. Patatas Bravas: probably the most mouthwatering and delicious fried potatoes I've ever had. Perfectly crispy on the outside and soft on the inside with this red sauce and tangy garlic aioli. I couldn't stop eating these. Hangar steak: just perfectly cooked at a medium rare. Delicious natural flavor with the beef, topped with a truffle sauce. The sauce was a bit over the top, and this is coming from someone who loves truffles. I think it may have taken away from the dish as the sauce just tasted like it was made with a cheap, white truffle olive oil. I'd recommend the sauce on the side so you can apply as much or as little as you'd like. Gambas Ajillo: a little delicious iron skillet of shrimp in a sherry sauce. The shrimp was cooked perfectly and was a nice bite before some of the mains. Fingerling potatoes: very good texture but lacked in overall flavor. The garlic was too mild. I wouldn't waste stomach space on these. Suckling pig: a special tapas they had from a pig roast they had done the night prior. The cut was big enough to serve 4 people. The chicharrón was not crispy at all as it was saturated in vinegar and other liquids. It was very tough to chew. The meat however tasted wonderful. There's nothing better than a pig roast!Heirloom tomatoes: salt, pepper, oil, that's it. Very bright and refreshing flavor. Great starter. Bread and oil: very warm crispy crust and soft interior. Oil tasted incredible."], ["Naomi R.", "Been here a few times and after going to the New Haven one last night, decided this one needed a fabulous review! Food is always amazing, timely, hot when needed to be hot and cold when should be cold. Service is always on point. Only word of advice: if you go between 4-6, don't sit by the window as there aren't any shades or blinds so it gets hot in the sun. Happy hour is AMAZING and prices are on point!"], ["Luc V.", "I've literally been here at least once a week every week since February of 2015 and I never wrote a review. I'm not one to write reviews for any restaurant which I am a regular but feel it is appropriate to write this one. Barcelona is by far my favorite restaurant in the area! A lot can be said about their service, food, and drinks list. They also do half off bottles on Sunday! I think Monday too but could be wrong but anyways...Hanger steaks, empanadas, Kim chi pork belly, gamba, and this crazy fried cabbage thing are just a few of their superb tapas to name. They have larger to share items too but their tapas are a good way to try everything in small portions. Service is nothing short of spectacular. Paris, Rebecca, Taylor, and Megan are all excellent and certainly do a wonderful job at making your dining experience consistent and entertaining. Maybe we are just a bit crazy but it is always a good time and never a dull moment. There is ONE major drawback! This draw back is so horrifying that we refuse to step foot into this restaurant on certain days! When we decide we want our weekly Barcelona fix, we will ONLY show up on Sunday evenings - Wednesday. Thursday, Friday, and especially Saturday nights are full of basics, wedges, cheap tacky Michael Kors loving creatures, foul smelling college hot shots, welfare collecting ballas, and the typical \"we only hang together\" Asian squad! It goes from exceptional restaurant experience to ...what are we in downtown Hartford? Come on ladies...grandma heels? pathetic wedges?  The same forever 21 dress ten others are wearing? Hate to say it but you ugly basics need to go back to the other side of the river. Extremely obnoxious crowd and degenerates who can't hold their liquor. They congregate around acting like fake baller and dressed like they're ready to pick up a couple basics. Overall, i still adore this restaurant! I dump hundred and hundreds of dollars into here a month and will continue to do so as long as their servers continue to be like those mentioned earlier and food remains excellent."], ["Erica K.", "My boyfriend and I were celebrating our one year anniversary so we decided to go to Barcelona. Rebecca the hostess was very nice. We had a bit of a wait so they passed out white and red sangria.The food is excellent. We ordered the speck, Manchego cheese and fuet (sausage). The speck was salty and delicious, the cheese was nutty and the sausage was perfect.The eggplant pappardelle was my favorite. It was spicy and sweet and the roasted red peppers were good. The hangar steak was cooked perfectly and came with a nice sauceWe wanted to end our night with the lobster dish,  it was lobster with toasted pasta and garlic sauce. For some reason we did not like this even though it had everything we like. We told our waitress Hilary and she offered us something different but we were too stuffed. When we got the bill, much to our surprise the lobster dish was comped. The service is wonderful, we had free champagne to celebrate our anniversary. Hilary was great and we can't wait to go back."], ["Kimberly T.", "Wine flights? Amazing tapas? Great service in a lovely atmosphere? Yes yes and yes!! Barcelona had it all on my recent trip and it's safe to say this is going to be one of my new favorites. It was crowded on Friday night, but we were seated pretty quickly. We started with a wine flight, one bubbly, one white, one red. All delicious. Our waitress had no problem letting us take our time with the experience. We munched on the complimentary warm, crusty bread and oil with the smaller first course of goat cheese we ordered. Simple and delish. We then experienced several inventive and flavorful tapas: mushroom and herbed goat cheese, spicy shrimp, and lastly chorizo in fig sauce. They were all good, but that chorizo is a must have if you like figs!! I capped off with a Barcelona Gintonic which was refreshing and fruity but not sweet. The ambiance is really something. It's lovely inside but it was too dark to take photos for this review without illuminating the entire restaurant with my flash. Sorry-- no photos. You'll have to take my word. As with every place in West Hartford get ready to pay for parking and walk to your destination along the fashionable end of Farmington Avenue. Totally worth it!"], ["Isabelle G.", "this restaurant is awesome!! the food is really good and so are the drinks. it's expensive but worth it. the waiters are also very good looking and the service is great."], ["Daisha N.", "OK. its been a while for a restaurant establishment to get a 5 star. Atmosphere, drinks, food, and service was on point!!!We had reservations and got in right away. The birthday girl came and then we ended up getting drinks right away. She ordered the sangria (white), that was a tasty drink. We then started with the beef empanadas (4 dishes): perfect and tasty (I think I'm a professional); just not much of a fan of the outside shell really.the we all ordered something big; I got the filet mignon, artichoke, and onions with truffle sauce (which was OH MY great). My friend ordered a side of asparagus and the sauce was oh sooo tasty (we need to make a bottle of that and sell it).We then got the amazing dish of tomatoes reduction in a red wine with shrimp, mussels, peas, potatoes, and more. It was pretty delicious (not over salty as most I've had). I've had this dish in Spain many times and they were pretty close.My other friend ordered the hanger steak with truffle sauce drenched, not to much on over the middle and it was cooked to perfection (OH sooo good).Then the \"manly friend\" got a steak with an over easy egg on top. NO butte, no oils, and no salt (potatoes. green and red peppers, onions) with pepper seasoning and it was looking really good from a far.The service is hands down the best. Everyone who encountered our table was fabulous. The dishes were amazing. They came out at all different times which made the breaks between other plates perfect timing.  The wine selection was outstanding. I love Spanish wine. I heard about the Mario wine (which is a cab sav.), but its only available by bottle.They don't have a menu online at the East Hartford location (I uploaded the wine list for a photoKeep in mind everything is tapas, but the prices are ideal. We got a lot of food for a small price. If I ever come back to West Hartford I would definitely come back to this spot."], ["Jackie D.", "Great food, drinks and atmosphere. The chicken empanadas are very good. The calamari is a lot of bang for the buck as well. Consider the potato tortilla as well. It is more like a frittata than a tortilla. We also had the jamon croquettes which were rockin. If you come on a week day between 5-7 they have great drink specials from wine, mixed to beer and they have some tapas specials that range from $2-$3. This place is a definite must try. We also had the mixed fruit red sangria. It was very good. The chocolate hazelnut indulgence was to die for. You need to come here and try it!!!"], ["Nik B.", "Wonderful place!  Beautiful decor, spacious, and fabulous menu.  If your into interesting foods, know more than just a thing or two about wine and cocktails, this is going to be your new favorite place.  My husband and I went on a Tuesday night, sat at the bar and had the best service I've ever had from a bartender.  We didn't get her name, but she was a pretty blonde, with great knowledge and she made us an outstanding rye Manhattan."], ["Jess L.", "I came here for a great happy hour. Seriously, you gotta check it out. From 5-7pm, there are discounted wines, beers, and cocktails; there are also about 10 tapas to choose from at $2 or $3 a pop.The Monastrell ($5 happy hour) was really nice. Medium bodied and a little sweet. In terms of tapas, I also really loved the pork/beef meatballs (3 for $3 in a great tomato-based sauce), and the chickpeas with spinach and onions ($3). The Tortilla was also nicely portioned for happy hour ($2). Great vibe. This place was fairly empty at 5:30pm but definitely got packed by 7:30pm. (Happy hour is from 5-7pm.) Our waitress and the two other people who brought us our food were really nice. They kept our water glasses full, too, which I appreciated."], ["Leah M.", "I can't believe I haven't written a review for this place yet!!!!  There are many excellent things to say about Barcelona...their food, service, drinks, and atmosphere are a dream.  Depending on how hungry you are your meal price can range from very reasonable to very pricey.  TAPAS RULE!My husband and I spent Valentine's Day at Barcelona this year, and we were not disappointed. Although, I thought I was going to be when we first walked in.  The place was packed and even though we had a reservation, they told us they were running thirty minutes behind!  I was a little shocked, but it wore off quickly.  The staff served us complimentary sangria and delicious small bites while we were waiting.  The staff did not act flustered or overwhelmed despite the obvious time crunch and were extremely pleasant the whole time.  Their huge selection of wine is superb.  They also have delicious cocktails and sangria.  We did not eat a ton this night, so our bill was pretty cheap. Just about $60 for two drinks, 4 tapas, and desserts, not bad for a VDAY dinner.The hanger steak with truffles is decadent and consistently good.  The crispy brussel sprouts are SO GOOD.  We also enjoyed a duck leg, and we never miss the Patatas Bravas.  The crepas filled with dulce de leche were out of this world.  I love that they keep a few favorites on the menu but change many of their items throughout the different seasons.  There is always something fresh and new!We also come here a lot for a night out.  Their bar is a lot of fun and it is really easy to grab small bites of food!"], ["Lucy B.", "It was a ridiculous choice to purchase a Manhattan at an establishment like this and to get charged $20 for it!!! I would expect that and be willing to pay that in New York City...not West Hartford, CT at Bar Taco. I didn't even pay that much at Grants for a Manhattan. And to have canned beer purchased at $7 a can but no glass offered??? And to have the wrong beers given while the beer cans ordered the first time around were still on the counter. There's a reason why we don't go to Bar Taco as a first choice."], ["Scott J.", "Upscale tapas bar in West Hartford's center. It was a very classy and upscale place, that was absolutely packed. Surprisingly, however packed it was, they did a great job of keeping track of everybody waiting for tables, they did a great job of getting people in and out, and we were able to get a table surprisingly quickly.The tapas were fantastic, we had the Hanger Steak Black Truffle Vinaigrette, which was amazing. The sauce they put over the steak was incredible.This is a great place for a meet up after work, or for a date."], ["Elle D.", "We had the heirloom tomatoes, Pulpo and Hanger steak with truffle vinaigrette and everything was amazing. Matt and Casey, the bartenders were awesome!!! Thanks for a great birthday. We will be back for sure."], ["Christine M.", "Can't beat the happy hour. Great selection of craft beers and innovative cocktail list. Ambiance is perfect for a date night and tapas are pretty delicious. The carb lover in me also loved that warm crusty bread. Service was attentive too. Only subpar item was the churros con chocolate. I thought the churros could have stayed a little longer in the fryer and the dipping chocolate wasn't fantastic, my husband didn't care for the sourness."], ["Brian L.", "The food was all very good. The drinks were a little blah but the food was great! The pork dish was fabulous, the steak with truffles was great as well. The paella was average if not below average... everything was overcooked and that is bad for seafood.All in all I would certainly come back and dine there again, we tried almost everything on the menu and almost everything was good. Good work Barcelona!"], ["Kyle B.", "This place is ok. There is a dj on Friday nights, an extremely small dance floor, overpriced drinks and people wall to wall. The only problem is, you cannot move whatsoever. It's a good ten minute wait to get service at the bar. If you like crowded louder atmospheres then this is the place for you. I would like to say it used to be a lot more classy where it was required to wear a collared shirt, but it just seems like it is a little more geared to the masses now, and the masses definitely are attracted to it."], ["Nathan L.", "Nice place but be prepared to bring your wallet at $10 a drink. Only one bar serving drinks means you are waiting a while.  Certainly a young crowd with the majority in their 20s."], ["Laurel L.", "Wow, I have never been to a place with such top notch food and service before! The food was delicious and the staff was so friendly and attentive.  There was never a moment when we were wondering  \"what happened to our server?\"The atmosphere is great, you will leave with a smile on your face. If you're looking to try something new this is the place!"], ["Leonardo D.", "Barcelona has to be my favorite tapas restaurant. They have 3 locations - West Hartford, New Haven and Stamford, and West Hartford has to be my favorite of the 3 because it is bigger, and has a enclosed heated patio sitting that is open year round. The other two locations are also amazing. The menu differs slightly between all 3, but there isn't one thing in their menu that I wouldn't order. The menu is very well diversified with a large variety. The wines are ok, but they really shine on their bar drinks. The staff is super friendly, and attentive, and despite being always insanely busy, the food always comes well prepared."], ["Amy T.", "Good food! The tapas are pretty authentic and delicious... except for the fact that you pay for them like appetizers.  I would recommend this place.  They have delicious red sangria.  Go on a Friday or Saturday late night for a club experience."], ["Crystal H.", "Stopped by here since we were in the area. Not too busy around 8ish so we were seated right away. Yummy complimentary warm crispy and chewy bread to dip in olive oil.I got the Rose Brut, but it was a really red color instead of the light pink like I'm used to. It didn't taste like a Rose..Onto the food:Mussels del Diablo- delicious tomatoey broth and plenty of musselsPork Belly- fatty goodness and melt in your mouthCrispy calamari- just the right amount of batter on the calamariService was good. Prices are standard."], ["Ryan D.", "Barcelona has never disappointed. The food is phenomenal and the waitstaff is top-notch. My wife and I went for our fourth anniversary Saturday night. Mike Ditka was there too, unfortunately we were not in proximity to him ... DA BEARS!! At first we were seated right in front of the door to the patio and it seemed every waiter/waitress/person in the building was going to the door, which ultimately created quite a breeze. I asked to move and luckily were there early enough that it wasn't an issue. Would I go back, you can bet on it."], ["Jess S.", "This restaurant is so very cute, the service was spectacular and the menu concepts are spot on but none of our dishes delivered the expected wow factor we were hoping for. Left disappointed because it had such potential. Everything was good but nothing was great. Chorizo w fig was so sweet it tasted candied, the albondigas were a bit too Italian v Spanish in flavor and the gambas were good but I've had better. The squash a la plancha, eggplant caponata and queso were delicious... Tried the Churros as a redemption dish and these were most disappointing of all. The dark chocolate sauce was overly sweet and maybe burnt? Tasted like cherry liquor had maybe been dumped in but the waiter suggested it was made w only milk chocolate and cream. I like my Churros w a dark molten dipping sauce. Execution needs work."], ["Ingrid L.", "A friend and I had dinner at Barcelona last night and it was spectacular. We had the fresh beans with ramp pesto, the mussels in spicy broth and the pulpo. All the food was excellent, but what really made our night was our server, Natalie. She was simply one of the best servers I've ever had the joy of dining with. She suggested drinks and wine for us and treated us like family. Next time I'm back in town, I'll be sure to go back to Barcelona and will always request her from this point forward!"], ["Lindsay D.", "Went for a birthday party and had the best service! Darryl is the manager there and was extremely accommodating."], ["Kerri P.", "Our first visit was on the hottest day of the year, last year, when nobody else felt like turning their stoves on either. Food and service were great, but it did feel more crowded than I am comfortable with. I've been back a few times since -- busy, but not too busy. A couple tapas + a couple drinks + a hilarious waiter = great experience. It doesn't feel pretentious."], ["M W.", "Went there for my sister in-laws 30th birthday. We had reservations which was good because the line to get a seat was never ending. Decor was nice and atmosphere was great. This is a tapas menu which there is a variety of choices to choose from. Our waitress Liz-Beth kept forgetting to bring us our drinks, forgot to place the order for my duck breast tapas, and just forgot about us all together. Thankfully the other waiter assigned to the table kept up on her mishaps. So it was strange, the tapas's were good but I don't think there is anything that would bring me back there, not gonna go out of my way to go there. Bar Taco which is owned by the same people, is attached to the front of it I thought is a better choice. I've eaten there and would of preferred to go there instead, it's also a tapas menu."], ["Anna E.", "Barcelona is one of the sexiest restaurants in West Hartford.  It's the perfect place to bring a date or lover or dine with friends.  There's something very intimate about sharing a bunch of small plates.  It is the perfect opportunity to try a variety of different dishes.Friday was the first time I'd been back since they renovated.  I loved the decor and ambience before but it did seem like more space was needed.  Now it's even better than ever.  We arrived sometime between 6 and 7pm and got a table in the outdoor dining area.  One of our two waiters brought over a menu and it did not take me long to select the Aviator (Ransom Old Tom Gin, Liqueur de Violettes, Luxardo Maraschino, Lemon Juice)  as my beverage of choice.Shortly after we placed our order we were brought a complimentary watermelon, cucumber, and feta salad from the kitchen.  It was light, summery, and refreshing.  The official start of summer isn't for about another week but summer started for me that night in my mouth with the first bite of that salad.  We also shared the spicy eggplant caponata, the kale salad with toasted hazelnuts, grilled hanger steak with black truffle vinaigrette, pork belly a la plancha with mustard, and 12-hour braised short ribs.  For dessert - churros with a chocolate sauce for dipping.  Everything was terrific   My favorites of the night were the multidimensional flavors of the caponata, the tender and flavorful short rib, and the crispy and soft churros, but honestly, I loved it all.  My dining companion commented that the kale salad tasted \"healthy, in a good way\" - the acidity of the balsamic drizzle was nice against the butteriness of toasted hazelnuts.  The pork belly would have been too dry without the wet of the mustard, but together it was good.  The hanger steak was  an ideal medium rare and the black truffle vinaigrette had a smokey complexity that added depth to the dish.  We also enjoyed using the warm, crusty, delicious bread as a vehicle to sop up the sauce from the eggplant caponata.We had a great time here and I look forward to coming back."], ["Pamela M.", "Not impressed. Not a regular restaurant. Some of the tapas were good; the others not good. The fideos with lamb merguez and garlic aioli was greasy and burned to the pan. The restaurant was not crowded. Staff has reached out. I might try it again some day."], ["Dani P.", "I can't say enough good about Barcelona. I recently asked all of my closest friends to meet up here for my birthday and it was definitely the right place.I've gone here probably 20 times in the last two years and have never had anything less than stellar to eat or drink. Though this is definitely not the place to go if you're looking for a quiet evening since the bar gets pretty packed and there is a lot of dancing and music, it's a great space to gather. The small plate options and tapas are good if everyone is in the mood to be adventurous. Side note: I can't have gluten (sadly) and they were SO incredibly accommodating - it's worth mentioning that a huge amount of their menu is naturally gluten free!"], ["Byron D.", "We were fortunate to have two charming helpful servers.  The menu items we selected were exceptional.  The mixed grill was a real treat!  The flavorful paella was wonderfully prepared and presented!  See the photos I loaded for the details!"], ["Diana M.", "I wasn't thrilled with the menu. But after speaking to the absolutely amazing manager, Johnny, I learned about the menu and found several tapas I enjoyed ! This place has a beautiful array of people and it made my experinece that much better."], ["Linda C.", "I always come here on the weekends as my last stop of the center. I love the dim lighting because it gives it that romantic feel. The DJ always plays the  songs I requested so that's always a thumbs up.The drink are okay. But it's like a fight to get to the bar. I usually have to run through people to get to the bartender because no one moves from the area. I took a star off because last weekend I ordered a vodka tonic, pomegranate margarita and a mojito. The bartender messed up my mojito and I didn't realize the bartender charged me for four drinks until after I was home. Love love this place."], ["Bruce T.", "Barcelona used to be one of my favorite restaurants and still has great food, but the service continues to go downhill.  I recently went there on a Saturday night.  Among the service issues we had during our one visit where as follows -1) Bartender didn't know how to make a drink we ordered and instead of looking it up, came back to the table to ask us how to make the drink (not a huge deal, but lazy that they wouldn't just look it up).  Oh, and even after asking they didn't make it right!2) One of the tapas we ordered never came out.  The waitress never came back around to check that our food was served.  We had to bring it up to her, and it still took another 10 - 15 minutes to get the tapa served.  3) We ordered a second round of drinks.  One came.  The other never came.  Again, we had to ask the waitress to follow up.  After another 10 minutes the drink finally came.  Overall the food was good.  But the service is not what you'd expect from a place where you're paying $50 per plate.  Unfortunately, this is the second service issue recently at Barcelona (see my other write up).  Anything can happen once, but twice makes a trend.  I probably won't be back."], ["Danielle M.", "My boyfriend took me here for my birthday and it was amazing! Best tapas restaurant I've ever been to. The food is pretty pricy but definitely worth it. Their sangria is great too. Definitely come here for dinner the next time you're in Blue Back Square. My favorite tapas are Patatas Bravas, the Spiced Beef Empanadas, and the Mussels al Diablo, and the veggie Paella is a great vegetarian option."]], "Andrea's Restaurante": [], "Casona": [["Wilther M.", "I love Spanish food and salsa music - if you're fan of any of these then you owe yourself a visit to this establishment. I've been here twice (maybe thrice) on Thursday nights. Their menu offers a variety of Latin cuisine, and their salsa music is awesome. They warm up the crowd with free salsa lessons around 9 or 10PM, and just kill it with some great music the rest of the night. The dance floor was not crazy packed, but it wasn't dead any of the Thursday nights I went either.I almost took a star away for the crummy ambience outside, nothing but gas stations and a sketchy neighborhood. Yet, it seems unfair since they do offer parking (at the very least) allowing for a quick getaway... AND there are far too few places like this in Hartford in general. I give it up to Casona for being a diamond in the rough!"], ["Erica K.", "Umm..... I can't even describe my experience at this place, but I'll do the best I can.I love Peruvian food and was super excited but I was disappointed. First of all, it was half club half restaurant. The bar scene was popping, but it was still early! Second of all, food was average. We ordered the Lomo saltado and my boyfriend said his cut of meat felt and tasted cheap. I got a fried seafood platter and it was over battered. I didn't like it. The weirdest part of the night was the manager was filming a commercial, we don't know what for, but we were in it. Never saw it though.Weird parking situation and mediocre food makes us pass on this place."], ["Mickey Z.", "This is for and drink review only. The sangria has no alcohol at all. Our party ordered it by the glass, half carafe and full carafe and after drinking it all everyone was completely sober. It was all juice. Never buying that again. The empanada dough is corn not real dough and fried improperly as the grease drips right off all the over the place. The filling is mostly potatoes. Awful. The seafood soup for 12$ has no flavor in the broth. I would only come back to order beers and dance. So disappointing"], ["Susan N.", "I've eaten here before and the food is good.  My gripe was with the service trying to use a Groupon.  They do not want to honor these and are very rude.  They will turn you away if you haven't made a reservation even if the restaurant is empty.  The manager came to the table and was insulting.I contacted Groupon and was given a credit.  I will never return to Casona."], ["Katia M S.", "Ate there on Friday and I had a good time. There was live music and the service was great. I had Beef empanadas and they were really great. My husband had arroz con gandules, pernil and fried plantain. He said that was the best pernil he ever ate. We also had piña colada and it was awsome. A+"], ["Michelle G.", "Absolutely terrible!  The worst customer service!  The bartender with the curly dark blonde hair basically ignored us... Cared more about eating her own food with her fingers then to wait on anyone.  She was handling money and then handling cups and straws with her dirty hands!!  They charged $3 for a bottle of water!  The shots were outrageously priced and were the size of a thimble!   My friends ordered food and when it arrived, the bartender set it at the back of the bar and forgot about it!  They had to ask about it and by that time, it had gotten cold!  I am appalled that they tried to charge $10 to park there AND charged $10 to get in!   In today's economy... Good luck getting people to come back to this place!Today I drove by there and watched people getting arrested in the parking lot.  That was pleasant."], ["Edwin A.", "I had an amazing experience here last night on Saturday.  I booked a VIP table here and the service was epic.  They look completely remodeled with great music!"], ["A C.", "UPDATE: My gf & I stopped here Wed after work (6PM). The parking lot had a few cars, but not many. We walked inside to see 2 people at the bar and plenty of empty seats in the dinning area....  A guy greated us and asked if we had Reservations, we said \"No\" (thinking, this place is nearly empty)Then the guy asked, \"Do you have a Groupon?\" And actually, we did, so I said \"Yes\". He then tells us that we have to call ahead of time for a reservation since we have a Groupon.... WHAAAAAAT? HUH???I then said, \"Can we call right now for a 7PM reservation?\"He looks down at his nearly empty note pad and says, \"It's BOOKED for the night\" (WHAAAT? huh???) There were EMPTY SEATS EVERYWHERE, I mean EVERYWHERE. I asked him again, Can we just call now so we can eat later... and he says NOWe walked out.WHAT BUSINESS TURNS DOWN CUSTOMERS WHO WANT TO SPEND $$$$$?????!!!!Our Groupon was for $40 (we paid $20 for it) and we planned to have drinks and desert. UN-F*&KING-BELIEVEABLE!  We will never go back, never..."], ["Gabss S.", "Worst Spanish place.  I celebrate my bday there this month.  The place was full of 50-years-old dressed inappropriate for a night out.  Also, the staff was very rude and careless: the bartenders,  the host, EVERYONE! They promised a bottle, and a cake, and what I got was a small bottle of the cheapest vodkA with no free juice refills,  and a horrible looking cake.  We couldn't finish the bottle 'cause it tasted really bad and did not even touch the cake. Finally, all my guest had to pay for their own entrance."], ["Caitlin C.", "Casona used to be La Casona, an establishment operated in the same location. In 2009, the owner, Fabio Caro, sold La Casona and moved to Miami. The restaurant's new owner unfortunately let cuisine fall by the wayside as he poured resources into promoting the place as a nightclub. As a result, La Casona shut down - but not for good! Fabio returned to Connecticut, and brought with him his experiences in Miami at restaurants that focused on ethnic tapas. He renovated La Casona and turned it into simply Casona, a gorgeous space that serves up truly unique, authentic dishes for both lunch and dinner.I arrived to find the dance floor (Casona still moonlights as a popular nightclub) occupied by a salsa teacher and his students! That's right, Casona offers salsa lessons on both Wednesday nights (6, 7:15, and 8pm) and Saturday mornings (9:30pm). Don't be shy, all levels are invited, and prices are extremely reasonable at just $10/class on Wednesdays and FREE on Saturday (what a fun, affordable date idea!). If salsa isn't your thing, Tuesdays at 6:30pm there is ridiculously cheap $5 Zumba!We were seated in the dining room next to two huge booths, which Fabio informed us are filled on weekends with young customers utilizing Casona's bottle service. The table was set beautifully and our waitress immediately brought over glasses and a bottle of water to keep at the table. I love that - I go through water like mad at restaurants, and it's great when I can just serve it myself.To drink, we selected an Argentinian Merlot. It was WONDERFUL and paired beautifully with all of our food. We started with toasty, crunchy bread with Casona's signature \"sexy sauce\". The taste of this sauce was certainly a sexy thing indeed.Our next course, Piononos, was my friend's favorite (she went back and ordered it for lunch this week in fact) and, after much deliberation, I've decided it was my favorite as well: sweet plantains stuffed with ground beef and Latin spices, topped with sexy sauce. First of all, I loved the presentation of each of the tapas. Secondly, WOW. The sweet plantains were a fantastic contract to the spiced ground beef, and the sexy sauce made them even more amazing. What a unique, well-prepared dish!Next up was a dish the seafood-lover in me was extremely excited to try, the ceviche, made with tilapia! Or as Fabio calls it...Peruvian sushi. Each section of the tray had a different sauce: yellow pepper sauce, rocoto, and virgin sauce. All were wonderful and had a bit of a spicy kick that got to me a bit by the time we'd finished this dish, but it wasn't so much spiciness that it made eating the ceviche unpleasant in any way. The dish was garnished with Peruvian corn - how cool is that? It was so yummy and wasn't even salted, buttered, or anything! The huge kernels packed a flavorful punch. The middle compartment of the tray was garnished with a sweet potato, which tasted so good in that spicy sauce. More yummy contrast!Out of anything I tried at Casona, I'd say the beef and chicken empanadas tasted most similar to other dishes I've tried before, but that doesn't mean they weren't stand-outs. The crunchy outer shell was fried to perfection and not greasy at all. The chicken was shredded, which I prefer so much more to chunks, and that perfectly-spiced ground beef was back again. Fabio called the salsa a pico de gallo, which was a bit odd to me since every other pico I've seen is more chunky and has the least liquid of any salsa variety, whereas this salsa was mostly liquid. I definitely prefer  a chunkier salsa, but since the empanadas shape is definitely more conducive to soaking than scooping, the liquid salsa was a good choice.The last dish was the Tostones Rellenos, or fried green plantains stuffed with chicken and shrimp (chicken for Rachel, shrimp for me) and garnished with homemade plantain chips. The plantain chips were the best I've ever tasted (Casona should bag them and sell them!) and the rellenos were again not greasy and absolute perfection. We were too full to finish this plate, and that did not make us happy, but we were going to explode with any more food!We are definitely going to be back to Casona (in fact, my friend's already been back), and it's so exciting to hear that they are having success so far in their revitalization."], ["Queen B.", "Love the Latin dishes offered on the menu. It's got a little bit from all over. I've had the Bandeja Colombiana and Churrasco. Loved it!!! I'd go back for those. Ordered the mofongo once but it had like spaghetti sauce (on mofongo???) on it. That ruined it. The food is good but service leaves a lot to be desired.  Great greeting, prompt delivery of drinks and after that its hard to catch a server's attention. It took us more time to get our check and cash out than the meal itself."], ["Jacqueline D.", "Haven't been for the food, but my girls and I stopped here for the club. Music was good. They had both the \"traditional\" music your parents would listen and dance to and the newer Reggaeton and club stuff. Either side was good. You better be ready to dance. The men looked good as hell so I definitely cant' complain. $10 cover?? I mean really"], ["B B.", "One of my favorite Latin restaurants!I love the recent upgrades to the bar and dining area. The vibe is very Miami. The food is delicious. My favorite is the Lomo Saltado and I usually add a side of sweet plantains. Yum!"], ["Prof L.", "Casona is the place to go for both great food and dancing. If Latin dancing is your thing, you can go on either Thursday,  Friday or Saturday nights and get your fill of Salsa, Merengue, Bachata and more. On Friday evenings they open up the dinning room floor for more freestyle dancing. The dance floor is one of the best in Hartford. Parking is a little tight so it's best to arrive early.On Wednesday nights there is  West Coast swing and at least once a month on Sundays you will find a nice mix of Hustle, West Coast Swing, Salsa and more. Occasionally there are live bands but most of the music is provide by DJ's. All of the DJ's are top notch and DJ Louie East is perhaps one of  the best Latin DJ's in Connecticut.On Friday nights there is often a live Latin jam session with local musicians and singers as well as opportunity for live Karaoke. Except for rare occasions, there is a beginner dance class before each night of dancingThe staff is friendly and courteous. The food is fabulous and the owners are fantastic people.  Plan on a leisurely dinner time when dining at Casona as the food is prepared fresh and therefore takes a little longer."], ["Giulie R.", "Awful customer service! I called to see if there was waiting list. The man said no but suggested I make reservations. I then asked if he had any reservations left for the night and his answer was \"there are several, the first availability being 7:15\" I then said ok and went on to give my information for a reservation. It was at this point that he interrupted me to ask whether I'd be using any promotions like Groupon. I answered \"yes\" and his reply was that he couldn't honor any more Groupons as they already limit themselves to honoring 7 Groupons a day. With that said, I mentioned that my Groupon would be expired tomorrow and thus needed to use it today, unless he would be willing to honor it tomorrow. His response was that I should've planned better and not have waited to use the Groupon on the last day and that now it was too late to use the Groupon $40 promotional value. Again I asked him how he could turn away and refuse customers that minutes ago he had offered a 7:15 reservation.I was supremely disgusted with the horribly rude host and customer service."], ["Catherine R.", "Best place ever!! Can't even begin to tell you how great the food was here. I had the monfongo. It was delicious. Not many complaints other than I wish that there was more shrimp in the dish. But other than that, it was well done and had a powerful and strong and rich flavor. I truly recommend this place for visitors to the Greater Hartford Area. I know I will be certainly going back."], ["Claudio C.", "I did not go for dinner, rather I wen to the Salsa dancing and it was a very happening place.  The facility is split into with an adjoining bar.  One side is where the Salsa dancing was and the other was freestyle dancing.  The DJ on the freestyling side was the best I have ever heard doing a great job of mixing some oldies in with latin music."], ["Randy G.", "The interior make over is refreshing compared to the previous layout and decor.. Large wooden dance floor area."], ["Anthony P.", "Good Latin food, but I felt my father made it better. I love the night life for dancing."], ["Julio H.", "Took the kids here to celebrate their fantastic school year. Straight A's all around and for honors and Advanced Placement classes to boot.My dish which were the pork chops were edible in fact nothing was left on the plate but disappointing. Appears they just dusted some old per-cooked  chops with plenty of adobo and some lemon or lime juice. My only recommendation is find yourself another restaurant if you are looking for good hispanic food.By the way, the service was good , the setting is comfortable and were seated in a sun room like seating area. Those parts were good. Shame the food was not up to the same level as the service and atmosphere."]], "Cora Cora": [["Victor D.", "If you are new in town and/or just looking for a cozy Peruvian cuisine restaurant with a great variety of dishes and excellent service, Cora Cora is the place to be! I think Cora Cora's ceviche is the best around the Hartford area and have a fair variety of Peruvian wine to go along with the meals. On Sundays there are dance performers displaying traditional Peruvian folklore dances. I also like their papa a la huancaina and sea food dishes."], ["Daniel H.", "Good variety of Peruvian dishes and appetizers.  Food is flavorful and well prepared.  Portions are about right sized.  I like their arrow con mariscos and beef chaufa.  Service is ok.  Ambience is ok.   It is a bit on the expensive side of things so we won't cone here often."], ["Shane G.", "Bring me the heart of a cow, skewered, sizzling, on a plate! The menu here is intensely alien. It's the kind of menu that forces you to be a bold regular (or Peruvian) in order to unlock it's tasty secrets. So many choices...  so little room in my belly.Don't worry if your Spanish is rusty, the waiter will kindly whisper the correct pronunciation to you should you fumble. They were all very professional, engaging and helpful.They start you off with a bowl of cancha. Gringos might identify them as Corn Nuts, but cancha is sooo much better. Cancha is giant corn kernels fried until they become light and crunchy. The sauce they serve them with was good, but the logistics of eating them with said sauce left me a little puzzled. The calamari (chicharrón calamar) comes with fried cassava root wedges that we initially mistook for deliciously starchy potatoes. I thought chicharrónes were fried pig skin, but apparently it's more of a preparation than a particular meal, and in South America the friable food can vary country to country. Then there's the sopa criolla de la minuta. My favorite proverb is an old Spanish one: of soup and love the first is best. It brings a tear to my eye when I meet a soup that puts real value to those words. The criolla de la minuta (creole of the minute?) is a beef soup with angel hair pasta, a poached egg, a potato and oregano laced milk that must have come straight from god's teet. It has to be said... some of the desserts are a little kitschy. There's some cheesecake I would assume came from a  box, an oreo mouse cake that also probably spent some time being shipped in from somewhere else... and then there's the flan. Now I know those of us that took Spanish in high school probably spent at least one class talking about how awful flan is. All jokes aside, this flan is the reason Spanish people love flan. Decadent caramel over a perfectly executed custard. My wife quickly abandoned her oreo mess and begged me out of half of my dessert, it was so good."], ["Jenna D.", "I never actually noticed this restaurant, despite going to Pho Boston many times. It was pretty empty on a Friday night, and there was decent parking. There was a bowl of canacha on the table already, with a creamy garlic sauce that was pretty delicious.While the drinks are standard West Hartford prices, the food is not. It's around (or slightly less) than your average chain restaurant prices, but it's sooooooooo much better (two drinks and dinner came to $40). I had the Tallarin Saltado de Lomo, a pasta dish with steak, peppers, onions, and tomatoes over linguine. The meat was cooked exactly medium rare, and was a great cut. The sauce was light, and the veggies were still a little crisp. The portion was enormous - I couldn't finish it. My husband had a sliced rib eye with onions and tomatoes, over french fries with white rice. He ate nearly everything, and his cut of meat was equally delicious.It might be something I don't understand about Peruvian cuisine, where everything comes with french fries/rice/Chinese style? That was the one thing I found a little odd, but Our server was attentive but not overbearing, and was very helpful when I was having trouble deciding what I wanted to eat. She was pretty good with refilling water glasses, too, which is a pet peeve of mine. She also didn't rush us out, as we sat around talking for about an hour after we paid the check. Definitely great service. There are fuzzy Alpaca wall hangings that I wanted to take home with me, and the overall presentation was very nice. It's a small place, so quite intimate. I will definitely be going back, and I hope to bring some other friends with me."], ["Sayya A.", "I was introduced to Cora Cora by my sister. I invited her out for breakfast one morning yet she didn't leave the house until lunch time so we were the first customers at Cora Cora.  This place is simply a gem lost in an eyesore plaza. I fell in love with the dishes we had that day.  My experience here was worthy of many future return trips. Food: Out of the world. The food portions were very generous and every dish that touched my tongue that day made a lasting impression.  If felt so inspired I had to stop at ADong's to get some yuccas to deep fry that evening. Deep fried yucca is a must try for those who never experienced the uniqueness of heavenly like Peruvian fries. Price: You can beat the price tag; the lunch special filled my belly without breaking the bank.  This is one of the most amazing lunch specials around in the area. Service: Friendly but we did have to ask for the lunch menu.  The food was amazing I'll forgive him for making me chew on ice cubes.Parking: Plentiful and Asian girl friendly."], ["Emily C.", "Even though I discovered Cora Cora on a chilly, overcast fall day, I couldn't shake the craving for tangy, summery ceviche.This place is gold. Tucked away on Shield Street in West Hartford (in the same plaza as Adong and Pho Boston), Cora Cora cooks up a variety of South American specialties that boast the unique flavors and spices of traditional Peruvian cuisine. The menu offers an extensive list of appetizers, chicharrones, soups, and chicken/beef/seafood dishes.After very little deliberation, I settled on the Ceviche Mixto: A fresh, flavorful amalgamation of octopus, mussels and clams marinated in tart lime juice with onions and cilantro- all beautifully garnished with toasted Peruvian corn and sweet potato over lettuce. To complement and offset the tangy ceviche, I also ordered a side of sweet plantains (platano maduro), which were predictably luscious. I then stabbed my fork over into my dining companion's plate to taste the rich, savory Camarones al Ajillo: Shrimp sautéed in a creamy Peruvian garlic and wine sauce, served with rice and fried potatoes.Since I plan on returning to Cora Cora sooner than later, here's a peek at some menu highlights that made it to my \"To Eat\" list:I've heard tasty rumors about this \"don't knock it til you try it\" dish: -Anticuchos: Grilled diced cow heart skewer seasoned with Peruvian spices. Served with Peruvian corn and fried potatoes.-Rachi: Grilled beef tripe marinated in special Peruvian spices. Served with fried potatoes and Peruvian corn.-Chupe de Camarones al Estilo Coracora: Originated in the beautiful town of Coracora, a delicious shrimp soup with fresh vegetables, Peruvian herbs and spices, cheese, milk, eggs and Peruvian corn.   -Papa a la Huancaina: Cora Cora's specialty Peruvian appetizer: a bed of sliced potatoes drizzled with Peruvian cheese sauce, garnished with black olives, sliced hard-boiled eggs and lettuce.CAN I GET AN OMNOM?"], ["Sylvia O.", "The food was absolutely amazing. Portions were not small. Unfortunately no room for dessert. Maybe next time."], ["Anthony P.", "I came here for lunch in the middle of the week to try their lunch special for $13.50. This was recommended by a fellow Yelper, Sanh A. along with Yelp reviews.The first thing I could say is excellent service!!! Attentive, professional, friendly, sophisticated. Awesome.This was what I had:1.) Ceviche de Pescado - yummy. They put a lot of lime in it. The combination of the regular and sweet potato complimented the citrus and sour taste of the sauce that was on the seafood. Topped with sliced onions, this was a perfect first course.2.) Chicha drink - its like Peruvian Kool-Aid. Sweet, refreshing and tasty!3.) La chaufa de Mariscos - fried rice, eggs, calamari, shrimp, and clams. It was like a Peruvian Chinese dish. But it's true, Peruvian food is considered \"Asian fusion\" food. It was a yummy dish.4.) Cancha - I call it the free bread basket of this Peruvian restaurant. Unlimited. Cancha is toasted and salted corn, it reminds me of that snack you can get in a grocery store called \"Corn Nuts\" except this one has the crunch of a soy nut. Served with a yellow sauce (I forgot the name). All in all Cancha is considered the \"popcorn\" of Peruvian snacks.5.) Rice pudding - served warm, topped with cinnamon. It was a great ending.I wanted my dish to extra spicy, and since it didn't reach my expectation, they were generous enough to give me small sides of hot sauce (I believe is made at the restaurant).I absolutely LOVE this place!"], ["Byron D.", "Cora Cora is a Peruvian Restaurant situated in a converted McDonalds. The interior featuring a festive unique decor that manages to incorporate a life sized stuffed toy Lama.  I was prodded along into visiting when I re-read a ROTD posted by a friend.  I have intended to visit many times and usually wound up defaulting to one of the nearby Vietnamese or Thai options in this neighborhood.  So.. now I know what I have been missing.  The service, food and presentation were outstanding.  I loved the appetizer, I will describe it as soft corn nuts accompanied by a spicy sauce.  It was really tasty.  Everything else was delicious as well.  We enjoyed and would recommend the Kinona salad, and the seafood.  Our waiter was really friendly, patient, and helpful.  It was a fun experience.  There are a number of dishes that I am looking forward to trying during our next visit. The dessert I selected was Key Lime pie, an unexpected treat."], ["Michele S.", "Will be back. I enjoy the spectacular lunch specials. Favorites: Lomo saltado and chaufa de pollo. Oh and the condiments have a special zing to them. Love the chicha drink and choice of dessert. The person who take the phone orders speaks limited English. It's a little confusing at times because each combo has two different options."], ["Nick G.", "I am writing this review after my third trip to Cora Cora. I was on the fence prior to my most recent visit but they've earned this 4 star review so here it goes. Peruvian food is very interesting: there are some dishes, like Ceviche, that are very complex and upscale and other dishes that are basically chopped hot dogs and crinkle cut French Fries. On top of that you have Asian style fried rice. Due to this it's hard to judge it on one trip/experience.  My tip is to find someone who has been there a few times and take them with you. (Maybe one day if I have more time I'll go through all of the menu items on Yelp.)If you like Ceviche; get some of that, if you like family style rotisserie chicken; get some of that, if you like Thai/Indian curry they have something like that too. In fact the first thing you should do is order a drink so you can really take your time with the menu and ask the servers some questions. You might need a couple attempts like I did but I can guarantee that Cora Cora will become a favorite spot soon enough."], ["David T.", "Met up with some CT friends for shopping at Westfarms and wanted to try out a new place for dinner so, after finding Cora Cora on Yelp, our journey began.  This was my first time at a Peruvian restaurant so I have nothing to compare it against but thought it was pretty decent.  I don't think it is something I would want to eat everyday but it was cool for something different.    I find it important to note that whilst the food was decent, the service was spectacular. The hostess and our waiter were two of the warmest, friendliest people I have ever encountered in a restaurant.  They welcomed us as if we were dining in their home and had a genuine passion for their culture and cuisine.  They both took time to explain the menu options and cleared up any questions we had about some of the more unusual items (i.e. the purple corn drink...see below).  The portions were plentiful and prices were reasonable.  Here are the details:1st course:  OCOPAThis was very different from anything I have tried before.  Basically consisted of potatoes and hard boiled eggs covered in a creamy green sauce. Not much to look at but I love to try out new things so we gave it a shot.  There was a noticeable egg + potato flavour but the sauce was pretty bland.  Also, the texture was just how one would think: on the mushier side.  I tend to like stronger flavours so this was not my favourite.  Glad I tried it but would probably not order again.Main course:  LOMO SALTADOThis was beef sautéed with onions and tomatoes served over french fries.  It came with fried plantains and rice on the side.  Meat was cooked well done which I appreciated and the dish was seasoned well.  The plantains were cooked perfectly and had the starchy sweetness one would expect.Drink: CHICHI MORADAThe purple corn drink. Apparently in Peru they have purple corn and this is a very traditional drink from what the hostess told us.  What can I say?  I really really liked this.  It's very sweet but was like nothing I've tasted before; I can't really describe how it tasted but it was nothing like corn.  Get this at any restaurant where you can find it; if you like sweet drinks you will love it.  Also it looks really cool to have a huge carafe of purple juice sitting on your table.**Was I blown away by Peruvian cuisine?  No. However, it is not bad and I would not mind it on occasion.**Did I enjoy the meal?  Due to the extraordinary service and the experience of trying something new, YES."], ["Amy T.", "After 3 years of telling myself  I 'neeeeed' to check this place out, recently I made a trip to Cora Cora and I have nothing but great things to say about the experience.  I feel my writing skills are just not creative enough to do this place justice so I will just keep it short. Superior service. Incredible ceviche. Inexpensive. Lovely. Plan to go back again soon, and then again... and again. P.S. My early dinner experience left me thinking that this place would be great for lunch as well. Enjoy!"], ["David M.", "Wonderful food from a clean quick resturaunt on the cheap. I can't complain. You can get a plethora of seafood dishes (very large and fresh ones) for under 15 dollars. We used a groupon for take out and got:Arroz con Mariscos, which was this amazing rice dish with a crab leg, two large muscles, a few shrimp, a lot of squid, and assorted other seafood. All the seafood was fresh, and the rice itself was actually amazing. Pescado a la Chorrillana, a fried fish dish with a side of red onions and a large dish of amazing rice. Fish was very fresh and full of flavor. Considering it was fried, it was amazingly light.I will be coming back here wtihout question to try the cerveche."], ["Carisa S.", "Good food be willing to try something different and watch the drinks they tend to be heavy on the liquor without tasting like it."], ["Michael H.", "Amazing food great selection. Very Authentic decor!  Great service!  Overall 5 stars!  I had the Roasted Chicken and White Rice!  Amazing and enough to feed a whole family. From the \"fried corn\" to the fresh garden veggies a totally WIN!"], ["dennis k.", "I used to like this place until I called for delivery and he turned me down because he had 6 delivery's so I said I guess you don't  want money"], ["Amy T.", "Very friendly and good service, very good food!! I'm a huge fan of Peruvian food, and this place is trying really hard to impress customers.  Guess what? It worked! This seems to be inside an old fast food restaurant, but I think they did a great job with the interior.  It is nicely decorated, and they take really good care of you here.  I ordered arroz con mariscos, which I would highly recommend.  They placed a water bottle on the table, and we didn't even have to refill our own glasses.  I would say that it was a little more than I was expecting to pay.  Give it a try!!"], ["Justin H.", "My wife and I have been here a few times and it was always great.  I'm sure that this is the only place in the world where you can walk into a rennovated McDonals, order something having no idea what you just ordered, chomp on corn nuts while you wait for your food, and then be delighted by your french fries topped with steak topped with a fried egg.  I don't know if this is authentic Peruvian, but either way I'm a fan. Just one word of caution...be wary of the ceviche unless you are a true fan.  My father-in-law gave this a shot.  I'm sure it was exactly what it was supposed to be, but it didn't compare to my steakeggfries.  I woudl have given a much larger word of caution about the pot holes large enough to swallow a Ford Focus, but I am happy to say the repaved the entire lot!"], ["Rene K.", "They have done a fantastic job with a former McDonald's..  We had one of the quinoa salads and beef/chicken rice dish and a chicken rice dish.  Food and service were top notch."]], "Costa del Sol": [["Timothy K.", "Yeah this is one of the best restaurants on Hartford period. They have fantastic seafood. The only problem can be the wait  time. Good wine list."], ["Teddy W.", "Always expect decent food from this authentic Spanish staple, they did not disappoint. The taste of hartford is always a great treat and bargain. The chorizo and beans app was very tasty, decent portion. The pork loin was yummy and the finishing touch of rice pudding completed the meal. All washed down on a very hot day with white sangria. This is not a splashy restaurant with cutting edge piped music, the age of the crowd does trend on the older side. This old stalwart just continues to play to its strength, solid continental Spanish cuisine"], ["Noheli T.", "I'm giving Costa del Sol 5 stars because their paella del casa is always delicious! Although their paella was great I was a bit disappointed by the rest of their restaurant week menu. I ordered the ensalada sushi as an appetizer and it was just ok. The rice pudding dessert was ok too but nothing special. The paella was definitely the main attraction. The customer service was great and they accommodated us well. Overall, Casa del Sol is a must for paella lovers!"], ["Sally S.", "Based on other Yelp reviews (Thanks!) I ordered the Fabada which is a  white bean stew with small bits of sausage and the Pan Catalan (bread rubbed with tomato and garlic and topped with Serrano ham). Both were absolutely delicious and perfect for a cold, rainy winter night.  If you like rose wine, the dry Rioja rose was excellent.  I saw many Paella's passing by and they looked great.  The place is not fancy and it is a bit noisy -you can hear your neighbors conversations loud and clear, but the prices are very good and the food is great.  Would like to see a few more tapas options on the menu but that is just a minor suggestion.  When I go back, I will order exactly the same thing I had! Servers were busy but very nice!"], ["Tiff J.", "I'd like to preface my review by stating that it's very RARE that I have an unpleasant dining experience, whether locally or outside CT boundaries, so it is with dismay that I must give Costa Del Sol a less than stellar review. I hadn't ever been to Costa Del Sol, so I was excited about my first pilgrimmage to the restaurant. Upon our arrival to meet a group of friends, my sister and I looked to and fro... hoping for direction from the hostess... a rather surely middle-aged woman who refused to look up from what she was doing and who begrudgingly waved toward the direction of our party and mumbled, \"back there and to the right,\" only after I approached her and asked. My sister scowled and I said, \"Alllrighty then. Thanks?\" Confused by her unwillingness to show good customer service. Seated with the other 6 or so people, at a rather small table (prior arrangements *had* been made), we jockeyed for water refills, the last of the party to arrive had to practically beg for a glass along with silverware, another dinner guest had a rather passion-less Passion- fruit martini - which got passed around like a ten dollar hooker to no avail, because there were no takers... it tasted horrible - and my sister had a mediocre Mojito, which tasted like bland 7-Up. One of the first times I've ever disliked an alcoholic beverage or drink! I played it safe and ordered a glass of Tempranillo and indulged in an after dinner sherry, which was quite good, but I digress... The Calamares I ordered - (A dish of grilled squid w/ spanish paprika, olive oil, and crispy garlic) - took forever to come... when it was finally placed in front of me, I was unmoved by its presentation and even more disappointed by how it tasted. It was chewy (I felt like I was masticating a thick rubber-band), bland, and devoid of any kick. I ate around it, fumbling for flavor and settling on the \"crispy garlic,\" which was extremely salty but the most flavorable aspect of the meal. The waitress would later ask if I wanted to box the rubber up to take home... an offer I politely declined. My sister had the Chorizo, which was supposedly sauteed w/ shallots and Riojo red wine but alas, nary a shallot was present. The chorizo was extremely lackluster and the sauce it was sauteed in tasted like it belonged in a Swedish Meatballs dish. A suggestion to douse the meal in tabasco sauce made it a little more palatable. There were also complaints about the rubbery shrimp in the Paella de la Casa as well. *Sigh* ...There was just so much ... WRONG ... this Friday evening. My friend was still charged for the frigid Passion-tini she sent back, without the offer of a replacement cocktail. Upon seeing the blight on the bill and a refusal by the manager to have it taken off, she demanded to have a replacement one, since she was being charged for it... A very unpleasant experience... which is rare for me. So much so, I'm not sure I'm willing to give it another chance and I'm hesitant to attribute it to an \"off night\" for the restaurant. Not at those prices. Two very generous stars: One for our harried but friendly waitress, the tempranillo, and then the sherry, the other ONE star that I wanted to rate it for being an absolute FAIL."], ["Michael L.", "Came in on a weeknight after picking up my car from a repair shop on a Tuesday night, wanting to let the rush hour traffic pass before heading home.  I really like this place a lot and the atmosphere is very authentic to its cultural roots.  I always enjoy the warm bread basket, served with a plate of olive oil.  Salt and Pepper on the side.  The Paella is usually excellent.  However, the pan that my wife and I shared this evening was just \"OK\".  The seasoning was non-existent...I remember it being much, much better.  I LOVE spicy food, but my wife does not at all, so she was okay with it, although even SHE said that it tasted a little bland this time.  I actually hesitated between choosing a rating of 3 or 4.  Would be a 5 if the Paella was what I remembered.  I would still highly recommend Costa, and hope that I can recover my experience on my next visit.  I like the recommendation made by Linda L. for the \"Parrollada de Mariscos\"...wish I had tried that instead!  They have a very cool bar area with limited seating.  The owners make it their passion to make rounds to the tables to inquire about their guests experiences.  A great place to check out....."], ["Heather M.", "I had been dying to go here for years but each time it was closed for one reason or another. When I finally got my chance to go, it was for restaurant week in Hartford. Sadly, I was disappointed!Here's what I loved: very pretty inside. Here's what needed fixing: 1. CUSTOMER SERVICE!!! My friend and I were meeting for dinner. (2 of us) I had a reservation for 2. When we arrived the place was fairly empty. We were one of first to arrive. Most tables were three or four tops with one or two two tops.  There was a sun room patio area, which was so nice and inviting looking. I asked the person seating us (older man....seemed to be an owner) if we could sit in the little sun room area, which was empty...the whole restaurant had more than enough seats. He told me \"NO!\" Can you believe it? I couldn't. He said that he needed to save the three tops for parties of three and he sat me at a two top (one of only ones in the place) so rude! Maybe they need to put some two tops in the nice little sun room why should only parties of three get to sit out there? Ok, I get if the restaurant was so crowded telling me I couldn't, BUT it was dead. When I left and hour later more people had arrived but there were still many open tables left, including in the sun room. Would it of killed to let me sit there? He ruined the dining experience for me. It put me off to this restaurant that I had been dying to try. Work on this and I would have given you maybe three or four stars.2. Food wasn't as good as I expected. To be honest cant even remember what I ordered so not very memorable.3. Desert- I got the flan, which came with the taste of hartford menu. It was plopped on my plate and looked like someone had eaten around the edges. I asked my waitress about that unappetizing presentation and she assured me it was like that because it had been scooped out of a big bowl so that's why the edges were looking like bites had been taken. Ummmmmmm....maybe serve them in individual tart dishes or brûlée dishes so its a nice presentation since the consistency is pudding like. That would be an easy fix.VERDICT: down the road is Casona.....much better food! Amazing food there. I've been there three times. It's not as pretty as costa del sol, but food is sooooo good! And customer service ther is great! They were so nice at Casona....they even let me sit in the sun room. Change your ways costa del sol or move over to Casona!"], ["Jon G.", "Went for the Taste of Hartford and a friend's birthday recently.  Not bad at all, but really nothing outstanding either.  I had a strip steak that may have come from the local Stop and Shop - a cheap, grizzly cut.  All of the other items, though, were very good.  The service was odd - it seemed to consist of a kind of team of three people.  That would have been fine, but 2 spoke no English at all.  Finally, we asked that our check be split in half among to credit cards.  We received the slips to sign, and there was about a $20 disparity between the the two.  Weird."], ["Tim F.", "I was here last night as a last minute dinner, which is my second experience here, and feel the need to YELP about the food.  Costa del Sol is known for authentic paella, and is probably one of the best restaurants in Hartford, I mean other then Olive Garden...just kidding, Bricco. Food/Sangria: If you come here you should try the paella and sangria, red or white. It's what they're known for. However, I already tried it in the past & wanted some MEAT this time. I did order the red sangria though... its yummy and authentic and has floating oranges and is very dangerous (I had a buzz on after 4 sips)...and I suspect that the white had the same effect on my friend. The app I chose to start with was the soup Caldo Gallego - which is vegetable soup with potatoes, white beans, collard greens, Spanish sausage and cured ham. It was piping hot, hearty and perfect for fall. My friend ordered the Tabla Iberica, a meat cheese platter with smoked ham, chorizo, and some cheeses...I'm not a smoked meat eating kinda guy so I didn't try it but he was happy and anyway I was busy with my soup and sangria to look up. They brought over a small simple salad between the app & dinner, which added nice touch. For dinner I had the Entrecote, which is grilled ribeye steak with peppers and garlic. It was cooked perfectly rare & melted in my mouth. Clean Plate Club. My friend ordered the Pork osso buco which was HUGE and well-presented on the plate...I think he said it had some sorta sherry demi-glaze...but he kept trying to taste my Ribeye, so I submit that it wasn't as delicious as mine. Décor: The décor is simple, maybe a little 90's dated, but warmly painted walls and Spanish pottery...nothing fancy, but well done. Certainly a good place for a romantic dinner. When you arrive there's a small brightly lit shop/deli to the left, which I think is maybe a little weird for a restaurant layout. Cleanliness:  I can't stress this enough: It is the CLEANEST restaurant I've ever been to. Seriously, one could eat off the bathroom floors. I'm not kidding. It is apparent that the quality of the food and the cleanliness of the restaurant show that the owners/management LOVE what they do there. CdS also seems to be a quiet secret.... maybe because it's in the frayed far south end of Hartford?  I'd have it no other way. I love the fact that unlike Bricco its NOT in West Hartford Center or the G'burbs or someplace else yuppified...the Wethersfield Ave locale adds to the exotic experience of eating really great, simple Spanish food. Of course, the parking lot is filled with shiny Beemers & Benze's so maybe it's not as unknown as I thought."], ["Margaret S.", "This is the first time I have ever written a review.  My husband and I were celebrating our 42nd anniversary.  It was also The Taste ofHartford.  We were served our drinks and then proceeded to wait35 minutes to be served our appetizer.  Which I had to ask for.  Wealso had to ask for our entree.  The service was terrible.  Everyone around us were served.  It was such a disappointment.  Our waitressalso brought out the wrong dessert."], ["Steve T.", "I have been having the food here for at least 15 years.  I say 'having the food here' because since I was a little kid my dad has been bringing home their paella.  I have dined here 3 or 4 times.  You need to go here and get the PAELLA.  Just do it.  You don't have to eat in, you can order the paella to go if you want.  But DO IT.  What are you waiting for?  I've had paella in Valencia and it was nowhere near as good as the paella that this restaurant in Hartford has to offer.  It will blow you away.  That's all I have to say about Costa Del Sol."], ["D W.", "I feel like I am in Espana! Friendly owners and great chef. Have been going here when I am in the Hartford area for years. Always consistent."], ["Claudio C.", "Great place to have paella.  Food was better before this last refresh of the menu.  It seems like flavors were toned down a bit.  Sangria is still good though."], ["Linda S.", "Four of us ate here last night, taking advantage of the Taste of Hartford special menu for $20.10 - a fabulous bargain. My husband's appetizer - potato and onion omelet - was a bit bland, but 2 of us enjoyed our bread with Serrano ham and tomatoes, and the chorizo sausage appetizer was excellent. All entrees were delicious - salmon, paella de la casa, and shrimp with garlic sauce over fusilli. Flan and rice pudding were good choices for dessert (I can't remember the third choice.) And our waitress  did her job quietly and well. This was my first visit to the restaurant and we will definitely go back."], ["Paul S.", "Still great.  Had a fantastic meal there recently from their prix fixe menu.  The thing I felt compelled to report: they no longer serve Goat Cheese Ice Cream.  This a major bummer.  I was told that they weren't selling enough to make it worth the effort or to keep it fresh.  People were put off by the idea, but I assure you, it's nectar of the gods.  And as Pepe, the owner, will tell you, it's the only ice cream that you can have with wine.  That alone should make it worth ordering!  So I hope everyone who wants the marvelous stuff back on the menu will express their love.  But even without it you'll find plenty here to satisfy."], ["Catherine J.", "The food was delicious! The paella was awesome! I highly recommend the champagne sangria. I also had the home made raspberry sorbet...DELICIOUS! The perfect end to an awesome meal. It is a bit pricey, but worth it if your in the mood for authentic Spanish food. I need to go back and get some of that olive oil that came with the warm bread. Yummy, fruity, fresh and sunshine yellow. I never thought I'd dream about olive oil... but I am. I will definitely be a return customer!"], ["Mickey Z.", "Food is OK but they need to change their menu. Seems like the owners don't care anymore. Same old thing over and over and not really that good anymore. Bar is fun and the sangria is good although Besito's in West Hartford charges the same for a pitcher and you get about 3x the amount of sangria and it tastes better."], ["Doug B.", "went last night.  Outstanding.  Seating was rapid and organized with obviously very attentive management.  Waiters came over promptly which can often not happen in other restaurants.  Food was very very tasty. A party of six, one had tenderloin, which was smooth and buttery. One had octopus, which he liked and again was very tender.  In a summary,  this place is on its game."], ["Ken M.", "Went there on a Friday night by myself. I was in the mood for some good seafood and I heard they had good paella. Since I was alone they ushered me into the bar: OK with me, I was able to watch sports while eating. The menu came out, and I ordered a seafood soup and it was good w/the bread tomato based.Then the confusion started: I was going to order a squid appetizer but when the bartender/waiter came over I told him I was going back and forth about octopus & squid. He told me that the octopus was better (more money too), so I went with the octopus. Later both apps came out: the squid & octopus. He was confused I guess, thinking I wanted both of them? I sent back the squid & started eating the octopus. There was so much sea salt on it I couldn't taste the octopus. Stupidly, I kept eating the octopus hoping that each piece would be different, and it wasn't. I needed to get that taste out of my mouth the wine and water weren't cutting it, so I asked for the squid I sent back while complaining about the salt. The squid was good and it did the trick. I wanted to order paella, but it is only for two, so I got the next best thing mixed seafood served with saffron rice and salad. This too was good. No room for dessert though. When I looked at the bill I saw both the $9 squid and $11 octopus on the bill. I didn't say anything, but I thought they would taste the potatoes I didn't eat and agree about the sea salt and not charge me. Good customer service would do that. When the manager came over, I told him about the sea salt but didn't complain about the bill. He offered me another glass of wine, which I took. The food is good, but I got the impression the bartender/waiter was trying to inflate my bill. It has good food, but the overly salted dish stopped me from being a fan. May go back for the paella with a friend."], ["Meganarama n.", "Came here with a group of colleagues.  The staff was very accommodating.   (We have a couple of folks who tend to be a bit high maintenance)  The food was excellent.  I had some shrimp dish that was really just so different from anything I have ever had - in a really good way!  The wine list was very good as well.  I would go back if they would have us!"]], "Comerio": [], "Bartaco - West Hartford": [["Craig P.", "What a great experience! We were in town for the night and were planning on going next door to Barcelona, came here for a drink and decided to stay. It was the best decision of the night. Amy was our server and she was great! Attentive, explained family style dining and guided our entire meal through dessert. We ordered the Bartaco margarita and Humo y Fuego. The margarita was made to perfection, so cold and great balance of tequila and lime. The Humo y Fuego is one spicy mezcal drink, if you like both of those things you will be in love. We started with the guacamole, salsa Verde and chips and my god they were delicious. The chips are whole tortillas that you break apart and dip that we're salted perfectly. The guacamole was fresh and salsa was the perfect balance of spicy and flavorful. We decided on trying most the tacos on the menu below:Curry Shrimp - shrimp were flavorful, not overcooked,  and a good size.Baja fish - lightly battered and deliciousPork belly - SO good! Crispy roasted pork with pickled onions.Spicy chorizo - not too spicy and juicy.Wild boar - great flavor.Duck - a little tough but still great, would order again. Portobello - one of of my favorites! Tender Portobello with light queso.Falafel - I would pass on. Probably had the least amount of flavor or just wasn't executed correctly.A major note was the sauces that come on the table. There are multiple hot sauces: roja, jalapeno, and habanero. I'm a major fan of hot sauce and these were all amazing. We finished with something sweet, the churro.It was crunchy, sweet and warm. It could have used a bit more cinnamon and sugar but honestly it was great! It came with a chocolate dipping sauce that paired perfectly. It was one successful night."], ["Kristen M.", "I really enjoy bartaco. It's unique and fun. Ambiance is great and it's not your traditional way/place to eat. The good: - the tacos are tasty - a variety of choices from pork belly, chicken, Baja fish to name a few- the drinks are Delish! Mojitos are yummy!- other dishes like the rice bowls are also savoryThe bad:- you must be in the mood for this type of food- tapas plate sharing styleOverall: Tasty if you re in the mood for a unique and delicious treat!"], ["Tim B.", "Bar taco is always a great choice. Today was no different. Rice bowl was delicious and my lunch time drink was spot on. Atmosphere is pleasant and staff always smiling. Keep it up guys and gals."], ["John M.", "With so many choices in west hartford I have only gone here one time before fire work. This visit was with a friend and we started with the guacamole , it was perfect with home made fried tortilla that you break to make chips We then tried the pork tamale and was very good My friend got the lunch special , 3 tacos and a salad He got fish pork belly and loved the red sauce on table said had a kick with lots of flavor I got the ribeye rice bowl Was very flavorful and was over  brown rice It also babble with peppers coated in cilantro , I took these off as I felt the favors clashed I have eaten at is sister restaraunt and had the churros Over all good experience My friend summed it well for me this is 2-3 steps  above chipotle"], ["James R.", "Ohhh bar taco, how do I love thee? Let me count the ways: 1. tall Chris. This man is a mix-master 2. Oyster taco, why are you weirdly good? 3. Street corn, crunchy goodness We'll see you soon!"], ["Eunie K.", "Went here on a Saturday a little after opening. My favorites are definitely the pork tamales and the corn. Tacos are also good but a little pricey for how small they are.Every time we go here, we get two free taco tokens for filling out a comment card after our meal. Customer service is on point and the sauce is good too."], ["John L.", "The name speaks for itself, BAR then taco.  Needless to say it's a great bar scene, but the meager portions are okay, but not worthy of their price."], ["Sandra S.", "I was really looking forward to Bartaco and gave it two tries, yet was disappointed both times.  The first time was during winter and they had their heat cranked up to 90!!  It was so ridiculous, we finally asked them to turn it down but it never got comfortable.  The prices are quite high and the tacos are, simply put, just not that good for a place with the word \"Taco\" in the name!  And, I love tacos!  There were items that were good \"here n there\" but not consistent enough to return.  Again, it was pricey for the amount of food you got."], ["Jackie D.", "I had dinner here with my husband.  I have to say that the food was wonderful.  It's a tapas style Mexican restaurant and it was fantastic.  We ardered the grilled corn dish (off the cob), it was so tasty.  the corn, spice, cheese and lime married wonderfully and the result was delicious.  We also ardered a handful of tacos.  The pork belly was delicious as well as the fish taco.  If you arelooking for a fun date night this place is definitely it.The one negative I have to add though, is that they party next to us had additional people come and they were practically sitting on my husbands and my lap.  It was a little uncomfortable because we felt as if we were part of their group and had to watch our elbows while eating, otherwise we would have elbowed them."], ["Love Being A F.", "Love Being A Foodie! Fast friendly service! Tacos are out of this world. We ordered the variety of taco entree (i forgot what it was called specifically) it came with a type of coleslaw and a cucumber salad and a variety of different tacos. I loved the baja fish taco! Yum! We sat at their outdoor \"patio.\""], ["Mark P.", "Based on two visits, Bartaco has not been my cup of tea. I should make clear that I have a couple of things going against me when I enter any trendy establishment: Number one I'm not a terribly social human being so a buzzy crowd which gleefully destroys plates of visually attractive food immediately puts me off. Number two I despise \"old money\" of which there is plenty in West Hartford and thusly I wonder to myself \"does this place have a vision and a purpose to serve a higher standard of cuisine and drink or are they strategically playing into a growing number of foodies with a growing appetite for 'tapas' and designer cocktails?\" The answer, I think, is a combination of the two. I feel like Bartaco goes out of its way to be trendy, promoting the revival of Cobain-era shirts among the wait staff, using low-hanging, low-wattage lights, and basing their food service on small plates. Don't get me wrong; when I sit down to eat I hate being the only guy who showed up wearing nice clothes when everyone else looks like they just came in from raking leaves. I appreciate being in a sophisticated crowd. That being said, the hipster vibe penetrates this place harder than the force penetrated Anakin Skywalker.My first visit was with my wife who enthusiastically insisted that I try a drink her girlfriend had once ordered which featured fresh jalapeño. I believe it was a variation of the margarita, which is not on their current menu, but regardless it was tough to swallow. Literally. The jalapeño, like the cucumber, doesn't belong in a cocktail.  I moved on to the \"Old Thymer\" which is made with fresh thyme. I fancy myself a pretty grizzled drinker but this one was tough. Real tough. My conclusion: When it comes to cocktails, sweets yes, savories no.Because my wife loves the place, we returned for her birthday. We told her friends to arrive there at a certain time for drinks and showed up an hour early to have some dinner. We ordered 4 or 5 plates. There was a rosemary chicken half which was fresh but very simple. Then there was a shrimp ceviche which was basically a little shrimp, a lot of thin-sliced veggies, and a very minimal amount of acidity. Compared to neighboring Barcelona, the ceviche was inadequate. The chicken was satisfying but unremarkable.Her friends arrived and we relocated to the bar. After several failed attempts to order basic drinks that the vast majority of full bars offer, I settled on some...\"adaptations\" of my favorites. One thing that became perfectly clear to me after this visit is that if you plan on ordering beyond the bar menu at Bartaco, you'll likely be out of luck. And this is something that you have to understand if you're a dense, cantankerous, avoidant bastard like me and someone drags you to Farmington Avenue for a drink and a bite.Go there to accept their version of wining and dining but forget your own. In the meantime I'll muster up the patience to give it another go."], ["Matt T.", "Awesome creative tacos, best margaritas in town, with a really cool ambiance. Food is cheap, drinks are expensive, but overall a great place for lunch or a casual dinner, particularly during summer when the patio is open. Ribeye tacos and Baka fish are particularly good."], ["Laura S.", "Great food, great service!! We had Ben as our bartender and he was fantastic!! You decide how much food you want!!  Great for a date night or a night out with friends!!"], ["Lisa M.", "This is easily one of my new favorite restaurants. Sheri and I grabbed dinner at the bar and I was beyond happy about all of our choices. $5 happy hour drinks, tomatillo salsa, fresh guacamole, tacos with chorizo, wild boar, sesame ribeye, curry shrimp and duck--all heavenly. Staff at the bar was very pleasant and friendly, the space is modern and airy and food was fabulous. Can't wait to come back!"], ["James O.", "We are here last night and loved it! We had the duck rice bowl , the chopped salad and guacamole...all were delicious !! Our server Delaney was terrific and gave us great service. As soon as we were seated the manager , Kevin, came over to our table right away and introduced himself. We really enjoyed the beautiful weather and great atmosphere in the outdoor seating area . The patio heaters and blue plush blankets offer a nice level of comfort to the dining experience - I highly recommend this place!"], ["Kevin C.", "I've been here several times already, half during the night life setup and during the day for lunch. Menu is a little confusing for first timers, but thru explain it for you. Staff of course is pretty helpful and friendly. The food is tapas style, so expect small portions. Their tacos are delicious, I got the Chorizo and the Baja Fish, both very good."], ["Dan L.", "I made my first visit to Bartaco tonight with some work friends and was immediately pulled in by the spacious outdoor seating. There's nothing like tacos and a drink outside to make one fine summer night. The tacos were all delicious, which is saying a lot given the wide variety. I also very much enjoyed the no stress ordering of just checking off what I wanted when I wanted and having the waitress pick up the ticket. If I'm ever in Hartford again, I'll definitely be coming back."], ["Sheethal S.", "Very tasty, very good, small sizes which don't over fill you, prompt service, we ordered multiple rounds of tacos. Shrimp, chicken, falafel, all were good. Friendly staff good service - overall very nice place"], ["Sarah C.", "I promise this third review update is worth the read....After I posted my last review, stating that I was underwhelmed with the inconsistency of the food and the suffering service, I got a very nice email from the manager at bartaco, Todd. He is a new manager there and said he is making every effort to insure 100% satisfaction of every guest and fix the problem areas they are facing based on customer feedback. He truly cared about the negative feedback and apologized for the experiences that we're subpar. He invited us back to try again and the service and food were excellent. The food has always been good, my problem was more with the delivery or portions at times. He went out of his way to prove that he, and the staff, were working hard to make everyone's bartaco experience a good one.I can honestly say that is it rare for a manager to reach out and whole heartedly want to correct the problem for their customers. For some reason, if you experience any issues there (which seem to be dwindling), don't hesitate to reach out to him or any of the other managers (Kevin is also wonderful). I wish I had reached out earlier had I known how eager they are to address any customer issues. I value good customer service above most other things. Even great good can be soured by awful customer service. Through reviews, I've learned that bartaco really values its patrons, and that says a lot about the company! Also, the duck tacos (which I had never tried prior) made my jaw drop. 48 hour glaze/marinade before cooking....need I say more?"], ["Ahmed A.", "Great tacos, loud atmosphere, fun trendy crowd, great location. Service was absolutely fantastic! Probably the best in the Hartford area. Maybe we got lucky with our waitress but she was amazing compared to service we've had in the area in general. We would definitely go back just for the amazing service we received. She went through all of our questions one by one, was very thorough with recommendations, etc. Keep it up! Definitely recommended. Hope they can work on their tortillas though! :)"]]}