{"Tokyo Cafe Sushi and Hibachi": [], "Koma": [["Ca D.", "I have eaten from this place a few times recently and I have enjoyed each experience. The food is consistently great and very fresh. The staff is friendly and helpful, the manager is friendly. The prices and specials are very reasonable as well. Nice to pick up on the way home after a long day. I have nothing but good to say."], ["Jennifer C.", "One of the best hibachi shows I've seen in a long time.They had excellent food there.We will be back!"], ["Chris C.", "Great place to have fresh Sushi. Huge bar with friendly bartenders and staffs. Parking was easy as they have a big big parking lot"], ["Emma R.", "This place is absolutely amazing!  The hibachi is sensational and a great show, and my boyfriend can't wait to try the sushi.  The service is excellent as well!"], ["Lily B.", "I had low expectations for this place and thought it would be chain-like fare. Was pleasantly surprised that the sushi is high quality, cocktails terrific and waitstaff are wonderful. I hope they maintain this level and we will keep going back."], ["Mark Z.", "Went for lunch. Great lunch special. Great sushi. They did a nice job with the restaurant design. We didn't do Hibachi but there is a huge nice Habachi room. Will be going back very soon."], ["Cathy S.", "We had dinner at the bar Saturday evening, 9/27/15. I ordered the Pad Thai with steak for $11.95 and my husband order a variety of rolls. My meal came out first while my husband had to wait for his rolls. Not well-coordinate  from the kitchen. He said the eel and crab rolls were great but the tuna roll was disappointing. I really liked mine minus the tofu (I hate tofu!) and chopped peanuts (the smell can give my husband a reaction!) on the top. Nowhere did it indicate these items would be part of my meal and were NOT on the menu! I expected noodles with steak period! My husband has a peanut allergy! It was a chilly night and I wanted a cup of coffee. \"No coffee.\" Ok, maybe tea. \"We only serve green tea.\" Really? No other tea choices? \"No.\" Very disappointed! We live in New England! My husband also ordered sushi which he said was pretty good. We looked at the \"happy hour\" menu and the beer selections were not impressive or remarkable. Not a draw for happy hour for us and our friends. The service was good, the staff was friendly and the decor is really nice. I gave it only 2 stars because of the above-poor description of my order (nut allergies are serious!), poor timing of my husband's meal, no coffee and only one type of tea! After dinner, we went to McDonald's for a fresh, medium coffee for two!"]], "Ginza Japanese Cuisine": [], "Ichiban Japanese & Korean Restaurant": [["Michael R.", "Great spot for quick and tasty sushi. The tuna maguro was exceptionally good. Steamed mussels were also tasty and not over-dressd with sause. Great value for the quality, dinner for two with wine under $50.Only downside is limited parking, (parked across the street at Tangers Market)."], ["Cindy L.", "I always order the sundubu jjigae (soft tofu soup) when I want to test out a new Korean place. Interestingly, they just call it the vegetarian tofu soup but it comes with delicious morsels of squid and a couple of clams! It came out bubbling in the classic stone pot. The soup wasn't too salty- it had a nice depth of flavor. The side dishes that came with the soup were also all delicious and complemented the broth well. My favorite was the slice of tofu in the sweet and savory soy sauce. Browsing the menu, there seems to be a great variety! Now that this place passed my sundubu jjigae test, I'm excited to see how they handle the BBQ!The only downside was that it took about 30 minutes for the food to come out."], ["Amanda L.", "Parking is very limited, cramped, and a pain in the A but parking across the street is accessible. Came here during dinner time with a large group of about 10. Our server was helpful and did his best to accommodate all of us. I got the Sashimi Bibim-Bap with raw tuna cubes, raw salmon cubes, white fish & vegetables. Hole-E-Chit, this dish was expensive but diddd I choose right. I loved it so much, the raw fish blended well with the vegetables. Who knew sashimi bibambap could taste so darn good? My eyes got a little taste too. The different colors from the sashimi and the veggies was alluring and increased my appetite when my bowl was brought out. Not only was it good but pretty healthy as well. Everyone around me was surprised as to how I could handle so much rawness at once but when you love something so much, you eat it all and accept the risk of salmonella poisoning...which I did NOT get!! Otherwise,  I wouldn't be able to write this chuckleworthy review."], ["Ginny L.", "I love sashimi bin bimbo! Very fresh and taste so delicious! it's a good mix of Japanese and Korean food"], ["Angie N.", "I went here for the first time for lunch last Wednesday when I got out of work early due to a snowstorm. My friend and I were both craving sushi and wanted to go somewhere close by. The parking lot in front of the restaurant was pretty small, but that certainly wasn't a problem for us, since when we first got there, there was only one other car. It's possible that there's more parking, but it was hard to tell with all of the snow. There is street parking available, though, so I'd imagine it's not too much of a problem even during busier times.The restaurant has a sushi bar as well as booths. We sat in a booth and immediately ordered edamame as an appetizer. It came out quickly, was well-prepared, and also came with a few slices of sweet red bell peppers, which was a nice addition.  I was pleasantly surprised by the lunch menu deals. I know really well-priced options at lunch time are pretty standard, but I don't go out for lunch during the week all that often, so it was a nice surprise. My friend and I both ordered from the Lunch Special Sushi Bar Menu, which offers a variety of sushi/sashimi choices currently ranging in price from $8.50 to $14.95 and includes either miso soup or salad. We both ordered the salads, which were a little heavy on the ginger dressing. I did notice another reviewer mention that as well. We both ordered option C of the Maki Lunch Combo ($9.50 at this time), which comes with a California Roll, Eel Cucumber Roll, and Salmon Roll. My friend goes out for sushi a lot more often than I do and was happily surprised to see eel on the lunch special menu, as she said most sushi restaurants she's been to don't include eel with their lower-priced specials. I loved the sauce on the Eel Cucumber Roll. I do wish they had put a little more on, but that was definitely my favorite. All of the sushi tasted fresh and I ended up taking half of the order home for dinner (there were 22 pieces total - 8 in the Eel Cucumber Roll, 8 in the California Roll, and 6 in the salmon roll, which is why I was so impressed with the deal. I can't remember the last time I got 22 pieces of sushi for $9.50!).For those who care, they do have a few TV's throughout the restaurant. That's never something all that important to me, but it could be a nice distraction for kids or nice if you're interested in watching a game (assuming they take requests for changing channels).I would definitely visit this place again. I'd be interested in seeing what it's like on a busier day or at a busier time, but would also just be fine with ordering lunch again."], ["Lucy L.", "Haven't been here for so long and a sense of nostalgia prompted me to write this review. They've changed their staff quite a lot from what I remembered. Now they seem to be more attentive and polite (at least my waiter was). I had a soon tofu which was not as flavorful as the one I've had in West Hartford, however it has more content. A choice of soup and salad comes with lunch order. The 7 side dishes were appetizing."], ["Luna P.", "Had the pleasure of tasting the salmon entrée. Hibachi chef was fun but made many inappropriate sexual comments. I guess when half the hibachi table guests are drunk off sake anything flys...even the food!"], ["Erica K.", "I think that we ordered the wrong things because everything was all very confusing and our waiter must have been new because he didn't have the answers to any of our questions. We ended ordering way too much, as we got Kai Bi (BBQ short ribs) and sushi. The short ribs were delicious, but a bit chewy. The sushi was good, interesting but I have had much better. The BBQ ribs came with a variety of side dishes that were not explained to us, so we had no idea what we were eating. We didn't really like what we ate and I wish we had a better understanding of the menu."], ["Anne C.", "I am going to echo the sentiment of many of my other Yelpers in that this is just down the street from where I work, I know where it is, but never seem to make it down here for lunch.  Luckily I had the opportunity to finally eat at Ichiban today when I met a friend for lunch whom had a hankering for sushi.  We arrived around 1pm and I noticed that there was still a healthy amount of patrons in the restaurant.We were seated quickly by an employee who gave us our menus and disappeared.  In her defense, she seemed to be the hostess, waitress, runner and bus boy so I did not mind having to flag her down to get our order in as I only had an hour.  Ordered the BibimBap - chicken substituted for the beef and since it was during lunch I was offered a miso soup or salad.  Chose the salad, and glad I did when my friend's salad came out drenched in the standard sushi restaurant sesame ginger dressing.Soon after are meals were brought - I totally failed in my ordering by not getting my Bibimbap in a stone bowl - make sure you don't make the same mistake.  Without the stone bowl - the dish loses its heat rather quickly, so when you are trying to mix the sauce, it takes a bit of effort.  I was also disappointed that the yolk of the egg was completely solid.  Love getting Bibimbap with a runny egg - it just tastes better!  I was also surprised (it was my first Bibimbap at a restaurant other than Pick n Mix) that it came with 6 small Korean appetizers.  I just wish the waitress would have been able to explain to this newbie what was in each bowl - I even made it a point to stop her as she whizzed by my table but the only response was \"Korean appetizers\"...uh yeah I got that!All in all the food was flavorful and fresh - loved the Korean side dishes that came with the meal and for $10.95 - it's a pretty good deal.  Just wish the service was better - especially on the tail end of lunch on a Monday afternoon."], ["Kelly L.", "I have had mixed experiences at Ichiban. Sometimes the food blows me away, and other times I leave disappointed. Since it's in my neighborhood, I keep going back so here's what I've learned so far. I am not a huge fan of Korean food on the whole, but this is where Ichiban excels.  The Bibim-Bab is wonderful and comes with interesting Korean pickles and garnishes that vary depending on the day. The Jam Pong soup is tasty and helps clear up any sickness. If I was just rating their Korean dishes, I would give 4 stars.   The remaining dishes range from 3 to 4 stars.  The noodle dishes and sushi rolls are quite good, but not consistently.  These dishes are a bit pricey for inconsistent quality.  The service is also spotty; you have to wait forever sometimes. The last time I went there was an amazing server, so hopefully that is changing.Overall, I give Ichiban 3.5 stars. Go here for the Korean food, save the rest for other restaurants."], ["Tim M.", "Having recently visited Japan, I was very excited to see some of the options on the menu including Tonkatsu, Shabu Shabu and Sukiyaki. I had the dumpling appetizers which were standard but nothing special and the Tonkatsu (breaded pork) entree. Although nothing can quite compare to the full Tonkatsu restaurant experience in Japan, it was pretty authentic and tasty! I would certainly recommend for authentic Japanese cuisine. Didn't try any of the Korean dishes so can't comment on those yet"], ["Daniel C.", "Used to come down here a lot when visiting friends in Amherst, always liked the place, here's why:Their noodle soups are on point, I've tried all of them and they're always consistent. Good customer service, the server is always incredibly attentive. Their Chinese food isn't as good as their Japanese food, even though they're Chinese I believe. But their dinner special is a good deal; you get three things for the price of one. However, they taste very \"Americanized\" to me. The place is warm and clean, good place for a nice gathering. Dessert is complimentary with fried ice cream, which is always a plus. I only wish that their Chinese food has better quality. Otherwise, this place is fantastic with great price!"], ["Amie C.", "Great for an inexpensive and good lunch near downtown Hartford! Bonus they have a small parking lot which is hard to find. Stopped in for lunch with some co-workers and we all enjoyed it! The serve was fast so we were able to get in and out during our hour lunch break. I had one of the Maki lunch specials: miso soup, Californian roll and salmon avocado roll for $8.50. The other lunch specials range in price from $8.50-$14.95. So great price for sushi for lunch. It is nothing crazy fancy but if you are looking for good quality sushi at a reasonable price this place fits the bill."], ["Ray C.", "I tried the Sashimi Bowel the other day and it was great! I also recommend the lunch bento box #19 BBQ short ribs."], ["Lily B.", "Our absolute favorite Korean/Japanese restaurant. No one can rival their sashimi bibam bop among other things. Staff is friendly and competent. Love, love, love!"], ["Jamal G.", "When we arrived, an older Korean lady impatiently asked how many of us there were.  Later she tersely took our order and spat as she repeated it to us loudly.  I actually saw little droplets spraying through the air.  Was she a waiter or a drill sergeant???  When the food came out, it looked good enough.  The bibimbap was good, but my chirashi bowl was bad.  The tuna tasted fishy and was cut the wrong direction along the grain, making it hard to chew.  I guess this is a place for Korean food.  Don't get the sushi!"], ["Ross N.", "I tend to shy away from seafood and sushi restaurants. When I decide to be adventurous, I head to ichiban. I have yet to find a better sushi bar in the Hartford area. I stick to eel, tuna and salmon hand rolls. I find them very tasty. I've also had their BBQ dishes and they hit the spot. Their seaweed salad is good too. Sometimes ordering had been a challenge as the servers don't speak the best English. Overall it's a good sushi and Japanese restaurant. ."], ["Lynn M.", "Ichiban is good enough for Hartford. It has an extensive menu and most of the things taste pretty good to me. I enjoyed their jap chae, sweet and sour beef, among many other good dishes. However, the last time I went, my friend and I ordered a jjam-pong (which is a spicy noodle soup dish) and they gave us barely ANY noodles. It was bizarre. I had taken one bite and she had taken one bite, and there was maybe a bite left of noodles. So we asked for more but they acted clueless about it and didn't apologize, which I found to be odd. They didn't charge us for more noodles though, so that was nice. I recommend this place for people craving Korean food in Hartford."], ["Mari K.", "I came here once for the Korean food,  and I enjoyed it. Kimchi and noodles were decent, although not great.  However I ordered sushi from them this week, and was very disappointed.  The quality is just not the  as some of the other sushi places around here.  The spicy scallop rolls were not very tasty,  and just had a dollop of spicy mayo messily added tp each.  The philly roll was ok (that's hard to mess up). It had avocado in it which was different.  The Alaska roll did not have avocado.  The rainbow roll was ok but not great. I may go back for Korean,  but I won't for sushi."], ["Martha C.", "As a vegetarian, I am quite happy here.  They have a number of dishes with tofu or just vegetables, and they are very good about making things without meat if you ask them to. My favorite is the stone pot bimi-bap with tofu.  They are nice people and not pretentious, and the food is always good and the service is fine."]], "Ichiro Hibachi & Sushi Bar": [["J.m. A.", "Good place to eat friendly staff. I would recommend to everyone who's looking for good food and excellent customer service."], ["Stephanie C.", "We recently took a 6 year old to hibachi dinner for his birthday.  With hibachi you know you're going to get a good show, a lot of food, and a hefty bill.  as long as you're comfortable with the hefty bill then you will be satisfied with Ichiro.  Our waiter was a very straight-forward and no-nonsense kind of guy.  The manager came over a few times to ask how our experience was - that was a nice touch.  However he also came over and encouraged our guest not to play with his milk so that it didn't spill.  Dear Manager - he is 6.  He is also with two adults that are caring for him.  Thanks for the tip but you freaked him out.  At the end of the day it was almost $100 for two adult meals and a kids meal.  This didn't include one ounce of alcohol.  Definitely steep but the experience was fun for the birthday boy and we have leftover noodles for dayyyyyssss."], ["Michelle W.", "There's nothing exceptional about this place. Just your run of the mill hibachi restaurant with \"ok\" food. Good location in blueback square.I ordered the chicken and shrimp hibachi, a shrimp tempura roll, and a scorpion bowl I split with a friend. It was all good. The drink was pricey and weak. Overall, not a bad experience, but there are cheaper places of similar quality in both food and ambiance. I won't be returning to Ichiro."], ["Kevin C.", "Other than coming for Hibachi, I wouldn't recommend coming here. Food is overpriced and the quality just isn't there. The members of my group that got the sushi said it was just too buttery and didn't taste right. I personally got the teriyaki sirloin steak, it was also just okay. There are better places around for a better price."], ["Paul C.", "Maybe I am spoiled from eating sushi in boston. Sushi here was bland. My tempura was not crispy enough and had no taste. The sauce for the tempura also did not do the justice. I feel for the quality of the food here, it was a little pricey.The rolls were ok, though."], ["Erica K.", "Went back last night and it was super busy.We were sitting in a very high traffic area, so the waiters came zooming back. Ordered our usual sushis, I am falling in love with the avocado roll. I love how the bacon wrapped shrimp is completely covered in bacon, not just the middle. That  way you get bacon in every bite! Love this place!!!"], ["Jackie D.", "The sushi was mediocre, but there were a lot of options. I think this is a good and fun place to eat hibachi rather than sushi"], ["Dana Y.", "I ordered for delivery around 8pm one night. The food came really fast and the delivery guy was really nice. I called in the order and the guy who took my order was really helpful in explaining the menu. I was expecting a lot from them since it's one of the few restaurants that had decent reviews around the area. But I was disappointed. I'm from New York, so maybe it's different... but usually when you order one order of sushi, it comes with two pieces. I just assumed that since I thought there was no way one piece of eel sushi can be almost $3. I was wrong but that's my fault for not reading the menu correctly. So, in hopes of satisfying my sushi cravings, I was left with just four little pieces of sushi that cost me over $15. So disappointed!!! The only plus about the sushi was that the sea urchin sushi was great. It was really fresh!I ordered the chicken hibachi dinner. It came with soup, salad, noodles, rice, and vegetables. I was not particularly impressed. It's something I can easily forget about. The noodles were soggy and bland. The rice was too hard. And the chicken was overcooked. I liked the sauce that came with the chicken but like that's at every hibachi place, so nothing special. It was a huge portion though. I was physically satisfied but I didn't enjoy eating it."], ["Allison R.", "I can't speak to dining in at Ichiro, but I order delivery from here frequently and love it. Delivery is always super fast (under 30 minutes the past few times I've ordered) and friendly.I adore the grilled Amazing Calamari -- so tender! If you're an eel lover like me, they've got lots of great options; my favorites are the Alligator Roll and Dragon Roll. Need some comfort food? Try the Nabe Yaki Udon with poached egg...mmm!"], ["Lex G.", "Good but not the best. However, I would definently come back again. Sushi was fresh and above average. The service was one of the best I've ever had. They doted on me, but not to the point where it was annoying - it's a fine line!"], ["Melanie M.", "The food is great but the past couple of times I have gone, my server has been \"Angela.\" She is very rude and has rushed us out of the restaurant. The first time we thought she may have had a bad day and still tipped her 30% but the second time, we'd had enough!She didn't even ask us if we wanted another round of drinks before she proceeded to bring us our tabs. As if that weren't enough, she hovered over us as we signed to pay.Under normal circumstances, I would have given Ichiro a 4 or 5, but her service is a 1."], ["Tiffany G.", "I've been here several times, and just about every time I've had a groupon. It's best to make a reservation if you're looking for hibachi on a Fri or Sat night. Tonight I had the hibachi scallops, and they were cooked to perfection, just like last time I went but didn't want to wait even longer for a hibachi table so I just ordered Teriyaki Scallops. The drinks are good, the meals have always been good, the hibachi chefs are always entertaining and someone is usually around to refill your water (a pet peeve when they aren't). Like most of WeHa center, you have to pay for parking but there is a huge lot behind the building. It's great to go here with a groupon, but I'd go even without one if the mood struck for hibachi, everything is always fresh and tasty. The Blood Orange Cosmo gets a thumbs up from me. I've had the steak and salmon for hibachi too, and again, always cooked to perfection."], ["Michelle C.", "I would give this place an extra star if it wasn't for the horrible, nasty waitress. We came in here for a sweet 16 birthday dinner. My husband and daughter were 10 minutes away and they seated the rest of us be grudgingly.  Granted we did not have a reservation but they gave us a really hard time about our party of six. For God's  sakes, is a Tuesday!!!!They hurried us to order and made us order our drinks,  appetizers and dinners at the same time even when people were even at the table yet! They said they will take their order when they get there. It was just a blatant way to hurry us out of there before we even ordered!!!!!Food was okay. Salty. It was just such a rush job, I don't even recount the food. They rushed the check over and added an 18% gratuity and which they failed to mention.  Won't be going back there any time soon.  Jeez. Happy birthday to you.I appreciate the reply by the manager. I just don't know how to reply back!"], ["Lily B.", "Ichiro was our first choice sushi restaurant for years, but the last few years the quality has been inconsistent, and about a year ago deteriorated to the point where we never returned. Sushi was skimpy and not that fresh tasting. I would love to see them return to quality of the past, but there is no reason to go right now."], ["Janelle S.", "Who doesn't like Hibachi?  It's fun, it's delicious.  Having said that, it's so LOUD at Ichiro.  They are set up with about 8 large hibachi tables in one big square room.  With all the Hibachi \"shows\" going on, there's a LOT of VERY LOUD activities going on!  This comment makes me feel like my grandma, but it's the truth!!!!  Our Hibachi guy was fairly entertaining, I guess.  Again, I feel like a sour puss when I say that I wasn't impressed by his ability to create boobs and other things out of vegetables.  I guess I am really am turning into an old lady now!  *sigh*  The food itself was tasty - I got the chicken hibachi.  It just would have been nice to be able to hear and talk to my friends without everything else going on.  I guess this place just isnt' really for me and I will stick to eating in their regular dining room if I come here again!"], ["Jennifer D.", "I just moved here and was looking for a new sushi place. I order sushi at least twice a week. They not only got my order completely wrong but the avocado was black inside the roll and the manager was extremely rude when I called to complain and did not offer a discount or refund. I had to throw out my rolls. I will never go here again. :(I ordered at 8:23 on 8/24 through Grub Hub. Thank you for the kind note that is very nice of you I'll even change the review but it doesn't excuse the fact that the manager on duty was just plain rude when I picked up he was as well. I was also charged $24 when the price on the bag of incorrectly prepared food was $18. It was the right bag but specifications ignored and poor ingredients."], ["Ishita S.", "HORRIBLE HORRIBLE HORRIBLE. The waitress, Angela is the worst. She was incredibly rude and rushed you while you are trying to order. First time visit, and will never go again. If you are a strict vegetarian like me, stay away. Even you inform the waitress that you are vegetarian, she does not rely the message to the chef who ends up cooking your food in the same area as the meat that was cooked. It's disgusting! I complained the manager because I was not about to pay $15 for a meal that I did not touch. In the beginning the manager was resistant but he was fair in the end and took the meal out that I didn't eat due to it being cooked on the same grill as the meat. The chef was very entertaining and it's a fun atmosphere. If it wasn't for the horrible waitress, I might have given this place another try."], ["Maja K.", "Went to this place a couple of times and both times, were disasters. The staff is very rude and have no idea how to communicate with customers. The hibachi chef kept making inappropriate comments to us girls and laughed it off! They rushed us along and never asked us how our evening was (We had a birthday dinner there).  Not worth the money! Give your business to another place, these people will not care either way."], ["John M.", "Right in the middle of West Hartford Center this place just doesn't live up to the caliper of its surrounding restaurants.   When I think of dining in WHC I think of exceptional food and atmosphere - the outdoor dining is pretty cool but the food is just \"ok\"."], ["Brittany T.", "I order from here quite often because I work in the area and they are always quick.. Usually it's always very good but today idk what happened.. Half my rolls unrolled as I was trying to eat them which normally doesn't happen and I found a hair in my ginger.. For a regular customer I was disappointed in my lunch today- not to mention it was almost $13 down the drain because I had to throw it away :("], ["Jason S.", "I'm not particularly impressed by Ichiro as a whole. The food was good but the service left a bad taste in my mouth. My friend and I arrived at the restaurant around 6:30 and we were not asked if we wanted to dine at the hibachi grill or a table but instead were simply shown a regular table. I noted this to my friend and we surmised that since the hibachi area was darkened and it seemed like no one else was there that it might not have been open for whatever reason.The restaurant wasn't busy at all but our waitress was perhaps a bit 'overly attentive' when it came time for her to ask us for our orders. I felt as though she was a bit crass and could have used a different tact when approaching a diner since this is a bit more of an upscale restaurant than just simple takeout."], ["Jen H.", "There are few times where I speak negatively about a restaurant experience. My time at Ichiro is one of them Being prompted to go due to a Groupon offer of $35 for $50 worth of food, I felt excited. In the past my friends and I have had great Groupon experiences with Ichiro, as well as great experiences with their Happy Hour. My friends and I went for Happy Hour, since in the past our Groupon was able to be used for that time. Yet it wasn't until we finished our meal that they said our Groupon could not be used. The Groupon they made did not note that it couldn't not be used with Happy Hour, nor did it day it could not be combined with other offers. However, my one star rating comes from the way the restaurant dealt with this conflict. The wait staff and manager were unprofessional in their methods. We pointed out the Groupon flaw and the manager just stormed off. He left us at the table two hours without telling us if he would honor the Groupon or not. They mostly stood from afar staring at us until we gave in and paid the full bill. I had thought to believe that in situations like this, the restaurant would own up to their mistake of not including in their fine print that Groupon could not be used with Happy Hour. But instead it led to my friends and I sitting for an extra two hours without the manager ever returning with a solution. It's safe to say I will not be returning to Ichiro and will take our business elsewhere."], ["Sarah C.", "This is an A-OK sushi place, especially during happy hour if youre looking for a cheaper sushi option that wont be questionable. That being said, Ive had MUCH better sushi in the area (think Feng, even the rolls at Cuvee) but it was good enough. We went during happy hour and at around 5pm we were the only ones there. This meant service was super fast and that was fine with us. The awesome thing about happy hour is $2.50 Sapporos and Kirin bottles (plus some others) and $1 bowls of miso soup! I thoguht the miso soup here was pretty great, a little on the salty side, but i happen to really like mine that was. Had a good amount of tofu, seaweed and scallions. The pork Gyoza appetizer was also good and came out piping hot ($4). After the apps, i tried the spicy salmon crunch roll and the Philadelphia roll. Both were good, and the fish tasted fresh. The salmon crunch roll still had some \"crunch\"...sometimes you get a place which obviously makes the filling beforehand and the crunch has turned not-so-crunchy. Each roll was a good size, nothing to rave about, but definitely solid sushi ($4 each).I would like to try their hibachi one day and live close so will probably go back. However, i dont think i'll be changing my preference over to this place. I would still rather go to one of the Ginza's in HArtford or Bloomfield. Another plus though, patio seating. So on a nice day its great to sit out in the center with a roll."], ["Mari K.", "I've never tried the hibachi here,  but I've tried a lot of the sushi and rolls,  and many soups and apps.  I Love the food and usually the service.  I'm especially fond of their spicy scallop roll.  They make theirs a bit differently than anywhere else I've ever had them,  and I'm addicted.  Their other rolls are also good, and their sauces are always tasty. I've started getting takeout from here a lot more often because even the basics (Alaska roll,  rainbow roll,  philly roll) are more consistently good than most other places nearby. I mentioned that the service is usually good. For example, a while back I had someone named Dan who I still remember, because he was fantastic. Last time I dined in,  it wasn't so great.  We were seated quickly,  but then the waitress kept forgetting about us.  It took a long time to get drinks.  We never got utensils - I ended up grabbing some from a nearby empty table. I know it was busy,  and there were larger parties there,  but we felt a little neglected.  The waitress also seemed annoyed when i told her i had a yelp deal i had purchased ($10 for $20). She took my cell phone with her into the back room to check on it,  which was weird for me.  We hadn't had great service,  so I decided to tip accordingly, slightly over 11% on the original total,  before the yelp deal was applied. The waitress saw the amount and got upset,  and came back with the receipt to make sure I knew that i should tip on the entire amount,  not the amount after the yelp deal was applied. She rudely put the receipt in front of me and handed me a pen and stared at me until I changed the amount to 20% of the original total.  Now,  I'm typically a good tipper. My general rule is 20%, and if the service is great I do more.  While an 11-12% tip is low for me, and I'd never tip below 10% regardless of service,  I felt that my tip accurately reflected my dining experience that night, and the amount of effort/care she'd given us.  I thought that it was rude for the waitress to push me to change it the way that she did.  I haven't been back to dine in, but the sushi rolls are so good that I do still get takeout fairly  regularly.  Also,  as I said,  the service is normally great,  and this was an exception."], ["Stephen T.", "In a situation like last night where the weather breaks...everyone headed to west hartford! There was the unfortunate 1 hour wait at 8pm at a few destinations that were first on our list but Ichiro came through for us in a pinch!Absolutely nothing to complain about. The place was packed but we were sat immediately intoned inning room. We were last in the shuffle for a few minutes, but as soon as our super friendly waitress saw that, I felt like we became first priority and offered great service.I ordered off the hibachi menus the filet and chicken combo. Huge portion with fried rice, noodles, vegetables and shrimp.Lauren had the three combo of sushi, salmon, tuna and California rolls. Very fresh and great presentation. Awesome too was the $10/20 yelp deal that I bought at the table and applied to our check. The acting manager also came around to each table to ensure everyone was happy with the experience.Will return."], ["Mike R.", "I am taking the time to write this review because I don't think the 3-star rating right now is even close to fair. How is it that little pizza shops are outperforming Ichiro on Yelp? I'm not sure people are making the right comparisons when rating this place. Granted, I have only been here for the hibachi grill, and I can say with confidence that it is an excellent experience. Delicious, fresh food, really friendly and talented chefs, and a very fun environment. I'm not sure the main restaurant area compares, but I do not hesitate to endorse the hibachi grill."], ["Samantha N.", "This is absolutely the WORST restaurant the customer service from the female manager is horrible!!! I would never recommend going to this restaurant everything about this place sucks..."], ["Leah M.", "I have had great meals here and sub par meals. Their drinks are tasty and refreshing and they always have creative sushi choices. However, their apps are definitely frozen then fried because the harumaki always comes out cold in the middle :(. The hibachi is ok, but I prefer other places in the capital region.  They are not offering anything special or especially fresh. The best part of the meal is the Japanese gum that comes with the check!"], ["Jocelyn C.", "I went to this restaurant for friends birthday dinner 2 weeks ago. We had reservations yet were seated until 45 minutes later. The wait staff then did not attend  to our table for another 20 minutes. One of the people I was with was served with a dirty wine glass with lipstick on it, then we over heard the wait staff criticizing how one of the people in my party ordered his food saying \"if they don't like our food they can leave.\" The person who claimed to be the manger (who lied was probably just a shift supervisor) was so rude to birthday girl responding to one of her questions about her reservation with \"it's common sense that......\" Our party of 15 at that point left and went to a hibachi place in Bloomfield  where we were treated with respect and like paying customers. This place allowed over $600 to walk out of the door. I will never step foot in this establishment again."], ["Natasha S.", "RACIST--RACIST--RACIST-----POOR SERVICE--DIRTY GLASSES--DIRTY TABLESI booked my birthday party looking to have a nice time.  My reservation was for 830, when I went to checkin the manager/owner brushed me off and told me someone already checked in for me.  9:00pm my guest and I remained in the lobby. At this time I followed up to see what was the delay? At the time the manager laughed at me and said my whole party wasn't here.  I asked why that was not said to me when I first came in, the managers response was to ask me if I have common sense? I took a deep breath and reminding him about customer service and alerted him to how rude he was being.  I asked if my party could sit at our table while waiting on the last of the guest.  We were told if we wanted drinks we could go to the bar! I took another deep breath and reminded him it was 910 and our reservation was for 8:30. I told him this was my full party and that we would like to be seated.  We were sat at 915 got water at 930, I got up to ask if we could get drinks@930? The drinks showed up at 10:00pm I asked if they could take our food orders at this time.  My friend on her way to pay her meter over heard the waiter and manager laughing at one of the orders placed.  When my friend came back in she reminded the manager how poor our treatment had been.  The managers response was,\" if you and your people do not like your treatment or services your food has not been cook that we could leave.\"  At 10:10pm with only drinks on our table we decided it was time to leave.  We went Sakura in Bloomfield... Amazing service!!!! Our bill at Sakura was over $300 dollars!!!  Black, white or Spanish -- class is upbringing and character!!! Color doesn't automatically give you class!!! I  Ichirio hibachi in west Hartford is an example of a classless establishment!!!!"], ["Jannie P.", "I came here March 14 on a Saturday and thought the waiter we was serving us was rude! She was rude and disrespectful wiling we having dinner with our sisters and her friends and my husband she had to flirt with my husband and tell my husband I'm too young to be married to him! How rude. Waiters should not tell a customer what they should do or anything! I hope she's not my waiter again or I'll have a rude awaken for her."], ["Bill M.", "So I have been to ichiro a dozen times and the last 6 have been so dreadful between service and cost it had me going back for 1 reason.... LOCATION!!! Other than that there service sucks. Our 87 year old grandmothers birthday this past weekend was a terrible experience and will never go back. I would prefer to be yelled at by a china house than this over priced combination plate... My experience here last weekend was my last one at ichiro. Never ever again."], ["Linda C.", "The hibachi was okay. I ordered steak hibachi and it came out really soft and flavorless. I've had better at other hibachi places. I did enjoy their noodles and cocktails. Their shrimp tempura roll was really good. It had just enough of the crunch, without being overbearing."], ["Mike B.", "Just strange.... very strange.  The soup was very different and the sushi was just Ok.  It was an odd experience.  That's all I can really say... I can't put my finger on what was wrong.  Maybe the Hibachi is better?  It looked like a great set up!"], ["Marieke S.", "Good waiter, very friendly and always checking on us. I thought the food was pretty good! Came out a decent times. Has the avocado salad which was delicious! Then I had some simple sushi which you can't really go wrong with, I think I got the Philadelphia roll. Either way it was a nice place and prices were decent. Would go here again."], ["Steven T.", "Another fantastic entertaining night at Ichiro Hibachi.  Monifa and I frequent this place often.  We visited this place the night after the blizzard 2013.  It was a Saturday night and we were itching to get out and about.  I've been to this place more times than I can remember.  The hibachi is not only entertaining, but a comfortable place to just \"chill\" with friends.  Like the grill master says, \"no sake, no boom, boom!\" Hysterical time had by all.  Just listening and singing along with him as he grills the food is just the best.    The food is great with its variety of dishes, sushi rolls, and grilled plates.  We had the shrimp and scallops.  I usually go for the steak and fried rice, but for some reason I opted for the seafood this time around which turned out to be just as good.  Try the soft shell craft rolls, spider, dragon and the spicy tuna! The service is effective, efficient and done with a smile.  The people are friendly and the atmosphere is comfortable.  Yes, I know, its West Hartford center...who knew??Ok, until next time.  Try it out....Cons:West Hartford Center parking is not free.  Meters operate Monday - Saturday, 9AM to 10PM."], ["Sanh A.", "I haven't tried the sushi here but will have to say I was impressed with the length of their hibachi shows. The shows are longer and the chefs appear to know a few more tricks. The portions are generous and the food was fresh. The only issue I had was a questionable utensil. The food wasn't amazing but it didn't disappoint either. I noticed that their hibachi shows are a tad more than other places but when you take the larger portion and longer better hibachi show into consideration Ichiro isn't that bad of a deal. Parking : street parking is always annoying.Service : they lost one star there because I waited forever to get a glass of water."], ["Ronnie M.", "I've eaten in this restaurant twice, once for lunch/sushi a couple of years ago and once for dinner/hibachi last summer.  I have been to many hibachi restaurants in my life going back to Benihana's on 56th Street in Manhattan in 1966 (yes, I was a little kid), so I consider myself well informed on what they should be like.  Ichiro is just average, in my opinion.  There are better places in the area for both sushi and hibachi so there isn't any burning culinary reason to go here.  OK, I like a good hibachi show, but this was bordering on stupid and annoying.  If that chef yelled \"Sake, sake, sake, hoy, hoy, hoy\" ONE MORE TIME I thought I might lose it!   And that bit with squirting water in people's mouths was even more mortifying.   I thought to myself, \"Am I in a Japanese restaurant or the stadium at a Scottish football game?\"  Realizing I needed to grin and bear the situation, I had a few drinks because I figured it would help me feel immune to it.  Well, it worked.  I almost don't even remember that the yelling was coming from every table by the time we left.  If you ever dine here, you might bring along a pair of earplugs if you want to enjoy your food.  They don't have any sound deadening in the ceiling.  The food was probably better than I remember, but I was so distracted by all the noise and theatrics, to be honest I don't really recall.I left in a better mood but still nowhere near loving the experience.  I noticed a few other people at the table also seemed to be putting up with it.  The looks on their faces ranged from \"WTF?\" to \"This is so stupid!\"  I guess management thinks they attract people with that tripe, but I actually think they're turning off more people with it than they think.  I mean, if people are coming to a site like this to complain about it, that's probably just the tip of the iceberg.  Maybe if they took the decibel level down just a bit they wouldn't have to offer as many Yelp or Living Social deals to make ends meet.  Just a thought.My first experience at this place was actually much better.  It was a weekday lunch near the sushi bar.  The sushi was actually not bad at all and there were no hibachi tables going so it was pretty quiet.  I had take-out sushi another time but it wasn't anywhere near as good as the first time, so I wonder how consistent it is."], ["Wei X.", "Not many sushi restaurants nearby my new place offer delivery service. Luckily found this one. Well the guy who talked on the phone was kinda rude to me. Very impatient and I felt like to hung up in the middle.. but anyway I still ordered and the delivery was faster than expected. Food was.. just ok. So I don't think I will order again.5 stars for delivery. 0 for Ordering service -really disappointed :((. Overall I give 2"], ["T P.", "I always want to like Ichiro-Hibachi/sushi that delivers! But they keep screwing up the orders. They often forget the hibachi sauces, which I have started to remind them to include in the orders. That helps but it is not a foolproof way to ensure sauce inclusion.And c'mon! What is hibachi without those great ginger & mustard sauces?But today their customer service about their two mistakes was so horrible I've sworn off them. They did not include the shrimp shumai or the fried rice-which cost $2 extra. Did they offer to bring replacements? Not unless we agreed to wait another 45 minutes for our whole order to be replaced & return our entire original order to them. After having waited an hour to get it to begin with.I refused to make my niece stop eating her steak and wait another hour for dinner. I have packed up the white rice to return to them to \"prove\" we aren't lying. And did I mention they made me repeat a half a dozen times that yes, I had emptied the whole bag and indeed there really was no shumai?!He still didn't believe me and had to go check with the chef. Ichiro, your mistakes are not my hungry niece's problem. Learn to treat your customers with respect and...I don't know...maybe check the orders for correctness before delivery to avoid these things in the first place?I'm done with them."]], "Tokyo Sushi III": [["Justin S.", "Definitely 4 stars. I read about the service issues but there were only two other tables so service was not an issue although this was at 4:30pm. Miso soup, seaweed salad, edemame were all great appetizers. Fire & Ice and Pink Lady rolls were really good. Waitress promptly refilled drinks and was courteous."], ["Yuchen Z.", "Tip: If you sit at the bar to eat, they give you a complimentary seafood salad (with seaweed, sushi pieces, & cucumbers). It's a small one, but it's free! I think TS is a pretty decent sushi place. They have a variety of food on their menus, ranging from sushi to udon to rice dishes. They have lunch bento boxes under $10 (soup, salad, shumai, and main entree) but they do not offer dinner bento boxes. Their wait staff is very accommendating and nice and it feels like they check up on you often to make sure everything is OK. The food itself is decent, aka. 3 star worthy but not 4 star worthy. You can get your sushi fix here but don't expect it to be the best sushi ever or anything. The entrees are very large (read: you can pack your lunch for tomorrow) but the flavors were lacking a little bit. Atmosphere: simple decorations that make it look like a typical sushi place--with the bamboo decor, the red lanterns, etc. The place looks like it could only cater to smaller parties."], ["John-Paul S.", "Man ill tell you I loved this place, mainly because of the food...get the ty Hong roll...outstanding. ..little pricey but I enjoyed feeling so good after I ate"], ["J M.", "Absolute worst! They advertise delivery...you call several times (usually get a few hang ups) finally get someone on the phone who tells you it's 90 minutes! We drove to get pick up instead- they gave us the wrong order. We called within minutes and they were arrogant and would not deliver the correct order or refund us. Basically we got stuck with the bill and someone else's food- Ichiro Sushi on Farmington Avenue is 100% better"], ["Calida J.", "Horrible horrible service! I will never go back again. I didn't think servers were supposed to argue with the customer about a mistake on their order. Really disappointed."], ["Laura F.", "This is my go-to sushi spot, and I'm surprised that the reviews aren't better.  The food is fresh, tasty, and the prices are unheard of in West Hartford.  A creature of habit, I always go for the Spicy Twin with brown rice (they can substitute brown rice upon request), but I have tried and enjoyed other rolls off the special menu as well.  You know what else is awesome?  They have bento boxes on the weekends. Go get yourself an obscene amount of lunch for $7-$10.  And if you're having a party, there's a private-ish room you can reserve for your group, something my friends and I have done for many birthdays."], ["Steve M.", "Best sushi in town. The ambiance is nice and they are very attentive. I literally moved to this neighborhood to be walking distance from Tokyo Sushi."], ["Melissa C.", "The food was absolutely delicious and very competitively priced. My friend and I were able to eat dinner for about $40. Our dinner included a special roll for the evening, a sushi entree, a peanut and avocado roll, miso soup (WHICH WAS AWESOME!), a salad, and a Mai Thai. The service was fine; our waiter was very polite and the restaurant was clean. I'll be back."], ["Jason M.", "My girfriend and I stopped by one evening for a sushi dinner. Was it good? Absolutely. Was it fresh? For sure. Was it reasonably priced? Considering this is West Hartford, highly so.But Tokyo Sushi kinda gets lost in the shuffle in a town that's inundated by Sushi places. This one, regrettably, is nothing special. Granted, I would still go here if Umi and Ichiro, it's major competetitors, were packed beyond belief.We had a bunch of different rolls, and they were surely tasty. Salmon, Tuna, Californa rolls, and the like. But nothing on the menu made me go \"Wow, just gotta have that!\" Perhaps a revision of the menu is all this place needs to shine above its competitors. A more fun vibe in the restaurant wouldn't hurt either."], ["Jessica J.", "I have such mixed feelings about this place.Great for take out, not so great for dining in. I love their sushi - it is always fresh and delicious. However, the service always irritatingly slow when we dine in. I'll stick with take out and save the waitress from inconveniencing her with my presence next time."], ["Jaimie A.", "This as of right now is my sushi go to. I've tried a lot of rolls they offer. They have simple rolls from spicy tuna to Philadelphia. If you like tempera sweet potato they do it as a roll and I crave it! They also have an extensive speciality list as well as a special roll. They only ones I haven't liked are the ones with peppered white fish it gave it an awful flavor that myself and friend couldn't eat. Ted roll which was a special last year is my favorite and go to and they still make it every time I go in.(cucumber spicy tuna instead with avocado sliced topping both the spicy mayo and eel sauce topped with red caviar. My boyfriend enjoys the nogi kaki nobu ( I believe that's the name :|) it's a very large soup in a clay pot with large noodles, shrimp, fish cakes and an egg.  The pork dumplings on the appetizers is also great and the sauce with it is to die for. *not for a quick sit and eat. Call ahead n pick up or order $30 in food and get it delivered and it's good enough to do so quickly :)"], ["Marcie G.", "First time here tonight.  We shared the Tokyo Boat for 2.  It was delicious, fresh and beautifully presented.  Included soup and salad for both of us.  Service may have been a tad slow, but we weren't in a rush so it was fine.  We will definitely return again as the food was fantastic and the pricing very reasonable."], ["Rebecca S.", "I am an avid sushi eater, I have tried everything from rolls, to sashimi to sea urchin to o-toro. To say the least, I'm pretty picky and now what fresh fish is supposed to taste like. Walked in at 8:45pm ready to try it out for take-out because I live down the street and Ginza in Wethersfield was too far to drive to at the time. Spent almost $90 on take-out ordering the sashimi and roll platter for 2, a spicy scallop roll, a tokyo roll, one order of supposed \"o-toro\" sashimi, and one order of sea urchin sushi with quail egg. I'd have to say honestly, worst decision of my life...for that night..the rolls were mediocre saying that the fish was minced and mixed with spicy mayo and other unknown sauces. The sashimi variety was ok, not super fresh but not bad. Then there is the \"o-toro\" and the \"uni (sea urchin)\"....may I say, I've had fresh sea urchin cracked open and the freshest possible o-toro so I know what fresh tastes like. This was NOT something I wanted to experience, the foul taste of almost spoiled seafood. I should've known better than to order from here, I should've just waited till the next day to get my sushi fix from Ginza in Wethersfield but I learned from this and will not repeat my mistakes! Never again!"], ["David H.", "Our favorite West Hartford sushi.Tokyo Sushi is always clean and quiet.  They are very reasonably priced for West Hartford and they are friendly, so it makes for a perfect spot to get our sushi fix.The sushi is fresh and tasty, and they have a good selection of special rolls.  I wouldn't make the trip for the cooked food, but it is passable for friends who don't like the raw fish.Even with the other impressive options available in town, we will remain loyal customers."], ["Vanessa L.", "FOOD: Decent Japanese food made by Chinese people.  Not being racist, but it makes a difference depending on how familiar you are with Japanese food.  I've come here a couple of times with my husband just to change things up from our usual spots at Murasaki and Toshi (Avon), and it's always been decent food.  Most recently, I had tonkatsu (pork cutlet) and one of their rolls (\"Faxy Lady Roll\") that had shrimp tempura, crab, and some sashimi on top.  Since their sushi menu indicates that you can kind of fix up any roll that you wanted, I substituted the original \"soy wrapper\" for regular seaweed on the roll, and it was quite delicious!  The tonkatsu was a generous portion of two thin pieces of pork cut into about 15 slices each.  It came with a bowl of rice, salad, and soup.  Not that impressive, but still delicious as I love katsu!AMBIANCE: Kind of dim and half-assed.  Not sparkly clean, not dirty.  Not welcoming, not gross.  Just... it is what it is.SERVICE: This is where Tokyo Sushi III loses points.  I went alone for dinner at 4:30pm on a week day and stood at the entrance for a good 7 minutes while two sushi chefs stared at me but never greeted me or gave their host/server a head's up that someone had arrived.  I was so off-put by this, I almost considered seating myself.  If you don't have the staff to have a host at the door, maybe put some bells on the door like other Asian establishments so you have an auditory indicator since the two sushi chefs clearly don't want to be team players.  Finally, the host/server appeared and sat me to a table and gave me menus.  He came back within 5 minutes to take my drink order and ask if I was ready, but I asked for more time and he came back in a reasonable amount of time.  My food came out reasonably paced, but when I was ready to ask for my check, I could not get my server's attention as he was standing by the sushi bar watching TV.  I was all the way across the room near the windows, and I literally stared at him watching TV for 10-15 minutes straight while the sushi guys made him an order for another table.  Kind of frustrating...VALUE: Reasonable prices for Japanese food and sushi.PARKING: some stalls up front, along the side, and behind the restaurant.  Shouldn't be a problem!I'd eat here again, but would have to lower my expectations for good service.  For excellent service and superior Japanese food, Murasaki and Toshi are the gold standard in this area."], ["Timur B.", "Great little restaurant with good service and even better sushi.The specialty rolls at Tokyo Sushi are among the best that I've tried, and with a constantly rotating menu you never get sick of the selection.  My current favorite is the Yellow River roll which nicely combines the flavor of mango with salmon and shrimp tempura.  Furthermore, the sashimi is always fresh and served in very generous portions.  I have never ordered cooked food from Tokyo Sushi, however, sampling cooked foods friends have ordered hasn't been too bad.  After all, this is a sushi restaurant...so lets stick to the raw stuff!The service here is fine, however, if you're expecting a staff that is fluent in the English language you'll be disappointed.  Again, going to a Japanese restaurant I feel more at ease with an authentic staff.  Management is very accommodating, with the ability to serve large (20 people) parties with relative ease, just give them a heads up.  Unless something changes drastically, Tokyo Sushi will continue to fill all my raw fish needs!"], ["Kate V.", "Absolutely the worst service and food. We sat unserved for at least 15 min at the bar completely ignored.  After awhile we found a waitress we ordered 2 drinks which took another 20 minutes and were digsuting! The sushi was bar none the worst. My friend got the vegetarian roll which she spit back into her napkin. Yes, that bad. I ordered a tuna avocado roll, with a soybean wrap. No soybean wrap, and all avocado hardly any tuna, way too much badly cooked rice, and it fell apart so much I couldnt keep it together when trying to eat it. We watched 3 ppl come in to pick up their food and be ignored to the point that they were walking into the dining area to find a waitress. Unnaceptable."], ["Stephanie C.", "I recently moved to WH from New Britain and was looking for something to replace my beloved Sushi California in Newington.  I checked out the Tokyo menu online and saw some very good looking specialty rolls.  As an added bonus, you can order online and they will deliver.  So they definitely are doing the right things as far as customer service.  However - the rolls showed up at my house and were so big that there was absolutely no way to eat them without having them fall apart.  What could easily have been 6 - 8 rolls of fish was mounded into 4.  This was the biggest deterrent because the fish to rice ratio was totally unbalanced.  We did also order the seafood soup which was brothy with sodium floating on top.  So all in all - I'm in the hunt for something else.  There are plenty of great reviews for Tokyo Sushi so there is an off chance that I may give them another try.  Perhaps the traditional rolls are better proportion."], ["Josh S.", "Tokyo Sushi is an excellent place to grab some sushi. Their wait staff doesn't speak English too well, but they understand what you want and get your food to you in a timely fashion. If I go to sushi in the area, it's either Ichiro, Tokyo Sushi, Ginza in Bloomfield or Feng in Hartford. To be quite honest, the sushi at Tokyo sushi is delicious, the location is great- right where Kingswood market used to be- plenty of parking in the rear.You must try the Ty Hong Roll!!"], ["Bill B.", "Huge pieces of fish inside of sushi rolls! Hartford's best quality and Moderate prices to boot, parking is tight in a small lot in this residential area"], ["Brian H.", "Solid sushi without high prices. This place always has coupons available which make it even more reasonably priced than it normally would be. The outside of the building doesn't really convey the size or setup of the place inside. There is always plenty of seating and with a full bar there are great drink options as well. Can't really go wrong."], ["Gary P.", "This is a great little find with some terrific specialty rolls for around 15.00. But the truth is my favorite is sitting at the bar and ordering. The two sushi chefs always slip you a little special something to try out while you wait. I think for the money, best sushi in the west Hartford down town district, even thought its on Farmington. One other thing to notice are the beautiful doors they put in, I noticed them before they opened...beautiful and reasonable for great sushi."], ["Jamie M.", "I have had Tokyo Sushi, eat in and take out, multiple times and have seriously enjoyed it. They make great quality Japanese cuisine and I would give this place 4 stars but...I just found large pieces of sharp plastic in not one, not two, but THREE pieces of my maki rolls. One was a spicy tuna, the other the \"Jazz Roll\", and the third a philly roll. I'm honestly dumbfounded. I love this place, but never want to eat here again. A bloody mouth is not my goal when spending over 50 dollars on take-out.I did call and explain the situation, as well as bring back the pieces of plastic in my sushi. The gentleman who I dealt with apologized. And that was it."], ["Jena W.", "TOTALLY Disappointed. My friend and I live in the neighborhood and were delighted when a sushi place opened up that we could walk to. Our experience was so bad we will not be back. The waitress was not accommodating - she brought my friend the wrong roll, argued with her, and then scraped it off her plate with a fork at our table before finally bringing the right one. There was wooden splinter in my bowl of rice. The miso soup and soy sauce both tasted watered down. When we asked repeatedly to speak with the manager, we were told he was too busy to come over.I was all set to have this be my \"go to\" place, but I will NOT be back."], ["Denise B.", "HIdden gem. Great quality sushi. Love the sign at the side of the store: Drive in Parking."], ["Jason M.", "Excellent food. I had the Pepper Tuna for an appetizer and it was awesome. For entree I had the Sushi Dinner and an Eel/Avocado Roll, that too was very tasty. My date had the Chicken Yakisoba and a Inari Roll and...you guessed it...those were delicious as well. With one drink and all this food our total bill was $57.00. Highly affordable and delicious. The only thing that kept this from being a 5 star rating was that our server was not all that good, she was kinda indifferent, and our food came at strange times in the meal. But despite that very minor issue it was an excellent meal. If you want raw fish, come here."], ["C C.", "I have been here 3 times now (hoping 3rd times the charm), and I do not plan to return. I have ordered tuna, yellow tail and salmon rolls here and they are never really fresh. Twice the tuna has had the skin rolled in, and  I have not been able to eat the roll because the skin was unable to be chewed through. Think thick and tough...I Love Sushi is just 5 minutes away and the quality is much better, as well as the freshness and price! I wanted to love this place, but alas it was a major let down :("], ["Ken M.", "I went there a while back for the Jazz. I figured it would be a bonus that they have sushi too. I have to admit, working for a Japanese company in Tokyo, I am very fussy about sushi, and I usually wouldn't go to a place named after a city in Japan. Most good sushi bars are named after the head sushi chef, the others are owned by other Asians trying to capitalize on sushi's popularity. Anyway, I checked out the fish and decided to pass on it. One can tell by color and/or odor, and this place didn't pass the test. I decided to go with cooked food, and that was just OK. The drinks were OK, and the jazz was great. I don't see this place lasting too long."], ["Danzy B.", "Maybe it's just because it's new and trying hard but this place is great. Hailing from Brookline, MA, I've been to my share of sushi joints but this place is a very welcome addition. The first thing you'll notice is the decor which has this very nice attention-laden vibe complete with beautiful ceiling/glass fixture lighting and of course, the well lit fish tank (with the giant fish, yum). But it's the food that really seals the deal. For  now at least, portions  are huge.GF and I ordered a Tiger and Maple roll. First of all, beware the Maple roll as it comes with a mountain of delicious crab meat surrounded by the roll itself. The Maple roll itself is surprisingly but not overwhelmingly spicy. The crunchiness of the Tiger roll sealed the deal however. We ordered the Sushi & Sashimi combo as well but after the Special Rolls, we had to take it to go. We just couldn't finish. Which is not to say we didn't want to. The fish is FRESH. The tuna is ruby red, just like it ought to be and tasted great. We had most of the sasishi as lunch the next day but still amazing even then.It's gaining in popularity so beware. We got there around 8 but it already had a line. For now, its BYOB but that's fine since Harvest liquor store is right next door and lets you mix-and-match a six-pack of craft brews. Bottom line, try this place."], ["Nicki C.", "Tokyo Sushi III is just awesome!  I've been there several times since they opened and the food has been great each time.  The fish always tastes very fresh.  And their eel is fantastic!  I usually order one of their daily special rolls; they are packed with flavor and just melt in your mouth.My favorite rolls are the eel/avocado, Pink Lady, Tiger Roll, and Maple roll.  I was not a lover of tuna, but this restaurant has made me a fan.  One of their special rolls has banana in it (I know what you're thinking - banana and fish?), but this roll was simply delicious.  The host, wait staff, and chefs are always very nice.  The prices are affordable and the food is just too good.  If you're in the area, please stop by Tokyo Sushi III, you won't be disappointed!"], ["Jonathan H.", "Best sushi in West Hartford. Seriously."], ["Michael B.", "awful service and even worse food, so many great places in the area don't waste your time"]], "Miku Asian Bistro & Sushi Bar": [], "Min Ghung": [["Ian L.", "I thought the food was amazing and fresh. I came here during the building's renovation and the restaurant was 100% running. Sushi was very good, restaurant was very nice and my only complaint was the carpet. Otherwise this place is GREAT. Food presentation was also very pretty."], ["Lauren Y.", "I love this restaurant, It's the best sushi I've ever had in the Hartford Area. So many different choices!! I especially love the weekly specials!! I like to bring friends almost every week, and we enjoy ourselves with a few delicious rolls and some hot sake! Can't get any better than that! I highly recommend this place to anyone!! :)"], ["Christy C.", "I am not a big fan of Japanese food and I don't eat raw fish but Min Chung offers a variety of rolls and sashimi.  They also serve hot kitchen food like teriyaki and tempura.  Their udon noodle soup is delicious and would definitely warm up your body for the winter.  There are plenty of dishes to choose from and will surely satisfy everyone's taste.  What I like the most is their dessert menu, very unique that I have never experience before.  I would definitely recommend this place to everyone.  Oh, and they serve a wide selections of wine and liquor. I tried a Japanese brand one and liked it a lot.  The place is nicely decorated and spacious.  I love the 2 private party rooms that decorate like the subway station.  I think I might plan my birthday party there this year.  I enjoyed my meal because besides the yummy food the service was great.  My waitress was very attentive and pleasant.  I will visit again for sure!"]], "Ginza Express": [["Dickie C.", "A cute little Japanese fast food joint built right next door to Feng, the mother ship.  It was within easy walking distance of my office, and I was in a teriyaki mood, so how could I say no?  It's a small place, but seating seems reasonable since most people get their food to go.  Anyone expecting Ginza-style decor might be disappointed; the place looks like any other take-out joint except with fancier signage.I went in at 11:45, thinking to beat the lunch rush, and I was in luck: I went right to the register and had my meal in hand a few minutes later, ready to eat.  I ordered the basic chicken teriyaki, which comes with rice and steamed vegetables.  I added my own dollop of beloved Sriracha sauce, and dug in.  Sure enough, the place began filling up just as I sat down; a nice mix of working-class people scoring teriyaki while the more white-collar types loaded up on sushi.  Ginza seems to be successfully fishing from two ponds at once, and I salute their savvy.The food is quite good, especially for the price.  You get a nice helping of teriyaki for six bucks, and it's warm and flavorful.  Pickier (or hungrier) diners can get white meat only or extra chicken for a few more dollars.  Shrimp, tofu, and even eel are on offer if you want something more exotic.  I haven't tried any of the sushi, but it was selling like crazy, so take that as you will.  This isn't food that will change your life, of course, but it's definitely on the high end of lunch spots in the area.  Oddly enough, this place is cheaper than the teriyaki food cart down the street at State House Square, despite the brand name and location.Solid food, fair prices, fast and friendly service, and a clean joint - can't really go wrong.  I'll be coming back on those rare occasions when my cheapness doesn't cause me to bring my own lunch."], ["Victoria S.", "I will not return.  I wanted some quick sushi and I left frustrated with disgusting food.  When I first arrived around 12:30, I checked out the sushi case but they were out of everything.  I went up to the counter and started placing my order of their menu, spicy salmon roll....  I was told \"it's Friday, it's too busy, sushi will take over 25 minutes.\" I said okay and stepped away to go over their menu and find something else.  A lot of people were ordering their only other \"main\" menu entrée item, teriyaki (your choice of proteins), so I ordered the salmon teriyaki with white rice.  In the meantime while other people who ordered after me were getting their food, another woman stepped up to the counter and asked for sushi.  This time they didn't even tell her a 25 minute wait, they said they cannot make sushi at all because they were too busy.  She asked when a good time to get sushi would be, and they replied with \"it's Friday, we're busy\".. she stepped away frustrated.  Less than five minutes go by, and a woman comes out of the kitchen and fully restocks the \"pre-made\" refrigerated case with sushi!  So, I just paid for teriyaki that I didn't necessarily want, and that I'm still waiting for, and now you bring out the sushi that I originally wanted within five minutes? The woman who brought out the sushi tells the cashier \"you can take sushi orders now\".Twelve minutes after I ordered, my salmon teriyaki came out of the kitchen.  The order states \"with rice and vegetables\".  When I got back to work, I opened the take-out container, and noticed the vegetables were basically cabbage, and more cabbage, and two itty bitty broccolis.  I assumed they would be similar to hibachi vegetables? Not the case.  I got a good amount of salmon, but it was dry and didn't have much flavor.  After picking off all of the cabbage, the rice still contained the flavor.  Overall I did not enjoy my meal nor my experience and will not be returning."], ["Grace M.", "Love this place it hits the spot. While I am no sushi expert I love that I can be in and out quickly and the sushi is delicious. I usually ask for a spicy tuna with avocado so that they make a fresh roll for me but the pre-made rolls taste great too I would just try and go earlier in the day.It is very clean and comfortable and one of my favorite places for grab and go in Hartford."], ["Horton L.", "Sushi was mediocre. I like their chicken dish though, and miso soup was only $1 with entree. Oh one sushi box $5 did not count as 1 entree by the way. Sushi looked so sad I wanted to cry. But it's a cheap and quick place if you are hungry in downtown"], ["Marsha G.", "Ginza express was right near my parked car and had a sign for a meal costing $5.95 and so I stopped in.  It's not a ''restaurant\" it's more like Japanese- fast-food.  I felt better getting this than McDonald's since it has veggies and brown rice. I opted for the tofu teriyaki meal to go. It made my car smell good.  There wasn't enough sauce on my dish.  I was expecting it to look more like what you'd get at hibachi. This place is good in a pinch."], ["Sarah C.", "As a die hard Feng devotee, I was a little skeptical when they opened this place as part of their resturant family. I never thought of them doing a quick take out restaurant that resembled a place you might find in a mall, but I am pleased to announce that its still Feng quality!While the selction isnt nearly as plentiful as the actual restaurants, I think thats to be expected. They still have great basic rolls. When I was there (and it was in the evening) they still had salmon/cucumber, philadelphia, spicy tuna, california, tuna/avocado, eel, and angry dragon rolls. We grabbed a salmon avocado and spicy tuna. I actually went AFTER a happy hour at Feng and had the spicy tuna when I was there... they were identical. And even though they are per-made, they still taste very fresh. There were also salads (seaweed) and some other packaged items. The man behind the counter offered up teriyai chicken samples as soon as we walked in. The piece I tried was good, basic teriyaki chicken. You grab your own chopsticks and soy sauce, napkins and silverware. There is a soda machine, or cooler case with bottles.What really gets me is the good prices and the convenience, which is probably what they were going for. Two rolls for $8.95? At Feng quality? Cant really beat that. Its quick, reasonable, delicious, and really great for the lunch crowd in downtown. Im sure its hopping during daytime hours. It has limited seating, but I would think the turnover is quick. I will definitely be going back to try some of the rice and noodle dishes."], ["Miss R.", "Visited Ginza Express during my lunch hour when I had Jury Duty in downtown Hartford. Food was served quickly and was very fresh (sushi and California roll) and hot (excellent miso soup). Although lunch came to just over $16 with a bottle of iced tea, it was very good. A lot of people ordered the teriyaki chicken lunch special; I will have to try that next time. Would definitely return."], ["Kelly Y.", "Joy!  I got 2 regular rolls for $8.95 (spicy tuna & shrimp tempura), and seaweed salad for $3.25.  Great value!Quick (obviously), clean, friendly..and a help yourself bar with soy sauce packets, chopsticks, and spicy mayo, srirachi sauce and red chili sauce....YES!!  take as much as you need!They also have cans/bottle of soda, fountain sodas, and japanese soda bottle.I will be back!Side note: the sushi is fresh and delicious, but I still recommend eating it there if possible....after walking back to my office, it's a race to eat it before it gets warm and chewy"], ["Kerri P.", "It'll do. If this were based on food alone, it'd be two stars. The employees are very friendly, service is quick, and the place is clean. The price is fine for what you get. I'm not someone who dumps sriracha on everything, but I found both the veg sushi and veg teriyaki to be bland and underwhelming. Despite feeling lukewarm about Ginza Express, I'm glad they're open. Hartford needed a no frills place for sushi that stays open past 2 pm."], ["Collin S.", "Good sushi at great prices, in a clean friendly environment.  Therre's really not too much to complain about here.Ginza Express is set up like your typical quick take-out place; a counter for ordering with a handful of tables.  There is pre-packaged sushi, and for $8.95 you get two regular rolls (spicy tuna, California, shrimp tempura, salmon among the options). I am certainly no sushi expert, but the tuna and salmon rolls were good.  I was in a rush but was able to get in and out with my food in a short period of time.  The question is whetherit is worth the wait to go a few feet to Ginza.  Either way though, it's a welcome new lunch option in the downtown area."], ["Dan S.", "It's still a little early to give a full verdict on this place after two visits. It's a quick take out place with a few tables. Basically, they serve various types of teriyaki (chicken, beef) with rice.  It's similar to what you get at the Japanese food cart outside Morton's except a little more expensive and better.  They also have prepackaged sushi and rolls.  For $8.50 you can get two rolls.  Not bad.Though for $9, you can go next door and get two rolls from Feng. Hmm. Might be a better lunch time deal.  The spicy Tuna roll was good, but the salmon and cucumber roll was pretty forgettable.I do love their seaweed salad ($3.25). And you can get authentic Japanese sodas.Overall, a solid choice for a quick meal.  Eager to see how it holds up.  I enjoyed the teriyaki a little more than I thought I would."], ["Pete R.", "Great teriyaki chicken beef shrimp or selection of two. Tasty quick and inexpensive!!"], ["Local G.", "Great teriyaki with fresh ingredients. Sushi price and quality could be the best deal here"], ["Rico R.", "WTF?!!! This place is horrible!!! If the first thing you want to do after eating is get the taste out your mouth and forget that you ate it, that is SUPER BAD!!!Since it opened, I've been wanting to try Ginza Express, since I love Asian takeouts. I was in the area and thought I'd give it a try. The place was packed so it must be good. Well, it was not good! Not close to being good, and can't get any better unless they just give me the raw ingredients and I cook it myself.For a menu that was purely catering to terriyaki bowl lovers, the terriyaki sauce was god awful! it was runny and thin, lacked depth of flavor. I think the dishwater would have tasted better. I make my own terriyaki sauce and it's not that hard to get the basic flavor profile of terriyaki, and this sauce was a wish, a figment, a simulacrum, of terriyaki sauce!For a $6 tofu terriyaki bowl and a 15 minute wait, I say skip this place. In fact, you probably need to skip Feng and Ginza if this is the poor quality that they put out, even if its only a takeout place!"], ["Matt F.", "Now open next to Feng in downtown Hartford, this is setup as an Express/Take Out location.  Few seats are available to eat-in, but not too many - about 20-25 capacity.Menu is very simple.  Teriyaki meals/combos to order, and a grab 'n go section of sushi rolls, salads, and drinks.Prices are very reasonable.  Teriyaki meals go from $4.45 (vegetable) to $9.95 (chicken, beef, shrimp) and the sushi ranges from about $4.95 to $9.95 (for the Angry Dragon).  8 pieces to a container.  2 Regular roll packages for $8.95.Right now I'm very much enjoying the Chicken Teriyaki and have some tuna avocado roll up next.Open 11-9 Monday-Saturday.  Good feeling this will be a nice lunch spot for many an employee....Facebook them:  facebook.com/GinzaExpress"], ["Farrah M.", "Ummmmmm this is a more expensive sarku Japan. The teriyaki sauce is not the same as feng's. two combos and two drinks for $20? I think you are better off next door. They have lunch specials. Bento boxes r much cheaper and more food."], ["John B.", "I decided to try the \"Express\" today.  I purchased the chicken teriyaki with noodles and a Japanese soda ($10.26).  Noodles were .75 extra Soda was $2.95. The place is clean and inviting.  I like that they have all of the condiments out and ready to use.  Plenty of chopsticks, Yamasa soy sauce packets, and anything else you might need to season your sushi or yaki. another review posted that the chicken was all white meat, I would have to disagree and say that it was all thigh meat.  It was trimmed well enough, but still had a couple of bites of \"things other than meat\".  The noodles were more like thick somen noodles, but they were tasty and not too soft.  I would have preferred if they could put in more vegetables.  I had a few small pieces of broccoli, a piece of carrot, and some cabbage.  It had a nice flavor, but was on the mild side.  I added a little soy sauce to my dish to flavor the noodles, since they did not fry everything together.  Overall I liked it.  I think they portion size was reasonable.  The location is clean and quick.  I will go back to try the sushi."], ["Todd M.", "My go to for a quick bite-  2 for ~$8.595 is my go to!  When I don't have time to sit for Fang this is a must go!"], ["Damaris G.", "Love Love Love, Price was great and food was amazing. My new fave lunch spot downtown."], ["Noelle M.", "Two rolls for $8.95. Speedy and friendly service. I'm not hugely into sushi that's been in the cooler, but it was a good deal. Will definitely return to try some of the teriyaki dishes next semester when I'm scrounging around downtown for lunch."], ["Caitlin T.", "I was pleasantly surprised by Ginza Express the first time I came here. I always get the chicken teriyaki (I don't eat sushi) and it's always delicious. It's less than $7 for rice, veggies and chicken. The service is always quick and the staff is really nice. I come here 2-3 times a month to grab lunch on my way to the office. I'm a fan!"], ["Mickey Z.", "Clean and fast. White meat chicken and brown rice option. The vegetables are just a pile of cabbage, one piece of broccoli and one carrot slice. Would have given it 4 stars if there was more of a variety of vegetables."], ["Foodlover L.", "The food was good at first then doesn't taste good much anymore. They reduce the amount of meat after 2 weeks of opening also, which sucks. Most of the people around the area will have lunch at 11am so it'd better be ready and prepared around 10:30am ."], ["Kevon R.", "Soon to be added to the list of Downtown Favorites. Quick, convenient and clean. Not the widest selection to choose from compared to its sister restaurants Ginza and Feng but enough to satisfy the appetite with delicious food at a reasonable price."]], "Wasabi Modern Japanese Cuisine & Lounge": [["Anne C.", "Late night dining option were few and far between after the movie got out later than expected so initially my dining companions and I went to Wasabi because it was one of the few options still serving dinner.So glad that we stumbled about this restaurant  - it is located in a bit of a shady strip mall but  the bright blue neon lights of the sign drew me inward.  Once my dining companions and I entered, we were greeted by a wonderful host and led to our seats within the expansive, clean and sleek restaurant.  Our waitress was a gem - answering all of our question (although she forgot to tell us the specials, I will give her a pass on that) and even gave us the option of hibachi, even at the late hour we arrived.  I was with Mark C. and was just craving some sashimi.  He likes sashimi but is more of a sushi and roll fan - so we got the best of both worlds and ordered a combination platter with a little bit of this and a little bit of that.  Fish was fresh and flavorful - with nary an off putting flavor.  Our meal also came with a Chef's Special Roll - which our waitress was unable to provide a specific name for but if I had my way I would call it the Amazing Anne roll as it had all the items (tempura shrimp, avocado and roe) I love.  Our meal also came with a small bowl of miso soup (hot and needed on that cold, rainy night) and the option of salad or salad bar.  Choose the salad bar option and loaded up on the seaweed salad - another favorite - because you are only allowed one trip to the salad bar.My only small complaint was that my dining companions who got three rolls had theirs brought out to them first and Mark C and I had to longingly look at their food as we waited for ours - it would have been a better idea to have them brought out closer together so that we could all dine together.If you are looking for something by the Buckland Mall that is not a chain or fast food - this is definitely a great option."], ["Jenni L.", "Most of the staff doesnt speak english. We have eaten there 3 times, and every time the waiter has forgotten one or two items that we ordered. They dont even realize they forgot.There is a coupon in the entertainment book for buy 1 get 1 free entree, which makes the service tolerable. Their sashimi platter is pretty decent. Better than the one served at sakura at evergreen walk down the street."], ["Steven R.", "We ate a ton of sushi here; spent $60 on rolls, sashimi and soups for 4 and all left full. The salad bar was mediocre but we did fill up on seaweed salad and some egg halves. Service was fast with the place so empty - surprising for a Saturday night - and the food was great.My only complaint is that they wouldn't give us a boat no matter how much we ordered unless it was one particular dish. Even though we were ordering like 9 rolls they wouldn't budge on this. Most sushi places I have been to are happy to oblige if you are ordering enough fish to fill one. They said they only have 2 boats and couldn't give them out on request, even though we were one of three tables in the restaurant. So that was kind of annoying, but I'm a boat snob so your experience will probably be better.The Yelp reservations here are also not to be trusted; it showed this place as full with no reservations available all night, but it was practically empty. No idea how that works..."], ["Staci R.", "I used to eat sushi weekly but I have a newborn so it's been 9 longggggg months that I've been sushi free. Now that baby is  here I was looking for somewhere good to reacquaint me with my long lost love and my husband suggested Wasabi. We haven't had much luck finding good sushi in Connecticut but my husband tried Wasabi and said it was yummy. I had the Sushi trio (3 pieces of yellow tail,  3 pieces of salmon, 3 pieces of tuna and a spicy crunchy salmon roll served with miso soup and choice of green salad or salad bar) and my hubby had the spicy roll combo. We both got the salad bar. Good thing hubby has been here before because he knew of the single serving policy at the salad bar (it's not all you can eat). The salad bar is small but there are enough options to make a good green salad with seaweed or \"crab\" on the side. My sushi was delicious and fresh. Our server was ever present, extremely warm and courteous. All in all a great return to sushi, thanks Wasabi. I'll definitely be back!"], ["Amie C.", "Favorite new sushi place! I loved everything about my recent dining experience here with a friend. The decor of the restaurant is great too. I got one of the sushi dinners that was about $14 and came with miso soup and salad bar. Never seen a salad bar at a sushi restaurant but it had a nice, somewhat random, selection. I stuck with the seaweed salad as it is my favorite. But they had two type of lettuce, veggie, shredded and cubed cheese, bacon, hard boiled eggs, mango and dressings.  My sushi dinner came with three rolls- California, salmon with avocado and tuna with avocado. The portion size was perfect, each had 6 pieces. I like that the rolls were more fish than rice! I will definitely be going back! Also be sure to check their website for coupons. I got a 10% our check. I will stay the wait staff could of been a little more attentive, it took as a little time to get our check. But overall still 5 stars in my book!"], ["Bird P.", "Just had one of best birthday's ever here. Second time I've gone . First time was 'sushi ' side , which was delicious. This time Hibachi side. Wait staff was wonderful , and very thoughtful! Food fantastic . Would highly recommend to anyone."], ["Krystle B.", "Awesome place.The look of the plaza definitely does not give you a feel for how amazing this place looks on the inside. The owners did not cut corners or spare an expense, everything here is quality and it shows. Although I didn't get hibachi, I peeked into the room and it is HUGE. We were seated immediately and greeted by a very friendly staff. Started off the calamari, which was good. They came out looking like onion rings, but they tasted alright. My boyfriend and I decided on getting the inspiration sushi dinner for two. And with that came miso soup, and a bowl to the salad bar to start with. The salad bar is standard salad stuff, nothing amazing. However it does have seaweed salad (I stocked up on that). Also, my boyfriend did not get up to get his salad and just picked off mine, and they took his bowl when they took mine! Not cool. Then came our inspiration dinner. IT WAS HUGE. It comes with a chef selected special roll, we got eel, and were extremely happy about that! We thought they might skimp and give us a California roll, but again, this place does not skimp! The arrangement of sashimi, as pictured, came in an elaborate, ornate, gorgeous presentation that really knocked my socks off! You really have to see it to experience how nice it is. Also, as pictured, the sashimi on rice comes with a lot more fish than rice, such a rarity! But most importantly the fish is all fresh and delicious. You will not be disappointed. And I certainly was not. Also on Friday and Saturday nights they have live music or a DJ. Could Manchester be getting a new nightlife spot?! Try it out, seriously. Best sushi I've had in CT."], ["Travis R.", "First visit and no complaints on a Wednesday evening it's quiet tonight with a small crowd of diners. Got the chicken and vegetable tempura and all was very good. Even the salad bar was good and I like the small bowls to keep you from over eating. The waiter was very friendly. Will return again before I leave town."], ["Kimberly T.", "Wasabi Manchester, the hotter, shallow little brother of Wasabi Orange. You walk in, and the place is modern, sexy, and inviting. It reminded me of a NYC lounge with the LED chandeliers, colorful uplighting, deep seated booths and waterfall walls. However, being a party of two was pretty uncomfortable in the overbearing, huge booths. I did like the sense of privacy though. We ordered the lunch special and I was surprised they had a salad bar. The options were okay but there was hardly any lettuce and I doubted anyone was paying attention to restocking it. Especially considering we were one of three parties there at the time. Not a big deal but not impressive either. The service was good. Our waiter was attentive. It was practically empty in there but I'll give him credit. Our cocktails felt a little weak for $9 a pop. I don't mind paying a decent price for a decent drink but my drink tasted like juice. The sushi was okay. I like the location in Orange much better. I think they have more options and a relaxed vibe. The atmosphere in the Manchester location comes off as overzealous.  I would rather have amazing sushi in a lackluster hole in the wall than okay sushi in a sparkly room, personally. So this would be a 3 star review, but the bathrooms in this place were really bad. The doors to the stall are so wide, they are an inch from the toilet when you open the door.  You have to contort your body and practically climb the toilet to get out-- luckily I am a public bathroom ninja and managed to get out without incident. It wasn't the worst bathroom ever, but it was pretty disgusting and poorly designed."], ["Valerie R.", "I had some time to kill and was looking for a spot in the area to have lunch (7/16).  I looked on Yelp and decided to try Wasabi.  When I got there, I noticed a sign out from with the lunch specials.  Lunch rolls special - any 2 rolls $8.95.  The sign specifically noted that shrimp tempura roll was included in this.  Most restaurants do not include that roll in their lunch specials, so I was very excited!I walk inside, cool vibe.  I open the take out menu on the counter to see what else is included in the lunch special.  I decided on a spicy tuna roll, but don't see shrimp tempura on the sushi lunch special menu.  I ask the woman at the counter and she says it's not included.  I tell her what the sign says and she went outside to look at it.  I went out with her.  We agreed that shrimp tempura roll is indicated to be included in the special.  She goes inside and talks to the manager, who says I can \"add it\" to the lunch special for $1.  I try arguing, false advertising, blah blah blah, they weren't having it.  I ordered it, after all, it was only $1.  But I was left with a really bad feeling as I don't like that type of management.  If your sign says something, honor it.  If your sign is wrong, change it.  But don't lure me in under the promise of something and then refuse to give it to me for the stated price.So...the sushi ended up being some of the best I've ever had in this area.  However, I am extremely annoyed at the shady business practices."], ["Yesenia C.", "I love this place!!! It's my favorite restaurant in Manchester CT and I come here all the time. Everything I've ordered has been delicious (and better yet - brought to the table fairly quickly). The ambience is fancy without making people who are more casual feel awkward. And best of all, during all the ones I've been to the resultant I've not had any bad food or service. So yeah - I love this place.Wasabi's cooked meals like the Yaki Soba or Yaki Udon are fantastic. The noodles aren't overly greasy and the flavor is wow. The sushi is perfect too, especially their eel rolls. I've had sushi in a lot of places and none of them hold a candle to this place. The sushi is full of flavor and tastes fresh. Wasabi has enough options too that you won't get bored if you want to venture out every one in a while. As far as the restaurant goes, the atmosphere is beautiful. As other reviewers will say the lighting adds drama and there is something pretty to look at in every direction. It's very clean too. In the 10-ish times I've gone, Wasabi's was spotless including the bathrooms. It feels like an upscale lounge but the prices are reasonable. So win. Actually, If you go around dinner time and do the dining area, it's a good place for a date or night out with the girls."], ["Jeff L.", "First time visit and it will probably be our last. There was nothing special about Wasabi. The sushi was good, although the basic rolls were smaller portions than I'm used to (6 pieces vs 8 pieces). The cocktails were not very good. My girlfriend ordered a Mai Tai and had to send it back. It did not taste anything like a Mai Tai and was not very delicious at all.  Her mango martini was better but nothing special.All in all, I think there are better sushi places around, like Sakura Garden in Glastonbury, with great drinks, great service, and similar prices."], ["Bob D.", "This place is really good! The sushi is fresh and fantastic, as well as all the other entrees I've had.  This is now my favorite sushi place in the Manchester area.   Their lunch menu is limited but very good and prices are reasonable."], ["Nina C.", "Not very familiar with Manchester area, but we were at David's Bridal and decided to stop in for dinner afterwards. So glad we did, we loved the food! Didn't try the hibachi, but we got the hibachi egg and veggie fried rice. I mean it's just fried rice right, but man was it delicious, I'm craving it now! Also had some maki rolls, all very fresh and flavorful. Ambiance is nice, place is clean, menu is priced reasonably, and we will definitely be back."], ["Dominicu D.", "Late night Saturday visit - we chose to sit at the bar for a few drinks and apps; food was good - issues we had was poor service from bar tender; extremely slow and disinterested; we waited a long time between her stopping by - (yuck factor - bartender wiped my martini glass with the bar rag).  The place was not busy.  Beautifully decorated place - not sure we will return."], ["Julia W.", "Oof, I am so sad to report that after hearing glowing recommendations from friends, I had such a bad experience with the sushi here. As for the actual restaurant and staff, they are both beautiful. My friend and I ordered sushi to go and everyone in the restaurant was friendly and the service was quick and on point. Bonus for having the waiting area staged in front of the water feature. My friend ordered tempura chicken and veggies, and I ordered a ginger salad, the avocado, asparagus, and cucumber roll (AAC), the avocado cucumber roll, and the sweet potato tempura roll. My friend said her tempura meal was perfectly delicious. My salad was the typical mostly-iceberg vehicle for ginger dressing, and the ginger dressing was forgettable at best. The sweet potato roll was good and on par for what is expected from this kind of roll. The AAC and avocado cucumber roll, however, were horrendous. I'm not sure if it was just because the avocado was severely under-ripe and hard, or if it was something else in the flavor profile throwing me off. I am not very fussy about my sushi as it is difficult to mess up raw veggies and rice, but they somehow managed to do that to the point that I couldn't eat more than two pieces and threw the rest away. Super disappointing. I want to work up the courage to give Wasabi another try, but it was so expensive compared to other places in the area that I just have not been able to justify doing so yet. Hopefully my next experience cancels this one out!"], ["Kristin B.", "The beau and I popped over here on a Tuesday night (around 8:00 pm) after chest and shoulders work at Planet Fitness.  There was a good sized happy hour/dinner crowd seated around the bar and the music was a bit loud, but definitely happy hour appropriate. We opted for the largely empty dining room.  We were seated immediately upon entry.  Our waitress brought us water and after a few minutes (waiting for me to run to the ladies' room) came over to take our orders.  Later, I realized that we were luck they let us in there in gym clothes. Ha!I had the vegetable gyoza and a salmon roll. My partner had shrimp shumai, two spicy salmon rolls, and then we ended up sharing one more salmon roll. The decor in this place is very modern and kind of evening trendy (if that makes any sense).  They did a wonderful job of plating the gyoza. It came with a great sauce that I couldn't quite place the flavor of.  Was both sweet and sour, but was a dark brown. Perfectly paired with the gyoza. Probably soy sauce mixed with something lighter.  The rolls came out in good time after we finished our apps.  I was really impressed with the rolls. Unlike some other places, the rice was room temperature, rather than being cold. That really made the freshness of the chilled salmon stand out.  Really quite nice.  We might this our regular post-workout place.  Maybe we'll wear proper shoes next time though!"], ["Daniel H.", "Walking in, the neon pink and blue light, similar to those that one would find in a night club, stroke me.  In terms of decor, probably the best I've seen in Connecticut.  The restaurant feels huge especially the full-sized bar that's located at the center of the restaurant (something that you don't usually find in a Japanese restaurant).  There are 10 hibachi tables, but when they brought us in, they placed us onto the table, where there were already two other groups.  Didn't quite understand this since there were 9 other tables open and they were definitely not busy.  I guess they were trying to save oil money by doing three to one.  Now onto the service, something that they are really lacking.  Our waitress seems extremely inexperienced, left us when we haven't even finished ordering.  Furthermore, every time I ordered something, she has to look at where I'm pointing on the menu before she can write them down.  One could argue that they only opened for two month and that's something that needs to be polished.  Since my girlfriend have never had hibachi, therefore I brought her here. Food was actually very good, yes, even the hibachi.  Most people go to hibachi mainly for the spectacle and not for the food, our chief John actually excelled in both.  When we asked for medium rare steak, we actually received medium rare.  There also a good balance between how much sauce and salt one put into the food, which most hibachi tends to miss. The minute amount of sushi that we ordered were extremely fresh, a definite positive.Also, they have a 20% off for hibachi on Friday-Sunday.Overall, decent food in a good-looking restaurant that need improvement on their service."], ["Jack K.", "Just ran across this gem.  We love sushi and this place is beautiful.  it's in a smaller mall near Buckland Hills on Tolland Tkpe.  Right across from the Honda dealership.  The place is very large and beautifully decorated inside.  Large sushi bar.  The unique think I saw was they have a salad bar with many very nice selections.   I love ginger salad and this was the first time I could make my own.  When you order notice that some of the entrees come with a free salad bar.  The sushi was prepared very nicely and priced pretty well too.  We always order too much everywhere we go.  Can't seem to get it right.  Check this place out.  It's worth it for the decorations alone but the food was excellent.Only negative thing I can think of was the miso soup was a bit watery.  Still tasted good though.  TONS of room inside.  It must be the biggest Japanese restaurant this side of Tokyo!"], ["Kevin D.", "I have been to this place a couple times in the past, when they first announced they were still waiting on licenses and it took them months to get up and running. when they first started they had good portions, decent rice, and a very pretty restaurant. now after having some more sushi from them, it appears they are on a decline.just recently I had a lunch special from wasabi, going for a basic Philadelphia roll and a california roll. I also decided to try a dynamite roll, just to see how their specialty rolls measure up. wait was short, staff was a bit green but not majorly so no major minuses there, and the place still looks half-way decent after a couple months of running.now I usually go into a lunch special expecting to get very little fish and a bunch of rice to my rolls. very common method to lower costs and keep people happy. which is fine by me because I happen to really like sushi. However the rolls I got were...well nothing really. More of an appetizer than a real roll. no rice, no fish, no real flavor either besides bleh.now since this was a lunch special I figured the dynamite roll might be something significantly better. It wasn't. it was overpowered by the teriyaki sauce they placed on the top, with only the green bean they placed in the roll offering any substance.overall a bit disappointed in my last order there. they have other things to make a visit worthwhile though, they are doing all you can eat sushi, happy hours, and other events as well. but for just the food it's kind of bleh"]], "Feng Asian Bistro": [["Lukas R.", "Kobe meatballs Spicy 2 in one rollBrooklyn Sorachi Ace on tap"], ["Michelle T.", "They have best sushi and appetizers, best service!!!"], ["Edwin V.", "Awesome place. Great for romantic dinners or a stress reliever. Awesome food an great hospitality from their waiters. Not a big sushi person but with the help of our waiter an his recommendations our afternoon was memorable an a learning experience. Price on the food is perfect. I also recommend a cappuccino martini made by their on staff mixologist that will blow you away. I will be stopping by more often to taste the wonders that this place holds. Thank you again an see you soon."], ["Stacy P.", "We've eaten at this restaurant multiple times and it is always good! However today the service was extremely slow, people who arrived after we had ordered got food before us. Our order was sushi so shouldn't have taken that long (30 minutes). We will venture out next time somewhere else. Service is everything."], ["Dawn O.", "My husband wanted to take me here because he said sushi is really good and very fresh.First impressions:The door is solid wood so you have no idea what to expect.  Upon opening the doors you interior wise you kinda know this is going to be pricy.  It's very nicely decorated compared to some of the typical sushi restaurants.The meal:We sat at the Sushi Bar for this visit. For a starter we ordered the Seaweed Salad. It was very good nice and fresh and had a little bit of marinated carrot and daikon radish on the bottom.  We decided to order 3 of the Special rolls which come with a bowl of Miso or Tom Yum Soup we both opted for the Tom Yum and weren't disappointed.  We ordered the Special Roll of day which had Soft Shell crab & Spicy tuna, the Jalapeño Roll & the Tuna Lover Roll.  All of which were very tasty and eye appealing.  Special rolls are around $17.00 a piece which is quite pricy.  It cost us around $75.00 dollars for lunch for two people and my husband would have liked another roll but opted not to since he knew how pricy it was going to be. Closing Comments:I would definitely go here again.  But not so often as I'd like because of the cost.  This is more of a special occasion kinda place."], ["Giang-Tien M.", "This is my favorite sushi restaurant in Connecticut. I enjoyed their fresh sushis and sashimi for dinner with friends on a regular basis. I experienced their great lunch special once. It is also a nice place to have drinks with friends. The restaurant is clean and the atmosphere is relaxing. The service is friendly and quick.You can park on the street."], ["Ben N.", "I usually come here for lunch specials and the food is your typical sushi lunch - fresh and simple (spicy tuna/spicy salmon). The other day I came in for dinner and was blown away at how amazing the special rolls were!The two rolls that I tried were Spicy Hasu and Autumn of Connecticut.The Spicy Hasu was delicious but the Autumn of Connecticut was even better (this was recommended by our waiter as a more popular roll). If it came down to choosing one over the other I would go with the Autumn. I can't wait to return!"], ["Marsha G.", "Decent Asian - fusion fare. They have a Maki lunch special for $10.50 which includes 2 rolls from a list, soup or salad. I like that they provide aluminum choppy sticks. Screw that wood-crap. They also have general Tso's chicken and pad thai. We didn't get that so I can't comment on the validity or quality of those dishes. The ambiance is dimly light ( even during lunch) which seems silly since most people are having non-romantic lunches. They need to bring up the illumination a bit. The service was attentive and included several different wait-sraff."], ["Kristin B.", "Not a lot of quality sushi restaurants in the Hartford County area so it's one of our go to places. It's a bit pricey though so not all that often. The lunch and happy hour deals are pretty legit though so I'd recommend you stop by then."], ["Richard R.", "We had the Peking duck but the home made hoisin sauce ruined it. I know real hoisin sauce having been to China many times and this sauce tasted more like ketchup. I also thought the duck and vegetables were too salty.  That said, if I had stuck to the Japanese menu I may have liked it better as we did get some excellent ceviche. The Dim Sum appetizer was good but again the fake hoisin sauce brought them down."], ["Karin O.", "We went here to celebrate a friend's birthday on a recent Tuesday night. We had our pick of tables, and the service was excellent. We all shared a couple of appetizers, including the Korean Calamari which was tender and crispy with a lightly spicy dipping sauce.For dinner, I had the pan-seared sea bass which was cooked to perfection and served with an interesting vegetable medley. Other members of the party had crispy chicken, short ribs, and various sushi rolls. Everyone was very happy with their meals.  The wine list was well rounded and contained a good selection of moderately priced but very drinkable wines. The one disappointment was the fried green tea ice cream that we ordered for dessert. This is a great place to go with a friend (or friends) to sample a few rolls and share a bottle of wine. I will definitely be back."], ["Reena P.", "Came here for happy hour and thoroughly enjoyed the creative cocktails and a handful of rolls.  The atmosphere is hip and trendy, even dimly lit at 5PM.  There are tall tables scattered in the bar area and a couple of waitresses/waiters that served us periodically.  The drinks were really tasty and packed with power.  I had the Raspberry Field Martini x 2 and sips out of my husband's Lychee Martini as well.  At $5 each, they were a steal.  We ordered some appetizers to start including Shumai and Chicken Satay.  We shared some rolls of which I can't remember, but in all honesty, real good sushi is a little hard to come by in CT.  That being said, nothing tasted fishy or disgusting... but they were just fine.  I would love to come back here again for more of the happy hour specials, especially drinks, and I wouldn't mind eating some more rolls as well.  Overall, a 3.5 but worth coming by!"], ["Kathryn P.", "Feng is always a stop when I am home in CT. I really enjoy their happy hour and have yet to be disappointed. They have a pretty solid list of things to choose from both food and beverage for their happy hour offerings. I would recommend just about any of the specialty chef rolls and I have enjoyed all of the other things I've tried like the rangoons and edamame. I recommend if you're looking for good sushi or good asian happy hour"], ["Kelly Y.", "Super sad.  We ordered shrimp gyoza, and got beef.  So i accidentally ate beef :(I also ordered the jalapeno roll, which was not spicy at all, and sloppy looking.  And there was a random chuck on tuna hanging out, with long white sinews connecting 2 pale chunks.  I don't know what this is, but I can't go on.  They get the 2 stars because they were very nice, apologetic and understanding, and comped the meal.  They offered to get me something else, but I just couldn't.The waiter was very nice, but he did take our order, then come back and ask again to each of us, at separate times, what we had ordered, which lowered my confidence.We still left him a tip.  No hard feelings.  these things happen.but with a heavy heart, I say, I can never go back.  When dealing with raw food items (and not eating beef), I need precision."], ["Jonathan A.", "I haven't been here in ages. I forgot how good it was. Sat at the bar and the bartender was super sweet and quick. Sushi was fresh and tasty. Ginger cocktail was solid. I'll have to remind myself to go back soon."], ["Ashika B.", "I am updating my review to 4.5 stars. I have returned to Feng a few times when it has been less busy and the service was very good. More importantly, my previous review really didn't give this establishment enough credit for the quality of the fish used. You really notice it when you order only sashimi. The fish is fresh and the cuts are never stringy. This is a popular establishment for happy hours but if you can dine here for lunch or on a weeknight, you're in for quite a treat."], ["Chelsea S.", "Woohoo! Such excellent sushi. I went there last night and had such a wonderful night out for my birthday and had some great wine."], ["Jeff S.", "Top grade sushi! I've eaten here twice, both times great. Get a sake sampler (I prefer sweet and unfiltered) to start. The Miso soup is very hearty. The sushi is really, really fresh, and the servers very knowledgeable. The baby tuna sashimi is excellent, as is the fresh scallop sushi. My favorite piece, Ikura Sushi, was offered with and without quail egg (I like both). I've also had the shumai, which were delicious and rich. You can't go wrong here."], ["Sammy S.", "This place is really posh. And trendy inside the sushi and drinks are really good happy hour deals"], ["Tri T.", "Decor was solid and service was great but the food didn't meet my expectations. Ordered rolls with brown rice and I'm not sure if they even cooked the brown rice. It was so hard! The other roll we ordered was all fish and vegetables but seemed to lack any rice or seaweed to hold it together. Neither of the two rolls came with ginger or wasabi so we had to request.Oysters as a special were really tasty as was the garlic bok choy."], ["Andrew T.", "This is the best sushi restaurant I've ever been to. The Irene's Paradise Roll and the Angry Dragon Roll are my two favorites and I always get their Leechee martini when I go. When I worked in Hartford and out of town auditors would come and wanted sushi I always brought them here. The only complaints I have are that they are slightly over priced and once I accidentally walked into the women's bathroom because they only have Masks on the door. Thankfully, nobody was in the rest room at the time."], ["Alex M.", "Sat at the sushi bar and had an amazing sushi and sashimi combo. The fish was so fresh. And service was fantastic. Exactly what I have come to expect from Feng/Ginza restaurants."], ["Minh C.", "We had an enjoyable meal here a couple weeks ago.  The seven of us ordered about 20 rolls / appetizers - from the angry dragon to the beef dumplings.  At the end we also tacked on a couple lava cakes and a 20 layer crepe.  I thought the sushi tasted great, although it's a little overpriced - then again, most sushi joints are overpriced anyway.  Lava cake is a must. Taking it down one star as service was only so-so.  The waiter had at one point took everyone's orders except one person and walked away.  At another time, they took away some of our glasses before the wine in them were properly disposed of into our stomachs."], ["Kay E.", "Good sushi. Pretentious vibe. The green tea martini was amazing. Went for my birthday dinner with the bf. He wore dressy jeans & a button down - I wore jeans, blouse and flats - and we felt underdressed. Guys were wearing sports jackets, slacks - women wore dresses. Really? It's not that serious.We had to park across the street in a lot and pay $10 for parking. Feng gives you a free $10 appetizer with your parking ticket. Cool idea, but still sucky. Overall, very good sushi but pretty expensive. I'm happy with my local, more inexpensive sushi joint."], ["Martin N.", "Very good dinner from the Dim sum to dinner. The Filet Mignon was one of the best in Ct. Coconut Cloud martinis are awesome. Will def come back."], ["Sarah M.", "Sorry to say, but this restaurant I have now been to twice with great hopes and have been disappointed both times. The food does not compare to other sushi places around. Luke warm and unsatisfying flavors. We have ordered an array of hot apps and sushi/ sashimi and rolls. Unfortunately none of my guests were very happy. I had heard good things about this place in the past, but perhaps standards have gone down. Head to west hartford if you are looking for good sushi."], ["Allison H.", "We were in town for business and referred to Feng for dinner last fall. It was so good we went back with a larger group last week. They were very accommodating fitting our group in the bar for happy hour. Our group had many of the sushi rolls, fried rice, and appetizers. All were delivered to our table timely and everything was delicious. The staff was so friendly as well. Thank you Bill we will be back in the fall!"], ["Kelly R.", "My husband and I went to Feng on Saturday night. I had the black sea salt edamame and the salmon entree, and my husband had the duck egg rolls and the Filet Mignon. It was all delicious, and our server was very attentive. My drink, the sake-tini, was also very good! We will definitely be back."], ["Linda F.", "Best sushi in the area! New Management is superb!  Excellent customer service, great atmosphere and I heard that they are soon going to have evening entertainment. Just can't wait. Recommend for anyone who wants a great night"], ["Kristina L.", "I came to Feng for the sushi, and left feeling unimpressed. My friends and coworkers, however, kept RAVING about this place so I decided to give it another try. The next few times I went to Feng, I loved it! Why? Because I ordered something other than sushi.All of their soups are great, the edamame is nice, and I love the novelty of cooking thin strips of kobe beef over a heated slab of volcanic rock. Their cappuccino is a work of art, and for dessert, the Twenty Layer Crepe Torte is perfection!During my last visit there, I got suckered into their 'specials' and ordered a fancy-schmancy sushi roll. Bad idea. Tasteless. But guess what? I'm still giving Feng 4 stars, because everything else is fantastic and I will be back."], ["Courtney R.", "Love this place for happy hour which runs 4-6pm. They have plenty of drink specials- wine, beer and martinis. I typically go there for sushi specials which range from $2 to $8. This is a great time to try out their specialty rolls or something new. The bar is typically busy around happy hour with professionals, young and old."], ["Heidi B.", "I come to Hartford a lot for work.  After much raves from my co-workers (\"best sushi ever\"), we came to Feng for dinner on a weekday.  Our server was attentive and food was fairly decent.  While my co-worker's fancy looking sushi rolls seemed appetizing, I thought my short ribs is flavorful however it could have used a little less sodium.I've also ordered take-out from Feng numerous times, and a few times I've noticed the same thing - dishes are a little too salty for my liking.  Maybe it's just me.  Food is prepared fast though and location of the restaurant is central."], ["Dave G.", "I'm a big sushi fan, and I want to like this place, but they really laid an egg last night.  Not only did it take 20 minutes just to order, but they also managed to bring my wife a 'peartini' instead of a dirty martini.  Imagine how THAT tasted with olives!  Food came out almost immediately after we finally ordered, but then we didn't see our waiter for another 40 minutes.  In fact, he said about 5 words to us the entire time, and oh yeah, we were still charged for the dirty 'peartini' when the check finally arrived.  Too annoyed to even argue about it.  This place is so overrated."], ["Kim S.", "came here on a Monday night for dinner after work. Great sushi and great service."], ["Chris N.", "I just had lunch at this restaurant today. I'd walked by it many times when I used to work downtown but I had never stopped in. Located in the heart of the Hartford business district, Feng is conveniently located on Asylum. The interior is very well appointed. I was greeted by a very polite and attractive hostess. I was then  seated at the sushi bar. My waitress came over immediately and took my drink order.   Very polite and professional. She returned with my drink and then took my order. I decided on the sushi and sashimi combo and ordered a seltzer water and chose the salad as the app. The salad was delicious and arrived immediately. The entree itself took a little longer but as I saw the men creating the sushi (and there were four of them - I could see they were all extremely busy). I forgot to mention that the restaurant was packed. That's always a good sign. The food itself was good and I was pleasantly satisfied. The only flaw that I could find was the lacquered wood directly in front of me was chipped and scuffed. A minor thing, but taken in context with the beautiful decor of the rest of the restaurant I had to mention it."], ["Amanda D.", "I came here last night for dinner and everything was so good that I felt I had to write a review.  First things first... went out with my boyfriend for a little celebration and it was Taste of Hartford (which I loooooove).  Went to a spot that is pretty good and there was a 45 minute wait on a Wednesday night... the food is good but not that good..so we decided to take a drive and try a different spot which led us to Feng's and I am SO glad it did!It was fairly crowded but no wait and we were seated immediately at a high table in the bar area.  The bar area is very cool and you still get some intimacy at your table which I liked.  Food and service throughout the evening was excellent.  I ordered off of the Taste of Hartford menu: Sushi \"pizza\" as my app, the sushi and sashimi combo as my entree, and a banana \"spring roll\" as my dessert.  Everything was BOMB.  Sushi and sashimi were very fresh.  My boyfriend had a steak that was also very good, and it came with polenta that was so creamy I basically took over his plate.  The drink order is also pretty sweet... I had the Thai Kiss which was very good.  Definitely check it out!"], ["Sanh A.", "I haven't been to Feng's for a long time because there are other options for sushi.  Feng's is pricy and sometimes I question the quality of the food. People always rant and rave about how great Feng's is.  Yes they have an amazing late night menu but it doesn't start until 10pm and depending on who helps you it's not offered.  I made a stop for snack and left unfulfilled. Got the lettuce wrap and three SUPER TINY oysters. The oysters were amazing, some of the best I've had in awhile but the lettuce wrap was blah. Tree leaves lettuce and a few strands of fried noodles not a fulfilling snack at all. I'll give them points for presentation because most of the time things come out visually stimulating but in my book it's not worth the price."], ["Bill B.", "Slow service, food much better, appetizer of yellowtail Jalipeno was excellent. Huge savings of tuna in my tuna rolls. Tuna was fresh and they honored my request for brown rice. My wife ordered some speciality rolls which were average. Prices are higher than normal"], ["Melissa A.", "Great sushi, little pricey but tasty!"], ["Carlos A.", "Feng is a good place for lunch if your lunch budget is about $10 or so and you need a nice place to eat with co-workers. Definitely check out their lunch specials. I enjoyed the salmon lunch box for $10 with rice, sushi, salmon etc."], ["Juliana C.", "Just had lunch at feng. I usually love everything they have. The angry dragon roll was as good as always. However the new burger is nothing special. It didn't have the special sauce. The Banh mi pork sandwich used to be amazing but they no longer have it.  They said they are changing the lunch menu again, I'll have to hear back from others as I was not impressed after my visit."], ["Penny F.", "Just awful. They need to update their website and their menu. Website claims free valet parking on Friday and Saturdays and not only is it not free, there's no valet parking at all. We ordered the Scallion Pancake/Braised Beef Short Rib | Marscarpone | Shoestring Sweet Potatoes | Cherry Pepper, for $13 and they brought a plain, rubbery scallion pancake. When we asked where was the short rib and the marscarpone cheese, the waiter said \"oh we don't have that any more but it's only $6!\" like we should just be happy and not be upset that they didn't update their menu or tell us when we ordered it that it was just a plain scallion pancake. The Peking duck spring rolls had only a few tiny flecks of duck and no promised \" shoestring sweet potatoes.\" We sent both appetizers back, shared one very mediocre \"Special\" chef's sushi roll, asked for our check and left.Might be OK for just sushi and cocktails but you can get better, more reasonably priced sushi elsewhere. And don't go for dinner! Overpriced, horrible food."], ["Annie S.", "Wonderful sushi options and their specialty rolls, though expensive were tasty and fresh. Feng roll is recommended as well as any of their specials! We had them all with brown rice."], ["Catfish D.", "Usually a favorite bar sushi... Today, I had the unique pleasure of being ignored.  Either the bartender was really fast for everyone else or really slow for me. I've never experienced this level of service feng as I am a card carrying member of the feng frequent dinner club. I took my money and appetite elsewhere. I will not return is service does not improve."], ["J D.", "Such a good happy hour - good quality cheap eats and martinis for $5 - and not crappy martinis, amazingly delicious ones! One dollar sign for happy hour, three dollar signs for sit-down meals, I'd say."], ["Sarah C.", "Feng is by far some of the best sushi I have ever had in the state of CT. The restuarant itself offers great decor. The bar is dimly lit with a great stone wall, high top tables, and a couple booths. Asian influsences are found throughout and the bathrooms (not that this matters) are gorgeous. Now, the food. First off, I will start by saying that it IS a bit pricey unless you go from 4-6 during happy hour or 10pm-12pm for \"late night.\" Expect to be paying between $16-20 for any sort of specialty roll, or $6-$8 for regular rolls. That being said, the specialty rolls are creative, large, and very tastey. They usually include 4 or more items within the roll, a special sauce, and lots of good quality fish. They do not skimp on the high end ingredients. There's anything from eel, to mango, to lobster. The presentation is also quite nice. If youre not a fan of sushi, they also have a good menu selection (Pad Thai, cooked seafood, steaks). The bento boxes at lunch are served with soup or salad and come with quite a bit of food (california roll, shumai, your choice of meat or sushi, and rice) for just under $10. If youre looking to splurge at dinner, I would suggest the Kobe beef. You order raw Kobe, sliced thin, and cook it at your table on a very ot stone. Not only is it a fun experience, but the beef is outrageous. It melts in your mouth. It's priced by the ounce and i believe its a minimum of 2 ounces, but it's well worth it for a special occastion, or just because.The full bar makes great cocktails, the lechee martini is always a winner. The only other advice I have is that if you order take-out, make sure to check your order when you pick it up. The place can get really busy and they have managed to forget a roll, or swich things around on more than one occasion."], ["Sarah L.", "We had a delicious meal, the atmosphere was very pleasant. Service was attentive."], ["Tony S.", "Brianna, our server was very helpful in choosing the perfect meal.  The rolls are to die for!  5 stars.. Love it.."], ["Lisa S.", "I've been to Feng in Hartford, Connecticut several times now. I've eaten at the bar, eaten in the main restaurant, and had appetizers at the bar then moved into the restaurant for dinner. Here is my review.First, it's worth mentioning that Feng is not cheap. If you just want a casual night out, and / or you're not really a fan of sushi, then you'd probably do better at another restaurant. The reason you go to Feng is for their excellent service and their excellent sushi. This is about quality, not quantity. So those who adore sushi will be in for a treat. Those who just want to hang out at the bar while they nibble something might find the prices a bit high.The sushi is absolutely phenomenal. I've thought that afresh each time I go here. I've gone with different people over my various visits and they all adore the food here as well. I like sashimi which is raw fish with nothing else. No rice, no dressing, no nothing. So the fish has to be top notch for it to be tasty. I've always loved the sashimi here. I also eat rolls, soups, salads, appetizers, and all shine.What is even more amazing to me is that even when I eat in the bar the service is top notch. In many places if you eat in the bar you're only mildly paid attention to, and the servers are often busy with other things. Here, it feels as if you get the same high quality experience in the bar as in the main dining area. The staff is polite, attentive, and always watching out for you.There's a parking lot right across the street, and also on-street parking. All cost money. So again, this isn't a cheap night out. But to me it's absolutely worth it.Is there a down side? I suppose if you're looking for large buffet-style servings or looking to save some money, this isn't the spot for you :). They definitely are on the high end side here. But again, that's why I go there. I have other places I go for a cheap, casual night out. When I want to treat myself, and have some of the best sushi I can savor, Feng is it.Well recommended."], ["Mayra V.", "I can honestly say I was impressed with the quick response from the general manager of Feng's when I received an email the day after I posted my initial review. He apologized for the lack of service and invited me back. I went back to Feng's yesterday with a Co-Worker. We were completely satisfied with the service we were  given. The general manager was also on site and was able to come and personally apologize for my previous experience. Thank you, I will definitely be returning"], ["Vanessa M.", "Im actually surprised at how many people have raved about this place. I will admit I give it an A for exterior and interior. The exterior reminds me of one of the clubs in Blade.. The interior, is fun, hip, etc. The drinks are good no question.. but the food. I like the spin on the dumpling.. it was Lemongrass but Ive had better, fatter dumplings and they were pretty greasy. The Angry Dragon Roll.. great presentation but very little flavor. This can't be the best Hartford has to offer can it? If so, I hate to say the SW kicks East Coast ass in sushi. How can that be?ok came back the next week and they weren't offering the lemongrass dumplings. wtf? Tries the Di Sun and that WAS good. The edamame.. Ive had better. What I was impressed with was that they had Mochi for dessert.. but it's not on the menu? Again ?????So who eats it the staff?  There has to be better. Its pricey for mediocre."], ["Genevieve C.", "Worst service ever. We were ignored for an hour. Asked a busboy for a waiter. None came. When we walked out no one noticed!"], ["Nicolas P.", "Feng has a trendy, upscale look and feel.I got the sushi (nigiri) and sashimi combo and found it excellent. Feng has the best cuts of sashimi anywhere in CT. These types of combos typically come with a salad and miso soup at other sushi places, Feng's exclusion of these peices is offset by the inclusion of a delicious spicy tuna roll. Including tip and without getting a drink this meal will run you close to $40, but if you're looking for fresh, flavorful, quality sushi, it's worth it."], ["Sean M.", "Best spot in downtown Hartford for sushi. Great Sake list! The bar selection could use a little more local beers that pair well with their menu. Add a sour or two, couple of hoppy beers, and saisons."], ["Lana M.", "This place has the best sushi that I have had in the Hartford area! It is a bit pricey but it's a great atmosphere and the food and service are just incredible. The Miso Eggplant, Aged Miso, and Irene's Paradise roll were my favorite!!"], ["Justin S.", "I would say 4.5 stars. I have to say definitely some of the best sushi I've had in CT. The presentation of the rolls are amazing, the combination of meats are excellent, and they tasted fresh! The selection of sake is great.  Service was spot on, the decor was trendy and lights were slightly dim in the bar. Best of all was that you could make reservations. Was definitely the pricier of the sushi places I have been but with everything said, well worth the price. I am already looking forward to going back."], ["Abe L.", "Rumor is that the place us under new management. This would explain the weird service I have gotten on my past few visits.  It used to be very high quality food and superior service. Now, immediately after we ordered, the server brought lukewarm miso soup, followed after about 15 seconds, by our sushi and entrees (remade?).  Seemed like the exclusive focus was on turning the table.  Too bad.  Had been one of hartford's best restaurants."], ["Anthony P.", "I was invited back by a friend who told me that he and his friends go here for late night sushi. Apparently the sushi is priced very cheap, but the quality is still like regular hours. I ordered the Philly and Spicy Tuna roll, my friend ordered Shrimp tempura, I believe, and Sweet Potato Roll. Among a group of 6 of us we had a few wooden baskets of Edamame with rock salt sprinkled onto it. I thought everything was good, especially dabbling off of my friends plate of sushi. What I really, really, really liked was the attention the staff payed to us, refilling our drinks, cleaning our tables, checking up to see if we liked our meals, etc. It was a great experience. No complaints here, and I will be back for late night sushi! :)"], ["Maria M.", "I've gone to Feng one other time before today.  My first experience was memorable insofar as the sushi I got wasn't impressive nor cold.  Generally, I've found that sushi is better cold versus warm.  Either way, I wasn't impressed and hadn't been back until today.   My boyfriend visited me on my lunch break so needless to say, I was crunched for time.  We were awkwardly seated (the hostess wasn't at her stand and looked at me like I had three heads when I walked over to the register area to find someone to seat us.)Our waiter comes over and offers us water.  He gives us the water and then meanders around (all within eyesight of us).  He is chatting away with two gentlemen seated at the bar, cleaning the bar, setting up other tables.  All the while ignoring us.  We sat there for 15 minutes; never even asked us if we were ready to order.  When he walked by us for about the 8th time and didnt ask if we were ready, we opted to get up and walk out.HORRIBLE.  This was the cherry on the top that will make me never return."], ["Izze C.", "I'm a huge fan of their late night offerings...good sushi and appetizers for an amazing price. You are seated quickly, orders are taken promptly, food delivered is freshly prepared. While the food quality doesnt change, service during lunch and dinner is awful!I somehow get the same server every time (no name calling! Though I suspect that he's connected to the place beyond wing a server...) and I'm not sure if it's because I'm with a younger group or if I'm not dressed to the nines, but I always get ignored! Not fun :(Now I've moved and for sure won't be going back..."]], "Oishi Japanese Express": [["Jasmin G.", "If I could award NEGATIVE stars I definitely would as this place definitely does not deserve to be in business in my opinion. Please allow me to explain! I work for a large State Agency and can honestly say that we give alot of business to Oishi on a weekly basis. With that being said, it is safe to say that at one point we enjoyed the food offered. Unfortunately we have been LESS THAN IMPRESSED the last 3 times that we ordered! The Customer Service is lacking and to be honest it has gotten borderline belligerent. Today, for example, my co workers and I ordered. The lady on the phone rushed to take down our order and when we received it it was COMPLETELY WRONG! We called Oishi back and were met with such negativity and we were actually accused of being \"difficult\" because we wanted our order corrected. The lady was EXTREMELY rude even saying that we had already eaten our incorrect order and were just looking for extra food. She could not be more wrong!!! Not only would she not re-deliver our correct order but she wasted our 30 minute lunch break. I ended up wasting my gas to go there with the incorrect order just to get my $$$ back. I am making sure that all of the agency's employees are aware of the unprofessionalism and bad business pratices of this \"restaurant\"--if u can even call it that. Extremely disappointed, unsatisfied and at this point very frustrated!! Take it from me and save yourself the aggravation!!!"]], "Koji Yakitori Sake Bar": [], "Tisumi Japanese Restaurant": [["K. B.", "I was so impressed with this place that it will be my first go to for sushi in the Hartford / Manchester / Glastonbury area, from now on. It is part of a shopping plaza in Glastonbury so it's easy to miss, but definitely worth the trip. It's clean, well decorated and the staff are all friendly and helpful. Another great thing about this place is it's BYOB!!! We ordered miso soup and Kani crab salad to start, they were both delicious. The Kani crab salad had a lot of crunch and was on the spicer side, the best I have had to date. We also got a spicy crab roll, spicy yellowtail roll, and a Philadelphia roll... All fresh and delicious. There was not one thing left on our plates after all three courses. We wanted to try more, but we were all too full. Can't wait to come back!"], ["Kristin S.", "Legitimately the best sushi I've had in a while. I know where I'll be coming next time I'm up here on business. It's walking distance from the nearby hotels and a refreshing change from the suburban mainstays. The interior is modern and clean. The service is impeccable. And having tried three dishes, from gyoza, to a jalapeño roll to the traditional shrimp tempura, it was all delightful. The tempura was fried perfectly, no grease and not too thick. It doesn't sit heavy. Having been on a business trip the past week, I was look for something fresh and light! I usually don't repeat restaurants on a business trip, preferring to try new places, but this place will certainly get another visit before I take off. Can't wait to come back again on the next trip!"], ["Jeremy K.", "3.5 but i round up for the kid friendliness of the whole dealso groupon lead us here.  she thought they had a habachi grill in the restaurant part, they do not, its in the kitchen, so i am guessing they do not do onion volcanos for the busboys.  hey, sometimes you gotta swing to knock it out of the park, this was not that.so i would not come back here anytime soon, price prohibitive. sure we had saved a few bucks on the groupon, but overall, still pretty pricey.  the kids menu was likely the best value of the whole thing!  i had a chicken yaki dish (just ok), she a pad thai (never had it before, wasnt a big fan) and a few apps.  the tuna in my tuna roll was a bit sinewy for my liking.what else. well, give them a try while you can, i cannot image their business model will sustain  in the current location."], ["Laura F.", "All you can eat SCAM you have to eat everything before you can re order on \"All you can eat menu\" even worse whatever you don't eat you have to PAY 50 CENTS A PIECE TO BRING HOME ! Are they replating even on their menu it says No Wasting. So why would they want to throw out. But over all there sushi is great and fresh but the all you can eat Sunday's is a scam."], ["Cody Y.", "A very impressive restaurant with authentic sushi, excellent service, and a wide diverse menu of options. You gotta love these small independent sushi places. Walking into Tisumi, I wasn't expecting too much  from this small sushi place in a strip mall. My group found the place completely empty on the Thursday for dinner. The service was top-notch, as our waitress was very patient and friendly with our large group and questions, including splitting the check. You couldn't ask for a better hostess.I tried to try a little bit of everything, ordering a Thai Iced Tea ($3 - doesn't necessarily go with sushi but eh rules are made to be broken), Miso Soup ($2), edamame ($4), and the Fancy Dragon Roll ($14) with tempura shrimp and cucumber inside, topped w. eel. avocado. tobiko and eel sauce. Everything I had was exceptional. The soup was superb- surprisingly flavorful for such a simple soup. The Thai Iced Tea was mixed perfectly, with a greater emphasis placed on the tea and less on the sweet. The edamame was cooked flawlessly in the pod, with no other ingredients added so you got only the bean flavor. Finally, the sushi roll was magnificent. Everything was made fresh and delicious. The roll stayed together when picked up with chop sticks and was packed with flavor. It was easily some of the best sushi I've ever had and my favorite meal on the trip. I highly recommend this sushi place for travelers staying outside Hartford and for locals who just want some good sushi."], ["Amie C.", "Purchased a groupon for this place and finally got around to using it! We went on a Saturday night and were seated right away. Upon arrival we learned it was BYOB, but it was too late now. The restaurant was new looking and has a nice decor. Now onto the menu- the sushi roll menu had your standard rolls and then several specialty rolls that sounded delicious.  I decided to try the Hot Fancy Roll, which was seared pepper salmon & avocado inside, topped with spicy tuna. I also got a salmon roll and pumpkin tempura roll. My boyfriend is not a fan of sushi, so he got the Chicken Teriyaki. One reason this place is not getting four stars is because they bought my sushi a good 5-10mins before bringing out my boyfriends entree.That is annoying. All entrees should be served at the same time. Overall we both enjoyed the food! All of my sushi was delicious! Especially the pumpkin tempura roll. Also in terms of pricing the rolls were very reasonably priced. I would go back again."], ["Lan K.", "heeyyyo! This place makes my inner fat kid so happy. Well, my inner fat kid on Sundays when they have all you can eat. What a hot new place in Glastonbury. It is in an ordinary plaza but the inside looks nice enough for a lovely date night. Its got some funky/cool decor. As for the food, I couldn't believe the quality and deliciousness of the food for only $22. (on top of BYOB with no corking fee?!). The all you can eat menu is very expansive in terms of their kitchen items (udon noodle, rice, tempura, teriyaki) to their sushi menu (sushi, sashimi, hand rolls, specialty rolls). You get two lists and check off how many of each you want and they are made fresh. For us (group of 5 with very large order) the food came out on a rolling basis. Some highlights: 1) Moneybag. I had no idea what it was but liked the name. Turned out it was wonton wrap filled with delicious crab all deep fried. Flavor explosion. 2) Pepper salmon. Just melt in your mouth. 3) Fried banana. Not tempura but panko crust. Super crunchy on the outside and creamy on the inside. 4) Pearl River Roll. Really savory unique specialty roll. 5) AAC hand roll. Fresh Avocado, asparagus, and cucumber. Perfect compliment to the more savory rolls. The only reason for not giving all 5 stars is that the food came on a rolling basis in a seemingly random manner. However, I don't know how random it was. We somehow got a lot of \"extra\" stuff, meaning, for example, two of the money bags when we ordered only one. Then, we had to keep asking for the sashimi, probably at least 5 times before we got it all the way at the end when it was clear that we were getting very full, even though sashimi was one of the first things we ordered. So, it sort of seemed like they were holding off more expensive items and trying to get us full on cheaper items. Purely speculative (though quite annoying). In any event, the wait staff was extremely pleasant. On another note, green tea is $1 and free refills. No big deal but just an FYI since some places give tea for free. Anyways, I'll be back. And it was good enough that I wouldn't wait for just the Sunday special!"], ["Jess L.", "Really, really pleased with my experience here. The prices are a dollar or two lower than the other Japanese restaurants in the area, and they do not sacrifice on quality or presentation! The Crunchy and Dynamite rolls were luscious, and I loved the uniqueness of the tempura sweet potato roll. BYOB is a great offering, and they actually have house sake on the house right now before they can sell alcohol. The ceilings are inordinately tall. Absolutely, insanely tall. It makes the decor feel a little strange, like they could have a floating restaurant above it.Service was a wee bit slower than I would have expected, but our waitresses were super nice and enthusiastic.I can't wait to come here again!"], ["Angie N.", "Great sushi, impressive interior, BYOB with no corking fee...need I say more?Paid my first visit here last night, and it will absolutely be the first of many. We knew ahead of time that it was BYOB, so we picked up a couple of bottles of sake on the way. And when we got there, they had a sign on the door alerting us to no corking fee! Awesome!The inside was impressive. Very clean, a beautiful chandelier, an electric fireplace, elegant booths. We were seated and attended to right away. Our waitress brought over a bucket to chill our sake and poured it for us, while explaining which types of sake are served chilled versus warm. We had an order of edamame as an appetizer, good. My friend ordered a seaweed salad and I tried a bite, that was also good (I've never really had bad edamame or seaweed salad at a sushi restaurant, luckily). I ordered the Mango Tango roll as my main course- eel, asparagus, and avocado inside, wrapped with fresh mango. Delicious, beautifully prepared, and refreshing. Everything tastes fresh. I also tried my friend's Lobster Dynamite roll (Maine lobster, avocado, and mango inside, topped with spicy tuna and sweet chili sauce)- it was so flavorful. The music was a little inappropriate at first (think unedited versions of music that would offend a number of people), but I don't think the staff realized it. Other diners asked for them to change it and they complied immediately, so I wouldn't hold that against them. I do hope they'll be more aware next time, but if not, they were sure to change it quickly upon request.For three of us, the bill came to $67, and they gave us a $10 gift card to use next time. I really hope this place builds up a big customer base, because I'd love to see it stay in business. I will definitely be back!"], ["Jung P.", "The sushi was great (thus the stars).  Otherwise, the food ranged from so-so to not great.  To start, kids and wife had the Clear Soup - was like drinking a salt lick.  The kids didn't finish their chicken 'hibachi' but didn't think it good enough to take home.  Wife's chicken teriyaki was finished but tasted off.  My nabeyaki udon was mistaken as yakitori udon, which delayed my meal as I waited for the correct order.  The nabeyaki udon was also incredibly salty and chicken seemed off - noodles were the best part.  I would definitely come back or take out for sushi but nothing else."], ["Joanne P.", "Spicy California Roll was very well made. I realize this is a sushi restaurant but that's about as adventurous as I get with Sushi.  My husband ordered the Seafood Delight Hibachi and I had the Udon Yaki Noodle with Beef.  My husband deemed his \"not bad\". Mine was very tasty except the beef was cold like they had taken It precooked from the refrigerator and added it as an afterthought.  The service was top notch and it IS great that you can BYOB"], ["Jason K.", "Not that I'm complaining at all but why are Sundays here not packed? All you can eat of anything on the menu for less than $25/person? Insane deal.Food is very good, but not great; hence the four stars. Sunday deal is definitely five star worthy though. Also, BYOB which is always nice.I'm actually going to be mad if there's a wait next time I go but you should still check it out."], ["Monique B.", "Pretty good hereeeeahhh. Typical sushi selection and hibachi entrees. I had the iced green tea, ummm don't get it. Also the spicy tuna roll with a little bit of tempura crunch and pearl specialty roll. I'm on the fence to come back. Nice and clean bathroom. Nothing substantially great. Very sweet and attentive servers. My guy had the shrimp hibachi with the noodles. In his words 'good'. Judge for yourself my fellow yelpers."], ["Marilee C.", "Really good restaurant. The service was prompt and efficient. The rolls were good and the fish tasted fresh. I liked the variety of the specialty rolls.  Good prices - pretty standard for the area. Picked up a Groupon after I ate here. They do a Sunday all you can eat (not all you can order!) event for a fixed price."], ["Vilija M.", "New restaurant in town and has excellent sushi! Great lunch and dinner prices. No liquor but you can BYOB."], ["Michael L.", "The food here is really great. At the price point I'm not sure it can be beat. I'd say it's food is on par with more expensive sushi places (like Feng's in Hartford) but with prices closer to Min Ghung. I've eaten here a few times now and the spicy salmon roll is always a winner, it's got a little bit of crunch to enhance the texture as well as delicious salmon. The mango summer roll is tuna with avocado and a slice of mango, wrapped in rice paper, garnished with some sprouts and situated in a tangy mango sauce. It's definitely delicious, but the mango sauce possibly makes it too sweet. It'd make a good dessert roll if there was such a thing.On sunday they have all you can eat for $22. It's worth it... LOTS of specialty rolls on the all you can eat menu, rainbow rolls, dynamite roll, (and lots more that escape my memory). Appetizers and dessert as well as noodles and soups/salads are also on the all you can eat menu. It's really easy to eat more than the price in food.Something I've never had before, but really enjoyed was the tuna tataki! It's DELICIOUS! I'm considering just ordering a lot of tataki next time I get the all you can eat.The interior is nicely decorated with a modern flair. The disco ball is a nice touch.Really hope this place succeeds, it's the best sushi place in the area now :)"], ["Leah M.", "Incredibly impressed with this new sushi spot in Glastonbury.  The decor is quite cute and its BYOB!!  The rolls were impeccably prepared and looked like works of art.  I could tell they fried the tempura to order and everything was delicious and fresh.  I had the Glastonbury Roll and will be back again and again to enjoy it!  It was resasonably priced, the service was attentive and kind, and most of all the food was fabulous!  YES PLEASE!"], ["Eric A.", "If I had to choose one cuisine to eat for the rest of my life, it would be Japanese. I don't think I could give up sushi - and I'd be very happy to eat it at Tisumi.Sushi is rarely a bargain menu item, but as others have noted the prices at Tisumi are down just a bit from other Japanese restaurants in the area. The quality is extremely high, and there are some offerings I haven't seen elsewhere - there's a creative spirit at work behind the sushi bar. I was in the mood for spice, so I ordered a Hot Fancy Roll and a Dynamite Roll. Both were very good, and the Dynamite Roll was excellent - a marvelous combination of heat and crunch.The setting feels, somehow, both rich and contemporary. I spent some time admiring the woodwork that separates the booths down the middle, and appreciating the way the lighting separates the space so effectively. I felt both pampered and comfortable.The servers were quick, kind, and informative. My waitress gently cautioned me about the heat in my rolls (\"They're a little too hot for me,\" she explained when I assured her I enjoyed them), and the sushi chef made a point to look over to see how his creations were going over.I almost missed his glance. As sometimes happens, my eyes were closed in sushi delight."], ["Jeff H.", "Came here on a Friday evening with the gf and used a groupon.  The service was great - they kept my glass of water full the entire time, without me noticing it ever getting empty.  The sushi rolls we ordered were alright though.  The rice was a little harder than I had expected and not in a good way.  It didn't detract from the flavor, but it was noticeable.  We ordered the spicy salmon, california, an eel/avocado, and a hot fancy roll.  The hot fancy roll was our least favorite of the bunch, with the spicy salmon being the best.  Unlike other places, they didn't mash up the salmon before putting it in the spicy salmon roll.  Definitely a plus on that.  We took a look at the menu for the Sunday all you can eat and luckily, the stuff that was there all looked good.  We plan on coming back someday. :P"], ["Jeanmarie M.", "Service was great, the quality of food was very good for the price.  We enjoyed the BYOB with a bottle of wine.  The rolls were unique and we loved what we ordered.  I had the Fancy Dragon roll and my husband had the Galaxy roll! Although we didn't order the all you can eat Sunday special (we were only looking for a snack), it was worth it and we will definitely be back for that as well! Very happy customers!"], ["Nicole D.", "Came here because I had a Groupon..unfortunately my Groupon was for dinner only, which I didn't realize, and we went for lunch...oh well, guess we'll just have to go back! Good service and good sushi. The place was totally empty when we were there for a mid week lunch...literally we were the only ones in there. It seems brand new inside and they did a nice job. Looking forward to trying it again for dinner."], ["Gary L.", "The United States on the tongue：raw fish is the most important \"fresh\" we enjoy, delicacies, thank you. Money is the country's, the food on their own health is selected, we are also considering what! Is. TISUMI SUSHI"], ["Ginny K.", "Finally a sushi place that doesn't bloat it's rolls with too much rice.  Came with a party of six, and everybody tried everybody else's rolls, so we got a great cross section of the menu.  Favorites:  spicy tuna roll, rock n roll, Galaxy roll, dynamite roll. Kitchen entrees were just ok (Pad Thai and chicken teriyaki).  Would recommend staying with the sushi.Tried a neat rice-free roll, wrapped in thin strips of cucumber.  A little hard to eat because the pieces were large and hard to bite into smaller pieces.  But the fish inside was fresh and overall a very tasty experience.Service was really attentive and friendly, and the decor was surprisingly nice.  You would not expect it from the outside (typical strip mall exterior).We'll have to come back for Sunday's all you can eat specials."], ["Saya K.", "After reading review, decided to try this place. I was disappointed. We ordered sashimi dinner and 2 special rolls. Sashimi was good but why fake crab meat is on the dish?? Crunchy salmon roll...salmon was half cooked so didn't feel like eating sushi. Spicy tuna....it was like paste. Usually (in other sushi place), tuna chunk is in, but wasn't like that here. Inside is nice. Japanese music (Pop/rap) was on. If you watch anime, you'll probably recognize a few songs. BYOB is nice. I noticed that many people were ordering non sushi/sashimi items. They looked really good. Maybe we should have ordered those instead.I was not impressed but that doesn't mean it's bad. Maybe I happened to visit on one of bad days??"], ["Kevin D.", "so decided to try this place again, mainly because their menu intrigued me and it did look like tasty food. got a couple specialty rolls, a dynamite roll and a rainbow roll.it actually was pretty tasty! the fish was fresh and prepared well, their spicy mayo had a nice kick to it, rice was slightly tart which is what I really enjoy in sushi rice. rolls themselves were good size, even had some seaweed salad which was good but not everyone's bag of teaoverall not bad for sushi. if your looking for raw fish you can't go wrong here. staff is still a little green, so they might seem a bit scattered but they are friendly and helpful."], ["Smith K.", "I went to this Japanese restaurant to celebrate my partner's birthday.  The ambiance was retro...New York City style vibe...excellent lightning.  Most importantly, the food was amazing and the service was on point.  We will return again for other celebratory events!!! Go Tisumi!!!"], ["Jan L.", "A refreshing new sushi place in Glastonbury center! The waitresses were really friendly and the place was very clean. I tried a sushi roll, grilled squid, shumai, and dessert and everything was well made.  Comparing to other sushi restaurants in the area, this place offers a complete meal experience that other ones lack. I will have to go back to double check, but my first experience was a good one."], ["Kristen M.", "Super impressed with this new sushi place! The prices are on par with other local sushi restaurants and the food is delicious. We will be going back very soon! We ordered 5 rolls and split between two people and also had miso soup and were full when we left!"], ["David G.", "Let's start with the food. The fish is wonderful, it is so fresh it melts in your mouth. The presentation of the food matches the fresh flavor you get. The ambiance is very NYC retro. Also, a great place for birthdays. If I could give this place 10 stars I would. This place is a must!"], ["Jen K.", "BEST SUSHI IN GLASTONBURY!!!! I absolutely love this place - close to home, friendly staff, and great food quality at reasonable prices. I've only placed take out orders, but I've had a great experience every time! I recommend this place to anyone looking for great sushi!!"], ["Jackie S.", "Great service and food. Very creative rolls and the BYOB is awesome.  Really nice people and they always remember us when we come in. Will be back frequently."], ["Evan O.", "The rolls were as good as the service. A solid spot tucked away in a nondescript strip mall."], ["Millie C.", "Love this place! Great sushi, ambiance and service. The place is clean and beautifully decorated including the bathrooms. Great lunch specials! If you want sushi and you are in this area, this is the place to go."], ["Christian C.", "I've been here twice and was impressed both times.  Staff is very nice and more importantly the sashimi is fresh.I will continue to go and support this small business!"], ["Paul B.", "The Godzilla of Sushi Invades Glastonbury...  I have made four visits thus far, for both lunch and dinner.  I am a raw sushi and sashimi diner that has eaten sushi at top restaurants throughout major cities in the US, including the west coast.  The fish was extremely fresh, and has been consistently of high quality... So fresh it almost melts in you mouth. I hope it lasts!A decent sized piece of fish atop the rice, but not overwhelmingly large.  The sushi chefs are refined in their methods, cutting, garnishes, sauces, and presentation.Menu sushi prices are for two pieces.  Sushi lunch special (Monday through Friday) is for five large pieces of sushi (tuna/maguro, salmon, yellowtail, mackerel, and squid) plus a California roll for only $9.My Daughter had the bento box at lunch, and the gyoza was the best I have tasted.  I have not yet had any negimaki or any other cooked appetizers.   As of right now, I thought it was equal to the best local sushi restaurants in quality, but a superior value.Large selection of cooked and raw rolls with some \"fancy\" creations.  I would like to see some more creativity applied in the selections when they get \"rolling\", no pun intended.The Lobster Dynamite roll is a standout.   Topped with a sweet chili sauce and fried sweet potato straw as a perfect foil. Also like the Crispy Salmon roll.I have also had the simple, but extremely wholesome King Crab sushi, in addition to maguro, toro, salmon, yellowtail, surf clam, seabass, and mackerel sushi.  No liquor license yet.  BYOB!Staff was highly attentive and pleasant.  The space is decorated tastefully, dominated by booths, and the sushi bar is in the rear.   An unexpected surprise."], ["Lucas L.", "Great quality and variety of sushi!!!!  New favorite place to get sushi in glastonbury!!!"], ["Vara P.", "We went for the Sunday special, 21.99 all you can eat from a huge menu selection. The best part was that it was brought to the table made fresh. And it really did taste fresh! The pepper tuna and pepper salmon were absolutely amazing! I would definitely recommend to anyone. Also the wait staff were so knowledgeable and professional. They helped identify food allergies and even made dishes special with no sauces or smaller portions to taste test. What a great sushi experience!"], ["Ghazi K.", "Amazing place ! Great food ! Awesome environment & excellent service :)  you have to try it ! Amber is the BEST !!!"], ["Caitlin I.", "Tried this place with a groupon today. Very good sushi. Creative special rolls. Nice location and friendly staff. All in all a good experience. Will be back for sure, if I'm in the area."], ["Sara F.", "Delicious sushi in a beautiful setting. I did feel like the portions of the special rolls were a bit small compared to other restaurants. Overall I really enjoyed my meal and love byob!"], ["Brandon L.", "First time to Tisumi; always looking for good sushi restaurants and this new add to the Glastonbury dining scene did not disappoint.  Tried a number of different dishes which had a great presentation and was very fresh.  Edamame and house salads were a great add to the meal!"], ["Stephanie T.", "I was very impressed with this place - especially because it used to be a kitchen store! The food was fresh and the atmosphere was really current and interesting. I hope they break outside the box and run some specials - introducing some different rolls, etc. I am happy to have more choices in GB!"], ["Elizabeth B.", "This review is mostly for the all-you-can-eat special on Sunday. The service is a bit slow, but overall it's a great deal -- many of the food items on the regular menu are included (drinks are extra), including most sushi items, and so it's a huge savings over ordering a la carte.  The hot and raw foods were all very good. Hopefully they don't change their minds on the terms of the deal just because of my single order!The decor is ... eclectic. I'm not sure if the fireplace was original or added by the owners, and the miniature bicycle perched on the mantle is an interesting touch - does tisumi mean bicycle in Japanese? - but the Japan-light-rock-infused vibe is not overwhelming. Bottom line, highly recommended."], ["Bryan G.", "Hi:I'd probably give this one 3 1/2 stars overall. Quality is about the same as Sakura Garden and the prices are similar as well. Pretty standard sushi stuff - I'm really waiting for a place in town that serves interesting, simple rolls - oshinko, kampyo, shitake mushroom, etc.... and makes it fun to be there. Roll and drink happy hours (like Ginza) or a Rock n Roll sushi night with a DJ, disco ball, special rolls,etc.... would draw people and make the place stand out from the rest. Promising start for these guys but I'd still like to see some innovation and excitment in my Gbury dining choices, not more of the same!"], ["Mickey Z.", "BYOB here is awesome. They have great sushi rolls and they offer brown rice as well. Good variety. Very clean inside and staff was accommodating. There is no outside seating as it is in the strip mall"], ["Judy L.", "My husband and I came for dinner last night. We didn't want to cook since it was the day before Easter. I bought a Groupon for this new place, a rival for Sakura and Min Guang. It is the former Ktchen place. Anyway, we brought a bottle of wine since it is a BYOB place without corsage fee. It is one of the few places I know with fee. That is a plus. We had to wait a couple of minutes before we were seated. We had a booth seat away from the entry. I ordered seafood noodle soup. I was disappointed with it. According to the menu, I had a choice of udon or soba for the noodle. I asked for soba as my noodles. What did I get? I got egg noodles like the kind for wonton noodles. I know that because I'm Asian and know the difference between egg noodles, soba and udon. With that price, I expected more than 2 slices of scallops, 2 slices of imitation fish cakes, a couple strands of imitation crabs meat, and 3 medium sized shrimps. Worst of all  the soup had NO seafood base. Maybe vegetable soup and two lettuce leaves as vegetables. They could have done better to have bak choy leaves instead. The salad was fresh for me and decent ginger dressing in it. My husband had filet mignon hibachi. It was cooked right and the two seasons were okay. However, the fried rice was too salty. They were heavy handed with soy or salt. The vegetables were acceptable. My husband had clear soup and salad with his dinner. The plate he had was not warm so his food was cooled when he was halfway eating. The ambiance of the place is good if we stayed away from the big screen. We would give it a try again but I would not order the noodle soup again. I always believe that if a dish is placed on the menu, it should be up to par for Asians and others. It is the quality that counts, not the quantity on the menu offered. So, I hope the owner would consider making improvements on the dishes rather than concentrate on sushis, tempura, and sashimi."], ["K R.", "Great experience!! Had spider and dragon rolls, salmon sashimi, ginger ice cream, etc.! Would recommend this place!!!"], ["Lauren W.", "This place was absolutely phenomenal!  Excellent prices, the fish is fresh and delicious, service with a smile, and the place has been beautifully redesigned. Hands down my favorite sushi place in the Hartford area!  Highly recommend!"], ["Juliana J.", "Ok, I knew from the start that this was going to be good. The tea was piping hot and the miso soup hot and was made right...No weak watery soup here. Delicious! We got two kitchen dishes, chicken curry and shrimp tempura. Absolutely fantastic. Generous and perfectly cooked. We will be back with others to have sashimi and sushi. Oiishi! Douzo, get yourself in here. I was sad when the kitchen store left, but now,  I think I'm glad they did!"]], "Murasaki": [["S L.", "I've eaten in all the fine restaurants that serve Sushi in WH.  While Fuji Sushi on New Britain Ave might be the best value, it is impossible to beat Murasaki for the sheer quality and presentation of their food.  Perhaps it is watchful eye of George, the proprietor, who rolls sushi with the other chefs which helps keep the standards high.  But from the humdrum California roll to the more intricate specialty rolls it is the consistently well done basics which make this place special -- fresh, well-cut fish, great presentation, and rice which is so fresh it feels like it melts in your mouth.  No, the decor and restaurant space aren't flashy, but place feels like everything a proper Japanese restaurant should be.  If you're looking for the cheapest sushi, check out your local buffet.  If you want the best, this is your place."], ["Emily K.", "I took my boyfriend here for his birthday and I cannot say enough good things about it.  When we walked through the door we immediately felt welcomed.  The two women at the door were very sweet and showed us right to our table.  I had made a reservation the week before and they had set aside a nice table for us.  The waitress brought over warm hand towels and then promptly took our drink order.  I ordered a cosmopolitan and it was delicious!  It was not super sweet like most, but had a nice tart taste that was refreshing and the perfect way to start the meal.  My boyfriend ordered sushi and was in food heaven and I ordered the chicken teriyaki and vegetable tempura bento box which was served with miso soup and a salad.  The bento box was huge with more than enough for two people and at $17 it was well worth it.  The vegetables in the tempura still had a bite to them which I like, and had a nice crispy crust.  The teriyaki was okay; to me it was a little bland and cooler than I would have liked it.  The sauce it was served with was nice and perfect to dip my rice into.  Overall I highly recommend Murasaki to anyone who wants a delicious and quiet dining experience with a staff that is welcoming and accommodating."], ["Sarah W.", "Very good sushi just off the main street of West Hartford. The salmon and avocado roll was delicious, and the eel nigiri was flavorful.  I'll come back to Murasaki!  Note- the food and service are great but the prices seem a bit high."], ["Dave B.", "Back in the day, Murasaki was located way out in Simsbury.  A bit of a drive, but once you got there, the restaurant was cozy, the service was friendly and attentive, and the sushi was great.  Then for some reason, they decided to move to West Hartford.  The move wasn't for the better.Murasaki's current incarnation is a tiny space that feels completely cramped, and worse, the food is just okay.  I can't say the service suffered, but since they moved, I've only been once.  For me, there's no reason to go here now.  And I used to be a huge Murasaki fan.  Things change, I guess.  Time to move on."], ["R D.", "Small place, good quality reasonable selection. Slightly expensive, but it's West Hartford and to be expected."], ["Rolf L.", "To me, the mark of a good sushi place is the spicy tuna roll. If they chop up nd blend the tuna and the sause rather than just put sause on the tuna and roll it up makes a difference. This place does the latter of the two. Although spicy, it was nothing to go out of your way for. The ambience leaves much to be desired, it's just a long narrow room. The edemame wasn't salted properly. ( I like salt) This all being said, I didn't have more than the above, since I was there for a quick bite. I would give them another try down the road for actual sushi, but I won't rush back."], ["Paul S.", "I feel silly writing a review that basically echoes Mindy S's review, but that's how I felt.  The sushi and sashimi lunch was fine.  Nothing amazing.  Just fine.  I must say, for some reason I liked their miso soup more than most, but I am not a fan, so if I liked it, I may not be the best judge!I must compliment them as well on friendly service."], ["Georgene S.", "This was a great experience for those who love sushi.  The atmosphere was fantastic...fun and trendy.  The wait staff and sushi chefs Japanese and wonderful.  Friendly and perfect service.  The sushi was great.  The prices were reasonable.  The chef/owner even gave me 4 pieces of Hokigai surf clam instead of two because he said he thought they were too small.  I couldn't believe it.  We love it here and I promise as a sushi lover and one who has eaten it for decades that you won't be disappointed.  The dinner my husband had was fabulous as well as he is not a sushi lover...but the chicken dinner was fabulous.  We are going back over and over again."], ["David S.", "By far and away the best Japanese restaurant in West Hartford, CT.  Small but with a sushi bar (with seating) and an extensive menu, it is a wonderful place to go for a nice meal.  The owners are wonderful, the staff great and the food couldn't be better.  Plus an extensive Saki menu!"], ["Michael B.", "Rainbow Roll was a good pick. I ordered 2. Miso soup wasn't as salty as other places. Good presentation. Cool Wallpaper."], ["stacey n.", "Excellent sushi and sashimi. Enough said."], ["Mindy S.", "Just okay. Nothing special to wow us. Some of the specialty rolls were good, but expensive."], ["J M.", "I believe this is the first time I've paid $15 for a roll. They have more normal priced rolls, too, like the Philadelphia roll, was about $5.50 I think. The nigiri sushi seemed a tad on the small side. The ikura was quite sizable but somehow the seaweed seemed a bit on the soggy side. This was probably the only blemish of the evening. The decor was simple and stylish, with one wall covered with what I assume to be lacquered newspapers."]], "Edoichi Sushi & Hibachi Steak House": [["David S.", "Excellent all around. I've been here numerous times now and also got take-out a couple times.  I'm always thinking about my next visit.The sushi quality, selection and presentation are all top notch.  The overall ambiance is very welcoming and relaxing and the service is fantastic and friendly.I have enjoyed all of the specialty rolls that I've tried. I am particularly fond of the thai spicy roll. Great combo with the jalapeno and cilantro sauce. Teriyaki chicken was delicious from the entree section."], ["Rob M.", "Being a Saturday night we called ahead and were told we'd definitely need reservations for the hibachi. Not so much for the dining room. I guess we needed reservations just so they'd know how many chefs to have on hand, because we were the only ones in the place. Three people. But the chef still put on a good show for us, and the food was very good. Meanwhile the dining room, which was not supposed to be busy, filled up. Go figure.This location has housed many restaurants and bars over the years but Edo Ichi is definitely the nicest. They've done a beautiful job with the decor and there are plenty of hibachis for even large parties. There is even a nice outdoor patio for happy hours and summer al fresco sushi. I did find the hibachi menu to be limited -- all sorts of combinations of chicken, salmon, shrimp, filet and even lobster tail -- but there is only so much you can grill this way. It all starts with some miso soup and a salad while the chef entertains, blasts some sake into your mouth from three feet away, and prepares heaping portions of fried rice and noodles/lo mein. Fun! Hint: no need to order shrimp as your entree because Chef prepares some, plus wonderful grilled veggies, along with your order. If you're not into hibachi the sushi menu looks absolutely fantastic (and you can order off of it even if you're sitting at the hibachi with other people). Some unique offerings I haven't seen at other sushi places. Unfortunately we didn't get to try any but I will make it a point to come back. It all looked sooooo good! The usual bento boxes and tempura is on the menu as well, including steaks and lobster tails prepared in the kitchen if you choose to sit in the dining room. After the meal (while we waited an interminably long time for our check), we were served a nice plate of watermelon slices and orange wedges. My only complaint, and the reason I'm only giving four stars, is with the service. Despite the place being very quiet, and our hibachi chef being entertaining and attentive, our server disappeared for long periods at a time. Then she'd show up several times in a short span to ask if we wanted more drinks or to clear plates. Then she'd disappear again. After an already long wait for the check we literally had to track her down just to hand her our credit card. That's just not acceptable in any restaurant. Also, the speciality drinks ordered by my wife and her friend were suspiciously non-alcoholic tasting. Sugary sweet, but not much bang for the buck. At $8+ a pop, that's too bad. I ordered a large Sapporo (beer) which came in a 22oz can, overpriced at $7.50 (two 12oz bottles provide a couple ounces more for roughly the same price), but it was ice cold and tasted great along with the grilled stuff. Oh, and the tv in the hibachi room, showing cooking programs, was a bit out of place in such an otherwise nice restaurant.Overall, despite the problems just trying to leave the place, I give Edo Ichi thumbs up. I know service can be sporadic, and maybe we hit it when the stars weren't aligned. I'm looking forward to a return trip to try out the awesome looking sushi menu."], ["HonestAbe R.", "Sushi was okay, I had spider roll and soft shell crab roll. My friend did hibachi scallops, shrimp.Scallops were okay, not enough seasoning, lo mein was under seasoned.The shrimp was so tasty!!The scorpion bowl- reallllyyy good!Wait staff- AMAZING!And it's a good price... To get something that will be great. I paid for my sushi so I wasn't disappointed."], ["Amanda N.", "I come here every couple weeks. I'd come everyday if I could. Great sushi, nice servers, reasonable prices and awesome lunch deals. They have take out sushi which is great. Everything I've ever tried from here I loved."], ["Elaine K.", "Went to hibachi last night for my friend's birthday. It was fun, good typical show! Saki! Saki! Saki! They sang happy birthday with the drum and got free friend ice cream."], ["Rosangelica F.", "This place is lit!!!!!!!!!!!!!!! This place literally scores a 100/100 in every way possible. First of all, the sushi rolls are literally the best sushi rolls I have ever had/will ever have in my entire life. Everything is so fresh and well put together!!!!!!!! The presentation and the staff are awesome. All around great experience. The day after the first time I ever tried it, I went back again. My boyfriend and I haven't sat at the hibachi tables yet but we tried the hibachi food which, once again, knocked my socks off. There are no words. Just go. Yes, this is the best sushi place in the area. I wish I could go everyday 3 times a day.  ************* THREE WORDS: THAI SPICY ROLL"], ["Rebecca A.", "This place is great! The staff is super nice.  The food is presented beautifully and is so fresh.  There are some rally interesting interpretations on traditional rolls... The Colorful Roll is stunning to look at and yummy in the tummy!  Crazy Tuna Roll..  Exactly what the name suggests.  The steamed edamame is perfection.The reasons I did not give the place 5 stars...  It's in a hole in the back of the Silas Deane Highway and a location known for restaurant failure.  This place also does not have Guest Wi-fi so I had to wait to check-in and write this review as even my 4G LTE network would not connect in the location.  In a world of \"want it now\" most people would not do what I have done this morning...they would have simply chalked it up to \"their loss\" and moved on.Please consider Guest wi-fi!  Social media will be your ticket for success in this location!I also wish they would consider delivery as that would make them stand apart from the other sushi restaurants in the area."], ["Chelsea S.", "This place is amazing! The atmosphere is great, the staff is friendly and welcoming and the sushi is a hit. I would definitely recommend this place to anyone looking for sushi on the Silas Dean or in the Whethersfield area. I would suggest trying the \"dancing dragon roll\", it was my favorite. You will be pleasantly surprised by the creative presentation! Check it out! Make sure you enter in the back and the front is a little confusing."], ["M C.", "I have been here many times and never had a bad experience. The food is amazing, great atmosphere and very friendly staff."], ["Mike L.", "This place is a hidden gem! The staff is always so friendly and the food is always so fresh and delicious. They go above and beyond with presentation, the finished plate that comes out to you could pass for art if it wasn't a meal! At the sushi bar the chef always has his recommendation and usually they treat you to a appetizer that he whips up on the house. My wife and I are so lucky to have such an amazing place so close to us! If you're in the area make sure you stop in! 5 Stars!"], ["Justin G.", "Edo Ichi is one of the best places to get sushi in Hartford County. I've been to many different sushi restaurants and Edo Ichi stands out as one of the best. The atmosphere is clever, given the many different restaurants that have lived out of the same building. They definitely achieved their own fun vibe in the dinning area. I haven't tried the hibachi although, there are 5 grills! The quality is top notch regarding the fish and they have a great selection. Above all, their presentation is excellent which earned them 5 stars from me. Arguably the best I've seen at a sushi restaurant."], ["Alexis M.", "Yum! We were a bit wary pulling into this place but the service was great, the mixed drinks were good (scorpion bowl amazing, Mai tai was weird tasted like bubble gum?) and the three sushi house special rolls that we got were all absolutely incredible. We found our local sushi spot!!"], ["Abhijeet R.", "I am not a sushi expert and i am still learning different nuances of Japanese food. I wanted to try sushi tonight and heard about this place on yelp. We order chefs special spicy Thai sushi. It was great. I liked the taste. We have also tried the mochi ice cream. Nice ambience and friendly staff. I am giving 3.5 stars."], ["Sawyer K.", "We love this place. The sushi is delicious and the hibachi event is always a good time. I love the dancing dragon roll - very high quality and incredible presentation. The happy hour drink prices are also fantastic (no hh food specials). Parking is behind the building which is a little confusing at first."], ["Lindsay J.", "Just visited last night for the first time. Holy crap, this place is amazing. Best way to access the restaurant is by taking Beaver Road off of Silas Deane. It's a one way, by the way! It is a quaint little spot however, there is a decent size parking lot in the back. I can't wait for warmer weather to come here and eat outside on the patio. Looks divine. We were promptly seated in the back dining room which was filled with some interesting decor. Exposed pipes and wood give this little spot some serious points in my book. Eclectic meets swanky meets comfy casual. Our waitress was exceedingly, over the top nice. We ordered the Shumai, Spicy Tuna Roll, Spicy Crab Roll and Spicy Scallop Roll. Once our food arrived, the presentation was beautiful. I almost didnt want to touch my food because it looked like a Matisse from the MOMA. But alas, I had to dig in. My boyfriend went crazy for the Spicy Tuna - he said it was \"killer\" and some of the best sushi he has had. My Crab Roll and Scallop Rolls were INSANE. The crab roll which is cooked, is an explosion of texture and flavor when you take a bite. Everything was fresh and delicious. This place vs Feng? You have your work cut out, Feng. So many people hype up Feng (I should know. I am one of them) but I will tell you. This place is small yet exquisite. Friendly and suggestive without being pushy. Service is impeccable and quick. On a completely different note: I like to take a small bit of Wasabi and add it to my soy sauce. The Wasabi at Edo Ichi is mindblowing. Sweet almost. It's a dry heat that is sweet but doesn't linger. I found myself continually adding it (and eating it) to my food. Not dry and crumbly that you get at some places but fresh and delicate. I can't wait to come back. I miss this place already. And if you don't go? You have a serious issue. But then again, just more sushi for me!"], ["Mya B.", "The best birthday experience ever!!! My husband surprised me here and let me tell you, it's awesome! This is the place to be for having small or large gatherings. Don't let the size on the outside fool you! It reminds me of an underground exclusive club so authentic and lovely. I've never been to a Habachi place, the live cooking and vibes were just so perfect. Excellent fresh food and the upbeat positive energy from all of the staffing was just so very sweet. My birthday celebration was just my husband and I yet we felt like we were VIP among the employees. We will definitely visit again really soon with more peeps! Sake, Sake, Sake for everyone!"], ["Kerri P.", "After seeing a picture a friend took from a recent visit here, we decided to go, but I really should have read the Yelp reviews first because then I would have known to enter through the correct door. So yeah, entry is lower level, behind the building. What a surprisingly nice place! As vegetarians, we had more than just two rolls to choose between, and all were great. These arrived with a vase of flowers on the plate. I never knew I even wanted my dinner to come with a side of floral arrangement. The service was friendly and quick. The age tofu came out first, followed shortly by several orders of rolls, including the avocado cheese. The food quality was on par with the much more expensive sushi restaurants in the Greater Hartford area, while the ambiance was more interesting. Now, I have a reason to go to the Silas Deane."], ["Joe S.", "Decent food, but a poor overall experience. They forgot one of my rolls and when I asked about it, they insisted that it was \"almost ready\". It never came.Also, they gave me a complimentary miso soup, which I did not order - this seemed like a nice gesture until they charged me $5 for it at the end of the night. Appalling.The food came out very slow, and overall the service was unpleasant. They also have a bizarre lighting system that shifts around every few minutes, and because it is mounted so low, it will occasionally shine right into your eyes.There is no reason to come here... go to OMG Sushi or Ginza instead."], ["Alina W.", "I rarely write reviews for restaurants. I want to say you won't regret if you try this place. My waitress sammi is really nice and helpful. The sushi is the best sushi I have ever eaten. I definitely will come back and recommend to my friends. The deco is awesome. 5 stars."], ["Ricky F.", "Oh my holy heck, best sushi I have had ever! Spicy Thai roll. IVE HAD DREAMS ABOUT THIS SUSHI. Tiger roll as well! Girlfriend had vegetable hibachi, all of our dishes were plated beautifully and our waitress was very very kind! 5 stars and I'd eat there every night if I lived closer. The drive will always be worth it and I will return asap!"], ["Haruka T.", "Beautiful place! I just asked a different sauce for sushi I ordered because I don't like wasabi and it was the wasabi sauce. Then they gave me a new sushi with new sauce and made the sushi into butterfly shape!! They were  so nice and caring about what customers think so much."], ["Rick R.", "It looks like a little place but is actually a very large restaurant with hibachi tables, a patio, sushi bar etc. Great service, beautiful presentation, and very good food. We brought an non-sushi eater and she had a good meal, sushi eaters loved it. They had some interesting rolls. Reasonable priced as well. You can enter from the front, but you should really park in the back and enter there."], ["Michael R.", "This is my new favorite Sushi restaurant! I've not been here for Hibachi so I can't speak to that but I've been here twice now in the last 2 weeks and the sushi is incredible with amazing presentation. Beautiful presentation. This is a new regular for me and my wife. We took friends here that loved it too(they ordered the Love Boat). Again, quite the presentation. We also got the Punch Bowl both times(recommended). Really, if sushi is your thing you can't go wrong here."], ["Mike B.", "Great atmosphere and literally can't beat there happy hour prices. Basically any martini or cocktail is 3.75 and $2 beers goes from Monday through Thursday until 7pm"], ["Kate K.", "We entered through the front at the top of the hill. The building looked like a shack that could contain 5 tables. You go in the door and down some sketchy stairs then it opens up to seating for 250 people. Nice, intimate atmosphere. The sushi presentation was picture worthy and a good value. The manager was attentive and servers were excellent. Complimentary watermelon for dessert. Lovely. Just lovely."], ["Ryan H.", "Went back again last night, and once again John and company did not disappoint! We tried the Toro, King Salmon and Scallops this time around and all were out of this world. The staff really go out of their way to provide you with the best possible dining experience. We'll be back very soon!"], ["Luke S.", "Second visit. This time for lunch.  All I can say is spectacular!  Had multiple rolls, kani, salads, etc.  Everything was better than the last. My new favorite!"], ["June S.", "I returned again over the weekend and it was just like the last five times I've gone here.... Amazing! The staff is so friendly and courteous! They are also very reasonably priced! I love this place so much,  I'll bus tables for food. Seriously,  I can't get enough of this place.  My new favorite spot and they have great happy hour times and prices which is another reason I have to go back. Until we meet again."], ["Lisa S.", "I really heart this place. Ahhh-mazing. The staff is always friendly and attentive. They offer a lot of creative sushi rolls. Tried so many but the yummy yummy comes to mind as a standout. They also serve various kinds of entrees and noodle dishes but it is hard to get me to stray from the sushi. GO and get your sushi on!!!"], ["Maria G.", "Great staff - excellent food. Generous portions!  A hidden gem...we will definitely be back again"], ["Bea B.", "Excellent food and entertainment!!! Big indoor space, bar, and outside patio. The Silas Dean entrance is deceiving. This restaurant is a hidden gem."], ["Amy G.", "Once again, five stars on a second visit. I came here with a girlfriend to get caught up after the holidays. We ordered the beef negimaki appetizer and I had a chilled sake. A little surprise dish appeared on our table from the sushi bar and wow! They call it an \"avocado dumpling\" and it's really good--spicy crab, some kind of really yummy sauce, and avocado, very tasty blend of flavors. I've never had anything quite like it.  I don't think this is featured on the menu but I plan to ask for it next time I am here. The plump beef negimaki was probably the best I've ever had as it tastes as if they are using thinly-sliced filet mignon for the beef--supremely tender pieces of beef wrapped around crunchy green onions with a glaze similar to teriayaki but less salty than at many places. The gf and I both ordered off the hibachi menu. I like the simple good flavors of hibachi items, but don't much care for the tableside schtick, so it's really great to be able to order those items at a regular seating. (It's also great that there is a separate room for hibachi parties, and then the quieter room that we were in. We chose salmon, filet mignon, and chicken, all really delicious. It's a ton of food, too, starting with a small green salad with a light dressing, miso soup, and then the entree comes with two hibachi shrimp as an extra, fluffy fried rice, veggies AND noodles. We took a bunch of food home, and it's even better the next day, Side note: I've had tea there while waiting for to-go orders, and they have that amazing \"roasted rice\" tea that is really nice. It actually has roasted rice in with the tea leaves.There was a large table next to us of some ladies who seem to be regulars. They were really enjoying the platters of sushi being brought out, along with huge \"scorpion bowl\" drinks. Everyone kind of gets into the spirit of the thing and the ladies even offered me a sample of the beverage. Good vibe and good folks. Now that I've sampled a few things off the non-sushi menu, next time I am going to go all sushi and check that out--and maybe take another crack at that avocado dumpling."], ["Bra M.", "Excellent service and the food is outstanding! The sushi is fresh and the portions are big. Quality is important to us, and they delivered. Price is reasonable. Will recommend to friends and family."], ["Elizabeth B.", "The food is great, the service... odd. I came directly from a business meeting, with a long drive in front of me. When I walked in on a Monday night, the place was completely empty. I mean, I was the only customer in the place at 7 pm. Over the next 30 minutes, only three other customers walked in the door, and they were a weird lot to say the least. At least one of them had never eaten sushi before. As a side note, I ordered a la carte, which was probably a mistake, since it ended up being as expensive as the combo meal with much less quantity. I ordered probably within five minutes, which was fine, but the hot food arrived before the sushi - I thought that was pretty strange, considering that there is no cooking involved for sushi. I actually finished the hot course before the sushi course came. When the sushi course did finally arrive, I realized what had happened - the plate was beautifully decorated with handcarved vegetables. I appreciated the effort, but it did take some waiting.It took a while to get the check - I was not there for very long, so maybe they didn't want to rush me, but I was in a hurry for my long drive home. all in all, the food was very good, but the atmosphere was very strange."], ["Miss R.", "Edoichi's sushi is beyond fresh and incredible, and this comes from a self-professed sushi snob. You must try the Sweetheart Roll; it is to die for! We have also had the hibachi, which is also excellent. The waitstaff is attentive and caring and always go above and beyond to make sure their customers are always satisfied. We can't wait to go back!"], ["Paul L.", "This place is a hidden gem...literally hidden down behind a flower shop (The Flower Box) on the Silas Deane HWY. The service is great. The staff is very friendly and hardworking. The Hibachi is the best around.  The food is always fresh. We love the crazy tuna, lovers and many other chef special roles. We had a fresh scallop one night at the bar and it was out of this world. Nothing we've ordered has been anything less than great. We eat in and take out. Our kids love it, but they really add to the cost so sometimes we put them to bed and order out and hide all the evidence so they don't find it in the morning. We were caught last week so we had it 2 nights in a row.  Not complaining. Their noodles are very good and we love the miso or broth soups. The spicy tuna on the app menu is light and refreshing and is a great way to start off a perfect meal."], ["Jessica B.", "i really don't have enough good things to say about this latest sushi & hibachi spot in wethersfield! sweetie and i swing in on a whim for a late lunch on a blustery week day and were treated with undivided attention by the entire (super friendly) staff. i'm new to the area but sweetie has been here for some time and seen a couple of businesses come and go from that very spot and from the somewhat obscure location i can understand how that would pose a significant challenge. all i can really say is don't let that deter you! they totally renovated the space, it's clean, modern, and fun. we sat at the bar and were treated to fast, friendly service- complete with a few gratis treats such as a sample of one of their specialty cocktails and something very similar to a vietnamese spring roll. both delicious! we ordered a couple of specialty rolls and some of our old standbys as well as a kani salad. everything we ate was incredibly fresh and flavorful..not to mention the presentation was clearly a priority and didn't disappoint! i've had some good, even great, sushi since i've been in ct but this place pretty much takes the (fish)cake! it's on the silas deane sharing the building with a florist. park in the back, come in and eat..you will not be disappointed. they also had great prices for cocktails, although we weren't drinking that day...we'll definitely be back for a night out."], ["Marie C.", "I was very impressed by this place! The presentation of the food is very nice and the food itself is awesome. The only thing that I didn't care for was that I asked for my rolls to be made with brown rice and I regretted asking when I tasted it (it wasn't good). But, I will definitely be going back!"], ["Igor P.", "Tonight visit was great.  The staff were super friendly and helpful. Matt and Maggie provided outstanding service!  The food was simply spectacular!  Highly recommended!"], ["Seth G.", "What a wonderful place to go for sushi and hibachi.  The service was excellent and they truly went above and beyond for a birthday we were celebrating.  The restaurant doesn't look like much from the main road but the actual restaurant is around back and it is very nice both outside and inside.  There are plenty of hibachi tables, a sushi bar and restaurant seating.  If you are looking for a great place to enjoy Japanese food, you can't go wrong at Edoichi Sushi & Hibachi Steakhouse."]], "Sushi California & Teppanyaki Grill": [], "Seoul B.B.Q. & Sushi": [["Dave G.", "First time having Korean and I really enjoyed it! The restaurant was very clean and very presentable. The menu was easy to follow and had pictures of most of the menu items which made it really easy to order. I was worried from other reviews about the service but it was really good. Our waters were refilled quickly and the waitress and manager both came over regularly to see how we were doing. I feel like my soup was priced very well for the amount I received however there were a lot of menu items that seemed very expensive. The food was very fresh so I imagine you get what you pay for. I would definitely go back and i'd like to try some more Korean soups."], ["Nicole H.", "I love this restaurant!! I eat here at lease once a week! If you live in the area, I definitely suggest trying take out some time! They fill you up with everything no extra cost! Very authentic and beautiful inside! The sushi is good too though I mostly only go for the BBQ. Love!!! Can't say enough good things!!"], ["Ashika B.", "I have passed this place a thousand times but thought that it was your run of the mill carry out restaurant. On a lark I decided to stop in for lunch and was surprised to find an actual sit down restaurant behind the heavy wooden doors. They offer both a Korean barbeque menu and a Japanese menu with sushi and sashimi options. On my first visit I ordered from the Korean menu. The food was good, or rather I should say that my palette is not developed enough with respect to Korean food to know the difference.The menu is quite extensive so I plan to visit again to explore more of the Korean menu. On my next visit I ordered from the Japanese side. Now good sushi/sashimi I definitely know, and the fish was fresh but of average quality. Overall Seoul BBQ and Sushi is a good find. 3.5 stars!"], ["Semin P.", "This is one of the best Korean restaurants ever. I would say this place is even better than restaurants in Korea. Love it! So good! So so good!"], ["Meli G.", "Great Godzilla roll & pleasant waiter!  The BBQ dishes look interesting but I didn't try.  Different type of seating... But a good trip all together!"], ["M D.", "This place is wonderful. It's the closest to the NYC Korean places I like up in this end of the woods. They have all the best dishes and stews. It's very nice and modern-looking inside (although outside, you'd never guess it!). And they give you a ton of banchan with you meal! My only gripe is that the kimchi sides are so small. However, they will usually refill if you ask nicely. :) Just like in NYC! It's comparable to prices in NYC. I haven't yet had the bbq, but the stews and bimbimbap are wonderful! Also the sushi rolls! It's a nice stop if you want something different and are near the Westfarms Mall."], ["Rosanna M.", "I went with my family as we heard all the hype about Seoul BBQ and Sushi. Our first visit was obviously for the BBQ, eventually, I want to try their sushi. We went around lunchtime and were greeted and seated promptly. It was pretty dead when we went, but it was very early in the day. We were served tea and asked if we could also have water, which came a lot later (more on that below). We decided to get the 2 combos, the marinated beef and pork, to share among three people. With the unlimited side dishes, it was more than enough for all of us. Some of the side dishes we liked, some not so much. It depends on individual taste. My favorite was the pork, but the beef was fantastic also. Halfway through, one of the servers came to change our grill grate for a new one. We really liked that. Service was good, but at times we were confused as to who was serving us. We had three people check on us throughout. One of the reasons why our water took forever to come to our table because we asked one person who we thought was our main server. We finally figured out who our main server was and got the water promptly after we asked him. Some lack of communication there but other than that nothing to get all hyped up about. I would definitely come again and try their sushi and other dishes that they have. It's a bit pricey, but good for date night or for the once-in-a-while-let's-go-eat-out-because-I'm-too-lazy-to-cook sort of night."], ["Dana L.", "This is my favorite restaurant in the area. Food is good and come with good amount of side dishes, that made me feel satisfied and happy everytime I came here. Highly recommanded place. FYI. lunch special is even better deal."], ["Peter L.", "This service was much better this visit, thank god that guy stood around and wasn't doing much!However I am less pleased with the food compared to my last visit.I had the Korean cold noodles this time. Yuck it was disgusting.The noodles were stuck together like a overcooked \"noodle bundle\". (It's noted that they did put in effort to assist me when they saw that the noodles was stuck all together, but the food was just poor) The soup, was nothing like I had expected. It was oily and tasteless. They didn't put enough pear juice the soup. They tried to offer vinegar as a substitute just isn't the right substitute as it lacked the natural sweetness and sourness.Note: My friends who came with me liked their fish entrees but the food overall is still below average for a Korean restaurant. Good effort to step it up on the service though."], ["KC C.", "Stopped by here on my way back to New York and was surprised to find a Korean place.  The  restaurant isn't in the greatest location, but it's near the highway and once you go inside it's a complete different atmosphere.  The BBQ was good and what you would expect if you were in NYC, but was surprised by the number of side dishes they offered."], ["Nobbi L.", "So this is our second visit and I'm even more impressed than before. Our server today was Sunny who just started. Another ajumma who is so wonderful. This time we got 20 banchan! I think that's a record. This is by far the best Korean restaurant I've been to in Connecticut. If they had my favorite, yuk hwe, it could stand up to Korea Way in NYC. The dishes are flavorful, the banchan diverse and multidimensional. The Dolsot bibimbap was really crispy reminiscent of a Persian tadiq. Another plus is the Korean waitstaff. I don't like it when I go to an Indian restaurant and get served by a Guatemalan (unless he speaks Hindi or Gujarati or Tamil, etc.) I want the authentic experience. And here you get it. Too bad they have to have sushi."], ["Susan N.", "Ive been here a couple of times.  The place is clean with nice interior designs.  It was very comfortable because its very spacious.  They had private rooms, good for parties.finally we have restaurants like this in the hartford area.  We can finally grill our own beef inside.  I love how they served us alot of  side dishes with the orders, it was very tasty."], ["Steven K.", "Let me start by saying I really wanted to like this place. There needs to be more korean restaurants in connecticut!So finally I decide to stop by for lunch. I order dolsot bibimbap and I'm very excited to try it...5 minutes later I get my assortment of banchan and am told it will be 10 minutes for my bibimbap. There is only one other table that is occupied by the way..Okay so I wait and I sit. These banchan is supposed to be side dishes.. Not appetizers but I finish them all (I guess I was hungry..)And I sit some more looking at these empty plates.. Looking around no waitstaff around.FINALLY 25 minutes after I order my waitress comes with my.... Miso soup to accompany my bibimbap? And she tells me it's gonna be a little longer??!! Nah I'm out. I tell her I'm out and the owner and her aren't apologetic at all. I've never done this in my life. Wish I could review the food but only can review their horrible horrendous service. Worst ever and I'm used to bad korean restaurant service but this is on another level. Come here if you have ample AMPLE time to waste. Also no need to come hungry because the wait will do that for you"], ["Luc V.", "Ok so this visit was my second time here at Seoul Korean BBQ. My first visit was a disaster and I said I would never return. However, today i decided to give the place a second shot. My first trip here was when they first opened so I decided to stay open minded and try again. This time around they gave me more sides than I could eat. As a matter of fact, they gave more side dishes than any other Korean BBQ restaurant I have ever been to. Believe me I have been to many! The meats were well marinated and certainly great. The service was very prompt and fast. Only draw back really is the price. Sadly you can get the same food at any Korean bbq buffet and pay significantly less. Insanely over priced for those of you who never ate Korean BBQ before."], ["Joel L.", "I had dinner on my own so wasn't able to enjoy the Korean BBQ (most dishes are for 2+ people).  I had the sushi instead and that was fine.  The service was polite and ok.  I wish I had the Korean BBQ, it looked delicious."], ["Dan R.", "Very good food + novelty factor + fun factor + great service = A super meal experience!Our first experience with Korean Barbecue was very enjoyable. They've only been open a few weeks, and I've been watching the very positive Yelp reviews pile up on an almost daily basis. Everyone is right on the money - this is a cool place that gives you a lot of bang for your buck.We all opted for a BBQ dish from the massive menu. Our choices were marinated chicken thigh, beef, and pork bellies. The meals start you off with a tasting of 14 side dishes - all sorts of cubes of this, and slices of that, and shreds of something. I saw kale, bean sprouts, potato salad, kim chi, lotus root and who knows what else. Nothing was outrageously spicy and all of it went. The BBQ concept is a hoot -each table has a mini gas grill built into the table, and one of the service staff goes through an elaborate ceremony of taking off the grill cover, taking off the grill grate, turning on the gas, and igniting the system. If you have kids, they will be mesmerized by this (hell, I thought it was pretty cool myself)!In a few minutes, our server brought a ridiculously large platter of the raw meats we ordered, plus a pair of kitchen shears to cut up the chicken and a big set of tongs to grill our selections at our table. It was so much fun!The marinated chicken was the consensus winner- it was tender and tasty and just delicious. The beef was thinly sliced and cooked the fastest. The pork belly was thicker and semi-frozen so it took longer than the beef to cook. The food came with dipping sauces, rice, and a field green-scallion salad,Being BYOB, we complied and had a few cold ones which really complemented the hot grilled meats.The staff was helpful -and damn -they must have had 15 or so workers running around like crazy. We were asked every 10 minutes if we wanted more rice, more sauce,and more sides (I said \"yes\" to the kimchi and the chewy and addictive lotus root.  Our BBQ choices ran $23, $23, and $24 for a grand total of $77.41 with tax.  Now think about that - less than $25 for a ton of really good food, served in a very novel and fun manner.This was a blast!! Thank you Yelpers for turning me on to a sweet place,"], ["Melody K.", "Probably the best Korean in CT. My family and I have been coming here often since it opened. My mom is 100% This is real Korean BBQ- grills in the center of the table, vent on top, and mountains of banchan, mountains. I think 12 side dishes come out when you order. I don't love the frozen pork belly. In a place with that decor and for that price, you expect fresh. However, the menu is great. We love the clay pot soups and they even have street food classics like dukbokki! Great for big groups in fact, I recommend you bring at least four people to split BBQ with- makes it economical- there is a ton of food!"], ["Lesley M.", "Going to a restaurant in its first week of operation is always a gamble because the staff is still trying to figure out the work groove.  Therefore, as a patron, you are expected to have some hiccups in service.  However, I see a lot of potential in this place.Despite being new, I really wanted to try this restaurant ASAP.  When I saw the first reviews on Yelp, I knew that I had to drag my fiancé.  After all, I drive by it everyday to work (both jobs) and was anxious to try it!Though located in a crummy strip mall, the location near Westfarms Mall and the interior décor are both perfect.  When we walked in, lots of tables were occupied and the kitchen was chaotic.  We were walked to our table/grill immediately, but were not acknowledged until ten minutes after we were seated.  Our waitress was very nervous and appeared to be new to waiting on tables, but gave her the benefit of the doubt because the restaurant was new and it was busy.  She was hesitant when she was cooking our meat on the grill.The menu had lots and lots of choices; Korean bbq, noodle dishes, soups, and sushi.  We were surprised that it was not cheap.  The Korean bbq was in the $20 and above range and it was a two-person minimum.  Since we never had a Jewish Christmas on Christmas, we splurged on the BBQ and ordered the Chadol-Baegi (beef brisket that is not marinated) and Daeji-Bulgogi (spicy pork collar, more like paprika pork collar).  Both were very good, but I liked the beef brisket.  You got a lot of food and it was like a Korean hibachi.  As Jason M. reviewed, if you get the BBQ, you don't need to get anything else because it comes with a bunch of different mini appetizers; some were good and others were misses.What was cool was that they didn't have a liquor license so we got a bottle of wine from CT Bev Mart next door, so we saved money on drinks.  The manager walked around and asked about our experiences.  There are little rooms for those who want a private party.Definitely be back, but to try a soup or noodle dish.  Good to see non-chain restaurants open in the West Farms area."], ["Jenny C.", "It's Christmas Night and H and I were too lazy to cook. I searched on Yelp for any open restaurant... lo and behold, a newly opened (12/20/13) local restaurant! The restaurant is not at all difficult to find. It's basically across the way from Chili's and in the same plaza as Subway. Parking was plentiful and packed- a great sign! We were promptly seated by the hostess and were in awe of the setting. It's beautifully decorated- there's so much to look at! H and I have been to our fair of Korean BBQ houses... and this might've been the prettiest to date. Our waitress was quick to take our order (BBQ- bulgogi and kalbi... Adventurous eh?! But it's the staples with which I determine a restaurant's yumminess) and our side dishes came out promptly. They were delicious in terms of ban chan (really, how hard?!) and were really flavorful. Waiting for our entrees, on the other hand, was a tad annoying since we waited a little over half an hour for raw meat (customer usually cooks it on the grill, refer to pictures). One of the staff members took the time to cook each set of raw meat- a nice surprise since I usually cook it for my H and I. The bulgogi was nicely seasoned- not too sweet and not too much sesame oil (which is how I like to make mine- much to H's digress). The kalbi on the other hand was perfect! Also, each of our waitresses were wicked nice!Also, H just had to order Philly and Cali rolls... They were standard fare, but great for the area. Too many local restaurants douse the rice with too much rice vinegar and overload the roll with rice. Yuck! Nothing extraordinary, but not horrible. Overall, well definitely come back. It's a tad expensive (prices are similar to Korea Town IMO) considering the area but the food was delicious and the waitstaff were wicked nice.(As I was looking around at all the beautiful things on the wall, a man spoke with me. He saw how cold I was and commented that it's the vent from the hood, that he was sorry! I thought he was an innocent customer who just pointed things out and thought nothing of it when he say at the next table. Also, our lid for the grill fell to the floor and he promptly picked it up! Should've been my cue that he's co-owner, part owner or the owner- but I was too busy enjoying my food and the atmosphere. Haha. Just a side note.)"], ["Zoe J.", "I loved the place. I will definitely go a gain and recommend it. The staff is friendly and attentive. The food came timely it was so good and well presented and garnished. We didn't do the grill because there was only two of us and it was expensive but next time we will do it with a full table."]], "Sakura Garden": [["Penny M.", "It was a HOT summer night - Hubby and I were looking for a spot to eat...and we decided to try Sakura Garden.  Service was great - helpful, friendly, not overly intrusive either.... The Frozen Mango Mojito was absolutely Marvelous! My husband enjoyed his Sake and was pleased with the selection of Sake available.  We ordered the Sushi & Sashimi for 2 and were in absolute heaven!  The presentation was stunning, the fish was FRESH and everything was absolutely delicious.... We were impressed from start to finish and will return very soon."], ["Megan R.", "It was dinner on a Sunday night for 6 of us, family night. I had a Groupon for Sakura, and the Glastonbury location was convenient for all who were joining us that evening.The interior is beautiful, very classy elegantly decorated. We were seated in the dining room, so as to enjoy a more conversation then watch the Hibachi show. The service started out well, but as it appeared to get busier through the shift, certain elements were certainly lacking. Our drink orders were taken, and after fifteen minutes, still no cocktails. The drink order wasn't big or complicated either, two of the signature martinis from the list, and one glass of white wine. Our appetizers had arrived and been eaten before we had to make the second mention of no refreshments. They were soon brought out, but nothing was comped off the check, or even apologized for. Our martinis (once they arrived) were the bright Pink Panther for my friend Stephanie, sweet and pink, and I had the Lychee Martini, which was excellent. A nice new martini to see on a menu, and a perfect balance of sweet lychee and sake. The appetizers for the table included:*Edamame - generous sharing portion*Coconut Shrimp - Very crunchy, very coconutty, and an excellent rich coconut sauce.*Seaweed Salad - Seasoned and with sesame seeds*Kani Salad - Crab, cucumber, and masago in a creamy sauce. Not too creamy at all, really nice rich crab meat flavor, one of my favorite types of salads.*Crazy Ceviche - Mixed raw fish and vegetables, with a seven spice dressing.  Nice flavor, definitely in the right category under \"New Style Sashimi\" different, reminded me of a ceviche stir-fry.Dinners included:Scallop Hibachi - Perfectly seasoned veggies and rice, nice sized seared scallops.Sweetheart Roll - Cut into heart shaped slices, with a wonderful sweetness with a miso honey sauce.Autumn of Alaska Roll - King Crab with a soybean wrapped with a honey pepper sauce. Excellent.Mummy Roll - Shrimp tempura, tuna, lobster salad, red tobiko, spicy citrus sauce, so many crazy flavors, and it works!! Awesome presentation on this roll in particular. For desserts, we went for a Turtle Cheesecake, I'm sure it was not made on premise, but it still wasn't too bad, and Tempura Fried Bananas, which were awesome, light and sweet, and perfect to share among four happy ladies.The service would be the only reason that we wouldn't return, because it was a bit slow. The prices were reasonable, for 6 people who left satisfied, our bill was under $200, even before the Groupon discount. I have heard very very good things about the lunch specials here, and am looking forward to coming back for a lunch meal, and probably quicker service. I think there is also a patio, once the sun comes back out."], ["Ashley T.", "This was my first time here during a normal work day lunch, and as is custom my coworker and I sat at the bar. There were service problems from the start. We had to talk to the hostess to even get menus and she seemed offended that we sat at the bar without talking to her. There was no dedicated bartender and everything seemed disjointed. The horrible service continued throughout the meal or well lack of service. The next complaint is the food. We got the hibachi lunch without actually sitting at the hibachi tables. Our food was cold by the time it got to our table and simply bland.I wouldn't recommend this for anyone who is looking for a decent quick lunch."], ["Will W.", "Great ceviche style appetizer, fresh sushi and good habachi.  Good selection of saki and mixed drinks."], ["A. G.", "We went out for a girl's night out. We got the hibachi which the cook was so so on entertainment. Also our entire meal was super salty. At the end the waiter told us he splits the tip with the cook. So if we could give $10 more. I didn't pay since it was for my Birthday but they gave a 15% tip. Which isn't a tip optional, I never heard of asking for more money. That really didn't sit well with us."], ["Justin G.", "interior decor wins it 2 stars but the remaining is a flop.  Nothing special here just another so-so chinese owned japanese joint.  Yaki udon was just plain boring.  My sushi was well below par.  Tuna was not fresh served with the incorrect rice.  the outside patio is cool but too many high school rift rafts buzzing by with their chopped off exhausts and booming systems.I can not speak for the hibachi but as we all know your paying for a show not for food.  just spin around some wood spoons and shoot sake into someones mouth and you have your so called hibachi."], ["Sandra C.", "Went there on a Sunday for a dinner with good friend. Very last minute pick and all day Sunday is half priced sushi. Wow. I thought their sushi was very decent. The prices can't be beat. Decor relaxing and funky. The place was packed."], ["Kasey B.", "I actually like the one in South Windsor more.  The sushi is great here too, but the list of rolls at the other Sakura is longer and definitely more creative and interesting.  They also have a better selection of sakes at the place in South Windsor.  The one in Glastonbury does look a lot nicer on the inside.  I went here after a soccer game to catch up with a friend I had not seen in a while.  We were in warm up pants and sweatshirts.  We definitely felt out of place even in the bar area and at the sushi bar area.  We still ate there but we felt awkward."], ["JT A.", "I sat at the sushi bar and order a small order of sushi with a seafood miso soup. My sushi arrived first and was just mediocre. The maguro was a bit of a disappointment and not worth the price. The soup was forgotten by my waitress until she was reminded by the sushi chef. However, the soup was much better than I expected. The miso broth was nice and strong and the soup was loaded with clams, scallops, shrimp, and crab. It was all very substantial and very filling. Give it a try!While not impressed with my sushi order (maybe I caught them on an off-night), the meal was enjoyable due to the friendliness of the sushi chefs and the quality of the soup. If I had more time in this area I would definitely give them a second look. If you haven't been, stop by and add your thoughts too."], ["Stefanie J.", "Happy hour here is fantastic - a great selection, nice outdoor seating, and just really good food. The pork gyoza and vegetable tempura are both great, and of course the sushi."], ["Jennifer B.", "First off, thank god someone actually designed a Japanese restaurant with Hibachi grills with some sense!! I am not a Hibachi fan and was so impressed that the grills are in a completely different part of the restaurant which of course keeps the noise down and keeps me from smelling like fried rice all night. The decor and layout of this restaurant gets five stars. The decor is modern and different which matches the menu. The menu is good but I wish they would explain their modern roll section a bit more. The presentation is amazing. I had the avocado salad which was good. Pretty basic but with fresh ingredients The fish in the sushi was fresh and very tasty! I wish they had some healthier dessert options. The service was excellent as well. The restaurant was not very crowded. We had made a reservation but it was not needed."], ["A A.", "I love this place. Great lunch spot. I get the a lunch box ( either sushi, chicken or beef teryaki whatever I'm feeling that day.) It comes with salad (I love the Ginger dressing) and miso. Then they bring you out a little wooden box with rice, vegetables, California roll, and some little dumplings. It's great and priced to please. Happy hour is a hell of a deal too.  In the warm months you can sit out on the patio and watch the Aston Martins drive down new London turnpike."], ["L. R.", "Overall, only three stars.  Here's why:Atmosphere:  Absolutely stunning decor - modern but not cold - with spots of fun color in the crazy lighting over each table and booth. We sat in a huge comfy booth with high backs for nice privacy.  This would be an intimate sexy place to take a date.  (We had 2 quiet, well-behaved kids in tow.  LOL)The sushi my husband and older son had was 4 stars....fresh and nicely prepared.   Husband had sushi platter and older son had a spicy maki platter.   The Nabeyaki Udon I had was a generous bowl of noodles, but UTTERLY FLAVORLESS and very skimpy on anything that could have added flavor, like mushrooms or fish cake slices that are standard in that dish.  A no stars item.  When the waiter came over to ask how our meal was, I told him there was no flavor in the dish, and he shrugged and told me it was a fish-sauce base, as if that was the explanation.  He offered no solution at all, then wandered off.  (Side note:  MUCH much better Nabeyaki Udon at Natori in Manchester, although you won't get the slick atmosphere).We wanted to order younger son something off the kids menu and asked to change the noodles from what was offered to udon noodles, but that was met with verboten - NO substitutes - so we had to order the adult size version.  It wouldn't have killed the chef to substitute one type of noodle for another.  If this place was turning away customers in a booming economy, I might not have a leg to stand on, but we ate there at 6:30 pm midweek and the place had 4 customers, none in the hibachi room.  A little flexibility brings customers back.As pretty as this place is, I'd go again probably to take a friend for the pretty atmosphere and for sushi only. On the way out, I asked the hostess for a takeout menu, and she gave me one from her secret stash that had a $10 coupon when you spend $50."], ["Rae B.", "i've been here a few times, and i'll come back for a few reasons.  the food has consistently exceeded my expectations, the drink menu has a very nice selection of sake, and Hibachi is always fun for a crowd! but this over-zealous bussing of tables needs to stop. the service, however, is hit or miss. sometimes i come, and everything is great. the server is nice, makes recommendations (this is how i found the joys of unfiltered sake), allows us to take our time with the meal, and i really enjoy myself. other times, and not when things are busy, around 5:30 on a wednesday evening, everything was very rushed. our waitress checked in with us every two minutes to take our order, even though menus were still open at the table. she rudely reached over my plate to take another dish from the table, that we were not even finished with.  my friends plate was cleared from under her chopsticks, before her last bite of sushi got to her mouth. that kind of militant bussing of table really turns me off to a place. the times i've been for hibachi everything has been wonderful. the hibachi cowboys always put on a nice show, and the sake flows like water. the food is always great, and i've never been rushed through a meal with the hibachi setting."], ["Sean H.", "The sushi is above average, the hibachi is above average, the service for large groups is below average.If you go in a smaller party 2-4 you will be fine.  Otherwise you should read about our experience.We arrived on time, even with the constant parking hassle of Eric town square.   We were met by a gracious waitress who was good and attentive.   We ordered drinks, they came at a good pace.  We ordered dinner and things went down hill from here.Two of six meals showed up late, one 10 minutes after the other four and one 20 minutes after the others.   This was unfortunate but we took it in stride and did not complain.    No manager came to apologize.   We finished our meals, were not offered, and, did not have dessert, paid the bill and talked for maybe 5 minutes after paying the bill.   The waitress came and asked us to leave the table and move to sit at the sushi bar.   This was uncomfortable enough, I was insulted and really just wanted to leave, but we moved.   Not two minutes pass but now a hostess comes and asks us to move to the bar.   We were quiet, it was after 8pm and not at all busy.  We were not drinking, nor did we want anymore to drink, why move us to the bar? Now we are insulted, and embarrassed.    I will not ever take a group there again.   Sakura in Glastonbury will be the last on my list when I visit the town square.   Is too bad, I like the sushi, but I don't need to be embarrassed when out with family."], ["Hilary D.", "I recently dined here with a few friends and their children.  I must say first of all that this place has the BEST sushi I have ever had.  Hands down.Additionally, I noticed there were quite a few families also dining at the same time - and everyone (including our group) was having a fantastic time.  The service was great - our Hibachi Chef was Brian and he was funny & great with the adults & the kids.   Our server was Dan - he was busy with a few packed tables, but really did a great job attending to every request in a timely and friendly manner.  Next time I definitely want to check out the bar before dinner!"], ["Eli Z.", "After reading all the great reviews for Sakura we decided to give it a try last night. So glad we did. I was craving sushi and they delivered . The fish was fresh and flavorful. My bother n law and I split the Sushi For Two which came with 20 pieces of assorted sushi and two rolls. My wife and sister n law had the Vegetable Hibachi and Amazing Chicken. After a few Sapporo's and some sake, we all left happy and looking forward to the next visit."], ["Wilawan W.", "Me and my bf when for late lunch , the food was okay and our sever she have no clue what she's doing the whole time... But we just not try to make a big deal out of it until when we ask for the check , we ask for Togo cup for the ice tea than she come back with a Baby Bottle Cup !!! Omg the cup is cute .. But come on is this for real ??? Than I ask her what is just happen ? She told me that they don't have a Togo Cup is that why she gave our a Baby Cup from some where....? who's know ...! And the stupid host she asked me why don't you want a baby cup ?? What's wrong with you guys !! ??"], ["Erika S.", "So I went to Sakura Garden of Glastonbury on a Friday night. The restaurant had maybe 8 tables going. What a shame! The people of Glastonbury do not know what they are missing! This place is tucked into the same plaza that Plan B, Dream Dinners and Sauce are located. I've been to the other two locations, and I must say I think I might be their biggest fan. Fusion Japanese, or \"New style sashimi\" as they call it, is where they shine. I got to witness perfect execution of this on my most recent visit to this location. This restaurant has the same feel as the other two. A very metro feel, but tastefully done. There seems to be different themes throughout the Glastonbury location that perhaps I just didn't notice in the other two; Mt Fuji, the New York Skyline, etc. We chose to sit at the bar which is in the center of the restaurant, mainly because we know Sakura Gardens shines when it comes to hibachi and also traditional sushi, now let's get down to business and hang out at the bar and taste this \"new style sashimi\" My date ordered a hot sake and a sapporo and I chose a Pomegranate martini. The pomegranate martini was perfection in a glass, a true martini. A slight natural hint of pomegranate, not one of those candy flavored martinis. There were two bartenders on that night, Evan, and the name of the other one escapes me, but they were both friendly as can be and extremely efficient. After looking over the menu, we decided to start with Sushi Pizza Fiesta for an appetizer, a Geisha Sister and a Spicy Tuna Sandwich. These chefs take great pride in what they do, each dish was presented beautifully, and tasted even better. -Sushi Pizza Fiesta: Spicy Tuna, tomato and mozzarella cheese on homemade tortilla chips with spicy mayo and eel sauce. -----This was amazing. The eel sauce which can be intimidating to some, shouldn't be. It gave the \"pizza\" a smoky flavor. We asked how this was toasted and were told that the chefs use a hand torch to melt the cheese on top and give each chip a nice glaze. This app was 4 individual pieces....more than enough. -Geisha Sister: Baked, stuffed salmon with snow crab, baby arugula and served with spicy coconut aioli. -----This also beautifully presented in two separate portions, but on one plate. A great choice to get if two people want to share, but a lot of food for just one person. This is a baked fillet of salmon that is stuffed with a velvety snow crab filling. The spicy coconut aioli was good, but a little on the sweet side for m palate. I could however, appreciate why they chose it for this dish. -Spicy Tuna Sandwich:Spicy tuna, avocado, crunch, red tobiko, bonito flakes, soy bean sheet in sandwich shape and served with spicy mayo. -----This was by far my favorite \"new style\" dish of the night. Excellent!!! 4 triangle \"sandwich\"pieces were presented on the plate. This was extremely creative and very tasty. I'm not going to elaborate any more...just go order one. It'll be the best thing you've ever done! While we were sitting at the bar chatting up the night with the bartenders, I ordered another martini, The Rising Sun. A little on the sweet side for me, but that was due in part to one of the ingredients that I didn't realize was in it., This visit goes to show that the food is consistent at all all three locations, consistently excellent. This new \"local chain\" has officially raised the bar on Japanese and sushi dining."], ["Eliza T.", "Wow!  We were instantly impressed as we walked in. The decor is modern and elegant and romanically lit.  It was a Saturday night, and we're actually sad to see not to much business going on inside---hopefully they'll do better soon so they can stay in business!We chose to sit at the sushi bar.  It is a Korean-run place so if you love sushi, you should know what that means...still good sushi, but perhaps not as \"authentic\".  They of course had the \"creative\" sushi and sashimi options.  We opted to start with the sushi/sashimi combo for two which had 15 pieces of nigiri, 18 pieces of sashimi, a spicy tuna roll and a shrimp tempura roll for $48.  We had the Nigori sake with it.  The presentation of the combo was very very eye-pleasing.  The fish was all good and fresh.  Though they served use mackerel (saba) and told us that it was spanish mackerel (Aji) so I'm not really sure if it was an honest mistake or he just didn't know there's a big difference???  They did use very little rice on their rolls as well as nigiri, which we very much appreciated.  I did have a problem with the way they cut their sashimi however....and this seems like the common problem at Korean-run sushi bars....where instead of cutting across the tissue planes, they cut parallel to them so that your teeth end up cutting through the tougher connective tissue and that was somewhat unpleasant.   So the order for two would probably be enough food for most couples, but my BF eats a lot!  Esp when it comes to sushi!  Hahaha So we had to order a couple more rolls for him.  The rainbow roll was classic and simply done.  One of their special rolls is the Naturo roll which has salmon, tuna, and yellowtail wrapped in cucumber and no rice was amazingly refreshing and perfect for the summer!  Everything was reasonably priced.  Not cheap overall, but for sushi I can't complain.So overall, we really really like this place.  It is a bit of a drive from New Haven, but I'm sure I'll be back."], ["B G.", "Wonderful.  Delicious. Great service and great food.  Been here dozens of times, never a bad experience.  Best sushi in Glastonbury!"], ["Nina L.", "On my way home and craving sushi, I Googled my Droid to see where Glastonbury's Japanese restaurants were and wound up here. It was a Sunday afternoon and I sat at the sushi bar. The chef was very friendly. The sushi was really delicious; I had a special spicy tuna roll. I would definitely go back and hope to have the same experience. I felt very welcomed."], ["Adrian W.", "Good standard as well as creative sushi offerings. I have only stopped in for lunch, so I can't comment on the hibachi or dinner offerings. Each time I've left satisfied and found the staff to be very attentive. They also remembered me, which felt nice since I've only been in 3 times. Compared to the other Japanese restaurants in Glastonbury, I would put this one on a higher level. I'm currently 7 months pregnant, so I cannot have any actually raw items. When I've requested tobiko left off of handrolls they've accomodated me, which has not happened at the other 2 sushi places in town. The bento box lunch is larger than similar bento boxes I have had elsewhere - which to a pregnant woman is great! I definitely recommend Sakura."], ["Rod E.", "OK Japanese food, hibachi is VERY pricey.The service is ok, the food is good, but sometimes inconsistent from visit to visit, and the hibachi tables are VERY expensive (something like $22 per person).I've ordered the Yaki Udon a half dozen times, and the two most recent times it wasn't even hot, a big turnoff.  My wife complained that there was lipstick on her glass, and not hers, so they could pay closer attention to the cleanliness of the restaurant as well.We'll go back, but we'll be on the looking for those negatives I've described.A major complaint of that area (not the restaurant) is that the parking situation is horrible, like they built 50 spots in the lot for businesses that require 200."], ["Julie k.", "This place has really good sushi and sashimi. We ordered the sushi and sashimi plate for two and were not disapointed. The sushi had just the right amount of rice, which was cooked to the perfect consistency and flavored well (dont underestimate the importance of rice texture in sushi), the sashimi was very fresh and cut nicely. Our favorite was the scallop sashimi...mmmmmmmmm. We also ordered uni and it was oh so uni-rific. Overall, it was excellent. Even the rolls were very good! I really like this place. They have hibachi too! If you want some good sushi, try this place out. Dont forget to order some warm sake too. mmmm. I'm very happy tonight =)"], ["Loucindy W.", "This is a great place for sushi. Great decor, ambiance, and of course, wonderful sushi."], ["Moses P.", "A friend and I went up to Glastonbury to visit a friend and his family. We looked at the prices and could not believe how cheap it was in comparison to NYC. The hibachi was absolutely freaking awesome. Still craving hibachi, my friend and I went to Benihana's in NYC a few days later, paid double the price, and the quality of food was half as good. I am dying to go back here. Thanks Sakura!"], ["Mickey Z.", "wait staff always screws up orders and forgets these. The food is tasty but could be better - the rolls could be more creative. tasty drinks though!"], ["Karen P.", "One fateful night, the burger place down the strip mall was way too crowded, so we decided to try this place instead.  Thank the universe!  The sushi here is a-MAZE-ing; it's honestly in my top tier of sushi restaurants.  We tried a volcano roll (spicy tuna with salmon), a salmon roll, a Boston roll, a sweetheart roll, and... oh, I can't remember them all, but they were all so good,  they rendered us speechless.  I am at a lack of words for how to describe the awesomeness.  Just try it.  Our waitress was great, too-- very professional, friendly, and efficient.  The only reason I didn't give this place five stars is that, first of all, I'd like to go back just to make sure (yum!), and the decor is... well, odd.  I noticed a lot of reviewers saying it's relaxing and cozy, and I suppose it is, but it's definitely quirky.  I say this as one who appreciates quirk.  Just be prepared to eat amazing sushi while listening to the upbeat 70s station on Sirius radio.  Also, the parking situation is nothing short of abysmal."], ["Kevin K.", "Best Japanese Restaurant in CT, and I have been to all of them. Wide array of Specialty Plates and rolls. Excellent atmosphere and plate presentation is like art. Really cool drink choices that your date will love. Service is quick and quality is top notch. Bring your wallet."], ["Katie M.", "We went there on a Friday night. It was not very busy at all. We where going to go to plan B, but there was a 40min wait. And am I glad we ended up at Sakura! The decor inside is very nice and the booths were big and comfortable. The food was excellent! We ordered mostly sushi and it was very good.The only thing I can say is the service was pretty slow. It was not very busy and our waitress hardly ever came around. And when the food came out, she brought 3 or the meals and it was almost 10min before she brought out the other two meals. And we ordered the chicken tempura and she brought us a chicken teriyaki instead.If the service was a little better I would have definitely given 5 stars."], ["yes n.", "The worst place I have been to in a long time. That is a bold statement, I have been to hibachi places before but when nobody there speaks proper English it hard to tell them what you want to eat, I ask the server to make me a martini that was dry, pretty easy right 30 minutes later she showed up and said that they didn't know how to make it what!!!!! Its just alcohol with no vermouth and when it came  to the food I was allergic to shell fish and told the server, but still food came out with shell fish with it in my food, After the fourth time going there I will never go back and the manager does not know what the hell she is doing her name \"Christine\" she was probably the worst of all hire some people that speak English so I don't have to sit there for a hour ordering food to go, I work in restaurants and I tell people if you go there just get fried rice everything else sucks."]]}