{"King and I Thai Kitchen": [["Sarah O.", "I am rounding up from four and a half stars, and it's not on account of the decor, which is caaa-razy (if you're not convinced when you first walk in, check out the restroom). The food is excellent, the prices are super reasonable, the service was fine, and it's BYOB.I ordered tom yum soup to start, and the serving was unexpectedly huge. It was delicious and quite filling, to the point where I didn't want to finish it for fear that I wouldn't be able to eat my entree.The shrimp and pineapple curry was likewise excellent-- well-seasoned, with lots of shrimp. It wasn't crazy spicy, which I appreciated, and the portion was large enough for two people.In sum, my advice to you, prospective King and I patron, is two-fold: 1) remember to B your own B, and 2) consider splitting an entree unless you're famished or want leftovers."], ["Byron D.", "This is a small restaurant in a part of town that does not have much off street parking.  Fortunately The King and I has a large safe parking lot. This eating place is somewhat concealed,  set back from Park St. on the first floor of a renovated house.  Assuming seating is available, you are seated immediately.  The menu is easy to understand, and the food is extremely good.  The dining area was crowded at noontime, although I did not have to wait.   My meal was very spicy and extremely delicious.  I noticed my dish had sliced red peppers in it in the place of chili peppers.  Probably a good thing.  I thought it was spicy already, if these were chili peppers as I have seen used elsewhere, I probably would have broken out in a sweat.Meals here are a good value, and best of all, the food is well prepared.  I just love all the dishes that blend coconut milk, lemon grass and chillies into these fragrant yummy entrees.  The fried rice combinations looked delicious.  I need to make it back here soon!"], ["R F.", "Best thai food in the Hartford/West Hartford location. I highly recommend their noodle dishes- drunken noodles with a side of sticky rice is the best! Good size portions and more of take out restaurant."], ["Peter N.", "I'm from Los Angeles, home to the fist Thai Town and largest Thai community in the U.S., so I know the cuisine well.FOOD:  is very tasty and fairly authentic.  The portions are quite good.  I had the beef pad se-ew, papaya salad, and Thai iced tea.  The salad, in particular, was spiced just right and quite flavorful.  The noodles were also nicely prepared.  i had the coconut sticky rice dessert (the mango was not available) and thought it was great.SERVICE:  had been friendly and fairly attentive on a number of occasions.  Unfortunately, I had a bad service experience here.  I arrived and was told that I had to wait 5-10 minutes to be seated, even though there was clearly a table available.  There was no space inside, so I sat outside for 10 minutes without anyone checking in on me, even though many patrons were leaving the place, and more tables clearly had opened up.  Very rude and disappointing.AMBIANCE:  this is a cozy, family run place.  You can see the food being prepped and prepared which adds to the feeling of authenticity.  The place is decorated nicely and is clean, but there could be a wait during peak hours as it is not large.  They have their own parking lot.VALUE:  is decent and you get your money's worth here."], ["Blah B.", "We found a two-inch-long thin metal wire AND a rubbery piece of string in our pad thai.  This wouldn't have been so bad had one of women who work there not implied that they couldn't have been responsible, suggesting perhaps that we planted it there. She said, \"you should've said something as soon as you found it.\"  In fact, we did say something right away, but it was more than halfway through the meal. We had four young children at the table and any one of them could've ingested the foreign matter.  The idea that we would've somehow planted that stuff just to get out of paying for the dish makes my blood boil.Disgusting people."], ["Michele S.", "Loved the salads but the pad thai was rather tasteless. I asked for spicy drunken noodles, and it was incredibly hot. There are different levels of spicy, and I shouldn't just taste the burning sensation on my tongue. Lunch specials are the best bang for your buck. Good service. I would look toward better Thai restaurants in southern CT."], ["Meeja R.", "Great Thai Food! Good quantity and very delicious."], ["Todd A.", "Finally got here. Wasn't expecting much; the feel I got was hype from people who don't know Thai, or who have had a bad experience. Hot Basil was closed, and was craving Thai so....Backing up; the people making this happen for you are Lao. Now, don't jump to conclusions; in my limited experience with persons of other cultures serving Thai, the Lao do a credible job. Only done that place in Blue Back twice, but both times very sweet, which is a trademark of Cambodians. Which is what the people bringing that particular flavor of Thai are. My wife is VN; she said, \"They have a bowl of sugar on their tables.\" And, I asked the hostess at the place in BBSq; she confirmed.Back to K&ITK; I'd stopped in a couple times previously to get a to-go menu. Not impressed; workers were distant. But, this early SAT afternoon, got someone who was all of personable and friendly and helpful. I got take-out; its generally easier, but seems things would be fine in this small dining area, as long as its in off-hours and she can run around w/o getting into too much trouble.A pet peeve are servers who can't make recommends. It can cost up to two stars, in an extreme case.Anyway, Ms Friendly guided me to some good dishes. I generally get the Som Tum; this was a goodly portion and had heat that built on the palate as one got further into the dish. Red curry w/ chix was both spicy and tasty. Companion deemed it her fave. Thai Basil Duck was another fave, notably w/ my toddler. Jungle curry rounded out the meal, and it was tasty. Lots of veggies, but also a reasonable amount of protein defined the dishes. Prices were at or about comparable to other places around, but flavor and portion distinguishes this from many others. East-West is still my fave, but I'll return to K&ITK."], ["Alice C.", "Came here last Saturday for lunch with a friend. When we arrived at 12, there were no one in the restaurant, it took about a minute before anyone realized we were there. The food arrived promptly and the waitress came back to check on us frequent enough. We ordered the green papaya salad, one of my favorite Thai dishes. It was very well done. I ordered the Panang curry, the portion was enough for me for two meals. The dish was also very nicely done. Both the dishes were authentic, and home made good. My friend ordered a Laotian dish, it was a stir fry beef dish with sticky rice. I never had Laotian food before but this dish was a-okay but I love the sticky rice.I have been looking for an authentic Thai restaurant in the Hartford area, although this is less fancier than the Thai restaurants you will find in Blueback square, but to me this is superior for its authenticity and I will definitely be back for more.On a side note, I left my purse at the restaurant and realized it about 15 minutes later, when I got back it was safely tucked away by my server behind the counter. She couldn't have been a better lifesaver."], ["Tianna G.", "Another Hartford favorite. This was my first Thai food experience and whenever I eat Thai now, I usually rate it thinking, \"Yeah, but was it King and I good?\" The place is often overlooked by those who don't know it. It looks like a regular red and white house that happens to have a parking lot in the front. There's a sign out front, but I've lived in Hartford my whole life and never realized that the sign and parking lot weren't for the small restaurants next door.Step inside and there's about 10 tables sitting inside what looks like a living room. The first time I saw it, I thought everyone would be cramped and unable to move, but it's actually very cozy. You really feel like you're eating in someone's home. Adding to that is the friendly service from the staff. You're greeted with warm smiles and hellos as soon as you walk in the door. The menu is very easy to navigate but if you're a newbie to Thai food, any of the servers would be happy to suggest something. My favorite is the drunken noodles (pad kee mao) with shrimp. Best drunken noodles I've had and now I won't eat them anywhere else. Other than some specials, all dishes are available in beef, chicken, pork, shrimp and tofu and are easily modified for the picky eater. They also serve amazing duck! Vegetarians rejoice because there are plenty of options for you and all are just as tasty as their meaty counterparts. You won't just feel like you're eating a careless side dish, but the food stands out on its own. And the portions are fantastic.Another plus that I love is that King and I isn't like some restaurants that have one menu for lunch and completely different, wildly more expensive menus for dinner. Their dinner prices are only about $1 more than lunch which means all day long they're reasonable. It's BYOB, so grab a great bottle of wine before you get there."], ["Rebekah R.", "We were driving thru Hartford, from a long trip thru NY and decided we had a craving for some Thai.  Looked it up on Yelp (OF COURSE!) and The King and I was suggested.  I have only had a thai a handful of times, so I can't go on too much.  I ordered the Pad Thai, which was amazing! I have had a pad thai several other times, and this was by far the best. The servers were quick, and friendly...although we were the only ones there.  This would definitly be difficult to find, had we not found the suggestion.  It just looks like someones house with a big parking lot.  Prices were good. Will be back if ever driving thru town again.  I would recommend!"], ["Anthony P.", "1.) Introduction:I decided to come here after reading reviews and a recommendation given to me by my Laotian friend. That was enough credibility to eat here.2.) What your eyes may see:a.) Outside:It's located in the Parkville section of Hartford. So just over the lines of West Hartford. This part of Parkville is what I believe a predominantly Brazilian community, though there are some Dominican businesses here, too. They have their own parking lot and it seems pretty nice.b.) Inside:It kinda has that homely feel to it. The rugs appear a little old (I notice stuff like that because I have asthma). The back area, which I believe where the kitchen is seems  a little cluttered. I definitely feel like I'm in somebody's house. The lighting is dimly lit, but I don't know if that is due to old lights. I like how one of the workers is cutting food in the dining area. Once again, I feel like I'm inside someone's home and I am a guest. This maybe a Sanitary Grade \"A\" place but their methods state otherwise. The glass and dinnerware that were set on the table appears to be the same glass and dinnerware that was on the table of previous guests. They probably figure, if they aren't using it then why constantly switch it out? Well that is not totally true. The fact that this glass was mouth side down yet touched by me when eating, could be applied to the previous guests and their possibility of handling it. Even though I wasn't drinking out of this glass, I still found myself playing around with it a few times to move it out the way.3.) Food:I got the Chili duck. I was in the mood for something spicy. Like my pizza and burger places, I always have a basis for a restaurant I'm new to eating at. With Thai restaurants I always go for duck first. I told the waitress I want it \"not American hot.......but THAI hot!\" She smiled and said okay. She came back with the food and I was happy to see the portion size. Yesssss, now I have a little for now, a little for later, and maybe a little for even later! This duck dish was primarily vegetable than duck. A huge dish, with loads veggies, and not much duck! I'm still debating what the duck's portion size was on this place. Some of the slices had cartilage in it. The chili dish was below my expectations. I asked for it to be \"Thai\" spicy and NOT American spicy. I really feel they underestimate this American's tongue (American with foreigners as parents). They thought by shaking some extra crushed red pepper it was going to make me go \"Wooooohooooooo!\" Crushed red pepper is like Black Pepper to me, it's more of a flavor enhancer than a spice. Also the sauce or curry itself was VERY sweet and salty. I was basically served a dish in an Americanized way......overly salted and sweetened with mild spiciness. Apparently that's what we Americans find as most flavorful, sugar and salt. *Now eat up!*4.) Service:My waitress initially was sweet and smiling. She did not check on me throughout the whole dining experience. Oops, I'm sorry. She did check on me, only when I looked over and she asked me sitting from afar in a dinner table, \"are you okay?\" (Said with an 'oops I'm sorry, I forgot about you, I feel bad' face). When I asked for the check she came by the table and rather placing it, she tossed it onto the table. Wow.5.) Impressions:I don't know if they treat certain customers like this, but I definitely did not feel I was treated well. Maybe they have had certain situations where coincidentally individuals who represented my skin tone have done them bad. What a shame...*tisk tisk tisk.* I paid $18 dollars and what I got was negligent service, with a duck dish overly sweetened and salted with little spiciness. I still gave the darn waitress 20% tip. Forget your stereotypes, I've heard them before. Don't worry THIS Black guy tips........AND........tips well! Please don't tell me how this is authentic poor Thai people food, because if it was.........it should have been cheaper! I definitely would have respected this place more if the dish was $8, because with the service and dish it was worth that much! $18 and i'm definitely demanding to be treated like a well valued customer. More importantly I am not coming back here. I don't keep all of my Duck eggs in one basket. There are bigger ducks to fry. There are plenty of other great places in Hartford for Thai. *lays gavel down, takes off white wig and black gown, then walks out of court room*"], ["Soukkha M.", "The food is authentic and at a great price! Every dish is made with fresh ingredients, nothing ever frozen. The staff is friendly and welcoming! Don't forget the byob!"], ["Sheryl S.", "So Disappointed.I am in Hartford only for the evening for work.  After reading many reviews I decided to give this place a shot.  Here is my experience:-Atmosphere:  The place is very very tiny (maybe 10 tables) and is in an old house.  Now, it was clean and I am used to small Thai places so this was fine by me.  This was probably the restaurant's most redeeming quality.-Service:  HORRIBLE.  Horrible, horrible service.  The \"waitress\" had TWO tables (including myself), only 3 customers.  I picked out a couple of interested looking dishes and asked the server for her recommendation, she picked the \"drunken noodle.\"  A little unoriginal, but I tend to believe the staff.   I also ordered hot green tea, which she never brought to me.  (She forgot tea with only two tables)  I had to ask for my check, TWICE.  The rest of the time she just sat at one of the spare tables and played on her cell phone.-Food:  I had the Tom Yum soup.  It was a large portion, but didn't really have any flavor.  Normally Tom Yum soup is flavorful and spicy.  This was neither.I also ordered the chicken drunken noodles.  The noodles were very mushy and reminded me more of over cooked linguine than what they should have been.  Also, drunken noodle is suppose to be a spicy dish.  Again, no real flavor here.  I had to ask for chili sauce.-Price:  Average.  Nothing to report.Overall, crummy experience.  I am really surprised it has such high ratings."], ["Kevin D.", "Super fresh food.  Excellent curries and noodle dishes for good prices.  My favorite Thai food in the area."], ["Zach G.", "My family and I ate here as a last resort as was pleasantly surprised! Best Thai food in Connecticut! We started with chicken Satay which came with a peanut sauce which was exceptional. We also got fried dumplings which were also pretty good. For my entree I ordered Pad Pik King, which was a pork dish served with string beans. The sauce was balanced well, which was spicy and flavorful. For desert I had the fried banana and ice cream. The banana was delicious and crispy. The coconut ice cream was also great but it was hard as a rock. The restaurant itself is a renovated house and has an interesting look to it. There is a parking lot but only about seven spaces are available. Recommended!"], ["Dwight G.", "I got Yelped in to going here this afternoon.I am sorry, but 4 / 4.5 stars?It maybe what I ordered, Basil Fried Rice with chicken, but it was just not that good.Service was fine, I was the only customer in the place.Ambiance was okay.But the food was just so-so."], ["Duyen T.", "If what you're craving is Thai, King and I is definitely the place to go. I didn't expect much when I came to school in Hartford in terms of quality, reasonably-priced ethnic foods (hailing from Los Angeles, I was definitely spoiled in this area), but King and I has become a go-to for whenever I'm craving something other than the food at school. From the outside, the establishment doesn't look like much and the parking lot is definitely a bit cramped, but the inside is cute and homey. The service is wonderful, I've never had to ask for a refill on my drink and the food has always come out within 15 minutes, even for the larger parties I've been with (up to 12). The prices are very reasonable for the gigantic proportions that they serve. In the four years I've gone to King and I, I have always left satisfied and very happy. I've tried the pad thai, pad-see-yew, spring rolls, the yellow curry, as well as the pineapple fried rice and they are always amazing. I can't help but to strive for another bite even though my stomach does protest--it's just that good. And best of all, King and I is a BYOB establishment, so bring your friends and a couple of bottles of wine and enjoy! Also, King and I does not deliver but you can call ahead and get take out and I've got to say that it has the fastest prep time-I've called and had the food ready to pick up within 20 minutes!"], ["Eric A.", "This place is \"highly\" rated, but is at best just an \"average\" Thai restaurant. The decor inside is dirty and very dated, if someone put a positive spin on it they would call this place a \"joint\". I wouldn't come back. My wild boar basil was over cooked, the meat was chewy. The tap water had an unpleasant odor. if this is the best Hartford has to offer, I would recommend another cuisine."], ["Mw S.", "Very very good. Very fresh ingredients. If you in the mood for Thai, come here!"]], "Somewhere In Bangkok": [], "Sawadee Thai Cusine": [["Tom X.", "This is my favorite Thai restaurant.  Their basil duck is to die for.  Be careful about heat level though.  Two stars is hot, three is very hot.  The heat also tends to vary depending on the batch of peppers they got.  So err on the low heat side.  Once my son got three stars on a hot batch day (I got two) and the capsacin was so strong it burned your eyes.  Be forewarned.  The wait staff will be happy to accomdate you.  Tiger tears is a nice appetizer.  My neighbor swears by the calamari.  I don't like every dish here.  I don't have to.  I have found dishes that I crave.  You will too."], ["Lee S.", "I would advise not getting take-out from here.  We have given them many chances and the food is really sub-par.  The portions are more than half  of what you would get in the restaurant but the prices are the same (actually, the prices on the take-out menu don't reflect the actual prices!).  Ordered vegetable and tofu pad thai for $12.95 and there was 3 pieces of tofu and not one vegetable, just lots of stuck together noodles.   The soup size has been cut in half but the price went up $1.00 per soup.  Also ordered chicken basil and there literally was less than a cup of food in the container and most was green peppers and carrots.  The pineapple fried rice was good and the portion normal sized but $12 for rice seems a bit high."], ["Missy S.", "OK, HAVE GOT to DOWNgrade this to like 3.5 stars, now that we have tried THAI AWESOME, which is a RAGING 5 stars for sure, and puts this place to shame, not only for taste, but in QUANTITY and price!!!Sawadee was fairly yummy (altho a bit salty, even tho they say no msg), and also, we were always underwhelmed with the amount they give. It is not very generous at ALL....in fact very stingy.  Not only with the meat, but also the white rice that comes with a meat/veg entree! They would give not even ONE scoop of white rice, and then when there were two meat entrees (which we had to get, no way you could share an entree!), they would 'combine' the 2 portions of white rice into one container.... and it would always be shy by quite an amount! and what the heck? White rice is freakin cheap, so why be so stingy?Anyway, it was the only really convenient place to us, and we were happy becuz it beats the crappy Chinese food places around us, plus we had not yet had the distinct pleasure of eating at Thai Awesome!Hubby had to be down in the No Haven/Hamden area and even tho we had Sawadee last night, he stopped and brought home a few things to try, and compare since we still had Sawadee on the Brain. and OMG, everything from Thai Awesome was amazing and definitely waaay better than Sawadee, thus this update!If u are in Hartford area, make the 30+ mile trek to Hamden, its so worth it!  Hubby said the ambiance is definitely nicer at Sawadee, but since we always get take out, who cares? Even if gas was still 4.70 a gallon, the trip to Thai Awesome would be worth it!Sorry Sawadee! Stop being stingy, and salty! and expensive! We got 2x the amount of food at T.A. and it was half the price!"], ["Kelsey T.", "Decent Thai food if you don't want to drive to Hartford to get the good stuff. Adds a bit too many extra ingredients though."], ["Andrew M.", "This is the best Thai restaurant I have been to in central CT. The Drunken Noodles are delicious.This is the best Thai restaurant I have been to in central CT. The Drunken Noodles are delicious."], ["Mike C.", "Amazing! The pinneapple duck fried rice is out of this world"], ["Desiree M.", "This is one of my favorite places to go out to eat. If you love thai, this is your place. Been here a few times and I have never been disappointed. One time I ordered a dish at a level of 4 in spiciness, it was H-O-T. But I like that! Be sure to have a glass of water handy though! lol"], ["Susie D.", "This place is awesome! Definitely the best Thai food around. The vegetable soup is spectacular. I'm not sure how they manage to make vegetable soup so good! The veggies are super-fresh and the broth is very flavorful. I also highly recommend the fried spring rolls. I am a vegetarian, so I can only speak to their veggie dishes. My favorites are their green curry, panang curry, drunken noodles and rad na. I've actually never had a bad dish. My husband swears by the cashew chicken. The service is very good-- they are very friendly and fast. Highly recommend!"], ["Ann T.", "We get takeout from Sawadee every other week and I feel fortunate to have such a good Thai place in my neighborhood. Of course, the food is always better when you eat there and they have a nice atmosphere, relaxed and casual. My favorite dishes are Prik King with beef (spicy and flavorful; veg is always perfectly cooked) and Panang Curry, Their specials (listed on a board near the register) are interesting and I had a wonderful salmon special a few weeks ago. I was quite put out when I forgot the leftover container on the table!"], ["Joel A.", "My favorite Thai restaurant in the area. The food always tastes fresh, especially important with seafood dishes. All the dishes I've tried, from curries to stir-frys, are delicious and flavorful.Can't vouch for the specials, as they're usually more than I'm willing to spend. They sound good, though!The service has always been very friendly and accommodating.Thank you krub!"], ["Gary D.", "This was our families favorite Thai place in the South Windsor area.  Great tasty, authentic Thai food!"], ["Katie T.", "I LOVE THIS PLACE!! It's my favorite Thai restaurant- hands down. I've never been disappointed. Every time I'm in town, I crave the pad thai with tofu (seriously to die for), along with their fresh spring rolls...oh! and their thai iced tea is great, too! Panang curry with shrimp is also soooo good! Wonderful service, they are always very friendly and attentive. Simply the best!"], ["Nicole B.", "I'm not sure how many times I passed Sawadee in my 13 years living in South Windsor, but boy was I glad I noticed it! I had been complaining for a while that there were no good thai places near me, and all of a sudden out of the blue, a friend recommended it to me!Sawadee offers a broad menu of awesome traditional thai dishes. When I was there, I had the ginger chicken soup- the portion was much larger than I had expected. It was tangy and sweet, the ginger accenting the flavors of the vegetables and chicken. For my main dish, I had the pad thai- perfectly cooked. I can't tell you how many times I've had pad thai where the noodles were so over cooked they were mush. Yet, the pad thai here was al dente and had a wonderful flavor.The parking lot here is a little smaller than one would expect, so if you come on a Friday/Saturday night you might want to come a bit earlier to beat the crowd. The prices are more than reasonable- for an appetizer/main dish you'll spend about $15 before drinks. Its a perfect place for dinner with friends or a casual date!"], ["Swiss M.", "I was hesitant to try Sawadee because of the not so nice scorings by you fellow Yelpers, but I'm so glad I did.  This is only the fourth Thai restaurant I've had food from, so perhaps I'm a bit inexperienced, but it was the best I've had so far.  Vegetable spring rolls were delicious, and had a nice finish almost like cinnamon.  I also had the vegetable dumplings which were filled with peas, corn and potatoes, and came with Thai Soy sauce.  Delicate, flavorful and really interesting.  The Panang Curry was rich and was generously filled with all of my favorite vegetables.  It had such good flavor, and they didn't skimp on the fish sauce which I ADORE.  My husband had the red curry which was good, but offputting to me because the water chestnuts they included permeated throughout.  He loves them though, and I don't, and he gave the dish 5 thumbs up, so don't listen to me on that one.  Vegetable fried rice=DELICIOUSI will be back.  It's a twenty minute drive, but so worth it.And as far as portions are concerned, I saw alot of grumbling about how small they were.  I will say this: we ordered alot of food and didn't have too much leftover, BUT the portions were in line with anywhere else I've been.  We also got two appetizers and three entrees for just under $50...soooo, you know, I guess it's dependent upon the person.  I never felt ripped off or cheated."], ["Gandrea R.", "OK place...a much better Thai place in our opinion is Somewhere in Bangkok in Southington CT...you must experience this place for yourself!  Authentic!  Anyways, the service here at Saweed was friendly.  I ordered some tea and they served it to me luke warm.  The place was cold and drafty.  I ordered beef drunken noodles.  The portion was rather small and low on the beef.  I told them I wanted mild spice and it came with absolutely no spice.  We will not be going back.  Looks like some of the locals go there but that is because they have not experienced Somewhere in Bangkok!"], ["Terry S.", "First time visiting here. Was heading down the road to a recommended Chinese restaurant down the street, saw the sign and we decided to try it since we both like Thai.  We started with spring rolls.. they were just okay, they tofu in them which my wife doesn't care for at all, and it came with peanut sauce that was more like a gelatin peanut butter, with a squirt of some red sauce on top, just okay. I had the Drunken Noodles, ordered 3 stars hot, it might have been 1-2 stars hot at best but was just okay, not much flavor, not much chicken in it that I ordered. Mainly noodles, and carrots. My wife ordered the Pad Thai, she also said it was just okay, lacked much chicken, but decent amount of noodles on  the plate. I also ordered some Tom Yum soup and like a previous review, it was way too oily, lacked the chicken I ordered in it, too pricey for the small container you get. Overall, it bit pricey, bit average, will try it again one day and see if my opinion changes."], ["Steven K.", "A friend an i just ate dinner here for the 1st time.   Server was very friendly, the place was clean, the it was warm (a positive considering my friend and I are both without power after the recent snow storm).    I was not impressed with the food itself.  Chicken satay for app, and i had the hot basil chicken for my entree.   1st, the portions were really small.   Also, my food was barely warm.   There was an odd taste to the chicken...not 100% sure, but it reminds me of freezer burned meat."], ["Mel R.", "I've been here a few times and has always been great. The green curry with basil, eggplant is fantastic. I wanted to try curry because I can't recall ever having it. I was not disappointed. It had a nice spicy/sweet flavor. I like the fact that you can add a fish, meat or tofu in. I ordered the scallops, which were great."], ["Penny M.", "What a nice addition to the area!  Try the pineapple fried rice - yummy and NOT greasy (I hate greasy fried rice).  The thai iced tea is truly delish!  Service is attentive and friendly.  Prices are reasonable and the atmosphere is very comfortable."], ["amy w.", "Sawadee gets four stars just for their Tom Kah soup - it's the best I've had anywhere.  I wish you could order just a huge bowl of this soup. I also wish the rest of the food was as good or I'd eat there more often. The curries are average, and the spicy eggplant entree and Tiger tears yum salad are pretty tasty.  It's rarely busy."]], "Thai Food On Wheels": [["Shereese R.", "Love this place! I try to go as often as I can in the summer, they're parked by Bushnell park and it makes for a very nice lunch.I get the drunken noodles, with chicken. It is spot on every time and always fresh. . They will even crank up the spice a bit if you ask. The woman at the window is very friendly. I try to call ahead because sometimes the line can be long. Can't beat the portions for only $7 or $8."], ["Dan S.", "This food truck is back for another season by Bushnell Park.And it's one of the better ones there. There's no flashy signs on the truck. Just a simple menu. But what I like about this place is the fresh meat and veggies. Not overcooked.  And they know how to turn on the spice too. None of that watered down spice offered by some other Asian trucks.The downside is that they can be slow. Very slow when it's peak lunch.  Of course, the food is cooked to order, so you can't complain on a nice warm spring day.The price is right and friendly service to boot too. A winner among the food trucks."], ["Linda E.", "The best Pad Thai of any place in the Hartford area! Love it! And, sitting on a park bench only adds to my happiness!"]], "Mae Kong Thai Restaurant": [["Jess L.", "Lori N. and I came here after an event at the Museum of American Art. This restaurant is a must! Who would have thought this small town would have such a spectacular Thai restaurant? We were immediately struck by how friendly and perfectly attentive our waitress was. She was very pleasant and not pushy at all. The menu is huge and includes many photos if you need help.Dare I say, Mae Kong had the best pad thai I've ever had - and I've had lots of pad thai. Sure, it might not seem like it's hard to mess up pad thai, but theirs had the perfect balance of flavors and quantity of ingredients.I will definitely make it a point to come back here when I am next in the area."], ["Katie H.", "It took us 3 months to use our Groupon, but my boyfriend and I finally tried this place (which came highly praised by our friends), and we weren't disappointed! I ordered the drunken noodles with beef, which were delicious. The noodles were cooked perfectly, sauce was flavorful, and the spiciness just perfect for me. I really appreciated how generous they were with the beef and vegetables too. Each time I thought I was out of beef, I would unearth another slice hidden underneath a noodle. The portion itself was plentiful, and my boyfriend had to help me finish it. He got the pra ram with squid (squid in a peanut sauce), and it was also extremely well-prepared. The squid was perfectly cooked, and the peanut sauce was addictive. The squid portion was a little small, but for the price, I thought it was reasonable. It came with a choice of jasmine, brown, or sticky rice, and of course we chose the sticky rice. It came in a little steamer basket, and it had just the right amount of chew to it. For dessert, we had the fresh mango with sweet sticky rice. It was deceptively small but ended up being just enough. The mango was ripe and sweet, and the sticky rice was again, perfectly cooked. The sauce could have been a little thicker, but that's a minor complaint. It was the perfect ending to a flawless meal.What really made this 5 stars though was the service. Both of the ladies who served us were very friendly and made sure we were taken care of the whole time. The restaurant itself is small, but but not cramped. It's not in the nicest part of town, but we didn't feel unsafe. There's only street parking, so be prepared to feed a meter if it's a weekday. This is the first case I've encountered of a Groupon restaurant that I would be perfectly happy paying full price for. I want the restaurant to succeed, and I think the food isn't expensive for the quality. We'll definitely be coming here again!"], ["Scott P.", "Genuine Thai food.  Not the overly sweet stuff,  one can find at many other Thai restaurants.  Very attentive staff who seem to care about serving delicious food."], ["Erica K.", "Yum!! I came with friends and ordered summer rolls and drunken noodles. It has great flavor and was super delicious. I only wish it was more noodles and shrimp. There were a lot of veggies. Other than that -- great yummy place!"], ["Greg C.", "Mae Kong offers a comfortable, standard Asian-restaurant atmosphere. They do do a nice job of decorating the place, it seems seasonally too. The menu is lengthy and they also offer some specials. The food was tasty, but the portions did not match the prices. The service was great. It is indeed a BYOB restaurant. In my opinion, this place would not be worth the money without a Groupon (i.e. there are many other BYOB thai restaurants)."], ["John S.", "Our waitresses were super sweet,As I ate my crispy, spicy meat.The chicken packed some intense heat,I'll be back soon to drink and eat.Mae Kong offers world-class Thai cuisine, unparalleled service, and BYOB. I had an amazing dining experience here.I ordered the Crispy Spicy Chicken: the first option on the House Specials list. Perfectly fried, peppered, and juicy. The dish made me as happy as the time I saw Cool Runnings in theaters in the 90s. We also got egg rolls for an appetizer, which were very enjoyable.The waitresses were both some of the nicest individuals I've encountered in a while. They were smiling the entire night and cracking jokes with us. They made us feel welcome and comfortable in their business establishment- so much to the point where I felt like I was at home. They were hugging customers and knew people by name. There is definitely a loyal following of regulars here.I was able to enjoy some of my favorite beer with a hot plate of delicious, reasonably priced food in a warm environment. Can't wait to return."], ["Anna E.", "I've been to Mae Kong numerous times since the last review and everything has been excellent.  Favorites include the pork basil, ginger anything/everything,  drunken noodle, the special pad thai with chicken and topped with crispy tofu.  Jasmine and sticky rice cooked to perfection each time.  Their Thai iced tea cannot be beat.  Customer service is still excellent.  Dining in is quite comfortable, takeout is good as well.  Sometimes finding a spot to park on the street can be  a little inconvenient but it's usually not a problem.  Without a doubt, this is our go-to! We love you, Mae Kong!"], ["Nicole H.", "I've been to this restaurant twice now and the food is very very good! The only thing that is holding me back from giving them a full five stars is, that the portions are a bit small, mainly the appetizers. The crab dip and corn chips was amazing but small. The drunken noodles with tofu and vegetables were soooo good as well."], ["Westie W.", "This was our third visit and probably our best.  We started off with the crispy lemongrass chicken appetizer - deep fried chicken that was lightly battered and oil free served with a sweet chili sauce.  My wife's entree was red curry with chicken. The chicken was tender and the vegetables fresh though the curry was probably a bit thinner and less complex than we have had elsewhere.  I found my entree,  pad prik khing, listed under the house specials.   Stir-fried chicken, fresh string beans, red and green bell peppers and kaffir lime leaves in spicy red curry paste.  A stunner both in looks and taste though be aware that there is a bit more heat than some of their other dishes.  We each opted for brown rice that was both nutty and moist.  Service continues to be both warm and efficient."], ["Lauren D.", "Downtown New Britain has some great lunch spots and this is one of them.  I've never been disappointed, fresh ingredients,  spiced to order, and friendly service.  Don't miss this little gem."], ["Jackie O.", "The food here is really good. And the service is super quick. You can be in and out fast if that's what you're into. But then again what's the fun of going out?! Anyway, I had originally tried this place because they took blue chip from ccsu (not sure if this is true anymore as I have completely run that card dry). The machine was down at the time which meant we couldn't use the card and we were told we could come back at a later time to fix the issue... but the machine was never up & running for months. So, blue chip users beware! But, as a regular customer, it really is a little gem in the downtown area. The food is fresh and my favorite has to be the spring rolls. So yummy! I also love the chicken satay with peanut sauce. The chicken nearly melts in your mouth and the sweet & savory sauce is the best addition. Great meals, great small appetizers, great place!"], ["Dan S.", "Every once in a while you get surprised. I had that experience at Mae Kong. Would it live up to its Yelp hype?for the most part, I'd say yes. For an appetizer, we ordered the Laab Moo Tod. It was deep friend ground pork and it was heavenly.  I can't remember enjoying an appetizer like this at a Thai restaurant in a while.That said, the rest of the dishes were quite good, but couldn't quite match the first one.  The spiciness factor on them could be ramped up a bit and the quality of the pork was good.Service was pretty good. The decor is nothing to speak of and with the cold weather, the dining room drops 5 degrees every time someone opens the door.Nonetheless, this was a very enjoyable Thai restaurant and one that is worth the effort to get to for something different."], ["Sarah F.", "I ordered Yellow curry and it was incredibly salty and the pork was fatty and gelatanous. My friend ordered the Pad Thai which I tasted. A little sweet but totally edible. I called the waitress over and explained the situation. She offered no solution, so I asked if I could have a pad Thai instead of my Inedible meal. The manager (owner?) came over and refused to take my food back, and suggested I could order and pay for another dish if that's what I wanted. I sat and watched my friend eat her meal for a few minutes, and asked the waitress over and again expressed that this food was not satisfactory, and I could not eat it. She had some consultation in the kitchen. They took my food back and added some water to the curry and declared it \"fixed.\" I really wish I hadn't been with a friend who frequents that place because I would have gotten up and left.Can I give a zero star?"], ["Candice C.", "This place is Amazing! The food is wonderful. The  staff are very Friendly  and very accommodating. Their food is authentic and had a lot of Laotian influences. I've had almost everything on the menu and I can say each dish is a complete treat! Food is fresh with great spices. BYOB and they even are willing to put a bottle of wine in the refrigerator for you.  It's a hidden jewel! Great place!"], ["Jason A.", "No, no and more no.  I am generally all for supporting local businesses, but Mae Kong Thai Restaurant left a bad taste in my mouth and it only partly has to do with the mediocre food.I was brought to this location by a Groupon offer of $25 to spend for $12.50.  As an FYI for price point, ordering 2 plates and 1 non-alcoholic drink will set you back $25+.Upon arrival, another customer informed the manager/owner that her bill was in error.  The manager's response was to lecture the customer on her poor math skills.  Now if this were a one off situation, I would have chalked it up to a customer mistake.  But later on during our dinner, another couple in the restaurant had the same issue.  Again, the manager lectured about how the bill was correct and refused to make any adjustments to the bill.  Ultimately, it may have just been a coincidence that multiple customers were wrong about their bill, but the way that it was handled by the manager was nothing short of demeaning and unprofessional.The food was so-so at best.  When your meals are delivered in less than 5 minutes at a sit-down restaurant, it likely means that everything was pre-made and simply re-heated.  I'm hoping that it was made earlier that day, and not from the day before.All in all, the average re-heated food combined with the questionable billing and poor customer service makes this a subpar restaurant experience.  I would recommend you pass."], ["Jess S.", "One of my favorite Thai restaurants. Every single time I go, the food and service are both excellent. Waitstaff is friendly and efficient, and will explain and/or recommend dishes if asked. The menu is expansive, and everything from appetizers to desserts, from what I've tried, is great."], ["Salas M.", "Good food, small environment, and a little pricey. The food was good not great, they messed up my order on my first try so not so good there. Nice lunch place very close to the courthouses and downtown New Britain."], ["Michael B.", "Found out about this place because of groupon purchased one because it was a good deal. Everything tasted so good. The service was on point everything was explained to us that was on the menu. The food arrived to our table quickly. Since this place is small I can see it getting packed Friday and Saturday nights. There is a $10 minimum to use your card but tip doesn't count towards that."], ["Joanne S.", "Went for lunch with my coworkers as it was in the downtown New Britain area and we were in the area for a work training. It was a little bit pricey but good food. I had the pan fried chicken dumplings and we're very good.  All my coworkers loved their meals and raved about how good it was. I would go back again."], ["Horton L.", "ATTENTION! If you have a groupon, they are going to add an 18% tip to your total bill."], ["Kiran V.", "Parking limited to the street ... Spent enough time to find a spot. A separate  menu with different prices coz u have a groupon on hand. Food just ok and it's worth a visit only because of the coupon on the hand."], ["Tim L.", "Crispy chicken was simply one of the best meals I have ever had.  The batter on the chicken pieces is perfect and they are fried to just the right taste.  The cashew sauce is not overwhelming and accompanies the dish quite well.  I can't imagine someone not liking this."], ["Sarah L.", "Went here two nights ago after finding out about this place. We loved Thai and live in New Britain, but had somehow missed Mae Kong before now. They have been there almost two years so I'm bummed we didn't come here before now. I had the Veggie Tofu soup to start and it was okay. It had lots of veggies, but the broth needed a little spice because it was a little bland. It did have the most veggies of any veggie soups I've had out at any type of Asian restaurant. For the main course, we had Pad Kee Mao (drunken noodle) and Crispy Duck. The drunken noddle had great veggies and noodles, but I did not care for the flavor, which bummed me out, but the Crispy Duck was really good. My husband got that and it had plenty of spice and he likes really spicy food. The house sauce was awesome. I had some on some rice and it had an excellent flavor- I would just have to ask them to make the dish a little less spicy if I ordered this meal. I uploaded pictures of each of our dishes and his Thai Iced Coffee which was delish.For dessert, my husband got Mochi Thai Ice Cream which is three pieces and you get to pick what flavors you want from strawberry, chocolate, green tea, mango, and vanilla. I'm not a huge mochi fan, but my husband is and he liked it. Next time I want to try the taro pearls in hot coconut cream. I've never had that before. I found that the had a large dessert menu- larger than most Thai places I've been to and they had a lot of different options that I have not had before so I will be back to try something else on the desserts and try a different entree besides drunken noodle.So glad to have a local Thai place to frequent! Also, they seem to do a lot of take-out. More people came in for take-out while we were dinning that came to dine in.If you live in the area, this is a must try!"], ["Lesley M.", "Last night was the beginning of a love story...with Mae Kong Thai Restaurant.I took my boyfriend there to celebrate his birthday.  We chose this place because of the amazing Yelp reviews and I knew it wasn't going to break the bank.Good thing we went on a Wednesday night because we were one of only three parties at the ma and pa establishment.  The parking was easy as we parked in front of C-Town.For drinks, the birthday boy ordered a Thai Iced Coffee while I ordered the Thai Iced Tea.  That was the only thing I was not impressed at the restaurant.  That is very minor as this is a BYOB establishment and you can order sodas.Luckily, the food we ordered was nothing short of fantastic.  For starters, we shared Tom Kha Kai; or coconut soup, which was delicious and perfectly spiced.  As for the entrees, we ordered the Spicy Curry Duck house special and the veggie and tofu Pad Thai!  Both dishes were tasty and fresh.  Though I have to admit, I did keep on topping the Pad Thai with the sauce from the spicy curry duck.While we were dining, quite a few people came in to pick up their take out orders.  I will be back for my favorite drunken noodles and to try the Papaya Salad."], ["Mickey Z.", "very clean inside. Wait was attentive and knowledgeable.  We tried the egg rolls - they were good with noodles inside as well as the crab rangoon. We both got the beef pho which comes with meatballs as well as sliced beef. It is a very large bowl and very good as well. Will be back for BYOB dinner"], ["Emily J.", "Friendly service and terrific Thai food! We had the house noodles and the curry duck - both were delicious!"], ["Steven L.", "This is my favorite place for Thai food. It's nothing too fancy, but everything always tastes great. I think the squid pad thai is to die for. That's my go to Thai dish and have had it at many other places, but this one stands out. I would definitely recommend trying this place."], ["Janessa C.", "Excellent service and excellent food!! I got the Tom yum, the fried egg rolls, the sticky rice with coconut ice cream, and the satay chicken, it was all so delicious! I can't wait to go back!"], ["Larry R.", "Very friendly, huge menu selection (probably too ambitious), decent quality.  Some dishes are quite good, some a bit bland.  Seemingly almost home-cooked thai food that is very good for where it is - the hinterlands of mid CT.  Lacks some of the fine subtle blending of spices that is inherent in better thai restaurants, but a very respectable dining experience.  Not worth a detour, but if you're in the area, among the best food around."], ["Hibeh D.", "Great food and service.  They have made the most of their location and created a nice atmosphere.  I usually order out but I ate in this time and was not disappointed."], ["Jessica B.", "everything we've had here is phenom. the fat noodles blow my mind. the crispy chicken is the bomb. i loved the crab rangoon but wife wasn't nuts about it..it's a little peppery..like black pepper peppery. the sauce that comes with it is delish. we can't wait to dine in and byob! super friendly staff, adorable decor, a gem by all accounts in downtown new britain. this might be one of my only 5 star reviews ever?"], ["Nick G.", "I never really venture out to the New Britain area, but happened to be there last week. Thanks to Yelp I found Mae Kong Thai. I went with 2 friends.The place is pretty well decorated and kept compared to most \"authentic\" places I've been. The servers are a bit slow but the place is small enough that if you really need something you can call a server or the owner over.The highlight of the meal was the 5 Star Chicken Wing. It's basically a de-boned chicken wing that is then wrapped, sushi style, around pork and vegetables. After being deep fried (obviously) it's then cut sushi style and served with a sweet sauce. It was crazy good; we went through the effort of cutting the last piece into thirds.For entrees with had chicken Larb, Chicken Drunken Noodle and I had some kind of special soup that turned out to be a coconut broth Ramen style dish. (Gourment ramen not mico-noodles.)All of the entrees very very good. I am going to make a trip back with some of my family style peeps so I can try a bunch of different dishes.Mae Kong is by far my favorite Thai place in CT."], ["Alexander D.", "Awesome Thai place in the heart of downtown New Britain. What a great surprise! Our server was excellent and our dishes were flavorful and delicious. My colleagues and I stopped for lunch last week, and the dishes have a home cooked, authentic flavor. Will come back for dinner! Prices were very reasonable."], ["Jason L.", "Wow, what a difference take out makes compared to dining in.  Took some Pad Thai & Mango Sticky Rice to go.  Pad Thai was disgusting.  Peanuts, bean sprouts, basil, lime etc... all were cooked in.  I've had this happen at other Thai restaurants and I can't stand it.  Pad Thai requires flavor, texture & temperature contrasts that all get lost when you cook in those ingredients.The Mango Sticky Rice was in a completely different league from the one we got last time.  Like it was demoted all the way back to little league.  The mango was warm and leaching this gelatinous substance.  The rice tasted old, and was a solid white mass.  It was brick like, almost like it had been steamed for 17 hours.We ended up throwing most of it in the garbage.  I will give this place one more dine-in shot if we're in the area, but it's off my list for take out."], ["Kate B.", "More than one late night dinner has been ordered here (I work around the corner), but we also tend to rely on it for lunch. Food is hot, spicy and quick. Great drunken noodles and pad see ew. Next time I am going to grab their massaman curry, which many coworkers have ordered but I never seem to remember (NOTE TO SELF). To anyone who says there is no good food in NB - you're missing out on this one."], ["Prince V.", "Service is very good. Thai Iced Tea is good. Ordered Nam Tok (Beef Salad) it was cold. Not even worth eating. Very stingy on the lemon sauce. They need to give more juice to the salad. Pineapple Fried Rice is decent. I asked to make it spicy and it was very spicy. Loved it. Pad Prik Khring was very bad. It was very salty. It was not even spicy. Small place and it does get packed fast."], ["Terri H.", "We arrived too early for a show at Trinity-on-Main so we ran across the street to this little Thai restaurant. We ordered our dinners, which were Pad Thai with pork and Mixed Veggies with chicken (both $9.95). Prices are extremely reasonable!  Taste and quality were great! Service was too. There are only about 10 tables here, but we didn't have to wait. I'd definitely go here again!"], ["Alex R.", "Consistently delicious. Friday nights call ahead and reserve a table, and if you don't it's still worth the wait."], ["Kenny R.", "Quick service, food was great. Had the spring rolls for appetizer, I liked the sauce. The pricing was decent and the food portions were nice. Before we even finished the appetizers the dishes were already out. I had the spicy seafood, everything was tasty and the broth reminded of a traditional spanish 'asopon' soup with a quick spice to it. Completely forgot about the rice but it went perfect with a quick dip in the broth. Too good."], ["Bob H.", "Good food, friendly and intelligent service, nice atmosphere, overall very pleasant experience."], ["Heidi F.", "Loved this place. Best way to judge a thai place for the first time is to order pad thai. It was very good. All food fresh hot and taste authentic thai not fast food thai.  Serve was good and owner very friendly."], ["Kara H.", "This place is a hidden gem. If they were in West Hartford center this place would always be packed. The food is ridiculously good, generous portions, fairly priced, nice presentation. Staff is wonderful. Can't go wrong with their drunken noodles."], ["Raphael K.", "Yes, 5 Stars.   This is without a doubt my go to Thai restaurant in CT.Their curries are amazing, their Rangoon sets the bar that all others should be judged by (seriously, the crab flavor... mind blowing), and the owner Oumaphone is always super friendly and happy to help.  Feel free to order off the menu \"hot\" if that's your thing.  Parking can be a challenge at times but that is totally worth it.   I drooling just thinking of the Yum Woo-Sen.  This place is so good, that unless you have food allergies or and aversion to spicy food you can close your eyes point at something on the menu and walk away a winner."], ["Julio S.", "This restaurant is a hidden gem in New Britain.  The food is fantastic and the service is very friendly.In the past year I've tried several dishes ranging from Thai to Vietnamese and have not been disappointed. The drunken noodle dish is very good and cooked to your desired heat level.  I really enjoy the Pho with beef balls and rice noodles.  I think I like the tray of seasonings that accompany the Pho the best so you can add anything from spicy chili sauce to sugar to your soup.  I am not a big dessert person but I tried the fried ice cream with vanilla ice cream and will never regret it.  There is a nice variety of ice cream flavors to choose from for the dessert.The restaurant is BYOB so bring your favorite bottle of wine and enjoy.I highly recommend this restaurant for friendly service, amazing food,  and very good prices!"], ["Ethan L.", "One evening my father and I decided we wanted Thai food but didn't want to drive to elephant trail, the usual place we went to. I decided to check on yelp to see if there were any places closer and came across this gem. We've been back at least 6 times with various family members now in the past month and half. The food is delicious, I've tried a variety of my usual Thai favorites and have even branched out, everything has been great.  The portions are very generous and the price is right, much cheaper than the other local Thai places. The service, excellent. Plus it's BYOB.  Parking is on the street or across the street in a parking lot.  Some people might not like New Britain, but this place is definitely worth the trip there."], ["Kelly R.", "This place is fantastic!We love Thai food, but are very picky about it, and have tried a number of places in the area.  We've so far settled on Blue Elephant, but have never been fully impressed with their food or their prices...  We usually try places 2-3 times, whether good or bad, before writing a review.  This place truly deserves 5 Stars!They have a large menu with great selection, with some very \"non-typical\" (at least in the states) meal options.The food is delectable!  The curries and stir fries are fantastic, the veggies always fresh, and the meats/seafood cooked perfectly (never dry, chewy, rubbery, etc).  However, we haven't tried any beef, so we cannot speak to that.  The prices are great, with a very hearty serving size.The staff are friendly AND efficient -- both in taking orders (due to dietary needs we usually ask for several modifications to our meals) and prepping the food.We are so pleased to have this place around - and have not found anything in the area that we are more pleased with.  It may not look like a large and glamorous restaurant, but the food is incredible.  Highly recommend it!"], ["Allie B.", "This place really IS a hidden gem.  It's cute, the staff is wonderful and friendly and the food is amazing.  During my first visit I had crab rangoons, Tom Yum Khoong soup and Pad Kee Mao (Drunken Noodles). During my 2nd visit  I ordered Beef rice noodle pho, Calamari and Taro Pearls in Coconut Cream. Both times everything was cooked to perfection, fresh, delicious, no complaints whatsoever about Mae Kong!"], ["Alyssa R.", "Thai is one of my favorite foods, and I've had Thai from probably a dozen places over the years including from Thailand. We gave this place a try the other day and I was impressed with the spicy  pad Thai. This place is about as good as it gets in CT tie with the Phuket restaurant but this place is more authentic , simple but good! 5 stars, we'll be back :)"], ["Anne-Marie R.", "This restaurant was recommended to us by my doctor who is a thai food aficionado. We had just moved to New Britain and Mae Kong had just opened. So we tried it. And now it's one of our most favorite places to eat!The owner is always there and not just overseeing things. She's taking orders and delivering food or bussing tables. Her niece is the primary server and they are both the sweetest people. We are always welcomed warmly and are treated like old friends. Whether it's just the two of us or we bring friends along - it is always a wonderful experience.And the FOOD!? Out of this world. It's all prepared to order with fresh ingredients and is served piping hot. Favorite dishes are: chicken drunken noodles and Tom Kha Kai soup. Off of the House Specials we recommend the Crispy Chicken and the Mae Kong Noodles. Our vegetarian friend recommends the veggie stir-fry if you're not a meat eater.But my absolute FAVORITE menu item? The fried banana with coconut ice cream. They have other flavors of ice cream if you don't like coconut, but I highly recommend it in this combination. It's simply amazing!So if you love thai food - or have never tried it - give Mae Kong a visit. You'll be glad you did!"], ["Et S.", "What a wonderful place for dinner. Very easy to find a place to park and the food is outstanding. This is probably one of the best time restaurant's in the state. Plus the price is just perfect."], ["George H.", "We lived in Hawaii for twenty years and ate some of the best Thai food in the world. But Mae Kong in New Britain is the best we've had anywhere. Get the Panang  Curry. I've never seen it done with tempura veggies, gives them a crunch, so good! I also recommend the Green Papaya Salad.  Attentive service, always willing to bring a dish back to the kitchen if it isn't quite what you expected.  The only thing I don't like here is the Thai Ice Coffee.  I like a very strong espresso with condensed milk.  This isn't very strong, just too sweet.  Along with Rock Cats Baseball, the New Britain Museum of American Art and South Church, one of the destinations that deserves a special trip into New Britain from the suburbs."], ["Rachel T.", "I think this is really 2.5 stars but I was generous.  We got takeout so maybe there were issues because we got it to go.  It was really really oily/greasy.  The veggies/meat were cooked well and the flavors were pretty good but the grease was just so unpleasing.  Also - the sticky rice was mor e crunchy than sticky.  I ordered the cashew nut and pad pik prow.  My husband and I had the same complaints about each of our dishes.  I really wanted to like this place because it's closer to us but I think we will still be going to somewhere in Bangkok in southington Very fresh, well cooked, and it's Byob too:)"], ["J M.", "Amazing Pad Thai with tons of fresh veggies! Nothing is over sauced or over cooked. Highly recommend this place to anyone."], ["Kedar C.", "After reading the rave reviews and going by the considerable high rating of the restaurant compared to local sweet chillies, we decided to give it a try. The neighborhood is not good, as soon as we parked and walked to the restaurant, a disheveled lady asked us for money. But this is not a fault of the restaurant. Anyway, after getting water to drink we waited for around 15 minutes before the server took our order. The food came out quick. We had ordered crispy chicken, drunken noodles and panang curry with added pineapples. The pineapples were not there, and the curry had fried veggies which is not very common. The taste was okay, nothing out of the world and we have had better tasting food at Sweet Chillies. So it was not obvious why it was rated below this restaurant by about 1 point. Anyway, later on I discovered a piece of plastic in my drunken noodles! We told this to the lady in charge and she insisted that is was not plastic and it was shrimp skin! We were fairly certain it was plastic, but in any case finding shrimp skin in chicken drunken noodles is not acceptable anyway. Not wanting to argue, we just paid the check and left. Obviously we will not go back here."], ["A J.", "We have been many times everything is amazing! My favorite is the spicy red duck curry.  The restraunt is BYOB which keeps our bill undercontrol.   My fiancé who spent some time in Thailand says it is as close to real thai food as he has ever found in the west.   The owner is very friendly.  This one of our favorite places for dinner lunch or take out."], ["Esther C.", "Overall a great experience! Really fresh food. Great service. Large portions. We particularly liked the drunken noodles and pad thai. Would definitely go back!"]], "Sukhothai Restaurant": [["Charles L.", "Very disappointed. I thought I would have Pad Thai but the special menu and waitress steered me to a dish called Hot Crazy Noodles.First of all they were not spicy. This was in spite of the fact I asked for spicy food. This was a mixed seafood dish and it ALL TASTED LIKE RUBBER. Everything was over cooked and terrible! This was a luncheon  special??  14 dollars for a dish of Ramen Noddles ( I have made them taste better than this). I would stay away from this place."], ["Josh C.", "I love me some Sukhothai! I find the quality of their food to be always good! I haven't ever had a bad meal here and we are always trying something new. My girlfriend who doesnt' like salmon loves their mango fish with currie sauce. It's one of my favorites as well. 3 flavor chicken and shrimp, drunken noodle, Phad Thai are some of our favorites to order. They also have good thai iced coffee and tea which are delicious. There service is good. THe waiters are all very nice. Goo Gai is really nice! She is really friendly and always offers good recommendations."], ["J H.", "I wanted to update my review... My unhappiness was really with the service but they have worked to rectify the situation and I have since gone back.  They have, hands-down, the best Pad Thai out there (also with the Mango Sticky Rice), and their Drunken Noodle is also fantastic.  The ambiance is very good and it's in an easy location.  They are closed on Monday and have odd daytime hours, but it rarely stops me from picking something up when I want it.  There's a minimum of $10 for credit cards.  Hard to get something for under than $10 when not buying the lunch specials.  The original problem was with the management who can be kinda prickly.  There's this one guy who gives me the \"You're not wanted here vibe\".  Never looks at me or puts change in my hand... He's kind of the \"Diva\" type, but hey, the food is made with love.  For personal reasons I started going to The King and I Thai down the street, but I can't deny how awesome the food is here and how cool some of the staff has been to me in the past."], ["David M.", "I'm going to agree with everyone... the service is a bit slow, but certainly not hours. The staff is always friendly and courteous. For a date, or getting together with family; this can be a really nice place. They do make the dishes fresh, and that has a lot to do with the time it takes to get to you. If you want fast food, go to McDonalds. (Great Quote: You can have your food done Fast, Good and cheap. Most places can do one, great places give you two, nowhere will give you all three)The Pad Thai here is really good. I don't agree that the other dishes lack inspiration, but I haven't had many of their currys. I have had some amazing salmon dishes. Their fried ice-cream is pretty good too.  I'd suggest going with the specials, or the pad thai."], ["Emily K.", "A decent Thai restaurant with average prices.  The Massaman Curry was very good, although a little heavy on onion for me.  My boyfriend got their Mussel Curry and thought it was delicious.  They gave him a HUGE serving of mussels that left him very satisfied.  We also ordered their Spring Rolls which were disappointing.  They were fried and still had a lot of oil on them and were served with a sauce that didn't leave you wanting more.  Overall, a great place in downtown Manchester to fulfill any Thai food cravings with an attentive and friendly staff."], ["Amy R.", "Amazing food, friendly service, overall great dining. Highly recommended!"], ["Swiss M.", "This is tough, because I've yet to find \"really good\" Thai food in CT.  I ordered takeout here, and the restaurant seems nice enough.  I ordered the Roti appetzier, which was described as chicken in massaman curry with roti bread.  While I thought the flavor of the curry was delicious (and not spicy, which is okay by me), all it consisted of was literally, three small pieces of chicken and the curry broth. No vegetables, no other chicken.  I pretty much paid $6 for an amuse bouche.  Not cool.I also ordered vegetable fried rice.  I've had it at other places where it is full of cilantro, plenty of vegetables and lime pieces.  While very flavorful and pretty decent, it seemed slightly uninspired.  The portion of rice was colossal, and it also seemed super salty.  I mean, it's good if you're looking for mediocre thai food.  I work in Hartford, so I'd rather order from somewhere there and heat it up in the microwave than return to this place."], ["Karen P.", "This is my all-time favorite Thai restaurant so far, the golden standard by which I judge all American Thai food.  What can I say?  The food here is absolutely spot-on, prices are reasonable, and the staff are friendly without hovering.  I've tried just about every vegetarian option on the menu, and they've all been outstanding.  (From what I understand, the meats are equally good!.)  Everyone I bring here leaves happy, too-- from the Thai junkies to the pad-thai-is-almost-too-spicy-for-me folks.  Seriously.  If you want Thai food, you owe it to yourself to at least *try* Sukhothai.  You can thank me later!"], ["Sara B.", "I hadn't had the curry here in quite awhile, and it seems to have improved.  I went last night and ordered the Green curry and it was spicy (not CRAZY spicy - you probably could ask for it hotter if you like...it was hot enough for me) and not nearly as watery as it used to be.  The service was also exceptional.  Granted it was a Tuesday night so it was slower in there, but everything seemed much better than the last time I ate in!"], ["Lori B.", "I had tried thai food a number of times prior to coming here and never liked it. I would ask other people what they liked at thai restaurants and they always say chicken satay and pad thai - boring in my book.Then we came to Sukhothai and now I like thai food. The curries are excellent, I love Spicy noodles with shrimp, any of the duck dishes - in short, I really enjoy eating here.I really haven't had a problem with the service but we do usually go on weeknights. I would say to people that are in a mad rush for their dinner, they do take-out :)"], ["Sean W.", "Pretty good food, attentive wait-staff. Unfortunately the day we went they were out of broad noodles and beef.  the food was very good as well.  They do not let you choose the spicyness level of dishes."], ["Kathryn G.", "Lovely staff. Delish food. Laid back atmosphere."], ["Claire W.", "I've only been here once, but it was really great.  I had the chicken pad thai, thai iced tea, and shared some spring rolls.  Everything was delicious!  Although, I have been told by a friend that this place serves \"Americanized\" Thai food, but it tasted great to me!"], ["N S.", "Pretty good Thai food for the price. If it was wicked expensive then I would rate it lower but for the price it is definitely a place you want to go for lunch. The Pad Thai is great."], ["Rob S.", "Good fresh food delivered with a smile.  Delicious Pad Thai and Tom Yum soup.  Highly recommend.  Worth the trip as I haven't found better in other towns east or west of the CT river."], ["Louisa L.", "My husband and I have been to this restaurant twice now.  The service was great.  The food was yummy.  Plus, plenty of street parking.  My husband ordered the Crispy Duck - YUM.  I have ordered the Tom Yum Noodle Soup & Pad Si Ew.  Both very tasty.  We have shared an order of fish cakes and my husband loves it.  I thought they were pretty good, but I'm a bit bias, my mom makes them so much better.  I highly recommend this place to people who wants to try some authentic thai cuisine.  So far, I think this is the best thai food I have eaten in CT, but I'm still searching for better."], ["Lori G.", "I stopped here at 8:30p on a Sunday after working at an event on my way back home to NYC.  We ordered thai spring rolls and dumplings to start, then pad see ew and another noodle dish for our entrees.  Overall the service was quick and the food was very good.  After a long day of working since 5am, this really hit the spot.  The quality of the food is good.  It's not going to blow you away where you want to come back every week, but it's definitely worth going to, and if in the area, I would return.  Good food, good service, and compared to NYC, great prices!"], ["amy w.", "Sukhothai has the best pad thai.  It's worth coming here just for that if you're a pad thai fan.  Unfortunately, the rest of the food is pretty disappointing.  The curries are uninspired and lacking in flavor.  The service is slow, so do not come here for dinner if you have firm plans afterwards.Update:  I visited again for the pad thai, which I'm sad to report has gone downhill, it's still the best in the area, but not nearly as good as before.  I hope they were just having a bad night.  The service was also worse than before, we had to seat ourselves while the server (who clearly saw us) sat and sipped her water."], ["Jason A.", "4 stars for quality of food and overall cost.  good noodles and fresh ingredients beat out a regular chinese resatuarant anytime - try the fried rice. Pad thai + drunken noodle are good too."], ["Penny M.", "The service is horrendously slow.  Unless you have hours to spend waiting to place an order, receive your food and wait for your check... In that case, the food is actually fairly good - but in my humble opinion, not worth the incredible wait.  The waiting just takes all the fun out of dining here and that's really too bad.  I love the table near the cash register with all of the Thai travel literature - great idea!"]], "Sweet Chilli Thai Cuisine": [["Laura T.", "Try the Tamarind Fish (Tilapia) - delicious!"], ["John D.", "Been here a couple times for lunch The drunken noodles are pretty good. Lunch specials are affordable. You'll never find parking out front so just head to the back of the building."], ["Jenny C.", "I was craving mikathang (Cambodian (Thailand's neighbor) 's word for pad see-ew)... so what did I do? I Yelped.. and the closest thing in my area was Sweet Chilli Thai. Also, I'd like to mention that I never finish meals. Ever. (Hot dogs, corn dogs, etc. included. I think it's a \"mental\" thing.)I called ahead and asked for an order of beef pad-see-ew and had it with a salad and a can of soda. It was ready in 8 minutes (the girl told me 10). After tip it cost $15.51. Expensive when compared to my hometown (where SE Asian food is in abudance), but if it was tasty, I could get over it.The lunch portion came cutely packaged. It was like being back in primary school with cute little trays. That said, the amount of the meal was miniscule and basically MADE for a toddler. I understand that it was a lunch portion, but really? The food itself was subpar and definitely not worth the $8.95. Especially considering I was charged an extra $2 because I wanted beef alongside my meal- which ended up being chewy and nearly inedible. The highlight was the salad, since the peanut sauce was actually good. (The sweet chili sauce was liquidy and almost soupy. I couldn't even stomach it and ended up making my OWN chili sauce. //face palm) The mini veggie egg rolls were decent. I finished this lunch in its entirety.Although this joint is less than half a mile from my apartment, I'll definitely pass. I'd rather wait the two week wait to have freshly made, protein-included meal. I will note one plus: now I know what mikathang is in Thai. Now I can order it at other Thai restaurants."], ["Joe B.", "After reading the \"oodles of noodles\" email from yelp I took them up on the offer with Sweet Chili's drunken noodles with duck to see what the buzz was all about. It's hard to find a restaurant with a solid duck dish and I honestly can say I've found it! Crispy, full of flavor...melts in your mouth! Add a hot cup of Thai tea with a little sugar and I'm all set for the rest of the day"], ["Chris N.", "My favorite spot for Thai food in WH! Best chicken & coconut soup.  Highly recommend the drunken noodles extra spicy."], ["Anne C.", "Arrived here on a recent Saturday evening to meet several friends for dinner.  Parking in front of the restaurant is sparse, but there are spaces on the street and a lot in the rear of the building.  I did not think to make a reservation, but Although  we did not have a problem getting a table.The décor is cozy, with dark wood floors, high backed chairs and tablecloths.Our waitress was very friendly and answered all our questions.  We ordered their fresh shrimp spring rolls as an appetizer which came with two types of dipping sauce, one of which I believe was a peanut sauce.  Rolls were fresh and with every bite I got a burst of fresh lemongrass and Thai basil.I ordered the Pad Pik Pow (green beans, cashews, zucchini, carrot, bell peppers in Thai Chili Sauce) with Mixed Seafood and a side of brown rice.  The presentation of the dish set before me was nice, however, after one bite, I immediately had to put my eating utensils down and grab a large drink of water.  The Thai Chili Sauce was very salty and took away any freshness that I could have experienced..  Now I like salt, so for me to say that a dish is even salty for me, says something.  Thinking that my taste buds might have been out of whack, I asked my husband to try the dish and he felt the same way.  On top of that I did not think that the cost of the dish matched the quantity of food I received.  Yes - I know sometimes quality out weighs quantity but having tried several Thai restaurants in and around the West Hartford area, Sweet Chili Thai Cuisine falls short.I will give it another chance, maybe it was just an off night for the sauce maker."], ["Sanh A.", "I tried Sweet Chili and left disaapointed. The restaurant is beautifully decorated and the staff was very nice but I went there for the food. I'm giving this place a 2 star,  one for the staff's friendliness and another for the decore.The food was a total disappointment. We ordered the chili fish. Fish was charged at market price and that was $19 that day for a fillet approximately 2oz. Flavor was okay but it wouldn't convince me to stop when I hungry.The Peanut lover was steamed broccoli with peanut sauce. Totally lacking in flavor and they broccoli used was old. It was dry and not crunchy. There's nothing special about this place. There are many great Thai places in the area save the money and head to another restaurant if you're seeking to satisfy your taste buds."], ["Abhi V.", "I was visiting a friend and found this amazing gem. We had veggie dumplings, bag of gold and drunken noodles. Have to say ,this place is freaking good. The flavors were to the spot. Neither spicy or greasy. My friends had masaman curry and some shrimp dish. Me being a vegetarian I jus loved the food here. The price was reasonable. And also they have a real clean restroom (which is pretty important for travelers like me). Overall 5/5 for food,cleanliness and service"], ["Nikki R.", "Love love love this place the food is amazing...you should really try it you won't be disappointed I promise."], ["Lesley M.", "I'm so glad that my man and I tried this place last night!  Excellent place for the price, especially if you are going on a date!Don't be fooled by its modest exterior in the Park Road section.  Once you step inside, the decor will take your breath away...And for a weeknight, it was relatively busy.For starters, my man and I shared the Sweet Chilli Sample (A-13), which was impeccably presented on simple white dishes with three different dipping sauces; peanut, duck, and soy.  The peanut sauce was outstanding and I especially enjoyed the satay chicken flat and bags of gold.For the entrees, we ordered and shared the Salmon Mango (SP-2) and the Drunken Noodles with Duck (N-2).  Both very fabulous and flavorful!  While my boyfriend's thought the salmon was it was overy cooked, I thought it was cooked fine.  The curry coconut sauce was sensational and the big chunks of mango were a nice bonus the dish.  As for the drunken noodles, that dish was cleared quick!The waitresses were very nice and calm.  Our dishes came out at a reasonable time.We will be back for sure!"], ["Jason M.", "You know the food's good when the owners can't even properly spell the words that name the restaurant.[Sigh... Yes, there are in fact two L's in \"Sweet Chilli\"]Anyway, here we find a surprisingly upscale little restaurant on Park Road. The prices are pretty reasonable, and given the presentation and environmental factors, I'd say you get more than you bargain for.Intimate lighting, dark wood, and leather chairs or booths give the interior a very chic feel; even the little bar in the corner is artfully presented. Waitstaff presented themselves well with an air of genuine friendliness throughout the meal.The Sweet Chilli Sample was a nice way to start the meal, with two kinds of dumplings, egg rolls, and grilled chicken skewers, creatively served with three different dipping sauces.Then we shared two main dishes. The Mango Salmon may have been the low point of the meal. Not because of the accouterments though - in fact, the fresh veggies, chunks of mango, and spicy sauce were extremely tasty. But the piece of salmon itself was not great. It was either overcooked or of poor quality.The drunken noodles with duck were GREAT. The noodles are much like the Chow Fun you get at a Chinese restaurant, but the preparation is different. Definitely get your noodle and rice dishes with duck here, you won't regret it. Tasty, crispy, fatty, delectable.Also a nice touch that brown rice is an option. Other than a few minor nit picks, Sweet Chilli did an outstanding job."], ["Douglas O.", "Our favorite Thai in West Hartford. Best duck. Lover the duck with the drunken noodles!"], ["Carlos A.", "I loved the modern decor and the food was excellent. I had the yellow curry and chicken pad see ew and both were very tasty. I highly recommend Sweer Chilli thai."], ["Prince V.", "Its a decent place. Service is good and fast. But could definitely work on the taste. This place is priced for \"presentation\" but not for taste. Pad Thai is SWEET. Drunken Noodles tastes good. But their Tom Yum soup is not close to good. I might go there again. Food is $10-13 per plate."], ["Steven T.", "Service was so painful last night! It felt like it took forever to get my meal and it was just the five of us this time around.  My miso soup was salty, but still good.  The Bangkok pork chop was very tasty, but a bit dry.  I'm going to give it another shot.  I was avoiding the fried food and I guess this was my punishment."], ["Alberto C.", "The food is very good. They are consistent in their cooking. The staff is always friendly and the restaurant looks very clean and trendy. The lunch specials come with egg rolls, soup or salad and priced under $10."], ["Lauren B.", "It was great- started with veggie dumplings and summer shrimp rolls. Then had pad see ewe, tom kha soup and red curry.  Oh, and thai iced tea! Everything was very good, place is very nice and classy looking, and service was excellent."], ["Rosanna M.", "As I work in West Hartford, I am quite familiar with the many Asian specialty shops and restaurants in the area (also being an Asian myself).  But last weekend was the first time I have ever been here.  A private party was hosted on site at the restaurant that I attended.  It was a buffet style of some of their menu offerings with an OPEN BAR (heck yea open bar!!! lol).  Anyway, I had a little bit of everything and OH MY GOD so delicious.  My favorite was the glazed wings, the Pad Thai and a pork paste baked on a sliced baguette, like a bruschetta.  If anyone knows what this pork bruschetta is called, let me know, because I want to go back and order them.  The papaya salad and the fried rice was great as well.  I didn't like the sticky rice as much.  I had a Thai beer while I was there and it was pretty good.  I thought it tasted like Bud Light a little bit, but was more concentrated in flavor.  The owners and the servers were awesome, very friendly and always smiling.I will go again during regular restaurant hours to try the other dishes.  Can't wait!"], ["Shweta U.", "Me n my friends had been to this restaurant. There was a pin in the food. I wouldn't recommend this place bec looks like they are really irresponsible while cooking food ."], ["Dan S.", "This place has potential.  So the three stars are more of an incomplete than anything else.Came in for a recent dinner. Plusses were the service and decor.Of course that means the food was just ok.  The Eggplant Basil dish was full of Eggplant but a little short on spice and a little heavy on oil.  As a result, it was just fine. Dinner companion's dish of Pad Thai was average. The prices also seemed a little higher than some of the other area Thai places and, candidly, if I had a choice between this and Blue Elephant Trail (or Hot Basil), I'd pick those places in a heartbeat.As a neighborhood place, its fine. As a destination place? Not yet."]], "The Blue Elephant Trail": [["Chelsea R.", "First time coming here and will definitely come again! I ordered the classic Thai Curry dish, with the 2nd hottest pepper rating (I believe that's 3 chilis on their menu), and it was definitely nice and hot. Our dishes came quickly and we were served a nice free appetizer beforehand of sweetened pickles and carrots. Another huge plus was the nice atmosphere, really enjoyed the blue wallpaper, elephant decorations and the opened windows allowing a nice breeze into the restaurant on a sunny day. Would definitely recommend for any Thai lovers!"], ["Anton R.", "Blue elephant is by far the best Thai I have tasted in Connecticut . I have tried about 6 other Thai spots and they surpass my expectations every time i eat here . The menu is quite extensive choices of chicken, beef or seafood . My recommendations are the Thai basil , mango and massaman curry . They also serve seasonal dishes like Pumpkin curry as well which is also phenomenal . No matter what you order you want be disappointed , everyone I bring here falls in love with Blue Elephant !The service is prompt and the owner Soden is usually their walking around talking to patrons and inquiring as to your satisfaction of your meal and happiness overall. I'm here several times a month and strongly recommend them for their quality dining and very healthy dishes ! You can eat very healthy here without sacrificing taste !"], ["Ian Y.", "Is it embarrassing to admit that I really wanted to dislike this place?  With it's West Hartford location, classy atmosphere, and relatively high prices, it had all the signs of being what P.F. Chang's is to authentic Chinese food.  But no, it was actually pretty good, not only in terms of taste but also value.I went to The Blue Elephant Trail early on a Sunday afternoon with my mother, who was visiting Connecticut.  I was pleasantly surprised to find that they offered the brunch menu through 3pm, and given the opportunity to try a bunch of different Thai dishes under $20, I felt it was the best way to go.  My mom and I intentionally ordered different dishes, so that we could each try two soups, two starters, and two main dishes -- definitely the way to go.  The staff was incredibly open to us sharing, and even provided us separate dishes for sharing (a welcome departure from those restaurants that charge a sharing fee).Being a relatively small restaurant it wasn't too hard to get the servers' attention.  The waitresses were polite yet indifferent; they didn't go out of their way to make us feel welcome, though, such a service approach didn't feel like it got in the way of a positive eating experience.Most dishes on the standard menu fell in the $15-25 range, and looking around at what people around us were ordering, I was impressed by how the portion sizes and quality of the food (at least by sight) were what you would expect, given the price.One thing that I admittedly cannot judge is how authentic the food was.  I mentioned P.F. Chang's earlier in this review, and I actually railed on P.F. Chang's in another Yelp review, stating that no self-respecting Chinese restaurant serves brown rice (Disclaimer: I love brown rice).  The Blue Elephant Trail does offer both brown and jasmine white rice (in many cases, only as additional-cost sides dishes), and the amount of rice they give you does not seem \"normal\" when compared to how much rice you would get at a traditional Asian restaurant.Still, the food was good and the price seemed right.  Perhaps if I become more familiar with authentic Thai food in the future, my rating of The Blue Elephant Trail will change."], ["K L.", "Located in Downtown West Hartford, this restaurant has decent Thai food. Nice decorations. Street parking. Well located."], ["Amanda G.", "The best Thai restaurant I've been to in CT. The drunken noodles are my favorite but everything I've tried has been great. The service is also super fast and friendly. It's a great place to go in West Hartford center that is rarely too crowded unlike many other nearby restaurants."], ["Suzanne F.", "While the food was very tasty, the service left much to be desired. It took forever to have out order taken, we had to ask for water multiple times, and appetizer dishes were left on the table well into the meal."], ["Ben S.", "This place gets five stars because of the balance between quality and value.  The food is excellent with delicate layers of flavoring and great cook.  The curry puffs, egg rolls, etc.. are as good as it gets.  I don't eat fried foods, but those are so delicately done with such a perfect cook that they are not greasy at all.  Crisp and just wonderful.The curries that they do are phenomenal and very nicely balanced.  Rich, but not too rich, well seasoned but not overly seasoned, etc.... I come here a few times a month.Tonight for the first time I had a slight issue with a dish.  The head chef personally saw to it that the dish was redone.  It was taken care of quickly and the results were nothing short of awesome.  They went above and beyond to make sure we had a perfect experience.  I am a regular and plan to continue being a regular here."], ["Jonah C.", "I came for lunch with my coworkers. Lunch was $10 which is a  pretty good deal. We came around 1:30pm and the waitresses were having lunch so the service wasn't quick. And the salad came without dressing. But pad thai I ordered was pretty good. I will come again."], ["Gabriela G.", "Sade sings loud throughout the restaurant speakers (more than just mood music). Survivor plays on flat screen tv over the bar. Decor is elegant, hardwood floors, cavernous-like, though bright lighting. Very clean, sharp white table cloths spotless, shiny silver wear and perfectly clean water glasses glitter on tables that overcrowd the small space. Some booths for large groups in the back. Elegance cheapened by the Christmas lights that are coiled around a divider that separates the bar from the restaurant.Hostess and waitress with friendly thai smiles greet me. I greet them back with my limited thai vocabulary. No wait for a table, I am seated right away.I ordered the seasonal special of flounder with thai papaya salad. It took about 10 minutes. The presentation was beautiful. Not haute-restaurant gourmet but homey, inviting and colorful with a rose carved out of a carrot as garnish.The papaya salad was good but one note. I asked for medium spice and it came out mild, it lacked crunch and acidity.The flounder however, was absolutely delectable! Lightly fried, crispy on the outside, tender on the inside. Amazing crunch and flavor.My water glass was never empty and the waitress approached my table several times to inquire about my dining experience and to aak if I enjoyed the food and needed anything.The service was fast and the food was quality. I ate alone since I'm here for work and didn't know anyone in Hartford. The waitress commented on my clothes and entertained my sloppy thai. I would eat here again. I have been to Thailand on several occasions and I live in Los Angeles, CA home of the first ever thai town in the US and home to some of the best thai food in the world (see my review for Jitlada) and I was not disappointed by The Blue Elephant Trail."], ["Sunita B.", "I love thai food. I have been coming to this place quite often. Ambience and outdoor sitting is perfect for summer lunch or dinner."], ["Tiffany W.", "I ordered from here on 12/14/13 because I was leaving UHART and heading to Wallingford for a concert in the middle of a snow storm. This was my first time going here.Due to the weather it was empty when I went in and I was able to just order and get my food to go, I wasn't hungry at the time. I got some veggie tempura and drunken noodles. The tempura was great even though I was eating it 30 minutes after I had ordered it. The noodles on the other hand: SOAKED in grease, to the point where they were messing with my stomach and made me not interested in finishing the dish. After my Backstreet Boys M&G I ate a pretzel and some popcorn at the Oakdale and had an awesome time at the concert."], ["Anna K.", "Delicious Thai food and great lunch specials! Really nice location and cute decorations with the option of sitting outside, inside, or inside by the open window. The place was pretty empty when I visited last - hope that is not the normal!!"], ["Adina M.", "Hit or miss. We have been several times, the food has either been absolutely spectacular or below average (even ordering the same dish). Service has always been good and prices are reasonable. Ambience and decor are very appealing. Overall an acceptable choice but nothing special, and better options in the area."], ["Nobbi L.", "I came here with a new friend from WH. The decor was upscale and the service was pleasant. But I believe our Asian wait staff was not Thai. They did not have a condiment tray. My dinner mate had the basil dish but the meat was in chunks, not the authentic ground meat. I think this is a place for upper class West Hartford folks who have no clue what real Thai food is like. But that's marketing to the locals, so ok."], ["Maki S.", "I don't have much to say about this place. The decorations are absolutely stunning,  so are the chandeliers and elephant mural...but the fact that I'm starting with the amazing decorations having not mentioned the food here speaks volumes, at least to me. I went here for lunch with my boyfriend, and ordered Pad Thai. Don't get me wrong, the plating is beautiful, and if you want to photograph a beautiful meal this is the place to go. However, the food was just BLAND. I'm going to give this restaurant the benefit of the doubt, but there was not one memorable thing about anything I ate, except for the veggie appetizer (they switch things up. Don't expect a bread bowl) because I ate a big piece of ginger thinking it was a raw slice of potato...not fun, but funny. ANYWAY, the Pad Thai noodles were cooked to perfection and everything had a hint of peanut, but it wasn't very well seasoned and not spicy at all.I like my Thai food with a little zing, and was unplesantly surprised to find out I would of had to request it spicy from the waitress while ordering. I've had better. I can't even suggest it, although like I said if you want some romantic photographs or interior decoration ideas check it out!"], ["H S.", "I used to love this place (see below). The last 2 times over 10 months I have been so disappointed.  Last summer I ordered my regular dish of the green curry with shrimp.  It was always perfect.  This time it tasted watered down, without it's usual rich coconut and chili flavor.  I assumed it was a one-time issue and didn't think much about it.I returned a few weeks ago for dinner.  We started with shrimp summer rolls - they were terrible!  They were almost completely filled with shredded iceburg lettuce with no hints of flavor such as mint or cilantro.  We didn't even finish them because they were that bad. I then ordered chili salmon.  The salmon itself was good, but there was so much chili sauce that it was more of a plate of soup, with lots of green beans and some salmon buried inside. The sauce was just too much - I didn't eat much.  Another in my party ordered pad thai and was pleased with that.I don't know what has changed here.  Maybe the the price of ingredients has caused them to skimp on quality ingredients?  I'll probably give it one more try before quitting.Here is my previous 4 star review:I've gotten take-out once so far and was very pleased.  I agree with other posts that promptness is not their virtue.  My take out order took another 10 minutes beyond their 20 minutes. I can live with that because the food was tasty and had good size portions.  Drunken noodles are delightful and the perfect amount of spiciness.  Vegetable curry puffs were tasty.  And a beef dish (forgetting name) of minced beef with lime, chili, cilantro was great.  I will definitely make this a mainstay for take out and look forward to sitting down and enjoying a meal inhouse."], ["Staci R.", "Came here for lunch and it was absolutely yummy! The $10 lunch special is an entree with soup or salad. The spicy soup was absolutely delicious! When my entree came I almost didn't want to give up my soup LolI had the Garlic vegetables with brown rice. It wasn't spicy until I drunk my water lol. It was very flavorful and filling. The waitress was very attentive and polite. I can't wait to come back and try the drunken noodles!"], ["Nicholas S.", "Got seated right away but thats about it.. a couple came in 10 minutes after I was seated and got asked their order before us and even recieved their drinks and full meal befor we were even asked what we wanted to drink. Our menus were closed and we were ready before they came in 10 minutes after us...GOT ASKED WHAT WE WANTED 40 MINUTES AFTER BEING SEATED..GAVE ME WHITE RICE WHEN I ASKED FOR BROWN, BLACK HAIR ON A PIECE OF MANGO"], ["Gator C.", "Amazing food! I always enjoy the grilled coconut corn! Delicious! Also enjoyed the Thai Basil Duck and the mango rice. Mango rice is presented on a pineapple boat! Been here several times and bring visitors here to eat. Always consistent.Coconut Ice Cream is a must have!"], ["Daniel H.", "Nice Thai place.  Does a decent job on your standards like pad Thai.  Really like their fried rice.  Their duck is pretty standard fare, tasty but a bit oily.  They do have good appetizers.  The staff is friendly but they are often understaffed and if you need anything it's a chore to flag someone down."]], "The Elephant Trail": [["Lisa B.", "We have had dinner several times at Elephant Trail and it's always been great. This particular visit this past Friday was excellent. We tried some appetizers and meals that we had not had on previous visits and both of our meals were excellent. I had the broccoli with pork and my husband had the garlic chicken. The meals were hot, vegetables crisp and fresh and the sauce was light and tasty. What is so nice is everything is made to order and there is no oily goop at the bottom of the dish like you find with Chinese food or at other Thai restaurants! As an appetizer we had the lettuce wraps, YUM!!! Treat yourself to a great meal and don't be surprised if there is a wait as it gets pretty crowded."], ["Vicky L.", "My sister and I went for a lunch date here yesterday and we were both so pleased! The atmosphere is beautiful..it's big and open and has very modern Asian decor. We fell in love with the porcelain elephant tea pot, it was so elegant and really went with nice ambiance of the restaurant. Their fall special was pho, now I was hesitant because my mom makes the best and pho can be a hit or miss in restaurants. My sister was brave enough to try and she said it was AMAZING! I took a soup spoon and sipped the broth and lo and behold she was right! No more traveling to hartford to get a decent bowl of pho. I had the seafood with vegetables and it was nice and light, not salty or overpowering. I sipped on refreshing Thai iced tea and our waiter was absolutely amazing. The service from beginning to end was impeccable. He brought over an extra table to fit my daughters high chair, paid a lot of attention to our needs. I can't wait to go back here. Only downfall: not open on Sunday's and I'm craving more!"], ["Greg B.", "If you're looking for Thai food, this place has been good and consistent for many years. Friendly staff, reasonable prices."], ["James K.", "This place has great food.   Pad Thai and seafood hot and sour are my favorites.  Atmosphere is nice too.   Friendly staff.   :-)"], ["Carolyn R.", "My favorites are the massaman curry and chicken larb. I also always get some ginger tea with it.The restaurant allows BYOB, though I've never done it. I've always loved their food, but now love the space too! The new location is much bigger and elegantly designed."], ["Bill S.", "I love this place. Cool friendly service. Outstanding curry and pad Thai dishes. And a wine that I had last night that was fantastic: Some Sauvignon Blanc from New Zealand. The place is clean and the people who go there seem to love it. There seem to be fewer and fewer restaurants like this. When I find one that I do like like this, I want to tell everyone!"], ["Kelly R.", "This is by far my favorite Thai Restaurant.  I have been going here for years and have never been disappointed.  The employees are very nice, and the service is great.  My favorite dishes are the pad thai, drunken noodles, and basil fried rice."], ["Kim A.", "Just had lunch there today, great experience. The lettuce wraps were great. The Larb was nice and spicy.  The drunken noodles were delicious.  We enjoyed everything we ate.  There was a large party near us and everything they got looked and smelled great.  We were far from home but would definitely return."], ["Harry R.", "Very solid Thai food that is definitely worth trying. Went back a second night for more! Massaman curry with chicken the first time and the veggies and cashews were cooked just right.  Second time was pad see euw was fair.  Noodles were tasty but nothing out of the ordinary. Would go back though!"], ["Heather R.", "We love the elephant trail and have been going here for years!!! This family is the best and always treat us like VIP. The food is amazing and always consistent. My favorite is the cashew nut with chicken and my husband gets the pineapple fried rice. It's also BYOB which is always fun!!"], ["Jeffrey Y.", "This is by far my favorite Thai restaurant. I have been eating here for years and have never been disappointed. The new location adds a lot more space and is a perfect place for big groups. The soups are fantastic and the curries are excellent! If you ask for it \"Thai hot\" be prepared as it will be mighty spicy.  There are plenty of things on the menu that are not spicy for those of you who don't like it as hot. Try this place you won't be disappointed."], ["Christy M.", "This place is really good if you're craving something Thai. It's so spicy and fresh. I live right around the corner so i feel like i constantly am pending from this place."], ["Ann S.", "Food is tasty, but service was exceptionally slow.  Took about 10 minutes for a waitress to ask if we had been helped; when we said we hadn't, she decided that perhaps she should take our order.  It took well over an hour to get our food, and only once did anyone come by to ask us if we wanted more to drink.  Food did not arrive all at once.  My dish --basil chicken -- was tasty, but my husband's was exceptionally spicy, even for me, who likes very spicy/hot food.  But, he had specifically asked for his dish to be mild.  He had to take the dish to the bar to ask for a redo, which he got, and which turned out to be great.Not sure we'll come back on a Friday or Saturday night for awhile; they need to better orchestrate their wait staff and improve their service.  Food is relatively good, though not as tasty as Tara Thai in Virginia--our favorite place."], ["Joe T.", "Very good pad Thai. Service is a bit on the slow side. Overall great Thai food. I loved the curry puff appetizer. The Thai iced tea is average. Went with wife and kids. I would suggest a kids menu but not a big deal. Ambiance is above average for Thai restaurants."], ["Rebecca G.", "The food was bad to mediocre. The service was horrendous. Snails pace at every step in the process and what's worse was that when they cleared our forks and spoons  after appetizers (we asked for fresh tableware), when they finally delivered our dinner, we did not have utensils to eat it. After flagging different waiters down twice who disappeared (and waiting and waiting) I finally had to get up and go looking for utensils.There were four of us eating. We all left half our plates filled with food and did not take it home because it just wasn't worth the trouble.The best part was the broth in the Thai mussel dish but by design we couldn't really devour that to enjoy it.Although I enjoyed my company that night, our experience at the Elephant Trail was just aggravating."], ["Melissa B.", "I am absolutely obsessed with this restaurant!  I no longer live in the area but I come here every time I come back to visit my family.  I have a few favorites including the vegetable soup, chicken satay, lettuce wraps, and pad see ew. But, you really can't go wrong with any of the dishes!!"], ["Ellen E.", "Very friendly service, but the food was just OK.  When I eat half and don't want to take the rest home, that's not a good sign.  It may have been that I just didn't care for my dish (didn't like the chicken in it, the noodles were fine).  The coconut ice cream was good!"], ["M. D.", "Elephant Trail has an extensive Thai menu, and they accommodate for my gluten-free dining needs.  The food was great and the portions were huge.  The drunken noodles were delicious.My only criticism is that the server was a little slow, even though the restaurant was empty.  Overall I would return and appreciate that they can accommodate gluten-free diners."], ["Dee S.", "How could you got 4 stars? Worst Thai Restaurat ever. Food are terrible. Tasteless, just sweet and sweet. Service also bad. The waitress took our plates when we are still eating. FYI, we went there on Sept. 29, and for sure we will never comeback."], ["Deborah W.", "When a restaurant is this exceptional, what can be said? The Tek family takes it to the next level because when you're their guest you become part of their family. By far the best Thai food I've eaten. Try anything on the menu. You won't be disappointed! The salads, noodles, curries, summer rolls - literally everything is delicious! My personal favorite are the Drunken Noodles."], ["Jim L.", "We went here for the first time and was pleasantly surprised. We sat down and the server was right there, friendly and helpful. We started with the summer rolls which were light and not fried. The entrees were excellent. I highly recommend Elephant Thai as the service, food quality and price was excellent."]], "Thai Palace": [["Dav Q.", "Great food but bad customer service. Often times you are rushed to pay your bill, your are rushed to pack your food and leave as other customers are waiting. The food is what's keeping me going there. The people working there have little to no people skills"], ["Luc V.", "$8 for a lunch special which includes a main dish, two spring rolls, and soup! I don't think you are going to beat that anywhere to be honest. Problem with this restaurant is the food and prep was not up to par. I don't recall pad thai noodles being pink. I also don't recall thai food without flavor. Our noodles were cold and our spring rolls were stale."], ["Joe B.", "$8 Lunch specials all the way - lots of food for such a little price! you wont leave hungry.  Very casual atmosphere, not a place I would go on a date or a special occasion, but definitely for a quick meal.  Another perk: pleanty of parking in the outdoor mall area!"], ["Jan P.", "I went for a solo dinner there tonight and was really taken aback at how unfriendly the staff was. From the blunt no how-are-you greeting to the waiter who seemed to make point not to smile the service was as bad as I have experienced.To make the experience even worse, there was a piece of metal foil in my dinner. It took several minutes to get the waiters attention since he wasn't in the dining room for several minutes. I told him about the foil and he offered a replacement meal. No visit from the manager to apologize, no offer of a refill on my drink will I waited, in fact I received no additional attention. I did get another meal plopped in front of me by the owner but I had to yell after her that I needed a new fork since they took the other with the old plate. Her only word to me in all of this: what.And that's the last time anyone came to my table until it was time for a check. The check did not reflect any reduction for the snafu with the metal foil and certainly no apology from the management. It's like they did not even bother to phone in an effort today at any point of my visit. The waiter humbled an apology as I walked out the door.  Too little too late."], ["Krystle B.", "I ordered the pad see ew to go on a week night. Called my order in, they didn't answer the first time, so I called back. Answered. Food was ready when I got there, great! Here comes the disappointment....I open my takeout container and find....drunken noodle veggies?! Bean sprouts, bell peppers, etc. This is NOT pad see ew. Upon taste test it would seem they simply replaced the padseeew veggies (Chinese broccoli) with drunken noodle veggies. Not cool. And not tasty. If a restaurant can't get one of its staple dishes right, what can it do?"], ["Ashwin S.", "The most amazing Thai food in town. Love the green curry and panang curry. Oh the spring rolls and chicken coconut soup are AWESOME too :)"], ["Lesley M.", "Thanks to the recommendations from my Yelp friends, I tried the drunken noodles lunch special and it was fabulous!  My co-worker had a basil shrimp and that looked really good.I went with a group of co-workers to celebrate a birthday.  What was very accomodating was someone called ahead with our orders and the meals were there when we arrive.  You can't go wrong at $8 for a lunch special with the amount of food you get plus Asian rolls and soup. Place is extremely busy during lunch."], ["Patt C.", "I stopped here for lunch on a weekend. I had the panang curry with white rice (they offer a choice between brown and white). The waiter suggested the Thai rice noodle so I got that too. The Thai rice noodle wasn't bad, but the spices tasted more Chinese than Thai. Same with the panang curry.  The curry wasn't bad, but the taste lacked a certain tanginess (maybe they don't use as much lime? lemongrass?) that I'm used to when eating Thai food. I've also ordered take-out here once before and the overall impression I had then was the same: not bad, tastes like watered-down Thai food. They have a cool-looking bar though. Too bad I quit drinking."], ["Denise N.", "I intended to take myself to Republic today, but, after driving around for about half an hour, unable to find it (yes- i know- i need gps), i decided to settle for Thai palace instead.  I've read a bunch of the positive reviews here, and felt comfortable that i would have a good experience.  Well- i did.Initially, i couldn't recall if they served alcohol or were BYOB, and i almost chose ginza (right next door) instead, considering their windows were littered with neon beer signs, but i decided i really was in the mood for Thai, and chose to chance it.  Well, fear not- i was greeted by a full bar immediately upon entrance.  I sat at the bar, as is my wont, which i think puzzled the owner a bit.  I had to explain that i was there to eat.  As soon as we got that straightened out, it was game on.I started with some ozeki nigori sake.  It was a bargain at $8 for 375 ml.  I like nigori sake- this is the cold, unfiltered stuff that looks like milk.  It totally hit the spot.  The menu is extensive, and i still consider myself a youngin' when it comes to Thai cuisine.  I wouldn't say i was overwhelmed, just disappointed i only had one stomach and just so much money.  There is a good variety of appetizers, soups (both as a starter or a meal), and then various entrees grouped by protein, noodles/rice, and house specials.As I'm still recovering from a cold, i chose to start with their chicken noodle soup: a rich, savory broth spiked with dried onion, as well as silken tofu, strips of tender chicken, and thin glass noodles.  The soup was delicious, comforting and an excellent opener.  I looove glass noodles.  I will say that i later saw some tom kha gai walk by, and was a little jealous, but I'll just have to return.My go-to for an entree is drunken noodles- so spicy, sweet, and savory- i just love them.  I'm an adventurous eater, and i always try to talk myself out of them so i can try something new which, until today, has proven entirely ineffective.  I chose something else today because a) it was time and b) Thai palace groups their drunken noodles with the curry dishes, not the noodles, which is not how I'm used to seeing it.  I didn't want to risk being disappointed if it was different than i expected.  Instead, i got the Thai rice noodles.  These were thin, vermicelli style rice noodles, served with chicken, shrimp, bean curd, red onion, zucchini, and egg.  I ordered the noodles spicy, which sometimes is spicy, and can sometimes be medium because Thai restaurant proprietors know we westerners are often not so great with spice.  Well-These were awesome!  The sauce was perfectly spicy, and, for just $10, a huge portion of noodles (i took half home), six plump shrimp, plenty of chicken strips, and a good amount of egg.  (I honestly didn't notice any bean curd, but the dish certainly wasn't lacking, so i let it go.)  I was a bit surprised there weren't more, or bigger pieces of, veggies, but that may just be what I'm used to.  I love egg in noodle dishes, but always forget to ask for extra.  My favorite bites of this included egg.  There's just something about how it absorbs sauce- love it.My meal closed with some cubes of pineapple, very classic.  I really appreciated that these were served with a small cocktail fork, as opposed to the toothpicks you often find.  Also- the young guy taking care of me was very sweet, polite, and efficient.  In fact, when i requested chopsticks for my noodles, he opened them, split them apart, and rubbed them for me!  I believe this is roughly the Thai equivalent to putting someone's napkin on their lap for them.This place is a solid joint and had a steady stream of folks coming and going, for eat-in and takeout, many of whom appeared to be regulars- always a good sign.  If i was ever in Bloomfield again, wanting Thai (or lost- ha ha), i would definitely revisit Thai palace."], ["Katie T.", "I'm sure you have fantastic food as you indicated in the recent mailing you sent me, but it would've been even more awesome if you could deliver it like your initial order taker said you could. My son and I can't eat a 50.00 minimum..Maybe you would do better w that in Western MA?"], ["Jasmine B.", "Best time to come is during their lunch specials. Pick any entree, a soup or salad with spring rolls for only $8.00. Certainly can't beat that price, however I wouldn't say this is the best Thai food around. My favorites are usually panang curry or drunken noodle (ask for extra sauce on it). Alcoholic beverages are very strong, especially martinis--could be good or bad depending on your taste.Service during lunch hours are awful because of the amount of people who come. Don't expect a water refill!"], ["Catherine F.", "Had cashew tofu and vegetables.Was awful--tasted burnt and tofu was very tough.waiter was very unpleasant and  I would not go again! My husband  experienced the same  distaste for the dinner. Egg rolls were good."], ["Rina P.", "The food is not bad but the service sucks!!! Waitress was so rude!!! This is the second time we went and got the same rude service! Never again!!!"], ["Kris B.", "Just hit up this joint with three of my boys. We each ordered something differently and I even got a mixed drink. We were please to see that the bill was under $50. The food was presented quickly and with great artistic plating. Food quality was mediocre overall, after finding a bone in my duck appetizer. They quickly took it off without question even though I ate over 3/4 of the dish.Not sure if I would go back here especially with Ginza's right next door, now that place is amazing!"], ["Mike C.", "I'm not a Thai food expert, I've had Thai food from different places, some delicious, some not, this food was not.I've actually given this place a few chances, so I'm not basing my thoughts on a single experience. I tried the Asparagus Chicken, the Peanut Chicken, the Mango, Chicken, and the Ginger Chicken all of which had very tough and chewy chicken.I also tried the fried rice, which was dry and the shrimp were so small that I could barely see them.I remember, way back in the day, this place used to be great, but that was a long time ago, and these days, it's a miss, the food's just not very good, and I feel like I've tried enough dishes to fairly say that."], ["Kelly H.", "Really good Pad Thai and Pad Woonsen. Start with the Thai Springrolls!"], ["Lisa M.", "An excellent stop! Me and my coworker were in the area and needed a place to stop and grab food before we headed off to our next call. Thankfully we found this place and couldn't have been happier. The staff realized we were in uniform, meaning we were on a bit of a time constraint, and they were conscious to get our food out to us quickly and everything was packed properly. They were nice and even gave us glasses of water while we waited--so nice, especially since it was a super hot day!I ordered my usual standby of drunken noodles (my barometer for thai) and it was perfect--mild heat to it and a great portion size. With the lunch special, you also get soup and spring rolls--both of which I was too stuffed to eat at the time (unfortunately food doesn't keep well on an ambulance!). For $8, you cannot beat their lunch menu. Would definitely return next time I'm in the area!"], ["Tevin B.", "Excellent restaurant. My girlfriend and I went there on a whim thinking \"we've never had Thai food, why not\" and we were very glad we chose this restaurant. Pad Thai was great, as were the summer rolls and tea"], ["Kristina L.", "Thai Palace is my boyfriend's family's favorite restaurant, so as you can imagine, we've eaten here for almost every birthday, anniversary, and other special event. Of the countless meals I've had here, the dishes that stand out in my mind are definitely the amazing roti appetizer, the spicy tom yum soup, and the T65 Thai crispy beef entrée. As for desserts, the red bean ice cream is fantastic!A few years ago, I used to think the portions here were WAY too monstrous for one small person to handle in one sitting (please keep in mind that I AM diabetic). While most folks probaby wouldn't mind the large portions, I did get tired of leaving here so overstuffed with rice to properly enjoy my leftovers the next day. So I started ordering appetizers and soup instead. But in the past few months, it seems like the portions here have gotten slightly smaller while the plates have gotten bigger. They've definitely stepped up their game when it comes to the presentation of their food! On my last visit here, my entrée arrived artfully arranged on a large square plate decorated with a swirly chocolate-sauce dragon design, and garnished with slices of tropical fruit. My rice (you can choose from brown, white, or sticky) came out in a pyramid-shaped edible portion.I will definitely be back again and again, especially for the out-of-this-world roti and chicken curry sauce! No other Thai place I've visited makes their roti as good as they do here!"], ["Veronica M.", "Ordered take out here. This place is \"cozy\" at best. The worst pad thai I've ever had. Why was it pink?.......   :-/"], ["Krista S.", "In a nutshell, good food, great price. More specifically, we had veggie spring roll apps, seafood tom yum soup, curry tofu, shrimp pad thai, and goong pad pla mouk plus white and brown rice to feed 3 hungry meat eating day laborers (I picked up takeout on my way out of work to help with my home reno and I only eat fish (no chicken or red meat) and wanted to try a little of everything).I went inside to pick up my order and to order an additional entree due to more people coming over. I sat at the bar planning to order a drink (and would have if the bartender ever acknowledged me) but, the additional pad thai came out of the kitchen in less than 10 minutes.Food wise: The tom yum was spicy and lemongrassy but great! Curry tofu is ridiculously awesome. The goong thing I can't pronounce was my fave: who knew black beans and calamari would blend so nicely together?! Vegetarians and meat-eaters will both be very happy here. When I got the check, I did a double take $37 for ALL THAT FOOD! I'm hesitant about dining in (although it was pretty inside) but, I will be a repeat takeout customer."], ["Andrea P.", "Consistently delicious, I could eat through the menu in one sitting & love every minute of it! Great flavor, no grease, good food-- it's one of my favorite spots ever! The lunch menu rules, $8 for soup, spring rolls, pineapple & a dish of food-- you can't go wrong.I've been coming here for years & I've always been impressed. Good service, clean & tasty, I hope it never changes...(I currently moved away but still drive for the lunch special)"], ["Shane G.", "Solid Thai food. If you're really craving some Penang Curry you wouldn't be disappointed. Sizzle duck was like the Chinese preparation of hoisin in pancakes. When the guy brought it out we asked to do it ourselves but he said that his boss was watching and would yell at him if we didn't let him make at least one... which sucks but the duck was still reallllly goooood.The Tom Kha Gai was standard, along with the Penang Curry and Red Chili shrimp.  The lemongrass beef didn't have a lot of lemongrass flavor to it. It reminded me more of a bastardized Chinese dish than Thai. The Scorpion Bowl was dangerous. Let's just say we were having a really good time."], ["Byron D.", "Grilled Pork with Pineapple, Tom Yom"], ["Robert F.", "Just went here for the first time this past Saturday night.  From the exterior, nothing special.  The interior is crowded and rather plain.  BUT, the food and the prices are wonderful.  We had salad and a main dish each and it came to under $30 (we are vegetarian so the entrees were only $10 each).  Wait staff was very friendly and accommodating.  Only complaint was that they charged $3.50 for tea - we only ordered for one but they came with two cups.  Regardless, before my wife poured, a waitress rushed over to tell us to wait another minute to let it finish steeping and then she poured it for us, didn't like that it wasn't strong enough looking and replaced it with a new serving.I would definitely return.  I thought the portion sizes were reasonable and priced right."], ["Collin S.", "One thing I've noticed is there aren't a lot of great Thai places in the Hartford area.  Thai Palace is reasonably good and is a decent choice for pick-up.  My wife and I enjoy the Massaman curry, which has good flavor. I've only had pick-up, and every time the food had been ready within the time frame provided.  The staff isn't especially friendly, but they're not rude either.One tip - parking can be difficult because of small parking spaces in the plaza parking lot."], ["Sarah O.", "A friend and I visited Thai Palace on a Thursday evening, and had a pretty average experience. The service was fine-- neither terrible nor spectacular. The hostess (she may have been a manager) made a point to come over and ask how things were at one point, which was appreciated. I ordered pad thai, thinking I'd check out Thai Palace's take on a standard. It was somewhat disappointing. The entire dish had an odd, almost fluorescent orange tint, and there didn't seem to be many ingredients beyond noodles and shrimp and perhaps a teaspoon of crushed peanuts. There is no shortage of Thai restaurants in greater Hartford, so I wouldn't feel all that compelled to try Thai Palace again."], ["F L.", "Second visit:  I'm hooked.  745pm on a Saturday night with only a few tables open. Went out on a limb & tried Lab Gai (T-9) and was very impressed with the combination of flavors & textures.  The menu reflects something like ground turkey with diced bell peppers, onions, cilantro, fresh lime and something else, served with lettuce on top.  Thought the placement of the lettuce sounded strange & it ended up being a typo - this delicious diced-chicken entree was served on top of shredded lettuce.  Ordered it mild with brown rice & Holy cats did my taste buds do a happy jig!!!  The fresh chopped cilantro and just squeezed lime really set this dish off nicely. SOOO wish I had taken a photo of the dish to share, as the presentation was beautiful...the kitchen's dish art of flowers was a classy touch.  Another nice touch are the warmed hand towels that are provided upon ordering to clean hands prior to eating.  Staff was, again, very attentive and accommodating."], ["Grace K.", "Fast service, clean presentation. The portion was good for its price. I would definitely come here again!"], ["Liz L.", "we looooove this place. We recently moved back to the area after two years and the food is still just as great as it was then. I will say that they do not tone down the Thai spice unless you ask when ordering do if you are sensitive to hot spicy then please ask! we love the steamed pork dumplings, the chicken coconut soup to start. I then order the lab gai which is a very spicy chopped chicken with onion, cilantro, jalapeño, red peoper, lettuce and lime juice. it is seriously addicting. I have a hard time stopping myself so I can have leftovers for lunch. My husband orders the mango chicken every visit and also tries hard to leave some as left overs. Staff is friendly and helpful though sometimes service is slow. We don't mind because we are usually busy enjoying a cocktail and/appetizers. This is a once a week (sometimes even more) kind of spot for us."], ["Tianna G.", "My favorite lunch spot!! My girlfriend and I often come here to do business at the credit union, then follow up with a delicious lunch. Their lunch special can't be beat. For $7.95 you get two spring rolls, soup (the Tom Yum is my favorite!) and an entree of your choice from a large selection. For those of you who like a choice, they also offer an upgrade to brown rice for extra. I try to get something different each time I go, but my favorites are basil shrimp or ginger chicken. I've rarely been let down, though I did go with the coconut shrimp once and I won't make that mistake again. The service is fast and though the staff isn't particularly warm or talkative, I've never been treated poorly either. Coming at noon on the dot can be a little crazy though. It's also a favorite with local workers. But even with the crowd, the service is very efficient and you're often seated within 5 minutes."], ["Christopher M.", "The wifesky and I decided to try this place for a Friday dinner.  The place was packed and there was a 20 minute wait which we didn't mind.  At least there was a fish tank to look at while we waited.  After our wait, we were seated.  My wife didn't like the placement of our seating as we were placed by the entrance to the bathroom door.  Not a big deal but I asked if she'd like another seat but she declined.  The waitstaff came immediately to fill our glasses with water and asked for our drink orders.  I ordered a mango martini and my wife ordered sparkling water.  My mango martini came with the napkin soaked and soggy.  What was odd was the waiter when through the bathroom door to get my wife's sparking water.  The bright side was it was a sealed bottle of Voss sparkling water but not sure why he chose to get it from the bathroom.   We ordered pork appetizers - Pork Dumplings which was very tasty and not too spicy, well seasoned, and hot.  Average wait for the appetizer was 10-15 minutes.  Then we ordered our meals.  My wife - the mango chicken and me - the basil chicken.  My wife requested hers have no spicy which they adhered to.  Average wait for he entrees was around 10-15 minutes.  Meanwhile, the noise level wasn't bad for a Friday evening.  The entrees came and were deliciously hot, tasty, and very well seasoned.  Kudos on the presentation as the plates and meals were highly decorated with intricate designs made from syrup of some sort including a sliver of honeydew melon with a Maraschino cherry and sword.  During the meal, the waiter came back to the table, once, and perfunctorily asked if it was okay and walked away with not even a smile.  At the end of the meal, he returned to ask if we wanted dessert but no requests on refilling our drinks.  We declined on the dessert offer.  When we got up to leave, he looked at the tab, then proceeded to look down at the tip which was generous in my opinion, and had a puzzled look on his face.  Then turned to me and said, \"Thank you!\"  I found that gesture of looking at the tab in front of me to be a bit unorthodox and it put me off a bit.  I've given this establishment 2/5 stars not because of the food.  The food was excellent but because of all the little negatives I've described above that all contributed to my decision."], ["Christopher S.", "I went to lunch with my wife and for $8 you get some spring rolls, soup, a main dish and a some pineapple pieces as a finisher.  The drunken noodles were great.!"], ["Nicole B.", "I love this Thai place! Very reasonably priced for the food you get. I highly recommend the chicken curry. I mostly go to this place for take-out. Definitely give it a try if you're looking for a place to order in from!"], ["Dmitri T.", "I love this place, especially for lunch. The menu is very extensive with a lot of choices. For $8 you get a choice of soup, spring rolls and an enormous portion of food. Service is excellent, polite and extremely fast. This makes it very popular at lunch time during the week. It is often almost entirely filled with Indian kids working in corporate IT sweatshops of the area around Bloomfield.Food quality is very high. I am a Tom Yum and drunken noodles addict and both are very, very proper here. Highly reccommend."], ["Dylan B.", "There are no words to describe how good this place is. Everything is so fresh and delicious, and the meats are all high quality. I highly recommend the Pad See You and the Mango Tofu! The staff is very attentive as well. I have never had any problems here and would recommend Thai Palace to everyone."], ["Dan S.", "Terrific Thai food with great service. What more do you need to know? Ok, here's a few more details.  Beef Satay may be among the best apps in the area; meat was really tender and peanut sauce was just right. Fried chicken dumplings came out like good empanadas and vegetable spring rolls had a nice consistency without being too oily.Pad Thai, a dish to compare with other restaurants, was terrific. Sweet without being overly so, it had generous amounts of chicken in it too.  Spicy Maple Chicken was a interesting mix while not being too spicy and the Ginger Beef was, well, gingery.  Service was quick but not overwhelmingly so.  A great place to go in the Hartford area for Thai. Doesn't beat my favorite, Hot Basil, but it is right up there..."], ["Lea Hoss M.", "Had a craving for spicy Thai food tonight. This did nothing to satisfy my craving and I would not go back.  I got the 'Thai palace spicy chicken' and the infamous 'Pad Thai'. The spicy chicken had three stars for spice. Needless to say, the spice lacked so much that I was and able to feed it to my 1 yr old. The chicken was barely visible and tasted like they threw in some asian stir fry mix\"{: and called it a day. Not good.The Pad Thai (with chicken) was a sore disappointment. To start with, it had a weird pink hue to it and a slight rancid smell I couldn't identify. The noodles were so dry that I had to pull them apart. They threw in one old scallion and a tsp of peanuts that had no flavor. Aside from looking weird, the taste was horrible. I had to write this review before I did anything else.  If you are looking for AUTHENTIC Thai cuisine and  or anything close to it....DO NOT GO HERE.  If on the other hand, you are trying Thai for the first time and are scared of spices then this just might be your \"Thai Palace\"."], ["David B.", "We definitely recommend.  Deserving of 4.5 stars.  Good for family and small groups.  There is more booth space than tables, so space can be an issue for larger groups.  The food is very good, drinks are generous portions, friendly wait staff, and it is clean.  Decorations are cool and not overdone.  Our favorite dish is the Pad Thai, and the kids love the dumplings.  Beef chow fun is my daughters favorite dish which she orders each time we go.  We haven't had the deserts, but we admired them from another table.  Looked fantastic, and there were no complaints from that booth.  We will be returning soon."], ["David S.", "This is our favorite Thai restaurant. We travel 25 minutes to get here at least once a month. We always order Shrimp Pad Thai but our second choice varies. They serve a wonderful jasmine tea and their leeche martini is to die for. The service is very good but my only problem is that they are very cheap on the pineapple at the end of the meal. While I usually tip 20% since they only give me few pineapple pieces they get 15%. It bothers me so much. When they serve a special dish with a piece of orange they skip the pineapple completely even when I request it. Their excuse is that I already has fruit with my meal. This is a mistake. We will return because the food and service is so good."], ["Sylvia O.", "Awesome food!! Highly recommend"], ["Mitch S.", "Hi All,Great Thai restaurant for lunch. I go here regularly.  I have had many of the lunch specials and never have been disappointed.   With the lunch special, comes soup.  I recommend the coconut soup.  It is spicy and sooooo good.  The wait staff  has always been quite commendable.  Water is refilled quickly, but not annoyingly.  When we go- 2-4 people- we are in and out quickly.  In fact...now that I am reviewing it... I think I will go today for lunch and perhaps get a check-in (on the rare occasion that it works).I will probably change the rating to a 5 once I go here for dinner.So... GO HERE!- MSZ"], ["Callie F.", "I ordered take-out after reading the good reviews on Yelp.  When I got  there to pick it up (a Saturday night) the place was packed and slightly hectic, but my order was ready soon after arrived.  (After seeing the inside of restaurant and the service, I think I would love to go back to dine-in too).  However, when I got home I discovered the two orders of rice that came with the food we ordered were not in the bag.  When I called they apologized profusely and gave me a free appetizer when I came back to grab the rice.The red curry was excellent and they offer options of brown, white, or stick rice.  I will definitely go back for take-out and will try to get there to dine-in as well."], ["Katelyn B.", "Thai Palace is THE mecca for cheap lunch. I'm a homecare nurse and I needed someplace quiet and calm to sit and do my charting between visits...and I was looking for some good food too. 7.75 for a bowl of absolutely fantastic shrimp tom yum soup with two mini egg rolls, a plate of drunken noodles with tofu and pineapple for dessert...tax tip and all, this was a filling, delicious lunch for CHEAP.What I do have to say is that I made it very clear to the waiter that I like my food blasting spicy--the kind that burns inside out. And what I got was a very mild drunken noodles...so that was VERY disappointing to me. It was enough to knock it down to 4 stars for me...I thought about giving it 3. But honestly it tasted very good even though it wasn't at all spicy, and a little on the bland side...the tofu was cooked to perfection and all the veggies were well cooked through. I would definitely visit here again. Good food, GREAT service...they came and filled my water glass immediately when it was empty. And the atmosphere was perfect for some quiet charting time in my busy day!"], ["Nicole T.", "I love this place.I recommend the following which I tried and love:1) Deep fried chicken wings2) Pad See Ew3) Pad Woon sen4) Spicy Basil Fried Rice5) Sizzle Duck (appetizer) - if u love peking duck."], ["Irene K.", "Thai Palace was a delicious and unexpected treat.  Seeing as to how my Dad will locate the nearest asian restaurant in any town around the globe, this place seemed like the only one that fit the bill with some time to kill before our flight out of BDL. (Quite a drive away, but well worth it)Although it was the first time for me, my family had eaten there once before in the past few days.  The service was INCREDIBLY friendly...the waiter joked about my bf's request to eat with chopsticks and remembered my family from their prior visit.  :)  Although our waiter (Chris) couldn't offer us the lunch special as it was a weekend, he went ahead and gave us a complimentary edamame appetizer seeing as to how much my Mom had liked it during the past visit.  The edamame was fresh and lightly dusted in sea salt.  We ordered Tom Yum soup (cilantro on the side for me and my sisters), Pad See-yew, Pad Woosen, and the Basil Thai Fried rice.  Although the portions seemed small on the plate, it turned out to be more than enough food to feed five hungry adults.  The Pad See-yew was sweet and slightly sticky (just how I like it!) and the basil thai fried rice was fragrant and very tasty.  The spices in the Tom Yum soup were so distinct and flavorful...especially the lemongrass.  Mmmmmm....  Chris surprised us all with a complimentary dessert -- a heaping fruit plate full of longans, pineapple, mandarin oranges, and cherries!Not only is the food delicious, but the presentation is FANTASTIC!  I would highly recommend this to any Thai lover or adventurous local.  You will leave feeling like Thai royalty!  (even though I believe the owners may be Chinese?)BONUS - The bathrooms were absolutely gorgeous and CLEAN!"], ["Dan S.", "Very good and lots of fun.  They have Sake bombs on the menu, so I had to try.  The waiter came over and set up the chopsticks on top of the glass and everything.As for the food, it was awesome.  I'm not a big Thai fan but this was very good.  The service was friendly and timely."], ["Natashka M.", "I love everything about this place! Great food. Beautiful presentation. Friendly service."], ["Mike B.", "I love this place!  The food is terrific and the service is great!  How many times have you gone into a Thai restaurant and they are very willing to find your perfect spicy taste?  So many Thai places it's either \"burn your mouth off\" or  very bland.  I love spicy and this place will listen to you when you tell them exactly what you like and will make it that way!  Outstanding soups... and a great full bar.  Excellent take out as well.  If you're a Thai fan - put this one on your list!"], ["Lauren B.", "My boyfriend and I decided to try Thai Palace this weekend since we recently tried Thai food for the first time. We walked in and continued to stand at the door, waiting for someone to seat us, for about 5 minutes. An elderly woman with a walker and what looked like her daughter walked in after us. Finally, the hostess came to help us and told us, \"They go first,\" and seated the elderly woman and her daughter. We were a little puzzled since we had walked in before them, but maybe they had put their name in ahead of time or something. A little more explanation would have been nice. We were seated and put in our orders. Our soups came out pretty quickly. I ordered the Thai Chicken Noodle Soup and my boyfriend ordered the Tom Kha Gai. Both were decent. While waiting for our meals, we kept hearing a creaking sound and couldn't figure out what it was. Finally we realized that it was the large picture above us - it seemed like everytime a door opened to the kitchen, the picture would move and creak. Kind of creeped us out a little. Our meals were brought out - Pad See Yu for me and Pad Thai for him. We were both a little surprised, as the portions were a little on the small size. But for $8.95, that's what you get. My boyfriend ate all of his noodles but felt that his chicken seemed a little processed. My meal was yummy and I won the clean plate award this time. While we were waiting for our check, some commotion happened at another table closeby. A group of older people had received their food, and apparently they had ordered something else that was taking a bit longer to come out. The waiter told them that it would be out soon and the crotchety old man said, \"Tell him to keep it\". The waiter went away and came back 5 minutes later with some type of fish dish that had such a nice presentation - he brought it to the table steaming hot and the shouting began - the man said, \"Take it back, I don't want it,\" and his loudmouth wife has to chime in and yell, \"He can't eat it, he can't eat it\". The waiter even offered to give it to them for half price, but they refused it. Now...I know that it's poor service to have part of your meal come out later than the rest of it, but if you could see the work that was put into putting that meal together, most people would have still taken it. My boyfriend and I almost told the waiter that WE would take the fish for half price! I was sure to shoot the wife a dirty look on our way out.As for going back to Thai Palace - we would probably go back if we wanted thai but didn't want to drive far to get it. Since we've only had thai twice, we don't have much to judge it on, but I think this place is second best compared to the first place we tried."], ["Casey P.", "What a surprising little place! We walked in to grab the take out we had ordered, and almost sat down to eat there. Snazzy interior, and Wednesday night they have a live musician. Huge portions for the price - a friend and I split an order of pad see eiw, had seconds, and then still had enough for leftovers.I wouldn't say the flavors in their dishes are outstanding, but the food is not bad and the vegetables look fresh.Avoid the dumplings - a bland chunk of chicken wrapped with a flavorless, pan-fried dough. Is this not a chicken finger, instead?"], ["Tiffany T.", "Hair in my food...I've been here many times as there is nothing else around.  They have great lunch specials and fast good service.  You get spring rolls, a soup and the entree for less than $10.  The pad see ew and drunken noodles are good.  Their pad thai is NOT!  Very soggy and artifically orange colored. The stir-fry dishes are too salty.  I have not tried the curries, so I can't comment.  I only come here for lunch, b/c the dinner menu is a bit overpriced for what you get.  The place is elegant, but again hair in my food sorta takes all of that away."], ["Brolee K.", "I just got some take-out a few hours ago and was quite pleased yet again. I've gone out for lunch and dinner here a few times and enjoyed the food and service. I love that they start the service with a hot towel--it just sets the mood for the meal. I'm a fan of their tofu/bean curd dishes and really enjoyed the mango tofu. Their steamed dumplings are delicate and perfect as a starter. I've also tried their mango martini and lychee martini, both were yummy and strong. The pad thai is average but hits the spot when craving noodles. If you're looking for spice go for a basil dish and ask for it spicy."], ["Peter D.", "This was my first time here and the service was great. I got to try quite a bit of things by tasting all of my friends selections and I have to say you probably can't order something bad here!  I had satay, Thai calamari, chicken panang curry, spicy chicken with brown sauce and crazy squid. I could go on and on about how everything tasted to try to convince you to come here, but bottom line, all the great reviews are there for a reason. If you like Thai food, you will be a regular. I'll see you there."], ["Michael R.", "Awesome lunch specials! I order lunch from here once every couple weeks, and everything I've tried was excellent. The lunch special comes with 2 mini spring rolls with dipping sauce, a choice of soup, and the entree all for about $8. The portions are generous too. Go for the Tom Yum Goong soup... You will not be disappointed. It's the best I have had after trying it at many other restaurants. It has a perfect mix of sour and spicy and comes with 2 shrimp. Love the cilantro flavors too.The entrees are all excellent. Some come with rice and other with noodles. The noodle dish portions are a especially large. The spicy chicken is great.... lots of hot chili pepper flavors. All of the curries are phenomenal (go with the Panang or the Green Curry) sitting in a well balanced coconut milk sauce that has just the right amount of spice and curry flavor. The Gai Pad Prik King is really good if spicy chicken and string beans are your thing. The Thai Rice Noodle dish is also fantastic, plentiful with chicken and shrimp. It's hard for me to find anything negative with the food, but the only think I can think of is the side of fried rice that you can choose with your order. It's good, but it just has certain taste that gets to me. The inside is pleasant with some Thai art work on the walls and a big aquarium where you wait to be seated. The service is good and the staff is very friendly. Lunchtime can be very busy, but they are good at getting people seated promptly."], ["Garrison A.", "This place is great.  It was my first experience with Thai food, and I enjoyed it very much.  It is a clean, medium sized restaurant with nice wait staff.  I had the Crunch Peppered Chicken and it was amazing.  If you like spicy food then I highly suggest that dish."], ["Jill K.", "Found this place while in Windsor on business, and was glad I did.  When I travel alone, my MO is to order many things and then take my leftovers back to the hotel for later noshing.  So...I first ordered Tom Kha Gai; I can't go to a Thai place and not.  It was not a very sweet or thick soup (not necessarily a bad thing); more on the salty side.  Slightly lacking in galangal flavor, but it was still tasty.  Good quality chicken in there, along with red peppers and mushrooms.  I couldn't find any chunks of galangal or lemongrass in there, and the broth wasn't too heavy on those flavors.  (Many places pick those out of the broth for you; I'm a freak who likes to nosh on them.)  Next, I ordered the Som Tom, which had terriic flavor, but more lettuce than green papaya.  Also came with lots of beautiful shrimp on top.  I would get this again.The Thai Iced Tea was kinda meh; I've had better.   (But mediocre Thai Iced Tea is still better than most things in the universe...)For my entree, I ordered a chicken and peanut sauce, which was a refreshingly human-portion and priced accordingly.  It was satisfying, but not life-changing.  I didn't order dessert, but with the check they offered a small plate of fresh pineapple and melon; very delightful.All this food was about $25.  Best of all: They didn't make me feel like a doofus for eating alone."], ["John O.", "Good food , reasonable prices,lunch special is very good value for the price but service is horrible at times,if you are not  white, wait staff is going to be cold to you."], ["Bryanna H.", "Thai Palace is by far the best Thai food in the Hartford area.  Great food, great service, great presentation.  I haven't had a bad meal either take out or dining in.  They are very friendly and very accommodating."]], "Mei Tzu Sushi Bar & Kitchen": [], "Thai House Restaurant and Sushi Bar": [], "Siam Hartford": [["Karen W.", "Delicious food, excellent and personable service -just like Glastonbury ! So glad they have another location! And look forward to even more! Will be back to one of the locations very soon!"]], "King and I Thai": [], "Puket Cafe II": [], "East West Grille": [["Steven R.", "Visiting from Texas and decided to try this place out with the grandparents, who tend not to like eating out and are very picky when they do. This was out of their comfort zone but I figured Thai food is pretty consistent and persuaded them to give it a shot.Their first comment on walking on was about the decor and ambiance; it's reminiscent of a 50's-style diner and they really enjoyed the throwback aspect of it.The service was great; they brought out rice cakes for the table and the appetizers were quick. The Tom Kha soup was a hit, as well as the edimame and tofu satay.On the entrees I tried the pumpkin curry since that's not something I'm used to seeing at Thai restaurants. It was great! The other entrees were all satisfying as well. I personally though the sweet and sour stir fry was as little too sweet - ketchup??? - but it was absolutely devoured by the person who ordered it, so I guess I can't complain.All in all it was a great experience, and if the grandparents leave happy, that's worth 5 stars in my book!"], ["Margaret G.", "While visiting CT for an event at the CT Convention Center my sister and I decided to have dinner in Hartford before heading back to RI. We searched Yelp for a place nearby and East West Grille came up. Pulling up to the restaurant you stop and think \"Is this the place?!\". It's an old diner. From the outside you would never in a million years think this was a Thai restaurant. And then you step inside and that million years turns into a billion. It's still set up inside like an old school diner. Vinyl booths and stools at the counter and everything. The place was almost empty and from what I gleaned it's more of a takeout restaurant on Sunday than eat-in (a lot of people calling in for take out). Our waitress came right over with menus and took our orders. We chose a couple appetizers (chicken satay and curry puffs) and our entrees (chicken pad thai for me, the seasonal pumpkin curry for my sister). Everything was delicious. I live for a good peanut sauce and theirs did not disappoint. The jasmine rice was fluffy, the coke was cold, the curry was perfectly seasoned and my pad thai was flavorful. We both had lots of leftovers and the prices were spot on. The space is a bit cramped but everything was clean and the service was good. The diner atmosphere throws you off a bit but it is awesome at the same time. I would definitely come here again the next time I'm in town."], ["Nora F.", "Cute dinette staffed with family and friends who make beautiful food and patronized by people who understand perfection. Things I love about this place include the basket of shrimp chips, either one of the tom yum (Cambodian is a little sweeter, has pineapple in it), the sai ghock with sticky rice and hot sauce, the crispy rice salad that I can only find in one other restaurant in Queens, green curry, Beer Laos, Thai coffee, the love I get whether I come alone or with someone, and those sweet leatherette booths. Ingredients are plentiful and fresher than elsewhere, vegetables, meats and herbs. Blah blah blah \"been to Laos and it's the real deal\".. it is though, and it's clear everything is prepared with great pleasure and reverence for the cuisine."], ["Slaine F.", "Headed out to breakfast and wanted something a little different.  Well, East West Grille delivered on that front.  I always knew them as offering decent Lao and Northern Thai fare -- the girlfriend spoke pretty highly of them.  However, I stumbled across their breakfast menu and that made me drive out to West Hartford to give 'em a shot.  The Good:Great selection on the menu -- They really cover all the bases with a melange of american, mexican, and lao/thai fare.  We opted for those items we couldn't get so regularly, and ordered some Banh Bao (Big steamed buns stuffed with pork, shitake mushroom, chinese sausage, and a quail egg) and Sai Oua (Lao pork sausage with lemongrass, shallots, and other flavors).  The Banh Bao were huge and delicious, especially with a little soy sauce -- that saltiness really helps bring out the other flavors and blend with the slight sweetness of the bun.  But the Lao sausage -- oh the sausage!  It was melt in your mouth delicious.  How often can someone say that about a sausage and not mean it in a lewd way?Service was prompt and attentive.  No complaints.  The Bad:The place is a little cramped.  Its very small, and they pack people in fairly tightly.  The Ugly:It looks like an old diner and could use a little updating.  I adored my breakfast and cannot wait to go back. I may also have to come back for some dinner while I'm at it."], ["Nisha H.", "Stopped in for breakfast on Sunday morning on our way to shop. Just me and the little guy. It was already busy and had wait out the door so we opted to sit at the counter. It was nice to sit at the counter and watch all the cooking and the craziness of a busy place. Although it may look little chaotic, all the worker seems to be working in rhythm and get things done. Now the food, the menu is expansive with American food, Asian fusion and Asian breakfast. Of course we opted for the Asian. We had the Bahn Bao, Shrimp Shumai and Chicken Noodle bowl. We loved it all, Bahn Bao was served cut in half and grilled which really brought out the flavor. Shumai was good, and the noodle bowl was also good. The broth was nice and light and nice chicken flavor. Saw so many different things that we wanted to try out on the menu so we will be back."], ["Na-Ne N.", "This is a strange place ~ it's Thai food in a 50's diner. The service, while sweet, is extremely aloof.  It's pretty much always the same waitress who looks like she's taking your order in between naps and magic smoke breaks.  There is little to no atmosphere here. The drink selection is sparse and standardly crappy. But I digress. I will keep coming back here because the food is seriously rocking. The drunken noodles, pad thai, tom yum and tom kar soups are gloriously spiced.  I really want to try the rest of their giant menu."], ["John L.", "Been here dozens of times, the food is fresh & spiced to your person taste.  The atmosphere is a cool jive of diner & Asian decor.  Fresh herbs & spices grow around the exterior and the beer / wine cooler stocked.2015-10-08: Grandma \"East West\" was in the house! Everyone working Calle her Grandma - very cute."], ["Amanda L.", "I always passed by this little diner and never forgot it because of the countless number of plant and herbs placed in the front. I finally got the chance to try the place and I'm a fan! Absolutely friendly staff who care about new customers and their regulars. One of the workers even made the time to strike up a conversation with us. The windows dressed in Laotian drapery really gives the place character.Serving not only Laotian, but American, Cambodian, Vietnamese, and even Mexican! This place has a big menu selection. I came in for breakfast hungry as a lion and ordered the...EGGS EAST COAST English muffin or bagels topped with smoked salmon, poached eggs, hollandaise sauce, and a touch of caperAlso with a side of hash and salad.RATE: Good! I got exactly what I ordered, cooked to perfection.LAO STICKY RICE TOASTSeasoned & grilled sticky rice coated w/ egg. Side of seasoned soy sauce.RATE: Love it! Basically a thick pan fried rice patty. For those who aren't familiar, don't be fooled by the name (no bread!)MIMOSAS (W/ PROSECCO)RATE: Love, love! First time and I'm already a fan. Orange juice and champagne with hint of procecco. What is not to love?Other recommendations:STEAK SKILLET  Chopped steak, shredded cheese, pork green chili sauce, tomato, onions, peppers and spinach.VEGGIE AND CHEESE OMELETTECOCONUT WAFFLE ...special item not on menu made by the owner!Belgian style waffle flavored with coconutCINNAMON RAISIN TOAST Thank you East West Grille! You really know how to satisfy your customers!"], ["Jesse N.", "Went here the other night, and it was probably one of the most disappointing meals I've ever had, if not the most disappointing Thai meal. There have been very few times in my life that I haven't finished a restaurant meal, and this is one of them. My gf and I barely made a dent in our food, and it came down to little details.Basil Fried Rice - this dish was completely devoid of any basil flavor, and the fried rice itself did not have that \"wok taste\" that you can only get when making fried rice on a restaurant-grade pilot-light stove. It also had string beans and corn, which is beyond me. Basil fried rice is suppose to be full of strong, potent, SPICY flavors and this had none of them.Pad Thai - this was one of the worst pad thais I've ever had. The red hue of the pad thai leads me to believe that they used ketchup as a sweetener, as opposed to sugar. This is something that some street vendors do in Thailand when making pad thai, since sugar is more expensive. It's beyond me as so why they would apply this technique here. This dish was completely one-note, and the shrimp was also overcooked.Massaman Curry - this dish was the least disappointing, but it was still so weird. There were bamboo slices in it (which I've never seen in a massaman curry in my life) and the potatoes used were red potatoes, skin on. The curry itself tasted like massaman, but again, one-note, weak seasoning and the addition of the bamboo/red potatoes was just weird. They didn't taste right and the potatoes didn't really seem to have absorbed any of the curry flavor, like they were tossed in as a finishing ingredient.Basil Fried Rice, Pad Thai, and Massaman Curry are my holy trinity of how I judge a Thai restaurant. I am Thai and my family has 30+ years in the restaurant business. On the level of both authenticity and quality, this was just poor food. I have a huge amount of leftovers that I don't even want to touch, which says a lot, because I hate wasting food.I will say that the Thai pupu platter was pretty good, and it did set my expectations high for the entrees, which made this extra disappointing. Top it off with a restaurant bill of $80 with tip, and I'm at a bit of a loss. 1 appetizer + 3 entrees and an iced tea at that final price just seems insane. I've been to the best Thai places in LA and NYC, and I've never even come close to that price for what I ordered.I'll also add that the service was fine, no issues there.I had really high expectations when seeing the 4 start yelp reviews, but I'm getting the feeling that most of the reviews were for the American style brunch. Either way, I won't be coming back. I still can't believe how bad/disappointing that meal was."], ["Jess L.", "I came here for dinner with a friend on a Wednesday night. I was immediate charmed by the old diner feel with Asian flare. Very unique and fun. There were only three or four other parties there at the time. Our waiter and waitress were witty, funny, not encroaching - added to the full experience.Coconut shrimp and tofu skewers were good, didn't blow my socks off but did the trick. My main dish, Raam, had a decadent and delicious peanut sauce and ample veggies. There was definitely enough to make this two meals worth. My friend got the red curry, which was also solid.Solid beer selection too! Includes Sierra Nevada, Naughty Nurse, Singha, and Stella.Really great experience overall. I cannot wait to come back!"], ["Thien N.", "Specializing in Laotian food, I've never had the opportunity to try any of their fusions. So full disclosure: It's been strictly breakfast and brunch for this guy!All breakfasts are served with savory home fries with a touch of sweet potatoes and are accompanied by your choice of bread and eggs. Their 3-egg omelettes are decent. I go for the \"build your own omelet\" ($5) Additional toppings are .50 cents and it's usually a good portion. I haven't sampled their breakfast sandwiches, but they are generally less than $5. Try the whole hog burrito; with ham, american and laos sausage, and bacon - it's a meat-lovers dream. The steak and veggie burritos are pretty good too. My personal favorites though are their skillets, especially the Idaho and East West Skillet! Just the right balance of crispy, salty, and flavors -- these platters are a great start to any morning. They also make home-made pancakes, waffles and french toast too.Though the breakfasts are tasty and very affordable, there isn't anything particularly South-East Asian about them. In fact, it's more of a traditional American breakfast. But what's so bad about a well-made breakfast right?! Parking lot is small so plan accordingly to avoid the line or getting jammed-up! Otherwise go hang at the bar, and stay awhile!  Tue-Fri, 11am-10pm Saturday, 8am-10pm Sunday, 8am-9pm Monday, Closed"], ["Tiffany G.", "I heard great things about this place for years, and finally made it in! Everything tasted great, from the hot tea to the Satay we started with as an appetizer. Both the Pad Thai and Pad Kee Mao (Drunken Noodle) lunch specials were great. The soup and salad that came with the lunch specials were delicious too. The only negative thing I have to say is that some of the pieces of chicken seemed to have a tough strange texture, like maybe they were frozen or something? Not sure, but I will definitely be back to try it out again, the flavors of everything were amazing, there was just a strange texture in a couple of bites, but I'll definitely go try it again and perhaps try a protein in the dishes other than the chicken."], ["Jared K.", "East-West Grille is a gem of a discovery we made en route to NYC from Boston. From soup to Laotian Cornish Hen, this is the real deal. The The Gao Lao Laotian Beef soup was a great start. Presented exquisitely, the taste was even better. So glad that my wife and I split a large.  The Beef Salad was amazing.  Great blend of flavors with a little kick of spice. The lime cilantro  was a great complement to the tender pieces of beef.  The Yarng Kai Noi (Laotian Cornish hen) was a great call. The chicken was juicy and flavorful served right on the bone.  So glad we decided to stop here.  Highly recommended."], ["Kelly L.", "The East West Grille is located in a 50s style diner on New Park, but the food is far removed from diner fare. East West features dishes from Laotian, Thai, and Vietnamese cuisines. They have an extensive menu that is sure to please anyone. I usually stick to the Laotian or Thai options. I've had a variety of curries, Thai Basil, Pad Sriracha, and Larb Gai; everything has been excellent. All dishes are made with fresh ingredients and are impeccably spiced.  The cooks are happy to adjust the levelof spice to your palate. The servers are attentive and the food typically comes out quickly. They have great lunch specials that will keep you full till the next morning. Here's the game changer- they serve breakfast on the weekends!  They have the typical eggs, omelettes, and pancakes, plus Asian style breakfast. The Huevos Rancheros with Laotian sausage was to die for. I wish Yelp let you do half stars, because I would give it 4 1/2. Whether you come for breakfast, lunch, or dinner, the East West Grille will make your belly happy."], ["Liz L.", "A 1950s chrome diner meets Thai restaurant. This place is adorable.Found this place passing through Hartford. We had been traveling all day and were starving - and to our delight/surprise, the food was prepared and brought to the table in under 10 minutes.I can't say it's the best Thai food I've had, but it is tasty. Got the pineapple fried rice which was good, but made with frozen veggies which were not up to par with the other ingredients in the dish. Pad thai was pretty solid. Generally good food, fast and friendly service. Would recommend if you're in the area."], ["Phil A.", "Absolutely delicious food for lunch. We had the lunch tray, and the beef salad. Both were excellent, prepared with fresh ingredients. Decor is fun, hip, and trendy.  Service was horrible. We had to ask for everything. Otherwise, this review would be five stars."], ["Mai F.", "My all time fav is pad sriracha! If you like drunken noodles and want to try something new but still have something similar, pad sriracha won't disappoint you. Pumpkin curry is my another fav - def try purple sticky rice if you're into trying new things. It comes in a little tiny adorable rice container. My favorite appetizer is chicken curry puffs. They come with peanut sauce. So delish. They also serve amazing breakfast, both American and Lao/Thai. I had rice porridge, was pretty good. The staff are very attentive and usually there isn't any wait unless on weekend nights. Love the atmosphere too! Cheaper option than Blue Elephant Trail, for sure and I have not been disappointed every time I come here."], ["Katie H.", "What a trip. Imagine a funky Thai place serving traditional Thai and Cambodian dishes housed in an old 1950s diner and you have this place. We couldn't get over the culture clash, but it's an instant conversation starter, and the place has its own quirky charm. The food was pretty good--not standout Thai food in an area with a lot of Thai restaurants, but still a good meal. I had the larb gai, which was refreshing and very light. I don't think I would order it again, but it's more to do with the fact that I've never had larb before and I don't think it's my cup of tea. My boyfriend ordered the yarng kai noi, which was a barbecued cornish hen. It was tasty, but could have used more time marinating since the flavors were a bit subdued. We were also hoping for  a bigger portion size. There were two pieces of chicken on the plate, and my boyfriend has a big appetite, so unfortunately, he was still hungry. The highlight I would say is the sticky rice that came  with both dishes. I absolutely love sticky rice, and it was steamed perfectly with the perfect amount of chew to it, coming out in the cutest bamboo containers. My boyfriend's mom had the pad thai, vegetarian style. It was actually my favorite dish. It's one of the sweeter pad thais I have, but it was certainly flavorful, and I would order it if I came here again. For an appetizer, we had the Vietnamese fresh rolls. Not the best I've had and not worth the money. If you're in the area, you'll definitely get a good meal here. It's honest, well-prepared, authentic Thai food served up in a really unique setting. I'm hoping to come back sometime to try the breakfast!"], ["Rob M.", "A very interesting place. An old Fifties-era diner car converted into an Asian Fusion restaurant. What's not to love?I arrived for lunch. A full parking lot, but not nearly a full dining room. The service was prompt and attentive. Kudos for that. The menu is extensive, to say the least. Lao, Thai, Cambodia, Vietnam...if you like East Asian food, this is the place. I had to brush off the server a couple of times just because the menu offered so many choices. I eventually ordered a small beef soup app, only to kick myself because I wanted to try the calamari. Soooo many choices!The beef soup was awesome. It was essentially Pho Tai without the vermicelli. The broth was light and flavorful, not fatty. The flank steak was perfect. Just nothing bad to say. Loved every spoonful.I finally decided upon a Pra Prik seafood dish, as I was informed they could not prepare the Pra Prik bass -- they only had tilapia (from Walmart, or BJ's down the street, I assumed). The Pra Prik seafood was delicious. With some caveats. First of all, they threw in some interesting ingredients. Obviously canned smoked oysters. Totally threw off the flavors of the rest of the dish. Then there was the fake pink \"crabmeat.\" C'mon. You only have to throw in a few chunks, how hard is it to buy real crab instead of that pollack mash-up? But there were nice calamari rings, scallops, and plenty of fresh locally-sourced veggies (at least, according to the table cards touting farm-to-table ingredients). Be aware: my Pra Prik was listed as THREE hot chili peppers. The hottest on their menu. I barely broke a sweat. It was a bit warm, but nowhere near three-star territory. If you like true Thai-style food (or Laotian) make sure you ask them to kick it up a notch. Overall, a true gem, and I will be back. There are so many great dishes on the menu...I can't believe it took so long to \"discover\" this place after driving by it so many times. Yay. I'm a fan."], ["Gladys M.", "Service is fast although they don't check up on you too often while you eat. The food is super amazing. I take my coworkers here all the time and get them hooked on it as well. I always get the Chicken Pad Thai and Lao Egg Roll with their awesome delish sweet chili sauce! It really is a gem."]], "Siam": [["Cryssa B.", "Pretty good Thai for decent prices.  I listened to the reviewer who said to order over the phone as prices would be cheaper and they definitely are.  I saved about $15.  Delivery didn't take too long and food was good.  Dumplings and noodles were what is expected from Thai food but could be a bit more flavorful as I felt as if something was missing.  Maybe they needed a bit more of a kick.  I've only ordered from here once so I plan to try it again and try out some different things.  Overall, I recommend if you are looking for some decent Thai food."], ["Vil M.", "Eat in lunch and dinner pre-fixe menu, great deal and great selection.  Love their Pad Thai."], ["Dave G.", "Really really like this place.  It's tucked away in an unassuming location next too Whole Foods, but don't let it get overlooked!  Great addition to the restaurant scene in town.I'm not going to pretend I'm a Thai expert, but everything I've tried here has been fantastic.  The Emperor Chicken, especially, is a must have (if you don't mind some kick).    I had tears in my eyes while eating it today, but they were tears of joy.Get after it!"], ["Robo T.", "I checked out Siam because I was in the area.  The restaurant is nice and is decent sized.  The staff were very efficient and friendly.  Now lets get to the good stuff...On the appetizer side I had the grilled pork skewers with nam chim chaeo/nam jim jaew (choose your transliteration).  I have had this (moo yang) before at many thai restaurants along with the traditional sauce.  The pork was tender.  The jaew was okaaay - the flavor was in the right neighborhood with the nam pla, lime, chili but it didn't have the toasted sticky rice flour or dried chilis in it.  I imagine most people dont care though.  I also have had the chicken satay with peanut sauce.  The peanut sauce is weird.  I'm used to the usual thai peanut sauce that is the usual unsweetend peanut butter, red curry, coconut milk, vinegar etc etc and ends up with the oil on top.  This peanut sauce had no red curry at all - it tasted like peanut butter mixed with too much coconut milk to the point where it was thin and runny and had no zip.  The chicken skewers were well marinated and tender.  The cuts were thicker so they were very filling.I had the \"traditional thai chicken\" which is a ka prow/gra prow/gra prao.  The flavor was good and the dish had a very nice heat level.  The down side was that It did seem to be a lot of dark meat and some connective tissue.  i prefer the dish when its made with white meat.  Clearly, for me, there are ups and downs here.  I acknowledge that I'm picky about things that other people dont care about.  Ultimately its definitely worth a try.PS  - the pineapple sunrise smoothie is yummy!"], ["Judy L.", "Tammy and her daughter are always there when we go there for dinner. Many occasions with friends and ourselves. Let me recall what we had. We go there more often during summer though. I love the curry dishes, Siam noodles, a special item of steamed rice. I always look forward to trying new items on the menu. When we got sick, I ask for chicken rice soup. It's my comforting soup to go for. The staff are always efficient and courteous. The plum wine is delicious. Keep up the good job. We love your food."], ["Robert G.", "I have been there a couple times.  Sampled several dishes.  I know Siam has gotten some very good reviews, but I would rate the food as unimpressive.  The service was good, but I think the staff should not be wearing jeans if they want to maintain an upscale image (and price)."], ["Laura F.", "Another good dining experience courtesy of groupon.  Siam is one of those strip mall hidden gems, located right next to Whole Foods.  I drove there with fingers crossed for a full bar, as I was really in the mood for a cocktail; I was pleased to see that they had one but even more excited to see they make Lycheetinis.  My favorite!  This delicious drink that I love is not made everywhere, so I get really excited when it is.  Theirs was as good as ones I've had at Feng or anywhere else, and my dude had a nice Pomtini.  The server even waited for us to take a sip and give our approval before walking away.We started with veggie spring rolls, that were your standard crispy fried rolls filled with cabbage and whatever else, with a sweet carrot dipping sauce.  My dude ordered the tofu pad thai entree, and even though pad thai is also a classic staple, he thought it was one of the best pad thai dishes he's had in a while.  I, in the mood to go rogue, ordered Tofu Rama, a dish I've ordered maybe once in my life.  The peanut sauce was rich and flavorful, delivering a slight kick on the finish.  I could have saved enough to bring to work for lunch, but wound up devouring the whole thing.The service was friendly and attentive, but there were only a handful of tables.  I'd lean towards giving 4 stars, but there were 2 or 3 pesky fruit flies buzzing around us while we were eating.  I know things like this can happen in restaurants (and sometimes my own kitchen), and I'm not going to make it into more than it is.  But, it was annoying and did take away from the meal a little.Overall- above average food, reasonable prices, good service.  I'd recommend checking it out if you're in the area."], ["Maggie K.", "The very first time dinning at siam was this past Sunday for dinner. I din't know there existed Thai restaurant in Glastonbury. It was close to close time when we entered and hardly there was just one table occupied. The staff was okay with service, it was a little slow. Din't like the attitude of the waitress dealing us. The orders taken were so delayed, we almost waited for 20 minutes even though we knew what we were to order. Then I ordered yellow curry and my hubby ordered thin noodles.The food was delicious had every bit of thai flavors in it! Had loads of veggies in both the dishes. The portions were good. To top it off we ordered a portion of thai fried banana with ice cream.This place works for a romantic date, large groups and its right next to the whole foods.Expecting good service in the near future, then I might update them to 5 stars :)"], ["Marleena C.", "Yes, YES, A THOUSAND TIMES YES!!! I love this place!! The service, the atmosphere and most importantly the food! I have not found a place comparable to my favorite Thai restaurant Somewhere in Bangkok and now I have!!! This place has GLORIOUS drunken noodles, fabulous spring rolls, yummy mango sticky rice and fantastic pineapple fried rice. SOOO GOOD!!! I was VERY impressed and I will be back again soon!!! There is still a bunch of amazing looking items I want to indulge in!!!"], ["Carol M.", "Stopped here for take-out a couple of weeks ago and was very pleasantly surprised at how quality the ingredients and delicious the food was.I had the Pad Woon Sen with Shrimp - the shrimp were large and the order included a decent amount of them. The vegetables were still a little crisp, not overcooked as can happen pretty frequently in the world of take-out noodle dishes. I also had the green lover - sauteed bok choy, broccoli with mixed vegetables - again, the vegetables retained their bite and it wasn't over sauced or soupy.I plan to head back and sample more of the menu for sure!"], ["Dennis U.", "I have eaten here several times in the past but I have to admit my most recent visit blew my socks off. I came looking for a Hot hot pork salad which was my favorite at the Thai restaurant that was here. Bummer, nothing like it on the menu. OK I'll try the Kua Gai, I've never had it before.....WOW....Tender pork slices, smoky rice noodles. It was so good that I nearly licked the plate. Now my biggest problem is to try something else on the menu. Nothing fancy here. Pleasant efficient service, a very good Thai restaurant in Glastonbury. I'll be back."], ["L. R.", "Picked up takeout for the family a couple of weeks ago.As soon as I approached the door and saw the huge Groupon warning taped unprofessionally right in the middle of the glass door, I knew I was paying too much for the meal, as I didn't have the discount.For the price I paid, the servings were adequate and the food quality was \"okay\".  There's nothing extraordinary about this place and it's pricey for the serving size and food quality.  Flavors were okay - nothing too spicy and nothing too memorable.I picked up takeout around 6:30 pm mid-week, the restaurant had 4 tables seated, yet the food court in Whole Foods next door was jammed.  Between that and the Groupon offers, those are signs that you can probably do better.I doubt we'd be back, particularly after seeing the Groupon and the prix fixe menu which wasn't  offered to my husband when he ordered, despite ordering the same items available on the prix fixe menu (which is available for takeout)."], ["Chris A.", "This is my choice for Thai food in Glastonbury.  They have different levels of spiciness, and they are very willing to alter meals to the specifications of customers.  There is nothing to complain about here -- a very solid establishment."], ["Ronald S.", "was this called something else before? i dont know but i think i wrote a review for this and it is missing or maybe its a new business. anyways. whatever.Siam has a pretty big menu featuring the standard Thai foods as well as some things i hadn't seen before. We started with papaya salad that was pretty good and had some noodle thing i can't remember which one. Conveniently located next to Wholefoods so if you want to eat before you grocery shop, its right there .. Curries sounded good but most had fish sauce. If you are veg*n ask if your dish has fish sauce because what we ordered didn't say fish sauce on the menu but when we asked they told us it did have it and they were able to cook it without the fishy.Weird fireplace lounge area with a desk in the back of the restaurant."], ["Rocco M.", "Better this time around... we will return, hopefully they will keep improving!"], ["Marji F.", "My husband and I love Siam. It's quiet and pretty inside, and the food is consistently good. I've noticed that everytime I order the same thing, it's prepared differently, but it's always delicious. I love that they offer brown rice. Great variety in the menu, too. The only complaint I have, is that one day when we went, the hostess that seated us was about 10 (prob the child of the owner) and wasn't wearing shoes or socks. Seems a bit unsanitary to me... But maybe I'm being too picky..."], ["Karen W.", "Delicious food and friendly service. We are \"regulars\" here. Siam has never failed to please."], ["Al B.", "Great food selection...good atmosphere in G-bury area"], ["Stefanie J.", "EMPEROR CHICKEN! What an unexpectedly fabulous dish. Flavorful with the perfect amount of crunch. Also, Tom Yum soup here is right on with an ideal amount of spice. Friendly service, big portions, tasty food. You can't really go wrong. Love!"], ["Michelle E.", "My only regret is that I didn't find this place sooner. Everything I have ordered has been delicious - Mango fried rice, tom yum soup, drunken noodles... The list goes on! If you like Thai, you won't be dissatisfied. Authentic and scrumptious! Great little hidden spot with a nice ambiance, which you wouldn't expect given its plaza location."], ["Lee S.", "Average Thai. Clean inside, friendly staff"], ["Julie H.", "Love the curries! My favorite Thai restaurant in the area!"], ["Jordan B.", "Ate here once before; food was unimpressive, but I'm a sucker for Chicken Pad-Thai and I was willing to give it another chance. (They'd apparently never heard of Cilantro or lime/lemon juice...LOL)...but who knows! Every cook is different, I'll give it another shot!Bought a Groupon to come here for $12.50 for $25 worth of Thai food. As per the agreement, I showed them the document BEFORE being sat down for dinner, and I adhered to the terms of the agreement. At the end of the meal; KNOWING that I wanted to use a groupon, they came and told me that they weren't accepting it- but wouldn't clearly explain why? Terms were 2 people, $12.50 for $25; I ordered two entrees plus drinks- ate one, my date picked at hers, and we asked for it to go. They said only *I* ate, so therefore they wouldn't accept it. Bill was well over the $25- and now they didn't accept the Groupon. Chattered at me in broken English; and were completely unseeing of any point of view but their own- I have never had to FIGHT to redeem a Groupon before. Not only did Groupon hear it from me, but I'm smoking this place on TripAdvisor, Yelp, Yahoo local, you name it. This is NOT how you win customers. Almost all of my YELP! Reviews are good ones; this is one of the few AWFUL ones."], ["Mary Z.", "Had a groupon so went with a couple of friends.  There was a price fix menu for $18 and it had a good selection (soup, app, entree and ice cream). I would definitely go again groupon or not."], ["Jennifer V.", "Siam is a great place for Thai food whether it is eat in or take out. I was pleasantly surprised that the food is significantly better than its predecessor Bangkok Spice. I am somewhat of a Thai virgin, so I normally stick to the basic pad Thai or a variation of fried rice.Strengths:The portion sizes are huge, definitely enough for 2 meals. The quality of the food is very good and non greasy.  The dishes are prepared to order and they do not have any problem adding or decreasing spice. The eat in experience is also great. The decor is clean, warm and appealing. The service is friendly and timely.  Ordering take out is super easy, they even have an app that you can use to order. Needs: I can't see any at this time! I will continue to hit this place up for Thai food regularly."], ["Sandra C.", "Another home run. Finally tried the pad Thai with chicken. It's as good as my friend said it was. Great prix fixe. Green tea ice cream is creamier and not as sweet. Great service. Friendly staff."], ["Gina C.", "Delicious. Went here for dinner with a Groupon on a Thursday. Service was slow. Only 2 people serving. Other than that, everything was great. We ordered from the prefixed menu: choose a soup (Tom Yum or Tom Kha), an appetizer (vegetable spring roll, vegetable dumpling, crab rangoon, and one other thing I don't recall), an entree (the usual selection of noodles and rices), and ice cream (vanilla, green tea, or coconut) starting at $18 (it goes up when you get a meat other than the standard chicken, beef, or pork).  I had the duck, which was a little fatty, but edible."], ["Kelly K.", "We decided to venture out of our normal area because we had a Groupon.  I love Thai food because my boyfriend and I both have food \"issues\" (one vegetarian, one gluten free), and Thai food handles both of those nicely.We were sat in the front of the restaurant next to the window. Normally, I don't care where I sit. However, there are no curtains on the window and a woman was sitting in a parking space outside for over 30 minutes with her headlights on, shining in our faces. Very annoying. Also annoying were the three or so tiny flies buzzing around us as we had our meal.Everything on the menu is marked very clearly whether it is gluten free or not, and you can add your choice of tofu, veggies, chicken, shrimp, etc. to almost any dish. The waitress came over after about fifteen minutes and seemed very rushed. She did not ask about drinks, took our food order and started to leave when I asked her for a drink. The drinks (a beer and a wine) took about 10 minutes to receive. They were not as cold as we would have liked, but we drank them anyway.Appetizers came out quickly and were very good (Tom Yum soup and Vegetarian Spring Rolls), but entrees (Pad Thai with Chicken and Basil Fried Rice) took probably close to half an hour to come out. That is a very long time when annoyed by headlights and tiny flies. We saw the waitress (a different one, actually) only once during this period when she cleared our appetizer plates. However, the waiter refilling water was very friendly and attentive. There also seemed to be another very attentive waitress in the room, but we did not have her. The table next to us also complained about slow service and not receiving their drinks. Overall, The food is good, but will take out next time, and only if in the area."], ["ALISON Q.", "Best Thai in town! We had curry puffs, edamame for apps. Delicious ! Pad Thai with chicken and drunken noodle with chicken are our favorites. We have been here several times and can't say enough. Service is friendly and extremely efficient. Lots of meal choices, including lunch specials and happy hour specials. Always guaranteed a great meal !"], ["Jason S.", "I had the Duck with a Basil sauce, found the restaurant clean, service acceptable and the food was very good.  The price reflected that of a restaurant in the center of Glastonbury but was fair for the quality of food."], ["Sara W.", "Best Thai food in Hartford area. Highly recommend their drunken noodles and Siam beef."], ["Amy L.", "Went tonight to try it out after having been a big fan of Bangkok Spice.I had the mango fried rice with shrimp. LOVED it. It was just the tiniest bit sweet. I had expected some stronger mango flavor or maybe some small bits of mango but there weren't any. There were some sweet onions and plenty of good sized shrimp in there though. It was cooked perfectly - the rice kept a little stickiness, not a bit dried out.My husband started with the rice soup - the smell of the ginger was intoxicating. The broth was rich and flavorful. He had the Pad See Ew for his main dish and I sampled that too. Wonderful stuff.We will definitely be back...new owners, new menu, not sure what the story is but it was so good I'll ask next time"], ["Tine A.", "Nice place. A little empty on a Friday night, but the food and service were great. I recommend the tom kha soup!"], ["R. N.", "Pros:Creme brulee dessert was delicious.Cons:There was only 2 of us (me and my son) and they automatically tagged on a 18% tip onto our bill?!  We used a Groupon so I don't know if that's related, but I was too tired to debate with the staff about it.  The service was ridiculously slow and unorganized.  We had to wait forever to order, to get our food, etc., and the only way I was able to even get service eventually was by flagging down the bus boy/water person to help us since the waitress wasn't around.  Maybe because of the horrible service they usually get low tips and that's why I got tagged on with an automatic tip?!  I could see that other tables were having the same problem getting service too.Soft shell crab  was mediocre and the Emperor Chicken smelled kinda weird/gross but tasted fine (maybe they used fish oil?).The only reason why I gave this place 2 stars and not 1 is because I've been there one other time in the past and the service was slightly better then but the restaurant was practically empty that time.  After this experience I doubt I will bother going back."], ["Melinda L.", "This time we got a groupon for this place and were delighted yet again with the food. Everybody at the table enjoyed their meal. I got the Prix fix! It was a great deal! Came with soup, salad, app, entree and choice of ice cream, for $18.00.  Service was great too.  The atmosphere is relaxing and it's decorated in warm tones. There is always tons of parking as well."], ["Ryan M.", "Now this is a great spot for thai. Foods excellent and service is quick. Doesn't take up too much time for work lunch. Recommended for sure. For those who arnt tolerable spice is on the mild side."], ["Jennifer P.", "My husband and I go back and forth about who has better Thai food - Siam or Phuket across the bridge in Wethersfield. I certainly feel Siam is one of the better Thai restaurants I've been to in the Hartford area.  We usually get take-out but recently dined in for the first time courtesy of Groupon. The portions are huge and flavorful. They are more than willing to adjust the heat in any dish to your liking which is key and the hallmark of a good Thai restaurant as Americans have widely varying degrees of tolerance for spice so it's nice when they can accommodate your tastes and do it well.  The restaurant was fairly empty when we dined but we were pretty early for the regular dinner crowd so I'm not sure how the waitstaff does during prime dinner hours but the two ladies who served us were attentive and friendly. All in all, a pleasant experience."], ["Donald R.", "Very tasty food, awesome service, and good prices! Best Thai food I have ever had, a must stop!"], ["Lindsey F.", "In Glastonbury, I think this is the only thai place. It's a good one. Friends went and we each had a different curry. Smiles all around!"], ["Mary B.", "For authentic Thai food look no further. Excellent service. The food comes out fast and in large portions. I like the Duck Salad but you can never go wrong with the Pad Thai."]], "Sweet Basil": [], "Hot Basil Thai Cafe": [["Shane G.", "Hot Basil Thai was recommended by a close friend. I've been trying to get into Thai food lately, though I think I lean more towards Malaysian as my preference. It seems like Thai food is always just a bunch of ingredients mashed together and served on a plate with rice. It's so one note, always coconut, always cloyingly sweet, often reminiscent of Chinese food but not in a comfortably familiar way. The cooks here are not making anything out of the ordinary here. It's typical Thai. The rice they serve is not sticky rice, it's just plain old jasmine rice. The curries are all classical, some sour and sweet flavors mixed together. They were all too sweet for my tastes. The bubble tea was kind of gross and the pearls were dry. The coconut soup was watery and the chunks of chicken were kind of scary looking. The fried spicy pork dumplings were really awesome though. And even though the satay's peanut sauce was more vinegary than I'm used to, the chicken smelled deliciously smokey."], ["Sarah O.", "I went here for dinner on a Saturday night with two other people. We took advantage of the BYOB policy, for which we incurred a small $5 corkage fee.Service was attentive, and our food came out quickly. We ordered steamed dumplings, which were standard but good, and split an order of drunken noodles, pineapple and cashew fried rice, and hot basil stir fry. We enjoyed everything, but nothing stood out as really superlative.No mango sticky rice on the dessert menu, which was a major bummer!The prices were fair-- I believe we each spent around $22 including tip."], ["Todd R.", "Amazing service and great food.  We started with the samosa's they were flavorful and the mango salsa was a nice touch.  Me and shorty got the pad Thai sriacha which was great.  I got the massaman coconut curry extra spicy beware when you say spicy they bring the heat.  I love this place every dish here always has such amazing flavors."], ["BJ C.", "Food is average, but good enough in a pinch. If you're looking for REALLY good Thai food, you should try East West Grill in West Hartford. I've been going there for years and both the quality and service is better than Thai Basil"], ["Dan S.", "I'm shocked I haven't reviewed this place before. Hands down, my favorite Thai restaurant in the area.  What's so good about it? Dumplings that melt in your mouth. Satay that isn't like beef jerky.Pad Thai that has the right balance of sweetness with a good consistency.  But its the main dishes where they shine. They tend to chop up their meats into very small bites that makes the dishes a great consistency. Not afraid to use the spices either. Atmosphere is great (you would never know it from the location) and staff is warm and helpful.  Only downside is that it is expensive. But in my view, worth every penny."], ["Sanh A.", "After hearing friends rant and rave about Hot Basil, my boyfriend and I tried it out one Saturday evening. The place was empty when we entered. Soon a family of three joined us a few tables away.The decor was nice. Chairs were comfortable but overall I didn't get a \"wow\" factor.Our orders were taken promptly. We ordered Spicy Hot Basil Noodle with Chicken and Peanut Stir Fry with Beef. The food came out fast. It smelled great but after my first bite I was not impressed. The portions are skimpy. Presentation was great but it didn't justify the outrageous price tag. If a restaurant is going to charge $16 for a noodle dish I expect a decent portion. The stir fry was $17.I am familiar with Thai food. I've had Thai food in the States as well as in Thailand. What Hot Basil was serving me tasted like food prepared by a novice or an unskilled chef. Our noodles were soggy and too wet. It had a kick but was also too sweet. It reminded me of when I prepare a dish and used too many chilli peppers and in an attempt to savage the meal I throw in tons of sugar and spices.The peanut stir fry was in no way authentic. I have difficulty finding words to describe the dish. It tasted like a fusion between a Chinese stir fry using Thai spices. I would never order their peanut stir fry ever again. Like the noodles, portions were small and the chef added crispy noodles on top which ruined the dish for us, mainly because it was out of place.We didn't care to even try the dessert and I'm usually a fan of coconut ice cream. If you want real Thai food avoid Hot Basil. Dishes are not authentic and portions are small. Drive 2 mins down the road and you can get real Thai food. I would never return to Hot Basil even if they lowered their prices."], ["Lloyd B.", "Hot Basil has been my go-to Hartford destination for Thai Food for over 5 years (essentially since I moved to the Hartford area).  The staff is very familiar with all recipes (the owners actually went to Thailand to learn) and the food is quite authentic.  The Hot Basil Stirfry is hands down my favorite.  If you are feeling brave, try any of the dishes 'thai spicy' (warning:  this is no joke but if you can tolerate the heat makes for quite the experience).On my most recent visit (7/14) I was pleased to notice that they are once again serving lunch and now also offer a modest selection of wine and beer.  BYOB is still permitted with a small corking fee."], ["Jennifer H.", "Not a big fan.  We have tried several Thai places by now, and I am not convinced in general that I am a fan of this style of cooking, but I can reassure you that I wasn't all that excited about our visit to Hot Basil Thai Cafe.  The water came with limes, which to me, is indicative of hose water syndrome.  At least they cover it up, but I am not a fan of limes in my water, I much more prefer lemons...or the option at least.   The pork dumplings were delicious, but the chicken satay wasn't anything to write home about.  Being a lover of bubble tea, we tried it and alas, I give you the advice...don't waste your time.  I wasn't a fan at all.  It was milk based and tasted like a powdered drink mix with under-cooked bubbles.  Disappointing at best.The place wasn't busy, but somehow the waitress felt the need to seat us directly on top of the only other customers in the restaurant.  I never understand why they do that when it is a small place.  We had a friendly fly visiting our table and every part of our meal.  Highly disappointing.  Needless to say, we didn't actually take our leftovers home with us."], ["Jodi M.", "I have tried several thai places andBy far this was the best so far...The chicken coconut soup was to die for...  The chicken pad Thai was the best I have had....   I cant wait to go back so I can try more on the menu ..."], ["Russell W.", "Overall I don't know if I would go out of my way to go there, but if friends suggest it next time we're in the area I won't object. I love Thai food, and this place does a decent job of it. Setting/Atmosphere: It's a little odd. Based on the neighborhood and the slightly rundown appearance of the building's exterior you might not expect the inside to be as well maintained and chic as it is. Since I'm going to mention Suhkothai in Manchester as having better food, I'll mention there that Hot Basil is a little classier overall and has a nicer appearance on the inside in general. Food: The food here was good. Flavor-wise I like Sukhothai in Manchester a little better, but this place has one nice special perks too (See \"Drinks\"). The presentation of the rice on my plate looked kind of stupid in it's upside down funnel shaped glory. I also didn't like how they cut up all the veggies, etc. in such small pieces, which to me detracts from the perception of being fresh and a little fancy. Drinks: They don't have a liquor license, so you won't be getting anything alcoholic from the menu. They do, however, allow you to bring in outside beer, wine, etc. for a nominal \"corking\" fee. (Though I believe we avoided that by opening it ourselves). There's a package store (liquor store or whatever you want to call it) conveniently in the plaza next door. Service: The service was good. Attentive but not invasive. Price: Reasonable"], ["April B.", "I've been to many of the Thai restaurants in greater Hartford; I believe that this is the best.  Food is well prepared and delicious.  While some people feel the menu is limited, many dishes have a choice of the kind of meat as a base.  We have also found that most dishes can be prepared with changes; you can have them leave out ingredients you don't like or substitute vegetables that you prefer.  The staff is friendly, and the owner works to keep the standards high.  They recently freshened up the dining room, and the place is lovely."], ["Amy T.", "This place is really great. I thoroughly enjoyed the meat trio (beef, chicken, porK) peanut stir fry while my company enjoyed the drunken noodle. So many wonderful flavors were fused to make two fabulous meals. Substantial portion sizes. Good service. Beer/wine only. Reasonable alcohol prices ($4 beer, $7 wine). BYOB but note that there is a $10 corkage fee. Love this BYOB option in the neighborhood."], ["Mallory W.", "I Know I've reviewed a few Thai Places in the Boston area already, but I'm from Connecticut and when I'm home visiting there is nothing like dinner at Hot Basil! When I lived in CT I used to go there at least 3x per week with my cousins after work. These are the top 10 Reasons why I love the Hot Bas:#1 its BYOB  *AND* there's a liquor store right next store! (only $5 to uncork the wine)#2 Spicy Pork Pan Fried Dumplings#3 The Crab Spring Rolls#4 Best Beef Satay and Peanut Sauce I've Ever Had#5 Entree's are ALL good. I have never once had a bad meal at hot basil.#6 Polite Waitresses that always say thank you to you before you can thank them!#7 Reasonably Priced#8,9 & 10 BYOB BYOB BYOB."], ["Scott L.", "There were a lot of things I really liked about this place. I had good service, the atmosphere (inside) was nice, the food was very tasty and the presentation looked fantastic. I had the Massaman Curry with meat trio and it was very delicious, and the portions were very big. My girlfriend and I bought our own Palm beer (and opener!) for the night and it was great. The spring rolls were fantastic, too. I wish I had tried more appetizers!The negatives now. I didn't so much mind the fact that it was so far out of West Hartford, but the restaurant is in a pretty bad location. The service was a little over attentive at times, though... My date ordered the Spicy Hot Basil noodles and found the dish to be too oily, and the shrimp Disgusting.   Also, she mentioned that it's the most expensive thai she's ever eaten, and she eats thai all the time."], ["Keith B.", "Generic is the only word that comes to mind.  The Tom ka soup was dull. The pad gra prow (basil stir fry) was spicy, but tasteless.  There was none of the signature sweet and sour flavors with the spicy found in good Thai food. In fact, extra spicy simply mean dumping a ton of red pepper flakes on top of the completed dish.Dessert was a total throw away. Banana is a sweet coconut milk? The just chopped a banana and poured the milk over it. It was a cold, sweet banana soup. Horrible.There is much better Thai to be had in West Hartford."], ["Amy T.", "I would say my experience with Hot Basil was good.  During my visit, I decided to try the Sweet Soy Noodles with tofu.  The pieces of tofu were very small compared to other restaurants, but the dish was definitely sweet and tasted pretty good.  I shied away from the drunken noodles because it contained mostly vegetables that I don't like.  My boyfriend got Pineapple Fried Rice, which was a heaping portion, bigger than I have ever seen before at a restaurant.  Overall it was a good experience.  The atmosphere wasn't bad, although our table was a little cold (I didn't end up taking off my jacket).  Overall, my visit was A-OK!"], ["Vanessa L.", "Ambiance is very lounge-y.  Cute place for dates, I'd say!Food was good!  We ordered some crab spring rolls, a spicy smth salad, and chicken with thai basil.  Our crab spring rolls came out still cold/frozen in the middle.  Hmm.  The server asked us if we'd like another set made, and we received a second set that was properly cooked.  But the spring rolls were not comp'd.  I'm not the type to set out to get free food by any means, but something like that... I feel they should have comp'd it as it is unacceptable to give your guests raw/cold food.The salad the mister ordered was VERY good!  My chicken with thai basil was also very very delicious.  It reminded me of the good stuff that I used to eat all the time in Los Angeles.  It had ground chicken and the RIGHT amount of spice (which was super spicy! love it!) - and there were little bits of eggplant and other vegetables in there, too.   Absolutely my favorite chicken with thai basil in CT so far... buuuut....The prices were outrageous for Thai food, though.  I believe our check was well over $50... I'm used to eating Thai food for 2 for less than $30.Service was attentive and the waitresses were all very nice.    I'd love to go back for their bargain lunch specials, but unfortunately, they are not open for lunch on the weekends! :("], ["Jamie R.", "You wouldn't be able to tell from driving by on the outside, but inside this is a cute little thai restaurant with great food. The place was well decorated and gave off a clean and sophisticated feel. The food tasted delicious and the service was quick. I will definitely be going back to try more dishes."], ["Irene B.", "My husband and I tried Hot Basil for the first time tonight after hearing about it through work. I definitely will be back to try some other dishes on the menu.I was a little skeptical and a little disappointed when they came out with our spicy steamed pork dumplings appetizer. I was expecting fresh dumplings but it ended up being the same frozen XO sauce dumplings that I buy from A Dong supermarket (right down the street).I ordered a Thai Ice Tea which was a little sweet and my husband ordered a coconut juice. I think they might have also watered the coconut juice down. Now you're probably wondering why I rated them 4 stars.... This place makes an AMAZING green curry. I got it with chicken and it was delicious. My husband got the summer noodle which tasted very similar to a Vietnamese dish we like and was pretty good. Next time we will try either a pad thai or hot basil noodle and will definitely get a curry again. The decor was nicer than expected for the location they are in. Now that we know what to order (and not to order), it is definitely a place we will go back to."], ["Erika S.", "Hot Basil is definitely in my top three Thai places. The food is so fresh and flavorful here. I'm a sucker for anything hot and extra spicy so I usually go with either the drunken noodles, the hot basil chicken noodles or the hot basil stir fry. The spring rolls are made fresh and not frozen and the massaman curry is pretty amazing too. Keep in mind when going that this place is tiny so reservations are a must and it is BYOB, also. Final note, it's consistently named one of Hartford's most romantic restaurants; it is a dark restaurant with candles and shades of reds, so consider it when looking for an intimate setting for some conversation with wine and good food."]], "Simply Thai": [["Amy C.", "So lucky to have this place so close to my house!I almost always get takeout from here because it is fast, delicious and a great price. Not to mention the portion sizes are pretty generous. The food has a nice level of \"heat\" which I always enjoy in Thai food.Recently my sister and I dined in and the food was on par with what I was used to but overall not a huge fan of the ambience in the dining room. I'll keep to ordering takeout which has always been consistently awesome!"], ["Meghana A.", "Good eats for travelers on 84.It's your typical Thai restaurant, nothing fancy....until I discovered they had spice levels 1 being mild to 5 being the hottest. Since we are used to Indian spicy food , obviously we ordered level 5 our server said we could handle it... So did I (lil did I know what was about to happen next)The apps( satay and puffs) were good.We ordered Pad Thai and chicken drunken noodles for our entree... N Then came the fireworks....Our food was like a ticking time bomb waiting to explode ...It's been 2 hrs now... My stomach hurts....I think it still worth it coz as long as I was eating it I enjoyed the food.Caution: proceed to level 3 at your own risk.Ambiance/service/quality : the usual OK"], ["Courtney R.", "Went here for lunch today after a few people in the office suggested it. I ordered ahead for take out and was happy there was no conversion of my order over the phone. When I got to the restaurant the staff was quick to help me and had my order ready for pick up on time. I got the veggie ginger curry, similar to other thai places the proportion was a healthy size! This place provided the perfect ratio of rice, usually there is too much or too little. Since two of us ordered I was able to sample their soup and salad that came with the lunch- you have to choose one over the other. I would recommend the soup as it was really good and the salad had a peanut dressing that I wasn't a fan of. I will definitely be back."], ["Quincy V.", "A local Thai place that's great for lunch or dinner.For starters, Simply Thai is separated from the strip centers of the area, in a building that used to be a post office many years ago. The lighting is dim and it seems like a very random place, but don't be fooled, they serve excellent Thai cuisine with a fabulous staff. You'll be warmly invited in with prompt service and soothing, soft music in the background. The lunch specials are a great value. You choose an entree and it comes with soup or a salad. There are many options ranging from curry to pad Thai, noodles and much more. There are many vegetarian options, with or without tofu, so that's a big plus. I highly recommend the Pangang Curry, especially if you enjoy something spicy. Their specials change from time to time, but they're worth a try for a slightly different spin on what you may be used to. The garlic sautéed edamame was excellent. This seemingly simple appetizer was bursting with flavor and was easily enough for three people. The veggie spring rolls were very good too, crispy on the outside with fresh vegetables on the inside. Service here is very polite and attentive as well. They're willing to accommodate. They must have a liquor license now because they have a huge wine selection, in addition to beer and other drinks.Don't overlook Simply Thai, as they hold true to their name, but hit a home run when it comes to food, service and atmosphere."], ["Kevin L.", "Delicious Thai food.  I came here hungry after my work out and their lunch menu filled me up!    The service was quick and they were friendly.  I have tried their pad thai and kee mao and would recommend both.  Some Thai restaurants overload their dishes with sugar but Simply Thai does it just right.  Their salad with peanut dressing is pretty good.  I am a fan of peanut sauce so it works."], ["N S.", "Pretty decent Thai food. I'm still going to go with Jao Praya  and Sukothai as my top choices in the area. Forget about the Blue Elephant in West Hartford...not so good especially in a more classy area. Service is very good. Nice atomosphere..."], ["Robo T.", "Simply Thai is awesome.  I had a jonze for kee mao (drunken noodles) and was rolling through the area and decided to stop.  Its right off I-84 W like BAM!!! in your face at the end of the exit ramp.The chicken satay app was tasty and tender.  The main event was the pad kee mao.  It was mouth-wateringly delicious. The spice level was perfect, there was a bunch of royal basil in it plus there was an interesting twist........... they put pieces of sliced fresh tomato in the stir fry!!  There was only a little tomato in it but it was enough.  Ive never seen that before and I whole heartedly (stomachly?) support it.  Service was friendly and efficient.  The restaurant is fairly good sized and seems to also have a private room in the back too.  There was a constant stream of people picking up take away orders while we were there.  It seems popular.  Highly recommended!"], ["Krystle B.", "I've always passed this place in favor of sichuan pepper right around the corner---but one night I was in the mood for Thai, and decided to give this place a try. First time I came here I ordered take-out. The waitstaff politely asks you to step into a hallway where the food handoff and money exchange occurs (as to not bother the eat in diners, I'm sure). The food (pad Thai, pineapple fried rice, pad see ew) was a little on the pricey side, but not ridiculous.The second visit I opted to dine in; dining room is quite nice, and the wait staff is attentive. Now that all the logistics are taken care of, THE FOOD. 1. Chicken pad Thai (5 star spicy): delicious. Ordered both times I came and was not disappointed. Spice wasn't as strong as I would have liked and asked for the spice rack to increase the spiceyyyyy! Hurts so good. 2. Pad see ew beef: a little underwhelming and did not order the second trip. Made with regular broccoli and on the sweeter side. But still pretty solid. 3. Pineapple fried rice: delish! Comes fully loaded; chicken and shrimp --- a meal all its own! 4. Green chicken curry: a little underwhelming, but not bad. The curry sauce was missing a punch I was looking for. 5. Fresh spring rolls: again, a little underwhelming; the peanut sauce that accompanies it is veryyyy strong. Had to mix it up with some spices so it didn't taste too peanutty. Despite my feelings of 'underwhelmed-ness', simply Thai had caught my attention and I'm still intrigued to try more things on the menu! Definitely a must try for the Thai lovers in your life."], ["Jocelyn S.", "Awesome awesome awesome! Fresh ! Friendly! Great for lunch or dinner Would totally recommend this restaurant Tom Kah coconut soup has a bit of a bite and rhe tiger tears salad does not disappoint. Excellent!"], ["Keith R.", "Better than fast food or a tired diner if you're traveling on the interstate. Great service and the Pad Thai was quite good."], ["Laura B.", "They have delicious food. Their pad Thai is great, as well as their pho. But my most favorite thing is their sticky rice dessert: coconut ice cream with sticky honey rice and topped with peanuts. Perfection."], ["Joan S.", "We came off the highway and found this place by accident. We're glad we did. The food was fresh and very tasty. The ginger chicken actually tasted of ginger (I usually have to take the restaurant's word for it). We'll remember this place when we come through again."], ["Peter L.", "I still like their green curry a lot personally, but other dishes they have been serving there are too inconsistent. Their Thai tea had been too sweet to drink and their service quality had declined by much.I will certainly consider other thai restaurants in the area before revisiting this one soon :/"], ["Thien N.", "After being away for a few months on contract work in New Haven, I come back to find this gem.I've dined in a handful of times, but with all the chaos that is of 2014 - most of my visits here have been for take out. A sister company of Sawadhee's in South Windsor, I'm really excited to finally have a taste of Thailand in town. Head chef is from Sawadhee's so you'd be hard-pressed to differentiate quality and originality between the two restaurants. Well versed with authentic Vietnamese, Japanese and Chinese cuisine, I'm still training my palate when it comes to savory Thai food. With that said, I personally recommend several dishes to new-comers/veteran Thai goers. My personal favorites here are their crispy basil duck, honey duck, red/green/yellow curries, tom yum soup, and of course pad thai. If you're around for their lunch hour and specials, it's 11:30am - 3:30pm. Impressive selection for choices, you're easily saving yourself $3-5 if you can make that 3 hour window, otherwise stop in for dinner 4:30 - 9:30pm weekly. Also, as of this posting they are awaiting their liquor license so take advantage of their BYOB policy!Conveniently off the interstate exit, ample parking, informative and very accommodating staff - I'm thrilled to for local the local Thai."], ["Phyllis W.", "This was a perfect place for a family birthday dinner. Everyone found a dish that made them happy. I love their fresh spring rolls!  The wrapping is soft and chewy, filled with crisp veggies that taste amazing with the side of peanut and hot chili sauces. The wait staff was very glad to help me choose which curry to have with shrimp. I learned that different proteins are best with different curries. My shrimp with yellow curry was delicious, with a tasty spiciness that didn't overpower the shrimp or vegetables. It's exciting that they offer brown rice!Hot Thai tea was a great accompaniment on a night that I wasn't interested in their bar items. Simply Thai serves exceptional food with friendly and efficient service."], ["Daniel M.", "Our family stopped here while traveling along I-84. It was easy on and off.  We ordered green curry, pineapple fried rice, pad Thai, clear noodle soup and Khan Tak soup (not sure about spelling).  Everything was fresh and delicious.  The pineapple fried rice wasn't too sweet which I liked."], ["Rose G.", "The food is excellent. I am GF and they are able to make so many items on their menu safe for me, and they don't just remove the soy sauce. Delicious. We hosted a gathering there recently, and the service was exceptional."], ["Philip J.", "Great food, and very Thai, spicy food is very delicious, and the waitresses are very attentive.  I had the Pad Thai, and thought it was delicious.  I will definitely recommend this to my friends and neighbors.  Enjoy !Easy parking, and very close to shopping, and the I-84 highway.  Great job everyone, I will be back very soon."], ["Sachin G.", "I have been to Simply Thai several times.. I love thai food and I found this place to be satisfying my taste buds.. They have super awesome fresh spring rolls with unique chutney I did not find in other thai restaurants I tried, fresh spring rolls are way much tasty and healthy (no oil) so I always order them no matter what..I have also tried green curry And red curry both.. Spicy n tasty.. Just love it.. Whenever I feel hungry and my tastebuds crave for spice, I choose to have thai food as its healthy n rich with variety of vegetables and spices..!I would recommend this place to anyone.. They have something or other that would satisfy your taste buds...."], ["Linda C.", "I went here on a Sunday afternoon with my best friends. We were the only ones in the restaurant and it kinda creeped me out.The place was super super clean and the waiter was really police and nice. I ordered the chicken pad Thai and I asked them to make it \"wet\". Unfortunately, my noodles came out a bit dry. Maybe they forgot?Clean place and I appreciate their linen tablecloths."]]}